{
    "filename": "15-Minutes_script.txt",
    "imdb_id": "tt0179626",
    "imdb_url": "https://www.imdb.com/title/tt0179626",
    "characters": [
        "Emil Slovak",
        "Rose Hearn",
        "Fire Marshal Jordy Warsaw",
        "Detective Leon Jackson",
        "Detective Eddie Flemming",
        "Oleg Razgul",
        "Nicolette Karas",
        "Himself",
        "Mugger in Central Park",
        "Cassandra",
        "Bobby Korfin",
        "Robert Hawkins",
        "Deputy Chief Fire Marshal Declan Duffy",
        "Detective Tommy Cullen",
        "Daphne Handlova"
    ],
    "dialogues": {
        "Emil": "Just do what I do.  Say the same thing I say.  Don't open your mouth.   Don't fool around.   Did you hear what I said?   Yes sir.  He hands the passport to the officer who runs it through an image swipe.  Emil glances furtively back to Oleg.   Two weeks holiday.   I have five-hundred dollars.   Yes.   Is there a problem?   We are both from Prague.   Two weeks.   He doesn't speak English.   He made joke, bad joke.  First time on airplane...  The SUPERVISOR comes over to see what the problem is:   I am butcher.   You stuff sausage in it.   Dog food.  Emil looks at Oleg.  Blaming his stupid responses at Passport Control for their detainment.   No.  Are you proposing?    Don't speak Russian!    Because I don't like your ugly language. I heard enough of it in school!  Now speak Czech or English.  And don't fool around anymore.  You almost got us thrown out!  Emil pulls out an envelope with Milos' address on it.  This is who they came to see.  Emil hails a CAB.  Oleg is staring inside a camera store - at himself on a monitor.  A videocamera's pointed out in the street.   We have no money.  Come on.  Oleg stares at the videocamera - dying to have one like this. Emil slides into the cab.   Here.  Emil looks out the window - no sign of Oleg.  Then, Oleg hurries out the camera store, gripping something inside his coat.  He flings both suitcases in the trunk, SLAMS it shut and jumps in the back seat.  He opens his jacket - pulling out the VIDEOCAMERA he just stole.   Go!  Oleg smiles sheepishly at Emil.    Turn that off!  Get the bags.   For five years I paid for your stupidness - you'll carry my bag for the rest of my life if I say so.  Unless you refuse, Oleg.  Oleg looks at Emil.  Even though Oleg is stronger than Emil, he fears him.  He picks up both bags.  Emil searches the occupant list over the buzzers to the apartment building.   There.  5RW.  Emil pushes ten of the buzzers except 5RW.  A BUZZER clicks and Emil pushes it open.   Smell like chemicals...for smoking drugs.  Emil pockets the pipe and climbs to the top floor, moving down the dirty hallway to a corner door.   Surprise!  Surprise!  Milos shoots a look across the tiny kitchen to TAMINA, his comely wife.   Your sister said she didn't know where you were so you shouldn't write to her with return address if you're hiding.   You know me...I never hurt anybody. Where's the money?   Milos.  Get my money!  Oleg videotapes the scene.   Ha. Ha.   A job?   As a plumber?!   A job??  As a plumber???  You think I come to America to work!    You spent all the money while I was in prison?  Now you tell me to get a job fixing toilets?!?  Emil pulls the knife away from Tamina - then angrily PLUNGES it toward Milos' chest!  Oleg videotapes it.  Then lowers the camera - shocked that Emil killed Milos.  Blood sprays Tamina's face.  She tries to run but Oleg grabs her, not noticing her brushed gold bracelet falls to the floor.  He covers her mouth as he points the videocamera at Emil who STABS Tamina - absolutely enraged!   She saw!  Emil hurries toward the bathroom.  She just got out of the shower.  Her underwear and purse are draped over a chair. Emil grabs the purse.  Finds a CZECHOSLOVAKIAN PASSPORT.  He opens the cover, stares at her photo and name.   Daphne Hanlova.  There's one stamp in the passport - from the U.S. when she arrived - June 16, 1998.  Underneath is written - 6 MONTH STAY.  Emil flips through the rest of the passport - all blank pages.   Six month visa.  Still here two years later.  They'll deport her if she goes to Police.  Emil pockets Daphne's passport and wallet, scoops up her shoes and jacket - enters the kitchen and dumps them on the floor.  He tears through the kitchen cabinets, throwing cans and bottles aside.   I'm going to make a bohemian barbecue.  Emil draws the kitchen curtains plunging the room into darkness.    Self-esteem?  Self-esteem??  He flips through his dictionary to find the meaning of self esteem.    Turn that fucking thing off!   Speak English!   How you erase this?   Stupid, Milos.  I didn't want to kill him.  What's this?  Emil found the last card in the wallet.  It's pink with a picture of a busty globe.  Printed in the middle is - WORLDLY ESCORTS - and a number.   Worldly escorts?  Emil picks up his dictionary and begins to flip the pages - finding the meaning of worldly.  He gets up and dials the number.  A soft, SEXY VOICE answers.  Soft music in the background.   Hello?   I'm homesick.  You have Eastern European girl?  A Czech girl?   I take her.  Send her!   Louder.  VIDEOCAMERA SLOWLY ZOOMS OUT and PANS over to Emil, sitting on the hotel bed watching the TV.  He looks at us.   Louder.  Oleg's hand reaches in front of the lens - turning up the volume.  The scene cuts back to Stephen Geller being interviewed by Robert Hawkins and his camera crew.  He's sitting on the front lawn of a mental institution in a paint stained shirt.  A showing of his artwork is displayed in the background.  Patients peruse the paintings of weird dysfunctional faces that avoid eye contact.  One of the paintings depicts Eddie Flemming and Leon Jackson.   I love America.  No one is responsible for what they do.  There's a KNOCK on the door.  Our VIDEOCAMERA POV swings over to it.  Then WHIPS back to Emil.  Emil looks at us.   Get in the bathroom!   Oleg, get in bathroom, stay there and shut up!  Emil turns off the TV.  Our POV backs into the bathroom, closing the door but leaving it open a crack.  Emil looks down at his shoe.  The POV PANS down to the kitchen knife sticking out of Emil's BOOT.  Emil's hands pull his pants cuff over it.  POV PANS up to Emil as he moves to the door and opens it.  It's not Daphne and she's not world class.   Where's Czech girl?   I ordered a Czech girl.  Daphne, you know her?  Oleg ZOOMS in for a CLOSE UP of Honey.  During the rest of the scene Oleg films her.  Honey begins to undress.   Where is escort service?   I like to talk to the person who runs the service.  Can you give me address?    Listen to me.  I don't want sex.  Just give me the address and then you go.   Give me the address!!    Who is he?   Do you know how much killer gets for movie rights?   Million?!  The killer gets one million dollars for a television interview?   Yes.  Both.    Get a taxi.  Oleg tucks the magazines in his coat, picks up the suitcases and hails a taxi.  As Emil collects his change he sees an old BLIND WOMAN waiting at the crosswalk.  The light's blinking  Let me help.  Emil gently takes her arm and crosses her to the other side.   I...I have a temper.  She looks at him, not understanding.  Oleg films the scene.   When I lose it, I lose control.  I didn't intend to kill Milos but he stole from me.  Cheated me!  When I went to prison, they beat me.  I still didn't tell he was my partner.  I loved Milos like a brother...  The tone in Emil's voice - there's an uncharacteristic softness to it.  He wants to reconcile his behavior to her.    I'm not a killer.  The back door opens.  He shoves the knife in his pocket as Ludwig peers around the alleyway.  What he sees is Emil leaning close to Daphne, kissing her.   Smart girl.  I'm glad you're not a whore.  But washing hair?  This is no job for a woman as beautiful as you. They should be washing your hair.  Emil reaches into his pocket and pulls out SOMETHING, sticks it in the palm of her hand, closing her fingers around it.   I don't want to kill you.  But if you talk, I will.  I thought you'd want these.  He taps her hand...he turns and goes out the rear exit.  Oleg follows.  Jordy arrives.    Put the fuckin' camera down!  Let's go!  Emil starts to flee.   Shut up.   This is nothing.  Emil lifts his shirt, exposing his back.   Don't want to film this?  We don't see what Oleg sees - not yet - but from his expression, it's horrible.   The video of Milos and Tamina - I told you to erase it.   And the whore's murder?  You didn't erase that either, did you?  Don't lie, I won't be angry.   Put the camera down, Oleg.  Oleg closes the LCD screen and puts the camera down.  Emil removes a small address book -- from Leon's wallet - he looks up Eddie Flemming's name.   What does it look like?  It's an address book!  Oleg jumps up with the camera to tape the book.   Sit down!   So...who's Nicky?   Your opinion.  You see, they going to make a movie about me, too, Eddie.  And write books.   I kill someone famous.   Good - be tough to the end.  Actor who plays you will want to die like hero.  Eddie looks at the videocamera.  Emil answers Eddie's look.   So tabloids don't have to do re enactments.  They going to have real movie this time.   Turn it off.  Oleg obeys.  Emil turns to Eddie.   No.  We are insane.  Who else but crazy men would film their murders?  So we kill someone famous and if we are caught, we are sent to mental hospital. But what good is money there?  Because once in hospital I say I not crazy. Just pretended to be acquitted.  We see psychiatrists.  They must certify we are sane and because of your - what is law called?  Oh - I got it.  Because of your Double Jeopardy law, we can't be tried for same crime twice.  We come out free, rich and famous!   Smarter than Americans.  You're fed cry baby talk shows all day long.  Not only will Americans believe me, they'll cry for me.  So...Detective Eddie Flemming, would you like to say goodbye to your Nicolette? Maybe you can propose to her now?  Eddie says nothing.  Just stares at Emil.  Emil puffs on Eddie's cigar.   Okay.  He has nothing to say.  Start the camera!   Bad last moment - I cut that out.  Emil raises the pistol again - pointing the gun at Eddie's left temple.  Emil cocks the hammer, but Eddie avoids the gun, ducking his head to the side of Emil's arm.  Standing and following his head up Emil's arm and pushing him over into the desk.  Eddie then knocks Emil with the chair and Emil falls off the desk and onto the floor.  Oleg still grips the videocamera.  Eddie continues around with the chair and drives Oleg back across the room - pinning him to the wall.  Eddie comes back from Oleg to the gun at the same time as Emil is limping for it.  Eddie knocks Emil out of the way with the chair and then stabs him with the legs of the chair repeatedly.  Eddie comes up and around again at Oleg who is coming at him from the wall.  Eddie knocks Oleg over the coffee table and onto the sofa.  Falling on top of him, rolling over and leaving Oleg on the sofa.  Eddie manages to get up from the sofa and position the chair in such a way that he can fall over backward and grab the gun.  Emil limps toward the gun at the same time and it is not clear in the darkness who has the gun.  Oleg gets up from the sofa and goes over to get the videocamera.  Eddie has managed to get the gun and comes up as Oleg is moving in with the camera and starts shooting toward Oleg - managing to shoot one of the blinds off the window and one of the lampshades off the lamp.  Oleg crouches down with the camera and Eddie starts to turn toward Emil who comes at him with the knife and stabs him in the stomach.  Emil steps back, revealing the knife is BURIED IN EDDIE'S  Die.  Die.  Emil looks around.  Grabs a black pillow and finishes Eddie off, suffocating him.    Come to 45 Broadway.  Don't bring the Police.  Come alone or you'll be in my next film.   No.  I'm the best that's ever threatened you.   We'll talk about that.  Four o'clock gives you time to go to bank.  Three hundred thousand dollars.    If you don't want my film - I'll call another show.  And they will show it.   Come alone.  Bring cash.  And we'll talk about surrendering.  CLICK.  The line goes dead.  Hawkins disconnects.  Hands the phone back to Maggie.  She's looking at him.  Excited. Hawkins looks at Nicolette.  His mind whirls.   America!  Who says you can't be success in America?  I arrived with nothing, knowing nobody - now look - I am a success story!  The videocamera is lowered.  Oleg turns it off.  Asks suspiciously.   Oleg, don't be paranoid.  You got a hundred-fifty thousand dollars, didn't you?  I gave you half of what they gave me.  Look - here we are!  Emil gestures toward the big television set.  We are in Planet Hollywood - where diners and those by the bar can watch a huge screen hanging from the ceiling.  Robert Hawkins is introducing his show.   The one who got caught in the bathroom.  George Michael.  Emil laughs.  Oleg doesn't.   Shut up.  Look!  Emil points towards the TV.  \"Top Story\" is continuing.  The scene cuts to Emil's video footage.  Eddie is handcuffed to the chair.  The light illuminating his face.   Bad last moment - I cut it out.  Emil looks at Oleg - furious.   I told you to cut that out before we handed in the tape!   Die.  Die.   Why did you leave that stuff in about you being the director?   Your idea?  I thought it was my idea.  Oleg tenses.  Emil laughs.   Aren't you just the cameraman?  Oleg doesn't laugh.   Credit?   Yes.  But there's only one problem - you want credit but the problem is - I don't share credit.  Oleg is pissed.   You got that?   You think you are a director?  You are a fucking little, small Russian piece of shit.  And I hate you.  I fucking hate you.  Emil slaps Oleg across the face.  Oleg stands up.  Emil suddenly pulls out Eddie's gun but before he can pull the trigger, Oleg STABS Emil in the arm!  Emil squeezes off a shot through the crowded restaurant.  Patrons SCREAM - Oleg runs through the restaurant, escaping.  It's chaos. Hawkins arrives with a crew and with BRUCE CUTLER, a confident, tough criminal attorney.  Emil pulls the steak knife out of his arm, picks up a napkin - pressing it to his wound.   Oh, hello.  Cutler accesses the situation.   Are you my attorney?  I'm Emil.  I'm insane.   Here.  I have your money.  Emil picks up a briefcase and hands it to Cutler.  Cutler opens it - inside is the cash Emil got from Robert Hawkins. Emil looks at the table, pushing the plates and silverware aside.  Emil looks under the table, throwing the chair aside, freaking.  He's lost the most important thing in his life.   Oh no!  No!  Shit!   He has the camera!  He took the movie!  Jordy comes in, gun raised.   I give up!  Jordy is disappointed!  He didn't want to take Emil alive. Hawkins signals to his camera man, who swings his camera at Jordy as he approaches Emil, his gun aimed at Emil's head.   No.  Keep filming...  Jordy realizes how media savvy Emil is and understands in that moment why he's surrendering.  Jordy yanks Emil up - dragging him across the restaurant floor - Emil still favoring his ankle.   Where are we going?   Yes.  Yes, come with me!   My father was.  He gave me many lessons about fire.  Now it's my friend.   You can't kill me.  You're not a cop. Just fireman with a gun.  I bet you never shot anybody in your life.   C'mon.  Pull the trigger.  Do it.  Oh, look, you're sweating.  You don't have the balls.   The Sheraton!  On Broadway!  Room 210. Go get Oleg.  He'll kill you.  Leon runs up.  Tommy's relieved to see Jordy didn't kill Emil.   You bring the cigarettes?   I was all of these.   What about Oleg?   No, he is here.  Shit...   What about my movie rights?  Book rights?   What's your cut?  How much?    No.  No way.   Thirty-percent.  No more.  Or I call another lawyer.  This is the biggest case of your life.  Don't try to negotiate.  Thirty percent.  Say yes or no.   What else do you need?    Give me another one, please.  Cutler stuffs another cigarette in Emil's mouth.  Lights it.   My father always degraded me.  Killed my self-esteem.  And my mother was blind.   Yeah, she went blind giving birth to me. She went to fucking black market doctor to induce me.   Yeah, yeah...bad doctor gave her bad drugs which made her go blind.  And my father blamed me for her blindness...   Yeah, he hated me from day when I was born.  Put it out.  Can you put the cigarette out?  Cutler takes the cigarette from Emil's lips and extinguishes it.   That's what he did to me.  He put cigarettes out on me.   Out on my back when I was a small boy.   I'm abused.  Don't you think?   Be careful.  I can kill you.  I'm insane.  Jordy shoves Emil into Cutler.  A scuffle breaks out as the cops separate the two - pulling Jordy back as we cut to:   ...so we kill someone famous and if we are caught, we are sent to mental hospital...   Traitor!!   I'll kill her!  Back off!  Everyone back away from me!  We hear Jordy's voice above Emil.   Tell him to put his gun down!   If he doesn't lower his gun I'll fucking kill her.  Jordy doesn't lower his gun.  Emil tries to back away.  The reporters - who have ducked and covered - are still keeping their lenses pointed at the scene.  This is great film! Jordy follows after Emil - his gun raised.   Shut up!  Meanwhile, the captain is still yelling:   Shut up!  Everyone is screaming at once.  It's mass chaos.  The captain is trying to keep everyone calm.  Cops following along with their weapons lowered.  All except Jordy - his gun still pointed at Emil. Hawkins can't believe what footage he's getting.  He's pushing his cameraman to the front of the pack.  Trying to get the best coverage.   I'll surrender!! I'll surrender if he lowers his gun.  He's pointing at Jordy but he's continuing to back away towards the police boat.",
        "Slovak": "",
        "Rose": "So you slept with your son's wife! What's that all about?     Who's there?   I have nothin' to say.  If you wanna contact my attorney...   You!  I've seen you on TV!  Eddie glances self-consciously at Jordy.   C'mon in.  C'mon in!    They enter.   Just a minute.  Shit.  And I don't have a camera.  Hold on a second.  Rose moves back to the phone - finishes up her conversation in Afrikaner.  We hold on Eddie and Jordy at the door.  Eddie looks around - taking in the place.  FOUR GIRLS are on phones.  Two girls take orders for customers.  The other two work the phone sex lines.  Rose hangs up the phone - turns to Eddie and Jordy:   What's wrong?   Oh my G-d.  Honey!  Honey's dead?   Yeah.  He wanted a girl from Czechoslovakia, but I sent him Honey 'cause once they get there, you know, it doesn't really matter - Honey was killed...?  Poor girl...   No.    Boy, she's so popular all the sudden.   Daphne.  Another guy came in asking me about her, too.  Jordy pulls out the sketch, unfolds it.   Yeah.  Sort of.  I tried to recruit her, gave her my card.  She said she'd think about it but I never heard from her.   He said he was her cousin.  I told him where she works.  They were just here.   Tall, short-haired, scary eyes.  Second guy with him was...shorter, with a wrestler's build.  And he wouldn't turn his videocamera off me.   She washes hair up at Ludwig's - a salon on 63rd and Madison.",
        "Hearn": "",
        "Oleg": "Okay.   Okay.  Oleg holds up his disposable camera - at arms length - to take a picture of himself.   I want to document my trip to America.   Yes...he's my friend.   I speak English.   New York.   A cheap hotel.   I'm here for movies.   Yes.  No.  Both.  When I was a boy, I see movie at school called \"It's a Wonderful Life\" directed by Frank Capra. Ever since I want to come to America. Land of the free.  Home of the brave.  A land where anyone can be anything. As long as they are white.    Look.  Times Square.  Just like in the movies!    Why?  Why do I always have to speak to you in Czech?   Look.  New videocameras.  Color viewfinder.  Image stabilization. Solarization.  Night vision.   Why should I carry your bag?  I am not a dog.   What?   Hello, Tamina.  Oleg is looking Tamina over.  Milos - though scared - barks at Oleg.   What are you looking for?  Emil finds nail polish remover - looks at the bodies.    I'm not filming.  I'm watching Milos die.  It's just like a move but realer.  Emil grabs the videocamera.  Don't break it!  Don't break it!    You said speak Czech!   I'll do it.  Don't hurt my camera!  Emil tosses the camera back to Oleg who drops his vodka bottle in order to catch the camera.  Oleg, holding the camera like it's gold, goes to the dresser and puts it away. Emil starts to go through Daphne's wallet.   Whore?   Whatever we do - we fuck her, right?   This is second day in America.  First day was very exciting.  Full of thrills and chills.  Over there, is co-star of my new movie, Emil!  He turns the camera around - FILMING EMIL.   And these.  Oleg picks up FILM COMMENT, MOVIELINE and PREMIERE magazine. Emil pays for everything.   Daphne Handlova?   Emil, look!  Oleg swivels with the videocamera.  Korfin is running toward them - pushing through the crowd.  Emil FIRES!  Korfin is blown backwards.   Perfect!  Cut.  Print!  Eddie arrives.  Bends down to Leon, whose face is red with blood.  Jordy runs to Korfin, who's laying in the street, shot in the side.  Jordy cradles his partner.   Gotta light the scene better.  Now it's more moody... like a scene from THE  Does it hurt?  Emil lifts his foot out of the sink.   Oh, shit.  I hate looking at that!   What is it?   I did.   Why not?   What is that?   Let me get a shot of it.   This way.  Hold it this way.  Good.  Oleg gets a shot and quickly sits back down.   Why won't you be angry at me for keeping my movie?  Emil takes a gulp of beer - drops cash on the table and limps away.  Oleg follows.    Good idea!   Cut!  Emil looks at Oleg.   This is my project.  I say 'action.'  I am the director!  You are the talent. You wait for me to say 'action!'  Emil looks at Eddie as if to say, \"See what I have to put up with.\"  Oleg gestures from behind the videocamera.   And...action!  Oleg FILMS as Emil raises Eddie's service revolver.  Eddie suddenly KICKS at Emil's hand, but Emil pulls it away, backing out of Eddie's reach.    is VIDEOTAPING them from the opposite rooftop.  Tenants from Daphne's building are fleeing down the fire escape.  Emil stands in back of Oleg - who is very excited.  He turns the camera on himself.   This is great film!  You can see fire right now - Daphne is in fire - Fire Marshal is here.  Everything is so messy.  Everything is so crazy right here!  Look at this fire!  We made it! 90% of people who die in fire die from eating smoke.  So most likely they all die from eating smoke.  The CAMERA PANS to Emil.   And this is the man who started the fire.  Say something to your fans, Emil!  Emil waits a beat and then blows a kiss to the lens.    Across the roof is videotaping the bathroom as it EXPLODES!   You are success story?  I am success story!  Why do you say I and not we?   In movie they make of us, who do you think would act me?   I'm serious.   This is my project.  I say 'action.'  I am the director!  You are the talent. You wait for me to say 'action.'  And 'action!'   Be quiet.  Watch.  Oleg watches the big-screen TV as Emil raises the pistol to Eddie's temple.  Eddie pushes him over the desk.  Eddie then knocks Emil with the chair and Emil falls off the desk onto the floor.  Eddie continues around with the chair and drives Oleg back across the room - pinning him to the wall.  Eddie and Emil both go for the gun.  Eddie knocks him out of the way.  Stabs him with the legs of the chair repeatedly. Leaves him in a ball on the floor.  Oleg comes at Eddie and he knocks Oleg over the coffee table and onto the sofa.  The blinds and lamp shade are shot - bathing the room with more light.  Emil stabs Eddie in the stomach.  Oleg kneels down for a CLOSE-UP.   Because I am the director.  Don't you realize, if it wasn't for my film, for my talent, my idea to do this - no way would we be sitting here right now.   I'm serious...this - this is a great American film.  Full of violence and sex.  And I want my credit.   Yes.  Before we hand in the next video - I put titles on it and my credit is going to read - Directed by Oleg Razgul.   No, I don't get that!   Look at that.  See that shot!  Seamless. No cuts.  And look.  Look at that transition. That's filmmaking!!  Isn't it great?!  Jordy KICKS in the door - gun raised.   Look!  Over here!  Jordy turns.  Oleg stands up and FIRES at him - trying to film Jordy's death with a videocamera. Jordy ducks, then rises up with his gun as Oleg vaults over the seats, leaping from one to the other, mashing shoulders and heads, bounding for the screen.    In disguise - sunglasses and a hat.  Holding his videocamera.   It's all in here.  All in here.   He knew exactly what he was doing - all of this was planned!  It's all here in my movie.  Emil is not insane.  Look. Look!  Oleg PLAYS his videocamera as lenses focus, we see excerpts of the moment where Emil explains to Eddie:   No.  You are the traitor.  You are murderer.  I am director.  Action!  Oleg pulls his gun.  Emil pulls Cutler in front of him as:    as it ZOOMS from the Statue of Liberty and PANS to Oleg.  He looks in the lens with his dying eyes, gasps:   A film...by Oleg Razgul.  And Oleg dies but suddenly his eyes pop WIDE OPEN.  Hawkins jumps back, Oleg smiles, coughing in pain.   How was that?  Oleg's head rolls to one side.  Now dead.  Nicolette runs over to Jordy.  Composing herself.  Coming together.  Glad Emil is dead.  Jordy starts to walk away.",
        "Razgul": "",
        "Nicolette": "Detective, does it look like a murder?   How many victims are up there?   Can we go up to the crime scene?   Is it drug related?   Detective...what's that you're holding in your hand?  Evidence?  Mike pans up to Eddie's face.  Other reporters arrive, hurling questions which Eddie easily answers.  Cameras flash as we PAN BACK TO Korfin and Jordy.  Jordy is about to get in the car as he notices, back behind some construction - DAPHNE HANDLOVA.  She's still wearing the crumpled summer dress. She tentatively steps out to signal Jordy.  He only catches a glimpse of her.  He starts toward her -- knifes through the crowd - but Daphne is gone.   Detective - can you tell us what happened here?   I understand, but I noticed that the Fire Marshall is here with you.  Is this somehow related to the fire department?   Okay.  But I do understand that your partner, Leon Jackson's been injured. Is that correct?   Do you have the suspect in custody?    Alright, cut, cut, cut.  Mike the cameraman cuts the cameraman - lowers it from his shoulder.    Eddie, are you okay?   Alright.   Alright.   Okay.  Eddie walks into the restaurant.  Throws a look back at her, then enters.   Hey, honey.   What is your problem?  Why'd you snap at me?  I just wanted a statement.   You didn't have to embarrass me in front of my colleagues.  You could give me something.   Stop it.   Alright, alright, Eddie.  Don't patronize me.   Yes you are.  I'm not just some reporter.  I don't just stick a microphone in your face.  You could give me something.   That was good.  You were holding the evidence.   Well, who was it that taught me how to do that?  Huh?   You're not so bad yourself.  They look at each other.   C'mere.  They kiss.   Look at this.  You have blood on your shirt.  Whose is it?   Jesus.  And last week you came over with blood on your shoes.  What am I going to do with you?  Eddie takes her hand.   What are you doing?  What are you saying?  Nicolette's phone keeps ringing.  Eddie stares at it.   Eddie?  Nicolette's phone keeps ringing.   Don't worry about the damn phone.  I won't answer it.   No.  Tell me what you want to say.   Okay.  Okay.  Hold that thought just for a second.  They only call me when it's an emergency.  Just hold that thought.  Can you call back?   What're you talking about?   What?  Oh.  Okay.  Yeah.  The line disconnects.  She collapses the phone.  Turns to Eddie.   Oh my G-d, they want me to anchor.  They want me to anchor tonight!   Yeah.   Okay.  That is great.  But I can't go now, we're in the middle of something here.   No.  No, listen to me here.  I want to know what you're talking about.  You know, the shoe thing and the marriages and...   Promise?   Yeah.  I'll do that.  As long as you're not patronizing me.   I love you.  They kiss.   Okay, til tonight.   You promise?   Okay.  And you know what, I'll swing by my place, grab a couple pairs of shoes and maybe just test them out next to yours...How's that... Would that be a good thing.   Okay.   Thank you.   You know...you know he was gonna propose to me.  The crime guys found a card he'd written out to me.  And a ring box...these fuckers that killed him - have my ring.  They have my diamond engagement ring...  Hawkins touches her shoulder with compassion.   What do you mean you know?  He told you he was gonna propose to me?    I want to hear everything he said.   Alright.  Go ahead.   Oh my G-d.  We were having lunch here. He started making overtures - talking about little shoes next to his in his closet but I got a call to anchor - and I walked out on him.  I walked out on him when he was trying to ask me to marry him!!  Nicolette is crying now.  She angrily wipes away a tear.   I'd never had a great relationship before.  I'd never made great choices with men.  And he wasn't easy to get to know.  He was older, my parents told me I was nuts to get involved with him. But he was so great to me.  Always encouraging, telling me I could do anything...  He was the one.  You know, I'd give up everything - everything - for just a little more time.  I would've spent fifteen minutes with him if that's all I knew I had.  She's lost it.  Hawkins consoles her.  Nicolette shrugs him off - turns back to her drink.  Downs the rest of it.  A woman arrives, MAGGIE, Hawkins' producer - assistant in tow.   ...and today with his partner who he blamed for the crimes still at large, Emil Slovak will appear in court.  His lawyer will argue that he is mentally unfit to stand trial.  Eyewitness News has also learned that later this month, Jordy Warsaw will himself be appearing in court.  He will be arraigned on charges of violating the civil rights of...Zwangen...Zwagen...   Goddamn assholes everywhere. Zwangenbobby..Zwangendaba.  I got it. I'll do it.  Shit.  Let's start again. 5-4-3-2-1...  She starts over.   Mr. Zwangendaba claims to be a direct descendent of the African King from whom he takes his name...  Jordy's face is flashed on screen.  The phone RINGS.  Jordy picks up.   Shoot!  Shoot him!!   Shoot!  Shoot!  Shoot him!!   Don't.  Don't let him surrender.  Shoot him!  Jordy won't take his gun off him.   Wait a minute.  Where are you going? Learn from Eddie.  Talk to the court of public opinion.  Take the credit, you need it.  She turns him around.  Straightens his tie.  Starts to push the hair out of his face but he stops her hand.   Cut.  Her cameraman lowers his leans.  Jordy smiles.  She nods. Jordy turns and walks away.   Get a shot of him leaving.  Then pan to me.  Jordy disappears into the sea of people.  The camera PANS back to Nicolette.   Well, he wouldn't talk to us, but you saw it.  The CAMERA PULLS BACK from Nicolette's face and the video is now on:   New York City has a new hero, Fire Marshal Jordan Warsaw.  I hope that Fire Marshal Warsaw's heroic actions this afternoon will help with his other legal problems.  WB11 has also learned that the fire Marshal has retained an immigration lawyer to help Daphne Handlova with her case.  We wish her well.  This is Nicolette Karas, live at Battery Park, WB11 New York.  Good night.",
        "Karas": "",
        "Himself": "",
        "Cassandra": "",
        "Bobby": "",
        "Korfin": "Yo, Jordy!  BOBBY KORFIN - an overweight arson investigator with a quick with and good sense of humor - comes over, pulling on a turnout coat.   Where you been, man?  We got a celebrity!   I don't know, you think Eddie will give me his autograph?   Naw - I'm sure the suspect's not here.   'Cause Eddie woulda locked him up by now!   Nah, not at all.  Detective Flemming - Bobby Korfin.  My Uncle Tony worked with you at 2-1 back when you were a rookie.   Sorry, bro.   Okay, Jordy - it was a fast fire, we got good patterns - about thirty minutes old.  Jordy moves to one of the corpses.  He pulls on a white rubber glove.  Inserts his finger in the corpses mouth.  The glove comes out white.   Clean?   But you knew that, right?  Leon looks at Jordy, then lowers the handkerchief.  Jordy turns back to the corpses on the bed.  Eddie - in the other room - has found Tamina's brushed gold bracelet on the floor.   They have not soot in their mouths, which means they weren't breathin' before the fire and that usually means they were deceased - and this piece of cloth that my partner found means they were wrapped up in something, probably doused with a flammable liquid and positioned like this on the bed.  To the untrained eye, it looks like an accident.  Jordy kicks around the draining floor, reaches down for something.   Here you go.  A big double homicide.   You see Eddie's face when I gave him the timer?  Wish I had a picture of it.   What??   What?   Yeah?   Yeah, right.   I said, yeah, you're right, Chief.  As soon as we get somethin' we'll let you alert the media.   Max.   Max!   Get in line.  Korfin takes over - throwing him out.  Jordy turns to Garcia who is laughing.   -- From Czechoslovakia?  And how long have they been livin' in your building?  Alright, I'll be in touch when we know somethin'.  Milos and Tamina Karlova.  They were quiet and kept to themselves.  Landlord don't know who your girl is.   You hear that question, Garcia?   Well, they're definitely permanent residents now.   Why don't we get some sleep and we'll go see him in the morning.   Aren't you tired?    She keepin' you up?  Like to meet her, huh?  She'd make you forget your ex wife.  Cure your insomnia.   It hurts.  Aw, Jesus!   How was it?   Yeah.  He finished awhile ago.   Yeah.  Jordy looks at her.  Duffy sees them hold each other's look.   Zwangendaba??? Is suing you, the department and the city of New York for 10 million?  Who is Zwangendaba?  Jordy remembers...and gets more depressed.   Are you alright, man?  Lemme see the hand!   What the hell happened?",
        "Robert": "Good evening, I'm Robert Hawkins and this is Top Story.  Tonight we bring you an exclusive interview with Stephen Geller - who horrified the nation two years ago when he went berserk and murdered three clerks in a Manhattan shoe store.  But now, Mr. Geller's claim, spoken softly and articulately, is that he is the victim.  According to Mr. Geller, the events of that fateful day were not his fault but were the fault of his psychiatrist.  Hard to believe...watch.   Your doctor?   ...so you feel absolutely no responsibility for killing these people?   You seem very savvy for a man who's been found mentally incompetent to stand trial.   Permanently disrupted?  Aren't you selling paintings now for quite a lot of money?  Hasn't this 'incident' as you call it, jump started your career as an artist?   And isn't there a movie in the works about you?   But doesn't the Son of Sam Law prevent criminals from profiting from their crimes?",
        "Hawkins": "Jesus Christ.  PAULIE, the owner, walks up.   Another martini.   Sooner or later that's everybody.   I think you're getting a little moody there, Eddie.   Isn't he a little moody?   In love?  With who?  Paulie delivers the drinks and sets some cigars on the table. Takes a seat next to Eddie.  Eddie asks Hawkins.   My kids?  Let's see...Susan's 15. Aundrea's 9.  Don't tell me you're thinking about having a kid!  How old are you?  Never mind. Let me just tell you this: Every stupid cliche you hear about kids - they change your life, they make you a better person, they make you whole...  It's all true!  Before I had kids when friends talked about their kids, I wanted to vomit.  Now -- I get it.  Am I right, Leon?   Paulie, you've got kids, right?   So you got your kids listening to Opera? You still singing in the church on the weekends?   So what's unique?   That's unique.   You're worried for my safety.  I'm touched.  Eddie flattens against the building - watches Unique descend the fire escape.   Ready?   Okay.  You ready?      Any chance we can do that again?   Good evening, I'm Robert Hawkins and this is Top Story.  Tonight we bring you an exclusive interview with Stephen Geller - who horrified the nation two years ago when he went berserk and murdered three clerks in a Manhattan shoe store.  But now, Mr. Geller's claim, spoken softly and articulately, is that he is the victim.  According to Mr. Geller, the events of that fateful day were not his fault but were the fault of his psychiatrist.  Hard to believe...watch.   Your doctor?   ...so you feel absolutely no responsibility for killing these people?   You seem very savvy for a man who's been found mentally incompetent to stand trial.   Permanently disrupted?  Aren't you selling paintings now for quite a lot of money?  Hasn't this 'incident' as you call it, jump started your career as an artist?   And isn't there a movie in the works about you?   But doesn't the Son of Sam Law prevent criminals from profiting from their crimes?   Awful...what an awful day.  He was New York City.  Hawkins notices a young man by the window.  Teary-eyed.  It's Tommy.  Hawkins nods to him.   I know, son, I know.  We all loved him.  Hawkins moves on...greeting others.  He notices at the end of the bar - sitting alone on a stool - is Nicolette.  He moves to her.  Pulls up a stool alongside her.  She turns, looks at him.  Just stares at him for a long beat.  She is bombed. Definitely drunk.  She's had many.  She turns to Hawkins.   I know.   Well, he...   I'm trying to tell you.   That morning.  He was talking to me and Leon about marriage.   What are you doing here?   I can't talk to anybody right now, can't you see I'm busy!  I can't talk business.  Hang up.  Have a drink.  Get her a whiskey.   Hello?  Who is this?  How do I know this is you?  Hawkins gives Nicolette a comforting squeeze on her shoulder. Backs away from the bar.  Now out of hearing distance, he looks back at Nicolette and lowers his voice.   Where?  We INTERCUT Emil on a public phone in the lobby of a movie theater.  Oleg videotapes Emil on the phone, as he throws glances into the theater.    Look asshole.  I've been threatened by better than you.   I'll meet you on one condition - I get exclusivity and you surrender to me.   What?  It doesn't work that way.   Wait a minute.  Wait a minute.   Viewer discretion advised!   What we are about to broadcast is very graphic footage...  Everyone is riveted.  But Jordy notices outside...a \"Top Story\" NEWS VAN is waiting in the alley.  Robert Hawkins jumps from a doorway and into the van.  Jordy backs out.   Good evening.  Welcome to \"Top Story\". Tonight, I present to you material of a graphic and violent nature never before seen on television.  And I do so with a heavy heart.  You will be first-hand witness to the slaying of celebrated New York City Homicide Detective, Eddie Flemming.  It would be only normal to ask, why?  Why are we showing something so journalist, I must show it.  A democracy survives through the freedom of its media, and if we cannot see what is happening then we don't deserve our democracy, or our freedom.  Eddie Flemming was my friend.  I cried when I watched this footage and vowed to fight this violence with every molecule of my being from this day onward.  Hopefully, this will have a similar effect on you. One final word, this material is absolutely not appropriate for children.  The restaurant BUZZES.  Emil checks his watch.    This footage will work in your favor. When the jury sees this - no matter what Cutler tries, they'll convict him.  Leon looks at him. This man used to be his friend.   If I didn't put it on somebody else would!  I was his friend!   He robbed you?  The ANGLE CUTS to Zwangendaba, the mugger, now dressed in a suit and tie.  Clean shaven and with a fresh haircut.  He stands in the same spot where Jordy handcuffed him to the tree.  He's appearing on \"Top Story\".    and his camera crew, and, not far from him - frustrated and frazzled, waits Nicolette.  Still grieving her loss, she looks over at Hawkins and his crew.  She shoots him a disgusted look - Hawkins shrugs it off.  He checks his watch - anxious - looks at his cameraman.   He said he'd be here.  Pick him up as he comes through the crowd.  Do you hear me?  For Chrissakes don't miss this.   Where the hell is he?  Goddamn it?!  Jordy glares at Emil.  Emil looks back at Jordy, gloating. Smiles.  He won.  He beat the system.  Jordy suddenly erupts.   I thought you wouldn't show up.  Where is it?  Where is the tape?   Wait a minute, Bruce!  We've got some interesting evidence, something you should look at!  Reporters turn as Hawkins speaks.  His crew is taping as he continues introducing his broadcast:   I have exclusive rights to the ORIGINAL UNCUT videotape shot by Oleg Razgul, proving Emil Slovak was not insane! Hard to believe...watch!  Reporters swing their cameras over as Oleg holds his videocamera up in the air.   He's still alive.  Hawkins looks down at Oleg.  He is sprawled on the ground. His videocamera in hand - he's still making the movie.",
        "Daphne": "I want to do it, alright?   In a minute, Ludwig.  Ludwig leaves.   I told your partner, I can't help.  I didn't see anything.   Tamina was a friend of mine.  My shower was broken, she let me use theirs.   If I tell you, will you arrest me?   No, no, don't talk to Immigration!  She clams up.   ...my little sister and I shared a flat - I came home one night and a man was raping her.  His gun was on the chair... He came at me and I shot him.   Yes, but he was a cop.    I'm from a small town in Slovakia.  Like the South here.  The Police is right, a civilian is wrong.  So I fled.   You're a cop - you'll never believe me.   Now I become custody of police department?   I will if they don't send me back.   Are you married?   Do you live alone?  I've been in these clothes since...the killings.  Could we stop at your place? I could take a shower...before I go into custody?  Jordy looks at her.  Can't quite tell if she's trying to manipulate him or really just wants to get cleaned up before all the shit starts.   Somewhere else?  Jordy looks at her...    So...the station is empty?   Yes, I considered it.   No.   No.  Daphne stops.  Looks at him.  Stands very close.   I came here.  I had no money.  I knew no one.  I couldn't get a job because you have to have a green card to get work. They approached me - I could've made a lot of money.  I considered it, but... it's not who I am.  They pay me below the table at Ludwig's.   What are you asking me?   Can you let me go?  She leans in close to him - giving him the opportunity to kiss her.  Jordy is tempted but...remembers Eddie's warning and backs up slightly.   You could shower with me.  Jordy is locked in her eyes.  Almost giving in.  Then breaks away.  Gestures towards the showers. Daphne looks away form him - crestfallen.  She heads to the showers.  Jordy follows her into the bathroom.  The walls are lined with shower stalls.   I'm not a whore.  I'm not a whore.   You don't know.  I'm sorry.  I was desperate.  That's not me.  I shot a cop.  Can you imagine what they'll do to me when I got to prison?   I'm sorry.  I didn't mean to...I'm glad. Actually I'm glad it's over.  All this time.  Hiding.  Never being able to look anyone in the eyes. Always afraid that someone would find out who I was.  Never trusting anyone...  He covers her with the towel, pulling her up.    It's an old brownstone - in poor condition.  Jordy pulls up. Opens the door for Daphne - takes her by the elbow - steering her to the door.  He is edgy.  Jumpy.  Looking around.   Are you alright?   I'm sorry.  He looks at her.  Nods.  They walk up to the stairs as the front door opens.  A NEIGHBOR exits, shocked.  Jordy pulls Daphne out of the way.    Hello.  How are you?    Jordy and Daphne make their way up the stairs.  A bouquet of flowers are outside Daphne's apartment.   Ludwig?  He's gay - are you jealous?   If you were my boyfriend, I'd suggest you find another girlfriend that isn't going to jail ten-thousand miles away.  They're staring in each other's eyes.  The sexual tension strong.   No matter what happens...I'm glad I met you.    It's very small.  Almost no furniture.  The bare minimum. The apartment is a hole.  She looks at Jordy.  Both thinking the same thought.  Another kiss.   Right.  She holds his look.   In the kitchen.   I'll get my clothes.  She heads down the hall.  Jordy enters the small kitchen.  He flips on the kitchen light and the LIGHTBULB EXPLODES -  Jordy!!!   That's not mine!  WHOOOOOOOOOSH!  The fire extinguisher FEEDS THE FIRE!  Flames leap up from the fire - shooting toward the extinguisher because it's filled with gasoline.  The handle LOCKS!  Jordy CAN'T TURN IT OFF.  Flames engulf the extinguisher and  Oh my G-d!  Oh my G-d!  Jordy turns - sees Eddie's shield.   They were here!  This freaks her out.  They were in her home.  She starts to panic.   Pouring it out!  She grabs the can of gasoline - pours it down the drain.  The FIRE is raging outside the bathroom.  The bathroom door is beginning to smoke and burn.  They are trapped.  Jordy turns - grabs an exposed water pipe that runs up the wall to the ceiling.  He throws his feet against the wall for leverage.  Pulls with all his might to break it loose.  It's creaking - but he's having a hard time with it.   Oh shit!  Jordy looks over.  The gasoline she's pouring out - is not going down the drain.  It's stopped up.  As soon as the fire gets in the bathroom, everything will explode!  Jordy begins pulling at the rusty pipe with all his might. Daphne comes over - helps him.  Both of them trying to break it off.  Suddenly it snaps and water POURS into the room. SOAKING THE WALLS.  They point the pipe toward the door, soaking some of the flames which are consuming the door. Trying to stop the fire from coming in.  He and Daphne are drenched.  And trapped.  Jordy grabs a broken piece of pipe.  Starts SMASHING the wall behind them.  The wall to the adjacent apartment.    Filled with smoke.  You can barely see Jordy or Daphne. Jordy SMASHES a hole in the wall - which reveals the bathroom in the apartment next door.  The smoke has a place to escape. There's a 7-year old KID in there.  Standing in the bathroom. Terrified.   Forget about me.  You have enough problems of your own.   I don't want to drag you down with me.   Shhhh.  She leans in and kisses him.  Then looks into his eyes, trying to find a smile.",
        "Handlova": ""
    },
    "imdb_rating": "6.1",
    "description": "When Eastern European criminals Oleg and Emil come to New York City to pick up their share of a heist score, Oleg steals a video camera and starts filming their activities, both legal and illegal. When they learn how the American media circus can make a remorseless killer look like the victim and make them rich, they target media-savvy NYPD Homicide Detective Eddie Flemming and media-naive FDNY Fire Marshal Jordy Warsaw, the cops investigating their murder and torching of their former criminal partner, filming everything to sell to the local tabloid TV show \"Top Story.\"—Jeff Cross <blackjac_1998@yahoo.com>",
    "name": "15 Minutes",
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYWFkZDE5Y2EtYjQ2Ni00OWY2LTgyOGMtN2I5NzEzYWZiNmVlXkEyXkFqcGdeQXVyNjk1Njg5NTA@._V1_QL75_UY281_CR3,0,190,281_.jpg"
}