{
    "filename": "9_script.txt",
    "imdb_id": "tt0472033",
    "imdb_url": "https://www.imdb.com/title/tt0472033",
    "characters": [
        "Complete credited cast:",
        "#7 (voice)",
        "#6 (voice)",
        "Scientist (voice)",
        "#2 (voice)",
        "Dictator (voice)",
        "#8 /Radio Announcer (voice)",
        "News Caster (voice)",
        "#1 (voice)",
        "#9 (voice)",
        "#5 (voice)"
    ],
    "dialogues": {
        "#7": "",
        "(voice)": "",
        "#6": "",
        "Scientist": "Experiment 208, day 20...    Please.   Give it a chance.   The grainy footage rolls again; we see the scientist moving away from the camera .  The lab is shadowy, late at night. We see his worktable for the first time, covered with discarded sketches, a furiously filled-in journal, and pieces of failed machinery (the floor is also similarly littered). The TALISMAN sits on the worktable. Nearby is a small old-fashioned tiny little box.   (tired, but dictating to    The machine zips through the complex 3-D chess game at lightning speed, checkmating the scientist in seconds as the Dictator watches. The scientist laughs fondly and pats the machine.      CLOSE on the machine: the dictator is gripping it with a nasty firmness. The machine seems to try to squirm away. The director's BLACK-GLOVED HAND grasps it harder.  and grabs the nearest soldier (seen from the back, we see only the uniform and helmeted head) by the back of his arm, BREAKING his ARM. The soldier falls .     A tiny, cluttered attic, filled with bits and pieces of found material--burlap, door hinges, an old shoe, old eyeglasses, rusty scissors, pen nibs, gas masks etc.   We see the tiny little box sitting on the cluttered makeshift worktable.       his voice a mere whisper    a feeble whisper      ...so little hope remains... that is why I create you...    ...so little hope remains... that is why I create you...  tenderly, to 9 directly",
        "#2": "",
        "Dictator": "Useless.  One more.      That's all. We turns to leave. We hear the clicking of boots as the soldiers accompany him out.  We see the scientist's dejected face as he comes towards the camera to turn it off.  Perfect.",
        "#1": "",
        "#9": "",
        "#5": ""
    },
    "imdb_rating": "7.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTY2ODE1MTgxMV5BMl5BanBnXkFtZTcwNTM1NTM2Mg@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "In a world destroyed in a war between man and machine, a hand-stitched doll with the number 9 written on its back comes to life. The world he has awakened in is frightening, but he quickly learns that he is not alone and that there are others like him, also with a single digit written on their back. The first one he encounters is 2 who tells him something of what happened to the world. 2 is also thrilled with the disk 9 is carrying, one with three unique symbols on the front. 9 soon learns that the disk and some of the other dolls who are prepared to die for the good of humankind may be the last hope for man's salvation.—garykmcd",
    "name": "9",
    "genres": [
        "Animation",
        "Action",
        "Adventure"
    ]
}