{
    "filename": "A-Most-Violent-Year_script.txt",
    "imdb_id": "tt2937898",
    "imdb_url": "https://www.imdb.com/title/tt2937898",
    "characters": [
        "Andrew Walsh",
        "Anna Morales",
        "Annie Morales",
        "John Dominczyk",
        "Julian",
        "Moishe Mendelsohn",
        "Arnold Kline",
        "Joseph Mendelsohn",
        "Beat Cop (as Chester Jones)",
        "Barber Jimmy O.",
        "D.A. Lawrence",
        "Deputy Lange",
        "Louis Servidio",
        "Abel Morales",
        "Toll Booth Attendant"
    ],
    "dialogues": {
        "Andrew": "So how are we this morning?  Well I woke up feeling very good about this.  Well we are going all in... so now I love it.  Here we go.  Should we head inside?  Of course.  Congratulations.  Well, it was a hell of a job just getting them to this point. It's a good day for us. Take a walk around. Enjoy it for a second.  Lawrence. Thank you for seeing us on such short notice.  Yes...  We need your help.  Our trucks. They are being robbed.  We have a serious security issue.  Our drivers are being put in danger.  Of course.  I understand. But this is turning into an urgent and pressing matter for us.  Yes.  Like what?  Abel. Abel.    No... let's not overreact. We don't even know what they are bringing against us. It could be total bullshit, and they are just trying to use us along the way. This isn't anything yet.  I'm sorry for the dramatic drop in but your phone doesn't seem to be working.  No... It looks like they are coming after us.  The D.A.  I still haven't seen it yet. But my guy in his office just gave me a heads up an hour ago. It's not good.  I'm not sure, a couple places probably.  Anna... sorry you've got no phone.  The D.A. is going to bring down charges on us tomorrow.  We don't know yet.  Right now they are just saying us.  It means we may have some accounting exposure where we have pushed things a little too far.  You always told us to push until we couldn't push any further. Well, we may have hit that line. So we will handle it and move on.  Let's not get ahead of ourselves here. You have always followed standard industry practices. We aren't even sure what this is yet. I just wanted to make sure you had all the information I do. This is a badge of honor, it means we are big enough to give a shit about now. Don't worry.  Very impressive.  And one more thing. I got a call from the union... O'Leary.  They've been getting word back from our drivers.  There is real concern about their safety.  The drivers are feeling unprotected.  I just think you should talk to them about it. Before it grows into something.  Good night.  Can I talk with you both?  Who?  Well...  It's not good... It's bad  It's a fourteen count indictment. Most of it is crap. Piggyback issues. But...  The first three counts are where we start to have real issues. They know what's going on in this industry. They say we are rigging scales and under-reporting income. We don't know what they have or how they got it. But no matter how they got it, it's a problem.  We are going to owe them some money.  That depends on a bunch of factors. But that's an accounting question.  And there is one other thing. The bank...  We need to sit down with them immediately. I set a dinner. We need you both there to lay everything out and be totally up- front. This shouldn't be a problem. Lord knows they've given money to bigger crooks than us. But I don't want us hiding anything from them.  Seems like all the way back to when you bought out Anna's father.  He's been wanting to talk to you for days.  How did that go?  He feels very strongly about this.  I don't think he fully understands it.  It's illegal.  I understand.  How would this work?  I guess I'm not even sure exactly what you are suggesting.  No.  And a permit?  When?  Are the permits legit?  Who is it?  I'll talk to him.  How did that go?  He feels very strongly about this.  I don't think he fully understands it.  It's illegal.  I understand.  I will try to talk with him.  How would this work?  I guess I'm not even sure exactly what you are suggesting.  No.  And a permit?  When?  Are the permits legit?  Who is it?  They just got another truck.  Who was driving?  Is he alright?  The drivers' security aside... this shit is starting to have a very significant financial effect on us here. It can't continue.  How was your talk? I spoke with him after. He's going to keep going `til he gets the answer he's looking for.  I'm not sure we are in a position to say that.  Do you want to go for a walk?  I am and it is.  It is looking like we must do this.  They will shut you down.  That's true, until its not. And the last person in the world right now that we need working against us is the president of the fucking teamsters. This company is out of business in a month if he gets these guys to walk. We are running out of cash.  The union provides a handgun and a permit to every one of the drivers. And they think this whole thing is over in a week.  It does either way.  Would you put everything at risk to stand by that.  Why do you want this so badly?  That's not what I mean. Why did you want it so badly in the first place? It was a risk... always.  You don't know? Have you ever thought about it?  I didn't mean have you ever thought about that place...  I mean have you ever thought why you want it so badly?  That's very simple.  You take these risks...  We have to get going, we need them to show up.  Did you have a chance to look over the outline that I sent over?  Is Julian here?  Abel would like to speak with him. To help him.  Of course we are turning you in. You have put everything that man has worked for for the last 20 years at risk. If it was up to me we would be dealing with this in a very different way.  Really?  And what things do you know?  I strongly suggest you think that through before you answer it. Because even if you did, what does it do for you? Nothing. There is nothing there for you to gain. Nothing.  I am too.  They say they have you firing four shots, is that right?  Where's the gun?  Good. Your background check with us says you have never been arrested, is that true?  Have you ever been arrested?  Because no bank will touch us right now. So we can't close on the new property. And he's going to lose everything on his deposit.  This is a lawyer who will meet you when they bring you to the station. You no longer work for us. You've been fired. But Abel wants to pay for the lawyer. So... this guy should be able to help you. Good luck.  I'm late. I will meet you at four.  We didn't think he'd react that way.  I'm sorry.  So are we... it's very sad. He was very close to Abel.  Possibly.  I'll show this to them. He'll never go for it, but it's a start.  I know... I will present it to him.  Thank you.  You need what to stop?  Starting to be? No shit.  I understand. The kid went out and got his own gun. This was not us. No matter what you think of him, Abel doesn't work this way.  He wants to talk to them. We've been trying to set up a meeting. O'Leary hasn't been able to get it done.  Is that enough?  Well here it is. It's just a first pass.  I'm sorry?  I know. It's just a first offer.  I know.  He's going to get us the meeting.  Lawrence, he's tight with O'Leary.  Does Julian have anything?  Anything on us?  If we are cutting deals, we can't have anything new come up at the last minute.  We need to find him... Lawrence needs him.  Fuck You! You better run!  Congratulations.  Yes.  I know. I'm sorry.  I don't know why but I guess I never realized we even had this view from back here.  What... what should we do?  Really?",
        "Walsh": "So how are we this morning?  Well I woke up feeling very good about this.  Well we are going all in... so now I love it.  Here we go.  Should we head inside?  Of course.  Congratulations.  Well, it was a hell of a job just getting them to this point. It's a good day for us. Take a walk around. Enjoy it for a second.  Lawrence. Thank you for seeing us on such short notice.  Yes...  We need your help.  Our trucks. They are being robbed.  We have a serious security issue.  Our drivers are being put in danger.  Of course.  I understand. But this is turning into an urgent and pressing matter for us.  Yes.  Like what?  Abel. Abel.    No... let's not overreact. We don't even know what they are bringing against us. It could be total bullshit, and they are just trying to use us along the way. This isn't anything yet.  I'm sorry for the dramatic drop in but your phone doesn't seem to be working.  No... It looks like they are coming after us.  The D.A.  I still haven't seen it yet. But my guy in his office just gave me a heads up an hour ago. It's not good.  I'm not sure, a couple places probably.  Anna... sorry you've got no phone.  The D.A. is going to bring down charges on us tomorrow.  We don't know yet.  Right now they are just saying us.  It means we may have some accounting exposure where we have pushed things a little too far.  You always told us to push until we couldn't push any further. Well, we may have hit that line. So we will handle it and move on.  Let's not get ahead of ourselves here. You have always followed standard industry practices. We aren't even sure what this is yet. I just wanted to make sure you had all the information I do. This is a badge of honor, it means we are big enough to give a shit about now. Don't worry.  Very impressive.  And one more thing. I got a call from the union... O'Leary.  They've been getting word back from our drivers.  There is real concern about their safety.  The drivers are feeling unprotected.  I just think you should talk to them about it. Before it grows into something.  Good night.  Can I talk with you both?  Who?  Well...  It's not good... It's bad  It's a fourteen count indictment. Most of it is crap. Piggyback issues. But...  The first three counts are where we start to have real issues. They know what's going on in this industry. They say we are rigging scales and under-reporting income. We don't know what they have or how they got it. But no matter how they got it, it's a problem.  We are going to owe them some money.  That depends on a bunch of factors. But that's an accounting question.  And there is one other thing. The bank...  We need to sit down with them immediately. I set a dinner. We need you both there to lay everything out and be totally up- front. This shouldn't be a problem. Lord knows they've given money to bigger crooks than us. But I don't want us hiding anything from them.  Seems like all the way back to when you bought out Anna's father.  He's been wanting to talk to you for days.  How did that go?  He feels very strongly about this.  I don't think he fully understands it.  It's illegal.  I understand.  How would this work?  I guess I'm not even sure exactly what you are suggesting.  No.  And a permit?  When?  Are the permits legit?  Who is it?  I'll talk to him.  How did that go?  He feels very strongly about this.  I don't think he fully understands it.  It's illegal.  I understand.  I will try to talk with him.  How would this work?  I guess I'm not even sure exactly what you are suggesting.  No.  And a permit?  When?  Are the permits legit?  Who is it?  They just got another truck.  Who was driving?  Is he alright?  The drivers' security aside... this shit is starting to have a very significant financial effect on us here. It can't continue.  How was your talk? I spoke with him after. He's going to keep going `til he gets the answer he's looking for.  I'm not sure we are in a position to say that.  Do you want to go for a walk?  I am and it is.  It is looking like we must do this.  They will shut you down.  That's true, until its not. And the last person in the world right now that we need working against us is the president of the fucking teamsters. This company is out of business in a month if he gets these guys to walk. We are running out of cash.  The union provides a handgun and a permit to every one of the drivers. And they think this whole thing is over in a week.  It does either way.  Would you put everything at risk to stand by that.  Why do you want this so badly?  That's not what I mean. Why did you want it so badly in the first place? It was a risk... always.  You don't know? Have you ever thought about it?  I didn't mean have you ever thought about that place...  I mean have you ever thought why you want it so badly?  That's very simple.  You take these risks...  We have to get going, we need them to show up.  Did you have a chance to look over the outline that I sent over?  Is Julian here?  Abel would like to speak with him. To help him.  Of course we are turning you in. You have put everything that man has worked for for the last 20 years at risk. If it was up to me we would be dealing with this in a very different way.  Really?  And what things do you know?  I strongly suggest you think that through before you answer it. Because even if you did, what does it do for you? Nothing. There is nothing there for you to gain. Nothing.  I am too.  They say they have you firing four shots, is that right?  Where's the gun?  Good. Your background check with us says you have never been arrested, is that true?  Have you ever been arrested?  Because no bank will touch us right now. So we can't close on the new property. And he's going to lose everything on his deposit.  This is a lawyer who will meet you when they bring you to the station. You no longer work for us. You've been fired. But Abel wants to pay for the lawyer. So... this guy should be able to help you. Good luck.  I'm late. I will meet you at four.  We didn't think he'd react that way.  I'm sorry.  So are we... it's very sad. He was very close to Abel.  Possibly.  I'll show this to them. He'll never go for it, but it's a start.  I know... I will present it to him.  Thank you.  You need what to stop?  Starting to be? No shit.  I understand. The kid went out and got his own gun. This was not us. No matter what you think of him, Abel doesn't work this way.  He wants to talk to them. We've been trying to set up a meeting. O'Leary hasn't been able to get it done.  Is that enough?  Well here it is. It's just a first pass.  I'm sorry?  I know. It's just a first offer.  I know.  He's going to get us the meeting.  Lawrence, he's tight with O'Leary.  Does Julian have anything?  Anything on us?  If we are cutting deals, we can't have anything new come up at the last minute.  We need to find him... Lawrence needs him.  Fuck You! You better run!  Congratulations.  Yes.  I know. I'm sorry.  I don't know why but I guess I never realized we even had this view from back here.  What... what should we do?  Really?",
        "Anna": "The camera slowly moves in as ANNA sits in a slip at her make up table putting on her face for the day ahead. She looks into the mirror as if she is putting on a coat of armor.  Yes.  Thank you.  Yes.  Don't do anything stupid.  They broke his jaw.  Yes.  He was left in the middle of the highway without a truck, they brought him in.  Not for a couple days... Can I speak with you outside?  Did they sign the contract?  And took the deposit?  So it's a go?  Congratulations.  We have thirty days?  Do you want me to speak to my Brother about this?  This can't continue.  It will if we don't do something.  Oh, fuck the D.A. He's more interested in coming after us than helping us.  It's not fair to them. You're at war here.  Really... because they are.  And you're going out to check on the new house?          How'd it go?  For what?  Who else?  We follow standard industry practice on every front.  I need to know what they are saying we did.  I know it has been a long road, and that not all of you wanted to do this, but thank you. For me...  Andrew.  For what?  Who else?  We follow standard industry practice on every front.  You know what that means.  I need to know what they are saying we did.  Thank you for coming by Andrew.  It only cost him a year of the kid's tuition.  What word?  All of them.  Because they are.      What's he doing?  Where were you?  Abel?     Who was it?  If you...  Seems like a message was sent loud and clear.      Catherine... Catherine. Katie!  Where did you get this? Catherine where did you find this?  Show me.  Did you see this?  Maria!  Maria!  A gun... It's a gun Abel.  Your youngest daughter found it in the bushes outside our front door. She was playing with it.  It's loaded... with the safety off.  Those weren't kids looking to rip off our TV Abel, that was a fucking goon with a loaded gun looking in our windows! What the hell is going on here?  Damn right we will. Who is this?  What does that mean you will take care of it. This isn't a brick through our car window or some other cute little warning that I've put up with in the past. This is your daughter playing with a loaded gun!  You better. Because you won't like what's going to happen once I start getting involved.  ...I won't.  I found a gun outside our front door. Somebody left it there last night.  Abel!  I'll get into it.  Andrew can I talk to you for a minute.  He's not here.  Okay. I will.  Arthur.  Thank you.  Ian.  Well that's exactly right. And we wanted to sit down with you tonight to make sure we were being totally up-front with everything that is going on and make sure that you understand the nature of the complaints and are comfortable that it is not going to affect our business in an adverse way.  Hopefully it made clear that even in a worst case situation we will pay off any and all fines and be able to move forward with very comfortable capital on hand.  Well, that went about as well as could be expected.  Do you think they will close?  Yes... you need to go put it out of its misery.  I mean it. We can't just leave it here.  Is it dead?  Well you need...  What are you doing?  Hello Maria, sorry we are a bit late. They were fine?  Great, thank you. We'll see you in the morning then.  What?  Yes... what?  No.  I told you I wasn't going to just continue to stand around and let these people come and get me and my children. So unlike you who seems to be totally comfortable just standing around like some... fucking pussy... I did something about it.  You know where I got it.  Not yet.  You've given me? You? Are you delusional? Do you even understand how ridiculous that makes you sound?  Abel.  You need to protect us.  What is this?  Are they serious?  Abel.  Mr. Lawrence is it?  Anna Morales.  May I speak with you for a minute.  I understand you and your men have a job to do here. But we are in the middle of a seven-year-old's birthday party.  That's not a problem, as we have nothing to hide from you. It's just that, we recently moved to this area, and there are twenty guests in our house... please... can you give me five minutes so we can ask everyone to leave calmly before you come into my home?  Thank you.  Where are you going?  You've got three minutes.  Our guests are leaving.  I don't want them going through all this before I've had a chance to.  Thank you for coming. Here you go. Bye, Rebecca. Thanks. I'm sorry. Bye.  This is probably one that you are going to regret.  My husband is a very honorable man. Coming on a Saturday? It's very aggressive.  Really? I know you think you are just doing your job. But we are not what you think we are. And you have embarrassed him in front of his family and friends.  Good for you. My husband is not my father. Not even close. So if I were you I would start treating us with a little more respect or he'll make it our only mission to ruin you. This was very disrespectful... and you are not going to find a fucking thing.     It's horrible.  Where is he?  And they haven't gotten the other guys?  Are you okay?  Who?  So what does that mean?  We have two days!      Quiet.  Stop. I've told you guys not to push it this morning, this is not the morning to be doing this... but since the second you all woke up. It's this, it's that. Just stop. The world does not revolve around you!  That's it Annie we've told you...  Stop!!  All five of them are sitting in the car, sadness prevails.     Hi.  I've made it to 1975.  I'm not sure yet... but it's not as bad as they are saying it is... Turns out I kinda knew what I was doing.  How'd you do?  You're going to see your little brother?  And Peter?  This is all worth it.  I'll be up.  I love you too.  The camera moves slowly across a dark hallway. We hear the sounds of a manual adding machine grinding away. As we come through the doorway we see ANNA MORALES sitting at her desk in a pool of light from the desk lamp. She is deep in it crunching numbers. Finally ABEL walks into the doorway, he looks exhausted.  Hi.  I've made it to 1975.  I'm not sure yet... but it's not as bad as they are saying it is... I guess I knew what I was doing.  How'd you do?  You're going to see your little brother?  And Peter?  They're fine.  This is all worth it.  Look at us...it is.  I'll be up.  I love you too.  ABEL comes in as ANNA is sitting at the table smoking. He walks over and sits down at the table with her. She gives him a great sly smile.  What a day.  Are you okay?  Car chases?  Who knew?  How was your brother?  Stop.  Enough.  It was a lot of things all at once.  How did it go?  I'm sorry.  I know.  It's a bank account.  Ours.  A lot.  It will help. You could replace Peter's money and get him out of the deal.  Abel.  Since 1971 I have been skimming money out of the company. Some years a little... others a lot. In the beginning it was just in case times got tough but then it was because you were taking all these chances... I didn't know what else to do... I couldn't risk having us be left with nothing.  I'm sorry.  Use it.... Abel...  What does that mean?  It's as clean as every other dollar we've ever made.  I can clear it on the books.  So what's your plan here?  (Yelling, but controlled enough to not wake the kids. Oh you are too much. You've been walking around your whole life like this all happened because of your hard work, good luck, and charm. Mr. Fucking American Dream. Well this is America... but it's not a dream, and that wasn't good luck helping you out all those years... IT WAS ME! Doing the things you didn't want to know about...  Oh... You have always been very good about not letting your ego get in the way of business. Don't start now just because it's me.  It's our money.  These fucking guys...what's this additional $11,000?  Abel.  Abel...congratulations. Now cheer up. And can someone give me a tour of this place we just paid two million bucks for?  What a hell-hole this city is.",
        "Morales": "The camera moves slowly across a dark hallway. We hear the sounds of a manual adding machine grinding away. As we come through the doorway we see ANNA MORALES sitting at her desk in a pool of light from the desk lamp. She is deep in it crunching numbers. Finally ABEL walks into the doorway, he looks exhausted.",
        "Annie": "Dad. Mr. Walsh is here.  Oh fuck you!  The world revolves around me? Me! What about her? And what about you? You're both so totally obsessed with your stupid business. You walk around like you are saving the world but what are you doing... nothing!",
        "John": "",
        "Dominczyk": "",
        "Julian": "Good morning.    Abel?  Do you think I am ready to move into sales?  I... I'm not sure I will be able...  Did you get the truck back?  This is the sixth one?  Thank you.  I think so.  Thank you.  Bulk delivery to Chase.  I feel very vulnerable.  Cathy! They are coming again. Over. Help. Help. On Bridge.  Get the fuck away from me!  Fuck you.  Fuck you!  I don't think so.  No.  Fuck you!     He's turning me in?  But I know things...  Yes.  I'm sorry.  I don't know.  I threw it in the river.  Why is this putting everything at risk?  No.  I'm sorry.  I was scared.  Aren't you scared?  What do you do?   Are you ruined?  I'm sorry.  No... I am not strong.  Trust me... I am not... I'm sorry.              I didn't.  I have nowhere to go.  Fuck you. I have nothing. And somehow you've ended up with everything you wanted.  What is that supposed to mean?  I'm sorry. You gave me a very good chance. Right?  Probably a better chance than I deserved.  Please take care of my family.  Please...",
        "Moishe": "",
        "Mendelsohn": "",
        "Arnold": "Well, look who it is.  Just a touch off the side Jimmy. Not all of us are as lucky as Mr. Morales here in terms of keeping our hair.  I know I am. So I hear congratulations are in order?  You got yourself in contract over there.  Thirty day close I hear, you better be.  I saw a couple of your trucks over in Rego Park the other day.  A couple times.  Is it?  That's a tough market.  My father struggled for years before he broke in there.  Hey.  Abel, that was well said.  What can I do for you?  What check is that?  I'm sorry?  I had nothing to do with that.  That's not possible.  How much?  I'll need a day.  I've just been buying this stuff off these guys, it was only a couple loads, I don't know who they are. I would never do that.  Abel, I wasn't the only person buying this shit.  It may ruin me.",
        "Kline": "Well, look who it is.  Just a touch off the side Jimmy. Not all of us are as lucky as Mr. Morales here in terms of keeping our hair.  I know I am. So I hear congratulations are in order?  You got yourself in contract over there.  Thirty day close I hear, you better be.  I saw a couple of your trucks over in Rego Park the other day.  A couple times.  Is it?  That's a tough market.  My father struggled for years before he broke in there.  Hey.  Abel, that was well said.  What can I do for you?  What check is that?  I'm sorry?  I had nothing to do with that.  That's not possible.  How much?  I'll need a day.  I've just been buying this stuff off these guys, it was only a couple loads, I don't know who they are. I would never do that.  Abel, I wasn't the only person buying this shit.  It may ruin me.",
        "Joseph": "So why is it you want this land?  It has been difficult for you to get me here, no? Over a year?  There are many like it around? And thanks to all these tests you paid for, we now know it is as much of a mess below the ground as it is above. My people have looked at your books, I know this is a lot of money for you, so why have you kept on us so... just for this ugly and polluted little piece of the earth.  So it is just proximity?  And what's that?  Well, I am in the garment business so I appreciate that sentiment. But I inherited this land from my uncle. Sadly he had no children of his own. He was the one that let them build these tanks here. So this place can do little for me... in fact thanks to all those tests you've done it may be a liability. As you know I offered to lease the site to you at a fair price, but you were not interested?  Why not?  I can see that.  Yes. This contract here, your lawyers have fully reviewed it?  And you have brought the money?  So you realize you have only thirty days to close this transaction?  No extensions, no... contingencies whatsoever.  I want you to know this up front. I am a very fair man but I believe in honoring contracts. You will fulfill your end of this contract and the property is yours. If you can't we will keep your money and will sell it to your competitor who has been chasing us almost as badly as you have. I like you, but know that the only reason I am choosing you is because of the favorable terms of this contract. So this is business... and when you sign this....  Well then, let's see this money, and then I will sign these papers.  Of course.  Of course you do.  Why?  It's a difficult time to do business.  I'll give you three more days. Then it's over.  Mazel Tov.",
        "D.A.": "Andrew.  Of course. And Mr. Morales. Please sit. I didn't realize you were coming as well.  So what can I do for you?  In what way?  (he looks over at DEPUTY  Yes.  Mr. Walsh, as I know you know, this office has been investigating your entire industry.  And as much as I'd like to be able to help you, you know this is a police issue. It's not what we do here.  Urgent?  I'm not sure what you mean. There were more murders and rapes in this city last year then there ever have been, so if you have come to tell me that we have a urgent security issue here, trust me I'm aware.  I don't.  I understand your frustration. And although everyone else seems to have given up and left this city for dead, I haven't. And as you know we have been investigating industry-wide corruption in your business that seems to have been going on for years. And the simple fact is that the only person who could do anything with 8000 gallons of heating oil in a matter of minutes after stealing a truck is someone from within that industry. And almost certainly someone with local storage capacity. So you're right. That means you all are stealing from each other. Which is, as far as I can tell, just a refreshing new take on what you've been doing to your customers and fellow taxpayers for the last fifteen years.  Well yes and no. See, all that I can do is to try and put people away in the simplest and most economical way possible with the limited resources at my disposal. It doesn't really matter to us who it is or how we do it as long as it's progress.  I know it does. This city is a very difficult place to do business right now.  You know... Mr. Morales you seem like a decent man, and because of that I'm really not comfortable just sitting here with you pretending that the elephant perched on the corner of my desk isn't there.  I can't go into specifics at this moment but we believe that you and your company have broken the law and that we have enough evidence to prove that. So next week, Monday actually, we will be bringing a case against you.  I'm sorry to do this in person. It's awkward, obviously, but I didn't want to have this happen on Monday not having said something here in person today, out of respect.  I'm sure you will.  One more thing... Have you been doing anything different in your business over the last year?  I'm just looking here through these reports. It looks like out of the nineteen registered heating oil companies in the city your trucks have been getting hit three to one.  So are you maybe doing something to bring this on yourself?  Like enter a new market?  Of course. But I think you understand what I'm saying... there are always some markets that are more difficult than others to enter.  I have a lot of problems coming across my desk every day Mr. Morales.     Yes.   Yeah.  I understand, and I'm sorry. But we are coming in.  You can get them out of the house.  Excuse me?  This is standard.  I think I know your father.  I heard.  It's not good... for either of us.  In my job we use whatever leverage we can gain, as I'm sure you do in your business. It's an ongoing investigation, and it will be just one piece of many. So while I appreciate you coming here... I have nothing I can tell you.  What a fucking mess this place is... Do you know where he is?  You should. And when you do, bring him to us. A situation like this, happening in such a dangerous and public way, within an industry I'm charged with cleaning up. It's very bad for me... professionally speaking.  So. I should start by thanking you for your assistance in... in attempting to bring in your driver?  Yes... Well, the officers there didn't set it up very well on their end either.  We are looking for him.  I understand. Well... Ms. Lange.  This could get a lot worse for you all.  And Andrew, one other thing.  I need this to stop.  This fucking bullshit with the open warfare. I won't put up with it. It's starting to be a real problem.  Not for you... but for me.  I need the driver.  I really could give a fuck, but you need to get your man to talk to these people, give in, stop doing whatever you are doing to bring this shit on you. It needs to stop.  I'll talk to him.  He's an old friend... and get that kid back in here. I'm up in it a little bit here and I need something.  I'm very sorry. Did you know him well?  He must have been under a hell of a lot of pressure.  I'm sorry.  Yes... so you are chasing down hijackers now?  No.  Probably not.  Of course.  Yeah.  I know.  That's probably true.  We can probably do that.  I hear you closed on this terminal today?  I didn't realize that you had that in the works.  That will put you in quite a powerful position.  If you get this place up and running again it will have significant influence... politically speaking.  We all have our ambitions.  And sometimes we need help to get there... You've come a very long way.  In a very short time.  The most right?  That one makes my head hurt a little.  I hope so.",
        "Lawrence": "Andrew.  Of course. And Mr. Morales. Please sit. I didn't realize you were coming as well.  So what can I do for you?  In what way?  (he looks over at DEPUTY  Yes.  Mr. Walsh, as I know you know, this office has been investigating your entire industry.  And as much as I'd like to be able to help you, you know this is a police issue. It's not what we do here.  Urgent?  I'm not sure what you mean. There were more murders and rapes in this city last year then there ever have been, so if you have come to tell me that we have a urgent security issue here, trust me I'm aware.  I don't.  I understand your frustration. And although everyone else seems to have given up and left this city for dead, I haven't. And as you know we have been investigating industry-wide corruption in your business that seems to have been going on for years. And the simple fact is that the only person who could do anything with 8000 gallons of heating oil in a matter of minutes after stealing a truck is someone from within that industry. And almost certainly someone with local storage capacity. So you're right. That means you all are stealing from each other. Which is, as far as I can tell, just a refreshing new take on what you've been doing to your customers and fellow taxpayers for the last fifteen years.  Well yes and no. See, all that I can do is to try and put people away in the simplest and most economical way possible with the limited resources at my disposal. It doesn't really matter to us who it is or how we do it as long as it's progress.  I know it does. This city is a very difficult place to do business right now.  You know... Mr. Morales you seem like a decent man, and because of that I'm really not comfortable just sitting here with you pretending that the elephant perched on the corner of my desk isn't there.  I can't go into specifics at this moment but we believe that you and your company have broken the law and that we have enough evidence to prove that. So next week, Monday actually, we will be bringing a case against you.  I'm sorry to do this in person. It's awkward, obviously, but I didn't want to have this happen on Monday not having said something here in person today, out of respect.  I'm sure you will.  One more thing... Have you been doing anything different in your business over the last year?  I'm just looking here through these reports. It looks like out of the nineteen registered heating oil companies in the city your trucks have been getting hit three to one.  So are you maybe doing something to bring this on yourself?  Like enter a new market?  Of course. But I think you understand what I'm saying... there are always some markets that are more difficult than others to enter.  I have a lot of problems coming across my desk every day Mr. Morales.  Yes.   Yeah.  I understand, and I'm sorry. But we are coming in.  You can get them out of the house.  Excuse me?  This is standard.  I think I know your father.  I heard.  It's not good... for either of us.  In my job we use whatever leverage we can gain, as I'm sure you do in your business. It's an ongoing investigation, and it will be just one piece of many. So while I appreciate you coming here... I have nothing I can tell you.  What a fucking mess this place is... Do you know where he is?  You should. And when you do, bring him to us. A situation like this, happening in such a dangerous and public way, within an industry I'm charged with cleaning up. It's very bad for me... professionally speaking.  So. I should start by thanking you for your assistance in... in attempting to bring in your driver?  Yes... Well, the officers there didn't set it up very well on their end either.  We are looking for him.  I understand. Well... Ms. Lange.  This could get a lot worse for you all.  And Andrew, one other thing.  I need this to stop.  This fucking bullshit with the open warfare. I won't put up with it. It's starting to be a real problem.  Not for you... but for me.  I need the driver.  I really could give a fuck, but you need to get your man to talk to these people, give in, stop doing whatever you are doing to bring this shit on you. It needs to stop.  I'll talk to him.  He's an old friend... and get that kid back in here. I'm up in it a little bit here and I need something.  I'm very sorry. Did you know him well?  He must have been under a hell of a lot of pressure.  I'm sorry.  Yes... so you are chasing down hijackers now?  No.  Probably not.  Of course.  Yeah.  I know.  That's probably true.  We can probably do that.  I hear you closed on this terminal today?  I didn't realize that you had that in the works.  That will put you in quite a powerful position.  If you get this place up and running again it will have significant influence... politically speaking.    We all have our ambitions.  And sometimes we need help to get there... You've come a very long way.  In a very short time.  The most right?  That one makes my head hurt a little.  I hope so.",
        "Deputy": "There have been a series of hijackings of bulk-fuel delivery vehicles.  It has been brought to our attention that it might be beneficial on your end to resolve this issue in a time sensitive way.  So we have prepared an offer for you to review.",
        "Lange": "There have been a series of hijackings of bulk-fuel delivery vehicles.  It has been brought to our attention that it might be beneficial on your end to resolve this issue in a time sensitive way.  So we have prepared an offer for you to review.",
        "Louis": "Whoa, whoa, whoa! Take it easy there.  Okay, man.  Watch it now, man. You're going to hurt someone.  Where are you?  Where is he?  Get the car!  Run for it!  Oh, there he is. Had to be the hero eh?  Couldn't just let us take the truck.  Hey man relax... calm down. Did they see you come in here?  Did they or not?  Alright, there's a door down here about four more flights. Don't go out there, that's the street. Go down about two more flights after that and you'll come out below the bridge. They won't be there.  You're welcome.  Please. Please.  You know I could never tell you that.  This was it anyway. Okay... Okay.  Thank you.",
        "Servidio": "Whoa, whoa, whoa! Take it easy there.  Okay, man.  Watch it now, man. You're going to hurt someone.  Where are you?  Where is he?  Get the car!  Run for it!  Oh, there he is. Had to be the hero eh?  Couldn't just let us take the truck.  Hey man relax... calm down. Did they see you come in here?  Did they or not?  Alright, there's a door down here about four more flights. Don't go out there, that's the street. Go down about two more flights after that and you'll come out below the bridge. They won't be there.  You're welcome.  Please. Please.  You know I could never tell you that.  This was it anyway. Okay... Okay.  Thank you.",
        "Abel": "Ready?  You look very nice.  You sure?  We don't have any more money so what else could I do.    Really?  You've been telling me not to do this for a year.  I'm sorry?  Almost two.  I have been looking over my fence at this property for a very long time.  No... I imagine I want it for the same reason you did.  To grow.  No.  I like to own the things I use.  So.  I understand.  I understand.  It's not ours yet.  There he is.  You have done a beautiful job here.  I mean it. You and your men should be very proud.  Most people don't have anything beautiful like this to show for their day's work. You are a lucky man.  Well I thank you... my family will be very happy here.  Now I think I owe you some money.  It is.  This is the seventeen outstanding. But we are arriving here in four days. It must be done.  Well, I'll let you go.  And the tile in the master bath...  Thank you.  Have they found the truck?  Are you alright?  Have the police been here yet?  Can you speak?  Yes.  Yes.    To you as well.  These fucking guys. This poor kid has been working his ass off.  No...don't talk to him or your father.  It won't.  I'm meeting with the D.A. in the morning.  No we are not.  Well I'm not.  Yes.  I have to get going.  Can we get you anything?  We'll pick you up when they let you out of here.  These men are cowards. Too weak to make a living... or even fight with their own hands, and too stupid to think up anything else to do.  May I take it?  May I take it now?  Yes.  So you guys have done what you needed to?  And what was that?  You just said you've done what you needed to... so what was it that you've done?  Did you fingerprint or anything?  So you've done nothing.  So who's coming?  They stole the $6,000 of fuel that was in it.  My people are at risk just driving around in this city, just trying to do their jobs. And I... I have done everything you have asked of me. It's been two years since you first started investigating my company and I have spent thousands of dollars hiring lawyers for this and that to provide you with every piece of information your office has requested. And I expect that you have been asking the same from my competitors. So with all this information that you have gained... We are just asking if you have any idea who has been doing this to us?  First, please know that we respect the work you are doing to try to help our business and the city. But also know I have never taken anything I haven't earned from anyone so when you say you've...  We are on the same side here.  Well, it makes a difference to me.  Yes.  I understand.  You have your job to do. But know that you are wrong and that we will take advantage of every opportunity to prove that.  I'm sorry?  Yes?  I am always trying to expand my business.  Every new market is a difficult market.  But my driver was assaulted and my truck and oil were stolen in broad daylight in front of fifteen toll collectors and six police officers yesterday. And yet no one saw anything. That is a problem... no?  I'm sure you do.  Exactly.  I know.  The DA... He said he's going to bring down charges on us next week.  We don't know yet.  Right now they are just saying us.  Where are we exposed?  Anna?  Okay.  I'm very sorry this happened. Do you need anything else?  If you do, you call the office... Okay then.  I don't.  You will.  Yes. They took the load.  Seventh... you get some rest.  ABEL comes out of the building and walks towards his car where a group of TOUGH-LOOKING KIDS in their early twenties are sitting, looking to see who is going to come and claim the brand new car. He walks right though them without being overly aggressive but without a hint of being intimidated. He gets in and drives away.  Arnold.  What's that?  We are working on it.  We are, thanks for your concern.  Really? When was that?  It's possible.  Yes.  It is.  Any new market is a tough one. I'll see you.  A toast.  A toast to our new home. It's as beautiful as my wife and daughters and as strong as me... May we be happy, prosperous and safe here. Cheers.  Peter... it's official as of yesterday.  Yes.  That's possible.  He's from Ohio. Played football. I like my drivers to fit in with the neighborhood...  Just picked up a few new accounts over there. Weekend houses of some old clients from in the city.  Right there.  Thank you.  Proud?  It's not set up yet... So I am guessing this isn't good news here on a Sunday night.  That describes many people at this point.  How bad?  Where are we exposed?  A couple places?  Anna... Anna!  As of tomorrow I'll have my new radio hooked up though so you should be able to reach me wherever I am...  Where are we exposed?  What does that mean?  How far?  Anna?  Okay.  Thank you.  Who?  Okay.      Quiet... don't worry. It's nothing.  Quiet. It's nothing. Come down here.  Go. Oh come on. Go.  ABEL comes to the end of the front walk and there is nothing. The dog has now followed him outside and is slowly heading over to a area where a small exterior hallway leads to a side entrance. It is dark. The dog starts barking and going crazy. ABEL slowly heads over to the covered passageway. All hell now breaks lose. A BURGLAR, in all black, comes blasting out of the shadows. The dog tries to bite him as he goes by. ABEL swings his club and hits BURGLAR square on the shoulder but he keeps coming. He knocks ABEL over and runs towards the driveway. ABEL is up and chasing after him faster than we expect.        ABEL comes walking back towards his front door. ANNA is standing with all the lights on and with the dog sitting next to her. She looks at him in shock.   A lot of help you were.     What do you mean, how am I supposed to know who it was?  I don't know.  I think it was just some punk, looking to rip us off.  Ouch! If they had wanted to send a message he could have... and he didn't.  Please. Don't get going on this. We are a big new house. He probably wanted the TV. He didn't have a gun, he had nothing. The alarm will be in on Monday. It was some kid. They aren't coming back.  What you are looking for here is the opening to the burn chamber. Now at this point you have not tipped your hat in anyway. From the minute you walked in the house you should have been working to create an impression of total impartiality. But now...  When this door opens you begin to close. It must always be spotless. If they see you have ever done this before it is over.  Now, you do this and only this... You look down at the cloth and don't say a word... You just keep staring at the cloth and then you slowly just start shaking your head. Very very slowly and small.  Don't look up at them. Just at the cloth.  It means you are close... Then after sitting in silence way longer than is comfortable, you turn. And say \"I'd love to run a few numbers for you. Is there somewhere more comfortable we could sit.\" They will almost always take you to the dining room table and will offer you something. And whatever it is you always take the fancy option.  A tea please.  I'd love a lemonade, thank you.  Because, we are never going to be the cheapest option, so we have to be the best. And they want... no, need... to feel that you want the best too. That's why our trucks are the newest or cleanest, and our drivers are approachable.  I gotta go, but the final point I will make is the hardest one. Once you have done the math and shown them what we can save them over the long haul through proper maintenance, you need them to sign. And the problem is by hiring you that means they are firing someone else. And that's never easy. So to get them over the line you need to close them. So when you show them the number look up at them both... and just stare at them...  You stare longer than you should. Because this is not a joke. You will only keep this job if you close. And that's not funny to you. And I am only interested in this company growing, and when it isn't I don't think it's funny at all. These people work very hard for their money and these other guys are ripping them off, treating them poorly, because they don't know... so when you look them in the eye you have to believe that we are better, and we are, but you will never do anything as hard as staring a person straight in the eye and telling the truth.  Well... it was great to meet you. Welcome and I wish you luck.  Good morning. First off, I picked up Julian yesterday and he is back home and doing much better. And I just wanted to make sure you are all aware that we are doing everything we can to deal with this situation. We are working with law enforcement, and they seem to be closing in on these guys. But, sadly these are the times we are living in and we must rise above them. So, on that front we have these.  These will be in every truck by the end of the week. Much to my wife's concern I spent some serious coin and we now have our own closed channel that shouldn't have any blackout areas. You will always be in contact with us. (a hand goes up in the  We have been in constant contact with the union and they aren't considering any new course of action at this time.  Yes.      ABEL is sitting down at his desk. ANNA comes to the door. She gets his attention and then walks right up to the desk. She puts the handgun down right in front of him.  What is that?  Where did you get it?  Let me see that. I'll take care of this.  I don't know, but I will take care of it.    Let me deal with this.  You are not to tell your father about this.  Do you hear me.  I don't know.  That truck just went out filthy.  How much?  You need to get home and start going through our set of books. How far back are they going?  What is O'Leary doing here?.   Jesus.  How are you Bill?  I would have come to see you.  My guys.  Good. I would love you to help on this. Because I can't have it going on any longer either.  I respectfully disagree.  They are taking shots at me because I am growing, expanding, getting stronger not weaker.  Well, it appears that you can't.  I agree. But these are truck drivers, not soldiers, this will lead to chaos.  No, it won't.  Yes.  It may seem that way... but if you are weak eventually it will show... it always does. And if you want this to all be behind us, help me find out who is doing this. You know a lot of people, and that would be the most help to me.  I'm sure that's true.  Thank you for coming Bill.     I know.  Leo.  Yes.  I know.  I said I wouldn't do it.  What's that?  Are you really serious with this, this is what it's come to, walking around outside like fucking gangsters?  I must?  These men, they work for me. These trucks they drive, the customers they serve. They are here because we built this.  What are you even talking about here?  These men are fucking truck drivers. This is insane. You know who is gonna get it in the end here, me. This comes back to me.  I'm not doing it.  It will be the end of everything I have worked for. If one of these guys shoots somebody it's me they will bring down for it...I'll talk to him... And we need to close this deal. We can't stay like this any longer. We must close on that property... We are so weak right now.  Because I have my entire savings at risk with this deposit. It is everything.  I don't know.  I've thought about it every day for the last five years. This place was sitting over that fence mocking....  I don't know what you mean.  I know what you are asking and no... I never ask myself why I do this. It just feels right... wanting to be bigger feels better. It feels right.  Yes...  ...It is.  Only when necessary.  A lot.  A wine list please.  We've been better... but we are good.  But you should know Arthur that this man has been digging through our industry for over two years looking for anything he can find. And as you know probably better than anyone, having worked with some of our competitors the thought that he would have singled us out is ridiculous. It reeks of everything that is wrong with this city right now. We run a fair and clean business and follow every standard industry practice and I will fight `til my last day to prove that...  But... but...  ...Don't think for a moment that I am going to allow this mess to interfere with our plan to grow. We need to know you are standing by us.  That's a very good question. This property gives us many things... firstly direct access to the river. So I can bring in fuel directly from any provider in the world straight to my tanks, then it has over 10 million gallons of storage capacity, so I can buy in the summers when my price is low and sell to my customers and most importantly some of my competitors when the price is high. I won't just drive trucks anymore... I will control my fate... but the real answer to your question...  ... is that when it feels scary to jump Ian... that is exactly when you must jump... or you risk ending up staying in the same place your whole life... and that I can't do.     Yes. Arthur is a good man.  Of course.  Are you okay?  Jesus.  No.  I know.  Getting the tire iron!      What?  Are you kidding?  Okay then... what is this gun?  Where did you get it?  Do you have a permit?  You must be a bigger fucking idiot than I even thought. You are trying to protect your children? Protect them? Do you have any idea what happens if you get caught using that thing?  You dress yourself up in these fancy clothes, and look at you here in your mansion. I've given you everything you could possibly want but you still can't stop thinking like the Brooklyn corner-store gangster's daughter that you are.  Where is this thing? Let me see it.  Let me see it. Is this going to make you safe?  You know who uses guns like this? Whores!  It's a trap... and you are walking right into it... You need to get that thing out of our house.  That is what I'm doing.  I understand. But as you can see this is a terrible time for us. I am having my daughter's birthday party.  I'm going to kill this guy.  Abel.  Give me five minutes.  Maria. Keep the kids playing for a few minutes.  Bring the last few out.  What's going on out there.  Do we even need to be doing this? What exactly are we hiding here?  Is that the last one. Get back out there.      Hey, how are you?  You'll do great. Remember... When you get them there. Hold the eye contact longer than you would like... but you watch what happens.  Good luck.  It is good to see you back here. You look good.  Are you ready to get back to work?  You are.  Where are you heading?  Manhattan. That's a cakewalk.  Good... Because you are. We all are. Someone came to my house a couple nights ago to rob me...  I tried to chase them away... but really there's nothing I can do. I am vulnerable. We all are. They can come back tonight. But to succeed and be great you must keep going back. And I know what all these guys want to be doing. But it doesn't make you any safer.  And then they will come after me with everything they have... So this is what we do. And the times will get better and safer. They will. So go. You are strong just by going. Stronger in fact.  Peter.  I need to speak with you.  This has gotten out of control... There was a guy with a gun at my house.  My wife and children were home at the time.  Yes. I managed to chase him off.  I need to know who is doing this.  It's one thing to come after my trucks and drivers... and to steal from me... but this... it's different.  Have you ever dealt with anything like this?  I refuse to live my life that way. I won't do it... I am going to ask for a meeting.  Anyone with more than 20k of storage. Can I count on you being there?  Monday.  Hold that... it's not done yet... you may be hearing from me.   Thank you for seeing me. I want more than this...  And you have.  But it's not.  Thank you.  Joanne it's me. What are you talking about... what shots?  I need to make sure you know that we had nothing to do with this. It's not the way I do business. In fact I have been warning my men against doing this sort of thing. It is terrible for me.  Yes.  No... but I'll find him.  Arthur.   Thank you for coming... This is not right.  What can I do?  And you are aware of the position this is putting me in?  I paid off my first loan to you eleven years ago.  Do you remember the term on that loan?  I had seven years to pay you back.  Do you know how long it took me to pay you off?  Six and a half.  I put 40 percent down as a deposit on this. It's all we had.  None of it is true.  May?  It does matter, that you know we didn't do this.  I'll find it.     Yes.  We're looking for him.  Of course not.  No... I'm not... They're out.  The bank.  It means we need to find the money somewhere else.  I'll figure it out.  You are thirteen years old. What are you doing? Your mother asks you an hour ago to help her get out of the house smoothly and you are acting like an...  What? What? What are you talking about?  I'm not sure who the hell you think you are, but you don't talk to me that way... You are in serious danger of becoming a rich little spoiled brat and I can tell you from experience there is nothing worse in the world than a rich little girl who thinks the whole world revolves around her.  First off I don't walk around like I am saving anything. I chose this business because I looked at the world and said `What's the last bill people stop paying every month when they are low on cash?' `Cause that's a business I want to be in. `Cause failure wasn't much of an option for me. I lived in reality... not whatever this world is you are living in. And we help people stay warm... which isn't all that bad.  Maybe you've got grander ambitions but for now this is how you eat, sleep, and get all dressed up... So you better shape the fuck up and NEVER speak to me like this again!  Hey.  How's it coming?  That was a good year.  Well it was for me...how is it?  I got us a three more days... and one piece... from Saul. But we're still about a million short.  First thing.  Probably.  Of course.  You should get to bed.  I love you.  I know.  I know.  Sometimes.  I have always been much more scared of failure than anything else.  It wasn't always like this.  Not today... but by the end of the week... maybe.  Good...  That does not have to be true.  I'm gonna try to get us a little more time.  Thank you for seeing me.  I need more time.  I know our agreement doesn't allow for that. But... I need more time.  Thank you for asking. Many, many reasons.  Yes... it is.  Thank you.  I talked to the Hasid, I got us three days.  I don't know.  Felons can't vote.  This plea has me...  I would never take this.  Who?  Of course he is.  All the drivers could have us on scales. Why?  He would never do that.  Thank you for letting me in.  Have you seen Julian?  We need to find him.  I am worried about him.  You know we were going to support him. I do not know why he ran.  I know.  Yes. Well this time that hasn't worked out.  Do what?  I know. It makes me very sad, because he is a very talented young man. But there are some decisions that you cannot come back from. I need to know where he is. And I need him to turn himself in. His actions are hurting me and my business. And I refuse to let other people's weaknesses hurt me. I don't know how it has come to this, but it has. If he does the right thing I will help to take care of his responsibilities. You and your family. When you see him. Tell him this. Please.  Does he have any money?  Money? Has he taken money out of your bank account?  You need to start looking into these things. It is very important that we find him safely.     I understand why you lied, but it is not smart.  There are other people looking for him. I am as good an option as he has. Know this.  Thank you both for agreeing to meet with me.  I think we have met before but I didn't realize you were Saul's Granddaughter.  I'm sorry to ask but how old are you?  Oh.  Yes.  Yes.  I understand. And I hope that your Grandfather was able to communicate to you how much I have always respected him. And it was only out of respect for the business he had built, and because I knew of his reservations and feelings about your uncles and your father that I made those offers.  But, I am not here to offer to buy your company.  As I'm sure you will soon learn some years are good... others not so. I am in contract with a significant hard deposit at risk to purchase the old Bayfront terminal.  And due to circumstances beyond my control my bank has left me at the altar.  So, I am here, hat in hand, looking for a loan. I certainly expect the terms to be in your favor as I could not be at a weaker place. But, if your Grandfather trusted you with his company, I would be willing to trust you as my lien holder.  I need $500,000.  Of course.  Okay. Thank you.  Tonight? Oh yes, of course.  Stop...  Peter... thank you... That may be true.  But over the last six months 110,000 gallons of fuel has been stolen from my family and I. Now the reason we asked Bill to get you all here is because the people in this room are the only people within two hundred miles of here who have the ability to purchase and store that kind of quantity. So... no matter what bullshit you have been telling each other one of you... or two... or three... has been allowing this to happen by buying this from these cowards or worse yet hiring these guys just to do it. And profiting from it. So what I am saying is... Stop! Now. Have some pride in what you do and stop.  Hey.  How's it coming?  That was a good year.  Well it was for me...how is it?  I got us a three more days... and one piece... from Saul. But we're still about a million short.  First thing.  Probably.  How are the girls? I feel like I haven't seen them in days.  Of course.  I know.  We should get to bed.  I love you.  ABEL is driving towards the office and is listening to the idle chatter on the radio between the dispatcher and the drivers who are out. They are underneath the Brooklyn Queens Expressway in stop and go traffic. Suddenly a panic stricken VOICE blasts through on the radio.  Your friend is dead... who do you work for.  Stop... just stop.  Jimmy, can you give me a minute?  Thank you.  I've just come to collect that check you owe me.  The one for $213,000.  That's how much has been taken from me over the last six months.  Your Far Rockaway facility bought a load of fuel last week off one of my stolen trucks.  I was standing on top of one of my hi-jacked trucks a couple weeks ago thinking about the cowards who did this when I remembered I had bought the load of fuel off a friend's tanker straight from Texas. As I'm sure you know Texas #4 is marked. But that was just one load, so every truck that has left my lot for the last two weeks has been marked with dye that I've put in... And luckily four more of my trucks got jacked since.... My guess is there are at least 4600 gallons of marked fuel in your small tank right now.  I said...213,000.  Okay.  My goal was to have you out of business by the end of next year. And if you're this fucking desperate it doesn't seem like it will even take that long.  I don't care.  When you find out who else it was you can get them to pay you back the difference. Kinda makes you miss having your father around? But I need the whole lot tomorrow or the feds will be at your doorstep by noon.  You look good out there.  I didn't either... I didn't mean to take you away.  Of course. You've grown.  I know... but you have.  The girls at this place... they are so beautiful?  I don't know how you get anything done around here.  I'm in a bit of a rough patch.  It happens.  Good...  That will be your burden...  Not having had one.  I need your signature on this.  I need to take out a short term mortgage on our apartment building.  210.  I'm up against it a bit. It will be fine.  Thank you... It's good to see your face.  I love you too.  Yes.  I am.  The one guy didn't make it out of the crash, and the other guy disappeared.  Thank you. And thanks for seeing me.  I need a loan.  No shit... but I'm here.  Six hundred thousand.  Yes... but if I don't get it...  The terminal.  You'll get your money.  I know that.  ABEL comes in as ANNA is sitting at the table smoking. He walks over and sits down at the table with her. She gives him a great sly smile.  Yeah.  Yes.  Yeah.  He seemed good... But the girls up at that place are...  I can tell you the girls didn't look like that where I went to school...  How are we here?  Yeah.  We can probably pull it off. Three different parties... it'll be a mess... and the terms... Peter suddenly showed me his true colors.  I spent my whole life trying not to become a gangster...  ...And now... on the biggest deal in my career they will all control me.  What is this?  Whose?  How much is in it?  What does that mean?  Where did it come from?  Where did it come from?  What do you expect me to do with this?  Is it clean?  It means if you walked into the office of the people who have been trying to put us in jail right now and slapped a check from that account down on their desk would it push me further into hell or help to get me out?  That's a fucking bullshit answer.  Well it sounds like you should take this money and keep it right where it is... because I'm going to pretend that we never had this conversation. And you can use that when they drag me off to jail!  I'll get it done. And it won't be as a cheat.  You stole from me!  We'll use the money... your money. It's the smart play.  I know...  I guess there is still some fuel in two of the tanks... they gave us a fair price on it.  To you too. Did you know...about the money?  You should have told me.  No.  I did.  I thought you said you threw that into the river?  I see that.  Nowhere easy.  It wasn't meant to be.  I know what you wanted. But you need to forget that. You are looking backward. Only look forward, that is what you can control.  Yes.  No.  Julian.  I will.  We call the police.  Yes!  I did.  Yeah. For a while I thought he was... it's just...  You really do have to be lucky.  I was right there... I couldn't help myself.  Have you found the driver?  You'll find him.  Well, thank you for coming. I wanted to make sure this was handled correctly.  I'm not sure how I got here.  So... I should tell you that I won't be able to take that deal you offered. There is no way I would ever accept a felony charge for anything we've done.  I am not a felon.  But I also can't have you digging around my life and keeping this hanging around my neck for the next ten years. I love fighting a good battle but this... it's very bad for my business.  So, we need to come to some sort of conclusion.  Good.  It looks that way.  For a very long time.  Within my business it has that potential.  Yes.  Yes, I have.  It doesn't feel that way... But please know that I have always chosen the path that was the most right.  Yes.  The result is never in question for me. Just what path do I take to get there. And I have never questioned my path. There is always one that is most right. And that is what this is."
    },
    "imdb_rating": "7.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjE4OTY4ODg3Ml5BMl5BanBnXkFtZTgwMTI1MTg1MzE@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "A crime drama set in New York City during the winter of 1981--statistically one of the most violent years in the city's history--and centered on the lives of an immigrant and his family trying to expand their business and capitalize on opportunities as the rampant violence, decay, and corruption of the day drag them in and threaten to destroy all they have built.Production",
    "name": "A Most Violent Year",
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ]
}