{
    "filename": "A-Scanner-Darkly_script.txt",
    "imdb_id": "tt0405296",
    "imdb_url": "https://www.imdb.com/title/tt0405296",
    "characters": [
        "Additional Hank Scramble Suit Voice (voice)",
        "Arctor's Daughter #1",
        "Donna Hawthorne",
        "Cop",
        "Additional Fred Scramble Suit Voice (voice)",
        "Voice from Headquarters (voice)",
        "Bob Arctor",
        "Brown Bear Lodge Host",
        "James Barris",
        "Waitress (as Natasha Valdez)",
        "Ernie Luckman",
        "Medical Deputy #1",
        "Arctor's Daughter #2",
        "Charles Freck",
        "Medical Deputy #2"
    ],
    "dialogues": {
        "Donna": "No. Get lost.  I thought you were going to knock me down and bang me.  I thought you might pull me into a doorway or something.  Well, I didn't recognize you.    I'm sort of nearsighted.  You'll bang me in the car.  That's a neat-o line, but I've heard it before. Everybody bangs me. At least they try to. That's what it's like to be a chick.  I'm suing one guy right now for molestation and assault. We're asking punitive damages in excess of forty thousand.  A hand around my boob.  I can get it.  Sixty dollars a hundred.  They're super good. Take my word.  Cool.     How do I get in touch?  V. Freck?  I think I remember you now.  I better not. Jerry thinks I contaminated him originally with those bugs.  Yeah, well, then he didn't know what they were.  Hello?    Eh. I was bumtripped this a.m. by my boss. This gray hair bilked us out of ten bucks. So my boss says it's coming out of my paycheck!    Yeah, okay. I'll come over tonight. Hey, I have this book I want to show you. About wolves.  You know what the male wolf does when he defeats a foe? He doesn't snuff him. He pees on him! Then he splits.  No kidding?    How come?  Not the usual way?  You can tell me, even if it's super gross. You have to be super gross with biker-types.    Oh. Okay, well I get it. Barf. Oh, I forgot to tell you, your roommates, Ernie What's-His-Name and Barris, came into the shop today looking for you.  I dunno. They said they wanted to use your cephalochromoscope and it didn't work. So Barris took it apart --  And apparently it's been sabotaged. The wires cut, and sort of weird stuff like that. Barris said he'd --  You gotta what?  Hey, I came in, like the note said.   I waited for you for awhile, then I crashed. Why are you guys yelling?  Of course. Otherwise I can't sleep. You shouldn't leave your place unlocked like that. You could get ripped off and it would be your own fault. That's the main reason I came in when I saw the note. Somebody ought to be here if the place is unlocked with a note on it.  Approximately thirty-eight minutes. Hey, Bob, I got that wolf book, if you want to see it. It's got a lot of heavy shit in it.  Did you say you were selling the house? Or was that me dreaming?    Did I scare you? Heh heh.  I have your stuff.  Your Death.  Do you have the money?  I need the money right now.  I don't like Barris, and I don't trust him. He's crazy. And you're crazy when you're around him. You're crazy right now.  Yeah.  Hey, you wanna take me to a concert at Anaheim Stadium next weekend?  I'm gonna bring some really oily hash and get really loaded. But you have to wear something neat, not those funky clothes you sometimes wear.  I'm taking us to my place. And you do have the money and you'll give it to me. Then we'll drop a few of the tabs and kick back. Maybe you could buy a fifth of Southern Comfort and we could get bombed as well.  You know what would be cool tonight, is to go to the Torrance Drive-in. They're showing all eleven Planet of the Apes movies. From 7:30 to 8:00 tomorrow morning.  I haven't seen all the Ape movies in years. And the last one for longer than that, the one where they reveal  all the famous guys in history, like Nero and Lincoln, were secretly apes...   It's dark. The door unlocks, light from the hall spills in. Donna enters, flips on the light. There's a trail of newspapers on the floor.   Stay on the newspaper. I just had the rug shampooed.  Someday I'm gonna get married and I'm going to need all this stuff. When you get married, you need everything there is.    Buy?   What do you mean \"buy\"?  I think I see what you're saying.  No.     It's a form of barter.  You protect me? What are you talking about?  The Coca-Cola company is a capitalist monopoly. No one else can make it but them. That's fucking wrong. C'mere, I'll supercharge you.  Yeah, I can dig it, you being in love with me.   Donna and Arctor are stoned on the couch in the dim room.   Dripping little things. Moving along about a foot above the ground.  Drippy.    Behind furniture.  Yes. Little spring flowers. With yellow in them. That first come up.  Yes. Before anyone stomps on them and they're gone.  No more.  Nothing.  No, you're too ugly.  No! Look, I snort a lot of coke; I have to be super careful because I snort a lot of coke.  Just leave my body alone.     You don't have your car. I'll drive you, man. But you can see why I have to protect my snatch --    I'm dreadfully sorry I hurt your feelings. Okay? I was out of it.  Sometimes I get really spaced. You wanna come back? Or what? You wanna go to the drive-in? What about the Southern Comfort? C'mon, I'm sorry.  That sure is good hash though, huh?  You know what I'm going to do someday, Bob? I'm going to move north to Oregon and live in the snow. Have a little house and a vegetable garden.      It's in the cards.     Donna drives a sick Bob Arctor along a tree-lined road.   Before we go to New-Path, Bob, I thought maybe we'd drive into the hills, y'know, look at the city lights.  Let's sit a few minutes.  C'mon, let's get off the road a little bit. In case of cops.  Here.  I guess we never know what's in store for us.  Did you know this dude Tony Amsterdam?  After he saw God, he felt really good, for around a year. Then he felt worse than he had ever felt before in his life. Because one day it came to him, he was never going to see God again. He was going to live out the rest of his life, fifty years maybe, and see nothing but what he had always seen. He realized he was going to have to live on and on with no purpose. Just a lump of flesh grinding along, eating, drinking, working, sleeping, crapping --  That's what I told   him. We're all in the same boat, and   it doesn't freak us out. But he said,    \"You don't know what I saw.\"  Spars. Showers of colored sparks. In the air. Going up the wall. Wherever he looked. The whole world  was a living creature. And there were no accidents. Everything fitted together to achieve something, some goal in the future. And there was a doorway. For a week he saw it wherever he looked. Always the same proportions, very narrow. Very pleasing. That's the word he used. He never entered it though. Just looked at it, surrounded by red and gold light, like the sparks had collected into lines. Then he never saw it again his whole, entire life.  He said it was always nighttime. Moonlight and water. Nothing ever changed. Water like blank ink and a beach. He was sure it was ancient Greece, that the door was a weak link in time. Later when he couldn't see it anymore, he became so frustrated with the noise and lights and motion in this world. He'd tell everyone he met that he lost everything.  There was a woman on the island. More like a statue. Of the Cyrenaican Aphrodite. In the moonlight. Pale and cold.  He didn't have the chance, Bob. It was a promise. Something to come. Something better a long time in the future. They show us trailers now. So we'll hold out.  You're a good man. You've been dealt a bad blow. But life isn't over for you. I care for you a lot. I wish...  You're a good and kind person. And this is unfair, but it has to be this way. Try to wait for the end. Sometime, a long time from now, you'll see the way you saw before.  Keep your voice down.  Just fucking take off.  Bob?   We've got to get started.  C'mon, they're expecting us.   I have to sign you in.    It's a person.  It's easy to win. Anybody can win.   Donna drives her tiny MG on the freeway in heavy traffic behind a huge Coca Cola truck. She picks a tape from the show box in the back. It's Carole King's Tapestry. She plugs it in and cranks it up loud, then pulls a pistol out from under the dashboard. She unrolls the window, sticks the pistol out, and begins firing at the Coke truck. She hits it several times before the clip is emptied. Broken Coke bottle glasses and brown liquid splatter her windshield. This soothes her for a moment, but misery builds up in her again almost instantly. To relieve it, she floors it and smashes into the truck with all her might. The impact spins the MG around. Tires shriek against fender as her car comes to rest on the shoulder facing against traffic. Water pours from her radiator. Her headlights dim. Donna gets out of the car and looks at the Coke truck. It is still grinding along, seemingly untouched. Motorists gape at Donna as they crawl by. One guy unrolls his window.   So are they paranoid about him?  Well, then, will he be able to act, when the time comes? Is anything left?  It was very well drilled into him. Such a price to pay. The government asks an awful lot.     Oh, I'm warm on the outside. Warm face, warm eyes, warm fucking fake smile. But inside I'm cold all the time. I am full of lies. I am awful.",
        "Hawthorne": "No. Get lost.  I thought you were going to knock me down and bang me.  I thought you might pull me into a doorway or something.  Well, I didn't recognize you.    I'm sort of nearsighted.  You'll bang me in the car.  That's a neat-o line, but I've heard it before. Everybody bangs me. At least they try to. That's what it's like to be a chick.  I'm suing one guy right now for molestation and assault. We're asking punitive damages in excess of forty thousand.  A hand around my boob.  I can get it.  Sixty dollars a hundred.  They're super good. Take my word.  Cool.     How do I get in touch?  V. Freck?  I think I remember you now.  I better not. Jerry thinks I contaminated him originally with those bugs.  Yeah, well, then he didn't know what they were.  Hello?    Eh. I was bumtripped this a.m. by my boss. This gray hair bilked us out of ten bucks. So my boss says it's coming out of my paycheck!    Yeah, okay. I'll come over tonight. Hey, I have this book I want to show you. About wolves.  You know what the male wolf does when he defeats a foe? He doesn't snuff him. He pees on him! Then he splits.  No kidding?    How come?  Not the usual way?  You can tell me, even if it's super gross. You have to be super gross with biker-types.    Oh. Okay, well I get it. Barf. Oh, I forgot to tell you, your roommates, Ernie What's-His-Name and Barris, came into the shop today looking for you.  I dunno. They said they wanted to use your cephalochromoscope and it didn't work. So Barris took it apart --  And apparently it's been sabotaged. The wires cut, and sort of weird stuff like that. Barris said he'd --  You gotta what?  Hey, I came in, like the note said.   I waited for you for awhile, then I crashed. Why are you guys yelling?  Of course. Otherwise I can't sleep. You shouldn't leave your place unlocked like that. You could get ripped off and it would be your own fault. That's the main reason I came in when I saw the note. Somebody ought to be here if the place is unlocked with a note on it.  Approximately thirty-eight minutes. Hey, Bob, I got that wolf book, if you want to see it. It's got a lot of heavy shit in it.  Did you say you were selling the house? Or was that me dreaming?  Did I scare you? Heh heh.  I have your stuff.  Your Death.  Do you have the money?  I need the money right now.  I don't like Barris, and I don't trust him. He's crazy. And you're crazy when you're around him. You're crazy right now.  Yeah.  Hey, you wanna take me to a concert at Anaheim Stadium next weekend?  I'm gonna bring some really oily hash and get really loaded. But you have to wear something neat, not those funky clothes you sometimes wear.  I'm taking us to my place. And you do have the money and you'll give it to me. Then we'll drop a few of the tabs and kick back. Maybe you could buy a fifth of Southern Comfort and we could get bombed as well.  You know what would be cool tonight, is to go to the Torrance Drive-in. They're showing all eleven Planet of the Apes movies. From 7:30 to 8:00 tomorrow morning.  I haven't seen all the Ape movies in years. And the last one for longer than that, the one where they reveal  all the famous guys in history, like Nero and Lincoln, were secretly apes...  Stay on the newspaper. I just had the rug shampooed.  Someday I'm gonna get married and I'm going to need all this stuff. When you get married, you need everything there is.  Buy?   What do you mean \"buy\"?  I think I see what you're saying.  No.     It's a form of barter.  You protect me? What are you talking about?  The Coca-Cola company is a capitalist monopoly. No one else can make it but them. That's fucking wrong. C'mere, I'll supercharge you.  Yeah, I can dig it, you being in love with me.  Dripping little things. Moving along about a foot above the ground.  Drippy.    Behind furniture.  Yes. Little spring flowers. With yellow in them. That first come up.  Yes. Before anyone stomps on them and they're gone.  No more.  Nothing.  No, you're too ugly.  No! Look, I snort a lot of coke; I have to be super careful because I snort a lot of coke.  Just leave my body alone.     You don't have your car. I'll drive you, man. But you can see why I have to protect my snatch --    I'm dreadfully sorry I hurt your feelings. Okay? I was out of it.  Sometimes I get really spaced. You wanna come back? Or what? You wanna go to the drive-in? What about the Southern Comfort? C'mon, I'm sorry.  That sure is good hash though, huh?  You know what I'm going to do someday, Bob? I'm going to move north to Oregon and live in the snow. Have a little house and a vegetable garden.      It's in the cards.    Before we go to New-Path, Bob, I thought maybe we'd drive into the hills, y'know, look at the city lights.  Let's sit a few minutes.  C'mon, let's get off the road a little bit. In case of cops.  Here.  I guess we never know what's in store for us.  Did you know this dude Tony Amsterdam?  After he saw God, he felt really good, for around a year. Then he felt worse than he had ever felt before in his life. Because one day it came to him, he was never going to see God again. He was going to live out the rest of his life, fifty years maybe, and see nothing but what he had always seen. He realized he was going to have to live on and on with no purpose. Just a lump of flesh grinding along, eating, drinking, working, sleeping, crapping --  That's what I told   him. We're all in the same boat, and   it doesn't freak us out. But he said,    \"You don't know what I saw.\"  Spars. Showers of colored sparks. In the air. Going up the wall. Wherever he looked. The whole world  was a living creature. And there were no accidents. Everything fitted together to achieve something, some goal in the future. And there was a doorway. For a week he saw it wherever he looked. Always the same proportions, very narrow. Very pleasing. That's the word he used. He never entered it though. Just looked at it, surrounded by red and gold light, like the sparks had collected into lines. Then he never saw it again his whole, entire life.  He said it was always nighttime. Moonlight and water. Nothing ever changed. Water like blank ink and a beach. He was sure it was ancient Greece, that the door was a weak link in time. Later when he couldn't see it anymore, he became so frustrated with the noise and lights and motion in this world. He'd tell everyone he met that he lost everything.  There was a woman on the island. More like a statue. Of the Cyrenaican Aphrodite. In the moonlight. Pale and cold.  He didn't have the chance, Bob. It was a promise. Something to come. Something better a long time in the future. They show us trailers now. So we'll hold out.  You're a good man. You've been dealt a bad blow. But life isn't over for you. I care for you a lot. I wish...  You're a good and kind person. And this is unfair, but it has to be this way. Try to wait for the end. Sometime, a long time from now, you'll see the way you saw before.  Keep your voice down.  Just fucking take off.  Bob?   We've got to get started.  C'mon, they're expecting us.   I have to sign you in.    It's a person.  It's easy to win. Anybody can win.  So are they paranoid about him?  Well, then, will he be able to act, when the time comes? Is anything left?  It was very well drilled into him. Such a price to pay. The government asks an awful lot.     Oh, I'm warm on the outside. Warm face, warm eyes, warm fucking fake smile. But inside I'm cold all the time. I am full of lies. I am awful.",
        "Cop": "Would you stand, you first, miss, and show me your identification, please?  You're a fed?  I'm sorry.",
        "Bob": "Lately, Jerry Fabin stands all day shaking bugs from his hair. The doctor says there are no bugs in his hair.    What I fear, is that our children, your children and my children...  ... I have two. Little ones.  But not too little to be addicted...  ... calculatedly addicted, for profit, by those who would destroy this society. We do not yet know who these animals are who pray on our young, but one day we will.  Well, it isn't the profits anyhow. It's something else... what you see ...  If you were a diabetic, and you didn't have the money for insulin, would you steal to get the money? Or just die?           Just this. Don't kick their asses after they're on it. Half of them, especially the girls, didn't know they were getting on anything at all. See, the pushers dissolve some reds in a glass of wine, they give the booze to an underage little chick, she passes out, then they inject her with a mex hit -- half heroin, half Substance D. Thank you.  Fucking McDonaldburger's is taking over.  Donna.   How you doin'? It's Bob.  How's your head today, man?  Hey, can I get anything from you?  Ten.   Just ten.  Oh, wow.  I peed on some people today.  Metaphorically peed, I mean.  What I mean is, I told this group of...  ... biker-types, at the Foster's Freeze. I was cruising around and they said something raunchy, so I turned and said something like --  I told 'em I'd rather ride a pig than a hog.  Well, a pig is a chick that --  They didn't try me at my job, did they?  The hell you say --  Fuck Barris! That cephscope cost me nine hundred dollars. I need to get home right now. But I gotta... Oh, fuck, man. Fuck fuck fuck Barris!  I gotta run an errand and like that.   Arctor parks across from the New-Path Drug Rehab Facility, a converted wood frame house. He checks the police photo of Erroll Weeks, a.k.a Spade Weeks, shoves it into his glove compartment, and heads, business-like, toward the building.   The S.O. believes Spade   Weeks has lost himself inside New-Path   by posing as a junky. New-Path strips    junkies of all  i.d. and gives them new names as part of personality rebuilding process. It's a perfect hiding place.  I'm in a bad place. I wanna turn myself in for treatment.  This place is the only hope I could think of. I had a friend come in here. A black dude, in his thirties --  I am bad off.  Okay, but listen, this black guy, my buddy, goes by the name of Spade, did he make it here? I sure hope he didn't get picked up by the pigs on the way over.   It's a mess. Freck is on the couch smoking a joint. A cat sleeps in his lap. Another cat and a dog lie on either side of him. A disassembled cephscope is on the coffee table, wires exposed. Barris hovers over the dining room table where he has set up a makeshift chemistry lab.      Bob Arctor? He's not doing anything much. Working at his nowhere Blue Chip Stamp job, dropping a few tabs of meth cut with Death during the day.  What do you mean?  Fine. So I assume this means you'll be bugging Arctor's house and car?   The yard, lit only by moonlight, is overgrown with weeds and littered with rubbish. Barris sits on a cracked cement patio fiddling with some sort of foam rubber and aluminum foil tube. Freck looks on anxiously. Ernie Luckman, a big stoner in a football jersey, sits on a decrepit swing set, looks up at the moon, and sips a beer.    Arctor jerks awake and reflexively grabs his gun from under his pillow. Confused, heart pounding, he tries to take in his surroundings. Dogs bark outside.       Arctor trudges through the pig-sty living room, past the ratty couch, the broken cephscope, the crooked pictures on the wall. He disappears into the kitchen.    It's the same room, but different. It's neat. The pictures on the wall are straight. A younger, cleaner, straighter Bob Arctor sits on the couch watching tv with his wife and children. Through shadow and obstruction, we never get a clear view of Arctor's family.       The catchy, reduntant Coke jingle continues in the background throughout. Bob Arctor squats down and reaches into a floor level cabinet to grab a popcorn popper. When he rises, he hits his head hard on a sharp corner. His countenance changes dramatically, violently.     That pain, so unexpected, so undeserved, cleared away the cobwebs in my head. I didn't hate the popcorn popper, I hated my wife and kids.   I hated my backyard,...  ... my front yard,...  ... my power mower.  All the elements that made up my life were right there. And nothing new would ever happen. Like a little plastic boat that would sail on forever, without incident, until it finally sank, which would be a secret relief to all.  So I ended that life and started this one. Now I dwell in a ugly world...  Now I dwell in an ugly... disordered world. But this very disorder... permits... the... unpredictable to --  Yeah?  Come in, Barris.  Why the fuck would I screw up my own cephscope?  You did it?  Oh, Jesus, Barris. Go fuck yourself.  How about, you're a fucked-up lunatic?  Get lost.   Arctor, Barris, and Luckman emerge from the house, bedraggled and bleary-eyed, and climb into Arctor's car.     You guys track down Andy and the hot scope. I'll pick you up in two hours.  Dropping in on a friend.  While in Long Beach today I checked in on Kim, an addict acquaintance who lives with dealer Dan Blake. My intention was to get the latest on Blake, but also to strand Barris and Luckman down here long enough for the scanners to be installed.  It's me, Kimberly. Bob Arctor.  Are you alone?  He beat you up?  Do you want him back?  How long can you go without?  Can't you get it anywhere else? Y'know the name of Dan's supplier? Maybe you could deal directly.  Yeah.  You should call the police.  Kim, he'll kill you.  Tires aren't...  That's what he wants you to do.    Dog shit. All that misery and that's what really upset them.  Shouldn't this locking ring hold the nut in place?  For a second I couldn't figure it out.    Put the fucking snuffbox away!    It's an illusion, right? There's no dog shit smell. How could there be dog shit in the eng...     Dog shit!   Fuck! It is dog shit!  What, Jim?   What'd you say?    You goddamn Barris! I know you did it, screwed over the cephscope and now my car! You kinky freak mother bastard!  I know it's him, man. I know.   Yeah, I hope.  What kind of surprise? It's my house, Jim, you can't start rigging up --  Well, what is it?  You should've told me.  Well, they're not going to expect it to be unlocked, so they'll go in the window.  You're jiving me.  We'll see when we get back. If there's a note on the door and it's unlocked, we'll know he's not jiving us.  So what did you write on the note, Jim?   The car pulls up to the house. The three guys get out. A piece of paper is tacked to the door. It reads: \"Donna come on inside; door's unlocked. We've gone to Long Beach for the day to purchase a stolen cephscope.\"   Jesus, Barris.   Barris studies the room.   Strange how, now and then, paranoia can link up with reality.  My God, who was here?  What raid?  Did you forget about the recorder, Jim?  Forget to turn it on, did you?  Sell the house?  What reason should we give for selling?  We'll just flat out say there's narcotics planted all over the place and since we don't know where, we decided to move out and let the new owner get busted instead of us.  I say we tell them the truth. In fact, we can put an ad in the Times: \"Modern, three bedroom tract house, two bathrooms for easy flushing, with high grade dope stashed in all rooms.\" It's a selling point.    Did you smoke a joint? Before you crashed?  How long have you been here?  Shit, I hope it was you dreaming.   Arctor and Barris, in greasy clothes, are in the driveway working on Arctor's car. Freck pulls up, gets out of his car and approaches.    How much you pay, Freck?  Jim could've gotten it for you cheaper.  Where's it located, Freck?    Why is it bent?    About a thousand pounds.  That's a thousand pounds with passengers, a full tank of gas, and a carton of bricks in the trunk.  Twelve.  No. Eleven in the back and the driver alone up front. The extra weight is in the back so it doesn't fishtail.  Unless you get eleven people in back.  What is that, Luckman?  To fix the engine. What else?  The most dangerous kind of person is one who's afraid of his own shadow.  I'll cruise the streets until I come across an Olds, then unbolt the carb. Like everyone else I know.  The scanners will have miles of this tripped-out garbage. But it's not the stuff that happens while I'm here that matters. It's what goes on while I'm gone. So I'll split. Then I'll see what these three clowns are up to.  What if I see some awful truth about the people I care about on these tapes? What if I see Donna climbing in the window and ripping me off, or destroying my stuff? Or some weird, nightmarish world beyond the mirror...  I'm going out to score some beans. Luckman, is your Falcon running?  Barris?  I'll walk.  Forget it. If I tried to drive your car, I'd press the wrong button and float up over the greater L.A. area.  I just did a freaky number, not like a fantasy trip, but... So I'm kinda --  My stuff?  Fucking Barris. You know how he kills you? He doesn't. He waits until a situation arises where you die, and he just sits there. In fact he sets you up to die. I don't know how exactl --  What?  Sure.   Yeah.  I am?  Donna, I know I can count on you to tell me if I'm getting weird or crazy or like that. Okay?  Right on.     Yeah. That sounds --  I'll wear whatever you say.  Oh, wow.   That sounds good.  Can a drive-in show movies in the morning?  Do you ever throw anything away?  How much of what you've got did you buy and how much did you steal?  Like when you buy dope. Like a dope deal. When I mean by \"buy\" is an extension into the greater world of business transactions of what we have present now, with us, as dope deals.  Like when you rip off those Coca-Cola truck you tailgate. That's stealing.  Donna, look, you're gonna get caught, and if you got drugs in your car when they catch you, there's nothing I can do to protect you then.  Nothing.     I just... Please take care.  Okay, cool.  I love you, Donna.  Hey, Donna, man, do you like cats?  No.   On the ground.  Little spring flowers, then?  Before.    Before anyone.  Yeah. You know me exactly, Donna. You can read me. No one knows me but you.  What's wrong?  Donna, can I put my arm around you.   I want to hold you, okay?  What?  Ugly?   Fuck you, Donna.    I'm taking off.  You're too stoned to drive and you never let anyone else drive that little roller skate of yours.    Okay.  You'll have to save up for that.  Who?  You sure this'll happen?  Hey, man, can I go with you? To Oregon? When you do take off finally?  Here you go.  Two of them do.  I try not to be. That's why I've arranged this transaction with you.    Fuck off, Barris.  Where's Luckman?  My axle jack?  Either you pay up your back rent or get to work fixing my godamn cephscope!  Barris portraying Arctor as coming off heroin.  What?  Barris up to something: pretending to be me... writing rubber checks on my account... representing me as a heroin addict. BUT WHAT IS HE UP TO?  Hi, I'm here...  ... to pay for a check of mine the bank returned. It's twenty dollars.  Yes, I am Mr. Arctor. Nobody else is.  I'm sorry about this, but by mistake I wrote the check on a closed account.  Also, I'd appreciate if you'd tell your husband --  I'd appreciate if you'd tell your brother that I was distraught when he called and I apologize for that, too.  Any extra charge?  I was distraught because a friend of mine had just passed-on suddenly.  He choked to death alone, in his room, on a piece of meat. No one heard him.  Yes. That's true. Thanks.      And thanks about the check.  Yes.     He was the best friend I had.  Thank you. And thank Mr. Englesohn for me. Thank you both so much.  Okay then, thank you.  A perfect forgery. Barris has my handwriting down. How many checks has he written on my account? Evil genius bastard.  What if I, Bob Arctor, wrote this check myself and just don't remember?  I'm sorry to bother you again, ma'am, but I was just wondering what address do you have for that service call?  Yeah, I lost my ignition key. 34881 Main Street, Santa Ana...  So, Arctor's the forger, not Barris! Not deliberately, but because his brain is slushed on dope. All their brains are...  ... slushed and mutually interacting in a slushed way.  But what is Arctor up to? Clearly the Sheriff's Office has some good reasons to focus their investigation on him. No doubt reasons I know nothing about. My job is to report, theirs to evaluate.  Fucking waste of a perfectly good house. A family could live here, for Christ's sake. Oughta take it away from this fuck.    What does a scanner see? Does it see into the head? Into the heart? Does it see into me clearly or darkly? I hope clearly, because I can't any longer. I see only murk inside and out.  Any given man sees only a tiny portion of the total truth, and...  Any given man sees only a tiny portion of Weh! steck' ich in dem Kerker noch? Verfluchtes the total truth, and very often, in fact almost perpetually dumpfes Mauerloch...  Wo selbst das liebe Himmelschlicht he deliberately deceives trub durch gemalte Scheiben bricht!    I drove by the Maylar Microdot Corporation building.  One of the employees had evidently tracked the inventory out on the heel of his shoe. So they were all in the parking lot with many little magnifying glasses.  They had a reward, but they lost that, too. It was a little tiny penny.  About an inch high.  They have a really big sign.  Oh, just tell me.  That's a decent idea.  Right.  You put a solar battery in it, it could keep walking for years. Forever.  Imagine an Eskimo village. And this six foot block of hash worth... What would it be worth?  More. Two billion. So these Eskimos are chewing hides when this six foot block of hash comes walking through the snow saying, \"No, I don't\" over and over again.  Legends would spring up.  But, see, legends build. So in a few centuries it would be, \"In my forefathers' time, a ninety foot high block of extremely good quality  Afghanistan hash worth eight trillion dollars came at us dripping fire and screaming, \"Die, Eskimo dogs!\" And we fought and fought with it and finally killed it with our spears.  Kids never believe anything anymore.  He got away with it? Never got caught?  It's like asking what an imposter looks like. I asked a hash dealer who'd been busted once what the nark who busted him looked like --  More so. The dealer dude told me the nark had longer hair than we do. I guess the moral is, stay away from guys who look like us.  How could a guy do that is what I want to know, pose as a nark?  Shit, I'm spaced. Pose as a nark.  My brains are scrambled today.      I better go crash.   Arctor is finishing up mowing the lawn. He is intently focused on the task, but has done an erratic job: the left side of the yard has been left almost completely unmowed. Arctor turns to enter the house. We see that the left side of his face is completely unshaved.     Just... like... the... rest... of us.  Did... he say what it was like?  What was on the other side?  I've lost everything.  He should've gone through while he had the chance. You only get one chance.  That's what you're trying to do. With me now. Show me a trailer. So I'll hold out.  I can't make love. My thing's disappeared. I'm sorry. I'm so sorry.  But what'll I do if my thing's disappeared? Will they still take me?  Okay.  Okay.  I am an eye. I am dead. I can only look at what is front of me.  Yes.  Okay.  Won't it wash off?  Thelma.  Don't you live here?  Bruce.  Are you leaving here?  Semi-rotten vegetables.  For now we see through a glass, darkly; but then face to face: now I know in part...  ...but then shall I know even as also I am known.  I can't do that.    How long has Donna been here?    Can I work with animals. I like animals. Can I work with them?  I want to work with something living.    Okay.  Is this Jerry Fabin?! Is this Jerry Fabin?!  My name is Bruce.  Okay.  I think I'll like it better here.  I like mountains.  I like air.  Will I be seeing my friends?  Mike and Thelma and Donna and Jerry Fabin and Luckman and Barris and --  They had us memorize that as part of the New-Path creed.  Thanksgiving.  Mountains, Bruce, mountains.  Echolalalia, Bruce, echolalalia.  Why not for me?  Gone.     The flowers of spring are gone.  I saw.  A present for my friends. My friends who I'll see soon.   At Thanksgiving.",
        "Arctor": "Lately, Jerry Fabin stands all day shaking bugs from his hair. The doctor says there are no bugs in his hair.    What I fear, is that our children, your children and my children...  ... I have two. Little ones.   But not too little to be addicted...  ... calculatedly addicted, for profit, by those who would destroy this society. We do not yet know who these animals are who pray on our young, but one day we will.  Well, it isn't the profits anyhow. It's something else... what you see ...  If you were a diabetic, and you didn't have the money for insulin, would you steal to get the money? Or just die?           Just this. Don't kick their asses after they're on it. Half of them, especially the girls, didn't know they were getting on anything at all. See, the pushers dissolve some reds in a glass of wine, they give the booze to an underage little chick, she passes out, then they inject her with a mex hit -- half heroin, half Substance D. Thank you.  Fucking McDonaldburger's is taking over.  Donna.   How you doin'? It's Bob.  How's your head today, man?  Hey, can I get anything from you?  Ten.   Just ten.  Oh, wow.  I peed on some people today.  Metaphorically peed, I mean.  What I mean is, I told this group of...  ... biker-types, at the Foster's Freeze. I was cruising around and they said something raunchy, so I turned and said something like --  I told 'em I'd rather ride a pig than a hog.  Well, a pig is a chick that --  They didn't try me at my job, did they?  The hell you say --  Fuck Barris! That cephscope cost me nine hundred dollars. I need to get home right now. But I gotta... Oh, fuck, man. Fuck fuck fuck Barris!  I gotta run an errand and like that.   Arctor parks across from the New-Path Drug Rehab Facility, a converted wood frame house. He checks the police photo of Erroll Weeks, a.k.a Spade Weeks, shoves it into his glove compartment, and heads, business-like, toward the building.   The S.O. believes Spade   Weeks has lost himself inside New-Path   by posing as a junky. New-Path strips    junkies of all  i.d. and gives them new names as part of personality rebuilding process. It's a perfect hiding place.  I'm in a bad place. I wanna turn myself in for treatment.  This place is the only hope I could think of. I had a friend come in here. A black dude, in his thirties --  I am bad off.  Okay, but listen, this black guy, my buddy, goes by the name of Spade, did he make it here? I sure hope he didn't get picked up by the pigs on the way over.   It's a mess. Freck is on the couch smoking a joint. A cat sleeps in his lap. Another cat and a dog lie on either side of him. A disassembled cephscope is on the coffee table, wires exposed. Barris hovers over the dining room table where he has set up a makeshift chemistry lab.      Bob Arctor? He's not doing anything much. Working at his nowhere Blue Chip Stamp job, dropping a few tabs of meth cut with Death during the day.  What do you mean?  Fine. So I assume this means you'll be bugging Arctor's house and car?   The yard, lit only by moonlight, is overgrown with weeds and littered with rubbish. Barris sits on a cracked cement patio fiddling with some sort of foam rubber and aluminum foil tube. Freck looks on anxiously. Ernie Luckman, a big stoner in a football jersey, sits on a decrepit swing set, looks up at the moon, and sips a beer.    Arctor jerks awake and reflexively grabs his gun from under his pillow. Confused, heart pounding, he tries to take in his surroundings. Dogs bark outside.       Arctor trudges through the pig-sty living room, past the ratty couch, the broken cephscope, the crooked pictures on the wall. He disappears into the kitchen.    It's the same room, but different. It's neat. The pictures on the wall are straight. A younger, cleaner, straighter Bob Arctor sits on the couch watching tv with his wife and children. Through shadow and obstruction, we never get a clear view of Arctor's family.       The catchy, reduntant Coke jingle continues in the background throughout. Bob Arctor squats down and reaches into a floor level cabinet to grab a popcorn popper. When he rises, he hits his head hard on a sharp corner. His countenance changes dramatically, violently.     That pain, so unexpected, so undeserved, cleared away the cobwebs in my head. I didn't hate the popcorn popper, I hated my wife and kids.   I hated my backyard,...  ... my front yard,...  ... my power mower.  All the elements that made up my life were right there. And nothing new would ever happen. Like a little plastic boat that would sail on forever, without incident, until it finally sank, which would be a secret relief to all.  So I ended that life and started this one. Now I dwell in a ugly world...   Present-day druggie Arctor returns to bed with his beer.    Arctor lies in bed and writes in his notebook. The voice- over is different here: It's halting, as if he's composing; and it's read with immediacy and anxiety.   Now I dwell in an ugly... disordered world. But this very disorder... permits... the... unpredictable to --  Yeah?  Come in, Barris.  Why the fuck would I screw up my own cephscope?  You did it?  Oh, Jesus, Barris. Go fuck yourself.  How about, you're a fucked-up lunatic?  Get lost.   Arctor, Barris, and Luckman emerge from the house, bedraggled and bleary-eyed, and climb into Arctor's car.      Arctor starts the car, begins to pull out of the driveway.    The car pulls to a stop on a residential street. It's a a cruddy neighborhood. Apartment buildings. Graffiti.   You guys track down Andy and the hot scope. I'll pick you up in two hours.  Dropping in on a friend.  While in Long Beach today I checked in on Kim, an addict acquaintance who lives with dealer Dan Blake. My intention was to get the latest on Blake, but also to strand Barris and Luckman down here long enough for the scanners to be installed.  It's me, Kimberly. Bob Arctor.  Are you alone?  He beat you up?  Do you want him back?  How long can you go without?  Can't you get it anywhere else? Y'know the name of Dan's supplier? Maybe you could deal directly.  Yeah.  You should call the police.  Kim, he'll kill you.  Tires aren't...  That's what he wants you to do.       Arctor drives on the freeway, deep in thought. Luckman's next to him. Barris is in back grinning in his dark shades.   Dog shit. All that misery and that's what really upset them.  Shouldn't this locking ring hold the nut in place?  For a second I couldn't figure it out.    Put the fucking snuffbox away!    It's an illusion, right? There's no dog shit smell. How could there be dog shit in the eng...     Dog shit!   Fuck! It is dog shit!   Arctor opens his eyes fast. Barris, looking on compassionately, squats next to him outside the car.   What, Jim?   What'd you say?    You goddamn Barris! I know you did it, screwed over the cephscope and now my car! You kinky freak mother bastard!  I know it's him, man. I know.    A tow truck is parked in front of the car. The three guys are inside, Arctor at the wheel, Barris and Luckman in back. A mechanic closes up the hood.    The three drive along in silence.      Arctor is pale, but seems back in control.   Yeah, I hope.  What kind of surprise? It's my house, Jim, you can't start rigging up --  Well, what is it?  You should've told me.  Well, they're not going to expect it to be unlocked, so they'll go in the window.  You're jiving me.  We'll see when we get back. If there's a note on the door and it's unlocked, we'll know he's not jiving us.  So what did you write on the note, Jim?   The car pulls up to the house. The three guys get out. A piece of paper is tacked to the door. It reads: \"Donna come on inside; door's unlocked. We've gone to Long Beach for the day to purchase a stolen cephscope.\"   Jesus, Barris.   Barris studies the room.   Strange how, now and then, paranoia can link up with reality.   Barris studies a full ashtray on the coffee table.   My God, who was here?  What raid?  Did you forget about the recorder, Jim?  Forget to turn it on, did you?  Sell the house?  What reason should we give for selling?  We'll just flat out say there's narcotics planted all over the place and since we don't know where, we decided to move out and let the new owner get busted instead of us.  I say we tell them the truth. In fact, we can put an ad in the Times: \"Modern, three bedroom tract house, two bathrooms for easy flushing, with high grade dope stashed in all rooms.\" It's a selling point.    Did you smoke a joint? Before you crashed?  How long have you been here?  Shit, I hope it was you dreaming.   Arctor and Barris, in greasy clothes, are in the driveway working on Arctor's car. Freck pulls up, gets out of his car and approaches.    How much you pay, Freck?  Jim could've gotten it for you cheaper.  Where's it located, Freck?    Why is it bent?    About a thousand pounds.  That's a thousand pounds with passengers, a full tank of gas, and a carton of bricks in the trunk.  Twelve.  No. Eleven in the back and the driver alone up front. The extra weight is in the back so it doesn't fishtail.  Unless you get eleven people in back.  What is that, Luckman?  To fix the engine. What else?  The most dangerous kind of person is one who's afraid of his own shadow.   Arctor, Luckman, and Barris lounge around, stoned.     Arctor seems relaxed, reclining on the couch and glancing discreetly at the hidden holo-scanner.   I'll cruise the streets until I come across an Olds, then unbolt the carb. Like everyone else I know.  The scanners will have miles of this tripped-out garbage. But it's not the stuff that happens while I'm here that matters. It's what goes on while I'm gone. So I'll split. Then I'll see what these three clowns are up to.  What if I see some awful truth about the people I care about on these tapes? What if I see Donna climbing in the window and ripping me off, or destroying my stuff? Or some weird, nightmarish world beyond the mirror...   The living room has a monochromatic, dream-like quality to it. Suddenly Donna crawls in on all fours. There is an non- human blankness to her face. She sticks her head into the dog's bowl and eats greedily, making slurping noises.    Arctor lurches out of his fantasy, freaked out. Luckman and Barris don't notice. They're still jabbering away.   I'm going out to score some beans. Luckman, is your Falcon running?  Barris?  I'll walk.  Forget it. If I tried to drive your car, I'd press the wrong button and float up over the greater L.A. area.  I just did a freaky number, not like a fantasy trip, but... So I'm kinda --  My stuff?  Fucking Barris. You know how he kills you? He doesn't. He waits until a situation arises where you die, and he just sits there. In fact he sets you up to die. I don't know how exactl --  What?  Sure.   Yeah.  I am?  Donna, I know I can count on you to tell me if I'm getting weird or crazy or like that. Okay?  Right on.     Yeah. That sounds --  I'll wear whatever you say.  Oh, wow.   That sounds good.  Can a drive-in show movies in the morning?  Do you ever throw anything away?  How much of what you've got did you buy and how much did you steal?  Like when you buy dope. Like a dope deal. When I mean by \"buy\" is an extension into the greater world of business transactions of what we have present now, with us, as dope deals.  Like when you rip off those Coca-Cola truck you tailgate. That's stealing.  Donna, look, you're gonna get caught, and if you got drugs in your car when they catch you, there's nothing I can do to protect you then.  Nothing.     I just... Please take care.  Okay, cool.  I love you, Donna.  Hey, Donna, man, do you like cats?  No.   On the ground.  Little spring flowers, then?  Before.    Before anyone.  Yeah. You know me exactly, Donna. You can read me. No one knows me but you.  What's wrong?  Donna, can I put my arm around you.   I want to hold you, okay?  What?  Ugly?   Fuck you, Donna.    I'm taking off.  You're too stoned to drive and you never let anyone else drive that little roller skate of yours.    Okay.  You'll have to save up for that.  Who?  You sure this'll happen?  Hey, man, can I go with you? To Oregon? When you do take off finally?   Arctor enters the dimly lit bedroom followed by Connie, a skinny girl with hollow eyes and a flat affect. He sifts through his dresser drawer as she hovers behind him. Finally he pulls out a baggie with some pills in it. Throughout, we hear stoned conversation coming from another room.    Here you go.  Two of them do.  I try not to be. That's why I've arranged this transaction with you.   The lights are off. The off-screen conversation has stopped. Instead we hear static from a signed-off tv station. Arctor is in bed with Connie. Both are naked and partially under covers. Connie lies rigidly on her back, arms straight down by her sides. She snores. Arctor moves in and out of     Fuck off, Barris.  Where's Luckman?  My axle jack?  Either you pay up your back rent or get to work fixing my godamn cephscope!  Barris portraying Arctor as coming off heroin.  What?  Barris up to something: pretending to be me... writing rubber checks on my account... representing me as a heroin addict. BUT WHAT IS HE UP TO?  Hi, I'm here...  ... to pay for a check of mine the bank returned. It's twenty dollars.  Yes, I am Mr. Arctor. Nobody else is.  I'm sorry about this, but by mistake I wrote the check on a closed account.  Also, I'd appreciate if you'd tell your husband --  I'd appreciate if you'd tell your brother that I was distraught when he called and I apologize for that, too.  Any extra charge?  I was distraught because a friend of mine had just passed-on suddenly.  He choked to death alone, in his room, on a piece of meat. No one heard him.  Yes. That's true. Thanks.      And thanks about the check.  Yes.     He was the best friend I had.  Thank you. And thank Mr. Englesohn for me. Thank you both so much.  Okay then, thank you.  A perfect forgery. Barris has my handwriting down. How many checks has he written on my account? Evil genius bastard.  What if I, Bob Arctor, wrote this check myself and just don't remember?  I'm sorry to bother you again, ma'am, but I was just wondering what address do you have for that service call?  Yeah, I lost my ignition key. 34881 Main Street, Santa Ana...  So, Arctor's the forger, not Barris! Not deliberately, but because his brain is slushed on dope. All their brains are...  ... slushed and mutually interacting in a slushed way.  But what is Arctor up to? Clearly the Sheriff's Office has some good reasons to focus their investigation on him. No doubt reasons I know nothing about. My job is to report, theirs to evaluate.   The cab drops Arctor off. He heads up the newspaper-strewn walk to the front door. He eyes the house and the grounds: The house needs paint, a rain gutter is halfway dislodged. The yard is overgrown.   Fucking waste of a perfectly good house. A family could live here, for Christ's sake. Oughta take it away from this fuck.   The place is a mess.    Arctor drops the papers on the floor.     What does a scanner see? Does it see into the head? Into the heart? Does it see into me clearly or darkly? I hope clearly, because I can't any longer. I see only murk inside and out.   Arctor rises and pulls a book from the shelf. It is The Picture Book of Sexual Love. He opens the book, revealing a photo of a man nibbling a woman's breast. He positions himself so as to be best picked up by the living room scanner,then appears to read aloud from the book. We can see that what he is reciting is not on the page.   Any given man sees only a tiny portion of the total truth, and...  Any given man sees only a tiny portion of Weh! steck' ich in dem Kerker noch? Verfluchtes the total truth, and very often, in fact almost perpetually dumpfes Mauerloch...  Wo selbst das liebe Himmelschlicht he deliberately deceives trub durch gemalte Scheiben bricht!    I drove by the Maylar Microdot Corporation building.  One of the employees had evidently tracked the inventory out on the heel of his shoe. So they were all in the parking lot with many little magnifying glasses.  They had a reward, but they lost that, too. It was a little tiny penny.  About an inch high.  They have a really big sign.  Oh, just tell me.  That's a decent idea.  Right.  You put a solar battery in it, it could keep walking for years. Forever.  Imagine an Eskimo village. And this six foot block of hash worth... What would it be worth?  More. Two billion. So these Eskimos are chewing hides when this six foot block of hash comes walking through the snow saying, \"No, I don't\" over and over again.  Legends would spring up.  But, see, legends build. So in a few centuries it would be, \"In my forefathers' time, a ninety foot high block of extremely good quality  Afghanistan hash worth eight trillion dollars came at us dripping fire and screaming, \"Die, Eskimo dogs!\" And we fought and fought with it and finally killed it with our spears.  Kids never believe anything anymore.  He got away with it? Never got caught?  It's like asking what an imposter looks like. I asked a hash dealer who'd been busted once what the nark who busted him looked like --  More so. The dealer dude told me the nark had longer hair than we do. I guess the moral is, stay away from guys who look like us.  How could a guy do that is what I want to know, pose as a nark?  Shit, I'm spaced. Pose as a nark.  My brains are scrambled today.      I better go crash.   Arctor is finishing up mowing the lawn. He is intently focused on the task, but has done an erratic job: the left side of the yard has been left almost completely unmowed. Arctor turns to enter the house. We see that the left side of his face is completely unshaved.    Now all the faces, including Arctor's, are gone.       Just... like... the... rest... of us.  Did... he say what it was like?  What was on the other side?  I've lost everything.  He should've gone through while he had the chance. You only get one chance.  That's what you're trying to do. With me now. Show me a trailer. So I'll hold out.  I can't make love. My thing's disappeared. I'm sorry. I'm so sorry.  But what'll I do if my thing's disappeared? Will they still take me?  Okay.  Okay.  I am an eye. I am dead. I can only look at what is front of me.  Yes.  Okay.  Won't it wash off?  Thelma.  Don't you live here?  Bruce.  Are you leaving here?  Semi-rotten vegetables.  For now we see through a glass, darkly; but then face to face: now I know in part...  ...but then shall I know even as also I am known.  I can't do that.    How long has Donna been here?    Can I work with animals. I like animals. Can I work with them?  I want to work with something living.    Okay.  Is this Jerry Fabin?! Is this Jerry Fabin?!  My name is Bruce.  Okay.  I think I'll like it better here.  I like mountains.  I like air.  Will I be seeing my friends?  Mike and Thelma and Donna and Jerry Fabin and Luckman and Barris and --  They had us memorize that as part of the New-Path creed.  Thanksgiving.  Mountains, Bruce, mountains.  Echolalalia, Bruce, echolalalia.  Why not for me?  Gone.     The flowers of spring are gone.  I saw.  A present for my friends. My friends who I'll see soon.   At Thanksgiving.",
        "James": "",
        "Barris": "No shit.  Hey, what kind of bread is this on the patty melt, anyway?  If you go into New-Path, you'll experience symptoms that emanate up from the basic fluids of the body, specifically those located in the brain. By that I refer to the catecholamines, such as noradrenaline and serotonin. You see, Substance D functions this way: it interacts with the catecholamines in such a fashion that involement is locked in at a subcellular level. Biological counteradaptation has occurred. Nine-grain wheat.  Say, is your name Patty?  The waitress we had last time was named Patty. Same as the sandwich.  Everything is super good.  More people than you think have such problems. This is a world of illness, and getting progressively worse.  Tell me, why the debate regarding turning yourself in for residence therapy at a drug rehab facility?    Oh, Bob's girl.  No.   He never got into her pants.      Donna does coke. Anybody who would give her a gram of coke she would undoubtedly spread her legs for.  I, my friend, can derive a gram of coke for a total cost to me of under one dollar. From a product readily available at your neighborhood 7-11.  That's a fine 7-11.  Let's not forget the one on Katella with the foxy cashier to hit on.  Oh, it's been sabotaged by person or persons unknown.  Behold, what they've deliberately done is mix the cocaine with oil so it can't be extracted -- they cleverly call it benzocaine -- but my knowledge of chemistry is such that I know precisely how to separate the two.  Now I'll freeze it, which causes the cocaine crystals to rise to the top because they are lighter than air.  Than oil, I mean.  The terminal step I keep to myself, but it involves an intricate methodological process of filtering.  You give her a gift she gives you one. The most precious gift a woman has.  There's a great deal about Bob Arctor you're not aware of. Your view is simplistic and naive, and you believe about him what he wants you to.  In this day and age, with the kind of degenerate society we live in and the depravity of the individual, every person of worth needs a gun at all times. To protect himself.  What it did was augment the sound rather than dampen it. But I almost have it right. I have it in principal, anyhow.  Not much.   Thirty bucks. I'll sell it to you.  You really ought to have one to protect yourself, Freck, against those who would harm you.  This one will be totally soundless.  Hey, Bob.    I thought you'd be sleeping.  I am here to inform you, Bob, that I have formulated an initial theory as to who may have systematically damaged your cephscope with malice and may do it again.    No, no. You... ... are looking at the person who did it. That was my complete, intended statement, which I was not allowed to utter.  I mean it's my theory that I did it. Under post-hypnotic suggestion. With an amnesia block so I wouldn't remember  Don't you see, Bob, I've got the advanced, specialized, technical, electronic skills. I have access, because I live here. It all fits. What I can't figure out is my motive.  I might have been hired by secret forces. It could be as big as that, Bob. As huge as that.  Oh, hold on, Bob. I forgot something. I forgot my antihistamine capsules.  And where are you off to?  Mysterious Bob Arctor.  Slow down!    What the hell happened, Bob?  The idle screw has been turned all the way out. So when the linkage parted, the override went up instead of down.  No. A special tool would be needed. A couple, in fact. I have the tools to fix this, but back at the house.  So we'll have to get to gas station and borrow tools from them.     Dope can't screw up a carb-idle adjustment, my friend. You'd better take at least three of these. They're primo, but mild.    Hey, Bob, want a lump of dog shit?   To chew on?  Hell, I took some too. And so did you. Didn't give us a bad trip. Besides it was so soon. Your stomach can't even absorb --  Oh, I wouldn't worry too much about that, gents.  But I left a little surprise for anyone entering the house. An electronic surprise, if you will.  Easy.   Be cool.  If the front door is opened, my tape recorder starts recording.  To increase the chance of them making their entry via the front door, I providentially left it unlocked.  But I put a note on the front door.  Yes.  Of course I'm kidding, guys! Only a psychotic would leave the front door open with a note on it.  I wrote: \"Donna, come on in, the door's unlocked. We...\" The note's to Donna.  This way, we'll know who's been messing with us, Bob. And that is of prime importance.  Interesting. Everything is exactly as we left it. They're very clever.  Look at this!  That roach may not be a slip-up. Maybe they were here specifically to plant dope, then phone in a tip later. Maybe there's dope planted all over this house. We're going to have to go through and get this place clean.  Wait. If they see us scrambling around before the raid --  -- then we can't allege, even though it's true, that we didn't know the dope was there. Maybe that, too, is part of their ingenious plan.  Oh yes. The tape should be extremely informational at this point. Well, it probably wouldn't ultimately have proven that important.  No. The first thing they did upon entering was switch it to \"off\".  They made their move swiftly, before so much as an inch of tape pasesd through the recording head.  You know, Bob, there is one thing you could do, although it would take time.  I've got an acquaintance in the field.  We don't know how fast they're gonna swoop down on us.  No. I don't think we can afford to be that up front. Bob, you say you got a job transfer.  Cleveland.  Or how much. Prospective buyers might inquire about the quantity.  Life is only heavy and none else; heavy that leads to the grave. For everyone and everything.  How big?  How big a plant?  They're practically giving meth plants away.    Bent choke shaft. The whole carb needs to be rebuilt.    The idling jets could be replaced with smaller jets. And he could watch his rpms with a tach. Usually just backing off the gas pedal causes it to upshift if the automatic linkage doesn't do it.  The tach needle would jump and he'd back off.  Momentum would carry him past.  What does this car weigh, Bob?  Well, you're right then. It wouldn't have much interia mass. A thousand pounds traveling eighty miles an hour --  This car fishtails?  Be better, then, to have two three hundred pound bags of sand in the trunk. Then the passengers could be distributed more comfortably.  If you bastards wouldn't rappity-rap on like a bunch of speed freaks, I could complete my computations and tell you how this car with its weight would handle a four barrel carb. So shut the fuck up, you assholes!  What?  I hear the phone ringing about the carb. I'll get it.  It was a wrong number, man.  Thought I would bring it with me, since I was indoors and noticed it.  Especially Donna. That chick steals everything she can carry.  At what individual price per stamp?  That's twenty-seven hundred dollars, if my arithmetic is correct.  You realize our taxes were raised by her stealing those stamps? It's one thing to steal auto parts, but when you steal from Uncle Sam --  I wonder, Bob, if you can handle my car? By that mean there are --  There are certain secret devices which have been incorporated --  It's just that it has certain secret --  I'm glad you appreciate my position.  Operator, I need, I'm not sure, is it called the inhalator squad or the resuscitation squad?  It is, I believe, cardiac arrest. Either that or involuntary aspiration of a bolus within the --  The address, the address.      let's see...  Uh, thank you. No assistance is needed after all. Good morrow.  You okay, Ernst?  Not exactly. You did go into an altered state of consciousness for a few seconds. Probably an alpha state.  You saw me on the phone, summoning the paramedics. I moved into action immedi --  This is Jim.  With the beard. Green shades. Leather pants. I met you at that happening at --  Say, have I scored. Psylocybe Mexicana. A rare hallucinogenic mushroom used in South American mystery cults thousands of years ago. You fly, become invisible, understand the speech of animals --  Five dollars a cap.  How'd you make out with little Miss Big Tits?  Bob, I'm sorry if I offended you.  He left with your jack, so I assume he's off to knock over pay phones.  Y'know, I have a sure fire way you could get into the pants of Little Miss Big Tits. For under one dollar.  Yes. About that, Bob. I've already ordered resistors --  Yeah?  Yes, this is Robert Arctor.  Oh, yes, I've been meaning to call you, but I've had a severe bout of intestinal flu, with loss of body heat, pyloric spasms, cramps...  I just haven't been able to get it together to make that little twenty dollar check good, and frankly I don't intend to make it good.  You heard me correctly.  Think what you want. Turn out, tune out, and good-bye.  We see imposters in our lives, now and then. But not posing as physicists.  Looked just like us.  What?  I have evidence that Mr. Arctor is part of a large, secret covert organization, well-funded, with arsenals of weapons at their disposal, probably dedicated to the overthrow --  No, I have not, sir, ever been in a --  My evidence, gentlemen, which I mostly don't have with me today, consits of tape recordings I have made of Robert Arctor's phone conversations.  I believe it to be political in nature, and against this country.  When you examine my evidence, you will undoubtedly conclude that Substance D is produced by a foreign nation determined to overthrow the U.S., and  that Robert Arctor has his hands deep in the machinery of --  A Miss Donna Hawthorne. On various pretexts he goes over to her place and colludes with her regularly.  I've followed him in my car, sir.  There's one more thing. Mr. Arctor is addicted to Substance D. His mind is deranged now. He's become dangerous.  He's already having episodes such as occur with brain damage from Substance D. Deterioration in the corpus callosum.  But, sirs --  I might be murdered. Mr. Arctor is, as I say --  That's not why I'm doing this. The man is sick. Brain damaged from Substance D. The reason I am here --  Thank you, sirs. Thank you very much.  The female's voice is a Miss Donna Hawthorne. The male is Bob Arctor.  I can identify the biker gang also.  Much more. Much much more.     Much much much much much --",
        "Ernie": "Law abidance has always been of the utmost concern to Jim Barris.  Just shut up and fire off the great eleven cent silencer of our times.  There's a lot of those. I saw in the L.A. Times yesterday, they're giving away a free transistor radio to those who would harm Freck most successfully.  Jesus, Barris. Y'know, you're supposed to be fixing the cephscope. Bob's lying in his bed right now thinking you're fixing his cephscope.  Jim Barris does not have allergies.  You ought to pass that truck, man. The humper's hardly moving.  The linkage from the pedal to the carb fell apart.  Could it screw itself all the way out like that accidentally?  Hey, man, did this happen by accident or was it done deliberately? Like the cephscope.  (spinning and lashing out  (barely audible above     Hey, man, you're getting a flashback.  Now just take it easy. Nobody got killed and now we're warned. It's okay. It's okay. Everything's okay.    I don't know, man. I can't figure out half the things he lays on people.  Take it easy, Bob.  That doesn't make any sense.      He'd have snuffed himself too.  What was in those tabs you gave us?  I wonder what's been going on back at the house.  You know, this proves, Bob, that somebody is out to burn you real bad. I just hope the house is still there when we get back.  Christ, Barris, they may have ripped off everything we got, or stomped all our animals, or --  What if they come in the window or through the back door?  Are you fucking jiving us or not?   I can't tell with you, man. Is he jiving us or not, Bob?  But they'd probably take the note down and lock the door after vandalizing and robbing us. So we'll never know. It's that gray area again. Damn it!  He did do that. He really did it.  Well, Barris, I can see you're right. There was definitely someone here. You see, the scrupulous covering-over of all signs they otherwise would've left testifies to their -- Barris, you're one paranoid fuck.  A still-hot butt. It sure is.  Wait, this is what's hot. They lit a joint. But what'd they do? What the fuck did they do?  I'll check the wall sockets.   You take apart the tv and stereo.  We're fucked! We can't do anything!  It's off?    Fuck! Those fuckers.  Now what?    Now what the fuck do we do?  Does anybody know a good realtor?  We should probably act fast, man.  Yeah, we can't tell the truth. We need a shuck. Barris, what's a good shuck?  Where to, though? Where the fuck to?  But they'd be calling asking what kind of dope, and we don't know. Man!  Christ, this is awful!  Well, you could've taken down the note, locked the door, and left.  I phoned and they're checking to see what a rebuilt carb will set you back. Hey, Freck.  Cool.    How big?  It would idle too high. And it wouldn't upshift.  If he tromped down heavy on the step- down passing gear to get a lot of torque suddenly on the freeway, it'd downshift and rev up so high it'd blow the whole engine.  While passing a big semi? He'd have to blow the engine up or he'd never get around what he was trying to pass.  What about uphill?  How many passengers, Bob?  That's six in the back and six --  What about one six hundred pound bag of gold, Jim?  I'm going to read to you now, Barris. \"He to whom it is given to see Christ more real than any other reality...  \"...than any other reality in the World, Christ everywhere present and everywhere growing more great, Christ the final determination and plasmatic Principle of the Universe --\"  Teilhard de Chardin. \"... that man indeed lives in a zone where no multiplicity can distress him and which is nevertheless the most active workshop of universal fulfillment.\"  Out of the way, Freck. I'm going to coldcock Barris into tomorrow for talking to his betters like that.  I was just kidding.  Naw, stay, man, you're a brother.  Hey, what's the hammer for, Jimmy-Boy?  You seem mellow, Bob. Having to spend a hundred bucks on a new carb wouldn't make me mellow.  I'll tell you a Donna story. One day she put a quarter in a stamp machine and it kept spitting out stamps, till she had like eighteen thousand stamps.  Fifteen cents per individual stamp.  And so what's Donna gonna do with so many stamps? She can barely write...  So she ripped off the whole stamp machine and remounted it, like, somewhere where the postal authorities wouldn't spot it and...    Fuck, Barris. It's an ordinary six cylinder. The parking lot jockeys park it all the time, for God's sake.  You're fucked, Barris. You know that?    I must've gagged. Did I pass out?  Fuck. I shit myself.  What were you doing while I was lying there, jacking off?  Balls.  Hi, what's happening, Bob?  You're shitting me.    How large is the Maylar Microdot Corporation building?  Well, then how can you tell when you drive past it, if its only an inch?  What's the sign look like?  Y'know how can you smuggle microdots into the U.S.? Barris told me. I'm not supposed to say, cause he's putting it in his book, \"Simple Ways to Smuggle Objects into the U.S. and Out, Depending on Which Way You're Going.\"  You smuggle it with a shipment of dope. Like heroin. The microdots are so small no one would notice.  Barris had this other idea for smuggling dope. You know how the custom guys, they ask you to declare what you have?  Well, you take a huge block of hash and you carve it in the shape of a man. Then you hollow out a little section and put a wind-up motor in. And a cassette tape. And just before it goes through customs, you wind it up and it walks up to the man, who says, \"Do you have anything to declare?\" and it says, \"No, I don't,\" and keeps on walking.  What's the use of that?  A billion dollars?  They'd wonder what it meant by that.  Can you imagine telling your grandkids, \"I saw with my own eyes a six foot block of hash appear and walk past, worth two billion dollars, saying, \"No, I don't.\" His grandchildren would have him committed.  The kids wouldn't believe that either.  ... this guy appeared on tv, claiming to be a world-famous imposter. He said he'd posed at one time or another as a great surgeon, a theoretical submolecular high-velocity particle research physicist, a Finnish novelist, a deposed president of Argentina...  See, the guy never really posed as any of it. He only posed as a world- famous imposter. Turns out he just pushed a broom at Disneyland, until he read about this actual world-famous imposter, and he thought, I can pose as all those things, then he thought, hell, I'll just pose as an imposter. Save a lot of time, a lot easier. Made almost as much money as the real imposter with books and movie rights.  Narks, you mean. Yeah, I wonder what a nark looks like?  Narks give me the creeps.",
        "Luckman": "Law abidance has always been of the utmost concern to Jim Barris.  Just shut up and fire off the great eleven cent silencer of our times.  There's a lot of those. I saw in the L.A. Times yesterday, they're giving away a free transistor radio to those who would harm Freck most successfully.  Jesus, Barris. Y'know, you're supposed to be fixing the cephscope. Bob's lying in his bed right now thinking you're fixing his cephscope.  Jim Barris does not have allergies.  You ought to pass that truck, man. The humper's hardly moving.  Slow down!    The linkage from the pedal to the carb fell apart.  Could it screw itself all the way out like that accidentally?  Hey, man, did this happen by accident or was it done deliberately? Like the cephscope.  (spinning and lashing out  (barely audible above     Hey, man, you're getting a flashback.  Now just take it easy. Nobody got killed and now we're warned. It's okay. It's okay. Everything's okay.    I don't know, man. I can't figure out half the things he lays on people.  Take it easy, Bob.  That doesn't make any sense.      He'd have snuffed himself too.  What was in those tabs you gave us?  I wonder what's been going on back at the house.  You know, this proves, Bob, that somebody is out to burn you real bad. I just hope the house is still there when we get back.  Christ, Barris, they may have ripped off everything we got, or stomped all our animals, or --  What if they come in the window or through the back door?  Are you fucking jiving us or not?   I can't tell with you, man. Is he jiving us or not, Bob?  But they'd probably take the note down and lock the door after vandalizing and robbing us. So we'll never know. It's that gray area again. Damn it!  He did do that. He really did it.  Well, Barris, I can see you're right. There was definitely someone here. You see, the scrupulous covering-over of all signs they otherwise would've left testifies to their -- Barris, you're one paranoid fuck.  A still-hot butt. It sure is.  Wait, this is what's hot. They lit a joint. But what'd they do? What the fuck did they do?  I'll check the wall sockets.   You take apart the tv and stereo.  We're fucked! We can't do anything!  It's off?    Fuck! Those fuckers.  Now what?    Now what the fuck do we do?  Does anybody know a good realtor?  We should probably act fast, man.  Yeah, we can't tell the truth. We need a shuck. Barris, what's a good shuck?  Where to, though? Where the fuck to?  But they'd be calling asking what kind of dope, and we don't know. Man!  Christ, this is awful!  Well, you could've taken down the note, locked the door, and left.  I phoned and they're checking to see what a rebuilt carb will set you back. Hey, Freck.  Cool.    How big?  It would idle too high. And it wouldn't upshift.  If he tromped down heavy on the step- down passing gear to get a lot of torque suddenly on the freeway, it'd downshift and rev up so high it'd blow the whole engine.  While passing a big semi? He'd have to blow the engine up or he'd never get around what he was trying to pass.  What about uphill?  How many passengers, Bob?  That's six in the back and six --  What about one six hundred pound bag of gold, Jim?  I'm going to read to you now, Barris. \"He to whom it is given to see Christ more real than any other reality...  \"...than any other reality in the World, Christ everywhere present and everywhere growing more great, Christ the final determination and plasmatic Principle of the Universe --\"  Teilhard de Chardin. \"... that man indeed lives in a zone where no multiplicity can distress him and which is nevertheless the most active workshop of universal fulfillment.\"  Out of the way, Freck. I'm going to coldcock Barris into tomorrow for talking to his betters like that.  I was just kidding.  Naw, stay, man, you're a brother.  Hey, what's the hammer for, Jimmy-Boy?  You seem mellow, Bob. Having to spend a hundred bucks on a new carb wouldn't make me mellow.  I'll tell you a Donna story. One day she put a quarter in a stamp machine and it kept spitting out stamps, till she had like eighteen thousand stamps.  Fifteen cents per individual stamp.  And so what's Donna gonna do with so many stamps? She can barely write...  So she ripped off the whole stamp machine and remounted it, like, somewhere where the postal authorities wouldn't spot it and...    Fuck, Barris. It's an ordinary six cylinder. The parking lot jockeys park it all the time, for God's sake.  You're fucked, Barris. You know that?    I must've gagged. Did I pass out?  Fuck. I shit myself.  What were you doing while I was lying there, jacking off?  Balls.  Hi, what's happening, Bob?  You're shitting me.    How large is the Maylar Microdot Corporation building?  Well, then how can you tell when you drive past it, if its only an inch?  What's the sign look like?  Y'know how can you smuggle microdots into the U.S.? Barris told me. I'm not supposed to say, cause he's putting it in his book, \"Simple Ways to Smuggle Objects into the U.S. and Out, Depending on Which Way You're Going.\"  You smuggle it with a shipment of dope. Like heroin. The microdots are so small no one would notice.  Barris had this other idea for smuggling dope. You know how the custom guys, they ask you to declare what you have?  Well, you take a huge block of hash and you carve it in the shape of a man. Then you hollow out a little section and put a wind-up motor in. And a cassette tape. And just before it goes through customs, you wind it up and it walks up to the man, who says, \"Do you have anything to declare?\" and it says, \"No, I don't,\" and keeps on walking.  What's the use of that?  A billion dollars?  They'd wonder what it meant by that.  Can you imagine telling your grandkids, \"I saw with my own eyes a six foot block of hash appear and walk past, worth two billion dollars, saying, \"No, I don't.\" His grandchildren would have him committed.  The kids wouldn't believe that either.  ... this guy appeared on tv, claiming to be a world-famous imposter. He said he'd posed at one time or another as a great surgeon, a theoretical submolecular high-velocity particle research physicist, a Finnish novelist, a deposed president of Argentina...  See, the guy never really posed as any of it. He only posed as a world- famous imposter. Turns out he just pushed a broom at Disneyland, until he read about this actual world-famous imposter, and he thought, I can pose as all those things, then he thought, hell, I'll just pose as an imposter. Save a lot of time, a lot easier. Made almost as much money as the real imposter with books and movie rights.  Narks, you mean. Yeah, I wonder what a nark looks like?  Narks give me the creeps.  What?",
        "Charles": "Hey, Jerry, I was in the neighborhood looking to score, and I thought -- What the fuck are you doing in the shower with the goddamn dog?  I don't see any aphids. What's an aphid?    Wow!    That is a big one!  What do we get for these? I mean, does the doctor pay a bounty or something? A prize? Any bread?  Jerry, these bugs sort of scare me.    I don't like it here by myself.  Couldn't you --  I'm afraid out here, man.  Do these fuckers bite?  Can I wash them off and wait for you?  Can you lay about ten Deaths on me?  Christ. Christ. Christ Christ Christ.   Freck drives slowly along a strip-malled Anaheim street. He passes a Thrifty pharmacy and notices the window display: bottles of slow death, slow death mixed with speed and junk and psychedelics. Dayglow signs in the window: \"Your Credit is Good Here\" and \"Death to the Masses\" He looks again. The window displays combs and shampoo. Freck checks his rearview mirror, sees a police car following him.   Fucking goddamn fuzzmobile. What was I doing? Was I weaving? I don't even know.  What I'll do is pull over when I see a parking space. That's it: pull over like I was gonna pull over anyway. Like it's totally normal to pull over. Like I'm going to a store. That's perfect. Real people do that all the time.  Fuck. Fucking fuzz. Now I'll never be able to pull back into traffic.    Hey!  Hey!  Donna!  Aren't you Bob Arctor's old lady?  Sure you are. I met you at his place.  Jeez.   I just...  One night me and Bob and another chick had some old Simon and Garfunkel tapes. You were filling caps with high-grade Death, then you laid one on each of us.  No. I just wondered if you, like, wanted a ride or... Bang you on the sidewalk? In broad daylight?  I know you. Besides Arctor would snuff me if I did that.  You want a ride where you're going?  Nah. Besides I can't get it up these days. Must be something they're adulterating all the stuff with.  That really sucks.  How far he get?  That's not worth forty thousand.   Freck drives Donna home.   Listen, you got anything to sell?    I'm really hurting.  Tabs, though. I don't shoot up. Needles are a bummer to me.  Jeez, man, that's a burn.  All right.     A hundred, then.  Charles B. Freck --  Charles Freck.  658-4412.  Hey, you want to go with me to see Jerry Fabin? I'm hauling some of his stuff over to the Number Three Federal Clinic where they took him last night.  They're aphids.  Hey, Barris, I'm thinking of turning myself in to New-Path.  But it's tough, that cold turkey thing they do. They watch you night and day so you don't snuff. But they never give you anything, like a doctor will, like Valium or like that.  Look on the menu. It explains everything.    No.   Nothing.  Everything is not good with me. I got a lot of problems nobody else has.  No!   No, we don't want any dessert!  Fruit pies are for old ladies anyway.  My friend Jerry Fabin and his aphids.  There's another reason. I'm running low again, and I can't stand this always running low and not knowing if I'm ever going to score again. Actually, though, I may have a new source. That Donna chick.  His old lady.  Really?   Can't Bob get it on?  I never shot smack. Needles are a bummer to me.  I don't want to lay her. I just want to buy from her.  I wish you wouldn't talk that way. Besides who has the money to procure a gram of coke?  That's bullshit.   Freck and Barris drive along.   Which 7-11 store do you prefer to shop at? The one on Lincoln is nice.  Although what about the one on 8th? They have the wider aisles. A more spacious shopping experience.  What's with Bob's cephscope, his prize possession of the entire world?  This is super unreal. I'm flipping.  Even if you do get a gram of coke out of thisl, I can't use it to get into Donna's pants. That's like buying her.  You're talking about Bob Arctor's girl, Barris. He's my friend and the guy you and Luckman live with.    Why do you need a silencer, anyway, Jim? I mean, they're illegal.  That's some silencer, man.  How much is a gun like that worth?   Freck drives along in great spirits. He giggles and plots.   Okay okay okay. So I go to Barris, \"Hey, Barris, I bought a methedrine plant today,\" and he goes... \"Methedrine is a benny, like speed, la la la. It's made synthetically in a lab la la la. It isn't organic like pot. There's no such thing as a methedrine plant, like there is a pot plant.\" Then I go... \"I meant I inherited forty thousand dollars from an uncle and purchased a plant in this guy's garage where he makes meth. It's a factory. Plant in that sense... ' Okay okay, I don't have the phrasing exactly yet, but when I lay this on Barris, man, I'm going to get him so good.  Hey, Jim, I bought a meth plant today.  What do you mean?  (confused as to how to  Uh, about ten bucks.  This is a whole fucking garage! A factory! It turns out a million pills a day!  Not around here. Hey, fuck it, you guys.    Fuck off.  Cool it, you guys.  What if he comes back with his gun and silencer?  Look, I'm splitting.  Naw, I'm cutting out.  I'm gonna split. I'll see you guys.  Did Bob mean me afraid of my own shadow? But that was turning into a super-bummer. Where's the chicken into not wanting to be around that? Everything's changing, man. Used to be cool to hang out. Now its totally dark.  Jerry! Jerry! Let me in, man, I'm truly bummed! I wanna talk!  Fuck! I can't believe I forgot Jerry's dead. What is wrong with me?  Fuck, I can't believe I forgot Jerry's not dead. What is wrong with me?   Freck lays fresh sheets on his bed in his neat apartment.      It is no problem how to kill yourself in the circles in which I hang. When life becomes more and more depressing as you watch those you know falling apart from drug use, just take a large quantity of reds.  Wash 'em down with a bottle of cheap wine.  The hard part is choosing the correct artifacts to be found on you by later archaeologists. So they know from which stratum you came and where your head was at when you did it.  I will be found with Ayn Rand's \"The Fountainhead\" open by my side to prove I have been a misunderstood superman rejected by the masses and so, in a sense, murdered by their scorn.  Also, an unfinished letter to Exxon protesting the cancellation of my gas credit card. That way I will indict the system and achieve something by my death. Over and above what the death itself achieves.  Perhaps a connoisseur wine is in order on such an auspicious occasion.   Freck drives, an expensive-looking bottle of wine on the seat next to him. He anxiously eyes the gas gauge on empty.   You'll soon be sorry, Exxon, you ever tangled with Charles B. Freck! Junior!   Freck sits up in bed in his now electric yellow room, sipping magenta wine. The walls are dripping.   I've been burned. These are not reds, but rather some freaky psychedelic, the likes of which I have never seen.  Fuck. You're going to read me my sins, aren't you?  And it's going to take a hundred thousand million hours, isn't it?  Know your fucking dealer, man.",
        "Freck": "Hey, Jerry, I was in the neighborhood looking to score, and I thought -- What the fuck are you doing in the shower with the goddamn dog?  I don't see any aphids. What's an aphid?    Wow!    That is a big one!  What do we get for these? I mean, does the doctor pay a bounty or something? A prize? Any bread?  Jerry, these bugs sort of scare me.    I don't like it here by myself.  Couldn't you --  I'm afraid out here, man.  Do these fuckers bite?  Can I wash them off and wait for you?  Can you lay about ten Deaths on me?  Christ. Christ. Christ Christ Christ.   Freck drives slowly along a strip-malled Anaheim street. He passes a Thrifty pharmacy and notices the window display: bottles of slow death, slow death mixed with speed and junk and psychedelics. Dayglow signs in the window: \"Your Credit is Good Here\" and \"Death to the Masses\" He looks again. The window displays combs and shampoo. Freck checks his rearview mirror, sees a police car following him.   Fucking goddamn fuzzmobile. What was I doing? Was I weaving? I don't even know.  What I'll do is pull over when I see a parking space. That's it: pull over like I was gonna pull over anyway. Like it's totally normal to pull over. Like I'm going to a store. That's perfect. Real people do that all the time.  Fuck. Fucking fuzz. Now I'll never be able to pull back into traffic.    Hey!  Hey!  Donna!  Aren't you Bob Arctor's old lady?  Sure you are. I met you at his place.  Jeez.   I just...  One night me and Bob and another chick had some old Simon and Garfunkel tapes. You were filling caps with high-grade Death, then you laid one on each of us.  No. I just wondered if you, like, wanted a ride or... Bang you on the sidewalk? In broad daylight?  I know you. Besides Arctor would snuff me if I did that.  You want a ride where you're going?  Nah. Besides I can't get it up these days. Must be something they're adulterating all the stuff with.  That really sucks.  How far he get?  That's not worth forty thousand.   Freck drives Donna home.   Listen, you got anything to sell?    I'm really hurting.  Tabs, though. I don't shoot up. Needles are a bummer to me.  Jeez, man, that's a burn.  All right.     A hundred, then.  Charles B. Freck --  Charles Freck.  658-4412.  Hey, you want to go with me to see Jerry Fabin? I'm hauling some of his stuff over to the Number Three Federal Clinic where they took him last night.  They're aphids.  Hey, Barris, I'm thinking of turning myself in to New-Path.  But it's tough, that cold turkey thing they do. They watch you night and day so you don't snuff. But they never give you anything, like a doctor will, like Valium or like that.  Look on the menu. It explains everything.    No.   Nothing.  Everything is not good with me. I got a lot of problems nobody else has.  No!   No, we don't want any dessert!  Fruit pies are for old ladies anyway.  My friend Jerry Fabin and his aphids.  There's another reason. I'm running low again, and I can't stand this always running low and not knowing if I'm ever going to score again. Actually, though, I may have a new source. That Donna chick.  His old lady.  Really?   Can't Bob get it on?  I never shot smack. Needles are a bummer to me.  I don't want to lay her. I just want to buy from her.  I wish you wouldn't talk that way. Besides who has the money to procure a gram of coke?  That's bullshit.   Freck and Barris drive along.   Which 7-11 store do you prefer to shop at? The one on Lincoln is nice.  Although what about the one on 8th? They have the wider aisles. A more spacious shopping experience.  What's with Bob's cephscope, his prize possession of the entire world?  This is super unreal. I'm flipping.  Even if you do get a gram of coke out of thisl, I can't use it to get into Donna's pants. That's like buying her.  You're talking about Bob Arctor's girl, Barris. He's my friend and the guy you and Luckman live with.    Why do you need a silencer, anyway, Jim? I mean, they're illegal.  That's some silencer, man.  How much is a gun like that worth?   Freck drives along in great spirits. He giggles and plots.   Okay okay okay. So I go to Barris, \"Hey, Barris, I bought a methedrine plant today,\" and he goes... \"Methedrine is a benny, like speed, la la la. It's made synthetically in a lab la la la. It isn't organic like pot. There's no such thing as a methedrine plant, like there is a pot plant.\" Then I go... \"I meant I inherited forty thousand dollars from an uncle and purchased a plant in this guy's garage where he makes meth. It's a factory. Plant in that sense... ' Okay okay, I don't have the phrasing exactly yet, but when I lay this on Barris, man, I'm going to get him so good.  Hey, Jim, I bought a meth plant today.  What do you mean?  (confused as to how to  Uh, about ten bucks.  This is a whole fucking garage! A factory! It turns out a million pills a day!  Not around here. Hey, fuck it, you guys.    Fuck off.  Cool it, you guys.  What if he comes back with his gun and silencer?  Look, I'm splitting.  Naw, I'm cutting out.  I'm gonna split. I'll see you guys.   Freck drives along, sweating.   Did Bob mean me afraid of my own shadow? But that was turning into a super-bummer. Where's the chicken into not wanting to be around that? Everything's changing, man. Used to be cool to hang out. Now its totally dark.  Jerry! Jerry! Let me in, man, I'm truly bummed! I wanna talk!  Fuck! I can't believe I forgot Jerry's dead. What is wrong with me?  Fuck, I can't believe I forgot Jerry's not dead. What is wrong with me?   Freck lays fresh sheets on his bed in his neat apartment.      It is no problem how to kill yourself in the circles in which I hang. When life becomes more and more depressing as you watch those you know falling apart from drug use, just take a large quantity of reds.  Wash 'em down with a bottle of cheap wine.  The hard part is choosing the correct artifacts to be found on you by later archaeologists. So they know from which stratum you came and where your head was at when you did it.  I will be found with Ayn Rand's \"The Fountainhead\" open by my side to prove I have been a misunderstood superman rejected by the masses and so, in a sense, murdered by their scorn.  Also, an unfinished letter to Exxon protesting the cancellation of my gas credit card. That way I will indict the system and achieve something by my death. Over and above what the death itself achieves.  Perhaps a connoisseur wine is in order on such an auspicious occasion.   Freck drives, an expensive-looking bottle of wine on the seat next to him. He anxiously eyes the gas gauge on empty.   You'll soon be sorry, Exxon, you ever tangled with Charles B. Freck! Junior!   Freck sits up in bed in his now electric yellow room, sipping magenta wine. The walls are dripping.   I've been burned. These are not reds, but rather some freaky psychedelic, the likes of which I have never seen.  Fuck. You're going to read me my sins, aren't you?  And it's going to take a hundred thousand million hours, isn't it?  Know your fucking dealer, man."
    },
    "imdb_rating": "7.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BOTc2ZGI2MzEtODlkNC00MGQ4LTlkYjQtMDU0YTg1YTI0NDI1L2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "In a totalitarian society in a near future, the undercover detective Bob Arctor is working with a small time group of drug users trying to reach the big distributors of a brain-damaging drug called Substance D. His assignment is promoted by the recovery center New Path Corporation, and when Bob begins to lose his own identity and have schizophrenic behavior, he is submitted to tests to check his mental conditions.Claudio Carvalho, Rio de Janeiro, Brazil",
    "name": "A Scanner Darkly",
    "genres": [
        "Animation",
        "Comedy",
        "Crime"
    ]
}