{
    "filename": "Absolute-Power_script.txt",
    "imdb_id": "tt0118548",
    "imdb_url": "https://www.imdb.com/title/tt0118548",
    "characters": [
        "Laura Simon (as Penny Johnson)",
        "Valerie",
        "Walter Sullivan",
        "Gloria Russell",
        "President Richmond",
        "Michael McCarty",
        "Kate Whitney",
        "Seth Frank",
        "Bill Burton",
        "Christy Sullivan",
        "Sandy Lord (as Ken Welsh)",
        "Tim Collin",
        "Art Student",
        "Red Brandsford",
        "Luther Whitney"
    ],
    "dialogues": {
        "Valerie": "Kids riding bicycles.    Very Norman Rockwell.            (as they study the  You're lucky is all -- some of my customers, they stand out no matter what.  How many passports you need?      Matter where you've been? -- I hate doing those goddam Asian passport stamps.  Usually takes some time, but for you, I'll rush it.  I don't want to know what you're into, but leaving forever...  I never figured you for a runner -- thirty percent of my runners kill themselves within five years.",
        "Walter": "It's all right, Sandy -- -- you're in charge of the case?  You want what, positive identification? Yes, that was my wife. Anything else?    She was, had it all planned, but you know women, they change their minds.    You mean the contents of the vault of course -- -- Sandy, you go on, I'm all right. Really. Go to the reception -- obviously I can't make it, but I'm sure everyone will understand.  I know it's not the contents -- You mean the chair. You have to ask about the chair.  But why?   Are they connected?     I'd hoped I could satisfy her... but you know... she had needs and she didn't want to go behind my back... she suggested the chair... she hoped I might get to like sitting there... ... I didn't... I've tried for eighty years to live a decent life. I've given a billion dollars to charity. If this comes to trial, none of that will be remembered -- I'll just go out as the joke of the world.         (noting McCarty's  This is a new arena for me, but from what I'm told, you have a flawless reputation, Mister McCarty -- which is why I need to employ you. Understood.  I have no idea who I'm after. Until I do, you will have to wait in Washington for instructions.  When I was 10 my father died -- he was a miner and lung disease killed him. I became rich at 25 and the first thing I did was purchase that mine, close it, and give every miner there fifty thousand dollars to retire on. You will come to Washington, Mr. McCarty. You will put one million dollars expenses into the Swiss                          * bank account of your choosing. And, when the time comes, two million dollars a bullet. You are a salesman, sir.  Selling sin is easy...  Is this a shortcut, Tommy?                              *  Very unusual -- what do I call you?  And are you familiar with how to get to my home, Luther?  -- I'm sorry I missed -- I believe in the Old Testament, sir -- there is nothing wrong with an eye for an eye when a terrible deed has been done. A deed such as yours.  Have no idea -- you going to rob me again? --        Who else was in my house?    Stop this --        -- it's too terrible.  ... I know about Alan's reputation as a philanderer... but... he would never dream of betraying me... I gave him the Presidency.  That's not real proof.  You could have stolen this.  (turns -- quiet now,  Is he working late? I haven't an appointment but I'd like to see him if I might.",
        "Sullivan": ")B(   ABSOLUTE POWER - Rev. 5/16/96                          8.                           )B(   ABSOLUTE POWER - Rev. 5/16/96                             10.                                                                          )B(   ABSOLUTE POWER - Rev. 5/16/96                          13.                                                        )B(   ABSOLUTE POWER - Rev. 5/16/96                         15.                                                                       )B(   ABSOLUTE POWER - Rev. 5/16/96                         20.                                                            )B(   ABSOLUTE POWER - Rev. 5/16/96                         25.                            )B(   ABSOLUTE POWER - Rev. 5/16/96                       26.                                                                        )B(   ABSOLUTE POWER - Rev. 5/16/96                        28.                                                                                                                 )B(   ABSOLUTE POWER - Rev. 5/16/96                            37.         It's all right, Sandy -- -- you're in charge of the case?  You want what, positive identification? Yes, that was my wife. Anything else?    She was, had it all planned, but you know women, they change their minds.    You mean the contents of the vault of course -- -- Sandy, you go on, I'm all right. Really. Go to the reception -- obviously I can't make it, but I'm sure everyone will understand.  I know it's not the contents -- You mean the chair. You have to ask about the chair.  But why?   Are they connected?  I'd hoped I could satisfy her... but you know... she had needs and she didn't want to go behind my back... she suggested the chair... she hoped I might get to like sitting there... ... I didn't... I've tried for eighty years to live a decent life. I've given a billion dollars to charity. If this comes to trial, none of that will be remembered -- I'll just go out as the joke of the world.             (noting McCarty's     This is a new arena for me, but from what I'm told, you have a flawless reputation, Mister McCarty -- which is why I need to employ you. Understood.  I have no idea who I'm after. Until I do, you will have to wait in Washington for instructions.  When I was 10 my father died -- he was a miner and lung disease killed him. I became rich at 25 and the first thing I did was purchase that mine, close it, and give every miner there fifty thousand dollars to retire on. You will come to Washington, Mr. McCarty. You will put one million dollars expenses into the Swiss                          * bank account of your choosing. And, when the time comes, two million dollars a bullet. You are a salesman, sir.  Selling sin is easy...                   Is this a shortcut, Tommy?                              *  Very unusual -- what do I call you?  And are you familiar with how to get to my home, Luther?  -- I'm sorry I missed -- I believe in the Old Testament, sir -- there is nothing wrong with an eye for an eye when a terrible deed has been done. A deed such as yours.  Have no idea -- you going to rob me again? --        Who else was in my house?    Stop this --        -- it's too terrible.  ... I know about Alan's reputation as a philanderer... but... he would never dream of betraying me... I gave him the Presidency.  That's not real proof.  You could have stolen this.           (turns -- quiet now,  Is he working late? I haven't an appointment but I'd like to see him if I might.",
        "Gloria": "",
        "Russell": "And you heard no sounds of violence 'til then?        We're going to have to sanitize this place. Alan, did you have sex with her?  Bill, you're going to have to examine her.  (she takes nothing  I'll take that.  (she holds out her  It's all going to be fine, Alan.  ... I'll take care of everything just like I always do. Gentlemen?               The country would have to be informed, Mr. President.  Burton says it's a flesh wound --  Are you serious about that press conference, Alan?  Shall I bring Mrs. Richmond home for it?  We checked his license plate -- he stole the car from a police impoundment lot.  Burton doesn't think he will.  He could be a little more than that, Alan -- he saw.       He was in the building -- he took a guided tour.  I've never dealt with blackmail --      You finished your recruiting speech? Because I'd like to know how I handle this.  Gee, Bill, that could be construed as criticism. Do you really want me as an enemy?  Fine -- you win the pissing contest -- -- what should I do?  Then what?           Thank you, Mr. President. And thank you, Mr. President.      Yes, yes, you think I don't know your writing? I assumed you wanted me to wear it tonight.  What, Alan?     It's not precisely the first time, Mr. President.  Only because you have so much on your plate, Alan; we wanted to spare you. He sent me a Polaroid of the letter opener yesterday.                 You're both assholes, now move --  We're working round the clock.",
        "President": "",
        "Richmond": "Kill her?  ... Don'... 'member...  Gloria -- I killed her --  ... But she's dead...  Take a walk with me.  Tell me about Walter -- how is he?  He understands officially my hands are tied?  Any news of the killer? Well, why isn't there? Who's in charge of the case?       -- I'll hold a press conference -- and I'll have Walter come -- and I will embrace him before the world.    (throws off his jacket,  What happened to my right to privacy? I think she nicked a tendon.    Of course I am -- Walter's been like a father to me.  I think Mrs. Richmond's mission to help the poor in Asia should not be interrupted. We know anything yet?  We're not dealing with a fool here. Has he initiated contact?  I agree. Sorry about my behavior -- won't happen again; think of it as a blip on the screen. And as far as I'm concerned, so is he.  He saw nothing -- a drunk woman who liked rough sex too much. And he's a burglar. Who's going to believe him? After all, it's not as if he had evidence or anything...  What happened to my right to privacy? I think she nicked a tendon.  I am having this press conference here because...  ... it is here, at this courthouse,                  * that Christine Sullivan's killer will be tried for his crime.  As you know, I came from an impoverished family in an impoverished town -- but we lived with our doors unlocked.  We all lock our doors now, but that is not what concerns me...  ... we are also locking our hearts... that is the sadness, that is the loss.  We are locking our hearts to the cries of the weary, we are locking our hearts to the poor and their pain...  ... Sisters and brothers, we are locking our hearts to ourselves.  We feel savagery and violence must be allowed a place at table. That is wrong. That is not America. I shall fight that battle.  Dear friend, old friend, we shall fight that battle.  Who can explain the ways of chance? If we had never met, I would not be President. If Christine had not taken ill, she would be with you in Barbados                        * even now. Oh, Walter, you've                         * always been like a father to me.                     * I would give the world to lessen your pain.     (off her, radiant,     Well, of course. Excuse me, all -- I am overcome with the desire to dance with my Chief of Staff.  What is this nonsense? I'm hoping there's an explanation.    It is lovely, Gloria -- and you know what else?  Christy Sullivan wore it the night                          * she was killed.                                             *  You realize what this means? Whitney's been heard from.         Well, now -- -- I need time to think -- come see me in my office in the morning -- This will certainly make for an interesting chapter in my memoirs.  (holding the note now,  Very gifted man.  And are we close to stopping him?  Good to know that.  Good to know that too.     There is one other thing you'll want to take care of.",
        "Michael": "",
        "McCarty": "",
        "Kate": "Ahh.  About?  That happens this time of year.  Luther, you don't have me.  -- you know what it's like being the only kid in show and tell who got to talk about visiting day?  We don't see each other anyway -- we haven't seen each other since Mom died and that's a year. Look, you chose your life. You had that right. You were never around for me. Fine. But I have no plans to be around for you.    -- are you active again? -- is that why you're here now?  -- I don't believe you -- -- Christ, Father, what have you done?                       )B(   ABSOLUTE POWER - Rev. 5/16/96                         66.            (before Seth can  Report you as an incompetent.     -- what? --    Lieutenant -- I don't know the man -- he was in jail when I was a kid, when he got out my mother and I went off to live by ourselves. We don't make contact. He doesn't care about me. I've seen him all of once this past year.  Couple days ago. He said he might be going away. There. I just helped you. Can I go back to work now?    I'm saying you won't recognize him. I'm saying he could be just around the corner -- he always kept a safe house --  He never said --    -- my mother loved him, all right? -- Even after she left him -- even when she was dying she always talked about him -- 'If only he hadn't this,' 'if only he could have that' --  I meet a lot of asshole cops like you -- guys who O.D.'d on Columbo --  -- There's something else, isn't there? Something you want me to do? -- But you won't say ---  How long did he live here?  Never been.     (pointing to the   ... No...  ... He won't come...  He's not a murderer.                                 *     I left a message on his machine, he called back within an hour; we're meeting tomorrow afternoon.  An open-air place near my office, the Cafe Alonzo --  Four o'clock -- it's deserted then.                Nothing, thank you.  Pardon?    Oh he will, we both will -- we'll order half the menu -- but just not now --  Thank you so much.           I just need some sleep.  You're on a hot streak, I guess.  You said.  Anything for the road?     I've got water and water.       Tired is all.       (still facing door,  Why'd you come?  No, this afternoon. To the restaurant. Why'd you come then? You must have suspected something, or you wouldn't have been prepared.  The same two guys who tried for you this afternoon?  Pretty powerful enemy; good going.  You're saying you're innocent of the murder? Why in the world                               * should I believe you?        They'll kill you.  Can you run?     What can you do?  It's dangerous outside.                                         )B(    ABSOLUTE POWER - Rev. 5/16/96                         112.                      ... Daddy...?       ... you're still here...?           )B(    ABSOLUTE POWER - Rev. 5/16/96                               126.       ... you don't have to fuss...  ... am I going to be all right?....",
        "Whitney": "",
        "Seth": "Christy Sullivan?  You serious, Laura?  Could someone have let him in?  Thank you for your support.  I hope not -- -- he's such a great man.    So he tried to strangle her, then went to the door and shot her from behind?  He did what?   Why?    Mr. Sullivan? -- I'm Seth Frank, senior homicide detective for Middleton County --      But Mrs. Sullivan didn't come.      I think someone sat in it -- and I think that someone may have been involved in the murder. You were my father's hero, Mr. Sullivan, I promise you this won't make my highlight reel.  I understand, sir; I'll do what I can.  See if any of this makes sense.  I am Christy Sullivan and I walk in and surprise a burglar.  Gold star. I draw my gun --  That's nothing -- why do I bother to have her strip and then put her clothes back on?  And I dress her because?     She had a point-21 blood alcohol level. -- she was too drunk to drive. I've checked every cab and limo company in the area and not one of them knows anything. Someone drove her home. Goddamit, who? And why haven't they come forward?  You saying the burglar drove her home? I hate this case.  Good service, thanks.  Oh yeah    -- remember that bullet hole in    the wall? Had the lab dig out the    slug -- guess what -- no slug --    why does the burglar take the time    to do that?  (getting more and     (gives papers to   -- hi, Seth Frank --  What did you have in mind?  Still trying to figure out what might have happened --    You're that Bill Burton.   Luther Whitney -- -- one of the great thieves of the world.  Been going nuts with this thing, up all night and I remembered your notion how it might be two burglars, and around dawn I thought, wait, what if it wasn't two burglars but what if it was one guy trying to throw us off by making it look like two? Called a buddy at the Bureau -- they keep track of this stuff internationally -- he says maybe only a half a dozen guys alive could have pulled off the Sullivan job -- I'm tracing all six -- -- but Whitney's the only one lives in Washington.  Because he hasn't been arrested in thirty years.       *  Whitney hasn't killed anyone in 45 years.  Korea.  Not just a veteran -- a wounded veteran. Got his combat record here. Battles, commendations,                                  * decorations up the kazoo.                                * Lives alone on his disability.                           * Says he does anyway.                                     * And I don't do war heroes...                             *      You been following the case?  -- F.B.I. feels only a few guys could have handled something as hard as the Sullivan job. I've got a list here; you're on it.    Just looking   for insight. How would you --   scratch that -- how would one go   about it? What kind of person do   you think I should be looking for?    Research for what?  Not just steal them?  Why go to all that trouble?    -- gizmo -- looked like a V.C.R. remote --  (sipping casually;  Why's that funny?    Would the burglar use a disguise?  Maybe like you.        What would you do if I just turned around and left?    (the instant  -- You think it's all coincidence? He's a thief and you just happen to be the toughest prosecutor in the area?  -- Luther disappeared.  I think you can help me.  When?    You saying he's left town, skipped the country, what?    -- Then where'd you hear this?  And?  -- Lady, I may be an asshole cop but you don't know me well enough to call me one --  Years.  Strange place for a thief to leave a key, don't you think?  He sure took off in a hurry. What scares a professional thief like that?  You can do a good thing, Kate -- -- help me bring him in. Just leave a message on his phone machine, you're worried about him.  It's the truth -- you are worried about him -- this isn't your normal case -- his life may be in danger -- you can save him, make the call --  (indicating the    Maybe you're right. Maybe he is                      * innocent. If so I'll have him                        * home and dry in a few hours. But                     * what happens if some hotshot who's trying to make a reputation tracks him down? I can guarantee his safety. You make the call, I make a promise: You'll have your father, home and dry...     Where?      Figured he'd    like an eyewitness report of the    capture. This is our guy -- if    he's innocent, he sure took off    awful fast.    This is not part of my brilliant master plan.  I like that in a woman.  Top number's local police -- -- other two are my office and home. I live alone, too, call anytime. Want me to get someone to spend the night?  I've got surveillance outside. And I'm keeping it on 'til this is over. I've got a feeling he's going to try and contact you.  Listen, I'm sorry.  Anything unusual, call me right away -- not a bother, I live alone.    Deal.  Pelligrino would be great. What's funny, I say it wrong?  I don't think I've told you this, but I live alone. Lock it behind me.  Real good.    Try and sleep.     Where are you?    She couldn't be in better hands -- talk about catching a break, Secret Service called me. They're taking over surveillance --",
        "Frank": "",
        "Bill": "",
        "Burton": "No choice in the matter.  Jesus, Tim, what did we do?    Maybe I should call the police now.       I'm no gynecologist.    What?  Shit!          Oh boy...  (a powerful man who             -- I know you must be going crazy -- but the boss is very interested in your progress. Maybe we can help each other.  You know how close he and Sullivan are? The minute anything breaks, if you'd call me, I'd tell the President. That way, he'd be the first to alert Mr. Sullivan -- it would mean a lot to him. And any red tape you want cut -- done. Here are my numbers.    -- I loved playing Sherlock Holmes.  I was State Trooper here ten years ago before the Government got me.  I was younger and dumber then. Keep in touch.       Like you handled the letter opener?  Miss Russell, I should have called the police that night. But I was weak. You convinced me to stay silent. I regret that. Know this: every time I see your face I want to rip your throat out.  Nothing -- because he's making a terrible mistake, he thinks he has time -- he doesn't -- Seth Frank's too good. He'll bring him in.          The Boss is very grateful. Thanks.  Unfuckingbelievable.                            (pointing to his   I talked to Seth Frank -- apparently Whitney learned how in prison.  He'll make a mistake.  You're sure you want to do that?          )B(   ABSOLUTE POWER - Rev. 5/16/96                           123.",
        "Christy": ")B(   ABSOLUTE POWER - Rev. 5/16/96                        14.",
        "Tim": "",
        "Collin": "Nothing to tell. He screamed.      Shit.  Shit!          -- relax, I got his license number, remember? --  -- take it easy, Miss Russell --  -- I better get cracking on that license number --                      (closes the desk,           ... you could have but you didn't...  ... mercy...",
        "Art": ")B(   ABSOLUTE POWER - Rev. 5/16/96                            52.                         )B(   ABSOLUTE POWER - Rev. 5/16/96                         66.   (finishing up the",
        "Student": "Don't give up.  May I?  You work with your hands, don't you?",
        "Red": "Luther. Your life would be a whole lot simpler if you could learn to operate a V.C.R.      Jordan beat us at the buzzer.",
        "Brandsford": "",
        "Luther": "I never do.      (as they nod to  My only failing.                                                                                    Bad night.  Kate. Kate.  Probably too late for me to take it up.  The jogging.  Dumb way to start this, I guess.  Wanted to talk to you.  Believe it or not, the weather. Nights are starting to get cold.  I was thinking of maybe relocating. Someplace with a kinder climate. I just wanted to check it out with you first... ... you're the only family I've got.  Kate --  This move -- I'm talking permanent, you understand.  -- no --  -- no --                      You mean I've got a weak face. Thanks, Val.    They're good. Beards and mustaches, too.  It may come to that.  Europe's fine. Maybe the Caribbean for winters. When can I pick up?  Thanks, Val. I've always been able to count on you.  What?  Finish it.       Usually takes a week for you guys to get to me. You look just like your picture, Seth. I'm Luther Whitney.  So, do you want my confession now or after coffee?  Watched the Bullets game    with Red Bransford. Prison buddy     of mine -- runs a bar -- want to    question me about the game? I'm     probably lying.      (as Seth nods;  You want me to help solve your case?    Need patience. The secret is just research, research, research -- from everything I've read.  Well, from what I can tell on the tube, it's not a small house. There had to be an architect, right? You'd be able to tell which one from public records in the library. And once you know the office, you could break in and find the plans and Xerox them, get them back before morning.  Seth -- breaking in isn't hard -- what's hard is breaking in so no one knows you've been there. Now, after the architect, next you'd want the contractor's office -- and the security company's office. You know the skill involved breaking the security of a security company? I wonder how those guys do it?  Papers said he kept the money in a vault, yes? Well, I'm guessing there was probably some secret way to open it --       The way you said it -- as if you were trying to surprise me.    Seth, you've got to get with the program you expect to catch this guy -- most likely it is a guy, am I right? Some kind of weird loner?        Tomorrow is promised to no one.     Not 'til morning? -- I'll be by early --    Turn that off, okay?         You -- heartless -- prick -- -- you -- fucking -- bastard --                              I need to look really good today.  You got that right.  I did not kill that woman, Kate.  You're not the first.  You have to know I'm not a murderer.    The robbery went fine 'til they came in. They were drunk. I hid in the vault. Sex got rough. He was going to kill Christy, but she turned the tables, was going to kill him. Two guys came in, shot her dead.  Probably only one of them. I think Walter Sullivan might have hired the other.  Not as powerful as the President of the United States.  Richmond was drunk. The two guys are Secret Service. Chief of Staff Russell planned the coverup.  Every word true.     Because I swear on Mattie's grave.  On your mother's grave, Kate -- you know I'd kill myself before I'd lie about that.  I know.  I know.  I was set to. At the airport. All the money I'd ever need.    But I saw that bastard using                             * Sullivan on the T.V. -- maybe I couldn't have saved that woman, Kate. But I didn't even try. I know what you think of me and I know what we've been to each other -- -- haven't been to each other. And it's not the time to try and explain my life --  -- but I've never robbed anyone couldn't afford it and I've never stiffed a waitress. And Alan Richmond has to pay.  Not much, maybe -- but I only went to jail when I had partners. People betray each other, Kate -- nowadays, when there's a group, someone wants to write a book --   (rises and looks at  This is probably it; you understand that. I was never going to tell you this, but I watched you argue a case last year -- thank God you got your brains from your mother.  It always is -- -- and I may not make you proud, Kate -- -- but I'm not going down alone...    Kate okay?  I'm not staying on long enough for you to track this, just answer me.    Scream. Go on. Which do you want most, for me to kill you or life in jail forever?  Going to guess this wasn't to pep her up.  ... why do you think that...?  That's because you didn't know your crime, prick.  (kneeling close, almost   I'm fresh out.  ... go to sleep, honey...  I need one answer -- when you interviewed Walter Sullivan, did he say why Christy didn't go to Barbados?  So will you -- check your phones --  Luther, sir.  I know the way, sir -- I'm the man who robbed you --  -- and you're the man who tried to have me killed --  You want to believe that, don't you? -- Makes your life a lot simpler if you believe that, isn't that right? What do you think I gain being here?  I don't need your money, Mr. Sullivan. Look in your vault lately?  Shit's coming down tonight, Mr. Sullivan, do you want to be a player or not? Do you want to know what happened, or not? I saw. Your call.  Are you up to hearing about it? -- Do you want to hear how he beat the shit out of her and tried to strangle her -- you have enough left for that? --  I was in the chair when they came in. They were drunk -- at first he only wanted to bruise her -- she fought back, he went for the kill -- she turned the tables. Then he screamed for help.  Secret Service shot her.  Gloria Russell handled the cover up.  -- don't you want to know who the man was?  We're too old to bullshit each other, Mr. Sullivan.    You fucking well do, don't shake your head at me -- when you're alone at night, when the rage takes you and you think of what you'd do to revenge her, on those nights you put a face to your enemy.  -- we're going all the way, Walter --  It sure is.      And this?  I did steal it. But that isn't my blood and those aren't my prints.  Haven't budged.  He was just checking in. When you're up to it, he said we might come over for dinner. He                                     * mentioned --                                                 *    You were forever catching colds."
    },
    "imdb_rating": "6.7",
    "description": "Inspired by David Baldacci's novel, and the ruthlessness of people in power. President Alan Richmond believes that everything he does is beyond reproach, including an affair or two. That leads to murder and everyone around him is involved. There is only one witness, a thief named Luther Whitney. They are sure he'll talk, but when? The Secret Service is determined to keep him quiet, but catching a thief isn't always easy.—Kristie Murray <hankm@cris.com>",
    "name": "Absolute Power",
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNDFlNTZmOGYtYmE0ZC00OTE4LWI5YzctNmZmZDU3M2ZiMmI4XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_QL75_UY281_CR1,0,190,281_.jpg"
}