{
    "filename": "After.Life_script.txt",
    "imdb_id": "tt0838247",
    "imdb_url": "https://www.imdb.com/title/tt0838247",
    "characters": [
        "Teacher #1",
        "Tall Kid",
        "Old Woman #1",
        "Paul Coleman",
        "Jack",
        "Father Graham",
        "Eliot Deacon",
        "Diane (as Luz Ramos)",
        "Tom Peterson",
        "Mrs. Whitehall",
        "Mrs. Hutton",
        "Beatrice Taylor",
        "Vincent Miller",
        "Anna Taylor",
        "Acne Kid"
    ],
    "dialogues": {
        "Teacher": "... the shell grows slowly...        She hasn't called in at all. It's not like her. She always calls in.     Hey!  Are you alright sweetie?",
        "#1": "",
        "Tall": "Hey.   Jack-off!  Didn't you hear me Jack-off?  You deaf Jack-off?  Can't fucking speak either.",
        "Kid": "Hey.   Jack-off!  Didn't you hear me Jack-off?  He must be deaf.  You deaf Jack-off?  Can't fucking speak either.",
        "Paul": "What's wrong?     ...it's like fucking a corpse.  Shit.   I'm sorry.   That was--     Anna. I'm sorry. That was a stupid thing to say.   But you know sometimes... sometimes it's like you're not here anymore. Like you're somewhere else.  Is this about us?  Then what is it?  I just want us to be happy.  Are you happy?  OK.   Who took the last pepperoni?  Great.  Broccoli. Who the fuck ordered broccoli?  Yeah.    With wheatgrass and alfalfa sprouts.  Hi baby.    I'm really sorry about this morning.    I fucked up. I know.      Please Anna.    It took me weeks to get the table.  No.     It has to be tonight.  Nothing. Don't worry. I just need... I just want us to have dinner tonight.      And Anna.    Everything's going to be fine.  I promise.  You scared the life out of me.  Your hair.  I didn't say that. It's just very... red. I mean it's not really you is it?  Yes.    We'll have the duck.  What?    You always have the duck here.  The duck is very good.  Let's not argue tonight.    OK?    I've been offered a transfer to head office in Chicago.  It'll mean more work of course. More responsibility. A lot of changes. But it's an incredible opportunity. I'd be crazy to turn it down. And... ...well I've been thinking. Maybe it's time for us to...  Anna wait.          Keep your voice down, everyone's watching.  You're crazy. You know that?      Just like your mother.     Anna. Open the door. Please. I want you to come with me. I want to...                   Anna!         Oh hi.   I'm looking for Anna Bryant.  I'm Anna's... fiancée. Paul Conran.     I thought this was her class.  We had a little misunderstanding last night.  Did she call in sick?     Beatrice's car pulls up. Diane gets out.      Pulls the wheelchair out of the car.  Paul grabs the flowers.  Mrs. Bryant.  Hi Diane.   I need to talk to Anna.  What's wrong?  What happened? Where's Anna?  A car crash?     When?  But... we were at the restaurant...  No. She can't be dead.    There must be some mistake.  Why didn't you call me?  Mr. Deane?  My name's Conran.      Paul Conran.  I'm Anna Bryant's fiancée.  Well not quite fiancée...  I'd like to see her.  I'd need to see her now.    If that's possible.  Please.   It'd only take a minute.    I tried to stop her.     She didn't hear me.  Is Tom in?  Thanks.   I'll just go and grab a coffee.  Come on.  You piece of shit.     I need to see Anna.  The funeral director won't let me see her Tom. He says I'm not family. Can you talk to him? Put some pressure on him.  Tom.    You're my friend.  I fucked up.  I always fuck everything up.     The music's strangely distorted now.        Almost silent.   As if we were inside Paul's head.           Anna stands in front of the shower with her back to him. She slips off her bathrobe and hangs it on a hook. Then her hand moves to her chest. There's a STRANGE WET SUCKING sound... ...as Anna rips out her heart and hangs it casually on the hook next to her bathrobe.                        Leave me alone.                Bad dream?  Yes?    Did you ever love me Anna?  Did you?  Say it.     Say you love me.  Me?   No.    It's probably for Eliot.  Thank you.        Look... Jack. I'm in no mood--          You little fuck. You think this is funny?  Jack... I'm sorry...  Am I?    No.   Of course not.  It's just... I'm having these...  Nothing.   Forget it.      Deane.  She's not dead is she?  Someone saw her.  One of Anna's students. In the window.  You know him?  I don't think he imagined it.   I think he really saw her.  Fuck you.     What's down there?  She's in here isn't she?     Give me the key.  Give me the fucking key.  Anna!  I'm here Anna. I'm sorry. Please Anna.  We'll be happy again. I promise.  I can't live without you.  Anna!  She needs my help.  I need you to issue a search warrant.     Anna's not dead Tom. He won't let me see her. He's keeping her there--  She's not dead.  Look. The paramedics phoned it in. They only checked for eye dilation and pulse. The doctor signed the death certificate without even seeing her body.  There was no EEG. Nothing. He could have drugged her to make it look like she was dead.  See? I'm telling you. She's not dead. The boy at school. Jack. He saw her.  No!  Tom. Just go down there and check the place out.  No.     But--  I think she called me.     Maybe you're right.    But why won't he let me see her?      Anna looks serene.  She's so cold.  I'm sorry Anna.  Yeah.   Thanks Tom.  You said she was alive.  You need a ride?  OK.   See you.  Go to hell.  I know she wasn't dead.            Come on.   Come on.  Anna.   I'm here. Please God.     Anna.  Baby.   Thank God.  I came back for you.     You're safe now.     Anna?  Anna!  Anna!     Where did you go?     Scissors?   What scissors?  Where am I?  I'm not dead.  I saw Anna.    You buried her alive.  I'm not dead.  I'm not dead.  I'm not dead.",
        "Coleman": "",
        "Jack": "Nothing Miss Bryant.  I tripped.   It was an accident.  I think it's dead.  Did I scare you Miss Bryant?  My mom's picking me up. It's my birthday. We're going to MacDonald's. Then on Saturday my mom's taking me to Busch Gardens. We're going to ride the Alpengeist. Continually voted one of the top ten roller coaster rides in America, the Alpengeist is a breathtaking avalanche of adventure.  My mom's friends with the manager. They're opening it specially for me.  Yes.    It will be fun.  Where are you going?    I've never been to a funeral.           You were supposed to pick me up from school yesterday.  I waited.      as he looks at the wilted flowers.    He crushes a petal then sniffs his fingers.  I thought it was Miss Bryant's funeral.  Where is she now?  Why?     Jack.  About what?     Are all funerals the same?               Anna in her RED SLIP by the mirror. She looks frightening in the harsh light. Deathly pale. Like a ghost.  Mr. Conran?  My name's Jack. Miss Bryant was my teacher. I saw her last night.  I was going past the funeral home. Miss Bryant stood there. In the window. In a red dress.  You think I'm lying.   I'm not lying.  She needs your help.  Maybe you just don't love her anymore?     I'm off to school now.  Frank Merano lies nestled in the velvet interior.    His face placid. No sign of the gaudy make-up.          You've spoken to others?  Who was the first one you spoke to?  You said you could teach me.  Miss Bryant.  Because she's dead.        Don't be scared. It's better this way.  I never said she was alive.     I just said I saw her.  Mr. Conran? Don't forget to fasten your seat belt.  Eliot stands in the window smiling at him.",
        "Father": "We have entrusted our brother James Hutton to God's mercy in sure and...  ...certain hope of the resurrection to eternal life through our Lord Jesus Christ, who died and rose again for us.  I am the resurrection and the life. Those who believe in me, even though they die, will live.  They that sleep in the earth will awake and shout for joy; and the earth will bring those long dead to birth again.  We have come here today to remember before God our sister Anna. To give thanks for her life.  We have but a short time to live. Like a flower we blossom and then wither. In the midst of life we are in death.  Please.   Paul. You're not well.",
        "Graham": "We have entrusted our brother James Hutton to God's mercy in sure and...  ...certain hope of the resurrection to eternal life through our Lord Jesus Christ, who died and rose again for us.  I am the resurrection and the life. Those who believe in me, even though they die, will live.  They that sleep in the earth will awake and shout for joy; and the earth will bring those long dead to birth again.  We have come here today to remember before God our sister Anna. To give thanks for her life.  We have but a short time to live. Like a flower we blossom and then wither. In the midst of life we are in death.  Please.   Paul. You're not well.",
        "Eliot": "The Antique Carlisle. Solid cherry. Hand rubbed satin finish. Tufted sovereign interior. Eternal-Rest adjustable mattress with matching pillow.  Or perhaps the Aegean? Solid bronze exterior. Hand brushed finish with Grecian bronze highlights.        Mrs. Ayres?  It's different every time.   Each person dies in their own way.  They just seemed appropriate somehow.     Anna's by her car rummaging in a bag for her keys. Getting increasingly frustrated.          You're in a funeral home. You're dead.  You had a car accident. It was raining. You hit a truck loaded with metal pipes.  You were pronounced dead eight hours ago. Your blood no longer circulates through your body. Your brain cells are slowly dying. Your body's already decomposing.  This is your death certificate. Cause of death. Massive internal trauma. Time of death. 8.23PM.  You were dead on arrival. The attending physician signed here... ...at 9.45 last night. I picked up your body from the hospital morgue at 12.10 this morning.  I'm sorry.  I'm preparing your body. You have to look beautiful for your funeral.  You all say the same thing. I'm sorry. Maybe you should rest now.     Then why are you here?  You're still in denial. You have to trust me. I'm only here to help you.  Don't be scared.  This will relax your muscles. Stop the rigor mortis setting in so I can work on your body.      I'm so very sorry Mrs. Bryant. It's always so tragic when you lose a child.  If you'd care to come to my office we can discuss the arrangements.  But she hasn't been--  Of course.  Ah.   Forgive me.  As I said. I've only just started preparing her.    I'll confirm the date with Father Graham this afternoon. Friday as you requested.  Yes?     Paul stands in the middle of the driveway staring blankly at the Funeral Home.  Can I help you?  Yes.  Of course. The lawyer. It's a small town. In my line of work you get to know everyone eventually.  That's strange. She wasn't wearing an engagement ring.  I'm very sorry for your loss Mr. Conran.  I'm afraid the viewing isn't until--  I'm sorry. It's not possible.     You're not family and--  I understand. But--  Mr. Conran.  There really is nothing I can do. I'm so sorry.  No one.  It was Paul.  Did you love him?  No.  Because it would only hurt you. You have to let go of the living. Just like they have to let go of you.  You're all the same. You all blame me for your death. As if it were my fault.  The others. They just see you as a dead body on a slab. Only I can see you as you really are.  I'm a busy man. I don't have time for this.  Oh I nearly forgot.    How tall are you?  Five seven.  I need to know how tall you are.   For your coffin.  Mrs. Whitehall.  You shouldn't be afraid of her.   The dead can't harm the dead.       The sharp tip pushes into his skin.  Go on.  What are you waiting for?  You think you're still alive because you're still attached to life. It's normal. You're just imagining you still have symptoms of life.  You died.   Everyone dies.  We're talking not because you're alive. But because I have a gift. I can talk to those between life and death.  To help them make the transition.  It depends on how you lived your life.  Not everyone needs my help. Some let go as soon as their body dies. Others don't let go until long after they're in the grave.  You're here so I can bury you.  Come.    We've wasted enough time already.  You're a corpse. Your opinion doesn't count anymore.  You people. You all think that if you breathe, shit, piss you're alive.  You clutch onto life as if your life was worth clutching onto. Was your life worth clutching onto Anna?  Was it?   Maybe you died a long time ago.  I have to tell you I'm surprised you're still arguing with me. You don't have much time left. Look. She's accepted her death. Her life has been examined. She has no more regrets. And now she's at peace. She used her time well. You still have so much to learn.  Are you sure?  Your funeral's in three days. Soon you'll be enclosed in a coffin. Then buried in the ground. No-one will hear you then. No-one will talk to you there.    Then perhaps you can help me. Could you throw these away for me?  Thank-you.  There's no life left in them.  They belong in the garbage.  I've seen you round here before.  Did you know Mrs. Whitehall?  Ah. Miss Bryant. No.       Her funeral's not until Friday.  She's downstairs.  Why?  Because she's not ready. Is the flower for her?  And you are?  Well Jack.      What did you think?  Mrs. Whitehall's funeral.     Did you find it interesting?  Oh.    I see.  No Jack. They're never the same. Each one is special. The dead always speak to us in different ways.  It was a pleasure talking to you Jack.          You'll be at peace soon.     I promise.  It's your dress. For your funeral. Your mother brought it round this morning.  An old-fashioned wooden rosary.  Why are you still struggling?  There's nothing out there for you anymore.  as he gets up and turns to Anna.  I'll be back soon.                    I'm the only one who can hear you now.  I'd be very careful if I were you. The dead have such a hold over the living.    You people.   You always need proof.  Because you are a corpse.  It's time you finally accepted the truth. You are dead. You will never live again.  Jack stands in the driveway holding his bicycle.    Looking up at the Funeral Home. Transfixed.  What do you mean?     No.   It's no problem at all.  I'll pick up the deceased from the hospital. Yes. This afternoon? That'll be fine. It's my pleasure Mr. Merano.  His mouth.   To keep it closed.  Now his eyes.  No. There's no need. I had to rebuild his face. You're still beautiful.  Yes.    A brother. He's coming in later.    It's not important anymore.        You should rest.  You're getting weaker.    It's almost time.  Yes.   Of course.  To make life important.        Mrs. Whitehall. Susan. I hope you found what you were looking for.  Think nothing of it Mr. Houseman.    No need to apologize.  I really enjoyed our time together.  Anthony.    Anthony. Always confused.  A POLICE OFFICER stands at the front door.    A SQUAD CAR parked on the driveway.  Eliot steps back.    Calmly continues to dry his hands.  How can I help you Officer?  Mr. Merano.   Yes. Of course.  It's no trouble at all.  Your brother's here.  You should remember him as he used to be.          Smiley.  I'm glad I could help.  No.   Not at all. I'll wait outside.  I just told you. That was your brother. You had an accident. You're dead. Why do you people never listen to me?  No.   It's not a gift.   It's a curse.  I take care of each of you as if you were my children. I wash the shit from your bodies. I dress you. I do everything to make you look more beautiful than when you were alive. And what do you do?  You argue with me. As if it were my fault you're dead. As if I was to blame. What? You're not talking to me now? You don't want to?  You don't talk because you have nothing to say. And you have nothing to say because you're a corpse.  No. Now I don't want to talk to you anymore.  Jack.  You have empathy with the dead. You're drawn to them. Just as they're drawn to you. It's a rare gift.  I know you saw Anna.  You're frightened by it. I was scared too the first time. But you shouldn't be. Christ had the same gift. He raised Lazarus and spoke to the dead.  Yes.  Yes.    Many others.  My mother.  You shouldn't be afraid. The others. They won't understand.    They don't see what we see. I can help you. I can teach you.  I've been gardening.  Yes.    The tulips love the sun.  Tulips?    Yes. I think so.  No.    They symbolize purity.  Unrequited love. What's your favorite flower?  A beautiful flower.       They need shade and lots of water.  Faithfulness.  Mr. Conran.   A pleasure.  I love gardening, but I'm not sure gardening loves me anymore.     I'm sorry?  Do you mean Jack?  Of course I know him. He's often round here. He seems to have a strange fascination with death. He's eleven years old Mr. Conran. And like all young boys has a vivid imagination. Now if you'll excuse me--  Maybe you just want to believe he saw her.  Mr. Conran!  Mr. Conran. I think you should leave before I call the police.  Mr. Conran.   She's dead.  I know what you're going through. Denial's a natural part of grieving...  ...but you've got to accept she's gone.  You can't help her anymore.    Believe me.  It's only a hole in the ground.   I'm digging it for--  Exactly.   For Anna.   She belongs here.  No.   Because there's no life left in her.  Don't you see? I have no choice. I'm the only one who can see all these corpses. Wandering the earth aimlessly. All they do is piss and shit. Suffocating us with their stench. Doing nothing with their lives. Taking the air away from those who actually want to live. I have to bury them all. I have no choice. Now there's two of us.  You did well this morning.  When Paul came. You did the right thing. You let him go.  Tomorrow's your funeral.  I told you.   You only had three days.  I told you to use your time well.  You're here to understand your life.       So you can finally be at peace.  Then why didn't you do anything about it?  What did you really want from life?     Yes you do! You're just too scared to admit it to yourself.  What did you want from life?    You had love. Paul loved you.  Did you?  What would you do if you had another chance?  Well?   Isn't this what you wanted?  I thought you were different. You all say you're scared of death. But the truth is you're more scared of life.      Eliot pauses.   Too confused to look back at her.  It's... It's not important.     You have to look beautiful for your funeral.  This will relax your muscles. Make your skin radiant. As if you were still alive. Just sleeping.  This is how they'll all remember you.  The last part is the most difficult. You'll have to face it alone. But you'll be at peace soon.  Anna. We've been through this before. You're just imagining--  You're still clutching onto life. Don't give in to your fears. You're so close.  Good bye Anna.  Violets just seemed appropriate somehow.         Eliot moves towards the window.  The dark cemetery. In the distance flickering candles illuminate Anna's grave.  Imagine Anna. The whole world, your mother, your fiancée, your friends. Everyone has buried you. They've placed a stone above your body.    They've said their good byes and gone back to their TV dinners and shopping malls. Thinking that this is never going to happen to them. Until it's their turn to be buried. Think about it Anna...  ...think about it while you still can.  Don't you think you've had enough to drink?     Wasn't she?  Mr. Conran. You come to my Funeral Home, making wild accusations. You have no idea what happens when someone dies. What happens to their body. What happens to their soul. You think Anna was alive after the accident? Maybe you're right.  Maybe she's still alive. You obviously don't believe a word I say. So why don't you go and find out for yourself Mr. Conran. Find out whether she's alive or dead.  You don't have much time left.      You're in a funeral home. You're dead.  You had a car accident. You swerved off the road. On the way to the cemetery. Hit a tree.  I'm sorry Mr. Conran. You never made it to the cemetery. You never saw Anna. You're dead.  Your skull was crushed. Your spinal cord pulverized. Your brain cells are slowly dying. Your body's already decomposing.  You people.    You all say the same thing.",
        "Deacon": "",
        "Tom": "You OK?  I just found out. I'm so sorry Paul.       If you need anything--     I can't do that.  Paul.     I can't do it.  You sure you're OK?  Paul. It was an accident. You should get some rest. Let me drive you home.  You're lucky.  They're not pressing charges.  What the hell's wrong with you? You're this close to fucking up your career.  You didn't believe him did you?  What?  Paul.    Sit down.     Just what the hell do you think you're doing? I got a call from Eliot Deane. Are you out of your fucking mind?  Anna was in a car accident. Her car was wrecked Paul. Remember? It's downstairs.  Here's the Coroner's report.     Drugged her?     Are you serious?  On what grounds Paul?       Do you have any evidence?  Do you have anything?  Called you?  First you hit a fucking kid. Then you attack Deane. And now you're telling me your dead girlfriend called you? What the fuck's going on? You're loosing it Paul.  I know you feel guilty but you've got to pull yourself together.  Look Paul. The funeral's tomorrow. You'll see her then. It'll help. It will give you closure. Trust me.  I'm taking you home.       You sure you're going to be OK?",
        "Peterson": "",
        "Mrs.": "The Antique Carlisle. Definitely the Antique Carlisle.  An antique coffin for an antique lady. We suit each other.  I'm sorry. Yes. A private visitation. Mr. Deane? What happens when we die?  White roses. They were his favorite. How did you know?  He looks so peaceful. As if he's only sleeping.  Thank you Anna. You were always his favorite student.  How's your mother?  You look tired dear.",
        "Whitehall": "",
        "Hutton": "White roses. They were his favorite. How did you know?  He looks so peaceful. As if he's only sleeping.  Thank you Anna. You were always his favorite student.  How's your mother?  You look tired dear.",
        "Beatrice": "Terrible color.  I'm not hungry.  I don't have to do anything.  The doctor's an idiot. He doesn't know what he's talking about.  Why did you do it? Today of all days.  You've forgotten haven't you?  Then you've got plenty of time to wash it out.  Then dye it back. You can't show up at the funeral looking like that. Like some prostitute.  Don't argue with me. Why are you constantly arguing with me?  Where are you going?  The sheets need changing.    They haven't been changed in months.  You weren't here Monday. You never sleep at home anymore. What if something happened to me in the middle of the night?     That's it.     Go and cry to Paul.  Go and bitch to Paul about your mean old mother.  I lost her years ago.  I want to see her.  I don't care. I want to see her.  What's the point of preserving the body if the soul's already left?  It's us who are left behind. It's us who suffer. Who's going to look after me now? Did you think about that?  Just do what you think's best.   It's just details.  Oh there is one thing.  Her hair. She was a brunette.    I'd like it back to that color.        You shouldn't have let her drive in that weather.  There's no mistake. We just got back from the funeral home.     You took her away from me.   I don't want you anywhere near her.",
        "Taylor": "",
        "Vincent": "I hope it's no trouble. I'd just like to see him before the funeral.  He looks so peaceful. You've done a beautiful job. Thank-you.  That's the schoolteacher isn't it?  Something's not right here.  His smile.    It was a bit more...  ...smiley.  A touch more.  That's much better. Thank-you.  Do you mind if I have a couple of minutes alone with him?  I'm sorry.    I didn't see...  Well. I guess I should be off then. I'll see you at the service. Thanks again.  I saw her.  She was on the slab.     Dead.  I've seen dead bodies.       Believe me, she was definitely dead.  Collect or long distance?",
        "Miller": "",
        "Anna": "Nothing.  her head bowed as she lets the water wash over her.  It's not about us.  I don't know.  I'm happy.  her nose is bleeding. She touches her lips. Looks impassively at the blood on her fingertips. The SOUND OF WATER carries into the next scene...      What's going on?  Jack?  Nothing? The incubator didn't just fall by itself.    No.   The poor thing's just scared.  I don't know Paul.                 Is someone there?  Jack!  It's locked.  Shouldn't you be home?    Sounds like fun.  Jack. Those boys.    Do they bother you a lot?  You know you can always talk to me about it if you want to.  You sure you don't need a ride?  Well.   I better run.     No Jack.   Funerals are very private affairs.  It wouldn't be appropriate Jack. Anyway wouldn't your mom worry about you?  I'm sure she would. I'll see you tomorrow in class. Have a wonderful birthday.      Yes Mother.  Can I get you something to eat?  You have to eat.  The doctor said--  What have I done wrong this time?  No I haven't forgotten.   The service isn't till six.  It's permanent. You can't wash it out.  I don't look--  To do the washing up.  I changed them Monday.  Nothing is going to happen to you.  That's enough Mother!  Mrs. Hutton.    I'm so sorry.  Fine.   She sends her condolences.  No.   I'm fine. Everything's fine.  James Hutton lies peacefully amongst the velvet trimming. Suddenly his LIPS PART... as he GASPS SOFTLY.  Sorry about that.  You don't like it.  Paul.    I'll have the duck.    This is good.  And looks very expensive... What's the special occasion?    You could've just told me this morning. You didn't need to buy me off with an expensive meal.  Why did you lie to me? You promised everything was going to be OK.  I'm not being ridiculous. Why do you always talk to me like I'm a small child?  See? There you go again.      Do you know how irritating that is?  Fuck you!    I'm nothing like my mother!  Good.             She hesitates.       For a moment we think she might go back to him...     Shit!    Paul? You home yet? Can you pick up?      I just don't want it to end like this.  Where am I?  I'm not dead.  I'm not dead.  Who are you?  Don't touch me! Why are you touching me?  I'm not dead.  The lights go off. O.S. the door clicks shut as it locks automatically behind Eliot.      Paul? You home yet? Can you pick up?       I just don't want it to end like this.  Please don't hurt me.  But I'm not dead.  Please. Just let me go. I won't go to the police. I won't tell anyone.  What are you doing?  I must be in shock.     That's all.   It's just shock.          Who was that?  No one?     That's none of your business.  You weren't going to tell me Paul was here, were you?  Why not?  I don't believe you.   Why are you doing this to me?  No. You drugged me.    So my mother  You're crazy!  What!?  Why..?  Wait!  Oh God.   Please. I don't want to die.  Glass everywhere. Paul glances at the KITSCHY BOBBLEHEAD DOLL on the dashboard flecked with blood. He places his hands on the steering wheel. Suddenly he hears a strange noise. He looks up... The KITSCHY DOLL. Its head NODDING SLOWLY. Its smiling face now unnaturally sinister. Turning towards us until it abruptly stops. Staring straight at us. Paul looks at the doll transfixed. Just then a PALE WOMAN'S HAND slowly reaches through the window... and touches Paul's shoulder. He jumps. Turns. ANNA stands by the car. Staring blankly at him.   The color drains from Paul's face.  her hands clutch the large scissors.  Who is she?     Stay where you are.  Don't come any closer.     I swear to God I'll kill you.  I'm breathing! Look. I'm still alive!  Maybe I was in some kind of coma. The doctors made a mistake. They're always making mistakes.  How can I be dead if we're talking?  Why?  Is this what happens when you die?  What do you mean?  Am I a ghost? Is that why I'm here?     But I can breathe.     I must be alive.  I have nothing to learn!  Are you cold?  I'm so cold.  You had a long life.  You look so peaceful. Aren't you scared?  I'm scared.    I'm so scared.  Who are you?  Is this the afterlife?    Am I in heaven? Or am I in hell?  The door... There was a door. Just there.  I used to believe in God. I thought I'd see him when I died. Instead I saw you.     Paul.      What's that?  This isn't my dress. This is my mother's dress! It was supposed to be for her funeral. Why has she given it to me?  It should have been her not me. She was the one dying. Not me.  I'm not ready to die.       No!      Eliot's van pulls up in front of the house.      Paul.   Please pick up.         Paul.  What do you mean?  Then prove to me I'm really dead.  Why do I look like a corpse?  I am dead.     I was dead. I had a car accident.     Did you ever dream you were dead?  Paul?  Paul.  What are you doing?  What neighbors? You don't have any neighbors.  Aren't you going to pick it up?  Is it always like this?  I thought when you died you wouldn't feel anything. You wouldn't feel any more pain. You wouldn't have to struggle anymore. But it just doesn't stop does it?  Frank stares back at her with open dull eyes. His face partially reconstructed with plaster of Paris.  What's that for?  Is this how you'll prepare my body?  Does he have family?  My mother... She didn't cry did she? When she came to see me?  And Paul?  I need to know.  I knew he wouldn't.     He always got upset when I cried.     He said crying never helped.  Can I ask you something?  Why do we die?  Your fingernails are dirty.  Your hands are normally so clean.  Is it sunny outside?  I miss the sun.  Are they your favorite flower?  I thought it'd be lilies. White lilies. Don't they symbolize death?  And tulips?  Violets.  What do they symbolize?     Roses are red, violets are blue...  No.     Leave it on.    It's so peaceful.  This morning?  He'll be all right now?    Won't he?     Already?  I need to... I have so many regrets.     I have nothing but regrets.  That's why I'm here isn't it?      To be judged.  I wanted a different life.  No matter what I did everything just stayed the same. I'd wake up. I'd shower. Sit in the same traffic everyday on my way to work. Go home. Go to sleep. Then wake again.  I just wanted to be happy.  I don't know. Don't you understand? That's the whole point. I don't know.  I don't want to talk about it anymore.      I just want this to be over.  I don't fucking know!          No. You don't understand. I was scared. I wanted to love but I didn't know how. I was... When I was a child... my mother.  When I was a child. I learnt that love. That when you love someone. You get hurt. So I learned not to love. That way no one could ever hurt me again.  I was always pushing Paul away.      He thought I didn't love him.  He was the only one I ever loved. But I never told him that. And then he stopped loving me.  No.  I'm glad I'm dead. I'm glad it's over.  I don't even know your name.  Her eyes still closed.  Can I see myself for the last time?  Is this the end?  You lied to me.  You lied to me.        ...delicately closes Anna's eyelids.  We see an almost imperceptible frown.               Paul?  You came back for me.  Promise?  Are we going home?  Or do you want to make love here?     I love you.   I always did.  It's only the scissors...  Scissors. For your clothes.    Eliot just put them on the table.  You're safe now. We're finally together.",
        "Acne": "He must be deaf."
    },
    "imdb_rating": "5.9",
    "description": "After a horrific car accident, Anna (Ricci) wakes up to find the local funeral director Eliot Deacon (Neeson) preparing her for her funeral. Confused, terrified and feeling still very much alive, Anna doesn't believe she's dead, despite the funeral director's reassurances she's merely in transition to the afterlife. Eliot convinces her he has the ability to communicate with the dead and is the only one who can help her. Trapped inside the funeral home, with nobody to turn to except Eliot, Anna's forced to accept her own death. But Anna's grief-stricken boyfriend Paul (Long) can't shake the suspicion that Eliot isn't what he appears to be.—Anchor Bay Films",
    "name": "After.Life",
    "genres": [
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTk0NDUzNTU5NV5BMl5BanBnXkFtZTcwNDE4ODIzMw@@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}