{
    "filename": "Ali_script.txt",
    "imdb_id": "tt0248667",
    "imdb_url": "https://www.imdb.com/title/tt0248667",
    "characters": [
        "Cassius Marcellus Clay, Sr.",
        "Bradley",
        "Don King",
        "Sonji Roi",
        "Cassius Clay /Cassius X /Muhammad Ali",
        "Howard Cosell",
        "Howard Bingham",
        "Angelo Dundee",
        "Chauncey Eskridge",
        "Veronica Porche",
        "Belinda Ali",
        "Malcolm X",
        "Drew 'Bundini' Brown",
        "Jabir Herbert Muhammad",
        "Dr. Ferdie Pacheco"
    ],
    "dialogues": {
        "Bradley": "Hello...?      (English translation;       to a sports court. Eight Uniformed Soldiers are with them. In the sports court, on their knees, hands bound behind them, facing away from us, are six prisoners in business clothes.   One is a woman. Guarding them are Bradley's Guards. Mobutu's Military Aide's soldiers take over the prisoners. Mobutu's Military Aide talks into a walkie-talkie. Meanwhile...   I thought that was all over. Is Clay going to support Malcolm's U.N. resolution?  Find out. We'll pick up on Malcolm in Liberia ourselves.   accompanied by an American Reporter is nabbed by a French news crew.",
        "Don": "and six other patrician, white business-people of Louisville in their green baize and wood-paneled Luxo boardroom. They speak soundlessly and patronizingly to Cassius Clay, Sr., seated at the foot of the table. It relates to the stack of contracts in front of him. He is in a suit and tie, his hair and moustache are dapper. His tie's a little loud. He has his hands folded deferentially in front of him.   ...I don't care what should have been ordered! We need a victory party right now. I got national press, the family, the champ, all kinds of folks... 250 to 300. Yes.   \"Rumble in the Jungle!\"     That's the name I given it.  A historical happening. This event will show that the black man has arrived on the world stage. Muhammad Ali and George Foreman in Kinshasa, Zaire.  Because you miss the significance. I dream, as Martin Luther King once dreamt, that a man could be judged by the content of his mind. This is about black men helping black men, overcoming four hundred years of racial depression to the dawn of a new day of liberation...financial and otherwise.  It will raise up the spirit of our inner cities. It will rise up and fill with hope the souls, the unrequited needs of the black proletariat, that is, the discouraged, dispirited, denigrated, denizens of the demimonde, that is called...the ghetto.  Ten million dollars. With one stroke of the pen, you split the world's biggest emolumation of the history of sports!  The \"Rumble in the Jungle\"!   in the rear realize, as do we, this is NOT MERELY A BOXING    Got cut. Right above his right eye. His sparring partner's elbow. Split it open, so...  Not for six weeks.  This is not a humorous situation, my champion. This postponement could be long, especially if George leaves.  How right you are, my suspicious and short Italian brother. And my fiduciary responsibility to this first all-black promotion is like a garden in the African sun. It must grow! It must bloom! It cannot flower in the gloom and shade of postponement to some dome. Like the Astrodome, the Super-dome, any dome outta Zaire, where it be deprived of light and bled of water. 'Cause what gonna bleed...is money. A hemorrhage of cash. ...blood on the floor. Double hotel costs. Double travel costs. Airplanes. Food and beverage...    What?  Who cares?      Ain't no doubt about it.  (laughs to dismiss  That would go off as planned on September 22nd and 23rd.  I ain't talkin' to you!   as tall as only three other men: Foreman, Ali and Bundini, walks into the ring wearing black...    What's on the menu...?   King is importuning Herbert, his hands work the air, gesticulating madly, building whole castles of hype and hustle. We can't hear what he's saying. Herbert listens. Then Don King stops and looks at him, and Herbert nods his head \"yes.\" Then Herbert starts saying something and Don King nods his head \"yes.\" Whatever's happening here, a deal for the future has been struck.",
        "King": "\"Rumble in the Jungle!\"     That's the name I given it.  A historical happening. This event will show that the black man has arrived on the world stage. Muhammad Ali and George Foreman in Kinshasa, Zaire.  Because you miss the significance. I dream, as Martin Luther King once dreamt, that a man could be judged by the content of his mind. This is about black men helping black men, overcoming four hundred years of racial depression to the dawn of a new day of liberation...financial and otherwise.  It will raise up the spirit of our inner cities. It will rise up and fill with hope the souls, the unrequited needs of the black proletariat, that is, the discouraged, dispirited, denigrated, denizens of the demimonde, that is called...the ghetto.  Ten million dollars. With one stroke of the pen, you split the world's biggest emolumation of the history of sports!  The \"Rumble in the Jungle\"!   in the rear realize, as do we, this is NOT MERELY A BOXING     Got cut. Right above his right eye. His sparring partner's elbow. Split it open, so...  Not for six weeks.  This is not a humorous situation, my champion. This postponement could be long, especially if George leaves.  How right you are, my suspicious and short Italian brother. And my fiduciary responsibility to this first all-black promotion is like a garden in the African sun. It must grow! It must bloom! It cannot flower in the gloom and shade of postponement to some dome. Like the Astrodome, the Super-dome, any dome outta Zaire, where it be deprived of light and bled of water. 'Cause what gonna bleed...is money. A hemorrhage of cash. ...blood on the floor. Double hotel costs. Double travel costs. Airplanes. Food and beverage...    What?  Who cares?      Ain't no doubt about it.  (laughs to dismiss  That would go off as planned on September 22nd and 23rd.  I ain't talkin' to you!   as tall as only three other men: Foreman, Ali and Bundini, walks into the ring wearing black...    King is importuning Herbert, his hands work the air, gesticulating madly, building whole castles of hype and hustle. We can't hear what he's saying. Herbert listens. Then Don King stops and looks at him, and Herbert nods his head \"yes.\" Then Herbert starts saying something and Don King nods his head \"yes.\" Whatever's happening here, a deal for the future has been struck.",
        "Sonji": "'Bout a year. I sell \"Muhammad Speaks\" over the phone...  My father named me after Sonja Henie.   He was shot in a poker game when I was two. He don't do nothin'. Sonja, on the other hand, was an ice skater, and my mother died when I was eleven.   Godparents, but I been on my own, doing my own thing...   No.   I gotta work, you know.   A record player?     C'mon.    How come it don't skip?   Herbert said you met The Beatles.   ...he's my favorite.   What he say?  Wow...  Yeah...  I'm takin' you there...   PULL BACK from being above Chicago in the winter at night to Ali and Sonji making love where Sheri's voice sings the second verse. To Ali's reactions...     Cover my hair? No make-up?     Long dresses? Honey, please. Were you a virgin?      My \"spirit\"...?  You serious?  Huh? How you do that? Step over a broom...shazaam...you a Muslim?  Baby, maybe you ain't ever gonna be with any other.  I'm changing my damn clothes! You didn't like what I was wearin'!  I fine runnin' around in all these cute short things for you. I submissive to you. But I ain't gonna be submissive to the Brother X's and what they think. They askin' me questions alla time anyway.  About you and us and I ain't tellin' 'em shit.  I don't drink. I don't smoke. I converted to Islam for you and...    All except the dress! I ain't puttin' no bleached-out, double- ugly bedsheets on this body, honey! I'm normal!  You okay? What's wrong?  I'm dyin' and...'cause this is how I dress! I dyin' for you out of worry...  Yeah. And all you care about is if I look dull enough?",
        "Roi": "",
        "Howard": "Does he hate white people? Malcolm X was in town. Then he left. Was that so he wouldn't embarrass you? Liston cannot stand you...  ...cannot stand you, Cassius.   He really wants to kill you...  (doing color radio    The winner...and the new heavyweight champion of the world is Cassius Clay!  What made him so easy for you?  Was there any single point you knew you had him?  ...the arena is surrounded by FBI, the stands are only half full, the promoter has taken out a million- dollar insurance policy due to Cassius Clay's membership in the militant and radical Black Muslims because of death threats. Oh, and by the way...Sonny Liston is here, too.  Liston is down! Scarcely a minute into the first round, I can't believe it!  It's over; it's over!  Cassius, it is my opinion you...    Yes, Muhammad. And to think I gave up a lucrative practice for the likes of you.        They want to make an example out of you.  All they are is political. They tell people how they ought to be. But you are the HEAVYWEIGHT CHAMPION of the WORLD. You're important. And they don't like your militancy, your politics. So, they'll make an example out of you.  Yes. Or, to demonstrate here is what happens to your ass if you don't...  What are your feelings about up- and-coming Ken Norton?    Let's tell it like it is. With your court and boxing problems, Muhammad, can you get a fight promoted?  Did you say you were broke?   How can you be broke?  You've made more money than all previous heavyweight champions combined. What about your management? Surely they have provided for you...    Muhammad, I'd do anything for you. But I got bosses who only give a damn about Nielsen ratings.  I thought you were resolute in your resolve to regain your crown...  What about Frazier?  You surprise me, Muhammad...  Do you think you're going to jail?  Joe Frazier told me on this show he would knock you out.  Muhammad, you T.K.O.'ed 'em...     Ali was out! He was out on his feet. Joe almost had him. Frazier must have thought Ali was playing possum. 'Cause Ali's a clown. Others have come in on Ali when he's playing possum and gotten knocked out.    You mean the Joe Frazier falling- down lesson?    Two-and-a-half-to-one. Against. We're worried you're going to get hurt.  Muhammad, I'm sorry. I have to ask. Are you really fast enough, anymore? To beat George Foreman? Many people believe you don't have the same skills, that you are not the same man you used to be ten years ago.",
        "Cosell": "Does he hate white people? Malcolm X was in town. Then he left. Was that so he wouldn't embarrass you? Liston cannot stand you...  ...cannot stand you, Cassius.   He really wants to kill you...  (doing color radio    The winner...and the new heavyweight champion of the world is Cassius Clay!  What made him so easy for you?  Was there any single point you knew you had him?  ...the arena is surrounded by FBI, the stands are only half full, the promoter has taken out a million- dollar insurance policy due to Cassius Clay's membership in the militant and radical Black Muslims because of death threats. Oh, and by the way...Sonny Liston is here, too.  Liston is down! Scarcely a minute into the first round, I can't believe it!  It's over; it's over!   \"Wide World of Sports\" is ON THE AIR.   We've entered mid- broadcast.   Cassius, it is my opinion you...    Yes, Muhammad. And to think I gave up a lucrative practice for the likes of you.       Ali pours three spoons of sugar in his coffee.     They want to make an example out of you.  All they are is political. They tell people how they ought to be. But you are the HEAVYWEIGHT CHAMPION of the WORLD. You're important. And they don't like your militancy, your politics. So, they'll make an example out of you.  Yes. Or, to demonstrate here is what happens to your ass if you don't...  What are your feelings about up- and-coming Ken Norton?     Let's tell it like it is. With your court and boxing problems, Muhammad, can you get a fight promoted?  Did you say you were broke?   How can you be broke?  You've made more money than all previous heavyweight champions combined. What about your management? Surely they have provided for you...   steps out of the truck. There is a small crowd of people who turn as ALI pulls up in a convertible. He's solemn for a moment. Then he's out of the car...      alone in the convertible parked in a distant corner of the lot.   Muhammad, I'd do anything for you. But I got bosses who only give a damn about Nielsen ratings.  I thought you were resolute in your resolve to regain your crown...  What about Frazier?  You surprise me, Muhammad...  Do you think you're going to jail?  Joe Frazier told me on this show he would knock you out.    Muhammad, you T.K.O.'ed 'em...     Ali was out! He was out on his feet. Joe almost had him. Frazier must have thought Ali was playing possum. 'Cause Ali's a clown. Others have come in on Ali when he's playing possum and gotten knocked out.      Two-and-a-half-to-one. Against. We're worried you're going to get hurt.  Muhammad, I'm sorry. I have to ask. Are you really fast enough, anymore? To beat George Foreman? Many people believe you don't have the same skills, that you are not the same man you used to be ten years ago.   A bittersweet smile and the eye contact with Ali.    Cosell knows...",
        "Bingham": "Watch what you signing, Ali.  You talkin' to me, or someone walk inna room, fat boy? Anything's do to with me I think's to d-d-do with me...I'm st-st-still a Christian.  I ain't goin' on your payroll. I like it freelance. Emphasis on \"free.\"  You been s-s-saving it up, training, Champ. You can't unleash it on this girl all sudden. You may kill her! Maybe you should spread it around more before you tie it down.  You know what you j-j-just said...?  Ellis doesn't belong in there.  I saw Bundini in New York.  ...bad shape. You better get your belt b-b-back...  You call your parents, Ali?  You p-p-p-promised you'd call them.  Ali, she's talkin' about \"Brother\" Herbert.   entering, concerned and urgent...   Bundini!  A mystery...d-d-d-daylight...  You b-b-becoming a Christian? Forgive and forget?     You mean the Joe Frazier falling- down lesson?  L-l-l-lingala.  Lingala.   They s-s-s-speak Lingala.   Waiters scurry. Ali talks to a blonde reporter from France and settles next to Lloyd Price, without a shirt. Everyone crowds around their table. A ZAIRIAN INTERPRETER and Lieutenant Nsakala are present. Ali disregards their presence because his attention tracks...   'B-b-b-bout Hong Kong, man?!   You know what I heard?    Bo'dini, you got Ali buttons?  Belinda?  You can't beat him. You can't beat him, 'cause you can't not love him.",
        "Angelo": "Man's religion's his own business. What kinda question's that?      No. You quit, it's over! Get out there. Be a yardstick. This is the big one, daddy. Get out there and run!   Weight's comin' down. 222.  What are you talking about?  Hell of a fight, champ...     Maybe we shoulda had more time between Blin and this, you know...to get back into...  So we only eked this one out. And George Foreman makes Frazier look like a sissy.  ...but, you go? We're the corner, same as always. But it ain't gonna be easy.  You got the tools, Daddy.     But they different.    Can he fight?  Are you tryin' to pull something, Don? Ali wants his title. And he wants it back in Zaire. George leaves, he ain't comin' back. George don't like it here.      The bus station.  What you say?   Waiters scurry. Ali talks to a blonde reporter from France and settles next to Lloyd Price, without a shirt. Everyone crowds around their table. A ZAIRIAN INTERPRETER and Lieutenant Nsakala are present. Ali disregards their presence because his attention tracks...    sits on the apron of the ring.      Ali joins him.     Give us a moment. Alone. Hey. This is my religion!  It's hot. Humid. Monsoon season's about to start. May hit 140 in the ring under the lights. You all right?  Where you at?  I'd worry if I was hearin' anything else.  Dance.   That's the most important...  George is playing prima donna.   He wants to make you wait.  ...keep moving. Don't let him put you into the corner. Stay off the rope!  going crazy in the corner!   Get off the ropes! Get off the ropes! Get off the ropes! Dance!",
        "Dundee": "Man's religion's his own business. What kinda question's that?      No. You quit, it's over! Get out there. Be a yardstick. This is the big one, daddy. Get out there and run!   Weight's comin' down. 222.  What are you talking about?   shouting instructions.        None get through.   Ali looks slow. Older.   Hell of a fight, champ...     Maybe we shoulda had more time between Blin and this, you know...to get back into...  So we only eked this one out. And George Foreman makes Frazier look like a sissy.  ...but, you go? We're the corner, same as always. But it ain't gonna be easy.  You got the tools, Daddy.     But they different.     Can he fight?  Are you tryin' to pull something, Don? Ali wants his title. And he wants it back in Zaire. George leaves, he ain't comin' back. George don't like it here.      The bus station.  What you say?     sits on the apron of the ring.      Ali joins him.      wrapping Ali's hands, tears the tape into narrow strips to go between the fingers. Doc Broadus, from Foreman's camp, observes the wrapping, then signs it. In addition to function, the taping feels ritualistic.   Give us a moment. Alone. Hey. This is my religion!  It's hot. Humid. Monsoon season's about to start. May hit 140 in the ring under the lights. You all right?  Where you at?  I'd worry if I was hearin' anything else.  Dance.   That's the most important...  George is playing prima donna.   He wants to make you wait.  ...keep moving. Don't let him put you into the corner. Stay off the rope!  Get off the ropes! Get off the ropes! Get off the ropes! Dance!  Get off the ropes!   What are you doin'?!  Ali, get off the ropes! Stick 'em! Jab! Off the ropes!  Off the ropes! Dance, champ, dance!",
        "Chauncey": "Yes. But I think the government's looking to negotiate a deal...   waits at the curb as Ali and Herbert pull up and get out of a car...move through the crowd...reporters shouting questions at him we don't hear, go up the steps, into the lobby, joining other recruits and M.P.'s.     They call your name. You say yes.  You sure you want to do all this? Your next three to four years are every heavyweight's prime. And there are few of those years...  Yes... We'll be in front of the U.S. Court of Appeals next month. We'll lose. Then we appeal to the Supreme Court.  Draw a crowd or not draw a crowd, Muhammad, is NOT going to make a difference with your boxing licenses. They don't want you to fight. ACLU's handling your case against the New York Boxing Commission. They discovered New York's got actual ex-murderers and ex-rapists currently licensed to fight. But revoked yours...?  No. State Department refused permission for the one-hour visa. No fight in Tijuana. Look...  I know people in the restaurant business...want to start up a chain. Muhammad Ali's \"Champ Burger\"...\"Muhammad Malts,\" \"Fist Full of Fries\"...all of that.  'Cause you need the money.  Too much.    They do that to you, too, you know.  Where you goin'?   speaks to Ali on a pay phone on ground level.   ...struck out at the appellate level in New Orleans. So we're heading back to the Supreme Court...    I'm petitioning on a conscientious objection basis. Religious belief. We'll petition that your sincere religious belief prohibits you from shooting people. I believe they'll hear that...  It's all over. You go to jail for five years.   hangs up the phone. Looks up. Starts to dial another number. A sound CRACKS OPEN THE NIGHT...  Chauncey runs up the stairs to the second-floor balcony to join...",
        "Eskridge": "Yes. But I think the government's looking to negotiate a deal...   waits at the curb as Ali and Herbert pull up and get out of a car...move through the crowd...reporters shouting questions at him we don't hear, go up the steps, into the lobby, joining other recruits and M.P.'s.     They call your name. You say yes.  You sure you want to do all this? Your next three to four years are every heavyweight's prime. And there are few of those years...  Yes... We'll be in front of the U.S. Court of Appeals next month. We'll lose. Then we appeal to the Supreme Court.  Draw a crowd or not draw a crowd, Muhammad, is NOT going to make a difference with your boxing licenses. They don't want you to fight. ACLU's handling your case against the New York Boxing Commission. They discovered New York's got actual ex-murderers and ex-rapists currently licensed to fight. But revoked yours...?  No. State Department refused permission for the one-hour visa. No fight in Tijuana. Look...  I know people in the restaurant business...want to start up a chain. Muhammad Ali's \"Champ Burger\"...\"Muhammad Malts,\" \"Fist Full of Fries\"...all of that.  'Cause you need the money.  Too much.    They do that to you, too, you know.  Where you goin'?   speaks to Ali on a pay phone on ground level.   ...struck out at the appellate level in New Orleans. So we're heading back to the Supreme Court...    I'm petitioning on a conscientious objection basis. Religious belief. We'll petition that your sincere religious belief prohibits you from shooting people. I believe they'll hear that...  It's all over. You go to jail for five years.   hangs up the phone. Looks up. Starts to dial another number. A sound CRACKS OPEN THE NIGHT...  Chauncey runs up the stairs to the second-floor balcony to join...",
        "Veronica": "seen over the heads of Zairians. She's 5 feet 10 inches tall. Without acknowledging she's the object of Ali's attention, her radar tells her she's the object of Ali's attention.   I don't think so.  Veronica Porche.    Don brought me here, but I'm not \"with\"...anybody.  L.A. But my people are from Louisiana. We're Creole. So I'm African, French, Spanish, my mother's grandfather was Jewish.  You know... ...I'm glad you said what you did. You made sure this fight stays here.  Ali, boma ye.  No.   squints, trying to figure out how he did it, because...    walk, towering over the kids. One girl holds Ali's hand. The others maintain a respectful proximity so that they don't invade the space around Ali.   Holdin' this in Africa make people proud. All over the world. They're proud of you. Anybody can fight in Vegas.  Islamic faith help you to that?",
        "Porche": "",
        "Belinda": "You don't remember when you met me once before...long ago...  You know my name! You came to my school, right before you win the title. Interviewed you for the school paper. I was eleven.  Yeah! You called me little Indian girl, then.  I loved you then, like all those kids. I never stopped. I still do.     hands and skin and faces against white in bed.   So close we are intimately inside the moment...   First time? 1961...Sister Khalilah introduced you at assembly. You said you would be heavyweight champion of the world by the time you were twenty-one!  I was eleven. I interviewed you for the student paper. You called me \"little Indian girl,\" 'cause I wore my hair real long, in a braid...I told you...\"Man, you scribble! You can't even write! You ought to go back to school until you do it better...\"  She's got to be done with that bottle.  No, he didn't. I told them about the one on the way...myself.  You wanna try changing her, for the experience?  That happen, you promise me you put some new people around you.  Where are they when we need them? You got Gene Kilroy droppin' off groceries like charity. Borrowin' money from my folks. So...?  Muhammad...?  Hell, I can't. I'm defying them by talking to you. And being with you.    sees Ali...the beating.       She begins crying.   My God.    They killed you!    Here's your water.  You could pick up parasites...  You're seeing what you want to see, Muhammad...   Mobutu is taking care of Mobutu and stealing all the wealth and sending it to Switzerland...     Yeah. 'Cause where was he when we was broke and borrowing money? And Bundini and all them that \"love you\"? Disappeared, is where they were. All over you when you got it and drop off you when you don't...     Don King talks black, lives white and thinks green! Why you defending him and \"brother\" Herbert?      Maryum is sick. Maybe I oughta go back to Chicago and look after her.  I'll be back before the fight. If that's all right, my husband...  Hello, Muhammad. Bingham.    Mr. Cosell.  Just now. Muhammad, may I have a word with you, please?  What is going on?  But I don't have to have it thrown in my face. I don't have to read about it and have people call me up on the phone about it...  Oh, hell, Muhammad, you got no discretion. You never did. You humiliate me!  I clean for you. I cook for you. I feel every punch you take.  Then why you got to be visible with women?  I live with the casual ones. But this, this...I can't hold it together anymore.  Then why do you disrespect me this way?!  Do you love her?  Do you want to marry her?  \"You're following your heart\"? That's what you do. No matter what anybody says. Or thinks. Or what it does... And what happens now?  Neither of us did.  ...I didn't come this far to quit.",
        "Ali": "When the contract run out. I want black lawyers and managers. Chauncey Eskridge on North La Salle Street...  I don't need no \"protectin'\" from myself. Why I need protecting from myself by them...?  I ain't one of their thoroughbreds! Or their charity things. \"Let's do somethin' for that well-behaved colored boy, Cassius.\" I ain't well-behaved nothing! I am a man.  And I am not Cassius. I changed my name. I am Muhammad Ali, now.  That's right.  No one \"made me\"...     I know who I'm not...I'm not drinkin'! Goin' back on my wife! I am not prayin' to no blue-eyed, blonde-haired Jesus. I ain't...  You saying I'm just like him?   in first class on a \"Ghana Airlines\" flight to Africa. Close by is Herbert Muhammad. Howard Bingham and Ali's brother, Rudy, are across the aisle from him, asleep...   The plane bumps in choppy air.  Muhammad, unable to sleep, a nervous flyer, gets up. He wanders up the aisle to the front of the plane. A Stewardess comes out of the cockpit. Muhammad slows, startled by the pilots. Both pilot and copilot are black.     No, man, I meant...in L'ville, when I growed up, they barely let black folks drive buses.   in a Mercedes convertible. It's a monumental expression of the force for the independence of black Africa. Accra is a wonder to Ali. A Third World showplace, in 1964 Ghana is alive with the optimism of emerging Africa. Infrastructure   and real estate are well-managed. Under Nkrumah, the city is in a frenzy of building public housing...    in the three-car caravan, passes the huge triumphal arch with its giant black star on the top. Thousands line the route to see the heavyweight champion and cheer him. For Ali it's another kind of parade...    They're stockbrokers and street cleaners, salesmen and secretaries, hotel managers and military officers... All is a contrast to the de facto apartheid of the middle America of Ali's experience. They all cheer his caravan as it passes.  Hey, man!!!  How you doin'? What's up, brother? I knew you were here...didn't think you were still here...  We just got here now... And, maaan, the brothers were flyin' a DC 8. Flippin' switches, navigatin', filing flight plans, talkin' French...  Where you goin'?  November.  Man, where should I go?   We're planning on Egypt.         You shouldn't have quarreled with Elijah Muhammad.  Sonji...Sonji Roi...  'Cause I love it, girl. How long you been workin' for Herbert?  What kind of name is that?  What's your father do?   So who raised you?   Whatcha doin' tomorrow?       Go ridin' with me.   I square it with Herbert.       I got a record player in my car.   Got springs and stuff.   Yeah. Only one of 'em's smart...the one with the glasses.   People all screaming and fainting. I asked him, \"This the way they act when you get big?\"    He said, \"Champ. The more real you get, the more unreal it gonna get.\"  Let's go...    I think I gonna keep you around forever, girl.  Herbert said you weren't a Muslim.  Why?  I'm no virgin...but I may as well be. I ain't jokin'! I always know when I know. See this face? I mean, you got a pretty face for a girl's face, but you ever seen somethin' as pretty as me? Now, you about five-foot-three...that's too small. But I overlook that, too, 'cause...  ...'cause of your spirit!  Yeah.   'Cause you too much fun!  But you gotta be a Muslim.  Maaan, I ain't never been with a girl like you.   That's right.   I wanna marry her.    Yeah. How 'bout it, Howard. You be my official full-time photographer.  No. Marriage is the cornerstone of Muslim life.  She gonna be a Muslim, now! So fix it up, Herbert.   past a speed bag onto Ali with Dundee + Sarria on the exercise table. They do NOT see, and we PASS them and other training boxers and MOVE IN to a portable B&amp;W TV on top of a cabinet.  ON B&amp;W TV:   MALCOLM X + MARTIN LUTHER KING, JR.  exchange greetings and introductions as if in a first-time meeting, and King turns back to CAMERA.    enters, looking for Sonji. Bundini and Cassius Clay, Sr. were laughing about something else. They got quiet. Bundini has a large water glass in his hand; Sr., a highball glass.      What's goin' on?     We're late.  What questions?!     king of the city, cruising through the pristine winter air of Chicago...   at a light, waves to a cluster of girls waiting for a bus who recognize him, go nuts...listening to Brubeck...    Dave Brubeck, loud...    stops short at a light because a man runs across the street.   What?     meets Liston, nails him with a straight right. Ali begins baiting him, dancing. Liston tries to cut off the ring, jabbing ineffectually. Ali lets Liston in, pulls back, then pivots on his right foot, throws a short right and RAMP INTO SLO-MO...to see Liston not see it coming.  The muscles of Ali's upper body contract and ripple in release after his short RIGHT catches Liston on the point of his chin. Liston drops to the canvas like a stone.   Get up, sucker! Get up and fight! No one gonna believe this!  Why you done up like that?  \"Worry\"...?  The world looks at me, girl! What if I straightened my hair, live in the white suburbs? How I am says something!   enters up the stairs. Bundini's waiting for him as are Reporters, trying to ambush him. Lots of activity in the motel forecourt.        What do I do...?  Please stay, Brother Herbert.  I ain't dead!   enters. Stands at the dresser. Only his suitcase is there. She left her chartreuse blouse. He takes it and smells the scent of her cologne. He is torn with grief at the loss of her, curling into a ball on the bed, alone in the room.    getting made up by a good-looking ASIAN COSMETOLOGIST. An ASSISTANT DIRECTOR lounges against the wall with headset, reading the newspaper...   Yeah?  Huh?  What you talking about?    ...I flunk their draft board test. Now, without testing if I am \"wiser\" or \"worser,\" they decide I can go into the Army.      I'm the best thing that ever happened to you, Howard Cosell. Without me you be a tall white man with a microphone in his mouth.   Ali pours three spoons of sugar in his coffee.   Keep talking. You were saying something half-smart...  Why? I'm no Stokely Carmichael, H. Rap Brown...  ...of a good \"Ne-gro,\" who do what he told?  I stay out of jail and I get to fight.   lined up with the twenty-five other inductees...being addressed by an Induction Officer, Naval LT. JEROME CLARIDGE...       approach from two vehicles. Rudy and SIX LARGE MUSLIMS escort Ali through the crowd of media trucks, reporters and conspicuous unmarked police cars and neighborhood people.    waves in Robert Lipsyte, the New York Times sportswriter in his late 20's we've seen before. He and Howard Bingham, waiting inside, know each other. They enter. The phone's already RINGING.    on the phone, on a long extension, joined by Lipsyte and Howard Bingham, while Bundini keeps at bay reporters at the front door. It all feels like a rock group in town for a concert.    (goes onto balcony  (wry; playing to      Man, I ain't got no quarrel with them Vietcong.  No Vietcong ever called me nigger.  So what? I ain't gonna be what anybody else want me to be. I'm not afraid to be what I want. And think how I want.   laying on the sofa. Dundee, Pacheco and Rudy have joined. There's the feeling the house is a bunker. Phones ring. Television is on. LIPSYTE, taking notes, watching Walter Cronkite on TV. He crosses to Ali. Dundee's on the phone.    What?  They gonna take away what no fighter in the world can?  What 'bout Terrell?     wearing a suit and a narrow tie at a table in front of Daley machine apparatchiks. A bald man, angrily:   Yes.  Apologize? No.    Yes, sir. I am not going to apologize to you. This isn't a courtroom. And I don't have to sit here and answer your questions.   march through the lobby. Ali gives a walking interview. He's angry. He won't slow down.   I ain't draft dodgin'! I ain't goin' to Canada. I ain't burnin' my draft card. I ain't burnin' the flag. I'm stayin' right here. And you want to throw me in jail? Go ahead. I'll do my time. I been in jail four hundred years. I'll be in jail four, five more. But I ain't goin' ten thousand miles to help murder and kill poor people for you. 'Cause if I'm gonna die, I'll die now, right here, fighting you. If I wanna die. You my enemy, not Vietcong or Chinese or Japanese. You my opposer when I want freedom. You my opposer when I want justice. You my opposer when I want equality. You want me to go somewhere for you, but you won't even stand up for me in America, for my rights and beliefs, you won't even stand up for me here at home.  What...?      What's my name?!?   something else in his eyes.   What's my name, motherfucker?!  What's my name?      with Eskridge and his other attorneys. The courtroom's packed. In the back we spot Joe Smiley, anonymous in the crowd.      on his way out of the building.    Media is held at the other end.    looks dazed, not sure how to act on the way out of court. Oddly, he shakes hands with each of a half a dozen white Houston Bailiffs. It's as if, benumbed by the verdict, he seeks human contact. The only contact available, ironically, is with the officers of the court that just convicted him.     Time has passed. It's winter. Snow's on the ground. He's in a car coat and a hat with a hooded sweatshirt underneath. Street lights are on. Traffic's slight. He walks through the whiteness as new snow falls.    under the hat brim, his gaze is internal, as it was in the opening in Miami.   Watch now...    This spooky! Don't get scared...  So what's fresh, girl?    (holds up the     You had a long braid...  That was you?     enters. CTA bus passes. Eskridge is there, waiting for him. Ali takes a coffee in a paper cup and grabs a Danish.   You see the Ellis-Quarry fight?  Ellis the champ? Man. I beatin' on him since we was sixteen. They give Ellis to Joe Frazier? Frazier'll kill him. Then they out of juice. Where's the gate? So they gotta let me fight. I fight Ellis in a phone booth...middle of Times Square...you think that draw a crowd?  Tijuana?  Can't fight here. Can't fight outside the country...  Why I want to be in the restaurant business?!  How much all this gonna cost?     hands and skin and faces against white in bed.   So close we are intimately inside the moment...   Not then...  I always tell the truth...   in a black leather jacket with a white shirt and skinny tie, speaking to an audience of college students, white and black, some Asian and Latino.    trains in grey sweats to Hendrix. He flashes 60 sit-ups hanging off a table. He sweats profusely. He has no trainers. Bingham holds his legs. Ali seems heavier.  The gym is grimy, filled with other boxers, a forest of heavy bags. Ali's one among other guys working out.    grimacing through another set, trying to stay in shape, trying to retain skills going dormant.    REVEAL Ali + Bingham watching the 1968 Olympics. NOW, Tommy Smith and John Carlos bow their heads and raise fists in black power defiance, instead of acknowledging the national anthem.     Thought we already got turned down there.  Where the money come from, Chauncey? Herbert tell me I'm runnin' on empty. Put aside \"how do that happen\"? Licenses all revoked. No passport. I can't fight here. Can't fight abroad. And what happen if I lose the Supreme Court?     How's he?  I'll call 'em, I'll call 'em... May-may! It go in one end and come out the other.  You so much better at it, mama.    I need Angelo, Rudy, Ferdie --    Go to Georgia or Alabama or Sweden. Everybody know I'm the champ. The crown is a lie. I know it's a lie. Joe Frazier know it's a lie. It time for everybody to stop lying and tell the truth.  I ain't interested in the paycheck, I'd fight Joe Frazier for free in a phone booth in Times Square, if I wasn't broke. I still will.  I'm saying it's time for everybody to quit lying! Muhammad Ali is the champ! I have to, I'll get the fight on myself. And if they offer me money, I ain't gonna turn it down.   training. There is NO entourage with him. Ali hits the heavy bag. He doubles up the left jab on the taped-together heavy bag. Sweat stains his sweats.    runs through tall reeds in the abandoned industrial landscape, ending at the lakefront and the cold, open sky and water. He's breathing hard, struggling against time to hold onto shape and prowess. He seems vulnerable against the open sky and water.    sits at the table. A deep vacancy is beginning to be there we've never seen before. May-may makes a mess.   You can't call me that no more.   entering, concerned and urgent...   Whyn't you call an ambulance or a doctor?  What's wrong with you, man?!  I leave you alone.   You called me!  What you shame yourself like this for, maaan...?! Why you shame yourself?!  You know \"low.\" You so low, the curb look like up!  Those rhymes is old.    Forget 'em.    No. There's no \"back\" to take you to...   and beyond the side of Ali's face, elevated through the slums and decrepit tenements of the south side of Chicago...the mean alleys and decaying back porches. Men gathered around 50-gallon steel drums, burning wood for warmth. Everything is corrupted or has left him.    staring into nowhere.   The city recedes. Vectors, in perspective, carry structures, buildings away. The sky is grey, going to blue. The city flees and SUDDENLY disappears as we race into the dark tunnel of subway. Ali's lost in the depths of attempting a calculation. He can't do that for which he has a genius beyond other men...      screams away from us. Red reflects off the rails past Ali's face as we descend deeper into the tunnels.   A thousand dollars to the man who brings me Howard Cosell's toupee! Dead or alive!   alone in the convertible parked in a distant corner of the lot.   Put me on, Howard.  I guarantee...it will be a historical and momentous night!  ...what Heavyweight Champion of the World? I'm not the champ. I am retired, finished, out of the game. And I ain't gonna let myself grieve and suffer none. But I know I will not fight again...  If tomorrow they say: \"We want you to fight Joe Frazier. Madison Square Garden. Millions and millionses of dollars. Here's your license back.\" I will tell them: \"I am sorry, but I am done.\"  You'll have to wonder...what me and Smokin' Joe would have looked like.  Howard, you losing your hearing along with your hair? Don't put questions to it! I am through fighting. 'Cause I got a bigger and more important match comin' up. The U.S. government. A heavier contender.  I don't know, but it's going to be a shocking and terrible fight. In fact, they might wish they let me stay in boxing.  There you go, agitatin'. You ask Smokin' Joe what he been smokin'?! Joe Frazier even dream he can whup me? He better wake up and apologize... But, if I WAS to jump in the ring with Joe, here's what you might see... Ali comes out to meet Frazier, If Frazier goes back an inch farther, Ali swings with a left, Ali swings Frazier keeps backin', but there's It a matter of time before Ali Now Ali lands with a right, what  a beautiful swing, out of the ring. referee wears a frown, Frazier come down. view. And the crowd is getting frantic. him up. He's somewhere over the Atlantic. they came to this fight, launching of a black satellite?  But don't wait for they fight. 'Cause it ain't never gonna happen. You only can wonder and imagine...  You want me to buy you a drink?  I don't wanna fight no more.   Not with you...  Who dress you, Joe?   You look like Dale Evans.  To be closer to you, honey.  There be two undefeated heavyweight champions! And they ain't fighting!  'Cause you gotta get behind this and we gotta do this.  You wanna get this on, Joe?     You and me? Or not?!  I can fight in Atlanta.  Georgia ain't got no state boxing commission. And Atlanta got a black city council; a liberal Jewish mayor, Sam something. It all set. I do a prelim in Atlanta with Jerry Quarry. But we got to get the steamroller movin' now.  You announce that if I beat Quarry you give me the title shot. So what you say...maaan?  But you know you ain't the champ yet.     sparring. Ali's sweating more than we have seen him sweat before. It's pouring off him. It stains wet his grey sweatsuit. INTO HIS EYES, through the headgear...    Ali spots...a figure step through the door. It's Bundini. Ali, seeing everything all the time, reacts not at all, turns his back. Bundini is thin, drawn, stooped, but clear- eyed. Everyone turns. It takes tremendous courage for Bundini to walk to the ring, expecting another rejection.   What you want?  You want me to take you back?       We've entered mid-fight in the second round. We're VERY CLOSE. Quarry has Ali against the ropes. Ali pushes him off. Quarry comes in again. Ali dances, feints and catches Quarry over his right eye with a jab thrown while going backwards!    can't wait for the bell to ring. He sucks in a huge breath through his nose and blows it out. Angelo applies Vaseline.    Past him, hearing him, we ARE him. We think what he thinks; see what he sees. Quarry's corner worked on the cut. Ali feints a left and throws a left cross over Quarry's attempt to block it. Quarry comes in again. Ali's next three ripping left jabs almost like karate shots...all with a sharp snap at the point of impact...   Ali knows Quarry's anguish. They embrace. Ali says things to him. And for that moment they are an island. Ali and Quarry, their arms interlocked, are their own tribe. Two pugilists, no longer adversarial, a class unto themselves. Then...    picked up by Angelo. Bundini's run into the ring.       Ali's arrived. He is coming back.    seated, being examined by Pacheco, his hands still taped. The dressing room's crowded. Belinda enters, embraces her husband. Then Ali hears a familiar voice. He sees Herbert Muhammad, along with the expressionless Joseph 13X and   another NOI Man, have entered.   All praise to Allah... ...Alaikum Salaam...  You saying I can be a Muslim again, Herbert?    When? After I promoted Quarry fight? After I won it?  I already got Frazier.  Are we talking management, talking money or talking religion?    (puts a hand on  Now, you go on out. And you make the Frazier deal.  Yeah...   and Belinda, with new twin babies; Maryum; Dundee; Pacheco; Cassius, Sr.; Sarria; and Ali's entourage. They're all around long tables, eating dinner. A large sign over the kitchen counter with \"Lana Shabazz' Ten Commandments\"...like:   #7 \"Anyone bringing guestes in for dinner without prior notice will be awarded thwacks on skull with sharpe object.\" #8 \"Please waite, Rome wasn't burnt in a day; it takes a while to burne the roaste.\" Lana Shabazz answers a phone and brings it to Ali. Ali's got one of the twins, feeding her a bottle and drinking from it, too.   What are you talking about, Howard? Quarry?   takes in the news, thanks Howard and hangs up. It is a shining moment after living under the threat of imprisonment for three-and-a-half years.   I'm free.  Supreme Court set me free.  deep in his focused concentration. His attention so arrow like it reminds us of the younger man in the Liston fight...pure purpose.    looks swollen,      out of breath. Something's wrong! Two solid Ali jabs and a      right hook connect. But they slow down Frazier not at      all. Joe Frazier, short and compact, like a pit bull, bobs      and weaves his way inside Ali's longer reach.    shouting instructions.        None get through.   Ali looks slow. Older.    Frazier, off his bobbing and weaving, launches his devastating left hook to Ali's head. Frazier is making the most of what he is: smaller. Ali clinches.    The referee separates them. Both men throw and miss...Ali on the right, Frazier on the left. Ali throws a hard left that catches Frazier but doesn't stop him. Now Frazier connects with a wild left hook into Ali's cheekbone. THE   is knocked down onto his knee. Ruled a slip, he stands immediately and continues. Ali, backed against the rope again, blocks shots, pushes Frazier into the middle of the ring...    around.     But Frazier cranks his left.     ALI SEES IT COMING...     is exhausted.    Labored breathing.     The crowd cheering Frazier.     Shut up! I lost. Get outta here...  Where's Belinda?  My hands was in sand, Angie.     My feet in water...  Woulda, shoulda, coulda... After three-and-a-half years, this...from how far back...comeback is.  I lost. You lose, you don't shoot yourself. The world goes on.    I ain't dead, baby!     C'mon.    starts an arc...or jams towards us.    taking the shot, covering and assaulting, covering with his left, which he turns into a jab, aggressively going after Norton.    fills the frame. Go behind it as they shield Ali spitting blood into a bucket.   I can move my jaw with my tongue. He got me...  Ain't stoppin' nothin'...! Nothin' stoppin'...!     watching television. The place is a huge mansion on Chicago's South Side.     They watch the Frazier-Foreman fight from Jamaica amid the wonderful chaos generated by kids and their toys, who crawl all over Ali as if he were furniture. Frazier and Foreman are in the center of the ring... We SEE Don King in Frazier's corner.   (through still-wired-  So.    (thinks; decides:  It's time to be heavyweight champion of the world again.  Man, you crazy.   Belinda's behind him. Bingham's there, Bundini, Angelo Dundee, Sarria. As they crowd to the door, we're shooting OVER ALI starting down the ramp. He looks up. We don't see what he sees. We see only the crowd of people at the foot of the ramp, including Don King in a dashiki and the crowd on the tarmac.    looking ABOVE the receiving party. The ROAR again. He looks side to side, almost distracted from King and the officials. He waves. Distant CROWD ROAR increases. They're chanting something. We don't understand the words. It contains his name. Now...    are beyond the receiving party. They're on the roof of the airport. They're sitting on balconies and fences. They're waving their arms. They're on every possible horizontal surface that can support weight. They're shouting in unison, a syncopated ROAR...his name and something else. Ali moves through the receiving party, as if in a trance, to get through the airport to the other side. Security tries to keep up...     emerges and reacts. He's electrified. Dundee, Bingham, and a few cops are with him. Everybody else got left behind. REVEAL 10,000 people are OUTSIDE the airport, cheering his arrival. Their cheer is thunder.   (to Zairian Official;  What's that mean?!   I don't understand!     is overcome. This is all for him. He is their hero. He defied the world's powerful. They tried and could not destroy him. His defiance made him their champion. And now he has come to contest his rightful title against the numb instrument of the all-powerful. He raises his arm, too, and shouts...   Ali, boma ye!  Ali, boma ye!   sits in EXTREME CLOSE-UP drinking coffee...lost in thought. He's somewhere else, puzzled, alone in his thoughts. He wears grey sweatpants, a thin-rubber long-sleeved T-shirt under his grey sweatshirt. He's oblivious to the Euro- modern furnishings. Then it's time, and he leaves...    enters from his bungalow. We SEE we're in a compound. They are white and severely truncated houses linked by sidewalks and too many large street lamps. As Ali starts to jog through this imitation of suburbia with the scale all wrong. It's like a Gulag in reverse for the rich and powerful to be within while keeping the rest of the country out. As Ali passes, REVEAL we are at the bank of the Congo River. As Ali starts his predawn run, across the river the first band of magenta tints the horizon and reflects molten on the water.       (weaves suddenly;    You out, sucker!   still jogging. Behind the signs, he becomes a magnetic attraction. People are surprised to see Ali. He's making their day. Euphoric kids parallel him, run with him, follow him...    the concrete-and-cinder-block walls to the dusty, bare ground are chromatic. Primary colors. Ethnographically interesting.   ALI SEES interiors. Broken walls. No roof. No plumbing. People come from a ditch with a shower curtain for privacy, surprised to see Ali. Faces indifferent to squalor. This is the ethnographically \"interesting\" surface of what, in fact, is civic disintegration starting to occur... It is the human concomitant to 13 years of Mobutu kleptocracy.    looks at the backs of the signs. He and we realize the signs' purpose: to hide the makeshift plastic walls and rooms made from cardboard containers and oil drums from the foreigners traveling the road to Kinshasa. One TEENAGER WITH A WITHERED ARM and a big smile runs up...   Foreman?   I kill him!   looks at individual faces. A grinning OLDER MAN with a blue transistor radio . A smiling kid. A girl with no shoes. A teenage kid jumping up and down...all looking at him. Ali makes four pieces of rope appear. He rubs them together...    Shazaam!!!       waits, sitting on a table edge in a corridor. Noise of a press conference setting. Howard Cosell crosses through, smoking. Bingham enters and gestures...they're ready. Ali waves off Bingham, stops Cosell...   Howard! How many you ugly sportswriters in there got me over Foreman? Don't lie.      This'll be the biggest upset since Sonny Liston. I want all of you to write it down! This fight is no contest!  George Foreman is a big mummy. I've officially named him \"The Mummy.\"  George punches are like \"Look out, here come the left.\" Whomp! Here come the right! Whomp! Like a Mummy. But \"The Mummy\" can't hit what it can't see. I'm fast! Gonna dance. Be all over George. George is gonna feel he surrounded. And I done somethin' new for this fight; I done rassled with an alligator.  That's right! I have rassled with an alligator. I done tussled with a whale. I done handcuffed lightning, thrown thunder in jail. That's bad! Only last week I murdered a rock. Injured a stone. Hospitalized a brick. I'm so mean, I make medicine sick.  Howard. I didn't want to talk about this, especially in front of everybody. But I talked to your wife! And she told me you're not the man you used to be...two years ago!   is entering. Lieutenant Nsakala is there, too. They time- share the facility. Foreman's entourage with conga drummers are exiting. Ali and Foreman are never closer than 10 feet apart. Foreman says nothing. Ali starts banging his hands on Foreman's conga and shouts over the percussion at Foreman...   Salaam Alaikum, brothers! The champ is here!    Bottled water. Frozen steaks. Brought all this stuff like Africans don't have steaks...  They eat it.   Mobutu eats it...     Here come \"Herbert.\"   Money? I do \"money-making\" whenever I want. Money is easy.   Don King delivered the first black- promoted championship fight in Africa!    'Cause clean-cut Muslims parading on the South Side of Chicago don't get this done! I got to put honkeys with connections and bad- ass niggers to it, too.  That what this is? Think I gonna lose? Puttin' doubt on me?  Sure.   Angelo and Bingham in the empty seating, looking at the ring under the canopy. Behind them is the rehearsal. Meanwhile...    is being taught to dance by two dancers. They fail. In the background, workers are raising gigantic Mobutu portraits. The Pointer Sisters begin.     That's right. He did three rounds. Knew he was gonna lose to Muhammad Ali and knocked hisself out. And I predict that whenever the fight is set, he might not show up!  I'm a bad man!  And you tell the same thing to George.    The whole world was gonna know. But, now, he ain't gonna show. That's why he knocked hisself out when he was training.    Yeah. Watch the bus station. Watch everything! Elephant caravans. He might sneak out by elephant.    Don't talk to Angelo like that! Don't you talk to him like that ever again!!!  You think you're callin' these shots, Don? You're not.   (segues into a   (hits the table with (French voices and   Waiters scurry. Ali talks to a blonde reporter from France and settles next to Lloyd Price, without a shirt. Everyone crowds around their table. A ZAIRIAN INTERPRETER and Lieutenant Nsakala are present. Ali disregards their presence because his attention tracks...    seen over the heads of Zairians. She's 5 feet 10 inches tall. Without acknowledging she's the object of Ali's attention, her radar tells her she's the object of Ali's attention.   Say, girl...!  C'mere.   I know you?  What's your name?  Like the sports car.  But with a little something extra. Veronica, I know you now. C'mere, sit down.  You with Don?  Where you from?  (looking at her  All them writers in there think Foreman gonna...kill me! What you think?  You been to Hong Kong?   Taiwan? Thailand?  I can't go there. All the ladies out there from Indonesia, Japan, Hawaii, India... \"Ali-i-i-e-e-e! Ali-e-e-e! Oh, Muhammad Al-i-i-i!\" You seen those people from Thailand? I was in Bangkok -- I couldn't walk. I couldn't...I just couldn't do nothin'. \"Get me outta this country!\" The women were so pretty...    But they ain't nothin' like the \"sisters.\" Ain't NOTHIN' like the sisters!     shows his bare hands. Now he rubs them together and MAGICALLY pulls from his closed fist a colored scarf.     The kids scream.    shows the scarf, pushes back his cuffs so that he can't hide anything up his sleeves. His wrists are bare. He shows both sides. Now, he takes the scarf and pushes with his right hand and feeds it into the closed fist of his left. He looks up wide-eyed at everybody. Then, he opens his fingers and the scarf is not there!    walk, towering over the kids. One girl holds Ali's hand. The others maintain a respectful proximity so that they don't invade the space around Ali.   So why you glad we still here?  That's one job.    I got two...    Listen, girl, as a Muslim, I am busted out and failed in the eyes of God. I shoulda discovered Islam at 50! 'Cause I am weak on women. They take my eyes and my heart follow...causing me to be a lovin' husband and a terrible husband...! ...green eyes and cocoa skin...? ...okay, rest of me, let's go!!     feints his left and throws a right.   It surprises Holmes.   Why not?  Hey! Look! Look at George Foreman's trainer, feelin' me up on purpose! On the side, to see if I'm in shape!  We'll, you ain't gonna find no fat! Watch out!!  She's gotta put it on.  \"George\" buttons is all I got. In my bedroom! All over the bed! Everywhere! To remind me...of all of ya'. All of ya'! Reminds me of all ya'!  Yeah.   enters with Howard Cosell and Howard Bingham and a two-man news crew.   When did you get in?  You know what's going on.  I didn't mean for it to come out...  I know that.  I didn't mean for it to be...  I don't want to hurt you. It's wrong. You're a good wife to me.  I respect you.   I always respect you.  I follow my heart.  I fight George. I didn't come this far to quit.   under the water. It flows like silver down the contours of his face and neck. He is in that zone of concentration where the best athletes go...where the pre-motor cortex's activity dominates and facial expression becomes blank, eyes look distantly...Ali's in his domain...in the groove.    and outriders depart.    wrapping Ali's hands, tears the tape into narrow strips to go between the fingers. Doc Broadus, from Foreman's camp, observes the wrapping, then signs it. In addition to function, the taping feels ritualistic.    attention is focused elsewhere...on his action:    what he will do, his strategy.   Thanks to Allah...  Why?    And I can't WAIT!  Rumble, young man, rumble! It's the \"Rumble in the Jungle\"!   starts moving towards the door. They open the door. It is guarded by a handpicked squad of paratroopers and Lieutenant Nsakala.    and entourage.      The crowd goes nuts.    The crowd roars; Angelo behind, Bundini on one side, Pacheco and Sarria.   dances back to his corner...    circles the ring. He looks at the crowd from different angles, from the corner, the center... He looks up at the lights and gets used to the heat from them.    do a shuffle. He feels the canvas. He feels the soft spots. The firm spots. He feels how much slide there is because of the resin on the canvas, how much spring there is in the boards...    sheds his robe, now, and throws a blistering array of jabs and hooks. The crowd goes nuts. Ali looks ringside and sees...    Lloyd Price...further along...Robert Lipsyte.    is shadowboxing as Foreman climbs in the ring and crosses past him, near to him. The look on Ali's face is indifferent. Foreman goes immediately to his stool. He doesn't move around the ring. He doesn't touch the ropes.   Motherfucker, you 'bout to discover you ain't nothin'.  (past the ref;     corners are clear. Ali is facing his corner, praying to Allah. Foreman is bent over at the waist, flexing and releasing the last tension in his huge shoulders, as the bell for ROUND ONE clangs...       as Angelo and Bundini's talk fades away. We see Ali's awareness in a deep concentration. He is holding counsel with himself. Ali stares into space across the diagonal to the other corner, but not really at Foreman. Ali is weighing something. A gamble. He blinks, and whatever it is, he's decided it NOW. AMBIENT SOUND starts to come back as Ali's attention returns to the present and he ignores...    turns away.     Nevertheless, it crashes into his jaw.    TIME SLOWS. He ties up George. We SEE Ali's hurt.        Dazed. But he must make George believe he's unhurt.   That all you got...?   That it?   reveals impact, but nothing diminishes the TERRIBLE FORTITUDE with which he endures. Now, he ties up George. Now, George drives Ali into the corner and pummels him.    alive, more than alert, the sharpest eyes in boxing.    are bright like stars.   His white mouth guard shines.     A grimace? A grin?     (another Foreman  Thought you was bad!   is apoplectic.   (it gets quiet; to    opens his arms as if the roar of 65,000 voices is sunlight. By opening his arms, his skin soaks it in and converts it to power. And the BELL STARTS ROUND THREE.    ties up Foreman's left in the crook of his elbow, and they stagger, married, awkwardly, into the center of ring. The referee separates them.    But, as if inconsequential...   George!    Show me something.  Where's your punch, man?!   blocks a rage of Foreman head shots with his fists, the abdominal shots within his elbows. Each Foreman punch is a haymaker.    hurt!     He holds on.    flash.     Roll in his head.   He sees neon.   TIME SLOWS...lights dim...          C'mon, chump!!!    Took somethin' away from him, Angie, that round...       covers with gloves at his head. Elbows at his ribs. When head shots come in, Ali slips them the right or left, or turns them into glancing shots, or just leans straight back so that they all fall short by quarter of an inch. The BELL.    covering, taking the most powerful hooks Foreman's thrown in the fight, one after the other to the body.       leaning way back at impossible angles -- soaking up George's shots. George is SLOWER...BUT Ali's not throwing at all!      Angelo and Bundini talk.            Neither we nor Ali hear them.     (talking to George in     goes to the ropes, throws a couple and, now, comes off the ropes. He's in the center of the ring. HE'S HUNTING. A couple of lefts from Ali. Foreman throws a haymaker and almost falls out of the ring. Ali's in the corner, having avoided the shot.    He's faking.    hits Foreman with a left. Foreman launches a short left that Ali counters with a BIG RIGHT CROSS that connects.    know the moment is...      short, chopping right turns Foreman's head down.    slams his head down and sideways.   And Foreman charges into Ali.    snaps a combination: an overhead right to Foreman's face, a short chopping left and a right hook. Ali's eyes light up like white phosphorus.     ...and Ali's left hand is extended way behind him with the wrist bent, no power. As it passes his body, Ali converts it into a left hook. As he's doing this, he's dropping his left foot back. The left foot DOES NOT support a left hand. It's for a right hand so the body can untorque across with the punch. And Ali is already cocking his right. Meanwhile, the left connects with Foreman's jaw and raises his chin. As the left is departing Foreman's chin, Ali launches the RIGHT.    comes in, Ali's torso untorques, transitioning all 217 pounds to Ali's left foot and putting that weight and power behind his right fist that crashes into George Foreman's chin...and the impact transfers to Foreman's skull...and Foreman's head snaps around. He is gone. He is falling in a spiral...a metaphor for vertigo...turning downward into   unconsciousness. And through the spiral, Ali has moved with him, pivoting with the falling Foreman, his right fist cocked to unload again if he has to. He never does...   rides through the downpour with Belinda and Bingham in the front seat. She gently holds, almost supports his hand.       have brought their children out into the rain to see the champion so they can say when they grow up they saw him pass by. Plastic or clothing protect the children from the rain. One man holds up his son. Ali rolls down the window.    Rain stopped. The cold, blue light is illuminated with magenta at its base as dawn starts to rise over the Congo River.   in a pale green shirt and slacks, walks towards the water, followed by Zairians, teenagers, some kids who snuck into the compound, two older men. No media; no elite; no hype. One policeman who staggers, drunk. Ali doesn't so much as walk to a destination as amble. He rubs the head of a 12- year-old boy who starts shadowboxing five feet in front of him.   You think you got a chance, chump? Now you in trouble.  You even dream of beating me?   You better wake up and apologize!  He too much for me!",
        "Malcolm": "...and those of you who think you came here to hear us tell you, like these Negro leaders do, that times will get better and we shall overcome someday, I tell you: you came to the wrong place.  'Cause your times will never get better until yo make them better. And any of you who think you came here to hear us tell you to turn the other cheek to the brutality of the white man and the established system of injustice in this country, to beg for your place at their lunch counter, I say again! You came to the wrong place.    Just now.    I'm front row, seat 7.  Nothing wrong with being cool, my brother. You been working toward this moment for four years.  It's a crusade in modern times. And television is beaming if off Telstar to the whole world. So Allah has brought this about for a reason... Salaam alaikum, my brother...  Man, look at that guy run!   This is the champ's time. And I'm here as a friend to celebrate his victory. So I got nothing you want...   enters into the street with his Bodyguard and looks up to a top-floor window in which he sees a light is still on at 4 a.m.   I was leaving, saw the light on...how come you're up?  I been invited to speak at Ibadan University in Nigeria. C'mon with me?  Africa.   You been there?  Nkrumah stayed with me when he was a student in New York, so we'll stop in Ghana...  Next Thursday.  You ever been so angry...have you ever been so angry that you'd explode?  What else?  ...when I heard about the four girls bombed in the 16th Street Church in Birmingham? The prohibitions of the Honorable Elijah Muhammad prevented me from speaking my voice in action. Because Birmingham was part of the civil rights movement, begging for a place at the white man's table... But dead children...are dead children. So the anger I felt, I had to contain. I locked that down! So tight my muscles seized. I lost control over the right side of my body. Leg didn't work...right arm didn't work. \"I'm having a stroke,\" I thought. I had to hold it in 'cause I wanted, all I wanted was to BREAK SOMETHING! Break a part...any part of this system. Because you are so provoked as a human being. In your spirit. In your heart... At the death of children. But I COULD DO...nothing.  (putting his glasses  I don't know. I will try when we get back. Until then I will live each day as if I am already dead.   We see Malcolm at work at the kitchen table.      It's cluttered and small. The telephone rings...   What is it, Joseph?    How about Gamilah or Khalilah?    And I heard you were coming.  When...uh, Liberia.   When you fighting Liston?  This is Maya Angelou and Ambassador Huang Ha. Amando Gonzalez is from Cuba. Taher Kaid is the Ambassador from Algeria.  Algeria. See Ben Bella... Go to Mecca, Medina. I just came back. Made my seven circuits around the Kaaba, prayed at sunrise... There were two million people...pilgrims from all over. Dressed all the same, high and low, the same. Blonde-haired, blue-eyed Muslims. Arabs. Blacks. Yeah. All of them, Muslims praying together.  It's Marlin. You'll never guess who Malcolm ran into...    Drank from the well of Zem-Zem... And you should visit Cairo. I have friends there in...  What?  Brother Muhammad...  Brother Muhammad...!    walks across the stage, aware of every little sound, every motion. He makes his way to the podium...peering beyond his glasses at the gathered. Bodyguard #1 goes to the side door instead of standing next to him...and Malcolm notices that...as he...   As-Salaam Alaikum...  Hold it, hold it, brothers! Let's be cool.   go to it.    Settle on it.   He new it was coming, as...  JOHNSON, an indifferent expression on his face, FIRES one barrel at...    ...which rips through the lectern as if paper and SLAMS a dead-center into his chest a seven-ring. 12 pellets, each the size of .32 bullet. Seven destroy Malcolm's heart. Five shred his aorta and burrow into his spine. Malcolm's hands fly back, and he topples, crashing off empty chairs onto the floor.     ...as life exhales from his mouth and his eyes go grey, dying, indifferent to Johnson emptying a second blast into him and the meaningless indignities of Hayer and Butler firing a .45 and a 9mm Luger at him.",
        "X": "in the dark. Coming toward us. Up and down in sync to an INSTRUMENTAL LEAD-IN from somewhere. A slip of light. A glimpse of somebody in shadow under a sweatshirt hood, staring at us, in and out of the dark as...    up and down, running along a dark road in the dead of night, passing vacant lots with debris amid trees and faded buildings. He is CASSIUS CLAY. He runs in construction boots. His eyes stare from under the hood. He passes the husk of an abandoned car, a pastel storefront. We're in Overtown, Miami's inner-city black neighborhood.    now runs diagonally across NW 7th INTERCUT with Cooke shouting, \"Yeah!\"     back here, now, crossing through black night and over black water of the MacArthur Causeway. We start to HEAR pop pop pop pop pop pop POP over Sam Cooke's music, and Sam Cooke's image SUPERIMPOSES as he segues from \"Feelin'\" to \"Bring It On Home.\" And the pop pop pop pop pop carries us into...    in a linear left jab. These punches are watched by Cassius' eyes in the Fifth Street Gym...studiously studying Liston's feet...straight-line movement...the jab, linear and straight at us. But it SLAMS into the Boxer, not Cassius. Down he goes. He's out. The referee pulls out his mouthpiece. It's a bloody mess. Teeth have been knocked out with it, so devastating is Sonny Liston... A distant crowd ROARS.   ...and those of you who think you came here to hear us tell you, like these Negro leaders do, that times will get better and we shall overcome someday, I tell you: you came to the wrong place.  'Cause your times will never get better until yo make them better. And any of you who think you came here to hear us tell you to turn the other cheek to the brutality of the white man and the established system of injustice in this country, to beg for your place at their lunch counter, I say again! You came to the wrong place.       past guards, Bundini, press, starts to enter. Inside, Clay's on the sofa, in his underwear, watching \"The Man With the X-Ray Eyes,\" who has the power to imbue and control from beams emitted from his eyes. Dundee and Bingham hang out.  Cassius' mind is elsewhere. His eyes float to the corner of the doorway before we see Pacheco, even though from the outside, has started to enter...     Nothing. Cassius is asleep in a lounge chair...incongruously a TV is run from the house by an extension cord. Cassius wakes. His eyes say, \"Who are you?\"   Just now.    I'm front row, seat 7.  Nothing wrong with being cool, my brother. You been working toward this moment for four years.  It's a crusade in modern times. And television is beaming if off Telstar to the whole world. So Allah has brought this about for a reason... Salaam alaikum, my brother...   breathing heavily, ignoring the stool and Dundee and Bundini, looks around. THIS IS WHAT IT'S LIKE TO BE 22, TO BE   can't wait to get out. He shuffles. He circles. He fires combinations. In the early rounds, provoked by Cassius, Liston's anger caused him to abandon his fight plan. Now, having been proven futile, Liston's confidence is gone. He's left with nothing. Psychologically and athletically, Liston is defeated. The BELL. Liston's eyes contemplate the inevitable: face nine more rounds of this.    Man, look at that guy run!    engulf them. People are their army. The sea of people press close to their heroes...reaching out to touch the champ, share a joke, laugh. A girl runs up to hug Cassius and runs off. We catch a glimpse on the periphery of Joseph 13X. Seven or eight reporters, black and white, and still photographers and Bingham, half with Cassius, half photographer in privileged position.   This is the champ's time. And I'm here as a friend to celebrate his victory. So I got nothing you want...   enters into the street with his Bodyguard and looks up to a top-floor window in which he sees a light is still on at 4 a.m.   I was leaving, saw the light on...how come you're up?  I been invited to speak at Ibadan University in Nigeria. C'mon with me?  Africa.   You been there?  Nkrumah stayed with me when he was a student in New York, so we'll stop in Ghana...  Next Thursday.  You ever been so angry...have you ever been so angry that you'd explode?  What else?  ...when I heard about the four girls bombed in the 16th Street Church in Birmingham? The prohibitions of the Honorable Elijah Muhammad prevented me from speaking my voice in action. Because Birmingham was part of the civil rights movement, begging for a place at the white man's table... But dead children...are dead children. So the anger I felt, I had to contain. I locked that down! So tight my muscles seized. I lost control over the right side of my body. Leg didn't work...right arm didn't work. \"I'm having a stroke,\" I thought. I had to hold it in 'cause I wanted, all I wanted was to BREAK SOMETHING! Break a part...any part of this system. Because you are so provoked as a human being. In your spirit. In your heart... At the death of children. But I COULD DO...nothing.  (putting his glasses  I don't know. I will try when we get back. Until then I will live each day as if I am already dead.   approaches Cassius in a suit and tie and beckons him into a living room in which sits Elijah Muhammad on a plastic- covered white sofa. Cassius is at his most deferential, awed at being in this man's presence. Elijah's power is the inverse of his size. He's short and delicate-featured. He motions for Cassius to sit beside him. Joseph 13X sits across the room with two men.    We've entered mid-scene.   Brother Malcolm...  What is it, Joseph?  The Honorable Elijah Muhammad has given the Muslim name, Muhammad Ali, to Cassius X. Herbert Muhammad's been placed in charge of his training, instead of you. Muhammad Ali will not be traveling with you to Africa.  The Honorable Elijah Muhammad has asked me to inform you your suspension has been extended indefinitely.     snakes out a building.   CAM FOLLOWS IT and we HEAR...   How about Gamilah or Khalilah?   in a Mercedes convertible. It's a monumental expression of the force for the independence of black Africa. Accra is a wonder to Ali. A Third World showplace, in 1964 Ghana is alive with the optimism of emerging Africa. Infrastructure   and real estate are well-managed. Under Nkrumah, the city is in a frenzy of building public housing...     arrives with Ali and entourage. It's a modern hotel. Meanwhile, a different group are about to depart in limos. One among them, a tall Man in a dashiki and sunglasses and carrying a walking stick, separates. He sees Ali. So does the woman next to him. She is the poet Maya Angelou.     And I heard you were coming.  When...uh, Liberia.   When you fighting Liston?  This is Maya Angelou and Ambassador Huang Ha. Amando Gonzalez is from Cuba. Taher Kaid is the Ambassador from Algeria.  Algeria. See Ben Bella... Go to Mecca, Medina. I just came back. Made my seven circuits around the Kaaba, prayed at sunrise... There were two million people...pilgrims from all over. Dressed all the same, high and low, the same. Blonde-haired, blue-eyed Muslims. Arabs. Blacks. Yeah. All of them, Muslims praying together.  It's Marlin. You'll never guess who Malcolm ran into...    Drank from the well of Zem-Zem... And you should visit Cairo. I have friends there in...  What?  Brother Muhammad...  Brother Muhammad...!   Why we meeting?  You got bad breath, man.  When do I get my expenses reimbursed...dry cleaning lots of suits isn't free...  As-Salaam Alaikum...  Hold it, hold it, brothers! Let's be cool.   enters up the stairs. Bundini's waiting for him as are Reporters, trying to ambush him. Lots of activity in the motel forecourt.        approach from two vehicles. Rudy and SIX LARGE MUSLIMS escort Ali through the crowd of media trucks, reporters and conspicuous unmarked police cars and neighborhood people.    wearing a suit and a narrow tie at a table in front of Daley machine apparatchiks. A bald man, angrily:    Time has passed. It's winter. Snow's on the ground. He's in a car coat and a hat with a hooded sweatshirt underneath. Street lights are on. Traffic's slight. He walks through the whiteness as new snow falls.    We walk past the bakery. It's closed.     Ali crosses the grey guttered street and exits into...   (from \"All Along the way outta here,  \"There's too much confusion, I can't get no relief. Business men, they drink my wine, plowmen dig my earth, None of them along the line, know what any of it is worth.\"  \"No reason to get excited, the thief, he kindly spoke. There are many here among us, who feel that life is but a joke.\"  \"But you and I, we've been and this is not our fate. So let us not talk falsely now, the hour it's getting late...\"  \"All along the watchtower, princes kept the view, while all the women came and went, barefoot servants, too.\"   speaks to Ali on a pay phone on ground level.      hangs up the phone. Looks up. Starts to dial another number. A sound CRACKS OPEN THE NIGHT...  Chauncey runs up the stairs to the second-floor balcony to join...    cradling Martin Luther King, Jr. in his arms. People SCREAM. King involuntarily spasms. Under King, dark blood pools like crude oil. Eskridge, ANDREW YOUNG and JULIAN BOND point into the Memphis afternoon.    \"Outside in the cold distance, a wild cat did growl, two riders were approaching, and the wind began to HOWL!\"   runs through tall reeds in the abandoned industrial landscape, ending at the lakefront and the cold, open sky and water. He's breathing hard, struggling against time to hold onto shape and prowess. He seems vulnerable against the open sky and water.    steps out of the truck. There is a small crowd of people who turn as ALI pulls up in a convertible. He's solemn for a moment. Then he's out of the car...    alone in the convertible parked in a distant corner of the lot.      Ali stands on the street corner, shades, incognito. A gold Cadillac pulls up: JOE FRAZIER. He is wearing a lemon yellow cowboy outfit, Stetson hat, striped pants. Ali looks at him in disbelief.    of Ali's jaw breaking, shearing, leaving an eighth-inch gap in the bone of the lower mandible...and becomes...    PUSH THROUGH people and SEE an Air Zaire DC-10 pulling in. A ramp is wheeled up. The plane stops taxiing. Zairian officials in safari suits, paratroopers with white helmets, LT. NSAKALA and hundreds of African, European and American media with cameras and lights approach. The hatch opens. A ROAR emerges from the right and left. We don't see the source.    emerges and reacts. He's electrified. Dundee, Bingham, and a few cops are with him. Everybody else got left behind. REVEAL 10,000 people are OUTSIDE the airport, cheering his arrival. Their cheer is thunder.    enters from his bungalow. We SEE we're in a compound. They are white and severely truncated houses linked by sidewalks and too many large street lamps. As Ali starts to jog through this imitation of suburbia with the scale all wrong. It's like a Gulag in reverse for the rich and powerful to be within while keeping the rest of the country out. As Ali passes, REVEAL we are at the bank of the Congo River. As Ali starts his predawn run, across the river the first band of magenta tints the horizon and reflects molten on the water.    Ali ENTERS, running. The road is lined with Mobutu's green billboards in French and English, proclaiming Zaire wonderful. A few kids emerge from behind the signs, coming out from between...and they trail Ali.      is casual, unrattled by Ali's antics. He is menacing in his indifference. It means he's ALSO immune to getting psyched out by Ali.    to percussion.      The number.     arrive, including in the first an Interpreter, Zairian Official #2, a Policeman Driver; and in the second car is Don King, Herbert, VERONICA, and another American Woman . They're in a hurry...    is being taught to dance by two dancers. They fail. In the background, workers are raising gigantic Mobutu portraits. The Pointer Sisters begin.    Waiters scurry. Ali talks to a blonde reporter from France and settles next to Lloyd Price, without a shirt. Everyone crowds around their table. A ZAIRIAN INTERPRETER and Lieutenant Nsakala are present. Ali disregards their presence because his attention tracks...    and old people, teenagers in dirty T-shirts with strange hats. Their eyes are wide.    leaving, steals a glance at Ali and Dundee. It's adversarial. The camaraderie was not false. Both are true. But being strategic, he is a threat to Ali. George has a first-rate team.     and outriders depart.    Lights flood it.   They pour down artificial sunshine.    They cheer. Ali raises his hand and salutes them. Ali dances from one end of the ring to the other...dances into George's corner... The crowd roars.    out comes Foreman in his red robe, Archie Moore following in his blue pea-cap, and Dick Sadler -- never a fashion plate -- in the world's least-attractive T-shirt, followed   by former featherweight champ Sandy Saddler.    They trade. Nothing. Foreman advances, Ali backs to the ropes, tags Foreman with a couple of harmless left jabs. Now Foreman opens up with heavy artillery. Ali gets in a couple of shots, but for the center of the round he's pummeled by Foreman. Midway through...  FOREMAN accepts a left jab, and while Ali's left arm is out with it, Foreman hammers a right into the exposed lower   midsection of Ali and then follows it with six tremendous hooks to Ali's abdomen. Ali pushes him away. Foreman comes in again. Foreman gets him on the rope again, and a surprising right on the left side of Ali's face.    Ali is braced on the ropes, as far back as the ropes will go. Foreman throws a barrage of shots, he slams in five and six at a time. THE BELL.    leaning way back at impossible angles -- soaking up George's shots. George is SLOWER...BUT Ali's not throwing at all!    Angelo and Bundini talk.            Neither we nor Ali hear them.    goes to the ropes, throws a couple and, now, comes off the ropes. He's in the center of the ring. HE'S HUNTING. A couple of lefts from Ali. Foreman throws a haymaker and almost falls out of the ring. Ali's in the corner, having avoided the shot.    He's faking.    As if finally released from the suspense, the sky opens. The monsoon begins.     Almost empty. The downpour.   The last fans rip down one gigantic image of Mobutu...    Rain stopped. The cold, blue light is illuminated with magenta at its base as dawn starts to rise over the Congo River."
    },
    "imdb_rating": "6.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZjA3OTUxNTktN2FlNC00NGUyLWI1NDktY2FlZTc5MDlmOGFhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "In 1964, a brash new pro boxer, fresh from his Olympic gold medal victory, explodes on to the scene, Cassius Clay. Bold and outspoken, he cuts an entirely new image for African Americans in sport with his proud public self confidence with his unapologetic belief that he is the greatest boxer of all time. To his credit, he sets out to prove that with his highly agile and forceful style soon making him a formidable boxer who soon claims the heavyweight championship. His personal life is no less noteworthy with his allegiance to the Nation of Islam, his friendship with the controversial Malcolm X and his abandonment of his slave name in favor of Muhammad Ali stirring up controversy. Yet, at the top of his game, both Ali's personal and professional lives face the ultimate test with the military draft rules are changed, making him eligible for military induction during the Vietnam War. Despite the fact that he could easily agree to a sweetheart deal that would have meant an easy tour of duty for himself, Ali refuses to submit on principle to cooperate in an unjust war for a racist nation that treated his people so poorly. The cost of that stand is high as he finds himself unable to legally box in his own country while his case is contested in court. What follows is a battle for a man who would sacrifice so much for what he believes in and a comeback that would cement his legend as one of the great sports figures of all time.Kenneth Chisholm (kchishol@rogers.com)",
    "name": "Ali",
    "genres": [
        "Biography",
        "Drama",
        "Sport"
    ]
}