{
    "filename": "Amadeus_script.txt",
    "imdb_id": "tt0086879",
    "imdb_url": "https://www.imdb.com/title/tt0086879",
    "characters": [
        "Katerina Cavalieri",
        "Emanuel Schikaneder",
        "Emperor Joseph II",
        "Parody Commendatore",
        "Count Von Strack",
        "Constanze Mozart",
        "Antonio Salieri",
        "Michael Schlumberg (2002 Director's Cut)",
        "Papagena (as Lisabeth Bartlett)",
        "Count Orsini-Rosenberg",
        "Wolfgang Amadeus Mozart",
        "Karl Mozart",
        "Young Salieri (as Martin Cavani)",
        "Frau Weber",
        "Leopold Mozart"
    ],
    "dialogues": {
        "Katerina": "",
        "Cavalieri": "Well, I heard you met Herr Mozart.  And he's been commissioned to write an opera. Is it true?  Is there a part for me?  How do you know?  Why not?  Where?  What's that?  Oh!  Turkish? Oh, if it's Turkish, that's different. I want to be in it.  Oh. Well perhaps you could introduce us anyway.  What does he look like?  Why?    Since you are determined, Since you are determined, Calmly, with no ferment, Welcome - every pain and woe. Bind me then - compel me! Bind me then - compel me! Hurt me. Break me! Kill me! At last I shall be freed by death!    Majesty.     Don't bother!  Don't bother.     Did you know? Had you heard?  The marriage!  Nothing! He can marry who he pleases. I don't give a damn.  How was I? Tell me honestly.  What did you think of the music?  Meaning you didn't like it.  Is her mother still lying on the floor?  I'm so relieved.  Is she a good fuck?  I assume she's the virtuoso in that department. There can't be any other reason you'd marry someone like that.  Come in!  No, no, no, no. You can't take him away now. This is his night. Won't you introduce us, Wolfgang?  You really are full of surprises, aren't you? You are quite extraordinary, you little shit!",
        "Emanuel": "",
        "Schikaneder": "(to the girls, very tipsy  No, no! You both lost. You both lost. You both have to forfeit. And the penalty is you must exchange your wigs.  Herr Mozart, why don't you name your son's penalty?  What did he say? What did he say?  I've got a good one. I've got the perfect one for you. Come over here.  Now, I want you to play our tune - sitting backwards.  And a fugue in the manner of Sebastian Bach.       Impresario de luxe   who personally will appear in every scene!     Who is it?  C-c-c-come in!  Who the devil are you? What do you want?  Dinner? How dare you? I am a nobleman. I only dine with people of my own height.      (singing to the tune of Non piu ante  Hey what?  Leporello! We want some hay - prestissimo! Leporello - where are you?  Well, how do you like that?  Yes, well, it's all good fun.  Isn't he marvelous? He cost me a bundle, that horse, but he's worth it. I tell you, if you'd played Don Giovanni here it would have been a great success. I'm not joking. These people aren't fools. You could do something marvelous for them.  'Course you would. You belong here, my boy, not the snobby Court. You could do anything you felt like here - the more fantastic the better! That's what people want, you know: fantasy. You do a big production, fill it with beautiful magic tricks and you'll be absolutely free to do anything you want. Of course, you'd have to put a fire in it, because I've got the best fire machine in the city and a big flood - I can do you the finest water effects you ever saw in your life. Oh, and a few trick animals. You'd have to use those.  I tell you I picked up a snake in Dresden last week - twelve foot long  - folds up to six inches, just like a paper fan. It's a miracle.  I'm serious. You write a proper part for me with a couple of catchy songs, I'll guarantee you'll have a triumph- de-luxe. Mind you, it'll have to be in German.  Of course! What else do you think they speak here?  So there you are. What do you say?  Ah. Well. Ah, I see you've got your manager with you. Well, Madame, how about half the receipts?  Down payment? Who do you think I am? The Emperor? Whoops, I have to go.  Stay where you are. You're going to like this next one. We'll speak again. Triumph-de-luxe, my boy!  Am I interrupting something?    I hope so. I need it immediately.  Is he happy with it?  Is this it?  What the devil is this? Requiem Mass? Does he think I'm in the funeral business?  Wolfi!  What is this?  Oh! I'm sorry! I'm sorry! What have you got for me? Is it finished?  What? The vaudeville, what'd you think?  Can I see it?  Why not?  Look, I asked you if we could start rehearsal next week and you said yes.  So let me see it. Where is it?  Look, you little clown, do you know how many people I've hired for you? Do you know how many people are waiting?  I'm paying these people. Do you realize that?  I'm paying people just to wait for you. It's ridiculous!  Oh yes? And what's so intelligent about writing a Requiem?  You're mad! She's mad, Wolfi.  Listen, Wolfi. Write it. Please. Just write it down. On paper. It's no good to anyone in your head. And fuck the Death Mass.                 Herr Salieri.  Can we come in?  But he's all right?  Well, tell him we were here, won't you?  And say everything went wonderfully. A triumph-de-luxe - say that! Tell him the audience shouted his name a hundred times.  I'll call tomorrow.  Oh, by the way, give him this. This is his share. That should cheer him up, eh?",
        "Parody": "Music!  Mirth!  Magic!",
        "Commendatore": "Down! Down!  I'm here! I'm here!      Are you drunk? You invited me. And my horse. Here he is. Ottavio!  Whoa! Whoa! Stop it!      Shut up.  (speaking to the dwarves    Oh shut up. I'm sick to death of that tune.  Shut up. I'm sick of that one too.  And that one, too!  Shut up.    Whoa! Whoa, Ottavio! Whoa!",
        "Constanze": "Stop it. Stop it!  Stop it!  No! No! No!  Where?  Fartsbishop!  Your Grace, I've got something to tell you. I want to complain about this man.  Why not?  That's stupid.  Do you think that's funny?  Oh, ha, ha, ha.  Yes, you are. You're very sick.    No, I'm not playing this game.  No!  Iram - marry Em - marry me! No, no! You're a fiend. I'm not going to marry a fiend. A dirty fiend at that.  Tub - but i-tub - but I vol - love but I love ui - You. I love you!  What?  Eat  Eat my - ah!  Mother, please!    Are you all right?  Excuse me, Wolfi. Mama is not feeling very well. Can we leave now?  I will.  I think you're mad! You're really mad!  One royal pupil and the whole of Vienna will come flocking. We'd be set up for life!  No, they will not. I know how things work in this city.  Well, I'm not borrowing any more money from my mother, and that's that!  Yes!  How are we going to live, Wolfi? Do you want me to go into the streets and beg?  All they want to see is your work. What's wrong with that?  This isn't pride. It's sheer stupidity!  Excellency!  That's right, Your Excellency. I've come on behalf of my hus band. I'm - I'm bringing some samples of his work so he can be considered for the royal appointment.  He's terribly busy, sir.  Would it be too much trouble, sir, to ask you to look at them now? While I wait.  I - I really cannot do that, Your Excellency. You see, he doesn't know I'm here.  My husband is a proud man, sir. He would be furious if he knew I'd come.  No, sir. This is my own idea.  Sir, we really need this job. We're desperate. My husband spends far more than he can ever earn. I don't mean he's lazy - he's not at all - he works all day long. It's just! he's not practical. Money simply slips through his fingers, it's really ridiculous, Your Excellency. I know you help musicians. You're famous for it. Give him just this one post. We'd be forever indebted!  Oh! They're wonderful.  Thank you very much, Your Excellency.  That's very tempting, but it's impossible, I'm afraid. Wolfi would be frantic if he found those were missing. You see, they're all originals.  Yes.  Yes, sir. He doesn't make copies.  Is it no good?  Oh yes. He's really proud of his work.  So, will you help him?  Oh, thank you, sir!  Tonight?  What for?  What do you mean?  But! I'm a married woman!  Well, I'm here. My husband has gone to a concert. He didn't think I would enjoy it.  I do apologize for this afternoon. I behaved like a silly girl. Where shall we go?  Should we stay here? It's a charming room. I love these candlesticks. Were they here earlier? I didn't notice them I suppose I was too nervous.  Wolfgang was given some candlesticks by King George in England, but they were only wood. Oh, excuse me. Let's not talk about him. What do you think of this? It's real lace. Brussels.  Well, it's much too good for every day. I keep saying to Wolfi, don't be so extravagant. Presents are lovely, but we can't afford them. It doesn't do any good. The more I tell him, the more he spends. Oh, excuse me! There I go again.  Do you still want to look at this? Or don't we need to bother anymore? I imagine we don't, really.  You shit! You shit! You rotten shit!  What are you staring at?  Tell them to go away. I don't want to see anybody.  Tell them to go!  No!  I love you! I love you!  I love you. Please stay with me. I'm frightened.  Stop it, Wolfi. I look dreadful. Welcome to our house, Herr Mozart.  Oh, yes.  In three months! Papa.  May I offer you some tea, Herr Mozart?  Wolfi!  Wolfi, I think your father's tired. I'll cook us something here.  This is just a game, Papa!  Salieri! Do Salieri!    There's a young girl to see you.  I don't know.  She won't talk to me. She says she has to speak to you.  What do you mean? What admirer?  What is ridiculous? Wolfi has many admirers in Vienna. They love him here. People send us gifts all the time.  Well, this is none of your business. Whoever sent you is going to pay, no?  Who is we? Who is letting who? Could you please wait outside?  Look, old man, you stay out of this. We spend a fortune on you, more than we can possibly afford, and all you do is criticize, morning to night. And then you think you can -  No, it's right he should hear. I'm sick to death of it. We can't do anything right for you, can we?  And so you do! The only time you come out is to eat.  Oh, now I'm a bad housekeeper!      Good! Come in. You'll start with that room there. It's filthy!    These gentlemen are from Salzburg.  Wolfi! Your father is dead.  Your father is dead.  How much will you pay him?  I'm talking about now. How much will you give him now? Down payment?  You're not going to do this?  When? We need money now. Either he pays now, or you don't do it.  I don't trust this man. And I didn't like what he did with your opera. It was common.  Half the house! You'll never see a penny. I want it here, in my hand.  Shut up! I'll not let you put anything in my hand until I see some money.  Wolfi? Wolfi!  Who was that?  I heard voices.  What's the matter?  What's that? Oh! Who gave you this? How much is it? Wolfi, who gave you this?  Why not?  Wolfi. Wolfi!  Why?  Not at all.  He's not in. But he's working on it. He said to tell you.  Leave him alone!  He's doing his best.  You know what's ridiculous? Your libretto, that's what's ridiculous. Only an idiot would ask Wolfi to work on that stuff!  Money! Money!  Oh yes, and who are you? He's worked for Kings. For the Emperor. Who are you?  Oh yes, sir. He's all right. And he's working on it very hard.  Wolfi, I think you really are going mad. You work like a slave for that idiot actor who won't give you a penny and here. This is not a ghost! This is a real man who puts down real money. Why on earth don't you finish it?  Give me one reason I can understand.  Why not?  No, this is really awful. You're drunk, aren't you? Be honest - tell me - you've been drinking. And I'm so stupid I stay here and listen to you!  It's not fair! I worry about you all the time. I try to help you all I can and you just drink and talk nonsense and - and frighten me! It's not fair!  Please! Let me sit here. Let me stay here with you. I promise I won't say all word. I'll just be here, so you know no one's going to hurt you. Please, please!  I want to go!  I want to go back to Vienna.  Yes!  I feel wrong. I feel wrong being here.  What are you doing here?  Why you?  Well, thank you very much. You can go now.  No, he doesn't. And I don't want you here. Just go, please.  And I'm asking you -  Wolfi, I'm back. I'm still very angry with you, but I missed you so much.  I'll never leave you again. If you'll just try a little harder to be nice to me. And I'll try to do better, too. We must. We must! This was just silly and stupid.  What is this?  Oh no, not this. Not this, Wolfi! You're not to work on this ever again! I've decided.    He's not going to work on this anymore. It is making him ill. Please.    Thank you.  Good night.  I regret we have no servants to show you out, Herr Salieri. Respect my wish and go.  Wolfi? Wolfi?",
        "Mozart": "Miaouw! Miaouw! Mouse-wouse? It's Puss-wuss, fangs-wangs. Paws-claws. Pounce-bounce!  I am! I am! I'm stopping it - slowly. You see! Look, I've stopped. Now we are going back.  Yes! Back! Back! Listen - don't you know where you are?  We are in the Residence of the Fartsbishop of Salzburg.  Go ahead, tell him. Tell them all. They won't understand you anyway.  Because here everything goes backwards. People walk backwards, dance backwards, sing backwards, and talk backwards.  Why? People fart backwards.  Yes, I think it's brilliant. You've been doing it for years.  Sra-I'm-sick! Sra-I'm sick!  No, no. Say it backwards, shit-wit. Sra-I'm-sick Say it backwards!  Em iram! Em iram!  No, this is serious. Say it backwards.  Just say it - you'll see. It's very serious. Em iram!  Em iram!  Ui-vol-i-tub!  Tish-I'm tee. What's that?  Tish-I'm-tee.  Yes.  My music! They've started! They've started without me!  Certainly!  Well, I think that went off remarkably well, don't you?  These Viennese certainly know good music when they hear it.  What do you mean?  Why what, sir?  Humiliated?  If His Grace is not satisfied with me, he can dismiss me.  No, Your Grace! I mean with all humility, no. I would rather you dismissed me. It's obvious I don't satisfy.  Excuse me!  And the other one?  And the other one?  Oh, they're both so beautiful, I can't decide. Why don't I have two heads?  Your Majesty!  Oh, thank you.    I know your work well, Signore. Do you know I actually composed some variations on a melody of yours?  Mio caro Adone.  A funny little tune, but it yielded some good things.    Majesty!  Oh, German! German! Please let it be German.  Because I've already found the most wonderful libretto!  I - I don't think you have, Herr Director. Not yet. I mean, it's quite n - Of course, I'll show it to you immediately.  It's actually quite amusing, Majesty. It's set - the  whole thing is set in a - in a -  In a Pasha's Harem, Majesty. A Seraglio.  Exactly.  Well not especially. It can be in Turkish, if you really want. I don't care.  Why not? It's charming. I mean, I don't actually show concubines exposing their! their! It's not indecent! It's highly moral, Majesty. It's full of proper German virtues. I swear it. Absolutely!  Love, Sire!  No, I don't think you do. I mean watching Italian opera, all those male sopranos screeching. Stupid fat couples rolling their eyes about! That's not love - it's just rubbish.  Majesty, you choose the language. It will be my task to set it to the finest music ever offered a monarch.  Keep it, Sire, if you want to. It is already here in my head.  I think so, Sire, yes.    That really doesn't work, does it?  Did you try this? Wouldn't it be just a little more -?  Or this - yes, this! Better.  It is new, it is, isn't it, Sire?  And German?  So then you like it? You really like it, Your Majesty?  What do you mean, Sire?  I don't understand. There are just as many notes, Majesty, as are required. Neither more nor less.    Which few did you have in mind, Majesty?  Majesty, this is Madame Weber. She is my landlady.  Well - Well we haven't quite received my father's consent, Your Majesty. Not entirely. Not altogether.  Twenty-six.  Katherina! I'll tell you what I'm going to do. I'm going to write another aria for you. Something even more amazing for the second act. I have to get some water. Her mother is lying on the stage.  What?  I'll be right back.  You should really go home now, Frau Weber. Your carriage must be waiting.  I have to talk to the singers.  Oh - excuse me!  No, she's fine.  Did you like it, then?  It really is the best music one can hear in Vienna today. Don't you agree?  What??  Of course.  Excuse us, Fraulein. Good night, Signore.  I will.  Most beloved father, it is done. Do not blame me that I did not wait to see your dear face. I knew you would have tried to dissuade me from my truest happiness and I could not have borne it. Your every word is precious to me. Remember how you have always told me Vienna is the City of Musicians. To conquer here is to conquer Europe! With my wife I can do it.  I vow I will become regular in my habits and productive as never before. She is wonderful, Papa, and I know that you will love her. And one day soon when I am a wealthy man, you will come and live with us, and we will be so happy. I long for that day, best of Papas, and kiss your hand a hundred thousand times.  What is this, Herr Chamberlain?  Why do I have to submit samples of my work to some stupid committee? Just to teach a sixteen-year-old girl.  Is the Emperor angry with me?  Then why doesn't he simply appoint me to the post?  No, but I'm the best.  Who is on this committee?  Naturally, the Italians! Of course! Always the Italians!  They hate my music. It terrifies them. The only sound Italians understand is banality. Tonic and dominant, tonic and dominant, from here to Resurrection! Ba-ba! Ba-ba! Ba-ba! Ba-ba! Anything else is morbid.  Show them one interesting modulation and they faint. Ohime! Morbidezza! Morbidezza! Italians are musical idiots and you want them to judge my music!  Must I? Well, I won't! I tell you straight: I will not!     Oh, leave me alone.  They'll come anyway. They love me here.  Oh yes? You always know everything.  You borrowed money from your mother?  Well, don't do that again!  Don't be stupid.  Shut up! Just shut up! I don't need them.     Stanzi! Stanzi! Stanzi-Manzi!  Sssh!  Sssh! Stay here.       Stanzi!  What's the matter? What is it? Stanzi!  Stop it now. Stop it. I've brought some friends to meet you. They're next door waiting. Do we have anything to eat? They're all starving.  What's the matter with you?  Sssh. What is it? Tell me.  Yes!  Your Excellency, you requested some specimens of my work. Here they are. I don't have to tell you how much I need your help. I truly appreciate your looking at these. I have pressures on me - financial pressures. As you know, I'm a married man now.  She is well. She is - well, actually, I'm about to become a father! She only told me last night. You are the first to know.  So you see, this post is very important to me right now.  Why? Here is the music. It's here. I am submitting it humbly. Isn't that what you wanted?  Filled? That's impossible! They haven't even seen my work. I need this post. Please, can't you help me? Please!  Whom did they choose?  Sommer? Herr Sommer? But the man's a fool! He's a total mediocrity.  But I can't lose this post, I simply can't! Excellency, please. Let's go to the palace, and you can explain to the Emperor that Herr Sommer is an awful choice. He could actually do musical harm to the Princess!  Look, I must have pupils. Without pupils I can't manage.  No, but I'm broke. I'm always broke. I don't know why.  How can anyone say that? We have no cook, no maid. We have no footman. Nothing at all!  They're stupendously successful. You can't get a seat. The only problem is none will hire me. They all want to hear me play, but they won't let me teach their daughters. As if I was some kind of fiend. I'm not a fiend!  Do you have a daughter?  Well, could you lend me some money till you have one? Then I'll teach her for free. That's a promise. Oh, I'm sorry. I'm being silly. Papa's right - I should put a padlock on my mouth. Seriously, is there any chance you could manage a loan? Only for six months, eight at most. After that I'll be the richest man in Vienna. I'll pay you back double. Anything. Name your terms. I'm not joking. I'm working on something that's going to explode like a bomb all over Europe!  I'd better not. It's a bit of a secret.  Actually, it's a big secret. Oh, this is delicious! What is it?  Ah. Italian?  Two thousand, two hundred florins is all I need A hundred? Fifty?  I can't say. Really  And which one of them do you want me to teach?    I'm afraid I am.  Really?  Good morning, Fraulein Schlumberg.  I'd like a little wine, if you have it.  Now, please play me something. Just to give me an idea. Anything will do.  Well, yes! on the whole. I suppose. How long have you been playing, Fraulein?  Who was your teacher?  Thank you, Madame. Come on now - courage. Play me something you know.  Perhaps it would be better if we were left alone. I think we're both a little shy.  Perhaps if I were to play a little first, it might encourage the Fraulein. Why don't you let me try the instrument? All right?  (barely controlling himself     Papa! PAPA!      Why are you here?  Of course, welcome! Welcome ten thousand times. Papa! my Papa!  Feed? Well, of course she feeds me. She stuffs me like a goose all day long. She's the best cook in the world. I mean, since Mama. Just wait, you'll see.  I don't know. Stanzi? Stanzi!  Oh, yes. Oh, I mean no - not exactly like this. I mean today - just today, Stanzi - I remember now. She had to go - yes! She had to help her mother. Yes, she's like that. Her mother's a very sweet woman, you'll see.  Oh! I didn't know you were home. Stanzi, this is my father.  We'll wait, we'll wait. Why don't you get up now, darling?  She's very tired, poor creature. You know me: I'm a real pig. It's not so easy cleaning up after me.  Oh we could, if we wanted to, but Stanzi won't hear of it. She wants to do everything herself.  It couldn't be better.  What do you mean? It's wonderful. Really, it's - it's marvelous! People love me here.  Who? Who says that? Now that's a malicious lie!  Pupils?  Yes.  I don't know. It's not important. I mean, I don't want pupils. They get in the way. I've got to have time for composition.  This one will.  Oh, let's not talk about it.  It's a secret.  It's too dangerous, Papa. But they're going to love it. Ah, there she is!  My Stanzi - look at her! Isn't she beautiful? Come on now, confess, Papa. Could you want a prettier girl for a daughter?  He's not Herr Mozart. Call him Papa.  Isn't that marvelous? We're delighted.  Didn't I? I thought I did. I'm sure I did.  Tea? Who wants tea? Let's go out! This calls for a feast. You don't want tea, Papa. Let's go dancing. Papa loves parties, don't you?  What? How can you be so boring? Tea!  Why not? Oh, come, Papa! What better way could I spend it than on you? My kissable, missable, suddenly visible Papa!    Oh no, Papa, please! Don't spoil the fun. Come on. Here, take mine.  Yes, Papa, name it. Name it. I'll do anything you say!  Papa, the rule is you can only give penalties that can be performed in the room.  But my penalty. I've got to have a penalty.  Oh, that's really too easy. Any child can do that.  Give me a name. Who shall I do? Give me a name.  Now that's hard. That's very hard. For Salieri one has to face the right way around.      What is it?  What does she want?  Well, ask her!  Oh, damn!     Yes?  That's right.  What?  Are you saying that someone is paying you to be our maid and doesn't want us to know who he is?  Papa, is this your idea?  Are you playing a trick on me?  Stanzi!  Papa!  No one calls you that.                      Thank you, Sire!  Baron!  Majesty, may I ask you to do me the greatest favour?  May I introduce my father? He is on a short visit here and returning very soon to Salzburg. He would so much like to kiss your hand. It would make his whole stay so memorable for him.  Father -  Yes, Sire.  Who told you this, Majesty?  Well, yes, I admit it is.  Well, Majesty, it is only a comedy.  But, Your Majesty -  Sire, I swear to Your Majesty, there's nothing like that in the story. I have taken out everything that could give offense. I hate politics.  But, Majesty, this is just a frolic. It's a piece about love.  But it's new, it's entirely new. It's so new, people will go mad for it. For example, I have a scene in the second act - it starts as a duet, just a man and wife quarreling. Suddenly the wife's scheming little maid comes in unexpectedly - a very funny situation. Duet turns into trio. Then the husband's equally screaming valet comes in. Trio turns into quartet. Then a stupid old gardener - quartet becomes quintet, and so on.  On and on, sextet, septet, octet! How long do you think I can sustain that?  Guess! Guess, Majesty. Imagine the longest time such a thing could last, then double it.  Twenty, sire! How about twenty? Twenty minutes of continuous music. No recitatives.    Elevated? What does that mean? Elevated! The only thing a man should elevate is - oh, excuse me. I'm sorry. I'm stupid. But I am fed up to the teeth with elevated things! Old dead legends! How can we go on forever writing about gods and legends?  Oh, bello, bello, bello! Come on now, be honest. Wouldn't you all rather listen to your hairdressers than Hercules? Or Horatius? Or Orpheus? All those old bores! people so lofty they sound as if they shit marble!  Forgive me, Majesty. I'm a vulgar man. But I assure you, my music is not.  Sire, the whole opera is finished. Do you know how much work went into it?  How can I persuade you if you won't let me show it?  Just let me tell you how it begins.  May I just do that, Majesty? Show you how it begins? Just that?  Look! There's a servant, down on his knees. Do you know why? Not from any oppression. No, he's simply measuring a space. Do you know what for? His bed. His wedding bed to see if it will fit.  Certainly, Herr Director.  Five minutes, please!  Yes, but this is not a ballet. This is a dance at Figaro's wedding.  But surely the Emperor didn't mean to prohibit dancing when it's part of the story.  What are you doing?  What are you doing, Herr Director?  Please! Please. I've no one else to turn to. Please!  It's unbelievable! The Director has actually ripped out a huge section of my music. Pages of it.  I don't know. They say I've got to re-write the opera, but it's perfect as it is. I can't rewrite what's perfect. Can't you talk to him?  Oh, I could kill him! I mean really kill him. I actually threw the entire opera on the fire, he made me so angry!  Oh no! My wife took it out in time.  It's not fair that a man like that has power over our work.  Oh, Excellency, would you?  Thank you! Oh, thank you.  Oh yes, certainly. Certainly, Herr Director!  Ladies and gentlemen, we're going from where we stopped. The Count: Anches so. Right away, please!  Nine performances! Nine! That's all it's had - and withdrawn.  But what is it they don't like?  What did you think of it yourself? Did you like it at all?  It's the best opera yet written. I know it! Why didn't they come?  I know, I know. Perhaps you should give me some lessons in that.  Oh no, the honour would be all mine.  Grazie, a lei, Signor Antonio!    That kind of music should be punishable by death.  How could I not?  How could it not, Excellency?  I never knew that music like that was possible.  Oh no! One hears such sounds and what can one say, but - Salieri!     Oh. Everybody's here! We've got guests. Good. I've brought some more.  We'll have a little party. Come in. Come in. You know Herr Schikaneder? This is! a very nice girl.  Yes, my love?  Salzburg.  We were just talking about Salzburg. If you've come from my friend the Fartsbishop, you've arrived at just the right moment. Because I've got good news for him. I'm done with Vienna. It's over, finished, done with! Done with! Done with!  What?  Wonderful! He liked the monkey, didn't you?  I liked the horse.  I'd like to try them someday. I'm not sure I'd be much good at it.  Animals?  German!  No, no, I love that. I'd want it to be in German. I haven't done anything in German since Seraglio.  Half the receipts! Stanzi!  Why not? Half the house!  Oh, Stanzi.      Is my pupil still anxious to learn the art of music?  Really? Perhaps your dear wife might care to profit from my instruction?  Well. Since it appears nobody is eager to hire my services, could you favour me with a little money instead?  If a man cannot earn, he must borrow.  No doubt, sir. But I am endowed with talent, and you with money. If I offer mine, you should offer yours.  Please. I'll give it back, I promise. Please, sir.  Please. Please. Please. Please. Please. Please.      What work?  What dead? Who is dead?  Who are you?  How much?  How long will you give me?  No one.  I'm not telling you.  You'd think I was mad.      No. Don't answer it!  Tell him I'm not here. Tell him I'm working on it. Come back later.  Leave that alone!  Put it down!  Put it down, I said! It's nothing for you.  What?  Yes.  No.  Because there's nothing to see.  Well, we can.  Here. It's all right here, in my noodle. The rest is just scribbling. Scribbling and bibbling. Bibbling and scribbling. Would you like a drink?             I don't have it yet. It's not finished. I'm sorry, but I need more time.  No, no! I promise you, I'll give you a wonderful piece - the best I ever can!  This is my wife, Stanzi. I've been sick, but I'm all right now. Aren't  Give me two more weeks. Please.  I can't write it!  It's killing me.  Go back to bed.      Stanzi? Stanzi-marini-bini?  What happened? Is it over?  No, no. I have to get back. I have -           Not here! She's not well, either. She went to the Spa.  You're so good to me. Truly. Thank you.  I mean to come to my opera. You are the only colleague who did.  This is only a vaudeville.  Do you mean that?  I have bad fancies. I don't sleep well anymore. Then I drink too much, and think stupid things.  The doctor thinks I am. But -  I'm too young to be so sick.  No! No, it's him!  The man. He's here.  Tell him to go away. Tell him I'm still working on it. Don't let him in!  Wait! Ask him if he'd give me some money now. Tell him if he would, that would help me finish it.  He knows. He knows!        What happened?  Another? But that's too soon! Tomorrow night? It's impossible! Did he say a hundred?  Would you? Actually, you could.  But you'd have to swear not to tell a soul. I'm not allowed.  You know, it's all here in my head. It's just ready to be set down. But when I'm dizzy like this my eyes won't focus. I can't write.  A Mass. A Mass for the Dead.     Where did I stop?  So now the Confutatis. Confutatis Maledictis. When the wicked are confounded. Flammis acribus addictis. How would you translate that?  Do you believe in it?  A fire which never dies. Burning one forever?  Strange!  We ended in F Major?  So now - A minor. Suddenly.  The Fire.  Common time.  Start with the voices. Basses first. Second beat of the first measure -  Third measure, second beat starting on E. Flam-mis a-cri-bus ad-dic-tis. And fourth measure, fourth beat - D. Ma-le-dic-tis, flam-mis a-cri-bus ad- dic-tis. Do you have that?  Sing it back.  Good. Now the tenors. Fourth beat of the first measure - C. Con-fu-ta-tis. Second measure, fourth beat on D. Ma-le-dic-tis. All right?  Fourth measure, second beat - F. Flam-mis a-cri-bus ad-dic-tis, flam- mis a-cri-bus ad-dic-tis.  Now the orchestra. Second bassoon and bass trombone with the basses. Identical notes and rhythm. The first bassoon and tenor trombone -  It couldn't be simpler.  With the tenors.  Exactly. The instruments to go with the voices. Trumpets and timpani, tonic and dominant.  Oh no. Now for the Fire. Strings in unison - ostinato on all - like this.      Show me.    Yes, yes - go on. The Voca Me. Suddenly sotto voce. Write that down: sotto voce, pianissimo. Voca me cum benedictis. Call me among the blessed.  C Major. Sopranos and altos in thirds. Altos on C. Sopranos above. Vo-ca, vo-ca me, vo-ca me cum be-ne- dic-tis.  Yes, and on 'dictis'.  And underneath, just violins - arpeggio.        Then let me hear it. All of it. The whole thing from the beginning - now!          Do you want to rest a bit?  We'll stop for just a moment. Then we'll do the Lacrimosa.  Would you stay with me while I sleep a little?  I am so ashamed.  I was foolish. I thought you did not care for my work - or me. Forgive me. Forgive me!",
        "Antonio": "",
        "Salieri": "Mozart! Mozart! Mozart. Forgive me! Forgive your assassin! Mozart!  Show some mercy! I beg you. I beg you! Show mercy to a guilty man!  Mozart! Mozart! I confess it! Listen! I confess!     Mozart! Mozart! I cannot bear it any longer! I confess! I confess what I did! I'm guilty! I killed you! Sir I confess! I killed you!  Mozart, perdonami! Forgive your assassin! Piet! Piet! Forgive your assassin! Forgive me! Forgive! Forgive!              What do you want?  About what?  So?  What do you want?  Leave me alone.  Do you know who I am? You never heard of me, did you?  Are they?  I do not seek forgiveness.  How well are you trained in music?  Where?  Then you must know this.  I'm surprised you don't know. It was a very popular tune in its day. I wrote it. How about this?  This one brought down the house when we played it first.    (taking his hands off the keys  Can you recall no melody of mine? I was the most famous composer in Europe when you were still a boy. I wrote forty operas alone. What about this little thing?  I didn't. That was Mozart. Wolfgang Amadeus Mozart. You know who that is?  Ah - you've heard that?    Do you believe it?  He was murdered, Father! Mozart! Cruelly murdered.  He was my idol! I can't remember a time when I didn't know his name! When I was only fourteen he was already famous. Even in Legnago - the tiniest town in Italy - I knew of him.  I was still playing childish games when he was playing music for kings and emperors. Even the Pope in Rome!  I admit I was jealous when I heard the tales they told about him. Not of the brilliant little prodigy himself, but of his father, who had taught him everything.  My father did not care for music. He wanted me only to be a merchant, like himself. As anonymous as he was. When I told how I wished I could be like Mozart, he would say, Why? Do you want to be a trained monkey? Would you like me to drag you around Europe doing tricks like a circus freak? How could I tell him what music meant to me?  Even then a spray of sounded notes could make me dizzy, almost to falling.  Whilst my father prayed earnestly to God to protect commerce, I would offer up secretly the proudest prayer a boy could think of. Lord, make me a great composer! Let me celebrate your glory through music - and be celebrated myself! Make me famous through the world, dear God! Make me immortal! After I die let people speak my name forever with love for what I wrote! In return I vow I will give you my chastity - my industry, my deepest humility, every hour of my life. And I will help my fellow man all I can. Amen and amen!  And do you know what happened? A miracle!       Suddenly he was dead. Just like that! And my life changed forever. My mother said, Go. Study music if you really want to. Off with you! And off I went as quick as I could and never saw Italy again. Of course, I knew God had arranged it all; that was obvious. One moment I was a frustrated boy in an obscure little town. The next I was here, in Vienna, city of musicians, sixteen years old and studying under Gluck! Gluck, Father. Do you know who he was? The greatest composer of his time. And he loved me! That was the wonder. He taught me everything he knew. And when I was ready, introduced me personally to the Emperor! Emperor Joseph - the musical king!  Within a few years I was his court composer. Wasn't that incredible? Imperial Composer to His Majesty! Actually the man had no ear at all, but what did it matter? He adored my music, that was enough. Night after night I sat right next to the Emperor of Austria, playing duets with him, correcting the royal sight-reading. Tell me, if you had been me, wouldn't you have thought God had accepted your vow? And believe me, I honoured it. I was a model of virtue. I kept my hands off women, worked hours every day teaching students, many of them for free, sitting on endless committees to help poor musicians - work and work and work, that was all my life. And it was wonderful! Everybody liked me. I liked myself. I was the most successful musician in Vienna. And the happiest. Till he came. Mozart.  One day he came to Vienna to play some of his music at the residence of his employer, the Prince-Archbishop of Salzburg. Eagerly I went there to seek him out. That night changed my life.  As I went through the salon, I played a game with myself. This man had written his first concerto at the age of four; his first symphony at seven; a full-scale opera at twelve. Did it show? Is talent like that written on the face?  Which one of them could he be?  So that was he! That giggling, dirty- minded creature I'd just seen crawling on the floor. Mozart. The phenomenon whose legend had haunted my youth. Impossible.  Extraordinary! On the page it looked nothing. The beginning simple, almost comic. Just a pulse - bassoons and basset horns - like a rusty squeezebox. Then suddenly - high above it - an oboe, a single note, hanging there unwavering, till a clarinet took over and sweetened it into a phrase of such delight! This was no composition by a performing monkey! This was a music I'd never heard. Filled with such longing, such unfulfillable longing, it had me trembling. It seemed to me that I was hearing a voice of God.  But why?    Why?  Would God choose an obscene child to be His instrument? It was not to be believed! This piece had to be an accident. It had to be!  I think it is an interesting notion to keep Mozart in Vienna, Majesty. It should really infuriate the Archbishop beyond measure - if that is your Majesty's intention.     Si.  Ah! Here she comes. Fraulein Lorl, good morning.  What have you got for me today? Let me see.  Ah-ha! Siena macaroons - my favourites. Give my best thanks to the baker.  Thank you. Are you well today, Fraulein Lorl?  Bene! Bene!  Grazie, Signore.  Majesty, I hope you won't think it improper, but I have written a little March of Welcome in his honour.    Majesty.  You do me too much honour, Sire.  A-flat, Majesty.    Really?  Ah!  My pleasure.  Excuse me, Sire, but what do you think these could be? Being a foreigner, I would love to learn.  Ah, love! Well of course in Italy we know nothing about that.     Grazie, Signore.  Yes?  Bene.     Good morning.  Really? What else did he tell you today? Give me some gossip.  Oh? News travels fast in Vienna.  Yes.  No.  Well even if there is, I don't think you want to get involved with this one.  Well, do you know where it's set, my dear?  In a harem.  A brothel.  A Turkish brothel.  My dear, it will hardly enhance your reputation to be celebrated throughout Vienna as a singing prostitute for a Turk.  Perhaps.  You might be disappointed.  Looks and talent don't always go together, Katherina.  There she was. I had no idea where they met - or how - yet there she stood on stage for all to see. Showing off like the greedy songbird she was. Ten minutes of ghastly scales and arpeggios, whizzing up and down like fireworks at a fairground.     Understand, I was in love with the girl. Or at least in lust. I wasn't a saint. It took me the most tremendous effort to be faithful to my vow. I swear to you I never laid a finger on her. All the same, I couldn't bear to think of anyone else touching her - least of all the Creature.  Yes! yes! er, on  the whole, yes, Majesty.  What?  Well, what does it matter to you?  You were sublime.  Extremely clever.  Dear Mozart, my sincere congratulations.  How could I not?  At that moment I knew beyond any doubt. He'd had her. The Creature had had my darling girl.     It was incomprehensible. What was God up to? Here I was denying all my natural lust in order to deserve God's gift and there was Mozart indulging his in all directions - even though engaged to be married! - and no rebuke at all! Was it possible I was being tested? Was God expecting me to offer forgiveness in the face of every offense, no matter how painful? That was very possible. All the same, why him? Why use Mozart to teach me lessons in humility? My heart was filling up with such hatred for that little man. For the first time in my life I began to know really violent thoughts. I couldn't stop them.  Every day. Sometimes for hours I would pray!     Please! Please! Send him away, back to Salzburg. For his sake as well as mine.  Your Highness.  Oh, Your Majesty, it would be such a tremendous honour!  An interesting idea, Majesty. But -  You already commissioned an opera from Mozart.  Yes, of course. My concern is to protect you from any suspicion of favouritism.  I'm sure there is a way, Majesty. Some kind of a little contest. I could perhaps put together a small Committee, and I could see to it naturally that it will select according to Your Majesty's wishes.        Yes.  Who is she?    Madame. How can I help you?  Frau Mozart?  How charming.  But why did he not come himself?  I understand.  I will look at them, of course, the moment I can. It will be an honour. Please give him my warmest.  I'm afraid I'm not at leisure this very moment. Just leave them with me. I assure you they will be quite safe.  Really?  Then he didn't send you?  I see.  Let me offer you some refreshment. Do you know what these are?  Cappezzoli di Venere. Nipples of Venus. Roman chestnuts in brandied sugar. Won't you try one? They're quite surprising.  Don't keep calling me that. It puts me at such a distance. I was not born a Court Composer, you know. I'm from a small town, just like your husband.  Are you sure you can't leave that music, and come back again? I have other things you might like.  Originals?  These are originals?     Astounding! It was actually beyond belief. These were first and only drafts of music yet they showed no corrections of any kind. Not one. Do you realize what that meant?  He'd simply put down music already finished in his head. Page after page of it, as if he was just taking dictation. And music finished as no music is ever finished.     Displace one note and there would be diminishment. Displace one phrase, and the structure would fall. It was clear to me. That sound I had heard in the Archbishop's palace had been no accident. Here again was the very voice of God! I was staring through the cage of those meticulous ink- strokes at an absolute, inimitable beauty.  It is miraculous.  Tomorrow night I dine with the Emperor. One word from me and the post is his.  Come back tonight.  Alone.  Some service deserves service in return. No?  Isn't it obvious?  It's a post all Vienna seeks. If you want it for your husband, come tonight.  Then don't. It's up to you. Not to be vague, that is the price.  Yes.     Yes, Father. Yes! So much for my vow of chastity. What did it matter? Good, patient, hard-working, chaste - what did it matter? Had goodness made me a good composer? I realized it absolutely then - that moment: goodness is nothing in the furnace of art. And I was nothing to God.  No? Was Mozart a good man?  All I ever wanted was to sing to Him. That's His doing, isn't it? He gave me that longing - then made me mute. Why? Tell me that. If He didn't want me to serve Him with music, why implant the desire, like a lust in my body, then deny me the talent? Go on, tell me! Speak for Him!  Oh? I thought you did so every day. So speak now. Answer me!   (intimately to the priest     Evening came to that room. I sat there not knowing whether the girl would return or not. I prayed as I'd never prayed before.  Dear God, enter me now. Fill me with one piece of true music. One piece with your breath in it, so I know that you love me. Please. Just one. Show me one sign of your favour, and I will show mine to Mozart and his wife. I will get him the royal position, and if she comes, I'll receive her with all respect and send her home in joy. Enter me! Enter me! Please! Te imploro.  Show her in. Then go to bed.          What?  Go! Go! Go!  Show this woman out!     From now on, we are enemies, You and     Because You will not enter me, with all my need for you; because You scorn my attempts at virtue; because You choose for Your instrument a boastful, lustful, smutty infantile boy and give me for reward only the ability to recognize the Incarnation; because You are unjust, unfair, unkind, I will block You! I swear it! I will hinder and harm Your creature on earth as far as I am able. I will ruin Your Incarnation.     What use after all is Man, if not to teach God His lessons?  Majesty, I did. Believe me, it was a most agonizing. decision. But finally, I simply could not recommend Herr Mozart.  Well, Sire, I made some inquiries in a routine way. I was curious to know why he had so few pupils. It is rather alarming.  Majesty, I don't like to talk against a fellow musician.  I have to tell you, Mozart is not entirely to be trusted alone with young ladies.  As a matter of fact, one of my own pupils - a very young singer - told me she was - er - well!  Molested, Majesty. Twice, in the course of the same lesson.     What does he want?  Come with me. And stay in the room.     Herr Mozart, what brings you here?  So you are. How is your pretty wife?  I'm flattered. And congratulations to you, of course.  Why didn't you come to me yesterday, Mozart? This is a most painful situation. Yesterday I could have helped you. Today, I can't.  I have just come from the palace. The post has been filled.  My dear Mozart, there is no one in the world I would rather help, but now it is too late.  Herr Sommer.  No, no, no: he has yet to achieve mediocrity.  An implausible idea. Between you and me, no one in the world could do musical harm to the Princess Elizabeth.  You don't mean to tell me you are living in poverty?  It has been said, my friend, that you are inclined to live somewhat above your means.  How is that possible? You give concerts, don't you? I hear they are quite successful.  Of course not.  I'm afraid not.  Ah, how exciting! Tell me more.  Come, come, Mozart; I'm interested. Truly.  Cream cheese mixed with granulated sugar and suffused with rum. Crema al Mascarpone.  Forgive me. We all have patriotic feelings of some kind.  What exactly are you working on?  I don't think you should become known in Vienna as a debtor, Mozart. However, I know a very distinguished gentleman I could recommend to you. And he has a daughter. Will that do?     Go on. Mock me. Laugh, laugh!     That was not Mozart laughing, Father. That was God. That was God! God laughing at me through that obscene giggle. Go on, Signore. Laugh. Rub my nose in it. Show my mediocrity for all to see. You wait! I will laugh at You! Before I leave this earth, I will laugh at You! Amen!     Do any pupils come to the house?  Then how does he pay for all this? Does he work at all?  Really? What is it he's writing?  Of course not. You're a good girl. You're very kind to do this. Next time you're sure they'll be out of the house, let me know, will you?  Yes what?  Where does he work?  I've just learned something that might be of interest to you, Herr Director.  Mozart is writing a new opera. An Italian opera.  And that's not all. He has chosen for his subject, Figaro. The Marriage of Figaro.  Exactly.  Yes.  I've seen the manuscript.  Never mind.     Incredible.  Well, gentlemen, so be it. In that case I think we should help Mozart all we can and do our best to protect him against the Emperor's anger.  About the ballet.  Excuse me - didn't His Majesty specifically forbid ballet in his opera?  Yes, in the third act.     Wolfgang, what is it? Sta calmo, per favore. What's the matter?  Really? Why?  Why bother with Orsini-Rosenberg? He's obviously no friend of yours.  You burned the score?  How fortunate.  But there are those who have power over him. I think I'll take this up with the Emperor.  With all my heart, Mozart.  (withdrawing it; imitating the Emperor    I'm sure I don't need to tell you I said nothing whatever to the Emperor. I went to the theatre ready to tell Mozart that His Majesty had flown into a rage when I mentioned the ballet, when suddenly, to my astonishment, in the middle of the third act, the Emperor - who never attended rehearsals - suddenly appeared.  It is not a question of liking, Your Majesty. Your own law decrees it, I'm afraid.      I saw a woman disguised in her maid's clothes hear her husband speak the first tender words he has offered her in years, only because he thinks she is someone else. I heard the music of true forgiveness filling the theatre, conferring on all who sat there a perfect absolution. God was singing through this little man to all the world - unstoppable - making my defeat more bitter with each passing bar.    And then suddenly - a miracle!    Father, did you know what that meant? With that yawn I saw my defeat turn into a victory. And Mozart was lucky the Emperor only yawned once. Three yawns and the opera would fail the same night; two yawns, within a week at most. With one yawn the composer could still get -     I know; it's outrageous. Still, if the public doesn't like one's work one has to accept the fact gracefully.  Well, I can speak for the Emperor. You made too many demands on the royal ear. The poor man can't concentrate for more than an hour and you gave him four.  I think it's marvelous. Truly.  I think you overestimate our dear Viennese, my friend. Do you know you didn't even give them a good bang at the end of songs so they knew when to clap?      What was this? I never saw him excited before by any music but his own. Could he mean it?      Mozart. It was good of you to come.  Did my work please you?  Yes?  You flatter me.  So rose the dreadful ghost in his next and blackest opera. There on the stage stood the figure of a dead commander calling out 'Repent! Repent!'  And I knew - only I understood - that the horrifying apparition was Leopold, raised from the dead. Wolfgang had actually summoned up his own father to accuse his son before all the world. It was terrifying and wonderful to watch.    Now a madness began in me. The madness of a man splitting in half. Through my influence I saw to it Don Giovanni was played only five times in Vienna. But in secret I went to every one of those five - all alone - unable to help myself, worshipping sound I alone seemed to hear.  And hour after hour, as I stood there, understanding even more clearly how that bitter old man was still possessing his poor son from beyond the grave, I began to see a way - a terrible way - I could finally triumph over God, my torturer.  I agree, Baron.  No, Baron, no. I'm afraid Mozart is a lost cause. He has managed to alienate practically the whole of Vienna. He is constantly drunk. He never pays his debts. I can't think of one person to whom I dare recommend him.  Indeed. Just a moment - as a matter of fact I think I do know someone who could commission a work from him. A very appropriate person to do so. Yes.     Herr Mozart?  I have come to commission work from you.  A Mass for the dead.  A man who deserved a Requiem Mass and never got one.  I am only a messenger. Do you accept? You will be paid well.  Fifty ducats. Another fifty when I have the Mass. Do you accept?  Work fast. And be sure to tell no one what you do. You will see me again soon.     My plan was so simple, it terrified me. First I must get the Death Mass and then achieve the death.  His funeral - imagine it! The Cathedral, all Vienna sitting there. His coffin, Mozart's little coffin in the middle. And suddenly in that silence, music. A divine music bursts out over them all, a great Mass of Death: Requiem Mass for Wolfgang Mozart, composed by his devoted friend Antonio Salieri. What sublimity! What depth! What passion in the music! Salieri has been touched by God at last. And God, forced to listen. Powerless - powerless to stop it. I at the end, for once, laughing at Him. Do you understand? Do you?  The only thing that worried me was the actual killing. How does one do that? How does one kill a man? It's one thing to dream about it. It's very different when you have to do it, with your own hands.     Now calm yourself. Calm. What's the matter with you?  Why? What has happened?  What medicine?  Where?  Is he working?  Is he working?      Are you neglecting my request?  The sooner you finish, the better your reward. Work!  I'll take care of him.  I have a carriage. Excuse me.  I'm taking you home. You're not well.  (handing the porter the lantern  Come now.  Where is your wife?  You mean she's not coming back?  No, please.  I would never miss anything that you had written. You must know that.  Oh no. It is a sublime piece. The grandest operone. I tell you, you are the greatest composer known to me.  I do.  Are you ill?  What?  Shall I answer it?  Who?  What man?  Finish what?  Yes, I am looking after him.  Well, he's sleeping now. Better not.  Oh, yes. He's just exhausted. He became dizzy, that's all. We should let him rest.  Of course.  Bene.  Yes. And congratulations to all of you. It was superb.  Yes, indeed. Goodnight to you all now. It was perfection - truly!  He said to give you this. And if you finish the work by tomorrow night, he will pay you another hundred ducats.  Yes. Can I - could I help you, in any way?  My dear friend, it would be my greatest pleasure.  Of course.  Then, let us try together. I'd regard it as such an honour. Tell me, what is this work?  (consulting the manuscript  Consigned to flames of woe.  What?  Oh, yes.  Come. Let's begin.  Confutatis Maledictis.  Yes.  What time?  Yes.  I think so.  Yes.      Also identical?  And that's all?  I think so.  That's wonderful!  Sopranos up to F on the second 'Voca'?  Yes!  You go fast!  Yes.  Oh no. I'm not tired at all.  I can keep going, I assure you. Shall we try?  I'm not leaving you.  What for?  Your husband is ill, ma'am. He took sick. I brought him home.  I was at hand.  He needs me, ma'am.  He asked me to stay.  No. I was assisting him. He asked me.  But - but - but -  Madame, I will respect his. He asked me to stay here.     I did.  I poisoned his life.  What difference does that make?  No, Father. From now on no one will be able to speak of Mozart without thinking of me. Whenever they say Mozart with love, they'll have to say Salieri with loathing. And that's my immortality - at last! Our names will  be tied together for eternity - his in fame and mine in infamy. At least it's better than the total oblivion he'd planned for me, your merciful God!  Don't pity me. Pity yourself. You serve a wicked God. He killed Mozart, not I. Took him, snatched him away, without pity. He destroyed His beloved rather than let a mediocrity like me get the smallest share in his glory. He doesn't care. Understand that. God cares nothing for the man He denies and nothing either for the man He uses. He broke Mozart in half when He'd finished with him, and threw him away. Like an old, worn out flute.    Why did He do it? Why didn't He kill me? I had no value. What was the use, keeping me alive for thirty-two years of torture? Thirty-two years of honours and awards.  Being bowed to and saluted, called 'distinguished - distinguished Salieri' - by men incapable of distinguishing! Thirty-two years of meaningless fame to end up alone in my room, watching myself become extinct. My music growing fainter, all the time fainter, until no one plays it at all. And his growing louder, filling the world with wonder. And everyone who loves my sacred art crying, Mozart! Bless you, Mozart.  Goodbye, Father. I'll speak for you. I speak for all mediocrities in the world. I am their champion. I am their patron saint. On their behalf I deny Him, your God of no mercy. Your God who tortures men with longings they can never fulfill. He may forgive me: I shall never forgive Him.  Mediocrities everywhere, now and to come: I absolve you all! Amen! Amen! Amen!",
        "Count": "",
        "Karl": "",
        "Frau": "Upstairs.  You can't be Herr Mozart!  I've heard about you for ages! I thought you must be an old man.  It's such an honour for us to have you here, Herr Mozart. And for Gertrude.  Michael, please! I'm sure you will find her most willing, Herr Mozart. She's really very excited. She's been preparing all morning.  Ah, now! Here she comes.    Wine?  That's all right, dear. Just go ahead, as if we weren't here.  Just one year.  I was. But she quite outgrew the little I could show her.  Michael!  What a strange young man.     She's not coming back, you know. She's gone for good. I did it and I'm proud of it. 'Leave,' I said. 'Right away! Take he child and go, just go. Here's the money! Go to the Spa and get your health back - that's if you can.' I was shocked. Shocked to my foundation. Is that my girl? Can that be my Stanzi? The happy little moppet I brought up, that poor trembling thing? Oh, you monster! No one exists but you, do they? You and your music! Do you know how often she's sat in that very chair, weeping her eyes out of her head because of you? I warned her. 'Choose a man, not a baby,' I said. But would she listen? Who listens? 'He's just a silly boy,' she says. Silly, my arse. Selfish - that's all you are. Selfish! Selfish, selfish, selfish, selfish, selfish.",
        "Weber": "Let us pass, please! Let us pass at once! We're with the Emperor.  Do you know who I am? This is my daughter. I am Frau Weber. We are favoured guests!  Call Herr Mozart! You call Herr Mozart immediately! This is insupportable!  Go ahead, Constanze. Just ignore this fellow. Go ahead, dear!  Young man, I am no stranger to theatres. I'm no stranger to insolence!  Wolfi! Wolfi, my dear!  Oh!  Oh, Sire! such an honour! And, and, and these are my dear daughters. This is Constanze. She is the fiancee of Herr Mozart.  You see? You see? I've told him that, Your Majesty, but he won't listen to me.  Oh, Your Majesty, you give such wonderful - such impeccable - such royal advice. I - I - May I?  Ah, what an evening! What a wise man we have for an Emperor. Oh, my children! Now I want you to write your father exactly what His Majesty said.  But aren't you taking us?  That's all right; we'll wait for you. Just don't take all night.     She's not coming back, you know. She's gone for good. I did it and I'm proud of it. 'Leave,' I said. 'Right away! Take he child and go, just go. Here's the money! Go to the Spa and get your health back - that's if you can.' I was shocked. Shocked to my foundation. Is that my girl? Can that be my Stanzi? The happy little moppet I brought up, that poor trembling thing? Oh, you monster! No one exists but you, do they? You and your music! Do you know how often she's sat in that very chair, weeping her eyes out of her head because of you? I warned her. 'Choose a man, not a baby,' I said. But would she listen? Who listens? 'He's just a silly boy,' she says. Silly, my arse. Selfish - that's all you are. Selfish! Selfish, selfish, selfish, selfish, selfish.",
        "Leopold": "But he needs to be here in Salzburg, Your Grace. He needs me and he needs you. Your protection, your understanding.  Oh sir, yes! He's about to make the worst mistake of his life. Some little Viennese slut is trying to trick him into marriage. I know my son. He is too simple to see the trap - and there is no one there who really cares for him.  Sir -  Yes, sir, that's the truth. But don't blame him. The fault is mine. I was too indulgent with him. But not again. Never again, I promise! I implore you - let me bring him back here. I'll make him give his word to serve you faithfully.  Oh, sir, he's never disobeyed me in anything. Please, Your Grace, give him one more chance.  Oh, Your Grace - I thank Your Grace! I thank you!  My dear son.  I write to you with urgent news. I am coming to Vienna. Take no further steps toward marriage until we meet. You are too gullible to see your own danger. As you honour the father who has devoted his entire life to yours, do as I bid, and await my coming.     Am I not welcome?  You're very thin. Does she not feed you, this wife of yours?  Is she not here?  Do you always live like this?  Don't you have a maid?  How is your financial situation?  That's not what I hear.  They say you're in debt.  How many pupils do you have?  Yes.  How many?  Composition doesn't pay. You know that.  What's that?  Why not?  You don't have secrets from me.  I see that you're expecting.  When, may I ask?  Why didn't you mention it in your letters?  Thank you. That'll be fine. Don't spend any money on me.  No, please! This is ridiculous! No, please!  No, really!  I want you to come back with me to Salzburg, my son.  I'm tired of this game. Please play without me.  Mine?  I never saw this girl in my life. Is this a kind of joke?  Young woman, this won't do at all. My son can't possibly accept such an offer, no matter how generous, unless he knows who is behind it.  Oh, this is ridiculous.  But you can't take her without reference. It's unheard of!  So now we are going to let a perfect stranger into the house?  Never mind. You won't have to do anything for me ever again. I'm leaving!  Don't worry, I'm not staying here to be a burden.  She does. She says I sleep all day.  And what do you expect? Who wants to walk out into a mess like this every day?  So you are! The place is a pigsty all the time.  Sorry, sorry! I'm sorry I spoke! I'm just a provincial from Salzburg. What do I know about smart Vienna? Parties all night, every night. Dancing and drinking like idiot children!  Dinner at eight! Dinner at ten! Dinner when anyone feels like it! If anyone feels like it!  Your Majesty.  That's right, Your Majesty. Twenty years ago. No, twenty-two! twenty- three! And I remember word for word what you said to me. You said - you said --  No! Yes, 'bravo,' of course 'bravo'! Everybody always says 'bravo' when Wolfi plays. Like the King of England. When we played for the King of England, he got up at the end and said, 'Bravo! Bravo! Bravo!' three times. Three bravo's. And the Pope four! Four bravo's from the Holy Father, and one 'bellissimo.'  Hush! I'm talking to His Majesty. Your Majesty, I wish to express only one thing - that you who are the Father of us all, could teach our children the gratitude they owe to fathers. It is not for nothing that the Fifth Commandment tells us: 'Honour your Father and Mother, that your days may be long upon the earth.'"
    },
    "imdb_rating": "8.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNWJlNzUzNGMtYTAwMS00ZjI2LWFmNWQtODcxNWUxODA5YmU1XkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_QL75_UX380_CR0,15,380,562_.jpg",
    "description": "Antonio Salieribelieves thatWolfgang Amadeus Mozart's music is divine and miraculous. He wishes he was himself as good a musician as Mozart so that he can praise the Lord through composing. He began his career as a devout man who believes his success and talent as a composer are God's rewards for his piety. He's also content as the respected, financially well-off, court composer of Austrian Emperor Joseph II. But he's shocked to learn that Mozart is such a vulgar creature, and can't understand why God favored Mozart to be his instrument. Salieri's envy has made him an enemy of God whose greatness was evident in Mozart. He is ready to take revenge against God and Mozart for his own musical mediocrity.—Khaled Salem",
    "name": "Amadeus",
    "genres": [
        "Biography",
        "Drama",
        "Music"
    ]
}