{
    "filename": "American-History-X_script.txt",
    "imdb_id": "tt0120586",
    "imdb_url": "https://www.imdb.com/title/tt0120586",
    "characters": [
        "Davina Vinyard",
        "Lamont",
        "Rasmussen",
        "Dr. Bob Sweeney",
        "Doris Vinyard",
        "Stacey",
        "Dennis Vinyard",
        "Lawrence",
        "Seth Ryan",
        "Cameron Alexander",
        "Mitch McCormick",
        "Derek Vinyard",
        "Murray",
        "Little Henry (as Jason Bose-Smith)",
        "Danny Vinyard"
    ],
    "dialogues": {
        "Davina": "What do you want!?    Back in his bedroom.  He's on the phone, asshole!  Hurry up and leave, Goodyear.  You've taken your dump now go.  Yes! I am!  You're not even human.  Seth erupts with laughter.    She puts down her homework and looks over at Seth.   Hey Seth? Cut the shit.   They feel threatened by you!   I feel.sorry for you, Danny.   You shut up, you poison to fuckin' society! Get out of our house!   Derek hates you, Seth.   What do you mean?  Seth stands and smiles.   You're a pig.   He ' s a fuckin ' loser, Nazi scumbag.   What else is new?  Hey what?    What!?   I got shit to do, Dan.   \"American History X? Take home paper as assigned by Principal Robert Sweeney?\" Why is he giving you homework? What happened to Murray?   Why?   \"Describe in detail your opinion of -the historical event that took place in the early morning of October 4th, 1993.\" What's that?   Sweeney gave you this?     Eat me, Dan.   I'm not doing your homework for you! I gotta spreadsheet due!   What's the matter with you? You wanna be a fuckin' loser your whole life?  Not receiving a response, she walks out the door.     Look who's talking about respecting the law? Mr. K.K.K. here.   Here we go.   Gates.     I didn't interrupt shit.   Who the hell do you think you are?  Derek jumps up from the table and grabs her by the back of the hair.  The table JOLTS and plates tumble to zhe floor.   Fuck...you.  Derek takes a piece of roast beef off her plate and shoves it in her mouth. Me holds the whole piece inside so she can't spit it out. Davina cries as she chokes on the meat.   I hate you, you fucking asshole!  The door slams shut in the background.  Doris, Murray, Danny, and Stacey all stare at Derek.  Derek calmly faces his brother.   Take this, you fucking dick!  Derek pops up quickly, disarms her, and pulls her close.   Fuck you! Let go!   Let go of me!       You couldn't tell.  A RAINSOAKED DORIS walks through the front door.    What?    Davina plops herself down and falls asleep instantly.   I'm coming right now! Jesus!     Thanks    That sucks, man.   Hey Der? Do you have Excel on disk?    Derek embraces them. Doris grabs his face -- torn between love and hate. Guilt-ridden, Derek tears from them and storms down the hall with Sweeney soon in tow.",
        "Vinyard": "The sex happening in the next room makes it difficult for Danny to sleep. Next to a digital clock that reads 3:07AM, the clean cut 14-year-old flips to his side.  A poster of Lee Ving of FEAR onstage, taped to the wall. Pre-Calculus and Biology books on the floor. Cassettes scattered on his tiny desk. A stereo in the corner.  The off-screen sound of breaking glass grabs Danny's attention. He sits up and looks through the blinds.    Davina and Doris Vinyard yell in the background like they were in Vietnam. They meet in the hallway, still not able to place the direction of the gunfire.    A YOUNGER DEREK, short haired with no tattoos, stands next to the reporter. Derek wears a Venice High Basketball jersey drenched in sweat. Towel around neck, he thinks to himself as the man speaks into the camera.    Danny walks' towards Derek and they smile and hug.  Davina and Doris soon join in.  Davina    The news segment winds down.    He's a striking presence with his scruff, tight t-shirt and tats hanging down his arm. A black jacket wraps around his waist.    She snores on the couch. The clock on the wall reads eleven as the boys ENTER. Danny goes to his room whale Derek heads for the girls in the living room. He genzly shakes Davina.    The place is immaculate. DENNIS VINYARD, the father of the household, eats his breakfast in his LA COUNTY FIREFIGHTER UNIFORM. Vintage fireman material: muscular, receding hairline, zero facial hair. Handsome. A pretty and well-dressed Doris SINGS while she scrambles eight eggs with mushrooms and peppers.",
        "Lamont": "I got your back. Righteous white Cracker with attitude. Just like the Judge who sentenced me, man.  Lamont laughs but then becomes serious.   If your smart though you'll remember one thing. You're the nigger in here. Not me.   But I won't go down on that shit.  No way, no how.   You ever been with a soul sister?  Derek looks over and meets his eyes. Lamont sees this and laughs.  Just for a second.   Oh shit! Sorry, man! Forgot who the luck I was talking to there for a second. Let me ask you this one though cause I don't know the white man's take. You like eating pussy?  Oh man! You sick fucking bastard! You sick pig!   Man...you don't know shit about the brothers. We won't go down on that shit if the bitch was holding a gun to our fucking head.  Derek laughs and the two continue to converse.   Motherfucker. What now, man?  He tends to Derek. He picks him up, throws him over his shoulder, and carries him off.   Shit, holmes. Hang on to me, man. You're heavy.  I'm fucking incarcerated, man. With a bunch of faggots. How you think I'm doin'?  Derek looks at the young man and can't help but laugh. Derek slowly gets up and limps past Lamont.   What are you gonna do, man?  Derek looks at him for a few moments, still shaken.",
        "Rasmussen": "All right. Moving on--  Good Morning, Doctor.  The group looks over and meets Sweeney's hard glare.   Gentlemen, this is Dr. Bob Sweeney. He's Principal over at Venice High and for some time now he's done a load of outreach work with gangs...in and out of the can.  Sweeney nods as Rasmussen cough.  He sips water and continues.   Three years ago a local kid named Derek Vinyard gets sent up for murdering a couple of Crips who were trying to jack his car. Bob taught Vinyard back in high school and has followed the case closely.   Cammeron Alexander is probably the biggest writer and distributor of white power literature in LA County. He promotes white power bands, writes reviews, columns, all at the ripe age of forty.   Pretty clean record...runs everything out of his house down by the beach.   We got some uncut footage here. Courtesy of NBC.       Vinyard was quietly released from Chino on Saturday after three and some odd years. And I think it's something we might want to keep an eye on for a few days.   It's not exactly LAPD policy but I want 24-hour surveillance on Vinyard for a few days.   Just for a few days.   Either way...let's keep it low.   Cammeron and Seth are in the ICU at St. Johns, Derek. They were jumped in front of Ben's Burgets early this morning.  Derek thinks to himself for a few more seconds.   They'll live. They must have been looking for somebody else.  Derek stares at Rasmussen and walks away. Sweeney, who knows to walk over to him.  He eyes  TIGHT ON SWEENEY AND DEREK. The two lock eyes.   He won't let go. Will you talk to him?",
        "Doris": "I need a kiss.  Danny wipes away her tears, kisses her, and moves away quickly so he won't get sick.   No one's safe--until we all are.  Seth looks at the woman like she's from another planet. He laughs and goes into the kitchen.   Just put me out of my mercy.   It's not that uncomfortable.   I need a cigarette.   I'm high as a kite.   Daniel?  I know you got homework.   I don't like him in this house.   Okay. Be careful.    She thinks to herself and closes her eyes.   That doesn't make it right.     We both put food on this table, fella.   Can we forget about Rodney King for chrissake?!   He didn't hit anybody!   Dammit Derek!   Derek!  Let go of her hair and sit down!   Danny?!  Are you okay?!  Let go of her hair and get out.  Derek releases his grip on his sister and she spits the roast beef onto the floor. She runs into the back bedroom crying, choking and coughing.   Both of you get out right now.  Murray stares at Derek with pity.  Doris becomes emotional.     He's a stupid kid, Murray!  I'm sorry!   It's just gonna take some time with him. What can I do?   He's not a terrorist, Murray.  Jesus!    Murray?   Murray! Please! Derek would never have anything to do with bombs, okay?! You don't know him like I do.   Find an apartment because I want you out of here.   I don't wanna hear it anymore!  I want you out!   When?   Good.  She walks past Derek and into the back bedroom.   Thank you, honey.  She coughs, recovers, and sips. Danny walks away.   Hey. Come here.  Sit with me.   You can sit down for two seconds.  He looks at her and sits beside her.   I won't.  They share a smile.   What? I'm not allowed to look at you anymore?  He smothers her face with his hand, jokingly.     I bet you will.  He smiles and locks eyes with his mother for several moments. He finally rises and walks back to his room.   If you need me to proof anything for you I will.   Wake up early if you get tired.  Doris watches him disappear down the hall, distant thoughts creeping back slowly.      Hello.  The two sit there and stare at each other for a few moments.   Dr. Sweeney called me. He spoke with a guy on the parole board here. He thinks you might be getting out soon.  Derek nods and stares at his mother, broken.   Davina's good. UCLA Math major. All three of you have always been so great in school. I wonder why all this--   He's doing the same stuff you were doing, Derek. Hanging out with Cammeron, getting into trouble. It brings back a lot of sad memories. And I can't do anything...he won't listen to me. He needs you.  Derek stares at his mother like it's the last thing he wanted to hear.    She snores on the couch. The clock on the wall reads eleven as the boys ENTER. Danny goes to his room whale Derek heads for the girls in the living room. He genzly shakes Davina.   Goodnight.   Breakfast!   So what's this all about, Dennis?  Dennis doesn't hear because his attention is on Danny. YOUNGER DEREK, donning a flat-top haircut and no tattoos, walks into the kitchen. The smiling athlete has his backpack and blue VENICE HIGH gym bag. He drops it all onto the ground and sits at the table.   What about this gang stuff?   Why you guys though? I can see them but the fire department?   A lot of people say otherwise, Danny. Including me.   Nooo...what you don't see are minorities on the boards of Fortune 500 companies cause whites won't stand for it.   Honey? Please don't speak that way. They don't--   You can be a stupid son of a bitch sometimes.   I really hate you with a passion some times.  An upset Doris exits the room past YOUNG DAVINA.  Dennis looks to Derek.    She's on the couch watching cartoons. She takes a jar of Vick's Vapor Rub and puts some on her chest. Derek walks in the room, bends over and kisses her on the forehead. Davina sits on the couch and writes. Derek just smiles.   Wow. What happened?   You look good.  Derek smiles and caresses his mother's cheek.   I'd love it. Do you think I should color my hair?   I'm glad you made it back. I wasn't too sure I was going to see you again. You know how I get.  Filled with regret, he nods.   You're my son. Of course I will.  Derek smiles and can't believe his tearful reaction.   No you're not.    Derek embraces them. Doris grabs his face -- torn between love and hate. Guilt-ridden, Derek tears from them and storms down the hall with Sweeney soon in tow.",
        "Stacey": "Fucking pervert, Dan!    Who?    Who's out there, Derek?   Derek? Be careful.  He looks at his girlfriend and walks off.   Get down, Danny! Jesus!  TIGHT ON DANNY. His gaze is locked on his brother from his bedroom window. Derek cocks his piece, points it and walks toward the man.  TIGHT ON DEREK'S FACE. Eyes blistering.   Fuck that, D. That chucker can't pull that shit. It's fucking-   I hope you kill that fucker.  Derek looks back at her and straight to Cameron.     I'm with you, honey. All the way. It's one...giant...ploy.   I mean...nobody likes Chief whatever his name is, right?   Yeah. So here comes this filthy piece of garbage in his Hyundai. He pulls over in front of a perfectly lighted area where a video camera is sitting there...fucking waiting for him, man. What happens next? Chief Gates is dust. It's total--  Davina drops her silverware on the plate with a clatter and looks at her mother. Everyone stares at Davina.     You callin' me a liar, RosenKike?   Murray Rosenberg...International Jew.   He can move in with me.   Tomorrow.   Get on the floor, Danny!  Jesus!  Danny looks down at her and hurries out of his room.     Welcome back.  He just closes the door on her.  Cammeron looks for his cigarettes.    Hey!  Derek turns around and faces her.   Don't point your fucking finger at me.   What are you gonna do?! Hunh?! Hit me?! Kick me as I roll on the fuckin' ground screaming?! That bullshit with Cammeron is nothing, Derek!   Goddamn you, Derek! Those two niggers deserved what they got. They deserved to die! And just like Cameron and Seth and a million others out there...I'll believe that 'til the day I fucking die. I will. Nothing will ever change that either.  Derek breaks from her grasp and walks away.   Do it, Seth.  Seth glances at her and Derek quickly GRABS the pistol. A shot goes off and people hit the deck. Derek wrestles the pistol away and punches Seth in the STOMACH. Falling to the ground in pain, Derek cracks him in the face once more and it's over.",
        "Dennis": "Okay! Let's go, Davina! Derek!   Good morning.   Jesus Doris...it's not that big of a deal. All departments have to take a precaution class on gang patrol today.   A guy was shot yesterday in Inglewood...changin' a valve on a hydrant. LAPD is worried that more firefighters will become targets. That's what this bullshit is about. A good father this guy was though and now he's in intensive care because of some goddamn--! They've pretty much declared war on LAPD and us.   They think we would rather let a building burn down over there than fight it. So now we got two fights goin' on at one goddamn time.  Dennis takes a bite of his eggs and explodes.     I'll tell you one more thing. This \"affirmative blaction\" shit is driving me up the fucking wall. Firefighters gettin' 99's on their tests while rappers who score a goddamn 62 walk away with the job.   Not when a job requires ability.  No.   A lot of people don't know shit, either.  Doris just stares at the back of her husband's head like she wants to smack it. He turns back and disarms her with a look.   If I'm fightin' a brush fire... surrounded by thousand degree flames...who would I want watchin' my back? A guy who scores a 99 or a guy who scores a sixty? You don't see half the NBA with whites, gooks and spics.   Doris! I'm tired of your damn argument! You sound like an idiot!     How am I speaking, Doris!? Hunh?! I'm speakin' fineP Hey. Don't let that him confuse you over there, Derek. Look at me. This shit he's pulling is a load of crap. Hey. Look at me, Derek. I mean it. If we keep givin' niggers everything, there'll be nothing left for us.  Derek and Danny stare at their father, not knowing how to react.   And then we have naive fools like her.   You know what I mean though, right?   Well...good morning, Miss Monroe! Look at you. You look like a star.   You did like it.  Dennis reaches over and wipes it off with his napkin.   Yeah. Well you're lucky I'm letting you wear that crap on your eyes. I love you but you're too young.   It totally sucks. And we all sympathize with you, too.  Everyone laughs but Dan, still shaken over his mother.     You wanna go to Der's game with me?   (quickly to Derek}  Perfect. Ben'll whip us up a couple of double deckers and we'll head over.",
        "Lawrence": "Seven-six. Let's go!  Set some picks!   Boy?  Lawrence quickly pivots past Seth, dunks it, and yells as he hangs on the rim. The crowd cheers.   Fat, pasty, pale, pastrami eating, cracker, motherfucker. A hundred bucks says I make you my bitch.   Name your price, Cracker.   You got a lot of fucking balls, man. Bring it. Right now.  Derek pulls off his sweatshirt and gives it to Stacey. Lawrence gets his team together.   Fuckin' BYU, man!  All right!  All we need is one now!  Lawrence and Derek lock eyes, a look exceeding competitive boundary. A look filled with rage.   I ain't losin' in my house!  Clear it out!  The POWER FORWARD dribbles beautifully up the court -- his teammates clearing out the key. Defensively, Derek is solid. He tries to pass Derek but Derek's defense is stifling. Again. With another tricky move, Lawrence inadvertently puts his LEFT ELBOW into Derek's face, sending him quickly to the pavement. EVERYBODY STOPS.   Get the fuck outta here!  He was movin' his feet!  Derek, teeth bloodied, rises. The two have a stare down.   You wanna piece! Bring it!  Players quickly rush to restrain the two even though the teams hate each other.   Fuck you!  Derek walks over to Cammeron, Danny and Stacey standing courtside. She has a water bottle and a towel waiting for him. He wipes his BLOODY LIP and takes a sip. Cameron stares at Derek.   Goddamn, man!  Come on, man. Call an ambulance.",
        "Seth": "Bring it on, boy.  Derek quickly moves his eyes to the court.   Lucky piece of shit! I'm through \"monkeying\" around with your ass!  Lawrence spins around and challenges Seth.     When I want your fucking opinion I'll ask for it, fuckhead. Help me cover here, guys.  Derek and Cameron stare at Seth, knowing Seth will lose and embarrass them.   I'll take this negro down.   Yes! Ten a piece! Nice fucking dish.    Open up, bitch!  Fuck off. Where is he?    Vinyard!  Fuck off.  What are you lookin' at?   Come in here and I'll show you, maggot.   I'm dropping the kids off at the pool, junior. Shut the fuckin' door!  Danny grabs his nose and turns to the door behind him.    He points his Glock 9mm at the mirror.   Drop the t.v., nigger.  He laughs to himself and exits.    He bangs on Derek's door once more, pissed that Derek didn't open it earlier. He heads for the living room.   Nigger lovin' Jew media calling the shots. Watch cartoons. It's the only t.v. that's safe nowadays.    He looks through the fridge but finds nothing. He closes the door and looks at the family pictures on the door.  A FAMILY SHOT of Doris, Derek, Danny, Davina, and DENNIS VINYARD in front of church. Seth appreciates Dennis in a coat and tie. Below that, a picture of a dirty and rugged Dennis and a young Davina, wearing her father's FIRE HELMET. Danny with Doris.   Come in here, Dan.  Where the fuck you find that?  Is Davina's ass water tight?  Listen to you. You callin' me a blimp, you fuckin' Democrat?!  Oh yeah? You ask Derek?  Well...you can think of me drinkin' 'em then when you're studying with fuckin'... White Trash in there.  Davina scoffs and Seth looks up her shirt.   Where is the fucker, by the way!? He's hiding from us.  Davina looks up from her homework and catches the pervert looking at her.   Of course, man.  Seth drums on the table as Danny shoves the last bite into his mouth.   Sit down. I wanna ask you some questions.   Two fucking seconds, dude!  Danny sits and looks at Seth.   Tell me your convictions.   Tell me some of the shit you've learned luckbrain or I'll pistol-whip you.   About anything.  What do you believe in?  Danny thinks to himself and smiles.   What else?   Why?  Good. What else?  Tell me what I want to hear, asshole.   You wanna get beaten?   Then tell me about Adolf and Mein.   I'm not fuckin' talkin' to you, Davina, shut up! Do you believe in Adolf?   What do you hate, Danny?   Why? And say it with some fucking conviction!   None of them are all right, Danny. They're all a bunch of fucking freeloaders. Remermber Canuneron. \"We don't know them, we don't want to know them, they're the fucking enemy.\" What don't you like about them?     Good.   Good!   That's the best shit I've ever heard come out of that mouth.  TIGHT ON DAVINA. She stares at the two hate mongers.   Shut up, Davina.     Hey! How are you, man? Fuckin' A. Long time no see. Look at that hair.  Seth moves to hug his old friend but Derek offers a reluctant hand instead.   I thought it was a great idea.   It's nice to see you too, man.     Sweeney's a fuckin' nigger on a power trip, Vinyard. That's what he was like when we were there and that's how he is now. It'll never change either. A nigger is a nigger.  Derek stares at Seth, ready to beat the fuck out of him. Suddenly, Doris starts in with a COUGHING ATTACK. Derek quickly fills a glass of water and goes in there.    Jesus, Mrs. Vinyard.  I think a lung just came up.  Everybody laughs -- including Doris.  Derek tenderly puts his hand on his mother's cheek.     Hurry up. I'm starving.   Derek looks at the oblivious cops and drops into the passenger's seat. Seth starts the engine and drives away. As the truck disappears, we pick up on a WHITE SOUPED UP JEEP CHEROKEE turning the corner. Tinted windows, it cruises past the apartment complex.   Wheto's your fucking green card, asshole?  Seth kicks the young man in the face with a blatant shot and continues. DEREK leaves a terrified white woman alone like she's not even there and pushes over an adjacent shelf, knocking over another worker with CANS OF   They sit in the car as a band JAMS from Cam's house. Shiftless Seth throws on a black CRO-MAG t-shirt and tosses his work shirt in the back. He wolfs down a burger as Derek rolls his foot on a basketball on the floor.   You're an idiot if you ask me.   What if he writes something stupid and that nigger turns you in? Jesus. He didn't testify, Der. They can use that shit and re-try you.  Derek takes a long stare at Seth, who devourshis burger.   You're serious.   I can't believe I'm hearing this shit come out of your mouth.   For your country, fuckhole, that's what. I'd do a hundred years before I felt like that.  Seth gets out, slams the door, and walks to the party.   You're a motherfucking traitor!  I'm not fat, cockwart!  I'm husky!     Where's Cameron?  Derek stares directly into the BARREL.   I'd be doing America a great fucking favor, let me tell you.   Get a job and buy one why don't you.   Fuck you.  Seth stumbles into the shop.  Cam stares at the homeless man, psychotically.     Seriously?   Where's Stacey?   Derek's a fuckin' traitor pussy.   What do you mean?      What?  CAMMERON'S POV. A large, mature and sharp-looking BLACK MAN helps A BEAUTIFUL BLOND out of a RED BMW. THEY KISS. Cammeron is at a loss for words. Cam puts out his cigarette as the couple ENTERS.   Excuse me? Tyrone?   Whatever.  Why can't you stick to your own race?   You got a fuckin' death wish, asshole? Do you? Make your move now if you do. If you don't...get the luck out of my sight. Cause I'm real close to shoving my piece up your girlfriend's stinky pussy.  The black man stares at the gun sticking out of Seth's belly. He grabs his girlfriend and walks out of the joint. Seth sits back down and the two laugh. Cameron looks over at Ben and raises his hands in the air.    Seth finishes his display of gluttony.   What's that?   Huge dicks, Cam.  That's all it is.   They get off on it.   Why the fuck not?   No shit. Oh go girlfriend! Don't be puttin' up wid dat, girl! Oh stop girl!  Seth and Cammeron laugh and head outside--leaving a mess on the table.",
        "Ryan": "Well well well. A virgin.   You ain't so tough now, are you?  The two men smile at each other, kick him and exit. After a few seconds, LAMONT enters with the cart and picks up dirty towels. He spots Derek laying on the tile.",
        "Cameron": "",
        "Alexander": "",
        "Mitch": "",
        "McCormick": "",
        "Derek": "It hangs above a serious computer and next to a giant, tome-filled bookshelf. The moans, meanwhile, approach orgasm.  TIGHT ON DEREK VINYARD. The young man has a shaved head, a thick goatee, and a well-crafted SWASTIKA on his left tit. On top of Derek in the bed is his barely-of-age girlfriend, STACEY. The covers are completely off and a BLACK ROSE is tattooed across her right shoulder blade. Danny watches her fuck, only for a second.     What?  Stacey stops and looks over.  Frustated, she rolls off Derek and onto her side.   How long has he been out there?   Nobody. Relax.  Stacey sits up quickly from the bed as Derek pulls on his black combat boots.   Not right now, honey. How many?   Is he strapped?   Does he have a fucking gun, Dan?   Is there a driver?  Danny nods his head yes.   Okay.  Stay the luck here.    THE BLACK GUARD carelessly turns toward the driveway to see what's taking his partner so long with the wires.    The guard has his back to him. Derek goes.   Fuck you!  The force propels the man six feet backwards.   How do I feel? How do you think I feel? It's typical.   Well...look at our country. It's a haven for criminals. Black...brown... yellow...whatever.   Every problem in this country is \"race\" related. Every problem, not just crime. These problems are rooted in the black community, the Hispanic community, the Asian...every non- Protestant group in our society. Look at the shit. Immigration... welfare...AIDS...they're all the problems of the non-white. Look at the statistics.     Millions of white Europeans came to this country and flourished within a generation! A generation! So what the fuck is wrong with these people?!   Because my father was doing his fucking job! Saving a nigger neighborhood he didn't give two shits about! And he got killed by some drug dealer who still collects a fucking welfare check.  Derek looks at the man and walks over to HIS MOTHER DORIS, who smokes a cigarette. The camera follows him as he puts his arm around her and escorts her back inside their Venice Beach residence. The camera pans back to the reporter who just stands there, speechless.   You can't take a shit, Seth.  Shut up.  Derek shoots a look to Cameron, comes to a decision, and stands. He shouts for all to hear.   I got a bet.  Lawrence stares at him, sensing something harder.   I come in, same score now, first one to eleven. Black boys against the white boys.  Lawrence looks back to his boys in disbelief.   No money...for the court. We win, you grab your shit and find a different place to run. Not just today... forever. You win, and we don't come back. No hitching, no fighting, here in front of everyone. Six-eight, our ball.  The action around the court gets very still.  Finally, Lawrence nods.     I'll go if you want to.   If you wanna go...I'm ready.  Don't be throwin' fuckin' elbows.   I know what he's gonna do.   Not on point game you don't.   Not on point, honey.  He turns back to the court and walks over to Lawrence. He stands in front of him and checks the ball in.    Tens!  Lawrence takes the ball, passes it to the wing, and quickly gets it back. Lawrence dribbles up top, makes a marvelous 180 spin with the ball, and pulls up for a ten foot jumper. Derek reads it perfectly and REJECTS IT. Lawrence trips to the ground, Derek grabs the ball off the fast break and DUNKS IT.   It's gonna be fine.   I got it.  Danny looks to his mother.    He listens to the man on the other line.   Unhuh. Unhuh. Did you expel him?  I'll be out in a minute!  Without pushing it, Seth undoes his pants and moves into the bathroom. Danny walks down the hall.    He continues into the phone receiver.   All right. Thanks.  I'll take care of it. Yeah.  DANNY'S POV. He opens the door and sees Derek on the phone with his back to him. Above Derek is Danny's surfboard, hanging on ropes hooked to the ceiling.  Blue jeans, black boots and slicked back hair, Derek holds his hand up and motions for Dan to be quiet. The sleeves of tats covering his arms, shoulders and back define the hatred that has engulfed his past.     Okay.  Okay. I'm what?  What channel?  He covers the receiver, turns on a ten inch TV, and flips to the correct channel.      I know.  Derek leans over the computer to check it out.   How do you know who I hate, Davina?   Gimme just one second, okay?  Seth nods as Derek stares at Danny.   Did you do a book report on Mein Kampf?     None of your fucking business how I found out.   That figures.  You're more stupid than he is.   Why'd you do it, Dan?  Because of Seth.   Cammeron?   Oh, you do everything you feel like? I feel like smacking you in the fucking head. Would you mind if I did a report on that?   Get a clue, you dumbshit. Hey! Look at me! Don't be a dickhead. Sweeney cares about you.   Yep. So wise up.  You hear me?   You'll be okay. You want me to pick you up any more medicine?  Together they look at all the bottles and laugh.  Derek checks out the couch.    Jesus. I can't believe I ever let it get this bad.   My ass. You smoke two packs a day. That's why you're spittin' phlegm.  I knew.   Yes he is. Open your eyes.  Not at Cammeron's you won't see me.   Forget it, Danny! It ain't gonna happen for you tonight.  I'll see ya.    I will.  Derek follows Seth out the SIDE WINDOW and goes down the alley.   Are you going in or not?      Just be ready, okay?  She nods and Derek gets out. The group is silent.   Come on. Let's pull it together. Hey! We're not playing fuckin' games here. Let's go.  The group snaps to attention behind him as Seth toys with the camera. CURTIS from earlier takes a hit off a joint and makes Derek wait for him. Derek walks over to the crazy man, takes the joint, and throws it onto the ground.   What the fuck, Curtis? You a fuckin' nigger now? Want some crack?       Don't laugh. It's tragic. On the Statue of Liberty it says \"Give me your tired, your hungry, your poor, your huddled masses...yearning to be free.\" It does not say give me your shiftless, your greedy, your indolent, your criminals, looking for a free ticket.  The group agrees.   We're here tonight to show the government how we feel about minorities taking over our country. The treat us like criminals while they reward them with jobs and fucking welfare checks. And it's only getting worse.   Are you ready to do something about it?   Okay then.  AND THEY'RE MOVING.  In formation.  Fast.  Directly at us.    Angry.  As the camera swings into line, TRACKING WITH THEM, Derek reaches into his back pocket and pulls out a STOCKING MASK. He pulls it down over his face.  The foot soldiers follow him in unison.      Can't hide from me, motherfucker!  He kicks the man and looks around the market for more. Danny watches in awe. Curtis breaks a giant jelly jar over a head. Another skin throws a BLACK CHECKER into a shelf of POTATO CHIPS.  DEREK'S POV. He looks up at one of the aisle mirrors.   HEAD AND PROCEEDS TO KICK HIM. Danny looks at Derek like he's Superman.  Derek looks to his watch and straightens up.   Let's go! We're outta here!  Move !  From just inside the door we see skins get in their last blows and pour out the aisles and pass us through the doors. TIRES SCREECH. THE CAMERA HOLDS ON THE WRECKAGE  Fuck you, Murray. White men don't cruise the streets of LA killing each other.   You're so fucking lame. A couple of cranks in cabins in Montana is not statistically significant. White Americans don't take PCP and drink and drive a hundred and twenty fuckin' miles an hour! We pull over and trust the law.   That's not what I said, Davina. Three different times Rodney King comes at those officers with the intent to hurt them. To hurt them! Three times! But since we see it on some fucking tampered videotape...the bleeding heart media makes you believe that he only comes at them once. All we see is Powell, Koon and Wind hittin' him and-- Briseno kickin' him in the back of the fuckin' skull with his boot. Still, the dumbfuck's tryin' to get up and kick their asses! That's how stupid that motherfucker is. Those cops used textbook-solid tactics and if Dad were still here he'd say the same damn thing.   Yes it does. Yes it does. They're cops! They are taught to use that stick and they did.   No. Appropriately. Appropriately! Cops have been granted a certain amount of authority by society and white people, unfortunately, are the only ones who acknowledge it. I acknowledge a cop's authority.  Davina starts to laugh.   That's two errors in one sentence, Davina, so take a fucking course in semantics. First error--I didn't say I respect the law. I said I respect a cop's authority. Second error...I'm not a member of the fuckin' low rent, disorganized, redneck Ku Klux Klan.. Pull your head outta your ass and look at who you're dealing with.   Murray, stay out of it. You're not a member of this family and you never will be.   Give thanks to the food on the table and then believe it, Doris.   True enough. The point is...if Dan was walking across the street that night and Rodney King plowed into him--     If he did though! If that shithead killed Dan...you would have believed the beating to be justified and so would everybody else. But since he didn't hit anyone...it's \"Hands Across America\" for the son of a bitch.  Derek takes a bite of food.   We are still so hung up in this notion that we have an obligation to help the struggling black man and all you contribute to it! Lincoln freed the slaves a hundred and thirty years ago! Get off your fucking asses!   Don't interrupt, Davina.   The hell you didn't. I was listening to Stacey and then I heard you. That's called interrupting. Wait 'til she's finished and you can be excused.   You don't know when to shut up.   I'm trying to teach my sister some respect, Murray.     I will when I hear an answer, Doris. Are you going to shut up, Davina?  TIGHT ON DANNY. He gets up quickly and tries to pull Derek off. Derek turns and cracks Danny in the face with a BACKHAND, dropping him back into a cabinet. A crystal vase with flowers crashes to the floor, just missing Danny's head.     It's a real easy question, Davina. A simple yes or no will suffice. Tell me what I want to hear and I'll let go.   Stay back, both of you!  It's her bed, she's gotta lie in it. You can cry all you want, Davina. I'm not gonna let go until you tell me what I wanna hear! Are you going to shut that fat fucking mouth of your's and let my girlfriend tell her opinion? Are you?!  DORIS grabs him from behind and he aggressively turns on her. Derek curls his tongue behind his teeth and raises his arm like he's actually going to smack his mother. She grabs his arm though, forcefully.   You okay?  Danny nods.    Derek smiles at Murray in wonder and disbelief.   Would you care to repeat that, Murray? I'm not sure I got all of it.     Or what, Murray!? What're you gonna do? Give her fucking detention?   Out of respect for my mother...I'm gonna let that comment go, Murray. I won't bash your face in. But let me tell you somethin'...man to fuckin' mouse here. Normally in a situation like this I'd take my steel-tips to your fucking Jewish temple. That goes for anyone making comments about me, my family, Stacey, whomever. You know and I know that I could crush that puny fuckin' skull of yours in a second. So it's beyond me why you would say something like that without being able to back it up? What's worse, you sack of shit, is you calling the woman I love a liar.   Weasel like that again Murray...you fuckin' ponytail, pussy, bagel eating, teacher, faggot...and I'll cut your shylock nose off. Make no mistake.  Murray silently walks out of the house. Derek claps and sings the Jewish celebration song \"Hava Naghila.\" Stacey joins in and the two laugh. Doris goes after Murray.   Davina!  It's okay!  Calm down. Please.     Come on, Davina.  I'm sorry. I lost control. Please.  I screwed up.  Derek holds tight until the crying girl settles down. He's gripped as desperately by remorse as he was moments before by rage. He kisses and repeats his apology over and over. Finally, she succumbs and puts her arms around him. Derek looks to Danny.     I swear to God I would, Davina. Please.   Davina? Please forgive me.  Please. I'm sorry.   I know it did. And I'm sorry. I just really hate that guy.   Morn, I'm sorry but that guy's--    He hovers over big Lawrence. Gun pointed steadily, he kicks him in the stomach over and over -- tongue pressed against teeth.  Hot air flows from Derek's breath and into the cold.   You fucked with the wrong bull.  Fuck that. The cops will let him walk.  Derek grabs Lawrence and drags him to the CURB.   Ever shoot at firemen, you fuck? Open your mouth and put it on the corner of the curb. I'm gonna teach you a little lesson.   Get in the fucking house, Dan!  Danny doesn't move.   My dad gave me that truck, motherfucker. Couldn't leave well enough alone. Put your mouth on the corner of the fucking curb!  Derek cocks his piece and Lawrence complies--his teeth now scraping concrete. SIRENS sound from afar. Danny walks out into the middle of the street to check it out.   What the fuck did you say?  You just threaten me? Hunh? Hunh? Hunh?    They sit in the car as a band JAMS from Cam's house. Shiftless Seth throws on a black CRO-MAG t-shirt and tosses his work shirt in the back. He wolfs down a burger as Derek rolls his foot on a basketball on the floor.   I'm not asking you.   Sweeney's not gonna do anything, Seth. He helped get me released.  Seth is a pathetic vision to Derek.  Derek stares at him for several moments.   I'm out, Seth.  Seth wipes his mouth and casually meets eyes with Derek.   I'm only going to tell you this once so pay attention. I'm done, Seth. I don't want you to come near me...near Dan...I want you to leave my family alone.  Seth stares and laughs at Derek.   I'm dead fucking serious. No more phone calls, no more visits, no more nothing.  Seth doesn't know what to say.   We don't exist as far as you're concerned, Seth.   Believe it, Seth. Believe it. I spent over three years away from my family. My family, Seth. For what?    He watches the house. Suddenly, Danny, Chris and Jason skate up to the residence and follow Seth inside.   What the--? Shit.   Your brother's a piece of shit!  Seth sees Derek enter and he releases Danny. Seth mixes into the party and SLAM DANCES into ten other skins. Danny follows Seth towards the keg.  DEREK'S POV. He analyzes the crowd.  Quickly, Chris recognizes him.   Do me a favor.  Grab Danny and get outta here!  The two boys look at each other and LAUGH.   You what!?  Chris looks at Derek like he's dead.   You don't have any homework?!    Sorry.  She smiles at Derek as the SONG comes to a close.   Cassandra.   The only person I've seen is Seth.   What the hell are you doing here, Dan?  They all look over.   What did I tell you, Dan?   There's a redhead out there looking for you. Go talk to her.  It wasn't too bad.   I agree.   The Mexicans.  They were really organized. I'll tell ya...it was impressive. They--   Be careful with me, Cam. You don't know what's going on with me.   I'm family, Cam? Is that why you came to see me all the time up there?  Cameron smiles but doesn't know what to say.   Fuck you, Cameron. You're a fucking chicken hawk...praying on kids.   No. You fucking use them.  To filter your insanity.  Cameron smiles in disbelief.   He's not your brother, Cameron.  All right? He's my brother. You hear me, Cam?    Derek takes Cam by his long hair and SMASHES his face into the mirror. IT SHATTERS. Derek follows with a solid punch to the kidney.   You gonna listen?!   Shut the fuck up! You're gonna stay away! That's what you're gonna do!  Derek rinses Cam's bloody face off by PLUNGING it into the toilet. He pulls him back up and they face the mirror.   It's over.  Derek stares at him in silence. CAMMERON RETALIATES. He forcefully backs Derek into the wall behind him. He throws two punches at Derek -- one in the stomach and one to the face that opens his lip. He misses on his third and Derek gets the upper hand.  BACK TO THE MIRROR. Derek prepares to crash Cam's face into the shards of glass one last time. The final blow. As Cam screams, Derek launches him forward then pulls back at the very last moment. Derek, noticing Cam's condition, throws him into the tub.  Derek throws him a towel, grabs one for his lip, and exits.   What?!   I haven't seen him.  Cassandra looks at him curiously and then focuses her attention to the bedroom.     I'm serious, Stacey!  Stay away!  She grabs and pulls on his shirt.   I don't care.  Stacey looks deep into his eyes and can feel it.   Let him go, Seth.  Seth sees blood on Derek's face and shirt and takes a moment to identify the source. He draws his 9mm Baretta and points it at Derek's head from four feet away.   Come with me right now.  He looks at his brother. He then sees Curtis and three other skins come through the house. Derek stares at Dan and hauls ass down the back alley.  DANNY'S POV. Curtis arrives and tends to Seth rather than go after Derek. Confused and mildly embarrassed, Danny bolts back into the house to get his board.   What the luck are you thinking!?   They're not friends, Dan!   Just sit there and relax for a second.   His boy? No, I don't think so, man. I'm not anybody's boy.   Nooo, I don't know what you mean.  Derek and Stevie lock eyes.  Stevie sneaks a hit and offers Derek.   Nooo...how about you getting that fucking shit awax from me?  Stevie looks at him, ready to kill. The other two can't believe Derek's gall. Stevie shrugs.   Excuse me? Do I have a problem? No, I don't have a problem. Do you have a problem?   Who the fuck are you?  Derek turns back to the other two and they are already walking away. Derek looks at the two and back to Stevie. Stevie sits with HUGE ARYAN and says something to him.   And you don't!?  Shut up.   I'm right here, man. You wanna have it out with me, let's go. Just me and you though.   Stupid?! You have anything else to say, you little pussy! Hunh?!   They killed my father, Sweeney.   Get me outta here, Sweeney.  Sweeney looks at the young man, heavily weighing his options. The two lock eyes.   All right. How are you?   I'm not going to do anything.    Hey Mom.   How are the others?   What about Dan, Mom?  How's he?     Pretty shitty assignment you got.   Oh yeah? What the hell do you know- about my father?  The two men sit there speechless as Derek walks over to an awaiting Danny.   Hey. Wake up.  She looks at him, delirious.   Time for bed.    Dan types at the computer as Derek escorts Davina and Doris to bed.   Goodnight, Mom.   Good morning.  Doris sets food in front of her two sons and they both go to work. Young Danny eats quietly.   What for?   Sweeney actually had a pretty good take on affirmative action the other day.     Yeah.   I like that color, Davina.    Yep.      He stares into the mirror in a coat and pants.  Danny rushes to get his things together.   Hurry up.  Derek walks out into the living room.   I gotta see my parole officer.   I've got everything on disk.  Davina smiles and walks into the back bedroom.  Doris looks at Derek.   We're getting out of here soon.  Is that okay with you?    Yes.  He sits beside his mother and enjoys the moment.  He thinks to himself.   You think you'll be able to forgive me? Someday maybe?   Look at me. I'm such a pussy.    He takes a guarded look outside. Everything seems normal. A bus drives by. A group of Mexican laborers, dressed for work and smiling, walk past in the other direction.  Inside, a black woman orders a dozen doughnuts from a short Korean.man behind the counter. Her young daughter grabs her leg. Danny sits down and reads Derek's paper.   What do you want?     How do I look?   What's your name?   How old are you, Tisha?  She holds up four fingers. Derek smiles.   What's goin' on?   How'd you find out I was here?   How bad?   Fuckin' A.  Sweeney sighs.   I can't, Sweeney.    They are outside the fence surrounding the field. Students head off to morning class.   Hey. Keep your head up, alright?  I'm going to take care of this.   I don't know. I'll figure it out though. You gonna be okay?   Hey.   Come here.  Derek puts his hand over the fence. Danny walks up and clasps it -- FINGERS INTERTWINED. Derek wants to say one thing but something else comes out.   I'll see you at home.  Danny smiles at his brother and nods. Danny puts his ear phones on and heads to class. Derek watches his brother through the chain-link fence. Danny meets up with Lizzy and they soon disappear from Derek's sight. Derek turns and walks down the street.   Nope.  Derek stops in his tracks, walks back over to the fence, and stares at the school.    Derek cradles his bloody brother. Sweeney walks over, crouches, and talks to Derek's back.    I can't.  Derek begins to cry outright. He can't control himself. He lets go of Danny's corpse and charges out into the hall.   How the luck do you know what I'm thinkin', Sweeney!?   They shot him in a fucking...pisshole!   It stops now, Sweeney.  Sweeney nods and the two lock eyes. Derek makes his way back to Doris and Davina and together, they grieve.",
        "Murray": "I do not have a problem with him as an individual, alright!?   This paper is a travesty, Bob! Arguing for Hitler as a civil rights hero?! You've gotta draw a line.   Oh come on, Bob!   His brother probably put him up to it.   Don't let him walk scot-free here. For his sake...not mine. You might be all he has left.  Sweeney stares at the younger teacher and nods.   Thanks, Bob.  No.  You guys make bombs.  Derek stares at the man, eyes filled with homicide.   You're kidding, right?   Excessively.   Don't speak to her that way, Derek.   What the hell does that have to do with anything?   What are you trying to prove, man?!  Derek turns and laughs at Murray.    Jesus!   She can't breathe, Derek!     See. Here we go again with this, Derek. Making me out to be the bad guy again.    Hey goddammit! You talk to me with respect or--!     I never said she was a liar.   He's not a kid, Doris. We were kids. We didn't call people kikes.   You don't know your children, Doris! You have no clue about the world they live in. Your son is a terrorist.   He's a member of the Disciples of Christ. You remember that grocery store incident?!   My sister and her two kids got evacuated from her Temple in Woodland Hills!   And I wouldn't want to. Goodbye.",
        "Danny": "The sex happening in the next room makes it difficult for Danny to sleep. Next to a digital clock that reads 3:07AM, the clean cut 14-year-old flips to his side.  A poster of Lee Ving of FEAR onstage, taped to the wall. Pre-Calculus and Biology books on the floor. Cassettes scattered on his tiny desk. A stereo in the corner.  The off-screen sound of breaking glass grabs Danny's attention. He sits up and looks through the blinds.    His fearful expression says it all.   Holy shit.  Danny quickly bolts out of his room and into the adjacent bedroom down the hall. He barges through the door.     Der !  Danny walks over and shakes him. Startled, Derek forcefully grabs his little brother's arm.   There's a black guy outside Der... breaking into your car.  Derek, muscled and tattooed, jumps out of the bed and quickly puts on his skivvies. He reaches under his mattress, pulls out a SIG .45 semi-automatic pistol, and shoves in a clip.   Not long.   One...I think.   Hunh?   I'm not sure.    They stay down on the carpet together.    From the rain-soaked window he watches Derek face his wounded prey - crawling on the ground. Sirens sound from a distance.   Hey Lizzy.     He sits in a chair next to an office door marked DR. ROBERT SWEENEY - PRINCIPAL. Danny glances at the secretary as she types and talks on the phone.  TIGHT ON DANNY. He listens to the conversation through the the crack in the door as his eyes swell.   I knew it was you.   Before he even gets through the door he's chastised.   What's what going to be?  Well...I don't know.  Yeah.  Okay.  Fine.  Yeah.   Come on, man! I followed directions and wrote an \"A\" paper. It's got nothing to do with Derek.   Let us get on with our lives, man!   Do it. What?  You don't think I could handle it?   It took me a week to read Mein Kampf. Come on, Sweeney.   What am I doing it on then?   People look at me...and they see my brother. That's how things have gone since the murder of our father.   Little Henry Hastings and his older brother Jerome. Jerome's a Shoreline Crip...Henry's on his way.  Little Henry and older brother JEROME catch their breath and stare down Dan. Danny doesn't flinch. Jerome sips from a 40 oz. beer and resumes playing.   Venice Beach, man. It didn't always look like this. I mean...our Dad used to take us down here to run...and it was cool. Derek fucking owned this place.        Since then though...the gangs, man--  TIGHT ON DANNy. He watches the basketball action as he takes a drag off his Marlboro Red.   --they've moved west from Inglewood and South Central and have really just...taken over. Especially at my high school. The Venice Locos are big too but they hang out in bumluck Mar Vista. It's scary. And then there's The Disciples of Christ. The D.O.C.  Jerome and Little Henry joke and argue with eight extra players and spectators.   It's eight-six, Seth.   You gotta call offense on that shit.     Yeah! Fuck...yeah!  A sweaty Derek pulls his little brother close. He takes a drink of water, spits out more blood, looks at his bitter opponent, and says nothing.    Danny awakens from his daydream. The black players now stare at him. Danny puts his board down and skates down the boardwalk.   It was only the beginning. Derek once told me that minorities would take America over one day. That white people are too afraid. Maybe he was right.    Hey.  Where?   There's dick for waves.   I've been trying to buy this.  You can't find it anywhere.  The two look at Dan.   Fuck that. I just read Mein Kampf.   Henry Hastings almost kicked Daryl Dawson's ass. He would're too if--   Everyday there's something over there, man.   I hear you.    The three skateboard down the strand, Jason and Chris with their surfboardS and suits. Chris looks at Jason's shirt.   Zionist-Occupational-Government.  Ahead an OLD ASIAN WOMAN tows a succession of SHOPPING CARTS. As Jason passes, he smacks her with his surfboard and knocks her to the ground. They all laugh and Danny breaks off and heads east on Rose.   Oh man--! Come on!  What are you crying about now?  THE PHONE RINGS and Derek rushes down the hall to get it.   Are you feeling better at all?   I'm still trying to figure it out.   Fuck off. When'd you start carryin'?   Jesus!  Chew your food, dude!   You got pigs outside.   {to the tv  Goin' to Cam's party tonight?  I'm there tonight.  Noo...but he's got two kegs.  Is Cam playing sticks?   I got homework, Seth.   Fuck off.   About Adolf?   I believe in filth and destruction and chaos and death and greed.   I believe in my family.   \"Respect your father and your mother. Whoever curses your mother and father... is to be put to death.\" Matthew 15-4.   You mean that stuff about your mother?  Davina CACKLES in the background.   No.   Yeah, man. I believe in Adolf.  Seth smiles at the youth and speaks intimately.   I hate everyone that isn't white Protestant.   Because they're a burden to the advancement of the white race.  Some of them are all right--   I don't know.  I feel threatened by them.   I hate the fact that it's cool to be black these days.   I hate this hip hop influence on white fuckin' suburbia.   I hate Hilary Clinton and all of her Zionist MTV pigs telling us we should get along. Save the rhetorical bullshit honey, it ain't gonna happen.  Seth looks at the young man.  He smiles at him with distinct revelation.   What's it to you?     No.   I did it cause I felt like it.   Uhhh...yeah.   Was that him on the phone?   Are you gonna to live or what, Mom?   You got any more?   I'm goin' in a second.  Relax.   No he's not.   Whatever, dude. I'm gonna go power that shit and I'll see you later.      This sucks.   He watches Davina complete her homework on the couch. Doris, on the sofa opposite, tries to sleep.   Hey.  Come here.   Come here for a second!  The scholar sets her homework aside and impatiently follows him down the hall.   Just read it.  She sighs and begins to read it out loud.   Asshole turned me in.   Just read.   The night Derek wasted those guys.  Davina takes a moment.    Yep.   Nooo...it'll be good for you.  She stares at him for a good three seconds.   Come on! Dick Nixon's playin' at Cammeron's tonight. You owe me.   Goddammit!  Davina walks to the door and looks back to her brother.   Asshole Sweeney.  He slowly begins to strike the computer keys. The screen reads \"People look at me and they see my brother. That's the way things have gone since the murder of our father,\"  TIGHT ON DANNY.  The frustated kid sits and thinks to himself. himself.   It was lunacy after he left us. All the time. Derek believed in Cammeron...he was angry...that combination gave them bodies. White punks...sick of gettin' their asses kicked by black and mexican gangs at school.    Seven skins, including Seth and Curtis, smoke and wait.  DANNY'S POV. Danny looks to his left and sees Derek with Cammeron, who sits in the driver's seat of the BRONCO. Stacey leans in from the backseat.    He takes off his stocking mask and stares at his stone- faced brother.   And before Derek could even blink...he had a crazed army behind him.   Willing to follow his word like it was the word of God.   And then came October 4th, 1993.   Things were fine on the homefront. My Mom had a good job but a below average boyfriend. We had a four-bedroom house that Dad left us with. Everyone was happy.  TIGHT ON DEREK. Shaved head, rolled-up sleeves, tattoos, loosened tie, LA COPY CENTER name tag from earlier. His charisma draws their attention as he rambles over the crackling rainfall.   Everyone but Derek.    He takes a long drag off his cigarette and exhales. He slowly runs his hands over his stubbly head, marveling at the past.    Davina?  Derek hears Dan and looks out of the corner of his eye. He spots her at the last moment.   I believe you, Der.  Derek smiles at his little brother, lovingly.    He rises from the computer and PEEKS out the blinds. The two cops supposedly watching Derek are now eating in the car. One of them looks up. Danny flips the blinds down. From the other room, he hears Doris break into another coughing fit.    He sits beside her and hands her a glass of water.   Here.   I've got this thing to do.   Don't breathe on me.   It's cold in here, no wonder your sick.  She stares and smiles at him for a few moments.   What?   No. You're not.   Nope. Never.   Get some sleep.   I'll be all right.    He grabs a flannel and throws it on. He sees a cigar box that rests on the right shelf. He grabs it and looks inside. The rolled-up LA TIMES clipping reads \"Prominent Skinhead Charged with Murder.\" The accompanying picture of Derek is near evil.  TIGHT ON HIS EYES.  Danny stares at the clipping.  ON THE  Let the cops handle it, Der!  Derek!?   The cops are comin' Der'  Lawrence mumbles something unintelligible from his outstretched mouth.     No!  Derek STOMPS his foot on the back of LAWRENCE'S head - completely tearing his jaw in half on the curb's corner.     Joseph Conrad once wrote that \"murder is always with us. It's almost an institution.\" That couldn't rang more true than with me.   Bobby Lawrence died of massive head trauma early that morning.  Derek marches past the bodies -- which are being tended to thoroughly.   Six months after that...Derek was convicted and sentenced to seven years for voluntary manslaughter...to be served at the California State Penitentiary in Chino.  Rasmussen forces Derek's head down and he gets in the car. He stares at his brother and sister as police lights flash on him. Then to Stacey. Finally, to a lifeless Doris. They lock eyes as the patrol car takes off down the street.   Prosecutors wanted murder one for my brother's torture method...but there wasn't enough \"premeditated\" evidence.    They clearly focus on the computer. HIGHLIGHTED is the sentence \"There might have been if I testified.\" Only when he hits the DELETE KEY does it disappear. He continues typing.      He looks through the PEEPHOLE and sees it's CHRIS AND JASON. He sighs in relief and opens the door.   I told you I can't tonight.   It's okay, Mom.  The two punks laugh as Danny pushes them and their boards back to his bedroom.  He shuts his bedroom door.   If I don't finish this thing I'm dead.   She did?   Hello?   Yeah?     Everything's fine.   I'm doing it right now.     You fuckers are going to get me booted! Dr. Sweeney? I'm sorry, man.   It'll be there, alright!?   Let's go.   Take it easy, dude!  Seth then grabs Danny hard by the shirt.  Chris and Jason stare at him like he's gonna hurt him.   What're you doin'?!   I gotta do that paper though.   My teacher cried to Sweeney, man. have to do another one.  Cammeron laughs.   I had to check it out, Der.  Come on.     I like you, too.    Seth, man!? Come on!  Seth puts the gun directly to Derek's cool head.   Fucking asshole!  Derek gets on top of his brother, spots a speeding car heading right for him, and pulls his brother to the sidewalk. Just in time.   What are you thinking!? Friends don't fight friends, Der! They stick together!   What the hell are they then?!  Derek picks his brother up and sits him on a BUS STOP  I don't wanna relax!  You looked like an idiot back there!  Derek stares and sits next to him. Cars and homeless randomly pass in the b.g. Danny looks at his brother, transfixed in thought.   What's happened to you, Derek?  TIGHT ON DEREK. He looks into his brother's eyes.    He sits back down at the computer and looks back at his brother as he dries off. Danny thinks to himself and types a sentence.   There was only one person who loved Derek more than me.   That was Dad. They were best friendS. Fathers and sons are never best friends...but they were..  YOUNGER DANNY stares at his larger-than-life father with a cap turned backwards. Doris breaks from song and yells to the back.   Don't we have to have \"affirmative action?\"   Coach's sick.    Sure.     Okay.  Dennis smiles, reaches over with a fatherly hand, and messes up his hair.    He stops typing and almost cries. He leans back in his chair and and stares himself in the side mirror. He feels his bald head, almost exploring.   I'm printing it up and we're out of here.   Maple bar and a...large milk.  Derek smiles at the little girl while he waits. She wanders from her mother's leg and over towards Derek.    They are outside the fence surrounding the field. Students head off to morning class.   How?   Yeah.  The two stare at each other as THE BELL RINGS.   I gotta turn that paper in.  Danny hops the fence with his backpack on. He looks back at Derek. Cops #1 and #2 sit in their car in the b.g.   What?    Students rush past them. Danny kisses Lizzy and she hurries off to class. He pushes on the men's room door.   Jesus Christ.  What are you doing, Henry?   Come on, man, no.  You don't want to do this. Come on.  Henry?  THE DOOR SMACKS OPEN and Danny moves to grab the pistol. It discharges and a bullet rockets into Danny's chest. He SLAMS back into the URINAL and gasps for air. The force of the pistol knocks Henry to the ground. The two kids who just entered bolt for help.  Danny slides to the tile, leaving a bloody trail. The two stare at each other - EYE TO EYE. THE BLOODSTAINED PAPER falls into the DAMP SINK. Danny inhales like glass is raking his lungs.    Derek cradles his bloody brother. Sweeney walks over, crouches, and talks to Derek's back.   We've heard it a million times, a Bible quote become cliche: \"Vengeance is mine, sayeth the Lord.\"    A still of the two immediately after the murder. We move in tighter and tighter until we get close on Danny.   Vengeance brought about by hate...and fear. When it points its head in our direction, we take notice and everything changes. The way we choose our friends, the way we protect our families, the way we create enemies out of strangers. Welcome to America.  TIGHT ON DANNY'S EYES. They are gently pushed shut by Henry's two small BLACK FINGERS."
    },
    "imdb_rating": "8.5",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZTJhN2FkYWEtMGI0My00YWM4LWI2MjAtM2UwNjY4MTI2ZTQyXkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "Derek Vineyard is paroled after serving 3 years in prison for brutally killing two black men who tried to break into/steal his truck. Through his brother's, Danny Vineyard, narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did.Nitesh D.(nmxpa7@msn.com)",
    "name": "American History X",
    "genres": [
        "Crime",
        "Drama"
    ]
}