{
    "filename": "American-Graffiti_script.txt",
    "imdb_id": "tt0069704",
    "imdb_url": "https://www.imdb.com/title/tt0069704",
    "characters": [
        "Curt",
        "Disc Jockey",
        "Bob Falfa",
        "Holstein",
        "Terry (as Charlie Martin Smith)",
        "Debbie",
        "Carol",
        "John",
        "Wendy",
        "Steve (as Ronny Howard)",
        "Ants",
        "Budda",
        "Carlos",
        "Laurie",
        "Joe"
    ],
    "dialogues": {
        "Curt": "Well... ah... why don't you hold onto it for a while?  Steve... Ah, I think we'd better have a talk. I've gotten-  Now, Steve! Let her wait.  Yeah, well... Listen... I... I don't think I'm going tomorrow.  I don't know. I was thinking I might wait for a year... go to city--  Wait, let me explain--  I just want some time to think. What's the rush? I'll go next year.  Why is it every girl that comes around here is ugly? Or has a boyfriend? Where is the dazzling beauty I've been searching for all my life?  Hey, John. Someone new in town.  You gonna go after him?  The big shot!  Hey, sis--what's wrong?  What's wrong, he's crying!  I'd like to, Toad, but I'm going with Steve and Laurie to the hop. I'd just slow you down anyway.  Yeah.  You ain't got no emotions?  Why don't you come with us?  Come on. For old time's sake.  What's the matter John? Did I say somethin' wrong? I'm sorry.  Well, we'll see you later, okay?  We'll all do somethin' together. You know, before Steve leaves.  I don't know.  What?    Quick! Hang a right!  Cut over to G Street, I've just seen a vision! She was a goddess. You've got to catch her!  I'm telling you, this was the most perfect, dazzling creature I've ever seen.  She spoke to me. She spoke to me, right through the window. I think she said, \"I love you.\"  That means nothing to you people? You have no romance, no soul? She-- someone wants me. Someone roaming the streets wants me! Will you turn the corner?  (grinning as he pulls out a pack of cigarettes  No, not yet. I have no matches.  Blotto.    And only stayed a semester.  Why?  Well, you know I might find I'm not the competitive type myself.  Well, I'm not really sure that I'm going.  Jane...  Yeah... I'll see you. Thanks a lot.  Well--hey, Wendy.  Fine. Great. How've you been?  Ah, maybe... maybe.  Hey, Wendy--where are you going?    Okay.  There--don't you see it? Speed up, you're losing her--  Cut around him, cut around him.  There, hang a right--over there!  You lost her!  Lost her again. Ah, Wendy, my old lover, come back here and console me.  I don't know, but I'm going to find out.  Okay, come on, who is she?  Yeah.  But she was young and beautiful, and cruising 10th Street. You're thinking of someone else.  What cruel fate keeps me from my true love? How am I ever going to meet her?  Maybe I've grown up. Maybe I've changed my mind.  Maybe you should shut up!  Why don't you move your bod into aft chamber, where we might discuss this in private.  Come on, Wendy? She doesn't say anything. They pull up to a stoplight. Wendy looks at the red stoplight and then abruptly gets out of the car and jumps in the back.  To the Opera, James.  Unless you want to go to Gallo Dam and have an orgy.  Maybe.  Huh? Yeah, I know him.  What do you want me to say?  Kip, baby, what's up?  Not much, just wanted to let you know that Bobbie here is hopelessly in love with you and trembles at the sight of your rippling biceps...  Help, wait! Joke--Joke--Bobbie, remember your nose bleeds!  Excuse me--ouch--Wendy--I got to go now.  See ya.  Oh shit--there!! Wait!  Me?  Gil Gonzales... no.  Yeah... why?    I guess so--yeah.  I'm sorry. It's not much of a scratch. I don't think he'll even--  That's funny Hey, you guys know Toby Juarez? He's a Pharoah, isn't he?  He's a friend of mine.  Oh--well, I don't know him that much anyway.  Well, I don't think I can--I gotta--  Probably is. Whimps get all the snatch.  Hey, terrific, I love miniature golf.  Well, I don't play that often really. Ah--what're we doing here then?  They don't sell gas here.  Curt.  Hey, hi. Mr. Gordon, what's up?  These are my friends. We were just...  Oh ah--no--no, I'm not--  I mean, I'm not leaving until tomorrow.  Ah, he means, we're all done having loads of fun out here.  Yes. Yes, it is. Thank you. Thank you both.  I think I have.  No, I won't forget you and you won't forget me.  'Bye.  Right. What he said goes for me, too.  Hey--any of you guys know a blonde in a white T-Bird?  I was just wondering who she is.  Price range? You mean she's a--  We must be thinking of different blondes.  Curt.  Wait a minute, wait a minute, Joe. What if he hears me?  No.  No, I don't.    Yeah, yeah. No sweat. Let's get out of here.  Stand by for Justice!  Yeah, there's some things I got to do. I still want to find that blonde.  Yeah, I guess so.  Hey--I'll see you guys.  Hold that up.  Wait a minute, wait a minute. I've heard this already. Aren't you the one who for eight weeks has been telling me you have to leave the nest sometime?  No--no realizing. You've been telling me all summer that it's time to pull your head out of the sand and take a look at the big, beautiful world out there. Gimme this thing.  (banging the Citroen hood shut  Wrong nothing. You've been talking about getting out of this town for eight weeks. And now--goddamnit!-- you're just--you're just mentally playing with yourself. If you can just relax, we'll talk about it at the airport.  I have a dental appointment.  Just relax, wil ya? I'll see you at the airport.  It's--I want to talk to the Wolfman.  I know, but I got to get in touch with him. I got something to give him before--  No, I can't. I want to ask him something that--  Listen, I got a right to talk to him. I listened to him every night for as long--for twelve years almost. I know him and it's personal and it'll only take a minute and I bet Wolfman would be upset if he knew a friend couldn't get in touch with--  I'm looking for a girl.  No. Thanks. Listen, ah...  Are you the Wolfman?  He's on tape. The man is on tape.  Well, ah--where does he work? I mean, where is the Wolfman now?  But I got to give him this note.  No, no. See, this is very important. I may be leaving town tomorrow, and it's very important that I--damn it, that I reach this girl right now.  Well, I'm supposed to go to college back East tomorrow. And I don't know if I'm gonna go.  No, thank you.  Why don't you leave?  That'd be great. Thanks. Really.  'Bye.  Wolfman...  Hello, hello, hello!  Yeah... this is Curt, who is this?  Do you drive a white T-Bird?  You know me.  Who are you? How do you know me?    No... I don't think so.  I'm leaving... in a couple of hours. Where are you from?  What's your name? At least tell me your name?  Wait a second! Wait a second!  Yeah, same to you. And I better see you there next year.  Sure.  See ya later.  So long, guys.  Yeah.  I'll see ya, buddy.  Okay, John. So long.",
        "Disc": "",
        "Jockey": "",
        "Bob": "Quit shouting in my ear!  I do not! You shut up!  I know her!  You know Mr. Beeman? He owns Hepcat Jewelers.  Well, she's his wife.  (seeing that Wendy is considering it  Drop dead.    Do you know Kip?  Talk to him when we go by.  Anything... I just want to meet him.  You creep, fink, son-of-a-bitch--  Get out--get out of my car--I hate you!",
        "Falfa": "Hey, you know a guy around here with a piss yellow deuce coupe--supposed to be hot stuff?  I ain't nobody, dork. Right?  Hey, you see this Milner, you tell him I'm lookin' for him, huh? Tell him I aim to blow his ass right off the road.    Where ya been hiding? Didn't anyone tell ya I been looking for ya?  They say you're the fastest thing in the Valley. But that can't be your car, man. That must be your mama's car. Hell, I feel embarrassed just getting near ya.  Field car? What's a Field Car?    Well, at least I don't have to move over to let a funeral go by, man.  Come on, boy, prove it. Let's go.  Hey, that's a tough lookin' girl you got with you, man. What're you doin'? Trying to pick up a few extra bucks babysitting? Hey, Doll. Why don't you come on and ride with me--in about ten years?  Hey Hey Hey, baby, what do you say?     All right now, where's this Paradise Road?  Why don't you shut up, baby? You ain't said one word all night long. What a weird broad. But you're gonna appreciate me soon. You're gonna be hangin' on for mercy, when I get this sucker rollin'.  Yeah, she's with me. You worry about yourself, man.",
        "Holstein": "Where you going, Milner?  Where you been, Milner?  Milner, you weren't around the 12th and G streets at about 8:30, were you?  Uh-huh. Milner, the reason I stopped you was because the light on your license plate is out. I'm gonna have to cite you for that. And Milner, the front end of this... this... this thing you're driving looks a little low.  Look, Milner.  You can't fool with the law.  We know that was you tonight. We have an excellent description of this car. I could run you in right now and I could make it stick. But I'm not gonna do that, Milner, you know why?  Because I want to catch you in the act. And when I do, I'm gonna nail you, but good. Happy Birthday, Milner.",
        "Debbie": "For real?  You really think I look like her?  Debbie. I always though I looked like Sandra Dee.  This your car?  It's really tough looking.  Dewey--can it lay rubber?  Wow--bitchin' tuck and roll. I just love the feel of tuck and roll upholstery.  Yeah.  Okay.  Peel out.  Peel out. I love it when guys peel out.  I never seen ya.  They got the best uniforms. But what if there's a war?  I love Eddie Burns.  You really think I look like Connie Stevens? I like her--Tuesday Weld is too much of a beatnik, don't you think?  Who do you like? I mean, singers and stuff.  (putting her head on his shoulder  You know what I'd like more than anything in the world right now?  I'd love a double Chubby Chuck. Isn't that what you'd like more than anything right now?  And cherry cokes.  Beat it, Vic. I'm not your baby.  Three weeks... besides, it only took one night for me to realize that if brains were dynamite, you couldn't blow your nose.  Tiger happens to be very intelligent. Unlike you. I know every thing your dirty little mind is thinking... ...it shows...  I won't be home.  That sex fiend is not a friend of mine; he's just horny. That's why I like you, you're different.  Yeah. And I'll bet you're smart enough to get us some brew.  Yeah.  Do you have an ID?  If you could get some Old Harper, I'd give you a French kiss.  Hey, did ya get it? Ya get it, ya get it?  You got it. You got it!  You didn't get it. Why didn't you get it?  What? Are you for real? Come on. Girls don't pay. Guys pay.  Well, I can't believe this... I really cannot believe this. Here.    Wow, it's pretty tonight. It's a perfect night to go horseback riding-- I was going with a guy once who had a horse.  Really?  Do you still have 'em? We could go for a ride.  Why do you kill little animals? I think that's terrible.  Wait a second.  There--now.  Ow--you pinched me.  Let me get my head over here--okay, now you get up--  Ummm, I just love tuck 'n roll upholstery.  Nah, come on. They won't come back.  All right. Okay.  What's wrong?  What?  Anyway, the Goat Killer--  --Whenever he strikes, he leaves a bloody goat's head near the victim. Isn't that creepy?  They thought he went up to Stockton, but two nights ago they found Carlie Johnson and Don White right here by the canal all hacked to pieces and--  --not only were there bloody goats' heads, but he had switched all the parts of their bodies around. You know putting her arms on him and his legs on--  You think it's the Goat Killer?  Come on, we'll hide in the field.  Maybe if it's the Goat Killer he'll get somebody and we'll see the whole thing.  Shhh--he's stopped. I can't see him very--I think he's coming this way.  Over there.  Hello.  Hi.  Yeah. Yeah. It's a good thing too. 'Cause somebody stole our car.  Yeah, I do. I do.  Why can't we go to Burger City?  Hey, why don't we go get your jeep?  You know, your jeep. The one you sold the hunting ponies for. The one with the four-wheel drive.  Come on, Terry--Terry?  Oh no, he really likes to drink. He told me.  Maybe we oughta call the police.  Stop it, stop it, stop it! Help! Police! You creeps!  Hit him!    I don't believe it! You practically get killed trying to get your car back, then you let him have it.  What?  Well, where is your car?  You don't--no car at all. What about your jeep?  No car... well, how am I going to get home?  You know, I had a pretty good time tonight.  No, no, really. I really had a good time. I mean, you picked me up and we got some hard stuff and saw a hold-up, and then we went to the Canal, you got your car stolen, and then I got to watch you gettin' sick, and then you got in this really bitchin' fight... I really had a good time.  Anyway if you're not doing anything tomorrow night, why don't you come over?  Really? Why that's almost a motorcycle. And I just love motorcycles.  I got to go.  Goodnight.",
        "Carol": "I'll go. I'll go.  Old enough. How old are you?  You can't be that old.  But you asked me. What's the matter? Am I too ugly? Judy doesn't want me with her and now you don't want me with you. Nobody wants me... even my mother and father hate me. Everybody hates me.  I am not! If you throw me out I'll scream.  Hey, is this what they call copping a feel?  What's your name?  So the next night we found out where they parked and went out with ammunition.  No sweat--my mother does it. Anyway, he thought he was had. He started the car and couldn't see through the windshield--and zoomed straight into the canal--it was a riot.  I still got some, so don't try anything.  Spare me, killer.  Why'd you do that?  Don't you think the Beach Boys are boss!  Grungy? You big weenie, if I had a boyfriend he'd pound you.  Good, a cop--I'm going to tell him you tried to rape me.  It's past my curfew. I'm going to tell him how old I am, my parents don't know I'm out and you tried to rape me. Boy, are you up a creek.  If you say \"I was a dirty bird. Carol's not grungy, she's bitchin'.\"  Say it--I'll tell him.  Okay--I'll think about it.    C.S.? What's that stand for?  Oh...  I'm so thirsty, I could die. Just a little 10 cent coke to wet my whistle. It won't take a minute, I can drink it in the--  Isn't it great, the way I can cry whenever I want. A lot of people can't do that, but Vicki showed me how. I bet you can't cry.  Thanks for nothing.  Oh rats, I though some of my friends might be here.  Wait, there's Dee Dee. I hope she sees me.  Babysitting!!  You spastic creep!  Hi cousin, how's your bod?  Needs a paint job, that's for sure.  You never had a wreck though--you told me.  I bet you're the fastest.  I'd love to see you race.  Whadaya mean? I'm the one who's supposed to say that. Whadaya afraid of? I'll keep it above the waist.  Bunny rabbit! Oh brother, you are such a drip.  If you say \"Carol's not a bunny, she's a foxy little tail.\"  You say the cutest things.  I just love listening to the Wolfman. My Mom won't let me at home. Because he's a Negro, I think... anyway, he's terrific. Do you know that he just broadcasts from a plane that flies around in circles all the time? Do you think that's true?  Don't worry, I won't rape you.  All right, very funny. What a chop. Ha ha. Quit laughing!!  Let's catch 'em at the light. Then you jump out and flatten their tires.  Just do what I say!  It doesn't look like a gear shift knob.  Well, go ahead, cream me. What's wrong, you're a tough guy. Break my arm, see if I care.  I was just going to keep it for a little while. You're an ogre, just like my father. He won't let me play records, or stay out late, or anything.  No--he's terrible. Once I was at a party that didn't end till late and he called the cops. Can you imagine? It was only a little after midnight and he had the whole police force--  Over on Ramona, why? Oh no. Uh uh. You thought I'd tell you where--not me, not old Carol. The night is young and I'm not hitting the rack until I get a little action.  What do you keep lookin' at? Who's that? You know him? He's following awful close.    That didn't come out right...  Oh, race him, you can beat him.  Wow! He's really fast, isn't he?  Why are we stopping here?  What?  You can't?  Me?  Well--well, a lot of that's an act, you know. Like... like my crying. It was just an act.  It's not too late! It's never too late! 231 Ramona--two three one--  I'll show you! It's easy to find.  I had fun. Goodbye.  Do you like me?  But I mean, do you like me?  Couldn't I have something to remember you by?  Gee, thanks. It's just like a ring or something.  It's like we were going steady. Wait'll I tell Marcia.  Wait'll I tell everybody.  Well, I'll see you around.",
        "John": "Not too good, huh?  I know what you mean. The pickin's are really gettin' slim. The whole strip is shrinking. Ah, you know, I remember about five years ago, take you a couple of hours and a tank full of gas just to make one circuit. It was really somethin.'  Ahhh.  Hey, listen, Professor, if he can't find me, then he ain't worth racin', right?  Hey, did she do that to you?  Hey, wait a minute, you're goin' to the Hop? The Freshman Hop?  Oh, come on, man. That place is for kids. You two just got your ass out of there. Don't go back now.  Yeah, well, go.  Bullshit, man!  Yeah, yeah... Well, listen. You go. Go ahead, Curtsy, baby. You go on over there and you remember all the good times you won't be having. I ain't goin' off to some goddamned fancy college. I'm stayin' right here. Havin' fun, as usual.  Ah, man, it's nothin'.  Right.  Okay, wait a minute. Now, you're not going?  Hey, Zudo.  Hey, man, what happened to your flathead?  What happened to your flathead?  What?  Yeah?  Yeah, I know.  Yeah. All right, thanks.  Oh, oh. Later.  Hey, you're new around here. Where're you from?  Turlock? You know a guy named Frank Bartlett?  Well, he used to. He goes to J.C. now.  Yeah, sure.  Yeah, sure. I got him in a class.  How would you like to ride around with me for awhile?  Ah, come on!  You're just ridin' around with a bunch of girls. Hey, how about somebody else in there? Anybody else want to go for a ride?  Aw, come on... I got plenty of room. It's dangerous to have that many people in a car. Cops see ya, you're had. You got nothing to fear, I'm as harmless as a baby kitten.    You ever get tired of going steady with somebody that ain't around--I'm up for grabs.  So, you're Judy's little sister.  Ah, shit,--how old are you?  I'm too old for you.  Listen, listen. I think you better go back and sit with your sister. Hey, ah... where are they, anyway? They comin' back or somethin'? This is a joke, right? This better be a joke, 'cause I'm not drivin' you around.  No they don't. I mean, I don't know, maybe they do. But I don't. It's just that you're a little young for me.  OK, OK, just stay cool. There's no need to scream. We'll think of something. It shouldn't take too long to find your sister again.  Oh, shit! Hey, get down!  Hey, cool...  NO! Uh uh. N-O. Don't even say that. Jesus...  Mud, if anybody sees you.  Don't you have homework or something to do?  Hey, watch it will ya! Jesus Christ, thanks a lot. Hey, drivin' is a serious business. I ain't havin' no accidents because of you.    I don't like that surfing shit. Rock 'n Roll's been going downhill ever since Buddy Holly died.  You would, you grungy little twerp.  (looking in the rear- view mirror  Oh, no--No. Hey--  Hey--ah, really--don't say anything.    I'm going home--sir.  Ah--at the movies--sir.  No, I wa at the movies--like I said-- sir.  Oh, no sir. It's twelve and a half inches. Regulation size. Now, it's been checked several times. You can check it if you like, sir.  Yes, sir.  Yes, sir.  Thank you--asshole.  Here, file that under C.S. over there.  Chicken shit--that's what it is.  Why don't you just get out and get one then! So long, goodbye, hasta lumbago.  All right, one coke and then home.  Don't count on it. I may surprise you any minute now.    Probably a couple of weeks past their bedtime.  Oh Shit, Dee Dee!  Have to be before noon.  No. Hi--ahh, this is my, ahh, cousin, Carol. I'm kinda babysitting tonight.  Jesus--watch it, will yuh? Been hittin' me all night. Kids will be kids, you know.  Watch out--damn it! Look what--why don't you grow up! We don't get along too well. It's been like this--  We don't get along too well. You know what cousins are like.  That's Freddy Benson's Vette... he got his head on with some drunk. Never had a chance. Damn good driver, too. What a waste when somebody gets it and it ain't even their fault.  That Vette over there. Walt Hawkins, a real ding-a-ling. Wrapped it around a fig tree out on Mesa Vista with five kids in it. Draggin' with five kids in the car, how dumb can you get? All the ding-a-lings get it sooner or later. Maybe that's why they invented cars. To get rid of the ding-a-lings. Tough when they take someone with them.  I come pretty close a couple of times. Almost rolled once. So far I've been quick enough to stay out of here. The quick and the dead.  I've never been beaten--lot of punks have tried. See that '41 Ford there? Used to be the fastest wheels in the valley. I never got a chance to race old Earl. He got his in '55 in the hairiest crash ever happened around here. He was racing a '54 Chevy, bored and loaded, out on the old Oakdale Highway and every damn kid in town was out there. The Chevy lost its front wheel doing about 85. The idiot had torched the spindles to lower the front end and it snapped right off. He slammed bam into the Ford and then they both of them crashed into a row of cars and all those kids watchin! Jesus, eight kids killed including both drivers, looked like a battlefield. Board of Education was so impressed they filmed it. Show it now in Drivers Education, maybe you'll see it. Anyway, since then street racing's gone underground. No spectators, I mean. Too bad.  Come on! None of that.  Funny... Who knows, in a few years--but not now, bunny rabbit.  Come on, open the door.    You got two seconds to get your ass over in the corner.  If the prize is you, honey, I'm a ready Teddy.  Hey, wait a--  Yezz, bozz....  Come on, will ya? Give it back to me.  Forget it.    Say, where do you live anyway?  Grab onto something.    Hey, I can't keep tracka all the punks lookin' for me.  Ya should, man--you're driving a field car.  Field Cars drive through the fields, dropping cow shit all over the place to make the lettuce grow.  Yeah, well, you're car's so ugly you must have to sneak up on the pumps to get a tank of gas.  Look kid, why don't you go out and win a few races, then come back and see me.  Leave her out of this. This is just between you and me.  Yeah. But he's stupid.    I--I don't think that I can control myself any longer.  No... Carol, I've got to have you.  All night you've been sitting there and you've been so sexy and it's been so hot--and I can't wait any more...  Well, it's been building up inside of me like a volcano, all night. Maybe if I knew where you lived I could fight it--I could take you home--but since you won't tell me, and since here we are--I've got to have you. It's too late--    This the first time you've been quiet all night.  Yeah. I like you. You're all right.  I, ah... I like you. Okay?  'Bye, kid.  Yeah.  Wait a minute, now.  Don't go overboard with this thing.  Yeah. Think so. There's some punk lookin' for me.  Yeah... it's been a long time, ain't it? I'll see ya. Thanks.  Hey, man, you all right?    What happened, man?  What's wrong, Toad? You lose the car again?  Naw, man. I can't take you when I'm racin' somebody.  All right. Go ahead.  Paradise Road.  Hey--Laurie, what in the hell are you doing in there? Is she gonna ride with you?  Come on, before she blows.  He was faster.  I was losin', man.  He had me, man. He was pullin' away from me just before he crashed.  You saw it.  Shit, Toad. The man had me. He was beating me.  Look at your glasses, man. Okay, Toad. We'll take 'em all.  We'll take em... let's get out of here.  I know, you probably think you're a big shot, goin' off like this--but you're still a punk.",
        "Wendy": "What are you doin', stealing hub caps?  How've you been?  I'm coming--wait a sec. She's got her car. Hey, I thought you were going away to school.  Same old Curt. All the time we were going together you never knew what you were doing... well, anyway, I gotta go.  Nowhere.    What's wrong with you? You know Bobbie gets nose bleeds when she's upset.  Eat your heart out. Who was she anyway?  Mr. Beeman's not so old.    Maybe you don't think you can do it!  Maybe I will... and maybe I won't.  Well, slide over, I'm not sitting on your lap.  You wish.  I've been silly. I'm glad you're going to stay. Maybe we'll have some classes together.  Curt, I hope I see you at registration. Call me if you want. It was nice seeing you again.",
        "Ants": "Tie him to the car and drag him.  Tied him to a car and dragged him.  No, I called it!  Before we picked you up.  Ah, man--they'll never catch the Wolfman.  Hey, man, who cut the cheese?  Hey, man, he looks like a whimp.  Thirty dollars ain't much. I saw ten thousand once. My old man had it in a suitcase. They caught him the next morning though.  That's rotten, man. Hiding like that.  I seen a little kid attacked by pigs once, but this was even better.",
        "Budda": "A cherry-vanilla coke and a chocolate mountain. Anything else you want, Steve? If there is you let me know now. Just honk and I'm yours.  One fries--grab it before I drop it.  He didn't dump on me, you little dip. Hi, Steve!  You've got to be kidding!  Hi. You mind if I sit down?  I got five minutes outa the rat race, and I saw you all alone. For a change.  Where's Laurie?  I thought the two of you'd be going strong, this being your last night and everything--  Wow... what happened?  Nothing. Just thinking. A girl like Laurie--I mean, she goes to school and is cute and popular and all, but we're not so different. We know what we want. I've seen her after you for two years now.  Maybe not. She does have a different approach. Hers is \"Never surrender,\" me I lay down my arms at the drop of a hat--    Why don't you? I never got a chance to talk to you. You're leaving tomorrow. Listen, I gave up a long time ago, so it'd be just for fun. No problems.  I'll see ya later then.  She's got you so brainwashed--well, hell. Some day I'm gonna win. Don't ya think?",
        "Carlos": "Shotgun!  When?  You can't call it for the whole night, man. I got it now. Get in the back.  You tell her, Wolfman. He's my man. When I graduate, I'm gonna be a Wolfman. Hey, you know he broadcasts out of Mexico someplace?  That's just a clearing station, man. So he can fool the cops. He blasts that thing all the way around the world. It's against the law, man.  Milner ain't gonna beat that. His time has come. He's getting old. He ain't as fast as he used to be.  Hey man, don't tell Joe what he thinks.  Fuzz ahead, watch it.  Fuzz ahead, watch it.  At Jerrie's Cherries. You can just barely see the fender.  That's shitty.  That was the bitchinest thing I ever seen in my whole life.",
        "Laurie": "Um, how you thought high school romances were goofy and we started going together just because you thought I was kinda cute and funny, but then you suddenly realized you were in love with me, it was serious... and ah... oh, you were leadin' up to somethin' kinda big.  ...\"consider ourselves adults\"...  You mean dating other people?  I think you're right. I mean, we're not kids anymore, and it's silly to think that when we're three thousand miles apart we shouldn't be able to see other people and go out.  I know. I just sort of think it's juvenile now. I'll keep it at home. It's less conspicuous there.  I didn't say that. I understand and I'm not upset. I mean, I can't expect you to be a monk or something while you're away.  Nothing.      We're not going to spend the night chasing girls for you.  I don't want to go out with anybody else.  I just wish I could go with him or something.  Come on what?  No thanks.  Who's stopping you?  How sentimental. You'll be back at Christmas.  Get your cooties off me--  Go ahead, slug me, scar my face. I wouldn't dance with you if you were the last guy left in this gym.  I'll dance with you, Eddie. You don't mind, do you, Peggy?  I don't care if you leave this second.  Oh God, come on.  (pulling him toward the floor  You think I care if you go off. You think I'm going to crack up or something. Are you conceited!  You take me out? When we first met you didn't have enough sense to take the garbage out... I asked you out, remember?  Backwards Day--remember? If I had waited for you to ask me--even after that you didn't call me for two weeks.  You were scared. Dave Oboler told me. Then when you did ask me out you didn't kiss me for three dates.  Scared--Jim Kaylor told me. I even asked my father why you hadn't kissed me.  He said he thought you were bright and you'd probably think of kissing me after a while.  You didn't, of course. I had to. Remember that picnic?  Oh boy! You can't remember anything-- the first one, up at the lake. That was the first time you kissed me--I practically had to throw myself at you.  Go to hell.    Yeah, hard tough.      You know, it doesn't make sense to leave home to look for a home, to give up a life to find a new life, to say goodbye to friends you love just to find new friends.  That's what Curt said.  That's not true. I didn't say anything. Curt just said at dinner tonight he realized there was no big hurry. He thought he should take it easy for a while, go to J.C. and try to figure out what he wants to do with his life.  You think so?  I'm not going to the airport tomorrow.  Steve! Don't.  We've been through this before.    Well go ahead, you want to.  If you're not going to remember me for anything else, why don't you go ahead?  You're disgusting! Get out of my car! I told you never--  Get out! It's not worth it. I don't care if you're leaving--now get out!  Just don't say anything and we'll get along fine.  You just follow this street straight out of town... Listen, if you're gonna race John Milner, you can let me out right when we get there.  Mind your own business, John.  I said I didn't--you lousy greasy jerk! You coulda killed me--what's wrong with you. You clubfoot...  No, no, no. Please, don't come near me. No, please. I think I'm gonna be sick. Oh, Steven.  Oh, Steven! Oh, Steven, please, don't leave me. Don't leave me, Steven.  I couldn't bear it.  Please.  'Bye 'bye, Curt.",
        "Joe": "Whadaya doin', creep?  No, I'm talking to the other fifty creeps here. You know Gil Gonzales?  Don't know Gil... you oughta. You really should.  No reason... he's a friend of ours... and that's his car you're sitting on.  Hey, where ya goin?  Ya must be going someplace--I mean ya left here. Bring him over here, Ants, I want to show him something.  Here--bend down, look here. See that? Right across there--see?  You scratched it, man. Where do you get off sitting on Gil's car, huh, man?  It ain't the size that's in question here. It's the principle. Jeez, this is tough... what should we do with ya?  Toby Juarez. Yeah, sure we know Toby.  Sure, good old Toby. He's a friend of yours. That's cool... we all hate his guts.  We killed him last night.  This is going to take some thinking. You better come with us maybe. Go riding with the Pharoahs...  I know just how ya feel.  No, he don't. I seen the station right outside of town.  He who smelt it, dealt it. Hey, creep, scoot down. Sitting up like that, it wrecks the lines of the car, you know what I mean?  There's that badass Chevy again. Look at he snatch he's got with him.  I hate it.  We're outta gas.  No... but we're outta money, too. Come on, Carl.  All right, men.  Hey, we're all done out here.  It was nice to meet yuh.  Yeah, you just might make it as a Pharoah yet, boy.  Yeah, I seen her, what about it?  She's outta your price range, man. My brother's been with her and he clued me in.  Yeah, Thirty Dollar Sheri. Can you believe that? Thirty dollars.  Where?  Where?  It's dishonest.  We oughta do something. I got an idea. I got a good idea.  Listen, ah--Carl, I--  Curt.  Despite you scratching Gil's car, I like you. And I know what you'd like more than anything right now. Like every guy in town, you got the same secret dream, right?  Ya want to join the Pharoahs. Huh? You can admit it--you'd like to--but you never dreamed it could be possible, did you?  Well, tonight, I'm goin' to give you your chance.  Get down!  Okay. Now you got it? I'm stayin' here. You're on your own.  Shhh. Listen. Look at it this way: Now you got three choices. One, you chicken out. In that case, I let Ants tie you to the car and drag you around a little bit. And you don't want that, right?  Two, you foul up and Holstein hears you and well, ah... you don't want that, right?  Three, you are successful and you join the Pharoahs with a carcoat, and the blood initiation and all that, huh?  Hey, you sure you got enough slack?  Oh mother, it's been a glorious night.  Oh boy, I'll tell you something, that car must've jumped five feet in the air!  You sure you got to go? The night's young.  I think she was an optical delusion, man. Psychology-wise it ain't good to dwell on it. You'll alter your ego or something. Anyway, catch ya tomorrow night?  Guess so? Man, we don't admit a lot of guys to the Pharoahs. You understand we're going to have to swipe your jacket and all--you gotta make up your mind.  Sure--listen, remember, Rome wasn't buried in a night."
    },
    "imdb_rating": "7.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZGE1YWIzOTItYjU5MC00OTM2LTk0MDgtOTBlMjY4NjkxNmVmXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_QL75_UX380_CR0,10,380,562_.jpg",
    "description": "It's the proverbial end of the summer 1962 in a small Northern California town. It's the evening before best friends and recent high school graduates, Curt Henderson and Steve Bolander, are scheduled to leave town to head to college back east. Curt, who received a lucrative local scholarship, is seen as the promise that their class holds. But Curt is having second thoughts about leaving what Steve basically sees as their dead end town. Curt's beliefs are strengthened when he spots an unknown beautiful blonde in a T-bird who mouths the words \"I love you\" to him. As Curt tries to find that blonde while trying to get away from a local gang who have him somewhat hostage, Curt may come to a decision about his immediate future. Outgoing class president Steve, on the other hand, wants to leave, despite meaning that he will leave girlfriend, head cheerleader and Curt's sister, Laurie Henderson, behind. Steve and Laurie spend the evening \"negotiating\" the state of their relationship. Meanwhile, two of their friends cruise around town for the evening. Steve has left his car to meek and mild-mannered Terry \"Toad\" Fields to look after during his absence. The wheels give Toad a new sense of confidence, which he uses to try and impress Debbie Dunham, a more experienced girl generally out of his league. And John Milner, who is seen as the king of the street race in his souped-up yellow deuce coupe, tries to get rid of precocious pre-teen, Carol Morrison, who has somehow become his passenger for the evening, while dealing with the challenge of bold out-of-towner, Bob Falfa.—Huggo",
    "name": "American Graffiti",
    "genres": [
        "Comedy",
        "Drama"
    ]
}