{
    "filename": "An-Education_script.txt",
    "imdb_id": "tt1174732",
    "imdb_url": "https://www.imdb.com/title/tt1174732",
    "characters": [
        "Jack Mellor",
        "Jenny Mellor",
        "Marjorie",
        "Graham",
        "Tina",
        "Helen",
        "Danny",
        "Hattie",
        "Small Girl",
        "Auctioneer",
        "Small Boy",
        "David Goldman",
        "Latin Teacher (as Kate Duchene)",
        "Miss Stubbs"
    ],
    "dialogues": {
        "Jack": "I don't want to hear anything through the ceiling this afternoon, apart from the sound of sweat dripping onto textbooks.  No cello.  It's already your interest or hobby. When they ask you \"What's your interest or hobby?\" at your Oxford interview, you can say, \"Cello\". That wouldn't be a lie. You don't need to practise a hobby. A hobby is a hobby.    No. The orchestra shows you're a joiner-inner. Universities like joiner-inners.  Well, if you stop, that shows the opposite, doesn't it? That shows you're a rebel. They don't want that at Oxford.  (missing the sarcasm, as  Where are you applying, Graham?  Well, when will you be sure? You can't let the grass grow under your feet, you know. Otherwise you'll be at the back of the queue.  What for?  Travelling? What are you, a teddy boy?    So she's studying English at Oxford while you're a wandering Jew...  What's going on here?  A chap? What kind of chap? Who? Why?  Are you sure that's all he's wishing? And where does he get the money from?  What do you mean, he earns it? Why isn't he at school? What does he do?  Well I don't like it.  Ten bob's worth of luck, I reckon. That's a lot for a schoolgirl. You can't leave them out here, anyway. I'd burgle a house that had flowers outside. They'll think we're made of money.  I won't allow it!    Where is it?  Where's that?  How d'you know that?  There we are.  Near Westminster Abbey. I'm not going all the way over there.  And I've just said. That's where I'm not going. There must be something on locally. Where's the paper?  And how are you going to get over there? RAF helicopter?  Oh, bloody hell.  (panic-stricken and  I didn't mean I'm not against you... Actually, I did mean that, because I'm not, but...  I'm sorry. What I'm saying is that you're not the sort of, of person I'd be against, if I were the sort of person who was against...people. You're not an old...Oh, dear. I'm Jack, and this is Marjorie.  I suppose I am, yes.  I'm sorry, David. Can I get you a drink?  No, no, nothing...It was more of a question, really. How would you get to St John's Smith Square from here? For future reference?  Simple as that.    Back by ten, please, David. She's usually in bed by then.  Oh, well, I suppose...  Well, it's Friday night. And if you're going out to the West End...    At least there's no confusion, if you smell of carbolic soap.  It's her Latin, isn't it?  And you still say I shouldn't go down there and have it out with whatsername? The Latin teacher? Because this is hopeless.   What if their best isn't good enough, though, eh? What do we do then?   Perhaps it's all a waste of time and money anyway.   Well, what's she going to do with an English degree? And if she's going to spend three years playing that bloody cello and talking in French to beatniks, then I'm throwing good money after bad. I suppose she might meet a nice lawyer. But she could do that at a dinner dance tomorrow.   Is anyone listening to me? How much is that going to cost me?      Five bob! But... we could spend five bob on this and five bob on that, and before we know it that's our savings down the drain.  Oh, nothing. (He gestures round the room.) It's all free. That vase was free.  That chair was free. The sofa. We don't have to pay for anything. And even if we did, we don't have to work for it. That's the beauty of life, Jenny. Everything's free. Grows on trees. Wonderful, isn't it? (He warms to his theme, and grows progressively more berserk. We've got a lovely Oxford tree in the garden, lucky for you, so that's Oxford taken care of. And a whole orchard of school trees, so that's all free. I'm sure there are some private tuition trees out there. I'll go and have a look.  No, no, won't take me a minute. I think I saw some at the back there, right next to the pocket money tree. I'll just nip out and check, see that they're doing all right.  Oh. Hello. David does the most brilliant Bluebottle, Jenny. Actually, he can do all the Goons.  Oh, no, you've got him...  Is that so hard to imagine?  Hark at her! Makes us sound as though we've signed the pledge. You don't know everything about us, you know. We had a life before you came along.  They can't stand to see me enjoying myself.  You didn't tell me David went to Oxford.  What did you read?   (marvelling at the  That's what you need, Jenny. Someone on the inside track. It's not always what you know, is it, David?     Well, I don't know about this weekend. But one day, yes, thank you.    Would it be a bother to you, David?  Here she is! The wanderer returns!  Was he nice to you?  Well I never. Look at this, Marjorie.  Never a dull moment with David, is there? If it's not concerts, it's famous authors. Bit different from that lad you brought home for tea, isn't he?  Graham could live to be two hundred, and he still wouldn't be swanning around with famous authors. Hasn't got it in him.  Being one isn't the same as knowing one, is it? Anyone can be one. But if you move in those circles...  Well, it says something about you, doesn't it? It says you're going places. It says you're well connected. He's an impressive young man, that David. I like him more and more.  He wasn't. And now he is.  Is David taking you somewhere special tonight?  What do we want him round for?  It might not be a bad thing if he did.  Well, if you think about it, there's more than one way of skinning a cat.  No, of course...  Blow them out, then, before the whole place burns down.  Come on. Presents.  Good grief. You won't believe this, Jenny. Did you leave anything in the shop?  She's a special girl.  Makes your dictionary look a bit feeble, eh Graham?  Well, we're not the ones trying to impress her.  David, what can I get you to drink?  I've given him a glass of pop.  A glass of something warming?    How d'you mean, Paris?    They don't like us, the French, you know. John Sutton at work went once. They were very rude to him. I'm not sure I'd like that.  I don't want to spoil anyone's fun, but...It's not for me, Europe. We'll go another time.    Aunt Helen? The one who went to the concert with you?    Aunt Helen! Don't you see? If Aunt Helen's going to be there...  I didn't want to put a spoke in anyone's wheels. But if you look at it from my angle...A bachelor, taking my daughter off to Paris...  Oh, I couldn't possibly ask...No, no. If Aunt Helen's going...  Oh, aye. The potting shed. Who does he think I am? Prince Rainier of Monaco?  Married?  It would depend who it was, surely?  Course it would. I wouldn't want you married off just for the sake of it.  Who?  David?  David's asked you to marry him? Bloody hell. Pardon my French.  Of course she's got a choice. But it's an interesting one, isn't it?  Well. Looked at it one way, you wouldn't really need to go now, would you? He's a man going places. And say what you like, but they know how to take care of their money, don't they? He'll see you're looked after.  You know what I mean.  We don't know about nightclubs. We knew about education. Anyway, it all turned out for the best.  He wouldn't have wanted you if you were thick, would he?  How d'you mean, left?  What about your exams?  What are we going to tell people?  All that...  No. No need for Jack. She should hear it. All that money! Do you know how much it's cost me for you to go through school and take no exams?  You know what your trouble is, don't you? You're too clever by half.  What sort of things can you have for starters? I mean, how will I know what are starters and what aren't? I'm all right if it's soup or fruit juice. But if it's anything more than that...  Why don't you three go out? I'll be happy here with a tin of...  Someone told me that.  I was hoping you'd take us in this.  I feel like Eamonn Andrews.  Do you think we should offer him some petrol money? Or would he feel insulted?  He'd feel insulted, probably. He said tonight was his treat. That must include the petrol, for God's sakes?  What do you think?  God almighty. What have I done?  What's going on?  What's happened?    What's going on?  He just drove off.    Well we've got to have this out. If you won't do it, I will.  I beg your pardon? I'm still your father, Jenny.  We didn't...  That doesn't mean....what I think it means, does it? It can't.  Just tell me that you didn't...you haven't, you know...You didn't....  Jenny.  There's a cup of tea for you here.  I know I made a mess of everything.  All my life I've been scared, and I didn't want you to be scared. That's why I wanted you to go to Oxford. So that if someone asked you out to a nice restaurant, you wouldn't panic about what was a starter and what was a main course. And then David came along, and he had money, and he knew famous writers, and he knew how to get to classical music concerts. But he wasn't who he said he was. He wasn't who you said he was, either.  The other day, your mother and I were listening to a programme about CS Lewis on the radio, and they said he moved to Cambridge in 1954. And I said to Marjorie, Well, they've got that wrong, because how would our Jenny get her book signed, if he wasn't in Oxford?  Jenny, I'm sorry.",
        "Mellor": "",
        "Jenny": "Isn't it because Mr Rochester's blind?  I've got an English essay to do by tomorrow morning.  Cello?  I thought we agreed that cello was my interest or hobby?  Or interest.  Can I stop going to the youth orchestra, then?  Ah. Yes. But. I've already joined in. So now I can stop.  No. They don't want people who think for themselves.  You'd better, I'm afraid. Just to show my father you're un jeune homme serieux, not a teddy boy.  It'll be all right. I won't wait. It's going to bucket down in a minute. I'll see you at the weekend.  How do I know you won't just drive off with the cello?  Jenny.  I've never seen a car like this before. C'est tres chic.  It was a rehearsal. The concert's next Thursday.    I'm not a Jew!  Oh.  Can I sit in the car with my cello?  It's even nicer on the inside.  I only live round the corner.         I'd better not. I'm a bit close to home.  We don't go to any concerts. We don't believe in them.  So people say.  I suppose...What would he say?      Oxford. If I'm lucky. Did you go anywhere?  This is me. Thank you.          Oh!     They're for me!  Gosh. Him.  Just...A chap I met.  Yes, he is, really.    He earns it, I expect.  Can we just go? Otherwise the bunch of good-luck flowers will actually be responsible for me actually missing the concert. Which would be ironic, n'est ce pas?  Noted.      The whole point about him is that he doesn't feel.  Camus doesn't want you to like him. What he's trying to say is that feeling is bourgeois. Being engagee is bourgeois. His mother dies and he doesn't feel anything. He kills this Arab and he doesn't feel anything.  No. That just makes you a cow.  Well I'm going to be French. I'm going to Paris and I'm going to smoke and listen to Jacques Brel and wear black. And I won't speak. Ever. C'est plus chic, comme...  Hello. Thank you.  Oh, fine. I think. I mean, I didn't mess my bit up, anyway. And no-one got thrown out of the orchestra afterwards.  Going to school.    Thank you. And I'd like you to take me. I'd like to go with someone who knows when to clap.    The trouble is, we'll already have eaten.      You've heard of supper?  Neither of you is interested in the concert part, I notice.  Don't be so daft.  Why?  There won't be anything to tell.       Good.  St John's Smith Square.  I don't know. I'm sure we could find out.  He soon put a stop to that.  Where are we?  The trouble is, that's where St John's Smith Square is.  That's him. Now what?  Oh, and by the way...David's a Jew. A wandering Jew. So watch yourself.  Dad!  Ah. Well. Dad's got something to tell you.  Bye.  I'm so sorry.  It's beautiful. Where did it come from?    That would be nice. But South Ken... C'est beaucoup trop cher pour moi.  I just said....It was too expensive for me.  I just...Well, I said it in French.  I don't know.  Why on earth would he want to take me shopping?  I've only got....Well, I think it's just called `Juliette Greco'. The one with the eyes on the sleeve. I saved up and got my French conversation teacher to bring it back after Christmas.  Yes.    I love the pre-Raphaelites.  Yes, of course. Rossetti and Burne-Jones, anyway. Not Holman Hunt, so much. He's so garish.  An auction. Gosh. How exciting.    Well. Yes.  No. I'm sure I could....re- arrange. That would be lovely.     What are you doing?  It's twenty-five to twelve. We finish tea at seven.  It was...It was the best night of my life.  Goodnight, Mum.  There was nothing like that. He was the perfect gentleman. He just said he wanted to take me places and show me things.  Of course.  He's not my \"new boyfriend\". God.      How do you know Danny?  What kind of work?  How do you know those, those ...Negro people?  Clients?  I'm not sure I quite understand what you do.      Really? Fifty pounds? I don't believe you.  That's not a Lockey-Hill!  It's beautiful. Do you play?  Gosh, no. One day. When I'm good enough for it.  Oh, David. You've never heard me.  A weekend away? I wouldn't be allowed to do that.  Who?  About what?  You're going to ask my father if I can go away with you for the weekend? He'd have you arrested.  I'll bet you you can't do it.  Half-a-crown.  Mon dieu! You must take me back to school. And I've got to change back into my uniform.     How are you going to \"have it out\" with her? What are you going to do? Shout at her until she decides I'm much cleverer than she thinks?   We don't go to Oxford. Any of us. Not even you, Dad.   Oh, yes. That's the whole point of an Oxford education. It's the expensive alternative to a dinner dance.         Oh, no.  Oh. Graham. Hello.  No, no. It's just...I've got so much to do if I'm going to get the grades I need.                  And you're drinking? But it's not Christmas!  Yes, that's true. I'm only going on what I've seen over the last sixteen years.  Anyway. Would you excuse me? I've got a huge pile of Latin translation to do.  No. I didn't.  Extraordinary.   Dad has never come across anyone.   Dad has never read any books.   I'd love to meet him.  How often do you see him?    Please, Daddy. It would be so helpful to know something about the place.      A nightie?  Will we be sharing bedrooms?  No. I'm...No.  Really? Do     you think so?  Oh, I'd make sure that didn't happen. I'm going to do it when I'm seventeen. On my seventeenth birthday, hopefully.  Well...Golly. I suppose it will be with David, won't it?  April.  Can we stop?  You never get out?    I want to read English.  Sorry?  Oh. Yes. Reading English is just another way of saying...  Please explain what stats are. You're always going on about them.  We've got exactly the same curtains at home.  There's something you should know, David. I'm...Well, I'm a virgin. And I want to stay that way until I'm seventeen.  Well, yes. Of course we can. If it doesn't mean...  Is that me?  Oh. If that's what..  Yes, David?  Sorry. Yes, bubbalub?  You just want to see them?  Aren't you coming?  What are you talking about?  I don't need looking after, thank you very much. David, I want to see...  \"Either way\"?      Liberated! That's one word for it.     Gosh. Yes. Loads.  Thank you. I had a nice time.  As you said in the car, it was a misunderstanding.  You have no idea how boring everything was before I met you.  Excitement's a lot, when you're at school and you live in Twickenham.  But that is who you are. I've never met anyone like you. Action is character, our English teacher says.  I think it means that if we never did anything, we wouldn't be anybody. And I never did anything before I met you. And sometimes I think no-one's ever done anything in this stupid country, apart from you.  Thank you.     Lovely, thank you.  Look inside.  He was just...normal. Kind.  Oh, he was busy. David did, though.  Beautiful.  He might become a famous author, for all you know.  What?  I feel....I Feel I should do my homework.  Russian Sobranies.  Paris. You can't buy them here.  (mimicking Tina's  But I'll bring you some back, if you want.  Non.    Peut-etre.  Might be.  You have such a Victorian attitude to sex, you two.  They don't know yet. David's got a plan, he says. He usually has something up his sleeve.    Apparently I do.  Sod. Miss Davies.     Not that I know of.  Graham?  What did you happen to be talking to her about?  What if David turns up?  And who's the skinned cat, in this enchanting image? Me?  I have an education to pursue.        Oh. Thank you. I    needed a new one.        This is Graham.  Clearly.  Can I open anything yet?  You know the one, Dad.  Dad!    Oh, for God's sake.  Can I go now?  There's no bed.  A suite!  I would have thought that tonight of all nights we only need a bedroom.  What on earth is that for?  With a banana?  David, I don't want to lose my virginity to a piece of fruit.  Let's wait until we get to Paris. I think the moment might have gone.  And David..... if tomorrow night does happen, it will never happen again, so...  Because the first time can only happen once.  So, please...No Minnies. No baby- talk. I'm not old enough for baby- talk. Treat me like a grown-up.    Not after the...first bit. It's funny, though, isn't it? All that poetry, and all those songs and films, about something that lasts no time at all?    Why will I need to miss it?    Of course. I'll catch you up.  What do you mean?  I think so.  He couldn't stop me.        Oh.  You're clever. And you're pretty. So presumably, Clever Miss Stubbs won. And here you are, reading all those pony essays. I don't know. These last few months, I've been to Paris, and to jazz clubs, and I've eaten in wonderful restaurants, and seen wonderful films, heard beautiful music...  It's nothing to do with that.  Maybe our lives are always going to end up with pony essays. Or housework. And yes, maybe we'll go up to Oxford. But if we're all going to die the moment we graduate, maybe it's what we do before that counts.  I don't think you're dead. But...  (looking at the Rolls-  I gathered that much. But why do we have to crawl around the West End looking for his car? Why don't you just make an appointment, if you want to see him?  Thank you.  About what?  (knowing that she should  I'm still trying to work out what makes good things good. It's hard, isn't it?    What are you doing?  What were you looking for?  (eyes twinkling with  You're very sweet.            What if I got married instead of going to college?  Married.  Would it? That's interesting.  Thanks.  Yes.  Nothing yet.  No. A man I just met walking his dog.  This is where you're supposed to say, \"But what about Oxford?\"  (quietly, turning the  All that Latin! All those essays! What was the point? Why didn't you just send me out prowling round nightclubs? It would have been less trouble. And I might have had more fun.  How?  Ooh. Miss. Me. I can.  What?  Half the girls in this room are wearing jewelry.    We won't be getting married in a church. David's Jewish.  (beginning to feel less  Yes, that's right.  Nobody has been able to explain to me the point of University.  And nobody does anything worth doing with one, either. No woman, anyway.  Boring!  Studying is hard and boring. Teaching is hard and boring. So you're telling me to be bored, and then bored, and then finally bored again, this time for the rest of my life. This whole stupid country is bored. There's no life in it, or colour in it, or fun in it. It's probably just as well that the Russians are going to drop a nuclear bomb on us any day now. So my choice is either to do something hard and boring, OR to marry my... my Jew, and go to Paris and Rome and listen to jazz and read and eat good food in nice restaurants and have fun. It's not enough to educate us any more, Mrs Walters. You've got to tell us why you're doing it.  I don't wish to be impertinent, Mrs Walters. But it is an argument worth rehearsing. You never know. Someone else might want to know what the point of it all is, one day.  I'm not sitting them.    I'm sure David will pay you back. Send him a bill. As you said, he wouldn't have wanted me if I was dim, so he should fork out. Just tell me why there's a point in sitting my exams, and there's no point in me going to University.  In which case I should have left school years ago, shouldn't I? Ask them for the money back. If I'm too clever by half, you overpaid by a third.  Am I still allowed to read?  Danny didn't seem very pleased about our engagement.  (trying not to be     Where is the flat again?  Like that?    And this is where you're living?  You've stayed there two nights \"on and off\"?  (frustrated by his  No, but.... You seem to float around. I never know where you are.  It depends on how funny it is.  We all live at home.  But I live with my mother and fa... You don't mean it.  Your mother and father?  Did you do this one? \"Show from any TWO scenes in `Pride and Prejudice' how far it is true that Jane Austen's methods are `essentially dramatic'\".  It says two here. Look.  I've been looking at flats. I've been to look at dresses. I've been reading a lot, too.  What's this afternoon?        I'm not sure he sees plenty of nice places. Would you like a radiogram for a wedding present? We love ours.  We've been through this, Dad. It'll be quite clearly marked on the menu.  David, probably. Who else would it have been?       It's another one of David's little muddles and misunderstandings.  I don't want to hear another word from anybody. Take me home. NOW.     Go inside, Dad.  Mr and Mrs David Goldman, Mr and Mrs David Goldman, Mr and Mrs David Goldman, Mr and Mrs David Goldman..  You're MARRIED!  When were you going to tell me?  \"Oh,   Jenny. I'm just too busy to find   somewhere to live...I live with   my mummy.\" You were living with   your wife! All this time!  What's your address?  Where?  Byron Avenue! It's no wonder we kept bumping into each other, then, is it? What number?      Spare time? Spare time? I can't tell you how grateful I am.  I have nothing. I left school. I didn't take my exams. Where's it all gone, now? I gave my life away.  Go and tell them. Go and tell them, then go and tell your wife. I want to see you. I want to stand there and watch.    Two minutes. And then I'll come out and drag you in.     He's helping himself to some Dutch courage before facing you. Stolen Dutch courage, from the look of it. He has something to tell you.    Yes. I wanted number...It's my cello lesson. Silly. I...  I can't.    Four months!     I saw her. I didn't talk to her. There wasn't any need.    Oh, you're my father again, are you? What were you when you encouraged me to throw my life away? I'm a silly schoolgirl. Was, anyway. Silly schoolgirls are always being seduced by glamorous older men. But what about you two?  And now I've got nothing. I'm...I'm broken.  What are you talking about?    I'd like to repeat my last year at school. Start all over again.  I know. I was stupid.  I know that I need to go to university.      I suppose you think I'm a ruined woman.  Did you want to?    There are a lot of things I didn't tell you. I was dreaming.    This is lovely.  But it is. Really. I'd love to live somewhere like this.  But all these books and pictures....  (apparently  A Burne-Jones.  What?  Yes. I do. Still.    Don't you understand what you've done?  Yes. I had fun. But I had fun with the wrong person, at all the wrong times. And I can't ever get those times back, now. Look, David. I'm in Oxford. Every day I wake up and pinch myself. And when I think how close I came...",
        "Marjorie": "How's your mother, Graham?    Who's `him'?  A chap who sends flowers? So he's a man-chap?  (drily, knowing the  Objection noted. Jenny?  It's in Westminster. Just around the corner from the Abbey.  I had a life before we were married, you know.  Jack, she wants to see someone who can play. She doesn't want to see Sheila Kirkland scratching away. I'll take her.  Jack!  Thank you.    Have a nice time.  It's called after-shave, Jack. And it makes a change from carbolic soap.  Nobody's ever going to get confused about you, dear.  Oh, hello, love. Did you have a nice time?  I can't get this casserole dish clean. We had hot-pot tonight, and it's all burnt round...  I know what the time is. How was your evening?  And he took you home in his car? Right to the door?  And I'm glad you enjoyed the concert.  I'll talk to him.  The test didn't...Well, it didn't go as well as we'd hoped.  Everyone's doing their best, Jack.   You don't mean that.   What about private tuition?   Five shillings an hour. Maybe a little more for A-level.  And what else are we spending five bob on? What else are we spending sixpence on?  It was, actually. It was a present from Auntie Vi.  Jack...  I'm trying to think what you missed. Nothing much comes to mind.  Isn't that funny?   CS Lewis? That's the Clive you're talking about?  Jenny used to love those books.  Sounds like too good an opportunity to pass up.  Did you have a nice time?  \"Clive\"...Lucky girl. What was he like?  And did he show you round?  What did you think?  Did it make you want to work harder?  David's a lot older than Graham.  Well, they say opposites attract, don't they? I wouldn't have thought he was your sort.  Is that how you feel, Jenny?  I've asked Graham round for tea and birthday cake.  I happened to be talking to his mother about something, and...  I thought it would be nice.  Are we expecting David to turn up?    Who'd like a piece?  And ours too, come to that.  Wait for me.  I can take her.  Has somebody asked you?  What did you tell him?  Do you have any choice? Or is it too late.  Jack!  You have to put the cosy on straight away.    Jenny! We could walk to...(She tries to think of somewhere Jenny might find interesting.) We could walk to the British Museum!  I'll leave you to it. Don't let it stew.  Don't worry. He'll find a nice place in no time. He sees plenty of them.  You won't be bored, you know. He's not boring.  Of course. Eamonn Andrews is the poshest person that Jack can imagine being.  Did you see her?",
        "Graham": "Should I wear, you know, Sunday best?  Oh, God.  Oh, yes. Bye.  She's fine, thanks. She sends her best, by the way.  I'm not sure yet.  I might take a year off.    Mr Mellor...I'm not a teddy boy. I'm an homme serieux. Jeune. An homme jeune serieux homme.  Hello.  I haven't seen you for ages....It all went wrong, didn't it? The tea-party, I mean. Was it because of the year off?  Never mind. I'll have one of those.",
        "Tina": "We still don't have to like him.  I wouldn't feel anything if my mother died. Does that make me an existentialist?  I'm sorry. I just had the strangest dream. I dreamed you crossed the road and spoke to a handsome man with the most beautiful car I've ever seen. And then you came back and you didn't mention it.  `Oo wazzee?    Oh my God! I've only just realised! That's what's going to happen to you, isn't it? Look at her! Men are going to pick her up in the street and take her out to supper!  We're trying to attract the attention of boys.  Well, make something up, then.    Things plural? Oh my Gawd!  `Jane Eyre' and Jenny's new boyfriend.  It's true. He's more a man- friend, isn't he? He's got a sports-car, Miss Stubbs.  I think he must be as blind as Mr Rochester.  You could always go to secretarial college with Hattie.  Yes. She's got no time for boys.  She might have bought them from the Savoy, or Claridges, or the opera, or some fancy nightclub. Who knows, with Jenny?  (suddenly looking at  Shut up, you stuck-up cow.  You're joking.  Isn't it your birthday next Tuesday?  I wouldn't like to be you. All those dinners you've had off him. Ouch.  Oh, sorry, Dr Kinsey. We're not all as experienced as you. I mean, you've done it...(She counts on her fingers) I make it never! Can that be right?  I've noticed that. What did he tell them when you had your weekend in Oxford?  And they tell us there's a God.  There are some things you must buy for us, and some things you only have to buy for us if you're a proper, true friend. (She points at Hattie, then at herself.) Chanel perfume, Chanel perfume. (She repeats the gesture) Chanel lipstick, Chanel lipstick. What have I forgotten?  How can you go back to double French when you've had a weekend with an older man in a posh hotel in Paris? You wouldn't catch me coming anywhere near this dump.  You're going to miss it. All the swanning around in posh hotels.  When you go to Oxford. Unless you're planning on being with David forever.  So? Won't you miss it?  How do you say `A penny for your thoughts?' in French?  For her thoughts, yes. You'd be overpaying by about ninety-nine centimes.  (sotto voce, to Jenny,  It was an unfair question. You're hopeless at maths. What do you do all day, anyway, Lady Muck?  Reading, trying on dresses... Where did we go wrong?  French. The translation paper.  I'm sure my uncle knows someone who could kill him. If that would help.  Of course we didn't. Why would we stop you? Restaurants, hotels, foreign cities, no exams...  That's the thing about our lives, isn't it? It's so easy to fall asleep, when there's nothing to keep you awake.",
        "Helen": "I was hoping we'd miss the beginning, and then it wouldn't be worth going in, and we could go off dancing or something.  Look. We can leave our coats over there. I want to get rid of this.    Oh, South Ken somewhere.    We should go shopping together one day, if you want.  Sorry?  No you didn't. You said something completely different.  In French? Why?  Anyway. It's too expensive for me, too. We don't have to worry about that. If you want something in South Ken, get David to take you shopping.  Oh, I do hope so.  I always think I'm going to my own funeral when I listen to classical music. That was classical, wasn't it?  You've got a French conversation teacher?  Is that why you suddenly speak French for no reason?    Certainly not me.  Give it to Jenny.  Yes!  Oh, behave yourselves.     Nearly ready!     There. You'll do. You can keep it. I can only wear so many every day.  What about tonight? Will you be needing a nightie? Or not?  You're not sleeping with him?  Good for you.  You're only sixteen. And you don't want to get into the family way, do you?  With   David?  When's your birthday?  Oh, he'll be around in April. If that's what you want. Anyway. I'll find you a nightie.  I know.  Oh, it's always like this. There are millions of places I've never seen because I've been stuck in here.  There's never anywhere to go in the places they stop.  I'm confused now. I thought you'd made him up?  Dirty old man.    It's true. And they can't all have started off that way, can they? Most girls aren't ugly, but most girl students are. So there must be something about those places that, you know, makes you fat, or spotty, or short-sighted.  I'm still not quite clear on what you want to do when you get here.  Books?  You want to read English books?  Jenny...  We don't go in.  They won't be long. Either way.  Sometimes they find something, sometimes they don't.  And when they do find something, we usually have to leave quite quickly. They can be a bit naughty, sometimes. Anyway. It's nice to have company. I'm usually outside on my own.  Coo-ee. Jenny.  No. Be Sneezy.  Congratulations.  Don't worry.  Someone told me that in fifty years no-one will speak Latin, probably. Not even Latin people. So you shouldn't mind too much about your B.  That's...Gosh. That's fantastic news.  I thought you'd see sense about university.  You'll stay pretty now.  English? Books?  You won't be laughing when she goes all speccy and spotty, David.  I don't really understand what difference it makes. When I found out that...",
        "Danny": "Helen is one of the more reluctant members of tonight's audience.  Yes. Very classical. As classical as you can get.  Oh, it's wonderful.    But you should see her in Paris, not here. David will take you.  Oh. No. Can't do it. There's a Burne-Jones coming up at Christie's on Friday. And I want it.  I just have a feeling that the pre-Raphaelites are going to take off.  Next Friday morning. David will pick you up.  You're busy?  Tant pis.  You nearly missed it.  You know who you are.  I know who you are, too. Tell him.  Thank you. Couldn't have bought it without you.     A couple of years ago you could pick these up for fifty quid, you know. Nobody was interested.  There aren't many people who come in here and say that.  I used to. I vowed to myself that one day I'd own one of these. And now I own one and never touch it. It's vulgar to put it on show, really.  That would be even more vulgar.  We should all go and spend a weekend in Oxford. Straw boaters, punting, cream teas, antiquarian bookshops. Bit of business, if we can find it. What about next weekend?            I wouldn't be surprised if three of them come out, you know. That's the only explanation. They're making themselves a friend. LADIES! Let's go. Please.       Imagine spending three years here.  (attempting, briefly, to  I wouldn't worry, Jenny. You're wasting your breath.  Absolutely. This would be a good place to do a little business.  All those little old ladies wandering around...I'll bet this place is rife with stats.  Helen will look after you. Go and find a nice cup of tea somewhere.  I'm not going to tell you a second time. Now. Run along.  Sorry about being a little brisk back there, Jenny. We have our way of doing things. Silly, really.     Who wants to come up   for a drink?  A bastard.  What? Ring his office? Talk to his secretary? That isn't how it works with him, dear.  There he is.  Oh-ho. Champagne, eh?  Fantastic.  Well, I'm not sure you'd want him to marry your sister. I'm not even sure you'd want to talk to him in a night-club, come to that.    We've heard that before.    I don't want to see her hurt.  Have I? Let's think? Oh, I picked up a little Piper the other day. A good `un, I think.  The thing is, Jenny, you know, without necessarily being able to explain why. You've got taste. That's not even half the battle. That's the whole war.  Alas. One day, school will be over forever, and we can talk about art all night.             Helen! Not now.  I tried to tell him. I'm not speaking to him now, if that's any consolation.  Ah, well if you want that sort of conversation...You watched David and I help ourselves to a map, and you didn't say much, either.",
        "Hattie": "Une vache.  We've heard of it. But we've never eaten it.  No. Of course not.  God, you're right, Tina. I hadn't thought of that. Look at her.  Because no man's ever   going to ask us out to supper.   Not until we're ladies, anyway.   You're going to have to tell   us everything. Otherwise   it's not fair.  Charming!  What the hell are those?  Where did they come from?  He's taking you to Paris?  This term?  Oh, my God! Your birthday!  But your parents are just going to let you swan off like that?  So you have a good-looking boyfriend with pots of money, brains and a nice car.  Those funny cigarettes you were smoking. Sobranies. Ten packets each.  A suite? Oh my God. Your life.  You're not, are you?  We'll miss it.  A franc is too much, isn't it?  Oh my God. Is that really what I think it is? I'M GOING TO BE A  Three scenes.  Two. Two. Two. I can't believe it.  We should have stopped you.  Well, if you'd told us that we might have tried to stop you.  Are you getting on with the work all right on your own?",
        "Small": "Goodbye, darling! See you at the weekend! I will miss you with all of my heart!  Are you the girl going to Paris?  Well are you or aren't you? Because I'd like some perfume.",
        "Girl": "Are you the girl going to Paris?  Well are you or aren't you? Because I'd like some perfume.  May not an ass know when the cart draws the horse? Sings whoop jug I love thee.",
        "Auctioneer": "We turn to lot 41, The Tree of Forgiveness, by Sir Edward Burne- Jones. This is a rare opportunity to purchase a key work of the Pre- Raphaelite movement. Who will start me off at five hundred guineas?  Two hundred?  Thank you, madam. Three hundred?  Do I hear three-fifty?  Over to you sir. Four hundred guineas? Thank you. Four hundred and fifty...  No further bids?  Five hundred guineas from the very eager new bidder.  Five hundred and fifty, madam? Thank you.  Six hundred guineas.  Six-fifty? Thank you, madam. Seven hundred...  Seven hundred?  Sold for six hundred and fifty guineas. Thank you.  Your name, please?",
        "Boy": "Goodbye, darling! See you at the weekend! I will miss you with all of my heart!",
        "David": "Hello.  Listen. If you've got any sense, you wouldn't take a lift from a strange man.  I am, however, a music lover, and I'm worried about your cello. So what I propose is, you put it in the car and walk alongside me.  Ah. Good point.  How much does a new cello cost? Twenty pounds? Thirty? I don't know. Let's say thirty.  There. Security.  I'm David, by the way.  And you are...?  It's a Bristol. Not many of `em made.  How did the concert go?  What are you playing?  Ah, Elgar. I often think it's a shame he spent so much time in Worcester, don't you? Worcester's too near Birmingham. And you can hear that in the music. There's a horrible Brummy accent in there, if you listen hard enough.  Anyway, I'm not sure Elgar and Jews mix very well.    Jump in.  Where to, madam?  What a shame. We'll just make it last as long as we can.  Smoke?  I suppose cellists must go to a lot of concerts.  Oh, they're real.  Why don't we believe in them?  Your father, this is?  Which of course is what is so wonderful about them. Anyway, you'll go one day.  Good for you. Which University?  I studied at what I believe they call the University of Life. And I didn't get a very good degree there.  Hello.  How did it go?  Always the mark of a cultural triumph. Listen. I'm glad I ran into you. What are you doing on Friday?  I meant the evening.  Because I'm going to listen to some Schubert in St John's, Smith Square. My friends Danny and Helen will be going too, so it wouldn't be...I'll tell you what. I'll come and pick you up, and if your mother and father disapprove, then you can have the tickets and go with one of them. How does that sound?  I usually watch Danny. He knows that sort of thing.  Seven? And we'll probably go for a spot of supper afterwards, if you...But if you, if that's not...Well, we can always put you in a taxi.  If you want.  Well. I mean, if you'd like supper, then, perhaps on Friday you could...not eat?      You're a lucky man, Jack.  So. Gosh. (He looks around approvingly.) This is lovely.  I'd love one, Jack, but we're running a little late. If Jenny's ready, perhaps we'll shoot off.  Oh, it's a pretty straight run, really. Up to Hammersmith, take the A4 through Kensington and you're there.  Simple as that.  I was hoping Jenny would come with me afterwards to have a bite of supper with my aunt Helen.  How about if I promise to have her in by eleven thirty?  Thanks, Jack. I appreciate it. See you again.  Hello hello. Are we late?  Jenny, these are my friends Helen and Danny.  Shall we?  I booked a table at Juliette's. Will that kill the mood, do you think?  Juliette's it is, then. Heaven forbid that we should end the evening reflecting on our own mortality.  Have you never heard \"Chante Francoise Sagan\"?  She's marvellous.  I'd love to. You'd fit right in.  It's wonderful to find a young person who wants to know things. There's so much I want you to see.  Are you still all right to come and have a look at that Pembroke Villas place with me on Friday, Danny?  (excited by her  Absolutely! Why don't we all go to the auction? Wouldn't that be fun?  Are you sure you're busy?      Oh, you know. We kept bumping into each other, and we became pals, and we've ended up doing a bit of work together, when it suits us.  Property. A bit of art dealing. Some buying and selling. This and that...  I'll be two seconds.  I'm sorry about that.  They're clients.  Jenny darling, even schwarzers have to live somewhere. And it's not as if they can rent off their own kind, is it?  You don't need to. It's too boring. All you need to know is that I work in property so that I can take you to nice places.    Quick!  Well done. A nerveless performance.  Play for us, Jenny.  She's good enough now.  I shall come to hear you in St John's Smith Square. Or in Oxford, when you get there.  Yes!  I'll find a way. I'll talk to them.  Jack and Marjorie.  Oxford.  We'll see.  How much?  You're on.  I don't think I'm very good at Eccles.  I wasn't going to disturb you. I knew you'd have your nose to the grindstone.  For all the good it did me.   Oh, English. Just like every other semi-employed layabout in London.   Merton.   I was just telling Jack that I'm going back next weekend. I go and see my old professor every now and again.   Too true. And Clive would love Jenny. Have you ever come across Clive Lewis?   I just thought he might know some of the books.   He wrote a children's book called `The Lion, The Witch and The Wardrobe' that did very well, I believe.  Well, to us he was just the old codger who taught Medieval literature. But I came to know him very well. We just...got along, do you know what I mean?  Gosh. That dates me. He was writing them when I was there.  I'm sorry. I'm being slow on the uptake. Would Jenny like to come with me at the weekend?  Oh, once every couple of years. But next time, eh?  Well, I wouldn't want to drive back after one of those Oxford dinners.  Clive will get her a room in college. That's easy enough.  I'd be delighted.  I told you. You owe me half-a- crown.  Come on!  How can they only be nearly ready?  Maybe later. There are a couple of things we have to do.  So. Now.Is he Clive, do you think? Or CS?  There.  Well, if you look at it that way...I mean, that's proper scientific analysis. And you can't argue with science.  Anyway, tomorrow we'll try to get more of a feel for the place.  All right. Think of a number. Now think about the most boring lesson you've ever had at school.  Let's not talk about curtains. You look beautiful. You really are a princess.  I think that's good. I think that's right. And for your seventeenth birthday I'm going to take you to Paris or Rome or Florence and make you feel like the most beautiful princess in the kingdom of love. But we can still be romantic, can't we?  Minnie....  Yes. You're my Minnie Mouse, and I'm your bubbalub.  Minnie.    Would you mind if I had a look at what might one day be mine? Just a peek?  I just want to see them.  Let it fall from your shoulders.  Thank you.  Might be worth a look.  Oh, come on, Jenny. Let's not spoil things.  I think there must be some kind of misunderstanding.  Jenny?  Jenny!  It was an old map. A Speed. It was cooped up in that miserable little cottage, and she didn't even know what it was. What a waste! It shouldn't spend its life on a wall in wherever the hell we are. It should be with us. We know how to look after it properly. We liberated it.  (quickly and  And if you don't like it, then I will understand, and you can go back to Twickenham and listen to the Home Service and do your Latin homework. But these weekends, and the restaurants and the concerts..They don't grow on trees.  Do you understand? Of course you do. This is who we are, Jenny.  I suppose you have homework to do.  (surprised, despite his  Exactly. A muddle.  I hope that there's something more than excitement to our relationship.  You know what I'm trying to say. I want you to like me for who I am, not just what I can do for you.  What does that mean?  That's a good place to end the weekend. I'll give you a tinkle.  It's a special day.  Oh, I know it.  Hello, young man.  Graham, a pleasure. I'm David.  What's everybody else having? What have you got there, Graham?  Yes. Well. You can put the pop away now. What is there for the grown-ups?  You know me so well.  Before you start on that little lot , I have a surprise. Next weekend, we're all going to Chez Georges to celebrate Jenny's birthday.  Chez Georges is in the Boulevard St Germain. In Paris.  Listen, I'm really sorry to have caused all this to-do. I just thought it might be nice. But I'll go with Aunt Helen and Uncle Daniel. They can have your tickets.  Yes, that's the one.    (the penny apparently  Oh, impossible. I hadn't thought it through properly. I do apologise, Jack. Would you prefer it if Helen took Jenny on her own? I don't mind. I've been to Paris before.  Ah. I pushed the boat out and got us a suite.  Well, if work stops us getting to Paris until tomorrow, then work can buy us a nice hotel room. Anyway, it's a special occasion, isn't it?  Hold on a second. I've got something.  I thought....I thought we might want to practice.  I thought we'd get the messy bit over with first.  I'm sorry.  I'm sorry, Minnie. I'm such a fool.        Do you still feel like a schoolgirl?  And it wasn't too uncomfortable?  Yes. Perec Rachman. He's a....  He's a business acquaintance, and we need to talk to him.  A bottle of champagne, please.  Don't be bashful.  All right, then. If you won't tell them I will. Jenny got two As and a B in her mock-A levels.  The B was in Latin. But it's much better than it was, isn't it, Minnie?  This is the one, Danny.  You can see she's different. She's got everything. You've got Helen, and....    Jenny, we should go. It's late.    Wait there.  Will you marry me?  I thought I had a ring. It wouldn't have been the right one. But it would have done for tonight.  I'm serious.  What do you think?  I thought that, too! I was wondering whether he might be a bit jealous.  You may have noticed that Helen's not really Oxford material. I'm going to keep him out of your way.  I haven't put my...my stamp on it yet. Haven't had time. It needs a woman's touch, really. And if you don't like it, we can move. Just say the word.  Just down from Russell Square. Two minutes' walk from the underground.  I've stayed there for the last couple of nights.  On and off.  Is that tea ready? One sugar, please.  I'm sorry. You must think I'm very odd.  A wandering Jew.(He pauses to take a sip.) If I tell you something, will you promise not to laugh?    No. I mean...I live at home...in the same way that you live at home.  Just my mother. My father's dead. I've been meaning to tell you, Minnie, and it would have been much better than all those silly lies. But...  Anyway. You can see how much I need you. And you won't regret this, I promise. We'll have so much fun. And just think. When we get married, you won't have to wait in the car while I do my business.. You'll be waiting at home, looking at the Burne-Jones on the wall. Home, Minnie. Our home. Can you imagine?  Everybody ready? I think you'll like this place, Jack. Their wine list is as good as anything I've seen in London.  Oh, you won't want to go in anything else after tonight. Mind you, it drinks petrol. I'm afraid we'll have to stop on the way in to town.  Madame. Monsieur.  Everyone happy?  Is that a good thing?  Sorry about this.  You might as well fill her up.  I'm just going to make a quick call. I'll be two ticks.    Jenny, I...  There's been a...Jenny's had a bit of a shock.  Jenny, it's not...  Of course I can. She's just got the wrong end of the stick about something.  Just let me...  Legally, yes, but...  Soon. It just - it never seemed the right time. You seemed so happy, and I was happy, and...It would have spoiled everything. What can I do, Minnie? What can I do? How can...  Jenny...  Byron Avenue.  There's no point..  Seventeen.  Please. You have to understand. I was with you just about all the spare time I had.  Don't be like this.  Jenny, I can get a divorce. Everything will turn out for   the best. You'll see.  They're not going to listen to me now. Let me come round tomorrow. When everyone's calmed down a bit.         The woman deposits the child in the drive, goes back into the house, comes out behind an enormous 1950s pram. David has found time to father another baby.   Jenny.  Jenny. Minnie. I wanted to tell you that I am going to ask my wife for a divorce.  I can see my behaviour must have been... confusing. But we've never sat down and had a proper chat about it all. About the whys and wherefores. They can wait. The important thing is that you're still my Minnie Mouse, and I love you, and you had fun. You know you had fun.",
        "Goldman": "",
        "Miss": "I knew that in the end `Jane Eyre' would work its magic upon you. I'm presuming that's what you're so animated about.  Ah. A Mr Rochester figure.  Is there no end to your thirst for literary understanding, Jenny? As you may have noticed, I'm attempting to turn the subject away from Jenny's lurid love-life and towards the matter in hand.  And it's quite clear on this evidence that most of you know much too much about the former, and almost nothing about the latter. Reluctantly I must concede that Jenny is evidently an expert on both matters. Excellent as always, Jenny.  Jenny, the headmistress would like a word at the end of the lesson. I'm afraid that the legend of Mr Rochester may have travelled further than you intended.  Jenny, could I have a word?  You can do anything you want, Jenny. You know that. You're clever and you're pretty... But sometimes those things fight. I'm worried that at the moment clever Jenny and pretty Jenny are fighting.  I couldn't bear it if clever Jenny lost. It's because of people like you that I plough through illiterate essays by Sandra Lovell about her pony. And there aren't many of you, I can tell you. One every few years. Is your boyfriend interested in clever Jenny?  Interested enough to let her do what she wants?  He might not have to stop you. That's what I'm trying to tell you.  I'm telling you to go to Oxford. No matter what. Or you'll break my heart.  Sorry?  Girton. Cambridge.  What does that mean? `Oh'?  I'm sure you have. But I was filled up with beautiful things, books and music and conversation, in exactly the same way at Cambridge. And I didn't have to pay the same sort of price. Are you taking precautions, Jenny?  Isn't it?  I'm sorry you think I'm dead.    Yes, when it says `Sings', it means he sings those words.  Never mind. Lear...  Oh, Jenny.  Take it off.  You know there's a school rule about jewelry.  Yes. But none of it is going to ruin their lives.  Let's see who's right. Come with me.  Please don't make me drag you out like a child.     Jenny!     Oh, it's not hard. Go to Oxford and become a teacher and this is what you end up with.  Penguin paperbacks. Posters and postcards.  Let's forget all about it.  You make it sound as though it's an original. Do you like him?  Still? Gosh, you sound very old and wise.  I was so hoping that's what you were going to say.",
        "Stubbs": "I knew that in the end `Jane Eyre' would work its magic upon you. I'm presuming that's what you're so animated about.  Ah. A Mr Rochester figure.  Is there no end to your thirst for literary understanding, Jenny? As you may have noticed, I'm attempting to turn the subject away from Jenny's lurid love-life and towards the matter in hand.  And it's quite clear on this evidence that most of you know much too much about the former, and almost nothing about the latter. Reluctantly I must concede that Jenny is evidently an expert on both matters. Excellent as always, Jenny.  Jenny, the headmistress would like a word at the end of the lesson. I'm afraid that the legend of Mr Rochester may have travelled further than you intended.  Jenny, could I have a word?  You can do anything you want, Jenny. You know that. You're clever and you're pretty... But sometimes those things fight. I'm worried that at the moment clever Jenny and pretty Jenny are fighting.  I couldn't bear it if clever Jenny lost. It's because of people like you that I plough through illiterate essays by Sandra Lovell about her pony. And there aren't many of you, I can tell you. One every few years. Is your boyfriend interested in clever Jenny?  Interested enough to let her do what she wants?  He might not have to stop you. That's what I'm trying to tell you.  I'm telling you to go to Oxford. No matter what. Or you'll break my heart.  Sorry?  Girton. Cambridge.  What does that mean? `Oh'?  I'm sure you have. But I was filled up with beautiful things, books and music and conversation, in exactly the same way at Cambridge. And I didn't have to pay the same sort of price. Are you taking precautions, Jenny?  Isn't it?  I'm sorry you think I'm dead.    Yes, when it says `Sings', it means he sings those words.  Never mind. Lear...  Oh, Jenny.  Take it off.  You know there's a school rule about jewelry.  Yes. But none of it is going to ruin their lives.  Let's see who's right. Come with me.  Please don't make me drag you out like a child.     Jenny!     Oh, it's not hard. Go to Oxford and become a teacher and this is what you end up with.  Penguin paperbacks. Posters and postcards.  Let's forget all about it.  You make it sound as though it's an original. Do you like him?  Still? Gosh, you sound very old and wise.  I was so hoping that's what you were going to say."
    },
    "imdb_rating": "7.3",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTg4NjgzOTc0MF5BMl5BanBnXkFtZTcwOTc2OTE3Mg@@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "In the early 1960's, sixteen-year-old Jenny Mellor (Carey Mulligan) lives with her parents in the London suburb of Twickenham. On her father Jack's (Alfred Molina's) wishes, everything that Jenny does is in the sole pursuit of being accepted into Oxford, as he wants her to have a better life than him. Jenny is bright, pretty, hard working, but also naturally gifted. The only problems her father may perceive in her life is her issue with learning Latin, and her dating a boy named Graham (Matthew Beard), who is nice, but socially awkward. Jenny's life changes after she meets David Goldman (Peter Sarsgaard), a man over twice her age. David goes out of his way to show Jenny and her family that his interest in her is not improper and that he wants solely to expose her to cultural activities which she enjoys. Jenny quickly gets accustomed to the life to which David and his constant companions, Danny (Dominic Cooper) and Helen (Rosamund Pike), have shown her, and Jenny and David's relationship does move on to becoming a romantic one. However, Jenny slowly learns more about David, and by association, Danny and Helen, and specifically how they make their money. Jenny has to decide if what she learns about them and leading such a life is worth forgoing her plans of higher education at Oxford.Huggo",
    "name": "An Education",
    "genres": [
        "Drama"
    ]
}