{
    "filename": "Anastasia_script.txt",
    "imdb_id": "tt0118617",
    "imdb_url": "https://www.imdb.com/title/tt0118617",
    "characters": [
        "The Dowager Empress Marie (voice)",
        "Czar Nicholas /Servant /Revolutionary Soldier /Ticket Agent (voice)",
        "Anastasia (singing voice)",
        "Anastasia (voice)",
        "Vladimir (voice)",
        "Bartok (voice)",
        "Anastasia Impostor (voice)",
        "Dimitri (voice)",
        "Young Dimitri (voice)",
        "Young Anastasia (voice)",
        "Rasputin (voice)",
        "Sophie (voice)",
        "Travelling Man /Major Domo (voice)",
        "Actress (voice)",
        "Phlegmenkoff /Old Woman (voice)"
    ],
    "dialogues": {
        "Anastasia": "Don't worry, Sonya, no one'll notice. . .    I was showing Sonya something . . .    I know, but I had to because . . .    \"Together in Paris\"! Oh, when can we be \"together in Paris?!   We're not afraid of you!   Anastasia BOLTS UP, hearing the shots. Her music box is next to her on her nightstand.   My music mox!   Anastasia grabs her music box as Tatiana rushes in.   Hurry, Grandmama!   who pushes Tatiana up the stairs of the caboose. This puts Anastasia a few steps behind as the train speeds up. Tatiana is gripped by other passengers as she reaches out to Anastasia.   Don't let go!     who has stumbled, hitting the ground hard.    Tatiana rushes to jump off the train after her, but is caught and held back by the ROYALIST PASSANGERS as the train CRASHES through the truck and picks up speed.  TATIANA's POV:  Anastasia rising from the ground, her hand outstretched. But she is suddenly swallowed up by the mob.",
        "(voice)": "",
        "Vladimir": "This, my friend, as an exercise in futility! We shall never find a girl to play the Princess Anastasia out of this motley crew of commoners!      It's no use, Dmitri - we'll never find the right girl!  Who did you hear it from?     Good day!  . . .  even if we find her, what makes you think the Empress will even see us?  That was your dinner!  I do hope there is no cabbage in Paris!  You're trespassing, boy!  He's her?  Perhaps you heard of our brilliant plan to find a girl and. . .    How much do you weigh?    Would you have leaned over Rembrant's shoulder and told him to paint faster?  You probably would. They're still wet.  Wake up, young lady, that's our train.  What a world - a man who was in my position in society is calling a peasant 'Your Highness\".  Royalty do not help people with their luggage.  Well, she certainly has a mind of her own.    What do we do now?  She's quite right, Dmitri, a man of my stature should not have to  I think I have hurt my...  Is everyone all right?  No have a lot of work to do, Anya! Come along, Meetoo!  We have to prepare you for an audience with Sophie.    We're just going to refresh your memory...  Ah! Let us begin!  You were born on the Adriatic sea at the summer palace, where the parties and the buffets were marvelous ....  Did I tell you that?  (lost in a memory of  Oh, yes it was the seagoing vessel of elaborate elegance in entertaining... A party boat. It once belonged to ...  Come out! I can do alterations.  I shant!  You are a natural! I don't know how you ever learned to dance that well! That must have been some high class orphanage ...  If I used the word \"bleak\" I would be optimistic.  The \"Odessa Dunk\"?  Such bravery! Why, that man should be rewarded! Amply rewarded!  I won't say a word...  May I present her Royal Highness Princess Anastasia!  Are you impressed with our Anastasia?  Then, you'll take her to see Tatiana?  Perhaps you could convince her?  We did it! We did it, my boy! We're going to see Tatiana at the ballet tonight and we're going to be rich! Rich!    Life is funny, isn't it. You find the right girl ... and then you lose her.  Dmitri ... You must understand that once you take her to Tatiana... well, it's over... nothing can happen between you. She's a princess and you're a commoner.",
        "Bartok": "You, uhh. . .  hang here often? \"Hang\" get it?  I said \"hang\" and we're both, you know, cause we're bats. . .  and, uhhh. . . what's your sign?  Whatta' ya say we go somewhere - maybe get a bug to eat.  Get it?  A \"bug\" to eat, 'cause we're. . .     Anya climbs into the ballroom.    having watched the whole thing - he sighs.   Oy. . .  he's gonna be so mad. . .   The city lights fade and we move into the blackness of the Russian forest.  Finally, in the distance, we see the orange glow of a fire.    having watched the whole thing - he sighs.   Oy. . .  he's gonna be so mad...   The city lights fade and we move into the blackness of the Russian forest. Finally, in the distance. we see the orange glow of a fire.   Ummm ... Father Gregori? It's, uhh ... me. Bartok. Phew! Not home ...  Oh my God! Don't do that ... feel my heart. Go ahead. I'm dying here ...  Name calling! That's mature.     Yeah, right. Keep that thought okay? So, I'm in town, stop by the old palace. You get a better class of bats there - no tattoos or anything.  So, I'm cruisin' the rafters and... what can I say, I struck out. I thought chicks would like the fact that I can talk, you know but, I mean, the way things are going I couldn't get invited to a plague. Someone's gotta clean that up...  Okay... you're not gonna like this but, well, it looks like Anastasia is ... still alive.  Trust me, it's her!  Rodent's intuition, how do I know? She looks exactly like her. Except she's taller, whichis natural ... Of course my second cousin Treplev - he nevergrew. Looks like a little pepper shaker. He was so cute ...  Oyyy... I knew this was gonna to upset him!  Hey, she's just a kid. And she's going to Paris outta sight, outta mind, outta Russia.  My Aunt Bella, sweet woman not the brightest bat in the world - she used to hang right side up, anyway she always said \"Curses were made to be broken\". Course, she said it in those irritating little bat squeaks, so it wasn't quite so profound...  You know, this is really obsessive behavior. There is this doctor this doctor in Austria, Sigmund something and he feels. . .   From under the glass, Rasputin looks distorted and even more horrifying.     Ohhh, that was dumb...    Ew, I hate when he does this!  Well, I better got goin'. Got a busy day letting all the blood rush to my head...  Rasputin pulls him back in, then speaks to his reliquary.   Oy... not a road trip. I get wagon sick, you know that.  You're absolutely right. Travel broadens your horizons...  Well,we wait this night!  I'm getting a chest cold..  I'm getting pneumonia. I have a fever. Feel my forehead...  My cousin Mischa, nice fellow had some dental problems - you didn't want to watch him eat, let's put it that way...  ... anyway, a bunch of other bats were hanging in the belfry - I know, cliche, but there you have it, and Mischa, not the brightest bat in the world, decides to hang <u>in</u> the bell. Which was fine for awhile until it started ringing ... Ewwww, what a mess ...  And it didn't help the tonal quality of the bell, either.  Boy, don't you hate it when that happens?  Nice looking fellow. I mean, don't get me wrong - I'm not attracted to him in the physical sense, I just ...  Me? No. Rich food - it kills me. Ever try and fly after one of those heavy sauces?",
        "Dimitri": "",
        "Rasputin": "You gave the orders!  After all I've done for your family - YOU TRIED TO KILL  The Romanov dynasty ends here! You, your wife and children will all die within the fortnight!      A lone candle lights the dark wagon. A frightened Bartok, stays on the window sill.   What?    I gave you that tongue and I can rip it out!    Get to the point sometime tonight.. I'm late for a wenching.  Impossible. That rumor's been around for years.      I cursed then all!  The Romanovs tried to kill me and I swore to destroy all of them! If she lives, if she should have a child someday, the Romanov Family continues! And I won't lot that happen! THIS IS THE END OF THE LINE!            She has friends. No matter...  Finish my prophecy...  She is not to get off that train... alive!  Go! I don't care what you do with the others but finish the girl! KILLLLL HERRRRR! And have fun...     Rasputin paces, still angry at the Minions. Bartok, nervous, fakes a yawn and stretches.   She's too far away, isn't she?  Yesss... our power is much stronger when were near. We must get close to her.  We'll catch her and finish her! We ride this night!    Bartok... a question.  What do you think is the most humiliating way to die?    You are toying with me, aren't you? You let me get so close...  Bartok ... have you ever been to Paris?  We are going to Paris - and while we're there, let's kill the young man. He annoys me.",
        "Sophie": "... moved to tears of joy! We won't be f ooled next time, girls! I'm a going to think of really hard questions...  Oh good! We haven't seen an Anastasia in several days!  I'd just like to ask you a few questions, dear...  Where were you born?      Oh, heavens - I must say, yes.  Oh, heavens I must say... no, no actually, I can't - Tatiana has refused to see any more girls.  Oh, heavens, no... but ... She is going to be at the Ballet Russe tonight! That's the Russian Ballet - Russe for Russian, oh those crazy French... they only go to see which dancers will defect.  Come my dear, we've much to talk about.",
        "Actress": "Oh. . . Grandmama. . .  It's me. . .  Oh, Grandmama. . .    Oh. . ."
    },
    "imdb_rating": "7.1",
    "description": "The daughter of the last Russian Czar, Nicolas II (Rick Jones), Anastasia (Meg Ryan) is found by two Russian con men, Dimitri (John Cusack) and Vladimir (Kelsey Grammer), who seek the reward that her grandmother, the Dowager Empress Marie Feodorovna (Dame Angela Lansbury), promised to the ones who'll find her. But the evil mystic of the Czar family, Grigori Rasputin (Christopher Lloyd), still wants the Romanov family to be destroyed forever.",
    "name": "Anastasia",
    "genres": [
        "Animation",
        "Adventure",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMDIxNzFjMGEtMDQxMS00ZWFkLTgzZTctMjA4MjE3YTM1MmU3XkEyXkFqcGdeQXVyMjI0NTA4NzA@._V1_QL75_UY281_CR46,0,190,281_.jpg"
}