{
    "filename": "Apocalypse-Now_script.txt",
    "imdb_id": "tt0078788",
    "imdb_url": "https://www.imdb.com/title/tt0078788",
    "characters": [
        "Jerry, Civilian",
        "MP Sergeant #1",
        "Captain Benjamin L. Willard",
        "Lieutenant Colonel Bill Kilgore",
        "Mike from San Diego",
        "Lance B. Johnson",
        "Chief Phillips",
        "Jay 'Chef' Hicks",
        "Lieutenant Richard M. Colby",
        "Kilgore's Gunner",
        "Tyrone 'Clean' Miller (as Larry Fishburne)",
        "Colonel Walter E. Kurtz",
        "General R. Corman",
        "Photojournalist",
        "Colonel Lucas"
    ],
    "dialogues": {
        "Jerry": "",
        "": "Original screenplay by John Milius.  Inspired by Joseph Conrad's \"HEART OF DARKNESS\".  This draft by Francis Ford Coppola.  December 3, 1975.      It is very early in the dawn - blue light filters through the jungle and across a foul swamp. A mist clings to the trees. This could be the jungle of a million years ago.  Our VIEW MOVES CLOSER, through the mist, TILTING DOWN to the tepid water. A small bubble rises to the surface; then another. Suddenly, but quietly, a form begins to emerge; a helmet. Water and mud pour off revealing a set of beady eyes just above the mud. Printed on a helmet, in a psychedelic  hand, are the words: \"Gook Killer.\" The head emerges revealing that the tough-looking soldier beneath has  exceptionally long hair and beard; he has no shirt on, only bandoliers of ammunition - his body is painted in an odd camouflage pattern. He looks to the right; he looks to the left; he looks INTO CAMERA, and slowly sinks back into the swamp, disapperaring completely.  Our VIEW HOLDS, We begin to HEAR natural, though unrecognizable JUNGLE SOUNDS, far off in the distance. We PAN TO REVEAL a clump of logs half submerged in the swamp; and part of what seems to be a Falstaff beer can in the mud. A hand reaches out, and the beer can disappears. As we TILT UP, we NOTICE that the log is hollow and houses the rear of a M-60 machine gun, hand painted in a paisley design.  Now the VIEW MOVES AWAY, ACROSS the ancient growth, PAST the glimmer of what seems to be another soldier hiding in ambush, wearing an exotic hat made from birds and bushes. ACROSS to a dark trail where the legs of those in black pajamas move silently across our ever TIGHTENING VIEW. Their feet, boots and sandals leave no impression; make no sound. A slight flicker of light reveals a pair of eyes in the foliage across the path, waiting and watching.  The VIEW PUSHES ALONG WITH the Vietnamese, MOVING FASTER AND FASTER WITH them, until suddenly, directly in front about ten feet away, an enormous AMERICAN clad in rags and bushes and holding a 12 gauge automatic shotgun casually at his side, steps in front of them. He smiles laconically, and BLASTS OUT FIVE SHOTS that rip THROUGH US. By the second shot, the whole jungle blazes out with AUTOMATIC FIRE.  Out VIEW TURNS as the men around us are thrown and torn, screaming and scattering into the jungle. More AMERICANS appear; unexplainably, out of the growth. It is now that we fully SEE the bizarre manner in which they are dressed. Some wear helmets, others wear strange hats made from feathers and parts of animals. Some of them have long savage-looking hair; other crew-cut or completely shaved; they wear bandoliers, flak jackets, shorts and little else. They wear Montagnard sandals or no shoes at all, and their bodies and faces are painted in bizarre camouflage patterns. They appear one with the jungle and mist, FIRING INTO US as they move.  The soldier we saw earlier emerges from the swamp, dripping mud, his MACHINE GUN BLASTING FIRE.  We begin to move quickly with one Vietnamese, breathlessly running for his life; we MOVE INTO the jungle with him, only to be impaled on a large spear of a smiling AMERICAN painted and wearing feathers like an Indian. OUR VIEW FALLS WITH him to the ground, STARING UPWARDS, as FLAME and EXPLODING MUD scatter above us. Men scream and die around us. The screams amid the GUNFIRE and EXPLOSIONS are piercing and terrible, as though the jungle itself is frightened.  An AMERICAN wearing a jungle hat with a large Peace Sign on it, wearing war paint, bends TOWARD US, reaching down TOWARD US with a large knife, preparing to scalp the dead.  OUR VIEW MOVES AWAY, along with the running sandals of a Vietnamese soldier, MOVING FASTER AND FASTER, only to be stopped by still another of the savage-looking AMERICANS with primitive ornamentation, wearing only a loin-cloth and green beret. He opens his flame-thrower directly ON US and the NVA soldier and we are incinerated in flame, bright psychedelic orange-red flame. Outrageous, loud, electric ROCK MUSIC OVERWHELMS the SOUNDTRACK :   <u>MAIN TITLE : APOCALYPSE NOW</u>     The CREDIT TITLES proceed as the FLANE CONSUME US, growing more intense, brighter, more vivid, purifying; transforming into an intense white heat that we can barely look at, like the sun itself.  Then it EXPLODES, breking apart, and shattering once again. It begins to cool, as the TITLES CONTINUE. It is as though WE ARE MOVING through the white center of cooling flame, forming a spinning web, and becoming more distant. The TITLES CONTINUE.  We are MOVING TOWARD planetary nebulae; MOVING through the stars; MOVING closer to the Earth. We can BARELY HEAR the MUSIC  now.  We MOVE CLOSER to the earth; beautiful, covered in clouds, as though SEEN from a satellite. The TITLES CONTINUE.  We are MOVING CLOSER to the earth; through the soft clouds, close enough that we can MAKE OUT the Western Hemisphere; CLOSER to North America; CLOSER, to America, then California; Los Angeles, STILL CLOSER to the odd, finger-like shapes of :     The VIEW finally SETTLES ON a partically luxury cabin cruiser harbored at a particular dock late in the day.  It is large, pleasure boat: The people are relaxing in bathing suits and towels and robes. They are drinking cocktails, and snapping pictures. The boat belongs to the head of a large American Corporation, and this is his party. This man, CHARLIE, is sitting, his shirt off to catch some of the late sun. Others have their faces smeared with white suntan oil that reminds us of war paint. Charlie is going on and on :   ... It's crazy -- sugar is up to 200 dollars a ton -- sugar !   What about oil ?   Food, oil --look, let me show you something. This is the economy of the United States in two years --  He takes a newspaper, draws a circle.    This is West Germany. (he draws another,  bigger circle This is Japan.  This is Italy.  This is Iran.  And this is Saudi Arabia... In two years ?  Do you understand ?   What's to prevent it ?   Maybe nothing. But I'll tell you, I didn't build a two-billion-dollar company in the last twenty years by doing nothing. We can protect our interests.  We are still the most powerful nation in the world. Militarily.  He leans to his associates, in a half-whisper.    You know bodyguard; he was a captain in Viet Nam. You talk to him, except he won't talk. This kind of man can kill you with his pinky. A nice quiet fella, though.  The VIEW BEGINS TO PULL AWAY from this group.    Carries a attache case at all times. You know what's in it ?  An Ingram Machine pistol.  Gradually, Charlie's voice softens as we MOVE AWAY, and a NEW VOICE, the voice of someone thinking, COMES IN OVER it :   I don't tahe chances, andBullshit. You can kill neither should this country.with the ridge of your If we're strong, we shouldhand to the throat; you protect our interests, andcan crush a skull with we should have the respectyour knee... but you of the world, even if itcan't kill anybody with takes another war.your pinky.  The VIEW MOVE ALONG the guests of this small party : Pictures being taken, some people are swimming. It is the good life. Now WILLARD'S VOICE TRACK DOMINATES.   The attache case has been empty for three years, but it makes him safe to think there's a machine pistol in it.  I don't like automatic weapons. They jam.  I saw a friend of mine get ripped open because he flicked his M-16 to automatic, and it jammed. How much money did the contractors make on the M-16 ?  Our VIEW IS MOVING through the people on the boat; some reading, flirting, drinking.    He likes to hear stories about Nam. I tell him I can't; they're not cleared. The truth is he wouldn't understand.  We can now SEE A MAN with his BACK TO US, looking the opposite way. An attache case resting near to him. We     There's no way I can tell them... what really happened over there.  I wouldn't've believed it if someone'd told me.  We are now RESTING on his back. Occasionally, he sips from a beer, but we cannot see his face.    There was only one part that mattered -- for me, anyway. I don't even know if I remember all of it. I can't remember how it ended, exactly -- because when it ended I was insane.      A Saigon boom street in late 1968. There are bars and shops for servicemen; the rickshaws, the motorbikes. Our VIEW MOVES TOWARD one particular officer; B.L. WILLARD , in uniform, a Captain of the Airborne, followed by four or five Vietnamese kids trying to shine his shoes and sell him things.   But I know how it started for me -- I was on R. and R. in Saigon; my first time south of the DMZ in three months. I wasn't sure, but I thought this guy was following me.  Willard looks back.     an American CIVILIAN.     Willard ducks into a bar.     Not much in this place -- a bar, linoleum flooring, a few tables and chairs, and a juke box. The lounge is fairly crowded. Willard takes off his cap and walks quietly past the soldiers at the bar. Some of them, catching sight of his ribbons, stop talking as he moves by.  An INFANTRY CAPTAIN enters the bar, buys a couple of drinks and approaches Willard's table.   How about a drink ?   Sure, thanks.  He sits down at the table with the drinks.   Winning the war by yourself.    Part.   Which part is that ?   My part.  Beer, with ice and water.    That's good gin.   I'm sure it is, but I had hepatitis.   Delta ?   No.   North ?   Yeah. Way north.   What unit were you with ?   None.   Rangers, eh?   Sort of.  The JUKE BOX starts BLARING. Annoyed , Willard looks over his shoulder.   Were you Longe Range Recon --   No -- I worked too far north for   He reaches into his shirt pocket for a cigarette, and the Captain leans over the table to light it for him. Willard notices the CIVILIAN on the street has glanced in the bar, then enters and sits down at a table by the doorway.   That's quite an array of ribbons...   Let's talk about you.   I was an FO for the 25th.   Tracks ?   Yeah.   Fat. That's real fat.   Sometimes.   At least you always have enough water. How many gallons does each one of those damn things carry ?   Thirty -- sometimes fifty.   You know, I can remember once, getting back below the DMZ -- and the first Americans we ran into were a track squadron. I just couldn't believe how much water they had. We'd been chewing bamboo shoots for almost a week, and before that, for two weeks, we'd been drinking anything -- rain water, river shit, stuff right out of the paddies. And there were these guys standing by their trucks spilling water all over. I could've killed them.  I swear to God I would have, too, if ...   I didn't know we had units up there in North Vietnam.   We do.   How long were you up there ?   A long time.   A year ? Waiter another beer.   I go up on missions. Listen Captain, buy me all the beer you want, but you better tell that asshole over there you're not going to find out anymore about me.  Willard glances over his shoulder and indicates the Civilian. The Civilian is given a sign by the Captain. He rises and comes over to the bar.    What do you want ?    If you're B.L. Willard, 4th Recon Group, we'd like you to come with us.   Whose orders ?   Headquarters 11 Corps -- 405th A.S.A Battalion -- S-2 -- Com-Sec -- Intelligence -- Nha Trang.   Who are you ?   The agency.  Willard looks at the Civilian a moment, and then walks roght out toward the jeep without saying another word. The Civilian follows.     A darkly painted \"HUEY\" ROARS over low paddies and jungle before emerging onto an open plain. It crosses a barbed wire and sand-bagged perimeter and lands in a heavily fortified, concealed compound.   They took me to some place outside Nha Trang... Intelligence Headquarters for all operations in South East Asia. I'd worked for Intelligence before --  Armed men jump from the Huey -- among them Willard. A large camouflaged cover is moved, revealing an underground corridor -- they enter.     A door swings wide -- Willard steps through and comes to attention, blocking the view of the room. A strange reddish light pervades. The room is covered with plastic maps and filled with smoke.  The whole place has been hewn out of the ground itself and there is a sense of the cut-back jungle growth slowly reclaiming it.   Captain B.L. Willard, G-4 Headquarters, reporting as ordered, sir.   Okay, Willard, sit down.  Willard sits in a chair that is set in a center of a bare concrete floor. Across from him, around steel desks and tables sit several men. The nearest one, a COLONEL puts his cigar out on the bottom of his shoe -- behind him sits a MAJOR and a seedy-looking CIVILIAN.   Have you ever seen this officer before, Captain Willard ?  He points to the Major.   No, sir.   This gentleman or myself ?   No, sir.   I believe on your last job you executed a tax collector in Kontum, is that right ?   I am not presently disposed to discuss that, sir.   Very good.  He turns to the Colonel and nods his approval. The Colonel gets up and goes to a large plastic map.   You know much about about Special Forces; Green Berets, Captain ?   I've worked with them on occasions and I saw the movie , sir.  The officer smiles at this.   Then you can appreciate Command's concern over their -- shall we say 'erratic' methods of operation.  I have never favored elite units, Captain, including your paratroopers or whatever. Just because a man jumps out of an airplane or wears a silly hat doesn't give him any priviliges in my book -- not in this man's army.   We didn't need 'em in Korea -- no sir, give me an Ohio farm boy and an M-1 Garand, none of this fancy crap -- no sir.    Major.   We have Special Forces A detachments all along the Cambodian border. Two here and another one here -- twelve or fourteen Americans -- pretty much on their own; they train and motivate Montagnard natives; pick their own operations. If they need something, they call for it, and get it within reason. What we're concerned with is here.      The A detachment at Nu Mung Ba. It was originally a larger base, built up along the river in an old Cambodian fortress.  The area has been relatively quiet for the past two years -- but --      ... Captain, we know something's going on up there -- Major --  The Major looks at some papers in front of him.   Communications naturally dwindled with the lack of V.C. activity, this is routine, expected ... but six months ago communication virtually stopped.   About the same time -- large numbers of Montagnards of the M'Nong descent began leaving the area -- this in itself is not unusual since these people have fought with the Rhade Tribe that lived in the area for centuries. But what is unusual is that we began to find Rhade refugees too -- in the same sampans as the M'Nongs. These people aren't afraid of V.C. They've put up with war for twenty years -- but something is driving them out.   We communicate with the base infrequently. What they call for are air strikes, immediate -- always at night. And we don't know what or who the air strikes are called on.   Who ?   You see, no one has really gone into this area and come back alive.   Why me ?   Walter Kurtz, Lieutenant Colonel, Special Forces. We understand you knew him.  He puts Kurtz' dossier in Willard's hand.   Yeah.   He's commanding the detachment at Nu Mung Ba.  The Colonel gets up and walks over to a tape recorder, flicks it on. The recording is first STATIC -- the AIR CONTROLLER then asks for more information on target coordinates -- it all sounds very routine, military. Then a frantic VOICE comes on, talking slurred, like someone dumb, except very fast.   Up 2 -- 0 -- give it to me quick -- Mark flare -- affirmative damn -- Immediate receive -- hearing automatic weapons fire man ...  GUNFIRE is HEARD and a lower, slower VOICE in background.   Blue Delta five This Big Rhine -- three Need that ordinance immediately Goddamn give it to me immediate Christ -- Big Rhino -- Blue God -- Delta damn -- goddamn.  A heavy BURST of AUTOMATIC WEAPONS FIRE -- INSANE LAUGHTER -- STATIC, and faintly, very faintly we HEAR HARD ROCK MUSIC -- more STATIC -- suddenly a low, clear VOICE peaceful and serene, almost tasting the words.   This is Big Rhino six -- Blue Delta.   That's Colonel Kurtz.   I want that napalm dropped in the trees -- spread it among the branches.  We'll give you a flare -- an orange one -- bright orange.  We'd also like some white phosporous, Blue Delta. White phosporous, give it to me.  STATIC interrupts -- the Major turns the machine off.   I only met Kurtz once.   Would he remember you ?   Maybe.   What was your impression of him ?  Willard shrugs.   You didn't like him.   Anyone got a cigarette.  The Major offers him one; they wait as he lights up, thinks.    I thought he was a lame.   A lame ?   This is years ago, before he joined Special Forces, I guess. We had an argument.   About what ?   I don't know. He was a lame, that's all.   But why ?   He couldn't get through a sentence without all these big words; about why we kill.   Well, he's killing now.   Maybe.   What does that mean ?   Maybe it's not Kurtz. I don't believe he's capable of that. I just don't believe it.   It's got to be Kurtz.   The point is that Kurtz or somebody attacked a South Vietnamese Ranger Platoon three days ago. Last week a Recon helicopter was lost in the area -- another took heavy damage -- direct fire from their base camp.   Our Recon flight ?   Ours.   Touchy.   You can see, of course, the implications, if any of this -- even rumours leaked out.   You want me to clean it up -- simple and quiet.   Exactly -- you'll go up the Nung River in a Navy P.B.R. -- appear at Nu Mung Ba as if by accident, re-establish your acquintance with Colonel Kurtz, find out what's happened -- and why. Then terminate his command.   Terminate ?   Terminate with extreme prejudice.     A waterway leading out to the ocean -- it is broken and divided into hundreds of channels, islands, water farms.  A Navy patrol boat  is waiting by a dock area. This is small, light craft, very fast, and heavily armed. Its men stand at attention in a small and simple military ceremony. Willard approaches them in battle- dress: Tiger suit, full field pack, forty-five, helmet, M-16. The boat commander salutes Willard.     We hear the introductions faintly, UNDER Willard's VOICE.   I met the P.B.R. crew; they were pretty much all kids, except for Phillips, the Chief -- Gunner's Mate Third Class L. Johnson -- Lance Johnson; Gunner's Mate Third Class J. Hicks -- The Chef -- Radio Operator Second Class T. Miller; they called him Mr. Clean.   Chief, try to keep out of where we're going -- Why we're goin' and what's gonna be the big surprise.   All right with me, I used to drive a taxi.   Let's go.  The Chief nods.  They all break formation and jump aboard and otherwise go about their work.  The twin diesels kick up -- and t he boat moves away from the dock. The Chef jumps aboard; Lance mans the forward twin fifty-caliber machine guns -- they wave to the guards on the dock and move away into the complexity that leads to the ocean.        The boat slams through the heavy sea ; hurtling off the top of a wave and crashing full into the trough of another.     Willard holds on to whatever he can -- he looks very pale. Water crashes over the bow and drenches everyone. The Chief mans the wheel and the ENGINES WHINE. Lance climbs back from his position. He looks at Willard, who just stares ahead into space, swallowing.        The dusk is spectacular through the broken storm clouds -- the sea is calm again.       The Chief is at the helm -- Willard approaches him.   The Delta closes off to us about ten  miles out of Hau Fat. We'll be able to pick up some supplies -- bit I think there are only two points we can draw enough water to get into the Nung River. It's all Charlie's turf from there on out.   We're gonna have some help to get in the river. You know these waters, Chief ?   'Bout six months ago I took a man up to Lo Mung Bridge. He was regular Army too. Shot himself in the head. I brought his body back down.   Shot himself. What for ?   Beats me -- the sun was too much for him, or the mud. Who knows ?  Pause, looking at Willard.     Suddenly, his attention is diverted -- there is a slow buffeting, as if the air around them is being sucked out and replaced quickly. The boat shakes slightly. There is a distant ROLLING NOISE like interrupted thunder. All the men have stopped whatever they're doing -- stand up and look out toward the shore and the green jungle hills beyond. The buffeting and NOISE CONTINUES -- they all stand silently -- suddenly it stops.   Arch light.   I hate that -- Every time I hear that noise something terrible happens.   Anybody see some smoke ?   Too far inland.   There they are.  He points up to the sky.     Way up -- past any clouds and barely discernible, we SEE the black silhouttes of four B-52 bombers, their vapor trails streaming white against the dark blue sky.   Charlie don't ever hear 'em. Not till it's too late -- don't have to hit you neither, concussion'll do it for a quarter mile or better. Burst your ears -- suck the air outta your lungs.     They are looking up. Willard sits down, unconcerned. He takes out the dossier given him by ComSec. He flips through the letters and other documents.   The dossier on A detachment had letters from Kurtz' wife and the wives and families of his men. All asking where to send future mail, understanding the necessery silence due to the nature of their work -- None of the men had written home in half a year.  Occasionally, in the b.g., we FEEL the terrifying buffeting of the distant B-52 BOMBING.     studying, examining a report.     Kurtz' face evolves through the various stages of his career as represented in the pictures in the dossier, as Willard reads :   Lieutenant Kurtz has shown a dedicated and well-disciplined spirit. He is a fine officer, combining military efficiency -- with a broad background in the Humanities, the Arts and Sciences ...  Another picture of Kurtz in Germany, standing next to the 161st Petroleum Supply Group sign.    ... He views his military career as the dedication of his talents to bringing our values and way of life to those darker, less fortunate areas in the world.  A SHOT of Kurtz at jump school.    ... I feel Captain Kurtz' request for Special Forces training is highly unusual in regard to his past humanitarian concerns, and his somewhat liberal politics, though I can see no reason to deny it.  A CLOSE SHOT of Kurtz with Green Beret on in the Vietnam jungle. His face is blank and vacant.    ... We feel Major Kurtz' need to bring a sense of Western culture to the backward peoples of these areas will be of use in accordance with our 'Vietnamization' programs ...  MOVE IN TO Kurtz' empty eyes until the photograph is just a BLURRED MASS OF DOTS.        One day later we came to an advanced staging area along the coast. This was our last chance to pick up supplies before approaching the mouth of the Nung River.  The VIEW OF THE COASTLINE leading up along the long load- ing docks at Hau Fat, an advance staging area for opera- tions \"Brute Force\" and \"Mailed Fist.\"  Everywhere are tents -- oil drums -- sandbagged bunkers -- helicopters -- tanks -- guns -- men. Nobody builds advanced staging areas like the Americans.  As the P.B.R. approaches the docking area, Lance notices something.   Hey.  They look as a Chris-craft speeds by pulling a fancy water- skier who waves as he slaloms by. The men just look at one another.     The P.B.R. pulls in -- the men scan the busy surroundings.   Lance -- I want you to go with the Captain an' get three extra drums of fuel and maybe scrounge some more 50 caliber.   Yeah -- look at those uniforms.     A platoon drills in the hot, lazy sun; they are clean and pale, in contrast to Lance and the others, just off the airplane.   Poor bastards, have a long year to go.  The troops turn and march TOWARD US with six weeks of Advanced Infantry Training to back them up.     They are tying up at the dock -- a young SERGEANT is fill- ing cut papers concerning them and talking with Willard.   I don't know anything about these papers, sir.   They're in order -- it's perfectly clean -- just check with ComSec- Intel like I said.   Well, you know I don't have the priority to do that, sir. It says here not to contact Com-Sec- Int. Who's your commanding officer ?   Right now -- I am.   Well who the hell verifies that ?   I do.  He signs it quickly, leaving the Sergeant totally confused.   No shit -- what's all the activity for around here ?   The show --   What show ?   Big show in the parade grounds this noon -- some boss stuff --   This -- Bob Hope or the like --   No sir, I think -- this'll be a little bit different --   Where's it gonna be ?  He points --     A large, well-built pedestal has been erected -- this is surrounded by a deep moat filled with punji stakes and garnished with concertina wire. It is empty --       The entire area around the pedestal and right up to the wire is mobbed with seething American fighting men. Some of these boys have just gotten here -- others have been in the jungle for months. All have one thing in common, to see and if possible grab an American girl. Their need far surpasses that of the run-of-the-mill rapist, pervert, or child-molester. To counter their need of course are the moat, punji stakes and barbed wire -- but implementing this are seven \"riot control positions\" equipped with the lastest in teargas launchers, attack-trained German shep- herds and assorted psychological warfare aides. Even so armed, the great mass of wild men are right up to the wire.     jammed in the crowd   It's really too much -- I mean I've collected every picture of her since she was Miss December.   Yeah -- you can really get hung up on them like the cat in the Delta.   What cat  ?   One that went up for murder -- he was an Army Sergeant.   I never heard about that.   Yeah -- he really dug his Playboy mag, man -- I mean like he was there when it arrived -- He just knew.   So what happened ?   He was working A.R.V.N. patrols and had one a them little cocky gook asshole Lieutenants -- anyhow, the Lieutenant took his new Playboy one day, sat on the end of the dock, and wouldn't give it back.   Yeah -- typical A.R.V.N.   Then went too far -- he sat there and starts mutilating the centerfold. Poking pins in her an' all that. Sergeant says, don't do her like that. You leave your shitty little hands off that girl. Gook Lieutenant says Fuck you in Vietnamese -- Sergeant says, don't do that again. You'll wish you hadn't. Then he stood up, flicked his iron to rock and roll and gave the little zero a long burst through the Playboy mag. Man, it blew him clean off the dock -- Hell, just the magazine was floatin' there all full of holes.   They nail him for it bad ?   He's in the L.B.J. -- didn't give him no medals or nothing --  In the b.g., we begin to HEAR a SWELL of TWO THOUSAND MALE VOICES; the ENGINES of four helicopters approaching. All heads turn skywards while one descends onto the pedestal kicking up a lot of dust and general resentment. On the nose amd doors of the black Huey are painted large Playboy rabbits. Finally the blades are trimmed and a strange silence descends over the men. The door of the copter slides partially open -- two young Green Berets step out with M-16's to varied catcalls. When this abates a young, extremelly well-dressed man emerges. He is the epitome of a Hollywood AGENT. Hair is combed impeccably and free of dandruff -- clothes are formal but hip -- shoes are shined -- Quite some dude -- his presence causes some stirring but seems to strangely quiet the man.  He walks over to the microphone.   I'd like to say hello from all of us up here, to all of you out there. All of you who've worked so hard during Operation Brute Force -- Paratroopers -- Infantry -- Airmen -- Medics -- Marines -- and Sailors. And I want you to know that we feel proud of you and know how hard your job is. To prove it -- we've brought some entertainment we think you're gonna like: The Playmate of the Year and her two runners up !  He pulls open the door and three unbelieveably beautiful sex playmates in fringed go-go outfits leap out and start dancing to the Creedence Clearwater Revival singing \"Suzy Q.\"     VARIOUS SHOTS as the girls dance in an incredibly erotic manner -- smiling.  The faces of the G.I.'s pass -- their jaws drop -- some look almost horrified. Chef is hypnotized -- Mr. Clean cries. Chief mouths unspoken obscenities with sentimental tenderness.  Others grab the air in front of them. With each movement their need increases by the square.     They crush forward starting to scream -- men fall on the wire -- the guards in the \"riot control positions\" forget -- the attack dogs are trampled. The mob as one surges forward onto the wire. Men scream and fall into the moat, which is filling up fast. The Agent sees this all as he has seen it before. He casually pulls the pin of a smoke grenade; the girls retreat into the copter -- he follows, then the two Green Berets. The ROTARS WHINE -- the black Playboy Huey lifts off just as the first crazed men reach it. They grab frantically for the wheels, but miss. The Huey wheels up into the blue sky, leaving them all below.  Such are the ways of war.       The P.B.R. moving further up the primitive coastline. There are few signs of civilization; no villages, no boats -- just the overwhelming presence of the jungle.   Two days out of Hau Fat, there was nothing but us and the coastline. I felt like I had set off for the center of the earth...  Suddenly, Chief looks out, ahead.   Smoke !   Where ?  They all turn. Chief points up the coast.     A thick train of black smoke rises from the green jungle.   Black smoke ... secondary burning.  The Chief grabs field glasses.   Yeah -- fishing village -- helicopters over there. Hueys, lots of 'em.   First Air Cavalry. They're the ones gonna get us into the River.     A vast field of devastation -- smashed and smoking palm trees -- deep, ragged craters -- gutted and burning huts -- shattered sampans and bodies washing around in the surf.     They wade through the water to the beach where they are met by a heavily armed group of men.  Overhead jets swoop by FIRING ROCKETS, the NOISE drowning out Willard's attempt at conversation with some of the men.  We can't hear any of the talk, but we notice that the Sergeant turns up to a particular Huey, and points to it.     Three Hueys swoop in low -- they are heavily laden with machine guns -- rockets and loudspeakers. The two out- side copters hover, while the center copter lands, raising a lot of dust. It cuts its rotors and the other copters pull up and off to the side. Two armed soldiers jump from the doors and stand with guns ready. Then a tall, strong looking man emerges. He wears a well-cut and neatly-stretched tiger suit. It is COLONEL WILLIAM KILGORE -- tough looking, well-tanned, with a black mustache.  He crouches over, holding his hat in the rotor wash. It is no ordinary hat but a L.A. Dodgers baseball hat. He walks out, and then stards to his full immense height and with his hands on his hips he surveys the field of battle. His eyes are obscured by mirror-fronted sunglasses.    Lieutenant: Bomb that tree line back about a hundred yards -- give me some room to breathe.  A Lieutenant and radio man nod and rush off.     He was not quite prepared for this.     turning to his GUARDS   Bring me some cards.   Sir ?   Body cards, you damn fool -- cards !  The soldier rushes over and hands him two brand new packages of playing cards wrapped in plastic. Two other soldiers get out of the copter and walk over. They are well-tanned and carry no weapons. They seem more casual about the Colonel than anyone else. The Sergeant walks up, leading Willard, the Chief and Lance.    Captain B-L. Willard, sir -- 4th Recon Group -- I carry priority papers from Com-Sec Intelligence 11 Corp -- I believe you understand the nature of my mission.    Yeah -- Na Trang told me to expect you -- we'll see what we can do. Just stay out of my way till this is done, Captain.  He cracks the plastic wrapping sharply -- takes out the deck of new cards and fans them. The Colonel strides right past Willard with no further acknowledgement. The others follow,     The Colonel walks through the shell-pocked field of devastation. Soldiers gather around smiling; as Kilgore comes to each V.C. corpse he drops a playing card on it -- carefully picking out which card he uses.    Six a spades -- eight a hearts -- Isn't one worth a Jack in this whole place.  The Colonel goes on about this business.     moving through the corpses, dropping the cards.  On of the two tanned soldiers rushes up and whispers something to him. He stops.   What ? Here. You sure?  The soldier points to Lance, who immediately puts down the card he was holding. Kilgore strides over to the young man, who almost instinctively moves closer t Willard.    What's your name, sailor ?   Gunner's Mate, Third Class -- L. Johnson, sir.   Lance Johnson? The surfer?   That's right, sir.  Kilgore smiles -- sticks out his hand.   It's an honor to meet you Lance. I've admired your nose-riding for years -- I like your cutback, too. I think you have the best cutback there is.   Thank you, sir.   You can cut out the sir, Lance -- I'm Bill kilgore -- I'm a goofy foot.     His entire, top priority  mission has been put in the background.   This is Mike from San Diego and Johnny from Malibu -- they're good solid surfers -- none of us are anywhere near your class, though.  Lance blushes, sort of mumbling thanks.   My orders are from Com-Sec Intel -- B.L. Willard, 4th Recon --   Just hold up a second, Captain -- I'll get to you soon enough -- We've got things to do here.  Willard eats it, for now. Kilgore puts his hand on Lance's shoulder, and continues flipping the cards in- discriminately on the bodies as they talk.    ... we do a lot of surfing around here. Like to finish up operations early and fly down to Vung Tau for the evening glass. Have you ever surfed the point at Vung Tau? I liked the beach breaks around Na Trang a lot -- good lefts.  He passes a twisted gun emplacement with about five bodies -- sprinkles cards all over them.    ... we keep three boards in my Command Huey at all times. You never can tell when you're gonna run into something good. I got a guy in Cam Rau Bay that can predict a swell two days in advance. We try to work it in.  He stops at a particularly wild-looking Viet Cong who has died with his mouth agape -- staring wild-eyed in horror at the sky. Kilgore pauses.    Hell, that's an Ace if I ever saw one.  He puts the card in the gaping mouth.     We SEE the Colonel and the others walk off -- the dead Viet Cong and card are in the immediate f.g. The card has the shield of the CAV printed bautifully, and above it the motto: DEATH FROM ABOVE.   Where've you been riding, Lance?   I haven't surfed since I got here.   That's terrible -- we'll change that -- I'd like to see you work -- I've always liked your cutback; got a hell of a left turn, too.       Willard is sitting with Kilgore on acouple of chairs by a table set up in front of the command copter.  Everywhere we SEE armed men, sandbags, barbed wire, oil drums etc. Hueys are constantly ROARING over. ARTILLERY BOOMS in the far distance. Kilgore looks at the map.   Why the hell you wanna go up to Nu Mung Ba for?   I got bored in Saigon.   What's the furthest you been in?   Haiphong.   Haiphong? Shit, you jump in ?   No. Walked.   What'd you do for supplies?    Mercenaries -- agents, traitors -- they put out caches.   Can you trust them?   No. They put out two or three for every one I needed. When you get to the one you'll use, you just stake it out. If something feels wrong, you just pass it up. On one mission, I had to pass up three and ended up living on rats and chocolate  bars.   Nu Mung Ba. Last I heard, Walter Kurtz commanded a Green Beret detachment at Nu Mung Ba.   When did you hear?   'Bout a year ago? Is Kurtz still alive?   Who knows.   Seems to me he got himself fragged. i heard some grunt rolled a grenade in his tent. Maybe a rumor. Helluva man -- remarkable officer. Walter Kurtz woulda been a General some day. General of the Army. Shit, Head of the Joint Chiefs of Staff. Did you knew Kurtz?   I met him.   Don't you agree?   He musta changed !  I got to get into the Nung River, here or here.   That village you're pointing at is kinda hairy.   Hairy ?   I mean it's hairy -- they got some pretty heavy ordnance, boy -- I've lost a few recon ships in there now and again.   So? I heard you had a good bunch of killers here.   And I don't intend to get some of them chewed up just to get your tub put in the mouth of the goddman Nung River. You say you don't know Kurtz?   I met him.   You talk like him. I don't mind taking casualties, Captain, but I like to keep my ratio ten to one in this unit -- ten Cong to one.   You'll find enough Cong up there.   What about this point here?  He puts his finger on the map.    What's the name of that goddamn village -- Vin Drin Dop or Lop; damn gook names all sound the same.  He motions to one of his surfers.    Mike, you know anything about the point at Vin Drip Drop?   Boss left.   What do you mean?   It's really long left slide, breaks on the short side of the point -- catches a south swell.   Nice.  Willard looks at Lance -- then at Kilgore.   Why the hell didn't you tell me about that place -- a good left.  There aren't any good left slides in this whole, shitty country. It's all goddamn beach break.   It's hairy ,though. That's where we lost McDonnel -- they shot the hell out of us. It's Charlie's point.   How big it is?   Six to eight feet.  Kilgore gazes out across the parked helicopters.    A six-foot left.  Willard nudges Lance -- who gets the idea.   Boss. What's the wind like.   Light off shore -- really hollow.   We could go in tomorrow at dawn -- there's always off-shore wind in the morning.   The draft of that river might be too shallow on the point.   Hell, we'll pick your boat up and lay it down like a baby, right where you want it. This is the Cav boy -- airmobile. I can take that point and hold it as long as I like -- and you can get anywhere you want up that river that suits you, Captain. Hell, a six foot left.  You take a gunship back to division -- Mike, take Lance with you -- let him pick out a board, and bring me my Yater Spoon -- the eight six.   I don't know, sir -- it's -- it's --    What is it?   Well, I mean it's hairy in there -- it's Charlie's point.  Kilgore turns and looks to Willard, exasperated.   Charlie don't surf.     What seems like hundreds of Hueys standing, their rotors churning a great wind -- Inside, the men of the 1st Cavalry Airmobile -- toughest unit in Vietnam.  Kilgore's helicopter is being loaded with ammunition and has surfboards strapped underneath.     Kilgore strides up to the side door, dressed for battle. He looks out, around. He turns to his door GUNNER.   How do you feel, boy?   Like a mean motherfucker, sir.  He turns to his R.T. man.   Let's go.     Helicopter rotors build up speed -- gas turbines belching fire from their jet pipes -- dust flying as fifty helicopters rise; ROAR OVER CAMERA and deploy into attack formation.     Helicopters moving THROUGH the FRAME: almost a dance of dragonflies.      Willard looks ahead -- Kilgore sits near the door. Below they see the jungle whisk by and they are suddenly over the ocean, low and fast.     CLOSE SHOTS of rocket pods -- mini-guns in bizarre looking mounts.  CLOSE SHOTS of the three surfboards strapped below the command helicopter, next to the fearsome weaponry.  And finally, CLOSE SHOTS of the men -- nervous, excited very few of them really scared -- they fondle their rifles, grenade launchers, anti-personnel grenades, claymore mines; plastic explosives cord; flame-throwers; M-60 machine guns; expandable rocket launchers; mortars and bayonets.     Kilgore cranes his neck and almost leans out to watch the waves -- then he sits back relaxed.    We'll come in low out of the rising sun -- We'll put on the music about a mile out.   Music?   Yeah. Classical stuff -- scares the hell out of the slopes -- the boys love it.     POV behind the PILOT and CO-PILOT -- the ocean rushes below.   Big Duke six to Eagle Thrust -- turn on coordinates 1-0 -- niner, assume attack formation.  The helicopter banks into a tight turn and bears toward the coast.   Eagle Thrust formation target 2800 yards -- begin psch-war operations.     The ocean rushes below as suddenly the LOUDSPEAKERS BLARE out Wagner's \"Ride of the Valkyries.\"     From the water we SEE the massive grouping of Hueys -- gun- ships -- troop carriers -- medevac and recon -- ROAR over low in battle formation BLARING out \"Ride of the Valkyries.\"     POV behind pilot --   700 -- 600 yards -- 500 -- Commence firing.  The whole copter shakes.     A Vietnamese coastal fishing village built along the beach and palm trees -- with rice paddies behind. This village commands a delta where ocean and river merge.  Sampans are pulled into a cover where they are being unloaded. We SEE bunkers with N.V.A. regulars ambling about.  Suddenly we HEAR the distant MUSIC -- Everyone stops; they stare out to see. Men scream orders -- women run from huts bearing ammunition and rifles -- Everywhere there is activity to prepare for the defense of the village.  Camouflage is removed from anti-aircraft emplacements. People feverishly unlimber weapons of all types and run to tunnels and trenches.  The MUSIC GROWS LOUDER with the FAINT SOUND of ROTORS     coming directly at us; WAGNER BLARING.     looking down through the helicopters as they approach the village.     POV behind pilot   700 yards -- 600 -- 500 -- commence firing.  The whole copter shakes.     We SEE rockets ROAR from pods -- MACHINE GUNS RATTLE -- grenade launchers POUND away -- and MINI-GUNS pour streams of lead and tracers with the SOUND of a DIESEL      POV behind lead gunship. They ROAR in over the beach streaming FIRE from doors, pods and nose -- The ground is alive with smoke and fire -- a hut EXPLODES. The leads ship banks sharply up over the trees -- men run below SHOOTING back.     EXPLOSIONS crash around -- the MUSIC and SOUND of the COPTERS almost drown them out. The gunner FIRES frantically -- COPTERS are ROARING over -- GUNFIRE rips around. The gunner is blown away.     as the ship he is in swoops down, its MACHINE GUNS FIRING into the village.     The Pilot leans out and SHOOTS a charging V.C. in the head with his .38, then ducks back in.   We're down, Eagle Thrust -- we're hit. We got a hot L.Z. here.  BULLETS RIP through the plexiglass. The Pilot FIRES back.    Hell of a hot L.Z. Need immediate air strike on the tree line, Eagle Thrust.      Kilgore has R.T. equipment -- he leans out near the door gunner.   Big Duke Six to Hell's Angels Four -- bring it in on along tree line and huts.   Hell's Angels Four to Big Duke Six -- we'll need green smoke -- suggest you have the FAC mark it.   Haven't got time, Hell's Angels -- lay it right up the tree line.     Four F-4H Phantoms peel off and streak toward the coast.      Fucking savages.   Who?   The enemy. Who else?     The jets streak by below laying in huge gobs of orange napalm along the trees.    Very good, Hell's Angels -- suggest you follow with cannon fire.     They circle the battle.   This is Baker Delta Four -- Captain hit bad -- need dust-off. Receiving heavy automatic weapons fire from huts about thirty yards to our left.   Big Duke Six to Baker Delta Four -- hold -- we're right over you.  He turns to door gunner.    Right along the doors, boy.  The gunner FIRES leaning out --    Fine... fine... little higher. Through the roof; yeah, that's good.  He leans back in.    Didn't anybody bring me any bombs, grenades, claymores or anything?   You didn't tell me to, sir.    You shoulda known.  Suddenly, BULLETS SMASH through the copter -- Plexiglass SHATTERS; the copter vibrates and turns sharply. Kilgore is thrown down where he hangs on.    Sonuvabitch -- anybody hurt?   Automatic weapons flashes along those trees -- probably eleven millimeter guns and AK-47's.   The trees, eh...  He grabs the R.T.    Eagle Thrust Four -- Big Duke Six. Join me in sparaying some trees.   Affirmative, Big Duke Six -- We're even got some rockets left.   Take her in low, Lieutenant.     The two helicopters swoop up out of the smoke and blast the trees with ROCKETS, MACHINE GUNS and GRENADE LAUNCHERS.  Other copters join -- The V.C. break and run through the rice paddies in the f.g. -- BULLETS EXPLODING around them -- they scream and fall FIRING back.     Kilgore looks out as three V.C. break and run through the rice paddies -- the helicopter turns and follows them -- the door gunner swings out and BLASTS two of them into the mud. He takes a bead on the third.   Hold it, boy.  He puts his arms across the sights -- the gunner swings back inside.    Take her up to 300 feet, Lieutenant.  They rise above the paddy -- the man below runs for all he's worth. Kilgore motions to the door gunner who steps aside. Kilgore buckles himself into the gunner's harness.    Rifle.  A hand passes him a M-16.    My rifle, soldier.  There is some fumbling and then a hand passes him a 300 Weatherby Magnum with a zebra wood stock -- mother of pearl inlays and a variable power scope. Kilgore takes it and opens the bolt.     Amazed at these proceedings.     as he loads the rifle with huge cartridges. He gets into the sling and slams the bolt shut.     He is running hard, but starting to sink into the mud. The Huey DRONES overhead, its huge shadow behind him on the mud. He turns and FIRES with a pistol.     Kilgore leans out; pulls the gun in tight -- takes careful aim and the Cong is BLASTED flat into the paddy. Kilgore leans back, opens the bolt, ejecting the spent cartridge out the door. He hands Weatherby back into the copter.     The gaudy rifle passed by him.   That's 27, sir.   Anyone got a card?  Somebody hands Willard the deck. He takes a card and flips it out of the copter, never lifting his gaze from Kilgore.       Americans run through the hooches FIRING and throwing GRENADES. Helicopters swoop overhead -- JETS ROAR by -- Uniformed N.V.A. regulars burst from a tunnel en- trance and charge the Americans. The SHOOTING is at point blank range -- automatic, as the V.C. are cut down.     Kilgore leans out carefully, looking over the battle- field. He has the R.T.  He leans back, deliberately avoiding Willard to speak to Lance.   The L.Z.'s cooling off fast -- we'll move in another company an' then we'll own it.  Charlie's point.  He looks out toward the ocean.    Good swell.   What, sir?   I said it's a good swell -- hell of a good swell 'bout six feet. Let's get a look at it.  Lance looks at Willard and then agrees.     The pilots are used to this -- they bank sharply and swoop in on the lineup of waves, coming in  low over the point and streaking down a long, lined-up green wall as if surfing it. They tip up over and up at the last minute as the wave breaks.       Americans line up blindfolded Viet Cong and N.V.A. regular troops outside a burning hut. GUNFIRE is DISTANT and sporadic -- an occasional MORTAR round SCREAMS in. A soldier yells in Vietnamese in a southern accent and the prisoners are marched away. Other soldiers are already setting up heavy weapons emplacements -- 50 cal machine guns etc. Three Hueys ROAR in, fanning the smoke with their wind. The center one, the command ship, lands. JETS SCREAM over and the two gunships pull up at 200 feet. Another Huey zooms in low and lands behind the Colonel's. The doors open, guards jump out, check the situation, and out steps Kilgore and Lance. From the other copter are more guards, Kilgore's surfers and others of the P.B.R. crew. Willard follows.     They stride out across the debris-strewn beach. Kilgore stands majestically on the point watching the waves. A SHELL SCREAMS overhead.   Incoming !  They all dive, except Kilgore. He is watching a big set -- the SHELL EXPLODES in the water about a hundred yards away, sending up a huge geyser of spray. Kilgore is unmoved.   Look at that.  They look.   This  L.Z. is still pretty hot, sir, maybe we oughta stand somewhere else.  Kilgore pays him no mention.   I'm waiting for the fucking boat, Colonel.    It'll get here, soldier.  He turns to Mike and Johnny who have their faces in the sand.    Change.   Wh -- what?   Change -- get out there -- I want'a see if it's ridable -- change.   It's still pretty hairy, sir.    You want'a surf, soldier?  He nods yes meakly.    That's good, boy, because it's either surf or fight.  They turn and hurry off -- Kilgore grabs an M-1 from one of the guards. They all think he's going to shoot the surfers or someone. They move back uneasy.    I'm gonna cover for 'em -- that's all.  He cocks thye weapon. Lance looks around uneasily. The Colonel walks over.    You think that section on the  point is ridable, Lance?   I think we ought to wait for the tide to come in.  A SHELL SCREAMS OVER -- they all hit the dirt except for Kilgore. It EXPLODES throwing sand through the air. Kilgore leans down yelling over the NOISE.   Doesn't happen for six hours.  Lance looks up at him terrified, holding onto his helmet.    The tide -- doesn't come in for six hours.       They walk through shallows carrying brightly colored boards. They look very scared. JETS SCREAM overhead, FIRING CANNONS. Helicopters wheel by carrying out wounded.  They wear olive drab surfing trunks with the Cav's shield on the left leg. The same shield is emblazoned on the boards along the word \"Airmobile\". They edge into the water and paddle through the mild shorebreak.     They paddle up the point in the calm channel -- the beautiful waves breaking beyond them.    They paddle on their stomachs, keeping low -- breathing hard and constantly looking around scared out of their minds.     Kilgore looks at them with his field glasses. Lance kind of sits below taking cover in a shell hole.   They far enough?   Sure -- fine --  Kilgore turns and takes a giant electric megaphone from a waiting lackey.    That's far enough -- pick one up and come on in --     They line themselves up on the point. A good set is building. Mike turns strokes into it -- takes off -- drops to the bottom and turns -- trims up into a tight section -- everything right except he keeps looking around frantically.     Another SHELL SCREAMS over and EXPLODES down the beach. Lance looks over at Willard.    Maybe he'll get tubed.   What?   Maybe he'll get inside the tube -- where -- where they can't see him.  A SERIES of SHELLS ROAR in.   Incoming !  Lance ducks -- puts his hands over his head. The SHELLS SCREAM over Kilgore and out towards the point. Kilgore looks through his glasses -- two EXPLOSIONS in the water are HEARD.   Son of a bitch.  Lance looks up and out toward the point in horror.     Two surfboards float in the channel bobbing up and down on the waves.       The tragedy of this war is a dead surfer.  Willard looks over, beginning to think Lance is crazy, too.   What's that?   Just something I read in the Free Press.   They just missed a good set -- the chicken shits !  Lance looks up.     They come up near their boards and climb on -- smoke hangs over the water.    Try it again, you little bastards.     He turns to Willard.    Im not afraid to surf this place. I'll surf this place.     He turns, glowering to his lackeys.   Bring that R.T., soldier.  He grabs it.    Big Duke Six to Hell's Angels -- Goddamit, I want that treeline bombed -- yeah -- napalm -- gimme some napalm -- son of a bitch -- yeah, I'll take H.Z. or C.B.U.'s if you got any of them -- just bomb 'em into the Stone Age, boy.  He throws the R.T. back to a soldier -- another SALVO WHISTLES over -- everyone drops.    Son of a bitch.  As the SHELLS EXPLODES on the beach behind him, KIlgore raises his M-16 and EMPTIES it full automatic in the general direction of the trees. He mumbles a few un- intelligible swear words and jams a new clip into his rifle turning to Lance --    We'll have this place cleaned up and ready for us in a jiffy, boy. Don't you worry.  He FIRES another clip as the JETS SCREAM overhead.      A sky-crane without pod descends slowly toward us -- The P.B.R. hangs below it.  The Chief, mr. Clean and Chef stand watching this sight alomg with other soldiers. A man guides the descending copter till the boat settles carefully in the shallows. The Chief and others leap aboard; unshackle the hoists -- load on ammunition and fuel. The battle is still going on around them. They all look up as a wadge of PHANTOMS streak over low and peel off one by one to begin their bombing run.     Phantoms RAKE the trees with 20 mm CANNONS -- FIRE five inch ROCKETS in salvo -- \"Bull Pup\" MISSILES -- drop H.E.  and C.B.U's (Cluster Bomb Units) and finally an immense amount of NAPALM.     The Chief is at the helm --the engine starts; Clean and Chef work feverishly, ducking for cover every-so- often when an EXPLOSION hits nearby. The boat begins to back out of the shallows. The EXPLOSIONS of NAPALM are reflected on their faces; the ROAR of the FIRE drowns out almost everything.   Forget that extra drum -- it's too damn hot.   Clear on starboard -- Where's Lance an' the Captain?   I saw that Colonel's Huey on the point --  Two HELICOPTERS SCREAM over FIRING ROCKETS.    Let's just get outta here.      Kilgore watches the waves with his field glasses -- smoke drifts over.  Lance crouches below. Willard is up looking off in another direction. SHELLS SCREAM over, but even their noise is drowned out by the fierce SHRIEK of the PHANTOMS and the deafening BLAST of HIGH EXPLOSIVES. Willard stares at the tree line where it comes down to the river. The JETS are making a hell of the tree line; a hell of fire and bust- ling steam thet nothing could live in. Willard's glance goes further downriver through the black smoke and there merging in the river -- small and vulnerable, is his boat.    Look. There it is; the boat.  Lance looks over --  a tremendous relief on his face. But still there remains the threat of Kilgore, standing stark against the sky. Willard silently motions Lance toward the boat.    He'll kill us.   He can't kill us.  We're on his side.  Kilgore FIRES another clip at the tree line, and then strides back without looking at them.    You smell that.  You smell that?   What?   Napalm, boy -- nothing else in the world smells like that --  They reflect the glow from the burning trees.    I love the smell of napalm in the morning.  One time we had a hill bombed for 12 hours. I walked up it when it was all over; we didn't find one of 'em ... not one stinking gook body. They slipped out in the night -- but the smell -- that gasoline smell -- the whole hill -- it smelled like ...  victory...  He looks off nostalgically.   You know, some day this war's gonna end..    Yes, I know.  Suddenly he senses something -- he stops -- lifts his hand -- then frantically licks his fingers and puts them up in the air.    The wind --   What?  Sure enough there is a rushing breeze that increases.    Feel it -- it's the wind -- it's blowing on shore -- It's on shore !  He leans down and practically grabs Lance.    It's gonna blow this place out. It's gonna ruin it ...   The kid can't ride sloppy waves.  They turn and stare out to sea.     The wind has changed. Instead of blowing spray back over the waves and hollowing them out, this strange wind is causing white caps and cross chop.. reducing the swell to slop. Mike and Johnny lay low on their boards, overjoyed.   The kid can't stand sloppy waves.      You don't expect this kid to ride that crap, do you? He's a goddamn artist, he needs something to work with...  Slapping Lance on the shoulder.   Yeah, I'm an artist, goddamit !    Yeah -- yeah, I can understand how you feel.  He turns toward the trees.    It's the napalm -- it's causing the wind -- ruining my perfect left.  He staggers off toward the trees followed by his guards and other lackeys.    The napalm -- ruin -- napalm my perfect left -- my perfect left point break -- napalm --  Lance motions with his eyes to Willard.     The P.B.R. along the river shallows -- The Chief and crew waiting and yelling.      Are you finished surfing?   Yeah... thanks.   Want to say goodbye to the Colonel?   Nah.   Then let's get the hell out of here.  They break and run like hell toward the boat in the distance. OUR VIEW TRACKS with them. They are cheered by the crew -- suddenly, Willard sees some- thing and stops... Lance continuing. In a pile of equipment that the Hueys have left are two surfboards -- Willard looks at them.   No -- no, Captain.   Which one's the Colonel's?   The Yater -- the clear one with the thin stringer.  Willard glances over to it with determination. There is still MORTAR FIRE coming in between him and the board. Suddenly, Willard makes a run for it.   Incoming ! Incoming -- son of a bitch.  The ROUNDS bracket the P.B.R. and line up the beach toward Willard. He stands there and doesn't move, the surfboard under his arm. The shells kick up sand. Lance has dropped. Fragments whistle by, one rips a chunk of foam and fibreglass from the rain of the board.    This one , Lance?   Yeah, Jesus Christ !  Once again, Willard takes off fast as hell with the board under his arm. Lance follows toward the boat, through the water. Willard hands the board up to Mr. Clean, and they both scamper abroad, exhausted and relieved.   What'd you that for?   When I was a kid I, never had a Yater spoon.  Mr. Clean stuffs the board in the stern 50 Cal. mount. The boat turns -- ENGINES RUNNING HARD and ROARS OFF toward the deeper water of the river -- the board clearly visible on the stern.       The P.B.R. ROARS BY going down the river at full speed. It is swerving and zig-zagging to avoid potential enemy fire.     They all are in full battle positions -- their twin fifty Cal. guns turning; warily covering the jungled banks. The Chief is at helm -- Willard crouches against some armor plate, huddled with his M-16 ready. Chef is behind him at the radio. Lance leans back from his forward turret.    Maybe we better stay in under the trees till dark -- we got his Yater.   He didn't look like he'd take that sitting down.  They all look up into the sky -- expecting the worst.    Let's put some distance between us and Charlie.  The Chief nods.   Lance ---   Yeah.   Why don't you roll us a big joint? I think the Captain'd like that.  They all look at Willard uneasily. After a suspensful pause, Willard smiles:   Take one a mine --  He fishes into his breast pocket -- pulls out a huge cigar-sized joint. They all smile -- Willard lights up.       It zig-zags away from us down the river at high speed.       The boat is hidden under some trees along the river bank. The men wait tensely listening --   You hear it again?   No -- I don't think so. But it'll be back. They were circling. It'll be back.   You think he'd of shot us?   When?   Any time -- us -- Americans.  Lance looks over at Willard.   I don't think hed of shot us on the beach but -- he'd of shot us if he saw me taking the board --   A Yater spoon is hard to get -- especially here.   He's a man who knows what he wants -- he does know what he wants.   Can I go get those mangos now?   I'll go with you in a while -- judt hold tight awhile --   Captain -- that was all true about the rats and chocolate and stuff?   Sure.   And you could just tell when the supplies were booby trapped?   It's a feeling you get in the jungle. When you get good, you can find a track and tell not only how many they are, but their morale, how far they're going, whether they're near their camp, the weapons they're carrying.   How can you tell their weapons.. an' how far they're going?  Willard smiles.   Mostly from the imprints when they put them down to rest. their morale from the way they drag their feet, or the joints that may be lying around. If they're near a base camp, they wouldn't be conserving food; they'll be throwing it away half-eaten. If the branches aren't broken, their weapons are slung. But all this is just technique.. There's a feeling you get after a while, that's what's important. I was going through a village once. I was looking for a certain party. I took off my boots, and walked into each hut. It was midnight. I went into three like that and suddenly I realized Id gone into each hut the same way -- standing up -- so the next one I went in on my belly. An RPD burst took out the door a bit above my head.  Things like that.  A pause, and then suddenly his attention is diverted -- They all are silent -- It is pitch dark -- we HEAR the distant SOUND of ROTOR-BLADES and indistinguishable language on a loudspeaker -- The talk stops -- the ROTORS grow LOUDER until almost overhead.    I'm not gonna hurt or harm you, boy -- I just want the board back -- You can understand -- It was one of my best -- You know how hard it is to get a board you like, boy. I'm not gonna hurt or harm you -- Just leave it where I can find it --  The HELICOPTER DRONES on into the night -- the same speech starts again further off -- Finally the noise ceases.   Jesus -- that guy's too damn much.   I wonder if that was the same copter.   He's probably got 'em all over the river with that recording. We better move now while it's dark.  Chef steps forward with a plastic basket.   Yeah, Chef -- go ahead -- take Lance with you --   I'll go with him --  They all look at him.    I wanta get my feet on solid land once in awhile --  He grabs an M-16 and follows Chef over the side.     They cautiously walk through the underbrush.   Chef.   Yes, sir --   Why they call you that?   Call me what, sir?   Chef -- is that 'cause you like mangoes an' stuff?   No, sir -- I'm a real chef, sir -- I'm a sauciere --   A sauciere --   That's right, sir -- I come from New Orleans -- I was raised to be a sauciere.. a great sauciere. We specialize in sauces; my whole family. It's what we do. I was supposed to go to Paris and study at the Escoffier School; I was saving the money. They called me for my physical so I figured the Navy had better food.   What are you doing out here?   Cook school -- that did it.   How?   They lined us all up in front of a hundred yards of prime rib -- magnificent meat, beautifully marbled.. Then they started throwing it in these big cauldrons, all of it -- boiling. I looked in, an' it was turning gray. I couldn't stand it. I went into radio school.  They move into a slight clearing.    -- quiet --  Chef crouches close -- redies his M-16. Willard ges- tures that he heard something; he points.     PAN SLOWLY over jungle -- END REVEALING Willard and Chef.    There...  He points -- motions Chef to move away -- they cover the spot. A few yards from them they hear something move. It is obviously no small jungle creature. They walk toward a patch of black elephant grass; their guns at the ready. They look at each other. Willard is cold, methodical, doing something he knows well. There is a noise again -- some of the growth rustles.  He and Chef move a distance apart, and join in stalking the probable V.C. Willard directs the Chef with hand gestures, and bird and cricket sounds. They move stealthily, closing the apex of their triangle on the hunted. The two men drop low into the elephant grass, and remain motionless. Then Willard makes the cricket noise, and they move closer. Willard's left hand edges out along the M-16's far end, so that he only has to point the finger of that hand and he will hit what he wants. He makes another command and they rush the trapped enemy.     Suddenly there is a RUSHING SOUND -- The grass folds down quickly toward them -- willard plants his feet and from the hip lets go FULL AUTOMATIC. The Chef retreats FIRING short BURSTS into the grass -- the grass folds almost to Willard -- then a huge tiger leaps out at them; snarling magnificently. They FIRE wildly, emptying their clips.   It's a motherfucking tiger -- goddamn...  He turns and bolts through the jungle, as scared as a man can be.    Goddamn -- Jesus Christ tiger -- motherfucking tiger -- ohhhhhhhhh --  Willard jams another clip in his gun and backs out of the clearing, covering the bushes and runs, scared out of his head as well.     They all are armed -- Lance has the twin 50's pointed into the jungle. Chef comes screaming out of the brush, throws his rifle into the boat and dives headfirst after it.    Ohhhh -- tiger ! Oh goddamn ! It's a tiger ! Jesus Christ ! Goddamn, a tiger ! Ohhhhhhhh.  The Chief tries to grab him; takes his gun away, but is unable to take a hold of the Chef, as he slithers around the boat, trying to find safety. willard follows from the jungle -- The Chef is moaning and stares off into the night.   What's this tiger shit?   No shit... I think I shot the hell out of him.   You think?   I wasnt looking.. I was running.   Was a big tiger -- no shit?   Who stopped to measure him -- let's get the hell out of here.   A motherfucking tiger -- I could've been killed.  The ENGINE ROARS to life -- the P.B.R. pulls away with great speed.   You forgot the mangoes, didn't you?   Mangoes? There as a fucking tiger in the woods -- I could've been eaten alive. I'm never going into that jungle again. I gotta remember never get out of the boat; never get outta the boat.  They move off; swallowed by the darkness. The JUNGLE NOISES remain, as OUR VIEW BEGINS a MOVE INTO the jungle.   He was right, the Chef -- never go into the jungle, unless you're ready to go all the way.       Willard, thinking, his BACK TO US. Suddenly, he turns around, and we SEE his face.   What was in the jungle? What was there, waiting for me?  He lights the cigarette; the light of his match illuminating his face momentarily. There is something different about him; a maturity, a cool inner peace.    ... Kurtz was in there. Or was he; was it Kurtz? He was just a name to me now; I couldn't remember a face, a voice -- he just didn't add up to me. all his liberal bullshit about the end of savagery -- and the role of our culture, our way of life...  Willard looks toward the group of people on the boat -- there is still some MUSIC. They talk and drink and laugh.    Our way of life -- I really started to look forward to meeting Kurtz again.       We HEAR:   -- must remember that we owe our thanks for these to the wonderful services of the U.S.O. -- here's another oldie -- this one dedicated...     by himself on the P.B.R.; he has wiped mud under his eyes to kill the glare; it is incredibly hot. He is barechested, wearing a hat made of a banana palm.   ... to the fire team at An Khe from their groovy C.O. Fred the Head --      The Rolling Stones and \"Satisfaction...\"   Outa sight.  The SONG BLARES ON -- they all dig it.  PAN TO Willard, sitting alone in the rear, reading from his file on Kurtz. We REVEAL Lance in the b.g., water- skiing behind the P.B.R., slaloming back and forth on his single ski to the MUSIC -- jumping the wake occasion- ally.     Lance waterskiing to \"Satisfaction.\"     alert, at the rear of the boat -- his M-16 ready, just in case.      Willard opens a letter from the packet.  We can SEE it is a private correspondence -- feminine writing on the envelope.   The dossier of A Dtachment contained letters from the families and wives of Kurtz' men There were letters from Kurtz' wife as well.     It is addressed to Colonel Walter Kurtz -- in the corner is the return addess of Mrs. Colonel Walter Kurtz -- Willard's hand fushes through the packet and comes up with apicture of a very attractive, thirty-five year old American Beauty... She is classically American.     looking at the picture -- puts it back, then opens the letter, straightens it.   Dearest Walt -- I have to confess something. I know how you feel about this, but I had to ask Bob to find out what he could -- I just couldn't stand it anymore, not knowing where you are, whether you're alive or dead. I'm sorry Walt, I'm sorry I said that. Bob didn't tell me anything -- he said he couldn't -- I can't stand it anymore, Walt -- I just can't stand it.  Willard looks out at the jungle.  Deep imppenetrable jungle -- dark and primeval forests pass by. The Rolling Stones CHANT on in the b.g.    I have to take the kids to school every morning now -- carpools just never work out.  Jeff came home with a black eye on Tuesday but said he won anyway. He wouldn't tell me what the fight was about. Jeff keeps asking where you are -- he has maps of Viet Nam in his room now. He misses you very much. I can't take this much longer, Walt. I love you and I just can't stand it.     He folds the letter up, files through some others quickly and gets to a peculiar envelope stamped Top Secret with a stenciled date on it. It is also noted that this was the last correspondence to leave Nu Mung Ba. It is addressed to Kurtz' wife. He opens the letter -- it is written in a scrawled savage hand to no one in partic- ular. It reads:  Sell the house Sell the car Sell the kids Find someone else Forget it I'm never coming back Forget it --  He folds up the letter.     He looks out at the ominous jungled mountains.       The P.B.R. pulls in towards an American outpost that is being used as a forward medical evacuation center. Various helicopters pads are SEEN, but only one heli- copter -- the H-34 painted with Playboy rabbits that brought the girls to Hau Fat. Several soldiers in rain- coats come out the dock as the P.B.R. pulls up.     Willard looks into some empty tents -- looks around the dreary muddy camp. Two soldiers pass.   Soldier -- where's your C.O.?   Stepped on a booby trap, sir -- got blown all to hell --   Well , who's in command here?   I don't know -- don't have any idea -- I'm just the night man --  He turns and walks off babbling incoherently --   What about you, soldier?  The soldier he was talking to turns around smiling idiotically and making animal noises. He stumbles off after his friend.     He looks around disgustedly    Captain --  Willard turns around looking for where the voice came from.    Over here, Captain --  He turns to see the Hollywood Agent under the flap of a large tent so that he won't get wet. He wears the same clothes as before, but is much dirtier. He motions Willard into the tent.     They duck inside -- it is dark and damp.  On cots around astove sit the three playmates and the pilot. The nearest one, CATHY, a blonde, picks leeches out of her feet. The other two, TERRI and LYNDA, play cards with the helicopter pilot. Willard looks over the situation.   You came in on that boat, didn't you?   Yeah --   Where are you headed?   What's it matter? Get to the point.   Look -- you know the girls -- Thta's Terri -- she was playmate of --   Yeah, I caught your show at Hau Fat.  They all look over.   Oh -- I see -- Well, girls, this is Captain -- eh --   Captain Willard -- go ahead.   Look -- we got in a little trouble -- they rudely took our helicopter for MedEvac work on this -- uh Operation Brute Force -- They just brought it back this morning.   Yeah.   Well I mean like they also took our fuel -- We've been here two days.   Dreadful.   Look -- the girls could get killed -- we're not supposed to be this close combat, I mean real combat.   Well --   We could use some fuel -- just a half drum -- just enough to get us out a here.   We need all our fuel.  He turns and starts to leave.   But, Captain, think what these girls have done for the boys -- think of how they've risked --  Willard is almost out of the tent.   Captain --  He turns around.    It's really rough here -- Captain -- we're just not built for it --  The Pilot laughs.   That's rich --   Do us a favor -- I'd do one for you -- if I could --  Willard just stares at her -- even though she's in jeans and field jacket she is something to see -- The Agent takes Willard aside -- Terri goes back to the others.   Look -- you know who that is, Captain -- you know what she's saying -- you'll never see stuff that good outside of a magazine for the rest of your life.   I'm not that fond of blondes -- maybe I like brunettes --   Take your pick -- they all like you -- I can tell --   I like all of them --   Good -- like I said, take your pick.   I said I like all of them.   Now just a second -- I'm doing you a favor, buddy -- what're you trying to pull?  Willard turns to leave again.   We need all our fuel anyway.   Wait -- wait -- don't get up tight -- what I meant was we'd need a whole drum for that --   Sit down -- we'll talk about it.  Willard sits down on a metal chair -- motions the Agent to do likewise.   What's there to talk about -- this whole thing disgusts me.   My men --   What !   That's what there is to talk about -- my man -- I take a good care of my men --  The girls are trying to pretend they're not listening -- the helicopter Pilot is cackling to himself.   You're out of your skull --   We have a lot of pride in our unit --   How far do you think you can push -- what kind of people do you think --   Esprit de corps --   No -- absolutely not --   One for all -- all for one --   You can keep your fucking fuel --  Willard gets up.   You make some of your closest friends in the army -- war has a way of bringing men together.   Get out --   Men of all races -- nationalities --  He gets up and starts out.   Two drums --  Willard turns around slowly.    Two whole drums --   We can use some fifty caliber and a 16 too --   I don't know what you're talking about -- Get fucked --   I will -- I assure you that -- You got a fifty on that H-34 -- leave the ammo in boxes -- I'll get my men to bring the first drum with 'em --  He turns to go under the tent flap.    Have the girls freshen up a bit -- comb their hair -- put on something -- you know what I mean --  He leaves.     They are all working on patching the boat and cleaning it up in general. Mr. Clean sits in f.g., cleaning an M-16.   You keep this thing in this condition an' it's gonna jam, Lance -- mark my words.   Why don't you go pet the water buffaloes -- get off my back.  Behins them on the beach stand several water buffaloes eating mud or whatever they do. They are painted jungle brown and green camouflage with grey bottoms -- on their sides the words have been stenciled in black:  1 Each -- Buffalo, Water B-1A U.S. Army No. 15239  Willard walks through them down to the boat.   Careful,  Captain, they've been known to charge.   All right I got a little surprise for you --  They all look up.    I've arranged with those people we saw at Hau Fat to give us some 50 caliber in trade for a couple a drums of fuel --   No shit.   Chef -- since you're such a fan of Miss December's I think you should be detailed with Lance and Clean to take the first drum up there.   I don't believe you --   What're you trying to say, Captain --   You'll see soon enough -- get going, sailor --   No shit -- hot damn --     He has followed her into the tent awe-struck -- she casuallu starts unbuttoning her fatigue jacket and taking off her pants. he just stands there, his arms at his sides.   I've got every one of your pictures -- I've got the centerfold -- the Playmate's review -- the Playmate of the Year run-off -- everything, even the calender --   Well, get undressed and let's get it over with --   I can't believe it -- I'd a never even got to see you if it wasn't for this war --  She lies down on the cot in only her panties.    You wouldn't mind -- uh kinda draping that jacket over you sort of the way you were in the calender, would you?   Come on -- cut this crap -- I gotta get back to Saigon --   Just let me look awhile -- I just don't believe --       They have just finished making love. cathy looks very pleased. Lance finishes tying his boots -- she draws on his back. He gets up -- starts to leave.   Well -- uh thanks -- see you around.   Yeah.  He leaves -- she pulls herself up and starts combing her hair -- Mr. Clean walks in.    Who are you?   I'm next --  She shrugs.       He finishes tying on his boots -- pulls on his jacket -- his gun belt and picks up his M-16. She looks up at him --   Ma'am -- I'd like to thank you for what you an' all your friends have done for us -- I want you to know that me an' the men appreciate you coming all this way -- riskin' your lives -- living uncomfortably an' doing all you can to entertain us. I want you to know personally, Miss, that for the past few minutes you have made me feel at home.  She picks up a shoe to throw at him. he turns, exits f.g.    Just wanted to say that, ma'am.  The SHOE CLANGS off his helmet.        The boat edges in toward the wrecked bridge in the distance. Along the banks are sandbagged fortificvations with U.S. soldiers in them. There is a bright fire burning uncontrolled in the distance; the sparks and white light from welding on the bridge momentarily lights up the night.   Two days and nights later, we approach the Do Lung Bridge.     watching. Everywhere are wrecked boats -- parts of trunks sticking out of the water -- smashed helicopters on the banks. The bridge is in a state of siege. Mortars and rockets arc through the night indiscriminately and rip through the nearby jungle. Soldiers are everywhere -- scurrying from trenches, carrying materials for the bridge or tending to the wounded, the maimed and the dead. Light automatic WEAPON FIRE is HEARD occasionally. The P.B.R. edges in under the span of the old bridge. Soldiers run up through the water. They are obscured in the darkness.   I gotta get out a here -- Ill pay -- I got money.   Get away from this boat.   Who's your C.O., soldier?  The Soldier ducks back and runs away.   Fuck you, you'll get what's coming to you.  Other men approach the boat. A young LIEUTENANT steps forward.   Captain Willard?   That's me.   Captain Willard -- we got these from Nha Thrang two days ago -- they expected you here then --  He hands up a plastic bag, maximum security markings, Willard takes it.    You don't know how happy that makes me, sir.   Why?   Now I can get out a here -- if I can find a way out.   We'll be needing some supplies and fuel -- do you know anybody who can give me a hand?   I'd just clear out as soon as I could if I were you, sir. They're gonna start working on the bridge with torches again. Charlie will start throwing it in hard --   What is this bridge?   It's of strategic importance for keeping the highway into Bat Shan open -- the generals don't like to admit that Bat Shan is surrounded.  He points to the men getting ready to work.    Every night we build it and by 0800 they've blown it up -- it and a lot of good men -- But the generals like to say the road is open -- ha ! Nobody uses that road except Charlie.  He turns and splashes off into the darkness.    This is the cesspool of hell.   Incoming.  SHELLS WHISTLE OVER and CRASH into the bridge -- MEN SCREAM in the distance -- the EXPLOSIONS are thunderous.    All right -- Lance, go with the Captain an' see what you can scrounge --  Willard climbs out with Lance.    Better make it fast, sir -- we don't really need much anyway.  Willard nods and they scurry off the bank under the bridge.     They dash up the embankment and along the barbed wire on the edge of the road. SHELLS SCREAM overhead, they don't know where to run.   Straight ahead, son of a bitch.  They dive towards the voice.     They dive in, a SOLDIER is crounched in f.g. holding his buddy who is crying uncontrollably.   You came right to it, son of a bitch --   Son of a bitch, sir.  The Soldier doesn't respond.    Where's your chief supply officer?   Beverly Hills --   What?   Straight up the road -- a concrete bunker -- Beverly Hills -- where else you think he'd be?   C'mon --  There is an apparent lull and they dash out along the road. Suddenly to their right an M-60 STARTS OPENING UP from a sandbagged emplacement.   Get your asses down, buddy.  They drop and crawl to the slit trench and run up to the emplacement. Several SOLDIERS man a M-60. One has a sniper rifle -- another tries to spot for the Gunner. Willard and Lance edge up along the trench. Willard trips.   Watch your feet, asshole --  Willard looks down.    You stepped on my face.   We thought you were dead.   The whole world loves a smart ass.  They move ahead more carefully. The Gunner BLASTS away into the night, there is a pile of brass cases about three feet high next to him. Finally he stops swearing to himself.   What're you shooting at, soldier?   Gooks.  He turns and sees it's an officer.    Im sorry, sir.   It's all right, sergeant -- what's out there?   They were tryin' to cut through the wire -- I got 'em all I think.   Oh yeah -- listen.  There is a low moaning SCREAM from out in the wire -- it stops for aminute then continues hideously.   He's trying to call his friends -- send up a flare.  The Spotter does, it arcs up, then bathes them in eerie light. The Gunner FIRES a long BURST.   Those are all dead, stupid, he's obviously underneath 'em --  They think about this as the flare goes out. The SCREAMING gets more intense.   Wake up the Roach.  The Spotter moves down to where a tall lanky SOLDIER is leaned up against the trench. He kicks him hard several times. Roach wakes and just looks up. On his helmet are the words: \"GOD BLESS DOW.\"   Yeah, man.   Slope in the wire -- hear him.  He listens, he does, he nods.    Bust him.  Roach gets up somewhat annoyed but very cool. He saunters up the machine gun dragging his M-79 which has paisley designs all over it.   Hear him?   Sure , yeah.   You need a flare --   No, its cool.  He opens the breech of his shotgun-like weapon and plunks the big slug into it. He snaps it closed then rests it across his forearm over the trench -- he listens to the SCREAM, calculating.    He's close -- real close.  He adjusts his sights so that the gun is aimed high into the air. He listens again then FIRES. The GRENADE WHISTLES off into the night. There is a sharp EXPLOSION that cuts off the scream. Then the THUD of bodies or pieces of bodies coming down around them.    Muhhh Fuhhh ...  He staggers back down the trench to go to sleep.     They stand in the shallows waiting for Willard and Lance. Clean is nervous, he constantly checks his M-16. SHELLS WHISTLE by and CRASH in the distance.   Geez, I wish they'd hurry.  A SOLDIER comes up on his way with some others to start building the bridge.   Hey, buddy, that boat still runs, eh?   Yeah, it still runs.   Do me a favor buddy, please.   What is it?  He takes out a handful of crumpled envelopes.   Send these out when you get back to the world.  He puts them in Clean's hand.    It's to everyone I really knew -- the first girl I screwed -- my brother -- best friend -- I wanted to tell 'em how much I enjoyed knowing 'em -- it's been a great twenty years. I gotta let 'em know.   What're you askin' me for -- put 'em in the first helicopter comes in tomorrow.   Nobody comes in here.  He points up at the mountain ridges.    The N.V.A. 312th -- over there the 307th -- on that hill we counted fourteen different guns in one minute -- they got rockets mortars, snipers in those trees, there's a million of those shitty little bastards out there -- we're all gonna die.  He grabs Clean and looks at him with a maniacal urgency.    I'm gonna be dead.  Clean takes the letters.    You got a chance in that boat -- by morning you could be five miles down the river.   We ain't goin' down the river.  The Soldier looks at him as if he is joking.    What's up river from here anyhow --  The Soldier doesn't answer, just stares dumbfounded.   Spooky.   Charlie?   No, it'd be spooky without the war -- give 'em back.  He takes the letters and leaves, somewhat disappointed and disgusted. Willard and Lance come back down the beach carrying some belts of ammunition and a couple of extra M-16's.   Wow, you must a found the C.O., eh?   We found some bodies -- let's get out a here.     They edge through the shallows as the men light up their welding torches to start work on the pontoon bridge -- then pull away and accelerate fast.     The Chief is at the helm --  they all look back in the distance where the bridge was -- the hills flash with artillery discharges -- there is a fiery glow from the bridge area and the CONCUSSION of heavy EXPLOSIONS.       The boat moves uneasily upriver, through this tropical downpour. Mr. Clean is in thef.g., oiling and cleaning his 50-cal, his M-11 and M-79 -- the rest of the crew are forward, taking shelter from the rain under the canvas canopy. Clean works methodically under an umbrella he was set up by leaning the surfboard against gun mount.     The river is moving fast against them. all manner of de- bris; tree trunks, sweeping by the P.B.R.    I can't see a fucking thing.  There is a loud CRACKING SOUND, as one of the pieces of tree- trunk whacks the hull, and bounces off. Willard climbs forward, and looks down.    We hit a big enough one this hull will shatter like a Corvette. Fucking plastic boat.  Willard practically hangs off forward with a long pole, warding off the big debris moving toward the P.B.R. Clean joins him, helping.    What about ducking into one of those tributaries till this river slows down?   Who knows what's up there?   Can't be any worse than this. What do you think?   I think this river wants to take us home fast. I'm practically goin' in reverse.  Willard points his pole in the direction of the mouth of a tributary.   Well, get in there.   This whole area is lousy with V.C. -- We don't stand a chance. Lemme turn around and we'll be in Hau Fat in six minutes.  There is a really loud WHACK against the hull. willard really mad, throws the pole at the Chief, who ducks.   Get in there !   This is my crew and my fucking boat, and I'm the responsible party.   Get in there now or I'll bury you in this river.  It's clear that Willard will kill the Chief if he doesn't do as he says.   (finally relents,   turns the helm You're fucking crazy. You're going to get us all killed.  The P.B.R. navigates through the rush and into the mouth of the tributary.       Rain is pouring down, but the P.B.R. is slowed down to a snail's pace by Hyacinths, literally across the waterway.  Willard, Chef and Clean in the water, cutting through them with machetes.     having climbed to the highest point of the cockpit.   It breaks through in about twenty feet.     cutting through. he looks to Chef, who has stopped cut- ting, and is staring into the jungle.   What do you see?   I don't know.  He looks out -- the jungle at this point is very dark and high -- totally impenetrable.   Keep cutting.  They work feverishly, knowing something is wrong.     cutting with all he's got.   I know it sounds stupid, but I feel like the goddamn jungle's watching us.   Probably is.   Whatdoya think it thinks.   That we're dumber than we look.  Chef stops again, looks hard, trying to penetrate the darkness and from the very depth of it -- the darkness of it, comes a stream of tracers, lazily arching out at them. It whips between them -- the SOUND FOLLOWING much later.  Other BULLETS SMASH through and ricochet off the deck fittings. GLASS SHATTERS, and a huge hunk of paint is removed from the armor shield by a 20 mm cannon.   Lance -- 'bout twenty meters starboard.  Lance leaps down to his position. Willard, Clean and Chef cut feverishly, as the trapped boat struggles to get free.   There in the trees !  Everything is confusion -- yelling -- GUNFIRE -- the THUD of heavy BULLETS ripping inti the P.B.R.'s fibreglass hull.     Lance's twin guns return the FIRE. The Chief moves to one of the heavy guns and joins Lance in returning the FIRE.     pushing, cutting. Bullets SMASH and EXPLODE around. Clean climbs onto the boat, and leaps onto a gun emplace- ment.     Nobody really knows where the erratic fire is coming from.    Elevate Lance, in the tree. No, I saw another.   Thirty meters up, Lance; I saw the fucking flash.  Lance grits his teeth, FIRING --        He BLASTS short bursts of tracers into the jungle, cutting it to salad. Suddenly more tracers from another direction -- Clean swings around -- BULLETS smash against his shield and rip chunks from the surfboard. He BLASTS a long heavy burst at the jungle -- trees crumble.   I'm ripping 'em, man, son-of-a- bitch, it's jammed, oh God, it's jammed.  Clean is riddled by MACHINE GUN FIRE.  Chief runs to Mr. Clean -- it is obvious that he is dead. He looks angrily to Willard.  Willard and Chef are practically through. Willard leaps up, as Chef finishes the last strokes. He moves toward the cockpit.   Throw me that ordnance.  Chef throws him an M-79 and several shells -- Willard opens it, jams a huge projectile and pulls himself over the edge of the cockpit.    Give me some kind a field a fire --  BULLETS rip by.    We're through.  He climbs aboard and collapses.    Oh, God --    I ain't finished ! I ain't finished !   Bring that bow ordnance into those trees.  He jams his gun up as he sees a flash and FIRES -- there is a low POP and a WHISTLE as the GRENADE arches into the jungle.     He FIRES another burst as the GRENADE EXPLODES brightly. There is another POP and WHISTLE , another BLAST. A large tree falls, just as the craft speeds up through the thin- ning growth. We HEAR strange SCREAMING from the trees and jungle, hideous MOANS and terror-filled CRIES.     He jams the throttle forward -- the boat surges ahead. Willard FIRES another GRENADE from his M-79.     The boat slams through the hyacinth growth, moving through the river, FIRING BACK at unseen enemy in the jungle.       The boat moves ahead at half speed through a wide, flat area in the river.     The men sit around, exhausted, brutalized, wounded. They look like animals, but they are relaxed, be- cause they know they're too far from the banks to be shot at.  They smoke pot and eat silently. Lance smokes a joint and looks at his gun. Splotches of paint have been blown away from the armor shield -- pieces of deck are ripped and ragged around the mount. The boat is a floating wreck.  Clean's body is being prepared in a plastic sack by Chief. All of the men are silent.  Chef comes up from below; he has been wounded in the shoulder.   There's some bad holes, man, and the cracks -- water's coming through the cracks. Food's shot to hell.   How much is left?   Less than half -- sure is a mess down there.  Chief has been silent by the body of Clean in a plastic sack.   And the grass?   Still got a lot of that stuff from Nha Trang. But we're running low on the other.  Chief pushes Clean's body into the river.     He notices something in the distance.     A light.     Willard stands up, pointing up the river.   Hey.  They all look over.    That's a light down there --   Yeah, it is.   What the hell is it?   In the middle of the jungle -- a goddamn light.     The P.B.R. approaches the distant light -- which seems to be on the dock of an overgrown plantation building.     straining to see; he uses field glasses.     Seems to be some figures standing on the dock. The figures pull back behind some drums.      Watch it !  They duck as SHOTS RING OUT from the dock, stitching the water across the P.B.R.'s bow. The crew crouches, guns trained on the dock as the boat still approaches.    They're not Cong.    We're Americans.  Another BURST, closer.   Maybe you shouldn't say we're Americans?  Willard stares at the dock and building, trying to figure it out.   Chef, try your French.  Chief hands the loud-hailer to Chef, who shrugs and shouts:   Nous sommes Americains --  Silence.    Nous ne voulon pas vous agresser.     He looks through the glasses.     Gradually, a small group appears from behind the drums on the dock.   French Nationals -- they may not be too friendly, though.     We drift closer to the dock. The Chef starts enjoying speaking French.   Nous sommes Americains -- nous sommes des amis --  There is silence as the boat drifts closer. Then:    Vous parlez Francais comme une vache espanole.    I thought it was pretty good, myself.   What'd he say?   Said I speak French like a Spanish cow.   Laisser tomber vos armes --   Put the guns straight up -- stand away from the mounts.   Do it.  They do.   Vous pouvez approcher mais doucement --   Take her in slow.     The men on the dock move forward, cautiously. They are a young man, PHILIPPE, about 25, strong and handsome, save for a scar down on the side of his face and through his left eye, which is covered by a patch. He is dressed in a tiger suit and the red beret of the French colonial para- troops. Also of the red beret are HENRY LeFEVRE, a bear- ded, dark-looking man of 35, and TRAN VAN KAC, a middle- aged half-breed slave. They all bear automatic weapons and suspicious in their eyes. As the boat pulls up to the dock, another Frenchman joins the group, obviously the head man, GASTON De MARAIS, about fifty, small and deli- cate, with a strength about him.   Hands on the heads.   I can't steer with my goddamn feet.   Hey, they speak American.   Who is the commanding officer?      I am -- I'm Captain B.L. Willard. This is Chief Warrant Officer Phillips -- it's his boat. We were shot up bad downriver and need repairs and food -- we can pay you in gold.   Philippe --  Philippe moves to another position -- Kac grabs the rope from the deck and ties it to the dock.   I'll help you with --   Do not move --  Gaston looks at the skyward pointed twin fifties admiringly.   Fifty calibers, eh, Captain --   As I said, we can pay you in gold.   Entirely unnecessary, Captain.  He puts down his gun -- the others do likewise --   We share a common enemy -- you are our guests.  I am Gaston de marais -- this is my family's plantation. It has been such for 121 years. It will be such after I die. This is my son, Philippe -- he has fought in Algeria and held the rank of Captain. And Henry LeFevre -- a sergeant; he was at Dien Bien Phu. My personal servant, Tran Van Kac ---  Then he motions to the trees. A young man in a tiger suit and three women come forward from different positions -- all wear bush clothing and bear weapons.    My youngest son -- Christian --     He carries an M-60 machine gun in his hand -- a belt of ammunition trailing off behind him.   Christian's wife -- Ann-Marie --  A tall girl, goodlooking, but severe -- she carries an     And my youngest daughter -- Claudine.     an attractive girl about eighteen. She wears a red paratrooper beret and a well-fitted bush suit. She carries an M-79 grenade launcher and plenty of ammunition.     They stand there, exhausted and amazed. Philippe yells in Vietnamese -- about a dozen native men in tiger suits, heavily armed, walk out of the trees from all around them. They look the Americans over warily and assemble at Philippe's command.   American weapons?   We took them from the dead.  Now -- I assume you want to rest, to shower. We'll attend to your repairs after dinner.   Shower.  Willard's men look at one another, dazed.   We don't want to bother you any, we --   A man of war is never bothered to aid an ally -- you will follow me, Captain.  Willard steps off -- then stops, reaches back and picks up his M-16 by the stock.   A habit of men of war, sir -- you understand.   Of course, Captain -- an unfortunate necessity.  The men are relieved. They pick up their weapons and follow.   What about the boat?   My men will keep it for you --   Yeah -- well, I'll stay with the boat.   Chief.  Come with us.  They look at each other a moment. The Chief shrugs and follows.     Gaston stops, points to a guest house off the main struc- ture which is a typical jungle plantation house, save the many sandbagged gun emplacements and barbed wire.   A suitable accomodation for your men, captain -- you will, of course, be quartered with us --  He indicates that the men should follow Philippe. The Chief is hesitant.   Go ahead --  Philippe leads them on, muttering.   Captain, this way.  Willard follows -- they walk over past the house and toward the jungle, approaching a huge crater, 100 feet across and about thirty feet deep. The bottom is filled with water and young French and Vietnamese children swim in it. On the opposite rim, sit two men and a woman with machine guns. Gaston strides up and looks down at the crater with pride.    Magnificent, eh, Captain?  Willard looks.    It is very good -- there is no current -- It is very good. I have never seen one like it in all Indochina. I was in Paris when it arrived -- do you know what might have caused --   Looks like a two thousand pound to me. Yeah, a two thousand pound bomb.   No, I've seen those in Normandy. This is much better.  My country -- my country could never originate this. Magnificent.  Gaston stands in serious admiration for this feat; Willard looks between him and this big hole in the ground in amezement.     A foreman's shower from the old plantation days. The Chief steps out of it, refreshed, though still exhausted. Lance stands there, about to step in, absolutely filthy, caked with blood. His reaction is odd; rather than just stepping into the shower, he seems almost frightened, reluctant to step in. Chef is waiting behind him.   A hot shower, hot damn.  He pushes him forward into the water. The dirt and caked mud go swirling off his face and shoulders, and he relaxes as though he suddenly remenbers what a shower is.     battered and torn -- a few of Philippe's Vietnamese guard at the boat.     A beautiful European room with tall ceilings. Still elegantly furnished, although old and decaying.  Willard sits in a comfortable chair in the corner of the room, looking out over the carpet,  the bed with its elegant spread; the wash basin; the bidet. His battle dress is black with muck, with bloodstaines and burns.  He rises from the chair and steps to a dresser above which is a large mirror. There is an album on the marble top of the dresser. He turns to a page at random.     haggard, looking down at the album.   I wondered -- how long has this room been like this; how long has the furniture been standing in these places?     Some old photographs of people standing around a car in the 20's in front of the plantation. Another picture shows a child playing by the rubber trees near the plantation.   Was it like this sixty years ago? Eighty years? But here, even eighty years is nothing.  He turns the page,  The plantation being built. Pictures of the framing, skeletal against the sky and jungle.     fascinated   It was jungle, once; and it will be jungle, again...     Onlu the very beginnings of the house; the first struc- tures. Then another picture of the jungle site where it was to be built.     He looks up and sees his own face, reflected in the garish mirror. He barely recognizes himself.     Willard looks at himself in the mirror, in this odd, out- of-time room.     TRACK DOWN the long table, covered with delicious food. The P.B.R. crew sits with others of the De Marais group. The table is headed by St. LeFevre. Chef's face lights up as he regards the wonderful European-style food.   This food is wonderful ! I can't believe the chef is a slope.  Some more?  Opposite the table, sitting next to the Chief, Lance reaches hungrily for bread and other food with his hands.    Hey -- Lance.   Huh? Oh. Um, wouldya .. wouldya pass me the Rice-a-roni, please.  And then he looks to his friends for approval.  Our VIEW REVEALS that behind a transparent silk curtain there is another, more elaborate table, where the De Marais family is dining with Willard. Our VIEW MOVES through the curtain and settles in a MEDIUM VIEW of the group.  The men rise as a very attractive woman enters the room. Willard finally does as well, and she moves to the chair next to him.   Roxanne, I hope you are feeling better.   Je vais bien maintenant.   May I present Captain Willard? He is of a paratroop regiment. You know the difference between a paratrooper and a regular soldier, don't you , my dear?   (smiling and taking   Willard's hand Yes, they come from the sky.  She sits -- there's an uneasy silence.  Willard is caught with this exotic woman on one side of him, and the ongoing conversation on the other. He is forced to face toward Gaston, and drawn to look at Roxanne.   I would like to know more about the .. uh, plaque...  Philippe turns around, points to an elaborately scripted wooden plaque with various tallies on it.   Attacks repulsed, as I was saying.  This is only  for this war, Captain. Viet Cong -- 54; North Vietnamese regular forces -- 15; South Vietnamese -- 28 -- regular forces and otherwise.  Americain -- 6. Of course, they were, perhaps, mistakes, Captain.   Of course. I -- Once we make our repairs, we could send word, we could have you evacuated from here.   Captain?   You'll get blown outta here some day.   We will never 'evacuate', Captain -- this is our home. Indochina is ours; it has been so for a hundred and twenty-one years, there is something to say for that.   The Vietnamese think it's theirs -- I guess the Americans do, too.   But we civilized it. A place belongs to those who bring light to it, don't you agree.   I always thought the French came here to get the rubber.   Excuse me, I must attend to my men.  He gets up, and leaves abruptely -- followed by his wife.   May I ask where the Captain is going in his little boat?   We were going upriver when we got caught in a storm, ma'am.   Upriver? Why upriver? There is nothing there, only jungle.   Do you know that jungle?   When I was a boy, my father would take me there, to hunt. There are a few savages, but no man can live there, no white man.   What about an American named Kurtz?  There is a pause.   We have never heard of him.  Gaston rises, and takes Roxanne's hand.    Bon nuit, Roxanne -- bon nuit, Captain.  Willard turns.   Good night.  Gaston leaves. Willard and Roxanne are left alone. The servants clear the table.   You must realize, Captain -- we have lost much here -- I, my husband. Gaston -- his wife and son.   I'm sorry to hear that.    Cognac?   I should be checking on the boat.   The war will still be here tomorrow.  She walks out of the room.    I guess so.  He follows.     Roxanne sits, pouring a brandy, while Willard stands.   Do you miss your home, Captain? Have you someone there?   No. Not really.  I was discharged from the army four years ago. I went home, wasted some time, bought a Mustang Mach 1, drove it a week. Then I re-upped for another tour. No, everything I love is here.   Then you are like us.  She reaches out to him; indicating that he sit.    What will you do after the war?   I just follow my footsteps, one at a time, trying to answer the little questions and staying away from the big ones.   What's a big question?   Kurtz.  I know you've heard of him.   Yes.   What did you hear?   That strange things.. terrible things have occured around this American, Kurtz.   What things?   Gaston would never tell me. It was asubject not to be spoken of, Captain.   Yes.   Did you know -- deeper in the jungle, upriver -- there are savages?   I know.   But Captain, I mean -- cannibals.  A long pause. Then she looks at the cognac she poured for him.    What a pity, you don't drink. Since my husband died, there are so many things I must do alone.  She takes a sip.  Willard moves to the French doors, which have been left partly open to let a breeze in. He steps onto a terrace overlooking the river.     A machine gun emplacement is situated on the terrace cover- ing the front of house, from the river.    Are you warm, Captain?   The river is beautiful.  In fact, we REALIZE that he is checking the boat.     The P.B.R. is under guard by a couple of Gaston's Vietnamese.     She, thinking it romantic to talk about the river, comes up behind him.   I spend hours watching that river from my bedroom window. It fascinates me.  She moves her body close to his; and, in a moment, he is kissing her.    One eye steals another look at the P.B.R.     Two of the guards leave -- two remain, getting ready for the long night.     His hands wander over her body as she clings to him. Then she takes his hand, and leads him back into the sitting room, and up the stairs.     It is dark. She leads him into her room and closes the door. He stands there. In the center of the room is a large canopied bed with mosquito netting hanging down over it. The windows also have netting and barbed wire -- there is a .30 calibre machine gun mount in the far one. He look around. she goes over to the bed, and turns down the sheets. Then she slips out of her dress and stands there facing him.  He puts down his gun and strips off his shirt. She lays down on the bed and watches him.   I have been lonely here, Captain.  He moves to her, slipping into the bed. M-16 is leaning against the wall in his reach.       We can VIEW into the room, as Willard has silently slipped out of her bed, and is a dark sinister figure kneeling in final preparations for going out in the night.  Without a sound, he comes out to the terrace, and scales down the wall of the old building, disappearing into the darkness.     Two Vietnamese guard the P.B.R. -- suddenly, feet first, the first disappears into the thicket.     in the thicket; we realize he has just killed the man with a knife. Willard stalks the second guard and makes quick work of him with his knife. He even enjoys it. Silently, he drags the body out of sight.     The dark figure boards the boat silently. He disappears into the hold.     He lifts out several cases of supplies, working quickly, with a grace that indicates he is a man who has done his best work alone, and at night.       He sleeps soundly alone in the bed - we HEAR SOMEONE moving around in the room. He wakes suddenly -- PULL BACK TO REVEAL Roxanne combing her hair and buttoning up her blouse. She notices he is awake and smiles.   I will fix you breakfast.  He starts to get up.   I'm afraid I won't have time -- I gotta --   Whe you reach the boat you will find that half your fifty calibre stores -- a case of grenades, a mortar and two M-16's and a case of clips are being transfered to us by your order.  He stops -- seemingly stunned.   So that's it.   You may think what you wish, Captain, but I like you very much.  She turns to go.   What if I say no.   Then Philippe will have to kill all of you.  She leaves.     He walks down onto the dock. Gaston's men are transferring ammunition boxes.  Gaston is standing with Philippe, who are covering the Chief and crew with M-16's.   Two of my men deserted last night. It happens from time to time. I assume my daughter told you of our conditions.   Your daughter.   They taking half our ammo, Captain -- said it was your orders.  He pauses for a second.   That's right -- I did.  The Chief spits in the water disgustedly and starts the engines. Willard looks hard at Gaston.   I guess this is whAt men of war do -- eh?   We endure, captain -- you can blow up the house and we will live in the cellar -- destroy that and we'll dig a hole in the jungle and sleep on it. Burn the forest and we'll hide in the swamp. all the while, we do but one thing -- clean the blood off our bayonets.  Au revoir, Captain.     Willard climbs on board and it pulls away.     The BOAT ROARS out across the river. The Chief looks over at Willard. They stare at each other for a moment.   Next time we  get in a good fire fight -- I'd like to know how she was, Captain.  Willard just smiles at the Chief. he leans over and pulls up a floorboard -- the men stare in amezement; it contains the contents of all those ammo boxes.  .50 calibre; clips; grenades.   Holy shit.   What did you put in all those ammo boxes?   Rocks, sand -- those two men who deserted.   When'd you do it?   While you were sleeping.  He lets the board drop.  Willard moves to the back of the boat.     The river has narrowed and runs swifter -- the water dark and deep. The trees are higher in this area and much of the river is shaded on one side. There is no undergrowth, just the tall trees and ferms. They move ahead at half speed, alert, ready for anything.   We moved deeper and deeper into the jungle. It was very quiet there. It was like wandering on a prehistoric planet, an unknown world ... where the men thought they crawled to, I don't know. For me, we crawled toward Kurtz -- exclusively.  Willard looks out ahead and points.  They all turn their guns in that direction. We PAN TO REVEAL a small village of huts along the bank.        They pass in front of the village which is rundown and completely deserted. The huts are on stilts to avoid the flooding of the river -- they are just skeletons of what they once were.   Flood.   No -- most of 'em are still standing -- might've been disease.   I don't know -- there'd still be some sign -- it's just like the one this morning.       The canopy of trees grows taller and stretches out across the river filtering the sun. The forest itself has grown darker and more twisted with ferns and creepers. Strange birds fly out of the trees as the boat passes -- a huge snake slips along an overheading limb. The depth of the jungle is dark, ominous -- yet cool and strangely inviting.     Suddenly the river widens, the trees give way to marsh and as they emerge into the light a strange shadow falls upon the boat. It is the shadow cast by an enormous vertical tail section of a B-52 bomber thrusting out from the mud. Pieces of aluminum hang loosely from it, oxi- dizing in the sun. Creepers have already started to grow up around its heights -- the jungle is claiming it. But once under its shadow, they have passed a gateway. A gateway to paradise.  The river widens and the trees at its edge are soft and seductive. The hills beyond are purple and lush. Strange orange colored water-fowl swim lazily out of their way. The water itself is glass smooth and black as if there were no bottom. The sun is warm and the breeze gentle and laced with wild gardenians. It is indeed the most peaceful valley in all the world and each man looks upon it and has never known such a sense of peace and well- being.  Each man in his heart feels a need to stay -- his soul cries to stop -- stop their madness -- this spiral into hell.  Here is all that can be had of earth. But no hand moves. The boat drifts on its own toward a hole at the end of the clearing. A hole into the jungle from which a darkness permeats. The boat follows the river into this hole.       The skull looms in the f.g. -- the P.B.R. is pulled back about seventy yards -- Early morning mist still hangs on the water -- as it clears, we SEE another post and skulls on the opposite bank, It is strangely quiet.   -- All right, Lance --  Lance's TWIN FIFTIES split the silence as they POUR into the skulls on the opposite bank -- Suddenly there is a tremendous EXPLOSION and SECONDARY ONES from the jungle as shrapnel rips into the jungle and water from CLAYMORE MINES obviously set to cover the mound of skulls. The smoke clears.   The other one --   No -- leave it --   Why -- Charlie put it there to kill --   Thta's not Charlie's work --  There is silence.   Whoever put'em there didn't do it to kill people -- They put 'em up as signs --   Signs?   Yeah -- like keep out --  Willard motions -- the Chief accelerates -- they move ahead past the smoking mound.     The P.B.R. pushed deeper into this mysterious area. Mist swells in and around the river, as the boat moves into an obscure fog. The Chief cuts the engine, and they coast.   Toward the night of the fifth day out of Do Lung Bridge, we judged ourselves about eight miles from Kurtz' base. Everything was still, the trees, the creepers, even the brush seemed like it had been changed into some kind of stone. It was unnatural, like a trance. Not a sound could be heard. I began to think I was deaf -- then the fog came suddenly, and I was blind too.  The boat disappears in the thick fog.     We catch glimpses of him, even though we are close.   Listen.   What is it?   Listen.  They are silent. We can HEAR the most ominous SOUND COMING FROM THE BANKS. The GROANING, OR WAILING .. of    They're on the banks of the river.     Frantically, he swings the twin fifties around.   Jesus !     We can barely SEE him -- in and out of the fog.   No, Lance. Not while you can't see.     listening. The SOUND IS TERRIBLE, HORRIFYING.   Will they attack?   If they have boats ... or canoes... they'd get lost in the fog. We can't move either -- we'll end up on the shore.   God...   Sounds like hundreds of them.   Shhhhhh.  The CHORUS OF GROANS in unbearable. But it is not ahostile cahnt; or a war chant, but rather the SOUND OF HUMAN     It doesn't sound hostile -- it sounds like they've seen us coming and it sounds like -- I don't know, a funeral. I don't understand.     A glimpse of him, almost in tears. We then SEE glimpses, fog moving, of all the men on the P.B.R.       MOVING THROUGH the thinning mist. The Navy craft proceeds cautiously.   Two hours after the fog lifted, we moved slowly to a spot we thought was roughly a mile and a half below Kurtz's camp. We approached a long sand-bank stretching down the middle of the river.   Which way? Right or left?   Who knows? Right.   Looks pretty shallow.  The P.B.R. moves toard the right-most channel. Chef takes a long pole and begins sounding depth.     The men are really tense now -- Lances swivels his gun from bank to bank. Chief keeps his fingers on an M-16. Willard takes out the TOP SECRET packet he received at Do Lung. Tears it open. We MOVE IN ON him.    Upon reaching objective. Target key personnel and commence operation. Should difficulty arise from which extraction is impossible, break radio silence Com-Sec Command code Strong Arm -- indicate purgative air strike -- code -- Street Gang.  Purgative air strike ! Purgative ! They'd kill me too !  Suddenly Chef lays out flat on the bow. Hundreds and hundreds of slender sticks fly onto the P.B.R. rattling against the boat.   Shit ! Fucking arrows ! They're shooting fucking arrows at us.     looking toward the banks.     Frags of men -- naked limbs, arms, breasts, glaring eyes entangled in the dense jungle gloom. And hundreds of pathetic wooden arrows flying out toward them.     crazily zig-zagging up the river in the midst of the childish assault.   Steer her right.     arrows hitting the deck. The men open up everything they've got. Lance is FIRING the two fifties wildly.   Keep going.. keep going. They're just fucking sticks ! Chief, stay at the helm.  But Chief seems out of control -- he lets the clip of his M-16 go. Then slowly lets the rifle fall out of his hands, and falls to Willard's feet, a primitive spear having caught him right through the ribs. Willard looks down in horror.     laying at Willard's feet -- the long spear through him, bleeding onto Willard's boots. He looks up at Willard, about to say something.   A spear?  He dies.     The men are still crazily FIRING into the empty jungle long after those who attacked beat their retreat.   Stop it. <u>Stop it</u> !  Slowly he pulls his boots from under Chief. They are absolutely soaked in blood. He is stunned -- sits down and begins to unlace the bloody boots, and take them off.   Chief's dead.  Willard unlaces the other boot, and holds the bloody boot in his hand.   It was the strangest thing -- I don't know that I can explain it. Two of my men dead, and all I could think of was whether Kurtz was dead too. That's all I wanted: to see Kurtz, to hear Kurtz.  He starts to wipe the blood off the boot.    Somehow, in the middle of this ... carnival, Kurtz had grown into something -- a gifted officer; a great man. Somehow, he was the only light in this hopeless, hopeless darkness. And now I was too late -- he was probably gone, disappeared... by a grenade rolled into his tent -- or by some spear on the head. Christ, I felt like howling like those animals in the fog.     The people at Charlie's cocktail party on the boat. Some flashbulbs are going off. Some people are dancing to the MUSIC. OUR VIEW MOVES SLOWLY TOWARD Willard, on the edge of the party.   Here they are in Los Angeles. Everything is safe. There's a supermarket around the corner, the police station around the other. It would seem ridiculous to them that I was shot to hell because I had lost the privilege of listening to the mysterious Colonel Kurtz.  Of course I was wrong. He was waiting for me. Kurtz was alive and he was waiting for me.       The P.B.R. moving up the river. The men are practically in a trance now, looking at the banks of the river. They dont even make an effort to touch their weapons.     Hundreds and hundreds of Montagnard natives -- dressed in the most ornate and primitive manner: feathers, parts of birds and animals; cod-pieces -- all in body and face paint of the most savage nature. But there is a purity about them, men and boys, standing passively watching the small Navy craft flying the strange flag of red, white and blue.     The men of the crew are not the same men who began this voyage. Their manner is lifeless as though in a trance. The various decorations and paraphenelia that they have picked up along the way seem oddly relevant to the savages that stand before them. The Chef has made a hat of birdfeathers; Lance's face has been painted with mud under the eyes to block the glare of the sun. He wears certain animal skins; trinkets; some animal teeth. Their uniforms have been torn and patched throughout the difficult journey. They start to move to their gun positions.   Just stand here with me where they can see us. Do nothing.     MOVING SLOWLY TOWARD the fantastic human wall of feathers and war paint, standing on canoes across the river. The men on the crew stand in a group, their hands visibly without weapons. The natives standing across the river make no hostile gestures as they approach. They accept the small boat moving toward them with a sort of inevi- tability. The boat moves closer, approaches the wall of feathers -- which slowly and automatically gives away, in almost a ritual of birth, undulating, allowing the little boat to penetrate.     Mus on his face , the palms of some jungle vegetation protecting his head, he looks something like atribal chieftan himself. His intuition was right. He senses that they would be allowed to pass.     Hundreds of Montagnards who had been lining the river now run, absolutely silently, along the banks, keeping pace with the P.B.R. There is no hostility in these faces, only curiosity and a sort of grief.     They look up toward the bank.     The temple at NU MUNG BA, a fortified encampment, built around the ruins of a former Cambodian civilization. Stone walls, barbed wire, cracked pyramids and rows and rows of Escher-like sandbags arranged in an endless maze around the fortress.     He picks up his field glasses and looks through.     A sign entangled in the barbed wire -- its lettering strict and military:      The GLASSES POV MOVES REVEALING another sign written in a wild psychedelic hand.    The POV OF THE GLASSES MOVE once again and come upon an astonished sight, a black man dressed in a tatter of colored fabrics, feathers, and an Australian bush hat. He looks something like a multi-colored harlequin waving frantically to the P.B.R. The POV OF THE GLASSES MOVE OFF of him.     not believing what he's just seen.     Once again the young black man is now waving his Australian hat.     Willard shouts out to the starnge greeter.   We've been attacked.    I know, I know, it's all right. Come in this way. It's mined over there. This way. It's all right.  Willard look at Chef who is at the helm. He shrugs and they do as this man says. The P.B.R. moves towards the water's edge where there is a dock covered with concertina wire. The odd Australian stands waving his hat, guiding them safely in.  A thick greasy smoke hangs from fires that burn near the fort; fresh shell craters indicate a recent battle. Near the dock there is a tangled clump of corpses -- half sub- merged in the water. Other piles of bodies lie about, some of them on fire. Fire literally burns from out of the ground. Chef nods at the bodies.   Charlie?   Looks that way.    Who's he?   God knows.  The boat pulls up. The Australian harlequin hops on board; the crew regards him with their dark faces splat- tered with mud and blood.    Who the hell are you?   Moonby. Got any Winstons?   Moonby what?   Moonby, 4th battalion, Royal Australian Regiment, Task Force. Ex-Corporal Moonby, <u>deserted</u>.       (incredulously, indicating  the hundreds of natives What <u>is</u> this?   Oh, they're simple enough people. It's good to see you, baby. Nobody has any Winstons?  Chef automatically offers Moonby a Winston.   This boat's a mess.   Where's Kurtz? I want to talk to him.   Oh, you don't talk to Colonel Kurtz.  You<u> listen</u> to him. God, these are good. I kept these people off you, you know. It wasn't easy.   Why did they attack us?   Simple. They don't want him to go.   You're Australian?   Pre-Australian, actually. But I'd dig goin' to California. I'm California dreamin'.    So Kurtz is alive.   Kurtz. I tell you, that man has enlarged my mind.  He opens his arms wide, to indicate the breadth of his mind's expansion.    But lemme tell you, <u>he</u> is the most dangerous thing in every way that I've come on so far. He wanted to shoot me. The first thing he said is, 'I'm going to shoot you because you are a deserter.' I said I didn't desert from your army, I deserted from my army. He said, 'I'm going to shoot you just the same.'   Why didn't he shoot you?   I've asked myself that question. I said to myself, why didn't he shoot me? He didn't shoot me, because I had a stash like you wouldn't believe. I hid it in the jungle; the wealth of the Orient: Marijuana -- Hashish -- Opium -- cocaine -- uncut Heroin; the Gold of the Golden Triangle. and Acid -- I make Koolaid that makes purple Owsley come on like piss. Now I'm Kurtz' own Disciple -- I listen he talks. About everything ! Everything. I forgot there's such a thing as sleep. Everything. Of love, too.   Love?   Oh, no, not what you think... Cosmic love. He made me see things -- things, you know.  The whole time Moonby is chattering on, Willard has picked up his field glasses and scans the fortress.     Men in small groups, huddled over food. Now he settles on the entrance in the temple. There are stakes in front, and on top of them are horrible shrunken heads.      Sounds like he's gone crazy.   No, Colonel Kurtz couldn't be crazy -- if you heard him talk, just last week, you'd never think he was crazy.   Is that where he is? By the shrunken heads.   Those heads, yes. Well, the rebels...    We're going ashore. Tie her up -- and leave your guns up, Lance.   What?   Bring your rifles, that's all.  Take us to him.   Right on -- he's been waiting for --   And shut up.  Moonby nods and shrugs, and hops off the P.B.R. willard and the men follow.     As they proceed closer to the fortress-temple, men appear where a moment before there was only jungle.  They are mostly Montagnards, but far more savage looking than any we've seen before. They wear only loinclothes and bandoliers of ammunition. their bodies are painted in strange patterns. They carry Army M-16's, Russian AK-47's and a wide variety of knives and clubs. Women emerge from the brush as well. they are armed and equally primitive looking. Interspersed among them are a few taller men with paler skins, with the remnants of Army insignia on them. The paint on their bodies is, if anything more bizarre. We CONTINUE TO MOVE ACROSS the entire group up to the stone gates of the fort, where thirty or so more are seen silhouetted against the sky. Willard and his men look up at people more primitive and more savage than any since the time of Captain Cook.  They encounter, in the center of the group, what once appears to have been an American. he is tall, gaunt, wears a flak jacket, but is otherwise naked, save a loincloth. His face is darkened from dirt, battle smoke, strange camouflage patterns. His hair and beard are long, matted with mud and grease. He carries an AK-47 decorated with scalps and human ears. Willard approaches this beast, who seems shy and retiring.   Who are you?    His name is...   I'm not ever goin' to tell you to shut up again.  Moonby shuts up. The MAN tries to speak, but nothing comes out. He is dumbstrucked at seeing them, as they are to see him.   Colby. Exec. officer, A-Team... Special Forces. F-82 -- Col. Walter Kurtz, commanding.   What happened here?   What -- happened here.   Charlie?   NVA regulars. They're coming again tonight. Tet -- their big -- assault.  Willard is the man in the middle -- he doesn't know what to say to this man, but he understands the forces that pounded him. He takes his arm.     looks at Willard, not understanding.     Six months later, and he and Colby would be identical.   I'm taking you back.  Moonby slaps himself in the head with his hand.   Oh, no, dont say that.   Take us back. Take us back ! But, the operation -- the team. Colonel Kurtz has such plans for -- the team.   Take me to him, Major.  Colby starts, and then, seeing the shrunken heads on poles, he turns, agitated, to Willard:   I had nothing to do with these operations -- I did not do the planning -- none of us did. It was all Colonel Kurtz -- he was the genius. You'll see -- the genius of our Colonel. He should be made a General, don't you think? A General? It's...  Suddenly, frightened, he stops. Without looking Willard knows that Kurtz is standing behind him. He turns.  Kurtz has stepped out from his headquarters: He is a powerful man, though obviously very ill. He slowly attempts to pull the remnants of his uniform together, though it is ripped and bloodied, and now combined with primitive ornaments designating him a tribal chief, as well as his U.S.A. Colonel's insignia. He is feverish, with long blonde hair and beautiful features. His eyes almost hypnotize. His midsection is bandaged from what seems to be a serious wound.     This is not what he expected. He is quiet, and then, automatically, he comes to an attention.   Colonel Kurtz, I guess.   I'm Kurtz.    Captain B.L. Willard reporting his presence, sir.     looking at him a long time. Then he returns the salute, and simply:   At ease...  Sit down.     There is, of course, no chair or anything like a chair. But behind and around him, Kurtz's men begin to sit on the ground, cross-legged. Finally, Willard sits as well. Then Kurtz does.  Moonby lights a joint, and passes it respectfully to Kurtz -- throughout the scene, the joint is passed from man to man, ritualistically.    Why did you come to ... my province.   We were attacked -- down river. We need supplies and medical help.   You were not coming here, to see me?   (finding it more and  more difficult to go  on with this lie No -- no, sir.   You came up my river -- in that small boat. So simple. I always thought the final justice would come from the sky, like we did.  You are the final justice, aren't you?   What do you mean, Colonel?    What other reason could you have come? A Captain. Ranger. Paratrooper. Graduate of the Recondo School. Am I right about these things?   You know you're right.  There is a clear, incredible intelligence about this man.   Then the Agency approached you. Maybe in a bar in Quinon or Pleiku. Simple. A year's pay for one life. Perhaps a village elder, or a tax collector. Nobody's orders but your own. Exciting work.     He remains silent.     He smiles.   You've spent tome at the Royal Tracking School of Malaysia. I can tell from the way the laces on your boots are tied. I understand you, Captain. We understand each other.  There is a long pause,  as the two men regard each other. Then Willard reaches to his holstered .45 -- withdraws it, and places it on the dirt before Kurtz, as an act assuring Kurtz that he is not an assasin.   Do you know me?   Yes.  Kurtz reaches down; takes the .45 -- and without another word or gesture, shoots and kills a man.    Do you know <u>me</u> ?  He throws the .45 back on the dirt. Rises, and walks back into the cavernous headquarters behind the shrunken heads. Moonby scampers off after him, a respectful distance behind. Even Willard is stunned.   Holy shit.     Dotted with campfires; Montagnard families -- it is like a primitive civilization.     Willard is alone by a campfire -- his M-16 leans by a wall next to him. He is exhausted.  Lance sleeps by the fire, a little distance away. Chef approaches, crouches down.   Captain -- they've been probed all this week -- Cong and NVA regulars. There's gonna be a big offense any time.   I know.  Lance stirs; starts to wake up.   What are we doing here?   Kurtz. I'm supposed to kill him, just like he said.   Yeah, I can see that. He's fuckin nuts --   Yeah.   He killed that guy without feeling anything.   Not a thing.   When you kill Cong, don't you feel something.   Sure.  Recoil... I feel the recoil of my rifle.  Willard rises. Chef looks at him, confused and frightened.     Willard walks along the top of a thick wall -- sandbagged and dug out every so often for an M-60 or a mortar emplacement.  Wild looking savages man these guns, and seem to bow to Willard as he passes.   This is good -- triple overlapping fields of fire -- walls so thick ordinary artillery just cleans the moss off their surfaces.  A woman tentatively moves to Willard, bowing, and then runs off to her bunker.  WE ARE TRACKING with them as they move past the groups of people, huddled by their fires... men, women and children. Skulls, shrunken and otherwise hang from every hut -- adorn every sandbagged bunker -- dried scalps hang from barbed wire. A child is chewing on a big piece of almost raw meat.    I've done things, when I was alone in the jungle -- that I never told anyone about.  They continue past amount where the shattered wreck of half a helicopter is laying. It has been altered and fortified with sandbags and concertina wire. The wreck lays on its side so that a 7.62 mini-gun that was mounted there sticks up above the sandbags. The emplacement is built on amound so the gun commands a clear field of fire into the jungle beyond.  Some Americans, barely recognizible because of their beards and savage manner, sit near the gun. Several Montagnard children giggle at their feet and play with bayonets.   This is evil -- evil, Captain. We're all gonna die here.   Yeah, I know.   I don't get it -- You said your mission was to kill him. Let's do it, an' get our asses outta here. This  Kurtz is ruining the war; I mean, this don't look good for America !    ... he's an amazing officer.   You got to kill this sonuvabitch -- Lance and me, we don't understand none of this -- Jesus, Captain -- I don't wanna die here -- Do it quick.  Lance just stands there; his eyes vacant.. He sort of nods, sucking a joint.   Yeah. I know.  He thinks.     VIEW FROM INSIDE -- Willard approaches the stakes with the shrunken heads. Chef and Lance with him. Willard steps in -- Lance and the Chef crouch outside, waiting.     An austere stone savern in the temple: Kurtz's head- quarters. Electric lights hanging in odd contrast to the ancient stone. We SEE what is left of the maps and other military charts -- they had been tacked up on big boards, but have now fallen into decayed disuse.  There are other indications of the modern headquarters this had been. Now all those things are no longer impor- tant.  Kurtz sits alone, slumped back in a wicker chair. There is a large wooden planning table next to him, with maps, lamps and apile of debris that is practically garbage. There are native decorations to ward off evil spirits; and graffiti on the stone walls, things ranging fromm \"Viet Nam, love it or leave it\" to quotes of Nietzsche \"Nothing is true -- everything is permitted.\"  Moonby, who had been crouching in a corner, moves to Willard.   He's asleep -- don't bother him.   I'm awake.  Willard steps in closer. Kurtz looks to Moonby.    You. Get out.  Moonby hesitates -- not wanting to leave him alone with Willard.    <u>I said get the fuck out !</u>  I'm going to kill the little weirdo myself tomorrow. (he shows some pain   when moving his   midsection Hes only stayed alive this long because he's a good orderly and medic. He knows how to use a hypodermic.   You're gonna get hit tonight, bad -- a whole regiment of NVA regulars.   That's right, the little gook- pricks. But they are noble little gook-pricks, noble. Because they fight with their guts, like animals. And for an <u>idea !</u> That's rich. We fight with ingenious machines and fire, like Gods, and for nothing. But I'll call in a major blotto airstrike tonight. We'll have ourselves a helluva airstrike tonight, a lightshow. How do you like The Doors': 'C'mon Baby Light My Fire...'  Willard shrugs.    Do you?   Yeah, I like it...   I <u>love</u> it.  He rests back, grinning.   You've gone crazy.    No. My thinking is clear.  But my soul has gone mad.  Suddenly Kurtz is seized with a terrible pain from his stomach wound. He groans horribly, clutching at it. He literally falls from his chair onto the dirt floor.    My gut -- Oh, Christ, my gut !  Willard leans over him; checking the seriousness of the wound.     Lance is crouching by the stone entrance -- Chef leans in, witnessing the proceedings inside.    Kill him -- come on, why don't you kill him      Willard examining the wound.    Oh shit -- on the table; morphine.  Willard moves to the table, opens the medical packet. He takes out a morphine capsule, leans over the writhing Kurtz and injects him with the drug.   (continuing; looking   up in pain You see how stupid it would have been to blow out my brains? I'm dying from the gut anyway.  Willard quickly prepares another shot. Kurtz, truly frightened, holds up his hand.    No -- I don't want to sleep. I want to think. Water. Give me water.   You can't have water after morphine.   Still playing by the rules. (almost   affectionately You're a damn good kiler.   (still holding the   second morphine How's the pain?   How's yours?   I can handle it.   Pain is easy to handle -- but nobility.. the nobility of a man is judged by how much Truth he can handle.   What Truth?   The truth that you were sent here to murder me, ans so far you haven't done it. And do you know why?  Yes, you know why.  Your mission makes about as much sense as those idiots who sent you on it. <u>Asshole</u> ! <u>Schmuck</u> ! How long does it take you to figure out that nobody knows what they're doing here.  Except me.  He rests back. The drug is beginning to take effect.    Gimme water.   No water.   You know what you're doing? <u>You are interfering with my</u> <u>plans</u> !  He crawls in pain toward the canteen Willard watches him impassively.    This water's got Moonby's acid in it --  He drinks sloppily from the canteen, water spilling all over. Then he throws the canteen to Willard.    Drink it -- drink it for tonight. Think of it. A whole regiment of those shitty little Cong -- War. Total war -- war like you've never known it. It's beautiful -- you'll love it. Trust me.     We can SEE into the headquarters: Kurtz offers the canteen to Willard. Chef is terrified -- Lance is stoned out.   Lance -- the fucker's not gonna do it.   Goddamn -- You've gotta dig napalm on Speed, too. It's spectacular, you'll see.  Lance stands up holding his M-16, looks into the cavern with Chef.     Willard stands there, holding the morphine needle in his hand.   Look into the jungle. You can't -- it's too terrible. You have to smear yourself with warpaint to look at it -- you have to be a cannibal.  That's why warpaint was invented. Then it becomes <u>your</u> jungle.  Willard shoots himself in the arm with the morphine.   How did we get here?   Because of all the things we do, the thing we do best -- is <u>lie</u>.   I think think a lie stinks.   Oh Captain, that is so true.   Stinks. I could never figure -- (he drinks from   the canteen I could never figure how they can teach boys how to bomb villages with napalm -- and not let them write the word 'fuck' on their airplanes.  Willard drinks more of the LSD water.    You could never figure it because it doesn't make sense.   Fuck no.   I'll tell you what makes sense ! <u>Air strikes</u> ! <u>White Phosphorus</u> ! <u>Napalm</u> ! We'll bomb the shit out of them if they don't do what we want.   We'll exterminate the fuckers !  Chef steps into the Headquarters -- he is terrified. He draws his bayonet.   Captain -- kill him.   Think of it -- for years, millions of years, savages with pathetic painted faces were scared shitless that fire would rain down from the sky. And goddamn, we made it happen. <u>God</u>  <u>bless</u>  <u>Dow</u>  !   Kill him !  Chef rushes at Kurtz with his bayonet -- instinctively, Willard GUNS him -- then there is additional automatic FIRE. Chef is being riddled by bullets.     He has let loose with his M-16 at Chef, like some sort of mindless, programmed killer.    Hot damn !  Then hes tops -- Chef falls to the dirt -- there is an instant of silence, then:     The DOORS begin LIGHT MY FIRE , loud and overwhelming, as illuminating flares light up the blackness.     of enormous loudspeakers protected behind spirals of razor-sharp concertina wire. LIGHT MY FIRE is blasted out to the enemy, poised to attack.     Cannibal-painted men in savage decorations wait. Bay- onets are fixed. Men are stoned to acid, injecting speed, sniffing cocaine, eating grass, smoking hashish in water pipes. One looks up to the sky.     A rocket illuminates the sky, strobing, as in a psyche- delic hallucination.     Wow...  Another behind him is chanting the word NAPALM softly t himself.     Willard strides out of the darkness, into the positions around the gate. He looks like a magnificent warrior -- Genghis. All the men: Montagnards, fierce Americans, even the savage men of the P.B.R. crew either bow, salute or kneel before Willard. The color pulsates around the edge of the image, red and green, mauve and purple.  We SEE Lance; waiting, with his weapons -- garlands of teeth around his neck, his face painted.     Enemy ARTILLERY BLASTING away at the fortress.     A hand drops a shell and it FIRES.     It FIRES. EXPLOSIONS around the fort, red and orange and blue and green. They hit and grow, outward like some sort of cosmic flower.     Shoots out a stream of burning napalm that looks like a death ray gun, radiating outward with ice-blue energy.     blasting out music.     With the MUSIC, like those people you see listening to radios in their cars.      Shells WHISTLE in and EXPLODE on the walls in the compound. The men behind them are setting up rocket launcher  . Everywhere metal and rock and flame fly and it is beautiful to see.  Willard looks through the infra-red sniper scope.     Strange, luminescent images of North Vietnamese approach- ing the outer perimeters. Thousands of them.      Mini-gun. Colby. Sergeant. Mini-gun.     A SERGEANT in feathered head-piece and wildly painted operates the mini-gun with several native helpers. SHELLS BURST  around them. When they FIRE the SOUND is incredibly loud and steady like a high-pitched foghorn. A solid stream of molten lead seems to pour into the darkness as 7000 rounds a minute rip into the enemy. The pass of the lead reaches out in beautiful patterns as the Ser- geant sweeps the area. The sergeant laughs maniacally as the GUN resumes FIRING, right up to the moment he is blown to eternity by an all-engulfing 105mm shell.     Exhilarated, and moving with the MUSIC.   Napalm.  Colby pushes a row of plungers: Advancing NVAs il- luminated by napalm drums, phosphorescent napalm EXPLODES beautiful, like a magnificent firework.      Claymores, claymores.  The SOUND DISTORTED of tremendous HOWLING EXPLOSIONS penetrate the track of LIGHT MY FIRE one after another. Kurtz's face is illuminated by each of these. His face seems to change from one grotesgue primitive face to another, as though the whole history mankind is evolv- ing in front of us.  The SCREAMS of maimed and dismembered men almost pene- trates the INCREDIBLY LOUD MUSIC and we HEAR Kurtz's men LAUGHING and SCREAMING in delight.  Kurtz looks out over the field of slaughter.     through wires and claymore glass, each wilder and more extreme. They burn in the pools of luminescent napalm but press relentlessly on. SHELL BURSTS overhead. They chant to themselves as they advance. NVA have reached the walls and throw down scaling ladders and start up. Suddenly the sky is bright with flares which produce weird psychedelic light. Blared out at tremendous vol- ume over and above the DIN OF BATTLE is LIGHT MY FIRE.     The Americans and Montagnards stand up screaming. Spurred by MUSIC, they charge up. M-16's in both hands, blasting, kicking, bayoneting, gouging, splittin throats, biting necks, both sides collide in the utter and most horrible savagery.     standing on the wall BLASTING as bodies fall around him; he thrusts his bayonet into one attacker, removes it with a foot and stabs another. From him he takes his AK47 and BLASTS more as they come.     The VC rush his position. Willard trips a claymore that BLASTS most of them to shreads. More fill in. Lance opens up FULL AUTOMATIC . Willard and Lance move down to the nest wall, FIRING , bodies tumbling over.  Lance is caught in a CROSSFIRE and hit several times. He pulls himself up -- FIRES a final BURST and then falls under the enemy's feet.     sees this and scampers off into the jungle, muttering madly to himself.     shouting into the radio   Code -- Street Gang -- Street Gang ! Purgative air strike; Street Gang !  He turns and runs back through the compound with the receding Montagnards. SHELLS are EXPLODING everywhere. The light patterns are fantastic. Men fall, Viets break over the walls and charge. They crouch and rip into them FULL AUTOMATIC. They break the charge and continue cutting their way through the NVA masses like torches through metal.     Kurtz watches as invaders swarm through his domain. Women and children rush upon him now. Kurtz flicks some switch- es and the whole north wall EXPLODES in overwhelming FIRE. The gates are uprooted. The stone lions tumble, crushing men below. Kurtz cocks an M-16 and walks off the bunker.     watching this spectacle.     He rounds  the shadow wall.  Kurtz sees a group of Viets and rushes up and prepares a machine gun mount. They don't see him. He braces the gun at his side and steps out.    Charles !  They stagger and fall, shattered and bleeding, save one who's merely lost his weapon. Kurtz looks at him, his gun empty. He drops it and flips open the flap of his holster. The Viet soldier goes for his pistol. Kurtz beats him to the draw and bloes him into the night. He moves over to pick up the NVA light machine gun. Holding it at his hip, he stands atop one of the ruined walls and FIRES into the masses. His native men see him and rush for the chance to die beside him. They are quickly encircled by onrushing Viets and are being overrun. The machine gun jams and Kurtz grabs a rifle. When it's empty and the bayonet is off he wields it as a club.     taking swings with his rifle, standing atop the wall and battering the oncoming enemy like Davy Crockett at the Alamo.     The air strike hits with all its force. Balls and rain of fire sweeps down on the temple, the enemy, everything. It is the biggest firework show in history.  The wall Kurtz was standing on, and he falls with it. Willard sees this and makes his way toward him as the air strike continues. All around us is a spectacle of MUSIC and light and fire and overwhelming color.     following Kurtz's trail in the mud. He has crawled on all fours back into the jungle to die. He stalks Kurtz into the jungle ; moving around and cutting off the crawling Kurtz   Go away -- hide yourself.   What are you doing?   Going back  - to the jungle to die.   I'm taking you back. You can still live.   I had immense plans.   I'm gonna get you out of here.   I was on threshold of great things.  Willard slings Kurtz's bleeding body around his neck, holding his hand, dragging hom through the jungle. The spectacle continues in the b.g.     This wreck of a boat is still afloat. Willard crawls out of the jungle, carrying the dying Kurtz and manages to get him onto the boat.     The spectacle of total psychedelic war: the fortress of Nu Mung Ba.         The entire temple is devastation. Vultures by the hundreds circle overhead. There are a few survivors. Everywhere is smoke and heaps of bodies. Colby, a Sergeant, and some Montagnards sit near them.  Their eyes are red and glazed, their jaws hang slack and they tumble occasionally. They stagger away from the field of slaughter. Willard looks down and sees something. Moves over to it, kicks several bodies away and in the f.g. below is Lance, dead.  Colby stumbles over. Willard holds Lance up by his hair.   Who is he?   He was the tragedy -- the tragedy of this war.       battered, moving slowly down the river.     Colby is at helm. Kurtz lies feverish, delirious. Willard sits by him. As the boat moves, Montagnards, those left alive, come and pay their respects by the riverbanks. Colby takes an automatic weapon and FIRES it into the air. Some of the natives move in terror, frightened of him. The battle is not over.   Don't. Don't frighten them away.  Willard looks down at him.   So you understand this?  Kurtz looks up at him, past him with fury, longing in his eyes. There is a slight smile.   Do I not?     The boat moves as though naturally carried by the river.   My river... my people... my jungle... my ideas... my country...  my wife...  ... my death.   You had immense plans... immense plans...   Yes...   I'm taking you back.  Kurtz looks up to him, then an expression of overwhelming intense and hopeless terror, hopeless despair. A whisper at some image, at some vision, he cries out twice, a cry that is no more than a breath.   The horror, the horror.  We HEAR the distant SOUND of HELICOPTERS approaching. The SOUND of ROTORS in the distance. They look up, craning their eyes at the sky. Colby points.   There.  Over the jungle mountains the small formation of MEDEVAC helicopters hooping toward them.    How did they know?   They must have seen the fire.  The helicopters are closer now but high up. Two of them breaking off, spiraling in TOWARD US.   They're coming to rescue us. They're Medevac.     He stares up at the sky.    They're coming to take us back.  Copters directly overhead.    Yeah.   Colonel Kurtz, he's dead.   Yeah.  He raises his M-16 and FIRES the entire clip at the ap- proaching rescue helicopter.     It frantically pours on the power and wheels up to the sky.      Yeah.  Colby takes his rifle and joins Willard in FIRING at the retreating American helicopters.     The men in the boat FIRING AT US as we fly further into the air, the boat getting smaller and smaller.   ... Don't remember a lot about my rehabilitation... but I was sent back to the world before the fall of Saigon...     MOVING DOWN back to the pleasure boat at the Marina.  Pause. Willard is very silent.   I never answered questions about Kurtz -- I gave them a few of his unimportant papers -- but for the most part I saved everything. There were other letters, personal ones written earlier to his wife. I brought them to het. I watched the fall of Saigon on television in a bar in Alameda...     A bright clear day in a scrubbed-clean California neigh- borhood. Some kids are playing in the street.  Willard, years later, dressed as a civilian, proceeds past the lawn to the attractive home, carrying a packet under his arm. He passes a lanky, young teen-aged boy working on a motor-scooter. Willard looks at him. The boy looks back.   Hi.  Then the door opens, and KURTZ'S WIFE is standing at the door. She is still beautiful, blonde, and dressed in mourning even though she doesn't wear black. There is a sense of purity about her, though she is not young.   Come in, Captain Willard.  He enters.     Everything good and secure and desirable about America.  She stands in the center of the room, a little nervous.   Can I get anything for you?  There are pictures of Kurtz, not too many... but he is there in the various stages of his career.  Then she sits suddenly, and Willard sits by her.    Did you know him very well?   You get to know each other pretty well out there.   And you admired him?   He was a remarkable man. It was impossible not to --   Love him... Yes, it is true. That's the hard part for me... I knew him better than anyone ... I knew him best.   You knew him best.   You were his friend... You must have been, if he had given you this...  If he sent you to his home. He was the best this country had -- he was --   Yes, I know...   I'll never get over it -- But I'll always remember him...   Both of us...   Men looked up to him... (she loses herself   in a thought He died as he lived...   His death was -- yes, he died as he lived.   Were you with him, when...   Yes I was... He said his last words to me.  Pause.     A little of the madness is still with him. He knows what she will ask.   What were they?      Tell me.     remembering that incredible day moving down the river.  Our VIEW LOOSENS   Tell me what he said.   The horror ! The horror !   He spoke of you, ma'am.  He sits there looking at her.     The cocktail party is breaking up. Willard is one of the few guests left.  We MOVE FROM Willard standing alone on the deck of the boat. Moving back through the departing guests. Charlie is getting ready to leave himself. We MOVE CLOSER to Willard.       the boat floating down the river. Kurtz's body; an exhaust- ed, half-dead Colby. And HOLDING Kurtz, Willard. We HEAR THE DOORS' \"THE END\" as we present the END TITLES.           </html>",
        "Civilian": "If you're B.L. Willard, 4th Recon Group, we'd like you to come with us.   The agency.  Willard looks at the Civilian a moment, and then walks roght out toward the jeep without saying another word. The Civilian follows.     Major.   Would he remember you ?   You didn't like him.   What does that mean ?   The point is that Kurtz or somebody attacked a South Vietnamese Ranger Platoon three days ago. Last week a Recon helicopter was lost in the area -- another took heavy damage -- direct fire from their base camp.   Ours.   You can see, of course, the implications, if any of this -- even rumours leaked out.   Exactly -- you'll go up the Nung River in a Navy P.B.R. -- appear at Nu Mung Ba as if by accident, re-establish your acquintance with Colonel Kurtz, find out what's happened -- and why. Then terminate his command.   Terminate with extreme prejudice.",
        "Chief": "All right with me, I used to drive a taxi.    Willard holds on to whatever he can -- he looks very pale. Water crashes over the bow and drenches everyone. The Chief mans the wheel and the ENGINES WHINE. Lance climbs back from his position. He looks at Willard, who just stares ahead into space, swallowing.   The Delta closes off to us about ten  miles out of Hau Fat. We'll be able to pick up some supplies -- bit I think there are only two points we can draw enough water to get into the Nung River. It's all Charlie's turf from there on out.   'Bout six months ago I took a man up to Lo Mung Bridge. He was regular Army too. Shot himself in the head. I brought his body back down.   Beats me -- the sun was too much for him, or the mud. Who knows ?  Pause, looking at Willard.    Anybody see some smoke ?   Lance -- I want you to go with the Captain an' get three extra drums of fuel and maybe scrounge some more 50 caliber.   Poor bastards, have a long year to go.  The troops turn and march TOWARD US with six weeks of Advanced Infantry Training to back them up.    No shit -- what's all the activity for around here ?   Where's it gonna be ?  He points --    What cat  ?   I never heard about that.   They nail him for it bad ?   Smoke !   Yeah -- fishing village -- helicopters over there. Hueys, lots of 'em.   The draft of that river might be too shallow on the point.   Forget that extra drum -- it's too damn hot.   I saw that Colonel's Huey on the point --  Two HELICOPTERS SCREAM over FIRING ROCKETS.    Let's just get outta here.    Incoming ! Incoming -- son of a bitch.  The ROUNDS bracket the P.B.R. and line up the beach toward Willard. He stands there and doesn't move, the surfboard under his arm. The shells kick up sand. Lance has dropped. Fragments whistle by, one rips a chunk of foam and fibreglass from the rain of the board.   Lance ---   Why don't you roll us a big joint? I think the Captain'd like that.  They all look at Willard uneasily. After a suspensful pause, Willard smiles:   I'll go with you in a while -- judt hold tight awhile --   I wonder if that was the same copter.   Yeah, Chef -- go ahead -- take Lance with you --   You forgot the mangoes, didn't you?   Careful,  Captain, they've been known to charge.   What're you trying to say, Captain --   No shit -- hot damn --    Get away from this boat.    All right -- Lance, go with the Captain an' see what you can scrounge --  Willard climbs out with Lance.    Better make it fast, sir -- we don't really need much anyway.  Willard nods and they scurry off the bank under the bridge.    Wow, you must a found the C.O., eh?    I can't see a fucking thing.  There is a loud CRACKING SOUND, as one of the pieces of tree- trunk whacks the hull, and bounces off. Willard climbs forward, and looks down.    We hit a big enough one this hull will shatter like a Corvette. Fucking plastic boat.  Willard practically hangs off forward with a long pole, warding off the big debris moving toward the P.B.R. Clean joins him, helping.   Who knows what's up there?   I think this river wants to take us home fast. I'm practically goin' in reverse.  Willard points his pole in the direction of the mouth of a tributary.   This whole area is lousy with V.C. -- We don't stand a chance. Lemme turn around and we'll be in Hau Fat in six minutes.  There is a really loud WHACK against the hull. willard really mad, throws the pole at the Chief, who ducks.   This is my crew and my fucking boat, and I'm the responsible party.   (finally relents,   turns the helm You're fucking crazy. You're going to get us all killed.  The P.B.R. navigates through the rush and into the mouth of the tributary.   Lance -- 'bout twenty meters starboard.  Lance leaps down to his position. Willard, Clean and Chef cut feverishly, as the trapped boat struggles to get free.    Elevate Lance, in the tree. No, I saw another.    He jams the throttle forward -- the boat surges ahead. Willard FIRES another GRENADE from his M-79.    What the hell is it?    straining to see; he uses field glasses.     We're Americans.  Another BURST, closer.   What'd he say?   I can't steer with my goddamn feet.    What about the boat?   Yeah -- well, I'll stay with the boat.   They taking half our ammo, Captain -- said it was your orders.  He pauses for a second.    The BOAT ROARS out across the river. The Chief looks over at Willard. They stare at each other for a moment.   Next time we  get in a good fire fight -- I'd like to know how she was, Captain.  Willard just smiles at the Chief. he leans over and pulls up a floorboard -- the men stare in amezement; it contains the contents of all those ammo boxes.  .50 calibre; clips; grenades.   When'd you do it?   No -- most of 'em are still standing -- might've been disease.   -- All right, Lance --  Lance's TWIN FIFTIES split the silence as they POUR into the skulls on the opposite bank -- Suddenly there is a tremendous EXPLOSION and SECONDARY ONES from the jungle as shrapnel rips into the jungle and water from CLAYMORE MINES obviously set to cover the mound of skulls. The smoke clears.   Why -- Charlie put it there to kill --   Signs?   What is it?   They're on the banks of the river.     We can barely SEE him -- in and out of the fog.   No, Lance. Not while you can't see.    Will they attack?   Which way? Right or left?   Looks pretty shallow.  The P.B.R. moves toard the right-most channel. Chef takes a long pole and begins sounding depth.    Shit ! Fucking arrows ! They're shooting fucking arrows at us.     laying at Willard's feet -- the long spear through him, bleeding onto Willard's boots. He looks up at Willard, about to say something.   A spear?  He dies.",
        "Phillips": "",
        "Kilgore's": "",
        "Gunner": "Like a mean motherfucker, sir.  He turns to his R.T. man.   Gooks.  He turns and sees it's an officer.    Im sorry, sir.   They were tryin' to cut through the wire -- I got 'em all I think.   He's trying to call his friends -- send up a flare.  The Spotter does, it arcs up, then bathes them in eerie light. The Gunner FIRES a long BURST.   Wake up the Roach.  The Spotter moves down to where a tall lanky SOLDIER is leaned up against the trench. He kicks him hard several times. Roach wakes and just looks up. On his helmet are the words: \"GOD BLESS DOW.\"   Hear him?   You need a flare --",
        "Photojournalist": "",
        "Colonel": "Okay, Willard, sit down.  Willard sits in a chair that is set in a center of a bare concrete floor. Across from him, around steel desks and tables sit several men. The nearest one, a COLONEL puts his cigar out on the bottom of his shoe -- behind him sits a MAJOR and a seedy-looking CIVILIAN.   Have you ever seen this officer before, Captain Willard ?  He points to the Major.   This gentleman or myself ?   I believe on your last job you executed a tax collector in Kontum, is that right ?   You know much about about Special Forces; Green Berets, Captain ?   Then you can appreciate Command's concern over their -- shall we say 'erratic' methods of operation.  I have never favored elite units, Captain, including your paratroopers or whatever. Just because a man jumps out of an airplane or wears a silly hat doesn't give him any priviliges in my book -- not in this man's army.   We have Special Forces A detachments all along the Cambodian border. Two here and another one here -- twelve or fourteen Americans -- pretty much on their own; they train and motivate Montagnard natives; pick their own operations. If they need something, they call for it, and get it within reason. What we're concerned with is here.    The A detachment at Nu Mung Ba. It was originally a larger base, built up along the river in an old Cambodian fortress.  The area has been relatively quiet for the past two years -- but --    ... Captain, we know something's going on up there -- Major --  The Major looks at some papers in front of him.   About the same time -- large numbers of Montagnards of the M'Nong descent began leaving the area -- this in itself is not unusual since these people have fought with the Rhade Tribe that lived in the area for centuries. But what is unusual is that we began to find Rhade refugees too -- in the same sampans as the M'Nongs. These people aren't afraid of V.C. They've put up with war for twenty years -- but something is driving them out.   He's commanding the detachment at Nu Mung Ba.  The Colonel gets up and walks over to a tape recorder, flicks it on. The recording is first STATIC -- the AIR CONTROLLER then asks for more information on target coordinates -- it all sounds very routine, military. Then a frantic VOICE comes on, talking slurred, like someone dumb, except very fast.   What was your impression of him ?  Willard shrugs.   A lame ?   About what ?   But why ?   Well, he's killing now.   It's got to be Kurtz.",
        "Lucas": ""
    },
    "imdb_rating": "8.4",
    "description": "It is the height of the war in Vietnam, and U.S. Army Captain Willard is sent by Colonel Lucas and a General to carry out a mission that, officially, 'does not exist - nor will it ever exist'. The mission: To seek out a mysterious Green Beret Colonel, Walter Kurtz, whose army has crossed the border into Cambodia and is conducting hit-and-run missions against the Viet Cong and NVA. The army believes Kurtz has gone completely insane and Willard's job is to eliminate him. Willard, sent up the Nung River on a U.S. Navy patrol boat, discovers that his target is one of the most decorated officers in the U.S. Army. His crew meets up with surfer-type Lt-Colonel Kilgore, head of a U.S Army helicopter cavalry group which eliminates a Viet Cong outpost to provide an entry point into the Nung River. After some hair-raising encounters, in which some of his crew are killed, Willard, Lance and Chef reach Colonel Kurtz's outpost, beyond the Do Lung Bridge. Now, after becoming prisoners of Kurtz, will Willard & the others be able to fulfill their mission?Derek O'Cain",
    "name": "Apocalypse Now",
    "genres": [
        "Drama",
        "Mystery",
        "War"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZjFmNzhmZTAtMzdkMC00MTRiLTkwZjgtYmExZTMwN2U5YTRhXkEyXkFqcGdeQXVyMjI0NTA4NzA@._V1_QL75_UY281_CR1,0,190,281_.jpg"
}