{
    "filename": "Arbitrage_script.txt",
    "imdb_id": "tt1764183",
    "imdb_url": "https://www.imdb.com/title/tt1764183",
    "characters": [
        "Gavin Briar",
        "Chris Vogler",
        "Det. Mills",
        "Julie Côte",
        "James Mayfield",
        "Earl Monroe",
        "Jeffrey Greenberg",
        "Syd Felder",
        "Judge Rittenband",
        "Jimmy Grant",
        "A.D.A. Ray Deferlito",
        "Ellen Miller",
        "Robert Miller",
        "Det. Michael Bryer",
        "Brooke Miller"
    ],
    "dialogues": {
        "Gavin": "Here you go... Goldenrod - 4.17.11 3.    It makes no sense.  To sign.  No.   Did you speak to the auditors?  What if... we don't don't close this week...  Seven-thirty tonight at the Four Seasons. We'll get it straight with Mayfield then.    How was it? Goldenrod - 4.17.11 38.  The show.  The show, Julie's show?  Mayfield's here.  Sherry Netherland. Checked in about an hour ago.  No, Brooke has a friend on the executive committee who said he's taking meetings in his room... Maybe he's settling in.    How do you know that?  How am I...?   Robert, I just heard about Julie... I'm so sorry. Her Gallery called. Her mom's flying in today.  Tomorrow at nine am.    Not yet, but we'll get him... Robert, I...    Robert?  Good work.",
        "Briar": "",
        "Chris": "You're aware Congress plans to extend the audit requirements for private funds.  Well, Standard wants to prepare for it now. So I was asked to go through every one of your trading books and reconfirm their assets.  Don't worry. I put the team on different books and I left \"Old Hill\" for myself. Anyway, I'm here to tell you-- I cleared it.  The report will be issued today. Actually, I'm calling it my \"swan song.\"  Yeah, on Friday, it's a five-year clock.  Uhh.. To prevent exactly what we're doing. But honestly, there's nothing left to worry about. It's -- great.  Robert, I've run into some problems. We're doing a \"non-recommend.\"  They got compliance involved. I'm sorry.  I've gotta go.  What the fuck...?  I can't.  I can't!  It's not me!   It passed! It passed a week ago! Like I said. Everything's fine! We confirmed the money, it's all straight and done.  Because they asked me to hold it.  Mayfield.  What?",
        "Vogler": "",
        "Det.": "",
        "Mills": "Catching detective wants us to rule before he calls it.  I'm not so sure about this...  Car roll had multiple impacts, but she was here and her feet were down there.  How'd it go?  Why didn't you pick him up?  Got about fifteen calls in a three- mile. Two of `em look a little strange: got an incoming-- that's probably a local drug deal...  Collect call. About a minute and a half. Made from the Chevron station on West Lake Road.  Cellphone in Harlem. Still waiting on the address.  Let's flash him.  Mr. Grant?  NYPD Homicide, would you mind stepping into the car?  Listen, kid, we know you went out there. We ID'd your photo with your neighbor who saw you getting into your truck ten minutes after this call was made.  He was doing a little dealing a while back, but it looks like he stopped.  So far he won't budge.",
        "Julie": "Okay...    I made this for you.      Oh...  This is Robert Miller, one of our collectors. This Katrina Stanton, and Alex Stanton and their daughter Ava, who is a talented young artist.  Go -- away.       What do you want?  Where?     Are you serious?           You just come in and out whenever you want?   One damn night in a month I told you was important to me, et tu es meme pas capable d'etre la...  ...I don't want to hear about your obligations. If you cared -- YOU  No, no, no. You're here when it's convenient for you to be here. C'est pas ca l'amour. Love means  Why did you buy those paintings?  Okay, thank you for helping me get started. But if I'm gonna fail-- then let me fail!  What image?    ...Where?...  Me, too.",
        "Côte": "",
        "James": "",
        "Mayfield": "They're just getting acquainted.  You remember what it was like on our side of the fence. Everything just moves... a little slower. Plus this whole audit mess doesn't help. You know, clearing that all up...  Excuse me...?  Robert, I think we're getting off on the wrong foot...  Let's just calm down...  Your price is too high.    Four-fifty.   It's a deal.  Alright.    Yes. Goldenrod - 4.17.11 82.  What are you doing?  Are you serious?  I'll send over a draft of the press release.  Are you all right?  Six hundred. And you would've taken...?  So we made a good deal.     Speak, John.  Who authorized this?   And what did you conclude?    I think... I think... that I don't see anything wrong here.",
        "Earl": "I'll call you tomorrow if there's any news. Don't worry about anything. And don't talk to anyone else. You take care.   You're gonna have to answer that.  That's asked and answered, Mr. Deferlito.  Jimmy. Jimmy-- what was that?  Okay, now here's what...  We need a minute, Detective.  Detective, I need to talk to my client. Now if you would just please...  ...Jimmy, don't say anything else.  ...Jimmy, stop! Detective, what's going on?   Wait here.   Hello, Brent. I'm Earl Monroe. I'm executing a criminal evidence request. I need to get a look at one of your lane tapes. Brent looks over the papers, confused.  Okay, they won't release tapes without a court order, but they did give me a print out, the same kind they used at Jimmy's indictment. Earl reaches inside the folio and removes the PHOTOGRAPH he got from the toll authority. He lays it on the counter. It's from a toll camera, showing his car and license plate. Goldenrod - 4.17.11 91.  Thank you.",
        "Monroe": "",
        "Jeffrey": "Thank you, Diane.  So?  Guess what's not?  \"...working on it,\" yeah. Well, while you're doing that, lemme tell you what's not working...    That you're gonna get a signature from Mayfield, and that my hostage money and my fee are going to be sent to me promptly, say... by tomorrow?  When?    I didn't get you into this mess!  ...remember when you asked me if it was a good idea to divert half your liquid assets into a fucking copper mine? What did I tell you?    ...the fuck I can't, it's in an escrow bill with one-day call rights...  That's really not my problem, is it?",
        "Greenberg": "",
        "Syd": "Hypothetically, the situation you're describing would be involuntary manslaughter.  ...would be in a lot of trouble, especially if that person was closing a merger with a large public bank where any publicity or arrest could delay or derail the transaction. Goldenrod - 4.17.11 35.  But that's only if there was some evidence that could link him to the crime.  Very hard to collect after an explosion. The real world's different from television.  Did this person make any calls from the area?  Then they won't be able to place him there.  To confess immediately.  To put as much distance between himself and the event as possible, if possible. But let me tell you something, and I'm speaking to you as a friend now: there are about fifty things that person wouldn't have thought of. And the more time that passes, the more lies that are told, the worse it gets for him.    They're going to come to you. Goldenrod - 4.17.11 36.  An accident's not the worst trouble. If we talk to them now we can probably work it out.  Nothing good.  I did.      I called in Earl Monroe.  Civil rights attorney. You remember Crown Heights?  He's the best above 96th Street- and that doesn't make him any cheaper.  It might not be that easy. If he doesn't cooperate they're likely to indict him on obstruction.  Hard to say. With his prior... Five years, maybe ten.    This isn't productive. Goldenrod - 4.17.11 54.  We meet with Earl and we go from there. I understand that right now they don't have enough to charge you with anything.   Gentlemen, my driver will take you where you wanna go, but I cannot be a party to this conversation, so this is where I get out...  He's gonna walk.  Courts aren't for certainty, but he says he was at home, why shouldn't he be? A phone call doesn't make him a liar.  But what's baffling to me, though, despite your sentimental history together, is why you would put your family's future in this kid's hands. Goldenrod - 4.17.11 71.  Is that a good thing?  How's Ellen?  I heard something...  She met with Gil Deuchman.  Yeah. Has she mentioned anything?  It's not good... Goldenrod - 4.17.11 84.  We went to the toll authority. They said they gave the tape to the cops. I've requested our investigator go examine it at the evidence room, but honestly what's the point?  And you believe him?  What? What do you mean?  Have you lost your mind?   No, what's done is done. There's no intent to defraud. You haven't warranted any behavior. So it's just money.  At this point- I dunno, they're not gonna make it easy.... I really suggest you think about this. Goldenrod - 4.17.11 89.",
        "Felder": "",
        "Judge": "",
        "Rittenband": "Well they look a little different to me, too... Is there a reason you haven't allowed Mr. Monroe's investigator to conduct his own analysis? Goldenrod - 4.17.11 92.  ...You don't have them anymore. You're to meet him with the evidence in the next hour.  Where's the tape? Am I not speaking loud enough?  Yes?  ...Let him tell me.  Come again?  Where is it?  I'll ask you one last time, detective. Where is the tape?  Hmmm... In light of these developments, and I would think you should be very happy to hear this, with Mr. Monroe's approval I'm going to offer Mr. Deferlito the opportunity to voluntarily dismiss the indictment to save us all a bunch of embarrassment.  Further I'm going to put all charges against Mr. Grant under seal. (Bryer starts heading to  Close the door, detective, please...    ...You finessed it. I know it, and you know it. Goldenrod - 4.17.11 94.  I know who you're after. I saw all the evidence, not just the toll photo. You gotta get him the right way.",
        "Jimmy": "Who the fuck is this?  Robert?  You gonna tell me what this is?  So all you're sayin' is, you need a ride somewhere. Goldenrod - 4.17.11 30.  Because I want to be very clear about this: you called me to give you a ride. I'm giving you a ride.  Oh, no? Then where the fuck are we?  Right.  Why is anyone gonna check?  No.  No!  Well, my girl...  Man, you call up two am, what the fuck you want? She asked me where I was going.  I told her I had to run out a minute.  Is this the kinda shit you used to do to my dad?  Yes, I fucking trust her!  This is some pretty fucked up shit.  No, man, come on, I don't hear from you since the fuckin' funeral, you call me up out of the blue, using my father's name, ask me...  You wanna talk to me like that you can get the fuck outta my car and you can walk! You want that?! You wanna fuckin' walk home?!  You alright?  Jesus, man! We gotta get you to a hospital.  What if you don't make it a couple of hours?   Call me, alright, and let me know it's okay.  (can't believe it-- through the window So what you get in a bind and just call up the only nigger you know? Goldenrod - 4.17.11 33.  Yeah, alright, man. Take care of that.       Yes?  What's this about?  Am I under arrest?  Man, for what? My answers ain't gonna change.  Right. Goldenrod - 4.17.11 51.  Right.  I don't think I wanna answer any more questions.  I want to talk to my lawyer.  Well if you got all that, what the fuck you need me for, officer?  Lawyer.  All you said was you wanted a fucking ride! You didn't tell me you killed that girl!  I'm trying to put my life back together. Okay, I appreciate you helped us, but now you're pushing it too far.  Like it was your ass sitting in there? Like you know a fucking thing about how it's gonna be?  --Don't you got your own son for this? Why the hell you didn't call him?  Well I'm sorry your son's a fuckin' idiot, but that ain't my fault.  Oh, okay. So tell us then, Syd, what happens now?  Under suspicion? Motherfucker, I'm Black!  And what exactly would you like me to do about it?  Why couldn't you have just stayed?  Why not?  Somebody was hurt. Goldenrod - 4.17.11 55.  Yeah.  What's that?     Yo, yo man, pull over.  I look like a fucking snitch to you?       Where? Back to the station?  What if I say no? Goldenrod - 4.17.11 68.  Alright, man, what?  This is what you wanna talk about? I told you I ain't makin' no more statements.  Somebody cares?  Where you got that...? That's bullshit, cause I didn't do it. That's impossible.  Talk to Earl, Detective.  Who's Miller?   You don't know a Goddamn thing about my father.  You done?   Will you open the door?  Open-- OPEN THE FUCKING DOOR!   Will you -- open -- the door?  Yes. Goldenrod - 4.17.11 72.  Yes.  It was a wrong number.  No.  I'm not lying.  This is crazy.  April 11th, two thirty-three am.  D D G five five four two.  Yes.  Yes.  I can't.  No.  This is not my car in this picture. I don't know how you all did that, but this is not my car.  They're lying!  You can get the fuck outta my face. How `bout that?. Goldenrod - 4.17.11 75.  How you- How you all just gonna lie like that? Huh? How you all just gonna lie?!  That wasn't my car.  That picture was some bullshit...         You want something to drink?  Not much.  No.  What?  I was planning on Virginia, but it looks like I'm not going anymore.  You waiting for me to say something? Goldenrod - 4.17.11 85.  Yes, you did.  Yes. You said all that.  No, I did not.  I'm not lying! I took ninety-five all the Goddamn way there. I did what you said: I didn't stop. I didn't take the Triborough. I followed all your fucking instructions.  You tell me.  How'd you get so fuckin' rich again?  Hey, this is my fuckin' life, man! Earl's telling me it could be ten years? Ten fucking years! How much are ten years worth, Robert?  Look man, I told you, I ain't no fuckin snitch, but this is bad. This is real bad. Reina and I got a whole plan we're about to make happen next week!  I got money saved up; I'm buying a business.  I bought an Applebee's.  It's a fucking restaurant, man, it's a chain restaurant.  Is this really what you came here to talk about? What are you gonna do?  What situation?  Yeah but what about me? What about my situation? They showed me pictures, man; that's fucked up what you did.  And yeah, I know, all the people counting on you, whatever, but -- you told me Earl was gonna make this right. Now you know I care about you, all the things you did for us, and for my father, but Earl said they're offering me a deal, no charges at all. I walk away. They just want to know who I went to pick up. Why are you putting me in this position, man? Why are you putting me in this situation?  Alright, man, but Earl said the deal's on the table for twenty-four hours. After that, they're filing the case, and Earl says we're gonna lose.  You said take the money.  What can he offer me? Goldenrod - 4.17.11 88.  And this piece of paper makes everything okay?    Robert, look: you asked me to come meet you and I'm here, but I came because I wanted to get something straight between us: we're even.     And if I take this, then what does that say about me?  Fuck it. I'm gonna take your money and do something good with it.",
        "Grant": "",
        "Ellen": "We had to eat. The kids were starving...  Oh, here we go!  Where are you going?  Now?    It's the third one you've tried.  You look regal, and wise, and granted a little worried. What is going on? Are you afraid of this meeting?  I thought that's why you flew down there. Goldenrod - 4.17.11 15.  Now come on. It will all work out. Just follow the plan.  \"Confidence equals contract.\"  They're your words, actually.    Let's go to Ravello- the house there. We haven't been there forever..  We have to make time. We go for a year. Let's take a year and get fat and have fun and go on an adventure. I mean-- seriously-- how much money do we need?. Do you wanna be the richest guy in the cemetery? Goldenrod - 4.17.11 16.  Oh, by the way, Mary called from St. Victor's Hospital, again, she said they still haven't gotten the check yet...  The gala is Friday. Should I be selling my ring? What's going on?  It's only two million.    I do remember. But I do not remember you being so sentimental unless you were trying to change the subject.      Was it good?  Good. Don't forget to take your Lipitor in the morning...  What?  Of course I do...             What does he want?   Well, I'm late so-- I just can't deal with it right now.  Send them a thank you note, Zappos has been so generous-- Thanks, bye guys.        Did you just call my office?  Well, I don't have time right now, sorry..  Well, fine, but, make an appointment.  ...she's rail thin. She's a blond. I would not have known who she was if she hadn't come up and introduced herself to me. She looked totally different... and... (notices Brooke increasing the machine's resistance You're going straight to level six don't you think you better pace yourself a little bit?  Everything okay with you and Tom?  Are you worried about the deal closing?  You want me to guess? Brookie, come on, don't be silly, tell me what's...    Did he write the check?  Why not?  We don't lie to each other, Brooke.    What about your father's head- where he cut his head and the pain that he's hiding in his stomach and, now  For some reason that's way to complicated for me to understand, there's no money for a routine gift? Does that seem a little strange to you?  So tell me what's happening. Goldenrod - 4.17.11 79.  No. You have to do what's right for you. Not him, not me, not anyone. This is your life.    You spoke to Brooke?  No. She didn't have to.  ...you explained, did you? Did you tell her everything?  Everything?  Lift up your shirt.  Lift up -- your shirt. Goldenrod - 4.17.11 97.  Did you tell her about that?  Oh, don't treat me like an idiot. You've been sneaking off to see her for months. You don't think I know that?  I never cared, really, about your secretaries, your- gallerists, whores, whatever you wanna call them. I cared about our home. And now you have brought this to our door.  No you did what was necessary for you, Robert, for your interests.  Yes.  This isn't about your business, this is our life! Where do you think we're going tonight? Why do you think I've even tolerated this for so long?  I'm glad you find that funny.  I didn't ask you because I didn't want you to lie.  But I thought that we had an understanding. And you broke that understanding when you brought Brooke into it.  When you made Brooke complicit-- when you risked her future-- and I'm done.  Read it.  You're not following. Goldenrod - 4.17.11 99.   Okay, uhm, the police have been trying to talk me. I assume they want to know where you were that night. And you know what? I'm not gonna lie for you anymore. Not unless you sign that.  I think you'll find a way to manage. I'm sure you have all kinds of things offshore for a rainy day.    Well then... I'll have to tell them that you came home at four-thirty bruised and bleeding...  I think we call it negotiating. Goldenrod - 4.17.11 100.  You know what, it'll cause just enough trouble- the kind of trouble that you don't want-- In fact, according to my lawyer  It's enough to give them probable cause and then they can subpoena your cell phone, GPS, DNA,  And whatever else they can think of. So really Robert what you have is a choice: you can spend the next three years in court and in the tabloids or-- you can be at your business.  Just try me.    I do, but she didn't.   Then you're gonna need a warm coat.",
        "Miller": "",
        "Robert": "I'm a child of the 50's. My father welded steel for the Navy. And my mother worked at the VA.        They lived through the Depression, Pearl Harbor, and the Bomb. And they didn't think bad things might happen; they knew they would happen.  When I was a kid my favorite teacher was Mr. James. Mr. James said that world events always revolve around five things: (extending his fingers one-      This was fifth-grade econ.  But this is something we've seen over and over again, time and time again, that competition for this-- limited amount of dollars out there, can make even the best of us manic. So it's not surprising that we see these asset bubbles, but when reality sets in of course, they burst.     Quants? Derivatives structures? What was that about?  That's what you said last week. Why'd we go down there?  And did we sign?  No. We did not. Instead I fly two thousand miles for a marketing meeting... And where was Mayfield? What was this \"emergency\"? What was that about?  Why?            Hi, guys! Goldenrod - 4.17.11 5.    (to Peter, as they hug and   No, no that's okay. Where's my drink, is this mine, here?  Thank you, thank you, thank you all very much, it's such a surprise, I didn't even know it was my birthday! Goldenrod - 4.17.11 6.  What did Mark Twain say about? He said-- old age... is clearly a case of mind over matter. If you don't mind, it doesn't matter. I've done a lot of things in my life, worked very hard, but being here, looking around-- at all these shining, radiant faces, I know that my best work is right here in this room, right now... I'm deeply proud of all of you. That's the best gift your mother and I could have hoped for, so, thank you...    Although your one-track mind assures me you've got not only your mother's genes, but you've got mine, too!  Now, I'm aware that may seem uncharacteristic, but maybe it's taken me sixty years to realize what's truly important -- and it's you guys so thank you all very much.  Kids are wild.  No, no no, you should have-- I want more \"you's\" around.  Yeah, yeah yeah...  What?     Yeah... Oy. You know how I feel about that. Trash can.   Well, you gonna keep skirting around it?  My darling, you are still in your 20's. I am 60. That's a big difference in point of view.      Office.  Yeah I gotta finish up that thing.     Yeah, Gavin, it's me, uhh... When you get this -- I want you to call Chris Vogler at Fremaut, tell him I need to see him right away, okay?  Alright, I'm sorry. I'm sorry I'm late. I'm always late-- you know that-- and I'm sorry. And I'm always saying I'm sorry about being late.  It doesn't mean I wouldn't rather be here with you.  The show's gonna be beautiful.  (slight beat, then    You made this? This is amazing. One candle, thank you very...  I'm here.  Jeffrey, I told you, I'm...    What do you want me to say?  I am solving the problem. I am getting you your money and your fee. You will have them very shortly.  As soon as they sign the contract.  ...Stop it! You don't have to talk to me like that!...  You were a friend of mine!... Goldenrod - 4.17.11 13.  (stands, heading to door    ...I need the money there until they sign, Jeffrey. What if they check again?   Not your fuckin problem...          Good. Very good.     Is this too blue?  Ay, yay yay. I look old.  They haven't signed the papers.   So did I, but for some reason they're stalling. I didn't get any sleep on the plane and...  What plan is that?    Then you married an idiot.    I don't wanna be in the cemetery!  I'm taking care of it.  I've had to move some things around for the merger.   Only two million?  You remember-- Riccio's? Full meals... two bucks... all you can eat... three bucks...   I don't know what you're talking about... Goldenrod - 4.17.11 17.   Where the hell is Mayfield?    I'd love to hear about that, but... I had thought Mr. Mayfield planned to join us tonight.  I'm sorry, gentlemen, we've been here nearly two hours now. Where is Mr. Mayfield?  Detained where?    Yeah, yeah yeah.  No. What's up?  What is it?    What kind of entries?  Alright, come by about eleven tomorrow and we'll look at it then. And Brooke?  See if you can find out what happened to Mayfield.  How're they doing?  Yeah, but how are they doing?  Where's Julie?  Hey, Julie.  Oh, really? Painter?     I like the size of the paintings, I wanna talk to you about them in a second.  What? Why are you doing this?  I will take those two. And the Rubik's cube on the back wall.  Don't tell her it was me.  I mean it.      It's me.  I'm here.  I'm in your bedroom. Can you get those people out of here?  Look down the hall. Do you see me? Goldenrod - 4.17.11 24.  Okay, so I'm serious.  I thought we should talk...  ...I was working, do you understand? I'm under enormous pressure, I have obligations...  I was there! I was there! I was late, but I was there. And I'm here now.  I'm sorry.  Because I liked them.  Julie, you're not gonna fail. Why would you fail?  You know, I'm not the kinda guy who wants to throw money away but if you wanna start a business, you have to project a certain image.  Success.  The market's a disaster right now; nobody's moving anything. That's why you gotta show sales. People look at you then and they say \"Whoah, how'd she do that?\" -- and that's what they remember. Always. Goldenrod - 4.17.11 26.  Come away with me. Let's just take your car and go...  There's a place upstate. Very beautiful, on the water. We can wake up there together- just you and me. I'd like that.    Lawrence Grant.  Jimmy, it's me.  I want you to listen to me very closely...  Let's go.  It's better you don't ask.  That's correct.  No, you're not. We're not here.  We're both alseep right now. At home. Which is where you left your phone, right?  Because if anyone checks...  They're not, as long as we're not here. Anybody know you're here?  Somebody knows you're here?  But somebody knows-- you're not there.  Oh, Jesus, Jimmy...  What'd you say?  Do you trust her?  Do you trust her?  Good. So you're at home, and I'm at home. My wife gets up at five am for Pilates -- I will be there next to her, where I've been all night. And you'll do the same with yours.  Jimmy...  ...what do you want, you want money? I will give you five thousand dollars! I will give you ten thousand dollars! I'll give you whatever you fuckin'... Goldenrod - 4.17.11 32.   Listen... I'm sorry. I'm not myself. I need your help.  No, I just... have to get home... I'll deal with it in a couple of hours.  Then I don't make it.   Better we don't talk for a while.  I'm sorry, Jimmy. I really am. Just go home.            I'm fine, Glen. Go back to bed.     What?  I just went to... eat some ice cream.   Yes...  Ellen...  Do you still love me?  And such a person...  Fingerprints, DNA?  What about cell phone records?  Not from a cell phone, no.  What would you advise such a person to do?  Failing which?  Yeah.  I know.  You tell me what happens if the Standard deal does not close, and I gotta tell my investors about our real losses?  And what'd you say about the Justice Department? Depending on what they decide to arrest me on-- fraud conviction gets me twenty years?   What choice do I really have?  Of course I am aware. I gave testimony to the committee. You know this. Goldenrod - 4.17.11 37.  No. Absolutely not. That's impossible.  The audit's cleared?  You're leaving?        What?  What the fuck are you talking about?  Oh... Oh, it was fine...  He's here? Where?  He called?  You think we're dealing with a fucking idiot?  That's being issued now.  Never mind that, just find out why Mayfield hasn't called us. Goldenrod - 4.17.11 39.  Do I have to do every Goddamn thing myself? JUST FIND OUT! WILL YOU     Reconcile what?  Of course I'm listening. Okay, those trades are in the special book. They don't get audited on the same balance sheet.        Okay, I'll look into it. I promise you I'll look into it.     Give me two minutes, then send him in...  Yes, my other meeting just got here early. We'll have to pick this up later.  Brooke, we'll pick it up later, alright? Goldenrod - 4.17.11 41.         Yeah, I'm sorry to keep you waiting. You can sit there. We just heard about it. Really terrible.  Correct.  Through... I think it was a charity function. My wife and I have a foundation.  Last night, at the gallery.  No, I think I left about ten.  Home.  Yeah.  Yeah.    See her with anyone-- what do you mean?  Not that I noticed. No. No, no.  The driver?  This is awful. This is truly awful.  Actually we didn't talk about personal matters.  Well not an employee. I was an investor.  Why did I invest?  She had a great eye. She found me those Bryce Marden's there. They went up in value very quickly, and on the basis of that I agreed to fund some of the gallery.  Why would I mind?  Oh, right. Yeah. Of course. Sure, go ahead.  Mmm-hmm?  Actually I said that she wasn't an employee, but-- I think she'd just come over from Paris if I remember, and she needed a place to entertain buyers.  It was through our holding company. You seem a little confused by all this...  Alright.  But you're going to be indelicate...  Oh, okay, I get it, so why would I invest in her and help her find a place?  It's very simple, detective. I invest in people I believe in. I thought she'd do well, so I backed her, she did. It's is simple as that.  Sure.  What?   Oh, no, I just hit it on the medicine cabinet.  This morning.  Yeah. Me, too.  No problem. Goldenrod - 4.17.11 46.   Her Mom...? Service here?  Well we should pick up the expenses for that. Whatever she wants. You'll take care of that personally, for me?  You reach Mayfield?  Thanks. Appreciate your concern.  You're gonna sign him out?  The basketball player?  He's the best?  You've gotta get Jimmy out of this.  What would he be looking at?  Come on, get in.  Jimmy...  It's gonna be okay.  We've got you the best criminal lawyer--  Cause he woulda fucked it up, okay?  Your under suspicion.  I am aware of that.  I couldn't.  Because I have responsibilities. And if I stayed there, a lot of people would've been hurt.  Other people, Jimmy. I've got business troubles, you understand...? People rely on me.  Listen... I want to talk to you a second. Come here. I wanna show you something.  Now, you know, your father asked me to look after you.  Yeah, I know I messed up, alright? I'm sorry. But I do want to help you, you know that.  So I've been able to set up a situation for you.  It's a trust. In your name, assets of $2 Million dollars. Take a look at that.  What else is there?   What are you gonna do? Goldenrod - 4.17.11 56.  I don't know, Jimmy. I don't know. Are you?  Wait, wait, wait. Sorry. Just-- read it. Just take it home and read it. It's not gonna hurt you.    Yeah, put him through...  Chris...    Chris...  Chris? CHRIS! Goddamnit, Chris! Goldenrod - 4.17.11 57.  Tell me what is going on.  Tell me what's going on!  Why not?!  What do you mean it's not...?   The audit passed? What do you mean the audit passed?    They? Who's they?  Who is they?!    They're negotiating. He wants a better price.       Did we have a meeting?       You wanna sit?  I did.  Because I hoped you wouldn't.  I made a bad bet.  That's a dangerous word, Brooke.  Because we were going broke! Everything was finished. We'd have nothing.  You remember Alexanderov? Well he came to see me one day last year. He said \"Robert, we've got a great opportunity- there's a copper mine, it's in Russia, it's under- exploited- there's billions under the ground, and to get it out, all we need is a couple hundred million, you put in a hundred, we'll put in a hundred- we'll triple it all in six months.\" So, I go check it out. And the geological survey's right, friendly government. And to lock it in, you hedge it, right? Sell the copper ahead on the commodities exchange and it all works, it's fine, and you're making a fortune.  But then there's something I hadn't accounted for-- variation margin-- and that friendly Russian government all of a sudden not so friendly anymore and they're blocking the export of the copper so I gotta make it up, I gotta put the cash in to cover the hedge. But I'm not worried about it because it's still springing money, there's so much money coming out of the ground you can't believe. You can't stop it. And, yes, I'm the oracle, I've done housing, I've arb'd credit swaps, I have done it all, and yes, again, I know it's outside the charter, but it is FUCKING  Until it's not... The money's trapped. You can't get it out. Probably never will. It's like a plane crash. It just happens.  Not just happen, honey you are so naive sometimes. It HAPPENS. And like every father I pray that it doesn't HAPPEN to you, which, thanks to me, it probably won't happen to you...  Nobody's getting arrested. That's why I borrowed the money from Jeffrey. Plug the hole, I put it there for a month, they see the books are fine, I transfer the company, I pay back Jeffrey-- with interest!-- make all of our investors whole, and what's left we keep. At least we get to keep the house.  Yes.  You don't have to lie. You didn't know about it.  What did you want me to do? Did you want me to let our investors go bankrupt? Is that what you wanted? For people to get really hurt?    You are not my partner! You work for me!  That's right. You work for me! Everybody works for me! Goldenrod - 4.17.11 67.  Brooke. Brooke. Come here. Please? Please. Just, just come here. Just for a second and sit down.         You're certain?    (laughs, plays with his  She's good. Fine.  Why?  Yes...?  The estate lawyer?  Not to me.  I am so, so sorry.   No...  It's just... not fair, is it?       You keep sending people to my office to \"do business.\"  With the intricacies of my operation so that you can... not buy it?  Just coffee, please.  Fuck you. Goldenrod - 4.17.11 80.  FUCK - YOU. I'm the Oracle of Gracie Square. You came to me. I did not come to you.  No, no, no. Forget it, forget it... Forget the deal. I don't even care about the deal. No, I run a comfortable -- excuse me -- I run a THRIVING business, that has returned year-to-date 15.4% percent to our investors, or approximately $583 Million dollars from a trading operation that you don't have and that we both know that you need, or else you never would've called me in the first place. You on the other hand, you've taken a salary of 18 Million? And what have you delivered? A falling stock price of negative 14 dollars? Is that what it is? You've also lost approximately... THREE AND  ...so we issue a press release today, say there is no deal, never was a deal. You're not gonna be buying Old Hill, you're not gonna be buying Quantum- you're not gonna be buying anything; You? You're just a browser. Now, me? I'll continue to enjoy my earnings, and while I SOAR on princely wings, to my next winning enterprise, your stock drops another couple bucks on yet another - failed - acquisition - attempt. Bodes well for your tenure, doesn't it?  You have a nice day, James.  Five-fifty.  Five twenty-five. That's it. Yes or no? And if it's no, send any further communication right to my trash can.    And you're gonna have to make my son a VP.  No, no. He doesn't have to do anything, he just gets the salary, he gets the office. Both of `em on five-year employment contracts, and my lawyers draft them. Yes or no?  I'm writing the deal.   I'm serious. I'm very serious. Sign it.  I'm fine... Before I go -- how much would you have paid...?  Four seventy-five.   Yeah.  Actually, I lied. I would've taken four. Goldenrod - 4.17.11 83.  ...Anyway I will be seeing most of you at the gala tomorrow night. But as the sale's official as of this afternoon, you are now free to talk about it. Any questions?     I met his price. I just took it out of your share.  Yeah.  Well, thank you. Now go get me that fucking hospital check.    Hello.  What you got?  You got any milk?  I'll take a water.  Where are you going?  The boxes.  I told you not to take the toll.  I said \"Listen to what I have to tell you and follow my directions, listen to me closely, do the following just like I say.\"  But you took the toll anyway.  Come on, Jimmy, don't fucking lie to me...  So where'd they get the photograph from?  So, you're saying... it's a fake?  Don't be such a wiseass...    What business?  What's an Applebee's?  You bought an Applebee's in Virginia?    I told you... right now, if I were to speak, a lot of people would get hurt. Jobs, families. A lot of innocent people. Do you think you can understand that?       Alright I hear you. I'll be back with you as soon as I can. Just hang with me a little bit.     He says he didn't take the toll.   Does Standard have clawback?  Let's just say I decide to go in...  No, just listen, listen to me. If I were to surrender, now, could they roll back the deal?  Four years, you think?                    Wait. Wait. Just wait. A RAPPING noise on the window startles Syd, who rolls it down, sees Earl, and opens the door. Earl climbs inside, removing a FOLIO from his breast pocket as he talks.      Son of a bitch.  You didn't hurt anybody. You helped a lot of people. Goldenrod - 4.17.11 95.  No, it makes it easier.  No.  Okay, we're even. But just for the record though, what you did...  Was way beyond the money.        Hey, sweetie. What time you wanna get there...? I don't wanna get there too soon...   You okay? What is it?  Did she tell you that?  Yeah, I explained to Brooke that...  Yes.  What?    What do you think you know?  I did what was necessary.  For my interests?  Everything I do is for us, for this family, and now you're gonna tell me how to run my business.    What about me? What about the complaints? The unhappiness? The drinking? The shopping? The trainers? Everything! But yes, the charities, the wonderful sainted charities, you know, all the wonderful works that you do. How do you think I've paid for them?    No, I kept her out.  What is this?  \"All ownership and voting rights transfer to the Miller Charitable Foundation, to be administered by Brooke Miller?\" Did you really expect me to sign this thing?  Apparently not, no. No.  Yeah, this leaves me with nothing.    You're out of your mind. I am not signing that. I will not sign that!    You're not gonna win that one. There's no fucking way.    Fuck the DNA! I'm sick of this!    It's how it all works, Ellen. You know that.  She'll be better for it. The world is cold. Goldenrod - 4.17.11 101.",
        "Brooke": "It's your birthday, Dad, not theirs. You're spoiling them rotten.         So what was that all about?  The last time you made a speech like that we lost the Firestone bid.  You see this? Goldenrod - 4.17.11 8.  Peter's got a copy pinned up in the conference room.  Why sell our company? We make a great return, we give money to the causes we believe in...  Dad, you're not that old.      Did you get my message?  We need to sit down.  I don't want to talk about it here.    I found some strange entries in the \"Old Hill\" books.  I'm not sure yet, but there's definitely something off. Goldenrod - 4.17.11 20.  Yeah.  I cannot reconcile it...  The \"Old Hill\" Fund. Dad, are you listening to me?  Yeah, but look at the sheet! It can't be right. There's a four hundred million dollar hole here. I mean that can't be right.  ...the way that this sheet reads, half of the fund's assets are missing.  I know, it's ridiculous, and yet...  Everything alright?  Okay. And Mom wants to know about the hospital check?  Okay.       Can you explain these?  Old Hill. All the numbers you've falsified.  Get out of my way.  You're hurting my arm.  You're fired, Ben.  I just did.  83 You tell me. 83  I'll stand.  Didn't you think I'd find out?  Then why didn't you tell me? Goldenrod - 4.17.11 64.  Oh, come on. You tell me the truth now -- or I am done.  No, you committed fraud.  What would you prefer? That you cheated? That you stole money from people who trusted you? That you lied? That you lied right to my face? Why?  How. How does that happen?  Until...  Well it does not just happen.  Thanks to you, we may all be arrested.  Everybody wins?  If the company sells. If I lie for you.    What... gives you the audacity to think you can make those decisions?  No, it's illegal. It's illegal. And I am your partner.   For a moment I thought you were gonna say you were sorry.   I'm good. I wanna run.  We're fine.    (heading to pick up her  No.  No.  Issues related to the closing.  I'm not lying to you. It's complicated; you wouldn't understand.  I honestly have no idea.  Of course it's strange.       ...and to receive this prestigious award, I invite now to the stage the man who led this generous effort, and whose financial trading firm, Miller Capital, has just this morning been acquired by Standard Bank and Trust, a dedicated businessman, family man, scholar, philanthropist and all-around humanitarian, a man I am lucky to call -- my mentor, my friend -- and my father -- Mr. Robert Miller..."
    },
    "imdb_rating": "6.6",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BODU5ODYyNzM1MF5BMl5BanBnXkFtZTcwNDEwNTQwOA@@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "Robert Miller is a successful financial businessman with a loving wife and a smart daughter ready to take over the family business. Professional secrets involving illegal fraudulent activities start coming out at the same time that Robert's personal secrets take a turn for the worse and threaten to derail everything he has achieved.—napierslogs",
    "name": "Arbitrage",
    "genres": [
        "Drama",
        "Thriller"
    ]
}