{
    "filename": "Autumn-in-New-York_script.txt",
    "imdb_id": "tt0174480",
    "imdb_url": "https://www.imdb.com/title/tt0174480",
    "characters": [
        "Charlotte Fielding",
        "Dr. Sibley",
        "Sarah",
        "Simon",
        "Shannon",
        "Fakir",
        "Dr. Tom Grandy",
        "Lynn McCale",
        "John",
        "Dolly",
        "Alberto",
        "Autumn Woman #1",
        "Lisa Tyler",
        "Will Keane",
        "Netto"
    ],
    "dialogues": {
        "Charlotte": "-- and for weeks I sat by her bed and cried. I told her I loved her and I begged her not to leave me. All I could think about was what I'd lose if she died. And then one night... she was in really bad pain... I stopped thinking about myself for a second and I thought about her. I stopped crying. I said goodbye. And in less than an hour Ella was gone.  I really think it's possible to hold a person back... cry them back... from dying. That's what I did to Ella and I'll never do it to anyone else again. I hope no one ever does it to me.  Shit.  Dolly! The bulb burned out!  Dolly?  See? Surprises suck!  You guys! Let me think! Okay. Okay.  Very funny! Actually, any moment now you're gonna turn straight and fall at my feet.  He's here. And he's staring at me again.  Don't! Wait a few seconds, then go to the bathroom.  He's beautiful. And much older.  Okay, look.  Oh, shit.  Thanks.  Thanks.    Hey, Dolly, how do you know him?     Okay, bitch, I'm ready!  Oh my God, I'm so sorry! Wait. Who is this?  My friend Simon, actually. He always calls me the morning after to sort of... you know... sum everything up.  Kinda cool, kinda creepy. Anyway, you wanna speak to my grandmother?  Really? Wow. Sounds fun. Okay.  Uh-huh.  But that doesn't necessarily --  Any particular style?  A week or two.  Oh. Wow. Okay.    Really? Wow.  Yeah?  I know.  I know.  Bye.  Why don't you mark what isn't important? That way you'll save ink.  Oh, come on, just last week, you said you were on a roll. You loved it!  I think you're incredibly lucky. I'd love to be going to college.  Spoiled brats don't even ask questions like that. What do you think?   Oh, really?  Thank you.  I couldn't get a cab, so I took the subway... only it was an express and it didn't stop at --  I know... I'm so sorry... I --  I could leave and come back.  I can't. I'm soaked.  I wanted it to be a tiny poem.  Why?  Like this?    From Ella. The woman whose memorial you crashed.  Uh-huh. And the next time I saw you, you were on the cover of New York magazine. And I had to pick a place for my birthday. So...  I met Ella in the fourth grade. She was my teacher at the Little Red School House. We stayed friends after she retired. She taught me how to cook and sew... speak Italian... basically enjoy life, have fun -- that's what she was best at... even when she knew she was dying. The most important thing she did was introduce me to poetry. She believed it was the highest form of art and that everything we say and do should aspire to it.  My mom and my dad's. After they died, Dolly was so devastated she pretty much gave up on everything. It was like if something that tragic could happen, there was no way she was ever gonna care about anyone else ever again. Including herself. She wasn't a horrible parent... she didn't abuse me or anything... she just ignored me. She was more like a weird landlady than a grandmother.  For a long time I kinda thought that, too, and I made excuses for her, but now I don't. I was seven years old and I needed her and she wasn't there.  Oh, no, come on! I love this stuff! Don't you? Didn't you grow up on it?  Ancient!  Have fun!  Sort of a date.  You know him?  A major womanizer, right?  Charlotte Fielding.  Same here.  Lisa something.  Us.  God, you talk like you're a hundred and sixteen!  He asked nonchalantly.  God, it must be a relief.  To finally deliver that speech to a woman and actually have it apply to her.  No, because coincidentally I am all those things you just said. And more.  I'm a \"unique\". At least that's what my yoga teacher says. He says there are very few uniques in the world and I'm one of them.  You, on the other hand, are what he'd call a \"typical.\"  Uh-huh. And I can prove it. Want me to? Come here.  Closer.  No, come on, really close.  Perfect. Now watch very carefully.  See? You're a typical. And for what you just did, most girls my age would slap your face. Or ask to be put in a cab. Lucky for you, I'm a unique.  Boy, do you look guilty.  Didn't anyone ever teach you that it's bad manners to stare at a girl when she's eating like a pig?  Uh-oh. Here it comes.  Okay.  I know. I'm dying.  What I said. Nobody thought I'd even last this long.  I could have put off telling you, but I genuinely like you, so I wanted to be clear... you know, right from the start.  Thanks, Olivia!  A real charmer, isn't he?  How are you on Cambodian money units?  Are you okay, old man? You look kinda woozy. Is there a doctor in the house?  Hey.  Look on the bright side: if I weren't sick, there's no way we could hang out together. I'm serious. You'd be scared of hurting me and I'd be scared you were just using me for my perfect young body.  And then our friends would say we were just into each other for weird psychological reasons. You know, because I'm looking for a daddy substitute and you're looking for someone you can feel superior to so you won't have to confront how scared you are of real intimacy -- and, of course, they'd be right and eventually we'd break up. But since I'm so sick it doesn't really matter what deep-seated weirdness has brought us together because there's no way we can possibly screw each other over... or up... because that takes time. And I don't have much left.  So considering everything, don't you think we should just sort of chill out, forget I'm sick, and enjoy what we have... right now... no strings... just this... until it ends? 'Cause that's really all I have to offer.  Think about it, okay? But not too hard.  Last night was so incredibly hot. By the way -- it was my first time. And I picked you for the job. I hope you're flattered.  Really? Better put some ice on that.       So that would be a \"no.\"  What? What's wrong?  I did! I just didn't think it would take so long!  It is when you're sitting by the phone. You wanna know how I knew?  I am, but no -- it's because of my birthday wish.  I know, but I wished that whatever happened... you know, with my illness... I'd go out with a bang. Nothing heavy. No violins. No melodrama. Just fun. A total adventure!  Wow, it's getting exciting already.  \"Lord, I do fear Thou'st made the world too beautiful this year! My soul is all but out of me, -- let fall No burning leaf; prithee, let no bird call!\"  No, that would be a thing! I don't want to do any thing today. I want to do no thing all day.  Uh-huh. No thing at all.  Way out!  Both out.  Possible.  Only when I have money.  I agree, and I promise I'll let you give me something else, but not today.  Soon. But I'm warning you, it's not going to be anything material.  That's right, but we're not gonna talk about that.  Because it's my rule.  Yeah, because everybody always wants to talk about miracles, or about some genius quack-doctor, or their friend's friend who went into remission eating nothing but sunflower seeds. It's boring and pointless.  Don't start, okay? Now what I would enjoy is taking you shopping. For clothes. I'm serious. It's quality not quantity, you know.  At work you should look perfect, but in everyday life you need to delight in disorder more. Don't you know? \"A sweet disorder in the dress kindles in clothes a wantonness.\"  It was true when that poem was written three hundred years ago and it's true today. Wouldn't it be fun to look wanton occasionally?  Totally. Accessories rule. But we have to be careful. I don't want you looking too young. Nothing's worse than an old guy trying to look young.  You know what I meant.  Uh-huh.  Perfectly imperfect!  Hey, you're giving me the creeps. Just spit it out.  So I made the hat for myself? And you bought that dress for me? And you did all this just so you could sleep with me? Why? I mean, why me?  And sex seemed like the best way to do it.  Well, first of all, let me say, you have great taste because that little Dolce &amp; Gabbana was to die for.  And, second, don't ever lie to me again.  Seriously. There isn't a lie in the whole world I'd rather hear than the truth.  I thought I told you to wait right there!  Well, I hope you didn't talk to anybody!  You know what would scare me right now?  This.  Have I told you my latest motto?  If it's scary, do it.  I'm not sure that matters.  Oh my God.  You're scared, too.  Your turn.  What's the matter, old man? Can't afford a gym?  \"Counting the beats, Counting the slow heart beats, The bleeding to death of time In slow heart beats, Wakeful they lie.\"  If I could give you anything in the whole world, that's what it would be.  Poetry.  Don't come in! Don't!    Ta-da!  Don't I look just like her?  You have no idea who I am.  \"Hope is the thing with feathers that perches in the soul.\"  You dummy! Emily Dickinson! Only the greatest American female poet ever!  Uncultured swine.  Wanna bet?  When do I get to see your costume?  All right, but this is the last last one!  \"Because I could not stop for Death, He kindly stopped for me; The carriage held but just ourselves And Immortality. We slowly drove, he knew no haste, And I had put away My labor, and my leisure too, For his civility.\"  \"We passed the school where children played At wrestling in a ring; We passed the fields of grazing grain, We passed the setting sun.\"  I had no idea I was so tired.  And out. Where's Lucifer?  Lemme at 'er!  Hey, shouldn't one of your minions be doing that?  -- off to buy crack!  Seen Beelzebub around?  Uh-huh.  Shit.  You lost your horns.  Uh-huh.  Thank you.  You guessed it.  No, I was just wondering if you had sex with that woman.  No, the answer to that's pretty obvious. I meant tonight. On the roof.  That's what I was wondering. I thought, \"We're so happy he'd have no reason to do it. And if he did do it, he'd at least look guilty, wouldn't he? But he doesn't. He looks more relaxed than before the party started.\"  But then I thought, \"He's a womanizer -- that's what they say.\" Funny word, huh? Sounds like some sorta machine. \"And how do you get to be a womanizer? Obviously by sleeping with lots of different women for no good reason and being really good at lying about it.\"  Let me finish.  Anyway, there's something about being sick right here --  -- that has made me acutely aware of my heart. Nothing corny -- I mean, literally... I feel every beat. I know how sensitive it is. It reacts to everything.  If you're lying to me, I'll know it. Did you have sex with Wendy on the roof?  My God... oh my God.         You know, maybe you're right. Maybe this is the best time to end it. Because I was actually starting to love you, Wills, and that's the last thing I ever wanted.  You have?  But you said Wills and my Mom were just friends.  Why didn't he give her one?  Why did he do that?    You never talk to me! You never try to help me!  Yes! You're my family. You're supposed to take care of me.  No, that's you, Dolly! People who have given up don't listen to other people! People who want to die close off! That's not me! I wanted your help! I wanted to learn!  Anything... anything you would ever have told me, I would have listened to! I promise.  Okay, I'm chugging Scotch, gagging on smoke, and losing my hearing! Now why is this so good for me again?!       Eric! Wow!  God, long time no see! One night we show up to rent Eraserhead and you're just gone!  What's up? Ralph said you moved to Rockland County!  What does he do?  So what're you doing now?            Hey.  So worried you fell asleep. What're you doing here?  How'd you get in?  I didn't know I had a curfew.  None of your business. So what is it? What do you want?  Cowardly.  Why should I?  Let's sleep.  In the morning, we'll talk about what a gigantic asshole you are.  With Shannon and Simon and Eric.  An old friend who used to work at Blockbuster.  Talked and drank. Simon and Shannon finally went home. Eric and I hung out.  Stop. We'll talk about it tomorrow.  And I honestly think I have a right not to tell you.  You're being nosy.    Oh, come on, what's the worst that can happen? Well, I guess you could break a hip.  How come?  Not even close!    It's not! It's adult! It's revenge! And if you think it's bad not knowing what I did -- well, it's even worse knowing exactly what you did!  Do me a favor, okay? Never ask me again what happened with Eric. Just accept the fact that you'll never, ever know. And if that hurts, then think about it next time you want to cheat on somebody.  What changed?  What were you scared of?  Well, for your sake, I hope I am.  When you realize that I'm God.  Yeah. No big deal. Cramp in the old fifth shakra!  It's no big deal. I just hyperventilated. Really.      Hey.  Stoned.    You still owe me a birthday present.  Just 'cause I fainted is no excuse for you to bail on your peacock pose.  What?  I've ruined you for other women.  All part of my master plan. Do you wanna hear a story... a bedtime story?  Once upon a time, there was a woman on a ship crossing the Atlantic and her little boy got sick. Very sick. And she said whoever saves my boy's life... I'll name my next baby after them. Well, they got into port and they rushed her son to St. Vincent's hospital... to here... and they saved his life. And so the mother named her next baby Edna St. Vincent Millay. And Edna grew up to be, as I am sure you know, the second greatest female poet in American history.  You're a quick learner -- I like that about you... \"It may be, when my heart is dull, Having attained its girth, I shall not find so beautiful The meagre shapes of earth, Nor linger in the rain to mark The small of tansy through the dark.\"  I am so pretentious...  Uh-oh. Heavy, heavy...  No. No violins. I'm fine. Go home... sleep...  You never talk about my mother. Talk about her.  Everything. All I remember is that she smelled like vanilla, loved to read to me, and was really good at cutting up fruit. I couldn't believe she didn't cut her fingers off.  I've seen pictures, dummy.  Much better.  Neither can I.  Who?  Did you know she was in love with you?  Were you in love with her?  Why? Because she was the only girl in Rhode Island who wouldn't sleep with you?  Then why did you screw her best friend on Labor Day?  It's just a question.    But why're you like that? What is it? I mean, you weren't born that way.  But I want everything from you, Wills. I rely on you in every way.  So the only reason you don't dump me is because I'm sick? Because you know that it's all going to be over, anyway?  I didn't know you could sing!    You call that a rose? It looks more like a hand grenade!    Hello, Sunshine!  By the way -- where were you today?  When you called I assumed you were at the restaurant, but when I called back later, Jesus said you hadn't been in all day.  Why?  Oh, really? Sexual or professional?  Hey! How do you feel about Christmas?  I doubt it.  What trip?  I wouldn't really call that a trip.  I thought we had a deal.  Lying. You were in Ohio yesterday.  But you know I don't want that! You know I've signed papers that --  It isn't your decision!  No! I told you right from the start how I felt and you went behind my back! You lied and --  I won't give people hope when there isn't any.  Now I know why you hurt so many women. Because you always knew if you held on to one of them, you'd never let go.  When we met, I was so lonely. But I didn't even know it. I'd been alone so long.. almost forever...  But now we have each other. Oh, what would I do, Wills? What would I do if you weren't here? Where would I be?  I'll do whatever I have to! I'll tear up the papers! Whatever you want! Tell the doctor! Because... I really do want... I don't want to leave you!  Wills?!  How long was I asleep?  Wow. And I'm still tired.  What're you doing in there?  Liar!    Oh no! You didn't!  This I've gotta see!  What have I done to you?  No... I saved you for them...",
        "Fielding": "",
        "Dr.": "",
        "Sibley": "Mr. Keane? Dr. Sibley.  It's my job, sir. Please, sit down.  Now, Mr. Keane, on the phone you referred to Charlotte's condition as cancer. That isn't strictly accurate. Neuroblastoma is a soft tissue malignancy, but it isn't cancer -- although it sometimes can be just as aggressive. It's most common in children. In young adults, the condition is extremely rare. In Charlotte's case, the tumor is located in her chest. It's growing rapidly and has proved resistant to both irradiation and chemotherapy. And because of its proximity to her aorta, surgery is out of the question.  At present? Nothing.  Eventually she'll be treated for pain. In the end, surgery could become an option, but her chances of survival would be slim. Right now Charlotte's against it. She's signed a directive forbidding any sort of heroic intervention.  There's more here if you're interested, but it won't mean much to you.  Optimistically? A year.  The repeat MRI and CAT scan do show interval progression.  Yes. Yes, it has. Considerably. As for her loss of consciousness, one explanation is a disturbance in her heart's electrical function. We'll be monitoring her overnight for any arrhythmias. If we find something, we'll treat it. Unfortunately, the more likely explanation is that the tumor has begun to obstruct the outflow of her heart. If that's the case, there's little we can do. We could be speaking in terms of weeks not months.  When she returns home, we'll want her to stay active, but don't let her overexert herself. Don't stay long. She's been sedated.",
        "Sarah": "Sure, if his folks could have afforded it.    So much for that turned leaf.  \"She's young. She's hot. I'm on the verge of menopause. Why not go for it?\"  Where're the girls? I thought you were tucking them in!    Judge you? Why would I? Screw the age difference -- I like the new you! Before Charlotte came along, do you have any idea how hard it was to get you to sit down for a Happy Meal?    Yeah, what is it?",
        "Simon": "Watch carefully, everyone -- they ought to begin emerging any moment now.  Oh, darling, you know I would if I could.  Are you feeling all right? You look positively green.  How will I know him?  Really? If he's rich you might have a fight on your hands.  Leaving so soon?  Be still my beating heart. Or is that your heart?  I think what Miss Harris is trying to say, is that you've strained her credulity.  So I've been told.  It really is uncanny. I tell you, in that dress you're the spitting image of Michel Simon.  A French character actor, long dead, who was not only hideous and fat, but quite male.  That's just it! The great spiritual benefit in leaving one's room is that it reminds one of how odious it is to leave one's room!     There's one thing you don't know about Mr. Keane and his adultery and as painful as it is I feel that I should tell you!  That woman on the roof? That was no ex-girlfriend! In fact, no woman at all. It was I, Simon Loring, master of disguise! Willsy and I have moved in together!  Well, I think I speak for all of us when I say that we've heard quite enough from Dolores.  Now, correct me if I'm wrong, but I believe what you're saying is that while the end may be in sight, it has not yet arrived.  Then why exactly have you called us here?  I cut short a lunch date, Shannon's missing her low-impact aerobics class, and Dolores has delayed the start of her happy hour -- surely you must have had good reason.  It is. You could have told me all about it on the telephone.  Charlotte loathes comfortable. I never sought to bore her with comfort while she was well, why should I start now that she's sick?  It's a pose that I've cultivated. I chose it, as a sort of smoke screen, some time after attending my twentieth funeral in as many months.  It's quite all right. But, honestly, it shocks me how often you people forget. Our phone books have as many numbers crossed out as written in. So that while death is certainly as painful to us as it is to you, we do not find it nearly so... extraordinary. Don't misunderstand me. I adore Charlotte and when she dies, I would... were it not already in that state... cry my heart dry.  I've had friends who weren't expected to last till morning who lived another seven years. Another ran a marathon and died the next weekend. It's all so terribly random the way life actually works. I take nothing for granted.",
        "Shannon": "The only time he falls at your feet now is when he wants to borrow your Prada loafers.  -- and you know how bouncer's get. He's like, \"That's the worst fake I.D. I've ever seen.\" And I'm like, \"Yeah? Well, you have the worst dread- extensions!\" And then just when --  No way!  He's as old as my dad!  And so, after all that, we pay our cover, we get in, and it's totally heinous! Nothing but losers and --  What?      Why don't you sew your mouth to my butt? That way you'll stop annoying me.  God, I hate school.  Well, now I'm on the rag and I hate it.  Am I the most spoiled brat in the world or what?  That you're the most beautiful person in the entire world.  I don't believe it! I don't believe it!  Girlfriend, you are so incredibly cool!  Okay, now tell us everything! Don't leave anything out!  Excuse me! Excuse me! Sorry! Excuse me!  Look what I found!  It was such a drag! You know, having to actually start paying to rent movies!  Cool!  Whoa, I don't believe it! She hasn't laughed in like a week!  It just didn't seem real and now that it is, I hate it! It's so unfair!",
        "Fakir": "",
        "Lynn": "",
        "McCale": "",
        "John": "Easy for you to say, ya prick. Waltzin' in here like you own the joint.  So who's the new potential ex-wife? I thought you were still wastin' time with Tanya-von-What's-her-name.  Save it, pal! Don't even bother! I may not have gone to a fancy school like Bendover --  -- but when Wills Keane comps three bottles of Dom to a twenty-year-old girl, then tells me he did it 'cause he likes the kid's grandma, I smell a rat!    Is that what you think? Buddy, since we hit town, I have done nothin' but cut you slack! Every week a new woman on your arm and I didn't say a word. Why? 'Cause I figured at least they're in the right demographic. Maybe by accident you'll trip over something substantial. But this little girl? Best she could be is Miss Right's daughter!  Hey, they're bigger than you are!  Okay, then what happened?    What?    The hangman got hanged. How's it feel?  So what now?  How come?  I don't know, when you talk about her, you're not such an arrogant son of a bitch. You get all whiny and stupid. I like that.  And since I don't see you gettin' serious with any of your other victims, I figure why not spend a little time together?  I got bad news for you, brother, so are you.  Oh no, your boy made it! At ten minutes before close! All night I got a card announcing a halibut special, only I got no halibut! Now it's Sunday and I got three dozen cats lickin' their chops in the alley! Tony, I don't wanna hear it! I don't wanna hear it! I don't wanna -- MAN,  Are you familiar with the phrase, \"Mind your own god damn business?\"  No, your business is to smile, make friends, and get rich! My business is the business.  What're you doin' here, anyway? You got a girl. Go home. Carve a pumpkin.  Why not? No, seriously. Why not?  Every year. You got no imagination.  What's goin' on?  At home.  O, Ricky, chill out! You're gonna get snot in the water!  That's it -- outta the pool!  We got a volunteer!  You know, in my day, you bobbed for the apple, and, sure, maybe there was a nickel inside it and that was sweet -- but you ate the god damn apple! These little animals grab the coin and they're out the door!  Exactly my point.  The Prince of Darkness?  Yeah, he went upstairs.  Where the hell you been?  Where's Charlotte?  Who's the broad? She looks like a Holiday-Inn hooker from Ohio.  Nobody!  Last time I checked I was your best friend!  So after the party, no thank you! I call you three times -- no call back! And for six days you don't even eat at your own god damn restaurant! What am I supposed to think? Huh?! I was ready to call the morgue!  Well, you sure don't look it!  I'll tell you why it's my concern! Because I had a god damn swimming pool! An ocean view! A fabulous lemon tree hangin' right over my Jacuzzi! And I gave it up for you, brother! Back to a life of concrete and dirt and sirens just so you could get your shit together!  On my roof? You gotta be kiddin'! Not on my green chair! Tell me it wasn't on the green chair.  Oh, great. Now how am I gonna clean that?    Buddy, I hate to break it to you, but in the real world... where I live... there're only two kindsa love stories. Boy loses girl and girl loses boy. That's all there is. Somebody always gets left behind. You try to avoid that, you'll end up an old man toastin' yourself with egg nog in the mirror on Christmas Eve. You'll end up dying in your own arms.  Yeah, how come, Uncle Wills?  Where're you goin'?  But that was last month.  Now you got me curious.  You seen Celia?  The matter is I got a half-hour wait and no help up front! You got a call on Two!",
        "Dolly": "Yeah, I know, time's kicked my ass but good. Come on, Romeo, let's bury the hatchet. Give me a hug. Careful of the cocktail.  So what the hell're you doin' around here? Last I heard you were out in earthquake country blowin' the family fortune.  Good for you!  Sure, L.A.'s okay if you're a cactus or a lizard, but if you're a New Englander, your soul dries up and blows away like a god damn leaf.  So what're you doin' now? You owned some restaurants out there, didn't you?  Kids! I want you to meet an old chum of mine, the owner of this fine establishment -- Wills Keane!  And that over there's the birthday girl -- my granddaughter, Charlotte.  You bet. She got her height from her dad. But her talent's all Katie's.  Made it herself from scratch. That one, too. Honey, show 'im.  Same here.    Now, now, if you two kids can't play nice --  Well, well.  She'll be right down. She's upstairs, gildin' the lily.  Excuse the mess. My maid died fourteen years ago and it's been simply impossible to replace her. She did windows and spoke English.  Well, aren't they loverly.  Care for a cocktail?  What can I say? Time's a thief. One day you're rich as an Arab, the next you're lucky if you can afford a god damn can of pistachio nuts.  How about that, huh? That was the summer you two --  Who'd have guessed what time had in store for her, huh? Look at that smile.  Then again, time loves some people. Like you, for instance. Oh, time's just wild about you.  Just as handsome and charming as ever. And still up to the same old tricks.  First time you came to pick up Katie, you brought me flowers. Just like those. Flower the mother; then deflower the daughter. But Katie was too smart for you...    You look like your mom is all.  Well, if it ain't the Belle of Amherst.  Seen that face before.  And for the same god damn reason.  Sure, but she was nuts about him. The only reason she didn't sleep with him is 'cause she was sentimental. And smart. She wanted a ring first.  'Cause he knocked up little Millie Tyler instead. In Newport. At Bailey's Beach. During the Labor Day clam bake.  Millie was your mom's best friend from Nightingale. You had to hand it to him. He sure knew how to make a point.  Aw, who the hell knows? 'Cause the moon was full. 'Cause life's short. 'Cause he's Wills Keane. I'll tell you a little secret -- after that, your Mom hated his guts, but your dad never made her smile like he did. 'Course your dad never made her cry like that either.  Oh, I dunno...  Christ, look at me. I'm gonna tell you what to do?  Aw, you wouldn't listen. That's the thing about people -- they just do what they want from the day they're born till the day they die.    Fare is what you pay on the train to Jersey. Fair is the place that smells like manure where, if you're real lucky, you win a blue ribbon for your home-made pickles. Fair is a sky without a cloud and a face with a mark. Fare is food. What fair isn't is everything else.",
        "Alberto": "",
        "Lisa": "The C-list?  Why do you say that?  I had to come. I work at the Met. What's your excuse?  With Wills Keane, right?  Just by reputation.  That's what they say. I'm Lisa.  Anyway, I should keep mingling. But it was nice to meet you.  Sorry to disappoint you.  Well, I didn't expect you to show up at my job.  My boss thought you were a stalker.  But you did.  So you got my letter. What'd you do? Freak out? Burn it?  I was just blowing off some steam, okay? I think I have the right.    Thanks. Anyway, I guess it made me want to meet you. I've been a little sentimental about parent-hood.  In a lousy absentee sorta way, sure.  Great. Nuts. She moved to Costa Rica last summer.  A guy, what else? He owns a charter airline and wears sunglasses indoors. I think he might be a gunrunner.  You know, you're much better looking in person than in photographs. I always assumed Mom was exaggerating, but she wasn't.  Anyway... I should go...  I really just wanted to meet you and... maybe... I don't know...  Nothing earth-shattering. Maybe just to hear you say you were sorry.  Okay. Thanks.  Before... when you came in... who did you think I was?  You must like her an awful lot.  What is it?  I'd be happy to do it.  Dad, I'm really sorry she's sick.     I've got him!  His name's Tom Grandy. Harvard undergrad. Columbia Medical School. He's at the Cleveland Clinic. I know, I know. But don't laugh. It's one of the best in the world.  He did his residency at the Brigham in Boston... his cardiac surgery training at Cleveland.  He was so good they kept him on and within three years he was chief of the program.  He travels a lot. Spends lots of time lecturing. I got you an appointment tomorrow at twelve-thirty. Don't be late. He only has fifteen minutes.  The surgeon that recommended him said, and these are his words not mine, \"Don't let his appearance fool you. He's brilliant and has balls the size of your head.\"  Actually, to be honest, Peter's more than a little freaked. I mean, how could he not be? He's twenty-six. His first child. A baby girl, no less. Nothing really prepares you for it.  He said it's the first time since we got married that he's actually realized what marriage is. That it's forever. That he can't just pick up and run away to Nepal or something if we have a fight. That he's part of the cycle of things now. That he's gonna die some day. That it's the next generation's turn to take the stage.  So what about you, Mr. Keane? You ready to be a grandpa?",
        "Tyler": "",
        "Will": "-- and I could have waited to tell you, but I wanted to leave no room for misunderstanding.  Yes, I do.  The minute I laid eyes on you. It's the saddest thing about getting older. You know people so quickly. I even knew you'd end up hating me.    That she's just a kid.      But I thought you loved it.    No, it won't. Because it takes at least a few weeks to get fat and by then you won't even be speaking to me.  Because we have no future. All I can offer you is this... what we have right now... nothing more meaningful... until it ends.  I could have waited to tell you, but I wanted to leave no room for misunderstanding.  We certainly will. Table seven, Jesus, if it's available.  How are you, Melissa?  Good evening, Celia. And how --  I'll be right with you.  How's it going?  The house specialty.  We wisely agreed to cut our losses.  In what way?  I assure you it's an absolutely painless procedure.  Sure. Especially for me.  Actually, I appreciate your concern, Celia. The truth is I'm a little worried myself.  Seriously. I've been trying to do better. But... you know how it is... old habits die hard.  Nope. In fact, John's been looking for an assistant. Tell him you've just been promoted.  I'm sorry, do I --  My God, it is.  Actually, I doubled it.  It only took me twenty years to come to my senses.  Not Katie and Jay's daughter?  Impressive.  I think we can do better than that.  Happy birthday, Charlotte.  I'll let you get back to your celebration. A pleasure to see you again.     For what?  Wills Keane.  Who did you think it was?  And how would you sum it up, Charlotte? Turning twenty.    I called because I'm going to be attending a benefit... a black-and- white ball.... and I'd like you to design a hat... for my date.  It's a gift. I don't have her measurements, but she's about your size. What're you, a six?  Good -- then let's assume your hat size is also the same.  It's a risk we'll just have to take.  Her dress is a sheath... sleeveless, black. The hat must, of course, be black or white or both.    You have till Thursday. I'll need it here by seven o'clock. I'm at the Pembroke on Central Park West and 76th.  What's your fee?  How's five hundred dollars?  Charlotte?  You say \"wow\" a lot.  It has to stop. You're a woman now.  Bye.  What do you mean?  Thank you, no, I'm fine.          There wouldn't be much point in lying to you, would there?           What happened?  You realize, don't you, that you're a full eighteen minutes late?  Charlotte, relax. What's the point of being a beautiful young woman if it isn't to keep your admirers waiting? In fact, you disappoint me: I was looking forward to at least another half hour of suspense.  Nope, too late. Anyway, I want to see the hat.  Try it on.  It's all right.  It's perfect. It's like a tiny sculpture.  If only I had some use for it. My date canceled a few hours ago.  I don't know. She was vague. Would you... like to come in her place?  The outfit I bought her is hanging in the guest room closet.    Nonsense. You're very good. Where did you learn?  So you did see me there.  It sounds as though, in a way, she took your mom's place...  I'm sure she did the best she could.  I remember when I heard the news about your parents. You know how after a crash they print a long list of names in the newspaper? Well, I grew up outside Boston, so I naturally started to scan the list. But casually, not expecting to --  How old do you think I am?  I have no idea what to do!  Who was that?       That's usually how I feel. But not tonight. Tonight I feel sixteen... just sixteen... and three-quarters.  Champagne?  You see, Charlotte, the way you know you're getting older is that you start to notice patterns. People start falling into types. Pretty soon you know a person before you've even been introduced. And if it's a woman, before the romance even starts, a whisper in your head tells you exactly what it is and how long it's going to last. And the saddest, the most tedious, part of all is that that little voice is almost always right. Now, what I like about you -- and I think that's actually what inspired this little lecture -- is that I find you completely unprecedented... and, therefore, wholly unpredictable.    Now wait a minute.  Well, he's a wise man.  Oh, really?             Listen --  That's right, because, look, I could put this off, but I genuinely like you. So I want to be clear... right now... from the start, so there's no chance for misunderstanding later.  What I want to say you is.... well... that all I can offer you is this... what we have right now... nothing more substantial... just this... until it ends.  The truth is, we have no future together.  What... what do you mean?  Thank you so much for taking the time.  So then what treatment is she getting?  How long?  Not much. I took her home and she pointed out an irony -- that fate was now offering us the very same thing that just this morning I'd told her was all I could offer her: a relationship with no future.  She's not a kid! That's what I've been trying to tell you. Nothing's lost on her. I'm the kid. She... I don't know what the hell she is... But I do know what she was.  A virgin.  I had no idea. That's the only reason she had her party here, so she could lure me into doing the honors.  I know.  Embarrassing.  I end it.  What, you're endorsing this now?  Thanks.  Because she's dying.  For you.  No, thanks.  I know.  What do you mean?  Dolly, look --  What do you mean, you knew?  Two days is long?  You're psychic?  But we hadn't even been introduced yet.   We could go to a museum.  Nothing at all?  So a movie is out.  Ice cream at the Plaza? High tea at the Palace?  What about shopping?  It's not a thing?  But all I gave you was champagne. That's not a proper birthday present.  When?  Why not? Oh, I see... because you're sick. Because --  How come?  Any particular reason?  Are you sure? I mean, there are specialists who --  I think that goes without saying.  It's been a lifelong dream of mine. But will a scarf do it?  Good advice. I'll remember that for when I get old.  That I'm old.  I don't know why, but for some odd reason, I feel absolutely compelled to tell you the truth about this... even at the risk of --  I never had a date for the benefit. My plan from the beginning was for you to come with me.  The eulogy you gave at Ella's service was so... impressive. You spoke about her death... about loss... in a way that I could never have done. You understood life emotionally in a way that I didn't. Whatever that understanding was, I wanted to get close to it.  And the most enjoyable, yeah.  Thanks.  All right.      I got restless.  Not a soul.     What?  No.  I'm not sure I like that motto.  What?  That's it!           So many words in that wonderful head of yours...  Words?  Are you familiar with the phrase, \"You can catch more flies with honey than with vinegar?\"  Sure, it's from Poor Richard's Almanac. But the last time I checked --  We can't spend every waking moment together.  No trouble?  It's a classic. A little spirit gum and voila!  -- young women are rendered helpless.  Of course -- it's biological.  What do you mean?  Nothing. Honestly. We're having a lot of fun. We're very happy.     I'm not even tempted!  Sure, thanks.  Mmmm.  Incredible.  Absolutely incredible.  Give me a hint.  Was that the hint?  The truth is out. I've lost you forever.  Wonder Woman?  Batgirl?  Princess Di?  Wendy?  Yup, I'd know that throttle anywhere!  Hey, looking for me?  We were checking out the roof. John's got quite a set-up.  Wendy, this is Charlotte Fielding. Charlotte -- my friend Wendy Lister.  Is the party over?  I have a strange feeling that you're upset with me.  Ever?  You're not serious.  Of course not. Why would I want to do something like that?  Well, there you have it.  Sure, except that --  Look, I never pretended to be anything other than --  This was all a mistake. Right from the start. All of it. I'm a grown man and you're a child. Anyway, you have better things to do with your last -- With your time than spend it with me.       Thank you. It was designed by a team from --  Actually, no, it's velvet.  How are you?  Yes, Jesus. Table seven, if it's available.  Hello, Celia.  I've been worse.    Splendid, how are you?  Deliveries on time?  Keep up the good work!  I'm sorry, would you excuse me?  Who is it?  So?  Relax, I'm alive.  Look, it doesn't matter that she's sick -- she's still a kid and there's no way we should be together. It's unhealthy... it's... it's inappropriate...  Look, if she were just fun... just some sort of diversion... maybe I could justify it. But the worst part is that it's becoming more. Much more. It's embarrassing how much I like her. She gets to me. She affects me...  And she's gonna be gone and... I'm not sure I can... I mean... I already think about her all the time... Her smile kills me... and the thought... that it'll be gone... forever... that I'll never see her again... I don't know... I can't -- I don't think I'm that strong, Johnny. It's too much. I'd rather have it be over... over now. I'll start missing her now.  Good. I'm... I'm glad.  Patty, I... I want to be honest with you... right now, from the start... so there's no room for misunderstanding. I didn't have a good time, but it's nothing personal. I just split up with someone and rather than admit to myself how much I miss her, I asked you out instead. And it's unfair. If I feel sad I should just feel sad and not try to use you... and your body... as some sort of painkiller, right? Anyway, I think you're a warm and engaging woman and I wish you all the best.     Good night, Michael.  Who?     No, no. Not at all. You surprised me, that's all. I didn't expect to see you... not here... not after your letter.  I followed you in. I wasn't even sure it was you. All I have is an old snapshot.  I didn't mean to run off like that.  I saved it.  So do I. Look, why don't we go upstairs.  Lisa -- Congratulations. That's wonderful.  Is that what you consider me?  How's your mom?  Why?  Thanks. You're not bad looking yourself.  Already?    I am. I'm very sorry.  Can I call you?  A friend.  Where were you? I was worried.  I've missed you. You have no idea how much.  Dolly. We watched TV. She fell asleep. What time is it?  Where were you?  To tell you that you were right. I do hate myself. But not so much that I can't see how stupid and despicable and --  And cowardly what I did was. And even though there's no excuse for it, I want you to forgive me.  Because, for better or worse, I'm falling in love with you, and the thought of our not being together is unbearable to me.  So where were you?  Who's Eric?  What'd you guys do?  Hung out where?  Fine.  Talk about what? Is there something to talk about? What happened?  No, honestly, I think I have a right to know.  You're being unreasonable.  You know, in this day and age it's not so outrageous a request. I mean, I don't know this kid. I don't know where he's been.  It requires balance and I have lousy balance, okay?  Look, I'm not in a sporting mood!  I'm jealous, okay?! Is that what you want to hear? Are you satisfied now?  All I want is a simple answer and you're torturing me! And I resent it! It's cruel and juvenile! And I --     I wish I were exaggerating, but I'm not. I slept with every one of them. Really. Look through Dolly's old photo albums... or any movie magazine... visit Aspen at Christmas. I was on a mission. And until recently I really didn't think I had a problem. Or if I did, it was definitely the most pleasurable one I could imagine.  My house in Malibu burned to the ground.  I know, it sounds funny. But it must have triggered something because the next thing I knew I couldn't sleep. I'd lie awake at night absolutely terrified. Like a kid left alone in the dark.  How quickly time was passing and how adolescent I still felt. How meaningless all my choices seemed. How lonely I was. So I liquidated my portfolio, sold my businesses, and moved back here. To start over, settle down, start acting my age. You were supposed to be my one last dalliance with youth.  I want to, Carla, but --  Well, Molly, I just haven't met the right woman yet.  I agree. She's also demanding.  She's decided she wants her birthday present today.  The Dom didn't count. This is her real present. She chose it herself and it's not material.  When does the enlightenment start?  Don't worry. You're gonna be okay.  Excuse me... do you have an extra one of those?  Not for years.  Thanks.    Are you all right? You're okay? How do you feel?  I'll let you rest. I should. You'll sleep and then --  I do not.  It ought to be illegal.  Your smile. It's too pretty.  You have.  Shouldn't I be telling you one?  The first would be Emily Dickinson.  Charlotte, listen, I --  I just think --  That's right. The tumor's begun to interfere with the function of her heart, but she --  I thought Charlotte's health might be of some interest you.  I also thought it might be a good idea if we discussed ways to make her as comfortable as possible for the --  Tell me, are you really so cold? Or is it just a pose that you've cultivated?  I'm sorry.  She's in the hospital now. She doesn't have long. Weeks maybe and -- She... Anyway, I have something to ask you. A favor. I have no right to ask. I know. I'd do it myself, but I can't. I'm too... I'm...  I want you to find a surgeon. Dr. Sibley told me... Charlotte's doctor told me... he said at some point, when it's hopeless, surgery could be an option. Heroic surgery, he called it. I want to make sure that when the time comes a hero is performing that heroic surgery. Do you understand? You'll have to make calls. I'll get names. Sibley will give me names. I'm sorry to ask you... I have no right. But, you see, she doesn't want it... this surgery... I'll have to convince her. So no one can know... for now. And I trust you. You're my only family and I... You have every right to refuse me. After what I did. You were a child... and you needed me... and I was nowhere to be found. There's no excuse for that. I'm so terribly sorry!    What do you want to know?  Well, I remember a little more than that. Let's see... she was blonde... about your height --  Oh, okay. She... always ate her ice cream with a fork -- how's that?  And she wrote great letters, but couldn't spell at all.  She was a McGovern Democrat but also an incredible snob. She loved blueberries. She had the world's worst backhand. Her favorite singer was Stephen Stills.  Never mind. She was afraid of sharks. And, considering the times, she was pretty square. She only tried drugs once -- a lifeguard gave her a hash brownie and she threw it up all over him.  And she laughed just like that. And she bit her fingernails. And she couldn't tell a joke. In short, she was a unique.  She told me.  Yes.  That's how she got my attention; it's not why I fell in love with her. I fell in love with her because she charmed me senseless day and night for an entire summer.  I have no idea. The summer was over. Your mom was going back to Smith. I was moving down here to work on Wall Street. It was our last day together. She was crying. She told me, for the first time, that she loved me. I said I loved her, too. I promised to call and visit. A few hours later I was in a cabana with Millie. When Millie told me she was pregnant and that she wanted to marry me, I escaped to L.A... and I never saw her or your mom again.  I think it's part of the reason I never came back.  I might as well have been. For as long as I can remember, I've always run off at the first sign of a woman wanting anything from me... relying on me in any way.  I know.  Maybe. But it doesn't feel that way. It feels as though I'm not afraid anymore.  Driver! Quick! Pull over here! Right here!  I didn't know you couldn't!  I love you, Charlotte.  I'll add it to the specials list.  What's the matter?  Wills Keane.     Good? They say there's no one better.  Can your best save her?    I can't thank you enough.     What do you mean?  I was in Montclair, New Jersey.    I was considering opening a restaurant. But the rents are too high.               Straight?  I'm sure we do. About what?  I met with a heart specialist. He's willing to operate.  Well, maybe I want it.  Of course not, but if you'll hear me out --    Why not?! Maybe we want hope! Or maybe we just need to know that we did everything we could! Maybe I need to know that... if I'm going to be able to live... to go on without... without --        So had I.  You don't ever have to worry about that.     Yeah?  A couple of hours.  That's all right. Relax.  Nothing.  Don't! Don't move! Just one more minute!     You were just going to tire yourself out!  Just hold on!  Finishing touches!  Almost!  Voila!     Time cannot break the bird's wing from the bird. Bird and wing together Go down, one feather. No thing that ever flew, not the lark, not you, Can die as others do.  Ruined me for other women.  It happened so quickly. We'd just talked about the surgery. She agreed to it. But I thought there'd be time.  You know, it's funny, the first time I saw her, I --        I guess not.",
        "Keane": "",
        "Netto": ""
    },
    "imdb_rating": "5.6",
    "description": "Forty-eight year old Will Keane is a successful restaurateur and serial womanizer, his reputation generally preceding him. When he is introduced to twenty-two year old Charlotte Fielding by Charlotte's grandmother, Will's old friend Dolly who he has not seen in years, there is a mutual but slow to acknowledge attraction. After their first date, Will and Charlotte agree that their relationship will never progress to one of a long term standing, but for different reasons: while this is Will's somewhat standard modus operandi, Charlotte announces that she has a terminal heart condition. Charlotte's admission makes Will look at this relationship differently, he being told by his best friend John that if he is going to continue to date Charlotte that he better treat her well. Their relationship does end up being different than both expect, for Charlotte which could mean a change from her current \"let me die in peace\" attitude to want to fight for her life. And Will's time with Charlotte is further influenced by his encounter with a young woman named Lisa Tyler.—Huggo",
    "name": "Autumn in New York",
    "genres": [
        "Drama",
        "Romance"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMWFlM2VmYTUtZmFmMC00N2Y1LWE3NmUtYWI5MWZiMTY3NDRiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}