{
    "filename": "Avatar_script.txt",
    "imdb_id": "tt0499549",
    "imdb_url": "https://www.imdb.com/title/tt0499549",
    "characters": [
        "Cryo Vault Med Tech",
        "Eytukan",
        "Venture Star Crew Chief",
        "Tsu'tey",
        "Trudy Chacón",
        "Parker Selfridge",
        "Jake Sully",
        "Dr. Grace Augustine",
        "Neytiri (as Zoë Saldana)",
        "Mo'at (as Carol Christine Hilaria Pounder)",
        "Corporal Lyle Wainfleet",
        "Dr. Max Patel",
        "Norm Spellman",
        "Private Fike",
        "Colonel Miles Quaritch"
    ],
    "dialogues": {
        "Eytukan": "You speak truth. We must understand these Sky People if we are to drive them out.",
        "Tsu'tey": "You should go away.    Jakesully will go first.  I thought -- enough drink -- you would not be so ugly.  Your warriors -- hide inside machines -- fight from far away. I did not think a sky person could be brave.  You do not speak here!  You!  You mated with this woman?!      Yeeeeeaaa!  I challenge you.    I will fly with you.    Are the people safe?  I can never ride again, or bond with my woman -- or hear the voice of Eywa. I can not lead the People. You will lead them, Jakesully.  It is decided. Now do the duty of Olo'eyctan. Set my spirit free.  I am already dead.  It is the way. And it is good. I will be remembered --  -- I fought with Toruk Macto, we were brothers -- and he was my last shadow.",
        "Trudy": "Sully -- Colonel wants to see you in the Armor Bay.  Yeah, `cause we're not the only thing flyin' around out there. Or the biggest. I'm gonna need you on a door gun, I'm a man short.  See ya on the flight-line, zero nine. He's down there.  Sturmbeest herd, one o'clock.  I'm going to have to call it, guys. We're not allowed to run night ops. Colonel's orders.  Sorry, Doc. He's just gonna have to hang on `till morning.  It only takes tiny inputs.   Here, put your hand on the cyclic --  Feel how small the moves are? You barely have to think it, and the aircraft reacts.  Yeah we are. Look at my instruments.  You should see your face.  There usually isn't time to key the mike.  I saw one take out a gunship once -- WHAM! Total frickin' yard sale. Ate the crew like peanuts.  They're coming back.  If you don't give him something, he's gonna shut us down.  Loveshack this is Samson One Six inbound hot to your pos. I have Colonel Quaritch with me and --  Sorry sir, it's procedure.  Sec-ops is rolling the gunships.   They're gonna hit Hometree!  Now.    We're spooling up now! I gotta go.  Screw it.  Personally I think steak's too good for these traitors.  Oops. All the way down, pendejo.  Well, at least they won't be able to track us up here. Not this deep in the vortex.  Yeah.  Copy.  Frickin' daisycutters.  You know he's gonna commit those bombers straight to the Well of Souls.  We both did.  You need to get some rack.    Going up against gunships with bows and arrows...    You're not the only ones with guns, you pricks.  On it.",
        "Chacón": "",
        "Parker": "",
        "Selfridge": "Grace.   You know I enjoy our little talks.  Actually, we got lucky with him.  Well -- lucky your guy had a twin brother, and lucky the brother wasn't an oral hygienist or something. A Marine we can use. I'm assigning him to your team as security escort.  Look, you're supposed to be winning the hearts and minds of the natives. Isn't that the whole point of your little puppet show? If you look like them, if you talk like them, they'll trust you?  But after -- how many years? -- relations with the indigenous are only getting worse.  This is why we're here. Unobtanium. Because this little gray rock sells for twenty million a kilo. No other reason. This is what pays for the party. And it's what pays for your science. Comprendo?  Those savages are threatening our whole operation. We're on the brink of war and you're supposed to be finding a diplomatic solution. So use what you've got and get me some results.  Look, Sully -- find out what these blue monkeys want.  We try to give them medicine and education. Roads! But no -- they like mud. I wouldn't care except --  Their damn village is sitting right over the richest unobtanium deposit for a hundred klicks in any direction. Which sucks -- for them -- because they need to relocate.  Yeah, she does, and she's on the next ship back if she tries to cock-block me on it.  Killing the indigenous looks bad, but there's one thing shareholders hate more than bad press -- and that's a bad quarterly statement. Find me a carrot to get them to move, or it's going to have to be all stick.  Good of you to stop by. How's it going out there? Our blue friends all packed up yet?  See, I keep hooking it.   It's the damn pack.  The low gravity and the high air density cancel out so --  Go ahead.  Not what I was hoping to hear.  This thing is inevitable. What does it matter when it happens? I'm sorry, Dr. Augustine. You're out of time.  Roll on. He'll move. These people have to learn that we don't stop.  Son of a bitch!  Can we just take this down a couple notches, please.  You know what? You throw a stick in the air around here it falls on some sacred fern.    That's a lot I'm guessing.  What the hell have you people been smoking out there? They're just. Goddamn. Trees.  Well, I'd cherish that, but unfortunately you're out of here on the next shuttle. All of you. I'm shutting down the Avatar Program, effective now.  Christ.   Selfridge is stares soberly as Quaritch outlines the plan.   Alright, let's pull the trigger.  They're fly-bitten savages who live in a tree! Look around -- I don't know about you but I see a lot of trees. They can move.  You've got one hour. Unless you want your girlfriend in there when the axe comes down, you get them to evacuate. One hour.  Pull the plug.  This thing is completely out of control!  Listen to me! I am not authorizing you to turn the mine-workers local into a freakin' militia!  You think you can pull this palace coup shit on me?! I can have your ass with one call --  You touch me you're so fired.    What do you mean, off the board?!  Oh shit.",
        "Jake": "They can fix a spinal, if you've got the money. But not on vet benefits, not in this economy.   The room is a tiny CUBICLE, prison cell meets 747 bathroom. Narrow cot, wall-screen droning away in the B.G. --   I became a Marine for the hardship. To be hammered on the anvil of life. I told myself I could pass any test a man can pass.  Let's get it straight up front. I don't want your pity. I know the world's a cold-ass bitch.  You want a fair deal, you're on the wrong planet. The strong prey on the weak.  It's just the way things are.   And nobody does a damn thing.  All I ever wanted in my sorry-ass life was a single thing worth fighting for.  I hope you realize you've just lost a customer!    If it ain't rainin' we ain't trainin'!  Step off.    You're ruinin' my good mood.  The strong prey on the weak. A guy with a knife took all Tommy would ever be, for the paper in his wallet.  Jesus, Tommy.  The Suits' concern was touching.  The egghead and the jarhead.   Tommy was the scientist, not me. He was the one who wanted to get shot light years out into space to find the answers.  Me -- I was just another dumb grunt gettin' sent someplace I was gonna regret.    What're you two limpdicks starin' at?  Nothing like an old-school safety brief to put your mind at ease.  Yeah.  That's why I'm here.  Damn.   They got big.  It looks like him.  The idea is -- every driver is matched to his own avatar --  -- so their nervous systems are in tune. Or something. Which is why they offered me this gig, because I can link with Tommy's avatar, which was insanely expensive. Is this right? I just say whatever in these videologs?  Right. So, whatever. Here I am. Doing science. Never been in a lab before.  He's dead. I know it's a big inconvenience to everyone.  No.  High school chemistry.   But I ditched.  Like -- an hour.  Don't!   I got this.  Maybe I was just tired of doctors telling me what I couldn't do.  Kiss the darkest part of my lily white --  Grace?  That's kinda freaky.  You guys're packing some heavy ordinance.  Yeah, no problem.  I figured -- just another hellhole.    Just Marines comparin' tattoos.  Got it.  Then how's this supposed to work?  How do we contact them?  Or they may skin us and make a drum.    It's already pissed off!  What do I do?  Oh yeah!   Who's bad?! That's right.  That's what I'm talkin' about, bitch!  That's right motherf--  What about this one?       Run, don't run? What?    Wait, don't --  Look, um, I know you probably don't understand this. But -- thanks. Thank you. I owe you.  I would have been screwed if you hadn't come along --  Hey, wait. Wait!   Where you goin'?  Slow down a second will you. I just want to thank you for killing those --  Okay, I'm sorry.    Whatever I did -- I'm sorry.  They attacked me.   How'm I the bad guy  Okay, fine, you love your little forest friends. So why not just let them kill my ass? What's the thinking?  Yes, why save me?  If I'm so ignorant, maybe you should teach me.  Whooaa.  Then teach me to \"see.\"  Hey, slow down. Look, I think we just got off on the wrong foot and --  --you just have to get to know me. I'm Jake. Jake Sull--  Whooaaa -- shit!  I need your help.  So take me with you.    What are they?  What was that all about?  What's your name?  What's going on?  Your father!? Uh, good to meet you, sir.  Who's Eywa?  Jake Sully.  I came to learn.  My cup is empty, trust me. Just ask Doctor Augustine. I'm no scientist.  I don't know. I was a Marine -- uh, a warrior. Of the Jarhead clan.  What's going on?   What are they saying?  So it's all good, right?   You and me --  Don't get up.  You never told me your name.  Okay, again, a whole lot slower.  Nay-TEE-ree. That's nice. Nay-TEE-ree.  Your mom likes me.    I can tell.  These rock. What are they?  That's some damn fine teylu. That's like grandma's teylu.  Wha --? Oh.    It's not something you can teach.      So -- who talks them into moving?  What if they won't go?  I'm on it.  Tsu'tey. Mo'at. Eytukan.  Got it. So who's this Eywa?  Who's got a date with the chief's daughter?  I didn't meet the sister.  Forward.    You've got outer columns, then a secondary ring here, and an inner ring. Then a core structure, it's like a spiral, that's how they move up and down.  Roger that.  Yeah, so what does hold them up? Grace explained it to me -- some kind of maglev effect because unobtanium is a superconductor, or something. At least somebody understands it. Just not me.  Hey. You got a problem?  Holy shit.  When?  Do I have to do this?   I need some rack.  Yeah, yeah. The days are starting to blur together. The language is a bitch, but I figure it's like field-stripping a weapon. Repetition.  Seyri.  Ontu, mikyun, nari.  Neytiri thinks I'm some kind of retard.  Norm's attitude has improved lately.  Ireiyo.  It's good he's back on board, but he thinks I'm a retard too.  My feet are getting tougher.   I can run farther every day.  I have to trust my body to know what to do. With Neytiri it's learn fast or die.  I sweet-talked Mo'at into giving Norm and Grace a hall pass. Now Grace even makes me coffee before link every morning.  I'm learning to read the trails, the tracks at the water-hole, the tiniest scents and sounds.  Sometimes I have no idea what she's talking about.  It's been a month and I'm still not allowed to make a kill. She says the forest hasn't given permission.  There's a lot of crap like that. She's always going on about the flow of energy-- the spirits of the animals and what not --    Excuse me -- this is my video-log here, okay?  Everything is backwards now. Like out there is the true world, and in here is the dream.    I made a kill today. We ate it.   I know where that meal came from.  Yeah yeah.  Get rid of this shit, then you can lecture me.  Not now. Tomorrow we leave for Iknimaya.  That's right, Grace. This is what I've been working for.  What did happen at the school?  Jesus.  Iknimaya translates roughly as stairway to heaven. It's the test every young hunter has to pass.  We doin' this?  How will I know if he chooses me?  Outstanding.  Let's dance.  That's right! You're mine.  Heeeyyyaaaah!  Shut the hell up!!  Level out!     Fly straight!  I may not be much of a horse guy.   But I was born to do this.  The People call it Toruk.  Last one you ever see.  That's it.  Hey, guys.  That's a long time.  Sorry.  It's hard to put in words the deep connection the People have to the forest.  They see a network of energy that flows through all living things. They know that all energy is only borrowed--  -- and one day you have to give it back.  Hard to believe it's only been three months.    You called us back to report -- you want to hear it or not?  No.    I can do this.  I've gotta finish this thing. There's one more test -- the Dream Hunt. It's the final stage of becoming a man. Then I'm one of them. They'll trust what I say...  ... and I can negotiate the terms of their relocation.  It's the last door -- I'm going through it. You can help me or get out of the way.  I have to go all the way -- become one of  You know why I'm here? Because Quaritch sent me.  That's right -- to embed with the Omaticaya. To find out how to screw them out of their home. By deceit or by force, he didn't care. And if it turned out to be force, then how best to do it.  I'm not that guy any more.  But if I tell Quaritch the truth, he yanks me out -- I never see her again. And if I tell her the truth, the clan throws me out -- that's if they don't cut my heart out and show it to me.  They don't even have a word for \"lie\" -- they had to learn it from us.      It's like -- a sound you feel.  I don't want Ninat.  I've already chosen. But this woman must also choose me.  Neytiri, you know my real body is far away, sleeping.  We are?  Really, we are?  It's cool. I'm there.  Hey!    Heeeey! Stop! Stop!    I accept.  It's the only way to get him to goddamn listen.  Are you out of your goddamn mind?!    Just tell him what you know in your heart.  They're not going to give up their home -- they're not gonna make a deal. For what? Lite beer and shopping channel? There's nothing we have that they want. We're a horror to them. We're the monsters from space.  They're never going to leave Hometree.  Yup. That's how it's done. When people are sitting on shit you want, you make them your enemy. Then you're justified in taking it.  When?  Look Selfridge, you don't want this kind of blood on your hands. Let me try to talk them out. They trust me.        They sent me here to learn your ways. So one day I could bring this message, and you would believe it.  Yes. At first it was just orders. Then everything changed. I fell in love-- with the forest, with the Omaticaya People -- -- with you. And by then, how could I tell you?  Neytiri. Please, I only wanted to --  You have to get out of Hometree! Run to the forest! Please, I'm begging you!  We've gotta move!    He's gonna blow the columns.  Neytiri!   Neytiri!  I'm sorry --  I was a warrior who dreamed he could bring peace. Sooner or later though, you always have to wake up...    So what do you say?    Time for a revolution?  Come on.    Stay here. I need somebody on the inside I can trust.  Take it nice and easy, troop.  On the ground, face down. Hands behind your head.  Go! Go! Go!  Oh yeah, baby!  Hang on, Grace.  It's strongest at the Well of Souls, right?  Good, `cause that's where we're going.  I'm gonna get you some help, Grace.  No!   The People can help you. I know it.  The Well of Souls. The heart of the forest. I knew the People would go there.  I've gotta try, Norm.  Outcast. Betrayer. Alien. To ever face them again, I was gonna have to change the rules.  Sometimes your whole life boils down to one insane move.  Come on, boy. Time to fly.  The way I had it figured, Toruk is the baddest cat in the sky. Nothing attacks him. So why would he ever look up?  But that was just a theory.       Ireiyo.  Grace is dying.     I beg the help of the Great Mother.  Look where we are, Grace.  Is that possible?  Hang on, they're gonna fix you up.  I will.  Grace!  With your permission, I will Speak now. You would honor me by translating.  The Sky People have sent a message that they can take whatever they want, and no one can stop them. But we will send them a message. Ride out, as fast as the wind can carry you, tell the other clans to come. Tell them Toruk Macto calls to them. Fly now with me brothers and sisters! Fly! And we will show the Sky People that this is our land!  We rode out to the four winds. To the horse clans of the plain, to the ikran people of the mountains. When Toruk Macto called them, they came.  Talk fast.    When?  Thanks.  That's right. Because I gave it to him on a plate.  Then I guess we better stop him.  Gonna have to settle for coffee.  I was a warrior who dreamed he could bring peace. But there was only one thing I was ever really good at. Ooh-rah.    Yeah.  What's your point?  I've never done this in my life.  And I'm probably just talking to a tree right now. But if you're there -- I need to give you a heads up.  If Grace is there with you -- look in her memories -- she can show you the world we come from. There's no green there. They killed their Mother, and they're gonna do the same thing here.  More Sky People are gonna come. They're gonna come like a rain that never ends --  -- until they've covered the world. Unless we stop them.  Look, you chose me for somethin'. And I'll stand and fight, you know I will. But I could use a little help here.  It was worth a try.  We have to stop the shuttles, no matter what it takes.  What the hell -- ?     It's all over Quaritch --  Kinda hoped you'd say that.  I See you, Tsu'tey te Rongloa Ateyitan.  They're safe.  No. I'm not officer material.  I'm not killing you.  No.    A few chose to stay. Fewer were chosen.  The forest will heal, and so will the hearts of the People. New life keeps the energy flowing, like the breath of the world.  This is my last videolog.  The science guys will keep the lights on, here. But I won't miss this place.  I better wrap this up. There's a funeral tonight, and I don't want to be late. It was someone very close to me.",
        "Sully": "",
        "Norm": "Hey, you're Jake right? Tom's brother? You look just like him. Sorry, I'm Norm Spellman, I went through avatar training with him.  He was a great guy -- funny.     It was a big shock to all of us.  And duh! -- obviously you look like him. I mean, if you weren't genetically identical, you wouldn't be taking over his avatar.  So -- you want to go check it out?  Yeah, they mature on the trip out. So the proprioceptive sims worked pretty well.  No, it looks like you.   This is your avatar now, Jake.  Yeah. You just need to get in the habit of documenting everything -- what you see, what you feel -- it's all part of the science. Good science starts with good observation.  Grace Augustine is a legend. She's the head of the Avatar Program, and she wrote the book -- I mean literally wrote the book -- on Pandoran botany.      Five hundred and twenty hours.  Hey, check it out.  I am a living god.  This is failing as a pep talk.  The bull has the red on the dorsal armor?  How will they know we're here?  Why don't they come back?  Who's Eywa? Oh, only their deity. The Great Mother. The goddess made up of all living things. You'd know that if you had any training whatsoever.  The Hallelujah Mountains?  Yesssss! The legendary Floating Mountains of Pandora? Heard of them?  Oh. My. God.  I trained three years for this mission. I speak the language fluently. He falls off the frickin' turnip truck and all of a sudden he's cultural ambassador!?  Yeah, well I didn't come out here to wash the dishes while you're on some interspecies booty call.  Thank you?  Irrrreiyo. Irrrreiyo.   You've gotta roll the R, r-r-r-oll it.    Calibrating. Thirty seconds.  What?  They won't understand what you've done.  Link is ready.  Samson One Six?   Trudy? Crap.  Hey, hang on, you can't interrupt a link in progress, it's dangerous -- wait!  I can't believe that.  Baby, you rock.    Holy shit.  We're screwed.  If he takes out the Well of Souls -- it's over. It's their main line to Eywa, to their ancestors -- it'll destroy them.  Jake!   Jake! We're falling back!  No!",
        "Spellman": "",
        "Private": "",
        "Fike": "Check it out, man.    Meals on wheels."
    },
    "imdb_rating": "7.9",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMzQ3MjUyYzctZDY5MS00MGVhLWJhOTctMzA5N2QyZDAyZmU1XkEyXkFqcGdeQXVyMTYwMDIyNzk1._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "When his brother is killed in a robbery, paraplegic Marine Jake Sully decides to take his place in a mission on the distant world of Pandora. There he learns of greedy corporate figurehead Parker Selfridge's intentions of driving off the native humanoid \"Na'vi\" in order to mine for the precious material scattered throughout their rich woodland. In exchange for the spinal surgery that will fix his legs, Jake gathers knowledge, of the Indigenous Race and their Culture, for the cooperating military unit spearheaded by gung-ho Colonel Quaritch, while simultaneously attempting to infiltrate the Na'vi people with the use of an \"avatar\" identity. While Jake begins to bond with the native tribe and quickly falls in love with the beautiful alien Neytiri, the restless Colonel moves forward with his ruthless extermination tactics, forcing the soldier to take a stand - and fight back in an epic battle for the fate of Pandora.—The Massie Twins",
    "name": "Avatar",
    "genres": [
        "Action",
        "Adventure",
        "Fantasy"
    ]
}