{
    "filename": "Babel_script.txt",
    "imdb_id": "tt0449467",
    "imdb_url": "https://www.imdb.com/title/tt0449467",
    "characters": [
        "James",
        "Anwar",
        "Jane",
        "Walter",
        "Elyse",
        "Barth",
        "Richard",
        "Tourist",
        "Douglas",
        "Robert",
        "Susan",
        "Tom",
        "Lilly"
    ],
    "dialogues": {
        "James": "What's the use in staying?  They can go drop us off and then come back for you.  Hey, take it easy.  Try to calm down.  Come with us.  Try to understand, many of them can't go on. Tell me, honestly, is there any point in us staying?",
        "Anwar": "(In English, with an  Now, I'd like to show you the materials that were used to build the walls...  It's far away, about four hours. There's a clinic that's a little closer, about an hour and a half to the south. By bus it'll take us about two hours and a half though.  Yes, but it's the closest thing we've got.  We can take her to my town. It's near here and there's a doctor. In the meantime we can call Erfourd for an ambulance.  (To the driver, in     Yes sir, this is my house.        Here... here...       If you have the number of the embassy, I can go call.  Of course, come with me.  She can take care of her.         No, not here.           In Tazarine, three hours southwest of Erfoud.  I'll call Erfoud so they send one over.  They've already gone to look for him.           She's hurt, we had to take care of her.  Don't be paranoid and go help find the doctor.     About an hour and a half. It's coming from Alnif.  My brother already called a doctor, he's coming.  Trust my grandmother; she knows a lot about remedies.                   He says he is very sorry about your wife.    He asks if you have any enemies in this country.  Why did you come to Morocco?    What do you do for a living?    Anti-muslim magazines?      He says the federal police are already in charge, that they are going to send the ambulance.    He gives you his blessing.      The doctor's here.          He says she will be fine.  He has to sew up her wounds.    He's a veterinarian, but he is good.  If he doesn't sew up the wound, she may bleed to death.  He says she has a broken bone and he has to put a splint on it.                              The fourth of eight.  Do you have kids?  Just two?  You should have more.    No, this is where my family lives. I live in Marrakesh. But I come whenever I can...       A while ago... he says the ambulance broke down.  (In Arabic, to the      He says your embassy will deal with the matter.  They're going to try to send a helicopter.  Where?         What happened?  In Alnif, an hour and a half away from here.            Good luck, mister...  No sir, no... Allah be with you.",
        "Jane": "That he can't turn on the air conditioning, that it's not possible.",
        "Walter": "We can't leave him here alone.",
        "Elyse": "And why would you stay?",
        "Barth": "Marrakech isn't this way. They're going to shoot at us again.  They're going to kill us all. Turn back... turn the bus around...",
        "Richard": "Amelia, it's Richard. We're going to have to be here a few more days here in Morocco than we expected and Rachel wasn't able to find anyone to take care of the kids.  Amelia, this is very serious.  Amelia, this is an emergency. Cancel your son's wedding. I'll pay for another one.  We need you, Amelia... hold on.  Amelia, we're really counting on you. I have to go. Goodbye.  This place is beautiful, don't you think?  I'll have a chicken cous-cous and a Coke, please.  Look, look: a hawk.  This country is incredible.  What d'you mean why? I thought you would like it.  To forget everything, to be alone.  The Coke is warm.  Why can't you ever relax.    You're always stressed.  You could if you tried.  You're never going to forgive me, are you?  Susan, please; we didn't come all this way just to argue.  Here.  Susan, what's wrong?  What happened?  Stop the bus, stop, my wife's been hurt.  Take it easy honey, take it easy.  Is anybody a doctor?  Please: a doctor.  Where's the nearest hospital?  Does that takes away from Marrakesh?  I need your help. We were attacked.  Help... hospital...  Tell him we need his help.  Let's take her to the clinic.  We've got to get her to a hospital.  Shut up, god damn it!  Easy, sweetie, easy...    Ok.  Are we here?  Easy, darling, easy...  I need to call an ambulance and contact my embassy.  I need to make a phone call.  Don't worry, I'll be right back.  You're going to be ok.  Bad. Very bad.  And where should I take her?  You can't leave us here.  In case I need the bus.  Please wait.     Let me try to deal with this.  Yes... Rachel? It's Richard...  Yes, we're still in Morocco...Rachel, there was an accident, your sister was shot...  I don't know... We were shot at from some hills.  She was hit in her neck and shoulder. Rachel, she's not doing well... I need you to tell the embassy as soon as possible... wait... and call Mark...  Anwar, where are we?  Were in Tazarine, T-a-z-a-r-I-n-e Three hours southwest of Erfoud... in the desert... it's a town... there's no hospital... There's nothing here at all...  From a shop. Rachel, this is urgent... urgent... call the embassy... They have to help us... call James too...  I don't know... Rachel, you're sister's badly hurt... do you understand? Call for help... now...  Call an ambulance...  And find a doctor...  I'm going to as soon as I can. I've already called Rachel; she's going to tell the embassy.  How long until the ambulance gets here?  That much? Isn't there anyone here who could take her?  We've got to get her out of here. There's no one to tend to her.    I don't understand French.  Of course not.  Vacation.  I'm a magazine editor.  No, magazine magazines.  Tell him we need to get my wife out of here. Ask him if the ambulance is on its way.  What did he say?  Thank you.  Thank you.  What did he say?  Stop lying to me god damn it, and tell me what the fuck he said!  Yes, we know that. What can you do in the meantime?  You need some stitches.  You're not going to give her any anesthetic?  What kind of doctor is he?  He can't take care of her.  Honey, this is going to hurt a little.  Calm down... calm down... Susan, they have to sew you up... relax...  Honey, please try to relax...  My love, don't move.  You can't move, calm down.  You can't; there's only one phone in town. I'll call them later.  You can't leave us like this.  At least wait until an ambulance comes.  Is there anyone around here who can take them in?  Just wait, the ambulance should be here any minute now.  Thank you.  Is that your daughter?  Eight?  Three... Yes, just two.  What about you? How many wives do you have?  And is this where you live?    What? Tell him to call another one. He has to get another one.  What the hell do you mean there isn't another ambulance? You've got to get her out of here...  She can't stay here or she'll die. Call another fucking ambulance...  Come on, move... call another ambulance...  How the fuck are they going to deal with it? It's your shitty fucking country's responsibility.    I need to make a phone call.  Stop fucking with me.  Oh no?  Leave asshole.  I'm fed up with that asshole.  Calm down? My wife is dying up there.  Where the fuck do you want me to take her?  You leave and I'll kill you...  Rachel... What's going on? Nobody's come... Who have you talked to... we need help...she's dying...  She's very weak, please, you've got to do something.  You can't just make these stupid fucking calls, you've got to do something...  How the fuck do you expect me to calm down? Susan is dying...  There's no time. I need to get Susan out of here now! Put Mark on the phone...  God damn it, connect the fucking call.  Mark, help me... Susan is dying and there are no ambulances, there's no hospital, there's nothing.  I don't give a shit about political problems... Do something, now, please...  Son of a bitch...  Stop... Stop... Stop you mother- fuckers stop...  What do you need?  You're not going to die. You can't die. You just can't.  No, I'm not going to leave them and don't you even think about leaving me, because I'll kill you like nobody's killed you before.  What?  I'm going to tell Mike on you, so you never scold him again.      Come, try it like this.  Forgive me my love. When Pat died I didn't know what to do, the pain drove me crazy... I was scared, that's why I left... forgive me.  No, it wasn't your fault. I was wrong...  Shhh... it wasn't your fault my love, it wasn't anybody's fault... Pat just left... Forgive me, please.  You missed; you got my leg.  Does it hurt?  Anwar...Anwar...  We've got to get her out of here. Where's the clinic?  Can you get us a car we can take her in?  My love... I'm going to get you out of here.   We're going to try to take you to a clinic an hour and a half away from here. Do you think you can make it?  I need you to be strong. Really strong.  Thank you for lending us the car.  Sweetie, you've got to hold on.  Hello...  Yes, speaking.  My wife is dying. She's in urgent need of medical attention.  We've been here for five hours. What the fuck are you waiting for?  I can't wait anymore... I'm taking my wife to a clinic in Tinerhir right now...  We can't wait any longer.  My wife is in critical condition. How long is the chopper going to take?  Thank you for everything.  Thank you...  The last thing I'm worried about right now is the fucking press.  Is she going to be ok?  (insistently, as if  Amelia?  How is everything?  They're going to operate now... Amelia... take good care of the kids, and don't tell them anything...  Put Mike on please.  Hey sweetie, how are you?  Oh really?  Yeah, I'm ok. Everything's fine.",
        "Tourist": "",
        "Douglas": "How is your wife?  I'll stay with you if you need me.  You do what you have to do, we'll wait.  His wife is in no condition to ride a bus.",
        "Robert": "",
        "Susan": "(not very  What do you have that doesn't have fat in it?  I'll have the fried eggplant and a diet Coke.  Then a regular Coke.  Richard, why did we come here?  Really: why are we here?  Alone?  Throw out the ice.  Yeah, but you don't know what kind of water is in there.  You're the one stressing me out. You're why I can't relax.  Tried? Don't you think I tried?  Do you even know what I'm talking about?  Oh, we didn't? Then when are we supposed to \"argue\"? Or are you planning on running away again?  I don't have any money... I don't have any...  What are you doing?    It hurts, it hurts...  It hurts... it hurts so much...  Don't touch me there.  Don't leave me here alone...  Can I have some water?  No, water...  Thanks.  Where's my husband?  Get me out of here... please...  I told you we shouldn't have come.  No, not that.  No, no... not that...  What did he say?  What do you mean stitches?  Richard, he might infect the wound...  Richard, don't let him...  Don't let him, don't let him.  No, no...no..  I hate you... I hate you...  I don't give a shit...  I want to call the kids.  I want to talk to them.  I want to talk to them...  Richard.  Richard... if I die, take care of the kids. Especially Mike, he really needs you.  Don't ever leave them again.  I peed my pants.  I couldn't hold it in and I peed.  I need to pee again.  I can't.  Now I can.  I was scared too... when I saw Pat lying still in his crib...  It wasn't my fault, it wasn't... I couldn't do anything for him...  Forgive me for not forgiving you.  So much... so much...  Yeah.  Ahhh... Ahhh...",
        "Tom": "Get her outta there and let's go.  In Egypt, in a town like this, they slit thirty German tourists' throats. They might do the same to us.    We're not going to risk our lives, so hurry.  What is he saying?  Fuck you.   We're gettin' out of here.  We've gotta talk to you.  We're leaving.  There are old people here and the heat is getting to them.  One man almost fainted in the bus and there's a woman who needs to get back in time to take her medication.  It's not about that.  Well let him come, then.  And lots of other people aren't in any condition to keep waiting, can't you see?  We're giving you an hour... one hour...  What did he say?  We can't stay here any longer. It's going to get dark soon. Lots of people aren't feeling well and its dangerous to stay here.  Don't you dare push me.  What are you doing, you stupid fuck?  Fuck you.",
        "Lilly": "It's very hot, sir, and the driver turned off the air conditioning. I'm feeling sick.    Sir, we can't wait anymore."
    },
    "imdb_rating": "7.5",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYTJkZDljNGYtNjRiNC00ZmY2LTg1NmItYTI1MTllNDQzMWVmXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "Four interlocking stories connected by a single gun converge at the end to reveal a complex, tragic story of the lives of humanity around the world and how we truly aren't all that different. In Morocco, a troubled married couple are on vacation trying to work out their differences. Meanwhile, a Moroccan herder buys a rifle for his sons so they can keep the jackals away from his herd. A girl in Japan dealing with rejection, her mother's death, her father's emotional distance, her own self-consciousness, and a disability, deals with modern life in the enormous metropolis of Tokyo, Japan. On the opposite side of the world the married couple's Mexican nanny takes the couple's two children with her to her son's wedding in Mexico, only to meet trouble on the return trip. Combined, it provides a powerful story and an equally-powerful looking glass into the lives of seemingly random people around the world and it shows just how connected we really are.—Mac",
    "name": "Babel",
    "genres": [
        "Drama"
    ]
}