{
    "filename": "Bad-Santa_script.txt",
    "imdb_id": "tt0307987",
    "imdb_url": "https://www.imdb.com/title/tt0307987",
    "characters": [
        "Girl on Santa's Lap",
        "Milwaukee Bartender",
        "Milwaukee Mom with Photo",
        "Marcus",
        "The Kid",
        "Gin",
        "Milwaukee Bratty Boy",
        "Willie",
        "Lois",
        "Bob Chipeska",
        "Milwaukee Mother",
        "Sue",
        "Hindustani Troublemaker",
        "Milwaukee Boy",
        "Milwaukee Security Guard"
    ],
    "dialogues": {
        "Milwaukee": "",
        "Bartender": "",
        "Marcus": "Jesus.  How's it goin'?  I'm goin' downstairs... I need a melon-bailer and a loofah.  Fuck the loofah, let's go.  Drive.  Willie, it's Marcus. It's that time of year again. Pack your shit. Phoenix.  Jesus Christ! Can you maybe keep it together for just ten minutes?!  For crying out loud, chew a few of these... you drunken, fuckin' imbecile!  Thanks... you know, we been at this a long time an' all, so we like to think we do a good job...  Oh no, we're fine, w --  Willie no, he --  Willie...  OKAY! We're gonna head upstairs now.  Such a card.  No, no, no. Joke. Adult joke. For us. Adults.  ...Joke.  Merry Christmas! Santa's coming!  What the fuck you doing, \"fuck stick\" in front of the boss?  You don't like any guy. You think I can't find another portly motherfuck can run a water drill?  Don't tempt my hand. You blow this and we're broke for the year. So stop acting like you know something because, pal of mine, you don't know squat. You're gum on my shoe.  Now put on your fuckin' hat and get out there.  ...And try to act professional. For Chrissake!  It's okay. C'mon.  What's your name?  ...You can tell me...  ...How about Santa? If you don't tell him, you won't get a present.  ...That's right. Let's tell Santa.  Just don't come in to work stinkin' of booze again.  Lollipop Guild, asshole. Jesus, two year olds flip me shit better'n you.  (pauses, then deliberately  ...Motherfucker... Oh, you lousy fucking motherfuck...  That's just the kinda shit that's gonna get us pinched!  You promised no arcades! You said you'd only hustle Big &amp; Tall!  How many times, you fuck? \"The bigger the store, the bigger the take.\" Well, we can't work the big stores with your big fucking train wrecks!  What the fuck is this?!  You cocksucker!      What guy?! You get a look at him?  Is there anything in the room? Anything professional?  Just ditch. You got anywhere to sack out for a while?  You can't just take up with some kid! You don't know who's around, what they do!  You said that last night you stupid fuck!  You are by far the dumbest most pathetic piece of maggot-eaten shit that has ever slid from God's gilded ass! What if the kid has one of those fucking play-dates they have now?  You fuck her?  With me? I fuck one person, I ain't out there serial fornicating, trying to float my liver! Drinkin' myself silly 'cause I can't stand what a piece of shit I am!  Yeah, that's right, shit-for-brains, talk about my height. Make it about something safe. 'Cause you're an emotional fucking cripple. Your soul is dog shit. Every single fuckin' thing about you is ugly.  I've seen anal warts more attractive than you.  You're late.  Morning Jesse.  You tear your ball again?  Let's do the other thing.  There.  Next!  Oh jeez.    What gives? Where's the grandson?  I know you?    Easy! Easy! Just back off, Willie. I can handle this.  Okay. Thirty percent. There's three of us. Thirty percent. That's fair.  I meant thirty-three.  And a third.  Thirty-five.  Forty.  Forty-two?  Forty-two five.  Fooooooorty... eight.  Forty-nine?  Well...  ...what's one point.  No! Money's one thing, but --  Ah, he's a fuckin' moron.  Fuck you.  Fuck you -- you don't like it, next year, fuck off. I can always get another box jockey.  Yeah? Where? You see us hangin' off of fuckin' trees? Like fuckin' crab apples? And even if we did, you'd never front your own racket. 'Cause you got no discipline and zero fuckin' initiative. You'd fall apart without me. You're just too fuckin' pathetic --  -- too fuckin' pathetic for words, you fuckin' loser. And you fuckin' know it.    ...You need many years of therapy. Many, many, many, many, many... many fucking years of therapy.  No.  Holy motherfuck. What do you think you're doing?  You son of a bitch!  What do you mean, get him out of here?  In case you hadn't noticed, I'm a motherfuckin' dwarf. So unless you got a forklift handy, maybe you should lend a hand.  Special treatment? I'm three fucking feet tall, asshole -- it's a matter of physics! Draw me a sketch how I get him to the car!  Sketch it up, fuckin' moron. Fuckin' Leonardo da Vinci.  I called you a fuckin' guinea Homo. From the fifteenth fuckin' century.  Yeah? You sure it ain't too sore from last night?  Well it was on your wife's pussy last night. Why don't you dust that thing once in a while. Asshole.         There he is... that lousy, leatherfaced, dago motherfucker...  Sorry, the van stalled. Give us a jump will ya?  It's hard for me to reach...  Thanks.  Oh my, what a terrible accident!  No, but it looks like you broke most of his ribs.    (shaking his head in dismay  Shit!  Put it in reverse.  What are you, drinking Sterno now? 'Cause you're sounding like my Aunt Tilly right before she smeared her own shit on the bedroom walls and we had to lock her up and she spent the rest of her life with a shaved head and eating lunch through a tube up her nose...  ...You better be in shape by this evening, fat man. After tonight, I don't give a shit. But this is the time to reach deep down and suck it up.  ...Lovely boy.  Let's go.  ...Oh Christ.  All right...  What? What-What-WHAT-WHAT?  So?  Yeah, Andy Pizzarelli?  Huh-uh, since he got married they call him An -- WHAT'S YOUR FUCKING  Yeah? YEAH?  ARE YOU FUCKIN' SHITTIN' ME?! Are you tellin' me after I've propped you up and held you together and smiled for all those kids and danced for all those fucking housewives in a fucking lime-green fucking velvet elf costume YOU CANNOT GET IN THAT  Store dick don't want shit.  Store dick dead. Store dick don't want shit.  ...Fuck the fuckin' store dick.  Willie. This has been a long time comin'.  Every year you're worse. Every year, less reliable. More booze. More bullshit. More butt-fucking.  You gotta be able to rely, Willie.  Believe me, Willie: there's no joy in this for me.  Oh please. Don't gimme that trite \"commercialism\" crap. This is what we do, Willie. We get the shit. Christmas time, we get the shit. Because we are men. And Lois. It is Christmas, Willie, and we are men, and Lois.  Good-bye, Willie.  Huh? !  ...Where did you come from?  Oh yeah? Well come'n get us, coppers! Ha-ha-ha-ha!",
        "The": "Hurry boys, we're gonna miss Santa! She drags them across the street toward the looming art-deco monolith that is the big-city department store.  Willie, I don't care man, I'm not looking to blame anyone, but that diamond isn't a real stone, man. I took it to -- BOOP!  KNOW?! I'M GONNA -- Whoa! Sage Terrace!",
        "Kid": "I saw you in another mall.  You're not really Santa. If you were Santa you could do magic.  Loser!  It's not real.  How'd you get sick?  Mrs. Santa?  What's it like at the North Pole?  Which one?  You are really Santa, right?  Okay.  Uh-huh.  Uh-huh.  Uh-huh.  Uh-huh.  Yeah.  Why do you need a car?  This car.  Sage Terrace. Where's your sleigh?  Where're the reindeer?    How do they sleep?  But the noise, how do they sleep?  From the shop.  I thought it was always night at the North Pole.  Then how do they sleep?  On my head?  How can they drop me onto my own head?      He's on a adventure 'sploring mountains. He been gone a long time.  Next year.  She lives in God's house with Jesus and Mary and the Ghost and the long- eared donkey and Joseph and the talking walnut.  Granma.  Granma.     Granma, Santa's here. Are you spry?  Nuh-uh.         You need money to fix your sleigh?  You want milk and cookies?     Bye Santa!     Santa!  You're bringing my present early?  But I never told you what I wanted.  Okay. Good. I want a stuffed elephant. A pink one.  Okay.     Do you and Mrs. Santa have kids?  What about the elves?  What about the reindeer?      ...What're their names?  The elves.  That's the Seven Dwarves.  -- How old are they?     You want cookies?  Warm milk?  Should I fix you some sandwiches?  Okay. You want anything else?  Okay.  Okay.       King me.                        ...I cut myself by mistake.  Santa here?  Part of it.  I was thinking I wanted a purple stuffed elephant, not pink, but now I changed my mind.  Now I don't want an elephant at all. I want a gorilla named Davy for beating up the skateboard kids who pull on my underwear and he could take his orders from the talking walnut so it wouldn't be my bad thing.  He make it all better?  You went bathroom on Mommy's dishes?  He try to teach you not to cry and be a man.  Uh-huh...  'Kay. Thanks, Santa.  'Kay...       ...Santa?  What're you doing?  You goin' to work today?  You just gonna sit there?  Yeah.  Umm...  I didn't know he did that.                  Hello. Santa?  I know that Christmas Eve is in a couple days and you have to fly around and give presents to the world and after that you won't be around no more.  So I thought I'd give you your present now.  A wooden pickle.  Not paint. It's blood from when I cut my hand when I was making it for you.  You're welcome. Good night Santa. Good night Mrs. Santa's sister.        You wanna see my report card?  Think I did good?  Yeah.  Yeah.  (back to the report card  I thought maybe since at least I did good in school, you'll bring me a present this year. 'Cause last Christmas and the one before that you didn't bring no presents...  ...Even though I'm a dipshit loser.  I know there's no Santa. I just thought maybe you'd wanna give me a present 'cause we're friends.",
        "Gin": "\"Fuck stick\"?  Little friend?  \"Little people,\" that's what they like.  So \"fuck stick,\" that's all?  Right.  Mm.  No.  Sure.  Yeah, a big fuckin' fat one.  Heeyeah. Unfair practices. A lot of special pleading. Bitch, bitch, bitch. Fuckin' broads.  Well sure. Santa fuckin' someone in the ass.  Yeah. Yeah. I getcha.  Oh shit yeah. There's always something.  Your name Roger Merman?  Doing three-to-six for embezzlement?  You live at 41 Sage Terrace?  They're fine. Do you have any house guests?  Thanks much for your time. God bless.  Well, it's fucked.  Yeah. Fucked. Frankly.  Clean.  As a fuckin' whistle.  No. Nothing. I mean, shit, he curses, yeah. But never around children.  No criminal record, no parking tickets f'Christ's sake, no bad habits, even. Sex, yeah. But man is a sexual being.  Fuckin' Darwinian. Can't do shit about that, Jack.  Wouldn't want to.  Hope not. End of the human fuckin' race.  Fucks large women. What can I say.  Open the rope there, Marcus.  Not yet.  Act natural.  You are Willie Tugboat Soke and you are Marcus \"The Prince\" Skidmore. On Christmas Eve, you're gonna rob this store blind. What say we go somewhere private?  Research, that's how. I'm a department store detective Sherlock, that's what I do. Seven cities in seven years. Pretty impressive. The stores change, your names change. You always get away clean. Yeah, pretty darn impressive. But let's face facts -- you all are a couple of half-bucket small-timers. Because of your physical attributes you've found a niche. I respect that. But you've also been caught. By me. So this is the way how we gonna do things. I don't want to take over, I don't even want to change your scam. Whatever you guys do, it works. All I want is a taste. When the deed is done, we part ways. I buy a ranch in Havasu, you take your little medicine show back on the road.  Half.  Half.  Half.  Half.  Half.  Half.  Half.  Half.  Half.  Half.  Down the middle on the dough, and any merchandise you take I look over and cherry-pick.  It ain't Chinese menu, jagoff. I tell yea how the way it's gonna be. This is pricks ficks.  Sweet Jews for Jesus...  Alright, let's get him out of here. I'll go smooth this over with Chipeska. Food poisoning, something.  Take him to his car.  That figures, you wantin' all kinds of set-asides and special treatment 'cause of your handicap. You're all the same.  Bitch, bitch.  What did you call me, thigh-high?  I could stick you up my ass, smallfry.  You got some lip on you, midget.  Jesus, Mother Mary and Joseph! What in the name of the holy lord Fuck is the problem now?  Well, I'll be dipped in dogshit!... What am I, your auto mechanic now?    Jesus Christ, give me those!",
        "Willie": "Ready.  I'm finished when I'm finished.  Got it.   Fuck you! Fuck you! Fuck you!  Goddamn it!  Yeah baby!  I got messages. Go wash yourself.  Well you smell like a bum's nutsack.  Yeah, yeah.  (irked, snapping out of his daydream  Performance. Like sexual?  You saying there's something wrong with my gear?  You know... fuck stick.  I don't like that guy.  Yeah, yeah.  All right, wuddya want?  Fine. Next.  YOWWWCH! Watch the toenails willya?  ...Wuddya want?  Yeah, c'mon, c'mon, wuddya want?  Fine. Next.  ...What do you want?     ...Next. Next!  ...Next, goddamnit! Let's move it along -- this is not the DMV!  What do you want? C'mon, wuddya want? A snot rag?       It was real. The hair fell out when I got sick.  I loved a woman who wasn't clean.  No, her sister. Let the fucking thing go.  Like the suburbs.  Apache Junction. What the fuck do you care?  Get the hell off my lap.  No. No, I'm an accountant. I wear this as a fucking fashion thing.  Get that kid out of here, he's freaking me out.  I gotta get a drink on. See ya tomorrow.  Don't worry about me. Get going, you'll be late for your Wizard of Oz Candy Bar Guild thing.  You tryin' to say something to me?  Well fu-uck you!  Up yours, yufff --  Yep.  Oh yeah.  Nothing 'til March. Then I'm the Easter Bunny.  Why not. Buy you one?  Nah.  Why not.  It's my job, no big deal. I'm an eating, drinking, shitting, fucking Santa Claus.  Which?     Yes! Yes! Yes!  At least lemme take off the hat!    Whoa-Jesus! All right buddy, that's it...  Look, what's the problem pal, you go off your meds?  Now you listen. My brother lost an arm fighting you people in Vietnam, so I want you to take a good hard look at this face...  ...'cause it's the last fuckin' thing you're gonna see before I knock your head off and sh --  You.     This one time I take you home.  I'm not your fuckin' dada.  It's not as if you helped out with that nut-job.  And you're right there to grab his fuckin' balls.  Right height.  Twist 'em.  ...Fuck you talkin' about?  Whuh. Which turn is it?  Repairs. In the shop.  I stable 'em. Is it gonna be left or right?  Next to the shop.  Who -- the reindeer? Standing up.  What noise?  They, uh, they only work during the day.  Not now. Now it's always day.  Well, they -- WILL YOU PUH-LEEEZ  ...What is it with you? Somebody drop you on your fucking head?  What, are they gonna drop you on somebody else's head?  Not onto your own h -- ARE YOU FUCKING  Nice digs. Daddy home?  Exploring mountains? When's he coming back?  What about Mommy?  Who the fuck takes care of you then?    Uh-huh. Is Granny spry?  So you're tellin' me no one else is here?  ...No aunts, no uncles, no cousins?  ...Butler, security guard? Nothin'?  Daddy got a safe?  Huh? Yeah, whateverthefuck...  Daddy got a car?  Yeah! Yeah! You ain't gonna shit right for a week!    Ah, it's like shooting fish in a barrel -- there's no sport,    Mind your own fucking business.  Opal, come here.  No, not that -- come here!  Who the fuck's in my room, did you see someone go into my fuckin' room?  Ah fuck.  No, I think it's a cop though. You think someone's onto us?  No. Clothes.  Yeah.   I said I didn't bring it, dipshit.  Yeah, well...  ...wish in one hand and shit in the other, see which fills up faster.  I'm gonna be staying here a while. Things are all fucked up at the North Pole. Mrs. Santa, she... she walked in on me fuckin' her sister. So I'm out on my fuckin' ass. She's taking half of everything... This'll do.  ...I'm gonna crash here. You and me, like, you know, bachelors.  No. Thank the fuck Christ.  Yeah, well, them. They stay with Mrs. Santa. I get 'em on weekends. Run me a bath, will ya?    ...Who?     Shit, is that not...? I just -- fuck, I don't know, I'll just say, Hey, Bub -- Look, I...   No.  No.  What is with the fixing sandwiches? No.  No. As soon as the bed stops moving I'm going to sleep...  ...Wake me up... when the little hand is on the...  Fuck me? Fuck you!  You got some nerve you little shit ya. You my mom now?! You shat me out your --  Ah, shit! Fuck you!  You shittin' me?! He doesn't have fucking friends! Not even an imaginary one! Unless he got ditched by him! He's just a fuckin' misfit! Lives with his grandma who sits drooling in front of the TV! Every once in a while she gets up to play soccer with her tits! What, she's gon' rat me out? She don't know her ass from last Tuesday!  Jesus! Why is everything sex with you?  What're you, fuckin' Sigmund Sawed- Off Freud? The shrunken fuckin' shrink?  Yeah? Well... fuck you.  (shouting, food flying out of his mouth  That's a threat? You think you can make my life any worse, you go ahead, be my fucking guest!   Son of a BITCH! ...you LOUSY...  Refill?  It's okay. Just renting.  Through the holidays.  Fuck no! Whaddya think I'm some kind of pervert?  Oh. No, see, the thing is... I'm not really Santa.  Yeah, I'm gonna send you some flowers. Real good expensive ones.  Whuh...  What the...  What the fuck did you do?  ...Lemme look at it. What the fuck happened?  I forgot to tell ya, that'll sting. Okay now!  ...Well fuck.  ...Don' t you want me to wrap it in a T-shirt or something?  Kids, lemmme tell ya...  ...They'll run ya ragged.  Up your ass.  GOD dammit!  No, it's okay.  Done.  Is that your underwear?  Where's the rest? Never mind. What do you want?  What.  ...You know when I was your age, I didn't need no fuckin' gorilla, and I wasn't any bigger than you. One day I came crying home to Dad because four kids had beat me up, and you know what he did?'  No. He kicked my ass. You know why?  What the fuck? No.  Nope, it was because he was a mean, drunk son of a bitch. When he wasn't busy busting my ass, he was puttin' out cigarettes on my neck.  The world's fuckin' unfair -- it don't give ya nothing. You can wish all you want but you gotta take what you need. Stand up for yourself... stop being such a pussy and kick those kids in the balls or something. Or don't, I don't give a shit. Just leave me the hell out of it.  Okay, go ahead...  ...Get the fuck outta here...  Santa don't do grab-ass, cowboy.  Huh? What?  ...What the fuck?!  Now you listen here, you --  ...Pricks ficks?  Yeah, well I guess that's how you got the upper hand.  Negotiating.  Yeah, and I can get another midget.  Yeah, yeah.  Ah, fuck it.  Yeah.  Ah, nothin'.  Not really.  Yeah. Lemme alone.  -- Kid.  Later today, when the paramedics come and bag up Santa...  ...make sure the cops get this letter. It tells about all the bad things that -- that -- what the fuck happened to your eye?  Well goddamnit...  I think I've turned a corner.  No no. No; I beat the crap out of some kids today -- but, you know, for a purpose. It really made me feel pretty good about myself -- like I did something constructive for a change. Accomplished somethin'.  ...Hello?  ...Granma?  Granma...  ...Oh jeez.    (frozen; teeth still gripping panties  ...Yes?    Why'd you paint it brown?  ...Thanks.  Hold on a minute.  Nothin'... it's just... I'm... well... I'm sorta... fucking... touched.  ...I don't know if I can fuck...   Who the fuck is Thurman? This is you? Your name's Thurman?    Jesus.  Whaddya you care what I think, anyway? What do I fuckin' know? Better than I ever did. I never got any B's,  Oh...    Oh...  (pause, then sincerely to the kid   You fuckin' spic!    'Tendo it is.  ...Everything I touch turns to shit and dies.  Barbie it is...  ...That it?  (red-faced, holding breath  Up your ass.  Oh shit...  It's a Kitnerboy Redoubt.  ...You know Andy Pitts?  No, Andy Lapitski. Andy Pizzarelli is Andy Blue Balls.  Andy Lapitski can get into anything. Anything. They say he's been in Margaret Thatcher's pussy.  In the joint he told me that the Kitnerboy...  ...cannot be cracked.  No... I'm saying it's gonna take me a minute.  Piece of cake.  ...I'll be right back. I gotta grab one thing.  Shit... which did he say?  Well, I don't think that store dick is gonna want this.  Wuddya mean, fucking guy's greedier than...  ...greedier than fuck.  Dead, huh...  ...I didn't even know he was sick.  Uh-huh.  Sure. The three B'a.  You're monsters.  Oh, I don't mean layin' me out. I understand that. But just look at ya. All the shit... grabbin' all this shit -- do you really need all this junk? ...This is Christmas?  Shit!  ...Fuckin' kid!  Fuck me...  ...fuck me fuck me fuck me...  ...It's Christmas... and the fucking kid is getting his present.  Up your ass!  Dear kid. I hope that you got my present and that there wasn't too much blood on it, although there was blood on the present you gave me which didn't keep me from enjoying it, so maybe the blood doesn't matter so much I guess.  ...Anyway, just in case they took it as evidence I am also sending you a T-shirt. I hope it's the right size. I am healing up good and they tell me that I will soon be one hundred percent even with eight bullets dug out of me because they didn't hit any vital organs, just my liver which is fucked anyway, ha-ha-ha. Anyways...  ...Thank you for giving that letter to the cops. I forgot I asked you to do it but it's a good thing you did or Santa's little helper would've plugged his ass. And now the cops know I wrote it, which is gonna keep my ass out of jail. That, plus everyone agreeing that the Phoenix police department shooting an unarmed Santa was even more fucked-up than Rodney King. The cops are treating me like fucking royalty now which is new in my experience. They are gonna make me a sensitivity counselor so that tragedies like this will never again embarrass the whole fucking department. Whatever.  ...As for my little helper, I am sorry to have to tell you that him and his prune-faced mail-order-wife are gonna be exploring mountains with your dad. I hope your dad doesn't go sucking shit from them like I did. Meanwhile, I told the cops you had no one to take the fuck care of you, so they set it up with Mrs. Santa's sister watching you till your Dad gets back in one year and three months. They made her a Guardian Pro-Temp or some such shit... anyway, she makes better money than bartending and seems to like you and your house and Jacuzzi.  ...So I'll be staying in Phoenix now, telling the police how screwed- up they are which is not a bad job as jobs go. They're supposed to let me out of this hospital room soon so I'll see you when I come over to fuck Mrs. Santa's sister in the Jacuzzi. Until then, don't take no shit from nobody. Least of all yourself. Anyways... see ya soon...  ...Santa.",
        "Lois": "Marcus, did you get the loofah?  Just looking.  Just looking.  Just looking...  Is he dead?  I needed more of a running start -- I couldn't build up any speed.  ...Wuddya waitin' for, honey? Plug him.  Gevalt.",
        "Bob": "",
        "Chipeska": "Harrison, please I Just let me explain. Financially, the --  Harrison, it's not the money or the midget. Believe me, if it was, I -- I don't think they like \"midget\". I think you're supposed to call them --  Hi. Bob Chipeska. I, please, I, uh -- please don't listen to him. Great resume and photo by the way.  You two are the best men for the job. Truly. So do not let his... unpleasantness affect your performance in any way.  Yea. Your performance... you know, the...  Excuse me?  I'm sorry. Your gear?  He's not gonna say \"fuck stick\" in front of the children, is he?  Yes, I thought it was strange too, but you know, I, I, I, I, uh, I, his little friend promised he wouldn't say it in front of the children. Which is fine because, you know, urn, there's an adult world and a child's world and that's okay. I'm not a censor.  Yes, a, a, a dwarf. Or midget... a, a, I don't know what he's called exactly but... a little guy. Little. Billy Barty. God rest. But thin fingers. Not the fat sausage fingers.  Ah, yes, right.  Well, no, there was something else...  ...A couple of days ago I was in Women's Big &amp; Tall? --  and I heard these, urn, you know, these... noises.  Now don't get me wrong. I was against the Clinton impeachment. What a man does with his penis -- Oval Office, Women's Big &amp; Tall -- it's not for the American people to say.  But when you're dealing with children, a tender sensibility, a position of trust -- then perhaps, someone who has screaming orgasms with large women --  Though I can't fire him for that.  Sizisra. They'd say.  Not true. I am no siziat. But I can see the picket line now.  They'd all say, If it had been a supermodel or, uh...  But -- I can't help it -- the guy makes me uneasy.  So maybe there's something I could fire him for.  Do you? Do you think you could find something?    He's...    Nothing?  Oh.  Yeah.   Yeah. No. Of course not. I'm not advocating celibacy.  Yes.",
        "Mother": "Hurry boys, we're gonna miss Santa! She drags them across the street toward the looming art-deco monolith that is the big-city department store.",
        "Sue": "He ain't worth it, sugar. He got hit on last week. Didn't sit too well.  Another Grandad, Santa?  Got a name?  What do you do? I mean, after the holidays?  ...Another?  Why not.  ...Not a big talker.  Buy you one?  You're pretty regular, for a Santa.  Prove it.  Fuck me, Santa! Fuck me, Santa!   I got a thing for Santa Claus, I don't know, I guess it's from early childhood.  Maybe because my parents were Jewish and never celebrated Christmas. Santa was sort of forbidden, you know?  I like you. Most of the people around here are pretty uptight. My name is Sue. Here's my number.  ...Don't mothball that suit!   Mm.  Nice place you got. Needs a bit of a woman's touch, but it's really nice.  Thanks... So how long will you -- urn...  ...How long you gonna be here?  So what's the thing, you like kids?  Wha? I'm talking about you being Santa.  Oh. ...Well -- still -- I gotta thing for you anyway -- c'mere...  So I'll see you soon I guess, right?  Oh my God...    That was very nice. He's really a nice kid, isn't he?  What?  That's okay. That's okay.  There, there... There, there...",
        "Hindustani": "",
        "Troublemaker": "I know that's what you'd like to do!  Oh saved by a woman, mister No-Pussy- Please man!   ...This is not Flagstaff!   Buddy? I said, I am not gay!  ...Yes, but this isn't about that! You are queer as a ten dollar bill.  Who is the bitch now, fat man?!  Please little boy, I am doing this for all of us!  I think he has finished his cruising for tonight, hm?",
        "Boy": "Nintendo Deer Hunter 3.  Fraggle-stick car."
    },
    "imdb_rating": "7.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjA4Njg1MDcwN15BMl5BanBnXkFtZTYwMzAxNjM3._V1_QL75_UX380_CR0,2,380,562_.jpg",
    "description": "Willie T. Stokes is a convicted con man who's led a miserable life. He drinks heavily and constantly embarrasses himself publicly. He only works once a year dressed as Santa. But then come Christmas Eve, he and his pint-sized helper dwarf Marcus stage elaborate robberies and take their department stores for everything they got. This time around, Willie gets distracted by large women, a bartender who is attracted to Santas, and a kid who's convinced he's the real deal. However, Marcus must once again put up with Willie's heavy drinking and a series of incidents that constantly shoot themselves in the foot. Will Willie and Marcus make it to next Christmas? Or will this be the year the dynamic duo finally face justice?—halo1k",
    "name": "Bad Santa",
    "genres": [
        "Comedy",
        "Crime",
        "Drama"
    ]
}