{
    "filename": "Bamboozled_script.txt",
    "imdb_id": "tt0215545",
    "imdb_url": "https://www.imdb.com/title/tt0215545",
    "characters": [
        "Thomas Dunwitty",
        "Manray /Mantan",
        "Verna (as Gillian Iliana Waters)",
        "Pierre Delacroix",
        "Honeycutt",
        "Mau Mau: Big Blak Afrika (Julius Hopkins) (as Mos Def)",
        "Mau Mau: Jo Blak",
        "Sloan Hopkins (as Jada Pinkett-Smith)",
        "Mau Mau: 1 /16th Blak (as MC Serch)",
        "Mau Mau: Mo Blak",
        "Junebug",
        "Womack /Sleep'n Eat",
        "Orchid Dothan",
        "Mau Mau: Double Blak",
        "Dot"
    ],
    "dialogues": {
        "Thomas": "",
        "Dunwitty": "Monsieur Delacroix, this very important meeting commenced...  Dunwitty looks at his Rolex Chronograph - Daytona Model.   ...exactly thirty-two minutes ago.   I'm sorry I'm late.   Do you know how much information can be dispensed in one minute alone?   So are you telling me everyone knew about this get-together except you?   People, you can attempt to pull a Rodman like our friend Delacroix, but I guarantee you'll be sent packing just like him.  Dunwitty via remote turns off the lights and turns on an overhead projector.   These are the standings.  Read 'em and weep.  As you can plainly see the Continental Network System is languishing.   Look at 'em people.  We are BOOTY, CA CA.  We are DOO-DOO.  Doo-doo on a stick, if you will.   I do not like to be the laughing stock of the broadcast industry.  I have pride and people, you better start getting some too.  These numbers have to go up.  Dunwitty turns on the lights.  JOAN, one of the writers, raises her hand.   Question?   What I want everyone to do is write some material that is FUNNY.  The junk you've been writing is about as funny as a dead baby.  It's not funny, it's not new.  It's not sexy. It, it, it...   SUCKS.  Thank you, Fish.  This meeting is over but I want everyone to seriously think about what I said and how you can deliver.  People scurry out.   Monsieur Delacroix, in my office now.  8.     Delacroix enters his corner office, which has huge action photos of ALI, JORDAN, GRIFFEY, TYSON, AARON and JABBAR on his walls, it is also decorated with African art throughout.   Do you know what C.P. Time is?   Let's sit down over there.  9.   Dunwitty and Delacroix sit on the sofa.   I'm sorry about my blowup but I have to have a whipping boy every meeting.   Forget it.  I believe you're my most creative person I've got on staff.  You're hip.  You know what's happening.  I got some corny white boys and girls writing for me.  Delacroix doesn't join him in his laughter because he doesn't know how to take that comment or where Dunwitty is headed with it.   I understand Black culture.  I grew up around black people all my life. If the truth be told I probably know \"niggers\" better than you, Monsieur Delacroix.  Please don't get offended by my use of the quote-unquote N word.  I got a black wife and three bi-racial children, so I feel I have a right to use that word.  I don't give a damn what Spike says, Tarantino is right.  Nigger is just a word.  If Dirty Ole Bastard can use it every other word so can I.    The material you've been creating is too white bread.  White people with black faces.  The Huxtable's, Cosby, revolutionary.  But that's dead.  We can't go down that road again.   I'm telling you it's not.  He goes to his desk, picks up Delacroix's scripts and starts throwing them one by one against the window.   The middle class black family moves into a white suburban enclave.  The middle class black family moves into a small Southern town that is run by the KKK.  The middle class single black father raises his teenage daughter.  The middle class single black father raises his teenage daughter.  The middle class single black mother raises her teenage son.  And so on and so forth.  It's too clean, too antiseptic...   Delacroix, wake up, brother man. The reason why they didn't get picked up was because nobody - and I mean NOBODY - niggers and crackers alike wants to see that junk.   You got your head stuck up your ass with your Harvard education and your pretentious ways.  Brother man, I'm blacker than you.  I'm keepin' it real and you're frontin', trying to be white.   That's exactly what I think.  I want you to create something that people want to see.  Let's be honest, the majority of the people in the country are deaf, dumb and blind and I'm including 35 million African-Americans.  You know and I know \"niggers\" set the trend, set the styles.  This is a golden opportunity now.  These idiots have to be led to the water.   You will or you'll be back at BET so quick you'll never know what hit you.  I need a mid-season replacement and pronto.  It will be on the fast track.    12.    Yes!  Yes!  Yes!  I want a show that will make headlines, that will have millions and millions of households tuned in, glued to their televisions every week.  I want advertisers dying to buy on this show.  I'm gonna squeeze this show out of you if it kills you.    One by one, the team enters the office and sits down on the sofa.   Delacroix, I'm glad you got your mind right.   Good.  I like the names.  Very theatrical.   I'm wid it.   Go on.  Good so far.   Word!!!   The name of the show?   I'm lovin' it.  You know how I know? Because I'm getting a boner, my Johnson is hard, no disrespect my sister.  Dunwitty starts walking around his office, pumping his first.   I'm feelin' dis'!   Don't worry about that, that's my department.  Now who do we cast? We need a star.  Can Whoopi sing or dance?   Are these our two stars, sitting here in front of my nose?  Which one is Mantan again?   That's a great handle.   I want you take it there.  All the way to the edge and back.  Sloan looks at Delacroix with concern.   What are there character traits?   Exactly!   And Sleep 'n Eat is his comical sidekick?   This could be bigger than \"Amos and Andy.\"    31.    Let'em try.  I will kill to make this happen.  Delacroix looks at Sloan.   So what.  We would just give the NAACP a donation that would be the end of that.  No such thing as bad publicity.  So what.  Earlier you said singing and dancing.   Who are the other characters?   We gonna hit 'em wid da BOMB DICKEY on dis' one.  What's the setting?   Ya first bad move.  Projects been done.  That's one of the problems now, everything, movies, TV, are set in the urban jungle, da hood. That's so tired.  Mantan's Millennium Minstrel Show should be set on a plantation.  In Alabama.     32.    And every week these Alabama porch monkeys will make us cry, make us laugh, make us look at our own humanity.  Make us feel good to be alive.   What are you talkin' 'bout?  It's the move.  Stay wid me now.  We're movin' fast.  What does everybody else think about this?   I like you.  Sleep 'n Eat.  That's funny.  Mantan, how do you feel about performing in black face?   Show me a little somethin' somethin'.  Mantan starts to put on his new tap shoes.   Delacroix, you dug deep, deeper than deep.  Mantan is ready.    33.    That'swhatI'mtalkin''bout. That'swhatI'mtalkin''bout!  He's off the hiz-hook!   Sleep 'n Eat, what do you do?   Oh you do so?   You da man.    34.    I'm gonna run upstairs with this. If CNS doesn't want to do this, somebody else will have da balls to pull the trigger.  I want to thank each and every one of you.  This is great, Delacroix.  I'll get back to you later today.     To hire someone solely on their ethnicity, gender or religion is not right.  It's un-American.  I will hire someone who is most qualified for this particular job.    45.    I want a hot, young white director. Maybe the kid, that pheenom who just did that hot new sexy Madonna video.   I just want you to meet him.  Keep an open mind.   Probably nuthin', but that's why it's such a sexy way to go. Sometimes an outsider has a fresh new outlook, a different unique perspective.  A black director, y'know what he's gonna do given the subject matter?  With this kid, the possibilities are endless.   If Spielburg can direct \"The Color Purple\" and \"Amistad\", our whiz kid can direct the Mantan pilot.   No!!!  Just meet the guy.  That's all I'm asking.  Look, I'll even let you choose your own musical director.  You can have that.    46.    Derrick Coleman, he possessed all the talent in the world, coulda, shoulda, been a great ballplayer but alas D.C. didn't want it bad enough.  Delacroix, do you want it? Bad enough to kill for it?  Do you want it that much.  Delacroix stares at Dunwitty.   Delacroix.  This is the director I was telling you about.  Jukka Laks.   I'm gonna leave you two creative geniuses alone.    Delacroix charges in as Dunwitty and Jukka go over the same \"pink\" revisions.   Calm down, please.   We just punched it up a bit.  Made it funnier.   I seriously doubt that will ever happen.  Didn't I tell you I know your people better than you do. But if by some miracle you're correct, I'm gonna invite them inside my house and we'll have a sit down, discuss it like civil human beings.   I want you to meet my lovely wife Verna.  Honey, this is Pierre Delacroix and Sloan Hopkins.   Yo, DeLa, I just got the news from the CNS brass.  They saw some clips from the pilot and they're rushing it onto the air.  Yo, we're a midseason replacement, ordered 12 shows.  We're on in 3 weeks.  Didya hear what I just said, Yo?     They didn't even view a rough cut, just some scenes we quickly cut together.   The big mistake was my not believing in your genius earlier.  From the gitgo, from jump street.   I want to meet her one day, please tell her the great news.  I'm OUT like Vanilla Ice.    Dunwitty, Delacroix and Sloan are joined by a young Caucasian woman, MYRNA GOLDFARB.    87.    I know all of you have seen the overnight ratings.  Through the roof.  But in this game you gotta be one, two, three steps ahead.  I introduce you to Myrna Goldfarb. She's the best media consultant in the biz.   Myrna is here to help us plan our strategy.   Goldfarb, run it down for them.    88.    We all stick to this, it's smooth sailing.   Let Myrna finish.   Yes you!   You couldn't hold out any longer, huh?   Stop the tape.  Stop the tape. Delacroix.  Get me Delacroix.   Drop the curtain.  Drop the curtain.  Bunning drops the curtain.  Security rushes onto the stage and grabs Manray.   Escort him out the building now!   But you are finished.  Done. Nigga's like you are a dime a dozen. I'm gonna slide Honeycutt right into ya spot.  We won't miss a step. Get him outta here.  The security guards move Manray as Dunitty glares at Delacroix.  Honeycutt is all smiles, he's being bumped to the top.   DeLa, I'll deal with you next.   123.    Hello, my name is Thomas Dunwitty. I'm the Senior V.P. of the entertainment division here at CNS. I come to you with a heavy heart.   This abduction is a cowardly, vile, sinful and dastardly act and I promise these creeps will be prosecuted to the fullest extent of the law.  This is an attack on your American way of life...   We here at CNS are offering a $100,000 cash award to any information that leads to the safe return home of our dear friend, Mantan.   127.      Help us and in addition you will get a guest-starring speaking role on the next Mantan - The New Millennium Minstrel Show, plus an added bonus: a lifetime of Da Bomb 125% Malt Liquor.  Let's you get ya \"freak on\", as well as a full wardrobe of Timmi Hillnigger Active Git Toe Wear.  Mantan, may God bless you...",
        "Manray": "Well do something about it.   I'm starvin' like Marvin.   Hurry up, I wanna watch HBO.   I guess that will come with the rent, gas, and Con Ed bills, too.    13.    Yo, check it.  This is good and all that but one day soon I want to have much Benjamins so I can have a nice crib and pay all my bills. You hear me.   And I'm the feet.   I'm tired of waiting.    They both are devouring the chicken with rice, as they watch bootleg HBO.   My tap shoes.   We ran out without my shoes and the floor.  I gotta get my stuff.  What about our savings?   Sloan!  She knows us.  The security guard stops.   We got evicted from our home. We've both been on the streets for the last week.   If it's not too much trouble could you order us some food?   What do I have to do?   Where do I sign?   How different?   DeLa, I'm aboard.  As long as I get to hoof and get paid too!!!   Bet.    23.    To what?   Mantan?  I don't even care as long as I'm dancing.  Which reminds me, I need some new kicks.   I never had a really real pair before.   Not a class, not a thing, just picked stuff up by myself.   You sing and dance?   So what's up with you and DeLa?   Are you and him kicking it? Knocking boots. Y'knowwhatI'mtalkin'bout.    24.    I'm sure that was the only thing he was impressed with.  You look beautiful like that.   You're welcome.  You shouldn't give up on performing.   I think that would probably make you the happiest.  When I'm hoofing, I mean really doing my thing, hitting it, nothing compares to that feeling in the world.   How do you do?   Why?   DeLa, I don't know 'bout this.   Mantan?   I'm not playin' myself no mo'.   I won't do it anymore.   I'm always gonna be that.  But I ain't doing no more buck dancing.   No.  No.  Manray leads the way to the stage.   Cousins, I want all of you to go to your windows.  Go to your windows and yell, scream with all the life you can muster up inside your assaulted, bruised amd battered bodies.     I'm sick and tired of being a nigger and I'm not gonna take it anymore.    He collapses onto the stage and the AUDIENCE sits on their hands.  Manray gets up and begins to dance.   I wasn't finished doing my dance.   Whaddup?  No one comes out.   Whaddup?  The doors open and the Mau-Mau's file out.   Don't start none, won't be none.  The Mau-Mau's are dying laughing.  Manray tries to walk through them.  They block him.  Manray attempts to climb over the suburban.  He's quickly nabbed, give a good ole Brooklyn Beatdown, then thrown into the rear of the vehicle.   What did I do?    His face says he can't believe this is happening.   For singing and dancing?   If you're gonna kill me, kill me.   There is nothing you can do to me. I'm wearing the taps of Bill \"Bojangles\" Robinson.  Manray is shot in one foot.  Then the other.    He dances like his life depends on it.  Despite the fact his feet are a bloody mess.",
        "/Mantan": "",
        "Pierre": "",
        "Delacroix": "Satire.  1a.  A literary work in which human vice or folly is ridiculed or attacked scornfully. B.  The branch of literature that composes such work.  2.  Irony, derision or caustic wit used to attack or expose folly, vice or stupidity.   Bonjour, my name is Pierre Delacroix. I'm a television writer, also a showrunner, a creative person.  We see a tall figure move in and around the space.   I'm one of those people responsible for what you view on your idiot box.   The problem is not enough of you have been watching.   With the onslaught of the internet, video and interactive games, nine hundred channels to choose from and whatnot, our valued audience has dramatically eroded.   To put it in much more simple terms...  Delacroix YELLS.   Like rats fleeing a sinking ship.   People tuning out by the millions.  Delacroix turns to the CAMERA and addresses US.   Which is not good.   Good morning, Cheeba.   De-la-croix.   Not yet.  Delacroix hands Cheeba a ten dollar bill.   Manray, Sloan says you're too talented to be dancing on the street.   Good morning, Marie.   What staff meeting?   I didn't find out about this very important staff meeting until...  Delacroix looks at his Jaeger-LeCoultre.   Four minutes ago.   I wasn't told about this until Marie informed me as soon as I got off the elevator.  All eyes are on Delacroix and he feels it.   Why didn't you tell me about this staff meeting?   What good are you if you don't tell me stuff like this?   C.P. Time is Colored People's Time. The stereotypical belief that Negroes are always late.  That Negroes have no sense of time - time except when it comes to music or dance.  They both laugh.   I understand.  But again, in all honesty I was not informed.   I would prefer you not use that word in my presence.   Say it again.  C'mon, say it again.   Who's a nigger now?  POW.  This is a fantasy in Delacroix's mind.  We go BACK TO REALITY.  Everything's how we left it.   I don't agree.  The Negro middle class does exist, and it's rich material for a dramatic series or sitcom.   ...to white?  I still feel all of my scripts would make good shows.    11.    I've never been given a fair shot.   I'm an oreo, a sell out?  Because I don't aspire to do HOMEBOYS FROM  I'm not sure if I can deliver what you want.   What is it you want from me?  Some plantation follies?  Some sitcom that takes place on a watermelon patch?  Some show that follows four nigger generations of junkies and crackheads?  You want me to go back to the ante bellum days?    He sits in front of a large flat-screen television, watching the Yankee game and eating his takeout Chinese food.  On top of the monitor, he has attached a sign that reads \"FEED THE   Delacroix sits at his desk, a ream of white bond paper in front of him, a box of number-two pencils and an electric pencil sharpener.   I was never good at performing under the gun.    14.    Well, this wasn't a gun, it was a bazooka and it was pressed dead blank right against my dome.    Delacroix grabs a pencil and put it to paper.    Delacroix is already in the bed, the lights are out.       The phone rings.    Delacroix picks it up.  They yell in unison.   Manray!   How did you know?   How can this be?  You and me at the same time, the exact same thought. It's scary.   Manray was under our nose the whole time.   Not yet, but this thing will never get made.    18.    Dunwitty wants a Coon show.  And that's what I'm going to give him, it's going to be so racist, so negative, he won't have the balls to put it on the air.  Hence I'll prove my point.   The point being that him, the networks don't want Black people on television unless they are buffoons.   You getting cold feet?   Good.  I'm going to need your support.   And lose out on my money?  The only way I get paid is if I get fired. And that's what I intend to do.   Everything was going according to plan.  I was working on the outline. Dunwitty was off my back for now.   But there was a catch.  A big catch.   Manray and Cheeba were nowhere to be found.   It was like they had disappeared off the face of the earth.   I had no contact numbers, no address, no beeper.   No nuthin', no clues...   Manray better not be bleeding to death.  I need him.  After we're done he can do whatever he wants to do, until then, he's ours.    20.     He sits in front of his TV and watches a tape of the old \"Amos 'n' Andy\" show.  Sloan leads Manray and Cheeba in.   Eureka!  Where've you been?  He hugs them both.   Sloan and I have been looking all over for you.   No offense.   I apologize.  What would you like to eat?  Anything you want.    A feast of McDonald's is taking place.  Cheeba and Manray are stuffing Big Macs, Fish Deluxes and large french fries into their mouths.  They were famished.    22.    I have this concept for a TV pilot. There's no guarantee it will get made but regardless, you'll still make some money.   First things first.  I have to know if Manray is up for this.   Some tap dancing, some singing.   Different.   Trust me.  Of course I still have to pitch it to my boss, but we'll have an answer one way or the other.   That's right.  Money turns the wheel.   You'll both get an advance and you can stay with me.   I would like to change your name.   You're now Mantan.   It's right and tight.  Good morning, let me introduce you to everybody. You know my assistant, Sloan.    28.    This is Cheeba.   And this is Manray.   We're all happy to be here and I'm going to paint a picture for you.   I've done a lot of soul searching and once again you are right.  In my previous work it's been all surface, superficial.  I have never really dug deep.  Not anymore.  As Mark Twain fully understood satire is the way.  Race has always been a hot button in this country's history and it needs to be pushed harder.  If we are ever to live side by side in peace and harmony. It's about promoting racial healing.   I know you're familiar with minstrel shows.  They came about at the turn of the 19th century.  It was a variety show in which the talent was in blackface - singing, dancing, telling jokes, doing skits. Dunwitty, I ask you when was the last time there was a good variety show on the air.  Carol Burnett? HeeHaw?    29.    So let's take this great form, this very American tradition of entertainment into the 21st century, into the new millennium.   It is called: MANTAN - THE NEW  It will take a lot of courage and backbone on the part of the CNS to get this on the air.  In fact, I would understand fully if the subject matter is deemed too risque, too controversial.   I don't know if Whoopi is the way to go.   And Cheeba is Sleep 'n' Eat.   Mantan and Sleep 'n Eat.  Two real coons.  I know we're way out there but it's satire.   Every week we follow the trials and tribulations of two real coons - Mantan and Sleep 'n Eat.  The Dusky Duo.   Ignorant, dullwitted, lazy, and unlucky.   Mantan is an uneducated Negro who always by some stroke of unbelievable stupidity makes his best laid plans go haywire.   Yep, you guessed it.   Protest finally forced \"Amos and Andy\" off the air.  Could stop us from ever getting on.   Negroes would be in an uproar.   Mantan right here is a gifted hoofer.  He has educated feet.   Do we have characters?  How about Honeycutt, Snowflake, Rastus, Nigger, Jim, Sambo, Jungle Bunny, and how could we forget Aunt Jemima.  Dunwitty is dying with laughter.  He's the only one.   In the projects.  Like Eddie Murphy's \"The PJ's.\"   I don't know about that plantation angle.   We think so.    Delacroix sits with Manray and Cheeba in the living room.   I want you to start using the name Mantan and not Manray if you don't mind.   You have to start getting into your character.   This is Mantan Moreland.   He was a clown, a buffoon but he was funny.   Gentlemen, the show, our show will be satirical.  You know what that is, don't you?  Trust me on this one.   That can be done.   Mantan!!   It looks delicious.   C'mon, Mommy, don't start with that I'm an ungrateful son stuff.   Can't beat it with a hammer.  Well, since you asked, it looks like I may have a new show, a pilot being shot.   It was.  It is.  But this is a different kind of show.   Mommy, please don't call me that.   I know what's on my birth certificate.  You heard from Daddy?   To answer your question, there are a lot of Negroes in it and what is your definition of buffoons?   Please let me know when you hear from Daddy, get a number or something.   I feel like somebody hit me upside da head with a sledgehammer.   I'm happy for all of us.  It's just we have a great responsibility now. The pressure is on.   I didn't mean it to sound like that.    41.    Now I'm privileged?!  Why?  Because I didn't grow up on food stamps and welfare?  Because I didn't call home a cardboard box?  No, I never ever went to bed hungry and I'm proud of it, too.  Whoever told you that living in poverty earns you somekind of badge of honor flat out lied to you.   My problem is MANTAN THE NEW  It was the principle.  Dunwitty had to be enlightened.  I was making a point.  I take pride in my work. Plus, I already told you I wasn't gonna walk away from my money.   Even if money wasn't an issue, Dunwitty will still go ahead without me and that could be more dangerous.   I wouldn't bet against it.  My Negroidal ass is stuck between the proverbial rock and a hard place.   I strongly feel that a Negro should direct this.  This kind of satire is a high wire act in a gale storm. One misstep and we're doing \"Amos and Andy.\"  Only a Negro will have the sensitivity and cultural awareness to navigate this dangerous terrain.   I was hoping to perhaps direct some episodes myself, if not the pilot soon after.   You're telling me some white boy is gonna direct this pilot?   Besides, what does he know about Negroes?   What are his qualifications besides being a white male and directing a hot new sexy freaky Madonna video?   That's exactly my point.  Has he even directed actors before in anything?   In the immortal words of Derrick Coleman, WHOOOPDEEDAMNDOO!!!    All of the writers are Caucasian - male and female.  Every single last one.   Good morning, for those of you who don't know me, I'm Pierre Delacroix. I'm running things and this here is my assistant Sloan Hopkins.   I've never worked with any of you and you've never worked with me so we'll be starting from scratch. I'm a fair person, a straight shooter and I don't hold my tongue. Everybody up in here should know I had nothing to do with you being hired.     47.    I would have preferred at least one other Negro writer.  Any questions? Comments?  MONA raises her hand.   Yes, your name?   Hi, Mona.   Oh, is that what I'm doing?  BETH jumps in.   I've heard this somewhere before.  David raises his hand.    48.    This thing was rigged, the deck was stacked, the fix was in.  Could Don King be near?  Good thing Sloan had my back.  She's my rock.  This was going to be a whole lot of work.   David, I appreciate your comments. Anybody got an ideas?  Everybody just talk out loud.   The mission was accomplished.  All of these people left the room thinking they would have real input. I was writing this pilot alone, myself, me.   Now came the fun part, finding the talented performers to cast in the show.  WE DOLLY past the hundreds and hundreds of unemployed African American actors, many of them dressed in various costumes.    50.    Everybody and their mother was trying to get in, trying to be seen. Trying to get their piece of the rock.   This was amazing.  Who had told these Negroes that this was what we were looking for?  The same old image, it damn for sure wasn't me.   Were people this desperate to get work?   Thanks, Ms. Lulu.   That's good.  We've seen enough. We'll get back to you.  Lulu scurries off stage.    51.    Which one is your brother?   What's your name?   And what are the Mau-Mau's going to do for us today?     We're ready when you are.     Good.  We're really blacked-oops, backed up, so shall we begin?    A look of disbelief is on his face.   Needless to say, the Mau-Mau's did not fit into our plans.   As I told Sloan, there's a black sheep in every family.   Finland.  This is a travesty.  A debacle.  A mockery.   Nice to meet you.  If you don't mind me asking you - how old are you?   Dunwitty, don't leave.    54.   Dunwitty is out.   Where are you from?   Finland.   Yes, I know.  Jukka, have you ever seen a Negro person before?  Even had a real conversation with a real Negro before?   A fiasco.  A disaster.  A boondoggle. An abomination.   Did you just ask me what's a Negro?  Well before there was BLACK or AFRICAN AMERICAN, there were  How did you get this gig?   This is a TV show, not a music video.   This is a travesty.  A debacle.   I'm gonna slit my wrists.  Cut my throat.  For the love of Joseph.    He's sitting behind his desk, reading new \"pink\" revisions of the \"MANTAN\" pilot.  He screams.   For the love of Joseph and Mary.  Delacroix bolts out from his office.   I will not be held responsible for these revisions.  These changes are not the way I want to go.  This is an outrage.  This is a sham.  A violation!   I don't give a good goddamn about Finland, Norway, Sweden or wherever ya blond ass came from.   Funnier to who and at who's expense? Dunwitty, when Negroes start to run amok, the boycotts, when the demostrations commence, I'm giving them your home address.  Let's see how you like it when they picket your lawn in Greenwich, Connecticut.   Just want to say good luck.   Wait a minute.  Hold up.  They all laugh.    57.    Can I kiss you too?   You feel good, not nervous?   Not nervous?  Relaxed?   Fired up.   The material is fine.  Sloan cuts a look at this liar.   We're trying to do something new here, some groundbreaking stuff.   Your life will never be the same.   What do you want me to say?   Good luck, Jukka.  Do a good show.   Same here.   I guess it was divine inspiration.   I was trying to be nice.    60.    C'mon.  You were only doing what family is supposed to be doing for family.  You gave your brother a shot.  That's all anybody can ask for, an opportunity, a chance, a shot.  He got his.    Delacroix looks like he has seen a ghost.    Delacroix is in the same position as the scene before.  Face buried in his hands.   Hello?    66.      This has to be a big mistake.   Hold on a sec, I got a call.   Hello, Mommy, let me get rid of this other call.   I gots to go, it's my Moms.     I'll be right over.   He said that?   Where is he?   I can't go all the way down south.    68.    I don't even know why you're still concerned over him.  Daddy's not with you.   It's gonna be hard for me to get away with the show taking off.   C'mon, Mommy.  Daddy hasn't been impressed with anything I've ever done.  From winning my fifth grade Spelling Bee to the present.   I figured this was a good time to get away.  Just jump in my ride and go.  I always did my best thinking when I was driving alone.  I needed to think out clearly what I was going to do with this MANTAN - THE   This must be a big night in here because the PATRONS are dressed to the nines.  What's in style down here is a lot different from what's happening en Nueva York.  Many of the men are dressed like PIMPS from 70's BLAXPLOITATION FILM, the ladies like HOOTCHIE MAMAS from \"Luke\" video.    He looks around.    It's dead in here.  The room is nearly empty.   Brother man, that's my father up there and I drove a long way to see him perform.  Please take this fifty, go buy you and the young lady some drinks in the club.  The guy looks him up and down.   I want to speak with you.   It's me, Peerless.   It's been a long time.   Pleased to meet you.   Is that so?   Daddy, she's younger than me.   I thought you had promised Mommy you stopped.    73.    How did you end up here?   That's what I'm askin'.   Daddy, it can't be just because of that.  There had to be other factors.  Junebug pours himself another stiff one.   Another one of your conspiracies to hold ya career back?   The same old, same old.  Trying to get my stuff through.    74.    Nuthin' I can't handle.   Where do you go from here?   I didn't mean that, in life.   Let's get him over to the bed.   I love you too, Daddy.   How long has my father been like this?   So he drank himself into a stuper?   So what's up with you?   Don't tell him it's from me or he won't take it.   He never showed it.   My Daddy.  I'm not mad at him.  Not at all.  Junebug was the reason I got into this business in the first place.   And I thank him for that.  However, it did me no good seeing him in that state.  Daddy was a broken man. He had been a strong man, with conviction, integrity, principles and look where it had gotten him. I had to ask myself did I want to end up where he was?   That was the last time I ever saw my father.   Who's side are you on?    He sits in front of the television, which is off.    83.    It was the Day of Reckoning.  After a massive advertising and publicity campaign...   ...the public would finally get a chance to view Mantan.  I was feelin' a little bit like Dr. Frankenstein.   What would their reaction be?  I hadn't the foggiest.   I was sunk, dead.  My goose was cooked.  The cat was in the bag and the bag was in the river.   Why are you here?   I thought it was the other way around.   These are black folks we're talkin' about, not some lab mice in a cage.   Yeah, show dem pearly whites.  She ignores him.   Me?    89.    I'm not black.  I'm a NEGRO!!!   A small victory isn't that small when you've been use to losing.    Sloan hands Delacroix a wrapped gift.   What is this?   For what?   The Jolly Nigger Bank.   Thanks.   Is that good or bad?   How so?   Because race has always been a sensitive issue in this country. Gary, I have no problem with people disagreeing with the show, it's when folks start trying to mess with my inherent right as an artist, that's when I get mad.  No one, in any way, shape or form should be censored.   Yes.  And I say yes because who is to judge?  Who is to stand before us and say this is righteous and this is not?  Who?  Who can play God?   Don't you people get it?  We're in the 21st Century.  Slavery was over four hundred years ago.  All that stuff people talked in the old days, it's over.  Folks always crying, white man this, white man that.  Let's all grow up.   Can I finish?  Thank you.  I had a great Aunt, we called her Sister. She went to her grave not believing man had walked on the Moon.     92.    When I was a little kid, I would argue with her, \"it's on TV.\"  She would answer \"I don't care what's on that idiot box.  No MAN is on the MOON.\"  Well, there are a lot of your Negroes just like my Aunt Sister.  Face up to it.  The world has changed and if you don't adapt, change with it, you will be left behind.  This show is a parody. Are you telling me that nobody can use some humor, have some laughs in their lives?  Is that what you're telling me?   When American people want something, they want it now, they want it big.   They wanted the hula hoop...   They wanted their yo-yo's.   Who could ever forget those lovable pet rocks.   Beanie Babies...   Now the latest, hottest, newest sensation across the nation was...    It was the rage.   The Mantan - The New Millennium Minstrel Show at www.nigger.com was getting 500,000 hits a day.    Delacroix has now decorated his entire office with Black Collectibles Art.  WE SEE black jockey lawn pieces, banks, mammies, signs for products, etc.   So they can be on TV.   This is nothing.  It will blow over by tomorrow.   Tomorrow it will be all about cruelty to animals or some sex scandal.  Besides, there is no such thing as bad publicity.  He hands Mantan a wrapped gift.   Rest your mind.  It's a little somethin' something.  Mantan opens it.  He pulls out an old pair of tap shoes.   Those were the last pair of tap shoes worn by Bill \"Bojangles\" Robinson.  In fact, he died with them on.  Mantan starts to laugh.   No joke.  Serious.   In time.   To my astonishment, not only did the people in TV land love us, but also the critics. _  102.      Mantan was being hailed as groundbreaking, barrier breaking, also earth shaking.  I looked forward to my awards.  Just vindication for all my hard work, all my talent that had been previously overlooked.   Alec Baldwin, this is the very first time we've ever met, you don't know this, I'm your biggest fan and I want you to have my Emmy. It's for you, out of the deep bowels of my heart - I don't deserve this.  You take it.  Alec Baldwin is shocked.  He grabs Delacroix in a bear hug and they both cry like babies.   If I did that I'd be assured to work forever.  Delacroix the grateful Negro.   That routine would go over like gangbusters.  I would be a dancing fool, Hollywood's new favorite Negro, move over Danny, Morgan, Samuel L., move over Whoopi.   I had it all planned.  To the T.   Pull ya self together.  Mantan is distraught.   What are you?  A man or a mouse? Are you a punk?  Punking out on me?   You getting scared because some people don't like what you are doing?   You've made it from the guttermost to the uppermost.  Don't you know you should never let them see you sweat.  Y'knowwhatI'msayin'?   And now is definitely not the time to bitch up.    Sloan turns off the TV.   Why'd you do that?   How long have you and Hambone been hangin' out?   That crazy brother of yours doesn't think so.   Oh, is he?  You getting jiggy with Mantan?   Dunwitty and I feel you've been getting too close to him, getting his mind all messed up.   Do you have to be so damn forthright?   113.    Light?   You can talk all that mumbo jumbo if you want to but your hands are much bloody.  I know where I made my big mistake.  I have a general rule, never get involved romantically with somebody crazier than you.   This is crazy.     The first and only time.  A big mistake.  I'm gonna have to ask you not to see Mantan anymore.   Otherwise.  I trust you know the difference.  You're an intelligent woman, finished at NYU.   And that's how you got me in the first place.  Sloan pulls a 3/4 inch cassette out of her bag and hands it to him.   You shouldn't even be mad at me over Sloan.   Oh, is it?  Buddy boy, in this business if people don't produce, they get fired.   Let me ask you a question, if I may. How do you think she got the job in the first place?  I don't mean to burst your bubble, Mantan the Marvelous, but Sloan is an opportunity.   Do I have to spell it out for you? In fact, go ask Sloan yourself.   115.     Delacroix sits behind the desk.  He's bought even more Black Collectibles, he's surrounded by them.    He dials the phone.   Hello, Mommy, how are you?   117.    You going to attack me too.  The show is a hit.  Aren't you happy for me?   Yes I have, very hard.  Has Daddy called?     Not at all?   If and when he calls, please don't forget to ask him if he's seen Mantan.   Soon.  Delacroix hangs up the phone.  He takes out some change from his pocket and puts a quarter in the hand of his Jolly Nigger Bank.    He is incredulous.   When I thought or imagined that my favorite Jolly Nigger Bank, an inanimate object, a piece of cold, cast iron, was moving by itself...  Delacroix slowly, carefully approaches the bank and picks it off the table.   ...I knew I was getting paranoid. Did I really see what I saw or was I buggin'?   Delacroix.  What?!  I'll be right down.  Dunwitty looks at him.   Mantan, we got a show to tape.   Kook and the Gang, it's Manray. Let's do the taping.  You go back to your dressing room, get dressed and blacken up.   How you sound?   Manray, I'm very sorry about ya boy Cheeba and Sloan.  Believe me, it gave me no joy pulling ya coattail about her, just lookin' out for a brother.  I feel you, all this stuff happenin' at once but you can't let if affect your work.  You gotta be professional.   No costume.  No blackface.   121.    And I should put my foot dead up in yo' ass.   The Mau-Mau's had come up with a brilliant, sadistic plan to broadcast Mantan's execution LIVE over the internet.   The Mau-Mau's sent anonymous e-mail proclamations to the websites of CNN, ABC, MSNBC and CBS.  It was an invite to witness the Dance of Death, 9 PM, prime time, tomorrow night on a site to be designated at a later date.   It's no joke getting grilled by the FBI for five houts.  Delacroix SCREAMS.   I don't know anything.   Somehow, someway, somebody had tipped the sharks off.  It was a feeding frenzy.  Delacroix and Cheeba start pushing people out of the way as they get in to their waiting car.   126.    The X-Force was brought onto the case.  When something involves the internet, these are the people IBM, XEROX, the CIA, FBI, even the US Government go to.   It was a race against time.  The Dance of Death.    He's watching the same.   There oughta be a law...   SWAT teams all up and down the East Coast busted in on known dissidents looking for Manray.  All the tips called in, info gathered through surveillance proved for naught.   Thank you for your help.    He sits in front of his GIANT SCREEN, on the desk in front of him is the 3/4 inch cassette Sloan gave him.  He picks it up and turns it on.   It was ten o'clock and the Dance of Death was about to commence.   129.    Since a lot of people still didn't have computers, the networks sought a court order to carry it live, taking the feed off the internet. It was granted.  A life snuff broadcast right into your living room.     I had to give it to the Mau-Mau', they definitely had a sense of irony.  They chose www.nigger.com as the website to pirate.     He screams at the monitor.   Don't dance.  Don't do it.    Delacroix's head is on his desk.  He has been crying.  On cue the Black Collectibles start to move.  The Jolly Nigger Bank, Aunt Jemima's, Mammies, etc., they are animated for   His head pops up as he sees the objects.  He too is in BLACKFACE.  In a rage, he starts to throw them against the wall.   Leave me alone.  Get away from me. You spearchucker.  You black sambo. You nigger pickaninny.  Fat Mammie.  Delacroix has finally lost it.  He looks at the shambles he's made of his office.    Delacroix is on the floor when the doorknob turns.  It's Sloan and she has a gun in one hand and her inhaler in the other.  She's wheezing like mad.   I didn't think this was in your studies at NYU.  Delacroix hits the PLAY button.   I'm sorry.  I didn't know anyone would get hurt.  I'm sorry, please give me that gun before you hurt yourself.  Give me the gun.  He reaches for it.  BOOM!  Sloan screams.   Give me the gun.  She reluctantly hands it to him.   Go, get out of here.  Go home.  Sloan runs out.  Delacroix slumps to the floor, WIPES HER FINGERPRINTS off the revolver.   134.     He looks at the monitor, the tape still playing.   As I bled to death, as my very precious life oozed out of me all I could think of was that I never made my father proud.  My mother didn't count.   Everything I did, no matter how great or small, was always extraordinary to her.  With Daddy it was a different ball game.  He never saw me.  Pierre Delacroix.    A pool of blood has formed around his dying body.   Now it was time to buy the farm, for me to meet my maker.  Goodbye cousins, and please tune in next week for the Best of Mantan - The New Millennium Minstrel Show.    He looks at Mantan.   For the love of Joseph and Mary, what have I done?  My God, what have I done?!  Delacroix slumps over dead.",
        "Honeycutt": "Everybody say Ho!   That'swhatI'mtalkin'bout! That'swhatI'mtalkin'bout!  I want to be the first to welcome you to the second taping of Mantan - The New Millennium Minstrel Show.  Audience applauds.   My name is Honeycutt and I want to try something different.  Can you do this for me?     I'm gonna start a chant and I want y'all to follow me.  Let's make our own 2 real coons know you're ready to start the show.   Let's go Niggers.  Then clap five times like this.  Honeycutt claps the cadence.    78.    C'mon.  It's easy.  It's the same thing y'all do out at the Yankee game, no different 'cept we changing one word.  Everybody go it?     Alright.  Here we go.  Let's go  Louder.  They can't hear you.   You sound so good to me.  Ladies and gentlemen, boys and girls, without further adieu, let's welcome youknowwhoI'mtalkin'about, your two favorite coons, Da Dusky Duo, our stars Mantan and Sleep 'N Eat.  The audience goes crazy as the curtain goes up and the house band kicks in with the Mantan theme.   Calling all my cousins, you're about to take a trip down to Hang 'Em High Plantation, home of your two favorite coons, Mantan and Sleep 'N Eat.   Mantan - The New Millennium Minstrel Show is proudly sponsored by...   ...Da Bomb.  We'll take you there. And...   ...Timmi Hillnigger.  Keep it really real.     We will be right back with the start of our show, but first, a word from our proud sponsors.    He's in the spot, he's the spokesperson.   DA BOMB.  Yo.  It's 125% pure pleasure MALT LIQUOR.   Clinical testing has found that Viagra doesn't work on black \"johnson's.\"  That's why our scientists developed Da Bomb for you.  It makes you feel like a MAN and it makes dem bitches feel like Natural Women - I mean Ho's.   DA BOMB - 125% pure pleasure malt liquor.  Honeycutt takes a big swallow from his 64 oz. Jugular.  Two statuesque ladies sandwich him, grinding up on Honeycutt. He takes the jugular from his lips.  As he speaks, flames come out of his mouth.   Oooooo-weeee!!  Da Bomb makes me wanna get my freak on.     Let's have a warm nigger applause for our two favorite coons, Mantan and Sleep 'N Eat.  TWO REAL COONS!   Thank you so very much.  Show me some love.  He laughs.   Thank you.  My name is Honeycutt and I want to welcome you to a very special evening.  It's always great coming back to the World Famous Apollo Theatre.  The audience applauds.   As everybody knows if you can make it here on this stage in front of the most discriminating audience in the world you can make it anywhere. Ladies and gentlemen, let's show some real Uptown love for Mantan The Marvelous!  The curtain goes up and Mantan the Marvelous stands there, arms raised.  He starts to do his thing.   107.    Is you a nigga?   Ma'am, is you a nigga?   Are you a nigger?   Are you a nigga?   You.  You.  Him.  Her.  We're all God's niggas.  Even the lost souls who don't know it are niggas cuz niggas is a beautiful thing.   We apologize for the holdup but without further delay, ladies and gentlemen, boys and girls, let's give it up for Mantan.   C'mon, don't be niggardly, give it up.  Show Mantan some love.  The CURTAIN RISES and MANRAY stands before them in his regular street clothes and NO BLACK FACE.",
        "Junebug": "He is a good-looking man, the only speckle of gray in his hair betrays his age.  As he walks around the small stage doing his comedy stylings, he keeps a drink in one hand and sips it often.     'Cuse me.  Please.  Can you please show me some respect.  I'm up here trying to make a living.   Don't make me have to come over there and whoop you upside ya head.  The sparse AUDIENCE laughs.   Just messin' with ya.  But please if you and your lady need to discuss something, take it outside. Thank you.  He continues on with his show.     Don't bring your woman out if you can't keep her in deep check.  If my woman ever did something crazy like that I'd put my size 12 dead up in her ass.  This gets the biggest laugh of the night.   What do you want?   Go away, unless you got my money.   Son.  Good to seeya.  Good to seeya.   Pull up a chair.  Oh, excuse me, this is my lady DOT.   Honey, pour me and my son a drink.  They both sit down as drinks are poured.   Good woman.  I trained her right.   My game is still strong.  No Viagra for me, don't need no chemicals. Just my tonic.  He holds up his drink and kills it in one gulp.   Purely for medicinal purposes.   I did.  I'm not an alcoholic.  I just like to drink.   How did I end up at the third rate chittlin' circuit greasy hole in the wall in West Hell, Virginny? Is that what you're asking ya Daddy?  Delacroix takes a sip of his drink.   Because I had too much pride.  Too much integrity.  I wouldn't lick nobody's butt.  Some material I refused to do.   That's the only reason, period. They only want one certain kind of black comic.   All I know is what happened to me. All that other mess I just file into the \"life's too short\" category.  He downs another one.  Junebug drinks like a fish.   Enough about me, what's happening with you?   Dem white boys giving you a hard time?   The truth is never let them seeya sweat.  You do that, that's half the battle.   Three nights Charleston, South Carolina.   In life?  I'ma keep on living, having a good drink, got me a good young woman, make a couple of dollars and make people laugh. Haven't I always tol' you all nigga's are entertainers?  The question is what are you gonna do, Peerless?   I'm not an alcoholic.  I just like to drink.   Baby, you treat me so good. Peerless, you're a good son, I love you.  You never gave me no trouble.  They lay him down on the bed.   Always keep 'em laughing.  Dot takes off his shoes.  He's out like a light.  Gone.",
        "Orchid": "You must think I'm some kind of fool.   You hear me talkin' to you.  The only time you come up here when something is wrong.   I said no such thing.  All I said is that something must be wrong.  She sits down with him.   How's the food?   That's wonderful.  Isn't that what you always wanted, a show of your own?  He talks between mouthfuls.    39.    If at first it's not what you want, just work that much harder, Peerless.   Son, Peerless is your name.  Now you might be one of these Hollywood types, change your name and all that but Peerless Dothan is on your birth certificate.   I guess he's still on the road. What kind of show is this?  Are they some Negroes in it without being buffoons?   Peerless, I didn't raise a buffoon. We have enough of those on television already.   I will.  And good luck with your show.  I hope it's a huge success. You've worked very hard.  You deserve it.  Delacroix gets up from his seat and hugs his mother.    40.     She is on the phone with her son.    67.    Peerless, your father called.    Delacroix sits at the kitchen table.   He wants you to come and see him.   Yes he did.   He's performing at some place outside of Richmond, Virginia.   Richmond is not all the way down south.   Regardless, he still is your father.   Even more reason to see him.  He'll be overjoyed with your success.   Peerless, last time, go see your father.   I'm doing okay.  Been reading about your show, it's all over everywhere. I watched it's all over everywhere. I watched it once.  I thought you said there would be no buffoonery.     Of course I'm happy for you. You've worked very hard for your success.   No.   You know how your Daddy is.   I won't forget.  When are you coming up here to see your mother?",
        "Dothan": "",
        "Dot": "Glad to meet you, too.  You are all your father talks about.   I'll leave you two alone.  She kisses Junebug on the forehead before leaving.   We know that baby.    75.    Not that often.  He was excited to see you.   The drinking is for the pain.  It doesn't kill it, just dulls it.   I was a hostess at this club, your Daddy was performing and I had never laughed so hard in my life. He asked me to come with him.  I quit my job and we've been together ever since.  Delacroix pulls out his billfold and gives Dot five crisp new model hundred dollar bills.   Your father is proud of you.    76.    He did the best way he knew how, Junebug is stubborn just like you.  Delacroix kisses his sleeping father of the forehead.   I'll take care of him."
    },
    "imdb_rating": "6.7",
    "description": "Dark, biting satire of the television industry, focusing on an Ivy League educated black writer at a major network. Frustrated that his ideas for a \"Cosby Show\"-esque take on the black family have been rejected by network brass, he devises an outlandish scheme: reviving the minstrel show. This is the hook: Instead of white actors in black face, the show stars black actors in even blacker face. The show becomes an instant smash, but with the success also come repercussions for all involved.N. Cognito <nobody@noplace>",
    "name": "Bamboozled",
    "genres": [
        "Comedy",
        "Drama",
        "Music"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTI2ODIzMjUyMV5BMl5BanBnXkFtZTYwNzEyMzY3._V1_QL75_UY281_CR0,0,190,281_.jpg"
}