{
    "filename": "Barry-Lyndon_script.txt",
    "imdb_id": "tt0072684",
    "imdb_url": "https://www.imdb.com/title/tt0072684",
    "characters": [
        "Lord Ludd",
        "Lady Honoria Lyndon",
        "Lischen (as Diana Koerner)",
        "Nora Brady",
        "Sir Charles Lyndon",
        "Graham",
        "Capt. Potzdorf (as Hardy Kruger)",
        "Rev. Samuel Runt",
        "Lord Gustavus Adolphus Wendover (as Andre Morell)",
        "Capt. John Quin",
        "Barry Lyndon",
        "Barry's Mother",
        "Capt. Grogan",
        "The Chevalier du Balibari",
        "Capt. Feeny - the Highwayman"
    ],
    "dialogues": {
        "Lord": "Dear heaven!  We saw you go away three hours ago.      (more and more     astonished It's the young Herr Galgenstein.   Do you happen to know Gustavus Adolphus, the thirteenth Earl of Crabs?   Well, sir, this nobleman is one of the gentlemen of His Majesty's closet, and one with whom our revered monarch is on terms of considerable intimacy.  I should say you would be wise to fix upon this nobleman your chief reliance for the advancement of your claim to the Viscounty which you propose to get.    Roderick and Lord West.    Have you done, Mr. Cosgrove?   Well, Mr. Cosgrove, I'll answer you point by point.  The King is exceedingly averse to make peers, as you know.  Your claim, as you call them, have been laid before him, and His Majesty's gracious reply was, that you were the most impudent man in his dominions, and merited a halter, rather than a coronet.  As for withdrawing your support from us, you are perfectly welcome to carry yourself whithersoever you please.  And, now, as I have a great deal of occupation, perhaps you will do me the favor to retire, or tell me if there is anything else in the world in which I can oblige you.  So saying, Lord West raises his hand lazily to the bell, and bows Roderick out.",
        "Ludd": "",
        "Nora": "",
        "Brady": "",
        "Graham": "",
        "Barry": "",
        "Lyndon": "",
        "Barry's": "",
        "Mother": "Various cuts showing illness and convalescence.  Roderick feverish:  the doctor taking his pulse.  Mother brings a tray of food.    Roderick waking up.     Thank God, it's fallen towards me!  And then, her heart being too full, she leaves the room.    Captain Grogan and Orderly arrive.    Upon seeing Roderick and Harry ride up, his mother, who has been waiting outside, rushes to her son with wild screams of joy.  He dismounts, and she kisses and embraces him.    Still much excitement and hustle and bustle.   Dublin?  But the poor lad has never been away from home.  He will be as safe here as in Dublin.    His mother takes out a stocking from her escritoire, and gives Roderick twenty golden guineas.    Roderick, my darling, my wild boy, I have forebodings that our separation is to be a long one.  I spent most of all night consulting the cards regarding your fate in the duel, and all signs betoke a separation.  Here is twenty guineas -- all that I have in the world -- and I want you to keep your father's sword and pistols, which you have known to use so like a man.    Roderick's departure.   Ah, Roderick, it's a blessing to see that my darling boy has attained a position I always knew was his due, and for which I pinched myself to educate him.  Little Patrick is a darling boy, and you live in great splendor, but how long will it last? Your lady-wife knows she has a treasure she couldn't have had, had she taken a duke to marry her, but if, one day, she should tire of my wild Roderick and his old-fashioned Irish ways, or if she should die, what future would there be for my son and grandson?   You have not a penny of your own, and cannot transact any business without the Countess' signature. Upon her death, the entire estate would go to young Brookside, who bears you little affection.  You could be penniless tomorrow, and darling Patrick at the mercy of his stepbrother.    Roderick and his mother.   I shall tell you a secret -- I shall not rest until I see you Earl of Duganstown, and my grandson, a Lord Viscount.  She smooths down Roderick's hair.   This head would become a coronet.   These things entail considerable expense, and you will need your lady's blessing, but the young boy forms the great bond of union between you and her ladyship, and there is no plan of ambition you could propose in which she would not join for the poor lad's benefit, and no expense she will not eagerly incur, if it might be any means be shown to tend to his advancement. You have important friends, and they can tell you how these things are done.   Depend on it, artful hussy has some other scheme in her head now.   Depend on it, there is some artifice.  When once you get into that wicked town, you are not safe. There are scores of writs out against you for debt.  If you are taken in London, and thrown into prison, your case is hopeless.   Roderick, you must listen to me.  As soon as they have you in London, they will get the better of my poor innocent lad; and the first thing that I shall hear of you will be that you are in trouble.  You will be a victim of your own generous and confiding nature.   Humph!  I believe she is at the bottom of it -- the wicked schemer.",
        "Capt.": "",
        "Grogan": "The Captain is gone.  Dorothy, giving him an indignant look, jumps up and walks towards the house.      (in a soothing tone     to Roderick This is a pretty way to recommend yourself to the family.   You are a gallant lad, and I like your spirit.  But what Dugan says is true.  It's a hard thing to give a lad counsel who is in such a far- gone state as you; but, believe me, I know the world, and if you will but follow my advice, you won't regret having taken it.  Dorothy Dugan has not a penny; you are not a whit richer.  And, my poor boy, don't you see -- though it's a hard matter to see -- that she's a flirt, and does not care a pin for you or Best either?   Faith, I think you are a lad that's likely to keep your word.  He looks hard at Roderick for a second to two, then he walks away, humming a tune, looking back at Roderick as he goes through the old gate out of the garden.  When Grogan is gone, Roderick is quite alone, and he flings himself down on the bench where Dorothy had made believe to faint, and had left her handkerchief and the ribbons and, taking them up, hides his face in them, and bursts into a passion of tears.   I'll go home with the boy.   A pretty day's work of it you have made, Master Roderick.  Knowing your uncle to be distressed for money, and try and break off a match which will bring fifteen hundred a-year into the family?  Best has promised to pay off the four thousand pounds which is bothering your uncle so. He takes a girl without a penny -- a girl that has been flinging herself at the head of every man in these parts these ten years past, and missing them all, and a boy who ought to be attached to your uncle as to your father.   And this is the return you make for his kindness!  Didn't he harbor you in his house when your father died, and hasn't he given you and your mother, rent-free, your fine house of Jamesville yonder?   Well, if it must be, it must.  For a young fellow, you are the most bloodthirsty I ever saw.  No officer, bearing His Majesty's commission, can receive a glass of wine on his nose, without resenting it -- fight you must, and Best is a huge, strong fellow.   In faith, I believe you are not; for a lad I never saw more game in my life.  Give me a kiss, my dear boy. You're after my own soul.  As long as Jack Grogan lives, you shall never want a friend or a second.  They embrace.   The meeting is arranged.  Captain Best is waiting for you now.   Your cousins go out with him.  Roderick and Grogan, and the Orderly ride off.   That's a very handsome sword you have there.   And now you risk the same fate.  If you are killed, your mother is all alone in the world.   Oh, it's with pistols we fight.  You are no match for Best with the sword.   But swords are today impossible; Captain Best is -- is lame.  He knocked his knee against the swinging park gate last night, as he was riding home, and can scarce move it now.   It must have been some other gate.  They alight from their horses, and join and salute the other gentlemen.   I have just explained to Mister James that Captain Best is lame, and that swords are impossible.   A regular Turk.  I never yet knew the man who stood to Captain Best.   Look here, Roderick, my boy; this is silly business.  The girl will marry Best, mark my words; and as sure as she does, you'll forget her.  You are but a boy.  Best is willing to consider you as such.  Dublin's a fine place, and if you have a mind to take a ride thither and see the town for a month, here are twenty guineas at your service.  Make Best an apology, and be off.   Roderick, fire at his neck -- hit him there under the gorget; see how the fool shows himself open.  Michael, who has not spoken a word, Harry, and the Captain retire to one side, and Harry gives the signal.  It is slowly given, and Roderick has the leisure to cover his man well.  Captain Best changes color and trembles as the numbers are given.  At \"three\" both pistols go off.  Best gives a most horrible groan, staggers backwards and falls.   Then the world's rid of a coward. It's all over with him, Roddy -- he doesn't stir.  He gives the huge prostrate body a scornful kick with his foot.    Roderick and Grogan.   I had news of you in Dublin.  Faith, you've begun early, like your father's son, but I think you could not do better than as you have done. But why did you not write home to your poor mother?  She has sent half-a-dozen letters to you in Dublin.   We must write to her today, and you can tell her that you are safe and married to \"Brown Bess.\"  Roderick sighs when Grogan says the word \"married,\" on which Grogan says with a laugh:   I see you are thinking of a certain young lady at Duganstown.   There's only six Miss Dugans now... poor Dorothy.   She took on so at your going away that she was obliged to console herself with a husband.  She is now Mrs. John Best.   No, the very same one, my boy.  He recovered from his wound.  The ball you hit him with was not likely to hurt him.  It was only made of tow. Do you think the Dugans would let you kill fifteen hundred a-year out of the family?  The plan of the duel was all arranged in order to get you out of the way, for the cowardly Englishman could never be brought to marry from fear of you.  But hit him you certainly did, Roderick, and with a fine thick plugget of tow, and the fellow was so frightened that he was an hour in coming to. We told your mother the story afterwards, and a pretty scene she made.   He has paid off your uncle's mortgage.  He gave Dorothy a coach- and-six.  That coward of a fellow has been making of your uncle's family.  Faith, the business was well done.  Your cousins, Michael and Harry, never let him out of their sight, though he was for deserting to England, until the marriage was completed, and the happy couple off on their road to Dublin.  Are you in want of cash, my boy?  You may draw upon me, for I got a couple of hundred out of Master Best for my share and, while they last, you shall never want.   I should have left you a hundred guineas, Roderick, but for a cursed run of ill-luck last night at faro.  He gives Roderick a faint squeeze of the hand; and, as the word is given to advance, Roderick leaves him."
    },
    "imdb_rating": "8.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNmY0MWY2NDctZDdmMi00MjA1LTk0ZTQtZDMyZTQ1NTNlYzVjXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_QL75_UX380_CR0,8,380,562_.jpg",
    "description": "In the eighteenth century, in a small village in Ireland, Redmond Barry (Ryan O'Neal) is a young farm boy in love with his cousin Nora Brady (Gay Hamilton). When Nora gets engaged to British Captain John Quin (Leonard Rossiter), Barry challenges him to a duel of pistols. He wins and escapes to Dublin, but is robbed on the road. Without an alternative, Barry joins the British Army to fight in the Seven Years War. He deserts and is forced to join the Prussian Army, where he saves the life of his Captain and becomes his protégé and spy of Irish gambler Chevalier de Balibari (Patrick Magee). He helps Chevalier and becomes his associate until he decides to marry the wealthy Lady Lyndon (Marisa Berenson). They move to England and Barry, in his obsession of nobility, dissipates her fortune and makes a dangerous and revengeful enemy.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "name": "Barry Lyndon",
    "genres": [
        "Adventure",
        "Drama",
        "War"
    ]
}