{
    "filename": "Battle-Los-Angeles_script.txt",
    "imdb_id": "tt1217613",
    "imdb_url": "https://www.imdb.com/title/tt1217613",
    "characters": [
        "Corpsman Jibril Adukwu",
        "Pfc. Shaun Lenihan",
        "LCpl. Steven Mottola",
        "Michele",
        "TSgt. Elena Santos",
        "LCpl. Peter Kerns",
        "Cpl. Kevin Harris",
        "2nd Lt. William Martinez",
        "Cpl. Nick Stavrou",
        "Cpl. Lee Imlay",
        "Ssgt. Michael Nantz",
        "Hector Rincon",
        "Cpl. Jason Lockett",
        "LCpl. Richard Guerrero",
        "Joe Rincon"
    ],
    "dialogues": {
        "Michele": "There's five of us. Three kids. Nantz is immediately moving.  I have my nieces for the week. My sister and her husband are in Hawaii for their anniversary... Is it safe there? I heard this is happening in other places... Martinez is at a loss for words.  What do they want from us? Why are they here?  Maybe I can help, sergeant. I'm a vet...   No, a veterinarian.  Michele.  I was more sure two minutes ago. She looks to Adukwu. They step to the body together as... Nantz approaches Martinez.          Your head, Sergeant. You're bleeding. Nantz touches his head, looks at the blood. He wipes it on his pants. Michele smiles at him softly.  Bet when you woke up this morning, you didn't think your day would end up like this.  It's okay. I'll be right behind you. Adukwu picks up Amy. Kerns picks up Kirsten. 66.  What's happening, Sergeant? What's that mean?  What's the matter?  You don't look much older, either. She gazes at the kids, pain and anger washing over her. 87.  Is this day ever going to end?     I'm single. Lots of family back in Nebraska, though... Hopefully they're safe... She shakes the thought away.  What about you guys?  You should be a surgeon, the way you cut into that thing... Adukwu smiles. Then his smile fades as he looks around.",
        "Hector": "Want some Nerds? Imlay holds his hand out. Hector shakes candy into it as... Nantz enters, calling to Adukwu:   Are we gonna die? Nantz turns back to Hector. Manages a smile.  I don't want to go without you.  I don't wanna be here. I want my dad back. I want it all to go back to the way it was before...     People always say that. \"He's a hero.\" No one even knows what a hero is.  What's that mean, \"retreat hell?\"  What are you gonna do?",
        "Rincon": "My son and I came here... There were only three cops, spread pretty thin... Then those things attacked. Police couldn't stop them. 43.  I don't know. Most people ran. We hid in a side room, found Michele and the girls... Couldn't see what happened. Just heard... Screams.  It's okay, son. I got you. 67. Rincon starts to PULL Mottola TOWARD THE OFF-RAMP... Struggling to get him to safety. Mottola's body starts to convulse. Rincon stops, tries to control him. Sees Mottola's eyes rolling back in his head. Then Rincon is horrified when he looks up to see... ALIENS RACING FORWARD... Heading his way! Moving in and out of the sea of abandoned cars. Rincon redoubles his efforts, pulling on the injured Mottola. As he does, he looks back up to see... The ALIENS ARE ALMOST ON TOP OF HIM now as... BANG! The first alien is shot by... Nantz, suddenly there, M-16 poised. Rincon looks from Nantz to... MORE ALIENS coming at them! No choice-- Rincon PICKS UP the injured Mottola's RIFLE. Scared, but resolute. He looks at Nantz.  What do I need to know? The slightest beat, then...  Just sight down the barrel...?  Listen to me, son. I'm not going to make it.  But you will.  I know. But you have to. Now wait with Michele a minute. Let me talk to the sergeant. Reluctantly, Hector allows Michele to lead him away.  Don't waste time, sergeant. You and I both know what's going on here. 75.  No. You can't take me. Nantz is silent, at a loss.  I keep playing it over in my head... If I'd done things differently... Maybe I could have gotten Hector out earlier.  Just promise you'll get my son out of here, Sergeant. Nantz looks like he has the weight of the world on him.  I'm trusting you with the only thing I have in this world. Nantz stares, nods.  I'm very proud of you, son. You're being so brave... Hector throws his arms around his father, hugging him tightly.  I love you, Hector. Mr. Rincon smiles. His face peaceful. Hector is silent, tears rolling down his face. 77.",
        "Joe": ""
    },
    "imdb_rating": "5.7",
    "description": "Los Angeles and other cities around the world are being bombarded by meteors that seem to be slowing down once they hit the earth's atmosphere. The earth is suddenly being invaded by space aliens that have landed off the shore of LA, and who begin killing everybody along the beach. The military is ordered into action. Marine Staff Sergeant Nantz (Aaron Eckhart), who was about to retire, is reassigned to a new platoon. The platoon, flown by chopper to the forward operating base at Santa Monica Airport, is being led by a new 2nd Lt. Martinez (Ramon Rodriguez). They are sent on a mission to rescue some civilians who are trapped at the police station within alien territory. They only have 3 hours to complete their mission and get out before the Air Force bombs that zone.—Douglas Young (the-movie-guy)",
    "name": "Battle: Los Angeles",
    "genres": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BM2Y0OTIzNTctY2RlMS00ZWMwLWI0YzctZWI1ZWUwODAyNmQ1XkEyXkFqcGdeQXVyNDI3NjU1NzQ@._V1_QL75_UY281_CR5,0,190,281_.jpg"
}