{
    "filename": "Beginners_script.txt",
    "imdb_id": "tt1532503",
    "imdb_url": "https://www.imdb.com/title/tt1532503",
    "characters": [
        "Georgia",
        "Magician",
        "Party Person",
        "Oliver",
        "Andy",
        "Hal",
        "Shauna",
        "Elliot",
        "Young Oliver",
        "The Sads (as Hana Hwang)",
        "Liz",
        "Anna",
        "Green Witch",
        "The Sads"
    ],
    "dialogues": {
        "Georgia": "Oliver!  Olly, you can do better.  That's good.       At the museum.  What're you, in the FBI?  The CIA?   There is nothing wrong with me and Pop.  C'mon.  When you feel bad, you go into a room and scream - loud as you want, for a minute or two, then it's out of you. It's called catharsis.  You will...     Oliver, stop it.  It's black, black music is the deepest cause they suffered the most, them and the Jews.  In my next life I'm gonna marry a good hot blooded Jew - someone full of emotion.  You're a quarter, I'm a half, your father's none. He has the least emotions, You'll have more emotions than him, but I'll have the most emotions. 10/29/07 36.  You get to play chauffeur but just to the bottom of the hill.  You're turning into a wonderful driver.  What? You're not allowed to interact with the art?  You too? You like being a good citizen?      What about your father? What will he possibly do without us?  Yes Mary, it's an emergency, Oliver's appendix has ruptured.  He's a very composed child.          Aha. The infamous left.  And?  Left again. Going in circles. I like it.",
        "Magician": "",
        "Party": "Hal, you look wonderful.",
        "Person": "",
        "Oliver": "Yeah yeah.  You're coming to live with me now.  This is my car.      This is the dining room where people come and eat sometimes.  This is the living room. 10/29/07 3.     That's the bathroom.       This is 2003. This is what the sun looks like, and the stars, nature. This is the President.  And this is the sun in 1955, and the stars, and nature, and cars, and phones, and movies, and the President. These are what pets looked like. These are fireworks. This was smoking.  This is what it looked like when people kissed...  ...When they were happy...  ...When they were sad.  My parents got married in 1955.  He was a museum director - she fixed up old houses.  They had a child, and they stayed married for 44 years...  ...Until she died in their bed, after four months of cancer and eating French toast for every meal and watching the Teletubbies everyday and confusing white straws for her cigarettes and skipping back and forth through time inside her head.  Six months later, my father told me he was gay. He had just turned 75.  I always remember him wearing a purple sweater when he told me this but actually he wore a robe. 10/29/07 5.  He changed all his clothes.  He got a boyfriend, Andy, a physical trainer who was also studying for his professional pyrotechnic license. 10/29/07 6.  He found an out gay priest to guide him spiritually. He saw a therapist for the first time. He joined the Primetimers. Movie night. Los Angeles Pride, and then...  Four years after he came out, he died in this room...     Look, its lonely out here, so you'd better learn how to talk with me.  I know. I know. 10/29/07 7.  Calm. Calm, calm breaths.  Pop, Pop, stop -- you're gonna hurt yourself. 10/29/07 8.  No, Pop.  She's a great nurse in the hospital, we don't really know her, you're very high on drugs.  No, Pop, I just don't want to be like you and mom.  Thank you...         Go have your own experiences with your own people. I'll be right here...  I'm a human. I'm not a dog. And you're a Jack Russell, that's a breed. Your personality was created by this guy John Russell, a hunting enthusiast, in the 1800s. And he bred your ancestors to have stamina and courage for the hunt. You think you're just you, and you want to chase the foxes, but other people planted that in you years ago. 10/29/07 10.  Now, somewhat arbitrarily, you are considered very cute by us humans, and we keep breeding you not to chase foxes, but to be cute, and we put you in movies and television shows, and you, you're chasing tennis balls cause there as close to a fox as you're going to get.       Want me to read this? I found it in your books.  Nice.  Oh, Andy brought those for you.  Well, I don't know. Its just a painting on the wall.  They're just photos, Pop.  They're just personal photos. They're not art.  Uh, well that's the water sprinkler thing.  What is?          Jesus, Liz. Another band that wants portraits.  You do something decent once, and that's all people ever want.     Yeah?        Arthur, you haven't been invited to this party. You're gonna stay and look after the house.     His name's Arthur - he doesn't do tricks.   Does it make you feel powerful to order my dog around? Maybe give you a sense of power?  Thanks, yeah. Very good.  Yeah. 10/29/07 16.   I'm sorry. Our time is up, uh... for this week. Thank you for coming in.  Oh, I was just- I was gonna take a break, actually.   Well, I guess we should start with your mother.  Well then your father.  I don't understand. You can't talk? Is it a mental problem? Do you need analysis?  That's a physical problem. 10/29/07 17.  I was doing such a good job of hiding it. How could you tell?  Clearly, I'm gonna need a drink. You?  You, stay here, yeah?  Watch him OK?     Hello?  Yeah.  You did?  Probably house music?  So did you meet anyone?     Would you like to dance? 10/29/07 20.  Hello...  Can I give you my number?  Thanks.  I feel bad dragging Arthur to the party. I should get home. It was really nice meeting you.       Hello?  Is that you?  One beep means yes?  I've always wanted to have a phone call with someone who doesn't talk...  You want to do something?  Now?  Okay, I'm parked just right up the street.  Okay. You point - I'll drive.  This way? 10/29/07 22.  Nice place.  Oh, my mother. My mother died five years ago.  Oh, you spoke.  My father died two months ago, almost three.  He, he was gay.  He was gay the whole time they were married. 10/29/07 23.  He came out after my mother died and, uh... he was 75 years old.  Sorry.  Sure, sure.  Oliver.  How long are you here when you get back?  A year?  A month? Right. And then?...  You're filming here. Acting. 10/29/07 24.  And after?...  Just somewhere else. Where?  Yes.     Hello house,  hello Oliver.     Jesus, Pop, you get so much mail.  I'm sorry.  Andy?  The Brazilian ballet star is already known not only as a skilled partner, but also as a gifted and versatile dancer, who adeptly fields roles ranging...     Yeah, he's fine. He sleeps on your bed.  Yeah, yeah, he's eating.  What was all that?  I'm sorry.  What did you do with my father? He was so polite.  Two, four, six, eight...  I'm gonna meet her at her hotel again. You happy?   Here's eight...  We haven't actually had a conversation yet, so, you know...  And you know that because?  It's true. It's embarrassing. I'm 38 and falling for a girl again...  It's like I lost the instructions or I, I never had them...  Where's Pop?  Is something wrong with you guys?  No.  No. 10/29/07 32.     I don't feel like screaming...  What the fuck is that?  Well, that's ridiculous.  Well, its just copying something someone did, like, 30 years ago in the Bronx.  How does it work?  Historical consciousness... you know, something bigger than myself.  Let's do it again. 10/29/07 34.      Maybe we, we could, um, just talk for a second.  This music's old.  I'm Jewish right?     C'mon.  No.  Camisole?  I was brought up by these animals and they didn't like questions.  They were very frowned upon. So I had to guess.  Anything?  What's out there?  Yeah. 10/29/07 38.  Uh-huh.  Right.  How do you know so much about people?  Oh yeah?  No, that's not true.  Yeah, you have blonde hair that goes down to about here. You smoke in non-smoking rooms.  Okay, open your eyes...  Yeah, you see, you don't know me at all.  Someone flashy walks into your life and you're just gonna fall for it?  No, uh, it doesn't work like that. There are other steps, it's complicated.  You know... I don't know.  She was great.  My situation?  That's your fatherly advice? Personal ads? 10/29/07 41.  What?  Jesus, Pop.  I thought he was your boyfriend?  Pop.  Alright, come on. Come on.  Arthur, down.  I'd wait for the lion.     Hey, what did you get?  Liv Ullman. Very serious.  That's kind of a classic American thing.  Yeah, Like page 75?  Or 75 all the way through, through 80.         Veronica Lake.  She was a pin-up model and a film star... Success was short-lived... series of broken marriages... She struggled with mental illness and alcoholism. She died of hepatitis at the age of 53.  Yeah.  It's really good. 10/29/07 46.  What do you think?  It's good? Oh, I wasn't sure you'd like it.  You're an actress and staying in that fancy hotel.  How do you keep hold of friends... or boyfriends?  You can stay in the same place and still find ways to leave people.  Yeah, I guess so.     Pop?  What are you--? Pop. What?  Prednisone makes you crazy.  Pop, you should rest. 10/29/07 48.  Nothing, you're pretty.  Yeah.  You're kidding right?  She did not.  This is what it looks like when Anna tells me about being Jewish in 2003. And when I tell her that my mother was Jewish. And then my father turned in his gay badge when my mother turned in her Jewish badge. And they got married in 1955.  My mother didn't know she was Jewish until she was 13. It was 1938. This is what people looked like.  And lions and giraffes. This man was Man of the Year.  Her father tried to hide that they were Jewish. This is the swim team that asked her to leave once they discovered that she was Jewish.  This is what pretty looked like in 1938.  My father realized he was gay when he was 13. It was 1938.  This is what pretty looked like. 10/29/07 50.  This is the only place my father could hide and have sex in the Fifties.  My father said if you got caught my the Vice Squad you could lose everything... This is everything.  My father laid down on a couch like this and told the psychiatrist all his problems in 1955. The doctor told him that homosexuality was a mental illness, but it could be cured.  Not everyone got cured.  This is where my parents lived in 1955.  And this is the home where the first gay rights group was secretly meeting.  While they were reciting their vows, here in this church...  Allen Ginsburg was writing his famous poem, Howl, blocks away in this room.     Yeah. Right.  Here, Pop.  I know, I know. Come on.  Alright.  But what about this chair? Is it gay?  Pop, Pop, the cord won't go that far.  Pop, you just got out of the hospital, you should take it easy. 10/29/07 54.  You need to tell Andy that you're... not well.  Me?  Hey.  Yeah?  Hey, I don't have a problem with gay guys.  No. 10/29/07 55.  I don't know Andy.  Okay, okay.  I couldn't tell him.  No it's not. You can't hide this from him. He loves you.  Just act natural. When he's not looking, we'll make a run for it, okay?  He's that bad?    Oui?  Oui Papa.  Doing what?  You should tell mom about that, not me.  Just as it was going so well.  Hey Anna?  How do you feel about vandalism? 10/29/07 58.  You okay?  Okay.  Yeah.  I'm trying to impress you.  Arthur, Arthur. I'm sorry.  Uh, do you mind?  Yeah.  Somewhere along the line, he stopped admitting to himself that he was sick.  He did a lot of shopping. Bought all these books.  And new clothes.    He was obsessed with Staples.    He bought a lot of plants.  He had a lot of parties.  I thought I was making dinner?  He had these political letter writing parties, there was an out gay congressman he was supporting... 10/29/07 63.  He started telling everyone that he was getting better.  Why're you telling them you're \"turning the corner\"?  You have stage 4 cancer?  Pop. There is no stage 5.  What does it mean?  What movie are we watching?  Yeah I know who Harvey Milk is.  He hired a secretary that he could dictate to.  He wrote an essay about religion...  You re-wrote Jesus' death?  For the first time I saw him really in love.  Anna?  If this is too much, then we should just stop.    No! 10/29/07 67.        He talks to you too?  Your English is not so perfect. And he said ten minutes.  You okay?  You did really well.  You watching all the humans going around and around.  If I leave him on his own, he loses all control.  Yeah, but if I leave him in the car, he cries, he howls. I can't leave him in the car.  She is just talking in French. She's saying it's OK, it is such a small dog.  You're gonna call the authorities?  Sorry, excuse us, sorry.  He shouldn't do this to you.  Your leaving soon?  I think you should come to my house and move in with me.  Yeah, a lot.  Yes .  But now I'm going to have to kill you for sure now.  Cause I'm falling in love with you.  Anna and I are in a relationship in 2003.    This is what the sun looks like and the stars. This is what it looks like when we eat. When we tell each other the stories in our heads.  I was born in 1965. Anna was born in 1971. This is what the sun looked like. Her pets. Her parents. She left home when she was 16. She lived here and here and here.    She had three serious relationships. She left all of them. I had four serious relationships. I left them too. Or let them fall apart. 10/29/07 72.      We didn't know how we learned the stories in our heads but sometimes they stop running and I can really see Anna's eyes in 2003. Her ears. Her feet. This is what it looks like when she says, I love you, in 2003.      This is what it looks like when she cries. When she tells me there's always a new empty room waiting for her. They used to make her feel free. Now they make her feel the opposite of free.     Next one.  Yeah, everyone knows that, here.  Everyone knows about that Pop.  No, I just thought you and mom weren't in love.  But you were gay that whole time.  For 44 years?  What about sex? You guys had sex?  And mom? You wanted mom too right?  Sex.  Life.  Healing.  Sunlight. 10/29/07 75.    Spirit.  The first Gay Pride flag was made in 1978 by a man named Gilbert Baker. He gave a meaning to each color.  This man was President. This was invented, this is what movies looked like. Pets.  On November 27th, 1978. Harvey Milk was shot and killed.  One week later, my father opened his annual Museum Christmas Exhibit. He collected stuffed animals from people in the community, and put them on display. My father printed a quote from The Velveteen Rabbit in large type on the wall...  ...`The stuffed rabbit asked - What is real? And the Horse said, \"Real isn't how you're made. It's a thing that happens to you. When a child loves you for a long long time not just to play with, but really loves then you become real... 10/29/07 76.  ...'It takes a long time. That's why it doesn't happen to people who break easily...  ...Generally by the time you are real, most of your hair has been loved off, and your eyes drop out and you get loose in the joints. But these things don't matter at all because you are real and you can't be ugly, except to people who don't understand.'\"  Yeah? Is that a good idea?     This is the idea, is that it's the history of sadness.  Here, this could be your...  Your gonna need a big CD box. Four billion years ago, Earth begins. And the idea is that sadness has not been created yet.  I'm sorry.  Well, that went well.       Come on Arthur.     This is the living room.  Dining room.  There are my parents. My mom. Hal, Georgia, this is Anna - Anna - Hal, Georgia.     These're the stairs.  They go up.     I emptied these for you. I'll get your case. 10/29/07 79.  Are you okay?             Are you?  Why were you crying yesterday?                   Yeah.     Well are you happy here?     I don't know Anna. I don't think this is what I am supposed to feel like.         I can barely remember you from when I was little.  Let's go home.  Let's go.           Anna? Where where you?  Hey.      Okay? Thanks.      Hey. Look I'm so sorry... But I'm, I'm at your front door. I'm in New York.  You, you're in LA?  You said you were coming here?!  Fuck. I'm in your building.  Okay, I'm inside. Wow, there's like nothing here.       Maybe because I, I don't really believe that it's gonna work. And then I make sure it doesn't work.  Great. You look great.  Once you make the call, you have less than an hour before two men come and place the body into a bag.  You will need to make copies and send them to cancel every credit card, phone account, utility, gym membership, every insurance policy, mortgage, to settle their taxes.  You will have all their mail forwarded to your address. You will write their obituary. You run it with a photo in the paper for two dollars a word. You will wonder if it's right. You'll throw a lot of their stuff away. You'll bring a lot of their stuff to your house. This is the photo my mother kept in her bedroom.  When I was a kid I thought that was my arm giving her daisies. Now I make a new mistake and think it's her arm giving me the daisies, saying, here, here's simple and happy. That's what I meant to give you.  Hey.  Arthur...  Thank you... Thanks. 10/29/07 92.  What?  No. No, it's because my father loved you so much.     Arthur... hey. Hey, how've you been?     Hey.  Come in, come in.  Yeah.  Sure.  Chest...  I like giving and getting rubdowns and then going into mutual soft stuff.         What happens now?  How does that work?",
        "Andy": "Okay. Is it on?  This is for our friend Hal Fields. Hal. We love you. 10/29/07 2.  Since I came out to my father, he never speaks to me. That's why I've been always attracted to older men.  Hal.  I brought something for you.  We made a recording for you.  This is for our friend Hal Fields. Hal. We love you.  A slug.  Oh I can look.  I'm Andy. Hal's boyfriend  You know, I have the right to be here as much as anyone else.  Guys, guys, this is to us. Cheers.  It's a green caterpillar.  Oh yeah I do. 10/29/07 42.  Yeah, Michael's in town.  Now that you're out of the hospital, you'll have to exercise, get you back into shape.  Okay, let's try it. I'll, I'll show you how.  Okay, I'll clean it up. It's a little - yech.  You know that I tried to have sex with women?  Yeah. I wanted you to know I tried, it just, it didn't work.  Have you ever had sex with a man?  I heard that if a man hasn't had sex with another man, he's always afraid of gay men. You know, they're a threat.  I didn't want you to feel threatened, I don't want to have sex with you. What I do, most people wouldn't even call it sex.  Hey...  Ready?     He remembers me. 10/29/07 86.         Hey.  It's cause I'm gay, isn't it?  You never called or came to see me?",
        "Hal": "I'm gay.  I'm gay.  I'm gay.  I loved your mother, but, uh... now I want to explore this side.  I don't want to be just theoretically gay, I want to do something about it.  ...I want to do something about it...  ...I want to do something about it.        Oliver! Please help me with all these ropes.  You two married?  Why not? She's great.  You always have some very good reason, haven't you?     Yeah, alright. Give me the flashlight.  Oh, that's nice. 10/29/07 11.  Oh, yeah?  Oh, who did that painting?  A--, and these?  But how do they relate to the exhibit?  Well, its beautiful.  Putting the Japanese gardens there. It's just beautiful. 10/29/07 12.  Andy!  Oh, God.     Oliver?  I'm not sorry I woke you! I went to Akbar tonight.  They had wonderfully loud music. In- sit, in-sit, in-sit. What kind of music is that?     \"House music.\"  Young gay men don't go for older gay men.  You have it easy.                    But...?  Uh-huh. I see.  No. Thank you.  Well, let's not rush out and tell everyone.  No need to get him up a tree.  Can you read me something? 10/29/07 27.  But is he eating?     Oh God, I worry so much about--  Oh here we are... 10/29/07 28.  What have you got in there?  Oh, Andy, you can't bring that kind of thing in here.  Fuck you.  It's time for inspection...  Hello.  Go take a walk. Calm yourself. 10/29/07 29.  Oh, Andy hasn't had it easy. Be nice to him.   Andy, where did you get these?  Oh, it's not?  No, no, no. She's a wonderful nurse. (he pauses a beat, then raises his cup again) Here's to health care.  Oh, I invited him - but he never returns my calls.              What happened with Michelle?  She seemed great.  Maybe you should take out a personal ad, where you explain your situation?  Yeah, I mean, you want to be in a relationship but you can't stay in one.  Well, a lot of people use them... I did.  If Andy wasn't going to be monogamous, why should I be?  Jesus yourself.     Hello house (Answers back in deep voice) Hello Hal.     Oh God, what have you got this time?  No, no, no, you don't have a green caterpillar.  Oh my God. Gross! Oh, Jesus...  Hey, you going?  Oh. Right.  Well, at least I'm the number one boyfriend.  Oh, my stomach.  Well, let's say, when you were little, you always dreamed of some day getting a lion? 10/29/07 43.  And you wait and you wait and you wait and you wait and the lion doesn't come. Then along comes a giraffe.  You can be alone or you can be with the giraffe.  That's why I worry about you.  You want me to be with someone like me. I like Andy cause he's not like me... he's fun.                Oh, did I wake you? Yeah. (Handing Maria some books) Thank you Maria. And now that you're here, uh, would you please put those up there?  I'm reorganizing.  I'm just not sleepy. I feel great.     As soon as I finish these papers. Right, papers? (In a different voice) Right, Hal. As soon as you're done, you can rest.       Oh, God.  Hey, no, no, no. That's the Gay Pride Day stuff. Just leave those.  And that's for gay book club. You better leave those too.  The chair's not gay. Obviously. 10/29/07 53.  Oh, to hell with it.  Oh, hey what's that?  That's a great idea.  Yeah, later on, I'm gonna make myself some tea.  Your mother's vase needs some flowers.  You'll tell him, won't you?  Please?        That's okay.  For someone with so much relationship advice, you seem awfully alone.        Oliver, this is Blake. He's a wonderful man. 10/29/07 61.  Look. I finally got a tattoo. Registration purposes of course.            Well, glad you could make it.  It's movie night.  Oh, I'm turning the corner on this thing.        Well...  It's not as bad as it sounds.  That's not what it means.  It just means it's been through 3 other stages.  \"The Life of Harvey Milk.\" He was the first openly gay politician...  Good, good. 10/29/07 64.        Eventually Jesus grew old. He could no longer walk far and he could no longer preach in a loud voice. One day he announced to his apostles that he was departing. The three disciples prayed with him, gave him water, bathed and fed him. After gasping for breath for several days, one morning, just as dawn came, Jesus passed away.  It was so violent, we need new stories.                      Again!                          Lord.  Here, that means gay pride.  No they don't.  Don't be ridiculous.  Did you know, about me?  We loved each other.  I learned how not to be.  I knew I was gay, though, at dinner parties I was looking at the husbands not the wives. 10/29/07 74.  I couldn't have survived if I didn't know that. I just chose not to follow those instincts.  She didn't think I was the greatest lover, but we made do. Look, I liked my life, the museum, our house, that's what I wanted.  Yes, stop that.  She proposed to me you know.  I said - look I love you and we're great buddies but you know what I am. And then she says, that doesn't matter. I'll fix that.  I thought. Oh, God. I'll try anything.     Andy's moving in.  Just be happy about it.      Have I done something wrong? 10/29/07 82.  I see.  You did an excellent job Dr. Long. Thank you... for... For coming to the party.             You always wanted to hold my hand when you were little. I couldn't, you know. I was afraid it would look funny. I wanted to be close, you know and my father certainly was never close with me. God, I hope I wasn't like that.  I guess I was at work.        Isn't Juan's hair wonderful.  Well it's terrific.  Oh, no.  I don't think so.     How do you do it?  Is that it?  How do I look?",
        "Shauna": "I got the skills... he's got the moves...  Funny? Funny? I don't think so Fun maybe, but not funny unless, like, serious is funny. Then he's' fucking hilarious.  But, lovable. You are very lovable.  No.  You just have no real color.     What does that me--, one, two. 10/29/07 18.  Two people. A girl and a guy?  Yeah, wow, making moves.  You know what? Here, give me Arthur. We'll just stay here and get arrested. You know, that's good.  C'mon, it's her first time!  Fuck it, steal the skates, just leave.",
        "Elliot": "Hi Liz.  Oliver?  The pen is not your friend. The paper is not your friend. The party is your friend. We're your friends. Your friends are your friends.  I got the moves... you've got the skills... 10/29/07 14.  You remember when Oliver was funny? And he could actually, like, talk, in complete sentences?  Yeah, very lovable.  No, its just not a natural color for a chicken.  (motioning to Shauna's  Hey, hey.  Two drinks.  Well that's two, two people.  Hopefully.  That's it? That's all you're gonna tell me?  Yeah, I'm very happy. Are you happy?  You're thinking about her all the time.  Because you're not talking about it. I know you.  L-E-IT, Elliot  I know! (Getting his criticism more) You're not very supportive.  Well yeah. I'm part of a tradition of civil disobedience, something bigger than myself.  Shake it, you have to shake it.  What was that?  Okay, but when you see her, don't tell her that you painted historical consciousness on the wall...  Oliver, don't write any of that serious stuff, okay? Just write something funny. Girls like funny.  Yeah, I can't believe that was your first time.  C'mon, it's her first time!  Fuck it, steal the skates, just leave.         Hey.  Alright.",
        "Young": "Where's Pop?  Is something wrong with you guys?  No.  No. 10/29/07 32.",
        "Liz": "Well, at least it pays the rent.",
        "Anna": "Oh merd.              He's sweet. He misses your Dad.  Right.  Well, my name is Anna. You're worried you can't trust me because you don't know who I am. I get it. That makes sense to me.     Can you toss me my camisole.  No, my camisole.  You don't know what a camisole is?  You can ask me anything.  That's a tree.  And cars.  Another building like this one.  People in the building like us. Half of them think things will never work out. The other half believe in magic. It's like a war between them.  Oh. Well, you have to learn how to read their faces.  For example... here is mad.  Happy...  Sometimes its just nothing.  This is nothing... And they are good at looking one way and being another way. 10/29/07 39.  You don't know me. I like that.  Oh yeah?  Oh yeah? You drive on the sidewalk. You were raised by animals. Sometimes you look very alone, like you just got here.             And I found this crazy book.  Maybe we can figure out some classic American things to do.  Uh-huh.  Oh I love her.  All these actor stories end sad. I can tell you that already. It's not a good life.  So. Now I want real Mexican food.  And I want to try page... 46.  No.  Really?  It's so good.  Why?  I like this place.     I used to love hotels. But now I'm always in a new apartment or... in another hotel somewhere.  It makes it very easy to end up alone - to leave people.  You are like that? Its what you do?  So we are the same? 10/29/07 47.  What?  No...  Jewish girls are not pretty. They can be \"interesting\", or cute, but not pretty.  That's what my mom told me.  No, you're right, this girl at school told me that. And I went home and my mom said, `Anna, who told you that? 10/29/07 49.     Don't, don't.  It's my dad.  I'll be my dad, you be me.  Honey?  C'est toi, cheri? 10/29/07 57.  You never call me back.  You know, I can't stop thinking about, you know, about it. Doing it.  Killing myself. You are the only one I can tell that to.  You are my girl.  Now I have to kill you.  I know. I'm sorry.  Hey Oliver?  I don't know. Pretty okay.  Yeah. I'm gonna stay here with my new friend (the handrail she holds).  C'est beau ici. 10/29/07 59.  Really?  It's working.          He looked like your dad?     Good for him.     He sounds amazing. But that must have been crazy for you.       Stay here.  I couldn't sleep, I wanted to walk around...  You've lost so much. What if I can't make up for that?  Wait, wait.  I don't want to stop.     Ah, you're awake! Arthur says it's time to get up, he says he has the day off.  Yeah.     Dans ce pays! On ne peut pas amener un chien. On peut rien faire. Mais c'est con...     Even if we don't answer, he's still in here .I go somewhere else, he's still here.  Yeah.  Would you want a strange girl like me?  Do you cook? 10/29/07 71.  I would love that.  Why?                      Hello.  Yeah?  You OK?  I was nervous, and excited. I kept thinking, maybe I'm not so lost.  You okay?  You seem so unhappy with me.  Maybe I'm not perfect at it. I don't really know what I'm doing... but I want to be here. 10/29/07 81.  Okay. I will go back to New York then.                 Hey.  I'm in Los Angeles. 10/29/07 87.  Yeah, but I didn't leave.  Okay. See the window? Near the radiator?  There is a hide-a-key behind it.     No.  This is my kitchen. It's where I eat.  This is my bathroom. It's very fancy.  Outside my window... 10/29/07 88.  ... That's my neighbor's roof. The room at the end is my bedroom...     That's my closet. Those are my clothes and my pictures.  Why do you leave everyone? Why did you let me go?     Hey.  The living room. 10/29/07 93.  Dining room...  Oh. Crazy picture...  Can I read it?  I'm looking for sex with the hope it turns into friendship or a relationship. But I don't insist on monogamy.  I'm an old senior guy, 78, but I'm attractive and horny. I'm an art historian, now retired.  And in addition to art, I like houses, gardens, parties, and walking with my Jack Russell. I'm 5'11\", 160 pounds. I'm trim, gray hair, blue eyes, hairy cheest.     I have a nice house with food, drinks, friends and me. If you are willing to try an older guy, let's meet and see what happens.  He didn't give up.  I don't know.",
        "Green": "",
        "Witch": "",
        "The": "",
        "Sads": ""
    },
    "imdb_rating": "7.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMDE2OTA2NDctNGEzMy00Y2E1LTlmMTctOTMxYWQzYWI5OTIwXkEyXkFqcGdeQXVyMTQyMTMwOTk0._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "In 2003, 38-year-old graphic artist Oliver Fields has just lost his father Hal to cancer, 5 years after his mother Georgia's death. Oliver is naturally sullen because of his relationships with his parents growing up (especially his mother, who had a unique view of life) and watching their cordial but somewhat distant marital relationship, but he's more so now as he deals with his personal losses. He embarks on a relationship with French actress Anna, hoping that his re-energized relationship with Hal following Georgia's death, and Hal's new outlook on life, will show him how to act in a loving relationship. After Georgia's death, Hal came out of the closet and began to live with a new joie de vivre and have an open relationship with Andy, a much-younger man. Oliver's relationship with Anna has other obstacles, including her own vagabond lifestyle and Oliver inheriting Arthur, Hal's very needy Jack Russell terrier.—Huggo",
    "name": "Beginners",
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ]
}