{
    "filename": "Being-John-Malkovich_script.txt",
    "imdb_id": "tt0120601",
    "imdb_url": "https://www.imdb.com/title/tt0120601",
    "characters": [
        "Dr. Lester",
        "Daughter at Puppet Show",
        "Woman in Elevator (as Octavia L. Spencer)",
        "Derek Mantini",
        "Maxine Lund",
        "Captain Mertin",
        "Father at Puppet Show",
        "Lotte Schwartz",
        "Craig Schwartz",
        "Cab Driver",
        "Wendy",
        "John Horatio Malkovich",
        "Guy in Restaurant",
        "Tiny Woman",
        "Floris"
    ],
    "dialogues": {
        "Dr.": "Many cloaked people in the room kneeling with candles in hand before the lit photo of Malkovich. Lotte kneels in the back row. They chant:",
        "Lester": "All furniture is scaled down to fit into this low-ceilinged space. A few other short men sit reading tiny magazines. Craig approaches Floris, the receptionist.    Craig enters. Lester, a giant of an old man, sits hunched behind his tiny desk.       Come in, Mr. Juarez. I'd stand, but,     well, you know.       Security.       She's not my secretary. She's what     they call an executive liaison, and     I'm not banging her, if that's what     youre implying.       Tell me, Dr. Schwartz, what do you     feel you can bring to LesterCorp?        You think so, eh? Which comes first,     L or... Glooph?       Damn, you are good. I tried to trick     you. Okay, put these in order.  Lester hands Craig a bunch of index cards. Craig orders them with amazing speed and dexterity. Lester watches, eyes wide.        Floris, get Guinness on the phone.       Forget it.        Fine woman, Floris. I don't know how     she puts up with this damn speech     impediment of mine.       Flattery will get you everywhere,     my boy. But I'm afraid I have to     trust Floris on this one. You see,     she has her doctorate in speech     impedimentology from Case Western.     Perhaps you've read her memoirs,     \"I can't understand a word any of     you are saying.\"       Pity, it tells it like it is.     That's why the eastern, read Jewish,     publishing establishment won't touch     it. That's a quote from the book     jacket. George Will, I think.      I apologize if you can't understan     a word I'm saying, Dr. Schwartz.        Thank you for being kind enough to     lie. You see, I've been very lonely     in my isolated tower of     indecipherable speech. You're hired.     Any questions?       Low overhead, m'boy. We pass the     savings on to you.      But seriously, that's all covered in     orientation.    Craig in a cream colored suit, pours over the file cabinets. Floris watches from the doorway.       Don't toy with Floris, Schwartz.     Why, if I were eighty years younger,     I'd box your ears.       One hundred and five. Carrot juice.      Lot's of it. I swear, it's almost     not worth it. I piss orange. Oh,     and I, have to piss sitting down...     like a godamn girly... every fifteen     minutes. But nobody wants to die,     Schwartz.       No sir-e-bob, I don't die. But what     I do is get older, wrinkled like a     former plum that's become the     wrinkled prune you see before you.     Oh, to be a young man again, maybe     then Floris would care for me.       I don't want to be your godamn link,     damn you. I want to feel Floris'     naked thighs against my own. I want     to know passion. I want my body to     inspire lust in that beautiful,     complex woman. I want her to shiver     in a spasm of ecstasy when I     penetrate her. Oh, God, the agony     of the flesh, Schwartz.       All right. Meet me at the Juicy-Juice     Juice Bar after work today and I'll     spill my goddamn guts for you.  Lester exits.       Imagine a room full of women.     Nubile, blonde, wet with desire,     Schwartz. A harem, if you will.     Me in leather. A harness, if you     like. I am the object of this     desire, and all eyes are on me as     I speak. Ladies, I begin. I am     the love god, Eros. I intoxicate     you. My spunk is to you manna from     heaven...       Wife, huh? I'd love to meet her,     Craig.       Shall we say dinner on Friday.     Just the two of us?      You can come too if you like,     Schwartz.    Lester sits at his desk studying an instruction manual for a juicer. The spanking new juicer sits on his desk. There is an urgent knocking at the door.       Yes?  Craig rushes in.       Ah, Craig. Just the fellow I wanted     to see.      Juicer! Easy as pie. Just keep your     fingers clear of the blade, and     never, never use it while bathing in     a tub full of water.       Ah. yes, the little door.      There is a short film on the little     door in the orientation room in     exactly two minutes. If you hurry,     you'll just make it.       Put up reel 752.    It's a posh place with flocked wallpaper and candelabras. Lester, Craig, and Lotte sit around an elegantly appointed table with all different sorts of juices in front of them. Lotte is still wet. Lester sits quite close to her.       Tell me, Lotte, can you understand     a word I'm saying?       Oh, be still my heart.       With immense pleasure, my dear. Down     that hall, ninth door on the left.     Watch the step down. It's sunken,     you know.  Lotte smiles, and heads down the hall.       More beet-spinach juice, my friend?       I see. Are you unhappy at our little     company?       And what sort of business will this     be? If you don't mind my asking.       The vacant office. I see. Olive oil.     Interesting. Be warned, Schwartz,     there are certain doors which     should never be opened.    Lotte walks down the ritzy hallway. She is counting closed doors in search of the bathroom. She opens a door, looks inside, gasps, then enters the room.    Lotte enters the room. It is dark. At the far end there is what amounts to a candle-lit shrine to John Malkovich. The centerpiece of the shrine is an enormous photograph of Malkovich bordered by a garland of flowers. Lotte stares at it for a moment, then drops to her knees in front of it.       You're making a big mistake, Schwartz.      Ma'am       There are rules, boy, procedures,     etiquette. This is not a toy. I've     been waiting seventy years to utilize     this room, grooming myself, quietly     setting the stage, performing     ablutions, paying tribute, seeing all     his motion pictures again and again.     Worshipping, Schwartz, worshipping     properly.       I am not alone. There are others. We     are legion. You will pay for this     blasphemy. You will pay dearly.  Lester exits. Craig looks at Maxine. There is a moment of tension. Finally:    Many cloaked people in the room kneeling with candles in hand before the lit photo of Malkovich. Lotte kneels in the back row. They chant:    The worshippers mill about, chatting, drinking coffee, nibbling on cookies.       May I have your attention, please.     We have a new disciple among us tonight.       She is the wife of Schwartz.  A stunned hush falls over the group.       No you mustn't, my child.       We need you on the inside, my child.     To report on his comings and goings,     and if need be, to... destroy him...      ...for lack of a better word.    Lester sits at his desk. The intercom buzzes.        Yes, my dear?       Thank you, Floris.        Good morning, Lotte!       You followed your heart, my child,     and that is not necessarily a bad     thing.        My child, I don't think its a great     mystery what Craig's up to.    Lester's hand is in a bloody bandage. The juicer sits on hi desk. Lotte sits across from him looking nervous and hollow-eyed.       You know I think it pays to leave     juice-making to the trained     professionals. You look terrible,     my dear.       Hmmm, a lesbian, are you? I must     inform you that I find that highly     arousing.        What?! That is not allowed. My God,     you are supposed to be one of us.     You know you must never partake of     Malkovich by yourself!       Oh, didn't anyone show you the     indoctrination video?       Oh, sorry. Right this way.       Welcome, my fellow Malkovichians.     As you may already know, today a     baby was born into this sad world.  We see a shot of a newborn.       His name is John Horatio Hannibal     Malkovich. And we are the keepers     of the door to his soul. One day,     when his brain is big enough, we     will all journey into his head and     live there for all eternity. Following     the teachings of our leader Karl Marx,     we will build the ultimate communist     community, one body and hundreds,     maybe thousands, of brains inside     working together to form a super     human intellect capable of curing     disease, stopping all war, and     ruling the world with a benevolent     fist. We will take a wife, a woman     of uncommon beauty and intellect, who     is, as yet, still an infant herself.  We see a photo of another infant, this one with a ribbon in her hair.       Her name is Floris Horatia Hannibella     DeMent.       Well, I tried to explain it to her,     but...  Lester points to his ear and shrugs.    The worshippers are assembled. Lotte stands before them.       Perhaps you're right, Terry. We're     all prepared, and perhaps this     Schwartz fellow is forcing our hand     a bit. We will enter the portal     tonight!  Everyone cheers.       Aaaahhhh, the portal!       No! Don't harm the vessel!       I understand, but we must protect     the vessel at all costs.      Please, Craig, please step aside     and allow us to have what is     rightfully ours.        Clear the way for them, my friends.     They will be dealt with in due time.  The Malkovichians grumble and let Malkovich and Maxine exit.       Now, let's see what we can do to     salvage this portal... for the sake     of all that is good.  The Malkovichians converge on the sealed portal, and begin clawing desperately at the quick-drying cement. Fingers are scraped raw, and we see smears of blood and skin on the rough gray surface.       Well, let's see what we've got     here.  Lester crawls into the tunnel, the door slams behind him.       My God, where am I? This seems so     familiar.  The person walks past a mirror. It's Hitler.       My God, I'm Hitler in the bunker!     Aaaahhhh! Aaaah!       Oh, I'm just the actor in that     Twilight Zone episode.  There is a popping sound.    The cult members mill about, drinking coffee, chatting. Lester enters with the cult member who picked him up at the ditch. All quiet down and look over at him.       Thank you all for your efforts,     but I'm afraid we can no longer get     into Malkovich through the portal.       I'm not certain, my dear, but I     believe your husband has somehow     psychically diverted the route.       I'm afraid that no physical harm     must come to him as long as he     inhabits the vessel.       Actually, my friends, I suppose its     time I told you, I'm Captain James     Mertin.  The members fall into a stunned silence. Lester takes some refrigerator magnets and spells out L-E-S-T-E-R on a board. He then rearranges them for a while.       You see, Lester is an anagram for     Mertin.  Lester continues to rearrange the letters, getting a little tense now.       It used to work, I'm sure of it.  Several members check their watches.       Oh, damn it to hell. Anyway, I am.  L-E-S-T-E-R has been left as E-L R-E-S-T as Lester turns from the board to face the congregation.        I'm two hundred and five, truth be     told.       Lots of carrot juice, little lady.     That, and a deal with the Devil.  There is a lot of murmuring in the room now.       Surprise.  The cultists get tense, start to leave en masse.       Wait! It's not that bad! When we get     into Malkovich, we still get to rule     the world, just like I told you. The     only difference is that we rule in the     name of evil, instead of good.  People stop in their tracks.       Absolutely.  The cultists think about is, then shrug and stay put.       So anyway...  Lotte stands.       My dear, let me assure you that when     we attain power, it will be much more     pleasant for those inside Malkovich,     than for those outside.  Lotte stops and turns.       Anybody else?       But of course.       Good. I think its time to beckon     Mr. Flemmer. Perhaps He can help us     out of this pickle.    Mr. Flemmer, a silver-haired gentleman in turtleneck and blazer, scratches his head. The cultists patiently watch him.       And as I said, sir, we can't very     well exert physical persuasion upon     the sacred vessel Malkovich.       Didn't mean to imply that you were,     sir.       Blasphemous bastard.  Malkovich tap dances out onto the stage. He is amazingly nimble and the audience \"oohs\" and \"aahs.\"        Pretty good though.  Malkovich does an amazing triple somersault, lands on one knee and, with spread arms, begins singing: \"Kiss Today Goodbye.\"  in a beautiful tenor. The orchestra catches up with him. The audience goes wild. A pretty-boy young man with a big tousle of black hair and a shiny, tight suit appears at the back of the house. An usher glances over at him.       Not too shabby.  Mantini is now sitting in a good aisle seat next to a beautiful woman. Her boyfriend is being hauled toward the exit by the usher. The beautiful woman watches, with some concern, as the boyfriend is taken away. Then she turns and smiles flirtatiously at Mantini. Mantini smiles back. On stage Malkovich is dressed in a ringmaster's outfit and juggling chainsaws.       It's just me, boss. I brought     croissants.  Lester enters with a greasy white paper bag.       We saw his show at the Luxor last     night.       The kid's got talent. You've never     seen Malkovich like this. Schwartz     had him up there singing and dancing.     Impressions.       Very talented son of a bitch. Too bad     we can't kill him.       A scary dream?        I like that.       How'd it go? Did you say the     philodendron gets water or no?       What kind of circumstances?       The Great Mantini?       Oh, he's good! Great, actually. I     saw him do \"Tru\" with his sixty     foot Robert Morse puppet. Sensational.        Do tell. I love a good plan.       I missed you. I'm sorry. Tell me     the plan.       Can you do that? I mean, do you know     anything about puppetry?       I was just asking. No disrespect     intended.       Fine. I mean, it's not like I was     doubting you, it's just that I know     puppetry is a skill that takes a long     time to acquire.       Fine. Your mail's on the kitchen     table. Mostly junk. Oh, there's a     letter from Alex Trebek.",
        "Derek": "",
        "Mantini": "Make one empty.       Nothing more than a Goddamn clown.  At this point the entire audience stands and gives Malkovich a spontaneous standing ovation. All except Mantini. Even the cultists get up.        Hello, Schwartz. I saw your show.       Yeah, I saw them       Very impressive. I could use a     producer with your vision. And     other outstanding attributes.       We'll see, Schwartz. We'll see.       I won't waste your time Schwartz, or     more importantly, mine. Here's my     proposal: There's only room in this     world for one \"World's Greatest     Puppeteer.\"  Correct? So let's allow     the puppet-going public to crown     their king.       A friendly competition, if you will.     Your Malkovich puppet and my Harry S.     Truman puppet appear opposite each     other in a play. Not some Vegas     Burly-Q pyrotechnics, but a real play     that requires actual acting. The     audience decides who is more deserving     of the title. The losing puppeteer     bows out graciously. Goes back to     obscurity as a file clerk.       Say... \"Equus\"? It's got everything.       Broadway's finest three hours. It's     about the suppression of the     individual. Conformity as God in     modern society.       Nothing but acting to hide behind,     buddy-boy.       Great then.       No.        I can't wait to see where you and your     friends live, Lotte.",
        "Maxine": "Yes. Unfortunately it's bullshit.     The real story of 7 1/2 is so evil     that it could never be revealed     to Americans raised on sitcoms and     happy news anchors.       Well, truth is for suckers, isn't     it?.       How dreary - to be - Somebody /     How public - like a Frog /     To tell one's name - the livelong June /     To an admiring Bog!       I wouldn't know.  Maxine walks away.       Yes, well...       And fifty other lines to get into     a girl's pants.       You know, if you ever got me, you     wouldn't have a clue what to do     with me. That's the thing, Romeo.  Maxine walks away.       What?       Yeah.       Why not?       Who told you?       Who told you?       Somebody told you.       I am dubious, but I don't welsh.     Meet me at The Stuck Pig. Seven     o'clock. You're late, I walk. So     help me, if I find out you cheated.       Just.       You married?        The usual, Barry.       My tits?       Christ, you're not a fag are you?     Because I don't want to be wasting     my time.  The drinks arrive. Maxine's is in an enormous fishbowl of a glass. It's bright blue, with fruit and marshmallows swimming in it. Paper umbrellas stick out of it, an plastic monkeys hang from the rim.       Dont let the girly shit fool you.     It'd blow your shorts off.  Maxine downs it like a shot of whiskey. She pushes the empty glass to the bartender.       Set me up again, Barry.  The bartender walks away with the empty glass.       You're a fag or a liar.        I mean, I am really attracted to     you. Jesus, you are a fag. We can     share recipes, if you like, Darlene.  Maxine gets up.        Good. Now we're getting somewhere.      Not a chance.  Maxine's second drink comes. She downs it, pushes the glass toward the bartender.       So, tell me about yourself. If you     can get your mind out of the gutter     long enough, dog-boy.        Check.       You're not someone I could get     interested in. Craig. You play     with dolls.       Yikes.       You might want to check those tarot     cards one more time.  Maxine heads for the door. Craig sits on a box. He puts his head in his hands and sighs. Across the room he notices a very small door with a two by four nailed across it.    Maxine sits at her desk, eats a sandwich. looks at a fashion magazine, and chats on the phone.       The puppeteer told me he loves me     today.      I know. I can't think of anything     more pathetic.    Maxine sits behind her desk with her feet up, and talks on the phone.       Absolutely, doll. I'm just about     to close up here.  Craig walks in disheveled and exhausted. Maxine sees him, keeps talking.        Meet you at The Pig in twenty     minutes.      Oh yeah, maybe I'll keep my legs     closed till then.      I'm splitting for the day. Lock up     for me, won't you, darling.  Maxine stands, puts some stuff in her purse.        No.  Maxine heads for the door. Craig grabs her arm.        It better be.  Craig sits Maxine down in a chair, lets go of her arm.       Sounds delightful. Who the fuck is     John Malkovich?       What's he been in?       Is this Malkovich fellow appealing?       Good. We'll sell tickets.       Exactly. Two hundred dollars a pop.       Fine. I'll do it myself. I was going     to offer a partnership to you, but     this way it's more money for me.        Sure. It'd be fun.       I'll protect you, Dollface.  Maxine reaches over and squeezes his lips affectionately between her thumb and forefinger.    Craig holds open the small door as Lotte climbs in.    Maxine sits at her desk composing an ad. Craig stands behind her, ostensibly looking over her shoulder, but actually studying the back of her head. He sighs.       Okay. Here it is.      Ever want to be someone else? Now you     can. No kidding. Only two hundred     dollars for fifteen minutes. Visit     J.M. Inc., Mertin-Flemmer Building.     etc., etc.        Yes, hello, I wanted to place an ad.      Hi, are you Craig's wife?       Hi, uh.      Hi. I wanted to place an ad. Yes.     \"Ever want to be someone else?\"     No, that's the ad, but let's talk     about you in a minute. \"Ever want     to be someone else? Now you can.     No kidding...\"        Let her go, Craig. I mean him.\"       You better hurry. Traffic.  Maxine tosses Craig his car keys. He heads out the door. Maxine dials the phone.        Davey? Max. Get me John Malkovich's     home phone? That's great. Love ya     and owe ya.        Mr. Malkovich?       You don't know me, but I'm a great     admirer of yours.       It's just that I fantasize about     you and, well, speaking to you     now has gotten me sort of excited     and...       Hi. I'm so glad you decided to     come. I'm Maxine.  Maxine holds out her hand. She is charming. Malkovich takes her hand.       And the funny thing is. Mr. Malkovich,     my voice is probably the least     intriguing thing about me.       Whatever you're having.       Ah.        The way I see it, the world is divide     into those go after what they want     and those who don't. The passionate     ones, the ones who go after what they     want, may not get what they want, but     they remain vital, in touch with     themselves, and when they lie on     their deathbeds, they have few     regrets. The ones who don't go     after what they want... well, who     gives a shit about them anyway?  Maxine laughs. There is another silence. Suddenly, at the same moment, both Craig and Lotte lunge for Maxine and start kissing her passionately about the face and neck. They stop just as suddenly and look at each other.       Craig, I just don't find you     attractive. And, Lotte, I'm smitten     with you, but only when you're in     Malkovich. When I looked into his     eyes last night, I could feel you     peering out. Behind the stubble and     the too-prominent brow and the male     pattern baldness, I sensed your     feminine longing peering out, and     it just slew me.        Only to John, sweetie. I'm sorry.      Thanks for a wonderful dinner.      No hard feelings, partner.  Maxine exits. Craig and Lotte look at each other.    It is deadly silent. Craig and Maxine sit at their desks. The wall clock ticks. Craig whistles tunelessly, every once in a while looking up and discreetly checking out Maxine. Eventually there is a knock at the door.       No.       No. Don't be an ass.       You can be John Malkovich.       Two hundred dollars, please.    Craig kneels at the door and peeks out through the mail slot. Maxine sits at her desk and files her toenails.       So unbolt the fucking door, Einstein.  Craig unlocks the door. Lester steps in, closes the door behind him, locks it.       Crackpot.  Craig opens the door. The first few fat people move noisily into the room.    The phone rings. Maxine sleepily picks it up.       Yes?       When?    The doorbell rings. Maxine, in a sheer black nightgown, answers it. John Malkovich stands there.       Thanks so much for coming over.    Lotte sits on the floor in the dark. She leans, out of breath, against the wall next to the portal and checks her watch. The time is 4:10. She pulls open the door.    Maxine and Malkovich sit a bit awkwardly next to each other on the couch.       So, do you enjoy being an actor?       I love you, Lotte.       Do you mind?       Oh, my sweet, beautiful Lotte.    Craig enters with red-rimmed eyes. Maxine sits at her desk, actually looking kind of radiant.       You're late.        I've fallen in love.       You picked the unrequited variety.     Very bad for the skin.       Do you have any idea what its like     to have two people look at you with     total lust and devotion through the     same pair of eyes? No I don't suppose     you would. It's quite a thrill, Craig.  Craig turns and walks out the door.       J.M. Inc. Be all that someone else     can be.       Sweetie! Oh, but we can't. It's     business hours. I need to keep the     membranous tunnel open for paying     customers.       Oooh, doll. I love this new     devil-may-care side of you. Alrighty,     I'll track down Lover-boy, and I'll     see both of you in one hour.     Exactamundo.  Maxine hangs up. Lotte hands the phone to Craig, who hangs it up. Craig opens up the big cage where Elijah is housed, and motions with the gun for Lotte to enter.       Oh, Lotte... Oh, sweetie...  We now watch the scene from Malkovich's POV.    Craig is toweling himself off, hurriedly combing his hair. Maxine enters.       A girl has a right to glow if     she wants. It's in the fucking     constitution.  Maxine sits. Craig smiles to himself.    Malkovich and Maxine are having sex on Maxine's couch.       Lotte, this is so good...       Lotte? Is that you?       Oh, Lotte...  Maxine kisses Malkovich hard on the lips. There is a sucking sound.    A panicked Malkovich is pulling on his clothes.       Oh, Dollface, it was just your passion     for me taking hold.    Craig and Malkovich enter. Maxine looks up, startled, but controlling it.       Darling!       Let him try.        How the hell would I know? I wasn't     a philosophy major.       J.M. Inc. Be all that someone...       One hour.  Craig hangs up, tapes Lotte's mouth.        Really? Well, you know, he's quite     good. I'm surprised. Anyway, I have     a session with Malkovich I have to     attend. I'll speak with you soon.       I thought so too, doll. I guess we     were mistaken.  Maxine hangs up. Lotte, visibly shaken, dials the phone.       I can explain about the portal,     darling.       Oh shut up.      Craig, darling are you in there?  Malkovich tenses up, then shakes his head in an awkward, puppet-like manner. When Malkovich speaks, it seems to be against him will.       Lotte called me.       Apparently you can control this     Malkovich fellow now.       I'll say you are. Let's do it on his     kitchen table, then make him eat an     omelette off of it.       You still there, sweets?       Wow.      Do a puppet show for me, Craig honey.       I'd love to see your work.        That was incredible. You're brilliant!       You're right, my darling, it's     so much more. It's playing with     people!  Malkovich kisses Maxine. She snuggles close to him.       Stay in him forever?       Well, we'll have all the money in     Malkovich's bank account, plus he     still gets acting work occasionally.       No one would ever have to know its     not him.       Oh, Craiggy, that's brilliant!    Maxine and Malkovich are furiously filling the portal with cement. Suddenly Malkovich stops and runs to the office door screaming a bloodcurdling scream. He stops just as suddenly, begins to strangle himself.        It's okay, my sweet.  They go back to filling the portal. There is the sound of many shuffling feet in the hallway. The door flies open and the Malkovichians led by Lester and Lotte burst in. Malkovich and Maxine turn with a start.       Now excuse us, we have an     entertainment legend to create.       No thanks.       Vegas.    The cult members are still there, now with picks shovels. They are worn out and sweaty. The portal is excavated, but it seems ragged and destroyed. Man #2 emerges from the hole, a rope tied around his waist.       This is it, lover. You're stepping     onto that stage a nobody and     presto-change-o, you're coming     back the greatest puppeteer the     world has ever seen.       Doesn't he know how important     tonight is to us?       Oh, darling. It's a dream come true.     We're going to ride this straight to     the top.       Busy day, my little fire chief. Why     don't you climb into bed, and I'll     meet you there in just...  But Malkovich is already passed out on the floor on top of his clippings. Maxine smiles maternally, gets up and puts blanket over him. We stay on Malkovich's face.       Bad dream, darling?       You've got to be kidding.       Malkovich is our meal ticket. You     can't back out because of some     stupid dream.        Perhaps you'll want to consult that     Ouija board again.  There is a knock at the door. Maxine opens it, angry.       Yeah what?!       I'm Maxine. I produced the evening     with Malkovich.       Yeah, we'll see, Schwartz. We'll see.        Keep your eyes in your pants, old     timer.       You'd better turn on the pyrotechnics,     lover, 'cause right now you're running     neck and neck with the dead president.     And you're both in last place.  Malkovich continues to watch himself in the mirror, nods his head.       Whatever.  Malkovich drops limply to the floor. He lifts his head.    Lester is surrounded by all the Malkovichians. He holds the walkie-talkie, has just received word. He nods, and the Malkovichians crawl in single file into the portal, while shrieking a war cry.",
        "Lund": "",
        "Captain": "",
        "Mertin": "Enter ye, if ye dare enter.  A tiny woman enters.       What want ye, girl child?        I see. Well, it is not my fault that     thou art tiny. So if it is charity     yer after, then be gone with ye,     ye foul demon.        Aye. Speak then if ye must.       Woman, your story moves me like n     other. Me own sister was tiny and     then died. Therefore, I shall make     ye me wife. And I shall build a     floor in my building, between the     7th and 8th, which will be scaled     down, so from now on there shall     be at least one place on God's green     Earth that you and your accursed     kind can live in peace...    A man-hole cover lifts. Lotte pokes her head out. The coast is clear. She emerges. Assumes the dead-eyed expression of the others, and enters the building.",
        "Lotte": "Craig jolts awake. A rooster stands on Craig's chest, crowing. Lotte, also 30, in the middle of dressing for work, hurries in and pulls the bird from Craig's chest.        Sorry, hon. I didn't know Orrin     Hatch was out of his pen. Good     morning.   Lotte leans down and kisses Craig on the forehead.       Gotta run. Shipment of grub worms     coming in first thing.       Craig, listen, honey, I've been     thinking... maybe you'd feel better     if you got, you know, a job or     something.       Well, you know, maybe something else     until this whole puppet thing turns     around.        Craig, everyone can't be Derek Mantini.      Well, grub worms are waiting. Do me     a favor?       Would you check in on Elijah? He seems     to be a little under the weather this     morning.       The monkey.    The place is a mess. Vivaldi blasts through cheap speakers. A small marionette stage stands in the back of the garage. The stage is lit and on it is a finely sculpted puppet version of Craig. The \"Craig\" puppet paces back and forth, wringing its hands with incredible subtlety. We see Craig, above and behind the stage. He is manipulating the puppet. His fingers move fast and furious. The puppet breaks into a dance, a beautiful and intricate balletic piece. Soon the puppet is leaping and tumbling through space, moves that one would think impossible for a marionette. Sweat appears on the real Craigs brow. His fingers move like lightning. The puppet moves faster and faster. Sweat appears on the puppet's brow. We see that the sweat is being piped from a special device that the real Craig controls. The Craig puppet collapses on the floor of the stage. It puts its hands up to its face and weeps. Craig hangs the puppet, and comes down around the front of the stage. He is heaving. He switches off the music, picks up a beer and takes a swig.    The room is filled with penned and unpenned animals of all kinds: snakes, lizards, birds, a dog, cats, etc. Craig sits on the couch and looks at the want ads, the TV is on in the background. Elijah, the monkey, sits next to Craig holding his stomach and moaning weakly. On the TV, Derek Mantini is working a 60 foot high marionette from the top of a water tower. The assembled crowd is enthralled.     Craig searches through Lotte's closet, looking for the right dress.    Craig waxes his body, shaves his face.    Craig paints his nails while he chats on the phone. Craig pulls stockings and underwear from Lotte's drawer. Craig picks a wig from a mannequin head on Lotte's dressing table.     Craig, at the sewing machine, is sewing padding to go onto his chest and around his hips.    Craig applies make up in the bathroom mirror.     Craig, now looking very much like a woman, admires himself in the full length mirror.        Is the trial date set?       Why'd you do it, Craig?    Craig sits on the couch in his bathrobe and studies the want ads. He sees an ad for a company called \"WOMYN-TEERS\", looking for \"an African-American, Lesbian Separatist Puppeteer for Community Outreach.\" Craig rubs his chin in thought, stands with determination.     Craig applies a dark pancake make-up to his face.    Craig pulls an afro-style wig off a mannequin head on Lotte's dressing table.        Why, Craig. why?    Craig reads the paper. He comes across an ad: \"Female puppeteer wanted for nudist colony marionette staging of 'Oh, Calcutta!'\"  Craig rubs his chin.        You know, maybe you should speak to     someone about this.    Craig sees a personal ad: \"Male puppeteer looking for attractive female puppeteer for friendship, travel, and much much more.\"  Craig rubs his chin, then thinks better of it and sighs. He finds a want ad calling for a \"short-statured file clerk with unusually nimble and dexterous fingers needed for speed filing.\"  Craig writes down the address.    Lotte chops onions. A parrot sits on her head. Craig stirs a pot on the stove. A monkey leaps from the top of the cabinet to the top of the refrigerator to the kitchen table. A dog watches the monkey and barks at it.        Sorry, honey.  The dog continues to bark.        Sorry!  Lotte grabs the parrot off her head and leaves the room.       Isn't that cute? I just taught her     that.       Seven-ish       They'll understand. Besides I've got     a morning appointment tomorrow with     Elijah's shrink. We're getting to the     bottom of this acid stomach.       Some sort of childhood trauma, she     thinks. Possible feelings of     inadequacy as a chimp. Interesting,     huh?    The dining room table is set up. Craig and Lotte and their friends Peter and Gloria are seated and eating dinner. There is an obvious lull in the conversation.       Thanks. Craig helped, too, by the     way.       Yes. All vegetable. all the time.    Craig washes the dishes. Lotte dries them. They dont look at each other.    Craig is at his workbench, painting the finishing touches on a new puppet. It is beautiful. It is Maxine. Lotte watches quietly from  the door. A Lotte puppet hangs from a hook, tangled and dusty.       New puppet?  Craig is surprised, caught.       She's very beautiful.    The room is dark. Lotte snores lightly. Craig lies there with his eyes open. Quietly, he gets up and leaves the bedroom. Lotte watches him go.    Lotte is combing Elijah. Craig enters.       Hi.       Did you eat?       I was worried.       Tom-Tom's puncture wound is     infected.       The iguana.       I dressed the wound. Then I've     just been feeding everyone, putting     everyone to bed.       No thanks. I'm going to turn in.       'kay.  Lotte exits.    Craig and Lotte are getting into evening clothes.       Don't be ridiculous. There is no such     thing as a portal into someone else's     brain.       I want to try.       I want to be John Malkovich. Tomorrow     morning. Plus I'd like to meet this     partner of yours.       Now?       I'm scared.  The door slams shut.       Holy cow!  Malkovich steps out of the shower, slowly towels himself dry.       Oh, yes. Yes.       I have to go back.       I have to go back now.    Craig drives. Lotte looks distractedly out the window.       I have to go back, Craig. Being     inside did something to me. All of a     sudden everything made sense. I knew     who I was.        I was, wasn't I?      I was John fucking Malkovich!      Take me back, Craig.       Yes, of course, Dr. Lester.       Dr. Lester, would you point me     toward the restroom?    Lotte has just taken a shower. She towels herself dry in much the same way as Malkovich. Her eyes are closed. She opens them slowly and sees herself in the mirror. Disappointedly, she drops the towel and heads out of the bathroom.    Craig sits at his work table. He is pulling the heads off of the Craig and the Maxine puppets. He puts the Maxine head on the Craig puppet. He sighs.       Fuck pets. Is this your partner?     I had to come back and do the     Malkovich ride again. Fuck everything     else. Is this her?       Yes, Hi.       Hi. Have you done Malkovich yet?       I've been going over and over my     experience last night. It was amazing.      I've decided I'm a transsexual. Isn't     that the craziest thing?       Everything felt right for the first     time. I need to go back to make sure,     then if the feeling is still there.     I'm going to speak to Dr. Feldman     about sexual reassignment surgery.       Don't stand in the way of my     actualization as a man, Craig.       What raw, animal power!        Oh, I like this.       My God!      Meet her there. Meet her there. Meet     her there. Meet her there. Meet her     there...  Malkovich goes back to his script.       Meet her there. Meet her there. Meet     her there...  Malkovich picks up a pen and writes: Bernardo's 8:00.       I have to go back tonight. At eight     Exactly.       Don't crowd me, Craig.       Maxine!  Maxine spots Malkovich. and heads over. He focuses on her.       God, she's beautiful. The way she's     looking at me. At him. At us.       I've never been looked at like this     by a woman.    Craig drives. Lotte is soaking wet. She stares out the window.       Oh, you know, not a lot. Just hanging     around his apartment. I think he must     be a lonely man.       You're right. You know I was thinking     that we should have Maxine over for     dinner. Since you two are partners     and all. It might be a nice gesture.       It'll be okay. I'll fix my lasagna.     Well smoke a joint.      Tensions will melt away.    Craig, Lotte, and Maxine are seated at the table and eating lasagna. Lotte eyes Maxine. Craig eyes Maxine. There is an awkward silence.        Did you know that Eskimos have not     one, but fifty words for snow. It's     because they have so much of it.       After that I'll introduce you to my     favorite monkey, Elijah. He's got an     ulcer, due to a suppressed childhood     trauma. But we're getting to the     bottom of it.      Psychotherapy.  There is another silence.       I want a divorce.        I'm getting divorced.       But why, Son of Malkovich?    Craig is putting stuff in boxes. Lotte enters in her cloak.       What are you doing?       Nothing. Don't go, Craig. I've been     thinking. Let's try to work this out.     We've got so much history.       I'm getting rid of the fucking     animals.       I'm getting rid of the animals. I've     lost interest. Besides, they're     standing between you and me.       You've always hated the animals.       I'm giving them up. I've changed.     I've found a new focus.        Us, of course.  Craig looks up from his packing. He and Lotte stare at each other for a long while.       Fuck Maxine.    The clock reads 3:00 AM. Craig, in his pajamas, is working the Craig and Maxine puppets. They make love on the bare puppet stage. Craig seems possessed.       I have to see you. Can you call him     and invite us over?       Give me one hour to get inside him     Exactly.  Maxine checks her alarm clock. The time is 3:11 AM.    Lotte drives.       Oh my darling. Oh my sweetheart.       Maxine...       This is too good to be true.    A sweaty and spent Craig sneaks back into the bedroom. He sees that the bed is empty.    Craig is hunched over a cup of coffee. The front door can be heard to open. After a moment Lotte appears in the kitchen doorway. She is caked with dirt. Craig looks up at her.        Yes.       We love her, Craig. I'm sorry.       Me and John.       Well, you have the Maxine action     figure to play with.  Craig looks down at his coffee.       I'm sorry. That was nasty.       Sometimes we're forced to make     hard decisions.      I'd like for us to stay together,     Craig. You know, platonically,     if that's possible. I truly value     our friendship.       Dr. Lester, everything's falling     apart.       I blew it, Dr. Lester.       But now we've lost access to Craig.    Craig stands still and tense, with gun in hand. We hear the front door unlock. Lotte enters. She does not see Craig. He grabs her from behind as she passes. Lotte screams. Craig holds the gun to her head.       I'm your Goddamn wife. Once you vowed     to cherish me forever. Now you hold     a gun to my head?       Suck my dick!        You bastard.  Craig cocks the pistol.        I have to see you.       What the hell, darling. Close early     today, live dangerously.        Help! He's locking me in a cage!  Craig slaps Lotte hard. She looks at him, almost sadly.    Craig is feeding the various caged animals. He puts two plates of food in Elijah's cage. Lotte is ungagged and unbound now. She eats as Craig slumps down next to the cage, gun in hand.       It'll never happen, fuckface.       What's that?    A wet, mess Craig sits next to Lotte's cage. Lotte is bound and gagged.    Craig is feeding the animals. His gun is stuck in his pants. He gets to Lotte's cage. She is bound but ungagged. She looks haggard.       Once this was a relationship based     on love. Now you have me in a cage     with a monkey and a gun to my head.       You fell in love with her first.       You didn't do anything about it out     of respect for the fact that she     wouldn't let you near her with a ten     foot pole, which is, by the way,     about nine feet, nine inches off     the mark anyway.       Maybe this is what you've always     been, Craig, you just never faced     it before.       I need a shower.       You're not a monster, Craig. Just     a confused man.       We have to meet.    Elijah shakes off the memory and looks determinedly at the ropes on Lotte's hands. He attempts to untie the knot. He works furiously and succeeds. Lotte pulls the tape from her mouth.       Oh, Elijah, you are magnificent!  Elijah beams and screams for ecstatic joy. Lotte unlocks the cage, and dials the phone.       Maxine! Listen:  It hasn't been me     in John the last three times. Craig's     had me locked up in the apartment. He     made me call you at gunpoint. It's     been him! Oh, God, it's been him!       But Maxine, I thought it was me you     loved.       Hello, Dr. Lester?       Craig stole Maxine from me, Dr.     Lester.       No, you don't understand. I've been     inside Malkovich when I'm with     Maxine...       No, I didn't know that.       No.       Does Floris know that she's the     chosen?       I have sinned, unwittingly, against     the community. And for this I am     truly sorry.       Oh, it's glorious. It's indescribable.        You bastard!  Lotte lunges for Malkovich. Lester grabs her arm, holds her back.       It's Craig in there, I can tell.        Why not? I need to get in there!       That bastard! I'll gladly dispose     of him in the name of the order, Son     of Malkovich.       Well, I for one, am resigning. I will     not serve evil. I am ashamed of all     of you.  Lotte heads for the door.       I'll take my chances.  She exits.    Lotte site in the living room, in her pajamas, softly sobbing. The caged animals watch her.       Oh, my friends. Be thankful you're     not human. People are treacherous     and greedy and corrupt. I've lost     my heart to two of them and I almost     lost my soul to another. And I'm no     better. Look at the way I keep you,     locked in cages, for my own enjoyment.     Well, I've been in a cage too, my     friends. Literally and figuratively.     So tonight I set you free.  Lotte opens the windows and the front door, then unlocks all the cages. The animals scurry and fly out of their cages, and out of the house. Lotte watches silently until she is alone.       Good-bye, friends.  A hand reaches for hers. She looks down. Elijah is still there and holding her hand. She smiles.       Hello, friend    Lotte and Elijah see the dark figure coming up the steps. The buzzer rings. Lotte and Elijah jump.       They've come to kill me, Elijah. See,     I know too much. I should get the     door. It's impolite to keep death     waiting.  Elijah looks at her sweetly, a great sadness in his eyes. Then he leads her by the hand out the window.       They're going to take over the     world, Elijah. Evil will reign.     But, then, evil already reigns,     doesn't it? So what difference     does it make if John Malkovich     is wearing the fucking crown while     it's reigning?  Elijah sighs, then holds his stomach. The ulcer is returning.       I'm glad you learned sign language,     Elijah, but I'm tired of your nagging.     I'm tired of this conversation. I'm     tired period. What has the world ever     done for me that I should feel     personally responsible for saving it?       What have I become?       Yes. I'm the only one. I have to enter     Malkovich and destroy him from the     inside. If not me, who?        Hush, sweetheart.  Lotte slips into a gray jumpsuit. She stuffs a homemade bomb on her pocket. She and Elijah kiss passionately, then embrace.        I'll be with you always, my friends.     Who knows, maybe if I'm lucky, I'll     rejoin you with wings and a beak.       My God!       I'm in love. For the first time.     It's funny, but when it happens to     you, there's no question.       It's Elijah.       The monkey.       A better friend.        It's okay, Craig. It all worked out,     in an odd sort of way.       Yeah. I was going to kill him from     the inside.       You saw it once. Now you see it again.     That's life, isn't it? And you were     up here to try the same thing, weren't     you?       I don't know. There's a small     community of us. We have a place they     don't know about. We're happy. We'll     keep trying to figure out a way. Come     stay with us. Join the struggle.       People make mistakes.       I know.       Sure. We could really use a farmer.     We'd be grateful for the help.      Also, I think, you know, if you     wouldn't mind too terribly, a little     puppet show every once in a while,     would do a lot to lift our spirits.     You know, if you wouldn't mind too     terribly.  Craig's eyes well up with tears. Lotte looks at him sweetly.       Oh honey. It's gonna be okay.  She puts her arm around him and leads him toward the elevator.       It's beautiful, Craig, like Eden.  Now we see filaments attached to Mantini's arms, and w follow them up to find that Flemmer is controlling Mantini.",
        "Schwartz": "",
        "Craig": "Craig jolts awake. A rooster stands on Craig's chest, crowing. Lotte, also 30, in the middle of dressing for work, hurries in and pulls the bird from Craig's chest.        Morning.       Enjoy.       We've been over this. Nobody's     looking for a puppeteer in today's     wintry economic climate.        The Great Mantini doesn't need a day     job.       What?       Which one is Elijah again?       Yeah. Okay.    The place is a mess. Vivaldi blasts through cheap speakers. A small marionette stage stands in the back of the garage. The stage is lit and on it is a finely sculpted puppet version of Craig. The \"Craig\" puppet paces back and forth, wringing its hands with incredible subtlety. We see Craig, above and behind the stage. He is manipulating the puppet. His fingers move fast and furious. The puppet breaks into a dance, a beautiful and intricate balletic piece. Soon the puppet is leaping and tumbling through space, moves that one would think impossible for a marionette. Sweat appears on the real Craigs brow. His fingers move like lightning. The puppet moves faster and faster. Sweat appears on the puppet's brow. We see that the sweat is being piped from a special device that the real Craig controls. The Craig puppet collapses on the floor of the stage. It puts its hands up to its face and weeps. Craig hangs the puppet, and comes down around the front of the stage. He is heaving. He switches off the music, picks up a beer and takes a swig.    The room is filled with penned and unpenned animals of all kinds: snakes, lizards, birds, a dog, cats, etc. Craig sits on the couch and looks at the want ads, the TV is on in the background. Elijah, the monkey, sits next to Craig holding his stomach and moaning weakly. On the TV, Derek Mantini is working a 60 foot high marionette from the top of a water tower. The assembled crowd is enthralled.        Gimmicky bastard.  Craig switches off the TV. He comes across an ad for a female puppeteer to teach at a girls school. Craig rubs his chin in thought, then stands with great determination.     Craig searches through Lotte's closet, looking for the right dress.    Craig waxes his body, shaves his face.    Craig paints his nails while he chats on the phone. Craig pulls stockings and underwear from Lotte's drawer. Craig picks a wig from a mannequin head on Lotte's dressing table.     Craig, at the sewing machine, is sewing padding to go onto his chest and around his hips.    Craig applies make up in the bathroom mirror.     Craig, now looking very much like a woman, admires himself in the full length mirror.       May 11th.        I'm a puppeteer.  They drive in silence.    Craig sits on the couch in his bathrobe and studies the want ads. He sees an ad for a company called \"WOMYN-TEERS\", looking for \"an African-American, Lesbian Separatist Puppeteer for Community Outreach.\" Craig rubs his chin in thought, stands with determination.     Craig applies a dark pancake make-up to his face.    Craig pulls an afro-style wig off a mannequin head on Lotte's dressing table.        I... puppeteer.    Craig reads the paper. He comes across an ad: \"Female puppeteer wanted for nudist colony marionette staging of 'Oh, Calcutta!'\"  Craig rubs his chin.    Craig sees a personal ad: \"Male puppeteer looking for attractive female puppeteer for friendship, travel, and much much more.\"  Craig rubs his chin, then thinks better of it and sighs. He finds a want ad calling for a \"short-statured file clerk with unusually nimble and dexterous fingers needed for speed filing.\"  Craig writes down the address.       Uh. yeah.       Thank you.  Craig climbs out onto the 7 1/2 floor.       No, uh, my name is Craig Schwartz.     I have an interview with Mr. Lester.       Schwartz.       Schwartz.       My name is Schwartz.       Forget it.  Craig takes a seat next to the other applicants.       Yes?       I said \"yes.\"        Actually, my name is Craig Schwartz,     Dr. Lester.  Lester flips an intercom switch.       No, it's okay, sir. Just a mixup with     your secretary.       Not at all, Dr. Lester. I simply     misspoke.       Well, sir, I'm an excellent filer.       Glooph is not a letter, sir.       You don't have a speech impediment,     Dr. Lester.       No.       No. I understand perfectly.       Just one. Why is this floor so short?       Moving story.       Is that true?       Listen. I'm Craig Schwartz, just     starting out at LesterCorp.        Emily Dickinson.    Lotte chops onions. A parrot sits on her head. Craig stirs a pot on the stove. A monkey leaps from the top of the cabinet to the top of the refrigerator to the kitchen table. A dog watches the monkey and barks at it.       Shut up!       Adorable. What time are they supposed     to be here?       We have to make it an early night.        Hmmm.       Hmmm.  The doorbell rings. The dog barks. The parrot screams. The neighbor pounds on the wall.    The dining room table is set up. Craig and Lotte and their friends Peter and Gloria are seated and eating dinner. There is an obvious lull in the conversation.       No kidding, Peter.    Craig washes the dishes. Lotte dries them. They dont look at each other.        Thank you, Floris.  Floris shrugs, shakes her head.       I am a trained performer.       Hello again.  Craig fills her cup.       You know, I've been thinking about     what you said yesterday, about the     orientation film being a cover-up.     I think you're on to something.       No, really.    Craig is at his workbench, painting the finishing touches on a new puppet. It is beautiful. It is Maxine. Lotte watches quietly from  the door. A Lotte puppet hangs from a hook, tangled and dusty.       Yeah, just an idea I had.        Just an idea I had.  Craig hangs the puppet, stands, and switches off the light.       C'mon, let's go to bed.    The room is dark. Lotte snores lightly. Craig lies there with his eyes open. Quietly, he gets up and leaves the bedroom. Lotte watches him go.        I would too know what to do with you.       Floris, you're very nice, but I'm     afraid Im in love with somebody     else.       I wasn't toying with her, sir. I     was just... How old are you?       I'll keep that in mind, sir.       The elderly have so much to offer,     sir. They are our link with history.       Dr. Lester, while I am flattered that     you share your feelings with me, I     believe perhaps the workplace is not     the most suitable environment for     this type of discussion.       Shit.        I won't be late. I just have to     listen to Lester's sexual fantasies     and drink carrot juice for a little     while. It's a job thing.  Maxine walks by. Craig grabs her arm, signals for her to wait a minute. She waits.        I gotta go back to work. Yeah,     okay. You too. Okay. Bye.  Craig hangs up.       I just wanted to say hi.  Did     you know I still don't know your     name or where you work?       How about this, if I can guess your     first name within three tries, you     have to come out for a drink with me     tonight.       Great.      Buuuhhppaahhhhnnn. . . . .     Muhhhahhhhh. . . . . ahhhnnnaaa. .     nollltuuukkkaaaaralllll. . .     tashabararassssssuuuuusaaaaaaa. . .     nnnnnnnaaaaaannnnnnnnncccccceeeeeee     Mwaaaaaa. . . . .Mahhhhhkkkkk. . .     sssseeeeeen. Maxine?       I'm right?       That's incredible! Nobody told me!     I swear! It's kismet. Maxine!     It's a beautiful name. There's a     psychic connection. Don't you see?     It was meant to be! Maxine! Maxine!     Maxine! I will shout it from the     rooftops!       Oh, Maxine, nobody told me. Maxine,     Maxine. It just came out of me like     a song, Maxine. A beautiful crazy,     song, Maxine. Maxine. Maxine!        Maxine.  Craig walks down the hall. A tiny smile flits across Maxine's face.        Dr. Lester, it's been really     fascinating, but I'm afraid I have     to get home to my wife now.       Yessir.        That's sounds fine, sir. Gotta     run.  Craig hurries to the door. Lester downs Craig's juice, signals the waiter for more.       Made it. Maxine. Maxine, Maxine,     Maxine.       Buy you a drink, Maxine?       Yeah. But enough about me.  Maxine laughs. The bartender approaches.       What'll you have?        I'll have, like, a beer. Like a     Budweiser, or something.  The bartender walks away.       I like you. I don't know what it     is exactly.       No, no, it's your energy or your     attitude or the way you carry     yourself or...       That's the usual?       Im not a homosexual. I just like     women for more than their bodies.     I guess you could say I'm the new     American male.        I mean, I am really attracted to     you.        No, wait! I like your tits.      I love your tits. I want to fuck     you.       Well, I'm a puppeteer...  The bartender comes back with Maxine's drink.    Lotte is combing Elijah. Craig enters.       Hi.        Sorry, I'm so late. Lester just     wouldn't let me go. Were supposed     to have dinner with him on Friday.     I can get us out of it if you want.     He's really amazing, this insane old     lech. It's actually sort of amusing     when you get past just how disgusting     it is.  There is a silence. Lotte continues to comb out Elijah. Finally:       Nah. I'm not hungry. I'm sorry I     didn't call. It was just, you know,     hard to get away.       I'm sorry. How was your evening?       The ferret?       Right.       Yeah. You want a beer?       All right. I'll be in my workshop     for a little while. I'll be in in     a little while. I need to unwind a     little.      I'll be in soon. A little while.        Tell me, Craig, why do you love     puppeteering?      Well, Maxine, I'm not sure exactly.     Perhaps it's the idea of becoming     someone else for a little while.     Being inside another skin. Moving     differently, thinking differently,     feeling differently.      Interesting. Would you like to be     inside my skin, Craig? Think what I     think? Feel what I feel?      More than anything. Maxine.      It's good in here, Craig. Better     than your wildest dreams.  The puppets kiss.       Hi.        Puppets. Maxine. It's the idea     of being inside someone else,     feeling what they feel, seeing     what they see...       Please, let me explain.  Craig grabs Maxine's hand and drags her into an empty office.       It's just, and I've never done     this before, Maxine, but it's just     that I feel something for you. I've     never felt this before for anyone,     not even my wife. My future is with     you, Maxine.       Another evil secret of the 7 1/2     floor.  Craig pries the two-by-four off and opens the door. It's a dark and wet membranous tunnel inside.       Holy shit. Maxine is gonna love     this.  Craig lets go of the door and it slams shut.       Dr. Lester. . .       Dr. Lester, I have a question. I was     in that vacant office down the hall     and I stumbled upon a little door     and....       Thank you, sir.  Craig exits. Lester waits a moment. then dials the phone.       Bullshit.  Craig exits. The usher mumbles something into a walkie-talkie.        Whoa! What the hell? Where am I?  We're still in POV. The person walks across the room, picks up his wallet from a coffee table. looks in a mirror and checks his teeth for food. It's John Malkovich.       Holy shit! It's that actor guy.     Shit! What's his name? That actor     guy! What's happening? Am I     inside him? Am I in his brain?     Am I him? Is he me? Does he know     I'm here? My brain is reeling!     Is his brain reeling?  Malkovich walks to the front door, opens it, exits his apartment.       John Malkovich! Of course!       John fucking Malkovich!        Ahhhh!  The image starts to fade, then suddenly goes black.       Don't you want to know what happened     to me?       This is important!       There's a tiny door in that empty     office. It's a portal, Maxine. It     takes you inside John Malkovich.     You see the world through John     Malkovich's eyes, then, after about     fifteen minutes, you're spit out into     a ditch on the side of The New Jersey     Turnpike.       He's an actor. One of the great     American actors of the 20th century.       Lots of things. He's very well     respected. That jewel thief movie,     for example. The point is that this     is a very odd thing, supernatural,     for lack of a better word. It raises     all sorts of philosophical questions     about the nature of self, about the     existence of the soul. Am I me? Is     Malkovich Malkovich? Was the Buddha     right, is duality an illusion? Do     you see what a can of worms this     portal is? I don't think I can go     on living my life as I have lived     it. There's only one thing to do.     Let's get married right away.       Yes, of course. He's a celebrity.       Tickets to Malkovich?       But there's something profound here,     Maxine, we can't exploit it.       You wanted to be partners with me?        Really?      But, Maxine, can of worms! End of     the world! Illusory nature of     existence!        Oh. Maxine.    Craig and Lotte are getting into evening clothes.       Brain. soul, I'm telling you, Lotte.     I was right inside him looking out.     We're going to be rich.       What?        Well, you know we're going to be     very busy tomorrow. I'll tell you     what. Let's do it tonight. Right     now.       Yeah. We'll do it right now. On     the way to Lester's house.    Craig holds open the small door as Lotte climbs in.       I'll meet you on the turnpike.       Me too, babe.  Craig hurries out the door.       Okay. Maybe tomorrow.       We'll talk about it in the car.  Craig helps Lotte up and toward the car.    Craig drives. Lotte looks distractedly out the window.       You weren't you. You were John     Malkovich.       Tomorrow. We're late for Lester.       Dr. Lester...       No thank you sir. It's delicious,     though. I just wanted to thank you     for the opportunity to work at     LesterCorp, but I'm afraid I'm     going to have to tender my resignation     effectively immediately.       No sir, not at all. It's just that     I'm going to open my own business     and...       Uh, import-export. Olive oil. Right     on 7 1/2 actually.      In the vacant office. So we'll still     be seeing each other.    Lotte has just taken a shower. She towels herself dry in much the same way as Malkovich. Her eyes are closed. She opens them slowly and sees herself in the mirror. Disappointedly, she drops the towel and heads out of the bathroom.    Craig sits at his work table. He is pulling the heads off of the Craig and the Maxine puppets. He puts the Maxine head on the Craig puppet. He sighs.       My kingdom for your portal, Maxine.    Maxine sits at her desk composing an ad. Craig stands behind her, ostensibly looking over her shoulder, but actually studying the back of her head. He sighs.       Sounds good. Oblique but intriguing.     Phone it in.  Maxine dials the phone. Lotte enters.       Lotte! Why aren't you at the pet     shop?       Lotte, Maxine. Maxine, Lotte.  Lotte and Maxine shake hands.        Why aren't you at work?       What, are you nuts? That's Oprah     talking.       This is absurd. Besides Feldman's an     allergist. If you're going to do     something, do it right.        It's just the thrill of seeing through     someone else's eyes, sweetie. It'll     pass.        Yeah, okay.      I'll pick you up.  Lotte enters. Craig closes the door. stands there.       How was it?       Why?    Craig drives. Lotte is soaking wet. She stares out the window.       So how was it? What was he doing?       You see, men can feel unfulfilled,     too. I'm glad you're realizing that.     You shouldn't be so quick to assume     that switching bodies would be the     answer to all your problems.       I don't know. There's some tension     between us. I'd hate to expose you to     that.    Craig, Lotte, and Maxine are seated at the table and eating lasagna. Lotte eyes Maxine. Craig eyes Maxine. There is an awkward silence.       After dinner I'll show you my puppets.       You?  Lotte looks away.        My God.  Lotte strokes Maxine's face. Craig clears dishes from the table.    It is deadly silent. Craig and Maxine sit at their desks. The wall clock ticks. Craig whistles tunelessly, every once in a while looking up and discreetly checking out Maxine. Eventually there is a knock at the door.        Come in!  Erroll, a sad, fat young man enters meekly.       Please, have a seat.  Erroll sits in a chair in front of Craig's desk. He glances nervously over at Maxine.       Exactly that. We can put you inside     someone else's body for fifteen minutes.        Tell your friends.    Craig kneels at the door and peeks out through the mail slot. Maxine sits at her desk and files her toenails.       This is amazing! We're gonna be rich!       Dr. Lester, I don't know what you're     talking about.       You're insane.    Craig is putting stuff in boxes. Lotte enters in her cloak.       I'm moving. Remember? What's with     the hooded cloak?        You should feed your animals. They're     looking peaked.       What?       No they're not.       You've always loved the animals.       What's that?        Oh, Lot...  They hug.       What about Maxine?       We wish.  They look at each other and laugh, them fall back into the embrace. They both get faraway looks in their eyes.    The clock reads 3:00 AM. Craig, in his pajamas, is working the Craig and Maxine puppets. They make love on the bare puppet stage. Craig seems possessed.    Lotte drives.    Lotte sits on the floor in the dark. She leans, out of breath, against the wall next to the portal and checks her watch. The time is 4:10. She pulls open the door.    A sweaty and spent Craig sneaks back into the bedroom. He sees that the bed is empty.    Craig is hunched over a cup of coffee. The front door can be heard to open. After a moment Lotte appears in the kitchen doorway. She is caked with dirt. Craig looks up at her.       You were him last night, weren't you?       And he was with her.       We?       Don't forget me.       Life is confusing, isn't it?       I feel that somehow my parents never     prepared me to make this particular     decision. Not that I blame them. How     could they know? Today's world is so     complicated.      No. I have to go away now. I'm sorry,     Lotte. I'm so sorry.    Craig enters with red-rimmed eyes. Maxine sits at her desk, actually looking kind of radiant.       Are you torturing me on purpose?       I don't think so. I've fallen in     love. This is what people who've     fallen in love look like.       You're evil, Maxine.    Craig stands still and tense, with gun in hand. We hear the front door unlock. Lotte enters. She does not see Craig. He grabs her from behind as she passes. Lotte screams. Craig holds the gun to her head.       Yeah, well welcome to the nineties.        Shut up!  Lotte is stunned. She feels the muzzle against her forehead. She shuts up. Keeping the gun trained on Lotte, Craig dials the phone. He hands the receiver to her. He holds his ear to the receiver also.       Tell her you need to see her.        Tell her, what the hell, close     early today, live dangerously.       Lesson number one:  Be careful what     you teach your parrot.  Craig tapes Lotte's mouth, ties her hands and feet. Elijah watches him tie her. He becomes somewhat agitated, and holds his stomach.       I can't believe it. This is too     good to be true.    Craig is toweling himself off, hurriedly combing his hair. Maxine enters.       You're glowing again.    Craig is feeding the various caged animals. He puts two plates of food in Elijah's cage. Lotte is ungagged and unbound now. She eats as Craig slumps down next to the cage, gun in hand.       It was lovely being you being     Malkovich, my dear. I'd never seen     the passionate side of sweet Maxine     before, or her actual tits for that     matter. If only, I've been thinking     to myself, if only I could actually     feel what Malkovich feels, rather     than just see what he sees... And     then, dare I say it, if only I could     control his arms, his legs, his     pelvis, and make them do my bidding.       Ah, but you're forgetting one thing,     Lambchop.       I'm a puppeteer.  Craig picks up the phone and dials. He smiles as he holds the receiver up to Lotte's face.        Move right hand across her left breast     now. Move right hand across her left     breast now. Move right hand across her     left breast now.  Malkovich clumsily, awkwardly moves his hand across Maxine's breast.       Holy shit, yes!       Holy shit! He said what I said!       Yes, yes, sweetheart, yes!    A wet, mess Craig sits next to Lotte's cage. Lotte is bound and gagged.       I did it, sweetie. I moved his arm     across your girlfriend's glorious tit.     I made him talk. And, oh, there was     the beginning of sensation in the     fingertips. Ummmm-mmmm! It's just a     matter of practice before Malkovich     becomes nothing more than another     puppet hanging next to my worktable.     Coffee?       Hey! Break it up! Break it up!     Everybody gets a chance to be...  The fat people climb off Malkovich. His glasses and cap have been knocked off and everyone recognizes him.    Craig and Malkovich enter. Maxine looks up, startled, but controlling it.       Mr. Malkovich, my name is Craig     Schwartz. I can explain. We operate     a little business her that...     simulates, for our clientele, the     experience of... being you, actually.       Sure, after a fashion.       You? Why I'm sure it would pale in     comparison to the actual experience.       Of course, right this way, Mr.     Malkovich. Compliments of the house.  Craig ushers Malkovich to the portal door, opens it.       What happens when a man climbs     through his own portal?       So how was it?       I know. I'm sorry...       Really? For most people it's a rather     pleasant experience. What exactly did     you...       With all respect, sir, I discovered     that portal. Its my livelihood.        And who's to say I won't be seeing     what you're seeing... in court?  Cars whiz by Malkovich. Someone yells from a passing car.    Craig is feeding the animals. His gun is stuck in his pants. He gets to Lotte's cage. She is bound but ungagged. She looks haggard.       Things change. Anyway, you gave up your     claim to that love the first time you     stuck your dick in Maxine.       Yeah but I didn't do anything about     it. Out of respect for our marriage.        That's true. Oh, God, Lotte, what     have I become? My wife in a cage     with a monkey. A gun in my hand.     Betrayal in my heart.       Perhaps you're right. I can't let     you go though. Too much has happened.     You're my ace in the hole.       I'm sorry. Oh God, I'm sorry. I'm     some kind of monster. I'm the guy     you read about in the paper and go,     \"he's some kind of monster.\"       I love you so much.  She dials her phone, opens her cage, puts phone to her ear.       But I gotta go now. I've got to go     be Johnny.       I'll tell you all about it when I     get home.  Craig exits. Lotte fiddles with the ropes on her hands Elijah, slumped in the corner of the cage, blankly watches her moving hands. Suddenly his eyes narrow. Something is going on in his brain. We move slowly into his eyes.    Elijah shakes off the memory and looks determinedly at the ropes on Lotte's hands. He attempts to untie the knot. He works furiously and succeeds. Lotte pulls the tape from her mouth.    Maxine and Malkovich are furiously filling the portal with cement. Suddenly Malkovich stops and runs to the office door screaming a bloodcurdling scream. He stops just as suddenly, begins to strangle himself.       Squatter's rights, Lester.  Craig laughs somewhat maniacally. Maxine slips her arm through Craig's, joins him in his laughter, and glances triumphantly over at Lotte.    The cult members are still there, now with picks shovels. They are worn out and sweaty. The portal is excavated, but it seems ragged and destroyed. Man #2 emerges from the hole, a rope tied around his waist.    Lotte site in the living room, in her pajamas, softly sobbing. The caged animals watch her.    Lotte and Elijah see the dark figure coming up the steps. The buzzer rings. Lotte and Elijah jump.       Who are you?       Oh.       Okay. Sorry. I didn't know.    Lester is surrounded by all the Malkovichians. He holds the walkie-talkie, has just received word. He nods, and the Malkovichians crawl in single file into the portal, while shrieking a war cry.       I'm so glad you're safe. You look     really wonderful.       He's a lucky man.      Do I know him?       The iguana?       Oh, right. As long as you're happy.     I'm sure he's a better lover than I     ever was.        I'm sorry for everything.       You came up here looking for the     portal?       And yourself too in the process. God,     you're so beautiful. Why couldn't I     see that before?       I suppose. But they got here first,     the lousy bastards. So now it's all     over, I guess.       You'll have me, after all I've done     to you?       I'm through with puppets, Lotte.     I just want you to know that.       I'd like to be a farmer. I want to     help things grow, to encourage life.     Do you and your friends need a farmer?       I love you, Lotte.  We come on very close to Craig's arm as he lifts it to put it around Lotte. We see a thin almost invisible filament. We follow it up, and discover that Craig is now a marionette being controlled from above by an emotionless Mantini in a gray jumpsuit.",
        "Cab": "Say, aren't you that actor guy?       John Makel...       Mapplethorpe?       Malkovich!       Yeah. I liked you in that one movie.       The one where you're that jewel     thief.       Who am I thinking of?       I'm pretty sure it was you. Hey,     could I get your autograph now?     It's for .... oh, what the hell,     it's for me! I'm your biggest     fan!",
        "Driver": "",
        "Wendy": "Hello, Don.       Don, I was wondering, do you know     why our workplace has such low     ceilings?       Ha ha ha!  TITLE:The End       Well, Don, I peeked in here, even     though I know it's against floor     policy. and I discovered that     there's a little tiny door in here.     Isn't it cute? It's almost like a     little dolly's door. I wonder what     its for.       Wow! That's some story, Don.",
        "Tiny": "Captain Mertin?       I am not a child, Captain Mertin,     but rather an adult lady of miniature     proportions.       I am not asking for alms, but rather     the ear of a kind man with a noble     heart.       Captain Mertin, surely I am a     God-fearing Christian woman like     yourself, but alas, I am afraid that     the world was not built with me in     mind. Door knobs are too high, chairs     are unwieldy, high-ceilinged rooms     mock my stature. Nor am I a marrie     lady, Captain. after all, who would     marry a person of my diminutiveness?     So I am forced to work for my few     pennies a week as an optometrist.     Why cannot there be a place for me     to work safe and comfortable?  Mertin wipes a tear from his eye.",
        "Woman": "Seven and a half, right?       I'll take you through it.  The man picks up a crowbar leaning in the corner. He watches the floor numbers light up in succession. After \"7\" and before \"8\", the man hits the emergency stop button. The elevator slams to a halt. The man pries open the doors with the crowbar. Revealed is a standard office building hallway, except that from floor to ceiling it is only about four feet high. Everything is scaled down accordingly. The number on the wall across from the elevator is 7 1/2.       Seven and a half.       Captain Mertin?       I am not a child, Captain Mertin,     but rather an adult lady of miniature     proportions.       I am not asking for alms, but rather     the ear of a kind man with a noble     heart.       Captain Mertin, surely I am a     God-fearing Christian woman like     yourself, but alas, I am afraid that     the world was not built with me in     mind. Door knobs are too high, chairs     are unwieldy, high-ceilinged rooms     mock my stature. Nor am I a marrie     lady, Captain. after all, who would     marry a person of my diminutiveness?     So I am forced to work for my few     pennies a week as an optometrist.     Why cannot there be a place for me     to work safe and comfortable?  Mertin wipes a tear from his eye.        You don't look a day over one     hundred and five, Captain. What's     your secret?       Do we get to wear a crown?       Count me in.",
        "Floris": "Welcome to LesterCorp. May we meet     your filing needs?       Please have a seat, Mr. Juarez...       Pardon?       I'm sorry, I'm afraid I have no idea     what you're saying right now.       Money, Miss Warts?        Fork ah did?  The intercom buzzes. Floris picks it up.        Mr. Juarez?       Yex?       You suggest what? I have no time for     piddling suggestions from mumbling job     applicants, my good man. Besides, Dr.     Lester will see you now. I think     that's what he said.  Craig stands, opens Lester's door, and enters.       Gehginnis ondah foam?       Fork ah did?       You're good.  Craig turns.       You're not like the other boys     we've had here. Granted, I can't     understand what you're saying either,     but your soft palette resonates     tremendously well and you never     ever constrict your epiglottis.        Music to my ears! Whatever you said.     Speak, speak, speak, my magnificent     friend, speak!       Oh, what magic those fingers could     work on the right cabinet.      Alphabetize me, baby. And don't     forget, I comes before U.  Floris laughs long and hard. Too long and too hard.        I'm afraid I... have no idea what     you are saying... you bastard!  Floris runs from the room. Lester pokes his head out from behind the cabinet.        Someone names A Lot of Warts on     line two.        Think, Jew florist?       Great things, my lonely subtext?"
    },
    "imdb_rating": "7.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTFlYjgyMjUtNmJhZS00MDY2LTg0ZmMtNTVlNDA2NTUwYTRjXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Puppeteer Craig Schwartz and animal lover and pet store clerk Lotte Schwartz are just going through the motions of their marriage. Despite not being able to earn a living solely through puppeteering, Craig loves his profession as it allows him to inhabit the skin of others. He begins to take the ability to inhabit the skin of others to the next level when he is forced to take a job as a file clerk for the off-kilter LesterCorp, located on the five-foot tall 7½ floor of a Manhattan office building. Behind one of the filing cabinets in his work area, Craig finds a hidden door which he learns is a portal into the mind ofJohn Malkovich, the visit through the portal which lasts fifteen minutes after which the person is spit into a ditch next to the New Jersey Turnpike. Craig is fascinated by the meaning of life associated with this finding. Lotte's trips through the portal make her evaluate her own self. And the confident Maxine Lund, one of Craig's co-workers who he tells about the portal if only because he is attracted to her, thinks that it is a money making opportunity in selling trips into Malkovich's mind after office hours for $200 a visit. Craig, Lotte and Maxine begin to understand that anyone entering the portal has the ability to control Malkovich's mind, which also alters his entire being. This experience makes Maxine fall in love with a composite. This ability to control Malkovich's mind begs the question of the ultimate psychedelic trip for Malkovich himself, who begins to feel that something is not right in the world as he knows it.—Huggo",
    "name": "Being John Malkovich",
    "genres": [
        "Comedy",
        "Drama",
        "Fantasy"
    ]
}