{
    "filename": "Big-Eyes_script.txt",
    "imdb_id": "tt1126590",
    "imdb_url": "https://www.imdb.com/title/tt1126590",
    "characters": [
        "2nd Olivetti Girl (as Emily Bruhn)",
        "Enrico Banducci",
        "Dick Nolan",
        "Judge",
        "Olivetti Girl",
        "Ruben",
        "Lily",
        "Walter Keane",
        "Older Jane",
        "Factory Boss",
        "John Canaday",
        "Dino Olivetti",
        "Young Jane",
        "Dee-Ann",
        "Margaret Keane"
    ],
    "dialogues": {
        "Enrico": "",
        "Banducci": "Give it up for Cal Tjader! That set was HUMMIN'! Al-aright, be sure to stick around for the one a.m. show!  Oh. Thanks, thanks.  Really? Hm...! Maybe you're right. What color were you thinking?  I like my club the way it is. Your stuff's so hot, go put it in a museum. 22.  Hello, Picasso! Nice crowd, eh?  Hey, it's prime thoroughfare! People drink, they gotta relieve themselves.       Can you believe this? We're sold out, and I don't even have a headliner!! Hell, it's a Monday!  Dope, we made the front page!! People are here, cause they wanna see the sappy paintings that made grown men fight!!  That's Dino Olivetti -- as in Olivetti typewriters. 32.  Don't even try, Walter. He doesn't speak a lick of English.",
        "Dick": "Yes sir! Whew. That was quite a load of horseshit you gents were layin' out there. Dick Nolan. The Examiner.  Hey pal, don't lose any sleep. I eat this stuff with a spoon! It gives me something to type about, in my column.  Well, Banducci's famous -- and you hit him! So you're a celebrity, once- removed. Buy me a drink?  Gary! I'll have a Ward Eight, in a frosted high boy. My friend'll have the same.  So! Walter, tell me about your work --  Jesus, not those! I mean the little hobo kids.  \"What exactly is local painter Walter Keane up to? My spies tell me a big announcement is forthcoming...!\"  The Purple Onion. 9:30. Joan Crawford has a dinner reservation.  So you're now called \"The Painting Keanes\"?  I had no idea Margaret painted.  True true. So Margaret, where do you get your ideas?  ModiWHAT? The Italian joint? 52.  Walter... you never told me you had another daughter.     I don't know... Walter. What she has said is pretty inflammatory.     I-I, but... why would Maggie do this?  I really don't know much about them...     I'm concerned about my old pal Walter Keane. The Hawaiian heat may have cooked his brain! The only thing he knows about courtrooms and lawyers comes from watching Perry Mason on television!",
        "Nolan": "",
        "Judge": "How many years back do these go?  This is a very strange case. These paintings hang in museums all over the world, attributed to Mr. Keane. And regardless of the truth, Mrs. Keane has contributed immeasurably to the confusion...  It seems impossible that Gannett's actions would ever meet the legal standard for libel. So -- the charge against them is dismissed.  Mr. Keane, you appear to be without counsel. Would you like a postponement, in order to get your affairs in order?  Mr. KEANE! I've told you, you must ask the witness questions! If you're acting as your own attorney, you cannot make statements at this time.     Overruled!!  HEY! This is not a domestic squabble! Or -- maybe it is. But the rest of us have no interest in watching you two go at it.  Maybe.  The choreography is not necessary. Just sit down and testify.  You're done.  Actually, you are!  I cannot stomach one more wild tangent or shaggy dog tale. You're not testifying -- you're filibustering! The Federal Courts are overburdened enough, without your docket-clogging nonsense. We can stay here until we grow old and die... but it's obvious that this case boils down to your word versus Mrs. Keane's word.  NO! It's not a mistrial!! In my opinion, there's only one way to clear up this thicket. You are both going to paint.  Now, I'm not looking for a masterpiece. I don't know much about these things -- I'm a jurist, not an art critic -- but, is one hour enough?  Okay then. You've both been provided with identical supplies... so -- without any further business... Mrs. Keane, Mr. Keane, the court is yours.  Mr. Keane?     gapes at Walter, befuddled.  Mr. Keane! Are you all right?  is astonished.",
        "Olivetti": "glides into the club -- a vision of perfection with his slick hair and sunglasses. He approaches closer, closer... when he gets distracted. By one of Margaret's Big Eye PAINTINGS. Walter gasps. He nudges Margaret. Olivetti peers at the artwork. Intrigued. Then -- excited. He starts gesturing and yapping in ITALIAN. The Blondes shout back. Everyone is getting worked-up. The big-bosomed Blonde turns to Walter.",
        "Girl": "",
        "Ruben": "What's brilliant about the composition is its spontaneity. The image has no visual center of attention.  Oh definitely! Strongly influenced by the tachistes.  Well... I'm not allowed to say...  Oh Christ, don't come in here. Please don't come in here...  Walter. In polite society, the word is \"appointment.\"  Haven't I seen that one before?     Well, it's not going up here. Walter, you know we don't go for that representational jazz! You're too literal.  Yes it IS! People want Kandinsky, or Rothko! They don't want goopy street scenes.     Why are their eyes so big?! They're like big stale jellybeans.     I say, NO! It's not art.  It's like the back of a magazine! \"Draw the turtle! Send in a nickel and win the Big Contest!\"  Well, nobody who's walking through the door of this gallery! Now please! Clear out this clutter, before the taste police arrives.  Christ. It's a movement.  Who would WANT credit?! 97.",
        "Lily": "I'm fine, Dad. I lost a tooth.     Walter admires Lily's mouth.     Dad told me you had a bunk bed. 55.  No, that's not fair! The floor's fine for me.  I guess... about a twenty minute drive.  No, I see him all the time! He comes up and visits every week.  Doesn't he talk about me?     She's pretty. She drives a Buick. She cries a lot. 56.",
        "Walter": "You wanna touch it? Do it! I lay it on thick -- you're not gonna break it! I poured myself into that painting. It's thirty-five dollars. 7.  Excuse me, Ladies.  are left together. An unspoken frisson, until --  You're better than spare change. You shouldn't sell yourself so cheap.  Ahhh! You're past that point! Your heart is in your work...  What's your name?  Mm, no. I like you, Margaret...  \"...Ulbrich.\" You know, Margaret Ulbrich, you're undervaluing yourself. Lemme show you how it's done.  Little Girl! How would you like your portrait sketched by the World- Renowned Margaret Ulbrich?! Queen of the Bay! In mere minutes, she will capture your soul!  \"Nah\"?!  Don't you wish this were you in this beautiful painting??  Oh, you're Mommy! My apologies, Honey. I misconstrued the situation. Well I'll just mosey along, before Mr. Ulbrich comes back and socks me in the eye.  His face slowly lights up. Ah! Sun breaking through clouds.  Bonsoir, gang! Henri! Sorry I didn't call first. Est-ce que tout va bien?  Je vais bien! I'm with a beautiful woman! Could life be any grander??  And I don't even have to pay! I'm set because I gave the chef a painting. You know what he said? \"Nobody paints Montmartre like Walter Keane!\"  Best time of my life...  Well you have to experience these things! Grab 'em!! I wanted to be an artist, so I just went! Studied painting at the Beaux- Arts. Lived in a Left Bank studio. I survived on bread and wine... 10.  Damn right!  Of course, walkin' away from the bourgeois scene wasn't a snap. I had to quit my job. Leave my wife. These choices aren't easy...  You shouldn't knock your work. I'd give an eyetooth to have your talent.  You can look into someone and capture them on canvas! You paint people!  I can only paint -- things. My street scenes are charming... but at the end of the day, it's just a collection of sidewalks and buildings.       Er, you can't rush inspiration --  Don't worry. She's not bothering me...!  There's something I gotta ask you. What's with the big crazy eyes...?  Yeah, but, c'mon! You draw 'em like pancakes! I mean, they're WAY out of proportion!     Um... we should hear from Permits by Thursday.  He is stricken. Something ominous just happened.     I'm in commercial real estate.     Of course! Any blockhead can arrange a sublet! All I ever wanted was to support myself as an artist... I tried to make a clean break, but couldn't cut it. I'm just a goddam Sunday painter. An amateur.  What's wrong...?  You're a perfect mother.  Marry me.   Shh. Don't think of a reason to say no. 'Cause I've got a million reasons to say yes.  I know it makes no sense! 15.  But just think of the fun we'll have..! And I'll take care of you girls.  Margaret, I'm on my knee! C'mon, whatdya say? Let's get married! We can be in Hawaii by the weekend.     I knew you'd love it. 16.  Well, I don't know about forever. But maybe... I can arrange another week.  Ruben, good day! Do you got a minute?  You're gonna love my stuff today.  Nah! That was painted in the Fifth Arrondissement. This is the Sixth Arrondissement!  It's all up here. (beat; a sentimental     Ouch! This stings terribly. Walter glares at the man, then softly slides aside his works. Quietly, he pulls out Margaret's Big Eye paintings.  Would they want... this?  No... they're my wife's.     So... what do you say? 20.     How dare you! Lots of people would like this.  We'll never break in...! Because there's a CABAL. A secret society of gallery owners and critics, who get together for Sunday brunch in Sausalito, deciding what's \"cool.\" They're like Freemasons. No, worse! McCarthy, in his hearings: \"That painter, I anoint. That painter, I banish to nowheresville!\"  Heh! You're livin' in fairy land! People don't get to discover a thing. They buy art, because it's in the right place at the right time.  Hey, Banducci. I love the music tonight. It's a gas.  I'm Walter Keane. I'm a painter. I was looking at your walls, and they're pretty plain.  No -- I'm an artist. I used to be based on the Left Bank. But now I've relocated to the \"States,\" and I'm looking for an... exhibition venue.  Okay! I respect that. You're a businessman, not a charity! So how 'bout if I, uh... rented your walls?  Yes! The paintings are available for public viewing daily, from 7 to 3!  Er, no. 3 a.m. It's in a nightclub.  Maggie! It's promotion time! We gotta lay the racket!  Ah, beautiful! An art lover! Yes sir, how may I help you?  He grimaces... beaten. Walter drops his head on the table. Not noticing a DRUNK COUPLE stagger in. They pass a Waif, then halt -- taken. They lean in. Enthralled... concerned...  Yeah.  Why, thank you...! Thank you so much! 24.           It's INSULTING! When people see art, they shouldn't think of SHIT!  I'm -- I'm sorry. Banducci... laughed at our work. ...So I socked him.  You're right! I know. But... I was already in a bad place. I'd had a couple... and earlier... I let some guy think I painted your Big Eye.  It was a misunderstanding. And then, I didn't want to jinx the sale. 26.  Don't give me a hard time. I'm just grabbing my stuff...  I'll see you in COURT, you son of a bitch! I'm suing you for assault! Slander! False arrest!! 27.   I thought you only did celebrities.  Huh? Uh, sure --  Well, when I was in Paris...  What do you wanna know...?!  Ding-a-ling! Wake up, we're a HIT!  What a night! I sold out all your Big Eyes!!  They adore you! Cause of that article, the joint was PACKED. And then, a famous journalist showed up, and -- I need more paintings! Now!  Of course! But, this is opportunity! Ah, we're gonna make a crackerjack team: Me schmoozing up the club, while you're back here, doing what you love!  ...yeah, eyes are powerful. A poet said they're the windows of the soul.  You got it! That's why I paint 'em so big. I've always done it that way.  If you like this style, I'm working on a few new pieces. I've got a little blonde girl in a blue dress that'll tear your heart out.  Baby! Hey, uh, what are you doing here? I  I was... trying to close the deal --  I'm just a salesman! You know, buyers pay more if they meet the painter --  Shh, QUIET!  Don't blow this! Look, we're makin' money! Your pocket, my pocket? What's the difference?!  Not all all! But it's not about ego! You wanna say you did the street scenes? Fine! I don't care! Say a monkey painted it!  Ah, honey! I just wanna share them with the world! Would you rather have your children piled in a closet... or hanging in someone's living room?  Hey. Who is that remarkably handsome and confident man?  The moment of truth. Margaret opens her mouth... and no sound comes out. She clenches up. Stomach tight. Mute. Walter gives her a second -- tick tock tick tock. Then -- he leaps into Opportunity. He SMACKS his hands.  I am!  It's a delight to meet you, Signore! Buon giorno! Have you been an art lover for long..?  I call that piece \"The Waif.\" Isn't it striking? With its juxtaposition of girl, cat, and stairs... and its almost Flemish use of underpigment... 33.  Baby! Baby! Can you believe it?!!  We made five grand!! Five THOUSAND dollars...!!! And that wasn't even one of your good ones!  No. No no! One of -- OUR good ones. (the spirit of generosity, he hands her a CHECK Look at those zeroes! We've hit the big time! We are now hanging in the collection of Italian industrialist Dino Olivetti! With his patronage comes credibility! And with credibility comes RESPECT!  Aw c'mon! The paintings say \"Keane\"! I'm Keane, you're Keane. From now on, we are one and the same.  On behalf of the children of the world, we present this painting to Mayor Christopher!  In the interest of peace through culture, we donate this painting to the people of Russia!  Miss Crawford! In recognition of your cinematic craft, we bestow this painting, \"The Lion and the Child\"!  Joan said \"Marvelous\"! MARVELOUS! That's worth more than 1000 critics!  Hey, maybe she'll come to our opening.  Says who?! Like John Q. Public cares? He's FED UP with abstract neoformalism!  He digs real art. Your art! It's beautiful. You're beautiful...  Ruben's gonna choke when he sees this!     You have a good eye, sweetie. I painted it, but I was trying to mimic your mother's style. You know, the style she USED to paint in.  Ah, my sweet! Are you enjoying the scene?   Give a hand to my beautiful wife. Without her, none of tonight would be possible!  A NOSY GUY corners him in front of a painted child.  That? Oh, wow. Probably... months. First the thinking, the sketching, and then time with just me and the oils.  Oh --! You mean that painting! Uhh, sorry! It's like a jumble of ideas, rattling around in my brain!  What do you mean?  Well, er, I've just always loved kids. Though mostly I was influenced by my darling daughter...  I remember when she was a baby...  Yeah. Cute little thing. I'd stare into those big orbs. Sometimes I'd get out my Brownie and snap a photo... but... that's not subjective. You know? It doesn't capture your feelings. So that's when I started painting her...  Janie, sweetie, you need to respect your mother's privacy. Sometimes grownups need alone time. Is that the ice cream truck? Why don't you go get yourself a fudgesicle?  Whew! Out of this world...!  Ah, Jane's grand! She's eating ice cream! She has new shoes. She has a college fund.  Well I don't want you feeling like a prisoner. Take a break!  Is that a tear...? You've gone deep!  I love it! ...How'd you get the eyes so lifelike? Is it the highlights?  I owe you an apology. I was initially dismissive of your kids, those emotion- wrenching blobs of humanity... but they have a real strength.  I'm trying! Ah, you know me. See -- this is why I need your help! I want to go on tv, to defend our art.  Yes! But... what will I say?? Meaning -- what compels me... to paint... these paintings??  Cute. 44.  Funny! Keep 'em coming! You're a regular Steve Allen. You want heat this winter? Help me out!  What would make a grown man paint a picture like this?!  I grew up, surrounded by six sisters. I grew up in an orphanage? I grew up... in a world where adults had vanished, and children and kittens ran wild over the desolate landscape!  Well, because... I lived it! I experienced it!  Well -- NO! Of course not. It was after the War. There was destruction everywhere... 45.  I traveled the Continent. The ravages were horrifying...  My psyche was scarred in my art student days. Nothing in my life has ever made such an impact as the sight of the children: War-wracked innocents, without homes, without parents, fighting over garbage...  Goaded by a frantic despair, I sketched these dirty, ragged little victims... with their bruised minds and bodies, their matted hair and runny noses. There my life as a painter began in earnest.  The insane, inhuman cruelty inflicted upon these children cut deeply into my being. From that moment on, I painted the lost children with the eyes. Those eyes that forever retained their haunting quality.  Good afternoon! Delighted! (he reaches the SEXY BLONDE CLERK and pinches her ass How many sales today?  It's the craziest thing. I started charging for the posters! First a nickel... then a dime.  YES, Maggie! It's cuckoo! So it got me thinkin': Would you rather sell a $500 painting, or a million cheaply- reproduced posters?!  47.  See, folks don't care if it's a copy. They just want art that touches them!  And then... we could sell it anywhere!! EVERYWHERE!  Whew! Something smells in here. You should open a window.  I dunno. 6:30, 7? ...Didn't Janie get dinner?  When's the last time you washed your hair?  (he notices the turned canvas; he's intrigued What do you got back there? Lemme see.  \"The world\"? Baby, it's me! (stepping forward, a bit     He leans right up to the painting. His expression is inscrutable. Studying the technique. We have no idea what his emotion is.  It's a completely different style.     How am I gonna explain that?  That seems a bit confusing. \"Keane\" means me.  Who'd you tell about the Big Eyes?     You tell anybody, the empire COLLAPSES! Do you wanna give back the money? We've committed FRAUD!  Janie thinks I'm in here, painting.  That was the honeymoon period!  Jesus, you're so fragile.  Yep! Walter and his girls! With galleries in three cities!  Yeah, we don't talk about it. Sadly, people don't buy lady art.  The bar's over there.  Yeah, Margaret's a superb artist, in her own way. I even steal a few tips from her, now and then! Behind every great man is a great woman.  Oh, for Christ's sake, Margaret! Dick writes a gossip column -- Let's stick to the family angle. Get a gander at little Janie over there!  What a talent! Look at these Keanes! If you cut open our veins, we bleed oil! Er -- turpentine. Uh, Dick, you know what I'm goin' for. Make it sound good.  Ah! A little treat! The fourth member of the Painting Keanes!  Lily, honey, how are you?!  Really? Did you get in a fight?  Walter admires Lily's mouth.  Well is the tooth fairy somethin' I gotta deal with, or did your mother already handle it?  Good! Good good! Well, just go throw your stuff in the kids' room, then you can come join the fun!  Didn't I? Sure. Lil's from my first marriage.  That's Lily. I'm sure I mentioned her --  No! Her mom's just going to Vegas for the weekend. I'm supposed to have her once a month, but I don't make her mom enforce it.  He starts to answer... then gives her a look: You are kidding? Walter squirms defensively.  She's a sweet girl.  I put up with your daughter. I never said a peep.  I'm sorry. Sorry! Please... let's just try to get through this.  Yeah, Walter Keane and Gauguin have a lot in common. They both walked away from successful careers to travel the globe, live on a boat...  Psst! Maggie! Can I have a second?  Good grief! What the hell are you babbling about?! Long division?? Could you please help the world and shut your mouth? You want just one number in his head: The sales price!  What the hell's going on here?!!  You KNOW I don't like anyone seeing my work before it's done!  There!  You and your whole non-representational crowd are FRAUDS!!  Get outta my house! My big house! Go back to sellin' your coat hanger sculptures on Fisherman's Wharf!  I don't want her ever invited here again.  M-Maggie! What're you doin' up?  I had a helluva night. Worked three or four clubs.  Stumbled onto some hot gossip: Madame Chiang Kai-shek is coming to town! Straight from Taipei! I think we should present her with a painting -- get Dick to flack it... Or the heck with Dick. I met a new guy at UPI...     Yeah? Maybe you're right. She probably doesn't have a Parisian street scene hanging in her palace.  He freezes up. Suddenly sober, smacked to reality.  \"Cenic\"...? Uh, what's that?  Huhhh?  Urgh... oh! CENIC!  Cenic was my nickname in Paris! All my art school pals loved my scenic views, so they called me \"Scenic\"! But since those Frogs can't pronounce a hard \"e,\" I became \"Cenic.\"   How DARE you accuse me of lying! I'm proud of my early Cenics!  You sound crazy! For God's sake. You've... you've SEEN me paint!!!!  All life drains from his face. His eyes go glazed. He speaks mechanically. Tiredly...  I studied art in Paris. I went to school at the Beaux-Arts. The Grand Chaumiere. I spent hours in the Louvre, gazing at the greatness of the Masters...  I wanted... I so wanted to be an artist. But -- it just never turned out good.  What are you working on?  I figured out a solution to our problems.  Teach me. Show me your tricks. Then you can pass off the Waifs, and we won't be lying anymore. 71.  Sure! Why not?  Y-you're right! But you know me! I'm a quick study. And I've got the basics...  They peer at each other, like a Mexican standoff. Then, he nervously picks up a pencil.  So...? What's first?  It's a -- Keane.  YEAH YEAH! Point taken. I'm standing here naked and humiliated in front of you. Look... can we just do a crying child?  Huh? C'mon, it's a head --  The child is this old! You're trying to make this difficult --  How's SALES?  How many posters are back here?  Does the printer owe us more? Do we owe him??  What about the OILS?! Are there more at the warehouse?  For the LOVE OF MUD! What am I PAYING you for?  Hypothetical question: If you were a man, would you marry Kim Novak or my wife?  Okay! Different question! If I got crippled and had to stop painting, how long before the gallery ran out of inventory and went belly up??  What's it all mean? Why are we put on this earth? A 100 years from now, will people even know we existed...? 75.  It's not even mine! It's one of hers.  His eyes narrow, piqued. World's Fair??? He leans in...  This doesn't change anything.  Who cares?! This is all your fault! Maybe it's time to shake things up. Start puttin' my name on the MDH's.  Quiet! Lower your voice --  NO YOU WON'T! Or -- I'll have you whacked!  If you tell ANYONE, if you squeal, I'll take you out! I -- I know people. Remember Banducci's cousin? The liquor wholesaler?  Christ, wipe your face! You look a mess. It's life imitating art! A crying Keane! 77.  Look, I don't deny I need you. You're the one with the gift. Right now there's a shot... God, I'm shaking I'm so excited. The New York World's Fair. 70 million visitors. Opening day, I unveil my MASTERPIECE!  Exactly! What have I been missing all this time?! Da Vinci has his Mona Lisa... Renoir has his Boatmen's Lunch... but where's my defining statement?  Why not?! Didn't Michelangelo know he was hittin' a homer, when he was on his back painting the Sistine Chapel?  Posterity, baby...!!  And here's the best part. It's for Unicef! Unicef is sponsoring the Hall of Education. Aw, we can finally give back to the children of the world!!  Because it has to encompass all children. All races! One hundred stricken faces! Marching to infinity! The ultimate Walter Keane! At least that's what I told Life Magazine.  Oh, a publisher says it's good timing to put out a coffee table book. You know, classy: \"Tomorrow's Masters.\" So they need my... uh, early portfolio. My artistic evolution...   I know you're being sarcastic, but these are all good ideas. Berlin war orphans... early self-portraits... 79.  Stop. Let us appreciate this moment. This is what we've worked toward our whole lives: Rarified air. Inside this house are the movers and shakers. Kennedys. Rockefellers. Until today, we've always been on the outside, looking in. But when we enter... we will belong.  You are one crazy bitch.  So maybe you have problems with the choices we made... but -- c'mon! Wednesday, the World's Fair opens. Thursday, our book goes on sale!  Aw, why are you always so miserable? Well, I'm gonna enjoy my afternoon! 82.  Mrs. Teasdale! Walter Keane. I just want to thank you for hosting this absolutely enchanting soiree.  Er, no. Honestly, I've been so busy all day preparing for this lovely --  faces drop, terribly hurt.   What do YOU care?! That's MY name being dragged through the mud!  Is he here?    What are you afraid of?? Just because people like my work, that means it's automatically bad??       Why does a man become a critic --?? Because he can't create! You don't --  Don't interrupt! You don't know what it's like! To put your emotions out there, naked, for the world to see.  looks around -- then quivers, realizing he's out of control. Shamed, he slowly drops the fork. People breathe a sigh of relief.  What's wrong with lowest common denominators?! That's what this country was built on!!  I'm gonna sue EVERYBODY! I'll sue that pansy critic! And the World's Fair! And -- Unicef! Yeah! I'll take down Unicef, and all their precious little boxes of dimes!  But I can't sue you, can I?  You were the ultimate betrayal! You FAILED me with that painting!  You crossed over from sentimentality to KITSCH!  You like making me look bad?? You enjoy people laughing at me??!    Lemme in, you BITCHES!!  Ow!  You got all that paint and turpentine in there? Well I'm gonna burn you up!  You're gonna blow like an atom bomb!  Maggie --?  He is strangely controlled and forboding.  Boy, you were sure hard to track down. Thought I might never find you...  I'm a little agitated. I got the strangest papers in the mail today.  Aren't you acting too rash?  Granted, our romance may have seen its better days. The bloom is off the rose. But I'm looking out for both of us. What about Keane Incorporated?! We're a professional couple. Like Roy Rogers and Dale Evans.  Whew. It hurts to hear you say those words.  I sure hate that it's come to this. Well... I SUPPOSE I can agree to a split -- as long... as you assign me all rights to every painting ever produced.  Really?! 90.  Uh -- okay. And... then, we have to consider future revenue stream.  It's -- the marketplace! I gotta stay fresh. Surely you understand? You want me out of your life, here's my term: You'll have to paint me 100 more waifs. 100 more Walter Keanes!  Nah, Warhol's like me. That fruitfly stole my act! \"The Factory\"? I had a factory before he had a soup can!  Ah! It's my art supplies.    Holy mother of GOD!  Margaret's gone berserk! You gotta help me! I need a story, a wire story -- national! -- to calm things down.  But it's nuts! It doesn't even make sense. When I was studying art at the Beaux Arts in Paris, she was still a kid in Tennessee!  Look! These are my early sketches. (he flips pages, like a  Exactly! It's impossible! We didn't meet for another nine years! After she busted her first marriage. Hell, she busted OUR marriage! Sleeping around with whatever trash she could find!! 98.  She's unhinged! She left me and moved into the jungle. She fell in with a bunch of religious zealots: Jehovah's Witnesses.  Oh! These people are gone! Solid gone! They don't celebrate Christmas, they can't salute the flag... they won't even let Janie go to the prom!  I'm angry as hell! But I'm lucky to have the mighty Gannett News Company watching my back. I expect to have this whole trial dismissed by noon. Truthfully, my only concern is that somebody get this woman some psychiatric care. She needs it!  \"Good luck\"? W-where the hell are you going?!  I've always taken care of myself, Your Honor. And I don't need a bunch of rent-a-suits to defend my good name! Let's PROCEED!  I'm the sole creator of my art. This is my total life. My contribution to the world --  Oh. Right! Ah, sorry, Your Honor. It's hard to keep this all straight...  Mrs. Keane. It seems impossible that you'd expect anybody to swallow your fantastic story --  Mrs. Keane. You seem like a lucid woman. Reasonably intelligent... So how could you possibly have gone along with such a far-out scheme? 103.   I want to remind you you are under oath.  S-sorry.  Hm! It sounds like you've described two different men. One a sadistic ogre... and the other a delightful bon vivant.  What an outrageous statement! I demand we strike that from the record!  Your HONOR! I ask for a mistrial!  I'm sorry for the emotions. I'm an artist.  I call as my witness... Mr. Walter Stanley Keane!    Mr. Keane. There has been a lot of innuendo and contradictory testimony about the genesis of the \"big-eyed waifs.\" Would you mind clarifying to this court, once and for all, who spawned these paintings?  Why -- I created the children.  I've had a wonderful life. I've been an artist, a world traveler, a friend of untold celebrities...  But when I look back at it all, when I peer into my heart and define what mattered... 106.  it is that I was dedicated to the hungry children of the world. It all began in Berlin. After World War II...  ...the orphans were clutching the barbed wire. Their bodies lacerated, their fingers scrawny, their eyes big and helpless. Imploring me, begging me... \"Do something!\" \"Do something.\"  ...and then Miss Joan Crawford walked up to me...  ...Kim Novak...  ...Liberace...  ...Wayne Newton...  Miss Natalie Wood walked up and said, \"That is the greatest single painting I have ever seen in my entire life.\"  I was born in a small town. My father made upholstery for the automobile  B-but, I'm not finished --     looks ill. Wracked with uncertainty. The Judge turns to him.      is melting down. In total crisis...  feels all eyes on him. He has to do something. Hesitantly, visibly shaking, he rises from the table. Margaret notices this. Walter braces himself, trying to look confident, then takes a step. Suddenly -- he SQUEALS.    No -- it's -- Ah shoot! My old shoulder injury just flared up. I've got a bad muscle -- I've been taking medication for the inflammation...  I -- I don't think I'll be able to paint today.  sinks down in his chair, beaten. All life gone. He stares at the emerging canvas, eyes wide, and we PUSH INTO WALTER'S FACE. He is witnessing the end of his empire... the destruction of everything that makes him who he is. We push in TIGHTER... TIGHTER... until the screen fills with his two eyes. Big. Sad. And filling with tears.  What a group of idiots... a quagmire of incompetence... This doesn't change a thing!",
        "Keane": "A blizzard of NEWSPAPER ARTICLES: \"Meet America's Million- Dollar Painter!\" \"Keane Masterpiece at World's Fair\" Painted EYES float by. Haunting... questioning... Old POLAROIDS: A family Christmas, a Keane print over the mantel. Kids play bumper pool, a Keane print in the b.g. A blurry black-and-white TV: A talk show HOST holds up a Keane  Whoa...! Pure joy envelops her. Then -- she gets jostled. Margaret notices Walter holding court with some GROUPIES. She approaches, unnoticed:                      stare, then turn pale.       Walter grimaces. He tries again, choosing his words.",
        "Older": "",
        "Jane": "Good luck. 3.  Nah.  But that IS me! And that's me...  And that one started as me, but then Mother turned it into a Chinese boy.  Mother, after all this time, you MUST know what my face looks like.  Hey! Your canvas is blank!  A-hem!  I remember when Momma painted that.  Sure I'm sure! It was in our old apartment, and you had me sit on a stool in the kitchen -- 36.  No, Mother did! Look! I'm wearing my blue dress.  A loooooong pause. She examines the print. Then... she nods.  Well you did a really good job.  Mom! I wanna come in.   Let me in! What are you doing in there? Why's the door always locked? 42.  Who's that?  They gape in bewilderment. Who the hell is this girl??!     Take the bed. I can sleep on the  Do you live far away?     But you never see Walter?     Does he talk about me?     Yeah, mine's the same. Except she drives a Packard.  I have some peanut butter hidden in my sock drawer. Do you wanna eat it?  Go, Rembrandt! Get the ball!  Can I come?  No. I can never come. No! I shouldn't even ask.  Mom, what's for dinner? Mom! Are you home...?  Mom... I know.  I'm not a child anymore. 80.  Ow!  Mom, what are we gonna do??!  But where are we going? We don't even have any clothes! 88.  Really...?  No, I'm gonna surf with the gang.      That's right! Or they'd see the precious paintings!! 91.  I just can't believe you let people in the house. 94.  Hey. Is Jehovah okay with suing??",
        "Factory": "",
        "Boss": "We don't get many ladies in here. So your husband approves of you working?     You do understand this is a furniture company?",
        "John": "",
        "Canaday": "Keane's work is completely without distinction. He is not a member of the Society of Western Artists. He has won no awards. He's only noteworthy for his appearances in a certain newspaper's gossip column! Mr. Keane is why society NEEDS critics! To protect them from such atrocities!  Four... five... SIX pages! Is there something here I'm missing? He's like -- the Hula-Hoop! He just won't go away...!  \"Will be unveiled in the Grand Pavilion of the Hall of Education... internationally celebrated artist has been selected... will represent the aspirations of children worldwide --\" Oh this is ABSURD!  And WHO was on the selection committee?  Mr. Keane, this is not the venue. Perhaps you'd like to write a letter to the editor.  No. But that doesn't make it art either.  Art should elevate -- not pander! Particularly in a Hall of Education!  Ugh! That moldy chestnut --  What emotions?! It's synthetic hack work!  Your \"masterpiece\" has an infinity of Keanes -- which just makes it an infinity of kitsch!  You have got to be kidding!",
        "Dino": "",
        "Young": "",
        "Margaret": "My husband and I are separated.  Sir, I realize I have no employment experience... but I sure need this job. I have a daughter to support. I'm not very good at tooting my own horn... but I love to paint, and if I could just show you my portfolio...  I studied at the Watkins Art Institute in Nashville, then took Illustration classes in New York. Here's a pastel I did... here's some fashion design... a portrait in charcoal... though I enjoy mixing mediums, preferably oil and ink...  A strained smile.  Deirdre, look at you!  \"Dee-Ann\"?!  Jane -- is swell. She's started in a sweet little school. Though... it's hard without her father. I'm not sure we can do this... 5.     Do they only show Modern?  What's espresso? Is that like reefer?  Today's a special: Two dollars.  All finished.  are left together. An unspoken frisson, until --  I'm just glad they liked it.  M-Margaret...  Wouldn't you rather flirt with those dolls over there? 8.  A gut decision. She stares at Walter, then smiles slyly.  Mr. Ulbrich is out of the picture...! 9.  I can't believe you lived in Paris.  I've never even been on an airplane.  You're a romantic.  I've never acted freely. I was the daughter. The wife. The mother... All my paintings are of Jane, because she's all I know.  She doesn't know what to say. Gently, she takes his hand.  Walter, I'd bet you could paint anything.  This is moving fast. You're my first date in a long time...  Sweetie, could you stop fidgeting?  Jane! Don't bother Mr. Keane. You know creativity has to well up from the inside...  I believe things can be seen in eyes. They're the windows of the soul -- 12.  Eyes are how I express my emotions. That's how I've always drawn them. When I was little, I had surgery that left me deaf for a period. I couldn't hear, so I found myself staring... Relying on people's eyes...  He is stricken. Something ominous just happened.  What was that?? 13.  You're a -- Realtor?  And you're... ashamed?       She turns, startled. Feeling guilty, Margaret rushes from Walter. Busying herself, she skims through the MAIL. Jane shakes her head and marches out. Margaret flips through envelopes -- until one stops her. On edge, she slowly removes an official DOCUMENT. She scans it... and her face drops. Crushed. Something terrible... Walter is worried.     He told the court Jane doesn't have a proper home. It's beyond my abilities as a single woman...     \"Hawaii\"? M-marriage? Walter, I'm crazy about you... but I'm overwhelmed. Why would we go to Hawaii?!  Margaret shudders, tears in her eyes. Hawaiian MUSIC begins...  You're right... this is paradise. Only God could make those colors.  Oh, can't we stay here forever??  This is a waterfall... the air was so fresh you could taste it. Here's an ancient altar... that statue is Kane, the god of creation. I said a prayer to him. Oh! Here's Walter and Janie, building a sandcastle --     You're talking about my husband!  I'm not naive.  Well, I am naive. But I know the man I'm marrying. Walter can act rash... but he's a good provider. And he's wonderful with Jane. Look -- we're both looking for a fresh start. I'm a divorcee with a child. Walter is a blessing.  \"You are on the threshold of untold success.\"  I think people buy art because it touches them -- 21.  I've never posted bail before.  Since when are you thin-skinned? Artists have to handle criticism.  I don't understand. Why would you do such a thing?!  Don't ever do it again.  There must be two-hundred dollars...  Walter, they take at least a week. There's layering, shading --  Mrs. Cava, I'm sorry to bother you so late... but would you mind watching Jane?  She GASPS, stunned. The room starts spinning.  Her face goes ashen. Dizzy, she clutches for support. What to do?? Overcome, she shrinks away... disappearing... ending up alone in a corner. She cowers, childlike.  Walter...?  Why are you lying?  You're taking credit for something that isn't yours.  Those children are part of my being!  They couldn't meet me, because you told me to stay home!! 31.     I'm glad you can dash off your pieces without any emotional connection...!  The moment of truth. Margaret opens her mouth... and no sound comes out. She clenches up. Stomach tight. Mute. Walter gives her a second -- tick tock tick tock. Then -- he leaps into Opportunity. He SMACKS his hands.  Don't you mean... one of your good ones?  What about... honesty?  But... isn't it strange? Artists get shown. They don't build their own galleries.  Are you -- sure? That was a long time ago.  L-lots of girls have that dress...  Hello. I've -- never really done this before. I'm not sure how you... I was raised Methodist. If it's a problem, I can go -- 37.  I lied to my child.  My husband... he pressured me into doing it. I've never lied to her before. I'm not that kind of person.  Ummm, no. I don't think of him that way. I mean, he likes to tell stories... maybe he exaggerates a little... but he's a good man. He takes care of us. He wants to make enough money to buy our family a house...  \"Harm\"?? Oh! Not at all. I'm just looking for answers...  N-no. That's not what --  She frowns. Dee-Ann slides into view, slurping champagne.     Well... he's more established.  Thanks for coming.  I don't... know.  Uhh, you can't. Mommy's busy.     Maybe I'm lightheaded from the turpentine. I've been in here all day.  Do you -- like it?        You're going to be on television?!  Maybe you have an unhealthy obsession with little girls.     Walter... art is personal.  What about your Paris street scenes? Why do you paint those?   And was it really all sun-dappled streets and flower vendors?  What time is it?  I've been... busy.  No --! It's just... something I'm working on. It's not for the world.  No, please! Walter, it's -- personal. 49.  Yes it is.  It's a self-portrait.  I thought... maybe... I could sign it myself.  Yes, I know... but... when people ask me if I paint, I don't know what to answer! I just want the pride of being able to say -- that's mine. 50.  Nobody!  No! NOBODY saw it!  I KNOW! My God! I live with this every minute of my life! Janie used to have a mother who painted. Now what's she think?! I lock myself in this room ten hours a day... and then you walk out with finished paintings!  C'mon! You haven't picked up a brush in months!  We used to paint together! Easels next to each other, side-by-side --  I've kept my end of the bargain! I've never told!  Please! Just let me have this! 51.      Oh... from the world around me. And I love Modigliani's use of line.  They gape in bewilderment. Who the hell is this girl??!  Walter? Walter! We need to speak.  What is going on here??!  No you didn't. 54.  Did she just move in??  Her head is spinning.  How can you keep something so big a secret???     I'm gonna pretend you didn't say that.  I painted it!  Yes, we don't use my name, since people don't take women's art seriously. \"MDH\" are my initials. And more! I'm interested in numerology... and as you know, seven is a very good number.  Luckily, my maiden name is Margaret Doris Hawkins! \"M\" is the 13th letter of the alphabet, \"D\" is 4, \"H\" 8! If you add up 1 and 3 in 13, that gives you 4, making 4 plus 4 plus 8 equals 16, then 1 plus 6 equals seven!  Rembrandt, shush!  Yeah. That driveway is long.  Honestly, I can't believe I live here.  I know! Two acres, a pool, five  What? Oh -- you mean Lily! No, she doesn't really live with us. That was just in the articles. 60.  I know. North Beach is 30 miles, but it might as well be 300...  Oh, please! She's Walter's friend.  He brings people by... the Beach Boys were here. But, it's pretty isolated.  Jane has nice friends. Sometimes I pick them up at the junior high, and we all get pizza. But she's busy... Are you hungry?  Good! I'll whip us up two gin fizzes.  When we moved in, I thought a wet bar was extravagant... but it's surprising how much use you can get out of it.  He couldn't be happier. He has everything he ever dreamed of. 61.  No --! You can't go in --  Dee-Ann, please! STOP --  W-Walter paints in here too.     I won't.  Okay, honey. I have to go work. 64.  Where did you appear from? Didn't you hear? No visitors!  Is this what it's come to? You're the only living soul I can tell my secret?  Well -- I painted them all!  It's TRUE! I did every single one --  Well, every one except that street scene. But I did the rest. Every Big Eye! And nobody will ever know. But YOU.  No you don't! It's nice to have company, but that sofa is new.  Let's find you some carpet to lay on. 65.  I think there's a scrap back here...  Well what's this?  She peers closer.  She sucks in her breath, shocked. She examines the painting. Then, she hurriedly grabs the next canvas. It's another sunlit scene: A quaint Parisian cafe, a man playing accordian, and in the bottom right corner... the signature: \"S. CENIC\" WHAT?! Margaret grabs the next canvas. \"S. CENIC\" The next canvas. The next canvas! They all are signed \"S. CENIC\" Margaret starts hyperventilating. She thinks, then suddenly bolts from the closet.  She trembles, overcome. Music SWELLS. Her eyes spin back --  She collapses.  Maybe you should give her one of your street scenes.  No, Walter. She's a dignitary. Doesn't she deserve a piece that comes straight from you? From your experience???  Unless Madame Chiang Kai-shek already has a Cenic.  Cenic is the name of the artist who did all your early paintings.  The more you lie, the smaller you seem.  Then why do you paint over the name?  A bit of advice: Don't use a water- base over an oil. It flecks off.  No, I haven't. I always thought I had... but it's some kind of... mirage. From a distance you look like a painter, but up close... there's nothing there. 69.  Walter?  Have you even been to Paris?  I don't want you sleeping in this room any longer. I -- I can't keep living these lies. There's three extra bedrooms. Go pick one.  A new MDH. Something for me. It's about a woman trapped in an uncaring world. I call it, \"Escape.\"  What?  And then -- YOU'LL paint them?     If you knew the basics, you wouldn't be at the easel. You have to sketch it first!  They peer at each other, like a Mexican standoff. Then, he nervously picks up a pencil.  I dunno. You tell me. You're the creator.  Oh, a Keane! How witty. You know, when we met all those years ago, I never would've imagined in my wildest dreams that one day -- 72.  How old is the subject?  It matters! A young child's head is round. An older child's head is oval!  NO I'M NOT! Every line is a decision! It's easy to talk about art, but it's not easy to MAKE art!!    Walter!!  Then -- he SCREAMS and smashes her CANVAS. BAM!!! The painting RIPS apart. Walter KICKS his foot through the remains, then spins and charges from the room.   I know the truth. 76.  NO! Absolutely NOT!! I still hate myself for giving you the Waifs!  Oh, I'll talk as LOUD AS I WANT --  What??!  You're threatening me...?! Fine, kill me! My God, I've kept our secret for years! I've never once -- Do you know what it's been like for me? I don't have any friends. I've lied to my own child...  What do you want, Walter? Everything with you is calculated. We're back where we had our first date...  What masterpiece?  You sound insane. Artists don't announce a masterpiece --  He worked on that for FOUR YEARS!  It's too big. Why'd you promise them Cinerama size?  You're right! Where are your preliminary sketches?? All that time in art school, and somehow we waylaid your youthful experiments! The half- finished charcoals, the struggles...  Get out of here. I'm trying to work.  W-what are you doing in here --? This is -- Walter's studio! You have to leave!  Jane, you don't know anything!!  I was happier selling paintings in the park.  Friday, I file for divorce.  faces drop, terribly hurt.  How could anyone... say something so cruel? 83.  is mortified. This is all too awful. Silent, she watches Walter back out of the party...    Walter! 86.  We're leaving.  I'm sorry I wasn't the mother I could have been. I -- I should have done this years ago...  Where we're going, we won't need much. Hawaii.  Yes, Hawaii. Because it's paradise. There's flowers, and birds, and beautiful colors. And... we're going to make a new life for ourselves.  Hello?  It's a decree of legal separation. I would appreciate if you signed it.  Walter, our marriage is over.  Walter, I want a divorce.  If that's the price.  My God, Walter! How much more money do you need?  Would you like to go into town? I'm stopping by the post office.  Your friends are a bit... wild.  Y-you know I can't have people over to the house.  I'm not interested.  I'm not interested in whatever you're selling.     Sounds like my ex-husband.  Would you like to come in?  It's been so long since I've been happy. But, I don't even know why I'm telling you... two complete strangers.  So you're -- Jehovah's Witnesses? 93.  I've explored so many religions. But they all had their flaws...  And how do you know...?  What does that mean, exactly?  It says here a worshiper of Jehovah must be honest in all things.  I have nothing to hide! It also says no lies. \"Speak truth. Let the stealer steal no more.\"  No... Big Lolo. Everything you just said is false.  One: Walter is no longer my husband.  And Two: He's not... a painter. 96.  No. Though he's been taking credit for ten years. I'm the only painter in the family.  He made me sound crazy!!  But how can I?! He claims I copied HIM! That he taught ME how to paint!  \"She used a slide projector to trace my work and fill in the colors.\"    I was forced into it. You had --  He had me dominated. He would rant and rave if I didn't do what he wanted. I was afraid. I didn't see any option, so I went along. I felt very bad...  I just gave in. I allowed him to take credit for the big eyes. They reflected all my feelings... and... it was like losing a child... I was weak. I didn't feel I could leave and support myself and my daughter. He said nobody would buy the paintings without his personality. Maybe he was right... You were very talented at being charming. You were a genius at salesmanship and promotion.  That's you, Walter. Jekyll and Hyde. 104.   No! You're outrageous! Constantly criticizing! Wearing me down! Saying I'd be \"knocked off\" if I ever told the truth!!  Her face lights up. She slowly breaks into a satisfied smile.  takes a pencil. She peeks over at Walter -- who's still glued to his seat. His face tight, his expression queasy. Staring off to some faraway place. Margaret looks up at the CLOCK. 3:20. Okay then. Totally calm, in a motion she's done so many times, she focuses on the canvas and starts outlining a Waif. Everybody watches. Effortlessly, she pencils the EYES. They are enormous. The largest orbs she has ever done.  fills in more detail. Ears... nose... then, little fingers clutching a fence. The child is peeking over it, staring right at us...  finishes penciling. She leans back, satisfied with the composition. Then, she reaches for... the PAINT. She unscrews a tube and squirts it on the palette. She rests it on her lap and starts mixing a flesh tone...  peers at Walter, knowingly. She's not surprised. This was his only way out. A look between them -- and then she cocks a half-smile and turns back to the canvas. She squirts out some white oil paint, then begins painting the eyes.  Thank you! Thank you so much.  \"Exhibit 224.\"  She hugs Jane. The Reporter jumps in.  Oh... it was never about the money. And honestly -- I doubt Walter will even pay. 112.  I just wanted credit for what I had done. The justice is... I got my art back. My prayers have been answered.  We hold. She slowly smiles in pride."
    },
    "imdb_rating": "7.0",
    "description": "In San Francisco in the 1950s, Margaret was a woman trying to make it on her own after leaving her husband with only her daughter and her paintings. While struggling to make an impact with her drawings of children with big eyes, she meets gregarious ladies' man and fellow painter Walter Keane in a park. The two quickly become a pair with outgoing Walter selling their paintings and quiet Margaret holed up at home painting even more children with big eyes, but Walter's actually selling her paintings as his own. A clash of financial success and critical failure soon sends Margaret reeling in her life of lies. With Walter still living the high life, Margaret's going to have to try making it on her own again and reclaiming her name and her paintings.Anne Campbell",
    "name": "Big Eyes",
    "genres": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZmVmODhlMTEtNjBiYi00YmFiLTllYjEtZWQ5OTJkMDFlZDlkXkEyXkFqcGdeQXVyNDI3NjU1NzQ@._V1_QL75_UY281_CR3,0,190,281_.jpg"
}