{
    "filename": "Birthday-Girl_script.txt",
    "imdb_id": "tt0188453",
    "imdb_url": "https://www.imdb.com/title/tt0188453",
    "characters": [
        "Bank Manager",
        "Waitress",
        "Bank Colleague",
        "Young Sophia",
        "Robert Moseley (as Xander Armstrong)",
        "Yuri",
        "Karen",
        "Concierge",
        "Porter",
        "John",
        "Clare (as Kate Evans)",
        "Sophia, alias Nadia",
        "D.I. O'Fetiger",
        "Alexei"
    ],
    "dialogues": {
        "Bank": "",
        "Manager": "When communicating he is good at selecting the most efficient methods and displays effective verbal communication skills...  On one occasion John showed first class communication skills in a delicate customer situation.  Initiative. John is reasonably quick to volunteer whenever others need help. Although he is sometimes reluctant and or unwilling to ask for it himself...  He is adequate at resolving difficult or emotional customer situations...  He usually fulfills commitments made to customers within expected time frames.  Customer Service. John shows a high degree of respect for customers...  John still has some reluctance to / or has problems in, carving out new relationships face to face.     Judgment -- John makes able decisions in most areas of his job.  John follows instructions conscientiously and responds well to personal directions.  John is normally very punctual and in most situations assumes responsibility for his own actions and outcomes.     Quick word John?  This is sensitive. Your car. Lovely car. Doesn't necessarily give the right impression.  To customers approaching the bank from the rear  You can see why it's sensitive?  I'll leave it on your desk.  Ah John. This is Robert Moseley, Head of South East New Business. Robert, this is John Buckingham.  I thought you could give us the tour this morning. Sort of be our Indian Guide.  Take the ball and run with it John.  We're starting to see results. This is Karen, who's uh... taking uh... it.",
        "Waitress": "Good morning. What can I get you?  We only do a croissant with the Continental breakfast.  One coffee. And for you Sir ?  More coffee?  Pleasure.",
        "Colleague": "Morning John. Give us a tune.  Morning John. Hey, Moseley's here.",
        "Young": "",
        "Sophia": "Hello John.",
        "Yuri": "You must be John. You seem very nice. Excuse me.  How's that? We can't drink our piss can we?  You must find some glasses, small, for the toast, and some plates.  Sorry. You've lost me...  What?       He says he feels safe here.  She says she wanted to tell you but her English is shit. And no one speaks Russian, it's very hard for her. The light please.  Oh. We are Russian.  Good.  And what? You mean from the beginning? Jesus. Can I uh okay, as we say in Russia can I cut a long story short. Okay. Nadia is my little cousin. Except she's not. But we say cousin. This is for you.  Toast first then we talk seriously, I can see you are serious about us.  Just kidding.    We better watch him. He's crazy.  I am actor, he is actor, although he is an actor stroke musician. I just noodle along, I'm not so good. He makes me look like a retard -- He smokes me. I don't mean he smokes me.  I mean he smokes me. Do you say \"smoke\" in U.K.?  Right. So I can say he smokes me. So.  So I come to England with other actors to make shows, I meet this freak from Novgorod I tell him of you and Chicken and the birthday here we are.  I asked her if you were happy to see us. I find it hard to tell with you.  She says you are a little shy. I think I know this.  Plans are for the architects, politicians and so forth.  You're asking for my documents?  We are all Europeans here. Europe, Tony Blair and Maggie Thatcher!  So. You have nothing to say to your Fiancee? Maybe to wife of forty years it's understandable. Come on. You speak and I will translate.  She says 'Hello' to you. Go for it John!  Classic! Thank God. She says 'Yes!'  She says she has a secret to tell.  She says she watched you at the airport.    \"I have these uh...\" She explains to you... \"When I was a little girl my father had these beautiful old glasses.\" Like... I don't know the word. Like for watching uh... for watching the birds.  Binoculars. He had these Binoculars he has kept from the war.  I would run around with them taking pictures of things I liked with my mind. If I saw something beautiful I would take a picture.  The day before I left Russia my father gave me the old binoculars. He said that when I saw you I was to stand far away and look at you with these, and to examine your face closely. And if you were a bad person I could run away.  She says she took a picture.  Oh nothing.  No. It is too judgmental.  He says why did you send to Russia for a wife.  You are not ashamed of it? It's no surprise to want to love.  Do you believe in love?  It's very strange. How many people are truly themselves with their love? It is the greatest human disaster and it is never in the newspapers. There are no Marches Against Heartache, no Ministries Against Loneliness, no Concerts Against Disappointment. We look away. And still we know in secret that nothing is more important to us. The one thing we all share but don't say. Look John I will show you something.  Here look, something beautiful from Russia. Here is Life, there, take it.  Here is bread. Khylep. This is work. We all need this, here eat.  Good. But we cannot survive with just work, so here is meat and blood. Myasa. This is family and country, flesh, strength, eat.  But again this is not life. Here is joy and pain. Chyesnok. Without these life has no flavour, is too serious. Eat.  But this vodka. Is love. Only this magic changes you inside. The moon and the stars and the sun.  This is a love song, a soldier's song to his beloved -- Alexei, he's Afghanstya, a veteran of Afghanistan. He saw terrible things.    How is bank?  To be indoors on such a day. It's crime.  He's just having fun. He's maybe too strong you know...  I understand. I'm so sorry  I have brought you trouble. Maybe I should have come alone.  John. You must call the Police.  John, I'm sorry. It's my fault.  He says sit down. Or he'll cut her.  Sit down please.  John.  He says you scare him so much he must go to the toilet in his trousers. John, he is a soldier. A trained killer. We must do what he says.  He says you are very sad ridiculous man. I don't agree of course. And that you must pay someone to have sex like a prostitute. Nadia is a prostitute. I'm sorry.  He wants money.  He wants a lot of money.  He wants the money from your bank.  You don't understand. He wants all the money that is in your bank.  He is sure you can do this. Of course you can not.  I'm so sorry.  Fifty thousand. Almost exactly.  Sweet Jesus...  What for?  No I don't.  I've been buying you stuff all week. I've been buying him stuff all week.  When we went to the Hard Rock Cafe. Who paid? When we went to see 'Cats'. Who paid?  I paid for those guitar cases.  It was alright.  Yeah. It was quite good actually. Some bits I really liked.  The sets were excellent. Everything was big, you know, all the rubbish, coke cans, sweet wrappers, dustbins, so when you were watching it you felt cat size. It was really clever.  How you doing?  I'll show you something. It should make all this easier I think.  Not all these bastards were like you, believe me. You should not too feel bad.",
        "Karen": "",
        "Concierge": "",
        "Porter": "",
        "John": "Hello.  Hello, hello. Hello...  I don't believe in perfect love. You know, love that comes out of the sky like a thunderbolt and uh... This is ridiculous.  No. No no no. Nope.  Running. Reading. Going out. Staying in. The countryside. Films, if they're good.  Thoughtful. Outgoing. Ambitious. Well-read. Reasonably popular. Balanced. Trusting. Quite attractive. Outgoing.  Someone intelligent, of course. Kind. Pretty I suppose. But its not critical.     Someone with a sense of humour. Someone you can communicate with on the same level. Someone you can really talk to. I think communication is key.  I think that by the time most people turn thirty they know where they're going.  And where they've been. I suppose they have some baggage stroke history.  We all have someone in our past who uh... one skeleton, if you like. We've all got at least one person, as it were, under the patio. Not literally of course. I suppose I only say this because I always thought people who did this sort of thing were... I had an image that they were losers. Not losers. A bit sad. But I think this is the modern world. And I think really it's quite a brave move. Quite a brave, reasonable thing to do.  Sorry can we start again?  Nadia?  I'm John.  Welcome. Well. Look I didn't have a speech but...  Is that everything?  Right. Okay. Good.  We can talk in the car.      It's about forty miles from here. I don't know if you've looked at a map, it's close to London but it's a city in itself. A Roman city. It's a nice house. I'm having a problem with ants. I uh... It's the warmer weather. I can't seem to find the nest. Sorry, do you understand \"ants\"?  I just can't find a nest. The root of the problem. I've looked everywhere. What's the Russian for ant? Sorry that's a stupid... Sorry. This is strange isn't it.  I'm pretty nervous. Are you?  I mean... \"Ants.\" \"I've got a problem with ants.\"  I had this...  As a joke but uh...  So. Is it different to how you imagined it?  I bet. What about me? Am I how you imagined?  And how was the flight. Sorry, am I speaking too fast for you?  Do uh... Sorry. Can you follow me? Do you understand what I'm saying?  Good. Or should I speak slower?  Do you follow or should I speak slower?  Uh... Are you a giraffe?    Oh Jesus.            Kitchen.     Bathroom.  Bedroom.  The uh... the other bedroom...  I'll get an ashtray.  This is John Buckingham from St Albans. I need to speak to you urgently. There's a critical problem. It's... Call me back as soon as possible. It's critical.  I don't know what to say. Your letters were in English. Good English. You said you'd studied English.  I can't take this.  I can't take it. I'm not really a ring guy.  Okay. No big deal. Thank you. Yes thanks. Thank you.  If anyone gets this message please call as soon as possible. It's an emergency.  Good night.  You should go now. We'll talk in the morning.                   Nadia. This isn't going to work. I'm sorry. It's been a terrible mistake. You must go.  I'm booking a flight for tomorrow. I'm sorry.        Uh. Yeah. Pretty good.  Uh. No.           Thank you -- I think that's very fair.                    It feels good. Weird.  Are you O.K.?  Sorry?  Bath day?  I don't understand.  Today?  Syevodnya?  Happy Birthday. Happy Birthday.  Yes. Party. Party syevodnya.  ...It might just be a twenty-four hour bug...           Happy Birthday to you. Happy Birthday to you. Happy Birthday dear Nadia...  Hang on hang on, sorry, but like, who are you?  What are you doing here?  I'm asking what you're here for.  Yes I know.  What did he say?  I need to know who you are first please.  Yes. I know.  And...  Hold on.    Right.  Right.  No.  So?  What was that?  Yes it's okay. Thank you for the food.  So how long will you be in England?  You must have a visa or something...  No, no...  Hello.  Uh. Do you like England?  Uh...  I can't think of anything. Hang on.  What?  When?   Binoculars.         What was that?  Tell me.  Tell me what he said.  No. It's not that.  I suppose it's... I mean define your terms.     Ch...    Uh... Yes.      Fine. I thought you were leaving today.  Hey.  What's wrong?  Of course. They go. Yes. Yes.     You can stay tonight.  Good night.         What are you doing?  What's he doing? What the fuck are you doing? Leave her alone.  Tell him to stop and let her go, and we'll talk.  Put the fucking kettle down.  Put the fucking kettle down. Tell, Yuri, tell him put it down or I'm going to make him.  What? What does he want?  What did he say? Tell me!  What does he want. The Russian shithead. What do you want ?  Tell him to put the kettle down and I'll give him money.  I'll give him money. Tell him to put the...  I'll fuckin' give it to him! We'll go down there.  I've got eight hundred pounds. Oh Jesus.  Oh Jesus.  Oh Jesus. Of course I can't.  Just leave her alone.  Leave her alone.     Hello.  Right.  Yes. I do.  I'll give you a tune later.  This is uh... This is the uh...  I'll give you a tune later.  This is where we're doing Trust and uh... Trust and Letting Go.  Yes.  Yes.  Excuse me.  I'll give you a tune later.  You can't smoke in here.   Oh, I don't know. In my job as Deputy Assistant of New Business at the bank would have to listen to the problems of a great many individuals. This took a lot of understanding and sympathy, to try to work out solutions to their problems. But, you see, I'm not in that line of work anymore. Nowadays I'm a bank robber.  I think that about covers it. I think I have grasped the part about you being dumped though. That's got to hurt, I imagine. That's got to smart a bit. I mean strictly in my observer's capacity it seemed you two were getting on Pretty Fucking Famously.  Unless. Unless this is part of the routine. You get tied up, stick around, distract me, they both bust in and Steal My Cup Of Coffee.  I don't want to know.  That's a relief. It's nice to know I'm a regular guy.  I'm going to drink my coffee. Then, we're going to the police station. Where there will be lawyers, loss of job, house, humiliation, gutter press, and probably prison.  Even so I always felt the decision to burst in and rob it very much remained with me.  Well as it turns out I did.  Yes please.  Splendid. Thank you.  You must think... I'm the biggest pillock... In the world.  In the world.  I do. I want to very badly.  In every sense. If at all possible.  Well, Nadia, It it's all the same to you, I'd like to give it a bash.  What?  What? No you're not..    You're pregnant.  No.  Get in the car.        Shut up. Have you got your passport?  We've got to get off this motor-way.  Give me some money.  What?  Give me your sunglasses.  So, uh, Alexei, which I know isn't his name...  Fine.  Fine. Absolutely. Must be disappointing though. Must come as a hell of a shock.  So uh...  Oh Jesus.    It's his baby I take it.  Not the kids type then is he? Not that broody. You must be pretty miffed.  Excuse me?  Yeah. I tend to tie up and abandon women I really want to see again too.  Fuck off.  Fuck off. You started it.  I don't want to talk about it.  Shut up. I'm not listening.  No.  So. What's it like having to fuck men you hate?  Okay. Let's... Okay. Okay. You have had sex with people you don't like haven't you? For money. To make money.  And. It's wrong.  And that would be Morals. That would be one's own moral sense of decency.  So. What then? You just detach sex from everything..  Listen. I didn't go rooting around in your private stuff.  So what? Do you just switch off in your head or do you imagine you're with him, or what?  Sometimes which?  Some... What does that mean?  I don't like sex. I don't think I'll be having sex ever again.  Well, it's just that the thought trying to charm up an erection in front of a woman, or alone for that matter, makes me want to die.  I think it's my safest bet, don't you?  What?  I got what I paid for.      Get out.  Get out  Get out.  Jesus. You weren't even on the plane.     (interrupting on \"different\"  (overlapping on \"saying\"  Then okay. So how old were you when you met him?  Yeah. He's a smashing bloke.  Thank Christ for that.  I'm pretty naive? Look at you. You have to do all this, and what have you got to show for it? Nothing.  Well what have you got?  Do you know if it's a boy or a girl?  Have you had any before?  Are you scared?  What?  It's none of your business. She didn't have small eyes.  She's dead.  I don't know why I said that. She's not dead at all.  I don't know why I said it. I'm sorry.  Laugh it up.  You should stop smoking. You're pregnant. You smoke like a fucking lab dog.  I've got news for you. It's not working.  Nobody's that unhappy.  I don't want anyone to die.  Except for Small Eyes.  I don't know.  What's your name?  It's alright.  No. I think I better just go.  Whatever.  Yeah. No thanks.  Because it was a lie.            Oh Jesus.  Are you okay?  Okay. Goodbye.  What will you do now?  Okay. Promise?  You can probably buy them on the flight.  Goodbye.  Whatever.  Please.  It's not mine either.  Yeah, you see when I said I didn't speak Russian I wasn't actually just making it up.  Why?  No. What? No. I know.  It's a long way to go for a date.  What does it mean?  Right.  Is the flight full?  Please check. Is it full? Please could you check.  Thanks.  Cash.  Kam. Kapsi. Schta.  Sophia. Hello Sophia. Mine's still John.",
        "D.I.": "",
        "O'Fetiger": "",
        "Alexei": "Nasyekski.    There's over eighty thousand here.  Put it in the cases. Split it up. And don't forget you owe me £150.  You know what for.  I got you those trousers from Paul Smith.  Such as?  Those aren't presents. That's normal friendship stuff  Yeah it was okay.  The sets were good.    What do you mean?  Do you want to stop?  We'll stop then.  What's this?  That's not a burn.  On both wrists?  Yeah.  Thank you.  What?  A baby? What are we supposed to do with a baby?                          I love you. I don't need to tell you that.  I wouldn't leave my child would I? You know that. I was confused. That's all.        It wasn't easy for me. You know what I'm like. I needed to know what I wanted. Now I know. It's simple. I'm happy.        You still love me? Eh? Of course you do. Come here. Yuri won't be here for a while. Come on babe.  What the fuck is he doing here?  That's that cigarette lighter I gave you isn't it?  What? What are you doing?  What. You're what? You're with this creep now.  You have. You've actually fallen for this prick.  Babe it's me. I won't let you get away.         Don't do this."
    },
    "imdb_rating": "6.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNTI1ZTZiNjItZmRiMS00YzM2LTkwNTYtMzgxMTU2OGQ1Y2M0XkEyXkFqcGdeQXVyMTcwOTQzOTYy._V1_QL75_UX380_CR0,8,380,562_.jpg",
    "description": "Internet love connections and mail-order brides rarely ever work out, and John should have known. Having never been lucky in the game of love and tired of waiting for the perfect woman to come along, John decides to take his chances and orders a mail-order bride from Russia online. At first, things seem perfect: his new bride Nadia is a gorgeous woman, and although she may not speak much English, her skills in the bedroom more than make up for any communication problems. When Nadia's 'cousins' unexpectedly arrive to celebrate her birthday, John is drawn into their web of corruption and crime.—Anna <dimenxia@yahoo.com>",
    "name": "Birthday Girl",
    "genres": [
        "Comedy",
        "Crime",
        "Thriller"
    ]
}