{
    "filename": "Black-Rain_script.txt",
    "imdb_id": "tt0096933",
    "imdb_url": "https://www.imdb.com/title/tt0096933",
    "characters": [
        "Joyce",
        "Masahiro",
        "Sugai",
        "Berg",
        "Oliver",
        "The Kid (as John A. Costelloe)",
        "Charlie Vincent",
        "Nick Conklin",
        "Crown",
        "Miyuki",
        "Sato",
        "Nashida",
        "Ohashi (as Shigeru Koyama)",
        "Katayama",
        "Frankie (as Luis Guzman)"
    ],
    "dialogues": {
        "Joyce": "Hello, Ich.  Johnny Walker?  Ich nods.  Joyce's Japanese is impeccable.  She's a part- time bartender, translator, model.  One of Japan's western wanderers.  She's sliding past thirty, but only her weary eyes give it away.  She is about to pour Ich another drink.   He gets as much as he wants.  Charlie extends his hand to Joyce.  She ignores it.   Right when you're being tucked into bed.  Cold.   They wouldn't appreciate it, Ich. Trust me.  She says something in Japanese to Ich as she eyes the cops.  Then, she walks off.   Ich said you left.   I'm sorry about your friend.  Nick's surprised at how fast she heard.   Dead gaiijin's are big news.   An outside person.  A foreigner.  A barbarian.  You, me.  More you.   I don't give tours.  Nick smiles.   You have a helluva way of asking for help.   Look, you need Ich.  I've been here five years and I still can't read all the street signs.   I don't think so.  From OFF SCREEN:   Busy man.  Nick holds out several of the same girl in various poses.   It's me.  Ich opens the door.  Joyce, dressed for work, is carrying two odons .  Joyce and Ich exchange greetings in Japanese.   What's the latest?  Nick shrugs.   She ever pull down her shades?   Don't be an ass.   I paid for that.  Nick tosses a few thousand yen on the table.  Then, spotting something out the window.   Somebody must be suffering somewhere, you're being so nice.  Joyce takes off down the street.  Nick watches her for a beat.   Where's Ich?   I've heard of Sugai.  I've also heard of the emperor.  They're both national treasures.  One's a hood.   My Japanese isn't that hot... Besides, you'll never get in.   And I'm supposed to care?   You're wrong to sell Ich short.   He's got a reason.  Nick shrugs, everyone's got a reason.   His son hooked up with some bikers. Yakuza kids.  A cop shot him running from a robbery.  Nick looks over for the first time.   A father doesn't out live that kind of thing here, much less a police officer...  Pause.   You met her.  Nick looks surprised.   The woman in the apartment.  She won't speak to him.  But she won't leave either.  Japan... Nice, huh?  Before Nick can respond, something catches his eye:  What he sees --   Not wound too tight...    A three story modern building on a quiet street.  She's searching for her keys.   I'd invite you up but I know you'd hate the incense.  I chant.   'Nam oyo ranged kyo.'  You think it's dumb of course.   I don't remember saying yes.    is sitting across from Nick.   They want your autograph.   This little guy thinks you're Robert Redford... the other one thinks you're Charles Bronson...   They'll never go away.  Nick, reluctantly signs.  Joyce takes one of the kid's notebooks before passing it back.   Mick Jagger?  Joyce smiles, surprised at his choice.  Then, she looks up shocked to see --   Gifts are expected here.  Nick nods, looks back out the window.  He'll never understand this country.  He looks back to see --  Joyce looking annoyed at him.  Nick gets the message.    reading the Manichi Daily.   (certain it's bad  news All's not lost.  There's a famous temple here.  We could chant.  The guard hangs up, calls out to Joyce.  Joyce responds in Japanese.  The guard opens the gate.   The cheese...     Just you.    Slide over.  Joyce, furious at Nick, starts the car, gets behind the wheel.  Ich gets in on the other side.  She spins the car around.  The gate opens.  They tear off.    You came up with the first part.   You're out of your mind.  I'm leaving.  Nick doesn't respond.   You'll get Ich killed.   Bullshit, Nick.  And don't tell me this is all just about Charlie. It's not.   Bastard...  She moves toward him, enraged.  Nick grabs her arm.   Let go.  He won't.   You're out of your mind.  He grips her tighter.   I still think you're a bastard.   Wouldn't help.  Watch out for Ich.  He nods.  The cab drives off.  Nick watches her taxi until it is out of sight, around a corner, then heads inside.    standing at the top of the steps.  A biker is pressing the muzzle of a Sig-Saur assault rifle on her.  Kobo's girl is beside them holding a small pistol.    who scramble for cover.    Ichiro's wife, dressed in a formal kimono, watch the ceremony.   Last time you asked me to come along I nearly got a hole in my head.   Maybe.  If I come visit, we can find out.",
        "Masahiro": "",
        "Sugai": "are having a heated discussion.  The GIRL Ich and Nick have been following walks over to Kobo and sits beside him.  This makes Sugai even more irate.  He's on his feet, red faced and screaming.    The only traditional house we'll see in our story.  It's surrounded by a pool of blood red steaming water from the hot springs.    A vast, austere, traditional room with sliding rice paper doors and tatami mats on the floor.  Ich and Joyce, drinking tea, are sitting with their feet beneath them in the traditional manor.  Nick, smoking, is in a semi-sprawl; using his tea cup as an ashtray.  A LIEUTENANT enters.  He says something and beckons.  They all rise.  He says something else.    Nick enters, ducking his head in the low doorway.  the shoji slides shut behind him.  The furnishings are minimal but elegant.  There's a butsudan, a tokonoma, and a low, long table in the middle of the room.  No chairs.  Nick sits on the floor.  A door slides open at the far end of the room.  Sugai, wearing a kimono over western style suit, walks in.  Nick stands up to shake his hand.  Sugai ignores it, and sits in the traditional position:  feet tucked beneath him.   I'll spare you the ritual.  He tosses him a palm sized bundle.  Nick catches it. Inside, are brand new greenbacks:  hundreds.   Pick it up.  Look at it.  Nick hesitates, then picks it up again.  He runs his fingers over the face of the bill and snaps the paper.   Seven years work by the finest engraver.  Mass produced, sequentially numbered.  The best there has ever been, Mr. Conklin.   -- Kobo... I know.  He killed two of my partners.  One in New York, one at the printing plant.  Sugai fills a cup of tea for Nick and hands it to him.   I took Kobo from the street.  I gave him a home, a future... But my ways were too slow for him... I served seven years in prison for my boss when I was a young man.  Kobo wouldn't serve seven minutes for his Oyabun.  He was supposed to take over this syndicate when I retired.   He'll be dealt with.  Sugai sets a plastic wrapped object on a table before Nick.  Nick recognizes it from the restaurant massacre in New York.  CLOSE UP:  Nick's fingers tear at the plastic.  A block of black iridescent polymer.  The negative image of a $100.00 bill.  A printing plate.   Our associates in New York were close to closing a deal with us.   Yes.  Unlike our syndicates, your criminals don't understand the words 'honor' and 'duty'... We can't afford not to deal with them.  Sugai takes the plate back.   Imagine if your families could pay their gambling and drug debts with perfect counterfeit bought for cents on the dollar.   Not with these bills.  And even if it only took them six months, do you know what our profit margin would be?  Nick looks at a child playing near one of the hot pools in Sugai's garden.   The other plate is currently in New York, in the hands of Kobo's man. Find it for me.   I'll pay you.  Nick laughs at Sugai's audaciousness.   Swiss bank deposit.  Gold bullion. Whatever you want.  You know the city and the police.   You're smarter than Kobo.  You know the price of deceit.  Think about it.    still walking with his back to Nick.    The room where Ich and Joyce are waiting.  Sugai enters. Their surprise turns to shock when they see Nick behind him holding a gun to the old man's head.    Sugai watches calmly as Nick, Ich, and Joyce put their shoes on.  Nick keeps the gun on him.    Nick steps out of the house.  He now has one end of a wire coat hanger loosely wrapped around Sugai's neck, the other end around his wrist.  His gun is pressed just beneath Sugai's ear.  If nick gets shot, so does Sugai.  A handful of guards stand in the courtyard, one is polishing Sugai's Debonnaire car.  They spot Nick and Sugai coming, and immediately pull their guns.   Kobo will meet me here tomorrow. Ten a.m.  Ich nods, confirming that what Sugai says is true.   He'll find out you took me.  I'm unprotected.  He'll kill us.  All of us.  You don't stand a chance.  Ich, knowing Sugai is right, looks at Nick.  Nick flips Ich the gun.    wearing his hat and coat is sitting on the couch, his back to us, facing out the window.  Drop down to --    Sugai, wearing his hat, is slumped down on the couch which has been splintered by the bullets from below.      wearing a western suit, is asking Kobo questions in Japanese.  Sugai barks at him again.  Kobo refuses to answer.  Sugai pulls up a shuto -- an 18 inch knife -- from it's scabbard.    Contact your associate in New York and tell him to hand my plate over to Abolofia.  Nothing from Kobo.   You have betrayed the syndicate and personally dishonored me.  I would rather the deal fell through than...  The guards walk over and turn Kobo around.  His back is to Sugai.  Sugai runs the sword across the nape of Kobo's neck drawing blood.  The guards tighten their grip on Kobo's arms.   Abolofia's person has received the plate.  It's done.  A door opens at the far end of the room.  It's Kobo's girlfriend, the one Nick and Ich had been following.  She starts toward Kobo; a lieutenant intercepts her.    I wanted you to see him like this.    That's enough.  Sugai turns away and picks up the sword.  The guards clutch Kobo.  Sugai's going to kill Kobo after all.  The girl screams at him to stop.  Sugai's oblivious.   You want him dead too.    If anything happens to Abolofia or my plate, detective...  HOLD on Nick then --    Kobo's girl, Sugai's daughter, hangs up the phone.  She's been on the other end of the line.     The door swings open.  Sugai is sitting on the floor.  The girl is carrying a tray of tea.  Beneath the tray, we spot something else -- the butt of a short-bladed tanto.    are putting the last of their belongings into a suitcase. She hands him the plate -- Sugai's plate.  Kobo kisses her as he slips it into his breast pocket. The SOUND of a motorcycle approaching from outside.     grabs the gun.",
        "Berg": "",
        "Oliver": "How big a package we talking about?   Dope?   The old man was a Japanese paper manufacturer.  Hotel room and rental car were full of it.    Art and stationary paper.  Cavello had five hundred thousand in his attache case.  Nick rubs the back of his neck in obvious pain.   One guy do all the damage?   Thought you knew your way around dark alleys, detective.  Oliver goes through the swinging doors into the Examiner's room.  Charlie shoots Nick a look.  Nick let's it slide.    What about the package?   Doesn't speak a word of English. And he won't speak Japanese either. No papers.  The Japanese embassy is very interested.   He's wanted in Japan.  They want him first.  Then we can have him.    Nick is sitting in front of Oliver's desk.  The sunlight makes him wince; wincing makes his face hurt.   Japanese embassy talks to state department.  State talks to police plaza.  They to me and me to you. Shit rolls down hill.  Oliver drops a file folder on the desk.  Nick opens it: petty cash, vouchers and plane tickets.   You and Charlie are taking the Jap home, tonight.   Check your gun before you leave. They're not allowed in Japan.  It's a nice, safe country.   They said send a detective if I could spare one.  I can always spare you.  Nick bridles at the insult.  Oliver's had a hard-on for Nick for years, and Nick's tired of it.   Yeah.  Have a wonderful flight.   It's not your job.   They're blaming it on you.  Christ, Conklin, you didn't even tell me you lost the prisoner!   How?  You don't know the place.  You don't know the language.  Get on the plane.   Your plane's at nine a.m.  Be on it. That's orders.  Period.  Oliver hangs up.  A moment of long distance hum cross talk.  Nick doesn't move.  Pull back through the rows of cops busily working... SOUND FADES.  Charlie Parker's alto sax FADE UP as we --   ... Remember, counterfeiting is the Feds.  They'll be all over Abolofia's place.  Stick tight. You I.D. the other plate, he does real time.   (still not facing  him You know, Nick, if you'd held on to that plate, you could've been a very rich man.  Oliver turns to face Nick.  Nick just looks at him, then:   Be careful on the run.",
        "Charlie": "Typical New York woman, big attitude, small apartment, no tits.  Only two things count to Charlie:  his job and his women, but not necessarily in that order.   I think she got to you, pappy.   (glancing at the  door Still, you gotta wonder how she'd look in handcuffs.  Nick, wary, eyes this kid.  Charlie shrugs, spreads his arms defensively.  The SOUND of pounding on the front door.   Whoa -- where do you think you're going, hotdog.  Cavello butts him with his head, sending Charlie to the floor.  Then, crosses his arms in front of his face and plunges through the WINDOW.  Nick, not missing a beat, gives a small sigh as he follows.    turns to see Nick, hands on knees, gasping for air.    ... It's not like you were slow or anything... I think you did just fine.  I think you did great.   Hey, hey, where you goin'?   Wait up.  You know the guy who did the Weismuller through the window --   You know him?  Nick tries to kick-start this behemoth, but it's not easy.   So why dive through the glass for a nickel and dime bust?  Charlie puts his foot up on Nick's fender to tie his shoe. Nick, spotting an ankle holster peeking from Charlie's sock, grabs Charlie's foot.  Charlie teeters.   Let go...  Nick pulls out a Beretta 32.   Back-up.   Why?   (looking at Nick's  bike I'll get rid of it when you get rid of the egg-beater.  The Harley comes to life spitting a cloud of blue smoke. Nick puts on his paint-flecked helmet, slides down some ski goggles.   Nick, let's go hunting.  Bag Cavello.   ... I found the goombah... Cavello. He's --   Whoa, I knew you were going to say that.  I absolutely anticipated that, Nick.  But I said to myself, Charlie, Charlie, we can move up on this, so go find Nicklaus... He'll be pissed for a moment, but then it'll dawn on him --   ... Look... they told me at the Greek's you were here.  I'm sorry, I never imagined...    I like her.  She's nice.  For her age.  The bedroom door opens.  Connie enters, dumps Nick's clothes on the couch, tosses his gun on top of the pile. Without a word, she goes back inside and slams the door behind her.  Nick, pissed, slowly turns to face Charlie.  Charlie shrugs.  Nick's got nothing better to do than go.   What are they doing now?   Who do you think the Jap is?   I don't blame you for being sore. It'll pass when we bag him.  Charlie, trying to relax, gestures toward his foot.   Whatdaya think?  'Bostonians'. Eighty-five bucks.  Girls go for shoes.  Second place they look. (off Nick's  reaction Hey, I read it in a magazine.  Nick's attention is drawn to a trio walking in the door.   What?  WHAT THEY SEE:  TWO BODYGUARDS are making a quick sweep of the bar.  FRANK ABOLOFIA, s stocky man with silver grey hair, sweeps in behind them.  Abolofia has mitts like a meat packer and a fifty dollar manicure.  A heavyweight Mafioso.   The Wolf?  Abolofia walks to Cavello's table.  All rise and shake hands.  The two hitters take seats at the bar.  The two brothers scramble to serve their distinguished guests.   Maybe we should do something?    on the floor.  They don't have the artillery for this guy either.    his hand close around the grip of the Beretta.  He unsnaps the ankle holster.  The SNAP can be heard across the room. Nick's hand closes around Charlie's and squeezes till the knuckles turn white.    What are you doing?   (nervously showing  shield Police.    Call 911.  Tell them an officer needs assistance.  Say ten thirteen.  Nothing from the owner who looks at Abolofia.  Charlie grabs the owner by his collar and shoves him toward the phone.   Do it, you dumb bastard!  Suddenly Charlie feels something wet at his feet.  He looks down to see that he's standing in a pool of blood from the massacre.  So much for his new shoes.  He wheels around, then quickly backs out the door.    NICK...!  Shit... SHIT!!    joins the cops as they run down the alley to find Nick getting pummeled.  Charlie shoots at Kobo.  Misses.  Kobo turns to see the five cops, guns drawn.  Nick, on one knee, spits out blood and a few teeth.  Kobo calmly slips the shuto out of his coat pocket and drops it next to Nick.  The blade gleams in the light. That was next.  Nick got lucky.  Kobo towers imperiously above Nick.  Their eyes lock.  We hold then...   Full of what?    I got a tattoo.  Birdie on the ball. We all got them when we finished basic at Camp Lejune.   ... Nick, you're the one that's always saying you never go anywhere.   What are you missing?  Riding your motorcycle to the nurse's house. That shit is sadder than Ethiopia.   They say we got to turn around and come right back.  That's what they say.  I got a plan.  The last thing Nick wants to hear -- too late.   I call, right?  I say I got the dreaded thirty six-hour Asian shits from some raw clam and we stretch it into three days.  You and I become a driving force on the local Geisha scene.    Hey, come on, big guy like you, cop from New York.  You're gonna be the biggest thing to hit town since Godzilla.  Nick can't help but smile at this kid.  Charlie looks down at the guide book.   Says here, it's very impolite to touch someone while you're talking to them...  Guess that means you can't talk and screw at the same time, huh, hotdog? What's the matter, no -- speaky-the- language?  Understand this:  You will never ever fuck with my partner again.  Nothing from Kobo who is looking straight ahead.  He doesn't understand.   Where is the subway station, please.  Kobo keeps laughing; it's obviously not what Charlie said.   Nick... You up?   Nick, have I been a good partner?   I just want you to know... I mean anybody who says you ever took has got to deal with me.   You didn't take, did you...?  You hear things.  Nick opens his eyes.    I didn't know.   Whoa.  Nick, we're in paradise.    Charlie.  Kon-ich-iwa.  Nagashima shakes his hand.  Bows.  Charlie bows back. Nick wouldn't bow if his life depended on it.  Nagashima hands Nick an official looking document.    Arigato.  Nick grabs Charlie by the arm and starts for the customs line.   Hey, when in Rome --    trying to shove past the customs inspectors who are wrestling them aside.   There must be some witnesses from the airport?  Still nothing from the good inspector.   Nick, we can't just --   ... Detective Ich-iro Matsu-moto. Hey, we're getting Mr. Moto on our side.   First decent idea you've had.  Charlie pulls out his 'Footloose in Tokyo\" book, flips through the pages.   Food... Food, here we go.  Tokyo offers a wide variety of food.  It's best to sample the local specialties, including sashaimi, soba, and world renown Kobe beef...  Nick goes into a restaurant.  Charlie drops the book, disgusted with Nick's choice.  Charlie reluctantly follows him in.  REVEAL it's a Shakey's Pizza restaurant.   This should be it...   Kore?  Doku?  Kore doku?  The man gestures toward the building Charlie was pointing to.   This the right place?   Konichiwa.  Ichiro Matsumoto?  The woman babbles bird-like in rapid Japanese.  She bows. They're in the right place.    Getting very weird.   Maybe we should bail?  Seeing they've stopped, the woman gestures for them to hurry up, then disappears around the corner.   The back room at Lombardi's after the Columbus Day Parade.  Under the bed.  In the mayor's office. Everywhere.  Ich heads for the door without saying a word.   I don't think he'd feel it.    Say Ich, between friends, where can I grab some squish around here?  Nick sighs, digs in his pocket for some yen for the bill.   Pussy, ass, soft personnel.  Ich looks up to see a picturesque, blood-haired American WOMEN in a tight silk blouse and skirt.  She works here and has obviously heard Charlie.   Hello hello, Charlie Skloaris.  New York City.  She refills Ich's glass.   My partner and I are cops.  We're on a very big assignment here.  When do you get off?    What'd she say?   ... He's a sorry old guy, but I like him.   Now that's the kind of motorcycle I want to see you on.   Nick, how we gonna bag this guy without any help?  Maybe I should work on that girl Joyce, she speaks the language.  Nick glances over at his partner, smiles.  But before he can respond --  The DULL ROAR of a half dozen motorcycles in the distance breaks the pre-dawn stillness.   Hey, Ich has been helpful.   You cool, Ich?   You all right?  You okay?  Ich nods.   What does Ichiro mean, anyway?   Hey, all right.  Charlie slaps Ich on the back.  NICK smiles at Charlie's remark.  He can't help but like this wide-eyed goofy kid.  Something makes Nick's smile fade.",
        "Vincent": "",
        "Nick": "One, and one on top.   Call.   Very nice, Barbie. (pointing toward her  boyfriend Now, I'd take Ken over there and go home.   It's time.  That's all.   Listen, Ken --   -- I'm offering you the benefit of my experience.    You want a popsicle, go to Good Humor.  And don't call me 'pappy.'    Alley oop.  They down their drinks, then set them down.  Charlie pulls out the Binaca, offering Nick a spritz, but Nick is already pulling out his POLICE BADGE and hanging it around his neck.  Charlie quickly follows suit.    My name is Conklin.  Let's do this fast so I can go home.  Zachara, annoyed, looks at Nick.    It's all yours.    catches the Debutante's eye across the room.  She smiles at him, he was right.  He shrugs, spreads his hands. That's life.  A well groomed middle aged man, who we'll come to know as CAVELLO, suddenly bolts from the crowd lined up against the wall.  Charlie spins around to stop him --    Fabulous...  He takes off after him.    Thanks.  Nick turns to leave.   Home.    -- Cavello.  Ronnie Cavello.  Charlie trails Nick to his motorcycle:  a Harley hog complete with wide gleaming fenders and twin tanks.  The bike is held together with tape and baling wire.   He works for Frank Abolofia. Atlantic City.  Casinos.   What's this?   Get rid of it.   It's not regulation.  And the only way you're gonna stop anybody with it is to show it to him, and while he's laughing, you can shove it down his throat.   Charlie...  Nick pops the bike into gear.   ... You still got shaving cream on your ear.  Nick rolls out and disappears in a haze of blue smoke.    Short shift?   Connie...   High spirits, desire, commitment.   Give me a break, would you?   Are you expecting anyone?   -- I should tear your head off.   -- Hey, I got a better chance of being hit by a bus then moving up.  Charlie looks away momentarily, letting it slide.  He knows he's on sensitive ground.   Eating Scungilli, just like the last time you asked.   Maybe Cavello's buying a Subaru. How would I know?    Charlie, don't do anything.  Promise me?   Frank Abolofia.    Some party.   Charlie, take your gum, stick it under your ass and keep it warm.  Nick turns away, resumes his drink.  NICK'S POV IN THE MIRROR BEHIND THE BAR:  two new Japanese men step in the door.  Early twenties, spiky hair, dark Versace suits.    on the floor.  They don't have the artillery for this guy either.   Saving your life.    Police officers.  Everybody stay put.  Get back up.  Abolofia's eyebrows rise at this development.  Nick bolts out the door leaving Charlie in charge.  He's never been in charge before.   On the ground, man.  NOW!!  Kobo cups his hands around his ear.  He doesn't understand English.  Nick, keeping his gun fixed, comes up to him and kicks out his legs.  Kobo falls flat on his chest.  Nick pulls out his cuffs.  But Kobo lunges for Nick's ankle and yanks it toward him.  Nick stumbles backward; Kobo's on his feet.  Before Nick can stand, Kobo lands a brutal kick to the side of Nick's head.  Nick gets up, barrels into him.  Kobo knees Nick in the solar plexus, then lands two more well placed kicks in Nick's back.  It's not that Nick's a bad fighter, it's that this kid is so damn fast.  Nick slowly gets to his feet.  KOBO lands two more brutal shots to the side of Nick's head.  He's a bloody mess.    There isn't a stick of furniture, but that's not the half of it.  In the middle of the room is a motorcycle on a centerstand.  A drop cloth is spread around it, tools neatly aligned.  It's a Harley -- but this one is in perfect condition.  A phone RINGS insistently from off screen, then stops.   Yeah... sure, sure I'll be down.  Nick walks in, naked.  Every muscle aches.  One side of his face is completely swollen.  He has a band-aid over his right eye; some blood caked on his earlobe.  He stops to twist a spark plug in with a ratchet, but it snaps.   (holding up his  hands This by this...   Not in that company.   Yeah.   Charlie.   Yeah, he's not used to seeing other people do the killing.   I did make a mistake.  I let the wrong guy get hit.  Abolofia doesn't blink an eye, goes for the jugular.   Why?   What?  Oliver nods.  That's the way it is.    looking at him.   What...?  What if I say no?   Why me?    You got something to say to me, Captain?  Oliver doesn't want to get into it.   I was thinking the Poconos, Charlie. Maybe Vegas.   Beats forty hours on a plane.   Not a prayer.   Shut-up, Charlie.  A beat, then Charlie reads a Japanese phrase from the book.  A slight facial response from Kobo.  Charlie tries it again.  This time Kobo laughs openly.   What'd you say?   Get a new book.   No.  Charlie removes his headphones.   Number five with a bullet.  Nick shuts his eyes.   Go to sleep, Charlie.   I worked the three nine in Queens, Charlie.   The lieutenant was on the pad along with the rest of the squad.  I was new, didn't know shit.  When the feathers flew, I got called in front of the special prosecutor.  It's on the top of my personnel file.  They think I'm dirty or I cut a deal. Doesn't leave you with a lot of friends either way.  Nick shuts his eyes.   I might as well have done something. I've been paying for it every goddamn day since I got transferred...  HOLD on Nick then...   You going to take this crap off our hands?   Right.   Givin' you a book is like givin' a baby a gun.   In Rome, I'll bow.   Inspector Nagashima told me to give you this.  He hands the Inspector the official looking document.  The Inspector scans the paper.  Hands it back to them.   We're cops.  Pol-ice-men.  The Inspector signals a nearby POLICEMAN.  The Inspector says something in Japanese.  Hands the policeman the document.  The policeman shakes his head, amused, points to the end of the line.   Fellas, get serious.  From off screen someone CALLS OUT:    trying to shove past the customs inspectors who are wrestling them aside.   Cops!  He's our prisoner!  Two more policemen arrive.  Nick and Charlie are thrown up against the wall.  Out come the cuffs.  SNAP!   What's going on?  We're the good guys!   Get me something like an Identi-Kit and I'll give you a description.  Ohashi remains poker faced.  He continues to arrange papers and apply his hanko  to the bottom of a stack of official papers.   What is it, tea time?  Still nothing from Ohashi.  Finally:   Incompetent is letting people waltz through a secure area wearing your uniforms, carrying official documents.  Ohashi bows slightly, we're not sure why.   I want a gun.   We're police officers.   Work with me.  I want your best detective.  Pause.  Ohashi returns to his papers.  Nick can't believe it.   Hey, inspector, I don't intend to take the rap for this.   Let's go.   I said let's go, Charlie.  Reluctantly they head towards the door, passing long rows of bureaucrats, telephones ringing off the hook.  Nick stops at the door, spots a fuse box nearby.  He glances back to make sure no one is looking.  Nick pulls out his handcuffs.  Charlie can't figure out what the hell he's doing.  Nick attaches one cuff to the main lever then yanks it down.  The lights go out.  The fan's stop; so do the typewriters; so does the air conditioning.  Dead silence.  Nick attaches the other cuff to a pipe, snaps it shut. Now it's impossible to left the main lever.  From the far end of the room:   Your best detective, Ohashi.   Let's grab some food.   You said that in the last two places.  Charlie holds out the paper to a passing man.   Okay, you were right.  Charlie grins, satisfied.    I hope not.  A WOMAN now appears at the door.  Middle aged, wizened face, in a full traditional Kimono.   I'd feel better if we had some heat.   (looking at the maze  of streets Think we could find our way back?   Where do we start looking for this guy?   Where're you going, Ichiro?    Jerry Lee Lewis, Elvis, Dinky Doo And The Don't's.  Let's book, Charlie.  If he starts on Motown, we'll be here all night.   That's what you said in the last three piss pots.  Ich sets down his drink, pours more sake for Nick and Charlie then for himself.  He's having a great time.   It's incredible.  Hit him or something.   Don't give him any more.   (frustrated, to a  cabbie What's the problem here?  The cabbie ignores them.   Not a prayer.   He couldn't find his ass with both hands.  A brand new Kawasaki 1000 motorcycle with windshield and full farings gleams under a street light.    Sure, a rice burning crotch rocket...   Give us a break...   Leave the rice cake outside and go home!  But Ich persists.   Could you fill me in?   Because I want you to tell me.   Can we skip the poetry, inspector?  Ohashi pauses.  Ich looks at Nick as if to warn him he can't speak to Ohashi that way.   Not until one of us bags Kobo. (looking at the  corpse And it doesn't look like you're doing so hot.  Ohashi coolly flicks the ashes of his cigarette and we --   You know, Inspector, you take shit once, you take shit forever.   Why the hell not?    KOBO, their escaped prisoner, hurrying in the opposite direction.  His Kamali suit looks like it just came from the cleaners.   Charlie!  Charlie spots him.  In a flash, the two men jump the railing and charge after him, leaving Ich in their wake.  Ich can't possibly make it over the side.  He furiously shoves his way through the Salarymen, trying to get to the end of the walkway.    It's a set-up...!  Charlie!  Charlie hasn't heard him.    shoving through the crowd.  He spots Charlie.  Shouts at him to wait.  Charlie can't hear his partner.     Charlie!  Nick is close enough to see, too far to do anything.  He's blocked by TWO MORE LEATHER BOYS.  He tries to shove past, but they grab him.    trying to struggle free.       manages to break free of the leatherboys holding him. They flee into the crowd as the police close in.   He was my partner.   I planned on catching him, Captain.   He killed a police officer.    asleep, the futon tangled around him.  He opens his eyes. A woman is making tea in the kitchenette.  This is the kimonoed woman who led Nick and Charlie to Ich the other night.  A RADIO is on softly in the background.  The Charlie Parker tune we've been listening to over the previous cuts ends, and the announcer comes on:   What happened?   Why weren't you at the platform?    as he pours a pail of water over his head, it runs down his face in slow motion.   Yeah...   Yakuza?  Ich nods.  Nick eyes them for a long beat, then climbs out of the tub.    Nick tossing two bags into a taxi in front of Ich's apartment building.   ... Smoking.    I want to cash it in.  Yen.   Ichiro?  The woman steps out of the kitchen, babbles something in Japanese.  Nick doesn't have a clue.   What's tricks?  She looks up, surprised to see Nick standing in front of her.   There was a change in plans.  Beat.   Gaiijin?   I could use some help.  Show me around.  I'll pay you for your time.   You can count on the truth from people who don't like you.   You have a helluva way of answering.  Draw.   Maybe I'm a quicker learner.   I can see that.  Ich ambles into the room, slips down into a chair.  He spills the contents of the large manila envelope he's been carrying onto the table:  a wallet, a set of keys, playing cards, etc.   How'd you get this?   Partners.  Ich has just had his last drink on duty.   Know her?   A snitch?    as the man in the Hawaiian shirt walks past him.  This is the snitch.  Nick glances back at Ich.  Ich nods -- they're in business.   What's he saying?   My turn.  He grabs the man by his shirt collar and shoves him against the wall.  The photos spill to the floor.   Who is she?  He bangs the man's head back against the wall.  The man starts babbling in Japanese.  Ich, horrified, tries to pull Nick off him.   Aw, for Christ's sake.  They continue speaking in Japanese.  They bow to one another again.  Ich gives the man a glass of water, then motions for him to sit down.  Nick, impatient, starts for the guy again.  Ich stops him. The snitch holds up one of the photos, and starts babbling.    Now we're making progress.    holding the photo, standing in the crowded store.  Ich is beside him.   That's Kobo's girl?  He's sure?  Ich glances back at the man in the Hawaiian shirt standing by the door.  The man nods.   Only one way to find out... Get her up in the morning and put her to bed at night.    is struggling with his chopsticks and bowl of noodles. From O.S. A LOUD SLURPING SOUND.  The sound stops, then starts again.  Nick can't eat.  He sets his bowl down and looks over at   Think you could keep it to a dull roar?  They're sitting by the window across from the Seibu department store watching the entrance.    waiting in the restaurant, get up to follow.    No.  Don't say anything.  Don't do anything, and for Christ's sake, don't apologize!   What'd I tell you?   Did I say that?   Are we getting married?  Pause.   You're doing fine, Ich.  Now drop it, okay?    as the girl, dressed in her store uniform, comes out of the apartment and heads for work.    nudges the sleeping Ich with his foot.  Ich opens his eyes.   Let's book.  Ich is groggy, nonplused.   Let's go.   Call a cop.  The door swings open.  Nick walks in.    If you're gonna give me a hard time, wait outside.  Nick goes through her chest of drawers:  on the top, a lot of high quality lingerie.  INSERT PHOTO:  The girl and Kobo posing in a vintage Corvette.  Nick replaces the picture, and carefully rearranges the drawer so it appears untouched.  He pulls open another drawer.  Then another.  Under the jeans and Mickey Mouse T-shirts, he finds:   Not too shabby for a perfume pusher.  Ich, shocked, tries to play it cool.    a few yards away.   Nick smiles, then walks into the store, hoping he hasn't been made.   (looking back out  the window Four goddamn days.  This is going nowhere...  A KNOCK at the door.    Sure, but then I just pull out the photos.  Ich opens one of the box dinners and sets it on the ledge in front of Nick.   Ichiro --   Smells like Bayonne at low tide.  Joyce hands Ich a flask of hot sake in tinfoil.   Whoa whoa...  Nick grabs the flask.  Dumps it out the window.   He's on duty.   Alley oop!  Nick grabs his coat and goes out the door.  Joyce slips Ich another flask of sake.    watching in a doorway down the block.  Nick's shivering, his hands thrust in his army surplus jacket.  Ich doesn't mind the cold.  He's had his sake.   Good.  Very good...   She disappeared... shit!    dropping another cigarette butt to the ground.  There's a small pile at his feet.  He's leaning against the wall watching one end of the block.  TRACK over to reveal Ich, his back to Nick's, watching the other end.  Ich glances back at Nick.  Nick ignores him.  Ich turns back.    Walk in.  Everything seems normal.  The BOUNCER in a white tux, stops them.  This is not a place frequented by Gaiijin.  Ich beseeches the Bouncer to let his good friend in, promising that his friend will spend lots of money.  Nick, thinking he's in, takes a step forward.  The Bouncer shoves him back.   Hey, no hands, huh?  He bats his hands away.  Ich grabs Nick by the shoulders, preventing a fight.   Gaiijin.   If I smell one drop of Scotch on your breath, my friend --   I don't believe it...  Son-of-a-bitch --  Ich, knowing they're being watched, grabs Nick by the sleeve and drags him off still pretending to be drunk.   We're through.  I mean it.  This is the end of the line, Matsumoto.   Shut-up.  No longer fearing he's being watched, Ich abruptly stops his affected walk, and sounding very sober --   I want to yank Kobo.   Ich, my name is Nick.  Not Nicklaus, not Nicklaus-san, not Nick-san. Nick.    are standing across the street waiting for the cops to arrive.  Nick freezes.   Shit...  Nick races across the street toward the club.  Horns  I'm taking you back.  The girl takes off down the block.    A few minutes faster, we might've nailed him.  Ohashi doesn't say a word, hands Nick a document.   What's this?   While you were hanging out at the visa office, we found the son-of-a- bitch.   Maybe if you'd work with us --  Ohashi ignores him, continues walking toward his waiting car.    Hey...! (Ohashi keeps  walking  Ohashi!  Ohashi faces straight ahead, ignoring Nick.  Nick takes the extradition paper and spikes it on the car antenna.  Ich grabs Nick by his arm, pulling him back from the car. The car pulls away.   Damnit, Ichiro, I'm tired of people telling me what I can and can't do. No one ever solved anything sitting on their ass.  Nick, beside himself with frustration, watches Ohashi's car disappear down the block.    who walks off without looking back at his partner.   The ice help?  Nothing from Ich.   Where does this Sugai live?   I want to go talk to him.   Because he knows how to get to our man.   I'll be a nice Gaiijin.  Nick gets up and goes to the closet.  He slides open the door.  All of his and Charlie's clothes have been neatly hung up.  He shoves Charlie's jacket aside.  Something's wrong with the way it hangs.  He pulls the jacket out, runs his hand over the coat, feeling something heavy in the lining.  Nick rips the lining open.  Charlie's .32 Beretta and a spare clip tumble out.   The little bastard.  God bless him.  Ich takes a drink from his bottle.   Big enough.   It's a new deal. (putting it in his  waist band ... coming with me tomorrow?   Sure, pal.  You've got better things to do.  Nick walks out shutting the door behind him.  Stay on Ich watching the door, then --   You know where I can get a decent cup of coffee this time of night? I'm buying.   I need your help, Joyce.   Unavailable.   I need someone to translate for me.   It's my last shot.  I have to be on a plane home tomorrow night.   You could fake it.  Joyce finishes her drink, sets it down.   He drinks.   Where's the wife?   What do you chant?   Not if it works. (holding the door  open for her I'll meet you at the train?   I don't remember you saying no.  Joyce smiles, heads inside.   Who am I supposed to be?   Tell them I'm not.  She does, but the kids insist.   I'm sorry, Ichiro.  I lost it last night.  I shouldn't have hit you.  Still nothing from Ich.   What's in the box?   So I bring some cheese?   Hey, Ich... Thanks.  I'm glad you're here.  I mean it.  Ich still won't acknowledge Nick.     They took the gift an hour ago.  The phone rings inside the gate.  A guard picks it up.   We're in?   This supposed to impress me?  He sets it down.   I'm impressed.  But let's use the short form.  I'm looking for --   I don't drink tea.  Sugai hands it to him anyway.   I want him.   The families who control the casinos?   The Feds would be onto you in a month.   Why tell me this?   You trust me?   (indicating the  counterfeit bills With these?   If I say no?   I don't have to.  Sugai cools.  Without a word he gets to his feet and starts toward the door.   I have ten hours to grab my man.   You won't get hurt.  Sugai turns to see Nick, across the room, pointing the Beretta at his head.   Let's go.  Him first.   It's done.  You don't have to come.  She hasn't moved a muscle.    Explain to them.  They shoot me, they kill you.   Grab the keys, Ich, and get inside.   Not now, man, okay, not now.  Work with me.  Ich takes the keys from the man polishing the car.  He gets inside.  Joyce hurries in bedside him.   Start it.    Where's somewhere safe?  Nothing from Ich.  He's still apoplectic.   Good.   Not if we're careful.  Ich checks to make sure the gun is loaded, then watches as Nick escorts Joyce out of the room.   No one's keeping him here.   Why would you care?  That pushes her over the line.   What if I chant?    walking into Sugai's room.  Sugai's asleep on the bed. Ich is vigilantly sitting awake in the corner, the gun resting on the table in front of him.   Better wake him up.    who slams the side of Kobo's head with the butt of his gun.    can't believe Sugai's going to kill him.  Nick starts to get up, Ich stops him.  Kobo realizes Sugai isn't just threatening him.   That wasn't our deal.   After a court convicts him.  He belongs to me.  There's a long pause.  Then, something unusual happens. Sugai tells the lieutenant to unfasten Kobo's wrist.  When he does, Sugai hands Kobo the sword and demands that he cut off his finger.  This is Yubitsume:  the ritual act within the Yakuza of slicing the joint of the little finger to atone for a mistake.  Kobo, not believing in this ancient tradition, refuses. Sugai nods to a guard who places Kobo's finger on the table.   Just one, compadre... Kampai.   It took 12 years to make it, you could take five minutes to drink it.  Ich slows down.   You did great, Ichiro.   Save it, I already took the tour.   Guess I'm on a roll.   Time, I've got plenty of.  A raucous SALARYMAN comes down the aisle, singing an Enka, swaying with the train, bumping into seats.  A common enough sight and ignored by the rest of the passengers. The Salaryman stumbles and falls across Nick's lap.    Hey, hey, come on, blow...  The Salaryman bows deep.  Nick ignores it.  The man moves on.  Kobo looks out the window, the train begins to SLOW as it approaches the next station.   I'm amused.   Sugai won't give it to me, you know that.    follows him to the door.    bursts into the packed bar car.   Ichiro?!  Everyone turns around.  No Ich.   Where's Ohashi?  Instead of offering him help, the policemen grab him and slap a pair of handcuffs on Nick's wrists.   What the hell are you doing?!   For God's sake, Ohashi, I need your help.  Let me out of here!   If anything happens to her while I'm here --   I have to get to Sugai.    (yelling at the top  of his lungs  I was ready to have your ass for taking off on me.   How many men?   Joyce?   We need the plate to negotiate with.  Ich nods.    You know, Ichiro, you just burned your bridges.  Ich is silent for a moment.  He hands Nick's Beretta back through the partition.  So it goes.   Now we've got nothing to negotiate with.   Joyce told me about your family. It's tough...  Ich looks up surprised.   A wife.  She left.   Me too.  Ich glances over at Nick, then back at the road.  Nicks rubs out his cigarette and presses down on the accelerator.    sitting in the car watching from a hillside turnoff. There's no easy way in.   Let's go.  Ich hands Charlie his shuto -- an 18 inch long knife.   What's that for?   Thanks.  Nick opens up his door and climbs out.    Why's that?    making their way through the waist high water.    rises from a ditch and swings a hoe at the rider as he passes, catching the man across the face.  The rider drops like a swatted fly.  The biker's momentum carries it a few yards before it falls and skids to a halt.  Nick hurries to the bike.  Ich drags the biker off the road, then catches up to his partner.    raise the heavy bike.  Nick mounts.  He takes the riders helmet and goggles from Ich, and puts them on.    bearing down on Kobo.    dumps the bike at the foot of the stairs and leaps on Kobo.  Nick and Kobo roll off the narrow porch.  Nick breaks free.  He isn't fighting fair this time.  He slams his foot into Kobo's face and ribs.  Kobo tries to get up, but Nick knees him in the chin.  A woman cries out in Japanese.  Nick turns to see    tackles her, and wrestles the gun away.  She grabs for it. Nick slugs her.    who scramble for cover.    You all right?    Call for help.  Nick mounts the other bike, and puts the turbo charged rocket into gear.    comes around the same corner.  His bike fishtails and slides out from under him.    pulling eight-five... ninety... one hundred.  The rain stings his face.  It's hard to keep his eye open.    is gaining on him.  He HEARS something coming up behind him.    as the biker draws even.    something the biker doesn't.    swerves to avoid it at the last moment.  The biker reacts too late and runs --    burst around the corner charging toward him at a hundred- and-twenty miles per hour, in the driving rain.    flying over the edge of the road, and down the cliff.    struggling to get his gun.  Finally he does.  But it's caked in mud.  If the barrel is stuffed it will explode. Nick has to take the chance.    aims as best he can and fires.  The mud caked gun explodes in his hand.  Nick screams in agony.    struggles to get up.  He can't.    crawling a few inches, that's it.    reaches into his coat and pulls Ich's 18 inch shuto out.  He rolls away at the last moment, slashing Kobo's ankle as he races past.    mustering all his strength, struggles across the road on all fours.    still moving, his arms and legs feel like lead.    grabs Kobo's wrist forcing him to drop the plate.  Nick picks up a rock.  It looks as if he's going to smash Kobo's head.  Instead, he brings it down on the plate, shattering it in a half-dozen pieces.  Nick tosses the pieces in front of Kobo's face.   Keep the change.  Nick, exhausted, slowly falls onto his back.  He looks over at Kobo, their faces are inches apart.  Nick makes a slashing mark with his index finger above his eyebrows. The same gesture Kobo made to Nick through the two-way mirror in New York.  Nick passes out.  His eyes shut... the screen...    standing at the far end of the room by the fuse box.  He's also bandaged and on crutches.  Nick looks at Ohashi without saying a word, then flips the main switch up.  The lights and fans start working.  He turns and walks out the door.    Ichiro's wife, dressed in a formal kimono, watch the ceremony.   Can't make you change your mind?   Might be different in New York.   I'd like that.  Ich sits down with two fresh bowls of soba noodles.  Nick hesitates.   Joyce, give the assistant Chief Inspector a drink, would you?  As Joyce refills all their cups we...   Right.  Reveal Nick sitting in front of Oliver's desk, his one arm is still in a sling.  Nick gets to his feet.   Never crossed my mind.  Oliver nods; he believes him.    walks in with two heavy bullet proof vests slung over his shoulder.  He squeezes past the raiding party to find   Sure you want to come?  Probably better than the Greyline Tour.  Ich stands up, shoves the guidebook in his back pocket. He helps Nick fasten the strap in back.   We can't lose.   Cause you're the biggest thing to hit this town since...  Before Nick can finish his line, the door SLAMS SHUT behind them.",
        "Conklin": "",
        "Crown": "",
        "Miyuki": "",
        "Sato": "",
        "Nashida": "",
        "Katayama": ""
    },
    "imdb_rating": "6.6",
    "description": "Two New York cops get involved in a gang war between members of the Yakuza, the Japanese Mafia. They arrest one of their killers and are ordered to escort him back to Japan. In Japan, however, he manages to escape. As they try to track him down, they get deeper and deeper into the Japanese Mafia scene and they have to learn that they can only win by playing the game the Japanese way.—Harald Mayr <marvin@bike.augusta.de>",
    "name": "Black Rain",
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjk1N2ZjOWYtN2FiMi00YzE4LTg1ZTctOGVmMjBlNzllNmUzXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_QL75_UY281_CR1,0,190,281_.jpg"
}