{
    "filename": "Blade-Runner_script.txt",
    "imdb_id": "tt0083658",
    "imdb_url": "https://www.imdb.com/title/tt0083658",
    "characters": [
        "Dr. Eldon Tyrell",
        "Leon Kowalski",
        "Bryant",
        "Rick Deckard",
        "Gaff",
        "Taffey Lewis",
        "Holden",
        "J.F. Sebastian",
        "Roy Batty",
        "Bear",
        "Zhora",
        "Hannibal Chew",
        "Pris",
        "Rachael",
        "Kaiser"
    ],
    "dialogues": {
        "Leon": "Okay if I talk?  I kinda get nervous when I take tests.  Sorry.  Already had I.Q. test this year -- but I don't think I never had a...  What one?  What desert?  But how come I'd be there?  A tortoise.  What's that?  Of course.  I never seen a turtle.  But I understand what you mean.  You make these questions, Mr. Holden, or they write 'em down for you?  Whatcha mean, I'm not helping?                       Somebody was already there.  Just a man.  I think I have no money.  But I would like to buy you drink.  Vodka!  Thank you very much.  Prosit.  You want to see my friends?  No problem.  Ya.  Two months.  But this one is not guy.  It is girl.  His girl.  Usually Blackie waits until Igor is eating; then, when his back is turned, he tries to take advantage of Anna.  Prosit.  You never saw a cockroach make love?  We will try.  It must be that he is not hungry or maybe she is not hot.  You like to kiss her goodbye.  I like you.  One more, eh?  How come you know where Zhora was so quick?  How old am I?  My birthday is April 10, 2015. How long do I live?  More than you.  Painful to live in fear, isn't it.  But that's how it is to be a slave.  The future is sealed off, he grovels, he waits.  Sex, reproduction, security, the simple things.  But no way to satisfy them.  To be homesick with no place to go.  Potential with no way to use it.  Lots of little oversights in the Nexus 6.  I tell you, nothing is worse than having an itch you can never scratch.",
        "Kowalski": "",
        "Bryant": "Five.  Three nights ago one of them managed to break into the Tyrell Corporation.  Killed two guards and got as far as the Genetic Sector before he got fried going through an electro- field.  There wasn't much left of him, so we can't be sure.  But bio- chemical data and morphology records of the Nexus-6 were reported missing.  Going on the possibility they might try to infiltrate we send Holden in to run Voight-Kampff tests on the new employees.  Guess he found himself one.  We're using Esper -- a 231 -- that picked up Holden's alarm.  Its guess is that all five are in the city.  The Tyrell Corporation has a demo model.  Check it out on the Voight-Kampff.  There's a chance the Nexus-6 is beyond out ability to detect.  If that's the case, everybody's up shit creek.  Industrial refuse.  Bryant here.  Regarding the rundown you requested on job applicants, Esper's concluded that the only irregular category that Tyrell's got is the entertainment section.  You better get on it.  If you hurry you'll get back before it gets cold.  I got a spinner on your roof in five minutes.  Good luck.  Just because it's a Nexus 6 doesn't change procedure.  A little known fact can become a well-known fact and part of our job, Deckard, is to make sure that doesn't happen. Now how can be do that if you blow one away in front of a fuckin' audience.  Well?  Then let her get away.  I thought you were a pro -- you're supposed to be a fuckin' tracker!  I'd say you got a little carried away.  You didn't like her!?  You start liking or disliking andies it's time to hang it up.  Look, go home.  Get some rest. Take an aspirin.  This is Bryant.  Are you alone?  She's not with you?  Take a number.  Canapt 1700, tenth floor, Villa Vita District, Olympia South.  Okay, here it is.  Eldon Tyrell, his family and half his staff were just massacred.  The cat is about to get out of the bag.  Pressure is definitely on.  The Nexus program is terminated.  When you finish there, locate Nexus designated Rachael and retire.  If you don't, we will.  It has to be total, Deckard.  That's an order from as high as it comes.  Got it?  Go.",
        "Rick": "",
        "Deckard": "It was 97 degrees in the city and no hope of improvement.  Not bad if you're a lizard.  But two hours earlier I was drinking Acquavit with an Eskimo lady in North East Alaska.  That's a tough change to make.  It was so good, I didn't want to leave, so I left a day early.  Contact.  This is Blade Runner One calling Com-fast 27.  Yah, Gaff.  You know where I been.  I been on vacation.  What's up?  Bad?  I'll see you in a minute.  I-X-4-P-D referred to as a Nexus-6, The Tyrell Corporation's new pride and joy.  Holden was administering the Voight-Kampff test when one nailed him.  The Nexus-6 must be fast because Holden was as quick as they come. The report said there were six of them.  Three males and three female. Led by a combat model called Roy Batty.  They escaped from the colonies two weeks ago.  Killed twenty- three people and jumped a shuttle. An aerial patrol found the ship in the desert.  No crew.  Bryant's got a liver problem.  A couple years back he handed me a bottle and said have a drink for another man.  I been drinking for him ever since.  Six, huh?  What was he after?  You got a machine on it yet?  Where do we start?  What was the cover on the one that got Holden?  Garbage man?  Did personnel have an address on him?  I'll go take a look.  Thanks.  The big incentive to emigrate was still free labor.  If the public found out that their door-prizes might kill them, they might not be so hot to go up there.  This was one of the worst one's we had and Bryant was worried.  He wanted to tell me to be discrete or something. But I didn't give him a chance.     Machines can be helpful sometimes, but they can also be a pain in the ass.  Ask for a trace on a forger and you might wind up at a steel- mill.  I don't mind a bum-steer once in a while -- it's their personalities that usually get me.  Somebody once said that man makes machines in his own image.  If that's true, whoever made Esper should have been shot.  You equipped for random questions?  You start.  How do I stop one?  Okay, but...     I know all that.  I think we're through for the night.  Yes?  Not if it works.  The umbrella.  Every government that could was racing to populate their colonial territory.  But emigrants needed incentive.  Over-population and the greenhouse factor didn't seem to be enough; but owning a human look-a-like had lots of appeal. It was big industry, the competition was stiff and Tyrell was top of the line.  His claim to fame was making a product more human than human and sometimes the 'more' turned out to be a problem.  This wasn't just an escaped andy who broke his owner's arm -- there were twenty-eight people dead and the pressure was on.  But so far they'd always managed to keep it quiet.  Not to say that once in a while there wasn't bad publicity.  Some fanatic bitching about equal rights for andies or an occasional trade union proclaiming it was aun-American for automatons to take jobs away from humans on the colony.  But what's more American than good old supply and demand?  The Government needed them, industry made them and the church backed them.  The big religious boys said that Androids, no matter how human, were objects; only God could make people. I'm not religious, but I was inclined to agree. Otherwise I'd be out of a job.  A humanoid robot is like any other machine, it can be a benefit or a hazard.  If it's a benefit, it's not our problem.  It's artificial?  Why should I be?  You got it wrong, girl.  I work with the bureau not for them.  My job isn't to detect malfunctioning andies, it's to eliminate them.  The more the better.  Thanks.  Please.  Yes.  Go ahead.  No.  Nothing is infallible, but so far the Voight-Kampff scale bas been foolproof.  One that relies on human interpretation.  Where's the subject?  Ready.  You're given a calfskin wallet for your birthday.  You have a little boy.  He shows you his butterfly collection, plus the killing jar.  You're watching T.V. and suddenly you notice a wasp crawling on your wrist.  In a magazine you come across a full-page photo of a nude girl.  You show the picture to your husband. He likes it and hangs it on the wall. The girl is lying on a bearskin rug.  Why not?  You become pregnant by a man who runs off with your best friend, and you decide to get an abortion.  Why not?  In your opinion.  Sounds like you speaks from experience.  Last question.  You're watching an old movie.  It shows a banquet in progress, the guests are enjoying raw oysters.  The entree consists of boiled dog stuffed with rice.  The raw oysters are less acceptable to you than a dish of boiled dog.  Lights please.  If she is, the machine works.  Thirteen.  She didn't know?  Five, maybe six.  No thanks.  Discreetly.  I work alone.  Sorry.  How do you know I'm not?  I'm tired of this.  So how did I do?  No rust?  Meaning?  Yeah?  Huh huh.  True.  Nope.  Listen, I could make you a long list of complaints about this fucken city but I still rather be here than up there.  They'll change the limit before I change my mind.  Never been more sure of anything in my life.  Why didn't you go?  But if you could?  Me too.               Thanks.  Is there anything else?  I've already got more help than I need.  Sounds like I'm an ass-hole either way, but the answer is still no.  I work alone.  So?  That's okay, I'll get it...  Yeah.  I can imagine.  So why do you think they were after their records.  Right.  Night.      The possibilities were infinite. They could change their appearances but not their future. Like she said, it was short. Longevity is what they were after. The garbage man even wanted a past. Poor fuck.  I'd check it out but I knew she was right.  The market worked on turn-over.  Built-in obsolescence was the name of the game.  That meant her too.  It was something I didn't want to think about.  Yeah.  I was just about to have my dinner.  What is a conventional term?  Never mind.  Do they have that knowledge?  Okay, gimme a run-down on the three females.  Next.  Number three.  Fuck.  Taffey Lewis?  Can I come in?  I'd like  you to take a look at these pictures.  Do you recognize any of them?  What did she want?  The girl that doesn't look like that girl.  What night?  What's suck night?  You talking about the Opera House on the Main?  Book the good ones for where?  What shows?  Excuse me, Miss Salome.  I'd like to have a word with you if I could.  I'm with the American Federation of Variety Artists...  Don't worry, I'm not here to make you join -- that's not my department.  I'm an investigator for the Confidential Committee on Moral Abuses.  There's been reports of management sexually abusing the artists in this place.  You haven't felt yourself to be exploited by the management in any way?  Like to get this position.  Did you or were you asked to do anything lewd or unsavory or otherwise repulsive to your person?  Oh, yeah. You'd be surprised what goes on around here.  I'd like to check the dressing room if I could.  For holes.  It that mother real?  It's a good job.  Does it eat?  Sorry.  They have their ways of doing their dirty work without the victim knowing what's going on.  You'd be surprised what a guy'll go through to get a glimpse of a beautiful body.  Little dirty holes the bastards drill in the wall so they can watch a lady undress.  Me.  Hmmmmm?  Stop or you're dead!  Listen, Sergeant...  She was gonna get away.  I didn't like her.  Yeah.  No problem.  Gimme another.  Forget it.  It's okay.  Forget it.  I'll but you one.  What'll you have?  Shot of vodka, please.  My pleasure.  Prosit.  Sorry, don't have the time.  Those cockroaches?  How long you had these guys?  Prosit.  No thanks.  I like you too.  I gotta piss.  I think I'll piss outside.  I showed pictures.  Somebody recognized her.  I went to see.  I don't know.  Four years.  Like I said, I don't need your help.     I knew a cop once who was involved in a high-speed chase.  They shot out one of his tires and he went over a cliff at hundred and fifty miles an hour.  They found him in the morning with a broken skull, six fractured ribs and second- degree burns.  On the way to the hospital he made a play for the nurse.  Hey!  I thought you were supposed to be taking care of me.  Don't just stand there looking at me.  It's not polite.  Sit.  Gimme your arm.  You ever take a bath with a man before?            Fuck you, then.  How are you doing, old man?  Well, you don't have to worry about getting it wrinkled.  Sorry.  I'm doing okay.  Yeah. But that's what I wanted to talk to you about.  No.  I got a problem.  I think I'm starting to empathize with these Nexus-sixes.  What's that?  What about -- not sex -- but love?  These aren't just...  Thanks.     You did?  Me and my dad.  Dead.  I am.  Part of my job is to sit on a couch and try and figure things out.  Not too good.  If they are smart, they take naps.     Yeah.  Sometimes.  Wishing is a kind of dreaming.  Yeah.  It wasn't very good last night, was it?  What?  Like?  I don't know.  If there is I'd like to find it.     Hmmm?  Don't be fooled by appearances.  Because they would ruin the arrangement.  I don't like people snooping around my stuff.  There's a vacuum in the front room closet is you wanna give it a try.  Oh no, don't do that.  Never mind the plug, just go through the motions.  I don't like the noise.  Just practice.  Practice makes perfect.  I'm serious.  Go ahead.  Show me how you would do it.  How about under the couch there. Come on.  Good for a smart girl to feel stupid.  Part of your education.  I never felt better.     She'd never seen the great outdoors. Never even seen books on the subject.  She went through everything I had, and we talked. And there were subjects we didn't discuss and they were words we didn't say, I couldn't say, like death, like future, like real.  But it was hard because she was curious and full of questions.  She was more alive than anyone I'd ever known.  You mean a woman?  What's a long time?  Nope.  Nobody could stand me that long.  Yeah.  Yeah.  Who.  Got it.  Yeah.  I got it.  Because it's not.  Andies only simulate suffering -- if they're programmed for it.  No, I don't.  Don't leave here.  Don't open the door, don't answer the phone.  Just wait here.  What?  Hello, Roy.         She wanted to go to a place I knew. Out of the city.  Like one of those pictures she saw.  Where there were trees but no buildings.  We had a good time.  She told me a funny story and I taught her a song.  A song about monkeys and elephants.  And it made us laugh so hard we couldn't sing.  I told myself over and over again, if I hadn't done it, they would have. I didn't go back to the city, not that city, I didn't want the job. She said the great advantage of being alive was to have a choice. And she chose.  And a part of me was almost glad.  Not because she was gone but because this way they could never touch her. As for Tyrell -- he was murdered, but he wasn't dead.  For a long time I wanted to kill him.  But what was the point?  There were too many Tyrells.  But only one Rachael. Maybe real and unreal could never be separated.  The secret never found.  But I got as close with her as I'd ever come to it.  She'd stay with me a long time.  I guess we made each other real.",
        "Gaff": "Where the hell you been?  Next time you go on vacation, do me a favor, let us know where it is.  Holden got hit.  Severed spine.  You'd better get in here.  Bryant's waiting for you.",
        "Taffey": "Yes?  Excuse my niece there... She's studying for an exam.  Of course.  You see I lost my contacts a couple of days ago around here somewhere and my sight is a little... What am I supposed to be looking for?  This one looks familiar, but I don't know.  Naw.  There's one came in today looks a little like this one but...  Who?  Nothing.  She wanted to know about suck night.  I didn't know if I wanted to handle her -- I already got a snake act.  But my partner goes down there to the Opera House on suck night to book the good ones.  That's what we call in the trade, audition free-for- alls and most of it sucks. Bit I don't think that's her.  Lots of places.  The tours, the clubs, the Silicone shows, private parties.  Silicone Valley.  Lots of these science guys never leave that place.  We book two shows a month in there. Those big time techs and bio- guys might be real high zoners up here, but when it comes to the arts, they like it loud and lewd.",
        "Lewis": "",
        "Holden": "Don't move.    You're in a desert, walking along in the sand when all of a sudden you look down and see a...  What?  Doesn't make any difference what desert -- it's completely hypothetical.  Maybe you're fed up, maybe you want to be by yourself -- who knows.  So you look down and see a tortoise.  It's crawling towards you...  Know what a turtle is?  Same thing.  You reach down and flip the tortoise over on its back, Leon.  The tortoise lays on its back, its belly baking in the hot sun, beating its legs trying to turn itself over.  But it can't.  Not without your help.  But you're not helping.  I mean you're not helping! Why is that, Leon?  I'm great.  I mean, I know I'm not really great, but I feel just great.  How you like my new suit?  Don't make me laugh.  It makes me pee.  Hey, it's okay.  I like to pee. So how are you doing?  From what I hear you're doing great.  Bryant tells me you're going like a god damn one-man army.  Making a lot of money, huh?  Money?  Let's hear it.  I'm taking a piss.  Let me ask you something, Deck. You been having intimate relations with one of these units?  That's what I thought... one of the liabilities of the trade -- you has sex with your prey, old buddy.  That's bound to create problems, unless you're a black widow.  Love is just another name for sex. Love is sexy and sex is lovely -- I don't care what you call it, an android can't have it.  I know what they are, Deck -- Look, maybe they can pretend to feel, but far as the raw, hot emotions of the old heart -- no way.  Believe me, take it from an old pro, no matter how good we get, we're never gonna make an artificial anything that can feel.  It's a contradiction. You might as well go fuck your washing machine.  Just go out there and keep up the good work.  Got to save it, Deck, I'm getting sleepy.  It's been good talking to you.",
        "J.F.": "",
        "Sebastian": "It's gotta be right for my customer.  Soon as I finish the job.  Day after tomorrow.  Thanks, Mr. Chew.       Hey!  You forgot your...  How come you were in my truck?  You can get back in if you want...  Don't worry, I won't hurt you.  What's your name?  Mine's J.F. Sebastian.  Oh!  Where do you want to go?  You want to go home?  Oh.  Where are your folks?  What about friends?  Well, where should I take you?  We sure did.  I've got stuff.  If you wanna go to my place?           Oh!  You scared me.  I'm working.  You look... better.  Beautiful.  Yeah, I live here pretty much alone right now...  No housing shortage around here... plenty of room for everybody.  Twenty.  Methuselah Syndrome.  My glands.  They grow old too fast.  Yes.  I couldn't pass the test.  Ah, you get hold of your friends?  Good.  I can sleep on the couch.             Mr. Deetchum?  Hello?  Now, now, Waddles.  Hello, Wrigley.  Mr. Deetchum isn't taking very good care of you people.        I keep a lot of provisions right here.  Well, no, not really.  There's Mr. Deetchum, he's the watchman, he lives on the first floor.  How about breakfast, I was just going to make some.  Oh, no bother, I'd be glad to.  Okay, then.  You make yourselves comfortable and I'll bring the food right out.     You're just all so... so different.  You're androids.  You're all so perfect.  What generation are you?  Could you...  Show me something?  Like...  You mean that you can't come here and I can't go there?  Of course not.  I don't know much about biomechanics, Roy.  I wish I did, but you're out of my league.  Dr. Tyrell?  He's not really my friend.  I just do a job for him now and then.  He could?  I'd be happy to mention it to him.  No.  This afternoon.  Yes.  Thank you.  Wait!  Can't fly without the pilot.  Yes, this is someone who wants to talk to you, Dr. Tyrell.  Thank you, Dr. Tyrell.  I'll see you later.  Was everything okay?      Just thought I'd...  Someone is coming here.",
        "Roy": "",
        "Batty": "Did you get your precious 'things'?  Police.  Police man.  Why don't you have a seat.  Enjoy the view.  What's going on down there?  When?  Whoops.  Hello, glad to meet you.  Can't thank you enough, Mr. Sebastian. If you hadn't come along...  We're not used to the big city. Where we come from it's not so easy to get lost.  Well stocked.  I like a man who stays put.  An admirable thing to be able to sustain yourself in these times. You live here all by yourself, do you?  If it wouldn't be too much of a bother... a little bite to eat would be...  Well, actually  Charming.  There's only three of us left.  Not if everybody is doing their job here at home.  How are things at home?  He knows what he's doing.  Mr. Sebastian is a host who wants to be appreciated.  We'll appreciate him and he'll cooperate.  Why are you staring at us?  What, Sebastian?  Nexus - 6.  We can trust Sebastian, ladies. He's been working with mechanisms all his life.  He's a wizard and a very perceptive man.  Like what?  We're not computers, Sebastian, we're physical.  Very good, Pris.  Now show him why.  We have a lot in common.  Not only that, but we have smiliar problems.  Accelerated decrepitude. But we don't want to die quite yet.  You could help us.  If we don't find help soon, Pris hasn't got long to live.  What about your friend, the man who owns this building?  Tyrell could help us, Sebastian.  His company made us.  Be better if I could talk to him in person.  But he's not an easy man to get to.  When do you deliver your project?  Will you help us?  I'm sure glad you found us, Sebastian.  What do you think, Mary?  Pris?  You're our best and only friend.  The name is Batty.  Roy Batty.  To act without understanding could lead to the very thing the act seeks to avoid.  A little talk it all I need.  Yeah.  It might be better if we talk in private, Sebastian.  Why don't you go home.  It's not an easy thing to meet your maker.  Can the maker repair what he makes?  Had in mind something a little more radical.  Death.  I want more life, fucker.  Why?  What about E.M.S. recombination?  Then a repressor protein that blocks the operating cells.  But not to last.  I am?  I've done some questionable things.  Nothing the God of biomechanics wouldn't let you in heaven for.  Could you tell me where the bathroom is?  Where?  What's the point?  You underestimate the trap, Mary.  Where are you going, Sebastian?  No, you stay here with us.  Out last night together.  Think of yourself as a light, Mary. Shine before you're turned off.  One man. He must be good.  That wouldn't be very sporting.  Okay, but don't kill him.  Save a little for everybody.  A masterpiece.  Turn out the lights, Pris.  You wanna play?  Not very sporting to fire on an unarmed opponent.  I thought you were supposed to be good.  Aren't you the man?!  This is how we do it up there, lad! Come on!  Not hurt, are you?  You better get it up or I'm going to have to kill you.  Unless you're alive you can't play.  And if you don't play, you don't get to be alive.  That's the spirit.  Come on, Deckard, show me what you got!  I'm right here on the other side of the door.  But you gotta shoot straight 'cause I'm fast!  Straight doesn't seem to be good enough.  You don't have a chance, do you?  Looks like I'm gonna have to scale it down for you.  Give you a handicap.  I won't run through any more walls.  Okay?  I promise to use the doors.  Okay?  Come on, let's use that brain!  Think!  We need a little resilience around here!  Where are those balls of yours?! Let's see a little bravery!  That was irrational of me -- not to mention unsportsmanlike.  Won't happen again.  I'll be down the hall when you're ready.  Where you going?  No cheating.  A promise is a promise.  I'll honor the handicapped, but we gotta play on the top floor.  You go get your laser gun now.  And I'll give you a few seconds before I come.  One!  Two!  No fair jumping through holes.  You might get hurt doing that!  THREE!  Five!  Six!  Seven!  Oh, I wonder where he is.  Not in here, I don't think.  Eight!  Maybe here.  Doesn't sound like it.  Nine!  Ten!  One point for you.  Ho ho!  Try it again!  What's wrong?  Don't you like me? I'm what we've made!  What's wrong?  Aren't you a lover of Faster, Bigger and Better?!  It's time to die.  Ah!  That's for you.  Stick it in your ear and push. If that doesn't work, try the eye.  Believe me, it'll be better for you than what I'm about to do.  Well?  Crap.",
        "Bear": "",
        "Zhora": "You ever get the feeling things aren't the way they seem?",
        "Hannibal": "",
        "Chew": "Well, you're right.  This little honey has a couple of defective cones.  You're a regular perfectionist, Sebastian.  Your customer, eh?  You got a pocket-charger, boy?  Is that good enough for your customer?  How much is he paying you?  Well, when do you get paid?  When might that be?  Oh!  Day after tomorrow.  The rich hate to pay, Sebastian. A guy like Tyrell keeps you waiting. Pay the little guy last.  You should charge twice as much.  It'll make him feel better.",
        "Pris": "I was tired and didn't have any place to go.  Pris.  Hi.  I don't have one.  They left.  I have some, but I have to find out where they are staying.  We scared each other pretty good didn't we?  I'm hungry, J.F.  I was hoping you'd say that.  Whatcha doin'?  Just better.  Thanks.  And you live in this building all by yourself?  How old are you?  What's your problem?  What's that?  Is that why you're still here?  I like you just the way you are.  As a matter of fact I did.  They've got some work to do tonight, but they're gonna come tomorrow.  He's not ready yet.  Tomorrow, he says.  This is my Uncle Roy, Sebastian.  And my Aunt Mary.  And this is my savior, J.F. Sebastian, everybody.  Sebastian doesn't like to go out too much.  Well?  I want to know what's going on.  Then we're stupid and we'll die.  I don't trust him.  I don't think he knows what he's doing.  What makes you think so?  I think, therefore I am.  I want to do it.  Naughty, naughty.",
        "Rachael": "Hello, Mr. Deckard.  My name is Rachael.  It seems your department doesn't believe out new unit is to the public benefit.  But because your department can't do an adequate job in detecting the miniscule number at large, it's a problem.  Correct, Mr. Deckard?  You like our owl?  Of course not.  You're in a very unique position, Mr. Deckard.  You could affect the future of this entire organization according to how you work your little test.  Are you apprehensive?  For the responsibility of your power.  Being a police bureaucrat, you've got more than your share.  Mr. Deckard.  Dr. Eldon Tyrell.  Go ahead.  I wouldn't accept it.  Also, I'd report the person who gave it to me to the police.  I'd take him to the doctor.  I'd kill it.  Is this testing whether I'm an android or a lesbian?  I should be enough for him.  I'd never get an abortion.  That would be murder, Mr. Deckard.  It would be my child.  Ugh.  Was that your dinner?  I'm sorry.  I called and found out you were on your way home.  These were already delivered to your department but I thought you should have copies as soon as possible.  It's the Nexus information you wanted.  I know you think it complicates your work, but I'm here to help.  I think you need more help than you've got.  There's two reasons a man rejects help.  Either because he's so good at what he does he doesn't think he needs it, or he's so insecure he can't admit it.  Two of us might be more effective than one.  No you don't.  You use your equipment, don't you?  So, I'm a piece of equipment. Use me.  Do I make you nervous?  I'm sorry.  It's strange to suddenly realize that what you thought was your life is actually someone else's fabrication.  Can you?  I couldn't.  A part of me is glad.  I think I feel more.  I don't like who I was before.  They probably want to find out when they were made.  I guess the date of your birth is important if you know you're not made to last.  That's my number.  If you need me.  You better get better locks -- if you want to keep me out.  Good night.  You look terrible, you know that?  What do you need?  What do you want me to do?  There's a lot I haven't done with a man before.  You're getting me wet.  Sorry, I am not in at the moment, but if you'll leave your name and number I'll return your call as soon as I can.  I told you I'd come back.  You didn't hear me.  You were sleeping.  Are you glad I'm here?  Who is this?  Where is he?  Oh.  How come you're not on the job?  How are you doing?  What do people do in the afternoon?  Do you dream?  I wish I could.  I mean asleep.  Did you cry when your father died?  That's another thing I can't do.  Nobody is freer than when he dreams.  I read that.  I don't know, I have nothing to compare it to.  I guess I thought there was something more to it.  I don't know... I think I missed something.  I'm not sure.  Is there a secret?  When was the last time you cleaned this place?  Have you ever cleaned your apartment?  It appears to be dirty -- why don't you get somebody?  They could clean around the arrangement.  But if I don't plug it in how can  But then how can you...  This feels stupid.  You're sick, Deckard.  You and I are good friends, huh?  It's so easy.  Have you ever known anybody a long time?  Uh-huh.  Ten years.  Why do you call it retire, why don't you call it murder?  Don't you think anything that can suffer deserves to be considered?  Do you think I simulated what happened between us?  What difference will it make?  You know what I think?  That some of the folks around here are more programmed then me.  You know what else I think?  This was the best day of my life.",
        "Kaiser": ""
    },
    "imdb_rating": "8.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNzQzMzJhZTEtOWM4NS00MTdhLTg0YjgtMjM4MDRkZjUwZDBlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_QL75_UX380_CR0,2,380,562_.jpg",
    "description": "In the early twenty-first century, the Tyrell Corporation, during what was called the Nexus phase, developed robots, called \"replicants\", that were supposed to aid society, the replicants which looked and acted like humans. When the superhuman generation Nexus 6 replicants, used for dangerous off-Earth endeavors, began a mutiny on an off-Earth colony, replicants became illegal on Earth. Police units, called \"blade runners\", have the job of destroying - or in their parlance \"retiring\" - any replicant that makes its way back to or created on Earth, with anyone convicted of aiding or assisting a replicant being sentenced to death. It's now November, 2019 in Los Angeles, California. Rick Deckard, a former blade runner, is called out of retirement when four known replicants, most combat models, have made their way back to Earth, with their leader being Roy Batty. One, Leon Kowalski, tried to infiltrate his way into the Tyrell Corporation as an employee, but has since been able to escape. Beyond following Leon's trail in hopes of finding and retiring them all, Deckard believes part of what will help him is figuring out what the replicants wanted with the Tyrell Corporation in trying to infiltrate it. The answer may lie with Tyrell's fail-safe backup mechanism. Beyond tracking the four, Deckard faces a possible dilemma in encountering a fifth replicant: Rachael, who works as Tyrell's assistant. The issue is that Dr. Elden Tyrell is experimenting with her, to provide her with fake memories so as to be able to better control her. With those memories, Rachael has no idea that she is not human. The problem is not only Rachael's assistance to Deckard, but that he is beginning to develop feelings for her.—Huggo",
    "name": "Blade Runner",
    "genres": [
        "Action",
        "Drama",
        "Sci-Fi"
    ]
}