{
    "filename": "Blood-Simple_script.txt",
    "imdb_id": "tt0086979",
    "imdb_url": "https://www.imdb.com/title/tt0086979",
    "characters": [
        "Complete credited cast:",
        "Debra",
        "Stripper",
        "Private Detective Loren Visser",
        "Radio Evangelist (voice) (as Rev. William Preston Robertson)",
        "Ray",
        "Mr. Garcia",
        "Landlady",
        "Meurice",
        "Man from Lubbock",
        "Old Cracker",
        "Strip Bar Exhorter",
        "Strip Bar Senator",
        "Girl on Overlook",
        "Julian Marty",
        "Abby"
    ],
    "dialogues": {
        "Debra": "Remy.  Thanks.  ...What's a palate?  I don't follow baseball.  You won't have to. I just wanted to see if you knew.  About ten years.  Going out with Meurice.  It'll pass.  You want to hustle me. I don't want to be hustled. It's as simple as that. Now that I've communicated, why don't you leave?  Christ, I'm getting bored.  Nice guy.",
        "Stripper": "",
        "Ray": "...Hello.  ...What? Who is this?  Yeah, I'm still here.  Yeah.  Your husband.                 Yeah...  ...You get what you wanted?  Why d'you wanna leave all this?  You can stay at my place, I'll drop you there.  See a guy.  I just gotta see a guy.  Meurice. Sorry I didn't show last night.  Is Marty here?    Marty?  ...Well...? What?  Am I fired? You wanna hit me? What?  Well... if you're not gonna fire me I might as well quit.  ...I don't like this kind of talk.    I want that money. If you wanna tell me something, fine--           Who was it?  On the phone. Was it for you?  Uh-huh. So how do you know it was a he?  No, am I?  If that's what you want to do, then you oughta do it. You, uh... you want the bed or the couch?  You can sleep on the bed if you want.  You wouldn't be putting me out.  Okay.                  Like to have seen his face when he found the dead end.      What's the matter?  Door's locked. Nothing there.  ...Huh?       Yeah? What happened?       Uh-huh.  What'd he say?    ...Mm-hmm.  ...You ever get tired?                     Marty...  Marty...  What's the matter, you deaf?                                                                                                                                                                  I don't know. It's early... I love you.  I don't know. I better get off now.  Abby--     You're bad.  I said you're bad.  We're both bad.       Yeah.  ...I just wanted to let you know that everything was all right. I took care of everything. Now all we have to do is keep our heads.  I know about it, Abby. I went to the bar last night.  Yeah.  ...He didn't see me, though. Nobody saw me.  ...Is it cold in here?  I cleaned it all up, but that ain't important...  ...What's important is what we do now; I mean we can't go around half- cocked. What we need is some time to think about this, figure it out...  ...Anyway, we got some time now. But we gotta be smart.  Abby, never point a gun at anyone unless you're gonna shoot him. And when you shoot him you better make sure he's dead...  ...because if he's not dead he's gonna get up and try and kill you.  ...That's the only thing they told us in the service that was worth a goddamn--Where the hell's my windbreaker?  That ain't important. What's important is that we did it. That's the only thing that matters. We both did it for each other...  ...That's what's important.  ...What was that?       ...Pick it up.  ...Who?    ...You can call him back, whoever it was...  ...I'll get out of your way.  You left your weapon behind.                      (his back to Meurice; arranging the sheet  ...Why?            In the trunk.  ...In the car.  Isn't that what you want?  Wanna come with me?  What do you want to know?  With your gun?...  ...Nobody broke in, Abby. I'll tell you the truth...  ...Truth is, I've felt sick the last couple of days. Can't eat... Can't sleep... When I try to I... Abby...  ...The truth is... he was alive when I buried him.                                                                                           Just turn it off.    I think someone's watching.  Just leave it off. He can see in.  You think...  ...Abby. I meant it... when I called...  Because you're scared.  I need a room.  How much extra?  Just a room then.  (after shooting Kyle an irritated glance",
        "Garcia": "",
        "Landlady": "--big windows, paneleen and everytheen. So you want, like your own place? Like a Town House?  No one will bother you here, sweetie--    Oh yes...  ...That's the kitchen...  ...This is the bathroom...  ...The toilet works and everytheen...  ...And here we are back in the liveen room.  ...Good floors. Gas heat.  ...That's Mr. Garcia.  ...I was just esplaineen to him that he moved out of here yesterday...  ...You look around. Don't mind Mr. Garcia; he use do be my brother-in- law.",
        "Meurice": "Hold it, hold it. What's tonight?  What night is it?  Right. Friday night is Yankee night. Where're you from?  Right. I'm from Detroit It's a big city up north with tall buildings.  Where was I?  Yeah, well, I may be getting in over my head here, I mean you're the geologist, but my theory for what it's worth, you got all these volcanoes and each time one pops it's the equivalent of what, twenty, thirty megatons of TNT?  Enough to light Las Vegas for how long?  How many years? Course, I'm no mathematician but--  Yeah, I know. Pour 'em short.  No, he's off tonight. Where was he last night?  I don't know, didn't he call?  ...Marty, I'd like you to meet an old friend of mine, Debra. Debra, this is Julian Marty, the dude I'm always talking about.  You said the usual--    What.  Right.  What.  Right.  What.  Jack Daniels. Don't worry, I'm paying for it.  What's the point?  Where? ...I'm very careful about that.  Not really. What'd you say your last name was?  Howdy stranger.  Wasn't too busy. You missed a good one, though. This white guy walks in about one o'clock, asks if we have a discount for alcoholics... I tell him to get lost, but Marty's sitting here listening and I can tell he's thinking that maybe it ain't such a bad idea...  ...Ray, this is Debra. She's a geologist. That's the theory of rocks.  Not here tonight. Wasn't here last night. He's especially not back in his office.  For what?  Marty...  ...I thought you were dead. Going home?    We get a lot of assholes in here, Marty.  I thought this is where they met.  I am?  It won't?  ...Ever occur to you, Abby, that maybe I'm the wrong person to ask?     Any time. But you don't have to worry about a thing for a while. Marty went down to Corpus yesterday.  Marty?  Marty, ya home?  What day is it today, Angie?  Tuesday is ladies' night.  Tuesday night is ladies' night. All your drinks are free.    I hope you're planning on leaving town.  No, you do, cowboy. You been to the bar?  You shouldn't have taken the money...  ...Look at me man, I'm serious. You broke in the bar and ripped off the safe...  ...Abby warned me you were gonna make trouble. Trouble with you is, you're too fucking obvious; the only ones with the combination are me and you...  ...and Abby. Maybe. But as far as I'm concerned that only leaves one fucking possibility.  Those things are nothing but coffin nails.  ...Look. Personally I don't give a shit. I know Marty's a hard-on but you gotta do something. I don't know; give the money back, say you're sorry, or get the fuck out of here, or something...  ...It's very humiliating, preaching about this shit.  I'm not laughing at this, Ray Bob, so you know it's no fucking joke.    Abby. What's the matter?  Yeah... yeah, come in...  ...but I gotta tell ya...     ...I'm retired.  Jesus, I got a hangover. Want a drink?  Well I do...  ...For you I answer the door. If you wanna stay here, that's fine. But I'm retired.    ...Let me ask you one question...  ...Why do you think I'm retired.  ...Ray stole a shitload of money from Marty. Until both of 'em calm down I'm not getting involved.  What?! Did Ray tell you that?  That's total bullshit. Marty called me after he was jacked up...  ...I mean, I don't know where he is, but he ain't dead.  You don't look too good. You sleep last night?  All right. Just sit tight. Try to get some sleep...  ...I'll find Marty, find out what's going on.            ...Opal?          Even the fucking dog's gone crazy...  ...Something pretty fucking weird is going on. Put your coat on and I'll drop you at home. But don't talk to either of 'em until I do. And don't worry. Believe me. These things always have a logical explanation. Usually.",
        "Old": "",
        "Cracker": "",
        "Julian": "",
        "Marty": "What did you take these for?  You called me, I knew they were there, so what do I need these for?  How long did you watch her?  You know in Greece they cut off the head of the messenger who brought bad news.  No. It just made them feel better.  Yeah, don't come by here any more. If I need you again I know which rock to turn over.    Meurice.  Has Ray come in yet?    If he does come in I'm not here... What were you drinking, Debra?  You've got a very sophisticated palate.  Give Debra here another drink, and give me the usual.  Listen, I got tickets for the Oilers and the Rams next week in the Astrodome. Ever sat on the fifty yard line?  You won't have to. I'll explain what a palate is.  What's this?  Red Label.  Pour that back.  Don't throw that out.  So how long have you know Meurice?  What--Waitaminute--What...     Deuce in the corner needs help.  ...So what're you doing tonight?  Tell him you have a headache.  We don't seem to be communicating--  I own the place.  I'm not surprised, the company you've been keeping the last ten years.  What's this?  (pointing at Meurice's drink  That's not the point.  The point is we don't serve niggers here.  He thinks I'm kidding. Everybody thinks I'm kidding; if Ray comes in I'm not home.                     What \"what\"?  I don't particularly want to talk to you.  Fine. Suit yourself. ...Having a good time?  Then what'd you come here for?  Nope. She's an expensive piece of ass...  ...You get a refund though, if you tell me who else she's been sluicing.  What're you, a fucking marriage counselor?  What're you smiling at--I'm a funny guy, right, I'm an asshole? No, no, that's not what's funny. What's funny is her. What's funny is that I had you two followed because, if it isn't you, she's been sleeping with someone else...  ...What's really going to be funny is when she gives you that innocent look and says, What're you talking about, Ray, I haven't done anything funny...  ...But the funniest thing to me right now is that you think she came back here for you--*that's* what's funny.  ...Come on this property again and I'll be forced to shoot you...  ...Fair notice.    No. I think I'll stay right here in hell.  Meurice...  ...I don't want that asshole near my money. I don't even want him in the bar.             ...Lotta nuts out there.     Let's do it outside...  ...in nature.                 Got a job for you.  It's not strictly legal.  It's, uh... it's in reference to that gentleman and my wife. The more I think about it the more irritated I get.  Listen, I'm not--this isn't a joke here.  I didn't say that. Well?  What do you think?  So, uh... this wouldn't interest you.  Ten thousand dollars I'll give you.  For the money.    ...What?  I'll take care of the money, you just make sure those bodies aren't found... There's a...  ...If you want, there's a big incinerator behind my place...  Yeah. Is it...  ...What?  Yeah...  Listen, what is it? Is it done?    Want a couple?  Got something to show me first?     Dead, huh?  What did you...     ...What did you do with the bodies?  Jesus, I don't believe it...  ...I think I'm gonna be sick.     Your money, yeah.  Of course.  Don't be absurd, I wasn't about to tell anyone...  ...This is an illicit romance--we've got to trust each other to be discreet...  ...For richer, for poorer.  It's taken care of. The less you know about it the better.  ...I just made a call about that. It'll look fine.  Then you shouldn't have done it. Can't have it both ways.  ...Count it if you want.                                        ...I'm not saying you took it but the place was your responsibility and I told you to keep an eye on your asshole friend. Don't--uh, don't come to the bar tonight, I've got a meeting. But tomorrow I want to have a word with you, and with Ray--if you can find him.             Lover-boy oughta lock his door.  I love you...  ...That's a stupid thing to say, right?  No. You're just saying that because you're scared...  ...You left your weapon behind.  He'll kill you too.",
        "Abby": "...Ray?  What was that?  Ray...?  Yeah. Let's get out of here.  You kidding? I don't wanna leave all this, I just wanna leave Marty...  ...Drive me to a motel?  Where... where you going?    Hello?  ...Marty?  What?  I don't know, he didn't say anything.    ...I can find a place tomorrow, then I'll be outta your hair.  Well... the couch would be all right...  Well... I'm not gonna put you out of your bed...  ...Well, I'd be okay in here--                         Opal--              Are you sure this is... Are you sure this apartment is vacant?... Mrs. Esteves?     Looks like the state legislature is out of session.  Listen Meurice, you're gonna help me with a problem.  You're gonna keep an eye on Marty and Ray, make sure nothing happens.     Thanks, Meurice.  He's in the house.  I could've sworn I heard something.  I knew it. 'Cause we wouldn't have heard anything if it was him. He's real careful. Fact is, he's anal.  Yeah, he told me once himself. He said to me...  ...\"In here, Abby. In here... I'm anal.\"  I couldn't believe it either...     ...Me on the other hand, I got lots of personality...  Marty always said I had too much. 'Course he was never big on personality...  ...He sent me to a psychiatrist to see if he could calm me down some.  Psychiatrist said I was the healthiest person he'd ever met, so Marty fired him.  Well, I didn't see him anymore, I'll tell you that much.  I said, Marty, how come you're anal and I gotta go to the psychiatrist?     Nothing. He's like you, he doesn't say much.  Except when he doesn't say things they're usually nasty.  When you don't they're usually nice.  Huh? Oh, yeah, I guess. Mm-hmm.  (through phone; sleepily  Ray?... What time is it?  ...You all right?  Okay, see ya... Thanks, Ray.          ...What?         Why didn't you get into bed?  Yeah...  ...You called me this morning.  ...What do you mean?  What happened?--Was Meurice there?  Well... what happened?  Ray--  What the hell happened, Ray?  I don't know what you're talking about.  I... I mean what're you talking about, Ray? I haven't done anything funny.       How can I be lying if I don't even know--  ...I mean if you and him had a fight or something, I don't care, as long as you...  What.    Marty.  ...What's going on with you two?                                                                   Ray...?  I... I love you too.                        Ray.  ...Where is everything?  ...You leaving?  ...But first I gotta know what happened.  You broke into the bar. You wanted to get your money. You and Marty had a fight. Something happened...  ...I don't know, wasn't it you? Maybe a burglar broke in, and you found--            I... I'm sorry, Meurice. I gotta talk to you... Can I come in?  No, I--  Something happened with Marty and Ray--  No Meurice, it's worse than that. Something really happened, I think Marty's dead--  Sort of...  Meurice--  Meurice, you gotta help me...                 Ray...        ...So?  So what'll they see?       ...I love you too.                              Ray--  (groping for the words, in Spanish                                                                                                         ...I ain't afraid of you, Marty."
    },
    "imdb_rating": "7.5",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZmI5YzM1MjItMzFmNy00NGFkLThlMDUtZjZmYTZkM2QxMjU3XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_QL75_UX380_CR0,8,380,562_.jpg",
    "description": "Texas bar owner Julian Marty, who is generally regarded as not a nice person, hires shady private detective Loren Visser, who is able to obtain what Marty requests evidence - in this instance, photographic - that his wife, Abby, and one of his bartenders, Ray, are having an affair. As Ray and Abby realize that Marty has found out about them, it allows them to plan for their future away from Marty, while being up front with Marty about the situation. Marty, in turn, decides to hire Visser once again, this time to kill Abby and Ray, and dispose of their bodies so that they won't be found. The out-in-the-open affair and the contract hit lead to some actions based on self-interest and a standoff of sorts between the four players, which is compounded in complexity by some wrong assumptions of what has happened, with an innocent bystander, another of the Marty's bartenders, Meurice, potentially, and unwittingly, adding to the scenario.—Huggo",
    "name": "Blood Simple",
    "genres": [
        "Crime",
        "Drama",
        "Thriller"
    ]
}