{
    "filename": "Blue-Valentine_script.txt",
    "imdb_id": "tt1120985",
    "imdb_url": "https://www.imdb.com/title/tt1120985",
    "characters": [
        "Charley",
        "Marshall",
        "Jo",
        "Gramma",
        "Dr. Feinberg",
        "Jerry",
        "Jamie",
        "Mimi",
        "Bobby",
        "Cindy",
        "Frankie",
        "Dean",
        "Checker",
        "Professor",
        "Glenda"
    ],
    "dialogues": {
        "Charley": "Cheer up man. God wants you to be happy.",
        "Marshall": "",
        "Jo": "You're gonna have to speak with Mr. Saned, honey. Wait just a minute, okay. Dean sits on a chair, smooths his hair, smells his clothes.  Dean... Telephone. It takes Dean a while to get up, but he does. And it takes him a while to get to the office where his phone call awaits. Once there, he holds the receiver in his hand for a beat...",
        "Gramma": "Come lord Jesus, be our guest, and let Thy gifts to us be blessed. Amen. Glenda, Jerry, Gramma Francis and Cindy sit around a dining room table. Glenda slices a knife through a greenish meatloaf. She serves a watery slice to Gramma.  Thank you. Glenda averts her eyes. She cuts another slice. Cindy offers Glenda her plate. The meat breaks apart and half of it lands on the table cloth. A brownish-green oil.  Don't get my hair.   What is it? Blue Valentine Official Green Script as of 6/9/09 30A.  Glenda... I mean Cindy... can I have a cigarette?  Cindy. Have you got a cigarette!  He went out for groceries.  Who? The conversation moves in circles. Not much information is gained. Dean ends up just holding her hand.",
        "Dr.": "Do you want to take over from here? Cindy places her hand on the sensor. Feinberg places his hand over hers. They gently glide it over the abdomen. Blue Valentine Official Green Script as of 6/9/09 7.  Easy. Feinberg releases Cindy's hand and removes his latex gloves.  Very good, Cindy. You're in good hands. Cindy is one of our favorites. Cindy blushes. She is transfixed on the monitor.  Busy. Haven't sat down yet. Walk with me. Cindy's holds her clipboard to her chest. He tilts it down with his finger.  What do you have?  Uh huh. I'll be in in a minute. By the way, I was thinking about you.  Yeah, well I can understand how you might not be able to relocate your whole family up to Riverdale, with your daughter being in school and everything. But, I was thinking, maybe, you could get an apartment. Work during the week, drive down on weekends. They arrive at a door, Room 220. Blue Valentine Official Green Script as of 6/9/09 72.  You wouldn't have to worry about being alone... We could hang out together. Grab some dinners sometime. Cindy blushes and then her brow furrows.  It's not a proposition, I'm just trying to help.  Cindy. What's going on here? Cindy points to Maria.  I can take over from here. He talks to Maria calm and clear.  Hello Mrs. Guevara. I'm Dr. Feinberg. I'm your DOCTOR. Let me see. It's OK. He reaches for the trembling Maria's blouse. Maria flinches.  Out! He turns back to Maria and places his hand on her shoulder.  It's going to be alright, Mrs. Guevara. Cindy backs out of the room. Blue Valentine Official Green Script as of 6/9/09 74.",
        "Feinberg": "There you are. Cindy places the flyers in her folder in a rush.  You got a second? Did you get a chance to talk it over with your family yet?  I don't have to tell you, it's a huge opportunity...  All right, Monday's our day. I want the A team up there with me. Talk it over. Feinberg walks away down the hallway.  Do you want to take over from here? Cindy places her hand on the sensor. Feinberg places his hand over hers. They gently glide it over the abdomen. Blue Valentine Official Green Script as of 6/9/09 7.  Easy. Feinberg releases Cindy's hand and removes his latex gloves.  Very good, Cindy. You're in good hands. Cindy is one of our favorites. Cindy blushes. She is transfixed on the monitor.  Busy. Haven't sat down yet. Walk with me. Cindy's holds her clipboard to her chest. He tilts it down with his finger.  What do you have?  Uh huh. I'll be in in a minute. By the way, I was thinking about you.  Yeah, well I can understand how you might not be able to relocate your whole family up to Riverdale, with your daughter being in school and everything. But, I was thinking, maybe, you could get an apartment. Work during the week, drive down on weekends. They arrive at a door, Room 220. Blue Valentine Official Green Script as of 6/9/09 72.  You wouldn't have to worry about being alone... We could hang out together. Grab some dinners sometime. Cindy blushes and then her brow furrows.  It's not a proposition, I'm just trying to help.  Cindy. What's going on here? Cindy points to Maria.  I can take over from here. He talks to Maria calm and clear.  Hello Mrs. Guevara. I'm Dr. Feinberg. I'm your DOCTOR. Let me see. It's OK. He reaches for the trembling Maria's blouse. Maria flinches.  Out! He turns back to Maria and places his hand on her shoulder.  It's going to be alright, Mrs. Guevara. Cindy backs out of the room. Blue Valentine Official Green Script as of 6/9/09 74.  What the hell is going on!? Dean turns and takes a blind swing at Feinberg. One blow and Feinberg reels against the metal lockers. He hits the ground with a thud. His nose gushes blood. Dean paces around Feinberg like a caged animal. He pulls down a locker with his hand. It crashes to the floor. Cindy kneels over Feinberg.  You're done. Leave. Dean jerks Cindy up off the floor.",
        "Jerry": "...Want me to show you a magic trick? Here's how you turn the grass green. You can teach it to your dad. The sprinkler jets on. Cindy comes up and kisses her dad on the cheek. She straightens Frankie's ears.  Wait...! OK...one, two, three GO! Frankie runs to Dean, dodging the water stream. She hugs his leg. He picks her up.  It got you! Go right! OTHER RIGHT! Dean and Cindy both laugh. Their eyes meet for the first time in days, maybe weeks. They exchange a brief smile, filled with mutual love, pride and respect - connected by their little girl. Frankie stands in front of Cindy, water drips from her bangs.  Get that fucking dog out of the kitchen!  Come lord Jesus, be our guest, and let Thy gifts to us be blessed. Amen. Glenda, Jerry, Gramma Francis and Cindy sit around a dining room table. Glenda slices a knife through a greenish meatloaf. She serves a watery slice to Gramma.  What'd you do to meatloaf? Huh?!  Are you kidding me? How long does it take to make a meatloaf? Five minutes? You mean to tell me that you didn't have five minutes to make a meatloaf? I been up since six this morning busting my fucking ass and you don't have five minutes to make a meatloaf?  Nice?  Well, what gave you the idea that any of us needed a change? Did you ask for a change? Cindy? She doesn't ask for anything... She doesn't talk. You didn't ask for a change, did you mom?...She can't hear! And I don't remember asking for a change. So, it was you, wasn't it? You wanted a change. I work all day so you can sit on your fat ass, thinkin' about yourself. How you'd like a change. Blue Valentine Official Green Script as of 6/9/09 27.  Sorry? What good is sorry now?  I want you to enjoy your fucking dinner. He storms out of the dining room. Glenda, Cindy and Gramma sit in silence. Cindy takes a bite.  Tell him to take off his shoes. Dean removes his boots. A toe wiggles out of a holey sock. He gathers the hole and tucks it between his big toe and his second toe. Cindy leads him by the hand to the kitchen.  ...She's going to struggle the rest of her Goddamn life with that fucking loser. And that's okay with you. Sit there...sit there on your fat ass don't do a goddamn thing.  She was good. Are you OK?  I don't know what happened up there. But please Dean, come on. Don't push it. Let it be... Dean closes the screen door behind him and locks it. Jerry pulls on the door.  Hey! You can't lock me out of my own house! Dean calls back.  I don't have my oxygen! Hey! Blue Valentine Official Green Script as of 6/9/09 84.",
        "Jamie": "",
        "Mimi": "You need to fill that out, sir. You can go over there. Mimi returns to the phone.  No, you need to fill it out, sir. Bring it back up to me when you're done.  Who's your wife?  Are you Dean?  I'll be right here. Don't let him brainwash you again. Blue Valentine Official Green Script as of 6/9/09 76.  Oh my god. Call 911. I'm going to call 911. The doors slide open and Dean backs outside.",
        "Bobby": "Is that Cindy Heller? Cindy turns and sees BOBBY ONTARIO, her college sweetheart. She lifts the glasses on her head, blood rushes to her face.  ...So, you been faithful to him?  I'm a strange person. Cindy laughs.  No seriously.  Yes you have or yes you haven't?  I'm not looking at you like anything.  It's hard to be faithful. I don't know if monogamy is possible, especially if you're a man...  This is Taylor. He's two. Got a little girl at home. Irene.  Kids are great. They pick up on things so fast. Like watch... Hey Spence, give me five... Give me five, buddy. Drooling, and with a toothless smile, Taylor gives his daddy five. Bobby beams.  Give Cindy five. Taylor holds up his hand limply so that Cindy has to give him an awkward five. Bobby laughs. They reach the register.  To see yourself in your kid's face... I never experienced anything like that.  How's your kid?   No, you go...  What's her name?  I got it.  You can get me back.  What are you doing?  You're supposed to be a quadriplegic?  Don't I give you enough attention? He presses himself into her and mauls her with a wet kiss.  Wonder what people would think if they saw me making out with a paraplegic? He lifts her expensive necklace out from under her dress - looks at it admiringly. Then, Cindy.  Can you come over?  Gimme a sec. Bobby tries to hide the erection trapped in his wrestling singlet. Blue Valentine Official Green Script as of 6/9/09 25.  55 55    Shit. She stops moving, feels him shrinking inside of her.  I couldn't help it. She gets out from underneath him.  I couldn't help it... You felt too good. Cindy is white, tries to contain her terror. She disappears into the BATHROOM. Bobby sits up. BOBBY  (cont'd) Don't trip. It'll be OK...OK? Bobby lies back, frustrated, and buttons his pants.  56 56     It's your fault. You felt too good. She sees her underwear lying by the base of the bed. She goes to grab them, but Bobby snatches them away. Blue Valentine Official Green Script as of 6/9/09 30.  Say you're sorry! Cindy picks her pants up off the floor - pulls them on.  I was just joking! God!  Hasn't anyone ever been nice to you? She takes the flowers, pushes Gramma into the house. The screen door closes between them.  Don't make me give up on you...  I just want to say to you thanks for making all bets off and freeing me of my human decency. All your shit's going in the trash, your books are gonna be ripped up. We'll go to war see who'll win. I know who the fucker is and I'm gonna destroy him. BEEP You probably don't know what you did. I want it all to come out. It'll be beautiful, It'll be sweet, it'll be awesome. BEEP Glenda's bloodshot eyeball appears in the doorway. Bobby  (cont'd) BEEP Well, what I was really trying to say before your machine cut me off is you created me, I'm your child... You created the person that I am now, and now you have to deal with this person. A SOUND - Cindy turns around sees her mom in the doorway.  ...And I got nothing better to do than destroy you both. BEEP If you think I'm being evil, you have no idea, no idea at all... I'm growing very impatient and I really don't give a fuck anymore... Bobby shotguns a beer in the passenger's seat. Speed metal music and adrenaline. The car blasts down the street to the storage facility. The three bound out of the car, fists clenched, geared up for ultraviolence.  Hey faggot! Dean continues his work.  Is your name Dean?  Think I'm dumb? Think I'm that dumb? Dean struggles to breathe but manages to say...  Fucking faggot! - Troy and Tony watch the door and egg Bobby on. - THE PHONE RINGS OFF THE HOOK in the EMPTY OFFICE.  Stay away from her!",
        "Cindy": "I'm sleeping!  C'mon, eat, you can't be late today. Frankie takes a tiny bite and makes a sour face.  Come on Frankie, use a spoon. You know how to use a spoon.  Frankie! We're leaving in 15. Eat! Frankie ignores her.  Alright... She pulls Frankie out of her seat and carries her under one arm to the back room. Frankie protests. Dean watches, shakes his head. He sees the computer on, Cindy's e-mail is still open. He shuts off the running water. He scans through messages from a bunch of names of people Dean doesn't know. He sweats, clicks open a return message from a real estate company - apartment now available.  Look up for mommy... come on Frankie! We're gonna be late... look up. Frankie is propped up on the sink. Cindy draws cat whiskers on her cheeks. Frankie tips her head back. CINDY  (cont'd) Don't blink... leopards don't blink...  ...Love you. Dean pulls his head out of the window.  Sorry...I'm almost done. Blue Valentine Official Green Script as of 6/9/09 5A.  Yeah... I'm going to. Blue Valentine Official Green Script as of 6/9/09 6.  I know I know. I should know for sure by Monday.  I will.  Do you want to know the sex?    Oh no... She pulls the car to a stop, puts on the hazzards, takes a moment to compose herself, unbuckles her seatbelt. Gets out. ELLIPSE: A blanket covers a dead Border Collie mutt in the gutter. Cindy puts Megan's body into the back of her van.  Did I miss her?  It was alright... Busy.  I found Megan.  Over on Urbandale... near Spur.  Aren't you coming up? Dean gives a sour look and lights a cigarette. Blue Valentine Official Green Script as of 6/9/09 9A.  He's an old man.  Go say goodbye to Daddy. You're not going to see him until tomorrow. Jerry holds Frankie back. Blue Valentine Official Green Script as of 6/9/09 10.  Come on silly. Let's go in and get dry.  You don't have to. Let's just go in. Cindy leads Frankie with one hand and pulls Jerry's oxygen tank with the other. Jerry takes Frankie's free hand. Dean smokes and watches... Cindy hold the screen open with her foot and maneuver father, tank and child inside. The screen door closes. Sammy barks at Dean through the screen door. He tugs his smoke, memories flood. He drifts...  What are we going to tell her?  She would have wanted to say goodbye. Blue Valentine Official Green Script as of 6/9/09 16.  What are you doing?  You're crazy.  Bobby Ontario?  That's a strange question to ask someone you haven't seen in forever.  Yes.  Yes...I haven't. I mean I have...I have been...Why are you looking at me like that?  Oh OK.  Who's this?  Wow... Blue Valentine Official Green Script as of 6/9/09 19.  I know... There is an uncomfortable silence between them. Cindy starts to unload her purchases.  I'm really happy for you.  She's good. Pause. They speak at the same time.   You go...  Oh... I was going to say, you ask her what kind of hair she's got and she says, a bob. It's pretty funny. Blue Valentine Official Green Script as of 6/9/09 20.  Frankie. Fumbling, she starts bagging her groceries.  Oh...I'm sorry. Cindy searches her wallet, goes into her change purse.  How much was the vodka? The Checker looks at the receipt.  Can I put that back? I'm sorry... Bobby holds out a twenty dollar bill.  Nothankyou. Just take it off please. Bobby drops the bill on the scanner.  Let's go.  Isn't it funny how you can be driving for 20 minutes and it feels like you've only been driving for 20 seconds. The time just gets swallowed up somewhere... Dean places his hand on Cindy's hand that rests on the car seat. A small squeeze. She squeezes back. Dean looks at her with tenderness. Her eyes are on the road. She lifts her hand to the wheel. Dean reaches for the radio.  I was kind of enjoying the silence.  Think so.  There should be some fig newtons back there. Dean unbuckles his seatbelt, crawls to the back of the van digs through the bags. Cindy can't see out of the rear-view.  You have to look. Blue Valentine Official Green Script as of 6/9/09 23.  I have to pee. The car stops on the shoulder of the two lane highway. Cindy gets out of the car.  I gotta go. Cindy jogs across the road. Dean sees traffic coming.  ...Hello? She stands up and zips up her pants. Eyes search the shadows. ...Cindy is ALONE. A leaf falls to earth. She stares at it and her mind drifts back to...  Research.  Quads can't use their arms. I'm a paraplegic.  I can't. I have to go get gramma. Cindy rolls the wheelchair back.  Get down Napoleon! Get down! GLENDA HELLER - 50's, desperate - peeks her head out of the kitchen. She holds a coffee mug filled with gin on the rocks.  Just us. Cindy kisses her mom on the cheek, can smell the alcohol.  It's OK mom. Blue Valentine Official Green Script as of 6/9/09 26.  It's not bad.  52 52    Shit!  Give em! Cindy presses her lips together. She leaps at Bobby and squeezes his crotch and gets her underwear back. Bobby's face turns vicious. He snatches them back aggressively.  Take a deep whiff, you fucking douchebag! She tears off his necklace, throws it at him, slams the door.  It looks like you have a new neighbor. Cindy returns to the book, but there is something about the mover that has captured her attention. She can't stop watching him every time he passes her door.  No, Gramma, you're in bed now. It's bedtime. Do you want me to keep reading? Gramma nods. Cindy turns the page, looks up, sees Dean lift the old man over the threshold and into the room.  Okay, shhh. But you gotta be quiet. Cindy gets up and opens the window. She turns on the fan, digs in Gramma's purse, gets a cigarette and a lighter. Cindy walks to her gramma's door, sees Curtis walking away from the old man's room.  No.  Like what?  Are you trying to pick up on me?  Hi Dad. We're here... It's kind of crazy. I don't know, should I feel bad? Dean trots back into the BATHROOM. He is screaming like a hyena.  ...it's just Dean... he's losing his hair. What are you guys doing?  Lemme talk to the little one.  Did Pa make you something to eat yet? ...Frankie? ...What'd you and Pa eat? ...Was it cooked all the way through? No pink in there? ... Dean walks up from behind, putting on a clean, white T-shirt. He snaps his fingers at Cindy. Cindy swipes his hand away with more force than necessary.  Okay sweetheart, your daddy wants to talk to you. I love you... love you... Don't forget to brush your teeth tonight okay. Okay? Here's your dad. Cindy sets down the receiver and walks away. Dean snacks on tortilla chips and picks up the phone. Blue Valentine Official Green Script as of 6/9/09 33.  What does it look like I'm doing?  It's fine.  Fine!  Close the door! Dean closes the door, remains in the BATHROOM, watches his naked wife, removes his clothes. Cindy does a double take.  What are you doing? Dean pulls back the shower curtain and steps in.  Dean. The small shower presses them close. Dean's smile infects her. He leans over, they kiss. Brushing lips at first. Dean presses closer. Cindy pulls back and pivots him around until the stream of water catches his body. He leans his head back, the water pours over his hair and face. He places his hands on Cindy's hips and pulls her close to him. Cindy hands him a bar of soap. He builds a gentle lather. Cindy inches back, turns around. Dean lathers her back, slow and languid.  What do you remember?  Okay. Cindy grabs under his armpits. He refuses, but she wins. She pivots them around again. Standing in the stream of water, Cindy washes the soap off her body, eyes closed, head back. Dean reaches for her and follows with his fingertips the flow of water down the front of her body.  Give me the soap. She forms a quick lather in her hands. She rubs it into his chest, her strong hands making circles of suds. Dean is a tranquil participant. She lifts up his left arm, scrubs his armpit, then his right. Her hands build a lather and wash his penis. Dean catches his breath.  Turn around. Dean obeys. She continues wash his back, buttocks and legs and stops. Dean turns around to Cindy who holds a squirt of shampoo in her hands. She reaches up and scours his head.  Your hair is not falling out. Cindy pivots him around into the water and rinses him.  You're crazy you know...  Okay, get out. I have to finish washing myself.  No. Go order dinner. I'm hungry.  Grump. Grump. She makes 2 drinks - vodka on the rocks. She hands Dean his drink.  Why don't you put some music on Dean? She pecks him on the cheek, walks to the bedroom to change.  80    Hi.  I think he passed away. Dean feels for the locket around his neck. He shakes his head.  She was pretty too.. Dean thinks about the old man. The bus drives.  Why do you say that?  Excuse me?  Home. The bus slows. She gets up to leave. Doors open. Blue Valentine Official Green Script as of 6/9/09 42A.  We passed it.  Back there... Dean looks back. He sees a bunch of houses that all look the same. They keep walking. ELLIPSE: Cindy smokes one of Dean's cigarettes, calls her dad  No.  Books. Mostly.  We'll see.  I'm trying to get into med school. Blue Valentine Official Green Script as of 6/9/09 44.  Someday.  Don't do it.  You wanna put on my lotion? Dean nods, applies a little lotion to his fingertips, rubs it in circles on his hands, applies it to his forearms, neck, face. He enjoys the feeling of it, offers her some. She say's no. He digs through her purse and finds lip balm, smells it.  Are you fucking with me?  Okay enough...  Because. Throughout the rest of the night Dean tries to continually steal Cindy's purse from her. It is a game. Innocent.  90 90   Aren't you gonna miss your train?  You are just gonna stay up all night?  Here.  Same streets. Same people. Everything here is the same. You walk down the street, you can't get lost... you know. . Blue Valentine Official Green Script as of 6/9/09 46.  There! Cindy runs to an old, creaky merry-go round, jumps on.  I used to love these things.  Push me. Dean is tentative, but goes along with her. He starts slow, but she eggs him to go faster. He runs in circles picking up speed until he is in a breathless, circular sprint. He can't keep up with the centrifugal force.  Get on! Dean does as he's told. They both hold on for dear life. The world spins in a frenzy. The dread on Dean's face builds to insane laughter. It is super fun. Cindy screams. Her hair snaps in her face. Then, a look of sickness steals her smile away. She wants it to stop, which, slowly, it does. She gets off first, tries to walk, but is too dizzy. She just keeps falling to the ground. Dean crawls off the merry-go round on all fours, laughing. Blue Valentine Official Green Script as of 6/9/09 47.  Make it stop.  I'm still spinning.  Maybe it's just the Earth that's spinning.  We're toasting tonight? Dean makes his toast. CLINK. Dean quaffs his glass.  Sometimes you don't make any sense. You might as well be speaking Chinese. Dean imitates a Chinese man - it goes on too long.  Happy belated anniversary. Cindy starts to eat a spread of Indian food and booze.  Good. How did Frankie sound?  She didn't sound sad?  Daddy's little girl.  That's beautiful.  Why don't you do something...  I don't know... isn't there anything you want to do? Dean thinks about it. Shakes his head.  I don't know... You have so many things you could do. You're good at everything. You could do anything you wanted.  Like right before the bear eats the man?  How different we are. You and me.  It's a good thing.  Absolutely. We don't have to get in each other's way.  I didn't say that. What I meant is that it's important for us to have our space. That's all. We're grown people.  You know, we rarely sit down and have a conversation. An adult conversation. Because every time we do, you turn something that I say around and make it mean something that I didn't mean to say. You just blab. Blab.  Good luck. I just want you to think about what you say sometimes instead of saying what you think all the time. Blue Valentine Official Green Script as of 6/9/09 51.  I think my glass has a hole in it. Cindy cuts around her food and pushes a piece aside.  It's fat.  I don't want to. You eat it. Dean stabs a piece of fat and pops it into his mouth.  That's going straight to your tits.  Shiiit. I bet you a nickel you can't even beat me at arm wrestling.  Ready?  On the count of three... One... Two... Cindy flexes and starts.   I'm alright. Blue Valentine Official Green Script as of 6/9/09 53.  Ow ow ow. Dean leads her to the kitchen, holds her hand under the faucet.  It stings a little. Dean tries to pick up Cindy. She struggles against it. Finally he cradles her like a squirming baby.  No, no... Put me down. It's okay... Dean huffs a little. Cindy adjusts her weight, self- conscious. He hefts her down the hallway to the bedroom.  I'm spinning. She sits up. They toast. Dean gulps his. Cindy takes a sip.  What are you doing in there? ...Dean?! An agonizing moan comes from down the hall. Cindy staggers off the spinning bed and stumbles to the bathroom door.  Are you all right? Dean... She pushes the door but it is blocked. Dean moans louder. Cindy pushes again and inches it open. She sticks her head in, sees him laying on his back looking up at the ceiling.  Ew. Come on, get up.  What?  Dean... Come on, it's time for bed.  You're drunk. Blue Valentine Official Green Script as of 6/9/09 56.  No... Dean... Wait a second. She removes his hand and places it on her hip. Dean continues to kiss her neck. He slides his hand up to her breasts. Cindy turns her head in the other direction. She pushes his hand away. He brings it back aggressive. Again. Cindy squirms underneath him. He grabs her wrists and holds her arms over her head. His tongue licks Cindy from her breasts to her face. She worms her arms away and grabs onto his hair. She arches her back, looks at him through slit eyes. His pelvis pulses and he moans. He looks up at her over his brow into her desperate eyes. He springs up. Sweat beads on his forehead.  Stop... stop... stop...  Are my hands cold?  You wanna go somewhere.  Where can we go?  Is your roommate awake?  Do you think he's gonna come out?  You think he's gonna go to sleep now? They hear Jake changing channels in the other room. As quietly as possible, they have sex under the sheet.  Just a second... She wraps the test in toilet paper and buries it in the trash receptacle. A moment while the door swings closed. Silence. Cindy opens the stall and confronts herself in the mirror.  Give it back! Bobby crushes the card in his fist. She tries to pry it open. She can't. She's not gonna get it back.  I... I don't know... It might be...  ...I'm sorry...I'm sorry...  Before us.  I don't know.  It's not the right time. Dean looks down, pauses and looks back to Cindy.  Okay... The DOCTOR wheels over to the table in the center of the room. She pulls out a clean sheet of examination table paper.  Yeah. The Doctor touches Cindy's knee to spread her legs, picks up an instrument off the table.  I'm a student...  I'm studying to be a DOCTOR...  What's that?  Because... I always thought... it would be wonderful to take a sick child and... Cindy cuts herself off. The Doctor holds a hose.  ...heal them...  Wait... wait.  Your eyes ever wide open, and you're dreaming? Cindy breathes deep &amp; settles into him. Dean hums a lullaby.  You smell like you.  Shit. She drops it and rolls over. The digital clock reads 4:52... Moments later... she is on the phone. CINDY  (cont'd) Hi it's Cindy... I have this weekend off. Cindy unwraps the bandage on her hand. She presses the four vampire bites to her lips. Blue Valentine Official Green Script as of 6/9/09 64.    Goodbye. No response. She closes the door behind her.  114 114    Mediplex... You are going to need to come in... We're going to need to see him... I can't diagnose over the phone... About 20- 30 minutes... Okay? ...okay, bye... Cindy hangs up. She holds a clipboard. CINDY  (cont'd) Maria? A Hispanic women, MARIA GUEVARA - robust, 50's - clutches her purse and rises off a waiting area chair. Cindy smiles.  Right this way.  Have a seat on the table, Mrs. Guevara. Maria has a blank look.  Do you speak English? Hablas Ingles? Maria holds her fingers up, indicating an inch.  Poquito?  Yo tabien. De donde eres tu?  So...Tu famalia esta aqui? Here?  They're in El Salvador?  Uh...Sola...Alone.  But hopefully not lonely. Maria hides her face with her hand and lets out a self- pitying giggle. Cindy looks at her clipboard.  So you're feeling some pain in your left breast. Uh...Tu dueles en tu chiche? Blue Valentine Official Green Script as of 6/9/09 71.  Well let's take a look. Cindy hands her a paper robe.  Can you take off tu ropas and pongas... put this on? Okay? Comprende? Maria nods and takes the robe. Cindy turns to leave.  Lo siento mi Espanol es muy mal.  A woman in 215. Hispanic. 53. Lives alone. Complaining of pain in her left breast.  Oh yeah?  I'm married.  I don't remember asking you for help. He holds up his hands and leaves Cindy alone in the hallway. She looks at the ground, turns around and walks to Room 215.  What's the problem, Maria? Tu sabes? Cindy pantomimes undoing her shirt.  No comprende? Necessita take off tu comisitas. Your shirt. Understand? Maria nods and undoes her blouse. Cindy turns her back. Maria sits slumped with her blouse opened. Cindy pantomimes removing her shirt fully. Maria does so and sits with her hand covering her face. Cindy gestures to her bra.  Por favor, Maria. Come on. Maria unhooks her bra. A purplish cantaloupe-size abscess grows on her left breast. Cindy's covers her mouth.  Oh my God. Jesus Christ. Maria... Maria puts back on her blouse. Blue Valentine Official Green Script as of 6/9/09 73.  Maria! Que eso? Why didn't you come in sooner? Why did you wait this long?! Eso es muy mal. Very bad. Maria starts to cry.  How could you look at yourself in the mirror and pretend it's not there? How long have you been pretending? Dr. Feinberg walks into the room.  Her breast. Her breast! Dr. Feinberg takes Cindy's clipboard from her hands.  It's probably been growing for years! Dr. Feinberg turns to Cindy.  Dean?  I can see that. How'd you get here?  Frankie's fine... Dean nods. He looks over Cindy's shoulder at Mimi.  We're not going to do this here. Cindy crosses the counter, grabs the bags by Dean's feet. CINDY  (cont'd) Give me a few minutes.  Live your life. Cindy walks out of the clinic hefting her bags.  Help me. Dean grabs the remaining luggage and follows, throwing back a look to both Mimi and the Gang-banger.  Are you drunk?  Can you drive?  No, you go. Take the car home. She hands him the keys.  You know how many sacrifices I make every day.  I never asked you to! I can't take this shit anymore. Cindy enters through the electric doors.  You're right Dean, I can't take the truth...I've had it with the truth or whatever it is you make up along the way and label as truth... You win. I give up... I've been lying to you for a long time.  It's me, Dean. I didn't want to hurt you. But I'm not the person you fell in love with. And you won't let me be anything but that person. That's why I can't look at you. Because every time I do I can't stop thinking about how much I want you to hate me. But you're too stupid to see it, and too chicken shit to do anything about it. Blue Valentine Official Green Script as of 6/9/09 78.  I don't love you anymore... Why can't you stop loving me? He pulls back his fist and swings, hitting the metal locker behind Cindy's head. He repeats the blows with thunderous rage. Feinberg enters the room.  I'm sorry. I'm sorry. Let me see.  You son of a bitch! Punches catch him in the nose. Cindy bullies Dean backwards with repeated shoves to the chest. He backs up down the hallway. Mimi stands in the hallway.  Give me the keys. Blue Valentine Official Green Script as of 6/9/09 79.  I want a divorce! She has emptied herself. Her whole body is numb and it feels as if she is floating in space. Anger overcomes Dean. He hits the dashboard with concrete fists.  Oh God. Cindy squeezes by her father to Dean. The expression on her face says it all. Dean hands her the flowers, leans in and kisses her. While he's there he whispers.  Are you okay? Dean nods. She leads him down the hall. Jerry stops, turns.  136 136     Does that hurt.  Why? They'll stop soon.  Good. Cindy goes over to her stereo and turns on some music, low - it is the same song that Dean and Cindy listened to in the moon room. It drowns out some of the fighting. She approaches him, starts unbuttoning his shirt.  Promise me one thing... you'll never let me become an adult. Blue Valentine Official Green Script as of 6/9/09 82.  That motherfucker. She kisses his chest. Dean starts getting underneath Cindy's clothes. He places his palm on her belly.  I love you too.  Yeah. From here on out, their actions increase with urgency. Each moment that goes by makes them more and more desperate to feel the other's skin. They are down to their underwear when they hear a door slam downstairs.  They never come in here. They make sweet love.  Who had candy for breakfast? Blue Valentine Official Green Script as of 6/9/09 83.  How was Frankie?  I'm OK. Cindy kisses her father on the cheek, closes the screen door.  I'm not coming home. Fear strikes Dean. He presses the base of his palms into his eyes, rubbing until he sees stars.  I am thinking about her.  I can't let her grow up in a home where her parents don't love each other.  144 144    Let her go, Dad. Jerry releases her and Frankie runs fast to Dean. She jumps at him to go into his arms. He doesn't pick her up. From the porch Cindy and Jerry watch Dean as he points to them. Frankie doesn't move. Dean yells for her to go back. Frankie heads back to her mother, confused. Cindy kneels down and takes her in her arms. Families light fireworks off in the middle of the streets.",
        "Frankie": "Wake up Daddy.  When's she going to get back?  She's going to be thirsty? Blue Valentine Official Green Script as of 6/9/09 2.  I don't like it... Cindy turns on the faucet over a pile of dishes, returns to the computer to e-mail herself the missing dog flyer.  Lepers don't use spoons.  Five.  I love you. Blue Valentine Official Green Script as of 6/9/09 5.  Did you find Megan?  Yeah! Cindy listens in the front seat. She doesn't approve.  Pa! Jerry growls at Frankie. She screams, scared but delighted. A yapping dog named SAMMY jumps on her. Jerry nods at Dean who keeps his distance by the van.  Cover his mouth and hold his nose.  I don't wanna take off my costume!  Daddy! Daddy! Mommy! Cindy's car sits in the driveway. Cindy gets out, grabs her suitcase. Jerry emerges from the house. Cindy kneels down and hugs Frankie. She is electricity in her arms.  I want to stay at Grampa's house next time for fifty nights. Dean looks up. He has tears in his eyes. Frankie touches one as it streams down his face.  Why you crying? Blue Valentine Official Green Script as of 6/9/09 85A.  Daddy! Dean walks out the front door where he passes Jerry who stands on the porch. He moves across the lawn to the sidewalk. Vermillion light falls in the sky. Cindy sets Frankie down and she runs out the door. Jerry catches the little girl by the arm and holds her tight. Dean walks toward the horizon. FRANKIE  (cont'd) Daddy! Dean stops and turns. Cindy walks to the porch.",
        "Dean": "What time is it baby? She sniffles. He notices.  She probably just went out for a run. She'll be back soon because she's going to get thirsty.  You know what we should do? We should leave her bowl full of water and her dish full of food. Because she's gotta get hungry and thirsty sometime. You know? Dean's optimism is infectious. Frankie nods slowly.  Like me. I'm hungry. I'm so hungry I could eat your toes. Dean pretends to gnaw at Frankie's toes. Breaks her sadness.  We're hungry! We're going to eat you. They pin her arms above her head and 'furber' her armpit.  Don't laugh. Come on, don't laugh! Cindy doesn't laugh, she screams.  What happened to the flute? Cindy pours the hot water into a bowl with instant oatmeal &amp; raisins. She blows on the food and places it at the table. Blue Valentine Official Green Script as of 6/9/09 3.  Here... we can make it taste better. Dean spoons the raisins out of her bowl onto the table.  This is how a leopard eats. He laps up his coffee like a cat. She mimics. Dean laughs.  Are you gonna listen to your mother? I think you better. Frankie reluctantly takes a tiny bite. Her face sours and she lets the food fall out of her mouth and back in the bowl. Cindy returns to the dishes.  How old are you?  Okay, eat five bites. Dean gets up, goes to Cindy at the sink.  We gotta get a dishwasher... Tries to take the dish sponge away from her. She resists. Blue Valentine Official Green Script as of 6/9/09 4.  I'll do it. Come on let me do it. She drops the sponge, dries her hands.  You be good today for Miss Alex, okay? Frankie, dressed like a little leopard, nods. DEAN  (cont'd) Love you.  Love you. He kisses her on the corner of her mouth. A hesitation.  Put your seat belt on. She starts to back up.  C'mon. What's the big deal? Cindy does as she's told, looks over her shoulder, scrapes the curb.  Watch... Cindy cranks the wheel straight, puts on the gas and burns down the road. Dean stands there in his driveway, muttering to himself. He watches the car disappear down the street. Another car, headed the opposite direction, barrels down the road, past the Periera home.  Slow that piece of shit down!  God's a woman and she's pissed off at me.  Didn't think you were gonna make it.  Almost. Her class is coming up. Dean kisses her cheek. Cindy settles, arranges her things.  You have a good day?  Anything good happen? Cindy shakes her head \"no.\" She drops her keys into her purse, but they miss the target and she fumbles after them.  Is something wrong? Cindy shakes her head. Takes the water from Dean. He stares at her. She concentrates on closing the clasp on her purse.  Why don't you tell me? She doesn't want to start crying. Dean gets visibly frustrated. He's sick of prying everything out of her.  Why do you gotta make me beg? I know there's something wrong. It's gonna come out eventually. Just tell me. The song ends. A patter of applause. The teacher introduces the next song \"THE BATTLE HYMN OF THE REPUBLIC\".  That's great, where? Cindy doesn't answer. She can't. She tries to keep from crying. He quickly realizes what she's trying to tell him. Blue Valentine Official Green Script as of 6/9/09 8A.  Where?  I told you you gotta close that fucking gate. Cindy wipes tears. She has to look up and blink to keep them from rolling down her cheek. Dean puts his arm around her, holds her close. She tries to pull away. He won't let her.  I'm sorry. It's not your fault. Blue Valentine Official Green Script as of 6/9/09 9.  You were great.  No. But... I was thinking... Maybe she got a job or something... You know? So she could make some money and buy some food. Or maybe she moved out to Hollywood to become a movie dog! Frankie nods. Dean gets her to the car. Straps her in.  I was thinking...you should have some fun tonight1 Don't you think?  What? I can't smoke around his oxygen. Cindy gives Dean a slow look of contempt, grabs the backpack and walks toward the house. Jerry stands over the hose spigot with Frankie at his side.  Hey leopard. You be good now. You remember what to do when Pa snores?  That's my girl. Gimme a squeezer. Dean hugs her and she squeezes back as hard as her arms allow. Dean plays as if his neck was being pinched off. He sets her on the ground running back to the porch. She gets caught in the diameter of the sprinkler spray. She screams as the water chases her.  15 15      Hey man... Can I have a slice of that pie?   23  24 24    25  26 26     28 28    It's fucking pee! - He runs to the toilet and pukes in to a shit stained porcelain bowl. Saned berates him for wasting time.  How could you live like this? - He ties a bandana around his nose. Gets back to packing. - boxes full of the old man's life (religious items, framed pictures, old cameras and reams of polaroids). - Boxes are packed, taped and stacked.  Look how handsome he was.  Wait up. We gotta do this right... He takes the wheelchair from the nurse, wheels Walter out of the room, picks him out out of his wheelchair, and carries him back into the room across the threshold of his new home.  You are gonna be the new stud in this place. Dean sets him down in a recliner, then gives him a tour of his room - tells him which drawer his socks are in, where put the aftershave, etc. Curtis pokes his head around the corner.  We'll tell her Monday. After the weekend. Let's not ruin her Holiday. Dean turns Cindy around, closes his eyes, and hugs her.  You remember where we put... Cindy stops and watches him. He holds up a gift certificate in an old anniversary card.  Here! Let's get the fuck out of here. Dean grabs the phone and dials. DEAN  (cont'd) Hello, I want to see if I can reserve a room for the night... tonight. I have a gift certificate but I don't know if it's still good. Can I give you a number?  Taking us away. We gotta get outta this house.  It's still good? Good... Well, what rooms do you got?...Hold on a minute... Dean lowers the receiver to his neck.  What room do you want? The North Pole, the Moon Room or Cupid's cave. Which one? Cindy shakes her head. Blue Valentine Official Green Script as of 6/9/09 17.  I don't want to hear any excuses. We're going. We deserve it. One night. Because we belong to each other. Pick a room.  You're not going to decide? I'll decide. That's how decisions get made. Dean gets a shit-eating grin.  Come on let's go get drunk. He returns to the phone.  Give us the moon room. Periera. P-E-R-I- E-R-A... 2... Great... Dean hangs up.  Pack our bags. We're going to the moon!  You're drivin'? Cindy hops in the driver's seat. Dean rides on the end of the buggy and crashes it into the buggy corral. She fires up the engine and honks. He throws his hands up.  Alright, lead foot. It's not a race. Cindy is zoned into the road. She turns off the radio.  Do you mind if I turn this back on?  Let's just see if there's something on... He scans through the low stations.  Anything? Fuck it. He turns it off. Blue Valentine Official Green Script as of 6/9/09 22.  That's better. You're right. It never gets to be just quiet. You know? Cindy nods. Dean rolls down his window, spits his gum as far as he can. He rolls it back up.  What are you thinking about? Dean looks at Cindy, waiting for her to respond.  Did you get everything?  Where d'you get these? Dean reaches for the glasses on top of Cindy's head. She feels the dangling tag - \"woops.\" She tears off the tag and tosses the glasses on the dashboard.  Try em' on. Cindy shakes her head \"no.\" Dean puts them on his face. He poses for Cindy. She grabs the glasses and puts them on. She looks at Dean. He holds in a chuckle.  You look like your mom. Cindy takes them off. Back on the dash.  You get any snacks?  Which bag?  Mmm. These are good. He offers her another one. She shakes her head.  You can't wait? We're almost there.  Goddamnit Cindy!! Pay attention!!! On the side of the road, she stares into the woods. Cars pass behind her, headlights flood the night. She descends into the thicket until the sound of the highway is faint. Wind through the leaves. She drops her pants and pees. Something rustles and she looks into the woods.  I didn't just steal that. Cindy doesn't know what this guy is talking about. DEAN  (cont'd) You think I just stole that money?  You do. No, you do. I know that you do. And the reason that I know that you do is - I have stolen money before... a lot of it. And I know what it feels like to have someone look at you like that... Blue Valentine Official Green Script as of 6/9/09 30B.  The way your lookin'. Just so you know, I have a job where I make money. Money that I can take girls out on dates with.  Maybe...  Can I give you my number or something. He feels inside his shirt pocket, pulls out a business card. Finds a pen. Dean writes his name across the card. Hands it to Cindy. DEAN  (cont'd) I'm Dean. Just call and you can ask for me. I'll get it. Cindy looks down at the card, at his name. Then back up to him. Dean run out, chasing after his ride. He looking behind before he leaves. Cindy watches him go out the door. Blue Valentine Official Green Script as of 6/9/09 31.  Wow. Where are we? He sets down the suitcases, transfixed by the room, a kid in a candy shop. Cindy moves to the small kitchen that looks like a control room. She makes herself a drink.  I could piss harder than this! The dual mirrors multiply his reflection. He looks at himself and removes his coffee-stained shirt. A neglected body. But something else distresses Dean. A fallen hair on the T-shirt he holds. He runs his hands through his hair, looks in horror at twelve fallen hairs in his palm. He washes them down the drain and leans to the mirror, inspecting his hairline.  Cynthia!  Now watch. He runs his hands through his hair then shows her his palms - three fallen hairs. His magic trick.  See. I tol' ya. It's falling out! Cindy ignores Dean who is mesmerized.  Oooooooooh shiiiiiiit! Cindy waves him away. Jerry picks up the line. Blue Valentine Official Green Script as of 6/9/09 32.  Is that Francis? Hey!? Don't hang up until I talk to her!  Who's this? ...How do you know I'm your father? A faint scream of joy is heard through the phone.  Are you ready to go to sleep now? I'll call you first thing in the morning, OK? He walks into the living room, stretching the phone cord, grabs the remote and turns on the television - animal doc. Dean turns the channel. Tennis.  How much? CLICK. The news.  ...Well, I love you more. Sleep tight. Dean hangs up and returns to the living room. He changes the station. A porno. He turns the volume down and watches. He hears water running in the BATHROOM. CLICK. A show on space.  What are you doing?  Do you like the place? Blue Valentine Official Green Script as of 6/9/09 34.  I'm gonna go order dinner now.  Any special requests?  What does it look like I'm doing?  I remember the first time I saw your back.  Everything. He lowers his hands from her back to her behind. Cindy turns.  I wasn't done. Blue Valentine Official Green Script as of 6/9/09 35.  Getting thinner, isn't it?  I know. I love you. She pecks him on the lips. Blue Valentine Official Green Script as of 6/9/09 36.  I'll do it.  Wait, I didn't wash your hair...  We have neighbors. Cindy stands in a towel at the bar, waiting for the ice.  Thanks. He takes a big drink, sifts through cassettes in his bag. In the bedroom, Cindy buttons up one of Dean's big flannel shirts. Blue Valentine Official Green Script as of 6/9/09 37.  Maybe...  Anyone call for me? Dean peeks into Jo's office. She shakes her head \"no.\"  79 79    I just keep replaying it in my head. Thinking about other things I coulda done. Other things I coulda said.  You wait your whole life for something to happen... Blue Valentine Official Green Script as of 6/9/09 39A.  ...And you have all these ideas in your head about how you'll act and what you'll say and what you'll do, who you'll be... She washes the taste out of her mouth and looks at herself in the mirror. She flicks water at her reflection.  Hi. I was looking for your neighbor... the man who moved in last month. Across the hall. Do you know what happened to him? Blue Valentine Official Green Script as of 6/9/09 41.  What about the girl that was with you?  Hi.  I just had a long talk with your gramma... is that, is that your gramma? Cindy remembers him now - he's just dressed nicer - he doesn't look like a mover  I was looking for that old guy who moved across the hall, you know? Do you know what happened to him? Blue Valentine Official Green Script as of 6/9/09 42.  That's exactly what happened to my dog. My parents moved out of our house and three days later she was a goner. He pulls the locket out from behind his shirt. He unclasps it. Shows her the pictures.  He was so handsome, wasn't he? I was trying to give it back to him. Cindy looks at it.  She must have been crazy.  Cause there's one thing I know... the prettier a girl is the more nuts she is. I mean, look at you... you must be insane.  It's okay, I mean, I get it. It's not your fault. Cindy pulls the chain to stop the bus.  Where you going?  Can I walk with you? Cindy thinks about it.  Just for a little bit... And when you don't want to walk with me no more, then just speed up. Doors to the bus open. Cindy thinks about it.  Where's you house?  Where?  Do you think it would be okay if I looked in your purse?  Why? Cindy thinks about it for a moment. Against her better judgement, she hands over her bag. It weighs a lot.  Jeez... What you got in here?  Lot of books. You doing good?  What are you gonna be when you grow up?  You going to be a doctor?  Oh yeah? What should I do about this? He pretends to bump into a pole. Cindy laughs.  You're gonna be a good doctor. I can tell. He digs through text books, pens, a wallet, asthma inhaler. Then he comes to a bottle of lotion. Opens the cap, sniffs.  Mmm. This is what you smell like? Cindy nods, \"I guess so.\"  I wanna smell like you. Can I?  This is what your lips smell like? They must smell good. He puts some on his lips.  Mmm. Your lips must taste good.  No. Blue Valentine Official Green Script as of 6/9/09 45.  89 89   What's in there? She takes her purse back.  Why?  90 90   Probably. I think I... I think I already did. It's okay. There's an early one.  Until you get tired...  Where'd you grow up?  Here? Cindy gives him a grimace.  Where do you want to go? I mean, if you could go anywhere.. They walk to an old playground. Cindy gets an idea.  Oh God... I hate these things.  What happened, tough guy?  You gotta puke... it's the only way. She refuses.  It's the only way. It will make you feel better. Don't be embarrassed. I'll do it. He sticks his finger down his throat and forces himself to vomit. The sound of it is too much for her. She gags. Side by side, they puke into the gravel. They finish their business and end up on their backs and out of breath, side by side, looking up at the stars. They are both covered in sweat. We see their breath.  Me too.  Yeah. We're flying. They laugh. Birds begin to awaken and fly.  You should come visit me in the city sometime. The morning air chills their bodies. Dean takes off his jacket and uses it as a blanket. They get close together to get warm and watch the stars spin above them.  To honesty... Blue Valentine Official Green Script as of 6/9/09 48.  Hey! Wait up.  How is it?  Great. She's the best.  Naw. She's the champ. She's the best parts of you and the best parts of me put together. Everyday she gets more and more amazing. Dean chews a bite of meat and washes it down with a shot of vodka. He refills both their glasses.  She's not mine. I'm hers. Blue Valentine Official Green Script as of 6/9/09 49.  I'm her father. She isn't there for me... I'm there for her. That's the way I look at it.  It's the choice I made when she was born. Silence. They chew. Cindy stares through Dean.  Like what?  What am I supposed to want to do?  I just wanna be with you. Silence. Cindy tries not to look disappointed.  You look like an animal right now. Your eyes look like an animal. Like a bear's eyes.  Yeah... You do. It's true. That's what you look like. Dean is amused but fearful. Cindy's confidence surges. Blue Valentine Official Green Script as of 6/9/09 50.  Whatchu thinking about?  Different?  You think that's good that we're different?  And that's the way you like it, don't you? You don't like me to bother you.  Well there's not much space here. So I guess you won't be able to get away from me will ya?  If you're not interested in hearing what I think I just won't say anything.  OK. I'm going to say something. And what I'm about to say I've thought long and hard about. I'm the luckiest person alive because I'm living my dream - you, her, this, us, all of it. Cindy lifts up her empty wine glass to the light.  What's wrong with that?  That's the flavor. Eat it.  My tits? I got tits? Dean opens his shirt and peers down at his chest.  I could still kick yer ass. Blue Valentine Official Green Script as of 6/9/09 52.  A dime and you're on. Cindy gulps more champagne. They scoot dishes out of the way and clasp hands in the middle of the table.  I'm always ready, baby.  Come on. Go! Start. Cindy ignores his taunts and pushes as hard as she can. Slowly, she begins to push Dean's hand down. Dean groans, letting her win a little. Cindy presses down with all her weight. His hand is centimeters from hitting the table. Then, he turns the tide. Cindy battles back with all the strength she can muster. Dean laughs, realizing her passion for victory. Dean pounds her hand into the table. He stands kisses his flexed bicep. Cindy lifts her hand. A fork is stuck in the back of it. She looks at it with curiosity.  Oh fuck.  Hold still. He plucks the fork from her hand, leaving four vampire bites.  You think we should rush you to the hospital before you bleed to death? Cindy shoots him a look. Dean wraps her hand with a dishrag.  Does it hurt?  Wait wait wait. He flicks the switch and the bed starts spinning. He runs out of the room. Cindy watches the room around her spin. Dean returns with the vodka bottle and two shot glasses. He kneels above her and pours them two shots. Blue Valentine Official Green Script as of 6/9/09 54.  To numb the pain. Doctors orders. I'm an anesthesiologist.  Drink up. We haven't gotten loaded together in years. He tops off her glass, refills his own, and quaffs it.  I gotta take a piss. Don't fall asleep. He kisses her on the forehead, stumbles. Cindy hears Dean urinating. She is sickened by it. She tries to set her full glass on the floor that spins beneath her. The toilet flushes. The drink tips over. A loud crash comes from the BATHROOM. Cindy sits up.  I fell over. Blue Valentine Official Green Script as of 6/9/09 55.  Nope, I want you to come here first. I want you to laugh. Cindy opens the door and Dean scoots, making room for her. He lets out an \"ow\" before extending his hand.  Come close. I want to hear you... I want to tell you... Shh, come here... Cindy reluctantly joins him on the bathroom floor. Their faces are close, eyes locked.  You want to hear a joke? OK. What's better than winning a gold medal at the Special Olympics?  Not being retarded. Cindy looks down.  Hey...that's not funny? How come you don't think I'm funny any more? I tell you something funny. You laugh. I see you laugh. But you don't really laugh so much. You don't laugh anymore Cindy.  No I want to make you laugh. Tears well up in her eyes. Dean rolls on top of her. He cups her face in his hands and stares long into her watery eyes.  Hello...  No, I'm just still in love with you. After a moment, their lips meet in an awkward rejuvenation. She moves her head away and pats Dean on the shoulder in a gesture of friendship. Dean kisses her neck.  Do you... you want to have another baby? ... I want another child. Cindy bites her lip. He slides his hand between her legs.  What!? I can't have sex with my wife!? Cindy covers her face with her hand.  Do I repulse you that much? I'm good to you. I'm good to Frankie. I deserve a little affection. Do you want me to stop loving you? Do you want me to fuck other women? Do you want me to beat you?  Is that what you think you deserve? Would that make it easier on you so you can treat me like this? Cindy raises her hips and slips off her panties. She lifts the shirt up over her head, positions her feet on the door jam. Her arm falls over her eyes. Breathless, Dean awkwardly moves one hand up and down her bodice. Blue Valentine Official Green Script as of 6/9/09 57.  I'm sorry...I'm sorry...I'm sorry... She looks at him. His head faces away. She rolls out from underneath and stands. She wraps her dress around her and slips into the bedroom.  Yes. Blue Valentine Official Green Script as of 6/9/09 58.  Sure.  97 97    I don't know. Let me go check. Dean tiptoes over to Jake's room. Peeks in his door. Returns to the couch where Cindy is taking off her jacket. He crawls back under the sheet. DEAN  (cont'd) He's just watching TV. They start to make out while listening for Jake.  I don't know... Should I go see if he brushed his teeth? She nods. He throws off the sheet and goes into the bathroom, touches the bristles of Jake's tooth brush. Cindy takes off her socks and waits for Dean to return. Blue Valentine Official Green Script as of 6/9/09 59.  Be quiet! Seriously. He's gonna kill me. He already hates me.  Are you okay? Cindy nods.  Is it mine? Cindy looks Dean in the eyes.  You let that asshole knock you up?  When'd this happen?  What do you want to do?   We'll keep it. We'll take care of it. Cindy nods. Silence.  Do you want to take care of it?  You're not in this alone. This baby is ours. It's us. Let's start a family.  Cynthia! No response. He struggles up and stumbles to the phone.  Hello? A prerecorded message.   Was she with a guy?  Who's askin'? Bobby rushes him, throws a shoulder into his stomach. They both flail to the floor. The two lock. Everything is quick. Bobby sends a flurry of punches to Dean's ribs and guts. Dean pummels the back of Bobby's head with blind overhead rights. It becomes clear that Bobby has the upper hand. He holds Dean's bloodied head in some kind of jiujitsu headlock.  I think you're a fucking idiot. Bobby hits him again, harder. Harder.  Never. Bobby looks at his bloodied hands. He lacks the strength to lift he arms. Gives one last weak kick into Dean's bloodied face. Troy and Tony pull Bobby out. The gang leaves, victorious yet somehow defeated. The office phone, which has been ringing incessantly, stops. Dean is on the floor in the fetal position. It takes him a while, but he manages to sit up. He feels the inside of his split lip with his tongue. He doesn't feel pain as much as he feels tingling and ringing - all over. Jo comes in. She freezes when she sees him.  Hello?  Where's my wife? She hands him an in-patient form. Dean looks at it.  I'm not sick. Mimi cups her hand over the phone.  There's nothing wrong with me. Dean hands her back the clipboard.  Where's my wife? Mimi lowers the phone.  Cynthia. Where is she? Blue Valentine Official Green Script as of 6/9/09 75.  Yeah, are you deaf or are you just dumb? She puts the phone on hold and disappears into the clinic. Dean turns around and looks at the people in the waiting room. He has a slight confrontation with a gang banger. Cindy approaches from the hallway.  Saved you a trip.  I got a ride. Mimi appears behind Cindy.  - I was going out of my mind. I didn't know if there's an emergency. I didn't know if Francis was hurt. Did you think about that?  Taking pictures? Mimi sits down at her desk and picks up a ringing phone.  Last night got fucked up, OK? I know it. I know I'm lazy, I eat too much, I drink too much, I drive you crazy with all my jealous bullshit. I fuck up. I know I'm clumsy. But you're not trying anymore. Cindy hurls the bags into the back of the car. Dean helps.  Please don't make me be alone.  I'm OK.  Yeah. Let's go.  You don't think about anyone but yourself. Do you? Cindy walks back to the clinic. Dean follows close behind.  You got no time for me anymore. It all goes to this fucking job. Blue Valentine Official Green Script as of 6/9/09 77.  You! What about me? I gave up everything for you.  Take what? What can't you take... The truth? I know you can't... You never could.  Who is it?  Wait a second... He grabs her in a hug. Her arms are pressed into her side.  Get up. She hits Dean with a flurry of flailing fists.  I know! He grabs the suitcase next to him and opens the door. He throws it through the air into a FIELD - trying rid himself of pain, longing, and desperation. He clutches his wedding ring, but can't yank it off of his fat finger. Finally, he gets it off and tosses it into the field. The moment he releases it, he wishes he hadn't. MOMENTS LATER - Dean and Cindy search for the ring. It is lost. Music begins to play in reverse.  I didn't know if it was pot luck so I brought an eggplant. He points at his face. Behind Jerry, Cindy peeks out from the kitchen at the end of the hallway. It is the first time she has seen Dean since the fight. She is shocked.  Face looks like an eggplant, don't it? How you doing sir, I'm Dean. Dean holds out his hand. Jerry looks Dean up and down.  I stole these for you.  Come lord Jesus, be our guest, and let thy gifts to us be blessed. Amen. Blue Valentine Official Green Script as of 6/9/09 81.  No. It feels good. Keep doing it. She does and is interrupted by... The FAINT SOUND of her parents fighting downstairs.  Maybe I should go.  I'm going to miss my train.  Okay. She kisses him. Opens up his shirt. Reveals a severely bruised torso. He winces a bit from the movement. She redresses his wounds, nursing him back to health.  I love you.  Really?  Are your parent's gonna walk in on us?  Hey sweetheart. Frankie leaps into Dean's arms. Cindy walks up to the house.  I can't play right now, okay? He releases his wired daughter who runs circles around him. Dean walks up to the porch. He and Jerry stand face to face.  Do you want to get out of my way. Jerry backs away. Dean walks past him into the house.  Keep an eye on Francis.  We're not alone here Cynthia. We have a little girl. We need to think about her.  All you're thinking about is yourself. You. Francis is gonna grow up in a broken home and that's OK with you.  Don't love each other? I've only ever loved you. Dean approaches her from behind. Reaches out...  140 140    ...Cynthia...Cynthia... He holds her hands and gropes her arms, legs, shoulders whatever she will let him touch. Cindy has tears in her eyes but she is focused. There is nothing to say.  Thank you... Blue Valentine Official Green Script as of 6/9/09 86.  Daddy's gonna go now, OK. Dean stands and picks up Frankie. He walks to Cindy and hands her over.",
        "Checker": "That's $58.42. Cindy hands the CHECKER a fifty. The Checker holds it out.  $58.42.  $11.99.",
        "Professor": "...When I was a young physician, I used to leave the hospital everyday in tears.  Just broken down from seeing the suffering of my patients.  ...As a result, I began to suffer. Not just in my work but emotionally and physically...spiritually... Blue Valentine Official Green Script as of 6/9/09 28.  ...There's a choice we all have to make in the medical profession - whether to be sympathetic or empathetic with our patients...  ...Imagine your patients as being in a hole. To be sympathetic means you throw them a rope to help pull them out... Pages print on an old printer. Outside the window, the sun has begun to rise. PROFESSOR  (cont'd) ...To be empathetic means you jump in the hole with them...  ...Now you're both stuck.  I want you to think about that when we go into the next section. Please pass in your reports. Cindy passes her paper down. Bobby, the TA, collects the reports. Cindy can feel him staring at her as she packs her backpack. Blue Valentine Official Green Script as of 6/9/09 29.",
        "Glenda": "Ope - I thought you were your Dad.  How was the beauty shop?  Come lord Jesus, be our guest, and let Thy gifts to us be blessed. Amen. Glenda, Jerry, Gramma Francis and Cindy sit around a dining room table. Glenda slices a knife through a greenish meatloaf. She serves a watery slice to Gramma.  Can I have your plate Dad? He pushes it across the table an inch. Glenda lowers a slice onto Jerry's plate with a SPLAT. Jerry looks at his dinner. Glenda serves herself. Cindy cuts Gramma's meat with her fork and looks over at her dad. His face is turning beat-red... Suddenly, Jerry pounds his fist into the mound of meatloaf, obliterating it. Particles of ground meat fly everywhere. Glenda won't look up, her shoulders tremble. Jerry raises his steaming fist. Bits of ground beef stick to his knuckles.  They had it ready-made in the deli. I... thought it looked good.  I thought it would be nice.  ...for a change...  Sorry.  Do you want me to make you some eggs?  Oh bullshit. Glenda retreats into the kitchen. Gramma and Cindy eat."
    },
    "imdb_rating": "7.3",
    "description": "Dean Pereira and Cindy Heller Pereira are a young working-class married couple with a young daughter, Frankie. Dean currently works as a painter and Cindy is a nurse at a medical clinic. Despite their relatively tender ages, they are both ravaged by the life they've eked out together and by the experiences they've had leading into their marriage. High-school dropout Dean comes from a broken home and never really had a mother figure; he never imagined getting married or having a family despite falling in love with Cindy at first sight. He has no professional ambition beyond his current work--which he enjoys since he feels he can down a beer at 8AM and it won't affect his work--although Cindy believes he has so much more potential in life. Cindy also comes from a dysfunctional family; her parents didn't set an example of a harmonious married or family life. One of her previous serious partners, Bobby Ontario, has had a profound effect on many aspects of her marriage to Dean. Dean and Cindy head off on an overnight getaway together without Frankie, seeking a clearer picture of whether their marriage can survive its many issues.Huggo",
    "name": "Blue Valentine",
    "genres": [
        "Drama",
        "Romance"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMzdkODBlODctNzhkNC00NTBkLWJkMWItZjY5MGExMTAwMTZhXkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_QL75_UY281_CR3,0,190,281_.jpg"
}