{
    "filename": "Bruce-Almighty_script.txt",
    "imdb_id": "tt0315327",
    "imdb_url": "https://www.imdb.com/title/tt0315327",
    "characters": [
        "Bruce's Soundman",
        "Jack Baylor",
        "Fred Donohue",
        "Bruce Nolan",
        "God",
        "Debbie",
        "Ally Loman",
        "Bruce's Cameraman (as Timothy DiPri)",
        "Himself",
        "Evan Baxter (as Steven Carell)",
        "Bobby",
        "Dallas Coleman",
        "Anita",
        "Grace Connelly",
        "Susan Ortega"
    ],
    "dialogues": {
        "Bruce's": "We are in. . .       Bruce jumps in, turns the key, the car turns over but doesn't start.  Bruce heads for his severely beat-up junker car whistling \"What if God were One of Us.\"    The PRISONERS drive off laughing.",
        "Soundman": "",
        "Jack": "Okay, promos are approved, let's--  I would have swore I already said this, but promos are approved. Now                  * can we move on?                                     *  Evan, you'11 know something when I know something.  Nice story, Bruce, but we're going with Evan's piece on the sex scandal at the mayor's office for sweeps.  Okay, knock it off... Bruce we're holding your story in reserve. Now, can we get back to the board so we have something to air today?  Sure, Bruce. What do you need?  You don't want to be like Evan. Evan's an asshole.  No, Bruce.     You can't.  Are you going to pick that up?  Hi, Susan.                           Hi, Susan.  Look, Bruce. You're a good reporter. You make people laugh. God knows today we can use it.    Yep.  Well now you and Evan get the live feeds.  Yes, but watch yourself, Bruce. I've seen your outtakes.  What's going on?  He may not have audio. Check his feed, have Susan cover.  Come on, Bruce, talk damn-it... Okay, get ready to pull the plug.    Did I just hear..?  Alright, cut the feed! Cut to black if you have to.       He sees Bruce enter, immediately perks up.                         *  *  Look, I'll be straight. We want you back, Bruce. I want to tell you, it wasn't my decision to let you go. When the big guy gives the order, I gotta...  You did that in a day?  I haven't been the best father in the world.  I cur se a lo t. I c hea t on my ta xe s. My w ife u se d t o mak e my kids call me, when she was alive... ...Now, I go to strip clubs, and dri nk a ll nig ht. Bu t at le ast their open unt il four. W hat are you doing tonight?  Yeah, I gotcha. It feels good to get that out. Thank you.  Look,    it's not in my power to give you a   nchor, but as far as field repor   ting goes, if you're looking for a    bump.    What the hell is that?   Very uncomfortable, struggles for the right words as he's firing somebody.  Look this isn't easy for me. We're starting to get some complaints and... Well, Bobby, things just aren't working out.  Bobby's demon-looking head, slowly ROTATES 360 DEGREES ON HIS     The world's gone mad.  Oh, there you are. Your big debut. How you feeling?  Okay, the Sabers just won the Stanley Cup. It's getting pretty crazy out there. We're going to kick live to Fred at the stadium. Oh, and Bruce, you won the pool again. Exact score, dead on. Twenty-three to one, who would have thought.",
        "Baylor": "",
        "Fred": "Sniffles at eleven is nice.  Come on. You're turning orange.                       *",
        "Donohue": "",
        "Bruce": "by Steve Koren &amp; Mark O'Keefe         Oh, God, no! The hair's wrong. This is a bad sign. We really need to get a make-up person?!  A hair net? I'm not wearing a hair net. I just did the hair.    Remind me to swing by an elementary                   * school after this and serve lunch.  For three decades the Kowolski Family Bakery has been a mainstay in downtown Buffalo. Known for their sinfully rich, cream filled, deep fried polski pierogis. And the occasional sugar induced coma that follows. Today, in honor of their 30 year anniversary, Momma Kowolski and her sons Gustov and Vol, decided to do something, a little bit different. Tell me guys, how did this idea come about?  Wow. Fascinating.  The previous Buffalo cookie record was 3 feet, 17 inches baked by Gladys Pelsnick. But this behemoth cookie clearly proving that Gustov and Vol have much more free time.  As we witness the ceremonial toasting with milk it makes one pause and think. What are we really looking at here?  Is it just a big cookie or does this cookie represent the pride of Buffalo? Our dedicated and hard working citizens the key ingredient, with a few nuts thrown in. And finally, the love of our families which provides the warm chewy center making our beloved Buffalo the sweetest place to live.  And that's the way the cookie crumbles. I'm Bruce Nolan, Eyewitness News.   Bruce is with his longtime girlfriend, GRACE. She has a box of photos on the coffee table in front of her organizing them into a photo album.  So, what do you think?  It sucks. It's a story about a cookie. People with eating disorders will be riveted, Dear Bruce, love the bakery piece. I can't wait to vomit so I can make room for more cookies.  What? I'm cutting that. They made me wear that stupid thing. I don't even look like myself. The hair is one of the most important parts of an on camera persona. Right out of the gate, I lost the hair advantage.  Grace. Try to stay focused here. I need your help.  It's sweeps Grace. It is serious. There's an anchor job open. This is important. This is our future!        You look pretty intense, hun.  So, you're attracted to me in some way, is that what you're trying to say?  I was saving myself for the wedding night, but if you keep this up, I may lose my resolve.  Hey, that's a good line, but you need more resonance. From the diaphragm. That's the way the cookie crumbles.      ...Bruce Nolan. And this is Sixty Minutes.  We are in. . .       Bruce lies next to Grace with a big smile on his face. Grace hits the alarm, rolls over snuggling close to Bruce.  No, I'm having a great dream.  Of course they lost, they're my team.  \"And that's the way the cookie crumbles.\" You know, I think there might be something to that cookie line. Everything great anchor has his own signature sign-off. \"And that's the way the cookie crumbles.\"  Oh no!   Grace, the dog!  Ah!  Whoops, sorry.  Oh, you're all done, huh? B-e-a-utiful.  Yeah, if you want to rub your success in people's faces.  What's with the hubbub?  Creepy. Needles, yech...  I mean, it's just s o . . .  C'mon, that's your...blood. It's in your body and I don't think it's supposed to come out. Besides, they stockpile that stuff. They have an endless supply frozen in a warehouse somewhere then tell everyone there's a shortage.  Well, I'm IB positive. IB positive they aint touchin' me with no needle.  What's that?  Well, I hope they work, cause it's going take a miracle to get me to work on time.  This is just my luck.  The meeting's starting, perfect... Screw it.      Well, that's- Bobby, I gotta go- I'm late...  Bobby, I can't, I--  Mmm, delicious, I really gotta go.  Can you get Kelly- Ahh...  Really?    Keep the change.  Sorry, Jack. It wasn't my fault. The traffic was -- You guys already played the spots?  (re: Evan's perfect  Is you're posture naturally that good, or do you have to shove a stick up there?  Jack, Jack, hey.     Can I talk to you for a second?  Sweeps.  Look, Jack. Hear me out, I'm getting desperate man, I am pushing forty and what have I got to show for it? The point is, I've hit some kind of a ceiling here. Some kind of anti-Bruce barrierI And Evan is just lovin' it, by the way. He gets the good stories, he gets on sweeps. Maybe I have to be more like Evan.  I can be an asshole.  Yeah, I'm sorry.  It's just- this anchor position looming, it's gotten me nuts...  Hi, Susan.                           Hi, Susan.  Maid of the Mist. That's always live.  Evan gets the live feeds.  I'm going live. In sweeps.  Yes 1 You will not regret this, Jack. I will not forget you when I go national.  Grace?    Yep, it's happenin', hun. I got sweeps and I'm live. You know what that means?  They're seeing if I can think on my feet, like you might have to do in a live news anchor situation.  This is happening for us, Grace. What we've always talked about. Jack practically came out and told me.  Well, he didn't spell it out, but this is exactly what happened to Susan Ortega right before she was bumped up to the desk.  I totally agree, but in the mean time you should start thinking about what coast you want to live on.  Oh, they're calling me, I gotta go.  I love you.                                            *  What for? I'll get soaked.  Lovely.    Glad I wore my tap shoes.  And people who are insanely                    '     * thirsty, I get it.                                   *  90 seconds, going live. Think anchor, think dignity, Ignore umbrella. Just have fun.   Listening to the feed. His FACE GOES WHITE.      He stands in shock. Evan is seated next to Susan.     Thank you, Susan 1 Bruce Nolan here aboard the Maid of the Mist at Niagara falls.  First off, \"I want to add another congratulations to Evan Baxter. It's good to see what someone with real talent can accomplish when great opportunities are given to him instead of me. Anyway, I'm here, I believe with Katherine Hepburn's mom. Tell me, why did you toss the blue \"heart of the ocean\" jewel over the railing of Titanic?  Did you feel guilty at all letting Leonardo Decaprio freeze, while you were safe floating on the big door? Do you think he would have survived if you had taken turns, or were you too afraid to freeze your big fat ass off?  Well, I guess that's the way life works, isn't it? Some people are drenched, freezing to death, on a stupid boat, with a stupid umbrella... while others who aren't fit to kiss my willy, are sitting in a nice, comfy news room, sucking up all the glory111  Now, lets speak to the owner. Come on in here, Bill.  Bill, you.'ve been running the Maid of the Mist for 23 years. Tell me, why do you think I didn't get the anchor job?  Do you think it's my hair? Maybe my teeth aren't white enough? Or like the great falls, is the bedrock of my life slowly erroding underneath me. Erroding. Erroooding. Errodiiiing...  I'm Bruce Nolan for Eyewitness news. Back to you fuckers 1  Hey, come on guys. What are you doin'? Just leave him alone.  Yeah, you'd better keep walkin'.  B-e-a-utiful.  Just what you get for trying to help someone.  Get a clue, buddy.  Bruce is pacing, holding an ICE PACK to his swollen lip.  God, yeah. Let's thank God. Thanks for everything, Lord. I am so honored that my horrible demise is a part of your loving and mysterious plan.  Oh, don't worry, he's not listening. If he is he doesn't care. Have you seen the news lately? We got gangs, we got drugs, we got corruption. What kind of God lets that happen? Every time we cure a disease he comes up with a new one! Yeah, is this the lab? Yeah, it's God. They've just come up with a treatment for syphilis down there. I think it's time to release the tainted monkey. Oh, and there's a guy in Ohio who's praying for strength and wisdom, blind him and cut off his legs.  Think about it, Grace. God is all- powerful . He could fix everything in five minutes if he wanted to.  But he doesn't want to. He doesn't like me.  Oh, Perfect! But you're aim isn't so good, I'm over herel  Of course not. It's part of the mysterious plan.  Okay? News flash: I'm not okayi And I'm not okay with the fact that you think everything is okay. I'm not okay with a mediocre job. I'm not okay with a mediocre apartment. I'm not okay with a mediocre LIFE!  Terrific. I'm drowning and you throw me a brick!  Perfect! I'll have the worst day of my life with a side order of guilt, please. I-- I don't need this.  Okay, God. You want me to talk to you? Then talk back. Tell me what's going on? What should I do? Give me a sign...  I'm right here. Speak to me.  All I need is some guidance. Please send me a signal.  Oh well, I guess you don't care.  Okay, we'll do it your way. Lord, I need a miracle. Please help me.  Come on, where'd you go? Ah ha! AHHH!  Okay, if that's the way you want it. The gloves are off, pal! Let me see a little wrath! Smite me oh mighty smiteri What, no pestilence no boils? Come on, you got me on the ropes, don't you want to finish me off?! You're the one who should be fired! The only one around here not doing his job is YOU! What are we, you're little pet project? A hobby you tinker with now and again? Answer me. ANSWER ME!!!  Sorry, don't know you, wouldn't call you if I did.   Bruce wakes, slaps at the alarm clock, groggy, reaches for the phone, finally realizes it's the beeper. He gets up, begrudgingly, checks it. The same number.      Well, hello again 772-5623, don't hold your breath.  Oh, no.  What's the point?        Perfect.    What about the elevator?  What? Yeah, I mind.  Excuse me. Hello. I'm, ah, looking for whoever runs this joint...  Yep, seems to be. Kinda bright, though.  Oh, the elevator's broken, huh?  You installed a clapper?  I gotta go.  Oh, this is hilarious. So you're the boss and the electrician and the janitor.  How do you know my father? And how did you get my pager number?    Who are you?  Sorry, it's not ringing a bell.  Oh, you're God. Well that explains everything1 That's how you know everything about me. That's how you got up to the seventh floor so quickly. Well, it's really nice to meet you. Thanks for the Grand Canyon and, ah, good luck with the apocalypse.  Okay, I don't know how you're doing that, but I really gotta go. This place is obviously rigged in some way. We're on some freaky hidden camera show. ...for which I will not sign a release, by the way! But you know what, I'd be a little more impressed if you didn't use the cheesy file cabinet illusion.  Everyone with a      brain in their head would know that      the drawer is being  Okay.     That's good.   That's a good one.  Okay, God. How many fingers am I holding out?  Okay, how about now.  AH HAl  AAAHHHl  You stay away from me! I don't know what your doing. But whatever you're doing is probably actionable!  Job? Wh at job?  Sure, whatever you say, Pal.  Okay, that did not happen.  No.   Bruce jumps in, turns the key, the car turns over but doesn't start.  I'm having a breakdown. That's what it is. Just a normal, everyday psychotic episode, brought on by tumor or brain lesion...      Okay, just relax here. I did not meet God and I do not have his powers. If that was God, then I'm Mario Andretti.    (SUBTITLES: Yes, you must  It isn't real, it isn't real, it isn't real...  Oh hi, ah, coffee please.  No, that's okay.  Alright, okay.  Excuse me I need a spoooo...  That's alright, I found one.  What?  Okay.  You- He- Thy...  Rules ?  Well the two extra fingers freaked me out a little bit.  Uh huh.   Can I-ask why?  This is amazing.  Where are you going?  God can't take a vacation. Can he? Can you?   ...Right.  And he saw that it was good.  B-e-a-utifull  Hey guys, remember me?  Look, I don't want to fight you guys. So as soon as you apologize, I'll be on my way.  What a coincidence. That's today.  Now I'm going to have to teach the rest of you guys a lesson.  Just me... and me...  And me, and me, and me, me, me, me, me and me and me.   Okay guys, Kum Ba Yal  I'll take it from here.  Back home for you, little one.  He belches and one last locust flies out.      He reacts to the unpleasant aftertaste and walks off.   We widen to an UP ANGLE of him standing on the top of Buffalo's tallest SKYSCRAPER. Clouds swirl behind him. He looks out over the vast city lights, opens his arms and proclaims to the world.     Grace sits on the floor next to the coffee table with a box of photos working on the album. She takes a sip of wine, sets down the glass. Sam walks over and laps up the wine.  What if God was one of us. . . Just a slob like one of us... Just a stranger on a bus... Trying to make his way. . .    You can call me Bruce.  Who wouldn't be on a night like this? For you.  It's a totally new breed. A cross pollination between tulips and Daisies. I call them Todayzees.  Nothing of this world. Why?  Last night, I was only human.  CD 4, Track 7.  We shouldn't waste it.  Bedroom.  Don't rush yourself. Sometimes                        * anticipation can heighten the                         * pleasure.                                             *  It's a funny thing about, pleasure.                   *  It can be extremely pleasurable.                      *  Standing at the door with both arms extended toward the bathroom like an WARLOCK CASTING A SPELL. Suddenly the light hits him from the open bathroom door and he quickly strikes a casual pose. Grace stands in the open doorway, panting like an animal. She dives on Bruce, attacking him.  Sam. Uh uh uh.  Good boy.  Good morning.  Oo, my favey.  Heavenly?  Huh? Ah, no, they, ah, look the same to me.  You got me. Probably just a hormonal thing. Well, enjoy your breakfast, I've gotta run.  To get my job back.  Bruce heads for his severely beat-up junker car whistling \"What if God were One of Us.\"    He gets in, fastens his seat belt, as two teenagers cruise by on skateboards, stop outside Bruce's window.  Well, it gets me from A to B.  And the last shall be first.  Watching the action from the side, holding his own home video camera. Phil spots him.  Yeah, I had a bad day. But things are lookin' up.  Just lookin' for a story.  I don't know. My instinct tells me there's something more.  Since the disapearence of Teamster president Jimmy Hoffa in the nineteen sixties, his whereabouts have remained one of this country's great unsolved mysteries. That is until just moments ago, when during a routine training session, a police dog named Hank sniffed his way right into the history books. As you can see behind us, the body is being carefully exhumed and will be transported to a hospital facility where DNA testing will confirm the identity. That, of course, only a formality as in a bizarre twist, the body was found buried with a birth certificate and complete set of dental records. Sort of a two-in-one for Hank today, as moments later, he busted a local news camera crew with four kilo's of marijuana.    That's the word.  No, thank you, I'm not hungry.  No.  I'm really not interested.  Bobby, I--  No, I really- no...  No, Bobby.. Bobby N01 I said I didn't want anything. Damn you...  *  No harm no foul, Jack. I needed some time off to reassess my goals and get in touch with my true self.  Imagine what I can do with seven.  What's that?  Oh, I'm busy doing...things.  Jack, don't worry about that. Just give me a camera and a crew and I'll give you the news.  (casual to an amazed news  Hold that thought, Hazel! It seems some type of meteor or asteroid has, by chance, hit the earth right behind the Mark Twain Chili Cook Off. . .  . . . So remember, it's sky diving season at Old Pete's airfield. This is Bruce Nolan.. My rip cord appears to be a bit stuck.  This is a very unfortunate turn of events. I'm heading toward the earth at a very precarious speed...  Ah ha!     You are real!   Bruce sits watching a hockey game on TV. He follows the puck intently with his eyes, as though controlling it's path.    In the past, zoo officials have been unable to get these Panda's to mate, but that doesn't seem to be a problem today.  And the mood seems to be catching o. . .  Oh, say can you                                       * seeeEEEEeeeeeEEEEeeeee...                             *   Grace opens the bathroom door, revealing SAM, SITTING ON THE TOILET SEAT WITH A NEWSPAPER UNDER HIS FRONT PAWS. Sam BARKS and Grace quickly closes the door.   ...eeeEEEEeeeeeEEEEEEEEEEeeeee. . .                    *  Bruce finishes running a bath, gets into the tub but SLIPS as is UNABLE TO SINK and ends up sliding around ON THE WATER like on a sheet of glass. He tries to break through, can't. Then, he concentrates and finally LOWERS INTO THE WATER.  ...of the                                              *  ...and that's the way the cookie crumbles.  Very good. If you run out just bring me some water, I'll take it from there.  Huh? Oh, no this is fine right here.  I was going to wait until after the meal, but I think it's going to just bust out of me if I don't do it now.  You ready?  I got anchor.  Evidently, they're having problems with Evan. He's finishing up the week and I go live Monday.  Well, yeah. Grace, I got anchor. We got anchor!  (noticing her flat    Well, sure. Just one second, hun. Fans. We better get used to this, huh?  Oh, thanks...  Wow. It's kind of loud in here.  Geez...  (talking loud .over the  Is this heaven?  I'm dead?I  Those voices...  Prayers? Those are prayers? Why can't I understand them?  Okay, so maybe I've righted a couple of the wrongs in my own life. I was going to get around to others. I can do both. I can help the world.  Yeah. Everything is great.  Oh, ah, She can't... I just, ah, needed a little fresh air.  I wasn't running out on you...        Oh, not now.    No.    Okay...Prayers.                                         *  Okay, first off, this creepy whisper thing has got to go. Organization and management. I need a system. Something concrete... Prayer files 1                                          * Let all prayers be organized into                       *  Too b ulky. Ah! Praye r po st-it s!                  *  Sloppy.                                                 * Ah!                                                     *  Welcome to the information super highway. No mess, full bless.   He's fallen asleep by the computer. As he wakes he sees:           * \"1,567,432 unread messages\"                                        *  Whoa.                                                    *  No.     You look great.  I think you look amazing.                                *  No it's not. Come on, give me a hug.  Oh, ah. Nothing. Surfing the                          * internet...for stories...  No, ah...Honey, you're going to be                    * late.  Don't need to.  Happy two months and four days before your birthday.  I'll work it out. Just trust me.  Okay. Let's start with something                           * easy. Find: Sports...Sabers. Please make the Sabers win the playoffs, good. Please, please let the Red Wings beat the Sabers.  Yes to you, loyal Sabers fan. And no to you. And your goalie has turrets.    The FAT KID nervously grabs the rope and much to his               * surprise, he CLIMBS IT LIKE STALLONE IN CLIFF HANGER.          * Bruce is in the stands, pleased. He flicks his finger upward and the BULLY'S gym shorts SHOOT UP HIS BUTT CRACK - a supernatural wedgy. Filbert flexes his flabby arm, amazed.  Ask and ye shall receive.                           *  Knock, and the door shall be                        * open. . .                                           *  Promotion with 15% raise...It's green. . . Donuts are now healthy...  Bruce sits at the computer, looks at the total prayer requests, his jaw drops. 3 MILLION and growing.  Oh, come on. What a bunch of whiners. This is going to suck up my whole life.    Oh, I've got something better than lunch.  Really?  Keep 'em closed...  Okay...open your eyes.  I know, it's incredible. Come on                        * in, look.                                               *  *  It's mine...ours.    7 million. That was the asking, but I got a deal.  We'll have the money. Listen to me closely. I'm getting anchor. Then, I'm going to get spotted, offers will come flooding in to go national, and then you and I are moving to New York City to a place that will put this to shame. This has been my exact dream my whole life and it's finally going to happen. Every step just how I pictured it.  What?  I wanted to surprise you.                       *  Honestly, I thought you'd be a little more appreciative.    Let those with ears hear.  Exa ct ly. F or th e bet te r. I' m not poor and s truggling . And mayb e that threatens you. I'm telling you, there are plenty of women who would love this place.  I can't believe this. I did all                 * this for us.                                    *  I want that.  Marriage, I want marriage, okay.                      * It's just not a great time right now.  Come on Grace, lighten up.                            .* Tomorrow's Saturday. The office is                    * throwing me a party here, for getting anchor. Let's enjoy the ride for a whi le. We're just starting to have some fun.  Grace.    Well on his way to plastered, takes a swig, then glances at the beer.    Bless you. Bless you.  Put your money on the Sabers. Coach prays a lot.  What do you have left?    I ' d thank you all for coming, but the liquor is free so maybe you should THANK ME!  And now let me tell you a story. There was a man who had two sons. The younger son took his inheritance and squandered his money on a life of lust and debauchery. I LOVE THAT GUY!!  Oh, ah, I was calling Grace.  I don't know, we had a fight earlier. Ever since I . . Well, things are different now and...  Really?  Look Susan, I don't know, I--  Grace, I...  Grace, wait.  Grace, come on.  Come on, don't say that. I was just calling y ou--  I didn't think you were coming-- I mean, I . . . I screwed up, okay. Let me make it up to you.  If that's what you want.  Grace, come on, don't do this.  You're the one that didn't like the new place!  You can't walk out on me! I'm the alpha, lady! I'm the Omega!    Fine! I don't need you! I have everything I need. Did you hear that?! I have EVERYTHING!  Grace left me.     How do you make someone love you when you can't effect free will?  Okay, surrender, surrender.  Hi.  I, ah, have my first anchor tonight.  I miss you. I just took the first step, shot myself out on the ledge, awaiting vulnerably your response.  How about you love me and you'll take me back.  Come on, what about all the signs?    It's okay as long as you mean a donkey. I didn't add \"hole.\" It's only bad when you say \"ass-ho--  Grace, please. None of this seems                    * right without you.                                   * Is that a glimmer of hope I see?                     *  Wait.  Now how do you feel?  Drin kin g? Sur e. I'm dru nk wit h   Hey11   That's my car!!  The PRISONERS drive off laughing.  Thou shalt not steal.  Car, show them the way out.  What is wrong with the world?  You know what? I'm good. The show must go on.  Susan, you didn't do anything                          * wrong. In fact, I found the                            * moment rather pleasurable.                             *",
        "Nolan": "",
        "God": "I'm God, Bruce.  Three.  Two.  Four. Nine. Six. Eight. One...  Seven.  You've been doing a lot of complaining about me, Bruce. And quite frankly, I'm tired of it...  Well, that's not very neighborly. I brought you here to offer you a job.  My job. You think you can do it better, so here's your chance. When you leave this building you will be endowed with all my powers.  All the power of God.  Havin' fun?  Let's take a walk.     Okay, let me explain the rules.  Yeah, you left in such a rush I didn't get a chance to explain.      Oh, speaking of amazing...  Since you're finished with these, I think I'll hang to 'em. Might come in handy someday.  I'll be seein' ya.  I'm taking a vacation.  Ever hear of the Dark Ages? Besides, I'm covered. You can fix everything in five minutes if you want to, right?  Really something isn't it?  It's Everest. You should try flipping on the Discovery Channel every now and then. Well, I guess you can't now, being dead and all.  No, I'm just messing with you.  They're prayers, Bruce. You keep ignoring them and they're going to build up on. you like that. You didn't think being God was going to be all fun and games did you?  You aren't listening, son. Let's see, you've had my powers for over a week now and how many people have you helped?  The world? That wasn't the world, Bruce. That was just Buffalo, between Commonwealth and 57th. Didn't want to start you out with more than you can handle. Now how you doing otherwise? Personal life in good shape?    Now it's heating up.    She's got a point.  You're going to have to answer those things, y'know.  You want some friendly advice?  You wanted the job, Bruce.     I                        * suggest you get to it.                                  *   Enjoying your party? Yeah, nothing like spending time with some real frien ds. Any s hrimp left ?  I know.  Would you take you back?  Welcome to my world, son. You come up with an answer to that one, you let me know.",
        "Debbie": "Well, it seemed like they were speaking a foreign language sometimes, but no. Problemo?  Is it so wrong to tie them up?    Free milk cow.  If the moo fits.  Small Wonders Day Care.      Moooo.                                                 *  Yeah, she should marry somebody famous, take the focus off.  We would have heard it ring.  He just needs to blow off some steam, he'll be fine.  Wow, you lashed? You never lash. I'm impressed.  Well, I've been praying to win the lottery for fifteen years, but it's not going to happen. You know, it's not all about money.  What?!  Zoe.  Hang on, I might need you to un- check a few things.    You're a saint, Grace.  So this is what success buys you.  Well, thank Mr. Exclusive for me. He's on a quite a roll. What'd he do make a deal with the devil?  Well, la-ti-da. Mike's idea of a romantic evening is Chez Sizzler.    Grasa? Doesn't that mean fat?  Good - you wouldn't want to leave any spare oxygen in there. Wait a second, you don't think he's going to propose, do you?  You do. You think he's going to propose.  I don't know, hun. I mean, I like Bruce but that man's priority list is him, him, him, then him some more and then you.  That's what I'm worried about. Careful, you missed a spot of free flowing circulation.  That'd do it.  Let's see, how do I--  Hey, I'll take that over fat...  So this is your new place, huh?  You sure you want to do this?  *  Oh, boy.  Right.  Grace's alarm goes off. The radio comes on and it plays a John Cougar Mellencamp song. But the lyrics are different.  Bruce hides behind a hedge, watches Grace jog past.",
        "Ally": "Not in the budget. And not to                         * worry, you're going to look great in this.    You're a thing of beauty.     In three, two, one. . .  Ah, isn't that last one a little misleading? I mean, the story's about flu shots. Do we have to scare people to death?    Jack, shouldn't the promos be                       * focusing on Pete's retirement. This is his last week.  They want you close to the falls.  That's the point.    They want you to hold up this.  Part of the condition of us getting the exclusive.  Remember, this is their 23rd anniversary. Capacity is 59. They cater to tourists, honeymooners. . .  And you'll be interviewing Irene Dansfeild...  ...She rode on the maiden voyage with her late husband. Okay, 90                      * seconds.",
        "Loman": "",
        "Himself": "",
        "Bobby": "Bruce the goose! Morning, Buddy. Don't even move, I got somethin' special today. My mom made it just for you.    You know, contrary to popular belief the quiche was actually invented by the Mayans, then stolen by the French. They shoulda said, \"Hey, that quiche ain't yours, it's Mayan!\"  Just taste it, taste it...  That's a buck seventy-five.    Way out of our league, huh?  You know, I saw them editing your cookie piece.  They must have gotten high or something, cause they was orderin' everything, I had. Hey, how long have you been interested in pastry? 'Cause I've got an aunt who makes baklava twenty layers deep.      Don't worry about it.    I called my aunt, we're on.  Hey, Br uce . N ice job , m an. Wa sn' t the same without you around here, pal. I hear Jack wants to see you.  You're going to need your energy in there. Can I interest you in a donut?  Coffee?  Fiber grain bar with bee pollen and Spiralina?  Yeah, I don't blame 'ya, they taste like grass.  Tell you    what? I wasn't going to break it    open until lunch time, but I made a    batch of rhubarb that you have got    to try.  Come on, it's my mother's recipe she's practically cripple...  Open up, that's it, here comes the news chopper...",
        "Dallas": "Attack of the killer sniffles?  I don't use a tanning booth.  I'm not touching hinu I mean, I'm not really qualified.",
        "Coleman": "",
        "Anita": "",
        "Grace": "Bruce is with his longtime girlfriend, GRACE. She has a box of photos on the coffee table in front of her organizing them into a photo album.  It's good.  I thought it was funny. I love the hair net. How'd you get it to do that?  Oh, my gosh, look at this one. My sister is so drunk.  Aren't you taking this a little too seriously?  I'm sorry.  It does matter. You're funny. You make people smile. Come on, take a break, help me put this album together.  Oh look at this. It's the first day we moved in together.  Oh, here's me at my sister's wedding. I caught the bouquet.  Well, I was thinking about you.  You have no idea.  Well, that's the way the cookie crumbles.  Oh, say it again.     Bruce lies next to Grace with a big smile on his face. Grace hits the alarm, rolls over snuggling close to Bruce.  Sweety, time to get up...  I'm in the shower!  Wow, nice car, huh?  We're having a blood drive.  Oh, that's a nice response.  Helpful and life saving?  They do not. Now stop it. I'm                        * giving. I have a very rare blood                     * type, AB positive.  (suddenly remembers  Prayer beads. The kids made 'em. Keep you safe.  Martin, are you eating the glitter again?  Martin. Open your mouth. Abra su boca.  Oh, you're not huh? Well, then you've got a bad case of Liberace.  They didn't teach you Spanish in nursing school, did they?  Martin has decided to explore new food groups. Martin, this is for art. Like this.  D eb -- Ma rt i n!  Okay, go rinse your mouth with water. Lave su boca. Go. I swear that kid is going to poop an ornament.  Don't start...  Debbie, don't call me that.  Saved by the bell.    Grab that for me, will you?  Hey.  Sorry, honey. My sister seems to think she's my mother. Where are you?  Live? That's greatI  Oh, my gosh.  Wait, what do you mean practically?    Good luck, honey. I love you.                          *  Stop it.                                             *  Talk honey, talk.  Please baby, say something...  Thank you, God.  This isn't happening. This isn't happening...  Bruce is pacing, holding an ICE PACK to his swollen lip.  Thank God you're alright.  Bruce, don't talk like that.  So God is torturing us?  Bruce, please. This isn't his fault.  Honey, you're mad right now. It's understandable. And what Evan did was slimy and wrong. But your job doesn't matter to me. You matter to me. You could've really been hurt. I'm just glad you're okay.  Is that what you have, Bruce? A mediocre life? Well, I'm sorry for being a piece in your mediocre puzzle.   Bruce wakes, slaps at the alarm clock, groggy, reaches for the phone, finally realizes it's the beeper. He gets up, begrudgingly, checks it. The same number.          I know. It's just that he usually calls during the day.  I hope so. I've never seen him                        * that mad. An d I lashed back--                        *  I feel bad for him.   He's wanted anchor for so long.  Listen, I better get back. I want to be there for him.  What can I say, I love him. And if I know Bruce, he's out there wandering around with the weight of the world on his shoulders.   Grace sits on the floor next to the coffee table with a box of photos working on the album. She takes a sip of wine, sets down the glass. Sam walks over and laps up the wine.      Where have you been? You're so...happy.  These are amazing. What are they?  Todayzees? Okay...  Bruce, is there something you're not telling me?  What do you mean, why? Last night you weren't exactly happy with life.  Wow, it really cleared up. I've never seen the moon that big.  Five minutes.  I'11 be out in a minute.  *    Last night was just...  Mmm hmm.  It's funny, but when I woke up this morning, It felt like my boobs were bigger.    They're definitely bigger.      They feel huge to me.  Where are you going?   Bruce sits watching a hockey game on TV. He follows the puck intently with his eyes, as though controlling it's path.  Do you believe how they're playing? Oh, honey, would you hand me the scissors?     Debbie turns to her, she shrugs.                                  *  I didn't even know he could sing.                       *   Grace opens the bathroom door, revealing SAM, SITTING ON THE TOILET SEAT WITH A NEWSPAPER UNDER HIS FRONT PAWS. Sam BARKS and Grace quickly closes the door.   Bruce finishes running a bath, gets into the tub but SLIPS as is UNABLE TO SINK and ends up sliding around ON THE WATER like on a sheet of glass. He tries to break through, can't. Then, he concentrates and finally LOWERS INTO THE WATER.  I guess. I feel like a human taquito.  And he's taking me out tonight to dinner at Chez L'Amour.  Afraid so.    I don't think anything.  Well, he's always said when he gets his career together, you know... And his career is more than together. I mean, come on, Chez L'Amour. Change our lives...  Well, he just might surprise you.  Should we ask for a more private table?    That's great, honey. Congratulations. Wow. So that's what's tonight is about?  Well, to be honest, I thought that maybe tonight, you--  You have lipstick on your face.  Bruce, we need to talk. I thought we had an understanding--  What are you talking about? It's not loud.  Bruce, this isn't funny.  Bruce? What are you doing out here?  Bruce, what is going on? The second I want to talk about us you run out on me.  You know, I actually had the crazy idea that you were going to ask me to marry you tonight.  Not helping you what?  When is it a good time? It's never a good time.  Who are you talking to?!  Fin e. Yo u kn ow wh at? I 'm go in g t o go home and if by some miracle it                          * suddenly becomes a 'good time', you                        * know where to find me.                                     * And speaking of time, you're                               * running out of it.                                         *    Okay, this is getting ridiculous I  I have to see a doctor. There's definitely something wrong with me.  I look like a hooker I My whole body is changing.  My back didn't used to arch like this.  Bruce, I feel like our relationship is becoming all about sex.  No, Bruce. Come on.                                   *  What's that? What are you doing?                     *  Is this why you didn't come to bed?                   *  No, I'm not.  Oh my goshI How did I sleep this late? I've got to run. Are you giving me a ride?    If you're trying to buy your way                           * out of the hot water you're in,                            * it's not working. . .                                      * Well, it's working a little...                             *  Bruce turns away from the window, gets back to the computer.  Bruce sits at the computer, looks at the total prayer requests, his jaw drops. 3 MILLION and growing.  L ook! I'm back to no rmal. It was the wildest thing, I was worried, so I said a prayer and the next thing I know, I was completely healed. It was like a miracle.  So, you're taking me to lunch? Th is i s ra re -- But wonderful.  Oh, you'll never believe it. Debbie won the lotteryI  But get this, there were like 433 thousand other winners, so it only paid out 17 dollars. Can you believe the odds of that?    Wow. This is a bit overwhelming.                        *  *  What?  This had to cost-- I can't even imagine how much this had to cost.  Wh-What am I missing here? You can't afford this. You're a reporter. Buying cars is one t hing, but this--  There's only one problem.  I hate it.  What were you thinking? Why didn't              * you talk to me about this?                      *  Mission accomplished.                           *  Appreciative of what? The fact that you didn't include me on a major life decision or that we now live in the Sultan of Bernai's                  * house?                                          *  What is that supposed to mean?  What is happening to you? You're changing.   Yeah, and so would their pimps.                 *  Us ? W hat us? Yo u a lwa ys said wh en         * your career takes off we'd get                  * married. What happened to that us?              *      'That'. You can't even say the                       *  Not a great time. What is that, your mantra? This is never going to change. . .  No, you're just starting to have fun.  And what in God's name is going on with that dogI?  I'm going to have Debbie pick me up.  I'm sorry, but    I won't be attending your little pa   rty tomorrow. And if                 * you would like    to see me after I will be at our   home.                                *  Oh, and that poor, struggling guy you talked about? I miss him.  Cozy, don't you think? Come on help me find him.  I don't know. It's his big night.                      * I don't want to spoil it. I know                  .    * how much this means to him.                            *  .  Here. I do n't w ant your car. I don't want your things. . . I don't want you.  And you thought Susan's mouth was the phone?  How about a boat, Bruce?  Yeah, a big boat and oh, maybe two bags of cash, you know, the ones with the big cartoon dollar signs on the front. Then I'll be happy. Because I'm just hollow inside. Debbie's been right. All this time. I defended you, told her there was good in you. Another side to you. Well, I just saw that other side and I don't want anything to do with it.  Go back to your little co-anchor. Or is that ho-anchor? I came back here to apologize. How stupid am I?  notices something    CARVED IN THE TREE it reads: \"GRACE + BRUCE\". Carved in     the next tree, \"A COUPLE FOR THE AGES\". Carved in the next    tree, \"COME ON ALREADY, GIVE HIM ANOTHER CHANCE\". She does     a double take, continues on.  Hi..  That's great. I hope it goes well for you.  . . . I don't know what to say.  No, Bruce.  What? How do you know about that? Did you talk to Debbie?  Alright, inside, Martin. Okay everyone, inside.  I have to go...                                      *  ...Are you out of your mind? Have you been drinking?",
        "Connelly": "",
        "Susan": "Hi, Jack.  Bruce Nolan is standing by at Niagara Falls with a report on the Maid of the Mist sightseeing boat, but before we go live to Bruce, we have an announcement to make. As everyone knows, after 33 years, our beloved Pete Fineman is retiring.  Pete's shoes are virtually impossible to fill, but the show must go on. And we could think of no one better than our very own Evan Baxter.  Congratulations, Evan. Looks like we'll be sitting side by side from now on.    We may be having a bit of technical difficulty...  Hi, Bruce.  Good work, I'm impressed.  Good evening and welcome to Eyewitness News at six. I'm Susan Ortega.  Looks like my new co-anchor may need a glass of water.  Somebody get some napkins.      Dallas, help me.  His hair's on fire!  Hi Br uce. What are you d oing out here all alone?  Yeah, I didn't see her in there. I love the new place, by the way. So how are you and Grace doing?  You're on fire Bruce. Some women can't handle fire. Some can.  You know, I always had an instinct about you. I knew you were going to make something of yourself.  There's something special about you Bruce. I like special...  I was right. She couldn't handle the fire.",
        "Ortega": "Hi, Jack.  Hi, Bruce.  Good work, I'm impressed."
    },
    "imdb_rating": "6.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNzMyZDhiZDUtYWUyMi00ZDQxLWE4NDQtMWFlMjI1YjVjMjZiXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Bruce Nolan, a television reporter in Buffalo, NY, is discontented with almost everything in life despite his popularity and the love of his girlfriend Grace. At the end of the worst day of his life, Bruce angrily ridicules and rages against God and God responds. God appears in human form and, endowing Bruce with divine powers, challenges Bruce to take on the big job to see if he can do it any better.—Cezzie",
    "name": "Bruce Almighty",
    "genres": [
        "Comedy",
        "Fantasy"
    ]
}