{
    "filename": "Buried_script.txt",
    "imdb_id": "tt1462758",
    "imdb_url": "https://www.imdb.com/title/tt1462758",
    "characters": [
        "State Department Rep. (voice)",
        "911 Operator (voice)",
        "Special Agent Harris (voice)",
        "Jabir (voice) (as José Luis García-Pérez)",
        "Maryanne Conroy /Donna Mitchell /Rebecca Browning (voice)",
        "411 Male Operator (voice)",
        "Dan Brenner (voice)",
        "Alan Davenport (voice)",
        "Linda Conroy (voice)",
        "411 Female Operator (voice) (as Mary Songbird)",
        "CRT Spokesman (voice)",
        "Pamela Lutti (voice)",
        "Paul Conroy",
        "CRT Operator (voice)",
        "Shane Conroy (voice)"
    ],
    "dialogues": {
        "Paul": "What...? What is this? 2.  Oh my God! Help me!! Help me!!  Somebody help me! Please!! 3.  What is this? 4.  Come on, come on. What was it?  No. Where the hell is it? Son of a...Come on!  Help me! Please! Somebody help me! 5.  No! Wait!  Hello?  I'm buried. You have to help me. You have to help me, I can't breathe...  I'm buried in a coffin. Please help me! Send someone to find me...  Paul. Paul Conroy.  I don't know. I'm in a coffin. I don't know where. I'm scared. Please help me. 6.  Yeah, it's, like, one of those old, wooden ones.  No. I don't know. No.  What?  A cell phone. There was an old cell phone in the coffin.  Yes. No. It's not mine, but yes, I'm calling from a cell phone.  I didn't climb in.  I was put here.  Yes. Please send help.  I think so. It's...it's hot in here. I can't breathe.  I told you, I don't know. Somewhere in Iraq.  Yes. I'm a truck driver, an American. I work for CRT.  No. Please, please listen to me. I'm a truck driver. I work for CRT. I'm a civilian contractor working in Iraq. We were attacked in Baqubah, they...they... ...shot them. All of them.  All of the other drivers.  Yes. Please, you have to help me. They gave me a safety number to call, but I had it stored in my wallet and --  Ohio?  Sheriff's Department? No...you don't underst... ...forget it.  Come on, come on. Pick up. Please.  Linda, honey, it's me. Listen, I need you to contact the National Guard right away. Or the Pentagon. Tell them we were attacked in the Diyala Provence, in Baqubah. 9.  They have to find me. Please help me, baby. Please help them find me.  Linda, it's Paul. I need you to call me right away. This is an absolute emergency. Call the number that comes up on your phone. Call me at that number. If I don't answer, call the Pentagon or the F.B.I. I don't know what the hell is going on, but I'm buried in a box...  ...I can't breathe in here. Make sure you call me right away. Please, baby, please call me. 10.  Um...I don't know. The F.B.I., wherever they are.  I don't care, any city. Just connect me to the F.B.I.  Anywhere! Any city, just connect me, please!  Fine, um...Chicago. Okay?  Hello? Is this the F.B.I.?  I'm calling from Iraq. I'm buried in the desert somewhere. I need you to help me --  Now. I'm there now. I'm a truck driver for CRT. I've been here for nine months.  Paul Conroy.  Alright. Me and a convoy of other drivers were delivering kitchen parts to a community center. As we got closer, a bunch of kids started throwing rocks at our trucks. Then an IED went off up ahead and blew up one of the other trucks. These guys came out from behind the houses with guns and started shooting everybody right there on the street.  I don't know!  I don't know. I was way in the back of the convoy. I must have got hit in the head with one of the rocks and got knocked out. That's the last thing I remember. But now I just woke up, and I was tied up and buried in a coffin.  I guess whoever ambushed us.  No, you're not listening. The kids threw the rocks at us, but then some Iraqi guys -- maybe insurgents, I don't fucking know -- popped out of nowhere and started shooting at us.  They didn't, I don't know! But they shot them!  I'm shouting because you're not listening! I need you to help me! Please!!  Can you trace my call? GPS or something?  I have no idea. They didn't, that's all I know.  Why? Who cares? I'm buried in the middle of the fucking desert! Who cares what my social security number is?! I'm an American citizen. Just send someone to find me!  Hello? What? I can't hear you.  Hello?! Hello?!  Shit!!  Somebody, I need to talk to someone right away. It's an emergency.  Paul Conroy. I'm a driver for you guys. I'm calling from Iraq. My convoy was attacked.  I know, I know, but I don't have it. They took it.  The Iraqis, I think. I don't remember, I blacked out.  Davenport? Who's that?  Personnel? No, I need to talk --  This is Paul Conroy, I'm from Hastings, Michigan. I'm a driver for CRT, and my convoy was ambushed...by insurgents or terrorists. I don't know. I don't know who it was. I'm stuck in the ground, buried in a coffin and I need help. Please send help. I'm begging you. I think I'm in Baqubah in the Diyala Provence. Please send help right away. I can't breathe in here. I can't...please. I'm begging you. I don't know who else to call.         Hello? Hello? Is anyone there? Hello?  Hello? Who are you? Please, you have to help me.  Who is this? Hello?  What? I don't know what you're saying. Who is this?  No, I can't breathe. Please get me out of here.  Yes, please get me out. Help me.  No, no I'm not a soldier. I'm a truck driver. That's it. I'm not a soldier. I'm a contractor.  Yes, that's right. A contractor. Not a soldier.  No, not for Blackwater. I'm not a security contractor. Truck driver, I'm a truck driver. That's all.  Yes.  No, I'm not. I'm here unarmed. But, you still shot at us.  I'm not lying! We were all drivers.  Trucks. The big trucks you see driving around with the supplies? That's us. That's me. We're not soldiers. 19.  What?  Five million dollars? From who?  My family doesn't have five million dollars. If they did, I wouldn't be here.  I don't know, yes, the Embassy will pay you. If you let me go, they'll pay you the money.      Hastings, Michigan. I'm looking for Donna Mitchell. 21.  Ardmore Avenue...I think. Yeah. Shit, I don't know. Just give me that one.  Yes, Ardmore Avenue.  Come on! Where the hell is everyone?  Donna, it's Paul.  Where's Linda? She's not answering her phone. I need to talk to her, I've been taken hostage by...  Donna, I need to talk to Linda. It's an absolute emergency. Have her call me. Use star sixty-nine and find out the number I'm calling from and have her call me...  Donna.  I need to talk to Linda. Where is she?  Are you near a computer or something?  Turn it on. 23.  Look up the number for the State Department for me.  Donna, please, please, please -- just get me the number.  No! Everything is not alright! So, please, just look up the number.  I'm not yelling!        Donna, I'm very sorry I yelled. But, I'm only going to ask you once more to get me this number. If you don't get me this number, I'm going to die.  I don't have time to explain. Please...the number.     I'm an American citizen, working in Iraq. I've been taken hostage. I need to speak to someone right away.  From Iraq. I'm a truck driver for CRT -- Crestin, Roland and Thomas. We were attacked and now I'm being held for ransom.  No. I'm buried somewhere.  Yeah, in a coffin, a wooden box. It's an old coffin, I think.  I don't have the number.  I was given a number to call, a safety number. But the people took it. 26.  Yes.  No. Wait...  Hello?  Yeah, my situation. I'm running out of time and you people keep putting me on hold. What the hell is wrong with you?  Don't be sorry. Just help me.  You've got to be kidding me.  Wait, wait, wait...how did you know my name?  I never gave you my name. I don't think I gave it to the other guy, either.  What the hell is going on right now?  Yeah...?  Well, since you know what the hell is going on, what have you done to get me out of here?  So, that's it? I'm just supposed to rot in here because there's little you can do?  Then what?  In the Diyala Provence. In Baqubah.  Yes. The guy told me that he wants five million dollars by nine o'clock tonight.  Or else he'll bring me to Sea World. What do you think, lady?  So you'll pay them?  Wait...what?  To hell with that! It's easy for you to worry about policy, you're sitting in an air conditioned office somewhere, probably finishing up your sandwich from lunch. You're not the one stuck in a coffin, buried in the God damn desert!  Frustration? Lady, I'm going to fucking die in here. Understand that!  Hello?  Well, then say something. Tell me how you're going to get me out of here.  I don't know. Did it come up on your end?  Go ahead.  Who's that?  Hostage Working Group?  Situations. I love how you keep calling it that.  Yeah.  What about the news? I'm going to call them.  Why?  That's bullshit. You're just covering your ass.  You don't go looking for something if you don't know it's missing.  Fine.  Dan Brenner?     Oh, thank you, God.  That's what he said.  Yeah, in an old, wooden coffin.  I don't know. Maybe.  Less than half.  Vibrate.  What about my Zippo?  Yeah.  Won't it use up oxygen?  It's really dark in here without it.  You guys have to hurry.  Do you know if there were any other survivors?  Yeah.  I just wanted to do right by my family. That's all.  I didn't know it was going to be like this over here.  It's him. He's calling.  Yeah. What do I do?  Yeah.  What about the call?  He's going to hang up.    Hello.  You have to give me more time.  Yes. No. I talked to...someone. Government. They said that they won't pay the money.  No. They said that they don't negotiate with terrorists.  Yes. You are terrorist, you son of a bitch.  What did I ever do to you?  Yeah. I'm here because it's a job, to make money. That's it.  That's not my fault!  I told you, I'm only here to work. To help rebuild.  Stop! Just please, stop! I'm just a guy. I'm just a truck driver. Okay? I'm nobody that makes decisions about anything. I just want to go home.  Yes. Please. Get me out of here and I'll make the video.  What...? How?  Where? I don't see --  The video...if I make it, will you let me go?  Nobody's going to pay five million dollars for me.  If they pay it, will you let me go?  Shit.  Here's his number...  It's 07902-24-921.  What about me? Can you track my cell signal?  What does that mean?  He wants me to make a ransom video. 40.  If it's going to get me out of here, I'm making it.  We?  That's all you people care about! But what about me? Don't you care about me?  No you don't! You people don't care about any of us. I've had eight friends killed out here, six of them today. We don't have any guns, any armor. Nothing.  Tell that to the people who put me in this box! Tell that to the people who shot my friends!  No, you're not. All you people understand are your secret plans and your back room politics. 41.  If I were some diplomat or something, maybe even a hostage working group leader -- or whatever your fancy title is, I'd be out of here by now. Wouldn't I? But I'm not, so I'm just supposed to keep my mouth shut and die.  Fuck you.  Who are they? The people who put me here?  I'm no terrorist.  How do you know that?  I wouldn't kill someone. 42.     So pay them, then.  How many others have there been?  How many have you rescued?  How many?  Tell me their names.  Any of them. Make me know they really do matter to you.  Who was Mark White?  What happened to him?  When?  You remember his name.   Did he...? Is he...?  Where is he?  I want to get out of here. 44.  How?  You do?  That's...that's good.  What should I do in the meantime?  I can't help it. I'm always anxious. I take pills for it.  Yeah.  Okay. 45.  Not now.  I feel nauseous.  I'm trying.  Okay.  Yeah. I'm trying.  What?  No.  Let me out and I'll make it.  I can't. I can't read the paper.  I can't. I don't know what you want me to say. I can't read the paper.  I'm never getting out of here.  I was hoping I could speak with Maryanne Conroy, please.  Mom...it's Paul.  It's Paul, Mom. Your son.  It's okay, Mom. How are you?  That's good.  It's your son, Mom. It's Paulie.  Yeah. Remember? We lived over on Colfax Street, in the duplex. Remember?  That's right, Mom. 49.  It is, Mom. It's Paulie. How's everything at the home?  Yeah...I don't think Pop's there with you, Mom.  Not very good. This...uh, this may be the last time I talk to you.  Did you get the flowers I sent a few months ago?  Yeah, I sent...never mind. Listen, I...I'm going to go now. I just wanted to talk to you, you know, just to say bye. I love you, Mom.  Did you hear me? Mom? I told you...do you want to tell me you   Okay, Mom. Tell Pop I said hi.  Oh no. No, no, no!  Let her go. Please. Please don't hurt her.  No! No, please no shoot. No shoot her.  I will, I promise. Just don't shoot her. She's a mother, she's got two kids.  Yes. She has two kids.  Wait...  I can't read the paper.  No. Wait!  I don't know what you want me to say!  Okay! Okay, I'll make the video. Just, please, don't shoot.  I need to hang up to make the video. Okay? Is that okay?   Fuck...   My name is Paul Conroy. I'm an American citizen from Hastings, Michigan. I'm a civilian truck driver for Crestin, Roland and Thomas. I've been taken hostage somewhere in Iraq...and I need one million dollars by nine o'clock tonight, Baghdad time, or else I'll be left to die in this coffin I'm buried in. I've been told that if...  ...the money is paid, I will be let go. If it's not, I will die in here. These threats are real and will be followed through on. 53.  No, no, no!! 56.   There you are.  Linda, here's the number for the phone. I just found it out. It's 07902-42-884. You have to use the international calling code first. 57.  Please call me as soon as you get this. I love you...I love you. Call me right away. Please.  Oh shit.  Son of a... 58.  No! No, no, no!!! 59.  It's all a bunch of lies. 60.  All of it.  Nobody gives a shit about any of us. We're nothing to you people.  By looking the other way?  You let her die.  They shot her...and you didn't do anything.  She sent three videos.  Why?  What do you know?  I found out the number to this phone.  I found a way to change the display language. I figured that out, and you didn't. Why?  Then how are you ever going to find me?  What about mine?  I'm near a Mosque. I could hear the call to prayer over the P.A.  You're nearby?  They're alive?  We had just left Anaconda, everything seemed okay. We knew that a bunch of our CB radios had been stolen and that the Iraqis were listening in, so we made sure to switch from our usual channels. Pam was riding with Jeff Breer, the convoy commander. She wanted to ride with me like she usually did when she hitched a ride from base, but it seemed safer for her to be with the C.C. As we headed down the road, all these kids came running into the street. Dozens of them. It almost seemed like they were expecting us, except we got there faster than they thought we would. So they run on up in front of me, and I slam on my brakes. The rest of the drivers were already further up ahead, so they kept going. Next thing I know, one of the lead trucks got hit by an IED. I hear Tommy Wilkes on the radio saying, Sandman's hit, Sandman's hit. He's...he's everywhere. 63.  That's when the Iraqis came out of their mud huts from the side of the road and started shooting everybody. I couldn't believe what was happening. It seemed like slow- motion, like I was watching it on TV. People -- my friends -- were getting killed, and all I could do is watch. I didn't even notice that the kids were throwing bricks and rocks at me until one split my windshield. Sort of snapped me out of my trance. But then, I guess I got hit in the head with a rock, `cause I blacked out.      This can't be happening.  No. Come on. Please work. 65.     Yes. Yes, this is Paul. Who are you?  I left you a message.  It's worse. There was an explosion or something. The coffin's breaking, there's sand pouring in from everywhere. I only have a half an hour before --  The hostage takers, Dan Brenner from the hostage working group --  No.  About three inches to my right, there's a wall. Three inches to my left, there's another wall. And about four inches above my head, there's a roof that's about to collapse and drown me in sand. I think this situation is pretty contained.  Help me! Help me! What are you going to do to help me?!  Thank God.  What...?  Shit.  Yes. Yes!  Why do you need my permission? What is all this?  Yes. Alright? Yes!  About nine months ago. Around January of 2005. Why are you wasting time with this? 68.  Who cares? This is fucking crazy --  Yes!  You mean when I came down there to Dallas and you guys said that all of the trucks would be armored and have bulletproof glass?  You mean when you told us that things were safer than ever over here? Is that when I was made aware?     Yeah, I signed a bunch of things.  Yes. I signed the contract. Yes!  Yes. That's completely correct. What is the point of all this?  Wait, wait, wait --  No. Wait --  We...we were just friends.  This is bullshit.  What about my insurance money? My family will need that money...  You son of a bitch. You can't do this.  You can't do this!  Go to hell.  You people can't just wash your hands of this. You bastards put me here.  Come on...  Answer the phone!! 72.   Why won't you answer?!!  They're dead.  I just do.  I know. I felt it. Did they know I was here?  Did they care?  These people that took me -- if they're dead, they can't tell you where I am.  You tried that already.  It's over, isn't it?  What should I do?  That's right -- just like everyone else on the planet, there are some things you know and some things you don't. 74.  Yeah...me too.  This is Paul Steven Conroy. Social Security number 048-32-1198, date of birth 3/19/68. This video will serve as my last will and testament. To my wife, Linda Conroy, I leave the seven hundred dollars in my personal savings and whatever I have left in my annuity. To my son, Shane Conroy, I...I don't know. I don't have anything else. My stuff, like, my clothes. I wish I had more...I wish I had done more. Your dad wasn't really much of anything, Shane, I'm sorry. Maybe if I was a famous baseball player, or a guy who wore a suit to work, I would have more to leave you. But, you can be one of those people if you want. You can be whatever you want. Just promise me that when you get older, you'll take good care of your mom. And promise me that you'll always try to do the right thing, no matter what. I love you very much, Shane. Maybe I never said that enough...maybe I did, I don't even know. That probably means I didn't. I'm sorry, Linda. I should have listened to you. 75.  You're not dead.  Hello? Hello?!  I don't know.  I don't know where the money is.  I'm not lying! I swear.  I'm telling the truth. 76.  I can't!  I need more time. Please.  There's sand pouring in here. I can't...it's everywhere. Please, let me out of here and I will get you the money.  What?  No.  I'm not doing that.  No.  That's right, no. You let me out of here, and I'll cut off my whole God damn hand if you want.  Yes, I do. And a son. A young son. I want to go home...to see them. Please, sir.  Yes. Sir. I say that out of respect...to you. 78.     That's...you're lying. You're nobody...all of you. You can't get to them.  No. You're peasants, criminals, that's all. You don't even know where Michigan is.  You looked at a map. That's all you did.       Don't stay at the house, whatever you do, do not stay at the house. The guy...the kidnapper, he knows our address. He stole my license and now he knows where we live. Go to the Sheriff's station if you have to, just don't go home.   Holy God.  Brenner, where are you?! He's alive! He just called me! Call me right away! The fucking guy is still alive!         Oh my God. Oh my God.  Holy shit. 81.  Yeah?  I'm...here.  You're coming?  How do you know?  You're coming for me?  You have to hurry.  No...you have to hurry. The sand...it's filling up fast.  Okay. I believe you. Thank you. Thank you.  I have to go!  Call me right back.  Call me right back.  Linda.  It's me, sweetie.  I'm...okay.  It's going to be okay now.  That's okay. It's all okay. They're getting me out.  The people. Americans. They found out where I am and they're on their way to get me.  It's all going to be okay.  I'm okay.  You're not.      I should have never come here. You were right. I'm sorry. 86.  I will.  I will. I swear I will.  They're here!  They're calling me right now. I have to go.  I will. I love you.  I swear. I have to go.  Brenner?  It's me.  You have to hurry. It's almost full.  Hurry! Please!  I can't...are you close?  I can't hear you! Where are you?  Hurry! Please!!!  Hurry! Where are you? I don't hear you? Please hurry!!!  What is it?!  What?!!  You said...!  No.  No!! No!! NO!!!",
        "Conroy": ""
    },
    "imdb_rating": "7.0",
    "description": "Waking groggy in pitch darkness, Paul Conroy, an American truck driver working in Iraq in 2006, slowly realizes he is trapped inside a wooden coffin, buried alive. With his cigarette lighter, he can see the trap he is in, and he quickly realizes that there's not enough air for him to live long. He finds within the coffin a working cellphone, which allows him contact with the outside world. But the outside world proves not to be very helpful at finding a man buried in a box in the middle of the Iraqi desert. Paul must rely on his best resource--himself.—Jim Beaver <jumblejim@prodigy.net>",
    "name": "Buried",
    "genres": [
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZTRmZmIxMDktZjVmMS00NmFiLWExNmMtMzg0MTIyZDYwNWZjXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_QL75_UY281_CR6,0,190,281_.jpg"
}