{
    "filename": "Burn-After-Reading_script.txt",
    "imdb_id": "tt0887883",
    "imdb_url": "https://www.imdb.com/title/tt0887883",
    "characters": [
        "Chad Feldheimer",
        "Krapotkin",
        "Alan",
        "Katie Cox",
        "Divorce Lawyer (as JR Horne)",
        "Harry Pfarrer",
        "Linda Litzke",
        "Sandy Pfarrer",
        "Olson",
        "CIA Officer",
        "Peck",
        "Osborne Cox",
        "Tuchman Marsh Man",
        "Ted",
        "CIA Superior (as JK Simmons)"
    ],
    "dialogues": {
        "Chad": "I'm sorry, was that too much?  Well you're pretty tight.     You have to feel it or----  I'll be back in a minute.     We'll work on opening those hips.  Oh wow.   Any good?  Click on, uh... yeah...  What?  Cripes.   Did you have to send a picture?   That guy----wait----that guy wasn't bad.   No, before.   Yeah.    He uh, he might not be a loser.   That's a Brioni suit.   Shit yeah.   He looks like his optometrist has a sense of humor.      ... Huh-huh-huh. What does he do?  That's cool.  Plugs.  Hi Linda.     Did you call that guy?  Holy shit...  This is some heavy shit.  No... fuck...  I can't believe this... This is like... intelligence shit.  This is, like, I can't believe this shit I'm seeing.  Manolo found this, like, CD just lying in a locker. Locker floor. Ladies' locker room.  And I'm like, whoa, someone's music or what, so I come in here and it's these files, man.  Like it's talking about SigInt, and signals and shit. Which, Signals means code, you know.  Talking about like, section heads here, and their names and shit. And then these other files are just, like, numbers. Arrayed. Numbers and dates and numbers... And numbers. I think                  * that's the shit, man. The raw intelligence.  Wul... Throw it out?  Put a note up? Highly classified shit found, Signals intelligence shit, CIA shit? Hello! Did you lose your secret CIA shit? I don't think so.  Look,   Manolo...  ...you didn't find this.  Yeah, I know, but­  Omygod.  Omygod.  Uh-huh. So, like, I couldn't tell you this on your totally unsecure phone, but I know who the guy is.  The guy, the secret guy.  Um. I don't know if he's high up. Probably. I mean, I know his name, not like his rank.  Osbourne.    Cox.  Oh, like you're so plugged in to the intelligence community.  Well I think like the quality of the intelligence dictates how high up he is.  Not what we know.  And I also got his----do you have any water? I gotta hydrate.  Are you kidding?  Sources.  Do you have like Gatorade? Anything besides, like, Maryland swamp water?  ... You know how far this is from my place?  I have this geek friend, Ernie Gallegos? He does computer stuff, hooks up people's computers and programs their VCRs'n shit? So he examines the files and he pulls off the digital watermark that tells what computer they were created on. Fucking child's play for Ernie.  I also have his telephone number. That was a little harder.  Shall we give him a tinkle?  Because he's gonna wanna know that his shit is secure. You know, he's gonna be relieved. He might even be so relieved he gives us a reward----I would be very fucking surprised if he did not.  Very surprised. Like, you know, the                            * Good Samaritan tax. Which is not even a tax, really, since it's voluntary.  Hello?  Osbourne?    Osbourne Cox?  Are you... uh... Osbourne Cox?  I'm a Good Samaritan. I'm sorry I'm calling at such an hour, but I thought you might be worried.  About the security.     Of your shit.  Your files----your documents. I know these documents are sensitive. But I am perfectly happy to return to you your sensitive shit. At a time of your choosing.  ... Osbourne Cox?  Settle down, Osbourne.  (referring to his  Don't blow a gasket, Osbourne.    I have----   It's not important where I----   Oh! Why so uptight, Osbourne Cox? I'm just a Good Samaritan, like, a traveler on the road who has happened upon----   Linda, I'll do it!   You know, this is a major inconvenience for us and we thought, you know, a reward----  Well, yeah, uh... why not? I mean, this is not----am I out of line here?  Hello?   We just----  (into the phone as he  ... Geeze...  ... I am very fucking surprised he did not give us the reward.  But it doesn't sound like he's gonna play ball.  Well, that's----he sounds very senior. I think this is some senior guy who has screwed the pooch, big-time.  Yuh-huh.  Yuh-huh.  Right.  Yup.   It sure has.  Big time.  Well----you mean----go home and change?  I was gonna ride my bike.     Do I have time?  Osbourne Cox?  Yes I am.    You have the money?  That's what was agreed upon, Osbourne Cox.    Appearances can be----deceptive.   I am a mere Good Samar----  You think that's a Schwinn?  As soon as you give me the money, dickwad! I'm not----Huhgf!  ... You fuck!  You fuck!     You fucker!  You're the fucker!  He hit me!  He didn't give it to me­  That fucker!  ... Hey----what're you----  Oh shit!  Wait, wait! We gotta go back!  We gotta go back!     My bike!  It's just a Kryptonite lock----you can open those fuckers with a Bic pen!  Where we going?     My bike!  ... What is this?      Is there a men's room?  Very high up.  I'm just saying he's high up!  What?      Oh, yeah.   Yeah, he seems cool.  ... That fucker really hit me.  Name, rank and serial number.  We, um... we know our rights.  I don't think so.  I'm at 1442 Westerly----  I just----  It was unavoidable.    This won't happen again.  Why did you tell him we could get more stuff?  That's all Manolo found! That was everything! What're we, gonna tell Manolo to scoop some more secret shit off the locker room floor!  What.     Yuh-huh.   I'm sorry.   Right: Osbourne Cox.   Um.    I guess.   Why?   His neighborhood?     Laundry marks?                                               *  Okay.  Nuhhh!",
        "Feldheimer": "",
        "Krapotkin": "----Not exactly. I am assistant cultural attaché. The organs of state security are not allowed to function within the borders of your country.  Yes.  Yes.  May I ask the source of this...  PC or Meck?  Could you wait please?      Heh-heh.  Yes?  You are joking?  Yes?   Why is that?  Do we have him?  Um...  Is he not... at Hardbodies?  Yes, madam. Can we help you?  I am so sorry, madam.   An urgent matter.  I don't know the whereabouts of Chad, madam.  We're not interested in such \"information\". It was drivel.  Would you like your disk back?  I'm so sorry I can't help you.",
        "Alan": "",
        "Katie": "You're home.  Did you pick up the cheeses?  Were they ready? I didn't know you were coming home this early.  I left a message for you to stop at Todaro's. The Magruders and the Pfarrers are coming over.  What?  She said.    She would give you.   The message.  So you didn't get the cheeses.  Oh for fuck's sake, Ozzie, you mean I have to go out again? All right, well, you better get dressed.  Not right now. They'll be here in, what, less than an hour.  You should try the chevre, Harry. It's very good.  Harry works with the Marshalls'                       * Service.                                              *  Why don't you let your wife tell them about her own books, Harry?  Here, come in the kitchen, help me with the crudités.  Knows what?  Don't be an ass, he doesn't know a thing.     You quit?!  Well----Thank you for letting me know!  You tried? You tried? And then---- what, the aphasia kicked in?  Why?!    For fuck's sake, Ozzie!   You're tired.   Uh-huh.   Did you get a pension, or severance or something, or----   But I suppose my benefits are all right, I suppose you can live with those, is that the idea?   Yes?    Yes?     What're you gonna do?   Consulting.   Write.    Write what.     Yes. This is my fear. He's trying---- he says----he's trying to pull himself together, but...  No.  Ozzie!  I'm thinking of divorcing Ozzie.  That's what you were just saying.  So if I were divorced----  Why's that? I don't see that.  She's a cold, stuck-up bitch.  You and I should sort things out. I've told you that this is not just frivolity.  I thought I was loud and clear.  Who is it?  Who is that?  Ozzie, what is going on.   What in God's name is going on?  Your what?  Your what?  Why in God's name would they think that's worth anything.    It'll piss Ozzie off.  Mr. Terikhian, I have given my husband second chances galore. There are limits to my charity.  Yes.   Understood.  ----which to my mind is all the more reason to lower the boom on Ozzie.  That's it?     \"Mm\"?  Of course it's the right time.   Why wouldn't it be the right time.   Does it threaten you?  Is that how you see me, \"hammering\" him?  Weren't those your words?  I don't \"hammer.\"  He didn't lose it, he quit.  Maybe. As long as we're talking about Ozzie and not you.  Please get the check.  ...Yes?... Yes?... Is there blood in his stool?...Yes, soon.  It's after two. I have to get back to work.  Ozzie! Goddamnit, Ozzie, what have you done to the car?!  Ozzie!  ... All right. All right.  Can I see you please. Harry, please call me. I'm very upset.     Five.  For fuck's sake, Harry, it's five miles. Five point two.  I'm surprised you have any energy left.  You are very coarse.  Ach.   I'm late----  You seem distracted.  Very distracted.      The last two days.  ... That's enough carrots, don't you think?  For the salad?  ... What?  Harry: stop the foolishness.  Yes. And behave.    You are not talking to one of your...  ... \"shithole buddies.\"",
        "Cox": "Beyond, the open bedroom door shows a slice of hallway and stairs. Harry arrives at the top of the stairs. He nudges back a drape on the window at the top of the steps. He looks down one way, then the other. He lets the drape fall back and seems to relax.  Harry enters the bedroom. He strips off his shirt and steps out of his pants on his way into the bathroom off the master bedroom. He leaves the door open.  Chad reaches gingerly for the closet door to close it but stops abruptly as we hear the shower turned off and the curtain whipped back. Harry emerges from the shower. He rinses off, humming \"Born Free,\" and walks into the foreground pulling on shorts and shirt and a pair of dress pants that was draped across a bureau.  Chad shrinks back into the closet as Harry approaches.     Harry stops, just outside the cracked door.  Through the crack we see only the white of his shirt. Abruptly Harry turns his back to us and recedes into the room and bends to pick something off the floor.  Chad leans in ever so slightly to see, but draws back again as Harry approaches.  Chad looks over to his right: on a hanger, the brown pinstripe coat that matches Harry's pants.  The closet door is thrown open.",
        "Harry": "Because I have lactose reflux.    But I can----  Yes, but I can----  I know what they are.  Thank you for correcting me.  Yeah.   I can eat goat cheese.  ... I was just explaining to your husband here, I have a condition----  Used to work for Treasury, but I                      * didn't go over to Homeland Security.                  * I'm with the Marshalls.                               *  Very amusing. The gun is actually no big deal. Twenty years in the marshall's service and I've never discharged my weapon.  What?   I don't have a psychiatrist.  Sandy writes children's books.  Oliver The Cat Who...Who..arghh----Who----  ...Who Lives In The Rotunda.     Excuse me.  Yeah, it's a beloved series. You wouldn't believe her fan mail. Unghh. Are you sure this is goat cheese?  I'm sorry----was I----  Goddamnit.     He knows, doesn't he.  ... Nice floors.  About us, he knows about us.          Little prick.  What is that, forbo?       What a horse's ass.  Well, she's all right.  I should try to get a run in.  ... and then, you know, you grow up. I guess that's what's happened with me. You just... people change. We married when I was, what, in my mid- twenties. A kid. We were kids. Twenties. You think it's forever. Then, you know, you're older----you begin to feel your mortality, you start to think, well, there's no more time for dishonesty. Subterfuge. You go, I'm not that person. The choices you made, you can't, just through inertia----  ... I'm just thinking, Whoa. I mean, frankly, I'm thinking, Whoa. I, I, I guess that's what I should be thinking about too. With Sandy.  Yes! Absolutely! And you should be getting rid of that bozo.  No question about that. I agree.  Well yes, if you were uh, you know, yes. Yes, I should settle things. With Sandy. Because of you and me. It just takes, courage, you know. To inflict that pain. Scary stuff.  Scary stuff. You're a brave lady. Well, of course, it would be easier for you.     Well that's... a little----  No, that's understood.   You've been very straight.  Absolutely. Not just fun and games.  ... Absolutely.    Yeah, yeah, it's me.  Huh?  Oh baby.     Top secret.  ... You're gonna knock 'em dead.  ... How many cities?  Why do they always have you do Seattle. Not a big market.  I can think of a couple of things.  I'll be sad. But I'll be okay.  Just the right amount.  ... I am crazy about you, baby.  Yeah, I did the whole bodyguard thing for years. My guy was in State, the Secretary in fact, so of course I traveled a lot.  ...\"Ironside is leaving the building.\" We called him Iron Ass.  ... Not to his face, of course.     Not to his ass, either!  ... Ah, he was okay. But, Personal Protection----that's a young man's game.  Sure...  ... Does it have shellfood in it?                      *  `Cause I have this sensitivity. I, uh,                 * go into anaphylactic shock. My larynx                  * swells up, closes off the----Ah what the               * hell.                                                  *  Live dangerously----                                   *  ... Can't always wear a condom.  Anyway, my job's more administrative                   * now, not so much PP. Personal                          * Protection. Though I still carry the gun.    in a situation where your man is threatened the training kicks in. Muscle memory. Reflex----Those are outrageous.  ... Wanna swap?  ----but there was just a hell of a lot of political infighting, petty, petty, shit, and then basically the old man stepped on Goldberger's throat. Nice...  ... Wide-plank pine?  Listen, full disclosure here Linda...  ... I'm not wearing a wedding ring but I am married. Took the ring off, what, eighteen months ago when we agreed to separate. Agreed to disagree. That's about the only thing we ever agreed on.  Well, full transparency, the only way to----  Well let's go in the other room and find out!   Grrr!  Mm.  I'm just... wondering if it's the right time.  No no. No, you and me are rock solid. That's why I, uh, I think we can afford to be big. We can think about Ozzie, whether maybe we should let him get himself together a little before you hammer him with, um----  Of course not, but----  Yes, but----  No, uh-huh, of course not. But, I'm saying----I'm no friend of the guy. You know that. I think he's an arrogant little geek. But for Christ sakes, you and me have all the time in the world, and he just lost his job----  Yeah. Most of the people who \"quit\" in this town were fired.  ... I feel sorry for the guy. And he'll be easier to deal with when he doesn't feel... cornered.  Of course we're talking about Ozzie. Baby, I stand by you whatever you do. I adore you.  I love you so much.  Sandy and I aren't here to take your call. Please leave a message.  No no, doesn't start for five minutes.  ... You haven't seen this, have you?  I hear it's terrific.     Pardon our dust, I, uh----the ex is in the process of moving out. Damn! I told her I wanted to expedite this.  We, uh, you know you try to act like an adult.  Oh! Come on downstairs.    Do you like surprises?  I gotta tell ya----I saw an ad for this in a gentleman's magazine----twelve hundred bucks. I take a look at this thing, I think, Jesus, you gotta be kidding----I'm a hobbyist, this is basically nothing but speed-rail, I could probably go to Home Depot and whip this up myself for, like, a hundred bucks...    Isn't that somethin'? Hundred bucks all-in if you don't count my labor. And the, you know----cost of the dildo. Those things are not cheap.  But I lack the, uh, I'm not set up to mold hard rubber.  What's the odometer say?  About five or approximately five?    I mean----about f----  Okay, fine----I gotta do at least five. Five and a deuce is okay.  You kiddin'----pull around the corner we'll do it again in back!  No, back of the car.   I didn't mean a rear-entry, uh----                 ... Hello?  ... Hello?  Hungh!  ... Hello?  ... Omygod. Omygod.  ... Omygod who are you. You fucker. Omygod.  ... You fucker...  ... Omygod, my god... Ungh...  ... Omygod...  ... What the fuck...  ... Oh my fuck...  ... I killed a fucking spook.    You fucker...  ... What are you doing here, you fucker.    Nn.   Work.  Huh?  You know: you're really a very negative person.  I've tried. To ignore it.    And stay upbeat.  Stop the foolishness?      Honey.    It's so good to hear your voice.  No. Yes. Can you come home?       Your baby needs you.  ... Can you please come home?  I can show you your present.     It's finished.  Yeah.  Yeah.  Okay.   Yeah. Love you too.  Hey!    Fucker!  Fucker!   Fucker!  Who do you work for?!   Who do you work for?!  ... Tell me!  ... Who do you work for? CIA?     NSC?  What?  ... Tuchman Marsh?  Your name is... Tuchman Marsh?  You... work for Tuchman Marsh.  Which is a law firm.  Well... why are you following me?  My... my wife hired you?!  You're----you're----a divorce detective.  But this is divorce.  Yeah?  Yeah?  You can't tell her anything she doesn't already know, fucker.  You want... Sandy's number?  You think a marriage is... and then you...  Was it?  ... Well, yeah... right...    ... What?    What's wrong, baby?  What's wrong, baby?     Harry's here.  I'm sorry, baby----  I'll be good. I'll be better.     I just need to exercise. Are there pedestrian paths around here?  ... Who the fuck is Chad?  Wait a minute, what's his name?   What happened?  Okay.  You know his social security number?  It's okay. That's okay.     What's the last place you saw him?  Okay baby. We'll find your friend. Missing person. Piece of cake.  Hello there sunshine.    You look great.  Yeah, I snuck in a little gym time this morning. And our exercise last night didn't hurt!  Boy, I am through banging my head against the wall. I am gonna start doing what's right for me.  Yeah! Hell yeah! I mean I had a shock recently, and I realized you know, life is not infinite. No one's immortal.  You have to get from each day its full, uh, squeeze the juice from every day because there but for the grace of God----  That's right, don't sweat the small stuff...  ... and it's all small stuff.  This is where we first met.   Remember?  You never know what the important days are, until... until, um...  ... I told myself I was gonna stop being paranoid, but... is that guy looking at us?  Nothing yet, I've made a couple calls. I don't think it'll take long.  Oh yeah, there are so many data bases now it's a joke...  ... Back when I was in PP there was still some art to finding people. Not any more. And now with the cell phones? Pretty soon they're gonna know where everyone is. Everyone. At any given moment. I mean it's almost the reality now. You would be amazed.  Did he----when you left the Jamba Juice ----did Chad say anything about where he might be going?  Oh yeah?  Who are you?",
        "Pfarrer": "",
        "Linda": "And what about the face, you know, the window to the soul.  Baby crow's feet. Little chickling's feet. I mean chicks. Chickie chickie chickie.  Yeah, I don't wanna look like Boris Karloff.  No, I'm all woman!  Yeah, I don't want to get anything burned off.  Not with these ham hocks!  Well I don't know. Is the vaccine thing----can you counsel me on this? I don't know, is it unsightly? I see it a lot, a bunch of people have it.  Chad!       I got a batch from BeWithMeDC dot com.  I don't know yet, just looking... How do you open this?  Oh my god!  Oh my God, what a loser!  ... Loser!  ... Loser!... What is this! They should call this Mr. Saggy dot com.   Loser!   No, only guys do. I submitted a verbal profile, turn-ons, turn-offs, et cetera. I'm really looking for someone with a sense of humor.   Him?   Him?   How can you tell?   Oh yeah?     State Department.  His hair is... what is that?  This is the cardio area. A lot of machines here so that, believe me, there's never a wait. What you're seeing now, this is our busiest time, and there's still a couple of open treadmills I see, three Stairmasters---- I call it the Butt-Blaster----couple of LifeCycles----Hi, Chad.  Not yet! Chad is one of our trainers. I've just started internet dating and I got my first look at the, uh...  BeWithMeDC dot com?  Have you used them?  That's fantastic.      Yes!  ... English!  ... Agent!  ... Agent!     Agent!  ... Yes, hi, this is Linda Litzke, should I give you my account number? You have it up? Okay. I was informed that I needed pre-approval for these surgeries, and then... Yes, it was denied.  ...No, those are four different operations... It's very complicated; I'm reinventing myself, it's a whole new look so it isn't just one thing, however, it's all approved by my doctor... But----madam! This is not----my job involves, you know, public interface! This is not...  ... Yes I do understand. Could I speak to your supervisor please?       Alan?               Oh for Pete's sake!     English!... Agent!... Agent!...  Ted, can I talk to you about our Mickey Mouse health plan?  Is that my date list?  You know, I'm trying to reinvent myself, and these procedures, which are so incredibly not cheap, this Micky Mouse HMO is saying they're not, they're... What is this?  What is it?  You can't do that! You should put a note up in the ladies' locker room.  Absolut Saketini, please?  You know, it wouldn't cover all of it, but if I got some advance on my salary I could at least get the surgery ball rolling.  Well why do they have us on a cockamamie health plan? I need these surgeries, Ted!  Ted, I have gone just as far as I can go with this body! I----  That's right, Ted, I would be laughed out of Hollywood. I have very limited breasts and a gi-normous ass and I have this gut that swings back and forth in front a me like a shopping cart with a bent wheel.  I am trying to get back in circulation. I have appetites and so forth, and, uh----  Yeah----losers!  Omygod----is that you?!  Well jeez, that's a good job!  What happened?  Well that's my point! I don't want to stay where I am! I want to find someone to share my journey!  That's right! That's why I've started this internet dating!  Look Ted, I know you can't authorize an advance on my salary but you can put in a request, can't you?  Ted, have you ever heard of the power of positive thinking?      Hurrow----  Hello?... Where are you?... Okay. Just a second.     Chad, you know what time it is?  The guy?  Is he high up?  What is it?  Never heard of him.  I'm just saying, to the layman----  Uh-huh.  Uh-huh.  I have tap water  How did you find out who he is?  What do you mean sources?  How do you know his name?  Uh-huh.  Omygod!  Omygod, why?  Oh, wow.  We're going to return it, we just thought----   Like a Good Samaritan tax----   You warn us? You warn us? You know what, Mr., Mr. Intelligence? We warn you! We'll call you back with our demands!  Chad!    Don't play his game!  The nerve of that guy!     Oh, he'll play ball! We just have to let him know who's boss.  Yeah, that's why we got him, you know, we've caught him with his thing caught in a big fat wringer.  And us in the driver's seat. This is our opportunity, like, you don't get many of these. You slip on the ice outside of, you know, a fancy restaurant.  Or this happens.  And right now this has happened.  This could put a big dent in my surgeries.  Harry?    I'm Linda.  You wanna try these dumplings? They're                 * delicious.  Shellfood?                                             *  That's right! Not always!  Omygod,     really!  No way!      I guess.  Thanks for telling me.     I really do appreciate it, Harry.  That's not gonna go off, is it?  He's very very communicative. Very accessible. He has a sense of humor. And he agrees one hundred percent about my surgeries.  He thinks my ass could be smaller. I mean, not in a mean way, he kidded about it----he's got a terrific sense of humor.  I told you, he's in the Treasury Department and he----  Yeah, so am I!  No, you can't go like that!     You gotta wear a suit.  Yeah!  Where's the money?  Where's the money?!  Oh, for----Get in!       That'll give him something to think about.  I knew this would happen.  It's on to Plan B.  Heavens sakes----  Some people!  Russian Embassy.    I told Mr. Krapkin I might be stopping                      * by?  ... The organs of state security?  But if I had, oh, say, secrets of a highly, um, secrets that would interest the organs of state security...  ... This is just a taste.  No you may not.  Chad!  Um.    PC.                                              *  Well----  ... I have a date----  The fish.      Has bitten.                              *  Well----okay...  This is just a taste.  There's a lot more.    But we need to be paid.  Look, I have a date.  Date.  We work at the Hardbodies in Alexandria.  Chad, not your home address!  No.    Linda.                                             *      I'm sorry.  Yes we do.     I'm sorry, Ted.  We can't. I... I... Ted, I know this is terrible, but----I have to run. I have a date.  I'm sorry----am I late?  Oh!   No, no I haven't.  Uh-huh.  Oh, it's never easy.  Well, I'm very open to new experiences...  ... What is it?  Omygod!  ... It's fantastic!  Uh-uh.  Well maybe we can.  Hey!  I don't like the snideness!    Nor the                * negativity!   I'm just trying to work this thing! If I'm going to reinvent myself I need those surgeries. And those surgeries cost money! This is not just fun and games!   So let's figure this thing out!   We know who he is   So we can find out where he lives, right?   You should change.   Into your suit.   So you don't look out of place in the neighborhood. There are certain elementary things.   Yes. We'll remove the laundry marks and labels. And you should not be carrying ID.  Deniability.             I'm fine, Ted, I'm sorry.  No no, I'm... I'm...  Oh, I know you're trustworthy, I just... don't want to endanger other people with----I mean, it's a path I've chosen, it's not, you have to isolate, you know, a firewall.  I know, Ted.  I know, Ted.  No! No no no, Ted!   Just, just. .   .  Give me twenty-four hours!  To, um... I don't know, twenty-four hours!  Just give me twenty-four hours to solve this thing!  Foreigner?  Ted, we know what we're doing. Let me ask you this: did he know my name.  Thank you, Ted.  Omygod!  ... Hello? Mr. Krapkin?                                  *  Yes?  Yes, yes!----hang on.    Ted, I'm sorry. This is private.  ... Hello.     Is this a secure line, Mr. Krapkin?                                               *  Mr. Krapkin?                                           *  Is this a secure, uh----  No! I----I'm terribly worried about my associate. My----my----you know... Chad.  Do you have him?  Is he----I don't know what the term is, did he, \"go over\"?  Do you know where he is?  No, I----look, can I come in and discuss this?  What kind of Mickey Mouse embassy are you running?! I've been waiting here for fifty-five minutes, and I'm----  Well this could be urgent too, since, you know, Chad has been missing for forty-eight hours now and----  Well he was gathering information for you when he----  ... Dribble!  ... Dribble!  I'll tell you what's dribble! You listen to me, Mr. Krapkin! I am----  Cut it out.  But Ted, I can't do it, I don't know anything about computers.  My world is bigger than that, Ted. There's other people. There's the Chinese.   It's not just the surgeries, Ted! It's not just the money! We can use it as leverage! To get Chad back!   Information is power, Ted!     Hel-lo!   Somebody has him.    And we can----   I can't take it! I can't take it! I can't take it! You know I can't do that! We're operating off the map here, Ted! This is way higher than the police, it's higher than that!   I need a can-do person, Ted! I hate your negativity! I hate all your reasons why not! I hate you! I hate you!            Hurrow----  ... Hello?      But this was a long time coming.  You're depressed, Harry.  It can't always come from me, Harry! I'm not that strong!  You're not here for me! I need a can- do person! You're all... defeated!  Chad is the only can-do person I know and he's gone, Harry, he's gone.  Could you help me find him?  He's a friend from work. You know law enforcement people, right? You could call, unofficially?  Chad Feldheimer. He just disappeared. He hasn't been at work or at home for two days.  He----  Huh?     NO!    I----    Well you seem better.  Harry!  That's how I believe, also.   You have to do what's right for----  No one's immortal.  Exactly. The important thing is to maintain a positive outlook. Always up. Always ebullient.  Of course I do.    ... Have you found out anything about Chad?  Really?  Uh-huh.  Oh, I know where he was going.  A residence in Alexandria.    On Hillsboro Drive.  ... 2055 Hillsboro.  ... It's, um. The residence of a guy named Osbourne Cox.  I'm ... just ... Linda Litzke.  ... Harry!                       Oh for Pete's sake.",
        "Litzke": "",
        "Sandy": "I write children's books----  I don't know why we see them.  She is a cold, stuck-up bitch.  Harry?      Is that you?     Honey!  Honey!  My cab is here, I'm off.      Mystery man.  ... What is that thing?  Seattle, San Francisco, Los Angeles, Chicago.  I don't know, lots of independent bookstores. Rains all day, what are people gonna do.  You can think of one thing.  It better be the Peninsula. The money I make for them. Are you gonna be okay?  Not too sad..  Hello?  Something wrong, Harry?  Harry, you know I----  Oh Harry.    I can't just leave the book tour.  There are two days left.     There's still Seattle.  I love you, Harry.  Hello?  Yes?  ... Hi.  You've written a children's book?  Pappas &amp; Swain do children's literature.  Very well thank you.    And you.  Yes.    Good talking to you.    Thank you.  That wasn't discussed.  I'm sorry, I made plans.  It's fine.  It's fine.     Thank you.   We're finished.  Thought that would never be over.  Let me scrub this crap off my face.",
        "Olson": "Yeah, hiyah.",
        "CIA": "",
        "Officer": "",
        "Peck": "You have a drinking problem.  Come on, Ozzie.  Ozzie----",
        "Osborne": "",
        "Ted": "Uh-huh... Hang on...  I am not comfortable with this.  Manolo found it.  I am not comfortable with this.                       *  I am not touching this.    I want this out of here.  Look, you figure it out, I am not comfortable with this. I want this                   * out of Hardbodies...  ... We're running a gym here!  Just a Tab.  Whoa! There's a payroll company, you know. They don't just advance people money. They just don't do that. I mean, sure, I could say, Yes, I                           * authorize it, but that's not going to mean anything to them.  You're a beautiful woman!   You don't need­  I think it's a very beautiful----it's not a phoney-baloney Hollywood body----  Oh come on!  Well there's a lot of guys who'd like you just the way you are.  Well, I don't know. Am I a loser? Lemme tell you something. I wasn't always a manager at Hardbodies. I, um...  Let me show you something.  Fourteen years, a Greek Orthodox priest. Congregation in Chevy Chase.  Mm-hm.  Well...  ... It's a long story. Anyway, lotta ways I'm happier now. My point is... my point is... it's a journey.  Well, sometimes, you know, you don't look in your own back yard, you're never gonna see----  Uh-huh, but I'm saying, maybe you don't have to, you know... to----  It's not going to do any good, Linda.       That's great. That sounds... exciting.  Well, I----  That's good, but... but... Linda, what do you really know about this guy?  But he could be one of these people who, you know, who cruises the internet----         A line to check in, towels piling up.  Manolo running around like crazy----what happened to your nose?  This is not acceptable at Hardbodies. You two know better than that.  This is no way.  But you won't tell me what's going on.  You're changing, Linda.  ... Very sad.    Linda.   You okay?  You don't look fine.  You won't tell me what it's about. You never let me in, Linda.  Uh-huh. Well, I don't know what to think. You both go AWOL on Friday; today Chad doesn't bother to come in at all----  Linda, I can't run a gym this way.  I'm going to have to fire him.  What?  To what?  Linda----  Linda. I have to tell you. A man was here earlier asking about you.  Linda, are you in some kind of trouble? Is Chad running from something?  Whuh----yes, he was asking about you. Employment history, et cetera. Real jerk. I told him to get lost.  Well, we...  ... we just don't give that out at Hardbodies.            No-o-o-o-o-o way.   No way.   Whoa.   No way, Linda...  ... No.  Linda, the whole thing is crazy. It was crazy the first time, and you want to do it again? Break into the man's house? And why would----why would----you said the Russians didn't even want this stuff!   Linda, these surgeries----   What do you mean \"get him back\"!   What do you mean \"get him back\"!      You don't know where he is!   You ask the police to help you find missing people! And you----   Linda, I----   Seven &amp; Seven.  No.  I'm not here representing Hardbodies.  I don't represent that, either.  She's not----  No.  Ah!  Oh!"
    },
    "imdb_rating": "7.0",
    "description": "Osbourne Cox, a Balkan expert, resigned from the CIA because of a drinking problem, so he begins a memoir. His wife wants a divorce and expects her lover, Harry, a philandering State Department marshal, to leave his wife. A CD-ROM falls out of a gym bag at a Georgetown fitness center. Two employees there try to turn it into cash: Linda, who wants money for cosmetic surgery, and Chad, an amiable goof. Information on the disc leads them to Osbourne who rejects their sales pitch; then they visit the Russian embassy. To sweeten the pot, they decide they need more of Osbourne's secrets. Meanwhile, Linda's boss likes her, and Harry's wife leaves for a book tour. All roads lead to Osbourne's house.—<jhailey@hotmail.com>",
    "name": "Burn After Reading",
    "genres": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYzYwMjZhOGEtMGZlZS00Mjg1LTlkMDktYzJiZDU4MzAxZDRiXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}