{
    "filename": "Coco_script.txt",
    "imdb_id": "tt2380307",
    "imdb_url": "https://www.imdb.com/title/tt2380307",
    "characters": [
        "Papá Julio (voice)",
        "Clerk (voice)",
        "Mamá (voice)",
        "Héctor (voice)",
        "Tía Rosita (voice)",
        "Chicharrón (voice)",
        "Abuelita (voice) (as Renée Victor)",
        "Papá (voice)",
        "Miguel (voice)",
        "Tío Oscar /Tío Felipe (voice)",
        "Ernesto de la Cruz (voice)",
        "Plaza Mariachi /Gustavo (voice)",
        "Mamá Coco (voice)",
        "Frida Kahlo (voice)",
        "Mamá Imelda (voice)"
    ],
    "dialogues": {
        "Clerk": "You the Rivera family?    Well, you're cursed.  Día de los Muertos is a night to GIVE to the dead. You STOLE from the dead.  ACHOO! I am sorry, whose alebrije is that?  Whatever he is, I am -- ACHOO! -- terribly allergic.  And I don't have a nose, and yet here we are -- ACHOO!!  Well, since it's a family matter... The way to undo a family curse is to get your family's blessing.  Get your family's blessing, and everything SHOULD go back to normal. But you gotta do it by sunrise!  But not to worry! Your family's here, you can get your blessing right now.  Cempasúchil, cempasúchil.        Aha! Perdón, señora.    Nailed it.     Now say: I give you my blessing.  Well technically she can add any conditions she wants.        Uh, should we tell him there are no restrooms in the Land of the Dead?",
        "(voice)": "",
        "Mamá": "How are you, Julio?        Be back by lunch, mijo!  You know how Abuelita feels about the plaza.  ...Sign up?  Papá?  Papá is home...?  Papá is coming home?  Who are you?  No, no, no, no, no.  We have to make a clear path. The petals guide our ancestors home. We don't want their spirits to get lost. We want them to come, and enjoy all the food and drinks on the ofrenda, sí?  Papá?  Papá?  Papá!   Papá!  Miguel!   Get down from there!    Miguel!  I demand to speak to the person in charge!  My family always -- ALWAYS -- puts my photo on the ofrenda! That devil box tells you nothing but lies!  Oh, mi familia! They wouldn't let me cross the bridge! Tell this woman and her devil box that my photo is on the ofrenda.  What?!  Miguel?  What is going on?  Guitar...?  Ah-ah-ah! We do not speak of that... ...musician! He is DEAD to this family!  But none of this explains why I couldn't cross over.  You took my photo off the ofrenda?!  How do we send him back?!  Miguel.  I give you my blessing.  I give you my blessing to go home...  To put my photo back on the ofrenda...  And to never play music again!  Two seconds and you already break your promise!  Don't make this hard, mijo.      You go home my way, or no way.  I will not let you go down the same path he did.  Miguel!  Ay, he is going to get himself killed... I need my spirit guide, Pepita.  Who has that petal Miguel touched?  Have you found him, Pepita?      Have you found our boy?  Miguel.  He's close. Find him.  This nonsense ends now, Miguel! I am giving you my blessing and you are going home!  Miguel!   Stop!  Come back!     Miguel!  I am trying to save your life!  What?    Oh, I loved it. I remember that feeling, when my husband would play, and I would sing and nothing else mattered. But when we had Coco, suddenly... there was something in my life that mattered more than music. I wanted to put down roots. He wanted to play for the world.  We each made a sacrifice to get what we wanted. Now you must make a choice.    Mijo, I was so worried! Thank goodness we found you in time!  And you! How many times must I turn you away?  I want nothing to do with you. Not in life, not in death! I spent decades protecting my family from your mistakes. He spends five minutes with you and I have to fish him out of a sinkhole!  What?  He left this family!  And so what if it's true? You leave me alone with a child to raise and I'm just supposed to forgive you?  She's forgetting you...    Miguel, if we help you get his photo... you will return home?          No more music?  I -- I can't forgive you.        But I will help you.    Don't touch me.  Send Miguel home.  Now, we just have to find de la Cruz--  Ah!  That's for murdering the love of my life!  I don't know! I'm still angry at you.  And that's for trying to murder my grandson!  After him!  I don't know WHAT I said!  Miguel!   I have it!           Let go of me!  I forgot what that felt like.  Oh!  Miguel, I give you my blessing.  To go home... to put up our photos... And to never...  To never... forget how much your family loves you.  Miguel!  Miguel!  Miguel, it's almost sunrise!  No conditions.     We're all together now, that's what matters.  Look...  Elena?   What's wrong, mija?  My papá used to sing me that song.  I kept... his letters... poems he wrote me... and...  Papá was a musician. When I was a little girl, he and Mamá would sing such beautiful songs...  Papá!",
        "Héctor": "Yes, it is I. Frida Kahlo. Shall we skip the scanner? I'm on so many ofrendas, it'll just overwhelm your blinky thingie...  Okay, when I said I was Frida... just now? That... that was a lie. And I apologize for doing that.  You know what, I'm just gonna zip right over, you won't even know I'm gone.  Ha HA!  Almost there, just a little further...!  Fine, okay. Fine, who cares... Dumb flower bridge!  That's illegal?  Amigo? Oh, that's so nice, to hear you say that, because... I've just had a really hard Día de Muertos, and I could really use an amigo right now.  And amigos, they help their amigos. Listen, you get me across that bridge tonight and I'll make it worth your while.  Oh, you like de la Cruz? He and I go way back! I can get you front row seats to his Sunrise Spectacular Show!  I'll -- I'll get you backstage, you can meet him! You just gotta let me cross that bridge!  Can I at least get my costume back?  Some amigo...  Who wants to-- Ah! You're alive!  That's weirdly specific.  He's your wha-whaat...?  Wait, wait, wait, wait, wait. Wait, wait... Wait, no, wait, wait, wait. Wait, wait, wait, wait, wait, wait? Yes! You're going back to the Land of the Living?!  No, niño, niño, niño, I can help you! You can help me. We can help each other! But most importantly, you can help ME.  I'm Héctor.  Espérame chamaco!  Hey, hey, hold still. Look up. Look up. A ver, a ver... look up. Up, UP!... Ta-da!  Dead as a doorknob. So listen, Miguel: this place runs on memories. When you're well- remembered, people put up your photo and you get to cross the bridge and visit the living on Día de Muertos. Unless you're me.  No one's ever put up my picture... But you can change that!  Muy guapo, eh?  Such a smart boy! Yes! Great idea, yes! One hiccup: de la Cruz is a tough guy to get to. And I need to cross that bridge soon. Like TONIGHT. So, you got any other family here, you know? Someone a bit more... accessible?  Don't yank my chain, chamaco.      You gotta have SOME other family.  Okay, okay, kid, fine -- fine! I'll get you to your great-great grandpa...!  ...It's not gonna be easy, you know? He's a busy man. What are you doing?  No, skeletons don't walk like that.  No, I don't.  Stop it!  Blech. Every year, your great- great grandpa puts on that dumb show to mark the end of Día de Muertos.  Ahhhh--  That... that was a lie.      I apologize for that.  Cool off, chamaco, come on... I'll get you to him.  'Cause I happen to know where he's rehearsing!  Hola, Ceci!  Ceci, I lost the dress--  Ceci -- I know, Ceci. I know, I know. Ceci -- Ceci... Ceci. Ceci...  Chamaco! You can't run off on me like that! C'mon, stop pestering the celebrities...  That bum! Who doesn't show up to his own rehearsal?  He's YOUR great-great grandpa.   How come he didn't invite YOU?  Hey Gustavo! You know anything about this party?  Ha ha, very funny guys.      Very funny.  I don't want to talk about it.  I didn't choke, okay -- I got food poisoning, which is a big difference!    You are?  No, no, no, chamaco, you are loco if you think--  I know a guy...  Why the heck would you wanna be a musician?  ...Who spent his life performing like a monkey for complete strangers. Blech, no, no thank you, guácala, no...  We're almost there...  Keep up, chamaco, come on!    Eh!   These guys!    Hey Tío!   Qué onda!  Eh, in a way... We're all the ones with no photos or ofrendas, no family to go home to. Nearly forgotten, you know? So, we all call each other cousin, or tío, or whatever.  Tía Chelo!     He-hey!  Hey, hey! Save some for me!      Is Chicharrón around?  Who doesn't like a visit from Cousin Héctor?  Buenas noches, Chicharrón!  C'mon, it's Día de Muertos! I brought you a little offering!  I would, Cheech, but the thing is... me and my friend, Miguel, we really need to borrow your guitar.  Yes?  I promise we'll bring it right back.  Uh...  Ah, you see­-  No, no, not like those times.  Whoa, whoa -- you okay, amigo?  You know I don't play anymore, Cheech. The guitar's for the kid--  Only for you, amigo.     Any requests?     There are children present.  He's been forgotten. When there's no one left in the living world who remembers you, you disappear from this world. We call it the \"Final Death.\"  No one knows.  No, it doesn't work like that, chamaco. Our memories... they have to be passed down by those who knew us in life -- in the stories they tell about us. But there's no one left alive to pass down Cheech's stories...  Hey, it happens to everyone eventually.  C'mon \"de la Cruzcito.\" You've got a contest to win.  How do you think I knew your great- great grandpa? We used to play music together. Taught him everything he knows.  Ha-ha, you're funny! Greatest eyebrows of all time maybe but his music, eh, not so much.  Welcome to the Plaza de la Cruz! Showtime, chamaco!  That's our ticket, muchacho.  So what's the plan?     What are you gonna play?  No, not that one.     No.  Ehck, it's too popular.  Epa!   Now that's a song!  You always this nervous before a performance?  What?! You said you were a musician!  That's your plan?! No, no, no, no, no, you have to win, Miguel. Your life LITERALLY depends on you winning! AND YOU'VE  I'll go up there--  Why?  What does that matter?!  Oh. Oh, that's such a sweet sentiment... at SUCH a bad time!  Okay... okay, okay, okay. Okay. Okay. Okay. Okay you wanna perform? Then you've got to PERFORM!  First you have to loosen up.     Shake off those nerves! Sáquenlo sáquenlo, sáquenlo!  Now gimme your best grito!  Come on, yell! Belt it out! OOOOOOH HE-HE-HEY! Ha! Ah, feels good! Okay... now you.  Oh, c'mon kid...  Miguel, look at me.  Hey!     Hey, look at me.  You can do this. Grab their attention and don't let it go!  Make 'em listen, chamaco!        You got this!  Arre papá!     Hey!    No, no, no, no...  You're not so bad yourself, gordito! Eso!    Hey, you did good!     I'm proud of you! Eso!  Hey, where are you going?  What, are you crazy?     We're about to win this thing!  Wait, wait, wait! You said de la Cruz was your ONLY family. The ONLY person who could send you home.  You could have taken my photo back this whole time?!  You lied to me!  Look at me. I'm being forgotten, Miguel. I don't even know if I'm gonna last the night! I'm not gonna miss my one chance to cross that bridge 'cause you want to live out some stupid musical fantasy!  I'm taking you to your family.  You'll thank me later--  No -- no, no, no!     No...  Hey, chamaco! Where did you go?! Chamaco! I'm sorry! Come back!  Yes, it is I. Frida Kahlo.  Gracias...  We had a deal, chamaco!  You said you'd take back my photo. You promised, Miguel.  Please Miguel, put my photo up.  And whose fault is that?  Those were MY songs you took.     MY songs that made YOU famous.  If I'm being forgotten, it's because you never told anyone that I wrote them--    Oh, how generous.  Look, I don't want to fight about it. I just want you to make it right. Miguel can put my photo up--  --And I can cross over the bridge. I can see my girl.  Ernesto... Remember the night I left?  We drank together and you told me you would move heaven and earth for your amigo. Well, I'm asking you to now.  What?  I'm talking about my real life, Miguel.  That night, Ernesto.    The night I left...  We'd been performing on the road for months. I got homesick -- and I packed up my songs...  This was your dream. You'll manage.  I'm going home, Ernesto. Hate me if you want, but my mind is made up.  You walked me to the train station.  But I felt a pain in my stomach. I thought it must have been something I ate...  Or something I... drank.  I woke up dead.  You... POISONED me.  All this time I thought it was just bad luck.  I never thought that you might have... that you...  How could you?!  You took everything away from me!  You rat!  I just wanted to go back home!      No, no, NO!  Kid?  Hey -- hey, hey...  Hey, it's okay...  Hey, chamaco, it's okay.         It's okay.  Hhuuh!  She's... forgetting me.  My daughter...  I just wanted to see her again... I never should have left Santa Cecilia. I wish I could apologize. I wish I could tell her that her papá was trying to come home. That he loved her so much. My Coco...  Where... where did you get this?  We're...  ...family?                           ...family? Héctor is as shocked as Miguel.       He looks at his great-great grandson. He looks to the photo, touches the image of baby Coco, and he becomes saddened.  I always hoped I'd see her again. That she'd miss me... maybe put up my photo. But it never happened. You know the worst part? Even if I never got to see Coco in the living world... I thought at least one day I'd see her here. Give her the biggest hug... But she's the last person who remembers me. The moment she's gone from the living world...  ...Ever again.  You know, I wrote her a song once. We used to sing it every night at the same time, no matter how far apart we were. What I wouldn't give to sing it to her... one last time.        I didn't write \"Remember Me\" for the world... I wrote it for Coco. I'm a pretty sorry excuse for a great-great grandpa.   Imelda!  You look good...  Imelda--  It's true, Imelda.  Imelda, I--  I'm running out of time.         It's Coco...  This is my fault, not yours. I'm sorry, Imelda.  Here, let me help you with--  Got your petals?  She's talking about me! I'm the love of your life?  You said \"love of your life...\"  You... still got it.  You're going home.  Imelda--    He's a living child, Ernesto!   It's okay, mijo. It's--  Coco...  We're both out of time, mijo.  I just wanted her to know that I loved her.  You have our blessing, Miguel.  Go home...  Coco!",
        "Chicharrón": "I don't want to see your stupid face, Héctor.  Get out of here...  My guitar?!  My prized, beloved guitar...?  Like the time you promised to bring back my van?  Or my mini-fridge?  Or my good napkins? My lasso?    My femur?!  Where's my femur?! You--  I'm fading, Héctor. I can feel it. I couldn't even play that thing if I wanted to. You play me something.  You want it, you got to earn it...  You know my favorite, Héctor.  Those aren't the words!  Brings back memories.     Gracias...",
        "Papá": "If Abuelita says no more plaza, then no more plaza.  What's tonight?  Mamá, where should we put this table?  You want it down by the kitchen?  Miguel... Your Abuelita had the most wonderful idea! We've all decided -- it's time you joined us in the workshop!  No more shining shoes -- you will be making them! Every day after school!  And wingtips, like your Papá Julio--  Ah, Migue... You have your family here to guide you... You are a Rivera. And a Rivera is...?  That's my boy! Berto, break out the good stuff, I wanna make a toast!  What are you talking about?  We've never known anything about this man. But whoever he was, he still abandoned his family. This is no future for my son.  You will listen to your family.    No more music.  End of argument.  Mamá...  Miguel!   MIGUEL!  Miguel!   Come home!  Where are you, Miguel?!  Miguel?!  You're here! HERE here!  And you can see us?!  Hola.  We need Mamá Imelda. She'll know how to fix this!  ...Then we are going to her! Vámonos!  Come on, Miguel. It's ok.  As a matter of fact, yes.  Mamá Imelda?  Well, we never made it to the ofrenda...  We ran into... um...  Híjole!   Your hand!  Whoa, Miguel. Can't have you fainting on us.  Here!  Nice alebrije...  It's a Rivera boot!  Look, there they are!  Give it to Miguel.  Miguel!?   Stop!  Miguel, open this door!  Miguel!  What's gotten into you?  I thought I'd lost you, Migue...  Mamá, wait--",
        "Miguel": "Sometimes I think I'm cursed... 'cause of something that happened before I was even born.  See, a long time ago there was this family.  The papá, he was a musician.  He and his family would sing, and dance, and count their blessings... But he also had a dream... to play for the world. And one day he left with his guitar... and never returned.  And the mamá...? She didn't have time to cry over that walkaway musician! After banishing all music from her life...  She found a way to provide for her daughter... She rolled up her sleeves and she learned to make shoes. She could have made candy!  Or fireworks!  Or sparkly underwear for wrestlers!  But no... she chose shoes...  Then she taught her daughter to make shoes. And later, she taught her son-in-law.  Then her grandkids got roped in. As her family grew, so did the business.  Music had torn her family apart, but shoes held them all together. You see, that woman was my great- great grandmother, Mamá Imelda.  She died WAY before I was born. But my family still tells her story every year on Día de los Muertos -- the Day of the Dead... And her little girl?  She's my great grandmother, Mamá Coco.  Holá, Mamá Coco.  Actually, my name is Miguel. Mamá Coco has trouble remembering things... But it's good to talk to her anyway. So I tell her pretty much everything.  I used to run like this...  But now I run like this which is way faster!  And the winner is... Luchadora Coco!  I have a dimple on this side, but not on this side. Dimple. No dimple. Dimple. No dimple--  My Abuelita? She's Mamá Coco's daughter.  No, gracias.  S-sí?  Abuelita runs our house just like Mamá Imelda did.  I think we're the only family in México who hates music...  And my family's fine with that...  But me?  Love you, Mamá!  I am NOT like the rest of my family...  Hola!  Muchas gracias!  Hey, hey!    Dante!  Sit. Down. Roll over.        Shake. Fist bump.  Good boy, Dante!  I know I'm not supposed to love music -- but it's not my fault! It's his: Ernesto de la Cruz...  ...The greatest musician of all time.  He started out a total nobody from Santa Cecilia, like me. But when he played music, he made people fall in love with him.  He starred in movies. He had the coolest guitar... He could fly!  And he wrote the best songs! But my all-time favorite? It's--  He lived the kind of life you dream about... Until 1942...  When he was crushed by a giant bell.  I wanna be just like him.  Sometimes, I look at de la Cruz and I get this feeling... like we're connected somehow. Like, if HE could play music, maybe someday I could too...  ...If it wasn't for my family.  Huh?  Oh, yeah, sorry.  I just can't really talk about any of this at home so...  I could never say that...  I don't know. I mean... I only really play for myself--  Uh-uh, my family would freak!  ...Seize your moment?     Abuelita!  Um...uh...  He was just showing me his guitar...  Yes, Tío Berto.  No, no, no!  It's just Dante...  I was just shining shoes!  But the plaza's where all the foot traffic is.    Well they're having this talent show-  And I thought I might...  Well, maybe?  I thought we were done...  Like Mamá Coco's papá?  But you're the one who--  I was just--  But--   Oh, it's you. Get in here, c'mon, Dante. Hurry up.  You're gonna get me in trouble, boy. Someone could hear me!  I wish someone wanted to hear me...  Other than you...  Perfecto!  ...and make it come true.  No more hiding, Dante.      I gotta seize my moment!  I'm gonna play in Mariachi Plaza if it kills me!  Get under, get under!  Nothing!  Mamá -- Papá, I--  What?!  But what if I'm no good at making shoes?  ...A shoemaker. Through and through.  Dante!   No, Dante, stop!  No, no, no, no, no! No...  De la Cruz's guitar...?  Mamá Coco, is your papá... Ernesto de la Cruz?  Ha, ha!  Papá!   Papá!  It's him! I know who my great- great grandfather was!  Mamá Coco's father was Ernesto de la Cruz!  I'm gonna be a musician!  It's not a fantasy!  That man was Ernesto de la Cruz! The greatest musician of all time!  But Papá, you said my family would guide me! Well de la Cruz IS my family! I'm supposed to play music!  If you would just let--  Just listen to me play--  I don't care if I'm on some stupid ofrenda!  No!  I don't wanna be in this family!  I wanna play in the plaza. Like de la Cruz! Can I still sign-up?  No... But if I can borrow a guitar--  Excuse me, can I borrow your guitar?  You guys have a spare guitar?  I need a guitar, just for a little bit--  Great-great grandfather... What am I supposed to do?  No, no, no, no, no, Dante stop! Cállate! Shhh!  I'm sorry...  Señor de la Cruz? Please don't be mad. I'm Miguel, your great-great grandson... I need to borrow this.  Our family thinks music is a curse. None of them understand, but I know you would have. You would've told me to follow my heart. To seize my moment!  So if it's all right with you, I'm gonna play in the plaza, just like you did!  I... I'm sorry! It's not what it looks like! De la Cruz is my...  Mamá!  Thanks, I--  Ahhh!   Dante?! You can see me?          W-wait! What's going on?!  Dante!    Dante!  I'm sorry, I'm sorry...    Tía... Rosita?  Papá Julio?  Tía Victoria?  Tío Oscar?     Tío Felipe?  Whoa...  Dante!   Dante! Dante, wait up!  You gotta stay with me, boy.       We don't know... where...  This isn't a dream, then.        You're all really out there...  Well I don't know, I thought it might've been one of those made up things that adults tell kids... like... vitamins.  Well, now I'm thinking maybe they could be...  Are those...? Alebrijes!         But those are--  Hola.  Whoa...  Mamá Imelda...  What?!  But I wasn't stealing the guitar!  It was my great-great grandfather's, he would have wanted me to have it--  Uh, you're all dead.  That's just Dante.  But Dante doesn't have any hair.  Oh...  It was an accident!  That's it?  What happens at sunrise?  What?   She can't do that!  Fine.  No skeletons!  Mariachi Plaza, here I come--  This isn't fair, it's my life!     You already had yours!  Papá Julio, I ask for your blessing.  Tía Rosita? Oscar? Felipe?       Tía Victoria?  You really hate music that much?  The same path he did.    Con permiso, I... need to visit the restroom. Be right back!  Vámonos.  If I wanna be a musician, I need a MUSICIAN'S blessing. We gotta find my great-great grandpa.  No, no -- Dante!  Hey. Hey!     You really know de la Cruz?  Shhh!  Yeah I'm alive. And if I wanna get back to the Land of the Living, I need de la Cruz's blessing.  He's my great-great-grandfather.  D'ya know what, maybe this isn't such a g--   That's nice!  You don't get to cross over.  This is you?  So you get me to my great-great grandpa, then I put up your photo when I get home?  Mmm, nope.  ONLY de la Cruz. If you can't help me, I'll find him myself.  I'm walking like a skeleton. Blending in.  It's how you walk.  Whoa...\"Ernesto de la Cruz's Sunrise Spectacular...!\" Qué padre!  And you can get us in!  Hey, you said you had front row tickets!  How?  Hola.  Dante... Dante!  We shouldn't be in here...  No, no, Dante! Ven acá!  I just followed my--  I don't think he's a spirit guide.  I think it's just the right amount of obvious? It could use some music... Oh! What if you did, like, doonk-doonk- doonk-doonk...  Oh! And then it could go dittle- ittle-dittle-ittle-dittle-ittle- dittle-ittle -- WHAAA!  Huh?  Excuse me, where's the real de la Cruz?  You said my great-great grandpa would be here! He's halfway across town, throwing some big party.  If you're such good friends, how come he didn't invite you?  Chorizo?  Hey, I'm a musician.  I need to get my great-great grandfather's blessing.  You know where I can get a guitar?  My great-great grandpa was a musician.  Whadda you know?  So, how far is this guitar anyway?  These people are all your family?  Wait... what happened?  Where did he go?  But I've met him... I could remember him, when I go back...  You told me you hated musicians, you never said you were one.  No manches! You played with Ernesto de la Cruz, the greatest musician of all time?  You don't know what you're talking about...  Definitely \"Remember Me.\"  C'mon, it's his most popular song!  Um... what about \"Poco Loco?\"  I don't know -- I've never performed before.  I am! I mean I will be.     Once I win.  No!    I need to do this.  If I can't go out there and play one song... how can I call myself a musician?  'Cuz I don't just want to get de la Cruz's blessing. I need to prove that... that I'm worthy of it.  My best grito?    Héctor...      Not bad for a dead guy!      We gotta get outta here.  I do have other family, but--  --But they hate music!      I need a musician's blessing!  Oh, you're one to talk!  It's not stupid.  Let go of me!  You don't wanna help me, you only care about yourself! Keep your dumb photo!  Stay away from me!  Dante, cállate!  No, Dante!     Stop it! He can't help me!  Dante, stop! Stop it! Leave me alone! You're not a spirit guide, you're just a dumb dog! Now get out of here!   I don't want your blessing!  You're ruining my life!  Music's the only thing that makes me happy. And you, you wanna take that away! You'll never understand.  I thought you hated music.  But I don't wanna... pick sides! Why can't you be on MY side? That's what family's supposed to do -- support you. But you never will.  It's okay. I'm Ernesto's great- great grandson!  Disculpen, señores...  You too! Hey, musician to musician, I need a favor...  Thanks guys!  Whoa...  Gracias!  De la Cruz...  Señor de la Cruz!  Pardon me, Señor de la Cruz!     Señor de la--  Señor de la Cruz!     Señor de la--      You... know about me?  I'm Miguel. Your great-great grandson.  I need your blessing. So I can go back home and be a musician, just like you.  The rest of our family, they wouldn't listen. But I... I hoped you would?  Dimple.   No dimple.      Dimple.   No dimple.  ...I would move Heaven and            ...I would move Heaven and Earth for you, mi amigo.              Earth for you, mi amigo. Salud!                                Salud! In the clip Don Hidalgo and de la Cruz drink.        De la Cruz spits.  Poison!                               Poison! Miguel and de la Cruz gleefully act out the ensuing fist fight.  No -- it's all great.  It's just -- I've been looking up to you my whole life. You're the guy who actually did it! But... Did you ever regret it? Choosing music over... everything else.  Leaving your family?  You mean it?!  I can't... I have to get home before sunrise.  I just met him tonight.      He told me he knew you--  W-What?  That's crazy, de la Cruz wrote all his own songs.  You really did play together...  Heaven and earth?     Like in the movie?  That's Don Hidalgo's toast... in the de la Cruz movie, \"El Camino A Casa.\"  No, it's in there.    Look.  But in the movie, Don Hidalgo poisons the drink...  Héctor!  You were going to give me your blessing...  That you murdered Héctor... for his songs?  I -- no! Everyone knows you're the... the good guy.  Papá Ernesto? My blessing?  What?!    But I'm your family!  No, NO!  Let go!   Help! Can anyone hear me?        I wanna go home!  Héctor?  Oh, Héctor!  You were right. I should have gone back to my family--  They told me not to be like de la Cruz, but I didn't listen--  I told them I didn't care if they remembered me. I didn't care if I was on their stupid ofrenda.  I told them I didn't care.  Héctor!   Héctor--  Who?  She's the reason you wanted to cross the bridge...  Coco?  That's my Mamá Coco. That's my Mamá Imelda. Is that... you?  ...family?                           ...family? Héctor is as shocked as Miguel.       He looks at his great-great grandson. He looks to the photo, touches the image of baby Coco, and he becomes saddened.  You disappear... from this one. You'll never get to see her...  He stole your guitar... He stole your songs...  You should be the one the world remembers, not de la Cruz!  Are you kidding? A minute ago I thought I was related to a murderer. You're a total upgrade!  My whole life, there's been something that made me different... and I never knew where it came from. But now I know. It comes from you. I'm proud we're family!  I'm proud to be his family!  Dante?  Dante!    It's Dante!  Dante, you knew he was my Papá Héctor the whole time! You ARE a real spirit guide! Who's a good spirit guide? You are!  Whoa...  Dante!  I wasn't in there `cause of Héctor. He was in there `cause of me. He was just trying to get me home... I didn't wanna listen, but he was right... nothing is more important than family.  I'm ready to accept your blessing... and your conditions. But first, I need to find de la Cruz. To get Héctor's photo.  So he can see Coco again.        Héctor should be on our ofrenda.        He's part of our family--  He tried to go home to you and Coco... but de la Cruz murdered him!  Héctor?  You don't have to forgive him... But we shouldn't forget him.  Family comes first.  I might know a way...  Gracias Frida!  Ow!  Everyone clear on the plan?  She's talking about me!  The photo!  That's what I heard...  Hurry, come on!  Sing!   Ahem.  Never play music again...  Dante!  You're a coward!  Héctor's the real musician, you're just the guy who murdered him and stole his songs!   Good boy, Dante.  Héctor!   The photo, I lost it...  Héctor!    Héctor?!  No!   We can still find the photo...  No, no, no, I can't leave you. I promised I'd put your photo up. I promised you'd see Coco!  No, no... she can't forget you!  Héctor--  No, Papá Héctor, please!  No...  I promise I won't let Coco forget you! Aaahh!--  Ah! I need to see Mamá Coco, please--  Mamá Coco?     Can you hear me?   It's Miguel.  I saw your papá. Remember? Papá? Please -- if you forget him, he'll be gone... forever!  Here -- this was his guitar, right? He used to play it to you? See, there he is.  Papá, remember? Papá?  Mamá Coco, please, don't forget him.  I'm sorry, Papá.  Not all of us...  Mamá Coco...  Mamá Coco? Your papá -- he wanted you to have this.       He loved you, Mamá Coco.         Your papá loved you so much.  And that man is your Papá Julio...  ...And there's Tía Rosita... and your Tía Victoria... and those two are Oscar and Felipe. These aren't just old pictures -- they're our family -- and they're counting on us to remember them."
    },
    "imdb_rating": "8.4",
    "description": "Despite his family's baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.—Disney/Pixar",
    "name": "Coco",
    "genres": [
        "Animation",
        "Adventure",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYjQ5NjM0Y2YtNjZkNC00ZDhkLWJjMWItN2QyNzFkMDE3ZjAxXkEyXkFqcGdeQXVyODIxMzk5NjA@._V1_QL75_UY281_CR4,0,190,281_.jpg"
}