{
    "filename": "Collateral-Damage_script.txt",
    "imdb_id": "tt0233469",
    "imdb_url": "https://www.imdb.com/title/tt0233469",
    "characters": [
        "Roman",
        "Junior",
        "Gordy Brewer",
        "Matt Brewer",
        "Jack",
        "Peter Brandt",
        "Sean Armstrong",
        "Joe Phipps",
        "Mauro (as Tyler Garcia Posey)",
        "Felix Ramirez",
        "Ronnie",
        "Claudio Perrini",
        "Anne Brewer",
        "Rocha",
        "Selena Perrini"
    ],
    "dialogues": {
        "Roman": "",
        "Junior": "Hear the big news, Lieutenant? It's the twenty-first century.   We got electricity now.  Got these supermarkets, too.   Big places, freezers full o' ice cream.  Gordy.  Me and Mike are here.  It's not your fault.  Get those goddamn people outta here!  Just came over the police radio... Consulate surveillance cameras caught the bomber in the act. He was disguised as a cop.  Yeah, how long is it?  What a jerkoff.  The temp lieutenant put it out back, and Art hit it with his truck.",
        "Gordy": "Open up.  Screw the twenty-first century.  Second alarm. Multiple dwelling between Third and Lex.  Top story's fully involved. We're supporting inside. Two lines up the stairs.  Junior and Mike --  -- Sal and Ronnie.  Stairs're screwed. Hug the wall.  Knock it back!  Where?      Give me the hose!  Give me the goddamn hose!     It's okay... Esta bien, esta bien... Come with me... Con mio...  He was awake when I got home.   His throat still hurts.  You're right.  No fever.  Yes, ma'am.    (beat; calls after  I have a game. But yeah, if we do the handoff at the doctor's.  Luis, get back! Pick up your man!     We lose, win, whatever. But one thing we never do. We never, ever give up. Right?      Luis...  What was that about?  Try Fifth.  Shit.  I'm getting outta here.      Sorry.                 Anne!  Noooooo!!!  I need to see them!       ... I was late... They shouldn't have been there...  I need to see them.    I didn't see anything except the explosion.  ... I saw him... I saw a cop.  I gotta help 'em get the bastard.  That's him. That's the son of a bitch I bumped into.  ... No.  ... Seconds... Five, ten...  All I cared about was getting to my wife and boy.  ... I touched him...              How's that for collateral damage?  I've already paid. With my family.  You know where he is?  What kind of twisted people do things like this?  My family died because of what's going on down there. I want to know all I can.                Been busy.  E.L.C. attack platoon... These assholes kill innocent people all the time in Colombia.  Thirteen dead in a bus. A market. Twenty-seven dead. A whole family... Anne and Matt didn't mean shit to them. Or him.  (still looking at  Shrinks say ten more days.  Morgan, the guy from 23, right?  I'm gone three weeks and this place falls apart.  Who backed over that?... My tools still here?  Figured you guys would've sold my stuff at a yard sale by now.  You ever stay on one channel long enough to hear what they're saying?  Go back!   Go back!     Tell him not to bother.  ... Pleasure.  Is there a problem?  Says so right there in my passport.  ... You giving me a choice?  How far's Colombia?       Aqui?   Colombia?...  Gracias.  Inspecion militar. Chequeo de papeles.  Habla Ingles?... Que pasa?  Where are all of you going?  None of these people have papers?     No!  Mina... Mina...  Alto.        Don't move... Don't move...  You'll be okay... You'll be okay.  Guerrilla bastards.  No!   Alto!  No, that's okay --  ... Gordy Pitt.  Austria.   American now.  New York City.    Caguan.  How do you know?  Por favor.  Con mucho gusto.  It better be.    A lotta people're dying for it.  I was thinking... Maybe we could travel together into Caguan. You could show me around.  I've got money. I'll buy the pass from you.  I'll be getting some life insurance money --  No, thanks.  Why?                         The Wolf killed my wife and son in New York.  Yeah. Go to Caguan, find The Wolf and kill him.       And you guys still haven't got him.      Don't breathe.  Close your mouth.  I'll find a boat to take us upriver.  All the fire trucks are diesels.  Heinrich Beckmann.  My Austrian name.  Yeah.  In Mompos.  He was arrested in Ecuador. He got drunk and fooled around with a police officer's wife.  No problemo.  The E.L.C. guards your coffee beans?     I can't work with these pieces of junk.  Then treat them that way.  Armstrong wants your money. He makes them work, but he doesn't fix them... To do this right, we gotta order parts from Europe. In the meantime, I can make something temporary. There must be a machine shop in town.  Let's go.  I'm thirsty. How about you?   Want to get something to drink?  I've been working all day out in the sun. I need a drink... nice cold beer? How about it? I saw a bar in town.  With the spare parts, I'll have the generators running in two hours... We have time for a couple beers.  Yeah.  Armstrong said to watch my butt around here. I guess the fucking Americans come down and shoot everyone all the time.  Yeah, I heard about it.   Who did it?  Ever see him?  Where?  Tell me what doesn't get you killed around here.  We'd better get back, huh?  You're too drunk. I'll drive.  Hey, easy... What's the problem?  I am?... Looks different in the dark...  I have this one ready to go.  I just need another part from town, and it's five more minutes.  The old part's in there. I need to match it, and it's all greasy.         Berta working today?  You as thirsty as I am?  We can't stop for one beer?    What happened? Last night you were in love with her.  ... That wasn't a dream, that was the alcohol talking... You saying two men can't go have a beer and look at women's breasts because of pink elephants?... Nothing makes any sense down here.  Go ahead and shoot me, and you fix the goddamn generator. Part's in the back.  I have to piss.       Yo trabajo con Felix. Felix -- -- la cantina. Con Berta.  I went for a walk. I figured you wanted to be alone with Berta.  That make you happy?  Where's my money?  This where Armstrong stays?  Come on, baby... come on, baby...     Just in time...                                    No!    Stop!   Alto!  Get back!          You killed my wife and son --       ... Who are you?  ... His wife?     Why feed me?    Why not just kill me?  ... Thanks.  I'm not one of them.   I'm here for my own reasons.  Why are you still here?  I'm not like him.  He kills innocent people. He's planning to kill more.    Where?  Where?  Where in Washington?  Which building?  We can't let it happen.  We'd never make it.  How many more kids have to die? And for what?  If you don't stop it, you're as much to blame as he is.  How do we get out?              Go!  You okay?  Under the water! Uno, dos, tres...  Hang on. We just have to keep floating a little bit more...  You were shot.  We gotta get you outta the river.       Esta bien.   Esta bien.  You're lucky.  Can you walk?  How do you say 'hello'?  Yo soy Americano... Gordy Pitt... Gordy Pitt...  They both get asylum.    And she needs a medic.  What about the asylum?  He wasn't even there.  Where're we going?  I was underground. I couldn't see anything.  No.  I've told you all I know.  What's that?  Eleven.  She was killed in Guatemala.  Shit...  No.  Where's Selena?!  She's lying!   She's The Wolf!                                         You killed them.  They were my family.  The killing ends here.  No.    You don't understand.  Hold us both till the police get here.      You're no better than she is.  It's good to be home.",
        "Brewer": "",
        "Matt": "Look what we made!  That's a bad word.     There he is.",
        "Jack": "",
        "Peter": "",
        "Brandt": "Mike Brandt.  We'll have this discussion somewhere else more secure, after I get your clearance.  Mr. Pitt.  I'm very sorry for your loss... I lost people, too.  Don't worry, Mr. Pitt, we're gonna get the son-of-a-bitch.  We believe The Wolf's in hiding in an area of Colombia controlled by the E.L.C., extreme Marxist guerrillas... He thinks he's in a safe haven.  Here's my card. Call me any time.     ... Senator, the failure of one operation shouldn't cause your committee to question financing everything else we're doing down there...  ... I know it looks bad, and I appreciate your support. Together we'll get it done... Yeah. 'bye. Without his father's money, that asshole'd be keeping bees for a living... What?  No.  I don't need it.  Find your fucking leak?  All due respect, Noel, it's not likely... And we don't need the whole world looking into what we're doing down here... We find the son-of-a-bitch again, we're bypassing protocols...  Jesus Christ...  What, he thinks he can get The Wolf himself?  (beat; hands papers  Enjoy your trip?  We asked you to leave it to us.  It's not over yet... The guys next door are in The Wolf's elite bodyguard unit. Where he goes, they go. We're gonna ask questions. And we're gonna get answers... And you're staying right here till our bomber's dead.  ... I don't fucking believe it. That lucky son-of-a-bitch found The Wolf.  An E.L.C. compound...  They're not just hiding The Wolf.  It's well-sited... can't surprise 'em, so you gotta outgun 'em... So that's what we're gonna do.  We're not just gonna hit it, we're gonna wipe if off the globe. Cats, rats, dogs and mice. If it's moving, it's dead.  I don't care what the Puerto Ricans say. Which part of the word 'war' don't you understand? Our mission down here isn't just about catching The Wolf.  He was told not to be here... The first choppers'll hit it at 2200.      Only good thing down here... Put everyone on red till tomorrow night. And then, I don't care if there's a typhoon, I want those fucking rotors turning.  It's time to make The Wolf howl.  They couldn't have made it this far. Go back upstream.  F.B.I.'s on the radio.     Tell 'em everything you know.  On the plane.    Inter-agency headquarters for our efforts in Latin America.  Union Station.  What's he waiting for?  In here.  He always hid his face. Why's he giving us a clear picture now?  Escort her.  Everybody out!     Clear this floor! Now!       We got the bitch.",
        "Sean": "",
        "Armstrong": "Hey, yo, dude, here's a seat, man!  I was hoping for someone I could communicate with.  Only room's at the back near the bano, and I'd advise against it, unless you like poop.  Philip Armstrong. Assiniboia, Sasketchewan, Canada. Deerborn Heavy Equipment.  Hey, howya doing? I love Germany.  I love America. Never been to Austria. Where from in America would that be?  I don't like New York City. Buildings're too big. What kinda work you in?  Can't drink caffeine. Makes my stomach do the rumba. I like that commercial guy with the sombrero and the mule, though. Headed upstream, eh? Where to?  ... You've never been to Caguan, eh?  'Cause no one in their right mind would ever go back. Caguan's in the guerrilla zone run by the E.L.C. E.L.C. as in 'Extra Loathsome Communists.' They don't care, and they kill. I'm going there myself. But I have a 'get outta jail free' card.  E.L.C. travel pass. I can go anywhere I want. Everyone needs equipment fixed.  If you don't have one of these, you don't want to be up there, Gordy.  Got kids, eh?  That little kid and I had a nice, long snooze... We're almost to Mompos. Beautiful country.      I've worked too hard for it. And you don't have that kind of money on you.    Mompos... You want to have some fun, we'll hook up later. I always schedule a stopover. To sample the local wares and such. Life can be what you make it here on the frontier.  Gotta get off the boat anyway. Mompos is the last stop. From here into the guerrilla zone you can only travel by panga... If you change your mind, I'll be at the Tropicale later. It's a gringo bar. Just follow the cockroaches.  Sicarios. Death squads. Avoid those dudes at all costs.  Federales are looking for someone.  I never met a nose I couldn't hang a spoon on.  Yahtzee!  Police catch you trying to steal my hat, you asshole?!  Fucking hat thief!  Get outta here --  That stun gun wasn't cool.  Haven't peed my pants in a real long time.  Yeah, well, I guess all these assholes down here are just starting on my nerves.  So what the hell did you do to land us in here? And don't jerk me around, eh?  ... Oh, you're that guy, eh? I'm sorry, man... And what, you came down here to even things out?  Did you even have a plan?   If you can't kill them, don't even talk to them.             No. I told you. The pass is only good for one person. And you're too dangerous to travel with.  It hasn't been there since we landed.  Aw, hell... I was through with this place anyway...  I'll call ahead and tell Felix I'm not coming, and you're my replacement. He'll meet you in Caguan and take you to the plantation... What do you know about diesel engines?  You'll have to be Austrian, eh? They hate Americans. Name's gotta change, too, in case they're watching the news. It'll buy you a little time to look around Caguan. But you'll never find The Wolf.  Huh?  Luck got you this far. But up there, luck doesn't make it. I hope you know you're gonna die.",
        "Joe": "",
        "Phipps": "Who were the brass, and why were they here?  Check the surveillance cameras?    Anybody talk to him yet?  Put that tape out fifty more feet.  Chalk 'em and move 'em.  We gotta get on this quick.   I need to talk to him.  Mr. Pitt, if you can you tell me... What'd you see?  I know this is hard. I'm sorry I had to bother you.     Joe Phipps. F.B.I. Counter- terrorism task force.  What got this place blown up?  Whatever it takes. But I got a bomber in the wind. I need everything you can give me, and I need it now.  How long before we have a secure computer network?  What do you got?  Do it.  Run a total analysis. I want to know if this asshole's right or left-handed. I want everything you can get outta this film.  Any helpful information coming outta Colombia?  The cart was stolen from the Central Park Precinct yesterday.  The bomb's in the cart.     We think the bomb was triggered by a cell phone. The guy doesn't have one in his hands here. Did you see a cell phone when you ran into him?  How much time passed between then and the explosion?  We think maybe he got into the brown Ford. You see him then?  (beat, then, by way     Mr. Ortiz-Dominguez has agreed not to press charges if you make full restitution.  Take care of it.  Gordy, this is Mike Brandt.  ... Mike was in the motorcade that day... He's the chief U.S. intelligence officer overseeing Colombia.  I know it's hard for you right now, Mr. Pitt. We're all sorry. But why don't you go home. We're taking care of things.  These buildings best match what you described to us.  That's okay.   We'll keep trying.    It's secure, and we can coordinate all departments here.  My people will debrief you in another room... We'll take the boy to a safe house across the street... He'll be well cared for.  That's okay.    If we spook him, we don't know what his secondary target'll be.  That's him, isn't it?  He was there yesterday. Just stood there and left... So far, the dogs haven't found anything, so maybe we're ahead of him.  Are you okay?  Get copies of this freeze frame to all the undercover people and the sniper teams.  And nobody caps him until we get that bomb tagged. After that, I don't give a shit what happens to him.  Feeling better?  We think the bomb was triggered by a cell phone.  Did you see a cell phone when you ran into him?  She went to see her son.",
        "Felix": "Beckmann.  Come with me.  Armstrong should have called sooner. We don't like changes here... If I didn't need the equipment fixed, I'd send you back.  But now we have to see the E.L.C. Supervisor for Caguan.    Si.   Gracias.  The Supervisor made you my responsibility... You don't go anywhere without me, you understand?  ... Coffee beans? Shit. Armstrong didn't tell you much...     The problem's with the diesel generators. The sons-of-bitches keep breaking down.  We're using portables to keep production going, but they don't supply enough power to the heat lamps, and we have to dry a lot of... 'coffee beans.'     We can fix anything, but these keep dying on us... You'll start now. I'll have tools brought to you. Armstrong's a magician with them. Let's hope you have his skill.  Well?  Junk? These generators cost a fortune.    ... Yes.  Let's get moving.  We have to get back.  Okay.   Just a beer. Maybe two.  This is mine. This is the reason I come here... right, Berta? Me amas?  ... She's hot, isn't she?  Especially now, since the bomb in New York.  The Wolf, and they'll never catch him.  Once.      One day, I'm going to screw Berta.  ... I'll take her to a small restaurant... We'll have lobster and drink lots of wine... I'll get her drunk... We'll drive home... I'll carry her inside... I'll kiss her... And then, I'll screw her in my bed...  ... And when I am done screwing her, she'll never want to look at another man again...  What the fuck are you doing?!  You're going the wrong goddamn way!  Turn around!  You drive where I say... Or the Supervisor will have us both shot.  It's afternoon. Yesterday, you said it would only take two more hours.  What about the other one?  ... Shit.     Fine. Let's go.  Why're you bringing the tool box?     Ha!   Puta!  No.  There's beer at the plantation.  To hell with Berta.  ... I had a dream... I fed her lobster, got her drunk, and she rejected me for another man. Dreams tell the future.  You know I'm your man, baby.  Are you trying to get us both killed?  (to the guerrillas;  Shit...  You're working all night, Beckmann. That generator gets fixed, and you're out of my hair in the morning.  You'll get it in the morning.  This is where you stay... A boat will take you down river at seven.",
        "Ramirez": "",
        "Ronnie": "Cut's deep, but no major vessels were severed. He's got a load 'o silk holding it all together.  Yeah.   I'll get more.  Hey, Gordy --",
        "Claudio": "",
        "Perrini": "",
        "Anne": "Nice rocket... That took a while.  Shit.  Sorry.     How was your shift?  Dreamed I did a triple axel in an ice skating championship.  Dr. Bob can squeeze him in at twelve. I have a patient relations meeting at twelve- fifteen. Can you take him?",
        "Rocha": "Not yet. And it could be your fucking leak.  We have too much time and too many people invested to have a loose cannon walking around.",
        "Selena": "Are you alright?  My name is Selena.  Yes.  I brought you food.  Are you so anxious to die?  The men in jail with you in Mompos... They say you talked to a man from the C.I.A.  Claudio used to be a teacher. I was a medical aid worker. We met in Guatemala, in an Indian village called Guamaunco. We were married there. Sophia, our daughter was born there. Claudio was kind and loving, and we were happy... We were there four years when the civil war broke out... The guerrillas were all around us, but left us alone... Then they made an attack on the army nearby. The next night, soldiers came to our village. They were led by American 'advisors'... They accused us of helping the rebels. Our women were raped. Our men were tortured. Our homes were burned... We crawled out into the fields, but they threw grenades, and Sophia...  ... my baby girl was hit by shrapnel... she bled to death in Claudio's arms.  Claudio joined the guerrillas. When that war ended, we moved to the next war, and the next... Each fight has only deepened his hatred. And poisoned his soul. He's unable to love anything anymore...  Because I know he was a good man, who's been consumed by rage because of what he lost... Just like you.  Not yet.      I tried to stop him.  He's gone back.  Yes.  ... Washington D.C.  ... He had pictures of a building...  I don't know.  It's too late.     No one can stop him now.  I got down here from New York...  ... I'm his wife...  I can't.  We're going with you.  The guard is the only one close. When we're past him, we can slip into the jungle. Mauro's waiting for us there.  He's on the right... No needless killing.              We have to swim.  Your hired soldiers can't shoot.  ... I'm okay.  He can't hear or speak.  He's a war orphan. I adopted him.  I know where we are. There's a secret trail nearby that leads toward Mompos.  It's just my arm.  I don't recognize anything... I saw only parts of the building... I'm sorry.  I think   it's a public place. He said he   wanted the people of America   to feel the terror. 'Terror   is all they understand.' He said   it over and over...  No... No... No...  I'm sorry.  No...  ... No...  He had that book! Let me see it!  That's it!  Please don't kill him.    He takes his time. Like he told you, he enjoys it.  I'm sorry... I think I'm going to be sick.  I think I'd feel better if I could rest a little and see my son.                                                 (beat; with  It will never end.  Please help me!  He's trying to kill me!"
    },
    "imdb_rating": "5.5",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNjliY2MyZDUtYzk4ZC00N2RhLWJiZDktMjNkYjRjNGU1MDllXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_QL75_UX380_CR0,2,380,562_.jpg",
    "description": "Firefighter Gordon Brewer is plunged into the complex and dangerous world of international terrorism after he loses his wife and child in a bombing credited to Claudio \"The Wolf\" Perrini. Frustrated with the official investigation and haunted by the thought that the man responsible for murdering his family might never be brought to justice, Brewer takes matters into his own hands and tracks his quarry ultimately to Colombia.—Jason",
    "name": "Collateral Damage",
    "genres": [
        "Action",
        "Drama",
        "Thriller"
    ]
}