{
    "filename": "Conan-the-Barbarian_script.txt",
    "imdb_id": "tt0082198",
    "imdb_url": "https://www.imdb.com/title/tt0082198",
    "characters": [
        "Subotai",
        "Osric's Guard",
        "Conan",
        "Rexor",
        "Valeria",
        "Pictish Scout",
        "King Osric (as Max Von Sydow)",
        "Conan's Father",
        "Turanian War Officer (as Erick Holmey)",
        "The Wizard /Narrator",
        "The Princess (as Valerie Quennessen)",
        "Red Hair",
        "Sacrificial Snake Girl",
        "The Witch (as Cassandra Gaviola)",
        "Thulsa Doom"
    ],
    "dialogues": {
        "Subotai": "",
        "Osric's": "",
        "Guard": "What's this one done?  So have your men deal with him.  Sounds like a real problem. Too bad we have other places to be right now.  Time to leave, northerner. 20.    Even a dead horse smells better than this.       Public drunkenness. Another damn hill ape who can't handle his liquor.  What is it?  Fine, fine.",
        "Conan": "They killed one. I killed three. I am a warrior now. 6.  They would have done the same --  \"Stoke your fire, chop your wood.\" I have slept where wolves dare not. I have balanced a thousand river stones. When will you teach me the sword? 7.  To slay ones enemies.       Why did it break? 8.      Father!  Do we need more weapons?  No! I will fight!  Father, I am not afraid to die.  No!         No, my small friends. It's time to die. Now--  Who's first --  Where's the Captain of the Guard?  In truth, I've been guilty of much. Jewels stolen from the crowns of kings, men's heads split in battle for the price of a night's drink. But through that I've searched and waited and hunted my prey.  But drink? Haven't had a drop all night.  The key to the cells. 22.  I came for you, Lucius.  I do. And I am no ape. I am Cimmerian.  I'm the one who made you pretty.  No. I am death. And I came a long way for you.  Where?  Who are you offering?  You have my word. You tell me where I will find Khalar Singh, and I will not kill you.  Toasting, to our deal.  Go. You are free.  The key to your shackles sits in the Captain's gut. Happy hunting.  No. I said I wouldn't kill you.     Khor Kalba. Which way?  Use your whips on the horses' legs!         You!       Who are you?  Many died to capture nobody.  Get up.  Perhaps the slavers took your orders. I don't. 40.  You speak of animals as if they were less than men. But animals don't stab their brothers in the back or steal their mother's only possession. And they never lie.  Very well. Give me your name.  I am Conan.  What more names do I need?  There is only one truth I need from you, Tamara Amelia Karushan. Why does Khalar Singh want you?  Then let's hope it's for your cooking.  Trying to poison me?  What are you doing?  Crom! What would you pray for? That a bone may not get stuck in your throat? No words nor gods will give you one more moment than fate allows you.  I need no pity.  Don't worry. His back is broken. He won't be slinking away this time.  Now, let's eat.  I enjoy a little music with my meal.  You are more fit to inflict torture than to endure it. Your life is not nailed to your spine as my peoples are.  Why would he?  One what?  A queen in hiding.  So I should ransom her to your master? Not exactly loyal -- but still, a good idea.  You'll help me deliver it.  Good. Die.  Here. Eat.  Fire draws attention.  The only blood on these hands I claimed with my own sword.  Clean hands mean nothing. Kings and Queens claim more lives than I will ever meet, and not a drop is spilled in their presence.  You lie. You are the very reason my people are dead.  But Khalar Singh has. He destroyed my people, looking for you. 48.  You know this.  You hid from him. And while you did, others died in your place.  And I do not care, for he will not live to see it bear fruit!  Enough lies.  You will keep quiet. 49.  You will be the lure that will draw me close. Then I will scale the wall and cut him down where he stands.  They will not be a problem.  Did I ask?  I will not fail.     Be still!   I have what you want! Where's my gold?!     Send the gold. 51.  I was wondering what it would take for you to stop cowering.  It's not enough. I've failed you father.  I don't understand --  Where am I?  You were -- adequate.  I was just wondering what that smell was.  Now I know.  If it's metal you seek, perhaps you'd settle for steel. 58.  Still fast Artus.  It won't get easier. Khalar Singh lives. He'll be coming for me and the girl.  This one may be more than you wish. I need you to get me close to Khor Kalba.  I do. 59.  Just leave me to sleep.  You would risk your life for royalty? Why?  A tall tale. Meant to scare children.  What care I for queens and empires? 60.  I heard. Only I would happily put all of your \"civilization\" to the torch myself.  My only debt is to my people. And it still lies unpaid.  I hope I awoke with less clamor.  Is there a better reason to drink?  You've never tasted mead?  I have no future. It died with my people, as I should have.  Nothing.  I believe in the cold of steel, the warmth of flesh. All else is fairy tales. 66.  Purpose. I die with purpose.  That is what they wish. They drive us to another force, approaching from the south.  No. We give them what they think they want.  About ship! Now!  Let us show them why she is called the Wasp.  Fire!  Rip her apart!  Fire!  Good. I was growing weary with boredom.  Hide her below.         Time to go. 72.  I need you head west, to draw off our pursuers. I'll find another path to Khor Kalba.  I never said that. But I won't leave a virgin onboard a pirate ship, alone.  We'll rest here until morning. 73.  I would do you a kindness. Khor Kalba will bring only death.  We leave at dawn. I will not break stride for you. Not once. I will get you into Khor Kalba. Beyond that I have my purpose, and you yours.       They fought beside the men.  She died in battle, even as I was born.  I don't lie.  Do you ever tire of talking? Let me rest, woman.  We'll slip in, along with those traders. But you'll need a change of clothes, those monks' robes will draw attention.  And what better disguise for a monk? 78.  Do not test me, beast.  It's probably only way into Khalar's fortress. I'm sure it is heavily guarded at all times, day and night.  And dodge arrows as we do so?  During the day, we'd easily be spotted on the climb. And it would be useless to even attempt at night. No, we must find another way.  Thieves. You'll regret finding me.  What? Do you wish to join in?  So that's it?  What is it?  Not from me.  Around. Up.  82.  What?  Crom! Stop wasting time.  Crom indeed. 83.  Let's go.  Nothing good.    Who dies first?     Crom!                 You're going to fight Khalar's troops? Just you?  You want my help again.  Let me ask.  Will be where your queen is.  A swift end!  You lie. I was there. My father never uttered a sound.  I saw my father die. Slain by one who can only kill men already on their knees.  Really? Then why did your father not let you face me before, when I had sword in hand. He thought you unequal to the task.  Coward! Prove your strength!  Take my eyes, coward -- if you can. 92.     Crom.  Me!  Let her go.  My purpose.  Once you used my father to teach your son a lesson about strength. Now let me teach you.            Your story ends here.  Like a woman, Fariq cried and begged me to spare him.  Tamara!!  No.  I cannot. 103.",
        "Rexor": "",
        "Valeria": "",
        "Pictish": "",
        "Scout": "",
        "Conan's": "",
        "Father": "",
        "Red": "",
        "Hair": "",
        "Thulsa": "",
        "Doom": ""
    },
    "imdb_rating": "6.9",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMWYwZGU1N2UtNTU5My00ZTVkLThjZDktZTQzZmEyMzZjMTdmXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_QL75_UX380_CR0,6,380,562_.jpg",
    "description": "Beyond the mists of time, having witnessed the brutal death of his blacksmith father and the massacre of the entire village by the murderous followers of Thulsa Doom, the undead evil wizard and servant of the serpent-god, Set, Conan, the orphaned young Cimmerian, is condemned to a life of slavery. Chained to the perpetual Wheel of Pain, the helpless boy grows into a man, and after years of rigorous training as a fierce gladiator, Conan, now an unstoppable mountain of muscle, regains his precious freedom. But, with the image of the blood-soaked raid etched on his mind, Conan teams up with Subotai, the Hyrkanian thief, and Valeria, the Queen of the Bandits, and embarks on a peril-laden journey to the mysterious Mountain of Power, and the impregnable Snake Cult Temple. Will Conan avenge his parents?—Nick Riganas",
    "name": "Conan the Barbarian",
    "genres": [
        "Action",
        "Adventure",
        "Fantasy"
    ]
}