{
    "filename": "Coriolanus_script.txt",
    "imdb_id": "tt1372686",
    "imdb_url": "https://www.imdb.com/title/tt1372686",
    "characters": [
        "First Citizen (Tamora)",
        "Citizen",
        "Caius Martius Coriolanus",
        "Second Citizen (Cassius)",
        "Tullus Aufidius"
    ],
    "dialogues": {
        "Citizen": "Amen, amen. God save thee, noble Consul!  At his cue-- The civil violence threatened from the opening moments of this story finally EXPLODES-- 53. With Cassius and Tamora in the forefront, the crowd attacks",
        "Tullus": "",
        "Aufidius": "If we and Caius Martius chance to meet, 'Tis sworn between us we shall ever  Piercing our Romans.  We hate alike. Then Martius does something astounding. He holds out his arms to his sides and drops his weapons. They clatter down. Aufidius does the same. The Roman and Volscian soldiers watch. None daring to interfere. Martius and Aufidius continue to glare at each other -- dropping weapons -- disarming -- Martius climbing up the stairs, Aufidius coming down -- moving closer and closer-- At an instant- They slam together- Fighting without weapons-- Grappling brutally. Tearing at each other. Twining together. Fingers grasping. Teeth snapping. Hands pulling. It is a bloody, terrible, graceless struggle. 24. They crash and slam awkwardly in the claustrophobic stairwell. Smashing into the walls. Falling from level to  Five times, Martius, I have fought with thee; so often hast thou beat me, And would do so, I think, should we    Bolder, though not so subtle. A beat. Aufidius continues with prayer-like intensity:  My valor, poisoned with him, Shall fly out of itself ... Nor sleep, nor sanctuary, being naked, Sick, the prayers of priests, Nor times of sacrifice, Shall lift up their rotten privilege And custom, Against my hate to Martius. In the shattered glass of the minivan window, Aufidius suddenly sees himself. He studies his own face, nurturing his dark thoughts.  Where I find him, were it At home, upon my brother's guard, even there, Will I wash my fierce hand in his heart.     Whence comes thou? What wouldst thou? Thy name? Coriolanus does not respond. 76. Aufidius is growing uneasy. His men are tense, ready to open fire at any second.  Speak, man! What's thy name?  Say, what's thy name? Thou has a grim appearance .What's thy name?  I know thee not Thy name? Finally, Coriolanus removes his burnoose. His face is exposed. The Volscians are stunned.  O Martius Martius Each word thou hast spoke hath weeded from my heart A root of ancient envy. He offers his hand. Coriolanus takes it. Aufidius continues to hold him by the hand, rather intensely, speaking low:  Let me twine Mine arms about that body. He embraces Coriolanus. Aufidius' men finally relax. Weapons are lowered. Relieved glances exchanged. Some of the Volscians, though, are clearly suspicious of Coriolanus. They watch Aufidius and Coriolanus, concerned. Aufidius still can't quite believe his ancient enemy is now his newest ally.    Why, thou Mars, I tell thee, We have a power on foot, and I had  Or lose mine arm for it. Thou hast beat  Worthy Martius, Had we no quarrel else to Rome, but that Thou art thence banished, we would muster  0, come, go in, And take our friendly senators by the hands. Coriolanus shakes hands with the politicians:  Therefore, most absolute sir, if thou  And set down--- As best thou art experienced, since thou  Do they still fly to Coriolanus?  He bears himself more proud, Even to my person, than I thought he        Whether t'was pride, Whether defect of judgement, Or whether nature, Not to be other than one thing, Made him feared, So hated, and so banished. A beat as he studies the picture. His lieutenant watches him closely, disturbed by Aufidius' obsession with Coriolanus.  So our virtues Lie in the interpretation of the time. He brings the picture closer, whispering now:  One fire drives out one fire; one nail,  Thou art poorest of all -- then shortly art thou mine.  Only their ends You have respected; stopped your ears     As with a man by his own charity slain.  I know it, And my pretext to strike at him admits A good construction. A beat. He continues more to himself than them, almost convincing himself.  I raised him, and I pawned Mine honor for his truth; who being so heightened, He watered his new plants with dews of flattery, Seducing so my friends. At the last I seemed his follower, not partner, and He waged me with his countenance as if I had been mercenary.  There was it! For which my sinews shall be stretched upon him. At a few drops of women's rheum, which     (handing the treaty to  Ay, traitor, Martius.  Ay, Martius, Caius Martius! Dost thou    Name not the god, thou boy of tears. 105.  Let him die for it. At this command, his men move-- Aufidius steps back as-- The Volscian thugs attack-- With knives, machetes and tire irons-- Coriolanus fights bravely -- disarming two, grabbing their weapons, killing them, fighting back-- Slashing and cutting his way through the killers- Closer and closer to Aufidius, who just watches-- Blood spattering and spraying- But the thugs overpower Coriolanus, there are just too many-- 106. They stab him -- slicing with knives -- battering with chains and clubs -- finally emptying pistols him into him-- It is graceless and brutal carnage. Slaughter. But still he comes on. Body riddled with bullets and cut to bits. He refuses to fall. Like something immortal. An obscene demon of blood. Finally the thugs move away. Coriolanus still stands. Teetering. His face is a swollen mask of blood and gore. Blood flows from his body, pooling around his feet, spreading across the parking lot. Aufidius steps forward. What is left of Coriolanus glares at him through blood. Aufidius slowly pulls his knife. The same knife he was sharpening so carefully at the opening of the story. It has finally found its purpose. Coriolanus looks at him. Then slowly Coriolanus tries to raise one bleeding arm this requires superhuman effort his slashed fingers clutch his shirt he rips it open exposing his breast. Ready. He locks eyes with Aufidius. Aufidius steps to him. Takes his neck. Pulls him onto the knife. Driving it into him. Cradling his head like a lover. They stand like this. Then Coriolanus falls. A pause.  Take him up. No one moves.  Assist. Abrupt cut to-- 107."
    },
    "imdb_rating": "6.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTcyMjAwMjA2N15BMl5BanBnXkFtZTcwOTI0MjA0Ng@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "The citizens of Rome are hungry. Coriolanus, the hero of Rome, a great soldier and a man of inflexible self-belief despises the people. His extreme views ignite a mass riot. Rome is bloody. Manipulated and out-maneuvered by politicians and even his own mother Volumnia, Coriolanus is banished from Rome. He offers his life or his services to his sworn enemy Tullus Aufidius.—Icon Entertainment",
    "name": "Coriolanus",
    "genres": [
        "Drama",
        "Thriller",
        "War"
    ]
}