{
    "filename": "Crank_script.txt",
    "imdb_id": "tt0479884",
    "imdb_url": "https://www.imdb.com/title/tt0479884",
    "characters": [
        "Eve",
        "Doctor",
        "Orlando",
        "Carlito",
        "Arab Cabbie",
        "Kaylo",
        "Verona",
        "Chev Chelios",
        "Doc Miles",
        "Don Kim",
        "Man in Garage (as Laurent Schwar)",
        "Alex",
        "Haitian Cabbie",
        "Sin City Brother",
        "Chocolate"
    ],
    "dialogues": {
        "Eve": "11                                                                     11   I'm glad you called, but I'm not here. Can you leave me a message? Unless you're trying to sell something, because I'm absolutely not interested. But if you're not ...  ... then just ... oh, wait ... time's up -  13                                                                     13    The RESIDENT approaches him cautiously, on his knees, holding out a handful of small white boxes.   6    70                                                                  70      I was sleeping in.  72                                                                  72   Just a minute.  Alright, alright, Jesus ...  ... calm down, what the hell ...  Oh.   My.   God.  Is this your new look or something?  It's ... completely appalling.    Very you, Chev.  Are you looking for my other boyfriend?  No.   Why?  What are you talking about?    Don't be such a freak.  Actually, I'm glad you're here. Can you change the clock on the microwave?  I never changed it back.  Yeah. I never changed it back.   You know, daylight savings time.  That's sweet. Are you OK? You look like you're on drugs or something.  Yes.  What is it? What's wrong?  But ... I ...     You're so stressed out, do you want some pot?  What's the matter?  Come on, let me see ...    Fine.  74                                                                  74   Oh darn... the thing.    75                                                                  75   6                                                                  76  77                                                                  77   Hello?  78                                                                  78    79                                                                  79   80                                                                  80         You know, I could use a little help here.  Where's your car?  Hm.   So why are we here?  For me?  I don't understand.  Mob hits, Chev? Chinese poison? Do you know how ridiculous you sound? If you're going to break up with me, at least you can tell me the truth.  Chev, you're scaring me.  No.  What?  Help what?  Get off!   Are you kidding me?  No!  Stop it!  Oh my God, Chev!  You filthy animal ...  Take me right here in front of everyone.  What are you waiting for?    God damn it, Chev ...!  Oh God... Oh God... yes...  What???    No. Chev. I DO NOT UNDERSTAND.     I had to see if you were telling the truth... oh, and you have my purse.  Darn it, I forgot to take my birth control pill.  My stuff...   EVE gets herself turned upright and stares at CHEV, hair full of windshield glass.      You weren't lying.    And the other part?    How can we stop it?  his will get you going.  Come on, let's finish what you started.   EVE'S face has turned a distinct shade of PALE GREEN.   Are they... OK?  How can you... how can you do that...?  What's the matter?    But... you said...  Do you promise?  150                                                                 150   ... leave a message.",
        "Doctor": "",
        "Orlando": "I'm talking! What are we talking about?  OK, nobody's fucking with you, just calm down ...   (  Why would I know where ... ?     Now Chevy here has something he would like to discuss. So we are going to discuss it. In a civilized manner. Chevy? I believe you had a question, or some point you were trying to make?  OK. I am not affiliated with Ricky Verona.  Easy ... easy ... now things are beginning to clarify ... you see how that works? How discussion can lead to clarity?  Clearly you are operating under a false pretense. Ricky Verona and myself did not \"pull the Anselmo job together.\" In fact, Ricky Verona fucked me on the Anselmo job. In fact, Ricky Verona owes me seventy five hunna dollars.  But that's the way it is. That's the way it is. So you see, I don't know where Ricky Verona is. Because if I knew where he is, I would probably be there right now, beating his Gucci ass down.  Thank you. That's what I'm talking about. That resembles civility.  Shit dude, what's the matter with you?  I understand that. You've made that point abundantly clear to all of us.  Now what can I do to help you?  OK, now you're insulting me.  You think every brother is carrying, is that it?  I can see that.  So this is medicinal use coke, that's what you're telling me.  Well?  You got something for me, or what?  Chevy ... come on, man...   Ah, so this is about the Don Kim situation.  I know you pulled the trigger.  O...kay...  Whoa, Chelios. You good, man?  Beg your pardon?     What?  You got no time, period.  But you know this has got to stop sometime. What do you think you are, Michael Myers? They pop you and you just keep gettin up?",
        "Carlito": "34                                                                   34       Chevy.  I'm surprised to see you.  Ha!   So I've heard.  Word travels fast.     You amaze me, my friend.    Honestly, you should be dead already. It's a miracle.  We give that shit to horses ...  C          I'm sorry.  heads afloat.   What do you expect me to do?  Verona? That's just a small time punk. But... that's not to say there isn't an opportunity here.  Everyone knows the love I have for you, Chev. Maybe this can even the score for the Don Kim hit, which was perhaps ill- advised.  The heat from Hong Kong has been more than we anticipated.  Don't be difficult.  re you disrespecting me, Chev?    Is that  35                                                                 35    Why don't you sit down?  Let me see that.  Clever ... what is this, an insulin pump?      That's enough.  I said that's enough. It's been a long day. But in the end, you must agree, it all works out quite nicely. Don Kim gets his bullet, thanks to you...  The Chinese shit. Hold him down.  I'm afraid the Houdini act is over, Chelios.  Shut up, Verona.  Get me out of here! NOW!    Get down!  Ronnie James Dio...!",
        "Arab": "",
        "Cabbie": "OK, cowboy.  Where you want to go, man?  You're not getting into my cab wet.  You are not getting into my car no way.  I love America! I love Bush!    Hey man. What's the matter with you? You a crackhead?  Hey, you not gonna die in my cab, crackhead.  I got something for you.  You drink this Haitian shit, crackhead. This right here is some hardcore shit. Made from plant shit.    You see that? That's what a man looks like, crackhead. That's the power. Now look at you.  That's right, devil. You wait.  We're here.  I told you: it's hardcore.  Five fifty five.  Have a nice day, devil.",
        "Kaylo": "Hello?  16                                                                     16  I ... uhh ...  What?  What?  Where are we?  Ricky Verona?  Chev!  Chev?  Hello?  Chev?  Chev! I just saw Verona's brother going into Charlie O's.    Yeah.    I was just down here getting a taco.    He went right in, like, 2 minutes ago.   I'm across the street, getting a taco. Where are you?  What?  I've got Verona.  I've got Verona, man.  Don Kim's shirt factory.     Upstairs.",
        "Verona": "What's shaking, douchebag? Thought I'd give you the heads up. You're dead.  Yeah, that's right, you little bitch ... if you're watching this tape it means that I somehow resisted the urge to dismember you and shove the pieces down the garbage disposal ... opting instead to poison you in your sleep. Yeah, you heard me...  ... I fucking poisoned you in your sleep. How sick is that?... for the satisfaction of watching you squirm out your last minutes knowing it was me that did it to you, and there's nothing you can do about it...      the shit I gave you is some fucking high tech sci-fi Chinese synthetic shit that even I don't know exactly what the fuck it is. All I know is once it binds with your blood cells, you're fucked, baby... and believe me, it's done binded. By now you'll be feeling your joints stiffen up... hard to breath...  ... your heartbeat is slowing down like there's rust in your veins... you're like the Tin Man in the Wizard of freaking Oz...  Hey, it's been real. Probably should've thought twice before you whacked Don Kim. Experiencing a little 20/20 hindsight? I thought so. Have a nice death...  ... asshole.  24                                                                   24  ey, what's up, Doc!  ude, aren't you dead yet?    What the hell  eah, whatever. Look, just thought you'd  arlito? That's funny, I guess you  lever. Snappy. Did you pretty good,  Right, right, and the best part about it is...  I doubt it.  Talk to me, bro.  49                                                                     49     struggling to find a heinous enough threat      You motherfucker, my grandfather gave that medallion to my father, and then to - your ass.  You -  71                                                                      71       Right, so... let's go get the bitch.  Give me a fucking break...      What's up, corpse.  Oh, the antidote, huh?  And what are you prepared to give me. Asshole.    Alright.  Whatever.  Of course.        Wait a minute. Pat him down again. He's carrying something.  What the fuck is insulin?  I'm nobody's little bitch.  I'm nobody's little bitch, you hear me? He'll pay what I tell him to pay...!  Speak for yourself.  Dude's gone dipsy doodle...  Whatever, psycho...       That's right, motherfucker!   FLY!  You're dead, you're dead, you're dead!",
        "Chev": "8                                                                          8  9                                                                          9      10                                                                     10           14                                                                     14         Come on ...  Let me talk to him.  Where is he?  Where - thefuck - is - he?    D-E-A-D.   Chelios... got it?  Thank you.  Kaylo. My man. So, where were you last night?  I said, where were you last night?  8                                                                     18     I'm dead and you're simple. Now listen: you put the word out I'm looking for Ricky Verona. Anyone sees him you call me.  I'm going to get that little son of a bitch if it's the last thing I do... it may actually be the last thing I do, understand that? Copy me on that?  Find him!    Talk!!  Don't fuck with me!!   Look, I got to find Ricky Verona ...  ... right, I know, you don't know where he is, but you're going to tell me where he is, or I'm going to BLOW YOUR BRAINS  Where's Verona.    That's not how I heard it.  Alright.  Forget it. I just gotta find Ricky Verona, that little bitch ...  Look, just give me some coke, OK?    You got any coke?  Come on, man, I know you got coke.  Come on, I don't have time for this, just give me something ... I'm really dying here ...  No. You don't understand, I'm really fucking dying ... if I don't ... May I just have some coke, please?  That's right.   OK, that's good.    That's good.  Seems like some Chinese assholes hired him to kill me...  What do you know about it?    his shit's not working.  Alright ... who wants white meat?  3                                                                  23  Doc?       You haven't been tight since your brother fucked you in 3rd grade.  We'll see.    You've got to do something for me, it feels so crazy, like it's in my blood ...  It's like... it's like... like I'm slowing down... like I'm caught in a tar pit...  Yeah.   Not really. Actually I'm feeling pretty good right now.  Driving through a mall with five cops chasing me.  I'm having a little trouble hearing you, Doc.  Explain.   What's that?  That's what I'm trying to do... just keep moving... keep the blood pumping... every time I slow down it's like my veins start to rust...  A couple grams of coke.  Yo!   Right here!  Go.  Straight.    Now.  Make a right.  ey, crank the music.  No, CRANK IT.  Pull over.     Come on, right here.    Thank you.  OK, I'll be back in one minute.       Don't go anywhere.  You move, you die ...   Hey boss.  Well, something urgent has come up.  Then you know what happened?  What can I say. Look, Carlito, I need your help. I don't have much time.  We've got to find an antidote or something.  What's the matter?  What, so that's it?  A miracle.  Well you don't have to be so damn cool about it.  Tell me you're going to find that punk Verona and his whole fuckin' crew and feed `em to a cage of wolverines.  What is this? Are you boys now or something?  Opportunity.    Oh. That's outstanding, Carlito. I'm glad to know that my death can be of some use to you.  Am I being difficult? Is this what you call difficult? I don't know if you noticed, but I'm having a DIFFICULT  orget it, I'm out of here.  I just gave you 200 dollars to wait for 3 minutes.   Yeah.  Shit.  In English, doc.    Please.  Epi ... something ...  OK, OK.        I gotta go.  Yeah.   Yeah, what is it?  Uh huh.  Where are you now?   I'm there.     Meet me on 3rd and Flower.  motioning to the restaurant  Did anyone go in with him?   How you like that one, tough guy? How freaking awesome was that?  You feel like talking to me?   Where's your brother?  Nice ... wonder how many steaks I could get out of you ...   Jesus ... nothing's easy ...  You want to hold hands?    That's right, bro. You wanna guess how I got your brother's cell phone?  I can tell you have it all figured out. Looks like you should've cut me up when you had the chance.  What's that? I can't hear you ... experiencing some 20/20 hindsight?  I know, I know ... hey, what's this?  A necklace? You guys really are faggots aren't you?  No thanks, but you know I believe I'll hang onto it... looks like you'll have to come find me after all. Fucked up that you killed your own brother.  Out.  What was that... epi... shit... 10 milligrams...  Huh?    Oh.    I'm taking off.  I'd get out of here if I were you.    That's funny. No, I'm talking about some kind of artificial adrenaline ... some shit ... you know ...  I have heart problems.  Yes!    Yes ... that's it ... you have it?  Why?  Come on, what is that...  What?  You've got epinephrine on this cart!    I want that shit!  What?  Yeah, yeah.    Give me that.  Not going to tell you again.       How much of this stuff did he say to take?  Woah.   Woah. Woah.     Got it.  Yep.  Right.  Check.  Check.  Let me check.  Check.  Urinary sphincter ... check ...  Negative.  Check.  Copy.  Copy.    Out.  66                                                                   66  (tossing the gun up and  Yeah.  You've been home all day?  You were sleeping in, that's great, Eve ... super great ... you all rested now?    Right, you'll be there, OK.  Hey doll.  That's right. You into it?  Thank you.    Didn't think so.    Listen, we've got to get out of here.  What?  The microwave.  You love me, right?  Then I need you to do something for me.  I need you to put some clothes on and come with me right now.  I'll change the clock on the microwave.        It's nothing... don't worry about it... let's get out of here ...       I'm parked out back.  The thing.     What thing.  You trying to burn down the building?  Whoa whoa whoa...  Is this yours?  My car. Actually... I took a cab.  You know, I didn't have a lot of time to pick this out ...  (holding his fingers up to  \"This isn't going to be easy\" ... as they say ...  Alright, here it is. I told you I was a video game programmer. That was a lie. Actually...  I kill people. I'm a professional hitman. I freelance for a major West Coast crime syndicate.  Last night was a job like a hundred others. A high dollar hit. Nothing special.  Your life, jackass. A hundred grand wants you dead, so sooner or later it's going to happen. But I'm not doing it.  nstead, you're going to do something for  Or if you prefer, we can do it the other way, the way where I go to work and you go meet Buddah.  See: I quit. I quit the business. For you.  figure I call you that night. I tell  We get on a plane together and leave all this shit behind. Never come back. Pretty crazy, huh?  Yeah, well... I may be going on a trip, but you're not coming with me...  Eve... baby... please!  You think it sounds crazy? How do you think I feel - I've gotta live this shit...  ... just need...    Make love to me.  Come on. I think it'll help.  Take your clothes off.  You always say you want to be more spontaneous.  Save me, Eve. Save my life.    Shut up!      8      Shit!  Yeah.  Kaylo?  No shit.    Where are you?    Listen to me. You don't let that motherfucker out of your sight. I'll be there in ten minutes. You got that?  Out.  I have to go. Please understand.  hit!  (shouting back, voice trailing  Right... just step on it, alright?    What the hell.  (  What'd you say was in this stuff?    It's all you, man.    Keep it.  Right...        Yeah I am.     Where's Kaylo?    Alright, where is that motherfucker?  What the fuck is this?  What?    Carlito ordered this?  Just die.  Maybe you're right.  That's true ... we all gotta die ...  Right ... so ... let's all die ...   Nice.  Come on! Wait -  ... OK, now come on.  here's the keys?    Welcome to my life.  Oh. Yeah.  The poison? Yeah, that's true too.  Pretty much.  Adrenaline. It's the only thing that slows it down.  Yeah. Sorry.  What are you doing?   Oh boy...  Oh yeah, that's... that's really working for me...  Stay down.  That's it that's it that's it... just a little...    They're dead.  I told you, baby... I quit.  Wait here.  Jesus Christ! Now what...?    I can't feel my leg.   Where are you?  Sure, why not?  gesturing with his head at the  It feels sort of good.  So I'm not... better?  So... what are you going to do?  Then what?  (cocking his head toward the  A dream.  No... no, that's not what I want.  One hour.  I want one hour.  Hey douchebag, thought you might be interested in a little deal.  I want the antidote.  That's right.  How about the jewelry I got off your faggot brother, you cocksucker?  Thinking about it?  You like that deal?  I'll be at Downtown Standard in twenty minutes. You know the spot?  Don't be late, or I'll trade this thing to some whore for a hand job ...  It's going to be alright, baby.  I know. But things have changed. There's an antidote. I can make a deal for it, but I've got to go alone.  Of course. But you'll be safe now. And I'll be back.  I promise.  What's happening, brother?        Orlando?    I'm the Terminator.  Don't tell me you're talking about your bro, Def Lepard.  Yeah, not so much. I don't get it - why didn't you guys just cut me up alive when you had the chance?  Bipolar. Sadomasochistic tendencies. Adrenaline junkie. Addicted to violence... probably spends every day of his life looking for the big thrill, the big rush. Cutting up a guy like that while he screams in his own blood and excrement would be like... like a GIFT... a warrior's death... hell, you'd probably get off on it...  No, this was the best way for a guy like you: a slow, ticking clock... winding down... inevitable... non-negotiable... until...    Don't you know?    Yeah, well, better late than never. You know you're going to die up there.    But I'm taking you with me.       Easy ...  Looks like everyone's here.  No shit.  Basically.    You'll probably throw boss a nice little reach-around just to show what a good bitch you are.  Is that what I think it is?  Not so fast, motherfucker.    Presto.  Too late!  Oh no you don't...  Present from Kaylo.  I told you I'd kill you, you son of a bitch!  Hey doll. Looks like I let you down again. You were right about me ... funny, you really have time to reflect on things when you know you're going to die ... seems like all my life I've just been going, going, going ... I wish I'd taken more time to stop and smell the roses, so to speak, but well, I guess it's too late now... you were the greatest, baby.",
        "Chelios": "3                                                                       3   ... the kitchen, with a black marble island and hanging copper. He jams his head under the Fossil sink and runs the water. He steadies himself against the matching black marble counter, staring at his hands ... stunned... All the while we hear the faint sound of his HEARTBEAT... ... slow: LUBDUB... LUBDUB... LUBDUB. He begins crawling back into...         Where did I go wrong?  Like talking to the wall...  I'm amazed you remember you have a mother.  You never call, you never write... I haven't seen you since you ran out at 16...  That's hurtful.",
        "Doc": "Sorry baby, I just got the message.  Alright, slow down. You say you've been poisoned. Can you describe the symptoms?  Blurred vision?  Dizziness?  Pain in your chest?  What are you doing?    Listen, Chev - you have to keep moving.  If I'm right, they gave you the Beijing Cocktail... very nasty ... works on your adrenal gland, blocking your receptors. The only way to slow it down is to keep the flow of adrenaline constant.  Meaning: if you stop, you die.  If you stop, you die.  Have you taken anything?  Oh boy. Well, that's a start. Look, I'll be back in LA in an hour. I'll call you as soon as I land. Keep yourself pumped up. Don't stop, don't quit, I'll be there.   Relax. I mean don't relax. Listen to me. The shit they gave you is cutting off your adrenaline.  Your only shot is to massively increase the level of ephedrine in your body ... to force out the inhibitors ...  You've got to get to an emergency room and get yourself some epinephrine ... it's artificial adrenaline ... it comes in 10 milligram syringes ... the shit's potent so don't overdo it ... probably a fifth of an injection will do.  nephrin.    Epi-nephrin.  I'll call you -  Chevy!  I'm in the air, man.     Did you get the stuff I told you?  You took it?  You shot the whole thing, didn't you?  Oh boy. I said a fifth of a syringe, you idiot. Now you're dead for sure.  Chest is on fire.  But you're cold.  You got a steel hard on.    Maybe you can get a hold of some vicadin ... you still at the hospital?  Maybe some weed ... I don't know ...  Well, that shit should be out of your system in a half hour or so, if you live that long ... this air phone is costing me a fortune ... look, I'll be in LA in twenty minutes. I'll call you when I hit the ground.    Chevy! Holy shit, man, I've been trying to reach you for a half hour.  I'm at my office. Can you get here?  You're my best customer.  Synthetic ephedrine, diluted with saline.  Oh, I also gave you a little meth. That's the endorphins rushing into to your brain that you're feeling.  Fuck no. You're in such shit shape it's stunning. I've never seen a heart take this kind of punishment and keep ticking. You should be in a fucking medical journal or something.  The solution I'm giving you is acting as a competitive inhibitor... meaning it pushes the poison out of your receptors and replaces it with a chemical... it's a temporary fix...  Look, if we put you on life support we could maybe string you out for a few days, but at some point you'd almost certainly lapse into a coma... and then...  f you want, I can load you up with    Then ... what?",
        "Miles": "Sorry baby, I just got the message.  Woah!  Alright, slow down. You say you've been poisoned. Can you describe the symptoms?  Blurred vision?  Dizziness?  Pain in your chest?  What are you doing?    Listen, Chev - you have to keep moving.  If I'm right, they gave you the Beijing Cocktail... very nasty ... works on your adrenal gland, blocking your receptors. The only way to slow it down is to keep the flow of adrenaline constant.  Meaning: if you stop, you die.  If you stop, you die.  Have you taken anything?  Oh boy. Well, that's a start. Look, I'll be back in LA in an hour. I'll call you as soon as I land. Keep yourself pumped up. Don't stop, don't quit, I'll be there.   Relax. I mean don't relax. Listen to me. The shit they gave you is cutting off your adrenaline.  xcitement, fear, danger ... it causes  Your only shot is to massively increase the level of ephedrine in your body ... to force out the inhibitors ...  You've got to get to an emergency room and get yourself some epinephrine ... it's artificial adrenaline ... it comes in 10 milligram syringes ... the shit's potent so don't overdo it ... probably a fifth of an injection will do.  Did you get all of that Chev?  nephrin.    Epi-nephrin.  I'll call you -  Chevy!  I'm in the air, man.     Did you get the stuff I told you?  You took it?  You shot the whole thing, didn't you?  Oh boy. I said a fifth of a syringe, you idiot. Now you're dead for sure.  Chest is on fire.  But you're cold.  You got a steel hard on.    Maybe you can get a hold of some vicadin ... you still at the hospital?  Maybe some weed ... I don't know ...  Well, that shit should be out of your system in a half hour or so, if you live that long ... this air phone is costing me a fortune ... look, I'll be in LA in twenty minutes. I'll call you when I hit the ground.    Chevy! Holy shit, man, I've been trying to reach you for a half hour.  I'm at my office. Can you get here?  You're my best customer.  Synthetic ephedrine, diluted with saline.  Oh, I also gave you a little meth. That's the endorphins rushing into to your brain that you're feeling.  Fuck no. You're in such shit shape it's stunning. I've never seen a heart take this kind of punishment and keep ticking. You should be in a fucking medical journal or something.  The solution I'm giving you is acting as a competitive inhibitor... meaning it pushes the poison out of your receptors and replaces it with a chemical... it's a temporary fix...  Look, if we put you on life support we could maybe string you out for a few days, but at some point you'd almost certainly lapse into a coma... and then...  f you want, I can load you up with    Then ... what?",
        "Don": "There's BANGING on the door.    A BIKER yells from outside.    The RESIDENT approaches him cautiously, on his knees, holding out a handful of small white boxes.      Well? What are you waiting for?  Did I win something?  I see.    87                                                                    87     88                                                                   88   95                                                                  95      97                                                                  97    98                                                                   98  9  9                                                                   99  101                                                                 101    04                                                                 104  05                                                                 105   So this is how it is.",
        "Kim": "Well? What are you waiting for?  Did I win something?  I see.    87                                                                    87     88                                                                   88   95                                                                  95      97                                                                  97    98                                                                   98  9  9                                                                   99  101                                                                 101    04                                                                 104  05                                                                 105  So this is how it is.  Do not use a hatchet to remove a fly from your friend's forehead.",
        "Alex": "I just saw a ghost.  (anger gradually overcoming the  You was that, maybe. But there's a new gun in town.  He did you pretty good, didn't he?  Verona said you was Chev Chelios - A.K.A. Death On Two Legs.  He said you probably been a contract killer since grade school.",
        "Haitian": "Hey man. What's the matter with you? You a crackhead?  Hey, you not gonna die in my cab, crackhead.  I got something for you.  You drink this Haitian shit, crackhead. This right here is some hardcore shit. Made from plant shit.    That's right, devil. You wait.  We're here.  I told you: it's hardcore.  Have a nice day, devil.",
        "Chocolate": "15                                                                       15   I beg your pardon sir?  I don't know sir, this is his answering service, would you like me to have him paged?  Yes sir...  124                                                                     124   126                                                                     126           EVE and CHOCOLATE are sitting cross-legged on the mattress, staring blankly at the TV.    DOC shakes his head NO.  CHEV broods silently."
    },
    "imdb_rating": "6.9",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjg0NjAxNDY4MV5BMl5BanBnXkFtZTcwODA5MjMzMw@@._V1_QL75_UX380_CR0,2,380,562_.jpg",
    "description": "Poisoned by the potent and deadly mix of synthetic drugs called \"The Beijing Cocktail\" for getting in the way of the Triads, the tough-as-nails British hitman living in Los Angeles, Chev Chelios, wakes up with a terrible headache. With less than an hour to live, Chev will have to use all the help he can get from his doctor, and use every trick in the book, to consistently keep his heart rate up so that the adrenaline in his bloodstream staves off the effects of the deadly toxin. Now, his heart is pounding faster than any other human being, and as Chelios darts across the city's streets in search of an antidote and the arrogant criminal, Ricky Verona, to exact his revenge, he finds himself compelled to pick fights with no-nonsense drug dealers, murderous assassins, and an army of thugs. But, can Chelios stay alive long enough to protect those he loves, and make it through the day?—Nick Riganas",
    "name": "Crank",
    "genres": [
        "Action",
        "Crime",
        "Thriller"
    ]
}