{
    "filename": "Crouching-Tiger,-Hidden-Dragon_script.txt",
    "imdb_id": "tt0190332",
    "imdb_url": "https://www.imdb.com/title/tt0190332",
    "characters": [
        "Sir Te",
        "Jen Yu (Mandarin version) /Jiao Long (English dubbed version) (as Zhang Ziyi)",
        "Gou Jun Pei",
        "Lo 'Dark Cloud' /Luo Xiao Hu",
        "Police Inspector Tsai /Prefect Cai Qiu",
        "Yu Shu Lien",
        "Auntie Wu",
        "De Lu",
        "Maid",
        "Master Li Mu Bai (as Chow Yun Fat)",
        "May (as Li Li)",
        "Governor Yu",
        "Bo",
        "Madame Yu",
        "Jade Fox (as Cheng Pei-Pei)"
    ],
    "dialogues": {
        "Sir": "This is Li's personal sword, a great hero's weapon!  He is the only one in the world worthy of carrying it.  It's too fine a gift. I cannot accept it.   All right.  I'll act as the sword's custodian.  De Lu, the head servant, enters.   I must change.   Please do not be such a stranger. You'll stay the night as my guest. Now, Shu Lien... tell me something. And forgive me for prying.  Your father was a great friend to me, and I think of you as my own daughter.   Li Mu Bai giving up his sword and his warrior days... maybe he's trying to tell you something?   Don't be coy.  I've always known about your feelings for each other. All these years, it's a shame... neither of you is brave enough to admit the truth to the other. You're both wasting precious time.   When it comes to emotions, even great heroes can be idiots.  Tell me if Li Mu Bai is not more open the next time you see him.  I'll give him an earful!    Two lighted lanterns are raised up.   Go ahead, Governor Yu.  Governor Yu is impressed by the opulence and elegance of the sword.  He closes his eyes to guess the weight of the sword. Te snubs out the flame from a candle, then slides the sword out from its sheath.  The sword gives off a luminous blue glow in the dark.   Two feet 9 inches long.  1 inch wide.  The handle is 1 inch deep, 2.6 inches wide.  Seven-tenths of an inch thick.  With seven rubies missing from the hilt.  You can tell the design dates back to before the Chin era.  Engraved with a technique lost by the time of the Han Dynasty.   A sword by itself rules nothing. It comes alive only through skillful manipulation.   The Imperial Court isn't the problem.  With royalty and officials everywhere, the Royal Guard keeps security tight.  But Peking is not like the West.  Here, you'll find all sorts of characters.  Proceed with caution in your quest for law and order.  Don't depend only on the court.  Contacts in the Giang Hu underworld can ensure your position.  Be strong, yet supple. This is the way to rule.   How dare you imply?   -- Enough.  The men hustle out.  Bo can barely contain his frustration.   Yes, though I doubt he's involved in this.   Then someone's trying to set him up. We should inform Li Mu Bai.   Shu Lien, look who's here.  The man turns around -- it's Li Mu Bai.   This needs to be resolved, and quickly.   This is a delicate matter.   What do you have in mind?    Yu sits with Madam Yu and Jen.  They busy themselves with various items for her trousseau.   Hello, Madam Yu.  This is Li Mu Bai, the renowned swordsman.   When will this end?  They take it, they put it back, they take it again.  My home is turning into a warehouse.  Bo bursts into the hall, bows to Te.",
        "Te": "Customs officials have just finished checking the contents in a row of carriages bearing the Sun Security insignia. The caravan slowly passes through the checkpoint into the boundaries of Peking.  Yu, riding a handsome horse and clearly the leader, watches as her crew clears inspection.    Yu presents the sword to Sir Te.   This is Li's personal sword, a great hero's weapon!  He is the only one in the world worthy of carrying it.  It's too fine a gift. I cannot accept it.   All right.  I'll act as the sword's custodian.  De Lu, the head servant, enters.   I must change.   Please do not be such a stranger. You'll stay the night as my guest. Now, Shu Lien... tell me something. And forgive me for prying.  Your father was a great friend to me, and I think of you as my own daughter.   Li Mu Bai giving up his sword and his warrior days... maybe he's trying to tell you something?   Don't be coy.  I've always known about your feelings for each other. All these years, it's a shame... neither of you is brave enough to admit the truth to the other. You're both wasting precious time.   When it comes to emotions, even great heroes can be idiots.  Tell me if Li Mu Bai is not more open the next time you see him.  I'll give him an earful!    Yu and De Lu approach the study.    Yu gently lays the sword, still in its sheath, in Jen's hands.    Two lighted lanterns are raised up.    Sir Te hands the sword to Governor Yu.   Go ahead, Governor Yu.  Governor Yu is impressed by the opulence and elegance of the sword.  He closes his eyes to guess the weight of the sword. Te snubs out the flame from a candle, then slides the sword out from its sheath.  The sword gives off a luminous blue glow in the dark.   Two feet 9 inches long.  1 inch wide.  The handle is 1 inch deep, 2.6 inches wide.  Seven-tenths of an inch thick.  With seven rubies missing from the hilt.  You can tell the design dates back to before the Chin era.  Engraved with a technique lost by the time of the Han Dynasty.   A sword by itself rules nothing. It comes alive only through skillful manipulation.   The Imperial Court isn't the problem.  With royalty and officials everywhere, the Royal Guard keeps security tight.  But Peking is not like the West.  Here, you'll find all sorts of characters.  Proceed with caution in your quest for law and order.  Don't depend only on the court.  Contacts in the Giang Hu underworld can ensure your position.  Be strong, yet supple. This is the way to rule.    A wide shot of the compound.  A patrol man greets Master Bo, Sir Te's head of security.  The place is serene.   Chilly, eh?    A masked figure silently opens the window and enters the room.  It moves swiftly to the sword case, opens it, and wraps the sword.  Bo enters, sees the thief, who leaps up to the ceiling.  The thief steps over Bo and out into the courtyard.  Bo tries to stop the thief, who easily outwits him, jumping onto the roof as Bo yells out.    De Lu escorts Yu into Te's.    Men are standing at attention.  Bo is giving his account of what happened, as Yu enters.   How dare you imply?   -- Enough.  The men hustle out.  Bo can barely contain his frustration.   Yes, though I doubt he's involved in this.   Then someone's trying to set him up. We should inform Li Mu Bai.    Yu is ushered into the room, to discover Sir Te talking to another man, whose back is to her.   Shu Lien, look who's here.  The man turns around -- it's Li Mu Bai.    Yu and Li Mu Bai sit together.    Te and a group of his men look down as a cloth is removed from over the body of Tsai.  Bo and May stand before them.   This is Tsai?   This should be reported to Governor Yu.  The victim is an officer.  You believe the killer is hiding out in his compound.    Come with me.  He exits the room.    Te, Li, and Yu are seated.   This needs to be resolved, and quickly.   This is a delicate matter.   What do you have in mind?    Yu sits with Madam Yu and Jen.  They busy themselves with various items for her trousseau.   Hello, Madam Yu.  This is Li Mu Bai, the renowned swordsman.   Miss Yu is soon to be married.    A still, dark night.    Something moves in the moonlight.  A hooded figure jumps down.  Li Mu Bai, who had been hiding in the shadows, comes forward.    The figure bounces into an old monastery.  Li is already there.    The figure leaps into the garden, but again, Li is ahead of her.  The figure attacks Li, who uses his agility to evade her. Frustrated, the figure intensifies her attack.  The figure, losing composure, attacks wildly.  Li gets even more elusive, using a branch to repel her.    The Governess leaves, a small sack over her back.    Li practices fluently with Green Destiny in hand, beautifully at ease with the weapon.  He spins around to find Yu standing in the doorway.    Jen and Lo kiss.  Jen takes the jade comb out of her hair and presses it into his palm.  Jen starts to cry.  They embrace.    Jen quietly walks out and stands sadly in the early morning light.  End of flashback.    Yu and Li enter, as other men and women race through the compound, a sense of panic in the air.  Yu gives Li a look. Li shrugs.    A crowd, including Li and Yu, stand by as Te opens the empty sword case, his voice rising.   When will this end?  They take it, they put it back, they take it again.  My home is turning into a warehouse.  Bo bursts into the hall, bows to Te.   Speak!    Jen arrives at the tea stall.  She places her sword on the table, which catches the attention of a couple of Giang Hu martial arts characters sitting nearby.   Hello.  What is your name?   It's young Master Long.  My apologies.  I'm Iron Eagle Sung and this is my brother in arms, Flying Cougar Li Yun.  What brings you to Huai An, and where are you headed, Master Long?   In that case, perhaps we could be of assistance.   You don't seem to understand.   We have ways of helping you understand.  The two pull out their weapons which are immediately chopped into scraps by Jen.    Are you related to Li Mu Bai?   Please follow me.   We have plenty.  Your order?  Jen again sets her sword on the table as she sits down.    I have to order from a bigger restaurant.   You have amazing technique!  I am Flying Machete.  Are you related to Southern Crane?   We politely asked for a friendly match, but she showed no respect, and attacked us.  Everyone came by to teach her a lesson.    Jen climbs up toward the temple, finally reaching the temple gate, and sees Lo standing there.  He runs to her.  She greets him.    Jen and Lo make love.    Lo wakes up to find the jade comb on the pillow beside him, Jen gone.",
        "Auntie": "",
        "Wu": "Shu Lien!   Li Mu Bai is here!   Fine.  Please come in.  Yu sits, composed, as Aunt Wu ushers Li in.  Li carries a large object, wrapped in silk.  Yu smiles.   You're back!   Much better.  You've been gone so long.    I'll go and make up his room!  Aunt Wu hustles out.  Yu goes into her own room.   She's crazy.  You should have killed her.   Well, Li Mu Bai can do it.  Yu senses movement at the window.  Looking out, she sees Jade Fox in the distance.   Stop it!  Jen pulls out Yu's comb.   Let her in.    Jen climbs up toward the temple, finally reaching the temple gate, and sees Lo standing there.  He runs to her.  She greets him.    Jen and Lo make love.    Lo wakes up to find the jade comb on the pillow beside him, Jen gone.    Lo catches up to Jen, who stands on a bridge.  The gorges below are shrouded in clouds.  She looks back at him.",
        "De": "Workers are busy unloading the contents from the carriages. Boss Giao is checking off the merchandise -- a cargo of medicinal herbs.   Governor Yu has arrived.   Sir Te said to leave the sword in here.  De Lu opens the door and is startled to find a young woman inside.  The woman is studying the sheets of calligraphy hanging on the walls.   Who are you?   This is Sir Te's study.  You are here to...   I am Sir Te's head servant.  And this is another of our guests.    It's dusk and the sky is beautiful orange and purple.  Jen is leaving the study escorted by her maid.  She turns to Yu for a final good-bye.  Yu seems intrigued by the encounter.    A masked figure silently opens the window and enters the room.  It moves swiftly to the sword case, opens it, and wraps the sword.  Bo enters, sees the thief, who leaps up to the ceiling.  The thief steps over Bo and out into the courtyard.  Bo tries to stop the thief, who easily outwits him, jumping onto the roof as Bo yells out.    Bo is surprised to see the hooded figure battling with two other fighters -- Tsai  and May, his daughter.    Bo follows Tsai and May, who are quickly walking away.    De Lu escorts Yu into Te's.   Sir Te awaits you.    Madam Yu is returning from temple.  The governess is helping her out of the carriage.  Servants are peeling bills off a wall across the street.    The maid escorts Yu out.  Yu pauses, looks around, and sees the profile of the Governess peering at her from around a corner.    ...the face of a younger, less sophisticated Jen, as she lets the dry desert air flow through her hair.  She sits in a carriage, part of a caravan, with guards on horseback, that is traveling through the spectacular desert.  Across from her sits her mother, of whom she is barely cognizant.    Tsai and May have been sitting, hidden in the branches of a tree, watching Jen.   Pardon my intrusion.  Master Li, your room is ready.    Yu sits with Madam Yu and Jen.  They busy themselves with various items for her trousseau.    Jen holds up a comb, with daylight shining through it.  Jen admires the piece, her most prized possession.  Madam Yu sits opposite her.    Lo and a group of armed bandits descend on the caravan.    Jen and Lo ride across the desert floor at breakneck speed.    A group of bandits is dividing up the loot, as Jen rides up, keeping a respectable distance.  They notice her and rise as she dismounts.  One of them saunters over to her and stands, grinning, a few feet away.  In a second, she's slammed his balls into his stomach and knocked his nose into his face.  He crumples to the sand.  The other bandits stop laughing, quickly exchange glances, and charge her at once.  In a matter of seconds, they're either on the ground or dragging their fallen comrades back.  Lo calls out and stops the fight.    Lo and Jen ride, if not side-by-side, then parallel, about 20 feet apart.  Their pace has slowed considerably.  In fact, they're dead tired.    Jen tries to find her way among the treacherous stony terrain, her lips chapped and fingers bloody and blistered. But soon she passes out.    Lo and Jen ride across the desert.  Jen holds tightly to him.    Lo sees uniformed men through his binoculars.    Lo and Jen ride through a mountain pass.    Li and Yu ride together.",
        "Lu": "Governor Yu has arrived.   Sir Te said to leave the sword in here.  De Lu opens the door and is startled to find a young woman inside.  The woman is studying the sheets of calligraphy hanging on the walls.   Who are you?   This is Sir Te's study.  You are here to...   I am Sir Te's head servant.  And this is another of our guests.   Sir Te awaits you.   Pardon my intrusion.  Master Li, your room is ready.    A group of bandits is dividing up the loot, as Jen rides up, keeping a respectable distance.  They notice her and rise as she dismounts.  One of them saunters over to her and stands, grinning, a few feet away.  In a second, she's slammed his balls into his stomach and knocked his nose into his face.  He crumples to the sand.  The other bandits stop laughing, quickly exchange glances, and charge her at once.  In a matter of seconds, they're either on the ground or dragging their fallen comrades back.  Lo calls out and stops the fight.",
        "Maid": "Governess...   Madam Yu, someone's put up posters.  A partially torn flyer with the words \"Jade Fox will not escape justice!\" is seen on the ground.   There is a Miss Shu Lien here to see you.  Jen stops and looks up at them.   I'll tell her.   This way please.  The governess and Yu exchange quick glances.  The governess bows slightly and departs.   We heard noises.",
        "Governor": "Your knowledge is remarkable, Sir Te.   I see your point.  Please continue.    Bo is surprised to see the hooded figure battling with two other fighters -- Tsai  and May, his daughter.    Bo follows Tsai and May, who are quickly walking away.    Yu slowly gets the upper hand in her fight with the thief. A small arrow cuts across the night and flies toward Yu. She catches it, but the masked figure takes the opportunity to get away.  Yu pauses to feel the arrow in her hand, standing in the empty courtyard.    Madam Yu is returning from temple.  The governess is helping her out of the carriage.  Servants are peeling bills off a wall across the street.    Tsai and May have been sitting, hidden in the branches of a tree, watching Jen.    The Governess leaves, a small sack over her back.",
        "Yu": "Security men and porters are loading wagons for a convoy. As they work, we see across the lake a lone horseman entering the village.  One of the men recognizes him.    Aunt Wu runs hurriedly through the halls.    Yu, a beautiful woman in her early 30s, is finishing packing for the convoy, wrapping a few small items in a linen wrapper, as Aunt Wu bursts in.     Mu Bai...It's been too long.   Good.  And how are you?   Monk Zheng said you were at Wudan Mountain.  He said you were practicing deep meditation.   The mountain must be so peaceful... I envy you.  My work keeps me so busy, I hardly get any rest.   Why?  You're a Wudan fighter. Training is everything.   You were enlightened?   What was it?   We're preparing a convoy for a delivery to Peking.   The Green Destiny Sword?  You're giving it to Sir Te?   I don't understand.  How can you part with it?  It has always been with you.   You use it justly, you're worthy of it.   So what will you do now?  Li doesn't reply.   Come with me to Peking.  You can give the sword to Sir Te yourself. It'll be just like old times.   Join me once you have finished.  I can wait for you in Peking.   Thanks.  Let's go into the city.   Just doing my job.   Thank you.   Sir Te!  It has brought him as much trouble as glory.  Help him to leave these troubles behind. Otherwise, he'll never be able to start anew.    You've always been so good to Li Mu Bai and me.  Please accept our thanks.   Please, Sir Te, what is it?   I don't know...   I beg your pardon.  Li Mu Bai and I aren't cowards.   The handle is heavy.  And the blade is no ordinary metal.  Still, the sword is the lightest of weapons. You're just not used to handling it.   Beautiful but dangerous.  Once you see it tainted with blood, its beauty is hard to admire.  It's 400 years old.   My friend Li Mu Bai.  He's given it to Sir Te as a gift.   You're too young to understand.   Yes, I am.  But I prefer the machete.  Certain moves, however, call for a sword.   Fighters have rules too: friendship, trust, integrity... Without rules, we wouldn't survive for long.   Writers wouldn't sell many books if they told how it really is.   Sure.  No place to bathe for days, sleeping in flea-infested beds... They tell you all about that in those books?   So I heard.  Congratulations.  It's the most important step in a woman's life, isn't it?   What do you think?   You're probably right.  Yu studies Jen.  The room falls silent for a moment.   Your knowledge is remarkable, Sir Te.   I see your point.  Please continue.    Bo is surprised to see the hooded figure battling with two other fighters -- Tsai  and May, his daughter.   Return the sword, and I'll let you go.  The figure just regards her, slightly shifting weight.  Yu attacks, but the figure repels her.   You've been trained at Wudan?  The figure answers by leaping to another rooftop.  Yu catches up, and resumes her attack with a relentless series of lightning-quick blows.    Bo follows Tsai and May, who are quickly walking away.   Get down here!  Give back the sword!    Yu slowly gets the upper hand in her fight with the thief. A small arrow cuts across the night and flies toward Yu. She catches it, but the masked figure takes the opportunity to get away.  Yu pauses to feel the arrow in her hand, standing in the empty courtyard.   Has Governor Yu ever seen the sword?   But the sword could be in his compound.    Madam Yu is returning from temple.  The governess is helping her out of the carriage.  Servants are peeling bills off a wall across the street.   What is it?   Let me see.   How so?   You're doing calligraphy?   I never realized my name looks like \"sword.\"  Jen freezes slightly.   You write gracefully.  Calligraphy is so similar to fencing.   Thank you for seeing me.  I hear your wedding day is near.  You must be overwhelmed by the preparations.   You are fornuate to marry into such a noble family.   Do you think so?  Let me tell you a story.   Yes.  Did you know I was once engaged to be married?   His name was Meng Si Zhao.  He was a brother to Li Mu Bai by oath. One day, while in battle, he was killed by the sword of Li Mu Bai's enemy.  After, Li Mu Bai and I went through a lot together.  Our feelings for each other grew stronger.  But how could we dishonor Meng's memory?  So the freedom you talk about, I too desire it.  But I have never tasted it.   I am not an aristocrat, as you are... but I must still respect a woman's duties.   Then as a sister, let me wish you happiness in your marriage.    The maid escorts Yu out.  Yu pauses, looks around, and sees the profile of the Governess peering at her from around a corner.   What a godforsaken place!  Can't your father be appointed closer to civilization?  Jen... are you listening to me?  Jen is still looking out the side of the carriage, at a beautiful mountainside.    Tsai and May have been sitting, hidden in the branches of a tree, watching Jen.   But something is going on at the Yu household.   You always suspected she'd fled to the West.   Is there any place safer than under the nose of Governor Yu?   Be careful.  Sir Te requires discretion.  Official business is difficult enough.  Don't let personal feelings make it worse. And I don't know... even this poster... could be some sort of trap.   No.   It was Bo, Sir Te's man.  I hear he followed the thief to the Yus'.   No, not yet...   No, I'd already sent them home. You can blame me for losing the sword, but please trust that I'll get it back soon using my own methods.   What do you mean?  Didn't you come back here for it?   Then, why did you come?   I'd bet my life on it!   We must be careful.  Governor Yu is a court official, and in charge of security.  Any disturbance will cast suspicion on him.  It might get Sir Te in trouble.   Sir Te, can you find some excuse to invite Madam Yu and her daughter?   The best way to trap a fox is through her cubs.  Sir Te and Li look puzzled.   Madam Te is certainly spoiling us with these wedding gifts.  She's being so considerate.   I'm sorry she's not feeling well enough to receive you today.   I heard Sir Te lost something.  And now Madame Te's not feeling well...  Jen sits silently reading.   We know who stole the missing item. If the thief returns it, I'm sure Sir Te will pursue the matter no further.   That's good.  Sometimes the help can't keep their hands to themselves. It's very embarassing.   Sir Te knows that even well-meaning people can make mistakes... that can bring ruin to themselves and their families.   But don't be too lenient.   No mercy will be shown toward the murderer who turned up in Peking.   A murderer?   Yes.  The very killer of Li Mu Bai's own master.  Last night, she killed a policeman who had tracked her down.   A female criminal!  Now that's news!  Jen becomes visibly upset.   Yes, from the West.  He went undercover and and followed her here,   Maybe the murderer and the thief are one and the same.   I doubt it.  This thief... it very unusual...  As Yu speaks, she lifts the tea pot to pour Jen some tea. As she finishes speaking, she looks into Jen's face and the pot slips from her hand.  Without even looking down, Jen instinctively catches the pot with a lightning-fast move.   ...And most likely smarter than a mere killer.  Sir Te and Li Mu Bai walk by.    The Governess leaves, a small sack over her back.   The sword is back... are you happy?  Li smiles.   But it's not your sword anymore. You gave it to Sir Te.   My job was to get the sword back, without embarassing anyone.  I wasn't about to ruin her life, or her father's.   I knew she would intrigue you.   She's an aristocrat's daughter. She's not one of us.  In any case, it will all be over soon.  You'll kill Fox, and she'll marry.   But Wudan does not accept women.   It's not our affair.  Even if Wudan accepts her, her husband might object.   I wish there were something more I could do to help you.   Jen... stop playing with it.  Jen looks out over the desert, as the wind picks up and the sky darkens.   Lower the shade, don't let them see you!   You think Jade Fox will show up?    Come with me!  Hurry!    You thought she'd give it all up and go back West with you?   Don't you want to see her again.   Have some tea.  As Yu passes the cup to Li, their fingers touch. Embarrassed, Li pulls back.   Not everything is an illusion.  My hand... wasn't that real?   To repress one's feelings only makes them stronger.   Her husband.  The men all nod their heads.   What about you?   Not a bad idea.  Tonight we'll get a good night's sleep at headquarters.  Yu takes a fork off the road.  Thunder can be heard in the darkening sky.   It's you!  How's everything here?   Yes, and I leave again tomorrow. Your wife was due?   Good!   Mrs. Wu...   How's the arm?  Still sore?   Li Mu Bai is coming to stay the night.    Yu eases her guard, then opens a drawer, and takes out some clothes.  Jen, wearing just white underclothing, sets herself on the edge of Yu's bed.  Yu brings over the clothes.   Here you must be in proper attire.   I'll give them to you.   Look at the trouble you've caused. Now you know what Giang Hu life is really like.  If you think of me as your sister, let me give you some sisterly advice.  You can run from marriage, but not your parents.   Go back to them first.  Then you can decide about Lo.   He really loves you.  Come back to Peking with me.  We'll find a solution.   Li Mu Bai has made arrangements. He sent him to Wudan Mountain.   How dare you accuse us?  I always knew you had stolen the sword! I've done nothing but protect you and your family.  And you're repaid me with nothing but contempt.  Li Mu Bai himself spared you, and all you do is insult him.  We wanted some peace and you've ruined it all! You're no sister of mine!   Put the sword down!  Jen jumps out.    Jen soars out to the front courtyard where the guards are still practicing.  They raise their weapons at the sight of an intruder.    Jen!  Jen greets Yu with the Green Destiny.   Everyone out.  Shut the doors.  The men leave.   Fine... the friendship is over.  Yu scoops up a weapon from one of many lying around and begins her battle with Jen.  Yu uses every weapon that's available against Jen but none are any match for the Green Destiny.  After slicing through another set of Yu's weapons, Jen looks admiringly at the Green Destiny in her hands.   Don't touch it!  That's Li Mu Bai's sword.   Without the Green Destiny, you are nothing.   Give me the sword.  Jen, taking advantage of Yu's trust, slices her arm.    Aunt Wu finishes bandaging Yu.   I didn't have the heart.   What happened?   We followed Jade Fox.  Instantaneously, a flurry of darts flies directly in Jen's direction.  Li and Yu swipe miraculously at them all, sending them flinging hither and thither.  Fox shows herself.  Li attacks her.  She falls back, bleeding to death.   A poisoned needle!   You can't die!  Tell us what poison you used!  You can't die!  Tell us the antidote!  You can't let Li Mu Bai die!   That can't be!  Everything has an antithesis!  Why not this?   (takes the comb from her hair Take my horse and go to the compound. Give this to Mrs. Wu.  She'll help you.  Hurry!    The guards surround Jen.  She pushes past them.   Mu Bai, hold on.  Give me some hope...   Save your strength.   Use it to meditate.  Free yourself from this world as you have been taught.  Let your soul rise to eternity with your last breath.  Do not waste it... for me.   Bo... please take this sword back to Sir Te.  He takes the sword from her.    Now you must go to Wudan Mountain. Lo awaits you there.  Promise me one thing, whatever path you take in this life... be true to yourself.",
        "Bo": "Chilly, eh?   Someone help!  Stop him!  He's on the roof!  The sword's been stolen! Stop thief!  Stop him!  The thief skips a few times and jumps off to a side street.  Bo grabs a pole and runs, as gongs begin to sound, alerting people to the theft.  People rush outside, Yu Shu Lien among them.   Do something!  He's getting away!   You were rehearsing?  Who are you trying to fool?  May wants to respond but is again cut off by Tsai.  They run off.   Where did that thief go?  Bo looks around and discovers he had chased the thief into Governor Yu's compound.   Governor Yu's house!   I'm sure the thief is in the Yu household.   But I say --   Where are they?    Jen practices calligraphy.  The governess is by her side embroidering and throwing occasional glances at Jen.  The maid enters.   Wait!  I'm a friend!  Tsai pauses.   Why were you spying on the Yus?   This Jade Fox is a woman?   Then leave her to me.   I'm ready for anything!  Bo fishes into the pot with his chopsticks.  May intercepts him with her own chopsticks.   The fox doesn't care much for punctuality.  Still no sign of her.  An old lady struggles up the hill, wearing a floppy hat over her face, holding a cane.  The three exchange glances.   That's what you think, old witch!   You'll pay for that!  A fierce battle begins, the main fighting between Tsai and Fox, with May and Bo getting a stab in occasionally, when the opportunity presents itself.   Another one!   I'm standing guard.   Jen has run away!  Gou found the wedding chamber empty.  Governor Yu requests your assistance.  You know the Giang Hu underworld.  He wants to find her, and keep her from harm.    Jen runs into a sea of bamboo.  She appears to have lost Li but is not slowing down.  Her white clothes are now stained with blood and mud.  The wind had picked up and every breeze sounds like an air attack by Li.  The two leap onto the tips of the bamboo trees and begin their dances and dodges.  They glance off bamboos and each other while staying afloat.  Finally Jen lands on the same stick of bamboo as Li.  The two hold their positions for a while, as the bamboo bends.",
        "Madame": ""
    },
    "imdb_rating": "7.9",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNDdhMzMxOTctNDMyNS00NTZmLTljNWEtNTc4MDBmZTYxY2NmXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "In early nineteenth-century China, in the waning years of the Qing dynasty, the renowned swordsman who yearns for enlightenment, Li Mu Bai, decides to give up his legendary Green Destiny sword: the sharp four-hundred-year-old blade of heroes. To mark the end of a blood-stained career, Li entrusts the excellent female warrior, Yu Shu Lien, with the precious weapon to deliver it to Governor Yu; however, once there, an audacious and nimble masked thief manages to steal it. As Shu Lien is hot on the trail of the skilled burglar, unrequited loves; fervent passions; an unconquerable desire for freedom, and bitter loose ends stand in the way. Can Mu Bai shake off his violent past?—Nick Riganas",
    "name": "Wo hu cang long",
    "genres": [
        "Action",
        "Adventure",
        "Drama"
    ]
}