{
    "filename": "Dances-with-Wolves_script.txt",
    "imdb_id": "tt0099348",
    "imdb_url": "https://www.imdb.com/title/tt0099348",
    "characters": [
        "Kicking Bird",
        "Spivey",
        "Lieutenant Elgin",
        "Smiles A Lot",
        "Black Shawl",
        "Stone Calf",
        "Lieutenant Dunbar",
        "Stands With A Fist",
        "Worm",
        "Otter",
        "Ten Bears (as Floyd Red Crow Westerman)",
        "Timmons",
        "Major Fambrough",
        "Pretty Shield",
        "Wind In His Hair"
    ],
    "dialogues": {
        "Kicking": "Yes... it is good. The grass is rich. The game is plenty and not running away.  I was thinking of a dance.  Yes.  I have seen such a sign.  I saw a man, a white man.  Just one. He was naked.  I saw his sex.  No.  He might be a god or he might be a special chief -- that's why we are thinking of having a talk with him.  You are right, we need meat today and tomorrow. But we must also have meat in ten years.  But the whites are coming. Our friends the Shoshone and the Kiowa, even our enemies, agree on this -- the whites are coming. More than can be counted.  Wind In His Hair has spoken straight, his words are strong and I have heard them. It's true the whites are a poor race and it's hard to understand them. But when I see one white man alone, without fear in our country, I do not think he is lost. I think he may have medicine. I see someone who might speak for all the white people who are coming. I think this is a person with which treaties might be struck.  The soldier did not come to fight -- he is going away and we will let him.  Buffalo.    Have you seen any buffalo?     Stands With A Fist.  We will talk awhile.     Your wounds are healing well?  You are happy here, with my family?  Perhaps you will marry again when the time is right.  We have word from many places that the whites are...  They are coming into everyone's country. They will soon be in ours I think. This white man who lives at the old soldier fort, the one who calls himself loo ten tant... I have visited him and I believe his heart is a good one. He knows things about the whites which we do not.  He is only one man.  Every warrior in camp would fight them if they tried.  I cannot make the white man talk. Loo ten tant does not know Sioux.  You have a certain medicine which no other Sioux -- man or woman -- has.  I do not ask this for myself... I ask this for all our people.  I want you to try and remember the the word.  You don't want to know.     Perhaps I am asking too much.  Buffalo?  The buffalo have come.  Loo ten tant...  Where is loo ten tant?  Does it scratch the skin?                       Yes, he is special... he should have a real name.       I know.           We were waiting for you.    Ask him why he is at the soldier fort.  What does he say?  Ahhh... He's right. I'm sorry.         (to Stands With A Fist                                       I don't know.  Something has happened? Well what?  With who?  Are you certain of this?  What are people saying? They're not angry?  I suppose I will be the one to say something.  Stands With A Fist.  You are no longer a widow.     This is a good day for me.  Stands With A Fist... if you want this man, take his hand in yours.  Have you heard all that I have said?  Good, then take her inside... she is your wife.  Dances With Wolves, are you in there?  I am riding today to a far away place. It is a place I haven't seen for a long time. A sacred place. I would like you to come with me.  Yes it must be.  No waiting?  I was just thinking that of all the trails in this life, there is one that matters more than all the others. It is the trail of a true human being. I think you are on this trail and it is good to see.  It is said that all the animals were born here... that from here they spread over the prairies to feed all the people. Even our enemies say this is a sacred place.  No, they've been gone a week maybe more... we will water the horses and go home.  Help me to know how many.     We cannot wait for you.  Something has happened... Dances With Wolves is not coming.  Pick two good men with fast ponies and send them back to the soldier fort.     You've finished your pipe? How does it smoke?  It doesn't seem possible that we could come this far.",
        "Bird": "Yes... it is good. The grass is rich. The game is plenty and not running away.  I was thinking of a dance.  Yes.  I have seen such a sign.  I saw a man, a white man.  Just one. He was naked.  I saw his sex.  No.  He might be a god or he might be a special chief -- that's why we are thinking of having a talk with him.  You are right, we need meat today and tomorrow. But we must also have meat in ten years.  But the whites are coming. Our friends the Shoshone and the Kiowa, even our enemies, agree on this -- the whites are coming. More than can be counted.  Wind In His Hair has spoken straight, his words are strong and I have heard them. It's true the whites are a poor race and it's hard to understand them. But when I see one white man alone, without fear in our country, I do not think he is lost. I think he may have medicine. I see someone who might speak for all the white people who are coming. I think this is a person with which treaties might be struck.  The soldier did not come to fight -- he is going away and we will let him.  Buffalo.    Have you seen any buffalo?     Stands With A Fist.  We will talk awhile.     Your wounds are healing well?  You are happy here, with my family?  Perhaps you will marry again when the time is right.  We have word from many places that the whites are...  They are coming into everyone's country. They will soon be in ours I think. This white man who lives at the old soldier fort, the one who calls himself loo ten tant... I have visited him and I believe his heart is a good one. He knows things about the whites which we do not.  He is only one man.  Every warrior in camp would fight them if they tried.  I cannot make the white man talk. Loo ten tant does not know Sioux.  You have a certain medicine which no other Sioux -- man or woman -- has.  I do not ask this for myself... I ask this for all our people.  I want you to try and remember the the word.  You don't want to know.     Perhaps I am asking too much.  Buffalo?  The buffalo have come.  Loo ten tant...  Where is loo ten tant?  Does it scratch the skin?                       Yes, he is special... he should have a real name.       I know.           We were waiting for you.    Ask him why he is at the soldier fort.  What does he say?  Ahhh... He's right. I'm sorry.         (to Stands With A Fist                                       I don't know.  Something has happened? Well what?  With who?  Are you certain of this?  What are people saying? They're not angry?  I suppose I will be the one to say something.  Stands With A Fist.  You are no longer a widow.     This is a good day for me.  Stands With A Fist... if you want this man, take his hand in yours.  Have you heard all that I have said?  Good, then take her inside... she is your wife.  Dances With Wolves, are you in there?  I am riding today to a far away place. It is a place I haven't seen for a long time. A sacred place. I would like you to come with me.  Yes it must be.  No waiting?  I was just thinking that of all the trails in this life, there is one that matters more than all the others. It is the trail of a true human being. I think you are on this trail and it is good to see.  It is said that all the animals were born here... that from here they spread over the prairies to feed all the people. Even our enemies say this is a sacred place.  No, they've been gone a week maybe more... we will water the horses and go home.  Help me to know how many.     We cannot wait for you.  Something has happened... Dances With Wolves is not coming.  Pick two good men with fast ponies and send them back to the soldier fort.     You've finished your pipe? How does it smoke?  It doesn't seem possible that we could come this far.",
        "Spivey": "Yessir sergeant...  We didn't see nothin' sir.  He's outside. But he didn't see nothin' either.  What's it to you?  Can you read?  Alright... hold your horses.  I don't see nobody.  Lookit the stupid bastard... he ain't even runnin'.  You dumb sons a bitches.  You want more?... get up... get up.",
        "Lieutenant": "",
        "Elgin": "Turn right... all the way to the end of the hall.  It's alright Major.  Don't sergeant.  Let's have the pistol.  You have proof of that?  Spivey, you and Edwards were here first. Did you find anything... a journal.  Where's Edwards?  What is your name?  You say you are an officer?  No.  There are no orders and there is no journal.  Why are you out of uniform?  Why are you out of uniform?  We are charged with apprehending hostiles, recovering stolen property and retrieving white captives taken in hostile raidings.  Are you willing to cooperate or not?  Sergeant... have a detail take him down to the river... let him clean up his face.  Spivey!  I see you bash the prisoner once more and I'll put those shackles on you...  You men! Get back to your places.",
        "Black": "Will she make the white words?  How is Dances With Wolves?  How is he learning?  You are not talking today?  People are talking about you...  They are proud of the medicine you are making with Dances With Wolves.  You can't, he is gone.  How long will Stands With A Fist mourn?  I hope it will not be too long.  She has found love again.  Dances With Wolves.  When you see them together you will know.  No. They like the match. It makes sense. They are both white.  She's your daughter now.  You can't see everything coming.",
        "Shawl": "Will she make the white words?  How is Dances With Wolves?  How is he learning?  You are not talking today?  People are talking about you...  They are proud of the medicine you are making with Dances With Wolves.  You can't, he is gone.  How long will Stands With A Fist mourn?  I hope it will not be too long.  She has found love again.  Dances With Wolves.  When you see them together you will know.  No. They like the match. It makes sense. They are both white.  She's your daughter now.  You can't see everything coming.",
        "Stone": "You were right about loo ten tant -- he is a special white man.     Some of your words are wrong... but you are learning fast. That is good. What can I tell you today?  What is your question?  She is in mourning.  She is crying for someone.  It is not polite to speak of the dead... But I will tell you... you are new. She cries for her husband. He was killed not long ago.  It is Kicking Bird's place to say when she is finished.  The Pawnee do not come for horses, they come for blood... and with many men gone, we are few.  Get your weapons and come to my lodge.",
        "Calf": "You were right about loo ten tant -- he is a special white man.     Some of your words are wrong... but you are learning fast. That is good. What can I tell you today?  What is your question?  She is in mourning.  She is crying for someone.  It is not polite to speak of the dead... But I will tell you... you are new. She cries for her husband. He was killed not long ago.  It is Kicking Bird's place to say when she is finished.  The Pawnee do not come for horses, they come for blood... and with many men gone, we are few.  Get your weapons and come to my lodge.",
        "Dunbar": "This is where I belong... this is my outfit.  It was no good... what's going on here?  Alright by me.  Forgive me Father.  Don't take off my foot.  The strangeness of this life cannot be measured. In trying to produce my own death, I was elevated to the status of a living hero.  Where can I find Major... Fambrough?  Sir?  Yes sir?  Excuse me?  No sir.  Yes sir.  Actually sir, I'm here at my own request... I want to see the frontier.  Yes sir... before it's gone.  I'm wondering sir, how will I be getting there?  No sir, it's just that I don't know.  Were it not for my companion I believe I would be having the time of my life. He is quite possibly the foulest person I have ever met.  We have been gone four days now and still we have seen no signs of life. Only earth and sky.  How far do you make the fort?  How far?  It's going to be my post... my home.  Timmons... Timmons.  Timmons.  Something's out there...  Might have a look.  How come we haven't seen any buffalo?  What about Indians?  Alright...lets unload the wagon.  I'm staying too... we don't know what's happened.  Not at the moment, no.  This is my post...  This is my post! And these are the post's provisions. Now get your ass off that wagon and help me unload.  Good.  Thank you.  Have arrived to find Fort Sedgewick deserted. Am now waiting for the garrison's return or word from headquarters. Post is in exceedingly poor condition. Have decided to assign myself clean-up duty beginning tomorrow. Supplies abundant. The country is everything I dreamed it would be. There can be no place like this on earth.  Damn... damn.  No sign of Captain Cargill's command. I don't know what to do. Communication can only take place if I leave and I don't want to abandon my post.  Made a short patrol yesterday p.m... discovered nothing. Will go further tomorrow.  There is a wolf who seems intent on the goings on here. He does not seem inclined to be a nuisance however and aside from Cisco has been my only company. He has appeared each afternoon for the past two days. He has milky white socks on both feet. If he comes calling tomorrow I will name him Two Socks.  Almost a month and no one has come. The longer this condition persists, the less inclined I am to believe that anyone will. Rain has forced me indoors for most of two days. I have begun an awning. The work has ruined my hands, but I am excited about the improvement it will bring to this place.  It is the loneliest of times... but I cannot say that I am unhappy.  You there!  Have made first contact with a wild Indian. One came to the fort and tried to steal my horse. Do not know how many more are in the vicinity but I am taking steps for another visitation. Am burying excess ordnance, lest it fall into enemy hands.  Have made all the preparations I can think of. I cannot mount an adequate defense but will try to make a big impression when they come. Waiting.  The man I encountered was a magnificent looking fellow.  I realize now that I have been wrong. All this time I have been waiting. Waiting for what? For someone to find me? For Indians to take my horse? To see a buffalo?  Since I arrived at this post I have been walking on eggs. It has become a bad habit and I am sick of it. Tomorrow morning I will ride out to the Indians. I do not know the outcome or the wisdom of this thinking. But I have become a target and a target makes a poor impression. I am through waiting.  Wait...  Wait... you're hurt.  Let me help you.  You're hurt... you need help.  She's hurt.  Welcome... Come... please... sit down.  Would you like some coffee? Coffee?  I'll get some cups.  Is the coffee not good? Too strong maybe? Here...    So what are you guys doing? Looking for buffalo?  He's a good one... good horse. My horse.  Good horse.  My horse. You see any buffalo?  Wait just a bit.      Buffalo.  The sugar didn't figure to last at that rate any way. I don't believe I'd go too far in saying that a foundation for good relations is being laid.  They have come again, as always the same two with an escort of six.  I believe I am dealing with Kiowa Indians as I have heard that word on several occasions.  I am learning the Kiowa words for head, hand, horse, fire, coffee, buffalo, hello and goodbye.  No, I haven't seen any buffalo. Are you hungry? I have food... are you hungry?  Nothing I have been told about these people is correct. They are not beggars and thieves. They are not the bogeymen they have been made out to be.  Buffalo...  Buffalo... Buffalo.  Yes. Buffalo.  I wish I knew what to say.  Thank you.  Look I'm full... I can't tell the story again.  Go ahead.    Here.  This is too much... I can't take this...  I can't... No more...  I can't, I'm full... very full...  That's my hat.  My hat.  Yes, it's good. But, I have to sleep.  They asked me to dance...  I was just dancing...  To stay any longer would've been useless. We had all the meat we could possibly carry. We had hunted for three days, losing half a dozen ponies and only three men injured. Many times I have felt alone but until this afternoon, I have never felt completely lonely.  Made a long patrol today. There is nothing to report. The truth is I am bored.  Though only two days it seems like a week. I am missing the company of my new friends. I can see all of their faces, but somehow it is not enough. Tomorrow, I will make an unannounced visit. After all, they are my neighbors, what can it hurt?  Go home.  Damn him.  C'mon Two Socks... you can't go... so go home.  Alright then, don't go home. But stay... stay right here.  You go home.  Thank you... I feel good.  Wait... what is your name?  Kick?  Kicking?   (to Stands With A Fist  Oh...  (to Stands With A Fist  Up? Get up?  Stand.  Stands With A...  Fist?  Stands With A Fist. I'm John... John Dunbar.  Yes.  I try to answer all of Kicking Bird's questions but I know he is frustrated with me. He always wants to know how many more white people are coming. I tell him that it is impossible for me to say. When he persists I tell him that the white people will most likely pass through this country and nothing more.  But I am speaking to him in half- truths. One day there will be too many, but I cannot bring myself to tell him that. I am sure that Stands With A Fist knows.     A war party is going against the Pawnee soon and I have asked to go. I sensed that I have made a mistake in doing so but I could not bring myself to take it back. They are my friends and from what little I gather the Pawnee have been very hard on these people. I hope I have not overstepped my bounds.  I'm glad to see you... please sit.  They are Sioux enemies.  I asked that he would think about my going.  Then tell him this. I have been a warrior for longer than many of the young men that will go on this war party. Tell him.  I know, I understand. But I cannot learn these ways in camp.  I will be happy to watch over your family.  Who is Dances With Wolves?  Dances With Wolves... that's right. How do you say it?  (in Sioux to Kicking Bird",
        "Worm": "Otter doesn't want to go.  I will be when my father finds out, his bow will be across my back.  We got a snake.  Dances With Wolves' door is closed alot these days.  Maybe they're having a hard time. Some people have a hard time.",
        "Otter": "Maybe.  Who gets the white god horse?  I have him.  I don't know. My arm doesn't work.  It was your idea.    We're gonna see if it can swim the river. You wanna come?  I know that.  Me neither.  Maybe we should pull the smoke flap closed. Then they would come out.",
        "Timmons": "Far.  Forty or fifty miles, maybe... what's the big hurry on Sedgewick?  You ain't hard to please, I'll say that.  Look yonder.  Somebody back east is sayin'... \"why don't he write?\" Stupid bastard.  Somethin' dead.  Might stay clear of whatever did the killin'.  Can't figger the stinkin' buffalo. Sometimes you don't see 'em for days, sometimes they're thick as curls on a whore.  Goddamn Indians you'd jus' as soon not see, lessen the bastards're dead. Nothing but thieves and beggars.  Not what you'd call a going concern.  Ain't nothin' here lieutenant.  Everybody's run off... or got kilt.  What, and leave it all here?  There ain't nothin' here lieutenant.  So things bein' the way they are we might as well turn around and get started back.  This is my... are you crazy boy?  Well... I'll let 'em know where you are.  Good luck lieutenant.",
        "Major": "Does he speak english?  Who are you?  Why are you dressed like this?  We will ascertain that for ourselves. Now if you guide us to these camps and serve as an interpreter, your conduct will be reevaluated.  Your status as a traitor might improve should you choose to cooperate with the United States Army.  Well, speak up...  What's that?",
        "Fambrough": "Lt. John J. Dunbar.      Lt. John J. Dunbar.  Indian fighter, huh?    I did not ascend to this position by being stupid.  It says here you've been decorated.  And they sent you out here to be posted?  You want to see the frontier?  Such a smart lad coming straight to me.  Sir Knight, I am sending you on a knight's errand. You will report to Captain Cargill at the furthermost outpost of the realm... Fort Sedgewick.  My personal seal will assure you safe passage through many miles of wild hostile country.  You think I don't know?  Hold your tongue.  I'm in a generous mood and will grant your boon. You see that peasant... he calls himself Timmons... he leaves this very afternoon for your Fort Sedgewick. Ride with him if you like... he knows the way. That is all.  Sir Knight...  I just pissed in my pants... and nobody can do anything about it.  Noooo, noooo...  Nooo, nooo...  Are you deaf fool. I said I'll have my crown this instant... this instant!  The king is dead... long live the king.",
        "Pretty": "He is keeping to himself.  That's what she says.",
        "Shield": "He is keeping to himself.  That's what she says."
    },
    "imdb_rating": "8.0",
    "description": "Lt. John Dunbar is dubbed a hero after he accidentally leads Union troops to a victory during the Civil War. He requests a position on the western frontier, but finds it deserted. He soon finds out he is not alone, but meets a wolf he dubs \"Two-socks\" and a curious Sioux tribe. Dunbar quickly makes friends with the tribe, and discovers a white woman who was raised by the Sioux tribe. He gradually earns the respect of these native people, and they learn from each other and befriend each other.—Greg Bole <bole@life.bio.sunysb.edu>",
    "name": "Dances with Wolves",
    "genres": [
        "Adventure",
        "Drama",
        "Western"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMDcxODQzMDMtMTZhZS00OTkxLWIyYjktOWVmNDdmYTExODljXkEyXkFqcGdeQXVyMjI0NTA4NzA@._V1_QL75_UY281_CR4,0,190,281_.jpg"
}