{
    "filename": "Dark-City_script.txt",
    "imdb_id": "tt0118929",
    "imdb_url": "https://www.imdb.com/title/tt0118929",
    "characters": [
        "Hotel Manager /Vendor",
        "May",
        "John Murdoch",
        "Mr. Wall",
        "Inspector Frank Bumstead",
        "Walenski",
        "Husselbeck",
        "Stromboli",
        "Emma Murdoch",
        "Mr. Rain",
        "Dr. Daniel P. Schreber",
        "Mr. Hand",
        "Mr. Book",
        "Karl Harris",
        "Taxi Driver"
    ],
    "dialogues": {
        "May": "",
        "John": "",
        "Murdoch": "",
        "Wall": "",
        "Walenski": "",
        "Husselbeck": "",
        "Stromboli": "Yes.  This way.  The handiwork of an extremely sick individual.  Youíve read the reports.  Not much to go on.  We know nothing about him, except that he likes to cut them... Always the same type of blade. Forensics match in each case... Anyway, it's all in the reports, read them for yourself.  Why are you wearing that thing on your face?  I see. One thingís for sure, heís ambitious. Youíll be a busy man from now on.  Thompson suffered a kind of severe delusion or some damn thing.  Anyway he isnít with us any longer.  The case is yours.  Go through his files. Take what you need. By the way, howís your mother?  Very good...  Letís go, Bumstead.  So much to do and so little time.  Enter!  What is it?  Why do you want to speak to him?  Bumstead, donít be so paranoid. Leave him alone  -  heís a sad case.  Iíll be the judge of that.  Anything else?  Absolutely not.  Up to my ears in cases right now  -  canít spare anyone.  What makes you think that!  If you would learn to concentrate on facts, not get so side-tracked  -  you might get things done faster, Bumstead...  John...  ...Murderer.  You'll sign a confession?  I need to speak to you.  Immediately.  Bumstead, these...  er, gentlemen are here to collect White.  Please, Bumstead.  Co-operate  - it's easier.  Yes.  That's right.  He's ill  -  he needs expert help.  If you could show them to the holding cell now.  (shouts at cringing  Alright, get out.  You stay.  Bumstead, you're starting to annoy me.  This case is very important to me.  Just a little warning:  I've got my eye on you inspector, remember that.  Hello, Bumstead.  Why do you always have to find things out the hard way!  Couldn't you just do your job, you idiot?  I told you, didn't I?  These people are not playing games, Bumstead.  They can do anything they want, don't you understand?  In a way, we <u>all</u> are, inspector! You.  Me.  Everybody!  Time for that early retirement, Bumstead.  Didn't bring the gold watch I'm afraid.",
        "Emma": "",
        "Rain": "",
        "Hand": "",
        "Book": "",
        "Karl": "Not often I get a chance to show these.  And this is me again about  -  um  -  I would guess about twelve feet further to the right of the last shot.  Now just behind the wall is the hotel I stayed at  -  sweet little place...  Hello...  Yes, he's here... It's for you.     Look!  This is a good one!  Which one?  Such a joker!  Like your father.  Yes.  It must be a closet or something.  Don't trip over.  It's dark up there.     John, I didn't see you there.  What is <u>that</u>?  Filthy beast!  Shoo!  Go on!  Shoo!",
        "Harris": "",
        "Taxi": "",
        "Driver": ""
    },
    "imdb_rating": "7.6",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMGExOGExM2UtNWM5ZS00OWEzLTllNzYtM2NlMTJlYjBlZTJkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,15,380,562_.jpg",
    "description": "John Murdoch awakens alone in a strange hotel to find that he has lost his memory and is wanted for a series of brutal and bizarre murders. While trying to piece together his past, he stumbles upon a fiendish underworld controlled by a group of beings known as The Strangers who possess the ability to put people to sleep and alter the city and its inhabitants. Now Murdoch must find a way to stop them before they take control of his mind and destroy him.—Anonymous",
    "name": "Dark City",
    "genres": [
        "Fantasy",
        "Mystery",
        "Sci-Fi"
    ]
}