{
    "filename": "Dead-Poets-Society_script.txt",
    "imdb_id": "tt0097165",
    "imdb_url": "https://www.imdb.com/title/tt0097165",
    "characters": [
        "Chemistry Teacher",
        "Knox Overstreet",
        "Steven Meeks",
        "McAllister",
        "Dr. Hager",
        "Charlie Dalton",
        "Richard Cameron",
        "John Keating",
        "Neil Perry",
        "Gerard Pitts",
        "Mr. Perry",
        "Hopkins",
        "Mr. Nolan",
        "Mrs. Perry",
        "Todd Anderson"
    ],
    "dialogues": {
        "Chemistry": "A teacher walks up and down the aisles, handing out books.",
        "Teacher": "Now just to review, you're going to follow along the procession until you get to the headmaster. At that point he will indicate to you to light the candles of the boys.   Pick three laboratory experiments from the project list and report on them every five weeks. The first twenty questions at the end of chapter one are due tomorrow.  The students let out a collective groan.",
        "Knox": "Hey, how's it going Neil?   Knox Overstreet.   Yeah Neil, tell him off. It couldn't get any worse.   All right, all right, Jesus. So what are you going to do?   Yeah, come along pal.  Todd looks up from his desk where he is setting his alarm clock.   Hey Spaz, Spaz.  Spaz turns around in time to be hit by a ball of crumpled up paper while Cameron smacks him on the shoulder.   Spooky if you ask me.   I can't make it guys. I have to have dinner at the Danburry's house.   Friends of my Dad's. They're probably in their nineties or something.   Yeah we'll see.  Neil approaches Todd, who's been sitting by the window staring down at the floor. Neil snaps his fingers to get Todd's attention.   Ready to go sir.   Hi. Knox Overstreet. Uh, Dr. Hager.   This is the Danburry's, right?   Mrs. Danburry?  Chris begins to laugh as Mrs. Danburry arrives behind her.   Yes.   Nice to meet you sir.   He's great. He just did a big case for GM.   Huh?   Terrible. Awful.  He leaves the door and sits down with the other boys.   Tonight, I met the most beautiful girl in my entire life.   She's practically engaged. To Chet Danburry.   Too bad? It's worse than too bad Pitsie, it's a tragedy. A girl this beautiful in love with such a jerk.   I can't just forget her Cameron. And I can't think about trig.  The radio Meeks and Pitts were working on begins letting out a high pitched hum.   Very funny Dalton.   What's the Dead Poets Society?   You mean it was a bunch of guys sitting around reading poetry?   I don't know Charlie.   Yeah? How?   But why do they swoon? Charlie, tell me why they swoon. Charlie!   Yuck.   An original piece.   Morose?   Great, Neil.    \"To Chris.\"  Charlie looks up from his desk with a grin.   I see a sweetness in her smile. Blight light shines from her eyes. But life is complete; contentment is mine, Just knowing that...  Several students begin to snicker.   just knowing that she's alive.  Knox crumples his poem and walks back to his desk.   Sorry, Captain. It's stupid.   That's not funny.   I can't take it anymore. If I don't have Chris, I'm gonna kill myself.   No, Charlie. That's just my problem. I've been calm all my life. I'll do something about that.   I'm gonna call her.  Knox begins to chuckle as he leaves the cave. The others quickly grab their coats to follow him. Charlie goes back to playing noise on his saxophone again.   She's gonna hate me. The Danburrys will hate me. My parents will kill me. All right, goddamn it. You're right. \"Carpe diem.\" Even if it kills me.  Knox puts in another coin and calls again.   Hello, Chris?   Hi. This is Knox Overstreet.   She's glad I called.   Would I like to come to a party?   Well, sure.   Okay, great. I-I'll be there, Chris.   Friday night at the Danburrys'. O-Okay. Thank you.   Thank you. I'll see you. Bye.   Yawp! Can you believe it? She was gonna call me. She invited me to a party with her.   Yeah.   So?   Well, of course not, Charlie. But that's not the point. That's not the point at all.   The point, Charlie, is, uh--   that she was thinking about me. I've only met her once, and already she's thinking about me. Damn it. It's gonna happen, guys. I feel it. She is going to be mine. Carpe. Carpe!  Knox flips his scarf dramatically around his neck as he walks away and climbs the stairs.   Hello? Hello, Chris?  Knox stops and combs his hair in the hallway mirror. Chris comes running out from one of the rooms.   Hi.   No.  Chris grabs Knox by his jackets and pulls him forward as she walks toward the stairs.   But I--   No relation. Never heard of him. Sorry, guys.   Whoa, I, uh, I don't really drink--   To Mutt.  They each take a big drink. Knox rolls his eyes and gasps, loosening his tie to try and breathe.   I don't really know Mutt.   To Mighty Mutt.  They raise their glasses again for a toast and down the rest of their glasses.   Will do.  Bubba puts on a horned football helmet and walks away.   God help me.  Knox looks about and then looks back down at Chris.   Carpe diem.  Knox takes a last swig of his drink  and then begins to softly run his fingers over Chris' hair. He then leans over and kisses her forehead. Across the room, Bubba looks over and sees what's going on.   Now, Chet, I know this looks bad, but you've gotta-  Chet throws himself at Knox, hurling them both to the floor. He then straddles Knox and begins to punch at him as Knox simply tries to protect himself.   I'm sorry. I'm so sorry.   Chris!  He approaches a girl with hair similar to Chris' and turns her around, only to realize that it's not her.   Chris Noel. Do you know where she is?   Thanks.  Chris is at her locker talking to a friend. She just closes her locker as she notices Knox coming towards her. She turns away.   Excuse me. Chris.   I came to apologize for the other night. I brought you these and a poem I wrote for you.  Chris pulls him aside, out of the main hallway.   I can't care. I love you, Chris.   Look, I acted like a jerk and I know it. Please, accept these. Please.   All I'm asking you to do is listen.  As Knox begins to read his poem, the classroom grows quiet as everyone stops to listen.   The heavens made a girl named Chris With hair and skin of gold. To touch her would be paradise.  Chris holds her head in her hands in embarrassment.   Yeah.  The boys begin to get all excited but Charlie shushes them.   Nothing.   Nothing. But I did it.  Knox walks away down the hall and the others chase after him.   Seize the day!   Chris.  Knox leaves the other boys to join her.   What are you doing here?   Go ahead, guys. I'll catch up.   Chris, you can't be in here. I-If they catch you, we're both gonna be in big trouble.   I didn't mean to make a fool out of you.   I can't, Chris. I love you.   Go ahead, Captain. I'll walk.   Then you wouldn't be here warning me about Chet.   Are you going with him?   Then come with me.   Come on, Chris. Just give me one chance. If you don't like me after tonight, I'll stay away forever.   I promise. Dead Poets Honor. You come with me tonight. And then, if you don't want to see me again, I swear I'll bow out.   He won't know anything. We'll sit in the back and sneak away as soon as it's over.   Dead Poets Honor.   My word.  Chris walks away from him and then turns to face him.   Yeah, Neil!  The curtain closes again and Neil turns around, letting out an excited sigh. Various actors continue to congratulate him. Neil lets out a yell as he walks offstage. In the audience, while others are leaving, Mr. Perry approaches a woman.   Don't touch him, Charlie. You do and you're out.   You don't know that, not yet.   O Captain! My Captain!",
        "Overstreet": "",
        "Steven": "",
        "Meeks": "Yes sir.   Oh, I'm sorry, my name is Steven Meeks.  Neil quickly gets up from his spot by the window.   Nice to meet you.   Oh well, welcome to Hell-ton.   He flatters me. That's why I help him with Latin.   Well, uh, Latin, eight o' clock in my room?   Todd, you're welcome to join us.   Carpe Diem. That's \"seize the day.\"   Meeks.   Okay, who's up for a trig study group tonight guys?   Holy cow.  Mr. Hager walks into the room.   Is there a picture in the annual?   His grades are hurting Charlie.   I'll try anything once.   Ha ha ha.   Aww, Charlie.   You're funny. You're real funny.   It's too wet.   No, no, the smoke's going right up this opening.  Pitts tries to stand up and slams his head into the low rock ceiling. He lets out a yell while the others laugh.   Yes sir, use Meeks' coat.   What, did you bring one?   An original piece by Charlie Dalton.   Oh, wow.   Then I had religion, then I had a vision. I could not turn from their revel in derision. Then I saw the Congo creeping through the black, cutting through the forest with a golden track. Then I saw the Congo creeping through the black-    ...cutting through the forest with a golden track. Then I saw the Congo creeping through the black, cutting through the forest with a golden track.  Knox picks up a metal container and begins using it as a drum. The other boys stand and begin going in a circle, making music with sticks of wood, combs, etc.  Then I saw the Congo creeping through the black, cutting through the forest with a golden track. Then I saw the Congo creeping through the black, cutting through the forest with a golden track.   We got it, Pittsie. We got it! Radio Free America!    \"To dance, clap hands, exalt, shout, skip, roll on, float on.\"   What did he say?   My dad collects a lot of pipes.   Yeah, Knox, we're from the government. We're here to help, man.   Smoke that. Put that in your pipe and smoke it.   Neil!  Neil enters the cave carrying a beat up light stand.   What is that, Neil?   The god of the cave.  Charlie begins making loud noises with his saxophone.   Oh, no.   Wow!   Vocabulary.  Knox jumps up.  Hello.   Me and Pitts are working on a hi-fi system. It shouldn't be that hard to, uh, to put together.    Yeah.   Look, uh, it's, it's over now.   Beautiful baby. Henley Hall, here I come.   You can't explain it, Todd.   You can't explain it, Todd.  Todd pushes himself away from the boys and stumbles down the hill, slipping and falling in the snow.   Todd!   Charlie!   Go away. I have to study.   Expelled.   Nothing they didn't already know.",
        "McAllister": "Slow down boys, slow down you horrible phalanx of pubescense.    Agricolam. Agricola. Agricolae. Agricolarum. Agricolis. Agricolas. Agrilcolis.  Again, please. Agricola.   What the hell is going on here?  The boys all turn around in shock. Charlie stuffs a crumpled page into his mouth. Keating emerges from his room with a waste paper basket.   Mr. Keating.   I'm sorry, I- I didn't know you were here.   Ahh, so you are. Excuse me.  Mr. McAllister slowly backs out of the classroom.   Quite an interesting class you gave today, Mr. Keating.   Oh, there's no need to apologize. It was very fascinating, misguided though it was.   You take a big risk by encouraging them to be artists John. When they realize they're not Rembrandts, Shakespeares or Mozarts, they'll hate you for it.   Free thinkers at seventeen?    Not a cynic, a realist. Show me the heart unfettered by foolish dreams, and I'll show you a happy man.   Tennyson?   For God's sake stop chattering and sit down.  The boys take their seats once again and Neil goes over and sits next to Todd, who is sitting by himself.   Oh shut up, will you.",
        "Dr.": "",
        "Hager": "All right fine.  Dr. Hager takes the bottles and quickly backs into his room, shutting the door.   Your study of trigonometry requires absolute precision. Anyone failing to turn in any homework assignment will be penalized one point off their final grade. Let me urge you now not to test me on this point.   Ready Overstreet?  Knox reluctantly follows after Dr. Hager.   All right gentlemen, five minutes. Let's go.  The students quickly pack up their gear and prepare to leave. Pitts tries to hide the radio in his lap. Charlie leans in close to Knox.   That wouldn't be a radio in your lap, would it Mr. Pitts?    You boys there, hurry up.  Neil turns around and faces the other boys.   I'm warning you, move.   Cut out that racket in there.  The kazoo player lets out a rude squeek before finally stopping. Hager glares at them for a moment.    Hager hears a dog barking.   Knox Overstreet.  Knox emerges from his room and goes to joing Hager. He gives a thumbs up to Todd as he passes his door. Once he leaves with Hager, Todd goes over to Meeks' door.   Todd Anderson.",
        "Charlie": "Rumor has it, you did summer school.   Keen.  The boys enter the room. Charlie turns around and looks at Meeks who is just entering.   Meeks. Door. Closed.   Okay, study group. Meeks aced Latin. I didn't quite flunk English. So, if you want, we've got our study group.   Hmm, what's his specialty, boot-licking?   That's not my fault.  Meeks seems to notice Todd for the first time.   Charlie Dalton.  Charlie continues to lay on the bed, looking smug. Knox extends a hand.   Oh yeah, sure. Valedictorian. National merit scholar.   It's every bit as tough as they say, unless you're a genius like Meeks.   And English, and Trig.  Charlie begins coughing. There is a knock at the door. Charlie quickly stamps out his cigarette on the floor and Neil tries to wave the smoke from the air.   Why doesn't he let you do what you want?   Okay, so I don't like it any more than you do.   Well I wouldn't lose much sleep over it. It's just a bunch of jerks trying to impress Nolan.   Because he's in a hurry.   Come on Cameron, don't you get anything?    What?   Ooh!   I'll second that.   How was dinner?   How was dinner?   Why? What happened?   That guy could eat a football.   Did you see her naked?   Thigh man. Mr. K was a hell-raiser.   Tonight?   Don't go.   So don't come, please.   No shit, Sherlock.   I'm in.   Pitsie, come on.   Except sex.   What about you Knox?   Come on Knox, it'll help you get Chris.   Women swoon.  Charlie laughs and runs inside. Knox chases after him.   Well, why don't you stay home?   Arrr, I'm a dead poet.    Guys, over here.   God, are you trying to smoke us out of here?   I'll second that.   All right, intermission. Dig deep right here. Right here, lay it down   Meeks, put your coat down. Picnic blanket.   Don't keep anything back either. You guys are always bumming my smokes.  Meeks lays his coat down and everyone dumps their food on it. Amongst the pile are chocolate chip cookies, a box of raisins, a few apples, an orange, and half a roll.   Wait a minute, who gave us half a roll?   Come on.   Ha!   The thing with the hand-  All the boys react, recalling the story and miming the scraping on the roof of the car.   I told you that one.   When were you in six, last year?  As everyone's voices begin to calm down, Pitts begins reading from the book.   You want to hear a real poem?  Meeks hands Charlie the book but he shoves it away.   All right? No, I don't need it. You take it.   I didn't memorize a poem. Move up.  Neil moves to the side as Charlie stands and takes his spot.    Teach me to love? Go teach thyself more wit. I, chief professor, am of it.  Neil gets up and looks over Charlie's shoulder to see what he is reading.   The god of love, if such a thing there be, may learn to love from me.  Charlie winks at the guys and they clap and cheer.   Abraham Cowley. Okay, who's next?  Neil sits reading from the book by flashlight.   Meeks, Meeks.   To feel taller.   Give it to me! Give it to me!   \"To indeed be a god!\"   Congratulations. Good for you, Neil. Good for you.  Neil enters his room with Todd and sits down at his typewriter.   Attaboy, Pittsie, inhale deeply.   Really? Mine's got thirty.   Come on, Knox. Join in.   What's wrong?   Knock it off. Smoke your pipes.   What do you say we start this meeting?   Gentlemen, \"Poetrusic\" by Charles Dalton.  Charlie begins playing erratic notes on the sexophone.   Laughing, crying, tumbling, mumbling. Gotta do more. Gotta be more.  Charlie plays more erratic sounds.   Chaos screaming, chaos dreaming. Gotta do more! Gotta be more!  Charlie starts to play a real tune on the saxophone.   My parents made me take the clarinet for years.   I hated it. The saxophone. The saxophone is more sonorous.   Knoxious, you've gotta calm down.   What are you gonna do?   Yes. Say, yes.   At Chet Danburry's house.   Well?   So, you don't really think she means you're going with her?   What is the point?   Yeah?   Exercising the right not to walk.   Yeah, this is it. Go ahead, go on in. It's my cave. Watch your step.   Hi, you guys. Meet, uh, Gloria and--   Tina. This is the pledge class of the Dead Poets Society.  Guys, move. Move. Come on, folks. It's Friday night. Let's get on with the meeting.  The boys move aside to let the girls in.   Guys, I have an announcement to make. In keeping with the spirit of passionate experimentation of the Dead Poets, I'm giving up the name Charlie Dalton. From now on, call me Nuwanda.   We gonna have a meeting or what?   \"Shall I compare thee to a summer's day? Thou art more lovely and more temperate.\"   I made that up just for you.   I'll write one for you too, Gloria. She walks in beauty like the night. She walks in beauty like the night. Of cloudless climes and starry skies. All that's best, dark and bright, Meet in her aspect and her eyes.   There's plenty more where that came from.   That's part of what this club is about. In fact, I'd like to announce I published an article in the school paper, in the name of the Dead Poets.   Demanding girls be admitted to Welton.    So we can all stop beating off.   I'm one of the proofers. I slipped the article in.   Why? Nobody knows who we are.   It's Nuwanda, Cameron.   Are we just playing around out here, or do we mean what we say? For all we do is come together and reach a bunch of poems to each other. What the hell are we doing?   Hey, would you not worry about your precious little neck? If they catch me, I'll tell them I made it up.    Welton Academy. Hello. Yes, he is. Just a moment.  Charlie stands up, holding a phone and bell in his hands.   Mr. Nolan, it's for you. It's God. He says we should have girls at Welton.  Most of the students laugh while the boys from the cave all shake their heads in disbelief.   One. Two. Three. Four. Five.   No.   I'm to turn everybody in, apologize to the school and all will be forgiven.   Damn it, Neil. The name is Nuwanda.  Charlie smiles and then shuts his door.   Creak. He started walking around towards my left. Creak. Creak. \"Assume the position, Mr. Dalton.\"  The door opens and Keating walks in. Many of the boys get up from their seats.   Mr. Keating.   You're siding with Mr. Nolan? What about Carpe diem and sucking all the marrow out of life and all that?   But I thought you'd like that.   Yeah. Like what?   Aye, aye, Captain.   All right. Go on.   Get out of here. Cameron, you fool.  Charlie notices Knox and grabs his jacket.   Hey, how'd it go? Did you read it to her?   Nothing. What do you mean, nothing?   What did she say? I know she had to say something.   It's an Indian warrior symbol for virility. Makes me feel potent, like it can drive girls crazy.  Charlie buttons up his shirt as everyone prepares to leave.   Yeah, come on, guys.  Charlie hustles the boys away. Meeks remains staring at her. Charlie returns to drag him away.   Hey, there he is! Hey, hey.  Cameron shoves him back into his seat.    He's good. He's really good.  Keating gives a thumbs up.   Neil, Neil, you were great.   Neil! Neil! Mr. Perry, come on.   Is it okay if we walk back? Captain?  Charlie motions Todd to follow.   Knox.  The boys leave and Keating continues to stare after the car, wiping the falling snow from his face.   Todd? Todd.  Todd, still half asleep, tries to shrug him off.   Neil's dead.   Todd. It's okay, Todd.   It's all right, Todd.   It's all right. It's alright.  Charlie grabs a handful of snow and wipes Todd's mouth with it.   No!   Todd.   Leave him be.  The boys watch as Todd runs down towards the dock by the river, yelling and crying. He finally seems to regain control of himself and walks in silence out onto the dock.   You told him about this meeting?   That's it, guys. We're all fried.   Cameron's a fink. He's in Nolan's office right now, finking.   The club, Pittsie. Think about it. The board of directors, the trustees and Mr. Nolan. Do you think for one moment they're gonna let this thing just blow over? Schools go down because of things like this. They need a scapegoat.  The door opens. All the boys except Charlie hurry to put their cigarettes out and wave the smoke away. A light comes on and Cameron enters.   You finked, didn't you, Cameron?  Charlie gets up and approaches Cameron, tossing his cigarette away.   You told Nolan everything about the club is what I'm talking about.   You little-  Charlie lunges at Cameron but Knox and Meeks hold him back.   He's a rat! He's in it up to his eyes, so he rattled to save himself.   I'm out anyway!   What's that mean? Who are they after?   Mr. Keating responsible for Neil? Is that what they're saying?",
        "Dalton": "",
        "Richard": "",
        "Cameron": "Neil, study group tonight?   Business as usual, huh? Hey, I hear you got the new kid. Looks like a stiff!  He begins laughing when he notices Todd coming into the room.   Oops!  Cameron quickly leaves. Neil tries to keep from laughing as Todd enters the room and sets his luggage down on his bed.   Brain damage.  The students quickly quiet down as Keating emerges from the other room, whistling the 1812 Overture. He walks up the length of the classroom and out the door without a word. The students look around at one another, uncertain of what to do. Keating pokes his head back in the doorway.   Think he'll test us on that stuff?   What? What?   Big alumns. How'd you swing that?   Just replace these numbers here with \"x\", for \"x\" and \"y\".   Of course, so what's the problem?  Charlie enters the room and closes the door behind him, leaning up against it heavily.   Ahh, forget her. Open your trig book and try and figure out problem five.   We shouldn't be doing this.    Man most likely to do anything.   What?  The school bells begin ringing and everyone heads back towards the school. Neil stands up.   Wait a minute.   Sounds boring to me.   You know how many de-merits we're talking Dalton   Look, all I'm saying is that we have to be careful, we can't get caught.   Come on Neil, Hager's right-   Me too.   I mean as long as we're careful.  The boys run into the building.   I don't know, it's starting to sound dangerous.   On the mud? We're gonna put our food on the mud?   I've got one that's even better than that.   I do. There's a young, married couple, and they're driving through the forest at night on a long trip. And they run out of gas, and there's a madman on the-   I love that story.   You did not. I got that in camp in sixth grade.   Where did you get that?   What are you guys doing? I'm sure-- You see this chemistry-  Cameron tries to hold up his book and Neil snatches it from his hands and suddenly all three of them are racing around the room.   Hey, give me-- Neil, give me-- Don't be immature. Come on. I need my-  Charlie enters the room and begins waving his hands.   Let me have my book, I need my-  The four boys continue racing around the cramped quarters, tossing Cameron's book back and forth. Neil picks up a recorder and begins blowing erratic notes on it while Charlie starts pounding on a set of bongo drums. Outside the room a crowd of boys watch.   I love the clarinet.   Ooh.   Oh, my God!   What?   Well, don't you think they're gonna figure out who wrote it? They're gonna come to you and ask to know what the Dead Poets Society is. Charlie, you had no right to do something like that.   Excuse me, just a moment. Yes. You're so cute.  Cameron runs a comb through his hair and Todd tries to mess it up.   Come on, Todd. I'm trying to fix this.   Getting red? What does that mean?   So, Charlie, what's this \"getting red\" bit?  Charlie opens his unbuttoned shirt to show a large red lightning bolt painted down his chest.   What's going on, guys?   Finked? I didn't know what the hell you're talking about.   Look, in case you hadn't heard, Dalton, there's something called an honor code at this school, all right? If a teacher asks you a question, you tell the truth or you're expelled.   He's right there, Charlie. And if you guys are smart, you will do exactly what I did and cooperate. They're not after us. We're the victims. Us and Neil.   Why, Mr. Keating, of course. The \"Captain\" himself. I mean, you guys didn't really think he could avoid responsibility, did you?   Well, who else do you think, dumb ass? The administration? Mr. Perry? Mr. Keating put us up to all this crap, didn't he? If he wasn't for Mr. Keating, Neil would be cozied up in his room right now, studying his chemistry and dreaming of being called doctor.   Believe what you want, but I say let Keating fry. I mean, why ruin our lives?  Charlie lunges at Cameron again and punches him in the face. Cameron falls to the floor as the boys pull Charlie away. Cameron lifts a hand to his bloody nose.   You just signed your expulsion papers, Nuwanda.  Cameron rises to his feet.   And if the rest of you are smart, you'll do exactly what I did. They know everything anyway. You can't save Keating, but you can save yourselves.  Cameron walks away, closing the door behind him.   We skipped around a lot, sir. We covered the Romantics and some of the chapters on Post Civil War literature.   I believe we skipped most of that, sir.   That page has been ripped out, sir.   They're all ripped out, sir.   Sir, we, uh-   \"Understanding Poetry by Dr. J Evans Pritchard, Ph.D. To fully understand poetry, we must first be fluent with its meter, rhyme and figures of speech, then ask two questions: 1) How artfully has the objective of the poem been rendered and 2)...\"  The door squeaks as Keating shuts it behind him. Cameron pauses.   \"... How important is that objective? Question 1 rates the poem's perfection; question 2 rates its importance. And once these questions have been answered, determining the poem's greatness becomes a relatively simple matter. If the poem's score for perfection is plotted on the horizontal of a graph--\"  Keating passes by Todd and the others and gets to the back of the classroom before Todd leaps up from his seat and turns to face him.",
        "John": "",
        "Keating": "Students enter Keating's classroom, talking and acting up. Keating glances out from his room off to one side.   Well come on.  He gestures them to follow and the students, after some hesitation, grab their books and follow Keating out into the main entranceway.   \"Oh Captain, My Captain\" who knows where that comes from?  Todd looks up as if he knows the answer, but says nothing. Spaz blows his nose a little too close to Meeks for his liking.   Not a clue? It's from a poem by Walt Whitman about Mr. Abraham Lincoln. Now in this class you can call me Mr. Keating. Or, if you're slightly more daring, Oh Captain, My Captain.  The students laugh slightly.   Now let me dispel a few rumors so they don't fester into facts. Yes, I too attended Hell-ton and survived. And no, at that time I was not the mental giant you see before you. I was the intellectual equivalent of a ninety-eight pound weakling. I would go to the beach and people would kick copies of Byron in my face.  The boys laugh once again, while Cameron, obviously trying to write all this down, looks around confusedly. Keating looks down at papers in his hand.   Now, Mr Pitts. That's a rather unfortunate name. Mr. Pitts, where are you?  Pitts raises his hand while everyone around him snickers.   Mr. Pitts, would you open your hymnal to page 542 and read the first stanza of the poem you find there?   Yes, that's the one. Somewhat appropriate, isn't it.   Thank you Mr. Pitts. \"Gather ye rosebuds while ye may.\" The Latin term for that sentiment is Carpe Diem. Now who knows what that means?  Meeks immediately puts his hand up.   Very good, Mr.-   Meeks. Another unusual name. Seize the day. Gather ye rosebuds while ye may. Why does the writer use these lines?   No, ding!  Keating slams his hand down on an imaginary buzzer.   Thank you for playing anyway. Because we are food for worms lads. Because, believe it or not, each and every one of us in this room is one day going to stop breathing, turn cold, and die.  Keating turns towards the trophy cases, filled with trophies, footballs, and team pictures.   Now I would like you to step forward over here and peruse some of the faces from the past. You've walked past them many times. I don't think you've really looked at them.  The students slowly gather round the cases and Keating moves behind them.   They're not that different from you, are they? Same haircuts. Full of hormones, just like you. Invincible, just like you feel. The world is their oyster. They believe they're destined for great things, just like many of you. Their eyes are full of hope, just like you. Did they wait until it was too late to make from their lives even one iota of what they were capable? Because you see gentlmen, these boys are now fertilizing daffodils. But if you listen real close, you can hear them whisper their legacy to you. Go on, lean in.  The boys lean in and Keating hovers over Cameron's shoulder.    Carpe.  Cameron looks over his shoulder with an aggravated expression on his face.   Hear it?  Carpe. Carpe Diem. Seize the day boys, make your lives extraordinary.  The boys stare at the faces in the cabinet in silence.    Keating sits at his desk at the front of the classroom and opens up one of his books.   Gentlemen, open your text to page twenty-one of the introduction. Mr. Perry, will you read the opening paragraph of the preface, entitled \"Understanding Poetry\"?   Excrement. That's what I think of Mr. J. Evans Pritchard. We're not laying pipe, we're talking about poetry.  Cameron looks down at the graph he copied into his notes and quickly scribbles it out.   I mean, how can you describe poetry like American Bandstand? I like Byron, I give him a 42, but I can't dance to it.  Charlie suddenly appear to become interested in the class.   Now I want you to rip out that page.  The students look at Keating as if he has just gone mad.   Go on, rip out the entire page. You heard me, rip it out. Rip it out!  Charlie looks around at the others. He then looks down at his own notes, which consists of drawing breasts.   Go on, rip it out.  Charlie rips the page out and holds it up.   Thank you Mr. Dalton. Gentlemen, tell you what, don't just tear out that page, tear out the entire introduction. I want it gone, history. Leave nothing of it. Rip it out. Rip! Begone J. Evans Pritchard, Ph.D. Rip, shred, tear. Rip it out. I want to hear nothing but ripping of Mr. Pritchard.  Meeks looks around reluctantly and then finally begins tearing out pages.   We'll perforate it, put it on a roll.  Keating sees Cameron still hesitating.   It's not the bible, you're not going to go to hell for this. Go on, make a clean tear, I want nothing left of it.  Keating goes over to his room. Cameron turns around to Neil.   Rip it out, rip!  From outside the classroom, Mr. McAllister hears all the noise and sees all the students ripping out the pages. He bursts into the room.   I don't hear enough rips.   Mr. McAllister.   I am.   Keep ripping gentlemen. This is a battle, a war. And the casualties could be your hearts and souls.  Keating holds out the basket to Charlie who spits out a wad of paper.   Thank you Mr. Dalton. Armies of academics going forward, measuring poetry. No, we will not have that here. No more of Mr. J. Evans Pritchard. Now in my class you will learn to think for yourselves again. You will learn to savor words and language. No matter what anybody tells you, words and ideas can change the world. I see that look in Mr. Pitt's eye, like nineteenth century literature has nothing to do with going to business school or medical school. Right? Maybe. Mr. Hopkins, you may agree with him, thinking \"Yes, we should simply study our Mr. Pritchard and learn our rhyme and meter and go quietly about the business of achieving other ambitions.\" I have a little secret for ya. Huddle up. Huddle up!  The boys get up from their seats and gather around Keating in the center of the class.   We don't read and write poetry because it's cute. We read and write poetry because we are members of the human race. And the human race is filled with passion. Medicine, law, business, engineering, these are all noble pursuits, and necessary to sustain life. But poetry, beauty, romance, love, these are what we stay alive for. To quote from Whitman: \"O me, o life of the questions of these recurring, of the endless trains of the faithless, of cities filled with the foolish. What good amid these, o me, o life? Answer: that you are here. That life exists, and identity. That the powerful play goes on, and you may contribute a verse. That the powerful play goes on and you may contribute a verse.  Keating looks up at Todd.  Keating What will your verse be?   I'm sorry if I shocked you, Mr. McAllister.   You think so?   We're not talking artists George, we're talking free thinkers.   Funny, I never pegged you as a cynic.   But only in their dreams can man be truly free. 'Twas always thus, and always thus will be.   No, Keating.  Keating winks and Mr. McAllister can't help but laugh.   Gentlemen.   Oh my God. No, that's not me. Stanley \"The Tool\" Wilson-  Keating crouches down and continues looking through the book.   God.  Neil crouches down next to Keating.   I doubt the present administration would look too favorably upon that.   Gentlemen, can you keep a secret?   The Dead Poets were dedicated to sucking the marrow out of life. That's a phrase from Thoreau that we'd invoke at the beginning of each meeting. You see we'd gather at the old Indian cave and take turns reading from Thoreau, Whitman, Shelley; the biggies. Even some of our own verse. And in the enchantment of the moment we'd let poetry work its magic.   No Mr. Overstreet, it wasn't just \"guys\", we weren't a Greek organization, we were romantics. We didn't just read poetry, we let it drip from our tongues like honey. Spirits soared, women swooned, and gods were created, gentlemen, not a bad way to spend an evening eh? Thank you Mr. Perry for this trip down amnesia lane. Burn that, especially my picture.  Keating hands the annual back and walks away, whistling once again. Neil remains crouched.    Keating is walking to the front of the classroom filled with students.   A man is not very tire, he is exhausted. And don't use very sad, use-  He points to the back of the classroom.   Come on, Mr. Overstreet, you twerp,  Exactly! Morose. Now, language was developed for one endeavor, and that is? Mr. Anderson? Come on! Are you a man or an amoeba?  Keating stands before Todd's desk. Todd looks up nervously but says nothing. Keating paused for a moment before looking away.   Mr. Perry?   No! To woo women. Today we're going to be talking about William Shakespeare.  The class lets out a collective sigh.  I know. A lot of you looked forward to this about as much as you look forward to root canal work. We're gonna talk about Shakespeare as someone who writes something very interesting. Now, many of you have seen Shakespeare done very much like this:  Keating holds out his right arm dramtically and begins to speak in an exaggerated British accent.  \"O Titus, bring your friend hither.\" But if any of you have seen Mr. Marlon Brando, you know, Shakespeare can be different. \"Friend, Romans, countrymen, lend me your ears.\" You can also imagine, maybe, John Wayne as Macbeth going, \"Well, is this a dagger I see before me?\"    The students are all seated together near the front of the room as Keating reads from a book.   \"Dogs, sir? Oh, not just now. I do enjoy a good dog once in a while, sir. You can have yourself a three-course meal from one dog. Start with your canine crudites, go to your Fido flambe for main course and for dessert, a Pekingese parfait. And you can pick your teeth with a little paw.\"    The students are all back in their normal seats and Keating leaps up onto his desk.   Why do I stand up here? Anybody?   No! Keating rings the bell on his desk with his foot   Thank you for playing, Mr. Dalton. I stand upon my desk to remind yourself that we must constantly look at things in a different way.  Keating glances around the classroom from atop the desk.   You see, the world looks very different from up here. You don't believe me? Come see for yourself. Come on. Come on!  Charlie and Neil quickly rise from their seats to go to the front of the classroom. The rest of the class follows them. While Keating continues speaking, Neil and Charlie join him on the desk and then Keating jumps down.    Just when you think you know something, you have to look at it in another way. Even though it may seem silly or wrong, you must try! Now, when you read, don't just consider what the author thinks. Consider what you think.   Boys, you must strive to find your own voice. Because the longer you wait to begin, the less likely you are to find it at all. Thoreau said, \"Most men lead lives of quiet desperation.\" Don't be resigned to that. Break out!  Keating notices Spaz and another boy leaving the desk immediately.   Don't just walk off the edge like lemmings. Look around you.  The school bell rings as the boys continue to climb onto the desk. Keating begins to gather up his stuff. The clock begins to toll as Keating walks to the back of the class.   There! There you go, Mr. Priske. Thank you! Yes! Dare to strike out and find new ground. Now, in addition to your essays, I would like you to compose a poem of your own, an original work.  The students begin to groan. Keating begins flickering the lights off and on while chanting ominously.   That's right! You have to deliver it aloud in front of the class on Monday. Bonne chance, gentlemen.  Keating steps out into the hall before quickly peeking back in once again. Todd is the last one to stand on the desk and is about to jump off.   Mr. Anderson? Don't think that I don't know that this assignment scares the hell out of you, you mole.  Keating flicks the light off, leaving Todd to jump down in the darkness as the students laugh.   Now, devotees may argue that one sport or game is inherently better than another. For me, sport is actually a chance for us to have other human beings push us to excel. I want you all to come over here and take a slip of paper and line up single file.  Keating reaches the stands. He tosses the balls aside and pulls sets his briefcase down. As the boys line up he begins ripping off slips of paper from a notepad and handing them out.   Mr. Meeks, time to inherit the earth. Mr. Pitts, rise above your name.  He hands the notepad to another student.   I want you to hand these out to the boys, one apiece.   You know what to do, Pitts.   Sounds to me like you're daunted. Say it again like you're undaunted.   Now go on.  Pitts gives one of the soccer balls a good kick.   Yes! Next.  One of the students sets up the next ball as the line advances.   Next. Louder!   Come on, Meeks! Listen to the music.   Yes!   Oh! Boo! Come on, Charlie, let it fill your soul!  Charlie raises his hands over his head.    Knox stands at the front of the room with his poem in hand.   No, no. It's not stupid. It's a good effort. It touched on one of the major themes, love. A major theme not only in poetry, but life. Mr. Hopkins, you were laughing. You're up.  Hopkins slowly walks to the front of the class and unfolds his piece of paper.   Congratulations, Mr. Hopkins. Yours is the first poem to ever have a negative score on the Pritchard scale. We're not laughing at you, we're laughing near you. I don't mind that your poem had a simple theme. Sometimes the most beautiful poetry can be about simple things, like a cat, or a flower or rain. You see, poetry can come from anything with the stuff of revelation in it. Just don't let your poems be ordinary. Now, who's next?  Keating approaches Todd's desk.   Mr. Anderson, I see you sitting there in agony. Come on, Todd, step up. Let's put you out of your misery.   Mr. Anderson thinks that everything inside of him is worthless and embarrassing. Isn't that right, Todd? Isn't that your worst fear? Well, I think you're wrong. I think you have something inside of you that is worth a great deal.  Keating walks up to the blackboard and begins to write.   \"I sound my barbaric yawp over the rooftops of the world.\" W. W. Uncle Walt again. Now, for those of you who don't know, a yawp is a loud cry or yell. Now, Todd, I would like you to give us a demonstration of a barbaric \"yawp.\" Come on. You can't yawp sitting down. Let's go. Come on. Up.  Todd reluctantly stands and follows Keating to the front.   You gotta get in \"yawping\" stance.   No, not just a yawp. A barbaric yawp.   Come on, louder.   No, that's a mouse. Come on. Louder.   Oh, good God, boy. Yell like a man!   There it is. You see, you have a barbarian in you, after all.  Todd goes to return to his seat but Keating stops him.   Now, you don't get away that easy.  Keating turns Todd around and points out a picture on the wall.   The picture of Uncle Walt up there. What does he remind you of? Don't think. Answer. Go on.  Keating begins to circle around Todd.   What kind of madman? Don't think about it. Just answer again.   No, you can do better than that. Free up your mind. Use your imagination. Say the first thing that pops into your head, even if it's total gibberish. Go on, go on.   Good God, boy, there's a poet in you, after all. There, close your eyes. Close your eyes. Close 'em. Now, describe what you see.  Keating puts his hands over Todd's eyes and they begin to slowly spin around.   Yes?   A sweaty-toothed madman?   Oh, that's excellent. Now, give him action. Make him do something.   That's it. Wonderful. Wonderful.  Keating removes his hands from Todd but Todd keeps his eyes closed.   What's he mumbling?   Forget them, forget them. Stay with the blanket. Tell me about that blanket.    Don't you forget this.   No grades at stake, gentlemen. Just take a stroll.  After a few moments, the three boys begin to march to the same beat.   There it is.  The other boys start clapping to the rhythm of their steps.   I don't know, but I've been told--   Doing poetry is old--   Left, left, left-right-left. Left, left, left-right-left. Left, halt!  The boys come to a halt.   Thank you, gentlemen. If you noticed, everyone started off with their own stride, their own pace.  Keating begins walking very slowly.   Mr. Pitts, taking his time. He knew he'll get there one day. Mr. Cameron, you could see him thinking, \"Is this right? It might be right. It might be right. I know that. Maybe not. I don't know.\"  Keating begins walking with his groin pushed forward.   Mr. Overstreet, driven by deeper force. Yes. We know that. All right. Now, I didn't bring them up here to ridicule them. I brought them up here to illustrate the point of conformity: the difficulty in maintaining your own beliefs in the face of others. Now, those of you -- I see the look in your eyes like, \"I would've walked differently.\" Well, ask yourselves why you were clapping. Now, we all have a great need for acceptance. But you must trust that your beliefs are unique, your own, even though others may think them odd or unpopular, even though the herd may go, \"That's baaaaad.\" Robert Frost said, \"Two roads diverged in a wood and I, I took the one less traveled by, and that has made all the difference.\" Now, I want you to find your own walk right now. Your own way of striding, pacing. Any direction. Anything you want. Whether it's proud, whether it's silly, anything. Gentlemen, the courtyard is yours.  The students begin walking about, some walking casually, others making up silly walks. Keating notices that Charlie is still leaning up against one of the pillars.   You don't have to perform. Just make it for yourself. Mr. Dalton? You be joining us?   Thank you, Mr. Dalton. You just illustrated the point. Swim against the stream.  Nolan moves away from the window where he had been watching them.    Keating and McAllister are enjoying tea in the small room off the classroom. Mr. Nolan knocks on the door and enters.   Certainly.  Keating fixes his tie and follows Mr. Nolan into the classroom.   Didn't know you taught, Mr. Nolan.   Well, your reprimand made quite an impression, I'm sure.   Courtyard?   Oh, that. That was an exercise to prove a point. Dangers of conformity.   I always thought the idea of educating was to learn to think for yourself.   It's all right, gentlemen.   Mr. Dalton. That was a pretty lame stunt you pulled today.   Sucking the marrow out of life doesn't mean choking on the bone. Sure there's a time for daring and there's a time for caution, and a wise man understands which is called for.   No. You being expelled from school is not daring to me. It's stupid, 'cause you'll miss some golden opportunities.   Like, if nothing else, the opportunity to attend my classes. Got it, Ace?   Keep your head about you. That goes for the lot of you.   Phone call from God. If it had been collect, it wouldn't been daring.  Keating leaves and the boys gather around Charlie once again.    Keating is seated at his desk. He is writing a letter and occasionally looks up at the framed photo on his desk of a woman playing the cello. There is a knock at the door.   It's open.  Neil enters and closes the door behind him. He appears to be nervous.   Neil, what's up?   Certainly. Sit down.  Neil goes to take a seat but notices the chair is piled up with books. Neil picks them up and Keating gets up from his seat to help him.   Excuse me. Get you some tea?   Like some milk or sugar in that?   No, it's part of the monastic oath. They don't want worldly things distracting me from my teaching.  Keating gives Neil a cup of tea and they return to their seats. Neil looks at the photo on the desk.   She's also in London. Makes it a little difficult.   Stand what?   'Cause I love teaching. I don't wanna be anywhere else.   What's up?   Have you ever told your father what you just told me? About your passion for acting. You ever show him that?   Why not?   Then you're acting for him, too. You're playing the part of the dutiful son. I know this sounds impossible, but you have to talk to him. You have to show him who you are, what your heart is.   You are not an indentured servant. If it's not a whim for you, you prove it to him by your conviction and your passion. You show him that And if he still doesn't believe you, well, by then you'll be out of school and you can do anything you want.  A tear falls down Neil's cheek and he wipes it away.   Well, you have to talk to him before tomorrow night.   No.   No, you're not.    Keating walks from the front of the classroom to Neil's desk. Neil is the only student remaining in the class.   Did you talk to your father?   Really? You told him what you told me?   Gentlemen, let's go.   Will you be joining us, Mr. Overstreet?   Shh, boys.  On stage, Neil hides behind a tree as a girl emerges, similarly clad, but with flowers in her hair. Neil sneaks over to the girl.   Neil. Neil. You have the gift. What a performance You left even me speechless. You have to stay with-  Mr. Perry returns from his car and shoves Neil aside.   Don't make it any worse than it is.  Neil and Mr. Perry get into their car and drive away. Keating stares after them.    Keating sits by himself at his desk. After a moment he gets up and walks over to Neil's desk. Opening it, he finds his copy of \"Five Centuries of Verse\" and flips through the first few pages. Sitting down at the desk, he returns to the opening page, reading the opening verse written there. Keating begins to sob, then closes the book.    Keating laughs slightly as he watches McAllister from the window. Inside, all his belongings have been packed up.    The students are all seated at their desks in silence. Everyone looks as the door opens. They quickly stand as Mr. Nolan enters the room.   Excuse me. I came for my personals. Should I come back after class?   I do believe you, Todd.   Thank you, boys. Thank you.     </body></html>",
        "Neil": "Hello Mr. Nolan.   Thank you, sir.   I'll do my best sir.   Hey, I hear we're gonna be roommates.  He shakes Todd's hand.   I'm Neil Perry.   Why'd you leave Balincrest?   Oh, so you're that Anderson.   Hey Knox.  Cameron comes by and leans against the doorway.   Yeah, sure.   Listen, don't mind Cameron. He was born with his foot in his mouth. You know what I mean?  He pulls some papers from his blazer pocket and playfully whacks Todd across the back with it.  CHARLIE comes to the door with a smug expression on his face. Knox and MEEKS are close behind him. He points at Neil   Yep. Chemistry. My father thought I should get ahead. How was your summer Slick?   Gentlemen, what are the four pillars?   Sure. Cameron asked me too. Anyone mind including him?   Come on, he's your roommate.   Oh, this is Todd Anderson.  Todd turns around and shakes hands with Meeks.   Todd's brother was Jeffrey Anderson.   It's open.  The door opens and Mr. Perry walks into the room. Neil quickly rises from the window.   Father, I thought you'd gone.  The other boys stand up when he enters.   But I'm the assistant editor this year.   But Father, I can't. It wouldn't be fair.   Father, I wasn't disputing-   Yes sir. I'm sorry.   Yes sir. You know me, always taking on too much.   Yes sir.  Mr. Perry slaps his son on the shoulder and leaves. Neil leans his head back against the wall as the other boys emerge from the room.   Oh, that's rich. Like you guys tell your parents off, Mr. Future Lawyer and Mr. Future Banker.   Well just don't tell me how to talk to my father. You guys are the same way.   What I have to do. Drop the annual.   I don't care. I don't give a damn about any of it.   Yes.   But different.   Me.   Anything's better than Hell-ton hash.   Hey, you coming to the study group tonight?   Suit yourself.   Of course.   Are you crazy? What's wrong with that?   Understanding Poetry, by Dr. J. Evans Pritchard, Ph.D. To fully understand poetry, we must first be fluent with its meter, rhyme, and figures of speech. Then ask two questions: One, how artfully has the objective of the poem been rendered, and two, how important is that objective. Question one rates the poem's perfection, question two rates its importance. And once these questions have been answered, determining a poem's greatest becomes a relatively simple matter.  Keating gets up from his desk and prepares to draw on the chalk board.   If the poem's score for perfection is plotted along the horizontal of a graph, and its importance is plotted on the vertical, then calculating the total area of the poem yields the measure of its greatness.  Keating draws a corresponding graph on the board and the students dutifully copy it down.   A sonnet by Byron may score high on the vertical, but only average on the horizontal. A Shakespearean sonnet, on the other hand, would score high both horizontally and vertically, yielding a massive total area, thereby revealing the poem to be truly great. As you proceed through the poetry in this book, practice this rating method. As your ability to evaluate poems in this matter grows, so will - so will your enjoyment and understanding of poetry.  Neil sets the book down and takes off his glasses. The student sitting across from him is discretely trying to eat. Keating turns away from the chalkboard with a smile.   Rip, rip, rip!  Neil makes Cameron turn back around.   Hey, I found his senior annual in the library.  He hands the annual over to Cameron who laughs at the younger picture of Keating.   Listen to this, captain of the soccer team, editor of the school annual, Cambridge bound, Thigh man, and the Dead Poets Society.   I don't know.   Nothing. No other mention of it.   Mr. Keating? Mr. Keating? Sir? Oh Captain, My Captain?  Keating immediately turns around.   We were just looking in your old annual.  He hands Keating the annual and Keating looks at his old photograph.   What was the Dead Poets Society?   Why? What was it?   Sure.  The other boys crouch down around Keating.   Dead Poets Society.   I say we go tonight.   It's beyond the stream. I know where it is.   All right, who's in?   Forget Hager, no. Who's in?   What? Pitts-   You can help him Meeks.   Forget it Pitts, you're coming. Meeks, are your grades hurting too?    Okay, follow the stream to the waterfall. It's right there. It's got to be on the banks.   Todd, are you coming tonight?   Why not? God, you were there. You heard Keating. Don't you want to do something about it?   But? But what?   Gosh, you really have a problem with that, don't you?   All right. What if you didn't have to read? What if you just came and listened?   Forget how it works. What if - what if they said it was okay?   I'll be right back.   You're in.    Neil stands in his doorway. He looks across the hall to the other room where Cameron and Charlie are standing. Cameron gives a thumbs up. Neil closes his room door and takes out his cloak and a flashlight. Setting the flashlight down on the desk, he notices a worn book, \"Five Centuries of Verse\", sitting there. Opening it up, he sees John Keating's name at the top followed by \"Dead Poets\". Below the title of the book, is written: \"To Be Read At The Opening of D.P.S. Meetings.\" Along with several lines from Thoreau, beginning with \"I went to the woods because I wanted to live deliberately\"   You okay?   All right, all right, forget the fire. Let's go gentlemen.  Neil stands before the others with the book in hand, and takes a drag on a cigarette.   I hereby reconvene the Dead Poets Society.  The boys cheer.   Welton chapter. The meetings will be conducted by myself and the other new initiates now present. Todd Anderson, because he prefers not to read, will keep minutes of the meetings. I'll now read the traditional opening message by society member Henry David Thoreau. \"I went to the woods because I wanted to live deliberately. I wanted to live deep and suck out all the marrow of life.\"   \"To put to rout all that was not life, and not, when I had come to die, discover that I had not lived.  Several boys whistle softly in reaction to the poem.   And Keating's marked a bunch of other pages.  Neil begins flipping through the book.   Raisins?   It was a dark and rainy night, and this old lady, who had a passion for jigsaw puzzles, sat by herself in her house at her table to complete a new jigsaw puzzle. But as she pieced the puzzle together, she realized, to her astonishment, that the image that was formed was her very own room. And the figure in the center of the puzzle, as she completed it, was herself. And with trembling hands, she placed the last four pieces and stared in horror at the face of a demented madman at the window. The last thing that this old lady ever heard was the sound of breaking glass.   This is true, this is true.   You memorized a poem?   You know this is history. Right? This is history.  Charlie clears his throat and pulls out a page from a magazine and slowly unfolds it, revealing a Playboy centerfold (Elaine Reynolds, Miss October, 1959   Wow! Did you write that?  Charlie turns over the centerfold to show where he had written down the poem.   Alfred Lord Tennyson. Come my friends, 'Tis not too late to seek a newer world for my purpose holds to sail beyond the sunset. And though we are not now that strength which in old days Moved earth and heaven; that which we are, we are;-- One equal temper of heroic hearts, Made weak by time and fate, but strong in will. To strive, to seek, to find, and not to yield.  Meeks takes center stage and begins reading a poem like he is performing a chant.   Uh, to communicate.   I found it.   What I wanna do right now. What's really, really inside me.   This is it.   It's a play, dummy.   Right. They're putting it on at Henley Hall. Open tryouts. Open tryouts!   So, I'm gonna act. Yes, yes! I'm gonna be an actor! Ever since I can remember, I've wanted to try this. I even tried to go to summer stock auditions last year, but, of course, my father wouldn't let me. For the first time in my whole life I know what I wanna do.  Neil grabs a handful of papers off Todd's bed and tosses them into the air.   and for the first time I'm gonna do it whether my father wants me to or not! Carpe diem!   First I gotta get the part, then I can worry about that.   No, no, no, no. As far as I'm concerned, he won't have to know about any of this.   Bullshit! Nothing's impossible.   That's a laugh!  Neil tosses the blanket back onto his bed.   If I don't ask him, at least I won't be disobeying him.    Jesus, Todd! Whose side are you on?  Todd says nothing. Neil looks at him for a moment and then takes the flyer back from Todd. He walks over to the window, his excitement gone.   I mean, I haven't even gotten the part yet. Can't I even enjoy the idea for a little while?  Once again, Todd says nothing. After a moment, Neil sits on the heater and Todd returns to his poem.   You're coming to the meeting this afternoon?   Nothing Mr. Keating has to say means shit to you, does it, Todd?   You're in the club! Being in the club means being stirred up by things. You look about as stirred up as a cesspool.  Neil gets up from the window and stands over Todd.   No! I want you in, but being in means you gotta do something. Not just say you're in.   Don't you think you could be?   No.   No.  Neil grabs Todd's notebook of poetry and runs across the room with it. Todd leaps up after him.   \"We are dreaming of a--\" Poetry! I'm being chased by Walt Whitman! Okay, okay.  Neil drops the notebook. Cameron walks into the room.   Charlie!  Neil tosses Cameron's book to Charlie.   Charlie, I got the part! I'm gonna play Puck! I'm gonna play Puck!  He pounds on Charlie's door.   That's the main part.   Charlie, I got it!   Okay, okay, okay, okay.   They need a letter of permission from my father and Mr. Nolan.   Oh yes, I am.   Okay. \"I am writing to you on behalf of my son Neil Perry.\"  Neil begins laughing and stomping his feet up and down.   This is great.   Friend, scholar, Welton men.   No. This is the god of the cave.   Where are you going?   Todd? Hey.   What's going on?   Is today your birthday? Happy birthday.   What's you get?   Isn't this the same desk set-   Oh.    Maybe they thought you needed another one.   Todd, I think you're underestimating the value of this desk set.  Neil picks up the desk set and begins examining it more closely.   I mean, who would want a football or a baseball, or-   Or a car if they could have a desk set as wonderful as this one? I mean, if, if I were ever going to buy a, a desk set twice, I would probably buy this one both times. In fact, its, its shape is, it's rather aerodynamic, isn't it? I can feel it. This desk set wants to fly.  Neil tosses the desk set lightly in the air. Todd stands up and Neil hands him the desk set.   Todd? The world's first unmanned flying desk set.  Todd flings the desk set over the side of the walkway and it falls to pieces down below.   Well, I wouldn't worry. You'll get another one next year.   Hello.   Nuwanda?  Tina takes out a tube of red lipstick. Charlie takes it from her and puts red marks on each of his cheeks.   Join?  Charlie leans over to Tina.   How did you do that?   All right, but you still shouldn't have done it, Charlie. This could mean trouble. You don't speak for the club.   You kicked out?   So what happened?   So, what are you gonna do? Charlie!   Save some for me. \"But, room, Fairy! Here comes Oberon.\"  Neil opens the door to his room and sees his father sitting at his desk.   Father.   Wait a minute. Before you say anything, please let me ex-  Mr. Perry rises from the desk.   No. Nobody-- I thought I'd surprise you. I've gotten all A's in every class.   No, I can't. I have the main part. The performance is tomorrow night.   Yes, sir.  Mr. Perry goes to leave and then turns around.   No, sir.   Can I speak to you a minute?   I'm sorry. Here.   Tea. Sure.  Keating goes to a table in the corner and begins pouring several cups.   No, thanks.   Gosh, they don't give you much room around here.   She's pretty.   How can you stand it?   You can go anywhere. You can do anything. How can you stand being here?   I just talked to my father. He's making me quit the play at Henley Hall. Acting's everything to me. I-- But he doesn't know. He-- I can see his point. We're not a rich family like Charlie's, and we-- But he's planning the rest of my life for me, and I-- H-He's never asked me what I want.   I can't.   I can't talk to him this way.   I know what he'll say. He'll tell me that acting's a whim, and I should forget it. That how they're counting on me. He'll just tell me to put it out of my mind, \"for my own good.\"   No. What about the play? The show's tomorrow night.   Isn't there an easier way?   I'm trapped.   Uh, he didn't like it one bit, but at least he's letting me stay in the play. He won't be able to make, make it. He's in Chicago. But, uh, I think he's gonna let me stay with acting.   Yeah. He wasn't happy. But he'll be gone at least four days. I don't think he'll make the show, but I think he'll let me stay with it. \"Keep up the school work.\" Thanks.  Neil picks up his books and leaves.   I can't, guys.   But that's ten more years. Father, that's a lifetime!   I've got to tell you what I feel.  Mrs. Perry stands up.   Nothing.  Neil sits back down dejectedly.   I was good. I was really good.  Mrs. Perry nods slightly.   Neil's pyjamas, bathrobe, towel, and shaving kit are all neatly laid out on his bed. Neil touches his pyjamas lightly and then removes his coat and shirt. He walks over to the windows and opens them, taking several deep breaths. He places the crown of twigs on his head and then closes his eyes, slowly letting his head fall to his chest.",
        "Perry": "Gale   Good to see you again.   Well he won't disappoint us. Right Neil?   Keep your seats fellows, keep your seats. Neil, I've just spoken to Mr. Nolan. I think that you're taking too many extra curricular activities this semester, and I've decided that you should drop the school annual.   Well I'm sorry Neil.   Fellas, would you excuse us for a moment?  Mr. Perry walks towards the door and Neil hesitantly follows. Mr. Perry pauses by the door and smiles to the other boys.   Don't you ever dispute me in public. Do you understand?   After you've finished medical school and you're on your own, then you can do as you damn well please. But until then, you do as I tell you. Is that clear?   You know how much this means to your mother, don't you?   Well, that's my boy. Now listen, you need anything, you let us know, huh?   Neil.   Don't you dare talk back to me! It's bad enough that you've wasted your time with this, this absurd acting business. But you deliberately deceived me! How, how, how did you expect to get away with this? Answer me. Who put you up to it? Was it this new man? This, uh, Mr. Keating?   Did you think I wasn't going to find out? \"Oh, my niece is in a play with your son,\" says Mrs. Marks. \"No, no, no,\" I say, \"you must be mistaken. My son's not in a play.\" You made me a liar of me, Neil! Now, tomorrow you go to them and you tell them that you're quitting.   I don't care if the world comes to an end tomorrow night. You are through with that play. Is that clear? Is that clear?   I made a great many sacrifices to get you here, Neil, and you will not let me down.   Excuse me, I'm Neil's father. I need to see him.  Backstage, the woman approaches Neil.   Excuse me. Excuse me. Excuse me.  The boys notice Neil and try to dtop him to talk.   Get in the car. Keating, you stay away from my son.    A photo of Neil standing stiffly with his parents sits on a table between a glass of alcohol and a half filled ashtray. Mrs. Perry watches through the window as her husband and son arrive and then takes a nervous puff on her cigarette before sitting down. Mr. Perry walks in with Neil close behind him. Neil sits down beside the desk while Mr. Perry remains standing.   We're trying very hard to understand why it is that you insist on defying us. Whatever the reason, we're not gonna let you ruin your life. Tomorrow I'm withdrawing you from Welton and enrolling you in Braden Military School. You're going to Harvard and you're gonna be a doctor.   Oh, stop it. Don't be so dramatic. You make it sound like a prison term. You don't understand, Neil. You have opportunities that I never even dreamt of and I am not going to let you waste them.  Neil rises to his feet.   We've been so worried about--   What? What? Tell me what you feel. What is it?  Neil looks to his mother and then back to his father but says nothing.   Is it more of this, this acting business? Because you can forget that. What?   Nothing? Well, then, let's go to bed.  Mr. Perry leaves. Mrs. Perry pauses on her way out and kneels behind Neil.   Go on, get some sleep.    Mrs. Perry sits on the side of the bed with her back to her husband. Mr. Perry removes his robe and slippers before getting in to bed. Mrs. Perry begins to cry as he turns out the light.   It's all right. It's going to be all right.    Neil holds a key in his hands. He unlocks a drawer in his father's desk and pulls out a pistol, wrapped in cloth.    Mr. Perry jerks up out of bed, startled and breathing fast.   What was that?   What?   That sound.   What sound? Tom?  Mr. Perry turns on the light and gets up out of bed, putting on his robe and slippers.  What is it? What's wrong?  Mr. Perry turns on the hallway light and knocks on Neil's door. He opens the door and goes inside.   Neil.  Mr. Perry notices the open window.   Tom, what is it? What's wrong? Neil?  Mr. Perry continues to look through the house, continuing downstairs.   Neil?  Mr. Perry notices the door to his study is ajar.   I'll look outside. Neil?  Mr. Perry flicks the light on but sees nothing. Then he smells something. Looking closer, he sees a thin cloud of smoke rising from behind his desk. As he moves around the desk he sees his gun on the floor and Neil's outstretched hand.   No!  Mr. Perry crouches down by his son.   Oh, Neil! Oh, my God!  Mrs. Perry enters the room and sees her son.   Oh! No!   Oh, my son!   He's all right.   My son! My poor son!    He's all right! He's all right! He's all right! He's all right! He's all right! He's all right!   Stop it! Stop it! Stop it.  Mr. Perry holds his wife and tries to comfort her.",
        "Gerard": "",
        "Pitts": "\"To the virgins, to make much of time\"?   \"Gather ye rosebuds while ye may, old time is still a flying, and this same flower that smiles today, tomorrow will be dying.\"   That was weird.   Me.   The Danburry's? Who are the Danburry's?   That's too bad.   All the good ones go for jerks, you know that.   We got it.   No sir. Science experiment, radar.  Meeks holds up the antenna as if demonstrating it.   Where's this cave he's talking about?   That's miles.   I don't know Neil   What is this, a midnight study group?   Oh God. Clowns.    I'm eating the other half.   You want me to put it back?   \"In a mean abode in the shanking road, lived a man named William Bloat. Now, he had a wife, the plague of his life, who continually got his goat. And one day at dawn, with her nightshift on, he slit her bloody throat.\"  The boys laugh.   Oh, and it gets worse.   Take center stage.   \"Oh to struggle against great odds. To meet enemies undaunted.\"   \"Oh to struggle against great odds. To meet enemies undaunted.\"   Puck?   Your parents collect pipes? Oh, that's really interesting.   It's Chris. Here's a picture of Chris for you.  Pitts holds up a centerfold.   Duh. It's a lamp, Meeks.  Neil removes the shade from the lamp, revealing the shape of a man as the base of the lamp.   Charlie, what are you doing?   That was nice. That was great. Where did you learn to play like that?    Nuwanda?   Yeah. Uh, I might be going to Yale. Uh, uh, but, I, I might not.    Yeah.   You didn't.   Spaghetti and meatballs!  Neil comes up the stairs as everyone else swarms down to the cafeteria.   What'd she say?   Come here, Knox.   Beautiful baby.   He said something about getting red before we left.   I, uh-- Well, you know Charlie.  One of the stalls opens and Charlie's hand emerges, holding a small brush and a bottle of red paint.   Calm down.   Todd, it's okay. It's okay, Todd.   Twice.   How do you mean?   About what?",
        "Hopkins": "\"Oh, to have life henceforth the poem of new joys.\"  Hopkins crumples up his paper and then barely taps the soccer ball with his foot.  Keating puts a look of disgust on his face.   \"The cat sat on the mat.\"",
        "Nolan": "Ladies and gentlemen, boys, the light of knowledge.  An organ begins to play as the old man goes forward with shaking hands to the young boys in the front pew. Each boy is holding a candle and he bends over to light the first one. Each boy in turn lights the candle of the boy next to him.   One hundred years ago, in 1859, 41 boys sat in this room and were asked the same question that greets you at the start of each semester. Gentlemen, what are the four pillars?  All throughout the pews, uniformed boys rise to their feet. TODD, who is not wearing a uniform, is urged by his father to stand with them.   In her first year, Welton Academy graduated five students. Last year we graduated fifty-one. And more than seventy-five percent of those went on to the Ivy League. This, this kind of accomplishment is the result of fervent dedication to the principles taught here. This is why you parents have been sending us your sons. This is why we are the best preparatory school in the United States.  Mr. Nolan soaks up the applause from the audience.   As you know, our beloved Mr. Portius of the English department retired last term. You will have the opportunity later to meet his replacement, Mr. John Keating, himself a graduate of this school. And who, for the past several years, has been teaching at the highly regarded Chester School in London.  The crowd applauds once again.   Glad you could come by.   You've been away too long.   Good to have you back.   Mr. Anderson.You have some big shoes to fill, young man. Your brother was one of our finest.   Thank you. So glad you liked it.  MR PERRY approaches with his son Neil. He shakes Mr. Nolan's hand.   Tom   Neil. We expect great things from you this year.   That boy there, see me after lunch.  Cameron quickly puts the annual away and the others all return to their meal.   Take a power train in two! Three! Keep your eyes in the boat!   Sit.  The students all sit.   In this week of Welton's Honor there appeared a profane and unauthorized article. Rather than spend my valuable time ferreting out the guilty persons -- and let me assure you I will find them - - I'm asking any and all students who knows anything about this article to make themselves known here and now. Whoever the guilty persons are, this is your only chance to avoid expulsion from this school.  The sound of a phone ringing can be heard. The professors look about for its source. Charlie picks up a telephone receiver.    Charlie stands with his back to the door as Mr. Nolan shuts it. Mr. Nolan then walks around to face Charlie.   Wipe that smirk off your face. If you think, Mr. Dalton, that you're the first to try to get thrown out of this school, think again. Others have had similar notions and have failed just as surely as you will fail. Assume the position.  Charlie sighs and bends over, resting his hands on the desk. Mr. Nolan hefts a flat wooden paddle in his hands.   Count aloud, Mr. Dalton.  Mr. Nolan begins to strike Charlie with the paddle.   What is this Dead Poets Society? I want names.   Excuse me. May we have a word, Mr. Keating?   This was my first classroom, John. Did you know that? My first desk.   English. Oh, long before your time. It was hard giving it up, I can tell you. I'm hearing rumors, John, about some unorthodox teaching methods in your classroom. I'm not saying they've anything to do with the Dalton boy's outburst. But I don't think I have to warn you boys his age are very impressionable.   What was going on in the courtyard the other day?   Yeah. Boys marching, clapping in unison.   Well, John, the curriculum here is set. It's proven it works. If you question, what's to prevent them from doing the same?   At these boys' ages? Not on your life! Tradition, John. Discipline. Prepare them for college, and the rest will take care of itself.   The death of Neil Perry is a tragedy. He was a fine student. One of Welton's best. And he will be missed. We've contacted each of your parents to explain the situation. Naturally, they're all quite concerned. At the request of Neil's family, I intend to conduct a thorough inquiry into this matter. Your complete cooperation is expected.    Todd enters the room to see his mother and father seated opposite Mr. Nolan's desk.   Have a seat, Mr. Anderson.  Todd sits down next to his parents.   Mr. Anderson, I think we've pretty well put together what's happened here. You do admit to being a part of this Dead Poets Society?  Todd says nothing.   I have here a detailed description of what occurred at your meetings. It describes how your teacher, Mr. Keating, encouraged you boys to organize this club and to use it as a source of inspiration for reckless and self- indulgent behavior. It describes how Mr. Keating, both in and out of the classroom, encouraged Neil Perry to follow his obsession with acting when he knew all along it was against the explicit order of Neil's parents. It was Mr. Keating's blatant abuse of his position as teacher that led directly to Neil Perry's death.  Mr. Nolan motions to Todd's father, who passes along a sheet of paper to Todd.   Read that document carefully, Todd. Very carefully.  Todd looks at the paper, which already contains the signatures of the other four boys.   If you've nothing to add or amend, sign it.   Sit.  The students sit once again as Mr. Nolan walks to the front of the room.   I'll be teaching this class through exams. We'll find a permanent English teacher during the break. Who will tell me where you are in the Pritchard textbook?   Mr. Anderson?   I can't hear you, Mr. Anderson.   Kindly inform me, Mr. Cameron.   What about the Realists?   All right, then, we'll start over. What is poetry?  There is a knock at the classroom door.   Come.  The students look back as the door opens. They quickly turn away when hey see it is Keating.   Get them now, Mr. Keating.   Gentlemen, turn to page 21 of the introduction. Mr. Cameron, read aloud the excellent essay by Dr. Pritchard on \"Understanding Poetry.\"  Todd slowly closes his book. Keating opens the door to the tiny room off the classroom.   Well, borrow somebody else's book.   What do you mean, they're all ripped out?   Never mind.  Mr. Nolan takes his own book over to Cameron's desk and then slaps the open page.   Read!  As Cameron begins to read, Keating looks out at Todd as he puts his scarf on. Todd looks at him for a moment and then glances away.   Quiet, Mr. Anderson.   Leave, Mr. Keating.   Sit down, Mr. Anderson!  Todd reluctantly returns to his seat.   One more outburst from you or anyone else, and you're out of this school! Leave, Mr. Keating.  Keating hesitates at the back of the classroom.   I said leave, Mr. Keating.  Keating slowly turns and heads to the door. As he opens it, Todd, stands upon his desk and turns to Keating.   Sit down, Mr. Anderson!  Keating pauses at the door and looks back at Todd on his desk.   Do you hear me? Sit down! Sit down! This is your final warning, Anderson. How dare you? Do you hear me?  After a moment of indecision, Knox climbs up onto his desk.   Mr. Overstreet, I warn you! Sit down!  Pitts climbs up onto his desk, followed by several others, including Meeks.   Sit down! Sit down. All of you. I want you seated. Sit down. Leave, Mr. Keating.  More students stand on their desks until half the class is standing.   All of you, down. I want you seated. Do you hear me?   Sit down!  Keating stands in the doorway, staring up at the boys in wonder. A smile comes to his face.",
        "Mrs.": "We've been so worried about--   Go on, get some sleep.   What?   What sound? Tom?  Mr. Perry turns on the light and gets up out of bed, putting on his robe and slippers.  What is it? What's wrong?  Mr. Perry turns on the hallway light and knocks on Neil's door. He opens the door and goes inside.   Tom, what is it? What's wrong? Neil?  Mr. Perry continues to look through the house, continuing downstairs.   I'll look outside. Neil?  Mr. Perry flicks the light on but sees nothing. Then he smells something. Looking closer, he sees a thin cloud of smoke rising from behind his desk. As he moves around the desk he sees his gun on the floor and Neil's outstretched hand.   Oh! No!   He's all right.    He's all right! He's all right! He's all right! He's all right! He's all right! He's all right!   Hello, darling.",
        "Todd": "Thank you.  Todd and his parents leave while others file past Mr. Nolan.   Todd Anderson.   My brother went here.   Nice to meet you.   Thanks.   Uh, no, no I, uh, I've got some history I wanna do.    Todd is seated at his desk. He scrawls \"CARPE DIEM\" across a blank page of his notebook. He looks at it for a few moments before crumpling it up and opening up his Chemistry book.   No.   Yes, but-   Keating said that everybody took turns reading and I don't want to do that.   N- no, I don't have a problem. Neil, I just- I just don't want to do it, okay?   That's not how it works.   What? What are you gonna do, go up and ask them?  Neil shrugs.   No. No, Neil.   Neil, Neil!  Neil gets up and rejoins the others. McAllister hears the boys whispering again.    Todd is on his bed trying to write a poem. The door opens and Todd turns his writing pad over. Neil enters the room laughing. He crouches down next to Todd's bed and plunks a sheet of paper in Todd's lap.    You found what?   \"A Midsummer Night's Dream\"?   What is this?   I know that. I-- Wh-Wh-What does it have to do with you?   Yes, so?  Neil pounds on the bed and then pulls a blanket off his bed, wearing it like a cloak.   Neil, Neil, hold on a minute. How are you gonna be in a play if your father won't let you?   Yeah, but won't he kill you if he finds out you went to an audition and didn't even tell him?   Well, that's impossible.   Well, why don't you just call him and ask him? And m-maybe he'll say yes.   Yeah, but if he said--   I don't know. Maybe.   W-What is that supposed to mean?   So- You want me out?   Well, listen, Neil. I-I appreciate this concern, but I-I'm not like you. All right? You, you, you say thing and people listen. I'm, I'm not like that.   No! I--I, I don't know, but that's not the point. The, the, the point is that there's nothing you can do about it, so you can just butt out. I can take care of myself just fine. All right?   What do you mean, \"no\"?  A smile comes to Neil's face.   Give me-- Neil. Neil, give that back.  The two begin racing in circles around the room, jumping from bed to bed as Todd tries to grab his poem back.   Neil, how are you gonna do this?   You're not gonna write it.   Oh, Neil. Neil, you're crazy.     Todd is pacing circles about his room as he reads his poem. His pacing slows and then he tears the poem up.   I, I didn't do it. I didn't write a poem.   A yawp?    Yawp.    Yawp.   Yawp.    Yawp!   A m-m-madman.   A c-crazy madman.   Uh, uh, a sweaty-toothed madman.   Uh, I-I close my eyes.   Uh, and this image floats beside me.   A sweaty-toothed madman with a stare that pounds my brain.   H-His hands reach out and choke me.   And, and all the time he's mumbling.   M-Mumbling, \"Truth. Truth is like, like a blanket that always leaves your feet cold.\"  The students begin to laugh and Todd opens his eyes. Keating quickly gestures for him to close them again.   Y-Y-Y-You push it, stretch it, it'll never be enough. You kick at it, beat it, it'll never cover any of us. From the moment we enter crying to the moment we leave dying, it will just cover your face as you wail and cry and scream.  Todd opens his eyes. The class is silent. Then they begin to clap and cheer.   Hey.   Nothing. Today's my birthday.   Thanks.   My parents gave me this.  Neil looks down at a deskset sitting next to Todd, still in its wrappings.   Yeah, yeah. They gave me the same thing as last year.   Oh.   Maybe they weren't thinking about anything at all. Uh, the funny thing is about this is I, I didn't even like it the first time.   Or a car.   Oh, my!   Come on, Nuwanda. You're gonna miss Neil's entrance.   W-What is that?   Oh, come on, Charlie. The girls are waiting.   Neil! Neil!  Outside of the crowd, Keating manages to catch up to Neil. He takes hold of Neil's coat.    Todd is sleeping. Charlie reaches across to wake him. Tears are running down his face.   Oh, Charlie.  Todd opens his eyes and sees Charlie's face   What is it?  Todd looks over to see Pitts, Meeks, and Knox by the door.   It's so beautiful.  Todd begins to gag and then goes down on his knees, vomiting into the snow. The other boys huddle around him, hugging him.   He wouldn't-- He wouldn't have done it.   It was his father!   He wouldn't have left us. It's because he- He wouldn't have. His dad was-- his, his father did it.   His father killed him. He made him do it.   That is not true, Cameron. You know that. He didn't put us to anything. Neil loved acting.    Todd looks out the window and watches as Hager escorts Meeks back to the dorm. Inside the room, Neil's bed has been stripped of all its bedding.   Meeks?   What happened to Nuwanda?   What'd you tell 'em?   Mom.  THe door closes behind Todd. He remains standing, not knowing what to do.   Yes, sir.  Mr. Nolan puts his glasses on and glances at a paper before him before removing his glasses once more.   What's gonna happen to Mr. Keating?   Uh, in the, in the Pr-   In the, in the, in the Pritchard?   Mr. Keating! They made everybody sign it.  Mr. Nolan gets up from his desk and approaches Todd.   You gotta believe me. It's true.   But it wasn't his fault!   O Captain! My Captain!",
        "Anderson": "Thrilling ceremony as usual Dr. Nolan.   Hello Dr. Nolan.   This is our youngest, Todd.   Hello, son.   Hello, darling.   Answer him, Todd.   I've had enough. Sign the paper, Todd.  Mr. Nolan holds out a pen for Todd to take."
    },
    "imdb_rating": "8.1",
    "description": "Painfully shy Todd Anderson has been sent to the school where his popular older brother was valedictorian. His roommate, Neil Perry, although exceedingly bright and popular, is very much under the thumb of his overbearing father. The two, along with their other friends, meet Professor Keating, their new English teacher, who tells them of the Dead Poets Society, and encourages them to go against the status quo. Each does so in his own way, and is changed for life.—Liz Jordan <c9310494@alinga.newcastle.edu.au>",
    "name": "Dead Poets Society",
    "genres": [
        "Comedy",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYWU0ZDgyYjQtZDI0OS00NTI0LTlmYjMtYzZlZTg4MGNiMjdjXkEyXkFqcGdeQXVyOTU2NDAzNDE@._V1_QL75_UY281_CR1,0,190,281_.jpg"
}