{
    "filename": "Dear-White-People_script.txt",
    "imdb_id": "tt2235108",
    "imdb_url": "https://www.imdb.com/title/tt2235108",
    "characters": [
        "Troy Fairbanks (as Brandon Bell)",
        "Sofia Fletcher",
        "Kurt Fletcher",
        "Reggie",
        "Martin",
        "Dean Fairbanks",
        "Samantha White",
        "Colandrea 'Coco' Conners",
        "President Fletcher",
        "Mitch",
        "Lionel Higgins",
        "George",
        "Gabe",
        "Helmut West",
        "Annie (as Katie Gaulke)"
    ],
    "dialogues": {
        "Sofia": "Your hair is so cute B. T. Dubs.  Is it weaved?  I saw \"Good Hair\" in Afro studies.  Huh? Oh Bechet bitch.  Easy, it was the luck of the draw. Daddy had nothing to do with it.  And honestly, if I had to pick anywhere to be it'd be here.  Oh I got mines. Want to meet him?  Hey boo. This is my friend Coco. She's new to the house.  -- Are we on duty?  You got it cut last week.  Since when is OCD a Black thang?  Besides you've got a shift at the Politicos booth, then a shift at Orientation, then your advisor --  Then a movie maybe? Just us?  You don't have to run again. Just because it's her doesn't mean --  It's who he wants you to be.  A Freud reference. Sophisticated.  You need a shower.  I don't have to be.  Hey boo...why don't we put some of your new found free time to good use? It's been a while since...  ...since you fucked me with your big Black cock.  It used to turn you on when I talked like that. Is it me?  Is it Sam?  Why? I hate my brother's friends.  You'd go without me?  You're my guest!  -- Okay, what's with you and my brother? Are you in love with him? Is this like, some DL shit?  You said you loved me.  What do you do in the bathroom? When you leave the shower running? Was it just to get away from me?",
        "Fletcher": "Free speech my ass.  You're joking about this?  This is your office's issue Walter. Especially after that episode with Kurt in the dining hall.  It's a student issue. You are the Dean of students aren't you?  The Times has been watching us like a hawk. Last thing we need is some \"race war\" on newspapers across the country. How do you think our donor base will feel about that? Our fund- raiser is four weeks away.  Worse. But let me tell you something. If this blows up any further? It's on you Walter. Racism is over in America. And if anyone's still dealing with it, it's the -- I don't know Mexicans probably.  Come on in.  Son, call me Herb.  Is your little war really this important?  I understand the pressure to stand for something at an institution like this but you're barking up the wrong tree okay?  Your advisor tells me you're hanging on by a thread in you major. Perhaps it's time to reprioritize.  And I think you long for the days where Blacks were hanging from trees and denied actual rights. Then you'd actually have something to fight against.  You will be facing two hearings in the coming weeks that could end in either Probation or Suspension. One on the merits of your show, the other on your election to Head of House.  Your responsibilities to your house are suspended. Your show is done for. And another one of your illegal \"demonstrations\" will only make matters worse. This is a critical time for this school.  We don't have an intolerance problem here. Except for the one I'm looking at.  I know about the party. You picked a hell of a time.  -- You're cancelling Kurt. End of story.     Now wait a minute!  I have heard enough --  How much we talking?",
        "Kurt": "Sis.  Bullshit.  The biggest athletes, movie stars, hell your president is Black.  Sometimes I think the hardest thing to be in the American work force right now is an educated white guy.  You guys still got affirmative action, you're set.  Obama. Leader of the free world got into Harvard on affirmative action. Know who's not president right now? The guy that didn't get in.  Yeah but what other dining hall gives you chicken and waffles? Dear White People right? Funny stuff. How haven't we staffed you yet?  We're a lot more than a magazine sweetie. SNL staff is basically half Lampoon, half Pastiche. Just like the network comedies.  Who are you to put me out?  You got any idea who you're --  Bad move.  Everyone wants to be on our staff that's the easy part.  Yeah but Halloween is our premiere party. The waitlist is already a hundred deep and it's going to take a lot to outdo this summer.  Too close to the Tea-Party.  Guys what's the Pastiche motto?  The hell does Sam think she is?  Could we?  Hey Lionel. Talked to the Dean today.  We had a very enlightening conversation. I just want to say... I'm sorry about the voice message.  Do you accept?  You got to talk to these people in a language they'll understand.             What?  I fold.         -- trying to get on my staff?  -- Bullshit. Game Night is where we make our bids for the new staff. It's why everyone's here. You were practically about to bust out a tap dance.  My staff likes you. A lot.  This thing with you and Sof...  Our dad's have been playing a game of chess off and on since 1972.  You're a pawn. And I think it's time you get off the board bro.  Here's the deal. Every year we throw a party. The point is to mock the self important and moronic entities of the campus. The way to get staffed is to write an invite for the party.  Our invites are legendary, we make Gawker, the Post, tons of blogs every year. If your invite is the one that goes out, you're guaranteed a spot on the staff. The runners up are voted on by the rest of us.  Still working on that...     It's ironic. Bold. And don't tell me I'm the only one who thinks Sam White's little movement needs to get cut down to size.  Looks like you got your Hip Hop party Mitch.  Boys, we've got a lot more mingling to do. We'll be in touch. And Troy? Get off the board bro.  Need your submission by Thursday.  The fuck?     We don't have anyone like you on staff and you had a great idea. We brought you here to --  We're here to tell you what we want.    We don't let people video blog our events...  What party --  Dear White People. Are you tired of your hum drum, Wonderbread existence of accidental racism and wishing you could sip on Henny out yo crunk cup without a Bitch giving you the side-eye? Course you are.  For all those looking to unleash their inner Negro from years of bondage and oppression Pastiche proudly presents \"Dear White People\" our 89th annual Hallow's Eve Costume Party - tonight at 10 Pacific Time or 5 Colored People Time. Sorry for the short notice, but let's keep it one hun-ed. You've had us on your calendar for weeks.  Dudes must rock FUBU, Ecko, Rocawear, or Sean John. XXXL is the smallest size T-Shirt you can wear, preferably with a collage of Barack Obama and Tupac on it. Stunner Shades, chains, and Blue-Tooth devices sticking out yo ears are also encouraged.  Ladies, we need to see huge hoop earrings, long nails, and cheap tight clothes.  A proper hood rat starts fights, speaks loudly, and when she can't think of the word she's trying to say just makes one up, such as \"edumicated.\" Feel free to fry up some chicken, bring Kool-Aid, Watermelon, 40s, Henny, and of course Dat Purple Drank. No bougie bitches allowed.  Naturally there will be a freestyle rap competition so bring it, get yo shine on and join us for the party of the year! Oh and Nigga Nigga Nigga Nigga. Boy that felt good.                What the hell?             Yeah?  Okay, I'm fucking confused.     What?  Lionel?  The fuck you think you're doing man?  That all you got?  Fuck you I'm calling the cops.  -- Why don't you tuck your tail between your legs, run and tell the Dean and get the fuck out.        Dude. I know you can't help it...  ...but why are you such a fag dude?       I didn't do this. Sam. I had nothing to do with this.  Once I heard what the group was planning, I sent out an email to the staff to cancel it. You have the email printed in front of you.  My lawyer.  94              Guys throw parties at the house all               94    Your son tell you that?  I loathe Facebook.  You've got to believe me.",
        "Reggie": "Yo Troy I forget. Is your major in shucking or was it jiving?  That's his platform? Haircuts?  Just pretend like you're in the booth. Just you and the mic.    Programming professor gets me and Martin here mixed up constantly.  Cute. You get that at Toys R Us?  You still using your ID number?  You are begging to get hacked.  Winning was a happy accident. We want the reform repealed right?  The Republican party.  This shit.  Man fuck Tyler Perry.  Why is every educated person inherently evil? Why this Nigga gotta be in a mutha fucking dress all the mutha fucking time?  Yo Sam. We got to talk about the protest. When are we are bringing the Housing fight to the prez?  What do we need it sponsored for?  Like the House you're head of?  Keeping it One-Hundred! Being Black as hell just cause.  We got to rally Sam. Time is now.  It'll do a hell of a lot more than a radio show or views on Youtube.  Look, we got power Sam and it's time we used it. We earned it.  Tired.  Why you got to snap at me all the time? I'm around you like twenty four seven. Like your lap dog. I don't even usually get down like that with no red bone chicks man.  Come on, I thought your ass was Puerto Rican when I met you.  Oh so you can dish it out but you can't take it?  Come on Sam. You know how I feel about you.  You know what? Forgive me if I see something in you. Something inspiring. Something folks like me can get behind.  Tell me you'll set up the rally.  Finally made it in.  Do Black people scare you?  You're too scared to even ask anyone for a cut.  How come you don't come to BSU?  You're the \"Black voice\" of the Bugle now. We're just trying to decide if you are friend or foe.  We got to protect our girl.  -- Assignment? What's the story?  Of which you are so clearly an expert.  So what's harder man? Being Black enough for the Black kids or the white ones?  There you are! We supposed to start at noon.  Those are going up on Gillespie. Good right?  Yo. What's that? You're not getting cold feet are you?  You're kidding right? You're sort of the keynote.  -- They came to hear you Sam. Grab a bullhorn. Turn it on.  Sam?  Sam!  Yo, what the hell Sam?  Sam! I know you're home.  Sam. We want to talk.  I did it, we did it for you.  Yeah? Well you betrayed me.    Alright brother. What's the plan?",
        "Martin": "I assume everyone has the app I created by now?  Good. Voting may commence.  Okay. Looks like we've got ourselves a winner. Sam White? Oh shit.  \"We wuz robbed.\" That election was suspect man.  You should be so lucky.  I agree. Got something to add?  Sam? What are you doing?  The server that processes the voting results for House Elections has shut down the A.P. database. Saw it this morning. Apparently the intermediary program is on a refractile loop.  Sam currently has 445 votes. That's 200 more than she had last week during the actual election.  Had to have been Reggie. Dude's in my programing class. Good. Just forgot to turn his program off.  You're the rightful Head of House.  Half of this crowd is under 21.",
        "Dean": "How could this happen?     Most everything's locked up, but we'll find another residence to move you to. Third time's a charm. What about Armstrong / Parker?  I might have an opening. Maybe it'd be good to be around...you know.  Maybe it's in your head. Sure, sometimes our folks can be intolerant around people like you. Homo --  You like jazz Lionel? Manchester's like jazz you know.  And jazz is tension. The interplay of improvised solos all creating one song. Your problem is you've got no instrument. No major, no affiliations, no solo son.  No one reads the Independent Observer, my point is are you playing swing or bebop?  Are you a sax or are you a trumpet?  I'll do what I can. Not a word of this in the Observer okay?     Stalin quotes for two hundred?  I'm sorry, was I supposed to take \"Free speech my ass\" as a legitimate suggestion?  Every race issue is my issue.  How bad is this deficit of yours?  President Fletcher tells me his son got his ass handed to him.  Bout time. Can't tell you how many instances I had to defend Armstrong / Parker when I was Head of House.  But you're supposed to be better than alright. Since when do we lose elections Troy?  What have I told you about excuses?  Pastiche? On Kurt Fletcher's staff?  I'll be God damned if twenty years from now you have to end up working for that dumb asses son.  Fletcher and I graduated a year apart. He barely made it through. I graduated Summa cum Laude. Now look who's President and who's Dean.  A couple hundred grand a year. Understand what I'm saying? Now what happened between you and Sam to make her come after you anyway?  I don't like your tone boy.  So you lost the House. On to the school presidency then.  It'll be good to show this campus is capable of electing someone like you as school president.  Running late.  For your little rally?  Do you honestly think this is in the spirit of Armstrong / Parker house?  -- I've got furniture older than you. Counter culture? Is that what you think this is? That show of yours?  Your show is racist.  Do you read the school papers?  Your antics are making press Sam and press like this keeps men like President Fletcher up at night.  He's building a file on you.  I'm sure it was hard growing up. Wondering which side you fit into. Feeling like you have to overcompensate perhaps?     Martin, would you share with Troy what you shared with me?  She cheated. Hacked the system.    Martin, let me talk to Troy for a bit. I appreciate this.     You didn't tell me you and Sofia had a misunderstanding.  Her father. She was very upset. Troy. What sort of vision do you have for yourself?  --And what's that got to do with partying with Kurt? With smoking weed and writing jokes?  Okay, so what? Is it the spotlight Kurt gets? You want to be on...tv or something? You know how many Black men waste their lives to get on TV? Be rappers and ball players?  And the drugs? God damn it Troy I taught you better than this. I have been in academia a long time, I've seen a lot of things. The men who really run this world? You got no idea what they see when they see you. You are not going to be what they all think you are. You will not give them that satisfaction, you hear me?  Not now Troy.  You're being rude son.  I don't know who you think you are young man but you don't get to talk to your father any kind of way.  What is all this?  We don't condone this egregious event and are investigating its origins. The president and I are looking at ways to address issues of Diversity at Manchester.     Who's this?  You were hoping to make the staff?  At what point in time did you show up to the event?  Samantha. Please.  We know you were planning this.     But you wanted to be?  94              The invite came from the Pastiche               94   You've used that line on me before this year Mr. Fletcher. When a homophobic message mysteriously appeared on a voice mail line you shared with a roommate.  What were your intentions when you went back the second time?  By any means necessary?  Want to hear something strange?  The Pastiche group page hadn't been used for months, until the invite went out.  Well what's interesting is how easy it was to access the group before the note was sent. The password was \"Pa$tiche\" spelled with a dollar sign according to Kurt. Seems recently it's been changed.  Couldn't figure it out at first. Then I thought to try something. Five, seven, eight, three, five, twenty six, one, nine, four, six. Eleven numbers. Just like our student ID numbers. Just like your student ID number.  Did you send out the invite Sam?  What?  -- That already happened.  -- reenact?  Now you look here. This is an honorable institution. The idea that we would so much as entertain this suggestion --",
        "Fairbanks": "How could this happen?     Most everything's locked up, but we'll find another residence to move you to. Third time's a charm. What about Armstrong / Parker?  I might have an opening. Maybe it'd be good to be around...you know.  Maybe it's in your head. Sure, sometimes our folks can be intolerant around people like you. Homo --  You like jazz Lionel? Manchester's like jazz you know.  And jazz is tension. The interplay of improvised solos all creating one song. Your problem is you've got no instrument. No major, no affiliations, no solo son.  No one reads the Independent Observer, my point is are you playing swing or bebop?  Are you a sax or are you a trumpet?  I'll do what I can. Not a word of this in the Observer okay?     Stalin quotes for two hundred?  I'm sorry, was I supposed to take \"Free speech my ass\" as a legitimate suggestion?  Every race issue is my issue.  How bad is this deficit of yours?  President Fletcher tells me his son got his ass handed to him.  Bout time. Can't tell you how many instances I had to defend Armstrong / Parker when I was Head of House.  But you're supposed to be better than alright. Since when do we lose elections Troy?  What have I told you about excuses?  Pastiche? On Kurt Fletcher's staff?  I'll be God damned if twenty years from now you have to end up working for that dumb asses son.  Fletcher and I graduated a year apart. He barely made it through. I graduated Summa cum Laude. Now look who's President and who's Dean.  A couple hundred grand a year. Understand what I'm saying? Now what happened between you and Sam to make her come after you anyway?  I don't like your tone boy.  So you lost the House. On to the school presidency then.  It'll be good to show this campus is capable of electing someone like you as school president.  Running late.  For your little rally?  Do you honestly think this is in the spirit of Armstrong / Parker house?  -- I've got furniture older than you. Counter culture? Is that what you think this is? That show of yours?  Your show is racist.  Do you read the school papers?  Your antics are making press Sam and press like this keeps men like President Fletcher up at night.  He's building a file on you.  I'm sure it was hard growing up. Wondering which side you fit into. Feeling like you have to overcompensate perhaps?  Martin, would you share with Troy what you shared with me?  She cheated. Hacked the system.  Martin, let me talk to Troy for a bit. I appreciate this.  You didn't tell me you and Sofia had a misunderstanding.  Her father. She was very upset. Troy. What sort of vision do you have for yourself?  --And what's that got to do with partying with Kurt? With smoking weed and writing jokes?  Okay, so what? Is it the spotlight Kurt gets? You want to be on...tv or something? You know how many Black men waste their lives to get on TV? Be rappers and ball players?  And the drugs? God damn it Troy I taught you better than this. I have been in academia a long time, I've seen a lot of things. The men who really run this world? You got no idea what they see when they see you. You are not going to be what they all think you are. You will not give them that satisfaction, you hear me?  Not now Troy.  You're being rude son.  I don't know who you think you are young man but you don't get to talk to your father any kind of way.  What is all this?  We don't condone this egregious event and are investigating its origins. The president and I are looking at ways to address issues of Diversity at Manchester.  Who's this?  You were hoping to make the staff?  At what point in time did you show up to the event?  Samantha. Please.  We know you were planning this.     But you wanted to be?  94              The invite came from the Pastiche               94   You've used that line on me before this year Mr. Fletcher. When a homophobic message mysteriously appeared on a voice mail line you shared with a roommate.  What were your intentions when you went back the second time?  By any means necessary?  Want to hear something strange?  The Pastiche group page hadn't been used for months, until the invite went out.  Well what's interesting is how easy it was to access the group before the note was sent. The password was \"Pa$tiche\" spelled with a dollar sign according to Kurt. Seems recently it's been changed.  Couldn't figure it out at first. Then I thought to try something. Five, seven, eight, three, five, twenty six, one, nine, four, six. Eleven numbers. Just like our student ID numbers. Just like your student ID number.  Did you send out the invite Sam?  What?  -- That already happened.  -- reenact?  Now you look here. This is an honorable institution. The idea that we would so much as entertain this suggestion --",
        "Samantha": "3.",
        "White": "3.  4.",
        "President": "My only problem with your movie is that it was late. The silent projects were last semester Sam. You were supposed to have emailed your sound treatment over Summer.  Free speech my ass.  You're joking about this?  This is your office's issue Walter. Especially after that episode with Kurt in the dining hall.  It's a student issue. You are the Dean of students aren't you?  The Times has been watching us like a hawk. Last thing we need is some \"race war\" on newspapers across the country. How do you think our donor base will feel about that? Our fund- raiser is four weeks away.  Worse. But let me tell you something. If this blows up any further? It's on you Walter. Racism is over in America. And if anyone's still dealing with it, it's the -- I don't know Mexicans probably.  Come on in.  Son, call me Herb.      Is your little war really this important?  I understand the pressure to stand for something at an institution like this but you're barking up the wrong tree okay?     Your advisor tells me you're hanging on by a thread in you major. Perhaps it's time to reprioritize.  And I think you long for the days where Blacks were hanging from trees and denied actual rights. Then you'd actually have something to fight against.  You will be facing two hearings in the coming weeks that could end in either Probation or Suspension. One on the merits of your show, the other on your election to Head of House.  Your responsibilities to your house are suspended. Your show is done for. And another one of your illegal \"demonstrations\" will only make matters worse. This is a critical time for this school.  We don't have an intolerance problem here. Except for the one I'm looking at.        I know about the party. You picked a hell of a time.  -- You're cancelling Kurt. End of story.",
        "Mitch": "Y.O.L.O. my nigga!  We're going to make staff bids on Game Night, and the RSVP's are through the roof for that.  Cinco de Mayo was epic.  Yo we need an East vs West hip hop party. Get the honeys in here.  Our motto is a euphemism for masturbation?  Sounds like a reminder of how gay you are.  Hey Gordon, say reasonable again.  Like Spike Lee and Oprah had a pissed off baby.  Yo my perfect Friday night is whiskey and my T-Bone Walker records, real talk.  Uh only a pioneer of electric and jump blues bro. Know your roots.  Don't sleep on T-Bone man.  Public Enemy my Nig--  Kurt?  What other \"magazine\" you know has a first look deal at NBC? The third biggest Youtube channel. Talk show. Platinum comedy record homie!  Sup ma?  You wan' a drink a sun'in?  Vermont.  Want to know why they used to call me Black Mitch?  `Bout time. It's going to be huge man, fucking epic.  Party's not over.  Sorry bro. Invitation only.  Gimme that mic Before I slap ya Looking for some dykes, that wanna another chapta. If you do me slow, you can do me faster, I'll pass you to the Nigga on my right, he gets you after.  I'm sorry but it's bullshit. Yo this is how we get down. If you can't take a joke in this day and age? The fact we can joke about it proves we've moved on you feel me? This is an attack on free speech! We're the victims here!",
        "Lionel": "Kurt. It's Lionel. I'm locked out.  I don't know...  Dean. The worst thing about high school, and believe me it was a long list, were the Black kids.  -- I don't believe in labels.  This is a research school.  I submit articles to the Independent Observer.  You're mixing metaphors.  I hate jazz.  What's it matter? No one reads it.  Grood...Gate...I'm ah..  No one reads the Observer.  What made you come over here?  I mean I'm glad you came --  The oldest one has his face.      Me?  Pathetic.  Pastrami sandwich on rye.  Forty minutes? Man she's lucky I leave her forty cents. You do a good job, maybe you'll see a tip.  Doris was tripping, but fifteen percent is the least I can do.  I reject the stereotype that African American's don't tip. I'm leaving her twenty, no twenty five, just to prove I can!   Nose-job?  Relax the Negro at the door is not here to rape you.  So this is what editors do?  You wanted me to drop in and tell you how the story was coming?  It was this or the new Madea movie.  Of course not.  So then Sam says \"What, is your daddy scared the Negroes are gonna start a rebellion on the plantation?\"  Yeah. Yes. Yup.  Outdated nationalist seeks purpose starts race war?  What are you doing?    Sorry.  She seems really cool.  No. Garmin.  George I'm not exactly down with Sam and I'm not in the BSU. I got kicked out of Armstrong / Parker same as Kurt. But I'm going to write a good story, okay?  I'm growing it out.  I live here.  It's two in the morning.  The Dean said it was the only opening.  But you're not Head of House.  Sure thing?  I was just finishing up.    I'm growing it out.  I listen to Mumford and Sons and watch Robert Altman movies. You honestly think I'm Black enough for the union?  I'm late for class.    I'm not on staff. Not until I make good on my assignment, I'm just --  They want me to do a profile piece on Black culture at Manchester.  Being neither.  73.  The Negro at the door didn't scare you this time.  You need something? Saw your e- mail.  That's Halloween night.  Ah. Thus the new guy.  I don't know. Are there going to be any racially fueled outbursts at this thing?  Am I a good writer?  You're just a big recommendation away from landing the Times.  Yeah. Sounds good.  Funny seeing you here.  So...Picard or Kirk?  I saw you watching Star --  Hey, some could argue that a show with Whoopi Goldberg, Michael Dorn and Kunta Kinte himself is a pretty Black show.  No. No it did not. At least not in High School. I bet there's a statue of you at your High School.  Did they know you were a trekker?  I think it's gaining sentience.  It's like a black hole for white people's fingers. They're obsessed.  You're I dunno...you?  No costumes? I got a tux for this.  Where is it?  Third and Basin. I know it.  This is kind of fucked up. Right?  Kitchen's this way.  Ouch.  It's okay. Can't wait to cut all this off.  I'll be right back.  Sam? Can we talk?  Have you heard you yelling?  For the first time in my life, I can't just sit around and do nothing. How can you?  Hey. How's it going. Hi.  Hey...what is this?  Uh. Excuse me. Hi. I'm Lionel. Some of you...none of you probably know me. I've never been to a meeting. But I just came back from a party on campus and I think you should know about it.  Anybody mind if I?  I mean...I don't know. This is fucked up right?  We go over there. Now.  We're putting an end to this Kurt.  Kurt--  Heyyyy! Hoooo! Heyyy! Hooo!  My name is Lionel, Some people call me Li. Lots of people think that I talk kinda white. Well that's alright. Yeah that's cool. I'd rather you think I'm white, than tap dance for you.  Finally got me where you want me.  It's hard enough for us to even get into a school like this. Let alone succeed. Find our way. This is only a debate because of who Kurt's dad is, which just proves the point. All you did was have a radio show and look what happened to you.  To stop it.  Someone once told me...Manchester is like jazz. I don't know much about jazz. But from what I can tell, when your solo's up, you better blow.        2 Chainz? Shaft? While endless complex depictions of whites, white men in particular exist - there aren't that many versions of us in the culture.  Culture has a powerful way of telling people what they can and can't be. For people of color the options are rather limited.  Think there's a story there? Who do you think it'll be?  What? No.",
        "Higgins": "",
        "George": "Lionel right?  George. We had Civ last semester? How you doing?  Fan of your stuff. In the Observer?  You seen this?  The residents of Armstrong / Parker just made her head of house. Am I crazy or is there a there there?  -- My staff? God bless them. They're whiter than Michael Jackson's kids. We're fucked if anyone of them writes this story and I will not let the transfers at the Gazette do it first.  You're in the Black Student Union. You probably know Sam.  You come up with a good angle? I want it in the Bugle.  Bugle. Focus. The only paper on campus with a national subscription base and an Advisor from the New York Times? Only so many ways a person can distinguish themselves at a place like this Lionel. You're good. You belong with us.  I keeps it clean Ya know what I mean. I drinks my Vodka straight, like I'm a fiend.  We're taking a break, what are you doing here?  Yeah like this week. It's Saturday night. You got nowhere else to be?  Dear God. Where does Madea go this time? Dialysis?  Alright so then what?  To Kurt Fletcher!?  We've got a news item but there's something bigger here. It's a profile piece on Armstrong / Parker and Sam White's pseudo revolution.  Beers in the corner. Bang out the news item tonight and we'll work on the profile piece for next week.  You want to be a staffer right?  Did we go too far? You're in Armstrong/Parker right?  Fancy.  I hope so. I want a Bugle on your chest by the end of the month.  Your fro's so gnarly.  Night Lionel.  Lionel's story on the would-be protest outside of Gillespie is running tomorrow and I'm also having Lionel work on a profile piece of Armstrong/Parker like you suggested. Really break down what's going on.  Right. It's almost like they recycle so much from their past - Music, food, fashion, and now turbulence.  Thank you so much. Okay, take care.  That was our Times advisor. He said it's stories like these that get editors recommendation letters.  Thanks.  Yeah, I need someone to do the Donor's function on Saturday. Small dinner for the school's big givers. Administration wants a little coverage.  Right, which is why no one else will take it.  On my way to class, but you can stay and check out last year's piece. You'll do fine.  Never know right?  You'll get better. And we need you right now.  God I hope so.  Hey.  I'm glad we finally got that Bugle on your chest.  There's a big party the night of the Donor's event. Call me after, maybe we can hang?  Li! You ready man?  Yeah, we're going as overworked.  Pastiche. The world's most erudite boneheads. Who wants another round? Come on Lionel, help a brother out.  Sorry.  Don't you dare.  I could eat you like a Hershey's.",
        "Gabe": "What would you say if someone started a Dear Black People?  I dig the \"silent movie\" thing, but it's a little self-congratulatory. Light on story and frankly thematically dubious.  Well what was that supposed to be about exactly?  You invoke Minstrelsy for shock value, but to what end?  So it's a tit for tat?                      *  You're reacting to a work made              * almost a hundred years ago.                 *  Frankly I just think sometimes its          * better to hold a mirror up to your          * audience than to drop an                    * ideological piano over their head.          *  African Diaspora? Really?                              *  Who goes to see Tyler Perry movies?  --to the detriment of the so called \"real thing.\" Got it.     And the commodification of culture is uniquely oppressive to Black people?  So when Kanye raps about Louis V and Rolexes and Classical Art, exactly what exploited pocket of Black America are those references being mined from?     What? You dream in \"Cosby\" again?  Hey so...this whole \"Head of House\" thing. Congrats?  Weird, right? Never took you as a student politician...  Sam? What are we doing?  Sam! Really Sam?  What is all this?  You want me to tell them to go?  I will.  I'm trying to be here for you.  What do you see in him?  Wow. Okay.  I want to be down? How long does it take to get your hair like that?  --what? Have to pick a side? I'm sick of your tragic Mulatto bullshit Sam!  Mulatto! Mulatto! Mulatto!  I'm sorry if I can't be your Nubian prince on my Black horse ready to take you back to fucking Zamunda!  Can I please get some credit for a solid \"Coming to America\" reference?  This isn't you Sam.  You're this...girl...  Who...likes to argue with me about every fucking thing. And I hate it because we both know you're smarter than me. Your favorite director is Bergman, but you tell people its Spike Lee. You love bebop, but you've got a thing for Taylor Swift. I know because my Mac picks up your Mac's library.  You like to use phrases from the thirties and wear clothes from the fifties and hairstyles from the sixties. You like to watch me when you think I'm sleeping. And trace the outlines of my face.  You're more \"Banksy\" than \"Barack\" but you've been co-opted as some sort of revolutionary leader or something? But really you're an anarchist. A beautiful writer, artist, filmmaker, shit starter. And beautiful, in general.  Everything okay?  Good. That's good Sam.  What!?  Hello Sam.  Read about Armstrong / Parker.  Congrats?  Sam going against the grain? Shocked. How's papa White?  Good. Well...  Want to talk about it?  I'm sure he forgives you.  Sam. Where are you going?  Isn't it Mac and Cheese day at Armstrong/Parker?",
        "Helmut": "You call your Youtube show \"Doing Time at an Ivy League?\"  Yeah? And do what?  Armstrong / Parker? That your rooming assignment?  That's not where you want to be?  With the rich white kids.  What part of Chicago you from?  What street?  -- Seventy Eighth is Southside sweetheart. And you know what they say. You can take the girl out the hood but --  Thanks so much for coming in.  Here's the way reality works sweetheart, I'm the producer. I ask the questions. Be in touch.  This is the school radio?  I'm looking for good TV sister.  You're at a great school, getting a great education. Be good at that.  Conflict is a commodity in my industry. Sam's got it. Do you?    New videos are picking up steam.  The show I'm scouting for... It's called Black Face / White Place. It's reality. Like a \"True Life.\" Each episode centers on a different one of \"us\" in a sea of \"them.\"  Interesting? You think they want interesting? Dignified stories of triumph and survival? They want the \"authentic urban experience\" which is basically network talk for bitching and weave snatching. I'm telling you this because the network is looking to take one of the subjects to series. I got one episode. One shot to find that subject. So if we do this...  I think so. She called me a Bojangling Oofta, whatever that means. Everything else she said would've been bleeped on tv. So look, forty thousand hits on Youtube is good. It's not great.  They'd let you do that?  It's just...  ...not everyone is as camera ready as you.  Two hundred thousand views. Look they even auto-tuned it.  Couple months, that's how long shooting for an episode takes. We recommend you cut your course load in half to accommodate the schedule.  Trust me it it'll read \"full-time\" in the episode. If...once we go to series, we might have to figure out a summer schedule.  For uh...classes and stuff. Won't be graduating early anymore sweetheart.  Five grand for the episode. Twenty each if you get picked up for series. What do you say?  Trust me sweetie it's the same out there as it is in here. Good news is? Against all that damn white you and I? We pop. Think I wanted to be the go-to producer for all things Black?  Tell you what's worse though. Being that broke Nigga stuck on the south side of Chicago. Hundred and Fiftieth street.  Let me get this straight. First you tried to break up the Black house. Then you took down the sister with the little radio show. And after all that, your kid throws a Blackface party?  You thought you were having money problems before? Wait till cable gets their hands on this story. Bill Maher is gon' fuck you up!  -- Wait I'm sorry. Look from where I'm sitting this place is a goldmine.  For one we got to show the events that led up to the party --  Well yeah, but we can reenact --  Documentary term...Look, I can start putting together an overall deal today. I'm talking real money! Turns out the one thing America likes in it's reality more than ignant Black folks, is crazy racist White people!",
        "West": ""
    },
    "imdb_rating": "6.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjMzMjc5MjIzNV5BMl5BanBnXkFtZTgwNTY4OTQ2MjE@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "A social satire that follows the stories of four black students at an Ivy League college where controversy breaks out over a popular but offensive black-face party thrown by white students. With tongue planted firmly in cheek, the film explores racial identity in acutely-not-post-racial America while weaving a universal story of forging one's unique path in the world.—Anonymous",
    "name": "Dear White People",
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ]
}