{
    "filename": "Deep-Rising_script.txt",
    "imdb_id": "tt0118956",
    "imdb_url": "https://www.imdb.com/title/tt0118956",
    "characters": [
        "Trillian St. James",
        "Hanover",
        "Mamooli",
        "Captain Atherton",
        "Mulligan",
        "Joey Pantucci",
        "Mason",
        "Vivo",
        "Simon Canton",
        "Communications Officer",
        "Billy",
        "Radar Man (as Warren T. Takeuchi)",
        "Leila",
        "John Finnegan",
        "T. Ray"
    ],
    "dialogues": {
        "Hanover": "You remember the first time we met Finnegan? I think you were just starting out...smuggling gold off Sumatra for those two Chinese...what did we use to call them?  No, it just struck me as odd...I don't see you for all these years and you've still got the same tape stuck in the box.  So where are we?  And where is our point of arrival?  Which question is that?    Don't mind him Finnegan...you remember 25...balls of steel... splashing around in a sea of testosterone.  That's why we're sill around Finnegan...you and me... Nothing gets the feathers up. Business is business. Eh?  Mr. Billy you're in the batter's box.  We're not savage here Mr. Billy... we're professionals. Hold him...Mr. Chin...  Anyone else?  This isn't right Finnegan. I've got a contract.  And no questions asked.  He did...with a crowbar...you know the rules on a broken contract.  What happened?  How soon can we get up and running?  I have a schedule...  We were talking about my schedule...  Not an option.  One more joke and your comedy career is over. Now fix this.  Contact verified! You know the drill gentlemen!  Care to see what dreams are made of Finnegan?  Secure the zone of operation!!  When I was a little bit of a pissant we lived down the road from where all the big cruise ships used to come into Sydney harbor...  Mum and me we used to sit by our front door and watch them...she used to say \"one day you're going to make your fortune in life on one of them...\"  And she could do a hell of a barbie to boot! Belt up. You'll find all the parts you need up there.  I'd say that's a pretty good assumption.  With what? Martinis and tanning oil?  Synchronize watches...  25 minutes...by the numbers. Engine room and machine shop are on the third sub deck...Vivo...Mulligan go with them...keep in touch...move out...  Focus on the task Mr. Chin...  What the hell is going on?    Stay to the schedule. Stay to the plan. Nothing has changed.  Where is everybody?    You tell it straight or I pull the trigger. Who are you?  Where are the other passengers?  Mulligan?? What?? I can't hear you?? Repeat I...  Stand down soldier!  I said...  Stand down!!  One of who?!  This is Red one! Come in Red two!  Let's find them!  It's not going anywhere...  Where are my men?  Drop it!  Now, back up!  Everybody in!  Where are you going?  Shut up!  Now, where's Mulligan? Where's Vivo?  Shut up! Shut up all of you! Now here's what we're doing... Mamooli is going to take you back to fix your engines, Chin and I are staying here to finish the job...  With who?  Where are we?  Don't touch it!  Bravo.    You hypocritical bastard...all you gave a shit about was the money... where's the hatch!!  Alright let's move out...you two on point...  Who gives a shit about aft?  You trying to take over my show Finnegan, that what you trying to do?            How do we know you're going to signal...how do we know you're not going to just take off?  Stop pacing.  You deaf?  You want some too?  Fire!!  Mamooli stand down!  What are you talking about?  Maybe we lost them.  Finnegan, No!!!  You idiot!  Feed them. That'll slow them down.  Help!! Help!!",
        "Mamooli": "What you talkin'? Samoa's a county!    Hanover!  Where's Chin?  This is not real! This is not bloody real!  I say we stay right here!    Someone...maybe they sent an SOS!  We don't even know if his boat is still there...you saw Billy!  They're wipin' us out one at a time. I say we make a stand. Right here! Right now! Maximum firepower!  I'll kill you!! I'll fucking kill you!! I'll do it! I'll do it! I'm not playin' around here!  What the hell are you talking about?  And what? These things are octopuses  What...? What??",
        "Captain": "Is what true madame?  It is a theory I would be glad to put to the test.  Enchante...  We have a storm rising behind us... we may have to close the canopy, I hope it doesn't ruin your party.  Mademoiselle...you are not a lady.  Switch over to auxiliary power, and run a circuit check.  Communication systems have failed! Radar...sonar...radios...I don't understand it.  Remain calm! Stop! Do you hear?  Yes.  We have to make it to the third deck...  We can't...all the communication systems went down.  I don't know how.  He's the owner...    All these people dead!! Because you screwed up on the math??  We're going to die here! We're going to die!  They are...they are everywhere.  Help me!  What is it?  What?!... WHAT?!",
        "Atherton": "",
        "Mulligan": "You know what my goal is? Before I die I want to make love to a woman from every country on earth.  What the hell does that mean?  Map...no map...I don't give a shit ...they got women on Samoa, it's on the list.  I vote we slit his throat THEN throw him overboard...  Target in sight!!  I thought the plan was we'd evacuate them after we got through.  Plans don't change...  Shut up!    Let's keep going!    What the...???  Come on...the sooner we get outta here the better I'll feel. Mulligan and Vivo move forward.    What the...  So?  Why don't you just stop figuring and keep working so we can get the hell out of here?  'Cause grease monkey ain't in my job description dick head...    Someone's back there.  Check it out!  Will you check it the hell out!!  What is it man?  Vivo!! Vivo!!  Touch it and you're dead, asshole!  What happened to Vivo?! What the hell happened to Vivo?  Hanover!...Hanover! Come in! Come in you son-of-a-bitch!  Hanover!! Hanover!!    Shut up, man, just shut the hell up! I gotta think! I gotta think!!  There ain't no thing here!! No thing!! There's you him and me!! Got it! You him and...",
        "Joey": "",
        "Pantucci": "\" -- the Minnow would be lost, the Minowwww would be lost.\"       You trying to make me feel guilty?  All better...  Now tell me again...  ...why we took this job?     ...and some of it's coming your way.     Thanks...  Here's what I think...I think these mokes below are a hit squad.  Right now...there's some bozo sitting on his yacht at those coordinates they gave us, sipping his scotch and soda...totally unawares that we are about to deliver 500 kgs of high power torpedo to light up his ass...that's what's down there in that hold and who knows what the hell else...  You don't give a shit about anything do you?  That's it? That's all you give a shit about?  Jezebel's dead...Hercules is right behind her! We got a gusher in the hull!  What did you do to my kids!!  No! The man in the moon!! Who's driving this thing?  I spent two years building these things...screw your schedule!  With what? Look at them...they need gears...cylinder heads...oil pans... we're in the middle of the goddamn ocean...  Good! So maybe he also know where the hell am I going to get the parts I need...    You'd think they'd set a deck watch...  Maybe it's the wrong ship.    ...Like a house in the suburbs... maybe a couple of kids...some sort of business...be in the bowling league...go to the ball games...  What? You don't think I can have a normal life?  Okay...        Why don't you help us so we can get done faster so we can get the hell out of here?  Don't shoot, man, don't shoot!  What's there to think about?? That THING back there...  Finnegan, what the hell was that?  If I don't, I ain't going back to get it...you think we're safe?   What the hell's going on here?  Finnegan!  Man, there's something here! On the boat!  It's gonna snap the cable!  Oh no!! Oh no!! Finnegan!!!  Yeah man, no shit, call in the Marines.  Hey I can fix any damn thing... where's the comm. center?  That way.    I ain't goin' up no more elevators.  Are you crazy?  On what? This son of a bitch zapped the communications.  Somebody shoot this jerk!  What the hell is going on!!  Oh no...oh God please no.  Gimme one! Gimme one!  They're catchin' up! They're catchin' up! We gotta slow 'em down!  Feed 'em?!! Okay! All right! Feed 'em what? WHAT ARE WE GONNA FEED  ...even you don't deserve this.  I'm sorry man...  Don't shoot!! Don't shoot!!  Not even a Joey, I'm glad to see you? Joey, what happened to your leg?    For juice, I gotta rebuild. That's not fast.  Can somebody tell me what the object of the exercise is here?    You know what I think? I think our luck has just about run shit out...  I think we gotta stop floating from one fucked up situation to the next...  I'm telling you, man, we got to give the future some serious thought.  And what have you come up with?  I gerry-rigged the ignition...all you gotta do is start her up...it won't go fast but it'll go loud...  Man, don't go up there...  She's gone...  All you're gonna do is get yourself killed...and for what? Some chick?  Was it the water in my eyes or were you guys about to...  Because it's cool, you know, I can always take a walk or something down the beach...  Or I could go for a swim...although, I gotta tell you...if I never get in the water again...  OK...OK...you don't have to beg me ...I'll stick around...  Or maybe not...",
        "Mason": "They were...but they musta been talking about another Finnegan... because the one I heard about was as rough as they came...the one I'm looking at is, well, about as current as the music.  And who's gonna make me?  I'll take a go and the I vote we throw the little weasel overboard...  You little weasel!  Tow lines!  Tow line secure.  What the...  Forget her...let's get what we came for and get the hell out of here!",
        "Vivo": "You mean countries that are acknowledged by the UN...or like made up countries too?  Like Mamooli's country...  It's a dot on a map...  Lines set.  Clear!  Maybe plans changed...  What I want to know is why the goddamn ocean is always cold...since I'm a kid I hate god damn cold water.  Nothing.  Hey! Come out here!  Hey! You hear me? Come out! Still no response.  Man this shit is cold!  I'm gonna kick your ass for putting me through this...  I'm not screwing around with you man...I hate the cold water.  I'm looking...  On shit!",
        "Simon": "",
        "Canton": "Ladies and gentlemen...  All my life I had the dream of building the greatest pleasure ship ever to sail the seven seas... tonight, seeing all of you here...so elegant...so beautiful...so rich...  I realize my dream has come true...I thank you all from the bottom of my heart for making it so...  To the Fuji Maru! Good times forever!  You wanted to see me Captain?    It is an amazing stone...  ...what were you planning on doing with it?  Well you can still proceed with your plans then...in prison...Captain... escort the lady...  What the hell is going on?  Nonsense! We're impervious to weather!  Well unmelt it!!  Ladies and gentlemen...your attention please... Ladies and gentlemen...  This is the most technologically advanced sailing vessel on the water today. Every problem has been anticipated...the Captain has assured me that we will be up and running in no time...so enjoy yourselves...there's nothing to worry about...  Dear God.  Oh my God. I didn't mean to...  I thought it was one of them!  I didn't mean to! I though it was one of them!    You see? You see?  It's taking us to the bottom of the ship!  The sublevel lobby.  We should get off as soon as possible.  I say we evacuate as soon as...  I just think that...  You can't... All the systems were melted at their core by nitric acid...  My dreams cost more than they would make...I miscalculated the market... there was no way I could recoup...        I never meant for anyone to get hurt ...it was supposed to be clean...  I don't know.   Through there...another sixty, seventy yards...there are more elevators there.  There's stairways...  Do we have to go there?  I can.  Oh my God, it's going to sink.  It's going to sink.  I'd like to but I have an appointment with my insurance broker!  Life takes the damndest turns, doesn't it?  Oh we sail the ocean blue, and our mighty ship's a beauty. We are strong men, yes it's true, and responsive to our duty...  No! No! No!",
        "Communications": "",
        "Officer": "We're losing radar and sonar!",
        "Billy": "At home we denosy the nosy.        Hey you! Muscles! Out here!  O.K. You want it that way...  ...when I find you, you pay...",
        "Leila": "Gum kwa she bam dok.    Asshole...  Gebop!!",
        "John": "",
        "Finnegan": "How we doing out there?  Yes, I'm very warm and dry in here, thank you for your concern.  A raise? I already pay you two bucks a day.  Missed one darling.  I love you too.      Guilty will be the least of what you feel when I run my rig into one of these god damn no name islands! Get me well here!  If I told you once...I told you a thousand times...  Fok Yu and Fok Yu Two...are we strolling down memory lane for any particular reason?  You know what they say...the classics are eternal.  Right here...middle of nowhere...  Right here...middle of nowhere...and the answer to your question is yes.  The one you came up to ask...are we on schedule?  All of them flattering I'm sure.  I don't mind him...but I do think it's time for him to get back down below with the rest of the playgroup.  The Finnegan you heard about.  And the classics are eternal.  It's not noise...it's genius...     ...this is not a democracy. You don't get a vote.  I'll say it again for the hearing impaired...    Who asked any?  I know it...but you want to get where you want to get, and back? I need a chief engineer, and unless you got a replacement, I'd highly recommend overlooking the indiscretion.  You put me in that position again I'll throw you overboard myself.  I saw these guy perform...at Altmont ...you know that? They opened for the Stones...  Hold still now...I was like three rows back.  ...Jagger was here...I was here...  Sure I do...I give a shit that at 0300 hour we reach our point of destination. I give a shit that those mojos got to do what they got to do, and 45 minutes later we are turn around and gone. I give a shit that by the time the sun comes up we are all safely tucked in bed.  Oh yeah...and that my stitch job doesn't make you uglier than you already are...this won't hurt a bit...  Leila see what they're up to...  What the hell...  Joey!! Talk to me!  Shit!!  Me??  We ran into a speedboat...  Speedboat in the middle of the ocean...  We can't...we got one engine dead, and the other limping badly.  You're going to have to get a new one.  Then you better start swimming.  I think he knows that Joey.  Great woman your mother. Real foresight.  I assume somebody up there has made sure no distress signal can be sent.  Let's just keep going.  Guys!! Whoa! WHOA! WHOA! WHOOOAAA!!  Guys...get a grip.      Joey...it's okay...  Joey...look at me...  We're gonna get what we gotta get... do what we gotta do...and get the hell outta here...okay?  It's okay...come on...  Relax your arms...slowly...that's it...  The hulls of these things are supposed to be impregnable...  So...If the hull's impregnable why are my feet wet?  Forget them...  ...we gotta get outta here -- NOW.  Grab the parts!!  I'll cover! Move! Move!  I don't know...you got what we need?  Come on!!  It ain't any better out there!  Lady, I'm telling you...   I saved your life is what I did!  What other bunch?  I'm not a thief.  I'm their ride.  Not anymore.  Dead.  Hanover, listen...  I told you...  Did you clear this?  With that...  Help me!!  They're coming! They're coming!  Oh shit...   You shoot me and you got no ride home...  You the Captain?  How do we get out of here?  This way!    Why don't you want a message sent?  Because you know a message can't be sent...  You're the inside guy aren't you? The guy who knocked out the communications.  Unless you collected on the insurance...  He's with them.  They rob the joint blind and torpedo it to the bottom. He collects the insurance, and sails off into the sunset clean as a whistle.  Right?  It's not going to help us!  I was born in a City housing project in the Bronx OK? It's not in the cards that I die on a luxury cruise ship...now which way up?  All right, be cool, everybody, nice and slow, no sudden moves.   Jesus Christ lady...  I don't know...  ...there's got to be a way to access out back there...  Nothing...you want to come, come... you don't...  Look lady, I know you people are used to getting your way...  You people...rich people...  Well, you sure do a good imitation.  Finnegan...John J...now that we've been properly introduced, can we get the hell out of here?  That's what I do.  Quite a few.  Anti social?  With the emphasis on SELF, and in selfish, right?  Shoot it! Shoot it!  The safety! The safety!  On the side!!  Let's get the hell out of here!    Got it?  Yeah you did...  Boat or no boat... You woulda come back anyway. You're that kind of gal.  The \"come back\" kind.  Takes one to know one.  Grab his hands!!  Joey... Which way's aft?  That's where my boat's moored.  Just trying to get to my boat...  They respond to sound...  What's on the far side?  Joey, what difference does it make...  If you hear one shot, you know I made it...start coming...  I'll wait here... You go check it out.    You O.K.?  Who?  Boat or no boat...I'm going...    I once saw a guy put a fish in a bottle, then he corked it, sealing it tight, and threw it to a baby octopus. The little sucker felt its way around that bottle, and in less than two minutes, got that cork off, slid inside, and ate that fish.  Us...I'm talking about us... We're the fish.  I don't know what these things are ...all I know is...  They're herding us.  Like cattle...  I'm saying they're calling the shots...  The quiet...  Or maybe we're exactly where they want us to be.  A meat locker.  We can't do anything for them... Let's go...  Eat this.   Looking good...   We're going to sink! We've got to get on deck!  You quit high school, lie about your age, join the navy, and next thing you know, four years are up and you need a way to make a living...  I'll break the seal! Pull.  Keep tasting...  It's OK...it's not one of them... it's from the aquarium...it's...  It's not them...it's it...  You know what kind of force it took to rip open the bow of this ship? A million little things like this...  ...can't exert that kind of pressure... And the way it tracked us? A million little things don't carry portable phones to coordinate positions... What's chasing us... it's one...thing...one giant... thing.  Will somebody give me a break here?  Look!  Not like him.  It's the engine...it can hear the engine...it goes for the loudest sound...  Hit it! Hit it!  Yeah...  Not unless we kill it first.  Anything moves, you shoot.  There's not much horsepower left in the engines, but there's enough noise...once this baby's set...I'll rev it up...that slimy bastard will come for it like candy...  Jet ski...there's one left up there.  ...let's see, it was red wire cross compressor blue wire...or blue cross red?  Just the man I wanted to see. On this puppy here, you remember if it's red to blue or blue to red...  Joey, you want to get sucked out by a giant fucking mutated squid?  Squid...squid like...squid type... it's got tentacles, a feed sac... probably one central nervous processor somewhere...what the hell do I know is going on deep down in the ocean...there's all sorts of shit we've never seen...eighty foot clams...60 foot sharks...I'm just guessing...can you get me more juice out of Hercules...fast?  Right...  Seafood salad. You ever operate a jet ski?  Not unless you can wire a missile or fix an engine.  Don't forget the safety.  And you got 10 minutes before this thing livens up a boring evening.  A little to the left...  Line it up now, nice and easy...  I have been.  How does an island sound to you?  One whistle... Start the engine...  Second whistle you make it to the deck and get ready to jump...  You're beautiful what you're jealous, you know that, Joey?  Don't look!! Push!!  Grab my hands!!  Push!! Push!!  Go! Go! Go!  Get to the jet ski! Go!  Get a good look...    I don't mean to drop in unannounced ...you ready...  Three minutes...I'm not back...no matter what...you go...  You don't take orders very well, do you?  This time, make an exception.  Pantucci!... JOEY!  Time to die, motherfucker.  He's not coming...  Hold on!  Oh shit!!  Come on!!  Come on!!  Joey...  Joey...  What now...",
        "T.": "",
        "Ray": ""
    },
    "imdb_rating": "6.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTJmY2ZiNzMtNTBhOC00MDlkLWJlYzUtYWIyNDAyZDM1OWQ0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,2,380,562_.jpg",
    "description": "When a band of ruthless hijackers invade the world's most luxurious cruise ship, they're shocked to discover the passengers have mysteriously vanished! But that doesn't mean they are alone! Something terrifying is lurking just out of sight: a deadly force from the unexplored depths of the ocean that begins to snatch the horrified intruders one by one!—Greg Kleiner <LtJGBrewer@aol.com>",
    "name": "Deep Rising",
    "genres": [
        "Action",
        "Adventure",
        "Horror"
    ]
}