{
    "filename": "Devil's-Advocate_script.txt",
    "imdb_id": "tt0118971",
    "imdb_url": "https://www.imdb.com/title/tt0118971",
    "characters": [
        "Christabella Andreoli",
        "Pam Garrety",
        "John Milton",
        "Mary Ann Lomax",
        "Mrs. Alice Lomax",
        "Lloyd Gettys (as Christopher Bauer)",
        "Meisel",
        "Mrs. Jackie Heath",
        "Kevin Lomax",
        "Leamon Heath",
        "Mitch Weaver - Justice Department",
        "Melissa Black",
        "Eddie Barzoon",
        "Mrs. Diana Barzoon",
        "Alexander Cullen"
    ],
    "dialogues": {
        "Christabella": "Christabella Adrioli. Economics. Primarily G-7 and E.C.      Do you have this view?  From your terrace, is this your view?  No, I live downtown. This is the family building.  Is it everything you expected?    Are you alone?  Is your wife a jealous woman? Silly question. We're all jealous, aren't we?    You like to be on top, don't you?  Of the situation. You prefer to be on top.  It's a boring party, anyway. Ciao.  Enjoying yourself?  Just what?    Looking?  Congratulations on Cullen.  What an incredible situation, even if you lose you become a star.  If you win... If you win it's everything.  Cullen is a pig. He's a pig beyond reasonable doubt. I suggest you keep him as far away from the jury as possible.  (leans in,  Careful... You'll spoil me for other men.  Heard he finally dragged you out the other night... Can't believe I missed it.  Have a lovely evening.  Oh, Kevin --  Eddie Barzoon...  He's dead.   He was killed.  What is wrong with people?  Do you have room for one more?  Surprise.    Anybody want a drink? I'm having a drink.  It's done.    Forget it. It's all for us now.  Stop talking. Both of you. Kevin, please...",
        "Andreoli": "",
        "Pam": "Until something better comes along...  In the pipeline. For now, we'll just have you work pro hac vice. We've petitioned Florida for a letter of good conduct. And... ... I prepared, at Mr. Milton's request, an overview of the Moyez case.  What do you think?  Isn't everything?  I'm sure the D.A.'s waiting for your call.  It's only a health code case.      Kevin...  Your wife is on the phone.   She sounds upset...  I'll make sure Melissa gets down to the car.  Caught me.  That bad?     Kevin... Kevin, I'm sorry, but you're due in court in thirty minutes.  I'll bring Melissa down in the car, but you better get going.  Kevin! Kevin, it's for you --  We got her on the first flight up this morning.  Don't you look beautiful now. Here. Have a look and see.  It's all right, dear.        Look...  Go on. Take a look.      See how beautiful you are?  There you are... Look at you... you're terrified. Not to worry. He'll take that fear away. You don't ever have to be frightened again. Go on, he's waiting...",
        "Garrety": "",
        "John": "",
        "Milton": "Behind you.  Sorry.    Didn't mean to...    Have we been treating you well?  Your wife, she's had a good time?  Good. That's our secret. We kill you with kindness. What's your secret?  You were a prosecutor.  Sixty-four straight convictions. What a number.  What's that like? One day you're putting them away and the next you're setting them free?  Pays better though, doesn't it?  The math teacher. The Gettys case. I hear you were brilliant.  Really.   So you think your guy was guilty.  What did you say?    I love it.  You don't really want to go back to Florida, do you? Walk with me.           What do you think? Some people can't handle it.  Exactly. Fill in the resume. Tell me about your family. What does your father do?  She never remarried?  That can't be easy in Gainesville.  Little different when you're looking down, isn't it? Tell me about her. Your mother. What's she like?  'Many are in high places, and of great renown: but mysteries are revealed unto the meek.'  Didn't rub off on you?    The book? The church?  Lotta potential clients down there. (Sooner or later it all flows through the streets.  You like it here, don't you?  Always.  Because our clients break the law just like everyone else and I'm tired of sending their business across the street.  I'm thinking about it. You have the talent. I knew that before you got here. It's the other thing I wonder about.  Pressure. Changes everything. Some people, you squeeze them, they focus. Some people fold. Can you summon your talent at will? Can you deliver on deadline? Can you sleep at night?  Money's the easy part.  There you go, Kevin. The whole team. I'm trying to think how long it's been since we were all together. All of us. Too long. I'm looking around, I know some of you came from very far away to be with us here today. It's appreciated. This room we're in was built -- architecturally designed -- to promote healthy group dynamics. A psychic centrifuge. Makes you want to reach out, doesn't it? Inclusion. Commonality. Synergy. All that good shit. That's what I'm looking for today. Because when I hear stories -- the kind of stories I've been hearing -- about backbiting, about partners not working together, departments cutting each other's throats over clients, or worse... I feel drained. It drains me. I feel empty. I feel as though I've let you all down. We need something. A gesture. What do I need, Eddie?  Wait a minute. I got it. It's perfect. It's intimate. It's quick. Doesn't cost a thing. There's a power to it. What is it? Let's hold hands. All of us. Together.  Right now. Every person at this table -- take the hand of the person on either side...  You want out of this, Eddie?  You won't hold hands? It's important to me, Eddie.  See.   See, I feel better already.      Kevin, what can I say? Outstanding.  Best street food in the world. Try that. Tell me it isn't great. New York. What a scene, right?  Guy like Moyez living in that subterranean shithole all the time he's running around with fifteen million dollars in the bank.  What do you think? We're giving you away? He's paying us in goat's blood? I'm billing you out at four-hundred an hour, my friend. I don't see a whole lot of pro bono work in your immediate future. Seriously, what I like, you got in there with him. Inside the cage. That's instinct. Can't be taught. You gotta hear that on your own. It's gotta be in your blood. It's molecular. I bet I've got five thousand lawyers working around the planet. I couldn't name ten -- couldn't name three -- I'd trust with Moyez.  What are they doing? They're corporate lawyers, what do you think they're doing? They're busy reducing life and death to the proper position of a semi- colon. They're doing needlepoint. Push button battles. Push button wars. Armies that get so fucking far away from each other they need satellites to tell them who won. No pain. No sound. No smell. One big, multinational circle jerk. You, on the other hand, you're on the slaughterhouse floor. You can't help but smell your clients.  Maybe I did. But don't get too cocky. No matter how good you are. Don't let them see you coming. That's the gaff, my friend -- make yourself small. Be the hick. The cripple. The nerd. The leper. The shit- kicking surfer. Look at me -- I've been underestimated from day one. Do I look like a master of the universe? That's your only weakness as far as I can tell.  The look. The Florida stud thing. 'Scuse me, ma'am, did I leave my boots under your bed?'  You know what you're missing? What I have? This beautiful girl she's just fucked me every way she knows how -- we're done -- she's walking to the bathroom -- she turns back -- and there I am. It's me. And she smiles -- it's like a veil coming down across her face -- and that smile, that's a question mark, because she's looking at me, she's wondering, how did that happen? And see, right there, from that moment on, she's got a secret. I'm the hand up Mona Lisa's skirt. I'm the whisper in Nefertitti's ear. I'm a surprise. They never see me coming. That's what you're missing.  Because I knew it was gonna be good. Because I knew I was gonna like it. That you would shine -- that we would take this walk -- that we'd really talk. Why I came down? You want the truth? I'm an aging, hipster plutocrat. I came up from nothing. From dirt. I'm warming my hands on your talent -- Where's the chicken?    (back to Kevin, as    Better a hundred guilty men go free than a single innocent be executed.  No. Exactly like that. It's faith. You're either in or out. You can't believe a little bit.  You're not here to amuse me. See, that's why people hate lawyers. So many of us have lost our faith. Don't let that happen to you. Token?  Learn the subways, Kevin. Use them. Stay in the trenches.  Mary Ann? John Milton... I was hoping we'd meet tonight. And here you are, already swimming with the sharks.  You'd be surprised. There's a lot more fear in this room than you'd think.  Each other. Themselves.   Why? What scares you?  You'll figure that out. There's only one thing worth being frightened of anyway, and that's being alone. Truly and finally alone.  You know what terrifies me? Responsibility.  For what. For you. Let's be honest, I've changed your life. Changed it forever. There's been a seismic shift in your existence and I'm responsible. And you've never even met me. We're talking for the very first time. How insane is that?  Kevin. Please. I'm not worried about Kevin. He buys a few new suits. Learns a few new tricks. He's there. I don't worry about Kevin. What about you?  You must have family.  Whoaa... I gotta think about that. I had you down as daddy's little girl, you know? The princess. Sugar plum snapshots. Pastel bedspreads. Cinnamon cookies.  So you've got a lot at stake here. You've made a real commitment.  It's not gonna be like Gainesville, but then you know that already.  If it isn't, will you come to me? Let me help? I'd feel a lot less responsible. Will you do that for me?  The worst vice is advice, right? But can I make a suggestion? It's about your hair, some people are sensitive, that's why I ask.  You have shoulders nobody can see. Pull it back.  If I do it, everyone in this room that's pretending not to watch us will assume we're fucking or something. Pull back your hair. Take a look. See. That's it. Isn't that incredible? You need to cut your hair.  A woman's shoulders are the frontlines of her mystique. And her neck, if she's alive, has the very mystery of a border town. It's the no man's land in the battle between mind and body. You know, your natural color would really bring out your eyes...  You know what I see?  I see the future of this law firm. Christabella, cara, prestamelo per favore, pe lo riporto piu tardi.  Look,   we gotta talk. You grab Heath   and Eddie Barzoon and get up to   my place right away. And let's   be quiet about it.         How many hours did we bill Alex Cullen last year?  Alex Cullen has just been charged with murdering his ex- wife, her stepson, and a maid.  Just now. Tonight. I already sent Pam downtown to make bail arrangements.  No.    I want Kevin on this case.  I've shaken hands with every marquee defense attorney in town. I take Kevin and I don't look back.  I want you on board, Eddie.  We can get this case.   The man's our client.  We know him better than he knows himself. We have the inside track. We have the best damn trial lawyer in the city. It's ours to lose.  No.    That's up to Kevin.  That's Pam calling... Are we fighting for this, or not?  Alex, you know how this town works. You've got enemies you never heard of. And now? Now you're down? I'd prepare for a class-A, New York pig-fuck. You're going to have to ask yourself who you really trust. Who do you trust, Alex?  He's a winner, Alex. And they'll never see him coming.  Grab your coat, Mr. Lomax...  The night is young. Title fight. Ringside.  Do it on the way.  You write beautifully, Eddie.  Soon.  I don't micro-manage. You find the talent and then you delegate. Who knows what the hell Eddie's up to. He's got a lotta fingers in a lotta pies.  No.    I can hear you just fine.        I told him if he didn't leave us alone, you were going to kick all three of their asses.  You need a better lawyer.  Hang on a second... Meet my new heavyweight. Kevin Lomax.  Speak of the devil...  I was just telling the Moyez story.  And is this your mother?  John Milton.    Nice to meet you.  Mary Ann... I think you've met Christabella, and this is Giselle who's just in from Paris.  You've very welcome. This isn't really your first visit to New York, is it?  She can't believe you're his mother. You've done one helluva job bringing him up, Mrs. Lomax. I'm sure it wasn't easy.  Kevin, hang on... How's Cullen. Everything on beam?    You sure?  I'm taking you off the case.  I want you to drop this case.  Do you love this woman?  Kevin, she's sick. Everyone will understand. I'll understand.  We'll find someone new. You consult. You live to fight another day.  It's a disappointment. We all have them. Embrace it. Use it. You move on.  What's to talk? It's your wife, man. And she's very sick.    And that's gotta come first. Are you telling me the possibility of leaving the case has never crossed your mind?  I guess you have thought about it. I stand corrected.     Was he drunk?  Eddie's gotten himself into trouble again. And he wants me to save him. And I can't.  Do you have any experience with manic-depression?  You do now.  Yes, it's me. Get Eddie Barzoon. Right away. He may be out running, so page him if you have to. It's an emergency. Looks like you could use a drink.       I'll tell you, Kevin, because I know you're into theology. When you've seen -- when you've represented -- when you've dealt with as many people as I have over the years, finally you say to yourself, 'God must've been awfully bored.'    You take a look at Eddie Barzoon you gotta wonder if maybe God overplayed his hand. Maybe he made the game a little too interesting...    You take a look at Eddie Barzoon you gotta wonder if maybe God overplayed his hand. Maybe he made the game a little too interesting.  I want you to put Eddie aside. Let me worry about it. You gotta deal with Cullen now. Marshal your strength. Prioritize. Conserve your energy.  What choice do we have?  Because she didn't answer you fast enough? Did she lie to you? No. She said nothing. The fact is, you'll never know.  You really believe that?  Look, you gotta go with your gut.  I'll back you either way. Hey, you think I haven't lost before? We talked about this, Kevin. Pressure. Take a big whiff.       You're right about one thing... I have been watching. Couldn't help myself. Watching, waiting, holding my breath. But I'm no puppeteer, Kevin...  ... I don't make things happen. Doesn't work like that. Free will -- it's like butterfly wings -- one touch and it never gets off the ground. I only set the stage. You pull your own strings.  A gun?   In here?  On a scale of one to ten, ten being the most depraved acts of sexual theater, one being an average Friday night run-through at the Lomax household, I'd say... Six.  Whoa... Got me! Damn! That's my boy. Step on up! Stay angry! Keep hold to that great fury! Hang on tight, Kevin, because it's the final fig leaf.  Never lost a case. Why? Why? Because you're so fucking good? Yes. But why?  Well, I'm a little more than that. Awful hot in that courtroom, wasn't it? 'What's the game plan, Kevin?' 'It was a nice run, Kevin. Had to close out someday.'  I have so many names.  Call me Dad.  Come on. You're not listening. Blaming me for Mary Ann? I hope you're kidding. You could've saved her any time you liked. She only wanted love. But you knew it wouldn't really work out, didn't you? Mary Ann in New York? Face it, you started looking to better- deal her the minute you got here.  Hey, it's not that you didn't care for her, it's just you were a little bit more involved with someone else. Yourself.  Bio-chemically no different than eating large quantities of chocolate. Don't be such a fucking chump. There's only one real sickness in all of creation and that is self- delusion. I told you to take care of your wife -- that the world would understand. And you made a choice. 'You know what scares me, John? I leave the case, she gets better and I hate her for it...' Remember?  Who told you to pull out the stops for Mr. Gettys? And Moyez -- the direction you took -- Snake handlers, Popes and swamis all feeding at the same trough -- whose ideas were those? And then Cullen -- knowing he's guilty -- seeing those pictures -- putting that lying bitch on the stand... What did I say, Kevin? Maybe it was time to lose, right? You didn't think so.  Exactly! Vanity is definitely my favorite sin. Self love. It's so basic. What a drug. Cheap, all-natural, and right at your fingertips. Pride. That's where you're strongest. And believe me, I understand. Work for someone else? -- Hey, I couldn't hack it. 'Better to reign in Hell than serve in Heaven.'  What do I want? I want you to be yourself!        I've had many children, Kevin. So many disappointments. Neurotic, indecisive wannabes. Over-eager, ham-handed butchers. Strung-out, priapic losers. And then there's you. Your mother, I'll tell you, she outstripped my wildest fantasy. That church she dragged you to? Every day? What training. What a challenge! It's awesome what you've done. How far you've come. Both of you... You and your sister.  Half-sister to be exact.  What do you think, Kevin?    What a scene, huh?  Wait till you meet her mother.  No. That's the other guy. I don't judge anybody. As far as I'm concerned, everyone's a winner.  God's your prankster, my boy. Think of it. He gives man instincts. He gives you this extraordinary gift and then, I swear to you -- for his own amusement -- his own private, cosmic gag reel -- he sets the rules in opposition. It's the goof of all time. Look but don't touch. Touch but don't taste. Taste but don't swallow. And while you're jumping from one foot to the other he's laughing his sick fucking ass off! He's a tight-ass. He's a sadist. He's an absentee landlord! Worship that? Never.        I'm here, on the ground, my nose in it since the whole damn thing began. Why? Because I worship man himself. And it's my time now. Our time.  Eddie was right. Your name is on the partnership charter. I want you to take over the firm. You and your sister.  No. She's ovulating. Right now.  Your vanity is justified, Kevin, you're the seed to a new future. Your son will sit at the head of all tables. You hold a special place in the history of all things.  I want a family.  Whatever...  Free will. It's a bitch. I need a family. I command an ever larger presence on the board. I'm busy and I need some help. There's a plan here. I've been conserving my energy. Synergy. Prioritize. It's the millennium, Kevin. Title fight. Round twenty. I'm ready to work.  Are we negotiating?  Yes!  Everything. Anything. All of it! What am I offering? I'm offering bliss. Instant bliss. Bliss by remote control. Bliss on tap. That first line of cocaine. That walk into a strange girl's bedroom. The jury coming back in thirty- eight minutes. Freedom. Revolution! Viva la causa!        Don't be too hard on yourself.  God, she's just fucking stunning, isn't she?  Like that's wrong. Like there's anything wrong with that. That there could be laws preventing something so natural. That's our ticket in. Did you know there were more students in law school right now than lawyers walking the Earth?        We're coming out, guns blazing. The two of you -- all of us -- acquittal after acquittal until the stench of it reaches so high into heaven it chokes the whole fucking lot of them! What we cannot legislate we will buy. What we cannot buy we will degrade. We will blow every fuse of enlightenment until it looks like a vandalized, neon sign! And while God is busy at his peephole -- as he deigns us with his disapproval -- as he lumbers around his empty kingdom like some overfed colonial governor -- as God sleeps late, we will win. We've got a winner here, kids!  Consider the source.        She's right, my son. It's time to step up and take what's yours.  Nooooooo...!",
        "Meisel": "Do you think as a juror you'd be able to set aside any prior opinions you might hold about the savings and loan industry? That was a question, sir.  Your Honor, may I have a minute to speak with my colleagues.  Number six? You're kidding, right? She's my first choice.  And eight? With the dreadlocks? That's crazy. He's a defendant juror if I ever saw one.  Look, kid, maybe down in Florida you're the next big thing, but this is New York. Manhattan. We're not squeezing oranges here.  She's a Catholic schoolteacher. She believes in human frailty.  How the hell do you know that?",
        "Kevin": "Any chance, Your Honor, for a short recess?  Lloyd, as your attorney, I'm advising you to get the fuck away from me.  The wife. The kid. The outrage. You definitely had me fooled.  You know what I'm thinking? Why don't we put you on the stand and you can jerk off for the judge.  Get the hell out of my way.  Not now, Larry.  Fuck off.  Math hasn't exactly been your subject this year, has it?  Any theories on why you've done so poorly in math this year?  Would you say Mr. Gettys is the problem? You're not sure. Have you had any discipline problems in math class this year?  No? Isn't it true Mr. Gettys has had to talk to you repeatedly about your behavior? Isn't that why he asked you to stay after class?  Have other teachers ever asked you to stay after class?  Did they want to talk about your behavior?  Goes to motive.  You ever pass notes in class, Barbara? Maybe a note that made fun of Mr. Gettys?  No? Never called him a 'disgusting pig monster'?  Your Honor, I've pre-marked this Defense Exhibit A...  (right to  You wrote this in his class.  'He's a huge hog beast. He probably eats a thousand pancakes for breakfast.' You're writing here about Mr. Gettys, aren't you?  Have you ever had a party at your house when your parents were away? Yes or no?  Credibility and bias.  The word special came up in your testimony earlier. You claimed that Mr. Gettys asked you whether you had special feelings, if you felt special. Have you ever heard of a game called 'Special Places?' You're under oath, Barbara. A man's career -- his reputation -- his life is on the line. This is not a joke. Have you ever played the game Special Places?  Is this game sexual in nature? Is this game sexual in nature?  This special party, Barbara, this was the first time you told the story about Mr. Gettys.  I've spoken to the other children who were there that day. Can you think of anything else, Barbara, they might have told me about that party?    You threatened those children, didn't you?  You told them to falsely claim that Mr. Gettys had hurt them, didn't you?  Because if they didn't go along you were going to tell everyone about this special party.  So you made up a story. A special story, about a math teacher -- a disgusting pig monster -- you didn't like. That's what really happened, isn't it?  I have no further questions, Your Honor.  I'll drink to that. No shop talk.  Milton, Chadwick, Waters. Never heard of it. What're you gonna do? Sue me?  From New York.  I've had some sympathetic juries.  Really. I'll tell you, man. You're pretty damn good. And the card is great. And the black thing -- you being black -- whose idea was that? Paul's? 'Cause that's just brilliant. I'm just not drunk enough yet to fall for it.  It's two weeks at most.  Every dog gets a day.  Mom.  Look, how you fixed for cash?    Mary Ann typed out the numbers for you -- phone, the flights -- it's all in there.      'Thou mighty city. In one hour hast thou mighty judgement come.'  -- wait -- leave 'em off --  -- close your eyes -- do it --  Okay.    Stop.  Okay.    Open your eyes.  'Go ahead...' '... bite the Big Apple.'  I don't know... looks to me like that dress is in your way.  No, ma'am. In fact, I hardly ever think at all.  Dump him. While you're at it let's get rid of number six, eight, and I'd say lose number twelve, except the prosecutor's gonna fuck up and do it for us.  She's my first pass.  You see his shoes?  He polishes those shoes every night. He makes his own clothes. He may look like a brother-with- an-attitude to you, but I see a man who's got a shotgun under his bed and woe betide the creature who steps into his garden. And number six? Your favorite? She's damaged goods.  No. There's something missing from her. She's wrong. She wants on this jury. Somebody hurt her and she wants revenge.    Every now and then she gets one right.  They deliberated for thirty-eight minutes.  Yeah.   Except one.    Thirty-eight minutes.     My jury.  Put on something that's gonna be easy to take off later. We are going out, girl!    No.  Please. Kevin Lomax.  Nice to meet you.  Very well.    Thank you.  She sure has. It's been great. The whole thing's been great.  I couldn't say.  Out of law school. Five years in the Jacksonville D.A.'s office.  I like to be in court.   I didn't plea out a lot.  Takes a little getting used to.  Yes it does.  Prosecutor dropped the ball.  I didn't say that.  How's this? I began the case with a clear conscience.  The men's room. Upstairs men's room in the Duval County courthouse. There's a hole in the wall. Straight through to the next room. I spent five years listening to juries deliberate.  Love it all you want, just don't repeat it. I'm not sure the Florida Bar Association would appreciate it.  It's peaceful.  I never got to know my father. He passed away before I was born. My mom raised me. Just the two of us.  She wasn't married the first time.  I don't think it's easy anywhere. Holy shit...  She's a preacher's daughter. She's tough. She's worked in the same poultry plant for as long as I can remember. I think she's up to eight-fifty an hour. She's got a church she really likes, so she's usually either there or they go out, they do a lot of volunteer work.  So they say.  I'm on parole.     Early release for time served.  You don't have to sell me on New York.  Are we negotiating?  Why do you need a criminal department?  Are you offering me a job?  What thing is that?  When do we talk about money?  So it's just two apartments per floor?  I sure as hell hope so.  Look, Mare, I'm only getting behind this if you're on board. You want to go home, I'm with you.       The Moyez case?  I'm looking for Phillipe Moyez.  I called this morning, I'm not sure who I spoke with. I'm his lawyer. I have a card... They said he would meet me here. Phillipe Moyez.  Look, I'm not sure I'm making myself clear here.  You're saying he's down here? In the basement? In the dark?  Mr. Moyez? We've never met. I'm a lawyer. I'm here about the animals.  I'll be arguing your case with the city. I need to ask you some questions. I've done a little preliminary research -- precedent -- cases in the past that dealt with Santeria and Vou--  Okay.   Is there a name?   Or...  Okay.  I'll get right into that. The animals. Let's start with that, then.  Look, Mr. Moyez, I'm going to need your help with this.  Perhaps we could start at the beginning?  Mr. Moyez?    What are you doing, Mr. Moyez?         It's a health code case. And it's a loser. So what's the point? It's a test, right?  The smart thing to do is make a deal. Plea him out and suppress the tape.  Yeah, well, let him wait. And you can tell Milton too. I didn't come to New York to plea bargain.        That's a veal roast, Your Honor. U.S.D.A. approved and stamped. Eight days ago, in Kansas City, two men pushed a calf into a steel frame as a third man fired a high- voltage staple-gun into the animal's skull. Men kill animals and eat their flesh. Phillipe Moyez killed a goat. He killed a goat. And he did it at home, in a manner consistent with his religious beliefs. Now some people may find it bizarre.  It's certainly not a religious practice performed by everyone. It's not as common as, say, circumcision. It's certainly not as common as the belief that wine is transformed into blood. It's not even as common as the handling of poisonous snakes to prove one's faith. But Phillipe Moyez isn't two thousand miles away in a stockyard. He doesn't use electricity to kill. And worst of all... Phillipe Moyez is not shrink- wrapped.  Your Honor, the city timed this police action to catch my client exercising his constitutionally- protected right to religious freedom.  Exactly, Your Honor. And I'd like to move at this time for an immediate directed verdict for dismissal.  I'm aware of that, Your Honor, which is why I feel confident in requesting a dismissal.  You gotta be kidding.  So what the hell are they doing?  I figure you came to court to make sure I didn't fuck this up.  What's that?  Never worked a jury didn't have a woman.  So why did you come down today?  What?  I believe in the presumption of innocence.  Something like that.  I was kidding.  Excuse me?    What's all this?  You can handle this.  Something nice.  Promise.  Instinct.      Excuse me?  Sorry?  Sort of. Not exactly. I'm about twelve floors down. What about you?  Sounds like fun. Downtown, I mean. I'm just getting to know the city.  More.  Amen.  You mean, tonight?  I doubt it.  Excuse me?  Depends on the view.  Is there more to it?  And a bedroom?  Where does he sleep?  Where does he fuck?  Look, I appreciate the vote of confidence, but maybe Eddie's got a point here.  Stop. Reset. I'm upstairs, I'm with Milton and Barzoon and there is a very good possibility that I'm about to catch a triple homicide defendant who also happens to be the largest real estate developer in the city. I had to bail on the party!  Mare... did you hear me?  For three whole hours... You gotta be kidding, right?  You don't have time to shop, Mr. Cullen. Jury selection started this morning at every breakfast table in the city. You lost round one. This is what people know. They know you and your wife were living separately. They see this maid -- Elucinda -- a sixty-eight-year-old grandmother supporting seven children. And then there's your stepson, a ten-year-old with a bullet in his brain. Those are already powerful images in the mind of the public.  I'm telling you how it looks. You discover the crime. You call it in. You've got blood on your person and clothes, and -- -- and -- your prints are on the murder weapon.  There's a second print in blood -- it's a partial of a hand -- on the wall next to th--  We need twelve people who can see past all that. I'd get out in front of this fast.  You're not happy tomorrow? The next day? We'll move over. But right now -- this moment -- you need immediate representation.  We need to issue a statement.  ... first thing -- I need this ASAP -- I want articles, clippings, TV interviews, I want everything you can get on Alex Cullen.    Guilty.  Thank you.  What if I win?  Any advice?  I'll keep it in mind.  What a relief. I was starting to think you were perfect.  You just left them in the store?  Look, calm down, all right? Listen to me... Mare? First, you do this radical thing with your hair...  Stop. I think it's fine. But I also think it's traumatic. You've got the pressure of fitting in with new friends, a new place... add three bottles of wine and --  What about Kathy?  Oh, and that's got nothing to do with it...  What about the apartment?  Let's make a baby.  I wouldn't do that. Unless you asked.  Right here.  ... because it needs to be clear, Mr. Cullen, because I need to understand exactly what happened -- you're standing there -- you look down -- there's the gun --  You kneeled down to pick it up?  Back up. Two prints by the gun. Right knee. Right hand. It's a strange move you must've made to pick it up.  I'm trying to picture it... Your hand came from inside and underneath.  Whose gun is that, Alex?  Are you out of your mind? You're charged in a triple homicide, you're walking around with a forty-five?  Give it over.    Now. Gimme the gun.  That's my job. When the case is over you can have it back. This is a dealbreaker, Alex.  Okay.   Let's wrap it up.  We need to talk to your assistant.  You feel confident she'll back you on the time.  So we're going to talk to her and you're not going to talk to anybody. Okay?     We need her to establish the time you returned home.  Tell you what, Melissa, let's talk to her first. See where she stands and take it from there.  That's why we're all working so hard.  I thought I was the only one working late.  Good news. We just wrapped up with Cullen's assistant. She looks like a great alibi.  But it looks like you have your hands full.  Who would ask?  Who's that?  Sorry.  I'd have to call Mary Ann...  So what's this Weaver Commission?  Oh, shit. John...  What did you say to him?    And say what? He's the senior partner at the -- Mare, you're really starting to piss me off -- Yes. I'm having one cigarette. You want me to lie? One cigarette after seven months is not -- That's exactly what I'm saying. Go to bed. I have no idea. I told you, he never sleeps. Mare. Stop. The guy pays our bills. The food, the heat, the rent on that enormous fucking apartment we live in. I live there, too!    This transition, it's been really tough on her...  I've gotta find Cullen. We just got the prosecution discovery package.  That's what they all say.  Your wife, the day she was killed, had lunch with a friend. She says and I quote: 'Alex is fucking around and I can prove it.'  Wrong answer. Your prenuptial agreement is on file at the firm. The contract is null and void in the event of marital infidelity. You fuck around, she gets rich. That's a motive, Alex. What do I need to know?  And, on the night in question?  I've got to re-interview Melissa.  Juries want honesty.     Fuck with that at your peril.  Arthur...  Welcome to Babylon, Ma.  Really.  Yes.   Mom, this is...  Thanks for the champagne.    Mom, we're here...  That's a long conversation.  Now?  Let's talk tomorrow.  What are we talking about?  That's ridiculous.  That's not a fight, Ma, it's marriage. Not exactly your area of expertise.  What?  You're kidding, right? Am I happy? Every now and then I look around and I think my mama must be praying awful hard for me, 'cause I died and went to heaven. Am I happy?  I guess I finally got there. Look, I'm sorry about being so busy this week. Maybe Saturday I can get some time off and...  I love you too, Ma.  Shit!  Mom?    Ma, what are you doing?  What?   What are you talking about?  You just got here. Look, I'm late and I just got my teeth kicked in on the front page, so I gotta run. We'll talk later.  Ma, this is New York, there must be twenty-thousand goddamn churches. Take your pick.  So stay. Take care of her if you're so concerned! Help me out.  This is home. You understand? This is where we live! I'm not going back to Gainesville. Unbelievable.  It's a little early for scripture. I'm going to work. You can do whatever you want.  We have to bring it out, Melissa.  A man's life is at stake.   You're our whole case.  Busy.    I'm in the middle of a meeting. Call my office. Schedule an interview. Or else forget it.  I'm picking a jury tomorrow.  You're not gonna have time to help me on Cullen, are you?  Tell me this is the medication.  Look, let's get you undressed and in the tub. Okay?  Okay.  I'm confused. Why? What is it now? What the fuck is it today, Mare? I swear to God, I'm calling this doctor, I'm gonna find out what the hell they're giving you.  What are you talking about?  Says who?  That's ridiculous.  Mary Ann...  Uh huh. For sleep. And she can take that during the day? No, she won't be driving. I'm gonna have the pharmacy call you right back. Thanks. He thinks, he's not sure, he thinks it could be some kind of hormonal imbalance.  What?  This case? Cullen? John, I've got a jury showing up this morning.  Yes.    Of course I do.    I put together a great jury.  Hang on, we gotta talk about this.  You know what scares me? I quit the case. She gets better. And I hate her for it. I don't want to resent her, John. I've got a winner here. I gotta nail this fucker down, do it fast, and put it behind me. Just get it done. Then put all my energy into her.  If it's a choice, I'll go now. I won't be as long as Mr. Broygo.  We just spent our morning listening to Mr. Broygo talk about his 'evidence'. What he neglected to tell you is what this case is really about. He left out the most important fact of all: Alex Cullen was somewhere else when these murders took place. Now, Alex Cullen has done a lot of things I don't like. He's been a terrible husband to all three of his wives. He's been a destructive force in the lives of his step-children. He's cheated the city. His partners. His employees. He's paid hundreds of thousands of dollars in penalties and fines over the years. I don't like those things. I don't expect you to like them. There will be other things during the course of this trial that you will hear about and like even less. But this isn't a popularity contest. It's a murder trial and Alex Cullen hasn't killed anybody.  The state is going all out here. They've got a whole team over there. They're throwing everything but the kitchen sink at this case. I need one thing from you. That's it. One thing. I need you to ask yourself, 'Is not liking this man reason enough to convict him of murder?' Enjoy your lunch. We'll talk again.  Listen to me like you've never listened to anybody before. I'm going to bust my ass to make sure they hate you. Because as long as you're out boning Melissa, you're not home killing your wife.  Then it doesn't look spontaneous.  Let me put it this way, then: can you tell from a blood sample if the person were alive or dead?  And there's a two hour window in which to place these murders.  So, you've got absolutely no way to determine the condition of the victims when Alexander Cullen put his hand on that wall.  Eddie...  What's up?  It's not over yet.  What are you talking about?  What?  I don't know what you're talking about, but I sure as hell don't like your tone of voice.  You got a problem with documents, I suggest you put together one of your late-night shredding sessions.  I doubt it. He was going running. What the hell was he talking about?  Why does he think I'm after his job?  Not directly, no.  I'm gonna, I'm gonna go downstairs now. Put this stuff away. Ice cream's already melting.  You testified that the defendant called you at four-thirty to ask you to come to his office gym for the purposes of sex.  Mr. Cullen, though, he's not just your lover, is he? He's the boss.  So two hours go by before you act on his request?  Okay.  Stop. This prosecutor is no fool. He's gonna change tempo, attitude, tone of voice -- he's gonna come out with questions you never thought of, just to screw you up. So what do we do?  Exactly. Is it your testimony, Ms. Block, that between the hours of six-ten and nine-forty you were engaged in sexual congress with the defendant?  At any point during this three hour marathon, Ms. Block, did you lose sight of the defendant?  Did he use the bathroom?  Is he circumcised? You understand the question?  So is he cut or not?  Which is it?  You've been polishing his knob three times a week for six months and you don't know whether or not he's got foreskin?  What's happened?  What about him?  When?    I can't put her on the stand.  I know she's lying.  He killed those people.  Cullen set me up. Melissa, the whole thing, I know it.  That's your advice?  I call Melissa Block.  Where is she?  Honey... Mare. It's me.  Who?  Who let himself in?  Did somebody hurt you?  What?     When?  Today? Today? Today. He was in court, Mare. He was in court, in my presence all afternoon!  I don't know, Mare. I don't know how much more of this I can take.  They want you to go to sleep.  They don't know. It's bad.   She's falling apart.  No comment. I'll have something for you later.  Staking out the funeral?  I'm in a bit of a hurry right now. I need to talk to my wife.  He's a lawyer! What the fuck do you want? Stay off my back.  What are you doing here?  I just... I don't know.  I was gonna call you, I just...  There's nothing you could've done.  About what?  When?  What are you talking about?  Wait.   Stop.  Oh, this is great, Ma... this is just perfect --    -- obviously I'm not under enough pressure -- I don't have enough on my mind, I need this little --  Why are you doing this now?     Mare! -- Look at me! -- Stop! -- right now -- Mare! --  (through  -- Mare! -- No! -- Look at me! --  -- Stop! -- No! -- Mare! --  -- Mare! -- Hang on! -- I'm almost there! -- Look at me!  Noooooooooo!  Oh, God, Mare, what've you done? -- no...  -- no, Mare -- hang on -- please, Mare, I'm right here, it's gonna be okay, baby -- oh, God, Mare, why did you do this? -- Where's the fucking doctor?!  What are you doing? Help her!  -- please, baby, stay with me... it'll be okay -- it's gonna be fine just, just stay with me -- Oh God, Mare... please, baby...  Finish the story. Nineteen-sixty-four. You're in New York. There's a waiter in a restaurant. Finish the story.  I want to hear you say it.  Say it.  No.  He's always been there. I know that now. Watching. Waiting. He's been playing us like a game. Jerking us around. Destroying Mary Ann...  I gotta go.  I can't do that. You go home. Pray for Mary Ann.  What did you do to Mary Ann?  What did you do to my wife?  Who are you?  Because you're my father.  Who are you?  Satan.  Mary Ann, Barzoon, Weaver...  That's a lie.  What the hell do you know about love?  You set me up.     It's entrapment.  That's my job.     That's what I do!  What do you want from me?  It is a test, isn't it? The whole game, you sitting there, keeping score.  This is some pitch. You must need me pretty bad. What do you want?  Is that it?  What?  You want a child.  The Antichrist.  But I have to volunteer.  So what are you offering?  Always.  What are you offering?  You're right, aren't you? About me. I mean, I made all the choices, didn't I? Gettys. Cullen. Mary Ann. I did kill her, didn't I?  You're right. I wanted to fuck her from the minute we met.  In the Bible you lose.   You're destined to lose.  You're right.    It's time.  Your Honor, I'm terribly sorry, but I can no longer represent my client. I need to be replaced as counsel.  There is no story.  They're gonna disbar me, Larry. You can cover that.  Call me tomorrow.",
        "Lomax": "You've never been to New York.  Pick a jury... I feel the hand of Mary Ann on this adventure.  New York is not a good idea.  I have my bad feeling.  Sounds like more than two weeks.  Let me tell you about New York.  Forewarned is forearmed. 'Fallen, fallen is Babylon the great. It has become a dwelling place of demons.' Revelation Eighteen. Wouldn't hurt you to look it over.  And what happened to Babylon?  'And the light of a single lamp shall shine in thee no more.'                                                                           What's he doing?  Always did like to stick his nose in a camera.    I surely did. Are you hungry?  Alice Lomax.    How do you do?     No.  Yes.   Good night to you.     'Night.  I'm worried about her. You shouldn't fight like that.  Are you happy here?  Are you happy here?  You were always running somewhere.  Don't worry on it. I love you more than anything in the whole world. You know that, don't you?          I'm going home, Kevin.  I don't feel right.  I have to go, Kevin. I miss my church.  You need to do a better job with Mary Ann. She's not well. This place isn't good for her.  I'll take her home if you let me.  'Wide is the gate, and broad is the way that leadeth to temptation.'              Kevin... honey...  I came this morning. I been calling the house and getting no answer and then I spoke to Pam and... I need to talk to you.  Are you all right?  Will you excuse us a moment?  I never should've left. I knew it. I'll never forgive myself.  What I did, Kevin, I thought it was for the best. Loving you was always first for me.  I could've told you the truth.  I've lied to you, Kevin.  Always. Baptist Endeavor Youth Crusade, ninety-sixty-four. I was here. In New York. That night in the elevator, you never let me answer.  We stayed a week. The Tremont Hotel, it's not there anymore, I went by and it's gone -- they had a restaurant downstairs and we ate there almost every meal --  Your father was a waiter in that restaurant.  -- honey, listen to me --  -- Kevin, honey, wait --  Listen to me.  Because I'm afraid!  Kevin.  Kevin! 'Behold I send you out as sheep amidst the wolves.'  What's going on?  Kevin!  -- Help! -- Help! -- Somebody!   We need help --    I could've packed that up for you.  I wish you'da let me help you.  He talked to me. Nobody'd ever really talked to me before. Sixteen years old, a thousand miles away from home, somebody takes an interest... Working so hard, putting himself through school, I'd never met anybody like that. Knew the Bible, every word, just knew it by heart. Every meal, there he was, at my ear and I just... I didn't want that week to ever end. But it did. He came to say goodbye, it was late, and I started to cry and he said not to worry, 'Behold, I send you out as sheep amidst the wolves.' And that just stopped me cold because we'd spent that whole day at Bible study reading Matthew Ten and there was just no way for him to know about that, so I was... I took it as a sign. I let him in. And then everything was different. He was cruel. He was so cruel and I was so ashamed, I thought I'd die...  I promised right there if God would let me back into His grace I would never leave again. I prayed there was a reason this terrible thing had happened. There had to be a reason. And there was. It was you. You were my blessing. You were reason enough to endure anything. How much I love you.  His face -- that night -- I knew it was him and the same time I was confused -- and you were so proud you'd come to New York and done all this on your own, I didn't have the heart to tell you --  (desperate  (there it is,  What do you mean?  What are you doing?  No... let it alone! Stay with me. Forget about him! We can leave here. We can go home! We don't ever have to see him again!  Kevin, please... Honey! I love you!",
        "Leamon": "",
        "Heath": "Mr. Lomax?  Helluva job today. I didn't want to disturb your party.  Actually, we were hoping to retain your services. We've been following your progress.  You've never lost a case.  That's exactly what we're looking for. We want you to come to New York. Help us pick a jury.  You'd have to start next week. All expenses. First class travel and lodging. You and your wife. A lump sum payment, regardless of verdict in the amount of, well... Here. Take a look.  Walk.  Sorry to keep you waiting, but Mr. Milton got pinned down in Indonesia a little longer than expected. Not bad, huh? You can play it cool if you want, but the first time I walked in here, my jaw was on the floor.    He's got you scheduled for fifteen minutes, which is a good sign, so make the most of it...  Gotcha. Man, I just love that...  I watched a Senator piss his pants right where you're standing.  He's waiting for you.      Good luck.  Mt. Sinai Hospital right up the street. Some excellent schools.  I doubt it was at the top of his list when Mr. Milton bought the building, but it's a great neighborhood for children.  Right here.  I thought I'd let it speak for itself.  It's what they call a classic eight.  I need to warn you about one thing. There are going to be some very envious people at the firm. These apartments, there aren't many of them, it's really a partner's perk. You must've made quite an impression.  What do you think?  Kevin Lomax.   Pam Garrety.     Who said he sleeps?  Sixteen thousand, two hundred and forty-two.           Relax.   We've all been there.  We're gonna find some names for you. Doctors. Good people.  Last night in the park. He was running if you can believe it.  At least they got the scumbags who did it.",
        "Melissa": "Would my babysitter have to testify?  She doesn't have her green card is why I ask. I don't want her to get in trouble.  Mr. Cullen didn't kill those people.  I can't do it. It's one thing to have an affair with your boss, it's another to have to tell the world in a murder case.  My ex-husband would have a field day with this.  Yes.  Yes.  Yes, I went up at six-ten. I knew it was six-ten, they had weather coming on the news. I remember --  Yes and no answers. Stay calm.  Yes.  No.  Yes.  Yes.  Yes.    Are we through here, or what?",
        "Black": "",
        "Eddie": "",
        "Barzoon": "Eddie Barzoon.     Managing Director.  How about a public flogging?  You've made your point, John.              Be gentle, honey. These are normal people.  Your first?  Is this your first marriage?   Front door -- abuzz -- Milton has just arrived. DEVIL'S ADVOCATE - Rev. 11/2/96                            48.                 Kevin standing at the rail.    He looks over.   Christabella not ten feet away.            Just this room.  No bedroom.  What's up, John?  What the fuck did he do now?  When did this happen?  They'll fucking crucify him. They'll get in line. I gotta call Meisel...  I hope you're kidding. Alexander Cullen in a Manhattan triple murder? With Kevin? You're dreaming.  You're a great judge of talent, John. You're the master. I just don't see it coming together.  He's a business client.  Tell it to Cullen.  He's right, Alex. People need to hear these things.       So did we.  What a pleasant surprise.  Just a little housekeeping. If they ask, you never saw this.  Weaver.  Justice Department. Weaver Commission. You don't know about Weaver?  How nice for you.    We need to talk.  I hope so.  Can't turn over what you don't have, Your Honor. We've been conducting a comprehensive search of our records and I'm sorry to say it's a great deal less than Mr. Weaver would suggest.  Your Honor, it's exactly these types of insulting accusations --  Forget about lunch. This guy Weaver is running me ragged.  You're good at that.  No.    Saw you go in.    I'm not talking about the trial.  How the fuck does your name get on the firm's charter?  Looks like it's been there for years. Now you're a partner? When did that happen? I am still the managing director of this firm. You want my job? Take me head on. Backdoor me one more time and I'll take your partnership papers and stuff 'em down your throat.  Bullshit.  You think you're tough enough to run this firm? Fine. You tell Milton next time Weaver calls maybe I pick up the phone.",
        "Alexander": "",
        "Cullen": "\"The Next Great Address\"  ... Look at this, I'm not out twenty minutes, we're running from the goddamn press. Look at those insects down there...  ... You may be right, but look at it from my point of view. I'm sure he's a whiz kid. I believe you. But this is my ass we're talking. Jesus, Eddie...  I don't know... I gotta look around.  I didn't kill anybody.  How do you know that?  I have keys! I called the cops from the house! I touched the goddamn wall! I was panicked! I panicked!  I panicked! Is that a crime?    I touched the wall!  I've got a fourteen-year-old stepdaughter who I care more about than anything in the world. They won't let me call her from downtown. They won't let me talk to her after I'm out. I gotta go deal with that first.  I'm gonna make some very tough phone calls. Then I'm gonna take a pill and try to get some sleep. My place. Eight A.M. tomorrow. Alone. And you better be every fucking inch as good as you think you are.     I don't know why I picked it up -- it was before I saw Elucinda's body and then, I mean we've been over this...  You work late. You come home. You walk in. Everybody's dead. It's not something you plan for.  The blood, I don't know, maybe I was trying to avoid the blood.  You want to see? Here... I'll fucking show you.    It's mine.  I've had nine death threats.  I gotta protect myself.  So what's next?  Call her.  Melissa, yeah. She's okay.     She's a real straight arrow.        I get one supervised hour a week with my stepdaughter. This is it. You better have a great reason to call me out.  Hearsay.   Never gets in.  Melissa. My assistant. She's not even that good a fuck.  I was boning my assistant while my wife was getting shot.  Forget it.    We're not telling that story.  Allesandra.   Wait...  Not now.  Allesandra.   Please...        What the fuck was that? Are you out of your fucking mind? They fucking hate me!  (pause, as he warms"
    },
    "imdb_rating": "7.5",
    "description": "Kevin Lomax, a ruthless young Florida attorney who never lost a case, is recruited by the most powerful law firm in the world. In spite of his mother's disagreement (she compares New York City to Babylon), he accepts the offer and the money that comes along. But soon, his wife starts feeling homesick and seeing devilish apparitions. However, Kevin is sinking in his new cases and pays less and less attention to his wife. His boss and mentor, John Milton, seems to always know how to overcome every problem and that just freaks out Kevin.Steve Richer <sricher@sympatico.ca>",
    "name": "The Devil's Advocate",
    "genres": [
        "Drama",
        "Fantasy",
        "Mystery"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BM2M2MDJhMDgtMmJkYy00MTgzLTkyZTktODM5NzE1MWUyNDA4XkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_QL75_UY281_CR4,0,190,281_.jpg"
}