{
    "filename": "Disturbia_script.txt",
    "imdb_id": "tt0486822",
    "imdb_url": "https://www.imdb.com/title/tt0486822",
    "characters": [
        "Kale",
        "Mrs. Carlson",
        "Detective Parker",
        "Greenwood Boy",
        "Mr. Turner",
        "Ashley",
        "Julie",
        "Ronnie",
        "Officer Gutierrez",
        "Mr. Carlson",
        "News Anchor",
        "Daniel Brecht"
    ],
    "dialogues": {
        "Kale": "Whoa, did you see that thing?  Holy shit!  I need reinforcements!  (laughing; pulling;  He's freakin' pulling us in!         Yes, be gone with the red meat!   I think so.  Oh my God, dad --  I can't -- It won't give --     Dad, here --  Dad, please, you can do it --  No -- I'm not leaving --  NO -- Dad, please, I've got you --  Este invierno --  Este verano -- voy a --  I don't know, alright?    I haven't gotten that far.        The execution squad shows up?       Hobby, Jet, you guys still there?     I got nothin'.  What, so he can tell me I'm ADD, have PTSD, and severe IAD?                          And your point is?  You canceled my Xbox subscription.  That might be difficult.  That's a little dramatic, isn't it? I'm just gonna plug it back --  What are you, mental?  Yes!               Give me some details, what's happening out there?  Wait, Ronnie -- Hello?         I'm coming!!     Oh shit!   Shit water shit!     You think that's funny?    Not before I shove this shit up your ass!  Shit!  Turn green turn green turn green...     No, c'mon, I'm way inside, turn green --  Yes!   That's what I'm talking about!  It's cool, I'm all green.                 Hey doggie, come here...             The world right outside the window.     ...Mrs. Pilch... saying goodbye to Lonnie...    Four o'clock every Thursday, she goes to the country club to play tennis with Betty Big-Bangs there.  And... ladies disappear... cue white Mercedes... Mr. Pilch... arriving from the office...    He can't. We don't have any lights on. Plus the angle's sharper from ground level, it only seems like he could see us. I did the math.  Optical illusion, line-of-sight doesn't apply to the subject.  Now tilt your gaze up...  WINDOW - Lonnie vacuums as Mr. Pilch enters the room behind him. Mr. Pilch flips off the light switch, cutting the power to the vacuum. Lonnie startles, turns around, sees Pilch standing there with the flowers and a big smile. A beat, then -- Lonnie jumps in Pilch's arms, kissing him passionately.  C'mon, there's more.  No, stalking's for psychos. These are just simple observations... natural side effects of chronic boredom.       He's lived there a couple of years, but I've never noticed he mows his lawn every two days.  Next to him is Judy Thorp. Dude, she freakin' sneaks over to her neighbors' every morning, steals their newspaper, I guess reads it or swipes the coupons, then puts it back before they even wake up.  Last stop on the tour.  Don't know.         Nope, no I'm fine.  Thanks, that was really humiliating.  Oh, you mean that thing with the cops? They had the wrong guy, total foul up. I'm Kale by the way.  Hey, so -- how'd the move go?  I'd help, but... I'm a little spatially challenged at the moment.     That doesn't sound good.  Oh, sorry, I was just gonna see if you wanted to hop in my Hummer and cruise to a kegger. Nice talking to you.  I know the tone.  Noticed that, too.    What are you stopping for?    Whoa.         Holy shit.   A dent --  Jesus, mom!                       Christ, Kale!  What?   No, I --  Nothing, just watching the wind blow.  No, see for yourself.  (now flipping through  Movement.  Better late than never.    Jackass!  Dick, my deaf aunt in Omaha heard that.    Seriously?    No.                                  No.  It's not gonna be her.  I have to.  It's her.  She totally saw us --    Yeah, no, we were playing upstairs --    Do you need to call anyone?  Uh, sure, come on in --  That's Ronnie.  Excuse me...     It's a little messy.  So you hear about that missing girl from Madison?  He drives a car like the one she was seen in.  60's era Mustang.  They said it was dented.     His has a bashed-in fender.  Hey --  Yeah --    How'd he fix it so fast --     (off Ashley's    About two or three years.  Not that I've seen --        How'd you get my phone?  What'd you do?  What the hell?  Where's --  So that's why the grass is greener...  So why the move?  No, seriously.  What did they think, an extra bathroom and two-car garage would actually change things... somehow protect them and you from all that crap you can never escape?  That's him.  No.  How do you know?     He's going in.  What do you think they're listening to?  And she's down for the count.     Looks like.  What were you expecting?  Does that disappoint you? 'Cause I can be more messed up if you want me to.  \"Fine?\"  \"Fine\" like your first cousin \"fine\" or \"fine\" in kind of a Brad Pitt sorta way?  I can't hear --      Are you nuts?!  Mom?     Dammit.  Shit!     Dumbass dumbass --  Okay, so where is she --  Oh shit oh shit...    Giles totally busted me.  They were arguing --  Giles and the girl he brought home. They had an argument, he grabbed her --  And then -- nothing.  Dude, something is going on over there. What if he killed her, too?  Wait --  A door just slammed.  Asshole, I'm serious.  Just -- wait -- wait till I check the hall --  Goddamn you!!  No, don't!  Ronnie -- just Ronnie.  I heard the door --  Fine.   Good.     Okay --  Anything caffeinated.         I know, how did you --  Dad put those security bolts on --    Yeah, I do.  That's right.  I think I'd like to hear his opinion.  I popped my Spanish teacher.  I like your shirt, by the way.    I mean, the color.  Oh, the... that dark orange.   Always reminds me of Texas.  Sure, absolutely. Even though I've never stepped foot in Texas --  Huh.  Just a black eye.     I know, he's a total freak, right?  Are you messing with me?  So you think it's all a coincidence. We've got the car --  The bumper sticker, the argument, the staring contest -- And now he's showing up in my kitchen --  Maybe.    Well what if she's really \"not moving?\" What if she's tied in the dungeon with the other girl, starving to death --  You're leaving?  Whose?  How is that possible?  Well, I mean... Sorry, I just didn't think you knew anybody --  Oh my god, \"Skinny Psycho?!\" I sat next to that bitch in Spanish --  And now the whole neighborhood's coming.  Hey, I get it. You don't have to explain.    It's funny, though.  I didn't peg you as a conformist.     Wait, what was that? You think I'm watching? Well, I'm not... Nope, I am minding my own business...  You think I'm buying that?  I'm not biting --  That's it.  Hey!        Take it easy, that's sixty gigs of my life.  Okay -- okay --  What are you doing?  Coulda fooled me.  Forget --  You wanna blend in with that crowd, fine, then stop looking up and trying to get a rise outta me.  It's not a cover --  What else have I seen?  Okay -- I've seen how you always pull your kleenex from the box in groups of three. Not two, not four, always three. I've seen you're the only one in the world who eats pizza- flavored Pringles. And you never stuff the chips in, you savor each one by dividing it into four precise bites. I didn't know that was even possible. You're also the first girl I've ever seen who spends more time on her roof than in her own house. And what do you do out there? You don't talk on the phone, you don't paint your nails, you read books. Now one would think with the whole numbers thing you've got going on that you'd put them on your shelf alphabetically, but you don't. Your system's much more perfect. The ones you like go on the bottom, the ones you love go in the middle, and the ones you need, the ones you keep going back to... well they go straight to the top next to the dream encyclopedia. You know what all this tells me? You know how things should be. The world according to Ashley. And guess what? It's a very entertaining and beautiful thing. Even when it takes a hit. When you end up in a place like this... when your parents dump their baggage on you, or just... when it seems like those curveballs are never gonna stop -- It sucks, but just so you know -- I get it.  But I've also seen those designer window shades of yours, and guess what? They always go up the next day -- no matter what. And even if no one else has, I've noticed that. And I ain't sorry. The only thing I'll even consider apologizing for is... not dropping the binoculars and telling you this a lot sooner.         Hey.  If would have gone to the flower shop, but --  Oh, two months, twelve days, nineteen hours give or take.  You know the other night... when you said you thought I'd be more messed up...  I didn't kill my --  Three-thirty.  You better see this.  Look, quick --        Phase one, steal his code from his opener.  There's only two. Now look, his remote's in the glove compartment of his Toyota. All you have to do is pop it open and read me the switch settings. \"On\" or \"off.\"  No, not breaking in. We're just talking about having access to his garage so we can go in on our own time - when he's not there - to just... to get a closer look at the car, the bag --    Look, if we're gonna do this, it's gotta be now. He takes twenty-one minutes average to mow his front yard... you'll be hearing him the whole time...        Let me conference Ashley in. Ashley, you there?  Nice.  Okay, Ron -- Green light.  You're all good.  You okay --  Dude, glove compartment, other side.  Well, while you're there, will you just check?  You see the package?  Whenever you're ready.  Just start over.  No, no --  Ronnie, he's coming around.  (trying to remain   Put the remote back --  Easy on the door.  Don't panic, he's coming straight for you --  Back seat, NOW!  Ashley --  Shut up, stay down and don't move.  Ronnie, you're good --  Ronnie?  Ronnie, was that the whole code? Ronnie?  (talking to Ashley  Was that the whole code?      Getting her license number --  \"Yeah, he seemed like such a normal guy. Sure he kept to himself, but he was always nice to me.\" That's what they all say. That's what all the neighbors always say -- after the fact. Only after they've caught the guy, after he's killed thirty people --       Trying to get to the bottom of this.  What's it look like?  Not who I think.  What, crazy?     Maybe I am.   But maybe I'm right.  Are you two gonna help me or not?      So what's your deal? You hanging out or not?  Sure.        Get off me, man.       (into walkie talkie  Got video, no audio.  Light on, far end.    Stay calm, it's there.  You're still clear, check the bag.  Try to get the plate number of the Mustang and check for dents --  The camera's sliding --  Ronnie?  Ronnie?!  He's in the house -- Ronnie?  What the hell --  RONNIE!    Shit --       Ronnie?!  Ronnie, can you hear me?! Giles, open the door!!  Hey!  Please, my friend's been kidnapped, he's in this house -- he's inside, I think the owner's trying to kill him --  It was already open.  You're a lying son of a bitch!  He's in there, goddammit!   He's inside! He's lying!  Okay, but he's lying -- he has my friend, and he kidnapped that girl last week, he killed maybe three others, all redheads, they could be in a bag -- a big blue plastic bag -- in his garage -- my friend knew this -- That's why he's covering -- he didn't just wake up five minutes ago --  So why'd you have to have the car fixed in record time, huh? Because it was covered in her blood --    Mom --  It was --  Yeah. I just -- didn't think you'd believe me --         Shit --  Ronnie --  How -- How long have you been here?  Still, you could have --    Why didn't Giles tell the cops someone broke in? I mean, he did see you, right?  What if he wasn't always a guy?    I was watching, remember?      So that's when the garage door started closing.  That's great.  Yeah, I lost signal --    You're not fooling me, Giles...           Ronnie?!  Ronnie -- MOM!!             It's dead.     No, I've gotta get her --  (beat; then; an idea  Once I have his attention, you go get her.       Ashley!   Are you okay?  Stick to the plan --      That was a warning!   Where's my mom?  I don't know -- the cops should be here any sec --  No flashing lights -- stay here --  Parker, where's the cavalry?!  Parker, you need to get them here right now -- Giles is --     him, I was so -- he's the one who left, he's the one who gave up, you know? -- But that's b.s. See, the truth is, my dad -- He saved me.     Movement.  She's whacked. Plain and simple. I think she thought it'd be some sick challenge or something -- hey, commission's the same I guess...  No way.   She can't be serious.",
        "Mrs.": "",
        "Carlson": "",
        "Detective": "",
        "Parker": "a sixty-foot radius from this guy here.  He's like a modem. He gets a constant signal from Mr. Bracelet that he sends through your phone line to the monitoring station downtown. So they know where you are, where you've been and what you're thinkin' 25/7.  (anticipating; re:  And they don't bring blindfolds. It's also tamper proof and waterproof. So don't try sticking your foot in a bucket of water and hopping across the line. It won't work, and you'll look stupid. Now, I'll be checking up on you a lot. Here's my card -- You're set up to pay his incarceration fee, Ms. Brecht?       Kale, first times happen. The officers knew that. But next time they will take you to jail.  Kale, what's going on now?  I told 'em don't bother, you were my responsibility --",
        "Greenwood": "",
        "Boy": "",
        "Turner": "",
        "Ashley": "Can I help you?    Please. I think any pride you had left was gone a while ago.  Still going.  Yeah, you've kinda got the whole Martha Stewart thing going on --  I'm a city girl. Born, raised, and now... Forcefully relocated.  I'm telling you, if I have another clueless jock hit on me or one more soccer mom cuts me off in her oversize SUV, I'm gonna go postal.        What took you so long? The house isn't that big.  Oh.   -- Locked out.  Thanks, but I'd rather stay stranded if you don't mind.  May I?  Nice to meet you. Video games, huh? I like to play.  A little?  Anything interesting out there?  Are you spying on the neighbors, Kale?  Is that so.  Yeah, I've seen him.   So?  (realizing; then  Gee, that really narrows it down.    So that's the infamous black mustang, huh?  The one with no dent?  Because it was never there in the first place?  Sorry guys, no bashed-in fender, just a Longhorns bumper sticker.  Okay, fine, stakeout. Who's on my shift?  Do you know how long Giles has lived there?  So he could've lived in Texas... Hey, check this out.  The summary lists four main criteria. Our guy meets at least three. White male between the age of twenty-five and fifty. He doesn't have any pets, right?  You said he lives alone --        I'm crafty like that.  Every time he calls, that's what you'll hear.    Only in disturbia...  What do you mean? The greener grass, the safer pastures...  Well, I guess my mom thought it'd help keep dad on a shorter leash. City life... had its temptations... But my mom pretty much cries just as much as she always did, and dad doesn't care -- more than ever.  Something like that. So... what're your issues, Kale?  Another car --  You seen her before?    Who said chivalry's dead?  There's a club girl for you.  Bright green bracelet's \"The Pyramids,\" purple's \"Club 360,\" the big black stamp's from \"Flavor.\"    Denied...  (been there, done  Oh, c'mon, Giles, all she wants to do is dance.  Could be radio. See if you can find the station.  (watching the woman &amp;  Stop.  Now's the time to bust your move.      Looks like this is as far as you go.  Y'know, I have to admit, you're different than I expected.  I thought you'd be more messed up.  No, you're fine.  Yeah.  He wants her to come back in --  Let's get closer --      And very vague... did he genuinely mean it was nice meeting you or was he sending you a \"sinister message?\"  Maybe a little. Did you even notice my hair?  With the non dent dent --  Why, because he slashed your mom's tire?  It's called \"the day after,\" Kale. Nobody moves after a night like that.    Have to.    Party.  Uh, mine?  Excuse me?  I don't, I didn't -- I met this girl earlier, Minnie Tyco?    Look, I'm stuck here. So I figured I can either shut myself in and keep hating it or... try to make the most of it.  Kale, you're welcome to come, but --      Try to keep these in your drawers tonight, will ya?     (peering out the window  Back off or I'll throw it where you can't follow.  Even better.  What are you doing?  I'm trying to enjoy my party. Wait, that's wrong. According to you, I'm trying to conform --  What does that mean?  No, I'm not gonna forget it.    And the whole \"my-neighbor's-the- killer\" thing. Great cover --  So what is it, Kale?   Huh?   What else have you seen?  Yeah.   What else?  That was either the creepiest... or the sweetest thing I've ever heard.  Hey... where have you been?  I know.  So how much longer?  ...For a guy who killed his teacher.  Shhh. I know. -- I know.  Oh my God, what time is it?  I've gotta go.  What?    So what do you wanna do?  I don't know about that, but --  I'll do it.  Ten-four.  What's wrong?  I'm on it.     Okay, case closed.  Why, Kale?   It's over.  Okay, I think we all just need to take a breath.  Kale, why are you so --  Kale, what are you doing?    Like you're determined to turn Giles in to who you think he is.    It's not about that, it's about -- -- What I see. What Ronnie and I are seeing right now. I see a guy who looks like he hasn't slept in days. I'm seeing you sitting at your dad's desk --  -- Because you lost him before maybe... you ever really knew him. Before the world according to Kale took a hit from that same stuff you were telling me about, remember? All those curveballs? But it's like -- it's like you're still trying to dodge them by forcing pieces together that are never gonna fit... by getting all wrapped up in... This. Obsessing's not gonna \"protect you,\" Kale. It's not gonna make the hurt go away.  I want to.  That's not what I meant.   Let me try --  Where's your mom --  (giving up with  Kale, you've gotta get outside, get over the boundary -- do you hear me?  Kale!  NO!   You son of a --  I wanna kill him --  Hi, Mrs. Brecht, I'm Ashley -- It's gonna hurt.          She went upstairs for you -- where's Giles?  What's wrong?  Why's your mom doing this again?  Hey, if anyone can spin a psycho house into the opportunity of a lifetime, I'd bet on your mom any day of the week.  Whaddaya think, another stakeout?",
        "Julie": "You're kidding. So I can actually put the burgers away this time?  What if he accidentally goes beyond --  Automatic withdrawal. Twelve bucks every day.  Dinner's on the table. I'm closing at the restaurant the next few nights. Could be some late ones, but hey... the extra tips couldn't hurt.    You wanna talk about anything?  Y'know, when we're finally free of all this legal stuff with the accident, the other families' lawyers... there might be a little insurance money left... maybe you should go back and see Dr. Phillips?   Well, that one could've been avoided.       The lawyer's sending some papers over.    I-tunes, too. You know what else I'm canceling?  Maid service. Sorry, you're a felon. And we're broke. I can't do it all, anymore, Kale. This isn't gonna be vacation as usual. I want these washed and the kitchen cleaned by the time I get home.  Well let me make it easier.    You heard what I said about the lawyer?  Jesus, mom!                       Christ, Kale!  I'm sorry.   I thought you heard me...  What's going on?      Kale, Kale, it's me!!  What's going on, who were you talking to?!  I'm sorry, the wind caught it --  Okay then, so... You want anything from the grocery? I'm going in the morning.      And that adapter thingy that unscrews it ended up stripping it instead --  No, it wasn't. You saved my life. We had it towed to Frank's.  Oh... no, it's okay, we're managing.  Oh c'mon, Kale. I'm sorry.    Wait, what about your coffee?    Kale, could you grab the sugar? Sugar?  Kale, come on --    I really am. You know, one thing I always told myself was that no matter what, I would always know what was going on with my kid --  Let me finish -- because I have to tell you something... I feel like I let you down. I was too caught up in my own grief to see straight. I thought time would heal this and taking a second job was... the answer to keeping a roof over our heads --     Listen to me. I am always on your side. No matter what. It may not look like it sometimes, but it's the truth. And we'll get through this. Okay?       You ready?",
        "Ronnie": "(subtitles as needed)  Quizás no. Quizás                Perhaps I won't. Perhaps apenas permaneceré en            I'll just stay at home. el país. Pero quizás             But perhaps my parents mis padres tomarán la            will take pity on me. compasión en mi. Quizás harán mi sueño            dream a reality! Perhaps una realidad! Quizás             they will take me to a me llevarán a una playa          beach on the French Riviera en la riviera francesa           so that I may gaze upon de modo que pueda mirar          the natural beauty of its sobre la belleza natural         female inhabitants. de sus habitantes femeninos...  Perhaps... Thank you.  Dude --  (phone filter; party    Seriously man, you need some sun.    What are you talking about?  -- Fascinating.  Husband?  Great, that still doesn't explain why you're in a bathrobe at four in the afternoon.  Dude, he's gonna see --  Oh, you did the math.  Kale --  WINDOW - Lonnie vacuums as Mr. Pilch enters the room behind him. Mr. Pilch flips off the light switch, cutting the power to the vacuum. Lonnie startles, turns around, sees Pilch standing there with the flowers and a big smile. A beat, then -- Lonnie jumps in Pilch's arms, kissing him passionately.     What, I go to Maui, you become a stalker?    Huh, I guess he likes his grass short.   (weirdly eyeing Kale  What was that?  Oh-- my-- God. Who be she?  What's stopping you?!  So you don't know what year the Mustang is?  Check this out. The feds think your missing girl might be related to three murders in Austin. All redheads.  Dude...   Oh, it's so warm, baby...  Cleansing breath...  Concentrate now. This is for the gold.  Dude, there's no way she heard that.    There's no way --    Her swims always that short?  Now where is she?  No.                                  No.  Don't, it could be her!  Then stop!    Just -- let 'em go away.  What?!   What?! Speak.  You're full of --  Shit shit!!    Oh my shit!  We are so busted. Don't answer it!      See, he has this neighbor -- who I guess by definition would also be your neighbor -- who may, in point of fact, be a cold-blooded killer.  Exhibit A, Robert Giles.  Black Mustang.  What?  Austin, Texas. Texas Longhorns.    This is all the stuff I could find --  \"Murderer: Tell Tale Signs of a Serial Killer.\" Qualifies for free shipping if you pair it with \"The Shrine of Jeffrey Dahmer.\"  What's the fourth?  (eyes closed; grinning  (yawning; re: woman    (then; aside to Kale,     What do you mean, are you sure?  Who?  And then what?  Uh-huh.  Then call your friends at the police department.  What?  (in his best sinister  I'm not and I'm hanging up.       There's more than one phase?  For the later purpose of doing what? Breaking in to his house?      No. It isn't safe. Let's do it.  (phone filter as  Oww, shit --  What do you think?  Excuse me if I'm used to my mom's import. Can I just try this one while I'm here?  Shit.    They're all gonna be locked --  I'm in.  Oh my God --  There's like a month-old order of Nachos Bell Grande under the seat. Okay, I found it.  Looks like \"on, on, on, off, off, on...\" No wait, that one was \"off.\"  \"On, on, on, off, off, off, on -- \"  I'll get it right this time.  Dude, stop dicking with me, I still hear his --    I did, I did --  What?!   Kale, you've gotta get me --      You've gotta be kidding.    What are you doing?  Why?  Try telling Inspector Clouseau that. Now he thinks he needs her license number.  Yeah, for a small fee --  I would, dude, but -- I've gotta pull it together and -- change my underwear. Catch you later?  Dude -- my cell phone's -- still in his car.  Kale, did you hear me?    (walkie talkie filter  Yeah, mic's on the fritz.    How am I looking?  I guess it's now or never.    Moving out.  First hurdle --  Twenty feet.     Ten feet --  Garage --  Bingo.  I'm not seeing it --  I've got it.  Hang on --  I'm setting the camera on the trunk.  I'm checking the bag first.  It does look like blood -- and hair --  That was close.  Oh shit --     Dude, don't kill me, don't kill me -- I can explain --  You should have seen your face -- I got out his front door. I got lucky. I heard you yelling, but dude, cops were everywhere --  What, popped out and said, \"oh yeah, officers, my friend's right, I was just in that house, I'd gone to get my cell phone out of the guy's car I broke into earlier...\" Are you kidding me?  Dude, I am sorry. Can we just... hug it out?  You know, let's be positive for a change. I thought he did, but maybe he didn't. Or maybe he's a nice guy afterall, and he didn't wanna make a big deal of it, you know? I mean, he's a guy, he was a kid once...  But I do have to ask... what was in the bag?  Naturally... Hey, you want more evidence, detective?  No, no, this is comedy, it deserves big screen treatment.  Hey, I caught that.  Yeah, he must have heard me. He came through the inside door -- This is where I ducked low and started...  ...hauling aaaass...  Dropped it.  But I never leave evidence behind.  And that's about when you started yelling bloody murder and the shit hit the fan.",
        "Officer": "",
        "Gutierrez": "Gracias, Ronnie. Quizás          Thank you, Ronnie. Perhaps le daré una \"F.\"                 I'll give you an \"F.\"  Senor Brecht...  So Kale, think you can stay conscious long enough to tell us your plans for the three wondrous summer months ahead?    ¿Qué?  ¿Qué usted va a hacer?  Did you do the homework or not?",
        "News": "...Thirty-three year old Patricia Walsh was last seen three nights ago...  ...attended a friend's birthday party at a local nightclub before she was last seen alone at a diner outside Madison, 50 miles east of here. A waitress said Ms. Walsh was picked up around 10:30 P.M. by an unidentified person driving a black 1960's era Mustang that was dented on the left side and may have --",
        "Anchor": "...Thirty-three year old Patricia Walsh was last seen three nights ago...  ...attended a friend's birthday party at a local nightclub before she was last seen alone at a diner outside Madison, 50 miles east of here. A waitress said Ms. Walsh was picked up around 10:30 P.M. by an unidentified person driving a black 1960's era Mustang that was dented on the left side and may have --",
        "Daniel": "",
        "Brecht": ""
    },
    "imdb_rating": "6.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTMyNTIxOTQ3M15BMl5BanBnXkFtZTcwMjU2NzAzMw@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "After his father is killed in a car accident, things unravel for Kale Brecht and he is placed under house-arrest for punching his Spanish teacher. Having nothing better to do, Kale occupies himself by spying on his neighbors. But one night, he witnesses what appears to be a murder going on in Mr. Turner's house. Kale becomes obsessed with uncovering the truth behind these murders but, after a few unsettling run-ins with Mr. Turner, it becomes a matter of life and death. And the ominous question: Who is watching whom?—O.G.",
    "name": "Disturbia",
    "genres": [
        "Crime",
        "Drama",
        "Mystery"
    ]
}