{
    "filename": "Drop-Dead-Gorgeous_script.txt",
    "imdb_id": "tt0157503",
    "imdb_url": "https://www.imdb.com/title/tt0157503",
    "characters": [
        "Lisa Swenson",
        "Rebecca 'Becky' Ann Leeman",
        "Lester Leeman",
        "Amber Atkins",
        "Iris Clark",
        "Tess Weinhaus",
        "Jenelle Betz",
        "Leslie Miller",
        "Annette Atkins",
        "Molly Howard",
        "Gladys Leeman",
        "Loretta",
        "Tammy Curry",
        "Mary Johanson",
        "Michelle Johnson (as Laurie Sinclair)"
    ],
    "dialogues": {
        "Lisa": "Why?  Well, uh, it's kind of like askin', \"Why do all the guys chew Copenhagen?\"  You know?  I mean, if you're seventeen and you're not a total fry, it's just what you do.  ETHEL MERMAN's \"Everything's Coming Up Roses\" PLAYS over speakers.     I'm gonna sing and dance to, \"New York, New York.\"  See, I fell in love with The Big Apple last summer when I was visitin' my brother.  He followed his dream to New York.  PICKS UP 8x10's, shows to camera.   This is Peter as Liza.  This is him as Madonna.  Oh, here's me with him as Barbara...   Ow!  Oh, God.  It's so em-so embarrassing.   You guys know the retard's pants are open?  I don't want to see that.     Oh-yah, I love to swim.  When I was in New York, I met Greg Louganis at one-a my brothers' shows...    wearing a Statue of Liberty Headdress.  (It's a Barbie Doll that holds an unlit birthday candle.   Living in a country where Lady Liberty keeps her flame burning bright.  She reaches up with a lighter to light the candle. It's hard to reach and won't light.   Keeps her flame burning bright...   Hey, my hands are stuck.   Listen, you guys, don't go int the bathroom.  Tess blew chunks all over. Man, she ate a big dinner.    Oh, Amber...   I can't believe this is happenin'.  I can't believe she said you couldn't...  Getting an idea, Lisa starts to take off her jacket.   Amber?  Here.   My jacket.  Take it kcause, y'know, I got my costume okay'd before the pageant.  You can wear it.   Shut up, yous guys.  Look, Amber, I'm not gonna win.  And let's be honest, a family only needs one \"Liza\" and you know Peter's got much better legs than me.   Oh c'mon, I love kem, but you know they only had me kcause Peter needed a kidney.   Then do it for Peter.  Mrs. Leeman used to call him a \"skinny little fag\" when he'd bag her groceries.  He'd pop his Nancy-belt if his old jacket somehow, I don't know, got her back.   Oh-you-beccha.  Amber hugs her and takes the jacket.   I quit.  And, uh, since my costume, y'know, was okay'd a month ago?  I'm givin' it to Amber.  Amber breaks a smile.  Taped music ENDS.  APPLAUSE.  Gladys, mic in hand, joins Becky for a big hug.   No, it was worth it.  Amber shoulda won.   I'll tell ya one thing.  Peter never woulda pulled a shenanigan like that.   Well, y'know what, dad?  Y'know what? Peter's gay!  She runs off.  Her parents stop DEAD IN THEIR TRACKS.   What?!",
        "Swenson": "wearing a Statue of Liberty Headdress.  (It's a Barbie Doll that holds an unlit birthday candle.",
        "Lester": "...You betcha.  S'posed to be colder-n- a witches tit tonight...    Hey, ya like it?  Open it...Yah-the globe.  Pull at the equator there.   Fits three full-size booze bottles. The cassette deck pulls outta Afghanistan, there.   Oh, all right  How soon they forget where all this comes from.   That's enough, young lady.   Yah-she's damn near as good as that little black fella - with the glass eye.   Yeah, yeah, the Jew.   Hey Tim, Carla - if yous kids don't try to Jew me down none, I'll throw in a matchin' hutch.  The COUPLE smiles excitedly.    See, that there's my specialty.  Don't pay me less and I'll give ya more.  Secret is, the hutch is included in the price.  Ain't that right, Jean?  Lester smacks Jean on the ass.   Take a memo, sweetheart.   Ahhh.  Beautiful as a whore's ass today.  Eh, boys?  In the b.g., Gladys holds a bullhorn, clipboard and points to a LARGE SWAN FLOAT.   Yah-Gladys had me order that swan special made from Mexico in case Becky won.  I do a lotta business with those people.  I always offer to pay kem in tacos.  Whoo, they love that.   Gladys!  Stop it!   So help me, Gladys.   That's enough!",
        "Leeman": "Good God, Iris, you taped your shows over it.   Now ladies, the rest of the tape - which is now gone forever - goes on about startin' this great American journey we call American Teen Princess...Yah-so, any of you young ladies who'd like to start on that journey, you just come right down here and sign up.  And please...help yourselves to some coffee and bars...     Civil Servettes and crew are piled in.  Gladys drives.    I'll always remember what she wrote in the card.  \"Jesus loves winners.\" That's why, no matter what I do...  She shoves the magazine back in her pistol.    Landscaped grounds surround this lovely two-story.    Brief \"LIFESTYLES OF THE RICH &amp; FAMOUS\" montage of Gladys showing off interiors to the theme from \"GONE WITH THE   It looks like a Levitz showroom.  Gladys sits stiffly between Becky and her husband, LESTER - mid-60's, gruff, \"old school\" salesman, drink in hand.      Lester's gone from the couch.    Follow Lester around cheesy room displays.  JEAN KANGAS, his meek, middle-aged secretary follows him everywhere. Lester CALLS OUT to a YOUNG COUPLE sitting in a dining room.",
        "Amber": "Hi, I-I'm Amber Atkins and, um, I'm signin' up k'cause, ah, my two favorite people in the world competed. My mom and Diane Sawyer...Course I hope I end up a little more like Diane Sawyer than my mom...  She flashes a GRIN, we melt.      Oh, my God, no.  Oh, God.  I just do the hair and makeup on the deceased.   I'm lucky I have an after-school job where I can practice my talent.    Well...it's the least I can do for the reigning Mount Rose Junior Miss Amer--  Amber pulls the brush away with a clump of Mary's hair dangling from it.   Oh God...   Huh?  Oh...Uh, just a little snarl...  Amber mouths, \"Shhh!  Don't tell!\" to camera as she tries to pull the clump of hair from the brush.   There we go.  She holds the mirror for Mary.   Yah... sure...  Amber gives a kind but worried smile to camera. Suddenly, Becky Leeman enters with a large box of chocolates.  She's fully aware of the cameras from the moment she enters.   What're you doin' here?   How nice, Becky, she's anorexic.  Becky roughly puts her hands over Mary's ears, who's now gently petting the spilled chocolates in her lap.    Amber stands in a room the SIZE OF A CLOSET.  Posters, articles and pictures of great tap dancers and Diane Sawyer cover the walls.   ... Dreams?  Yah-sure I got kem... Sometimes I dream of winnin'... I dream of gettin' outta Mount Rose and bein' a big time reporter like Diane Sawyer.  I mean, guys get outta Mount Rose all the time for hockey scholarships or prison.  But the pageant's kinda my only chance.     Amber points to LARGE PAGEANT PHOTO OF DIANE SAWYER - 1963   ... Yah-1963.  Her beauty worked against her when she started as a reporter in Louisville, her hometown. Those were different times.    That's my mom.  I'll get kem in a sec.  ANNETTE ATKINS, Amber's mom - sexy, but tired - OPENS THE  They're from L.A.  They wanted to see my room and film me for their movie.   Hi.  Becky notices their attraction and goes from flirt to uber-bitch in a heartbeat.   Here, I'll take it.  It's my job.   Well, you're supposed to put it in the...  Becky THROWS her tray on the counter spraying Amber with food as she storms off.   Then it must be Wednesday.   I know.     Huntin' season.  Shocked at the coincidence, they share a laugh.   Yah-sure, fine...fine.   Bye.  Amber smiles, gives a shy little wave - then, to camera.   Oh, God - you don't think Becky saw you guys, do you?  Look, you just shouldn't be in here...   No, listen.  We shouldn't talk here.  Stop by my house tonight, okay?  She looks around and motions them to rush off.    Ahhh!  Je-sus-Christ-on-a-cross!  Look, number one rule in a funeral home - never sneak up on the livin'. You never know who could have an embalming needle or skull saw in their hand.  Mr. Larson's son learned that the hard way - he's buried next to my Grandpa!  Amber turns to the slab to continue working.  She pulls off the SHEET to reveal BRETT, handsome football player, still wearing his hunting plaid.    Upset about Brett?  Nah.  Hazard of the trade.  I don't really have time for guys anyways.  It's weird, though. He took it right between the eyes. Don't often see that.   Sorry.  I just thought she might not wanna meet her Maker lookin' like a cheap whore.    -- red nose and ears.  I know, I know.  Mr. Larson PULLS Stella's coffin out.   Sorry I couldn't talk today kcause...I'm scared, okay?  I open my locker right after first period and there's a picture of Tammy Curry taped inside.   This was written on back.  She turns the picture over to reveal, \"YOU'RE NEXT!\"   Yah-sure, Tammy liked to driver her dad's thresher - she said the heavy vibration helped her think, y'know? But I know for a fact she only smoked after a good drive.  You ask me or anyone else who isn't scared to talk about it - Tammy was murdered.  God, I bet Diane Sawyer never had to deal with crap like this...  Toss me \"Caucasian #5,\" would ya?  A crew guy walks IN FRAME and hands her a make-up jar.   Man, I can't wait for fishin' season...  Mr. Larson bursts in, white as a corpse.   No, don't say it.  Another stray bullet to the head.  She adjusts Brett's red plaid hunting cap.   I'm gonna need more caps.   Relax, that's my ma's code for, \"Bring home milk and a carton-a Luckys.\"   Oh my God - no!  Is my mom okay?  Was she home?  Hearse SCREECHES to a halt.  We hear a THUD, then MOANS from in back.  Amber jumps out.  Camera follows, a la \"COPS.\"  It's pandemonium with fire trucks, neighbors, an ambulance, etc.   Mom!  Mom!?  MOMMMM!  Loretta runs up to Amber as TWO FIREMEN approach.    Is Mom okay?   Where is she?!   Mommmm!  I'll be right behind you in the hearse!   Oh, Mom, it's so ugly.   Mom, uh, about that...I-I'm-oh God...  Amber starts to cry and runs out.   I-I'm quittin' the pageant.   Oh God, I'm dead...  A candy striper approaches them.   So, what do I say?   Oh my God.  I'm so dead...   Mom, look, don't say anything.  First of all, I'm not pregnant.  Amber sits on the bed.  Annette grabs her shirt.   Mom!    Okay.  Yesterday I...I got this picture.  So I kinda, y'know, I'm thinkin' no.  I'm gonna, I-I-I'm gonna quit the pageant.   Ow!   Nice mouth you got there, Mom, but I- I'm not goin' through this again.   Oh, c'mon... First the picture of Tammy, then Brett Clemens, now this? It's scary.   That's it, I'm goin'...   God I hope that's you and not your concussion talkin'.   I love you much.  Annette hugs Amber.   No.  Mom said if I did, she'd look up my dad and marry him.   No.  She never hid the fact that my dad picked his career over us.  What'd she used to say?   Oh-yah.  Yes.  Yes I am.  Thank you, hello.  All judges turn a page on their clipboards.   Seriously?   Well, ah...Alabama.  A-L-A-B-A-M-A. Alaska.  A-L-A-S-K-A.  Arizona.  A-R-I-  West Virginia.  W-E-S-T-V-I-R-G-N-I-A. Wisconsin.  W-I-S-C-O-N-S-O-N. Wyoming.  W-Y-O-M-I-N-G.  Pan over to Judges.  They can't believe it.  Hank CLAPS retardedly.  He loves her.   Yah-my ma's clothes all melted onto mine forming like this big polyester meteor in our closet, y'know?  But, in some kinda weird miracle, our neighbor boy, Kenny Johanson, found my tap costume on the roof-a their trailer while he was settin' coon traps for his dad.  Here's the weird part.  It was still on the hanger.   Yah-sure, eight's my luck number anyway.  Diane Sawyer was number eight at her local.   Don't you get it?  I was supposed to go first.  I was contestant number one.  That light was meant for my head.  If Janelle hadn't wanted to change numbers... God, I owe my life to that deaf baby.  Loretta enters, portable phone and drink in hand.    Really, Loretta?   My mom wanted me to have this?   Loretta, never have kids.   Oh...my...God!  It's just like Diane Sawyer's!  kCourse it's not a size ten, Diane was a little hippy back then.  Oh, thank you!  Thank you! Thank you!  She hugs Loretta.    with a MAP OF THE U.S. HEADDRESS, dances up to the mic.   Living in a country where no matter who you are or where you come from, you can grow up and become what you've always dreamed of, makes me, Amber Atkins, proud to be an American!   Oh my God!  My-my tap costume's gone.  Commotion stops.  Becky continues to get ready.   No, wait.  It-it was here before the openin' number...wait.  What am I sayin'?  I should just ask you, Becky. Where is it?  Becky freezes, staring daggers at Amber.   You heard me.  Where is it?  The other contestants slowly clear a path between them.   I just did.   Oh-oh, you bring me some of that snotty attitude, Becky - bring it on.   Oh, I'll \"get it.\"  I'll \"get it\" all right.  I might even take seconds.  They're moving ever closer...   Bitch!   I'll get you!   I hate her!   Here, I didn't get any.    And the winner of the \"Spirit\" award goes to...  Girls laugh quietly.  Iris pulls a dazed and confused Tess - beg wet spot on her shirt - through the shot.    ...Yah-it's just gone...  I mean, I-I just wanna tap, y'know? I'm not sayin' I'm the best, or that I'd even win, but shouldn't I at least get a chance to compete?  I just wanted my Mom to see me dance.  CHLORIS KLINGHAGEN enters, small bag in hand.   Please, Mrs. K, I got so much Vaseline on my teeth, I'm gonna be smilin' for a year.   Mrs. K--    Mrs. Clark, why are you doing this to me?  Why're you pretendin' you don't know what's goin' on?   But, doesn't someone taking your costume so you can't compete, overrule that rule?   This, this... This is bullshit!   Good, kcause this isn't an American Teen Princess Pageant - it's, it's Nazi Germany!  Amber storms off.   Mrs. Leeman?   I-I'm wearin' this costume.  I'm, uh, I'm gonna do my talent tonight.   But, you - I mean... It's not my fault.  I-I... Please?  I didn't do anything wrong...  Amber starts to cry.    Good luck, Molly.  One of Molly's guns flies off her finger.  She goes to retrieve it.    I-I-I-I-I-, j-uh-j-uh-just wanted to compe-e-e-e-ete.    \"Here,\" wh-wh-what?   Your parents'd kill you.   Lis, I want to, I really do, but... Oh, I can't.   Yah?   Yah-I brought her some flowers this morning.  She's in the room next to my mom.  She's super happy.  Girls ad-lib SHOCK.   Oh -- the blow to her head made her deaf...  Girls ad-lib \"Oh, I see.  Okay-then.\" etc.  Another LONG BEAT of SILENCE follows.  Becky gets up to re-touch her make-up.   Bye mom.   It's okay.   Oh, Mom's okay.  They're just givin' her a ride back.  She almost blew outta the back of Loretta's pick-up on the way over.    ...Yah-well, at least, y'know, I got to perform.  And Mom got to see me.  I guess number eight only worked for Diane Sawyer...  Loretta puts her arm around Amber.  They walk off as Leslie and Pat approach.   Yeah...    Yes...   Yes, Leslie!    Oh-yah, this is exactly how I pictured it.  Chokin' on swan gas.  Suddenly, like a gasoline soaked pinata, it EXPLODES!  Gladys is thrown back.  Flames.  Screaming.  PANDEMONIUM! Becky doesn't have a chance.  She's a pink taffeta BALL OF FIRE.  The swan's back eventually collapses taking Becky into it's burning belly.   I don't know.  I just didn't wanna win like this.   Really?   Okay.   I never liked her, but she didn't deserve to die in the belly of a swan like that.  The whole thing's just kinda sad and lame at the same time.   Ah!  It's from State!  Oh my God!  Amber rips it open and holds up a color brochure with COLLEEN and TERRY in a glamour shot on the cover.    It's all the stuff I get to do.  Oh my God, oh my God... Okay, okay... We get a \"personal consultation\" with a make- up artist -- Eeeh!  Okay, um, there'll be a choreographer to the stars and, oh no -- No way.  Oh... My... God!   I'll be stayin' overnight at... The Airport Howard Johnsons!   There's an indoor swimming pool! Ahhhh!  Loretta joins in the screaming.   Oh crap - I only got four days.  I gotta practice!   Airport Ho-Jo!   Loretta, don't do that.   I gotta work with these women.   Mount Rose American Teen Princess.   Don't tell anyone, but, I have a little secret weapon of my own.  Amber pulls out a jar of Vaseline from her purse and smiles innocently.   I don't eat shellfish.  Mom always says, \"Don't ever eat nothin' that can carry its house around with it - who knows the last time it's been cleaned.\"  She should know.    Oh my God.  Look at her, she's awesome.  I should just go home now.  Terry and Colleen stand in front of the stage.   I, uh... I feel like... I, uh, I need a shower.  Townsfolk laugh and cheer.   I just, I just can't believe it.  I'm Minnesota's American Teen Princess!   I'm gonna be on TV!  Just like Diane Sawyer.  Annette opens a beer with a new HOOK replacing her hand.   Okay, ready?  Here's the signal I'm gonna give Ma when I'm on TV.  Amber MIMES inhaling a cigarette and Annette embraces her.   This is Amber Atkins reporting live from the Food Shack for...KRLH News. One of our reporters has just been shot.    And I'm Amber Atkins for WAZB News.  SUPER: ...was given her job.   Good night.  As they smile and laugh, we:",
        "Atkins": "Hi, I-I'm Amber Atkins and, um, I'm signin' up k'cause, ah, my two favorite people in the world competed. My mom and Diane Sawyer...Course I hope I end up a little more like Diane Sawyer than my mom...  She flashes a GRIN, we melt.      Camera approaches the trailer.  SIGN on the door reads \"Annette's Family Hair Care.\"  Inside, the kitchen has been turned into a mini hair salon.  Annette gives Loretta, neighbor, mid-50's - a bouffant.      Loretta holds onto the door frame so Annette can't push her out.    with a MAP OF THE U.S. HEADDRESS, dances up to the mic.",
        "Iris": "Sorry.  Gladys turns to the GIRLS in the bleachers.    What's sick is women dressin' like men!  Civil Servettes stare at her a beat.   A.k.a. Minneapolis - St. Paul.  PULL AWAY from MINNEAPOLIS SKYLINE to COUNTRYSIDE.   Nothin' too showy!   Gladys -- Gladys!  Look out!   That's why we Lutherans use grape Koolaid for the blood of Christ.   Oh, there's a parking space over there.  Oh, no, that's just a compact. Sorry.   It's a two-hundred dollar fine!   All right, let's go.   Oh!  What is it?   It's always hard to see the young ones called home, especially on an exploding thresher.  It's just so odd and gross.   Yeah.  Iris pats Gladys on the shoulder.   All right.  Okay.   The Judges Interview.   Okay, everybody, listen up!   Coupla things...Gladys wants to be sure we go in show order today.  All right?  So very important.  Don't forget that.   Okay, okay!  Listen-up.  Coupla notes from last night's dress rehearsal.  Number one, Gladys says a coupla yous are gettin' sexy with your hips durin' the \"Physical Fitness\" routine...   Uh, Amber?  We're not puttin' on our Talent costumes. You need to put on your \"Physical Fitness\" outfit.  And let's shake a leg, ladies.    Girls!  Girls!    Y'know, I-I don't think yous boys should, uh, should be in here while the girls are changin'.   We all do.  Now let's go.   All right, why don't we take up the stepladders, all right?  For the Physical Fitness number?   Well, hold kem away from you so it doesn't get on the outfits.  What kinda mental retard paints step ladders the morning of a pageant.    \"I'd like to take you back seventeen years, when a peanut farmer was in the White House, a group-a boys callin' themselves kQueen' topped the record charts and Gladys Leeman was Gladys Wood and she was Mount Rose American Teen Princess!\"  Gladys enters wearing sash, tiara and plaid culottes. Applause.  A SLIDE is shown of her at 17.   Amber, I'm sorry.  I really am.  But you know the rules.  All talent costumes hafta be okay'd by Gladys before the pageant.   Sorry.  I-I don't make the rules.   Amber Atkins!  That is not American Teen Princess language!    Where do they get this stuff...   C'mon, Lisa.  You're up next.   It's time, ladies.   Uh, Gladys?   We need more bars!   Enid ate a whole pan!   As, uh, actin' President of the Mount Rose Civil Servettes, it's my duty since Becky can't fulfill her duties - kcause she's dead-n-all - to make you Mount Rose American Teen Princess.  She puts the TIARA on AMBER.  Loretta FLASHES pictures.",
        "Clark": "",
        "Tess": "Uh... I don't know what my talent's gonna be yet...     Kenny.  Kenny, come.  Come, Kenny.  A DACHSHUND enters and jumps on her lap.   This is Kenny.  Spike, my German Shepherd, went to live with a nice family on a farm after he attacked me. It wasn't his fault.  I had beef jerky in my front pocket.  They re-made my belly with skin from my butt.    Dogwood.   And, uh, this is my lucky bolt.  They think it fell from a DC-10.  The doctor said I was lucky the flat side hit me, um, otherwise it coulda gone right through my head.  I know, I know, gives me the willies, too.  I guess the explosion...  Janelle Betz, wearing a flowing, nymph-like dress with ballet slippers, glides up to Amber.   Uh, this, uh, my Uncle Phil's World's Largest Ball of Twine, in Bundy Minnesota, makes me, um, it makes me proud I'm American - I kinda misunderstood the assignment.  The ball of twine falls to the floor and rolls off the stage, still attached at one end to her head.    The beagle is known for it's howl. \"Aaauuuuuhhhh.\"  The Pekinese has it's own distinctive bark.  \"Yip, yip, yip.\"  Not to be confused with the Chihuahua's, \"Yap, yap, yap.\"  But none can compare to the greatest bark of all - the German Shepherd...   She's happy?",
        "Weinhaus": "",
        "Jenelle": "",
        "Betz": "MRS. BETZ, a large woman, holds a tray of bars.  CREW MEMBERS REACH IN THE SHOT and help themselves.  JANELLE BETZ sits on the couch, SIGNING EVERYTHING she says.",
        "Leslie": "...Hi.  I'm Leslie Miller.  I'm signin' up kcause-ah, y'know, I always watch pageants on the TV and my boyfriend thinks I'll win.    She makes \"gills\" on the sides of her head with her hands.   For my talent, I'm gonna be doing the..  Two FOOTBALL PLAYERS interrupt: PAT, her boyfriend, and BRETT, who smiles and gives a nod to Amber.  Pat grabs Leslie and kisses her hard.   Uh, Pat, I'm trying to tell themabout my...Oh...  Hormones take over and they lock lips again.  She wraps her legs around him.  He feels up her ass.  They continue groping as her Washington Monument slips off.   Hi, Pat!  Go, Muskies!  Whoo!   Green?   Brett Favre!    Oh-yah, really nervous.  It's been about two months.  I haven't told my boyfriend yet.  How did you know?    Oh!  Nervous about the pageant!  Yah sure!  She kisses a photo and GIGGLES.    as she seductively strokes the sides of her Washington Monument Headdress.   The Washington Monument...  Guys WHOOP and CHEER O.S.    ..makes me, Leslie Miller, proud to be an American.   Okay, guys, I think we all got some. You just take it off.   Here, have some.   Roll him over --  Lay him flat  Pin his shoulders  To the mat  Roll him over, lay him flat, pin his shoulders, to the mat!  Yeahhhh!  She JUMPS, KICKS and ends with SPLITS.  APPLAUSE!    They're never gonna let you perform naked.  I asked.   So, anyone talk to Janelle?   Why happy?   Hey-hey, I'm Second Runner-up!  Whooo! I got second place!   Huh?  Lisa passes by with her parents.  They look pissed.   Amber, if I die from these fumes, will you be sure to cover the hickies on my neck?   And the bite marks on my ears?   I know it doesn't matter, but on my inner thighs.",
        "Miller": "...Hi.  I'm Leslie Miller.  I'm signin' up kcause-ah, y'know, I always watch pageants on the TV and my boyfriend thinks I'll win.    She makes \"gills\" on the sides of her head with her hands.   For my talent, I'm gonna be doing the..  Two FOOTBALL PLAYERS interrupt: PAT, her boyfriend, and BRETT, who smiles and gives a nod to Amber.  Pat grabs Leslie and kisses her hard.   Hi, Pat!  Go, Muskies!  Whoo!    as she seductively strokes the sides of her Washington Monument Headdress.",
        "Annette": "Hey, Amber, y'get my smokes?    Oh shit!    Oh... How quickly they grow up.  Hey, if they ask you to take off your shirt, get the money first.  Annette is gone.   And go get my smokes!    Oh, Jesus H. Christ!   You could be quiet.   Hi.   It's just the guys that are...you know, makin' the movie about the pageant.  I told you about kem.   This here's Loretta.   No.  You just missed her.  Amber got called in to the bone gardens tonight. You just missed her.  She's in a helluva mood today, anyways.   Loretta, shut it.   Shut it up, Loretta.    Why don't you paint a big red target on your ass, Loretta.   \"Most smartest?\"  Oh, that's good, Loretta.  Make sure you get a picture of that.  \"Most smartest.\"  We're cuttin you off and sendin' you home.  Annette takes Loretta's beer, starts to push her out.   I'll be right back.  See ya later.  CAMERA follows Annette and Loretta.   They're makin' a movie, here, goddamn it.   You don't know where this is gonna...   Don't fall for it.  She lives two trailers down.   Go on home, Loretta.  Come on.  Go on, the party's over.    A DOCTOR, Amber and Loretta stand beside Annette, who's got an I.V., bandages and her LEFT HAND wrapped and  Ruined a brand-new pair of Lee Press- ons.  Well, I sat down for a beer and KA- BLEWEY!  Next thing I know, somethin' blows through my kitchen window.  Next thing I know, I'm ass up in Loretta's flower bed.      I shoved your tap shoes in my jeans before I was blown outta the house, Honey.  Check with the guy who cut my pants off.  He should have kem.   Oh-Jesus-Mary-n-Joseph, she's pregnant!  If you are - come back, sweetie. Mommy wants to talk, then KILL YOU!    Follow Amber in past the now crying candy striper.    Go on!  Get out!   I ain't lettin' go ktil you tell me what's up.  I'm reaching' a point where I'd kill someone for the nicotine on their fingernails.   What?!  She hits Amber with her beer-canned hand.    Would yous boys excuse us a second? Loretta, you too.    SHOT THROUGH the window.  Amber paces around Annette's bed.   You're not goin' through this again? You?  You're not the one who knows how Jiffy Pop feels.   Let me tell you \"scary,\" Amber.  Look at me.  Do you wanna look like you been rode hard and put away wet at my age?  I'm a \"lifer\" here.  Best I can hope for is to end up in a descent \"raisin ranch\" where they'll change me twice a day.   Honest to God, if I got to do it over? I'd start walkin' outta this town the minute I took my first step. Practically the only thing I wouldn't do different is have you...  Amber sits on the bed.    It's me...I just don't want this to be the thing you'd do over.  This pageant's your ticket outta here.  I know you can win, Amber.   C'mere.  I love you so much.    Annette is in bad shape. The candy striper nervously stands beside her, holding a syringe.   \"Bad wirin'?!\"  Well, if that ain't the biggest crock-a-shit ever. (turning on the candy striper Ooowwww-Jesus!  Did K-Mart have a sale on dull needles?   Shit.   We was robbed.   We was robbed.   They told me to practice.   My little Carol Burnett.",
        "Molly": "MOLLY HOWARD, a large white girl, sits between a JAPANESE COUPLE, Mr. and Mrs. HOWARD.      To America, Dad.  Mr. Howard laughs.   Oh, Mom...  The Howard's biological daughter (they renamed her \"TINA\") ENTERS FRAME.  Although she's the picture of beauty, grace, talent and charm, she represents their old life.    Same scene.  Mr. Howard is gone.    Same scene on couch.   I'll be line dancin'.   Bonsai.   Uh, Emperor Hirohito.    wearing an Atomic Blast at Hiroshima Headdress.   Atomic power makes me, Molly Howard, proud to be an Asian-American.  As she steps away from the mic, Tess Weinhaus, wearing a huge ball of twine headdress, dances up to the mic.    Uh, I'm kinda dizzy from the fumes.   Wish me luck.",
        "Howard": "MOLLY HOWARD, a large white girl, sits between a JAPANESE COUPLE, Mr. and Mrs. HOWARD.      ... So we adopt Molly three year ago when we come to America, to help acclimate us to American.   She all-American girl.  She our American Teen Princess girl.    English!  English, you stupid little retard!  We America now, Tina!   Tina! Tina!! TINA!!!   \"Robert,\" settle down.      Same scene.  Mr. Howard is gone.    No!  We not like to hear it!  Go to your room and shut up!   What, you deaf?  I say shut up-shut up-   Same scene on couch.   Now Molly, tell movie man what you talent do.    Country western!   Clint Black!  Ruff!   Hey, what he got I not got?  They all laugh.     Go Molly!  Go!  Number one daughter!  Behind them Leslie Miller's boyfriend, PAT, and a group of ROWDY GUYS approach.    wearing an Atomic Blast at Hiroshima Headdress.    Gladys watches in stunned silence as her daughter and only chance at State go up in flames.  Suddenly, she     There's a fake tropical look, with loads of plastic palms, etc.  CAMERA FOLLOWS Amber into area.  BANNER:   Colleen and Terry address the assembled contestants.    Loretta, seated at the bar, puts her arm around a man next to her.      A DISCO BEAT POUNDS from a boom box.  Mr. Melchoir, the choreographer, watches contestants move in fast-paced crisscrossing formations.  Amber is among them.  Miss St. Paul screws up.    Colleen and Terry smoke and drink at a tall tiki table that's covered with empties.  In the b.g., a pageant worker passes out PINK BAGS to the contestants.  All the while, TWO FAT KIDS play \"Marco Polo\" in the pool.    A very mature Miss Burnsville talks to Amber who is staring at Miss Burnsville's supernaturally well- supported chest.    Contestants hungrily fill their plates with seafood.    Amber stands beside the buffet, holding only a salad.    Amber eats at a tall tiki table with Miss Minneapolis.    Amber watches four contestants in a row practice their talents.  All are equally amazing. \"THEME from 2001: A SPACE ODYSSEY\" starts.  Miss Minneapolis steps ON STAGE - silver unitard, silver streamers, silver tap shoes.  She starts a TAP ROUTINE that RIVALS AMBER'S.",
        "Gladys": "Good God, Iris, you taped your shows over it.   Now ladies, the rest of the tape - which is now gone forever - goes on about startin' this great American journey we call American Teen Princess...Yah-so, any of you young ladies who'd like to start on that journey, you just come right down here and sign up.  And please...help yourselves to some coffee and bars...   Showtime.    Oh yah-sure, I know what some of your big city, no bra wearin', hairy-legged women's libbers say, \"Pageants are old- fashioned\" and, uh, and \"demeaning\" to the girls --   Uh... You betcha, Iris.  Yah-I think yous boys'll find that things are different here in Mount Rose...  Civil Servettes AD-LIB AGREEMENT.   For one thing, y'know, we're God fearin' folk - every last one of us...  Civil Servettes AD-LIB AGREEMENT.   You won't find a back room in our video store...  Servettes AD-LIB \"AMEN.  YAH-YOU BETCHA.\" etc.   ...that filth is better left in the \"Sin Cities.\"    Through the window a family waves to Gladys.   ...Today's \"To Do\" list includes a trip to the Mall of America.  We need outfits for the \"Physical Fitness\" number --   Y'betcha, Iris.  We still need a third judge and we need to think of a theme.  Servettes react with pleasure.   Oh, my!  Hello, Father Donigan!  Sidewalks, sidewalks?  Iris mimes drinking, \"glug, glug.\"   Iris, stop!  It's not his fault.  The communal wine just proves too temptin' for some of them.   You'd think they'd build the parking lot of America to go with the Mall of America!  Gladys pulls into a HANDICAPPED SPOT.  Servettes and CAMERA stand outside the car.  Iris points at the sign.   I said I'd move if a cripple came. Let's just run in the store and pick out some outfits.   Wait! Wait! Wait! Wait! Wait! Wait! Wait!  I just thought of the theme.  Iris and the Servette stop.   \"Proud...to be...an...American.\"  Servettes react with pleasure.   Last year?  It was, \"Buy American.\"   \"U.S.A. is A-okay.\"   \"Can I?  I'm Amer-I-Can!\"  People ask me where I get this.  I don't know, it's...maybe a gift from God or somethin'.   Oh, yeah, sure.  You know, every pageant is special, but this one is extra-special to me.  When I was seventeen, I don't know if you know this, but I was crowned Mount Rose's American Teen Princess.  And this year...drum roll please, my lovely daughter, Rebecca Ann Leeman is competin'.   Well, you know, I think everyone's doing really well considering the fact that she was so young.   You know that sometimes it's hard to understand God's great plan.   But the show must go on.  I gotta get a hold of Ted and ask him if we can use that barn light as a spot again.  So you watch the Jell-o salad, okay?    Oh, Lester.  He loves his weather, y'know.   We're not in the showroom, Dear.  Banging and fumbling.  A CORKSCREW flies into shot - CREW GUY quickly ENTERS SHOT and grabs it.   Lester?   \"Impartial?\"  Outside this house I'm Gladys Leeman, President, Civil Servettes - impartial as the day is long.  But we're inside my home now and I've gotta warn you, I'm wearin' my \"wife apron\" and \"mom hat.\"  So, I can safely say that I'm the mother of the most talented contestant Mount Rose has ever seen.   I'll field that one - Rebecca's saving her voice.  Becky smiles admiringly at Gladys.   You-betcha, Rebecca's ready.  She's been singin' and dancin' since she was knee high to a pig's eye.  Lester returns to the couch, large drink in hand.   Sammy Davis, Jr., honey.   ...Yah-then, for the \"Judges Interview,\" each girl has a ten minute get-together with the judges before the pageant...  Gladys is distracted by the HARD, YOUNG bodies.  All are.   Yes, the Judges Interview.. Each girl has a ten minute get-together with the judges prior to the pageant.  Then we have the...  A HUNKY WRESTLER, TONY, waves.   Hello, Tony.   \"Hey\" to the folks.   So, remember the three most important parts of a good interview...   Number one, American Teen Princess' don't cross their legs like streetwalkers.  The girls put their knees together.   Excuse me, Miss Penthouse Ninety- eight, put your knees together.  I could drive a boat show in there.  Gladys paces.   Ankles together.  Hands resting lightly on your laps.  Good.  Sit up straight.  Smile!   All right.  Number two: the judges are as nervous as you are.    I'll be honest.  This is a hard time for me.  This is the part of the pageant when you realize that tomorrow night, all but one of these girls will walk out of here a loser.  It's hard for me to know how that must feel, but I'm sure it doesn't feel good.  In b.g., a BIG STAGE LIGHT FALLS on Janelle's head. CRASH!  Gladys and CAMERA rush the stage.  \"Through the Eyes of Love\" continues throughout.   Welcome, welcome.  Okay, alright, now. Is this for me or the gown?  Laughter and applause trail off.   Welcome to the Mount Rose American Teen Princess Pageant.  While every contestant you'll meet tonight is special and unique, they all have one thing in common.  They're all \"Proud - to - be - an - American!\"  Wild applause!  Jazzy patriotic medley tape.  Gym doors fly open and like a Felliniesque Vegas review, CONTESTANTS enter wearing gowns and U.S. Monument Headdresses.  They struggle to maintain balance as they dance, moving only their arms, on stage.   Yah-so how kbout a big round of applause for last year's Mount Rose American Teen Princess, in a farewell performance.  Who could forget her lip- synching to \"Don't Cry Out Loud,\" by Melissa Manchester.  And here she is, Mary Johanson!  Applause!  Gladys exits.  TAPED MUSIC \"It's My Turn.\"  A NURSE pushes MARY JOHANSON out in her wheelchair, complete with portable oxygen.  Mary wears a gigantic black wig and silver gown which hangs off her boney body. She moves her lips to the words as the nurse pushes her emotionally around the stage.   Get back!  Get back, you total retard!   I'm okay, I'm okay - dress is fine. I'm okay...well, our other judges are Jean Kangas and John Dough...    Thank you, thank you.  You know, I won the talent contest by sewing these culottes, Butterick pattern 7-4-3-2. Can you believe it?  They still fit!    Thank you, thank you. Our next eontestant is ready, so let's welcome her: Tess Weinhaus!  APPLAUSE.  Tess is pushed on stage.    Huh?   Oh really - I don't think so.  Uh, Amber, I hate to be the bearer of bad news, but rules state that a costume must be okay'd at least a week in advance.  And this...  This is why we have the rule.  My goodness gracious, I couldn't allow a neckline this low on stage.  We have kids in the audience.   Oops, that's my cue.  Gladys starts out on stage as Molly Howard, dressed like a red, white and blue cowboy, runs up next to Amber. She's twirling toy guns on her fingers.   Thank you, Molly.   Now, it's with overwhelming pride that I introduce contestant number six, who also happens to be president of her class - two years running - a member of the honor roll and the new President of the Lutheran Sisterhood Gun Club - Rebecca Ann Leeman!  STAGE GOES BLACK.  SPOT HITS BECKY, who sits at the edge of the stage, holding a mic.  She's head to toe sequins in her poodle skirt, sweater, saddle shoes, etc.   Boy, I'd hate to follow that.  Wow!  Becky exits, pulling the wheeled Jesus behind her.   Voice of an angel, that one.  Iris runs self-consciously out on stage, whispers in Gladys' ear, then runs back off stage.   ...Uh, I was just told that contestant number seven, Lisa Swenson, has quite the pageant.   Well, these things happen.  At any rate, we still have one more contestant - number eight, Amber Atkins.  Gladys exits.  A taped hip, hot DRUM BEAT starts. Suddenly, Amber glides into CENTER SPOT.  (Now wearing Lisa's costume, sleeves rolled up.)  Her feet burst into an amazing routine.  The loud drum beats seem to fly from her hands and feet as they punctuate the rhythm.  There's no glitz, just unbelievable skill.  It appears effortless as she floats around stage.  Like watching Michael Jackson moon walk for the first time, you can't take your eyes off her.  She concludes, center stage, with the GREATEST THIRTY SECONDS OF HER LIFE.  The audience goes WILD!  Amber takes bow after bow - they love her.  Gladys enters quickly, mic in hand.   Okay, okay, okay!  Well, now, it's finally time to say good-bye to our judges, so they can go make the toughest decision of their lives.  PAN TO JUDGES.  They look nervous as hell.  A relaxed Hank sniffs from a paint soaked bag.   Welcome back, everyone.  Judges.  Our Second Runner-up and winner of a fifty-  Taped fanfare.  Leslie bounds forward, grabs her trophy, stands to one side.   Our next prize, a seventy-five dollar scholarship --  Audience ad-libs amazement.   ...will be awarded to the First Runner- up.  Taped DRUM ROLL.  Contestants  take hands. Iris gives Gladys an envelope and trophy.   And the First Runner-up is - (opening envelope, face drops Contestant number eight, Amber Atkins.  Ad-lib audience shock and disbelief.  Contestants are stunned.  Amber steps forward, humbly takes the trophy and stands beside Leslie.  Audience finally quiets.   And finally, the moment I know I've been waiting for...  Iris hands Gladys a LARGE TROPHY and envelope.  Mary Johanson is wheeled out wearing sash and tiara.   With a scholarship of five-hundred dollars, courtesy Leeman Furniture, and all expenses paid for next weekend when she'll be competin' for the title of Minnesota American Teen Princess...  Taped drum roll.  Gladys opens the envelope.   Our new Mount Rose American Teen Princess is contestant number - ah heck, she's my daughter - number seven, Rebecca Ann Leeman!  Polite audience applause.  Becky rushes forward.  Gladys RIPS the tiara and sash off Mary, places them on Becky.   She's the winner and we're going to state.    Hey!  Turn that float around.  You think a swan's gonna swim ass first up Main Street?   C'mon, Rebecca, you wanted it.  Now get up there.  Ride it side-saddle if you have to - like a horse.  C'mon, now.   Oh for chrissakes, everything smells like that in Mexico.   Listen, little missy, this cost your dad a pretty penny.  Now get your ass up there and show me some teeth.   Okay, I designed the float, you know. And, what's gonna happen here is that this is going to look like a glistening lake beneath the swan.   What!   This is -- what?   I swear to God she can't do anything by herself.   Oh my God!  My Baby!  The swan ate my baby!  Ow-ow-ow!  Get up, Rebecca!  Get outta there!  We've gotta go to State!  Oh hot!  Oh, damn.  I like this blouse. Rebecca!  Get up, angel face.  Time to go to State!  Ow-ow-ow!  Eventually, Gladys tries to climb up on the float.  Iris pulls her off.   Get offa me, you cow!  Gladys spins and notices the silent CROWD.   What're you lookin' at?  Huh?  A whole God Damn town of losers!  That's what I'm lookin' at!  Crowd reacts.  Gladys notices Amber and runs up to her car.   You!  You piece-a-shit trailer trash! This shoulda been you!  Damn, I shoulda killed you when I had the  The crows reacts again.  Gladys spins, noticing someone. Lester approaches.   Hey, Ted, sorry.  I didn't know your family was in the garage when I set it on fire!   Guess it wasn't a garage sale as much as it was a bake sale.  Ah- hahahahahahahaha!  Lester tries to pull her away from the crowd.   Let go-a-me, you old bastard!  She grabs a BURNING 2X4 off a float and starts swinging it.   At least you've got another daughter.  CROWD GASPS.  Then stunned SILENCE.  CAMERA CIRCLES Gladys and Lester getting reaction shots of the crowd.   Becky was my only shot at state!   Let go!  Let go of me.  Oh my God, it's COPS!  TWIN OFFICERS, followed by \"COPS\" TV CREW, run up and aggressively tackle Gladys.  As the struggle on the ground continues, crew guys go over and shake hands with the \"COPS\" crew - obviously knowing them.    He sells reproductions!  His furniture's as fake as my orgasms!  The COPS crew begins to mingle with the DOCUMENTARY crew.   Uh-huh.  No, no.  Gosh, no.  You know I still don't want to be on camera...    Yah - I just wanna say - that little bitch better watch her back at Nationals kcause I'm makin' friends on the inside... Yah-friends who have friends on the outside...   Gotta go.  Click.  DIAL TONE.    Come on out, you little blonde piece of trailer park trash!",
        "Loretta": "What do you mean, they take out her butt?   Are we on \"Cops\" again?   Hi.   Oh, naw.  Hi.   I tell Annette, I says, \"You talk to me durin' my stories, you might as well be talkin' to the wall.\"  You guys want a beer?   Say, yous boys been to the Leeman's?   Y'know, if you have, you got all the pictures of the winner you need.   Oh, Christ, it's true.  Annette begins to comb out Loretta's hair.    Let's just say who should win, who deserves to win is Amber.   She's the prettiest, y'know.  The best damn tapper.  The most smartest...   Well, excuse me, Annette, but I'm braggin' up your kid, here.  Amber's gonna be the next Diane Sawyer, y'know...   All right, they're makin' a movie.   I got a hairdo.   Why do I think Becky'll win?  You're talkin'...  Don't pinch!.  You're talkin' kbout the richest family in a small town.  It's front page news when one of kem takes a shit.  Can one of yous boys give me a ride home?   So?  Be real easy.   Anyone?   No, she's just screamin' \"Mom, Mom!\" kcause she's got Tourettes... She's Annette's kid, dipshit.   She's alive, sweetie.   She's right over there.  Camera pans over to see a semi-conscious Annette as they load her stretcher into the ambulance, shut the doors and start to pull away.  Amber runs after them.   Don't let that worry you, Annette!    Annette, why don't you just see if there's any beer left in that can and relax a bit.   You're what?!   I heard you, I was just tryin' to scare you into changin' your mind.  Oh for Chrissakes, Amber, the woman clung to your tap shoes while flyin' through the air like a Goddamn lawn dart!    D'ya think a nice cool mint'd help if I shoved your head up your ass?  Fear sweeps over the Candy Striper - she bolts down the hall!  Loretta puts an arm around Amber and starts to walk down the opposite direction.   Simple.  Just say, \"Mom, I know you sacrificed everything - relationships, dreams - your tummy, ass and thighs - all to bring me into this world.  All so I could have tap lessons and be in the pageant - the same one you were in.  But, y'know what?  I'm quittin'.\" There.  Easy as pie.   Yeah, you betcha...   Hell-no, she ain't quittin'.   \"Once a carnie, always a carnie.\"    A very shaken Amber paces.   That was your mom.  She wanted you to have this.    You-betcha.   Oh, shut up.  I thought it might help you get some sleep.   Well God-love-ya for thinkin' I still could.  Loretta pulls a bag out of a closet and hands it to Amber.   Here, your ma did want you to have this since your other one got toasted and all.  Amber pulls out an ELEGANT GREEN GOWN.   Go Hank!   She had a big ass then, she's got a big ass now.   Okay.  Take her purse.   Thank God for bunge cords.   What is wrong with you?   You stop right there.  You are a good person.  Good things happen to good people.   No.  It's pure bullshit, sweetie. You're lucky as hell, so you might as well enjoy it.  Let's get you a root beer float.   Do you guys want some shots?  I'm buyin'.    Amber sits on the picnic table.  In the b.g., Loretta exits her trailer with a FED-EX GUY.  She pats his buns as he exits.  She approaches Amber with a packet.    This came for you, sweetie.   What?  For chrissakes, spit it out.   Right by the airport - Oh, Amber...    MONTAGE BEGINS over MUSIC.  Amber emerges from Loretta's trailer, Pop Tart in mouth, book bag in hand.  SMILES.  WAVES.    In silhouette, Amber taps on the picnic table by the light of the FULL HARVEST MOON.   All right, say \"Airport Ho-Jo.\"   I got it!  Yeah, why don't ya take a Mr. Larson unloads Amber's luggage from the hearse. Loretta leans against it, arm around Amber, smoking and occasionally flipping off people who stop to stare at this unusual sight.   I'm sorry.  They're just starin'.   Okay, sweetie, that's all right. Let's go.  Let's go.   So...you're cute.  Oh, I see you're married.  You catch this in your mouth, I'll give you a present.  All right?  Open wide...  Oh, God, you got that on the first try.  Come here.  Loretta kisses the bartender.   You are cute.    Annette (left arm's been amputated and replaced with metal pincers which she hasn't mastered yet) sits at the picnic table with Amber and Loretta.  Throughout the following, Annette struggles to open a beer can which keeps flying out of her pincers.  (Handmade \"congratulations\" posters cover the lawn and trailer.   Our baby's going to Nationals! Lincoln, Alabama - look out!   Annette, just use your hand.",
        "Tammy": "Tammy Curry.  I'm signin' up for the scholarship'n'all.   ...This one's for Varsity Soccer, uh, I'm captain.  I run track, and, uh...  Right here, I'm the new President of the Lutheran Sisterhood Gun Club...   I love that one.     Yeah, you bet I do.  I mean, maybe other people think I can't win a beauty pageant.  But other people didn't think I could beat out Becky Leeman for President of the gun club, either.  And I did.  I-I-It's just like Anthony Robbins says, \"I'm a winner.  Nobody can stop me but me!\"    KABLOOM!  Tammy's John Deere thresher BLOWS UP!",
        "Curry": "Tammy Curry.  I'm signin' up for the scholarship'n'all.   ...This one's for Varsity Soccer, uh, I'm captain.  I run track, and, uh...  Right here, I'm the new President of the Lutheran Sisterhood Gun Club...   I love that one.",
        "Mary": "My winning...the Mount Rose...   ...American Teen Princess Pageant...    ...really changed my life.  The TIARA SLIPS OFF her BALDING HEAD and rolls to the floor.    Amber fixes Mary's hair, carefully brushing her balding head.  Mary smiles, oblivious.    ...Amber does my hair...once a week.   What?    Amber ties the tiara and missing clump of hair to Mary's head with a ribbon.    Beautiful... Maybe next week... a perm.    Who are you?    A NURSE now stands beside Mary.   With two weeks until the pageant...  I was practicing my talent.  Finishing my costume, brushing up on current events, and running eighteen miles a day on about four hundred calories.  I was ready.  The nurse gives her a hit of oxygen.  Mary smiles and gives a THUMBS UP from behind the oxygen mask.",
        "Johanson": ""
    },
    "imdb_rating": "6.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BOTBhYjRlYmYtNzQxZS00NmEwLTk3OTAtNjU4MDEwMmUyZDczXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "In a small Minnesota town, the annual beauty pageant is being covered by a TV crew. Former winner Gladys Leeman wants to make sure her daughter follows in her footsteps. Explosions, falling lights, and trailer fires prove that. As the Leemans are the richest family in town the police are pretty relaxed about it all. Despite everything, main rival (but nice) Amber Atkins won't be stopped. There could well be more death and disappointment to come.—Jeremy Perkins {J-26}",
    "name": "Drop Dead Gorgeous",
    "genres": [
        "Comedy",
        "Romance",
        "Thriller"
    ]
}