{
    "filename": "Eastern-Promises_script.txt",
    "imdb_id": "tt0765443",
    "imdb_url": "https://www.imdb.com/title/tt0765443",
    "characters": [
        "Nikolai",
        "Tatiana (as Sarah Jeanne Labrosse)",
        "Customer",
        "Ekrem",
        "Stepan",
        "Soyka (as Aleksander Mikic)",
        "Tatiana (voice)",
        "Azim",
        "Doctor Aziz",
        "Nurse (as Dona Croll)",
        "Semyon",
        "Helen (as Sinead Cusack)",
        "Anna",
        "Kirill",
        "Chemist"
    ],
    "dialogues": {
        "Nikolai": "I'll think of an excuse. Your excuses are like fucking fairy tales.      Nice bike.  A Ural. You don't see them anymore.  How much do you want for it?  `Sentimental value'.   I've heard of that.  You're not staying for the party?  Nor me. Chauffeurs don't get invited. You want to go for a drink instead?  Sometimes if things are closed you just open them up, you know?  Have you got a hair dryer?  You'd better burn that.  Did you finish cutting his hair?  I just thought you might want six- fifty out of his pockets.  OK, now I'm going to do his teeth and cut off his fingers. You might want to leave the room.  You too, Kirill.  If you want to dump a body, this is the place. The currents keep it under the surface until past the barrier.  Yeah, yeah, I know.  What? You never seen anybody pissed before?  Come on, Kirill. Where are your keys?  Who are you, anyway?  We went to a Kurdish place. They don't even celebrate Christmas.  I think he's had enough.  We're partners.  He's thunder, I'm lightning. He makes all the noise, I do all the damage.  Well, you got more than a driver.  I run a mini-cab business.  Albanians, Chechens, Russians. They deliver packages. Anything. Anywhere.  I only took this job so that I could get to meet you. I think you and I could do business together.  You've got water in it.  The postmen used these. In my village. When I was a boy. Russian copy of BMW flat twin.  Get a bus.  You got far to go?  I'm a driver. I even do limousines. Look...  If Semyon found out I let one of his guests walk home in the rain, he'd fire me. And I can take care of your bike. So...  So you're a midwife. Jesus.  What's it like?  I didn't faint, but it was close.  Yeah, I know, I know, it's just... it makes me upset, you know? Thinking about it. This time of year. They're back in Yekaterinburg. In the forests. Near the mountains.  I'm... sort of freelance.  I meet lots of girls called Tatiana.  In that case, no, I never heard of her.  I thought you did birth.  (quickly, without a  Oh yeah. And the ice. Whole lakes covered in ice. You don't want to walk across them, though. Ice gets thin where you least expect it.  Like I said, I'm a driver. I go left, I go right, I go straight ahead. That's it.  What?  Christmas present.  And what did he say?    I'm just enjoying myself, man...  OK, OK, Jesus...  What?       What's the matter with you?  You've drunk enough Kirill.  Her.  Yeah?  Well if my examination is over, get the fuck out of here while I get dressed.            From where?  Import-export sounds good.  Your dad is right, Kirill.       There's no point lying to him.  Ozim's nephew slit Soyka's throat. Kirill paid him to do it.    But it's OK boss. You don't have to worry...  I disposed of the body myself. The police won't find a thing.  The vory code says you don't talk to anybody about your captain. Kirill is my captain.  When I found out what had happened, I did what I had to do to clean the situation up.  It was a matter of honor. Soyka was spreading lies about Kirill. About your family. Kirill did the right thing.  You know as well as I do Soyka was talking to the police.  I've got connections with the Chechens who export cars. Soyka was speaking to the Russian desk. Scotland Yard.      Meet in a public place with lots of people around. Very wise.  And I see you brought along a body guard. Also very wise.    What address?  I don't know what you're talking about.  Anger is very dangerous. It makes people do stupid things. Forget any of this ever happened. You're in the wrong place, Anna Ivanovna.  You belong in there. With nice people. Stay away from people like me.  Nasdrovia.    I don't want to repeat it.  That he is a drunk.    And that he is also... a queer.  So why don't you go home?  FSB.   They are called FSB now.  I met him.  I thought I'd bring it back before it got stolen. Lot of villains around. Sorry about the chain.  I got that address you wanted.  A little village outside St. Petersburg. I know it. Not much of a place for a kid to grow up in. Especially not a girl.  If you want my opinion, the kid would be better off in London. Maybe with you. Why not? Tatiana's family don't sound like the kind of people who'd want another mouth to feed.  I told you.    I'm just a driver.  I'm a camera. The pictures stay in my head.  I don't know. I was passing.  Oh, and... your uncle.  Is it true he was in the KGB?  Well, he's a brave old man.    That's for sure.  Does he live with you?  I fixed it.    It should be OK now.  What are you doing here?  )  There is nothing to tell.      Slaves give birth to slaves...  No.    What shall I tell Kirill?  He offered me stars. I accepted them.  Yeah.  I know, Kirill.  Your dad don't need the bottles any more.  My father was a government worker. He fixed the cars of officials. I began by selling the spare parts when I was fifteen.  None.  I spent two years in the punishment block.  I was in solitary confinement fifteen times. I was called 'The Stump' because they couldn't shift me.  That's right. My father means nothing to me. My Mother....  Yes. I have no mother and no father. There is only the code, the vory v zakone code which I have always followed.  I am dead already. I died when I was fifteen. Now I live in the zone all the time.  I have lived off Albanians and Georgians. I steal from them within the law.  How come?  Where do they dock?  Ozim?         I thought you did birth.  Yes.  He's in Scotland. In Edinburgh. In a five-star hotel.  I'm going to need some clothes. I arrived here without any. Can you get me some?  I can't walk out of here naked.  Your uncle knew too much.  I was told to get rid of him. I was meant to send him to heaven with a bullet in his head. Instead I sent him to Edinburgh. With a first-class ticket.  He is of the old school. He understood the situation. Exile or death. Edinburgh was his idea. He said they throw a great party at New Year. And he said it was a good excuse to get away from his family.  So... just a pair of jeans and a T- shirt. A jacket. And some shoes.  The hotel is called the Caledonian.       You got my message?  It's called improvisation.      If they terminate the operation now, they will be wasting this...  You tell the Russian desk you saw stars over my heart. OK? Tell them I'm through the door.    And you can tell them I'm going to replace Semyon at the head of the London organization.  I need you to take Semyon out of the picture. I want you to arrest him.  Rape.  The girl was fourteen.  She doesn't have to.   She's dead.  But she had Semyon's baby. If you prove the baby is his and prove the girl was under age when the baby was conceived, that's statutory rape.  All you need is the baby and some of Semyon's DNA. For poetic reasons I suggest you take his blood.     How is Uncle Stepan?  Hey... wait a minute...  Is your bike still working OK?  Did you get in touch with Tatiana's family in Russia?  Good.  So the baby's still in England.  Yeah, and all the thanks I get is a pair of dead man's shoes. I listen to you.                                    *  Yes. About Semyon and the baby.                     * Thank you.                                          *  *   What are you talking about?!  You brought your bike?  I'll drive.  Kirill, a vor doesn't kill little babies.  Something like this would be bad for all of us. Your dad has gone too far, Kirill.    He's going away. When he's gone the family business will be yours.  We can be partners again. Thunder and lightning, right?  Get into the car. I'll drive you home.  You're OK, yeah?  How can I become King if the King is still in place?  Maybe I can drive you somewhere?",
        "Customer": "",
        "Ekrem": "(hesitantly  Ozim... memnum etmek.  I got tickets, Ozim. It's with Chelsea. They said there was no tickets but I got tickets for the Chelsea game.  Hey! Hey Kabuka Chelsea! Fuck you!! Yeah you! Aliverisme!! Fucker!",
        "Stepan": "Do you always rob the bodies of the dead?  Did you know that your daughter robs the bodies of the dead?  You have an uncle who doesn't steal things from the dead. Not even their secrets.  You should put this in her coffin, Anna. Bury her secrets with her bodies.  Anna, how come is it that your boyfriend isn't here to carve?  I knew he would run away from you.  Black men always run away.  What?   I am allowed to be honest?  It is not natural to mix race and race. That is why your baby died inside you.  No Anna! You don't go to someone else with this! You don't go to anyone! Nasilovanie, it means rape. Iglah, it means needle. Prostitutcia, perhaps you can guess.  I go to wash my hands.  ...like potato sacks. Kirill came down after me and he hit me until I was bleeding. Then he tried to rape me but he couldn't do it... He just got madder and madder and kept hitting me. In the end his father came down. It was the father who raped me. He shouted at his son...'if you don't break a horse, it will never be tame, Kirill'.  I told you this would happen!    I told you!  The devil is loose now.  They are in this room now.   They are cancer...  I have a friend from Ukraine who owns a gun....  ...from the war in Afghanistan.  We all know what he would have done.  He would ask if there were bullets for the gun.  I dealt with the vory v zakone when I worked for the KGB.    You cannot do deals with these people!  Have you forgotten already what I just read to you?  No!!    No!!   No!!  She was an ordinary person.  I'm hungry.    I told you!       I knew they would do this....",
        "Tatiana": "My name is Tatiana. My father died in the mines in my village, so he was already buried when he died. We were all buried there. Buried under the soil of Russia. That is why I left to find a better life.  I am so excited this morning. Yesterday a friend came back to our village and he told us all about the places on the map that I look at... Paris, Amsterdam, London. He's been there for real...  ...he said the future of everything was already happening in all those places.  When I was little, London was like a place in the Bible. I wasn't even sure if it was real. My friend has told me there is a place in London where they pay girls to sing.  He said if I sang in this restaurant I would make more money in a week than my father made in a year.  My friend said he would get me to Amsterdam and from there we could find a way into London. I have been practising my singing and  have even rejoined the church choir. I am also practising my English.  My friend says his uncle owns the restaurant where you can sing. He is sure this man will take care of me.  I was thrown down the stairs and fell onto some sacks, like potato sacks...  I am not sure I can carry on another day. The windows won't open so I can't throw myself out. They inject me every day with heroin.  Sometimes I think this is all a hallucination...  I know now for sure that I am pregnant. It hasn't begun to show yet. After I was raped they made me take pills but I guess it was too late. I am condemned to give birth to a new life. But first I will try to find a way to end my own life and spare this child the pain.  My name is Tatiana. My father died in the mines in my village, so he was already buried when he died...  We were all buried there. Beneath the soil of Russia. That is why I left to find a better life.",
        "(voice)": "",
        "Azim": "",
        "Doctor": "Shoulder distocia, I think.   Stuck on the pubic bone.  Anna, I'm trying to rotate the shoulder medially... shit...  Unidentified woman, died December 24th at 11.13.",
        "Aziz": "Speak to me...  OK, let's go.  Ok.   Call it.  Merry Christmas, Anna.  And you have to open it in front of me.  At least pretend.  Thank you.  Wear them.       It's cold.  It's fine, although I think I've had enough.    Yes, I can.",
        "Semyon": "We are closed.    Khitrova?  And his name?  So, you are Anna Ivanovna.  We must hurry. I must stir. Stir, stir or the gravy dies in my hands. Today it is family. Here is my son, Kirill. Kirill! The berries are too low, too low. And Roman, more glasses for red! Come on!  My angels. You should be practising. You must make the wood cry. Like this, like this...  You see...  Come, come, hurry, hurry.    They will be here any moment. Ok, show me this card.  It is the old card. From before the renovations. But even so, if she had worked here I would remember the name. Perhaps she ate here once. Try this.  So did you get a chance to talk to this girl before she died?  This is an agency that hires casual kitchen staff. Maybe you will have more luck there. But I think they will be closed until New Year.  Ten minutes!! Fish, fish, fish! Ten minutes! OK, Kirill, get him a drink and tell him I am coming.  Anna, I'm so sorry I couldn't help. It is sad.  Her diary?  Why did you not tell me you found a diary?  OK, Anna, this is how it will be. You will bring the diary here and I will translate it for you. Then if we get the names of any relatives I will call them myself. I am something of a... community leader for the Russians here in this unfriendly city. What do you say?  (apparently not  fish with the sauce. OK? Tomorrow, yes? Shall we say seven?  Then it is settled. But for now, you must forgive me.  Dosvedania.  Oh Anna, you always work at the Trafalgar hospital?  Ah. My dear! I wasn't expecting you so early.  Where is the original?  I will need my spectacles and a clear head. Today I broke my rules and drank vodka. Tomorrow I will translate it.  Then I will bring what I have done to your home. Where do you live, Anna?  Then maybe I can drive you home.  So what will happen to the poor child?  Who will?  Hey, hey, Maria, go back to bed.  But you have had so many presents.  I know.  Who... the fuck... are you to tell me enough?  I hired you as a driver...  ...someone to stop him killing himself.  I have no idea what business you're talking about. Now get out.  Hello Anna.     I came on tiptoes.  There are always open doors, Anna Ivanovna.  Please Anna, let me speak.  I translated the diary...  I was shocked to discover... that my son Kirill is mentioned many times.  I have known for some years that he has strayed from the path I set out for him. His mother died when he was very young.  Many bad things.  But Anna please. Let me deal with him. If the diary should find its way to the police...  Some of the things my son did are illegal. Anna, he is a good boy.  Of course.   Of course. And that is the baby?  Anna, I have made some inquiries and I have found out an address for Tatiana's family in Russia. That's where the baby belongs, no?  So... perhaps we can do a deal.  Do you understand me, Anna?  You know where I am, Anna Ivanovna.  And I know where you are.  Your friend Soyka is dead.  Don't lie to me!!  I said, don't lie to me!    My son commits a murder?  On my own doorstep? A fellow soldier! And no one thought to tell me about it?  I decide what is right and what is wrong. You do not kill a vor for no reason.  For a driver, you are well informed.  Shut up!  If you are so well informed, you will know Soyka has brothers.  Get these boxes out of sight.  It is good to have someone who I can trust to do simple tasks.  In this business, sometimes the biggest danger comes from the most stupid things. You can't afford to be careless in any area.  Nasdrovia.  So what was the lie that Soyka was spreading about my son?  Kirill had him killed for nothing important?    You play   with the Prince to do business   with the King. But if you want   to do business with me you must   be open with me. Thieves- in-law.  What was Soyka saying about the Prince?    You know it never snows in this City. And it's never hot. London is a city of whores and queers. My son...  ...I think London is to blame for what he is...  The cold gets into my bones.  And also... the KGB would be waiting for me.  Whatever they call them they are worse even than the KGB were. Maybe the KGB and the vory v zakone were partners in a marriage. We had rules, they had rules.  Now in Moscow, the thieves don't wear tattoos and the police don't wear uniforms. You never know who they are...  You've heard about these new policemen?  They get under you, over you, behind you, inside you. They are the ones you least expect.  The midwife said she had an uncle. A Russian.  So you know what he looks like.  She said he has read the diary.  We can't trust a Russian with that kind of information.    Perhaps you can deal with him.  So what did they say?    You are being very honest.  Never again do business with any member of my family behind my back.  Do they know where to find Kirill?  Do they know what he looks like?  Then tell them you will deliver Kirill to them.  Tell them to give you two days.    Kirill, go down into the cellar and bring up some brandy. Twelve bottles.  No. He stays here.   I want to talk business.  Go to the cellar Kirill.   And take your time.  Did you deal with the old man?    Tell him I changed my mind about the brandy.        So what is all this nonsense?  For what?    I am afraid of... conspiracies.  Wait.       I've done nothing wrong.  To poison me.  They took blood from me with a needle. Probably the same needle they use for all the junkies and whores and blacks and queers.  Now I probably have the fucking queer disease.  I don't know.  Someone is ahead of me. I don't like people ahead of me.      What are you talking about?  Who?",
        "Anna": "Did you get a name?  Darling... darling, can you hear me?      Oh, don't be ridiculous.  )     A bit.  Mum?       Are you OK?  You should have done beef, then.    I told you, Uncle Stepan, I found it in the handbag of a girl who died in my ward.  (suppressed, familiar  Stepan, is there an address?  Body.   Singular.  How long will dinner be?  I know.  Sorry... I'm a midwife.  I'd like to speak to the Manager.  My dad was Russian.  Ivan.  God, that's amazing. My dad made gravy just like that.  That's OK. I'll probably find out more when I get her diary translated.  I found her diary in her bag.  I was going to ask my uncle....  Dosvedania.  Yes, always.  No, thanks.     I'm driving.  What?  Thank you.  It was my dad's.    No.  It's Christmas. Everything's closed.  I don't live with Oliver any more, Uncle Stepan. I'm living back here for a bit.  He didn't run away. You make me sound like a burning building.  What the hell has that got to do with it?  It's Christmas. I'm thirty-one.  I don't give a damn about Stepan. Who has that poor baby got in the whole world?  Good. Fine.     So you know everything.  The baby is my responsibility until I hand her over to the mother. The mother is dead.  The proper authorities will all be skiing until after New Year.  What grieving?  I'm not hungry.  Is it OK?  I copied the whole thing.  I'm going to keep it. Maybe give it to Tatiana's daughter someday.  Not far.    I can drop by and pick it up.  I'm fine.    I'm on my motorbike.  After Christmas, they'll do a missing persons report.  The police.  Water?    What makes you think that?  Just across the park.  You get used to it.  How many have you got?  What, you don't know?  Left here.  So Semyon employs you?  You said he'd fire you.  Did you ever meet a girl called Tatiana?  She was pregnant.  She died last night on my shift.  Sometimes birth and death go together. She had needle punctures all over both arms. Dehydration, emaciation. Early presentation of syphilis. Probably a prostitute. At the age of fourteen.  You think Semyon's son knew her?  Just here is great.  How much do I owe you?     What? Stepan, what? I'm late for work.  Who gave you that?  Mum, you can't go through my things.  And he said he wouldn't do it so I've found somebody else.  Just because I'm back in this room doesn't mean I'm twelve again.  Look, if I don't find a relative in the next few days they'll put Christine out for fostering. Once she's in the system, she'll never get out again.  I had to call her something. It sounds like Christmas. She's very beautiful.  Tell him I've heard bad words before.  Momma, this is London.  How did you get in here?  You're not allowed in here.  What does it say about him?  I don't care about him.   I care about the baby.  It's OK.   He's just leaving.  No.  He came to see me.  The man from the restaurant.    He came to the hospital.  I know it's my fault...  Shut up both of you!!!  OK... now... what would dad have done?  You never worked for the fucking  The diary. In return he'll give us an address for Tatiana's family. For Christine's family.  Stepan, I think he was threatening to harm Christine.  How the hell can you eat?  That's their driver.    Tatiana's family.  She was fourteen! Read the diary! She was fourteen when he raped her!  You murdered her! You bastards murdered her!  You read the diary?  So how can you keep doing what you're doing?  You look the other way.  Why did you bring me this?  I don't know.     Mum... I can't get hold of Stepan.  I need to check something with him.        (echoing Nikolai's  Family is important to you people isn't it?  Tell Semyon the baby I delivered on Christmas Eve is his daughter.  When he raped her she was a virgin. Then they gave her pills. Semyon has to be the father!  She was fourteen!      She was a child!  Tell him what I said.     I don't think the driver would do anything to Stepan.  I'm so late. Sorry.  Oh God...  Paul, on my way here I made a decision.  Take my hand.  Feel my pulse.  I'm going to apply to adopt Christine.  Can you feel that?  Is it OK to talk to him for a minute?  Yes.  My uncle....  ...the one who spat in your face... He's disappeared.  If we don't hear from him soon we're going to the police...  Do you know where he is?  Edinburgh?  You can't walk out of here because you're attached to a drip. Explain Edinburgh.           I can't believe I'm doing a favor for someone just because he had the decency not to murder a member of my family.  Yeah.     It's OK.  No.  She's staying here for good.  Why do you care?  Stepan said you were kind to him. He said you were risking your own life to keep him alive.  *  *  Sonya! Is someone bathing Christine?    What happened to the patient with the knife cuts? The Russian?  Where have they taken Christine?!  You bastards!! Where will he take her?! Tell me!!  Kirill. Kirill has taken Christine. I saw him here! I thought he was coming to see you, but he wasn't, was he?  I'll drive.  Kirill, let me take the baby.  She's cold, Kirill.  Who are you really? Why have you helped us?  There's someone I can call.   He'll come and fetch us.",
        "Kirill": "So you pick up Ozim and his bitch of a wife and you bring them back here.  Then I'll think of an excuse and we can get away.  Who the fuck's that?    Hey, you've got work to do.   Go...  Papa, Ozim is here.  Hey, you OK?     You want a drink?  OK.     Merry Christmas.   Drive safely.      (hissing out of ear    You really think I do this kind of thing?  This guy's not a driver. He's an undertaker.  He knows to say he hasn't seen us, right Ozim?  That's him.  There was a time when he was like a brother to me.  Now he looks like a fucking ice cream.  Respect?   This is respect.  OK, Nikolai, he's all yours. And show some respect. This Muslim is scared of ghosts.  Aren't you going to weight him down or something?  We're partners now, man, you know?  Hey, Papa, what did I do?    This is Merry Christmas or what?  So he said to me, `who is this driver guy?' I laughed so hard.  And I said you were the safest guy I'd met. Solid.  You know my dad. He didn't say nothing. But his eyes looked impressed.  Get out of the fucking way, you black gypsy baboon.  OK, which one you going to fuck!?  Serious.      Pick one.  You hear me? You're going to fuck one of these girls.  You're going to fuck one of these girls right now. That's an order.  Come on Nikolai. Who are you going to fuck?  I'm recommending you to my dad. I want to make sure you're not a fucking queer.  Enough?  You fucking Siberian ox don't tell a vor what is enough.  I've brought you to my dad's best stable. He uses this place himself. They're all clean. Now I'm going to watch you fuck one of these girls to prove to me that you ain't queer.  So which one is it going to be?  You did OK!     You did OK.  Hey, come on, Nikolai, I've got a Christmas present for you.  Open one.  From France. Old as fuck. Old is good with wine. Sixty quid a bottle anywhere. Except I got them for ten quid a case.  `From where?' From where you don't ask. Give it here...  If my dad says OK, I can start telling you about the serious stuff. Import, export. This booze is just for gifts to Papa's friends. The real import stuff is from Kabul, you understand?  You bet it's fucking good...  Jesus Christ, Papa... You scared me....  What's wrong? We're just sampling it!  Yeah? So what? What's that got to do with me?  I swear I don't know nothing about it...    Papa, I swear to you, I was going to...  You heard him, patsan!   Get these boxes out of sight.  If you're passing, you pass. You keep going, bitch. Nikolai, come on...       You don't use my father's name! You don't say that filth about him...  Don't even look at her any more.  That's an order.  Come on Nikolai!!  And if you open your mouth again, I'll tell my driver to stick his cock inside it! Understand? Maybe that's what you want!  You want to come in?! Maybe we all get to fuck you....  That girl you fucked in front of me... you remember her? The Ukrainian bitch?  So they kick down the door. These are ordinary fucking police. They ask for her by name and they take her away. Some fucking punter must have given them her name. What gives the police the right to take our women, huh?  Hey Papa, I never seen so many old people in one place. Whose party is it out there? The angel of death?  Come on, Nikolai, help me.  What business?  Papa, what business? His business is my business.  My dad swapped a little Georgian girl for this stuff.  Hey, don't feel bad. What happened up there is just how he is. He plays people against each other. That's all. I realize more and more what he's like. Here, drink to the Georgian girl...  What?   I drink alone now.  )  Some stuff will take a long time. I've been protecting you until now.  What?  You think I don't know stuff you don't know? I am vor by birth. The stars are a birthmark for me...  Where the fuck are you going? We've got to celebrate. Help me with these bottles.  Hey! We're still partners, right? Thunder and lightning!    Nothing, baby.  Someone I know got hurt and I blamed Grandpa.  No. It's not a fight if one of you doesn't fight back.  So, today I do as I am told.  Maria.   Go upstairs.  What did they want with you, papa?  Why would they want your blood, papa?  Maybe it's about the baby.  Some bitch was out there saying you were the father of a baby.  It was nothing. Just some bitch...  The woman from the hospital.   The midwife.  Hey, you stupid fucker!!  Be quiet baby. Quiet baby.    It's  She's a little girl, Papa, a little sweet fucking girl...  Shush, shush...    You stay where you are.  I swear I didn't know my dad was setting you up.  You come on, Nikolai! We're missing the fucking party of the year out there!! Get here and drive!! That's a fucking order!!",
        "Chemist": "For methadone I need to see paper prescription."
    },
    "imdb_rating": "7.6",
    "description": "THIS SUMMARY CONTAINS SPOILERS. In London, pregnant Russian teenager Tatiana arrives bleeding to a hospital, and the doctors save her baby only. Russian-descendant midwife Anna Khitrova finds Tatiana's diary written in Russian language in her belongings and, deciding to find her family and bring them the baby, she brings the diary home and asks her uncle Stepan to translate the document. Stepan refuses, but Anna finds a card of a restaurant owned by the Russian Semyon inside the diary and visits the old man trying to find a lead to contact Tatiana's family. When she mentions the existence of the diary, Semyon immediately offers to translate the document. However, Stepan translates part of the diary and Anna discovers that Semyon and his sick son Kirill had raped Tatiana when she was 14 and forced her to work as a prostitute in their brothel. Further, Semyon is the dangerous boss of the Russian mafia \"Vory v Zakone\", jeopardizing the safety of Anna and her family. Meanwhile, Semyon's driver Nikolai Luzhin gets close to Kirill and Semyon, climbing positions in the criminal organization, but he helps Anna, her family, and the baby.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "name": "Eastern Promises",
    "genres": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMDk2ZWNlMjktYjMyNS00Mjg0LWEyNTQtMDA0NGZmOWNjNzY0XkEyXkFqcGdeQXVyNDI3NjU1NzQ@._V1_QL75_UY281_CR3,0,190,281_.jpg"
}