{
    "filename": "Eight-Legged-Freaks_script.txt",
    "imdb_id": "tt0271367",
    "imdb_url": "https://www.imdb.com/title/tt0271367",
    "characters": [
        "Chris McCormick",
        "Ashley Parker",
        "Emma",
        "Deputy Pete Willis",
        "Gladys",
        "Floyd",
        "Leon",
        "Larry",
        "Harlan Griffith",
        "Sheriff Samantha Parker",
        "Amos",
        "Randy",
        "Wade",
        "Mike Parker",
        "Bret"
    ],
    "dialogues": {
        "Chris": "Damn.  Hope you like bologna!  Oh, great.  Right on.  I've warned you not to talk about my family!  My family built this town!  Stay out of this, Sam!  Did you hear what he said?  Those mines are full of gas. One spark in the wrong place could blow this entire valley sky high. Do you really want to load that gun with toxic waste?  How could they run tests? I didn't give them permission to go into the mines.  I asked you a question, you greedy son of a bitch!  You're taking his side?    He had it comin'. But Sam Palmer... That woman abuses her power.  I'm not proud of it.  I thought you were trying the patch.  That burner's on the fritz again.    Yeah... Then a rat stole my lunch. I practically blew myself up trying to get it back.  What are you saying?  You of all people know how much my dad wanted to find that mother lode.  And maybe you didn't know him so well after all.  Don't give up on me, Gladys. I promised him I'd find the gold. And I will.  What am I, the Pied Piper...  Need some rat traps.  What is all this?  I'll have mine without Nicotine.  Rats...  Have you been smoking?  Gladys...  She really has it in for me.  What?  Me and Sam... Hook up...  Too much information.  This is where I throw up.  I'm sorry about yesterday. Wade is... He knows how to push my buttons.  On a date?  I'm kidding.   What did you want to ask?  Define strange.  How about stampeding rats?  Could have been. Never saw them do that before. I guess it qualifies as strange.  Sam... Do you want to go out sometime?  Only if you're going to say yes.  So that's a 'No.'  No... I understand... I don't know what I was thinking... Gladys has some crazy ideas. I'm gonna kill her.  No!   Let me go! Gladys!   Let me go!    Gladys is dead.  It's a little large.  They keep their food alive.  If there were giant spiders roaming the desert, don't you think somebody would've seen them by now?  That one looks kind of scratchy.  Gladys thought I should sell... but you know... I never wanted to get rich. If it was about the money, I would have sold out to Wade a long time ago.  I think I just wanted to prove the gold was down there. That my family wasn't crazy to keep looking. Even after we'd lost so much. And now... she's gone, too.  Do you know what I'm trying to say?  That's right.    That's exactly right.  Remind me never to let you do my laundry.  I'll keep that in mind.  How am I supposed to do that!?  I'm gonna need some new pants.  I'm a fast learner.  What other spiders did Joshua have?  Why couldn't he keep goldfish like a normal person?  How about the radio station?  What are you going to say?   You can't tell them the truth.  The mall?  Let's try for the mall.  My truck's at the museum.  In my other pants.  What?  Keep going!  We're sealed up at both ends.  Like that?  Then at daybreak they'll go back inside. We can walk out the front door.  Radio Shack is full of cell phones.  I'll cover you, Harlan.    Don't even think about locking this door.  It looks clear.  We've got company!  This always looks so easy on TV!  They're coming!  No!   Don't say that!  What happened?  What a shock!     Try again!  Climb!  I've got you!  No!  You're going down!  We're on our own!  We should be able to hold them off for a little while.  What the hell?  We can get out this way!  Cover me!  At least they can't follow us.  I think we're in one of the old tunnels.  Don't worry, Sam.  I don't believe it...  Toxic waste.  We can get out this way!  You did this?  We're wasting time.  One end of these lights should be connected to a generator. That'll be near the entrance.  Methane.   This cavern is full of gas.  One spark and we're all dead.  There's somebody in here!  Gladys!  Gladys, please... Can anybody help her?!  It's okay.    It's okay.  You're okay.  No...  Jesus... it's the mother lode... He was right. My dad was right...  Consuela?  Go!  Leave it!  Bret, come on!  This is our chance to kill them all.  When the power comes on, the bulb will ignite the methane and torch them!  Keep going up the tunnel. There should be a generator at the exit. Start it up and await for my signal to throw the switch.  Will be buried under tons of rock! Go!  I need to set the fuse as close to the spiders as I can. That should give us time to get clear.  Bingo.  I hate spiders.  Start the generator!  Throw the switch!  No! It's a chain reaction! The whole valley is going to blow!  I really need some pants that fit.",
        "McCormick": "",
        "Ashley": "Oh shit.  Don't antagonize her, you guys.  Can't you give 'em a break?  But, Mom!  Shut up, dork.  Do you get off on humiliating me?  I'm just trying to have fun. Don't you remember what it's like to grow up here?  You are so over protective.  You need to start trusting me.  Why do you hate him so much?  Maybe I want to stay. I could get pregnant by nineteen. Then divorce with a couple of kids I can't handle. Slap on a badge and be a trailer trash sheriff.  Maybe you're not gay after all.  You can't take your eyes off his butt.  Relax, Mom. He's hot for an old guy. I can admit it. Why can't you?  Ladies first.  Woo-hoo!  Haven't you had enough of that?  I don't know. I want to do something with my life, Bret. Help people. Maybe med school is still an option.  Thanks, Mom.  Slow down...  I do!  I don't feel...  I don't want to lose my virginity in the front seat of a monster truck.  No... I guess... I'm just not ready.  Then call them! Have a menage a trois!  Please, Bret... Please don't...  I told you to back off!  Screw you, Bret. I'm going home.  I can't believe my mom was right about you. Do you know how embarrassing that is?  No.  Don't worry about it.  Nothing.  Nothing happened, alright!   A melancholy N'SYNC ballad plays over a BOOM BOX. Ashley sits on her bed with her back to the open window. The sun setting in the distance. She rips up the photographs of Bret.          Sam, Chris and Mike stand in the doorway staring at a giant spider menacing Ashley. The spitter fires another webby blast, sticking the girl's legs to the wall.   Where are you going?   Chris has the chair in one hand to fend off the spider. With the other hand he tries to get Ashley out of the webbing. Mike stands nearby reading from his Cassiopeia.   No shit!  Use my stun g...   Chris puts himself between Ashley and the spider. He looks for a weapon. Lunges for the scissors, but the spitter nails him with a blast of glue. Chris is flung across the room and stuck to the wall by the sleeve of his shirt. He shrugs out of it and makes another grab for his scissors. He gets them.   There aren't enough wine coolers in the world to calm me down!  Outside?    You want to go outside?  You just said giant spider on the air.  He was out at the dunes.  You dork!  There's someone inside!  Mom!  They're gonna come in after us?  You're not really going to get him bigger pants are you?  I didn't know you wore cologne.    They're inside!  I can't stay in here!  What are they doing?  Here!  They're coming through the wall!  Don't waste your bullets.  Aren't the spiders in there?  What are they?  Ewww... what's that smell?  What does that mean?  Her breathing is shallow.       She's going into arrest.  Bret!  Hurry!  Oh shit.  Hurry!  Hurry, Mom!  Yo, Mom!  Earthquake!",
        "Parker": "",
        "Emma": "The SCREAM of a SAWZALL. A house in the midst of remodeling. Sections of wall are exposed. Sheets cover furniture. HANK  is the Bob Villa-poseur.  A cat sits near an open section of wall. Watching something intently. The cat charges into the wall after unseen prey.  EMMA  comes downstairs wearing her bathrobe. She clutches her ears in pain, screaming for Hank to stop. He can't hear. She grabs his shoulder and he STOPS  Why do you need to do that as six in the morning!? Do you hate me that much!?  You've been saying that for six months!  Have you seen Zeke this morning?  If he got into the wall again, it's your balls in the blender.  I'll get the tuna.  What's wrong with him? Zeke!?   Zeke!    Zeke!  I want to know what killed Zeke!   Emma bursts out of the front door, screaming hysterically. Hank is behind her with the SawzAll. A wolf spider crawls after them from inside the house.   You go, Sam.",
        "Gladys": "Did you pop him one?  Why? Because she stopped you from givin' Wade another pop?  I am.  Oh something's broken? What else is new? You need to pay these by the end of the month.  Another vein of iron pyrite?  I'm glad you like my bologna sandwiches. Maybe you should talk to Wade.  Honey, if he really does have a buyer...  Your daddy wanted to    get rich. I don't think he cared    how that happened. If he was     still alive, maybe he'd sell those    mines.  You're right... I'm just worried about how we're going to pay these bills.  What are you doing home?  Try the basement.  I wanted to surprise you with a special dinner. Turkey De La Gladys.  Not as good that way.  No.  Get back to work. I'll see you tonight.  Sam called for you.  She wants you to come by the station.  Oh please.  You two should just sleep together and get it over with.  I may be older than electricity, but I used to be a nice-looking piece of tail.  I'm not kidding. I got more action than those chicks on VIP. So when I tell you Sam thinks your butt is U.S.D.A. choice...  Don't tell me you don't think she's a fox.  See you for dinner.  Am I... dead?  I'm not in heaven?  Then what's with all the gold?  So were you.  Have you got a smoke, kid?  I blew up the kitchen.  U.S.D.A. choice.  There's a ranch!  Let's get the fuck out of here!",
        "Floyd": "Yeah, of boredom.  I'm sorry.   I haven't seen him.  Having a bad hair day?!  How about a little off the top!",
        "Leon": "",
        "Larry": "Her nine-millimeter gives me a stiffy.  Your Dad is the Mayor.  Dude, did you piss in your pants?",
        "Harlan": "... listening to W.F.R.E. Freedom radio. We've put aside the U.F.O.'s and conspiracy theories...  ... for some down home talk back with our own mayor: Wade Hale.  Lucky? I think most of us are insulted that some outsiders think our town is a perfect place to dump toxic waste.  Isn't this just your latest get- rich quick scheme?  Your mall has more employees than customers.  And your ostrich ranch?   An airstream at the far end of town. Signs identify it as: \"FREEDOM RADIO.\" A brand new humvee is parked out front.     Walls decorated with clippings about aliens, monsters, and conspiracies. Two men sit at a home built transmitter.  HARLAN GRIFFITH  wears an \"Aliens Go Home!\" T- shirt. He eats from a box of Frosted Flakes and drinks Jolt cola.  WADE HALE  is the mayor of Prosperity. A slick- haired dandy who looks more like a Vegas lounge singer than a Mayor.   They say money doesn't buy happiness.    It would be nice to get the message out. Let people know the aliens walk among us.   Chris yanks the door open in time to hear...   We have a surprise guest in the studio.   Practically the entire town has gathered outside. Sam drags Chris through the door. Wade and Harlan are close behind.   Good morning, Prosperity, Nevada. It's another beautiful day on the frontier.  No charges have been filed in yesterday's fracas between Chris McCormick and Wade Hale. And we've got...   Sam, Chris, and the kids move away from the cop car to the door. They are at the far end of town. All appears to be normal.     Harlan is broadcasting.   ... I'm saying the invasion has already occurred. The aliens are among us. But they've taken common forms. They hide in plain sight.  What happened?   Harlan has donned a vintage football helmet and pads.   Now that's great radio!  The aliens!   Sam and the    others spill out of the trailer. They head for the cop    car. As they get closer, a wolf spider climbs onto    the car's roof and gnaws on the light bar. Sam raises    her gun to blast it.   Stop!    Take us with you!  My antenna...  I could climb up to the top. I bet I could get a signal out.  I've got a signal!  I'm calling from Prosperity Nevada! We're being attacked by giant spiders! The entire town has been overrun!  They didn't believe me!  There was a massive explosion! Everybody's dead!  She hung up on me!  Defend the human race!",
        "Griffith": "",
        "Amos": "",
        "Randy": "Ha-ha!   Bret pissed his pants!  The only one coming is you, dude.",
        "Wade": "Thanks, Harlan. As I was saying, Chemical Technologies has been looking for viable storage sites. And Prosperity is lucky enough to be on that list.  I may have overestimated the need for 100,000 square feet of outlet shopping.  If the government subsidies hadn't dried up, I'd still be rolling in cash.  With one phone call I could put together a deal that would make us all very rich.  They probably don't have any.  Money pays for kids to go to college. It pays the mortgage.  It puts food on the table. Haven't the people of this town lived hand-to-mouth for long enough?  We're all gonna die in this hell hole.  Wouldn't it be nice not to worry about surviving retirement? Or taking a shot at that life-long dream?  Think about it, Harlan, you could buy a commercial transmitter and start broadcasting to a national audience.  If Chris McCormick refuses to sell his mines. The rest of us are out of luck.  I don't think it's fair for one person to wield that much power. But he's just like his father. Selfish. Greedy. And more than a little bit nuts.  That family has been digging in those tunnels since the twenties. If there was something down there, don't you think they would have found it by now?  Common sense does not apply to crazy people.  Might as well be chasing a leprechaun's pot of gold at the end of the rainbow.  ... lunatics...  ... certifiably nuts...  ... at the very least...  ... those McCormicks are just plain-old dumb.  Am I supposed to be grateful?  I want him locked up!  We have no economy! People are barely scraping by! And now we've been offered the deal of a lifetime. You don't have the right to stand in our way!  Chem-Tech did seismic analysis, vapor checks, groundwater reads, soil sampling. They found isolated methane pockets, but no benzene or hydrogen sulfide.  I'm greedy?! You're the one keeping us down so you can search for gold!  You're crazy!    Just like your father!   Prosperity is clearly visible just a mile away. The police car drives down a long road lined with fences.     Wade's new Hummer is in the driveway. A CATTLE DOG BARKS as Wade leads Sam and Mike around the side of the house.   Came out to feed my birds this morning.  Hell no!  My flock had fifty birds! Where'd they go, dammit! Who the hell steals fifty birds that can't even fly!?  I guess.   And we didn't hear a thing.  Not a peep.  Not so good lately.    I didn't kill my birds, Sam.      Is that what you think?     Mike squints into the burrow but can't see anything.     Mike is oblivious as he peers into the dark.     The BARKING CATTLE DOG SNAPS its TETHER and charges Mike. Sam and Wade see this and run after it.     Mike doesn't see the dog.    He's too busy looking in the hole.     Mike senses something approaching in the darkness. Suddenly he's grabbed from behind. Sam drags him away as CLYDE the cattle dog continues BARKING.      Mike and Sam are in the cop car.     Wade is at Sam's window.   I need to know what happened to my birds!   CLYDE runs   next to the car. Suddenly he disappears underground   with a YELP. Only still frame on a DVD player will   capture the trapdoor spider's lunge from a camouflaged   den. The dog's empty collar rolls to a stop in a cloud   of dust.    Just give me the usual.  No!     Please!  Thank you!    Watch it!  Why didn't we see them earlier?  You're the sheriff.  But the signal won't get out of the valley. That's why we couldn't sell any of the damn things.  Great idea.    You should do that.  Hey, loverboy... you've got a town to save.  I'll be right here waiting.  Over here!  Where are you taking us?    I thought you were a goner, boy!  Come on, Bret!  We're trapped again!  Uh... yeah... he's right.   We can't get out that way.  I knew you'd never sell... We're under my property so...  I didn't have a choice! I was broke! They gave me a hundred grand!  My birds! You see, Sam? I wasn't lying! That's what I can put on the insurance form... giant spiders!  Gold! Gold!     Look!    It's everywhere!  Get as much as you can!  So you can keep it all!?   Hell no!   Mike and Gladys gather at a generator just shy of the tunnel exit. Mike tries to start the generator. It won't catch.    Mike is at the generator as Sam and Ashley ride up on the motorcycle.      Sam looks back to see Chris running toward her. Consuela is on his heels. The glow of a fireball is right behind them.    Sam and Chris dive out of the mine opening. A pillar of flame shoots out behind them.   Ashley and Mike are nearby. The town is visible just a mile away.     The EARTH BEGINS TO SHAKE VIOLENTLY.",
        "Mike": "He's huge!  Like what?  You ate snake?  Yeah. They're definitely getting bigger.  All from eating these bugs?   Maybe I should try some.  Run, little guys.  I could get away.  Are the new tarantulas in here?  That is too cool.    Bad!   Bad Consuela!   The multi-eyed spider's PANORAMIC VISION. Mike looms large at the edge of the glass, wagging his finger.     Mike stares into the many eyes of Consuela.   Do that again and I feed you to the parrot.  See you tomorrow, Joshua!  You   should see them, Mom. Each one   has a unique feeding behavior. The   spitters fire poisonous snot. The   tarantulas mummify their prey. The   jumpers can...  He studies them. NASA uses spider webs in outer space. And for medicine. They've been here forever, and they'll be here long after we're all dead.  Nightmares are cool.  It's from Dad! He didn't forget my birthday. I told you he wouldn't.  Rockin'!  Cassiopeia 2304 with 64 megs of ram. Integrated modem. Voice recording capability. This baby is tight.  He forgot to send the batteries.  Why?  You have the right to remain silent. Anything you say can and will be used...  I read her her rights.  What's your excuse!?  I'm just going to the mall.  A pack of cigarettes?  Where's this secret location?  Norman, you know my mom's the sheriff.  What?  Where's aisle five?  Hello?   Joshua? Charlie?    Cool! The house is deserted. No sign of Joshua Taft or his bird. The spider tanks are shattered. There is broken glass everywhere.    Mom! Mom!   All Josh's spiders are gone!  But Joshua is gone!  Mom, I'm serious! You're not listening!     A MULTI-EYED SPIDER'S VIEW of Mike at the top of the burrow.     The kid is FRAMED IN the burrow opening just a few feet away.    We have to go back.  That was a trapdoor spider's burrow.  Joshua was feeding his spiders bugs from the creek. And they were getting bigger.    That could be why the other species are coming out into the open. They're trying to get away from the giant spiders. The ecosystem is out of balance.  Maybe I am losing it...   The black and white classic: Tarantula, plays over an old TV and VCR. Mike is at his computer, downloading a spider encyclopedia into his PDA. A message flashes across the screen: CONNECTION LOST. Mike picks up the telephone.   Hello?   Hello?  Holy God...  Mom!   Wait!  Spiders shed their skins when they grow.  Like snakes.  Maybe not.  This is a tarantula's leg. Or it was. It's an exoskeleton, to be scientific.  See! Male tarantulas wrap their prey in webbing. Tight like a mummy. The food stays alive so they can eat it later.  A spider's leg!  Careful!  Those are quills! Tarantulas can flick them at you like darts!  Tarantulas! Wolfs! Trapdoors! Joshua had a ton of exotics!  The jumpers hunt in daylight. But not the others. They only come out when the sun goes down!   Mike checks the phone. Still dead. He types at his computer, entering the specification of the piece of exoskeleton. A digital representation of a spider grows on his monitor screen. Showing Mike exactly how big the spider would be after shedding this skin. Mike is distracted by the LOUD MUSIC coming from Ashley's room.   Can't you turn that down?!  I'm doing spider research!  Wow!   A scytodes spitter!  The scytodes spits a gooey discharge to immobilize their prey.    Get under it! Stab it in the abdomen! They don't have any armor down there!  I told you! I told you all!     But nobody ever listens to Mike! Still think I'm crazy, Mom?  Spitters, jumpers, orb weavers, tarantulas...  Giant spider invasion.  Wait, Mom! The noise will attract more of them!  Look out!  You stink.  Trapdoors!    They're all around us!  I didn't download that part!  Get away from the doors!  Glass won't stop them!  Hurry up!  For the last time! They can't handle the sunlight. They were waiting in the mines for the sun to go down!  We won't make it that long.  They're growing very fast. They need food to sustain that kind of development.  I don't.   It's spider repellent.  Arac attack!    We've gotta go!  Where do you grow your weed?!  They're going to kill us, you stoner!  Not until daylight.  I've seen one of these before!  The creek where Joshua gets his spider food. There was one in the water.  That's what I was talking about, Chris. Presents from the male tarantula to the female.  I think you should stop.  They don't have hair. They aren't fully grown tarantulas.  They're giant babies!  Consuela.  Mom!  It needs gas!  It needs gas!  He's coming!  We'll never get out in time!  Oh no... she's molting!  Consuela!   No!     Bad!   Bad Consuela!   He throws his Cassiopeia PDA at the spider's face...  Chris uses this moment of confusion to grab his machete and drive it deep into the spider's unprotected abdomen...  The tarantula screams.  Chris leaps up and runs, scooping up Mike.   They dive into the back of the humvee.  Consuela tries to follow but is mortally wounded. She collapses in the dust. The TOWN EXPLODES in the b.g. The earth itself begins to collapse.    Look out!",
        "Bret": "Hang on, babydoll!  There is something very sexy about an older woman in uniform.  I could always ride her from behind.  No sweat, babydoll.       We'll hook up later.  Larry, do we know anybody at City Hall who can mark this go away?  Oh, yeah. He signs your paycheck.  Relax, bee-otch. It's all good.   Bret smokes a Phillies Blunt as he donuts his TRUCK. Ashley laughs hysterically. Bret steers them around to the back of the truck stop. He SKIDS to a stop.   No such thing.     Norman's bud is da'kine.  When I medal at the X-Games, Honda will give me full sponsorship. Then I'll take you with me on the Supercross tour.  Are you still thinking about going away?  Not if you keep hanging out with me.  I thought you loved me.  Then what's the problem? You want to leave town. You don't want to make out.  What?  Why didn't you say so? We can go outside. I've got a blanket in the back.  Tammy and Larry do it every night!  Come on,   Ashley. Mommy's not around.    You don't have to play the good   girl. Let Daddy give you what you   really want.  My balls? Ahh! My balls! I pissed myself?! Damn, bee-otch!  Ashley, wait!  Please!   Open the door!     I'm sorry!  Open the door, baby!      I love you! I want to marry you!      Have my children! Please!  Get out of here! They're coming!  Ride!  I didn't touch her!     I swear!  You're going back in there?!       Are you all crazy!?  No way!   I'm not going!  No, we can't. Isn't that tunnel blocked off, Dad?  So the female's around here?  Nice work, Doc.  Dad!  I'm sorry I..."
    },
    "imdb_rating": "5.5",
    "description": "After a long absence, Chris McCormick returns to his quiet hometown of Prosperity, Arizona, to reopen his late father's mines. However, a chemical spill and lethal toxic waste have created an unstoppable army of giant spiders who prey on the unsuspecting locals, turning Prosperity into an endless buffet. Now, it's up to Chris; Sheriff Sam Parker; her son Mike; Sam's plucky daughter, Ashley; the conspiracy theorist, Harlan, and a handful of survivors to stop the hairy menace, and save the town. But, who can stand in the way of the disgusting eight-legged freaks?—Nick Riganas",
    "name": "Eight Legged Freaks",
    "genres": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMzMzODg5MDk4OV5BMl5BanBnXkFtZTYwNTM0Nzc3._V1_QL75_UY281_CR0,0,190,281_.jpg"
}