{
    "filename": "Elizabeth-The-Golden-Age_script.txt",
    "imdb_id": "tt0414055",
    "imdb_url": "https://www.imdb.com/title/tt0414055",
    "characters": [
        "Savage",
        "Margaret",
        "Annette",
        "Sir Walter Raleigh",
        "Robert Reston",
        "Queen Elizabeth I",
        "Infanta",
        "Thomas Babington",
        "Bess Throckmorton",
        "Mary Stuart",
        "King Philip ll of Spain",
        "Laundry Woman",
        "Sir Francis Walsingham",
        "Lord Howard",
        "Sir Christopher Hatton"
    ],
    "dialogues": {
        "Savage": "We live in dangerous times.    (  No, Tom! Don't kill me! I don't want to die!",
        "Margaret": "`Mud and leaves'! I nearly died!  She liked him. I could tell.  Bess! We're summoned.",
        "Annette": "My Queen.    And when the bastard usurper is dead, my lady will be queen.  The Warden, my lady.  Madame! Madame!  Blessed Mother of God pray for us!",
        "Robert": "",
        "Reston": "At last.  Your majesty has a merciful soul.  The light of purifying fire.  My time has come, majesty. Send me home.  I ask for your forgiveness.  His weakness endangers us all. He can't go on with us. And we can't leave him behind.  Who will help him?  Si ambulam in medio umbrae mortis, non timebo mala -  Quoniam tu mecum es, Domine. Virga tua et baculus tuus, ipsa me consolata sunt -  Lord have mercy on the soul of your servant, who gives his life for your eternal truth...  Lord, be with us as the end approaches.  We will not fail in our duty. We look beyond death, to eternity.  You have it?  What do you think? There must be clear and valid authority.  We wait on a direct order.  One more journey, my friend. Then - consummatum est! It is finished.  `If our forces are in readiness, both within and without the realm, then your Queen commands you to set the gentlemen to work.'  (with quiet steely  I have done what I was sent to do.  Send me home.",
        "Infanta": "",
        "Thomas": "",
        "Babington": "Make your peace with God.  Francis is about to die! We must act!      R  Why don't we strike? What's he dying for? Is this part of your plan?  Now!  Elizabeth!",
        "Bess": "Not too soon, my lady.  I'll want the marriage if I want the man.  An honest man. With friendly eyes.  And sweet breath.  Smile lines, my lady.  I beg your majesty's forgiveness.  The puddle man is outside, majesty.   He's rather sweet.  Well, wouldn't you?  I did very little, sir. You'd already caught the Queen's eye.  Him, my lady?  The pirate is not too bored by the vanities of the court, I hope.  If you can bring yourself to leave the dazzle of the bright lights for a moment -  That can only mean the Queen.  It seems you've presumed after all.  Tell me what it is you really want.  In that order?  It seems rather a long way round.  Which you will no doubt name after yourself.  Of course.  Why should I tell you that, sir?  My advice to you is, say what you mean to say as plainly as possible. All men flatter the Queen in the hope of advancement. Pay her the compliment of truth.  Elizabeth Throckmorton.  Everyone calls me Bess.  He is certainly charming, my lady.  He hopes for glory in his New World. He dreams of building a shining city.  It's refreshing to meet a man who looks to a world beyond the court.  Well? Are you satisfied with the Queen's favour?  I expect I'll think of something.      George! What's wrong? Is your father alright?  I was worried. You must send me no more letters. You know what would happen if I was caught.  Do you need more money?  You are known Papists.  I cannot betray the Queen.  Don't put me in danger like this.  I'm sorry.  Majesty?  I hope you believe that I like you for yourself, my lady.  No doubt, my lady.  Yes, my lady.  Yes -  The Queen asks me to assure you -  That is unfair -  Let me speak!  The Queen shouts at you once, and you sulk like a child. I thought you more of a man than that. And I thought you a better friend to the Queen. Her every move is watched by a hundred eyes. Assassins plot to kill her. Enemies prepare to overwhelm her country. And you say she's playing games?    Oh! It's you!  My prayer's done.  And I thought I prayed in silence.  A man was hanged today. A Papist. I knew him well. He was my cousin. He died because I gave information. I gave information to prove my loyalty. Because I was afraid.  He told me he wanted to change. Become part of the new England. I was afraid that he was lying to me. But what if - what if it was true?    I thought so.   Please! I'm innocent! I've always been a loyal servant of the Queen. I'd never betray the Queen, never -  She plotted to kill you.  So do we all.  She'll go on lying til you cut out her traitor's heart.  I used to be quieter, majesty.  Thank God you've come. I've never seen her so distressed. She's been alone in her rooms since morning. She'll see no one.  No. But she needs you. I know she does.  I'll be quick. I have something to tell you. But I ask for nothing. Is that understood? Your life is your own. Nothing will change.  I'm -  No one knows. My plans are made. I shall ask the Queen for permission to leave court. I shall live quietly in the country with - with my child. The Queen must know nothing.  To my mother's house.  I'm a ward of the Queen. I can't court a man without her permission. I can't marry without her permission. As for having a child -  As soon as I'm allowed.  Hush! We've no choice. You know it as well as I do.  Please listen. You once said to me, `Whatever I have to give, ask and it's yours.' Do you remember?  I ask that you forget me. Go to your ship. Do your duty. Forget me.  Here, my lady!  Yes, my lady.  Yes, my lady. It is - my husband's child.  156                                                                156",
        "Throckmorton": "He's old. He won't live long now. Thank you for coming, dear Bess.  I need your help.  My father is a tired old man. We don't want to hide like this anymore. We both want to get back to court.  The Queen loves you. Speak to her.  You are not betraying her. My father and I will embrace the new faith.  Cousin Bess, we've known each other all our lives. I would do nothing to harm you.  If they catch us, they will kill us. Our lives are in your hands.  No!  Enough! You want a name, I'll give you a name.  156                                                                156",
        "Mary": "15                                                                  15   This is so pretty I'm inclined to send it as a present to my dear cousin Elizabeth.  It is an intimate garment, of course. But even Elizabeth must have the occasional intimate moment.  Our friends write to give us hope.  That's enough, Annette. Slit her throat? Please.  Here's my noble jailer, come to smack my hand.  Have I sinned again, sir?  Oh, you jailer. I don't trust you.  See how I pass my time in my lonely prison.    William!  You come with me, William.   Why do we have to talk about war? Tell us your nice news, William. Are you married yet?   Then we must find you a nice sensible English wife.   29                                                               29    Dismissed? On whose orders?  Do stop snivelling.  The Warden? My Warden?  What have you done now, you bad man? Sent away my laundress? How am I to have clean clothes? Or do you want me to go about naked?  How am I to send my intimate letters?  And you will read them.  Am I to have no privacy?  You disappoint me, sir.  The Queen! Am I not a Queen too? What if I wish to write a love letter? Is Elizabeth to be sent a copy? Is she so starved of lovers that she must feed on mine?  Tormentor! Is that Elizabeth's order too? That you torment and mock me?  They say she's a beautiful woman. Is she so very beautiful?  She's called the virgin queen. Why is that, sir? Can it be that no man will have her?  My friend, forgive me. You are my friend, are you not?  I shall send no more letters. I shall stay here quietly, in my prison. With you.  61                                                                61     Bring me pen and paper, Annette. They wait on my reply. Hurry, now, hurry!     I pray for my cousin Elizabeth. Do you think she prays for me?  76                                                                 76    You bring news?  Yes?  Yes?  Unharmed?  Me? What has any of this to do with me?  Your master?  Traitors. I'm surrounded by traitors. Who am I to trust?  Only my little one...  Who are you to sit in judgement on me? By what authority do you condemn a Queen? God alone has made me what I am. He is my only judge. Raise your law above God's law, and what law remains? In your vanity and ignorance you set loose the monster of misrule. You know neither who you are nor what you do. But I know who I am. I die as I have lived - trusting in the mercy of my God - a Queen.  4                                                              84  Your face tells me. It's decided.  Please don't cry.  I forgive you with all my heart, for now, I hope, you will make an end of all my troubles.",
        "Stuart": "15                                                                  15   29                                                               29    61                                                                61      76                                                                 76",
        "Laundry": "",
        "Woman": "",
        "Lord": "",
        "Howard": "Why do you go among the people, majesty? I tell you plainly, you will be murdered! Every Catholic in England is a potential assassin!  We know the Catholics take their orders from Spain. The Spanish speak openly of Mary Stuart as Queen of England in waiting.  But while she lives, majesty, she is a beacon that draws our enemies' eyes and hopes.  Treachery, ma'am. All Catholics are traitors! Their loyalty is to the Pope of Rome.  Immense numbers, majesty!  We must act, majesty. Our inaction is taken to be weakness.  Here, majesty.  Not closed, majesty. But the gun positions here, and here, have full command of the channel.  Majesty, this vast Armada will surely smash through our naval defences. We must be prepared for the worst.  We're decisively outgunned, Drake. We are losing too many ships. We must defend the coast.  I tell you, we're out-gunned. Do you want to lose the whole fleet?  We can't get near them."
    },
    "imdb_rating": "6.8",
    "description": "Two faiths, two empires, two rulers - colliding in 1588. Papist Spain wants to bring down the heretic Elizabeth. Philip is building an armada but needs a rationale to attack. With covert intrigue, Spain sets a trap for the Queen and her principal secretary, Walsingham, using as a pawn Elizabeth's cousin Mary Stuart, who's under house arrest in the North. The trap springs, and the armada sets sail, to rendezvous with French ground forces and to attack. During these months, the Virgin Queen falls in love with Walter Raleigh, keeping him close to court and away from the sea and America. Is treachery or heroism at his heart? Does loneliness await her passionate majesty?—<jhailey@hotmail.com>",
    "name": "Elizabeth: The Golden Age",
    "genres": [
        "Biography",
        "Drama",
        "History"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTgzODIwNzcyMF5BMl5BanBnXkFtZTcwMTg0MTQ1MQ@@._V1_QL75_UY281_CR4,0,190,281_.jpg"
}