{
    "filename": "Eternal-Sunshine-of-the-Spotless-Mind_script.txt",
    "imdb_id": "tt0338013",
    "imdb_url": "https://www.imdb.com/title/tt0338013",
    "characters": [
        "Clementine Kruczynski",
        "Dr. Mierzwiak",
        "Train Conductor",
        "Young Bully",
        "Young Joel",
        "Rob",
        "Joel's Mother",
        "Joel Barish",
        "Stan",
        "Mary",
        "Young Bully (as Paul Litowski)",
        "Carrie",
        "Patrick",
        "Frank"
    ],
    "dialogues": {
        "Clementine": "Yeah, hi, I have a one o'clock with Dr. Mierzwiak.  Clementine Kruczynski.   Hi.  After a moment, Clementine appears in the doorway.  Mary leads her down the hall, not looking back.   Okay, I guess.   Okay, I guess.   I don't care.  He turns it on, smiles at her, gestures for her to begin.   Well, I've been having a bad time of it with um, my boyfriend, I guess.   What?  No.  I don't like the term boyfriend.  It's so gay.  Mierzwiak nods.  He's attentive, pleasant, and neutral throughout.   Maybe gay isn't the right word.  But, anyway, it's been rough with him... whatever the fuck he is.  Heheh.  My significant other... heh heh.  And I guess on a certain level, I want to break it off, but I feel... y'know... it's like this constant questioning and re questioning.  Do I end it?  Should I give it more time?  I'm not happy, but what do I expect?  Relationships require work. You know the drill.  The thing that I keep coming back to is, I'm not getting any younger, I want to have a baby... at some point... maybe... right?  So then I think I should settle -- which is not necessarily the best word -- I mean, he's a good guy.  It's not really settling. Then I think maybe I'm just a victim of movies, y'know?  That I have some completely unrealistic notion of what a relationship can be.  But then I think, no, this is what I really want, so I should allow myself the freedom to go out and fucking find it.  You know?  Agreed? But then I think he is a good guy and... It's complicated.  Y'know?   Um, well, he's a fucking tidy one --   God, yes.  You've saved my life!  The waitress pours the coffee.    Ain't that the question of the century.  The waitress is not amused.   You got grilled cheese and tomato soup?    And some cream, please.  Clementine looks around the place.  Her eyes meet Joel's before he is able to look away.  She smiles vaguely.  He looks embarrassed, then down at his journal.  Clementine pulls a book from her purse and starts to read.  Joel glances up, tries to see the cover.  It's blue.  He can't read the title.    Hi!  Joel looks over.   Why?   Why are you sorry?  I just said hi.   Really?   Aw, c'mon, live dangerously.  Take the leap and assume someone is talking to you in an otherwise empty car.   It's okay if I sit closer?  So I don't have to scream.  Not that I don't need to scream sometimes, believe me.  But I don't want to bug you if you're trying to write or something.   Oh.  So...  She hesitates in the middle of the car, looks back where she came from.   No, I don't want to bug you if you're trying to --   Just, you know, to chat a little, maybe. I have a long trip ahead of me.  How far are you going?  On the train, I mean, of course.   Get out!  Me too!  What are the odds?   Ucch, really?  You're kidding.  God. Bizarre small world, huh?  Yeah, that's me: book slave there for, like, five years now.   Jesus, is it five years?  I gotta quit right now.   Well, I'm there.  I hide in the back as much as is humanly possible.  You have a cell phone?  I need to quit right this minute.  I'll call in dead.   I'll go on the dole.  Like my daddy before me.   Ah, the hair. (pulls a strand in front of her  eyes, studies it Blue, right?  It's called Blue Ruin.  The color.  Snappy name, huh?   Blue ruin is cheap gin in case you were wondering.   Exactly!  Tom Waits.  Which song?   Anyway, this company makes a whole line of colors with equally snappy names.  Red Menace, Yellow Fever, Green Revolution. That'd be a job, coming up with those names.  How do you get a job like that? That's what I'll do.  Fuck the dole.   Purple Haze, Pink Eraser.    Someone's got that job.  Agent Orange!  I came up with that one. Anyway, there are endless color possibilities and I'd be great at it.   My writing career!  Your hair written by Clementine Kruczynski.  The Tom Waits album is Rain Dogs.   I think.  Anyway, I've tried all their colors.  More than once.  I'm getting too old for this.  But it keeps me from having to develop an actual personality. I apply my personality in a paste.  You?   Well, you don't know me, so... you don't know, do you?   Yeah, I got it.  There's a silence.   My name's Clementine, by the way.   No jokes about my name?  Oh, you wouldn't do that; you're trying to be nice.   Huckleberry Hound?   Huckleberry Hound!  What, are you nuts?    Oh my darlin', oh my darlin', oh my darlin' Clementine?  No?    Yeah.  Although it hardly fits.  I'm a vindictive little bitch, truth be told.    Why wouldn't you think that about me?   Now I'm nice?  Don't you know any other adjectives?  There's careless and snotty and overbearing and argumentative... mumpish.   I just don't think \"nice\" is a particularly interesting thing to be.  The conductor enters the car.   What is nice, anyway?  I mean, besides an adjective?  I guess it can be an adverb, sort of.  The conductor turns to Clementine.  She fishes in her bag.   It doesn't reveal anything.  Nice is pandering.  Cowardly.   And life is more interesting than that. Or should be.  Jesus God, I hope it is... someday.  I know it's here.  The conductor and Joel watch as she gets more agitated.   I don't need nice.  I don't need myself to be it and I don't need anyone else to be it at me.   Shit.  Shit.  I know it's here.  Hold on.  She dumps the contents of the bag onto the seat and sifts frantically through.  Joel sees the book she was reading in the diner.  It's The Play by Stephen Dixon.   Damn it.  DAMN IT!  Oh.  Here.  She hands the conductor the tickets, smiles sweetly.  He punches it, hands it back to her, and walks away.   Joel?  It's Joel, right?   I'm sorry I... yelled at you.  Was it yelling?  I can't really tell.  Whatever, I'm a little out of sorts today.    My embarrassing admission is I really like that you're nice.  Right now, anyway.  I can't tell from one moment to the next what I'm going to like.  But right now I'm glad you said, \"that's okay\" to me.  That was nice of you.   Oh, okay.  Well, sure, I'll just... (stands, throws bag over  shoulder Take care, then.   (heading toward other end of  car Unless I get that hair-color-naming job.  Clementine sits and stares out the window.   No, that's okay.  Thanks, though.   I don't want to take you out of your way.   Yeah?  He pulls over.  She climbs in.  They drive.   You're not a stalker or anything, right?   You can't be too careful.  I've been stalked.  I've been told I'm highly stalkable.  I don't need that.    You know Wilmont?   Wilmont.  Near the high school.  Joel turns.  They drive in silence.   Look, I'm very sorry I came off sort of nutso.  I'm not really.   So you like bookstores, huh?   Me too.  It is Rain Dogs, by the way.   The song's 9th and Hennepin.  I spent most of the train ride trying to remember.  \"Till you're full of rag water and bitters and blue ruin/And you spill out/Over the side to anyone who'll listen.\"  Remember?   Remember?  \"And you take on the dreams of the ones who have slept there/And I'm lost in the window/I hide on the stairway/I hang in the curtain/I sleep in your hat...\"  Oh, shit.  I'm so stupid.  Sorry.   I'm just a bit of a wreck.  \"I sleep in your hat\" makes me cry.  Me.  Joel pulls over.   Thanks very much.  That was very nice of you.   Oh, geez, I'm full of shit.  I already told you that.  Anyway.  See Ya.  Clementine opens the car door.    Hey, do you want to have a drink?  I have lots of drinks.  And I could --   Never mind.  Sorry, that was stupid.  I'm embarrassed.  Good night, Joel.    Joel stands in the living room, somewhat nervously.  He tries to calm himself by focusing on the surroundings.  He looks at the books on her shelves.  Clementine is in the kitchen.  We see her as she passes by the doorway several times, preparing drinks and chatting.   Thanks.  I like it, too.  Been here about four years.  It's really cheap.  My downstairs neighbor is old so she's quiet, which is great.  And the landlord's sweet, which is bizarre, but great, and I have a little porch in the back, which is great, because I can read there, and listen to my crickets and...  Clementine is in the living room now with two gin and tonics.   Two blue ruins...  Joel is looking at a framed black and white photograph of crows flying.   You like that?   This... someone gave that to me, just like, recently.  I like it, too.  I like crows.  I think I used to be a crow.  She caws and hands Joel a drink.   Do you believe in that stuff? Reincarnation?   Me neither.  Oh, there's an inscription on the back.  The way a crow/Shook down on me/The dust of snow/From a hemlock tree/Has given my heart/A change of mood/And saved some part/Of a day I rued.    Yeah.  I'm not, like, a Robert Frost lover by any stretch.  His stuff seems strictly grade school to me.  But this made me cry for some reason.  Maybe because it is grade school.  Y'know?   I miss grade school.  I don't know why I'm calling it grade school all of a sudden.  When I went we called it elementary school.  But I like grade school better.  Sounds like something someone from the forties would call it. I'd like to be from then.  Everyone wore hats.  Anyway, cheers!   God, that feels so fucking good.  Take yours off.   Yeah?  Well, have a seat, anyway.  Joel sits in a chair across the room.  Clementine finishes her drink.   Ready for another?   Well, I'm ready.  Put some music on.  Joel crosses to the CD's and studies them.   You pick it.   I don't know!  I can't see them from here, Joel!  Just pick something good.  Joel studies the unfamiliar CD's.  He picks up Bang On a Can performing Brian Eno's Music for Airports to look at. Clementine reenters with her drink.   Oh, excellent choice.  She grabs it and sticks it in the CD player.  The music is dreamy and haunting and slow.  Clementine falls back onto the couch, closes her eyes and sips her drink.   Mmmmmmm.  Way to go, Joel.  You pick good.  Joel sits down in his chair and drinks.  There's a silence, which seems fine to Clementine but makes Joel anxious.   No, stay.  Just for a little while.  Refill?   I know a man who needs a refill.  She grabs Joel's drink from his hand, takes it into the kitchen.   God bless alcohol, is what I say.  Where would I be without it.  Oh, Jesus, Mary, and Joseph, maybe I don't want to think about that.  She giggles.  Joel looks around the room again.  There are several potatoes dressed as women in beautiful handmade costumes: a nurse potato, a stripper potato, a schoolteacher potato, a housewife potato.  Clementine returns with Joel's drink and a refill for herself.   Drink up, young man.  It'll make the whole seduction part less repugnant.  Joel looks a little alarmed.   I'm just kidding.  C'mon.  She sits back on the couch, closes her eyes.  Joel watches her, looks at her breasts.  She opens her eyes, smiles drunkenly at him.   Y'know, I'm sort of psychic.   Well, I go to a psychic and she's always telling me I'm psychic.  She should know. Do you believe in that stuff?   Me neither.  But sometimes I have premonitions, so, I don't know.  Maybe that's just coincidence.  Right?  Y'know, you think something and then it happens, or you think a word and then someone says it?  Y'know?   Exactly.  Exactly!  That's exactly my feeling about it.  It's hard to know. Like, okay, but how many times do I think something and it doesn't happen?  That's what you're saying, right?  You forget about those times.  Right?    But I think I am.  I like to think I am.   It's helpful to think there's some order to things.  You're kind of closed mouthed, aren't you?   Oh.  Does that make you sad?  Or anxious?  I'm always anxious thinking I'm not living my life to the fullest, y'know?  Taking advantage of every possibility?  Just making sure that I'm not wasting one second of the little time I have.   You're really nice.  I'm sorry I yelled at you before about it.  God, I'm an idiot.   I like you.  That's the thing about my psychic thing.  I think that's my greatest psychic power, that I get a sense about people.  My problem is I never trust it.  But I get it.  And with you I get that you're a really good guy.   And, anyway, you sell yourself short.  I can tell.  There's a lot of stuff going on in your brain.  I can tell.  My goal... can I tell you my goal?    What's the goal, Joel?  My goal, Joel, is to just let it flow through me?  Do you know what I mean? It's like, there's all these emotions and ideas and they come quick and they change and they leave and they come back in a different form and I think we're all taught we should be consistent.  Y'know? You love someone -- that's it.  Forever. You choose to do something with your life -- that's it, that's what you do.  It's a sign of maturity to stick with that and see things through.  And my feeling is that's how you die, because you stop listening to what is true, and what is true is constantly changing.  You know?   Like I wanted to talk to you.  I didn't need any more reason to do it.  Who knows what bigger cosmic reason might exist?   You're very nice.  God, I have to stop saying that.  You're nervous around me, huh?   I'm nervous.  You don't need to be nervous around me, though.  I like you. Do you think I'm repulsively fat?   I don't either.  I used to.  But I'm through with that.  Y'know, if I don't love my body, then I'm just lost.  You know?   With all the wrinkles and scars and the general falling apart that's coming 'round the bend.  So, I've been seeing this guy...  Joel looks slightly crestfallen.    Well, for the last week, anyway!  He's kind of a kid.  Kind of a goofball, but he's really stuck on me, which is flattering.  Who wouldn't like that?  And he's, like, a dope, but he says these smart and moving things sometimes, out of nowhere, that just break my heart.  He's the one who gave me that crow photograph.   That made me cry.  But, anyway, we went up to Boston, because I had this urge to lie on my back on the Charles River.  It gets frozen this time of year.   Exactly!  I used to do it in college and I had this urge to go do it again, so I got Patrick and we drove all night to get there and he was sweet and said nice things to me, but I was really disappointment to be there with him. Y'know?  And that's where psychic stuff comes in.  Like, it just isn't right with him.  Y'know?   I don't believe in that soulmate crap anymore, but... he says so many great things.  We like the same writers.  This writer Stephen Dixon he turned me on to. And he's cute.  It's fucked up.  Joel, you should come up to the Charles with me sometime.   Yeah?  Oh, great!  She sits closer to him.   I'll pack a picnic -- a night picnic -- night picnics are different -- and --    You should stay.    Okay.  Joel puts on his overcoat.  Clementine heads to the phone table, pulls out a notepad.   I would like you to call me.  Would you do that?  I would like that.   You'll call me, right?   When?   Tonight.  Just to test out the phone lines and all.   You were not.   Come over after I'm done here?   You rat.    You didn't say anything about my hair.   In the room?   Yo ho ho!   Anyhoo, sweetie, I done a bad thing.  I kinda sorta wrecked your car...   ...a little.  I was a little tipsy. Don't call me pathetic.   Oh Christ I didn't kill anybody.  It's just a fucking dent.  You're like some old lady or something.   A wino?  Jesus, Are you from the fifties? A wino!  Face it, Joel.  You're freaked out because I was out late without you, and in your little wormy brain, you're trying to figure out, did she fuck someone tonight?    Fuck you, Joel.  Faggot.   How can you watch this crap?   I'm fucking crawling out of my skin.  The scene starts to fade.  Clementine puts on her shoes and heads out the door.    I want to have a baby.   No.  I want to have a baby.  I have to have a baby.   You're not ready.   What?!   Joel, We're fucking gonna talk about it!  Joel looks around.  People are watching.   You can't fucking say something like that and say you don't want to talk about it!    I'd make a fucking good mother!  I love children!  I'm creative and smart and I'd make a fucking good mother!  The scene starts to fade.  Clementine's rant continues but becomes attenuated and vague.   It's you!  It's you who can't commit to anything!  You have no idea how lucky you are I'm interested in you!  I don't even know why I am!  I should just end it right here, Joel.  Leave you in the zoo. Maybe you could find a nice sloth to hang out with!  She's crying now, but it's almost animatronic, no real emotion in it.  The scene is a husk.   I'm glad.  Their eyes lock.  She is fading before his eyes.    Would you get me another, Joely?  Joel sighs, stands, and heads to the crowded bar.   Thanky!  Thanky!  Joel is at the bar, trying to get the bartender's attention.  Joel is paying the bartender.  He turns with the drink to head back to the table.  He sees Clementine flirting with a man in Joel's seat.  Joel is at the table.  Clementine looks from her conversation.   Joel, this is Mark.  He likes my boobs. He came over special to tell me that. Isn't that nice.  He doesn't think I'm fat.  The scene starts to fade.  Mark rises.   S'okay, Mark.  Joel doesn't like my boobs.  I don't think he likes girls.  The bar gets quiet and vague.   You're a whiz kid.  So perceptive, so --  Clementine keeps talking but there are no more intelligible words, just a whisper -- like a breeze.  A doorbell buzzes.  Joel looks up.   You don't tell me things, Joel.  I'm an open book.  I tell you everything.  Every damn embarrassing thing.  You don't trust me.   I want to know you.   Joel, you're a liar.  The scene is faded completely now and Joel just lies there for a moment, registering Clementine's statement.   Good.  He watches her as she downs her wine and pours herself another glass.  She holds the wine bottle up to Joel.   More?   How's the fish?  The scene is fading.    Candles are lit.  Joel and Clementine are under a blanket on the living room rug listening to music.   Joely...   Do you know The Velveteen Rabbit?   It's my favorite book.  Since I was a kid.  It's about these toys.  There's this part where the skin Horse tells the rabbit what it means to be real.  I can't believe I'm crying already.  He says, \"It takes a long time.  That's why it doesn't often happen to people who break easily or have sharp edges, or who have to be carefully kept.  Generally by the time you are Real, most of your hair has been loved off, and your eyes drop out and you get loose in the joints and very shabby.  But these things don't matter at all, because once you are Real you can't be ugly, except to people who don't understand.\"  She's weeping.  Joel is stroking her hair.  They kiss and begin to make love under the blanket.  It's sweet and gentle and then it starts to fade.    Clementine watches out the window as Patrick nears.  She's crying.  He makes his way up her front stairs.  She swings open the door and hugs him.   I don't know.  I'm lost.  I'm scared.  I feel like I'm disappearing.  I'm getting old and nothing makes any sense to me.   Nothing makes any sense.  Nothing makes any sense.  She pushes herself out of the embrace and looks at Patrick.   Come up to Boston with me?   Now.  Now!  I have to go now.  I have to see the frozen Charles!  Now!  Tonight!   Yay!  It'll be great!  I'll get my shit.  She runs into the bedroom.  Patrick is at the phone and realizes he doesn't know Joel's number.  After a moment's thought, he *69's.  The phone rings.     I took Joel to walk on Charles River with me last night.  It was so beautiful and charming.  Joel was nervous about stepping onto the ice, but he wanted to please me so much -- he's so sweet -- that he came out after me.    We lay down right in the center and watched the stars.  He took my hand and said \"I could...    Patrick reads the journal.   ... and we made love right on the ice. It was absolutely freezing on my ass!  It was wonderful.  Clementine enters, dressed for the cold.  Patrick puts the notebook away.   I'm so excited.  Yay!   It's gorgeous.  Just my taste.  I've never  gone out with a guy who brought me a piece of jewelry I liked.  Thanks.  So let's get going.  Long drive.   Such a beautiful view.   Oh?   Wow.  Um, well... can't you just force yourself awake?   What if you hide me?    Well... if they're looking for me in memories I'm in, what if you take me to a memory I'm not in?  And we can hide there till morning.  Joel ponders this.  The scene and Clementine are beginning to dissolve.  Joel grabs Clementine's hand.  She giggles with glee.  He pulls her out of the scene as it degrades.   Jesus.  What's this?  Joel looks around at the kitchen, at his doll, at the woman.   I'm right here.   Joel, Joely, look... it's not fading. The memory.  I think we're hidden.  Joel sucks in some snot.  His mother scurries back and forth clanging pots.  The room is not decaying.  Joel smiles.   You know, we're okay.  They're not finding us.  You'll remember me in the morning.  And you'll come to me and tell me about us and we'll start over.   You remember what happened next?   -- another rainy day.  Whatever shall we do?  He laughs.  She unbuttons his pajamas.  They begin to make love.  Joel's mother hurries around the kitchen.  Joel stops, looks at Clementine.   What?   Really?  Is he cute?   Gross! You must remember to tell me this in the morning.  I'm, like, so freaked out now.    It's a rust bucket.  Clementine drives through the snow. She's crying and holding Patrick's hand.   What's wrong with me?    I've never seen you happier.  The elements of the scene flash explosively away:  Joel's mother, his Huckleberry Hound doll, the details of the kitchen, Clementine.   Joel is thrown into:   But can't you see... I love you, Antoine.   Yes, but I can't love a man named Wally.  She starts to fade.  The scene starts to fade.  Joel remembers their previous plan.    Hide me somewhere deeper?  Somewhere buried?  Joel grabs her.  They run off just as the scene decays into a husk behind them.   Look at you, cutey!  What are we doing?   Poor Joel.  They're at the bike rack and a bunch of kids, including giant, fat Joe Early come around the corner.   Our house!  Our house!  She runs ahead, laughing.  The scene is decaying.  Joel chases after her.    Joel!    Thanks, Joely.  A present!  Oh boy!  She pulls out the bracelet.  It's the same bracelet Patrick gave her.   Oh, Joel.  It's beautiful!  I mean, you're the first guy who ever bought me a piece of jewelry I could honestly say that about.  He notices she's starting to fade.   I love it!  She leans across the table to kiss him.  He grabs her and runs through the decaying scene and into the vague night.   It's okay.  You were a little kid.  This is a great birthday present. Getting to see you as a boy.  She kisses him and they walk holding hands.   I want to go home.  She hurries toward the shore, slips on the ice, gets up, and continues, now running.   I love this book, Joel.  Thank you so much for telling me about it.  Joel is his father.  The father is drunk and sullen.  He faces away from Joel, looks out at the lake.   Joel, you're not sewn in.  He's wrong.   Yeah.   This is our first \"date\" date.   Naomi, I guess.   What was I wearing?   Egad, were you horrified?   No, you were with me when I bought that. At that place on East 6th.  It was later.   I'll buy that.  Black's always good.   I said: Are you sure?  You seem unsure.   But you weren't.  I could tell.   So what.  Infatuation is good, too.    Come up and see me... now.   Yes, exactly.  Exactly my point.    Joel and Clementine are in the midst of awkward shy sex.   Is that what you want?   I didn't think you'd show your face around me again.  I figured you were humiliated.  You did run away, after all.    Yeah?   Well, you're married.   Look, man, I'm telling you right off the bat, I'm high maintenance.  So I'm not going to tiptoe around your marriage or whatever it is you got going there.  If you want to be with me, you're with me.   So make your domestic decisions and maybe we'll talk again.  She goes back to stacking.  Joel stands there helplessly.   Joel, I'm not a concept.  I want you to just keep that in your head.  Too many guys think I'm a concept or I complete them or I'm going to make them alive, but I'm just a fucked-up girl who is looking for my own peace of mind.  Don't assign me yours.    I had you pegged, didn't I?   Probably.   I know.   Remember me.  Try your best.  Maybe we can.  The scene is gone.   Hi there.   I saw you sitting over here.  By yourself.  I thought, thank God, someone normal, who doesn't know how interact at these things either.   I can't tell you how happy I am to hear that.  I mean, I don't mean I'm happy you're uncomfortable, but, yknow... I'm such a loser.  Every time I come to a party I tell myself I'm going to be different and it's always exactly the same and then I hate myself after for being such a clod.   But, I don't know, maybe we're the normal ones, y'know?  I mean, what kind of people do well at this stuff?   You did?  You liked me?   Yeah, I know.  I'm fishing.   I'm Clementine.  Can I borrow a piece of your chicken?   Oh God, how horrid.   Hi, Joel.  So no jokes about my name?   Yeah, like that.    This is it, Joel.  It's gonna be gone soon.   What do we do?   No, I stopped.  I didn't want to feel like I was being artificially modulated.   But my sleeping is really fucked up.   You should try Xanax.  I mean, it's a chemical and all, but it works... and it works just having it around, knowing that it's there.  Like insurance.   I'll give you a couple.  See what you think.   Have you ever read any Anna Akhmatova?   Really?  Me, too!  I don't meet people who even know who she is and I work in a book store.   Me too.  There's this poem --   I think, before.   Yeah, maybe.  Joel and Clementine wander near some beach houses closed for the winter.   Do you know her poem that starts \"Seaside gusts of wind,/And a house in which we don't live...   Yes!  I love that poem.  It breaks my heart.  I'm so excited you know it.  Look, houses in which we don't live.  Joel chuckles appreciatively.   I wish we did.  You married?   Let's move into this neighborhood.  Clementine tries one of the doors on a darkened house.  Joel is nervous.   Oh.  She walks to the next house, tries the door.   Male or female?   At least I haven't been barking up the wrong tree.  She finds a window that's unlatched.  She lifts it.   Cool.   It's freezing out here.  She scrambles in the window.  Joel looks around, panicked.   C'mon, man.  The water's fine.  Nobody's coming here tonight, believe me.  This place is closed up.  Electricity's off.   I could see you wanted to come in, Joel.  He walks cautiously toward the door.   As soon as you walked in.  I knew I had you.  You knew I knew that, right?   I knew by your nervousness that Naomi wasn't the kind of girl who forced you to criminally trespass.   Yeah.  What's your girlfriend's name?   Ah-ha!  Now I can look for candles, matches, and the liquor cabinet.   No, it's our house!  Just tonight -- (looking at envelope on  counter -- we're David and Ruth Laskin.  Which one do you want to be?  I prefer to be Ruth but I'm flexible.  Alcohol!  You make drinks.  I'm going find the bedroom and slip into something more Ruth.  I'm ruthless at the moment.  She runs upstairs, giggling.  The room is drying out, turning into a husk.    So go.    What if you stay this time?   Come back and make up a good-bye at least.  Let's pretend we had one.  Clementine comes downstairs, vague and robotic, making her way through the decaying environment.   Bye, Joel.     Clementine lies in bed with Patrick.    Joel says goodbye to Clementine.   So you'll call me, right?   When?   Tonight.  Just to test out the phone lines.   What took you so long?   Hmmm.  Do you miss me?   Ha Ha!  You said, I do.  I guess that means we're married.   Tomorrow night... honeymoon on ice.   Don't worry.  It's really solid this time of year.   Isn't it?  She runs and slides on the ice.  Joel is by himself now.   What if?  Clementine lies on her back and stares up at the stars.  Joel is paralyzed.  He looks back at the shore.   Joel, come here.  Please.  He hesitates then gingerly makes his way over to her.  She reaches for his hand and gently pulls him down.  He lies on his back beside her, their bodies touching.  He wants to turn to her, but out of shyness, doesn't.  She holds his hand. They look up at the stars.  She smiles, doesn't say anything and snuggles closer to him.   Make love?   Oh, um...   That's okay.  I --   Hey, Joel --   I'm nervous, too.   Well, you obviously don't know me.   Show me which constellations you know.    Joel drops Clementine off.  She kisses him.   Yeah?   I probably got the same thing as you.    Maybe it's true then.  It's my voice on the tape.   Maybe.  Call someone who'd know.   I know.  I spoke to my friend Magda.  Joel is immersed in the several page document.   Joel, we've fucked.  We've made love. Like a million times.  And we were so sweet and shy and inept with each other last night.  Isn't that lovely?  Joel doesn't know what to say as this registers.  He just stands there dumbly.   Come over here, sweetheart.  Please.    Joel and Clementine review their separate Lacuna packages together.   Says you were closed off, non communicative, never told me what you were feeling.    A bully?  Moi?   Well, sounds like me.  Sorry, man.  Says you were jealous and suspicious.   Did I use the term \"sexual conquests\" or is that your way of putting it.   Doesn't sound like me.   Says you were constantly calling me a slob.  It's sexy that we were like a married couple, griping and overly-familiar and bored.  Don't you think?   We should have sex.  It's old hat for us.  She smiles at nervous Joel.   You know my body like the back of your hand.  She unbuttons her blouse.   Every curve, every freckle.  She takes off her shirt.  He stares at her.  He has clearly never seen this body before.   Hey, lover.  Whatcha doing?   God, I can't believe I ever hated you.   Guess what I'm wearing.   Your dried cum.   You're still excited by my irreverence. You haven't yet started to think of it as my \"gratuitous need to shock.\"   Yay.  Meet me after work by the old mill.   I just wanted to say that.  Come by my house.",
        "Kruczynski": "",
        "Dr.": "",
        "Mierzwiak": "Yes?  Mary opens the door, peeks in.  Howard Mierzwiak, 40's, professional, dry, sits behind his desk studying some papers.    Thanks, Mary.  You can bring her in.  She smiles and nods.  It's clear she's in love.  It's equally clear that Mierzwiak doesn't have a clue.  Mary turns to leave.    Mary...   Order me a pastrami for after?    Thanks.   Ms. Kruczynski, please come in.  Clementine enters the office.  Mary smiles at Mierzwiak and closes the door, leaving them alone.   How are you today?    Well, why don't you tell me what's going on?  Do you mind if I turn this on?  He indicates a tape recorder.   You guess he's your boyfriend?  Or you guess you're having a bad time with hm?   I think I know. I think we can help.  Why don't you start by telling me about your relationship.  Everything you can think of.  Everything about him.  Everything about you.  And we'll take it from there.  She nods, thinks.   Ah, Mr. Barish.  This is Stan.  He'll be in charge of your procedure tonight.  Stan nods professionally.   We'll start with your most recent memories and go backwards -- There is an emotional core to each of our memories -- As we eradicate this core, it starts its degradation process --  By the time you wake up in the morning, all memories we've targeted will have withered and disappeared.  Like a dream upon waking.   Well, technically, the procedure itself is brain damage, but on a par with a night of heavy drinking.  Nothing you'll miss.  Joel looks quizzically at the eroding environment.  Suddenly he gets it.   Yes, I suppose you are. (back in his faded memory  persona So, let's get started -- If we want the procedure underway tonight, we have some work to do.  Joel is sitting in a chair.  Electrodes connect him to some electronic machinery monitored by Stan.  Mierzwiak watches from the corner.   We'll dispose of these mementos when we're done here.  That way you won't be confused later by their unexplainable presence in your home.  Stan pulls out a coffee mug with a photo of Clementine printed on it.  Joel looks at the cup.  The machines record his reaction.   Ah, your journal.  This will be invaluable.    Joel and Mierzwiak are in the sitting area.  Joel looks at the tape recorder.   I'm sorry you saw one of our notification cards.  You never should have.   We can help you through this.  Why don't you start now by telling me everything you can remember about your relationship with Clementine.    Mierzwiak sits with Joel in the sitting area.   So we'll need you to go home and bring in everything you ever received from Clementine and anything that might remind you of her...  The scene is faded and disappearing fast.  It's gone.   We can help you through this.  Why don't you start now by telling me everything you can remember about --   What?  What do you mean?   Yes, but... I'm just something you're imagining.  What can I do?  I'm in your head, too.    The room is dark.  A groggy Mierzwiak is in bed on the phone. His wife lies beside him, eyes open, listening.   Stan?  What's going on?   Okay, what happened right before he disappeared?   Well, where was Patrick?   Jesus.  All right, what's the address.   Mary.  What are you doing here?   Let's get to the bottom of this.  Shall we?  He sits down in front of the computer and does some fiddling.   Odd.  He fiddles some more.  Mary looks on, fascinated.   Did you try going through C-Gate?   I'm going to do a Spectrum search throughout his memory, see if anything comes up.  Mierzwiak presses some more buttons.  The program starts up. A much more complex and detailed human brain appears on this screen.  It rotates.  Eventually Mierzwiak sees a small distant light in the brain.  He zeroes in on it.   Okay, here it is.  I don't know why it's off the map like that, but --   Okay, we're back in.   Well, thank you, Mary.   Yeah, probably a good idea.   Oh dear.   We got him back.  Stan, I think I'm just going to have to get through this manually.  We're running late.   I'm getting the hang of it.  I still understand it.  But I'm finding him quickly enough.  I'm hopeful there won't be too much peripheral eradication.  Mary sits on the bed.    That's fine, Stan.  Mary doesn't say anything.  Stan huffs and is out the door. Mierzwiak continues to find and erase points of light.  Mary gets up her courage to speak.   How do you mean?   Oh.  Well, I'd love to hear some.  Mary is thrilled, beside herself.  She tries to calm down.   Is that Nietzsche?   It's a good quote, Mary.  I'm glad we both know it.  He smiles at her.  She's flustered, flattered.   Alexander Pope?   It's no big deal.   That's lovely.   It's fine, Mary.  I'm happy to hear it.   You're a wonderful girl, Mary.  She leans over and kisses him, then pulls away quickly.   I've got a wife, Mary.  Kids.  You know that.   We can't do this.   I want you to know it's not because I'm not interested.  If that means anything.  They look at each other a long while, then Howard goes back to locating and eradicating blips of lights.   Hollis!  Hollis!   It didn't start out to be this.  I came here to work.  It's a one-time mistake.  Mary is right behind Mierzwiak now.  Hollis is in her car.   We... have a history.  I'm sorry.  You wanted the procedure.  You wanted it done... to get past.  I have to finish in there.  It's almost morning.  We'll talk later.  He shuffles inside.  Mary stands there, unable to digest this, struggling in vain to remember.  Stan watches.   Okay, so just tell me what you remember. And we'll take it from there.   It's what's best, Mary.  You know that.  Mary slumps to the floor.  We move into her eyes.   Thanks, Stan.  Thanks.    Mierzwiak dials his phone and waits.  He hangs up.  Mary enters with the papers.   I don't know what I'm supposed say, Mary. I want to do the right thing here.   I have a family, Mary.   It was a mutual decision.   I didn't make you.  You thought it best.  But, look, I take full responsibility.  She looks at him for a long while.  Then, out of frustration, she screams.    Stan enters.  Mierzwiak is pale and pacing.   She should not have done this, Stan.  As mad as she was... as justifiably --   Mary has stolen our files and is sending them back to people.   This is why people must never be told. It's like waking a --   I know you don't like me much, Stan, but please talk to Mary.  She of all people should know this is a dangerous thing she's doing.",
        "Train": "Joel talks on a phone.  The wind howls around him.  He tries to shield the mouthpiece as he talks.    Joel sits on the bench waiting for a train.  Clementine enters the platform, sees Joel, the only other person there. She waves, sort of goofily enthusiastic, playing as if they're old friends.  He waves back, embarrassed.  She takes a seat on a bench far down the platform.  Joel stares at his hands, pulls out his journal and tries to write in order to conceal his awkwardness.    Joel sits at the far end of the empty car and watches the slowly passing desolate terrain.  After a moment the door between cars opens and Clementine enters.  Joel looks up. Clementine is not looking at him; she busies herself deciding where to sit.  She settles on a seat at the opposite end of the car.  Joel looks out the window.  He feels her watching him.  The train is picking up speed.  Finally:    There are a few more people in the car now.  Clementine has inched a few seats closer to Joel.  She watches him.  His head is immersed in his journal.    It's dark out.  The train is pretty crowded.  Joel stares out the window.  Clementine sits closer still to Joel, eyes him.    The doors open and Joel emerges along with others.  He heads to the parking lot, arrives at the car.  There's a big dented scrape along the driver's side.  He gets in.    Mary, in shock, sits in the empty fluorescent car.  She tries to look out the window but can only see her own reflection.    Joel waits on the crowded platform.  The platform across the tracks is empty.  Joel's train arrives.  It's packed.  He squeezes on with all the other commuters.    The platform is crowded with business commuters.  Joel is among them. The platform across the tracks from them is empty.  Suddenly, Joel turns and makes his way through the crowd.  He climbs the stairs, crosses the overpass and makes his way to the empty platform.  An almost empty train pulls into that platform.  Joel gets on the train and watches the business commuters through the dirty window as his train pulls out of the station.",
        "Conductor": "Tickets.  Joel hands the conductor his ticket.  The conductor punches it and hands it back.   Next stop Southampton.  The conductor heads into the next car.  Clementine shoves stuff back into her purse.  Her hands are a little shaky. She pulls a airline-sized bottle of alcohol from her pocket, opens it, and downs it.  Joel is watching all of this but pretending not to.  She looks out the window for a while. The train pulls into the station.  The doors open.  Nobody gets on.  The doors close.  The train pulls out.",
        "Young": "... so I called everybody I know and asked them to tell me everything.  Now I know my entire history with him, but it's in the form of a story, I'm losing my mind.   I don't know what to do.  Before I thought I was depressed for no reason. Now it's like I've been assigned a reason.",
        "Bully": "",
        "Joel": "Hi, Cindy.  Joel.  Listen, I'm not feeling well this morning.  No.  Food poisoning, I think.  Sorry it took me so long to call in, but I've been vomiting.   January 13th, 2006.  Today I skipped work and took the train out to Montauk.  It's cold.  The sky is gray.  I don't know what else to say.  Nothing happens.  Nothing changes.  I saw Naomi last night.  We had sex.  It was weird to fall into our old familiar sex life so easily.  Like no time has passed.  After two years apart suddenly we're talking about getting together again.  I guess that's good.  He has no other thoughts.  He glances up, spots a female figure in the distance, walking in his direction.  She stands out against the gray in a fluorescent orange hooded sweatshirt.  It's Clementine.  He watches her for a bit, then as she nears, he goes back to his writing, or at least pretends to.  Once she passed, he watches her walk away.  She stops and stares out at the ocean.  Joel writes.   If I'm constitutionally incapable of making eye-contact with a woman I don't know.  I guess I'd better get back to Naomi.  Later: Joel walks up near the beach houses closed for the season.  He peeks cautiously in a dark window.  Later: Joel digs into the sand with a stick.   I'm sorry.   Why what?   No, I didn't know if you were talking to me, so...  She looks around the empty car.    Well, I didn't want to assume.   Anyway.  Sorry.  Hi.  Clementine makes her way down the aisle towards Joel.   No, I mean, I don't know.  I can't really think of much to say probably.   I mean, it's okay if you want to sit down here.  I didn't mean to --   It's okay, really.   Rockville Center.   The weirder part is I think actually I recognize you.  I thought that earlier in the diner.  That's why I was looking at you.  You work at Borders, right?   Really?  Because --   -- because I go there all the time.  I don't think I ever saw you before.   I don't have one.   I noticed your hair.  I guess it made an impression on me, that's why I was pretty sure I recognized you.   I like it.   Yeah.  Tom Waits says it in --   I can't remember.   I don't really know how --   You think that could possibly be a full time job?  How many hair colors could there be?   I'm sure you would.   You sure?  That doesn't sound --   Oh, I doubt that's the case.   Sorry.  I was just trying to be nice.   I'm Joel.   I don't know any jokes about your name.   I don't know what that means.   I'm nut nuts.   Sorry.  It's a pretty name, though.  It means \"merciful\", right?   See, I wouldn't think that about you.   Oh.  I don't know.  I was just... I don't know.  I was... You seemed nice, so --   Well, anyway... Sorry.  They sit in silence for a while.   Okay.   Yes?   That's okay.   It's no problem.  Anyway, I have some stuff I need to --   (pulling journal from  briefcase Probably see you at the book store.   Hi.  I could give you a ride if you need.   You're sure?  It's cold.   It's okay.   Where do you live?   Well, I probably wouldn't say if I were, but no.   I'm not a stalker.   Yeah.   It's okay.  I didn't think you were.  There's a silence.   I like to read.   Yeah?  I can't remember that album very well.  I remember liking it.  But --   Sort of, um...   What?   Well, I wouldn't want to be --   Take care.   Um --   Very much.   Thanks.  That was good, that crow sound.   I don't know.   Frost?   It's pretty.   Cheers.  They click glasses.  Clementine giggles and takes a big gulp of her drink.  Joel sips.  She plops down on the couch and pulls her boots off.   I'm fine.   No, I'm okay for now.  She heads toward the kitchen with her glass.   What do you want to hear?   You just say.  I'm not really --   Well, I should probably get going.   No.  I --   Thanks.   Yeah?   I don't know.   Yeah, I don't know.  It's hard to know.   Yeah, I guess.   Sorry.  My life isn't that interesting. I go to work.  I go home.  I don't know what to say.   I think about that.  She looks at him really hard for a long moment.  Joel tries to hold her gaze, but can't.  He looks down at his drink. Clementine starts to cry again.   I do have a tendency to use that word too much.   Thanks.   Yeah.   Yeah.  I think so.  It's hard to --   Yeah.   No.   No, not at all.   Oh, yeah.   That's scary sounding.   I think so.   Okay.    Sounds good.  But right now I should go.   I have to get up early in the morning tomorrow, so...   Yes.  She scribbles her phone number, hands it to him.  He puts it in his pocket.  He stands there uncomfortably for a moment, then forces himself to speak.   I don't think your personality comes out of a tube.  I think the hair is just... a pretty topping.  She tears up, swallows, and kisses him on the cheek.  He's surprised and pleased and nervous.    So, I enjoyed meeting you.   Yeah.   Tomorrow?   Okay.  We stay with Clementine as she watches Joel tromping through the snow and getting in his car.    Joel speeds through the suburban Rockville Center neighborhood.  There is no snow on the ground.  He seems different, somehow foggy and disoriented.    Joel gets out of his car, spots a van parked across the street.  There are two dark figures inside.    Joel enters, dumps his overcoat on a chair, turns off the lights, crosses to look furtively out the window.  It's snowing in large flakes which seem to fall only in the beam of a streetlight.   It was snowing.   The driver waved.  So casual, friendly.   I might be making a mistake.   Fuck you, Clementine.  The colors bleach, the surroundings become slightly vague. Even Joel's persona and voice-over seem to alter, his emotional intensity becoming diffused.  Joel does not seem aware of this.  He stops pacing, takes a small vial from his pocket, dumps the lone pill onto his palm.  He looks at it. It's pink.  There's some illegible initials stamped on it.   Pink.  There was a number on it.  I remember.  We're sorry, the number you have dialed...  Screw you, Clementine, for doing this ...   Bye.  Joel hangs up and lies on his back on the bed.  By now the scene is lifeless, almost a husk.  He hears the apartment building door open.  He hears footsteps.   It's them.   Fuck.   I should maybe talk to you.   I love you and if you knew that... if I told you what happened...  I'll explain everything, what we meant to each other. I'll tell you everything about our time together.  You'll know everything again and...   Clementine.   How could she have done this to me?  How could anyone do this to anyone?   What's happening here?  Oh, God!  I have to go home.  They'll be there soon.  Joel turns to leave.    Joel drives fast, recklessly.  The intensity is back.  He's weeping as he drives.   Gotta get home.  How could she do this to me? How could she not care about what we meant to each other.  What a fuck!  What a fucking monster she is!   Them.   How exactly is this going to work tonight?  As Mierzwiak talks, the room colors start to fade, Mierzwiak's tone of voice is also affected; it becomes dry and monotonous.   Is there any sort of risk of brain damage?   It's happening now!  I'm already in my brain.  Mierzwiak looks at the fading room.   But you're tracing and erasing now.  It's already started.  I'm home in my bed.  Stan pulls a snow globe from one of Joel's bags, shows it to Joel.  The equipment registers Joel's reaction.    Joel lies on his back in fresh pajamas.  His eyes are closed and electrodes connect his head to several machines.  The machines are operated by Stan, now in grubby street clothes and in need of a shave, and by Patrick, dressed similarly. The monitor on one of the machines traces a myriad of light blips running like streams through an image of Joel's brain. Stan presses buttons and operates a joystick, aiming for the lines.  Patrick (who we saw earlier with Clementine at the bookstore) studies a meter on one of the machines.    Joel, snapped into a new memory, cries as he fills two large plastic garbage bags with mementos of his relationship with Clementine.  There are funny little gifts, wind-up toys, some potatoes dressed as women, some clothing Clementine has left there, some CD's.  He pulls a big clump of pages out of his loose-leaf journal and dumps them in the bag.  He gets some clean loose-leaf paper and writes:  December 15, 2004   Nothing much happened today.  I stayed home.  Naomi worked on her dissertation.  The scene is fading as he continues to write.   My name is Joel Barish.  I have an appointment.   Not great.   Well... I did.    It was a mess.  I don't know how it got this way...    Patrick is checking out the apartment.  Stan monitors the equipment.    Joel gets off the elevator and approaches the receptionist.   So then she just stops calling.   Any messages, Carmen?  Carmen the receptionist shakes her head.  Next day: Joel approaches the receptionist.   Any messages for me, Carmen.    Joel enters, checks his phone machine: zero messages.    Joel gets off the elevator, approaches Carmen, who is in conversation with someone else.   Sorry, Carmen.  Any messages?  Carmen shakes her head \"no\", goes back to her conversation.    Joel checks his machine: zero messages.   Why would she do that?   She's punishing me for being honest.  I should just go to her house.   Yeah, I don't want to seem desperate.   I don't know.  I'm so... I can't believe she'd be so goddamn immature!   They can't erase memories.  It's a joke. It's a nasty Clementine hoax.    Joel is on the phone pacing.    Joel drives past vague local landmark.   But what am I supposed to do?   How can I?  How can I move on when I know I'm the only one to carry this love we had?  How do I do that?    Stan works the joystick.  Patrick sits on the bed with Joel.    Joel distractedly reads a book, checks the clock, goes back to the book.  The door opens.  He looks up.  Clementine is staggering in, drunk.   It's three.   I can't believe you wrecked my car.   You're driving drunk.  It's pathetic.   Well it is pathetic.  And fucking irresponsible.  You could've killed somebody.  The scene is starting to degrade.  The acting becomes anemic.   I don't know, maybe you did kill somebody.   And what are you like?  A wino?   No, see, Clem, I assume you fucked someone tonight.  Isn't that how you get people to like you?  This shuts Clementine up.  She is stung and she starts gathering up her belongings, which are strewn about the apartment.  Joel is immediately sorry he said this.  He follows her around.   I'm sorry.  Okay.  I didn't mean that.  I just... I was just... pissed, I guess.  Clementine is out the door.  Joel follows.    Joel drives to catch up with Clementine.  He rolls down his window to talk to her.   Let me drive you home.   Look at it out here.  It's falling apart. I'm erasing you.  And I'm happy.  She keeps clomping.   You did it to me.  I can't believe you did this to me.  By morning you'll be gone.  Ha!  He stops the car, gets out.    Stan watches the screen.  Patrick paces, fidgets, looks at the unconscious Joel.    Joel and Clementine sit and eat dinner in front of the TV. It's hard to make out what they're watching. They sit on opposite ends of the couch.  They look bored. The scene quickly degenerates.  The room fades.   That must be the guy I saw you with.    Joel watches TV.  Clementine walks by in her underwear, looks at the TV.  She slips into a skirt.   Where are you going?   Oh shit.  I remember this.  Want to go?   Let's talk about it later.   I don't think we're ready.   Clementine, do you really think you could take care of a kid?  She turns violently toward him, glaring.    I don't want to talk about this here.   Clem, I'm sorry.  I shouldn't have --   Oh, thank God.  It's going.   It's going, Clementine.  All the crap and hurt and disappointment.  It's all being wiped away.  She looks up at him.   Me, too.   So, um --   You're drunk.    Patrick opens the door.  Mary stands there in a winter coat, carrying a backpack.    It's dark.  Joel and Clementine are in bed.  The memory is already in the midst of being erased.  Clementine is talking in a monotonous, robotic manner.   No, it isn't that.   I just don't have anything very interesting about my life.   How's the chicken?   No.  Thanks.  There's a silence.   It's good.  They continue to eat in silence as the scene dissolves.    Patrick is on the phone next to Joel's bed.  Stan watches the lights on the computer screen.   Yeah, Tangerine?   No.    No!  Jesus, No!  He looks down and Clementine's tear-streaked face is fading. She continues as if she's still being made love to, even though Joel is completely beside himself.  He jumps up naked and yells at the ceiling.   Please!  Please!  I've changed my mind! (looks down at fading  Clementine, then at ceiling I don't want this.  Wake me up!  Stop the procedure!  Plea --    Joel is unconscious on the bed, completely still.  Mary and Stan watch the monitor and smoke a joint.  After a silence:   Hi, it's Joel.  Please leave a message after the beep.  Beep.    Stan is on the phone.  He's really stoned and watches Mary, stoned herself, dancing in a sexy trance to something soft and low on the stereo.   ...die right now, Clem.  I'm just... happy.  I've never felt that before.  I'm just exactly where I want to be.  Clementine looks over at him.  Her eyes are filled with love and tears.  Then they get vague.  The scene is being erased. Joel is panicked.   Clem, no!  This can't keep happening. Please!  Oh, fuck!  Please!  Crazily, Joel runs off, passing through a series of decayed scenes: He and Clementine arguing in a car, having sex on the beach, laughing and holding hands at a movie, eating grilled cheese and tomato soup together in bed, Joel watching her sleep, them drinking at a bar.  He arrives at a decayed version of his first meeting with Mierzwiak.   You have to stop this!   I'm trapped in my head and everything I love is being erased!  Stop it now!    Stan and Mary have sex on the floor next to Joel's bed.    Yes indeed.  Fuck!  They're erasing you, Clem!   I hired them to.  We're in my brain.  But I want it to stop, before I wake up and don't know you anymore.   I don't know.  He concentrates.  Nothing happens.   Aaargh!  It's horrible!  I'm trapped!  He starts to have a fit, banging against trees, stomping his feet, screaming.  But even while he's doing this the memory and Clementine are fading around him.    It's raining out.  Joel is reading, slouched in a chair.  He looks over at Clementine, stretched out on her belly in her underwear.  She's reading, too.   I loved you on this day.  I love this memory.  The rain.  Us just hanging.  Clementine looks over at him, smiles.  Her brow furrows in thought.   What do you mean?   Where?  Where?  Where?  He drags her through the landscape of already decayed memories and turns off into:   I must be about two.  I want my mommy.  She's busy.  She's not looking at me.  Look, my Huckleberry Hound doll!  I told you about this!  I want my mommy!  He starts to cry.  Clementine tries to comfort him.  She hugs him.    I want my mommy.  I don't want to lose you, Clem.   I'm scared.  I want my mommy.  I don't want to lose you.  I don't want to lose...    Stan and Mary lie on the floor, their stoned minds wandering after sex.  Stan suddenly perks up.  He looks at the monitor.    Stan hangs up the phone, looks at Mary.   I really want her to pick me up.  It's weird how strong that desire is.  Clementine holds his hand.  He looks over at her.   I loved you so much this day.  On my bed in your panties.  I remember I thought, how impossibly lucky am I to have you on my bed in your panties.  She kisses him.   I came over to the bed and you smelled so good, like you just woke up, slightly sweaty.  And I climbed on the bed with you and you said something like --   There's this guy!   There's this guy.  I heard him talking in my apartment.  He's one of the eraser guys.  And he fell for you when they were erasing you, so he introduced himself the next day as if he were a stranger and now you're dating him.   He stole a pair of your panties while you were being erased!    Stan works on trying to get the signal back.  His hair is combed and he's dressed neatly, looking professional but still stoned.  Mary is pacing nervously to and from the window, looking out into the night.  She's dressed also, and she's wearing more make-up now.  Her hair is pulled up into some sort of style.  Suddenly she freezes at the window.    I love getting bathed in the sink.  It's such a feeling of security.    Mierzwiak looks up from the computer screen.   Don't call me Antoine.  My name is Wally.   They found us before.  The plan didn't work.  I don't know what to do now.    Stan is back at the controls.  Mierzwiak's at the door with Mary.   This kid, Joe Early, is going to beat the shit out of me.   He calls me Jill.  Everyone calls me Jill after this.  The other kids laughs.   Just shut up, Joe.  I'm going home.   I don't want to fight you.  The kids start chanting, \"fight, fight, fight...\"  Joe Early throws a wild punch that hits Joel in the side.  joel falls and stays down, covering himself.   I'm too scared to even throw a punch. When I tell people this story I leave that part out.  The scene flashes violently to white and is gone.    Mierzwiak is at the machine.   Clem, c'mon, we've got to hide you. Remember?  He grabs her arm and yanks and they are in:    I don't like it either, but I'm just trying to find horrible secret place to --  Joel's mother pops her head in the door.   Happy Birthday.   I scoured the city for it.   I can't.  I have to go home.  I'll do it later.    That's where I live.  Lived.  Joel looks down at her hand.  It's fading.  The bracelet is gone.  Clementine is gone.  His childhood house is gone.    Mierzwiak works the equipment.  He has located a small area of light in the brain imaging and eradicates them.    Stan sits in the van and smokes a cigarette.  He has an unobstructed view into Joel's bedroom window.  He watches Mierzwiak and Mary.  They're talking as Howard works.  It appears to be a very serious discussion.  A car pulls up outside.  Stan turns to see.  A middle-aged woman gets out, checks the address on Joel's building, approaches the only lit window, watches Mierzwiak and Mary inside.  Mierzwiak's resolve has apparently weakened and he and Mary kiss again. This time it leads to groping, partial undressing, and falling onto the bed alongside the unconscious Joel.  The woman in the window is transfixed.  As Mierzwiak fumbles to unzip his pants, he catches sight of the woman in the window. He practically shrieks and jumps up.    Mary looks confusedly at Howard.    The woman is at her car.  Stan watches from the van. Mierzwiak is hurrying to the woman.    It's deathly silent as Mierzwiak and Stan work on completing the job.  Mierzwiak locates a light hidden very deep in the map of Joel's brain.  He targets it.   It was horrifying, seeing my father like that. There was no hope for me if his life was such a failure.  And he saw failure in me, too, written in my future.  Clementine watches the frightened, confused Joel.   I'm done, Clem.  I'm just going to ride it out.  Hiding is clearly not working.   I want to enjoy my little time left with you.   Do you remember what we talked about?   Yeah.   God, I should know.  Your hair was red. I remember it matched the wallpaper.   No!  I think you were wearing that black dress, y'know, with the buttons.  She is wearing the black dress.   Right.  Something black though.   We did talk about Naomi.   I'm sure, I said.   I was so nervous.  I remember I couldn't think of anything to say.  There were long silences.  There is a long silence.   I thought I was foolish.  I thought I'd mistaken infatuation for love.  You said:   And I didn't have an argument.   I dropped you off after.  You said --   It's very late.   This was our first time.  The scene starts to fade.  Joel watches Clementine disappear.    Joel sits in the quiet living room.  The scene is fading.   Naomi.    Joel sits.    Namoi is red-eyed from crying.  She is packing things in boxes.  Joel paces, steals glances at her, doesn't know what to say.  She holds up a book.  The scene starts to fade.   You take it.  I don't know.  She tosses it in a box.   Naomi, I really value our relationship. I hope it's possible for us to stay in touch.    Joel watches out the window as Naomi stuffs a final box in the trunk of a car.  There's another woman down there with her.  They get into the car and drive off.   I told her today I need to end it.   I did it.  I guess that means something.  Clementine shrugs.  The scene fades.   I don't know, I've just been thinking, maybe we're not happy with each other.   Y'know, we've been, I don't know, sort of, unhappy with each other and --   I think maybe, we're both so used to operating at this level that -- How can one person be unhappy?  If one person is unhappy, both have to be... by definition.   No.  I just need some space, maybe.   It's not somebody else.   Is there a Clementine who works here?   Hi.  She turns.   Sorry to track you down like this.  I'm not a stalker.  But I needed to see you.   I'd like to... take you out or something.   Not yet.  Not married.   Okay.   I just think that you have some kind of... quality that seems really important to me.  The scene is disintegrating.  Clementine's speech is delivered without passion.   I remember that speech really well.   You had the whole human race pegged.   I still thought you were going to save me.  Even after that.   It would be different, if we could just give it another go around.   Thanks, guys.   Yeah.    The lights are off.  Joel sits on a chair near the window, writing in his journal.  The streetlight illuminates the paper.  Naomi sleeps in the bed.   Hi.   You didn't miss much.  Rob Carrie say hello.   Go back to sleep.  The room is starting to decompose.   In a minute.  Naomi turns over.  Joel goes back to his writing.    Joel is at his closet, putting on a sweater.  Naomi is at the dining room table, papers spread out before her, writing. Joel turns and watches her for a moment.   So you don't mind?   Okay.  I wish you could come.   I hope you get your work done.   Just a little overworked, maybe.   I remember you turned around.  Your face was dark and your hair was backlit -- I could see a halo of frizz -- you asked me if things were okay between Naomi and me.   I remember.   Yeah, you told me that later.   No one.   You were down by the surf.  I could just make you out in the dark.  Joel looks down to the water.  There's Clementine, in her orange hooded sweatshirt, looking out to sea.   Your back to me.  In that orange sweatshirt I would come to know so well and even hate eventually.  At the time I thought, how cool, an orange sweatshirt.   But I went back to my food.  The next thing I remember, I felt someone sitting next to me and I saw the orange sleeve out of the corner of my eye.  A shot of the orange sleeve.  Joel looks up.   Hi.   You said...   Yeah.  I don't ever know what to say.   Even then I didn't believe you entirely. I thought how could you be talking to me if you couldn't talk to people?   You know what I did.   You said --  She picks a drumstick off of Joel's plate.   And you picked it out of my plate before I could answer and it felt so intimate like we were already lovers.   I remember --   I'm Joel.   You mean, like...  Oh, my darlin', oh, my darlin', oh, my darlin', Clementine... ?  Huckleberry Hound?  That sort of thing?   Nope.  No jokes.  My favorite thing when I was a kid was my Huckleberry Hound doll.  I think your name is magic.  She smiles.   I know.   Enjoy it.  Say good-bye.  She nods.  Joel and Clementine are walking near the surf.   So you're still on the Zoloft?   I know what you mean.  That's why I stopped.   I don't think I've slept in a year.   yeah?   Okay.   I love her.   I think she's great.   Did this conversation come before or after we saw the house?   Seems too coincidental that way.   Yeah, yeah.  It goes \"Perhaps there is someone in this world to whom I could send all these lines\"?   Um, no.   I do sort of live with somebody though.   Female.   What are you doing?    Clementine.   I hesitated for what seemed like forever.   I knew.   It's dark.   Naomi.  She's searching through drawers for something.  She pulls out a flashlight, shines it in Joel's face.   I think we should go.    I really should go.  I really need to catch my ride.   I did.  I walked out the door.  I felt like I was a scared little kid.  I thought you knew that about me.  I ran back to the bonfire, trying to outrun my humiliation.  You said, \"so go\" with such disdain.   I walked out the door.  There's no more memory.   I love you.  She smiles.  They kiss.  It fades.    Howard watches the monitor.  The last specks of light are fading.  It grows dark.  He is tired, his eyes are hollow. He turns to Stan, who is staring out the window at the dawn.    Stan and Howard load the last of the equipment into the back of the van.  He and Howard look at each other.    Joel awakens.  The apartment is neat, like when he went to sleep.  He gets out of bed and heads into the bathroom.   Hi... Naomi?  Yeah, hi!  How are you?  I know, I know.  It's been a long time. Not too much.  You?  Oh, that's great! Congratulations!  Maybe I could buy you dinner to celebrate?  Tonight?  I'm free. Okay, good!   It's been a pretty lonely couple of years.   Well, it was my fault -- the break-up. I'm sorry.   I miss you.    Oh!  Great.  That's great!   I'm sorry.  I really shouldn't have --    Joel and Naomi are in bed having sex.  There are certain sexual routines, habits, they have fallen back into almost immediately.  She sticks her tongue in his ear in a way that's trying to be sexual but just feels embarrassing to him.  They finish and lie there.   So you think the dissertation will get published?   Yeah.   Tomorrow?   Yeah.  Joel exits.  We stay on Clementine as she watches Joel head to his car, tromping through the snow.    Joel enters, drops his overcoat on a chair, dials the phone.   Hi, Naomi, it's Joel.   How's it going?   I know.  I had to take the day to think.   I just got in.   Yeah, I suppose so.   There you are.  Naomi, it's just... I'm afraid if we fall back into this fast without considering the problems we had...   I had a good time last night.  I really did.   We'll speak soon.   I just walked in.   Oddly enough, I do.   I guess so.   I don't know.  She takes his hand and he is suddenly imbued with confidence.   This is so beautiful.  She squeezes his hand.   I don't know.  What if it breaks?   I think I should go back.   Listen, did you want to make love?   Have sex.  Y'know --   Because I just am not drunk enough or stoned enough to make that happen right now.   I'm sorry.  I just wanted to say that. This seems like the perfect romantic exotic place to do it and --   -- and I'm just too nervous around you right now.   Yeah?  I wouldn't have thought that.   I'm nervous because I have and enormous crush on you.  She smiles up at the sky.    Joel enters with his mail.  He opens a manila envelope, reads the enclosed file, sticks the cassette tape in his stereo, listens.  Joel dials the phone.   Did you send this?  Is it a joke?   I mean, I haven't even told anyone I've met you.  Who would even know to do this?   That's what you have to say?  How could it be true?  I never even heard of any procedure like this.  It's a joke.    Joel hangs up.  He dials the phone.   It's true.   Look, I have to go.  I have to think.   Says you were a bully...   That's what it says.  You drank too much, you picked on me for being passive and timid.   Says you would sometimes disappear all night, then brag to me about your sexual conquests.   I don't know.   Says you were a slob, leaving trails of panties and dirty socks in your wake.    I sort of do.  But I only see it as a fantasy version of reality.  Cleaned up enough to be erotic.   You're so beautiful.  She approaches him, kisses him, his arms wrap around her waist for the first time.   Hi, it's Joel.   I'm just, y'know, passing the time best I can till I can see you.   You must have been crazy.   I don't know.  Panties and --   Jesus.   I can't stop thinking about you.   What old mill?  Is that somewhere we --",
        "Rob": "Joel sits across Rob and Carrie, mid-40's.   I don't think you should go there, Joel.   Joel, look, the thing is --    Joel sits forlornly in the back seat.  Rob drives and Carrie sits in the front passenger seat.  The car stops in front of Joel's apartment building.    Rob drives.  Carrie fiddles with the radio dial in the front passenger seat.  Joel sits in the back.    Faded.  Carrie and Joel sit at the table with coffee.    Carrie is on the phone.  She pauses nervously, then speaks:",
        "Joel's": "Joel speeds through the suburban Rockville Center neighborhood.  There is no snow on the ground.  He seems different, somehow foggy and disoriented.    Joel gets out of his car, spots a van parked across the street.  There are two dark figures inside.    Joel enters, dumps his overcoat on a chair, turns off the lights, crosses to look furtively out the window.  It's snowing in large flakes which seem to fall only in the beam of a streetlight.    Joel drives fast, recklessly.  The intensity is back.  He's weeping as he drives.    Joel lies on his back in fresh pajamas.  His eyes are closed and electrodes connect his head to several machines.  The machines are operated by Stan, now in grubby street clothes and in need of a shave, and by Patrick, dressed similarly. The monitor on one of the machines traces a myriad of light blips running like streams through an image of Joel's brain. Stan presses buttons and operates a joystick, aiming for the lines.  Patrick (who we saw earlier with Clementine at the bookstore) studies a meter on one of the machines.    Joel, snapped into a new memory, cries as he fills two large plastic garbage bags with mementos of his relationship with Clementine.  There are funny little gifts, wind-up toys, some potatoes dressed as women, some clothing Clementine has left there, some CD's.  He pulls a big clump of pages out of his loose-leaf journal and dumps them in the bag.  He gets some clean loose-leaf paper and writes:  December 15, 2004   Nothing much happened today.  I stayed home.  Naomi worked on her dissertation.  The scene is fading as he continues to write.    Patrick is checking out the apartment.  Stan monitors the equipment.    Joel gets off the elevator and approaches the receptionist.    Joel enters, checks his phone machine: zero messages.    Joel gets off the elevator, approaches Carmen, who is in conversation with someone else.    Joel checks his machine: zero messages.    Joel is on the phone pacing.    Joel drives past vague local landmark.   But what am I supposed to do?   How can I?  How can I move on when I know I'm the only one to carry this love we had?  How do I do that?    Stan works the joystick.  Patrick sits on the bed with Joel.    Joel distractedly reads a book, checks the clock, goes back to the book.  The door opens.  He looks up.  Clementine is staggering in, drunk.    Joel drives to catch up with Clementine.  He rolls down his window to talk to her.    Stan watches the screen.  Patrick paces, fidgets, looks at the unconscious Joel.    Joel and Clementine sit and eat dinner in front of the TV. It's hard to make out what they're watching. They sit on opposite ends of the couch.  They look bored. The scene quickly degenerates.  The room fades.    Joel watches TV.  Clementine walks by in her underwear, looks at the TV.  She slips into a skirt.    Patrick opens the door.  Mary stands there in a winter coat, carrying a backpack.    It's dark.  Joel and Clementine are in bed.  The memory is already in the midst of being erased.  Clementine is talking in a monotonous, robotic manner.    Patrick is on the phone next to Joel's bed.  Stan watches the lights on the computer screen.    Joel is unconscious on the bed, completely still.  Mary and Stan watch the monitor and smoke a joint.  After a silence:   Hi, it's Joel.  Please leave a message after the beep.  Beep.    Stan is on the phone.  He's really stoned and watches Mary, stoned herself, dancing in a sexy trance to something soft and low on the stereo.    Stan and Mary have sex on the floor next to Joel's bed.    It's raining out.  Joel is reading, slouched in a chair.  He looks over at Clementine, stretched out on her belly in her underwear.  She's reading, too.    Stan and Mary lie on the floor, their stoned minds wandering after sex.  Stan suddenly perks up.  He looks at the monitor.    Stan hangs up the phone, looks at Mary.    Stan works on trying to get the signal back.  His hair is combed and he's dressed neatly, looking professional but still stoned.  Mary is pacing nervously to and from the window, looking out into the night.  She's dressed also, and she's wearing more make-up now.  Her hair is pulled up into some sort of style.  Suddenly she freezes at the window.    Mierzwiak looks up from the computer screen.    Stan is back at the controls.  Mierzwiak's at the door with Mary.    Mierzwiak is at the machine.    Mierzwiak works the equipment.  He has located a small area of light in the brain imaging and eradicates them.    Stan sits in the van and smokes a cigarette.  He has an unobstructed view into Joel's bedroom window.  He watches Mierzwiak and Mary.  They're talking as Howard works.  It appears to be a very serious discussion.  A car pulls up outside.  Stan turns to see.  A middle-aged woman gets out, checks the address on Joel's building, approaches the only lit window, watches Mierzwiak and Mary inside.  Mierzwiak's resolve has apparently weakened and he and Mary kiss again. This time it leads to groping, partial undressing, and falling onto the bed alongside the unconscious Joel.  The woman in the window is transfixed.  As Mierzwiak fumbles to unzip his pants, he catches sight of the woman in the window. He practically shrieks and jumps up.    Mary looks confusedly at Howard.    The woman is at her car.  Stan watches from the van. Mierzwiak is hurrying to the woman.    It's deathly silent as Mierzwiak and Stan work on completing the job.  Mierzwiak locates a light hidden very deep in the map of Joel's brain.  He targets it.    Joel sits in the quiet living room.  The scene is fading.    Joel sits.    Namoi is red-eyed from crying.  She is packing things in boxes.  Joel paces, steals glances at her, doesn't know what to say.  She holds up a book.  The scene starts to fade.    Joel watches out the window as Naomi stuffs a final box in the trunk of a car.  There's another woman down there with her.  They get into the car and drive off.    The lights are off.  Joel sits on a chair near the window, writing in his journal.  The streetlight illuminates the paper.  Naomi sleeps in the bed.    Joel is at his closet, putting on a sweater.  Naomi is at the dining room table, papers spread out before her, writing. Joel turns and watches her for a moment.    Howard watches the monitor.  The last specks of light are fading.  It grows dark.  He is tired, his eyes are hollow. He turns to Stan, who is staring out the window at the dawn.    Stan and Howard load the last of the equipment into the back of the van.  He and Howard look at each other.    Joel awakens.  The apartment is neat, like when he went to sleep.  He gets out of bed and heads into the bathroom.    Joel and Naomi are in bed having sex.  There are certain sexual routines, habits, they have fallen back into almost immediately.  She sticks her tongue in his ear in a way that's trying to be sexual but just feels embarrassing to him.  They finish and lie there.    Joel enters, drops his overcoat on a chair, dials the phone.    Joel enters with his mail.  He opens a manila envelope, reads the enclosed file, sticks the cassette tape in his stereo, listens.  Joel dials the phone.    Joel hangs up.  He dials the phone.",
        "Mother": "How's my baby boy?  She's gone.   Little baby getting awwwl cleean.  Awl clean.   Joel, I was just --  Oh.  Um... I'll ask you in the morning, honey.  Have a good night.  The mother backs out, closes the door.  Joel cringes. Clementine laughs, still in the mode of the memory she was swiped from.  Flash!  It's all gone.",
        "Barish": "",
        "Stan": "Boo.   Barely seen you all morning, kiddo.  He leans in to kiss her.  She cranes her neck to keep him off.   Sorry.  I just --   I know.  Anyway --   See you later, alligator.   Hey, if you're ordering lunch for Mierzwiak, would you --   Mr. Barish.   We use the articles you brought to create a map of Clementine in your brain. Tonight while you sleep we'll be able to trace the map and erase.   Very good.  Stan pulls out a potato dressed as a Vegas showgirl.  Joel studies it.  The machines register his response.   Good.  We're getting healthy read-outs.  The room, Stan, and Mierzwiak are now vague and wispy.   Patrick, do me a favor --  Joel is watching Stan.  Stan is not speaking, yet his voice continues.   -- and check the voltage levels, I'm not wiping as clean as I would like here.  Joel looks up.  Stan's voice seems to be coming from above.   Then check the connections.  Patrick fiddles with some jacks.   Yeah, that looks better.  Thanks.    December 15th, 2004.  I met someone tonight.  Oh, Christ:  I don't know what to do.  Her name is Clementine and she's amazing.  So alive and spontaneous and passionate and sensitive.  Things with Naomi and I have been stagnant for so long.  The scene is just a shell of itself as Stan rattles on.   I think we got this one.  Let's push on.  Joel looks up at the ceiling.    It's an apartment.   Patrick, let's just get through this.  We have a long night ahead of us.   So, Mary's coming over tonight.  Joel looks up.   Just wanted to let you know.   She likes you okay.   You can if you want.    This one's history.  Moving on...   Patrick, we need to focus.  Stan aims the joystick.   Yeah, that's this guy's girlfriend.  Was.   She was unconscious, Patrick.   Jesus, Patrick!   Look, just don't tell me this stuff.  I don't want to know this shit.   We have work to do.  There's a click and Joel finds himself in --   Patrick... do you know how unethical...   Hey, you.  Stan and Mary kiss.  She looks down at Joel as she takes off her coat.   You found us okay?   We haven't checked.   Maybe if you stopped stealing their panties.   That's a good one.    It's a good one all right.   It's a quote book.   Yup.    Yup.   Patrick, we're in the middle of --    Go.    Yeah.   You love him, don't you?  Mary seems surprised, taken aback, caught.  She is silent for a long moment.   Hey, where are you?   I can handle it.  He's pretty much on auto-pilot anyway.   It's stopped.   Listen, it's not erasing.  He makes his way, naked, to the computer screen.   It's not erasing.  He's off the screen.   I don't know.  He's not on the map.  Stan tries to break through his marijuana haze.  He fiddles nervously with the equipment.   I don't know what to do!  I don't know what to do!  Crap.  Crap...   I don't know!  I just said that!   Shit!  He jerks the joystick spastically.  Mary, also naked, gets up and looks over his shoulder at the screen.   No way.  I can handle this.    Okay.  He dials the phone, waits.   Hello, Howard?   The guy we're doing?  He's disappeared from the map.  I can't find him anywhere.   I was away from the monitor for a second. I had it on automatic.  I had to go pee.   He went home sick.   1062 Sherman Drive.  Apartment 1E, Rockville Center.  Mierzwiak writes it down on a bedside not pad.  He hangs up.   You better go.   She came to help, Howard.   I tried that already.   Yeah.  Of course.  Mierzwiak ponders.  He unzips his equipment bag, pulls out another laptop computer and plugs it in to the system.    You get some sleep, Howard.  I'll take it from here.   Howard, they've disappeared again.   I'll go out for a smoke.  If no one minds.   Let me take you home.  Mary shakes her head \"no.\"  She walks off, dazed.   So, I've got to drop the van off.   Hey.   I swear.   Once, maybe.  She watches him closely, waiting for him to continue.   It was here.  At his car.  I was coming back from a job and spotted you together. You seemed caught.  I waved.  You giggled.    Happy.  Happy with a secret.  Mary starts to cry.   I never saw you together like that again. So I figured I was imagining things.  Mary says nothing.   I really like you, Mary.  You know that.    You were in red.  That red sweater with the little flowers, I think.  You were leaning against his car.  He looked a little like a kid.  Kind of goofy and wide-eyed.  I'd never seen him look like that before.  Happy.  You looked beautiful.  You looked in love.   I work here.  I used to work here.  Stan. Please just tell Howard I'm here to clean out my desk.   I don't know what you're talking about, Howard.   Jesus.  Mierzwiak turns up the volume on a small video monitor looking in on the lab, where Patrick has clearly taken over Stan's position.  He is in the process of interviewing a sad young woman.   Hi.   Can I... I brought some --  She steps aside for Stan to enter.  He does, looks around, sees the tapes and the stuffed envelopes on the floor.   What's this?   I know what it is.   I don't know.  I just -- there are a lot of really confused people showing up at the office.   Mary, people come to him voluntarily.   The office is filled with people who want their memories re-erased.   Mary... please.  This is hurting people.  Long pause, then:",
        "Mary": "May I help you?   Yes, please have a seat.  He'll be right with you.  Clementine sits.  She looks tired, maybe hungover.  She picks up a magazine at random and thumbs without interest.   Howard, your one o'clock.    Yes?   Cole slaw, ice tea?   Welcome, Howard.  She smiles and heads down the hall.  Stan, 30's, tall, spindly, and earnest in a lab coat pops out of a doorway.   Hi.  She glances back nervously at Mierzwiak's open door.    Stan... c'mon...    It's just...y'know... I mean...   Anyway, I've got to do my tap dance here.  She indicates the door to the reception area.  Stan nods.   'kay.   I better do this, Stan.  Stan nods again and Mary opens the door to the waiting room.   Ms. Kruczynski?    How are you today?    Here we are.  Mierzwiak steps out from behind his desk.   Hello again, Mr. Barish.  Good, you've got your stuff.    How are you today?  Here we are.   May I help you?   Please have a seat.  Dr. Mierzwiak will be right with you.    How are you today?    Here we are.  Joel glimpses Mary smiling coquettishly at Mierzwiak.    Hi, May I help you?  These degraded, faded memories allow Joel to detach himself and hear what's going on in his bedroom.    Oh, hey, Patrick.   It's freezing out.   Yeah.  Poor guy.  Have anything to drink?   Well, allow me to do the honors.  It's fucking freezing and I need something.  She heads into the kitchen.  Stan turns back to monitor the slivers of light.   Hey, hey.  She pours the whiskey.   Oh, Patrick, you didn't want any, did you?   Blessed are the forgetful, for they get the better even of their blunders.  Mary and Stan click glasses.   Nietzsche.  Beyond Good and Evil.  Found it my Bartletts.   Yeah, I can't wait to tell Howard!  It seems really appropriate.   I love quotes.  So did Winston Churchill. He actually has a quotation in Bartlett's about Bartlett's.  Isn't that trippy?   \"The quotations when engraved upon the memory give you good thoughts.\"   I like to read what smart people say.  So many beautiful, important things.   Don't you think Howard's like that? Smart?  Important?   I think he'll be in Bartlett's one day.  Stan focuses on the monitor.  Mary pours herself another drink.   Let him go, Stan.  I can help.   It's amazing, isn't it?  Such a gift Howard gave the world.   To let people begin again.  It's beautiful.  You look at a baby and it's so fresh, so clean, so free.  And adults... they're like this messy tangle of anger and phobias and sadness... hopelessness.  And Howard just makes it go away.   No.  Besides, Howard's married, Stan.  He's a very serious and ethical man.  I'm not going to tempt him to betray all he believes in.  Stan takes another drag on the joint, passes it to Mary.   What?   Where?   Well, what should we do?   Sor-ry  We have to do something.  He can't wake up half done.    We should call Howard.  Stan turns and looks at her.  He's stoned and trying to understand her motivation.   This guy's only half cooked.  There's no time to fuck around, Stan.  Stan tries to think.  He paces.  Mary watches him.  Finally:   He's coming?   Hell no.  She starts getting dressed.   Shit, I'm so stoned.  I don't want him to see me stoned.  Stop being stoned, Mary!  She hurries into the bathroom with her bag.   God, I look like shit!  God!  Mary slams the bathroom door.  Stan puts his head in his hands.   There he is.  Oh my God.  Oh my God.  Do I look okay?  She doesn't say anything.   I'm still stoned.  Are you?  Crap.  She looks in the mirror.    Your Visine didn't do shit, fella.  The doorbell buzzes.  Mary lunges for the door, then calms herself before opening it.  Mierzwiak, holding an equipment bag, looks surprised.   I wanted to learn as much about the procedure as possible, Howard.  I think it's important for my job...to help comfort the clientele.  You know.  Mierzwiak looks from Mary to Stan, nods, and enters.  Mary closes the door.  Mierzwiak crosses to the equipment.   That was beautiful to watch, Howard. Like a surgeon or a concert pianist.   I'm so sorry, Howard, you must be tired.  He nods, distractedly.  She smiles to herself as he heads back to the equipment.    I like watching you work.  Stan sighs, grabs his coat.   Do you like quotes, Howard?   Oh, um, like famous quotes.  I find reading them inspirational to me.  And in my reading I've come across some I thought you might like, too.   Okay, um, there's one that goes \"Blessed are the forgetful, for they get the better even of their blunders.\"   Yeah, yeah it is, Howard.  And here I was thinking I could tell you something you didn't know.    There's another one I like, I read.  It's by Pope Alexander.   Yes, shit.  Oops, sorry!  Sorry.  It's just I told myself I wasn't going to say Pope Alexander and sound like a dope and then I go ahead and do it.  Like I psyched myself out.   You are such a sweetheart.  There's an embarrassed moment as that line hangs in the air. Then Mary plunges ahead to bury it.   Anyway, the quote goes \"How happy is the blameless Vestal's lot!  The world forgetting, by the world forgot: Eternal sunshine of the spotless mind!  Each prayer accepted, and each wish resign'd\".  She smiles, proud and embarrassed.   Really?  I thought it was appropriate maybe.  That's all.  I really admire the work that you do.  I know it's not proper to be so familiar but I guess since we're outside the workplace I feel a certain liberty to --   Okay.  Good.  Great.  Thanks.  I like you, Howard... an awful lot.  Is that terrible?  Mierzwiak seems momentarily taken aback, then returns to his unflappable self.   I've loved you for a very long time.  I'm sorry!  I shouldn't have said that.    I wish I was your wife.  I wish I had your kids.  Mierzwiak comforts her with a hug.  It turns into kiss.  He pulls away.   No you're right.  Once again.  You're a decent man, Howard.  He smiles sadly at her.  She smiles courageously at him.   What?  She follows his eyes and sees the woman in the window, who turns and walks off in a huff.   Oh my God!  Mierzwiak is already in his coat.  He's out the door.    Mrs. Mierzwiak, it's true.  And it's not Mr. Mierzwiak's fault.  I'm a stupid little girl with a stupid little crush. I basically forced him into it.  I swear.  Hollis turns, looks at Mary and then at Mierzwiak.   Tell me what?  Hollis and Mierzwiak have locked eyes.  Mary looks back and forth between them.  Hollis starts her car.   What, Howard?    Um, I liked you immediately.  At the job interview.  You seemed so... important and mature.  And I loved that you were helping all these people.  You didn't come on to me at all.  I liked that.  I was tongue-tied around you at first.  I wanted you to think I was smart.  You were so nice.  I loved the way you smelled.  I couldn't wait to come to work.  I had these fantasies of us being married and having kids and just...  ...and so... then... when... that one day, when I thought you looked at me back... like... Oh, Howie, I can't do this?  How can I do this?   Yeah, I know.  Oh, God.  Okay, well, I was so excited...   ...Remember you bought me that little wind-up frog?  A vague shot of a wind-up frog.   And you said...  A vague shot of Mierzwiak mouthing to Mary's voice.   \"This is for your desk.  Just a little token\"  Back to Mary sitting on the floor, listening to the tape.   I knew then... I knew something was going to happen... something wonderful.    Do you swear you didn't know?   And you never even suspected?  Never saw us behaving in any unusual way together?   How did I look?   And after that?   Do you remember anything else?  What I was wearing?  Was I standing close to him?  Was I leaning against his car like I owned it?  How did he look at me when I giggled?  Tell me everything.    Thanks, Stan.  She stops but doesn't turn to face him.   You're nice.  But I love him.  I knew I loved him.  Now I know.  He nods.  She waves, heads to the elevator.   I need this signed, Howard.  He takes it, unable to make eye contact.  He signs it, hands it back.   Thanks.  So... do we talk about this... or what?   Do you love me?  Did you love me? Something.  I listened to my tape.  I can't believe I've been sitting right in front of it for a year.  It's like listening to someone else's story.  I mean, I hear myself talking about having sex with you and I can't even imagine you naked.  I can't even say \"naked\" to you!   You made me have an abortion.   You made me have you erased!  I loved you.  I love you!  How could you --    Mary gets out of bed.  She has been crying all night.  She's a wreck.  She puts on some coffee then crosses into the living room area.  Sitting there are piles of the files from work.  She pulls the top one out, copies the name and address onto an envelope stuffs the file and tape cassette in.  She pulls another file out.  This one has Joel's name on it.  She copies it onto an envelope.    Mary opens the door.  Stan stands there with two cups of take out coffee.   Oh.   What do you want, Stan?   Nothing.   Then why did you ask me?   They have a right to know.  Howard is a thief.  He steals the truth.  I can't remember my baby!  I can't remember my baby.  It existed and I can't even remember.  Do you understand that?  Stan doesn't know what to say.  He stands there dumbly.  Mary slumps into a ball on a chair.   I won't allow it.  Those who cannot remember the past are condemned to repeat it.  What do you think of that?  That's from my quote book.    Remember the Alamo!  Remember the Alamo!    I don't want to hurt people.  But these things happened!  All these little sadnesses, the big ones.  What if no one remembers?  What does that do to the world?  Someone has to remember, Stan.  They look at each other.   May I help you?   Yes, please have a seat.  The doctor will be with you momentarily.  The woman sits.  Mary presses an intercom button.   Howard, your 10:30.  She switches the tape back on.",
        "Carrie": "Joel sits across Rob and Carrie, mid-40's.   I don't know, honey.  It's horrible.   Maybe you need to look at this as a sign to move on.  Just make a clean break.    Joel, honey... We have to feed the dog. Would you just wait here?  Just a second.  Joel nods, confused, as Rob and Carrie leave the room and close the door behind them.  Joel hears a hushed argument ensue in the hall.  He notices the dog asleep on the floor. He grabs a magazine off the coffee table, flips through it distractedly as he paces, puts it down, picks up another.  A subscription card falls to the floor.  He picks it up and is about to shove it back in the magazine when he sees it is not a subscription card at all.  It reads:   again.  Thank you.       Lacuna Ltd.      610 11th Avenue, NY, NY  Joel stares at the card, incredulous.  Later: Rob and Carrie are now back in the room.   You weren't supposed to see that.   Sweetie, we called the company.  Joel just stands there.  Close-up of a vague dictionary page.   You can't tell her, Joel.  They explained that.  Like waking a sleepwalker.  It might have a devastating effect.   Think about it: to be told you lived an existence of which you have no recollection.   Move on, sweetie.    Joel sits forlornly in the back seat.  Rob drives and Carrie sits in the front passenger seat.  The car stops in front of Joel's apartment building.   I hope you feel better, sweetie.   Say hi to Naomi.  The car door closes.    Rob drives.  Carrie fiddles with the radio dial in the front passenger seat.  Joel sits in the back.   I'm sorry Naomi couldn't make it.  You okay?  You seem quiet.   I did.  You said, things were fine.   This is the night you met Clementine, Joel.  I remember watching you walk down the beach with her and I thought, oh shit.   I told you that later.  Joel looks out he window.  He sees the husk of a memory on the darkened roadside.  It's Joel and Carrie in:    Faded.  Carrie and Joel sit at the table with coffee.   Who was the girl you walked off with?   Is this the right way?   Did you have fun?  Joel nods glumly.  Carrie continues to talk, but her voice goes under as Joel studies the faded husks of memories, piled like refuse outside the moving car window.  He sees dried-out version of previous interactions with Clementine playing out in loops. He looks back and sees the memory of his ride home from the beach with Rob and Carrie.  It, too, is decaying.  Soon all has crumbled into dust.  Everything goes black.    Carrie is on the phone.  She pauses nervously, then speaks:   Yes, Joel.  It is true.  We weren't supposed to say anything.  They say it's like waking a sleepwalker.",
        "Patrick": "I just thought I'd say hi.  I was in the neighborhood.   I was not.  Joel is mesmerized by their familiarity.  As he stands there, the scene starts to dry out. Clementine and Patrick continue their flirtation but it's turning lifeless, as if they are just reciting lines.  The bookstore start to lose its color and immediacy.   I can't.  I want to, but I have to study.   I really want to, but tonight's important.  Test tomorrow.   It's so cool.  You're by far the most sensational person in the room.   In the world.  Joel seems dazed, in some sort of dream confusion, as he realizes the world around him is looking increasingly odd.   The voltage looks fine.   Does that help?   It's kind of a dump, don't you think?  Joel looks up, trying to locate the voice.   Not a dump, then, but kind of plain. Uninspired.  And there's a stale smell. Sort of stuffy.  I don't know.  Stuffy.   Yeah.  Patrick returns to the bedside, focuses on the machines for a moment.  He glances at the unconscious Joel.   So who do you think is better-looking, me or this guy?  Stan glances sideways at Patrick.   Yeah?   I like Mary.  I like when she comes to visit.  I just don't think she likes me.   I wonder if I should invite my girlfriend over, too.  I have a girlfriend now.   Did I tell you I have a new girlfriend?   The thing is ... my situation is a little weird.  My girlfriend situation.   See, remember that girl?  The one we did last week?  The one with the potatoes?  Joel looks up, startled.   I gotta tell you something.  I kind of fell in love with her last night.   She was beautiful.  So sweet and funky and voluptuous.  I kind of stole a pair of her panties, is what.   I know.  It's not like... I mean, they were clean and all.   Yeah, okay.   Okay, but there's more.  Joel listens.   After we did her, I went to where she worked and I asked her out.  Joel looks over at the faded Clementine across the couch. She stares straight ahead at the TV.   Hi, Mary.  How's it going?  She walks past him.   Mary hates me.  I've never been popular with the ladies.    Okay, There's more, Stan --  Stan looks over at Patrick.  Mary returns with a bottle of scotch and two glasses.   Nah, I don't know.  Mary hands a glass to Stan.  She holds hers up in a toast.   What's your bartlett's?    Yeah.  Cool.   Very cool.  Trippy.   Definitely!   Definitely.   Hi, Clementine! -- Why, what's wrong? -- Oh, I'm sorry. -- Well, I'm not sure, I kind of have to study for my test --   Hold on.  Let me ask my friend.  Stan, can I leave for a little while?  My girlfriend is very --   She's right in the neighborhood.  She's upset.  Mary is in the kitchen.  She pokes her head out.  She's got some pie on a plate.    Mary hates me.  I'll be right over, Tangerine.   Oh, baby, what's going on?   Oh, Tangerine.   Sure.  We'll go next weekend and --   Um, okay.  I'll call my study partner.    Stan, it's Patrick.  Pick up.   I got into a situation with the old lady. Can you handle things tonight alone?  I'm really sorry, man.   Thanks, Stan.  I owe you.  Patrick hangs up, rifles quickly through his backpack.  He pulls out a silver bracelet, puts it in his pocket, then pulls out a journal, flips through it, keeping an eye on the bedroom door.  The handwriting is a woman's.  He finds what he's looking for.  He reads:   I'm excited, too.  Oh, and I wanted to give you this.  It's a little... thing.  Patrick pulls the bracelet from his pocket, hands it to her.   I didn't have a chance to wrap it.   Nothing is wrong with you.  You're the most wonderful person I've ever met.  She glances gratefully over at him then starts to cry even harder.   I could die right now, Clem.  I'm just happy.  I've never felt that before.  I'm just exactly where I want to be.  Clementine looks over at him.  Their eyes meet.  She sobs.    Patrick and Mary are heading home from Boston.  Mary is silent and depressed.  Patrick tries to break the silence.   You want to stop for coffee or something?  Mary shakes her head \"no.\"  Long silence.   Well, it was sure beautiful on that river.  Thanks for sharing it with me.  Mary doesn't say anything.  Silence.   Well do it again soon.   This never should've happened, ma'am. We'll take care of it.",
        "Frank": ""
    },
    "imdb_rating": "8.3",
    "description": "Much to his surprise, timid Joel Barish is shocked to discover that the love of his life, sparky Clementine, has had him erased from her memory. As a result, hurt and angry, Joel wants to pay her back in the same coin, going as far as to undergo a painless but intricate medical procedure to do the same. However, poor Joel is utterly unaware that darkness is an essential part of the light. And as the once-cherished recollections of Clementine gradually fade away, giving way to a soulless black void, something unexpected happens. Now Joel has second thoughts, toying with the idea of stopping the irreversible process. Who said ignorance is bliss?Nick Riganas",
    "name": "Eternal Sunshine of the Spotless Mind",
    "genres": [
        "Drama",
        "Romance",
        "Sci-Fi"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNjIxMTEzOTUtYWJhYS00MDQwLThmNmItYzkyN2MzZGVkZmM1XkEyXkFqcGdeQXVyOTU2NDAzNDE@._V1_QL75_UY281_CR3,0,190,281_.jpg"
}