{
    "filename": "Event-Horizon_script.txt",
    "imdb_id": "tt0119081",
    "imdb_url": "https://www.imdb.com/title/tt0119081",
    "characters": [
        "Complete credited cast:",
        "Dr. William Weir",
        "Cooper",
        "Smith",
        "Denny Peters",
        "D.J.",
        "Justin",
        "Lt. Starck",
        "Rescue 1 Technician",
        "Captain John Kilpack",
        "Burning Man /Edward Corrick",
        "Captain Miller",
        "Claire",
        "Peters, Med Tech"
    ],
    "dialogues": {
        "Cooper": "Time to play Spam in the can.  Is that an offer?  Damn, Dr. Weir, don't scare us like that. Coffee?  Coffee.  Hey, Starck. You wanna dry my back?  You can call him Baby-bear, he loves that...    I heard it.  ...cancel our leave and send us out on some bullshit mission...!  Laymen's terms.  I can see why they sent you along.  Latin? Who the fuck speaks Latin?  From what?  Skipper, do we get hazard pay for this?  ...come on, Skipper, I already put my shoes on...  I'll be all over it.  You still need the rope? I thought you were one a those spacemen with ice in ya veins.    Hey, Baby Bear, Mama Bear got a corpsicle for ya...    Justin, do you copy?      Justin?  What's happening?  350 meters... 400 meters...  I'm gone!  Hold on, Baby Bear...  Oh my God...  Justin, do you read me? Justin... .  Baby Bear, don't do this. Don't do this...      I told you. He was inside the Core...  It was like... nothing was there... and then Justin appeared and the Core... became metal...  You weren't there. I saw it.  I'm telling you, I saw it...    You been out there a long time. Trying to break my record?  What?  Shit, Smith, you're going Biblical on me.  You're sucking too much nitrogen in your mix.  We'll have to re-route through the port conduit to the APU.  But Justin...    Cross your fingers.    Solid as a rock. Hey, Smith...    Let me breathe, let me breathe...  How? The Bridge is gone.  Can you shut it down?  I don't want to go where the last crew went. I'd rather be dead.  ...and the gravity drive goes where no man has gone before.  Will it work?  I'm gonna activate the emergency beacon.  Starck?  What...?     It's over, hush now, it's over...",
        "Smith": "I can't believe this, I haven't gotten more than my hand in six weeks and now this shit. Why not Mars, Cap, Mars has women...  Locked and cocked.  30 hours to Neptune orbit.  Let the dead rest, man...  You can't do that.  Hey...  What the hell is that?  Jesus...    One-four degrees...  We have a lock on the Event Horizon's navigation beacon. It's in the upper ionosphere, we're in for some chop.    That's not it. That ship was built to go faster than light... That's just wrong, it goes against everything we know...  Something like that, yeah.  Yes, sir.  Dead ahead, 5000 meters.  We've got some weather.  Range 3000 meters and closing.  1500 meters. We're getting too close...  1000 meters...  Proximity warning! 900, 800 meters, 700... we're right on top of it, we're gonna hit!  Jesus, that is one big ugly fat fucker...  Range 500 meters and holding. Turbulence is dropping off...    Shit, Doc, any closer and we're gonna need a rubber...     Explosive decompression.  What the hell is that?  Something's wrong...  Get them back --  The safety circuit's failed!    We have a situation here...      We're losing pressure at 280 liters a second and our oxygen tanks are cracked. In three minutes, our atmosphere will be gone. We are fucking dead.    What?  I don't think this is a good idea, we don't even know what happened on that ship...    Captain Miller, you copy?  I've found a six inch fracture in the outer hull. We should be able to repair it and re-pressurize, it's gonna take some time.  Understood.  I'd rather spend the next twelve hours Outside than another five minutes in this can. This ship is bad. It watches you.  You heard me. This ship, it's crazy: trying to go faster'n light, that's like the Tower of Babel.  You know what happened to the Tower of Babel, don't you? It fell down.  I didn't see anything and I don't have to see anything. This ship is fucked.    ...you break all the laws of physics, you think there won't be a price? You already killed the first crew...  He's fucking lying, you know something...!  Sir.  What about the accumulator...?    What's going on, sweethearts?  About goddam time.  Let's go, let's go, this place freaks me out...      She was right behind me, I turn around, she's gone. She could be anywhere.  Roger that.  Dr. Weir! Hey, get your ass back on board! Dr. Weir!  Skipper, come in...        No, no, we just got her back together...  Where is it, where is it...  I gotcha... I gotcha...  I gotcha.",
        "Denny": "Mommy...  Mommy...            Mommy...  Wanna show you, Mommy, wanna show you something...",
        "Peters": "and DJ  load CO2 scrubbers into a bin in the floor. Weir stands to the side like a fifth wheel.  Just loading the last of the CO2 scrubbers. Good for four months.  No, no, its alright. I talked to my ex, he'll keep Denny over Christmas and I'll get him this summer. Goddam it, Skipper... I haven't seen him in two months.  First time in a grav couch?    He served on the Goliath.    You'll be fine. You'll wake up and we'll be there. Watch your fingers.         How can we salvage...?  It doesn't sound like anything human.    We've got pressure.  Jesus its huge.  (ahead at the next coupling  That means they didn't abandon ship.  There's no one in the corridor but us.  I don't know, this place is really dark, I can't see a thing...  I can see the hatch.  We found the gravity couches.  Dr. Weir, what's this the door to?  I found something.      There's no one here, Skipper.  Come on...  BLOOD AND TISSUE. Someone died here in a violent and terrible way. Peters starts to look up but the flash dies away. She never saw the horror behind her. Peters turns her attention back to her tiny crystal. She traps the it, returns the container to her belt. She moves from the antechamber into...  Okay. I'm on the bridge.  Everything's been shut down. Conserving power, I guess. Green light on the hull, it's intact.    It's stuck.  It's really jammed in there.    Frozen.  Crystallized.  Denny...    Yeah. I'm -- I'm okay.  I'm ahead of you. Bringing the thermal units on line...  Hold tight and prep for gees.  What happened to him?  I can use the station in Medical, keep an eye on Justin...  Justin...?  Nothing. It's nothing.    The speaker is the mission commander...  I can run the image through a series of filters, try to clean it up.  What's happening...?  I did.  About an hour ago. In medical. I saw my son. He was lying on one of the examination tables and his legs were...  I've seen bodies before. This is different.  Justin...?  Justin!  You didn't hear it? You must have heard it!  Oh... nothing...  Stop it! Stop it!    Justin, no!  Can you shut it down?  Justin! Open the door!      Yes. Yes, Justin, we heard it.  Do you know what it was?        Justin, look at me. Look at me. Open this door.      Starck!  We have to do something, oh God...  Oh God... Justin...  I've got a pulse, he's alive...  90 over 50 and falling... .      You got any coffee?  I don't care.    Sweet Jesus. Miller... MILLER!  CO2 scrubbers for the Clark. Miller pulled the plug on the mission.  Last one.       Smith.        Denny...?  Denny? Denny, come to Mommy...  Hold on, Denny, Mommy's coming...  Denny?  Denny...?  You can walk... Denny, you can walk... oh, my baby...",
        "D.J.": "",
        "Justin": "Everything green on my boards, Skipper.  Ballast.  That means top-secret, Cooper.  Seven years ago, the reactor blew...  How do you know all this?  So if the ship didn't blow up, what happened?  Yes, sir!  I'd rather be on the rope and not need it than need it and not have it. Now step aside, old man.  Not a chance, sir.  We still have pressure. The radiation count's steady at 7 millirads an hour.  I've reached another containment door. This thing's huge...  I'm going in.    I'm in the Second Containment area. It's pitch black in here. There must have been a coolant leak. Man, this shit is everywhere. I can't see a damn thing.  The reactor's still hot. Coolant level is on reserve, but still in the green.        I think I found something...     Almost done, I just gotta check one thing...               Did you hear it?    ...can't describe it... there are no words...          The other crew, they're there, they're waiting for me. They're waiting for you. I won't go back there... I won't...  If you could see the things I've seen, you wouldn't try to stop me. You'd come with me.  Hey, Mama-Bear... what are doing...?  Oh my god OH MY GOD...    Skipper, you gotta help me...  ...tell them to open the door...    But I can't... I gotta get out of here... Skipper, please...  Okay... okay...  Oh god --",
        "Lt.": "",
        "Starck": "Smith's right. Neptune? There's nothing out there. If something happens, we'll be on our own.  We're past the outer marker, we can engage the ion drive whenever you're ready.  Ion drive will engage in... T-minus ten minutes.  It is not.  Maybe when you finish puberty.  I just finished drying...  All boards are green, everything's five by five.  That's impossible! She was lost with all hands, what, seven...  The law of relativity prohibits faster- than-light travel...  How?  A straight line.  No one. It's a dead language.  Crossing the horizon. Optimum approach angle is fourteen degrees.     If they are, they're screening their calls.    It should be right there...  My God.      Picking up magnetic interference.  Look at the size of that thing.  The reactor's still hot. We've got several small radiation sources, leaks probably. Nothing serious.  Affirmative. The hull's intact... but there's no gravity and the thermal units are off line. I'm showing deep cold. The crew couldn't survive unless they were in stasis.  Something's wrong with the bio-scan.  There's not enough radiation to throw off the scan. I'm picking up trace life forms, but I can't get a lock on the location.  If they were in stasis, I'd get a location, but these readings, they're all over the ship. It doesn't make any sense.  I'm running diagnostics now, Skipper... Nothing's wrong with the sensor pack, I'm still getting trace life readings, all over the ship.      What is it?  What happened to his eyes?  Decompression wouldn't do that.  You okay?  Justin, hold on a sec, you're breaking up...   (static obscure her voice  Justin, come in...  I don't know. The life readings just went off the scale.  Miller, do you read me, Peters --  I'm trying, goddammit --    Here comes another one! Hold on!  We lost the starboard baffle! The hull's been breached!  There are pressure suits in the Airlock. Go!  What if the air has gone bad? We can't wear these suits forever.  We're all here.  It tastes bad.  The antennae array's completely fried, we've got no radio, no laser, no highgain... No one's going to be coming to help us.  Oxygen is not the problem.    I thought of that, with the filters from the Clark, we've got enough breathable air for twenty hours. After that, we'd better be on our way home.  The Event Horizon sensors show the same thing: \"Bio-readings of indeterminate origin.\" Right before that wave hit the Clark, there was some kind of surge, right off the scale, but now it's back to its previous levels.  I don't know, but whatever it is, it's not the crew.  What's the point? I'll just get the same thing...  I can reconfigure the scan for C-12, amylase proteins.  I can't believe we built this.  Why Dr. Weir, I think you're in love.  Claire is your wife?  It must be hard, being so far away from her.  I'm sorry.  Maybe a power interruption crashed the system...  What the hell...       Maybe one of the original crew?  Who?    Miller...  ...I ran the bio-scan with the DNA/RNA filter. The results were bio-readings of indeterminate origin...  I've got a theory.  There was a another surge in the bio- readings right before you... you saw what you saw. We picked up a similar readings right before the Clarke was damaged. What if there were a connection between the two? The gravity waves, the hallucination, all part of an defensive reaction, like an immune system...  You've got to listen...  I didn't say that, I said the bio- readings correspond to what happened to you, the ship is reacting to us...  It's not bullshit, it's the only conclusion the data supports...  I know that.  I thought you wanted an answer. And that's the only one I have.    Heard what?  What are you doing?  No...!  In our current environment, Dr. Weir, self-control is an asset.  What is it?        He's awake, he's in the airlock, he's not wearing a suit.  He's engaged the override.  I'll try. DJ, you better get your bag of tricks.    Keep him talking.  I don't think she can talk him down. We need a sedative.  Almost got it.  I can't! The inner door can't open once the outer door has been triggered, it would decompress the entire ship!    Five seconds.  CO2 levels will reach toxic levels in four hours.  Justin said something about, \"The dark inside me...\" What did he mean?  On the bridge. You said \"it\" wanted you.  It's cold.      Don't leave me!    Weir can't be alive.  Cooper!  You're okay now, it's over...  We've got to shut it down, we've got to...  There must be a way! What about Engineering?  I don't know the process, Dr. Weir was the expert...  Blow it up?  I'll do it --  Don't be long.  Hurry.  Cooper...!  Run!  Miller, he's back, he was in the tank...         Miller...",
        "Captain": "",
        "Miller": "I don't like it either, but you know the rules: we get the call, we go. Is the course locked in?  Justin?  Start the countdown.  Let's go.    Don't start with me, Cooper.  The clock is running, Dr. Weir. If you'll follow the rest of the crew, they'll show you to the gravity tanks.  What's the hold up?  I put in for a replacement for you but no one...  I am sorry. But now we have to go to work.  Doctor Weir, my crew is not going on your mission because we want to. We were pulled off a well deserved leave, to be sent out to the middle of nowhere, and no one's even told us why.  Until then, do what you're told and stay out of my way.  Five minutes.  Starck, why aren't you on the bridge?  Then what are you doing here? Come on, people, let's go! And Cooper... Put some pants on.  That's good to know. Justin, you wanna stow that?  Okay, listen up. As you all know by now, we have an addition to our crew. Dr. Weir, this is: Starck, navigation; Smith, pilot, Justin, ship's engineer --  This is Cooper, what the hell do you do on this ship, anyway?  He's a rescue technician. Peters, medical technician. DJ...  And this is mission specialist Dr. William Weir. We all know where we're going. Dr. Weir is going to tell us why.  EVERYBODY SHUT UP! Let the man speak.  Where has it been for the last seven years?  What is that?  What does it say?    You heard the tape, Smith. We're looking for survivors.  Come around to three-three-four...    Bring us in tight. Starck, get on the horn, see if anyone's listening...  We're all on edge, Smith. We're a long way out...  What are you trying to say? \"If God had intended Man to fly, he would have given us wings?\"  I guess we're about to find out. Keep us slow and steady.  Dr. Weir...!  I think you want to see this.  I noticed. Starck, anybody home?  Where is it?  Starck...  Reverse thrusters full!  Put it through TACS. Smith, you up for a flyby?  Do it.  Smith, use the arm and lock us onto that antennae cluster.  Starck, give me a read.  Find 'em, Starck.  Radiation interference?  Okay. We do it the hard way. Deck by deck, room by room. Starck, deploy the umbilicus. I believe you're up for a walk, Mr. Justin. Go get your bonnet on.  Dr. Weir, I need you on the bridge.  Once the ship is secured, we'll bring you on board --       Clear and open on my mark. Three... two... one... mark.  Ice crystals everywhere. This place is a deep freeze.  Peters and I will search the forward decks. Justin, take Engineering. No hot-dogging, not on this one, alright?  Dr. Weir, what's this?  I can see that, what're they for?  So where are they? Starck, any luck with the bio-scan?  Peters is right, no one's here.    Starck, you still showing those readings?      They're empty, Dr. Weir. Moving forward.  If we saw any crew, Doctor, you'd know about it. I'm in Medical. No casualties, it looks like this place has never been used.      The science workstation has power, I'll see if I can find the crew from here.          What the hell...  Oh shit...!  Boarding party, sound off... Peters, do you read me... . Peters...    Justin? Justin, sound off... Justin...!     Can anybody hear me...  Peters...    Coop, where are you...  Hold on, Coop...  Smith, where the hell have you been?!  Do we have enough time for a weld?  No one's dying on my watch, Smith! What about the reserve tanks?  Dr. Weir's right. Get on board the Event Horizon. I'll meet you at the airlock.  You heard me, Smith. Peters, are you with me?  Everybody okay?  Okay. Let's find out how much time we just bought.  No time. We need whatever's left in our suits to repair the Clark. Like it or not, this is the only oxygen for three billion kilometers.  But you can breathe it.  How much oh-two do we have?  Carbon dioxide?  We can take the filters from the Clark...  What about the life readings you picked up?  What's causing the readings?  So where is the rest of the crew? We've been over every inch of this ship and all we've found is blood. Dr. Weir? Any suggestions?  What happened here?      How is he?  DJ, take samples from these stains, compare them to medical records, I want to know whose blood this is.  Okay, people, there's been a change in the mission. In less than eighteen hours, we will run out of breathable air. Our primary objective is now survival. That means we focus on repairing the Lewis and Clark and salvaging whatever will buy us more time. Our secondary objective is finding out what happened to this ship and its crew. Two months from now, I fully intend to be standing in front of the good Admiral giving my report, and I'd like to have more than my dick in my hands.  Peters, I want you to go through the ship's log, see if we can't find some answers.  Fine. Starck, I want you to repeat the bio-scan...  Not acceptable. I want to know what's causing those readings. If the crew is dead, I want the bodies, I want the crew found.  Do it. Dr. Weir...  One of my men is down. I want to know what happened to him.  Cooper! Enough!    Hold on, what's this \"gravitational distortion?\"  What could cause them? What's in the Core?  How much time do you need? We have seventeen hours and forty-two minutes. Now: what is in the Core?  It's insane.  If it worked.  I want this room sealed. The Second Containment is off limits.  Your black hole damn near ripped my ship apart. It may have killed one of my men. No one goes near that thing.  You have something, Dr. Weir?  What about it?  It's 2041...  Explanation?  I wonder if they ever made it.     What the hell is that? Dr. Weir?  Do it.  We barely have enough power for life support as it is, if we can't stop the drain, we're not gonna make it.  Wait!  The rest of you, stay here, I don't want anyone else going near that thing.  No radiation. What's causing the drain?  We don't get the power back, our air's gonna go bad.  We just lost all power in here. Dr. Weir...?  Goddammit, DJ, it was not a hallucination! I saw a man, he was on fire. And then he disappeared.  No. It was someone else.    Peters is right. Its like something reaching into your mind. Seeing your thoughts and making them real. Smith, did you or Cooper experience anything unusual?  Smith...  That's enough!   That's it, that's enough for one day, Smith! I need you back on the Clark, I need you calm, I need you using your head, you make a mistake out there, none of are getting home, you understand?  Get outside, go back to work. I'll join you shortly.  We're a long way from home and we're in a bad place. Let's not make it worse. If anyone has any constructive suggestions, now is the time.  Do it.  I don't need sleep, DJ. I need answers.        Go ahead.  I don't need to hear this.  To what? What are you saying? This ship is alive?  We're hanging on by our fingernails and you're giving me bullshit stories...  Starck, do you know how crazy that sounds? It's impossible.  If you knew it was impossible, then why'd you waste my time?  What I want is to survive the next ten hours.  I'm going outside to work on the Clark. And Starck... don't tell anyone what you just told me. We've got enough to worry about.    What's going on in there, Starck?      I'll get him.  I'm on my way, Starck.  Patch me through to him.      You're not going to die! Not today! I want you to do exactly as I say and I'm gonna get you out of there, alright?        We'll make it.    Thanks.  Is that your \"expert opinion?\" The only answer we've had out of you is \"I don't know.\"  I want to know what caused that noise. I want to know why one of my crew tried to throw himself out of the airlock.    You said this ship creates a gateway...  To what? Where did this ship go? Where did you send it?  Where has it been for the past seven years?  The \"Other Place,\" what is that...?  That's exactly what we don't have, Doctor.  Any change?  Of course not. Justin just climbed into the airlock because he felt like it. Just one of those things. I swore I'd never lose another man. I came close today. Real close.  It was on the Goliath. There was this bosun, Corrick, a young guy, a lot like Justin. Edmund Corrick, from Decatur, Georgia. He got caught when the pressure doors sealed, one closed on his arm. Severed it at the wrist. The pain of that must have been... He passed out and...  I, I tried to go back for him, to save him, but I couldn't get to him in time. The fire... Have you ever seen fire in zero-gravity? It's like a liquid, it slides over everything. It was like a wave breaking over him, a wave of fire. And then he was gone. I never told anyone until now. But this ship knew, DJ. It knows about the Goliath, it knows about Corrick. It knows our secrets. It knows what we're afraid of. And now you're going to tell me it's carbon dioxide.  What is it?  Go on.  It's not a distress call. It's a warning.  Hear what?  \"Save yourself. From Hell.\" What are you saying, are you saying that this ship is possessed?    Alright, Cooper.  You got it, Coop.  Back in business.  We're leaving.  \"...to rescue the crew and salvage the ship.\" The crew is dead, Dr. Weir. This ship killed them. And now it's killing us.  Maybe you're right. But it's still my command, and I have leeway to abort when I feel there is an unacceptable threat to my crew. And I think there is. Starck, download all the files from the Event Horizon's computers. Coop, Smith, finish moving the CO2 scrubbers back onto the Clark.  It's done.  We will take the Lewis and Clark to a safe distance and then launch tac missiles at the Event Horizon until I am satisfied that she has been destroyed. Fuck this ship.  Watch me.  Starck, what the hell is going on?  Goddammit! Starck, get those files and vacate. I want off this ship.  Just get your gear back onto the Lewis and Clark, doctor, or you'll find yourself looking for a ride home.  Weir? WEIR!  All hands. Dr. Weir is missing. I want him found and restrained.    Now what?    Alright. Prep the Clark for launch. I'll find her.    Smith, get out of there...  One of the explosives is missing from the corridor. I think Weir may have put it on the Clark.      Smith? Smith! Fuck!   DJ. The Clark's gone. Smith and Cooper are dead.    DJ, you read me?    Peters...      Son of a bitch!  Oh my God.  Oh, God, DJ, what do I... how do  Oh God...  Weir.  Hold on... Get you outta these...  Your eyes...  What are you talking about?  What are you doing?  If you miss me, you'll blow out the hull. You'll die too.  Give me your hand! Your hand!  The forward airlock.  Whatever was on that bridge wasn't Weir.  Stay behind me.    Weir activated the drive. He's sending us to the Other Place.   We blow the Corridor. Use the foredecks as a lifeboat, separate it from the rest of the ship. We stay put...  You prep the gravity couches. I'm going to manually arm those explosives.  It worked for Weir. Prep the tanks.  No. I'll be right back.  Close it behind me. Just in case.  We're armed. This fucker's ready to blow...    Slow down, Starck, I can't understand you, who was in the tank?  Who? Who?  He's dead...  You're dead, I saw you die.  Then who the fuck are you?  Corrick...  That's not true...   You're not Edmund Corrick.  What are you?  You want me to believe you're the Devil, well, I don't, that's bullshit!  Then what, what are you? Tell me...   You can't have them!  ...not the Devil...  You're lying...!  Starck... Cooper...  (a grim smile of triumph",
        "Claire": "I'm so cold...  Billy. Help me. I'm so cold.  Help me. I'm so cold.  So cold.     Billy."
    },
    "imdb_rating": "6.6",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZGI0NDMwNjAtNGEzNC00MzA1LTlkMjQtYjBkYTZlZjAyZWEyXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_QL75_UX380_CR0,3,380,562_.jpg",
    "description": "In the year 2047, a group of astronauts are sent to investigate and salvage the long-lost starship Event Horizon. The ship mysteriously disappeared seven years ago on its maiden voyage, and with its return comes even more mystery as the crew of the Lewis and Clark discover the real truth behind its disappearance and something even more terrifying.—Losman <losman@express-news.net>",
    "name": "Event Horizon",
    "genres": [
        "Horror",
        "Sci-Fi",
        "Thriller"
    ]
}