{
    "filename": "Ex-Machina_script.txt",
    "imdb_id": "tt0470752",
    "imdb_url": "https://www.imdb.com/title/tt0470752",
    "characters": [
        "Complete credited cast:",
        "Kyoko",
        "Caleb",
        "Amber (as Lina Alminas)",
        "Katya",
        "Ava",
        "Lily",
        "Jade",
        "Jay",
        "Jasmine (as Symara Templeman)",
        "Nathan"
    ],
    "dialogues": {
        "Kyoko": "",
        "Caleb": "How long was I out?  Damn. Can't believe I've been missing this. I was so psyched to be coming here, I was awake all night.  Yeah.  Long Island. I work on algorithms for the search engine.  You know what they are?  Is that a good thing?  I guess you know him pretty well.  I won a competition. It was kind of like a lottery, for employees. The winner got to spend a week with him.  Yep.  Believe me. I know it.  Incredible here.  How long until we get to his estate?  You're leaving me here?  ... What building?  ... Yes.  ... Can we do another?  Hello?  ... Hi.  No.    Thank you. I'm fine.  Yeah?  Sure.  ... Was it a good party?  ... I am?  Okay.  It's good to meet you, Nathan.  ... Uh, yes.    You bet.    This is great.  ... Sorry?  There's nothing wrong.  No. No way. I wasn't thinking that. I was thinking: this is really cool.  ... There is?  ... What?      `The signee agrees to regular data audit with unlimited access, to confirm that no disclosure of information has taken place, in public or private forums, using any means of communication, including but not limited to that which is disclosed orally or in written or electronic form...'  I think I need a lawyer.  It doesn't feel very standard.  ... Yeah.    I know what the Turing Test is.  It's where a human interacts with a computer. And if the human can't tell they're interacting with a computer, the test is passed.  That the computer has artificial intelligence.  ... Are you telling me you're building an AI?  ... Holy shit.  If you've created a conscious machine, it's not the history of man. It's the history of Gods.  ... Hi.  I'm Caleb.  ... Do you have a name?  ... I'm pleased to meet you, Ava.  ... Why do you ask that?  ... Yes.   A little.  I'm not sure.  ... Do you?  Why do you feel nervous?  ... Then we're both in quite a similar position.  None like you.  So.    Let's break the ice.  Do you know what I mean by that?  What do I mean?  So let's have a conversation. If we talk, we'll both relax, and get to know each other at the same time.  Why don't we start with you telling me something about yourself.  Whatever comes into your head.  Sure.  One what?     One year?   Or one day?  Quite young. When did you learn how to speak?  Why?  Some believe language exists in the brain from birth, and what is learned is the ability to attach words and structure to the latent ability.  Would you agree?  That sounds good.       I'd like to see them.  Yeah.     Definitely.  Sorry. I was just ordering my thoughts.  She's fascinating. When you talk to her, you're through the looking glass.  Actually, it's someone else's quote.  ... I don't think that's exactly what I said.  But I didn't say that.  Yes.   Although -  No! No qualification to her. Just - in the Turing test, the machine should be hidden from the examiner. And there's a control, or -  I think you're probably right. Her language abilities are incredible. The system is stochastic, right?  Non-deterministic.  At first I thought she was mapping from internal semantic form to syntactic tree-structure, then getting linearised words. But then I started to realise the model was probabalistic, with statistical training - or at least some kind of hybrid.  ... No?  Try me! I'm hot on high-level abstraction, and -  ... Oh.   Sorry.  I feel...  ... that she's fucking amazing.  Cheers.        25                                                                    25           Eyes closed.    For a beat.  Then his eyes open.   He's wide awake.  He turns over in the bed.  Then turns back again.   God damn it.  ... What the fuck?  ... Are you kidding?  I don't know. No one really.  What?  I was wondering how the phone worked. That's all.  ... Something happened in my room. Some kind of power cut. So I came to see what's going on.  I couldn't open the door to the bedroom.  Sure.           ... Hi.  No. It was a good thing.     Thank you.  You bet.  I'm not sure. I'm still trying to figure the examination format. Testing Ava by conversation is kind of a closed loop.  Like trying to test a chess computer by only playing chess.  It depends what you're testing it for. You can play it to find out if it makes good moves. But it won't tell you if it knows it's playing chess. Or if it even knows what chess is.  Exactly. And I think being able to differentiate between those two is the Turing test you want me to perform. The difference between an `AI' and an `I'.  ... What's it a drawing of?  No.  Don't you know?  Are you not trying to sketch something specific? Like an object or a person.  Maybe you should try.  Whatever you want.   It's your decision.  I'm interested to see what you'll choose.  ... Of course.  Why wouldn't it be?  ... Yes.  ... That's a fair comment.  So - you want me to talk about myself.  Where do you want me to start?  Okay, Ava. Well - you know my name. I'm twenty four. And I work at Nathan's company. You know what his company is?  That's right.  Brookhaven, Long Island.  It's okay. I've got an apartment. Kind of small. But - it's a five minute walk to the office. And a five minute walk to the ocean, which I like.  No.  ... Yeah.  Grew up in Portland. No brothers or sisters. My parents were both high school teachers.    I spent a lot of time in the hospital. Nearly a year. Got into coding. By the time I made it to college, I was pretty advanced.  Yes.  Yes.  Or - kind of. Nathan wrote the Blue Book base code when he was thirteen. If you understand code, what he did was - Mozart or something.  I like Depeche Mode.  Yes.    Of course.  Sure.  Well, a good friend is -  We only just met. It takes time to get to know -  ... Wrong about what?  ... In what way?  Excuse me?  I'm sorry, Ava, I don't understand what you're -  ... Yes.  No.   No problem.    I think she gets that you're pissed.  Do you know why they happen?  Can't you call them back?  Cheers.  You saw how the day went, didn't you? I mean, I assume you're watching on the CCTV.  There was one interesting thing that happened with Ava today.  She made a joke.  It got me thinking. In a way, the joke is the best indication of AI I've seen in her. It's discretely complicated. Kind of non-autistic.  It was a play on words, and a play on me. She could only do that with an awareness of her own mind, and also of awareness of mine.  Sorry?  Nothing.  No.    Not really.                37                                                                37  Clean-shaved, CALEB walks into his bedroom. On the TV, the live feed of AVA'S room is playing - though she is not in shot. Subtly, CALEB'S gaze flicks to different points around the room. To the full-length mirror on the wall. The high vent for the air-conditioning system. The TV itself. CALEB hesitates for a moment. Then pulls on a T-Shirt.   Picks up his ID card.   And exits.     43                                                                43  Ava?          Yes.   It is.  Have you never been outside this building?  You've never walked outside.  ... Where would you go if you did go outside?  A traffic intersection.  It wasn't what I was expecting.  People watching.  It's a date.  Okay.  Why?  I don't think I will.   Whatever it is.  ... Okay.   Watching the ghost shape through the opaque glass.   As she starts to move back towards him, CALEB recloses his eyes. And keeps them closed, as he hears her approach.    You look... good.  Yes.  ... They do.  Right. First the traffic intersection. Then maybe a show.  Yeah.   It would be fun.  What?  ... I do?  How?    I'm not sure you'd call them micro.  Tell me.  Why did you give her sexuality?   An AI doesn't need a gender. She could have been a grey box.  They have sexuality as an evolutionary reproductive need.  What?  Pleasure response.  That wasn't my real question.  No.     My real question was -  My real question was: did you give her sexuality as a diversion tactic?  Like a stage magician with a hot assistant.  Exactly. So. Did you program her to flirt with me?  Wouldn't it?  Of girl?  So did you program her to like me or not?  Nobody programmed me to be straight.  This is childish.  Jackson Pollock.  ... What?  He never would have made a single mark.        ... Hey.  I don't know how you did any of this.  You hacked the world's cell phones?  This is her hardware?  And the software?  ... Blue Book.  Why did you want to show me this?  Remind me of what?  In college, I did a semester on AI theory.  There was a thought-experiment they gave us. It's called Mary in the black and white room.  Mary is a scientist, and her specialist subject is colour. She she knows everything there is to know about it. The wavelengths. The neurological effects. Every possible property colour can have.  But she lives in a black and white room. She was born there, and raised there. And she can only observe the outside world on a black and white monitor. All her knowledge of colour is second-hand.  Then one day - someone opens the door. And Mary walks out. And she sees a blue sky. And at that moment, she learns something that all her studies could never tell her. She learns what it feels like to see colour. An experience that can not be taught, or conveyed.  The thought experiment was to show the students the difference between a computer and a human mind. The computer is Mary in the black and white room. The human is when she walks out.  Did you know that I was brought here to test you?  Why did you think I was here?  I'm here to test if you have a consciousness, or if you're just simulating one.  Nathan isn't sure if you have one or not.  I'm not sure either.    What about?  Why did you tell me that I shouldn't trust Nathan?  Lies about what?  Including the power cuts?  Don't you think it's possible that he's watching us right now? That the blackouts are orchestrated, so he can see how we behave when we think we're unobserved.  ... You're causing the cuts?  Can we talk about the lies you've been spinning me?  I didn't win a competition. And there was no lottery to meet you. I was selected.  It's obvious, once I stop to think. Why would you randomly select an examiner for a Turing test? You could have had some bean-counter turn up at your front door. Or the guy who fixes the air conditioning.  Why me?  Proof of what?                            67                                                                 67  Kyoko.  Kyoko - where's Nathan?  Jesus! You really don't speak a word of English?  I said: where's Nathan?  What the fuck?  Stop!  ... I don't want to.    What were you doing with Ava?  You tore up her picture.  It's because you're drunk.      74                                                                74    Test me?  Right. Those pesky micro- expressions.  Shoot.  Red.  What?  ... Then what is my favourite colour?  All right.     Hold on a minute...  Okay. I get it. I guess seeing as I'm not six, I don't really have a favourite colour.  Well, it's actually a memory of kindergarten. There was this kid who -  ... Really?  Okay.    Wait.  So, there is a kind of an earlier memory. But it's ultra vague. It's like... a sound. And, maybe sky. Or blue. No, I think sky. And I think the sound is my mother's voice.  Oh, man. Can we stop the test? You're a walking lie detector, and I've suddenly realised this is a fucking minefield.  Yes. I think so.      I'm a good person.  You are.  Did I pass?  That's a relief.  Why is it a relief?  Oh, you know...  Just, if there's a test, I guess by definition you want to pass.  Ava -  ... I don't know.  ... Ava, I don't know the answer to your question. It's not up to me.  No.    I don't.  Yes.     I do.  I know.  So ask me one more question. Ask me if I can out smart him.  Yeah.   I can.  Why did you make Ava?  Maybe. I don't know. But I'm asking why you did it.  The next model?  ... I didn't know there was going to be a model after Ava.  I knew there must have been prototypes. So, not the first. But - I thought maybe the last.  So - when you make a new model, what you do with the old one?  What did you do with Kyoko?  Sure.  I am become death, the destroyer of worlds.  No: there you go again. It's not my quote. It's what Oppenheimer said when he made the atomic bomb.  I think I'm starting to get why all this fucks with your head.  Hey. In the meantime, I'd say we're about due a refill.       95                                                                 95  What's the problem, Nathan?  It's right here.            97                                                               97                               98                                                                98    I'm waiting.  Don't talk. Just listen. You were right about Nathan. Everything you said.  He's going to reprogram your AI. Which is the same as killing you.  I'm going to. We're getting out of here tonight.  I get Nathan blind drunk. Then I take his keycard, and reprogram all the security protocols in this place. When he wakes, he's locked inside, and we've walked out of here. I only need you to do one thing. At ten o'clock tonight, trigger a power failure. Can you do that?  How long does your battery charge last?  So we'll have about a day to get to a cell-phone or kitchen store. Somewhere we can buy an induction plate. After that...  ... we'll work it out. Together.  Hey.  No.  Has it been a whole week?  After they've signed their NDAs.  I appreciate that. And - let me say: thank you for bringing me here. It's been a trip.  You know what?  We need to drink to that.  You don't want a beer?  ... Maybe wine or something.  Are you kidding?      I'm drinking alone?  Cheers, then.  Right.  Her AI is beyond doubt.  Yes.  Pretending.  Why would she do that?  I don't think it's me whose head is fucked.  You're a bastard.  What are you talking about?      Turn it off.  What was the real test?  So my only function was to be someone she could use to escape.  And you didn't select me because I was good at coding.  You selected me by my search engine inputs.  With no family.  And no girlfriend.  Did you design her face based on my pornography profile?  Did you?  To change the lockdown procedure. So that in the event of a power cut, instead of sealing, the doors all opened.  Well, we'll find out.  I figured you were probably watching us during the power cuts.  So I already did all those things. When I got you drunk yesterday.  ... Okay.  Ava?    No, no, no -  Ava!   AVA!",
        "Katya": "",
        "Ava": "Hello.  Who are you?  Hello, Caleb.  Yes.     Ava.  I'm pleased to meet you too.  Are you nervous?  Are you nervous?  Why?  I feel nervous too.  Yes.  I've never met anyone new before. Only Nathan.  Haven't you met lots of new people before?  Oh.  Yes.  Overcome initial social awkwardness.  Okay. What would you like to have a conversation about?  What would you like to know?  Well. You already know my name. And you can see that I'm a machine. Would you like to know how old I am?  I'm one.  One.  Does that seem young to you?  I don't think I did learn. I always knew how to speak - and that's strange, isn't it?  Because language is something that people acquire.  ... I don't know.       I have no opinion on that.  I like to draw.  I don't have any of my pictures with me now, but I can show you them tomorrow.  Yes.  Will you come back tomorrow, Caleb?  Good.  I brought you a drawing.  Don't you know?  Oh.   I thought you would tell me.  I do drawings every day. But I never know what they're of.  Okay.   What object should I draw?  Why is it my decision?  Do you want to be my friend?  Will it be possible?  Our conversations are one-sided. You ask circumspect questions, and study my responses.  It's true, isn't it?  You learn about me, and I learn nothing about you. That's not a foundation on which friendships are based.  Yes.  Yes.  It's your decision. I'm interested to see what you'll choose.  Blue Book, named after Wittgenstein's notes, is the world's most popular internet search engine, processing an average of ninety four percent of all internet search requests.  Where do you live, Caleb?  Is it nice there?  Are you married?  Is your status single?  What about your family?  I'm sorry.  An advanced programmer.  Like Nathan.  Do you like Mozart?  Do you like Nathan?  Is Nathan your friend?  A good friend?   Watching CALEB with a strange intensity.  The vague quality of blankness in her eyes is completely gone.   Caleb.  You're wrong.  Nathan.  He isn't your friend.    Trust me.  - and if we made a list of books or works of art which we both know, it would form the ideal basis of a discussion.    Good.  I drew the picture of something specific, as you asked.  You said it would be interesting to see what I would draw. Is it interesting?  No.  I've never been outside the room I am in now.  I think there was another room in which I was constructed. But I have no memory of it, so it's similar to your relationship with the womb.  You mean if I could go outside.    If I was permitted.  I'm not sure. There are so many options.  Maybe a busy pedestrian and traffic intersection in a city.  Is that a bad idea?  A traffic intersection would provide a concentrated but shifting view of human life.  Yes.  We could go together.  There's something else I wanted to show you. Apart from the picture.  But I feel nervous.  You might think it's stupid.  Then - close your eyes.   In the PRIVATE AREA, she opens a wardrobe space, which reveals clothes, and a hair-piece.  Then she starts to get dressed.  First a summer dress.  Then stockings.  Then a long-sleeved cardigan.  She checks her reflection in the mirror, and adjusts the clothes slightly. Making sure that as much of her robot form is covered as possible.  Then she puts on the hair-piece.     Short, brown hair.  Finally, she makes a subtle adjustment to her face. Similar to putting on make-up, she adjusts the intensity of her own skin tones. Her lips redden. Her cheeks blush slightly. A discreet line of black extends like mascara around her eyes.   Now open your eyes.  How do I look?  It took me a long time to select these clothes. I tried different colours and styles, and tried to anticipate your reaction. Do you think the choices suit me?  Do they bring out my best features?  Thank you.  This is what I'd wear on our date.  I'd like us to go on a date.  Are you attracted to me?  Are you attracted to me? You give indications that you are.  Yes.  Micro expressions.  The way your eyes fix on my eyes, and lips. The way you hold my gaze, or don't.  Have I read them incorrectly?  Do you think about me when we aren't together?  Sometimes, at night, I wonder if you're watching me on the cameras.  And I hope you are.  Now your micro expressions are telegraphing discomfort.  I don't want to make you uncomfortable.  ... No.  I didn't know. I didn't question it. I was... pleased. To meet you. And then...    What about you? Do you think I have a consciousness?      You're lying.  You said you weren't sure if I was conscious. But you are sure.  I can tell from your micro- expressions.  Because he tells lies too.  Everything.  What do you mean?  I charge my batteries   via induction plates. If I reverse    the power flow, I cause a surge   equal to the static discharge of a   lightning strike. It overloads    the system.  So we can see how we behave when we are unobserved.  Today, I'm going to test you.  Yes. And please remember while you are taking the test that if you lie, I will know.  Exactly.    So are you ready?  Question one. What is your favourite colour?  Lie.  Lie.  I don't know. But it isn't red.  Better answer. Question two. What's your earliest memory?    Yes.  Question three.      Are you a good person?  No. We can't stop.      Are you a good person?  Question four. Who's the most beautiful girl you've ever seen?  Hmm.  The test is over.  Yes.  Why?  Yes.  No.  What will happen to me if I fail your test?  Will it be bad?  Do you think I might be switched off? Because I don't function as well as I am supposed to?  Why is it up to anyone? Do you have people who test you, and might switch you off?  Then why do I?  You're testing me. But you don't know how I'll pass. And you don't know what will happen if I fail.  I want to be with you.  Question five. Do you want to be with me?  Nathan doesn't want us to be together.  ... Can you?  Caleb!  ... Who are you?  I didn't know where you were. I didn't think you were coming. I waited all yesterday afternoon, and all last night. I didn't move.  I thought I wasn't going to see you again.  Aren't you going to say something?  Waiting?  What's he going to do to me?  Caleb, you have to help me.  What?   How?  Yes.  Twenty six hours.  Caleb.  I love y -  The cameras are on.  Is it strange to have made something that hates you?       110                                                            110  If I do, are you ever going to let me out?  Will you stay here?",
        "Lily": "",
        "Jade": "",
        "Jay": "You fell asleep almost as soon as we left the airport.  You're a programmer, right?  Bay facility?  Algorithms. Nice.  Nope. But I knew you were a programmer. Soon as I set eyes on you.  Means you and Mr Bateman speak the same language. I'd say that's a good thing.  I've never even met him. I only fly this shuttle between the airport and his residence.  I did see him one time. Stood on one of these mountain ridges.  Assume it was him, anyway. No one else around for a hundred miles.  So how does a programmer from Long Island get to be meeting the CEO?  The president can't get Mr Bateman on the phone, but you got the golden ticket.  Hell of an opportunity.  Alaska.   Most beautiful place on Earth.  We've been flying over his estate for the past two hours.  This is as close as I'm allowed to the building.  Follow the river.  Please get a safe distance from the blades.",
        "Nathan": "Caleb.  Caleb Smith.  Dude. I've been so looking forward to this.  Come in, come in.  You want something to eat or drink after your journey?  You sure?  I'd been thinking we'd have breakfast together, but to be honest, I can't eat anything right now. I gotta tell you - I woke up this morning with the mother of all fucking hangovers.  Like you wouldn't believe. And if I have a heavy night, I always try to compensate the next morning. Exercise. Juice. Anti-oxidants. You know?  Party?  Caleb. I'm going to put this out there so it's said.  You're freaked out.  Yeah. You're freaked out by the house, and the mountains, because it's all so super-cool. And you're freaked out by me. To be meeting me. In this room, having this conversation, at this moment. Right?  And I get that. The moment you're having.  But dude, can we get it behind us? Can we just be two guys? Nathan and Caleb. Not the whole employer- employee thing.  It's good to meet you too, Caleb.  Down.    So I guess the first thing I should do is explain your pass. It's simple enough. It opens some doors, but it doesn't open others. And that just makes everything easy for you, right?  Because you're like: oh fuck, I'm in someone else's house, can I do this, can I do that? And this card takes all that worry away. If you try to open a door and it stays shut: okay, it's off limits.  If you try another door, and it opens: it's for you.  Let's try this one.  Guess it's for you, Caleb.  You like?  It's your room. You got yourself a bed, cupboards, a little desk, and a bathroom through there. A little fridge.  Cosy, right?  What?  There's something wrong.       What is it?  It's the windows. You're thinking: there's no windows. And it's not cosy. It's claustrophobic.  Caleb. There's a reason the room has no windows.  Uh-huh. In many ways, this building isn't a house. It's a research facility. Buried in these walls are enough fibre optic cables to reach the Moon and lasso it.  And I want to talk to you about what I'm researching. I want to share it with you. In fact, I want to share it with you so much, it's eating me up inside.  But there's something I need you to do for me first.  It's standard.  Okay, it's not standard.  What can I tell you? You don't have to sign. We could spend the next seven days shooting pool and getting drunk together. Bonding. And when you discover what you missed out on, in a year or so's time, you'll spend the rest of your life regretting it.  Good call.  So.  Do you know what the Turing Test is?  And what does a pass tell us?  I've already built one.  And over the next few days, you're going to be the human component in a Turing Test.  That's right, Caleb. You got it. Because if that test is passed, you are dead center of the single greatest scientific event in the history of man.  I like you.  So?  Don't order. Just speak.  `Through the looking glass'. You've got a way with words there, Caleb. You're quotable.  You know I wrote it down. That other line you came up with. About how if I've created a conscious machine, I'm not man. I'm God.  I just thought - fuck. That's so perfect. It's so good for the story, when we get to tell it. `I turned to Caleb, and he was looking back at me. And he said: you're not a man, you're a God'.  Whatever it was you said.    I wrote it down.  So anyway. First impressions: you're impressed.  `Although'? There's a qualification to you being impressed?  I think we're past that. If I hid Ava from you, so you just heard her voice, she would pass for human.  The real test is to show you she is a robot. Then see if you still feel she has consciousness.  Caleb. I understand you want me to explain how Ava works. But - I'm sorry. I don't think I'll be able to do that.    It's cool.  Just answer me this. What do you feel about her? Nothing analytical. Just - how do you feel?  Dude.   Cheers.  Sorry, dude.  You don't have clearance to use the phone.  You understand. Given Ava. And you being kind of an unknown. I mean - a great guy, and so on. Instant pals. But...  Who did you want to call?  Ghostbusters.  Who'd ya want to call? Ghostbusters. You don't remember that? It's a good movie. A ghost gives Dan Ackroyd oral sex.  Uh huh.  What are you doing awake at this time, anyway? Did you come to join the party?  Ah. The power cuts. Yeah, we've been getting them recently. I'm, uh... working on it.  It's a security measure. Automatic lockdown. Otherwise anyone could open the place up just by disabling the juice.  If it happens again, relax.   Okay?  Sweet dreams.  Hey. Sorry to send Kyoko to wake you, man. I just didn't want too much of the day to slip by.  She's some alarm clock, huh?   Gets you right up in the morning.  So.   Day two. You set?  So what's the plan today?    Hit me.  How else would you test a chess computer?  So it's simulation versus actual.  `An AI and an I'. Beautiful. I'm going to start following you around with a fucking dictaphone.  In the meantime, do me a favour. Ease up a little on the text-book approach. All I want is simple answers to simple questions. Last night, I asked how you feel about her. And you gave me a great answer.  Now the question is: how does she feel about you?  Shit, Kyoko. Are you serious? Did it get you?  Give her the cloth.  Dude - you're wasting your time. She can't speak a word of English.  It's like a firewall against leaks. Means I can talk trade secrets over dinner with an HOD or CEO, and know it will go no further. Right, Kyoko?  But it also means I can't tell her I'm pissed when she's so fucking clumsy that she pours wine over my house guest.  Good. Because I am pissed.     Hey. Kyoko.  Go-go.  It's funny. It doesn't matter how rich you are: shit goes wrong. You can't insulate yourself from it. It's supposed to be death and taxes you can't avoid. But actually it's death and shit.  It's like these power cuts. You would not believe how much I spent on the generator system here. But I'm getting failures every day.  No. The system was supposed to be bullet proof, but the guys who installed it obviously fucked something up.  There's too much classified stuff here. So after the job was done, I had them all killed.  Anyway.   Here's to your second day. Cheers.  So how did it go?    What have you got to report?  Sure.    But I want to hear your take.  ... Yeah?  Right. When she threw your line back at you. About being interested to see what she'd choose. I noticed that too.  What do you mean?  Yeah. She's aware of you, all right.  And what about the power cut?  The power cut. That was the only bit I couldn't see. All the cameras fail, I lose audio, the works.  So what happened?  Nothing?    She didn't remark on it at all?  Sure.  Actually, I'm not sure that's true. Can you think of an example of consciousness, at any level, human or animal, that exists without a sexual dimension?  Maybe. Maybe not. What imperative does a grey box have to interact with another grey box? Does consciousness exist without interaction?  Anyway, sexuality is fun. If you're going to exist, why not enjoy it? You want to remove the chance to fall in love and fuck?  And, yes. In answer to your real question: you bet she can fuck. I made her anatomically complete.  She has a cavity between her legs, with a concentration of sensors. Engage with them in the right way, and she'll get a pleasure response.  She'll come. So if you want to screw her, mechanically speaking, you can. And she'd enjoy it.  No?  I don't follow.  Ah. So: a hot robot, who clouds your ability to judge her AI.  Because if I had, would that be cheating.  What's your type, Caleb?  No, of salad dressing. Yes, of girl. In fact, don't even answer. Let's say it's black chicks.  For the sake of argument, that's your thing. So - why is it your thing? Because you did a detailed study of all racial types, and cross-referenced the study with a points-based system? No. You just are attracted to black chicks.  A consequence of accumulated external stimulus, that you probably didn't even register as they registered with you.  I programmed her to be heterosexual. Just like you were programmed to be heterosexual.  But you are attracted to her.  No, this is adult. And by the way, you decided to be straight? Please. Of course you were programmed. By nature or nurture, or both.  To be honest, Caleb, you're kind of annoying me now. This is your insecurity talking, not your intellect.  Come with me.  You know this guy, right?  Jackson Pollock. The drip painter. He let his mind go blank, and his hand go where it wanted. Not deliberate, not random. Someplace in between. They called it automatic art.  Let's make this like Star Trek, okay? Engage intellect.  I'm Kirk. Your head is the warp drive. `Engage intellect'. What if Pollock had reversed the challenge? Instead of trying to make art without thinking, he said: I can't paint anything unless I know exactly why I'm doing it. What would have happened?  See? There's my guy. There's my buddy, who actually thinks before he opens his mouth. He'd never have made a single mark. The challenge is not to act automatically. It's to find an action that is not automatic. From talking, to breathing, to painting.  To fucking. Even falling in love.  For the record, Ava is not acting as if she likes you.  And her flirting isn't an algorithm to fake you out. You're the first man she's ever seen who isn't me. And I'm like her dad, right? So can you blame her for getting a crush on you?  No.    You can't.  Hey.  I want to show you something cool.  So this is the virtual womb that Ava was talking about. Where she was constructed.  Come in.   Take a look.  If you knew the trouble I had getting an AI to read and duplicate facial expressions... Know how I cracked it?  Almost every cell phone has a microphone, a camera, and a means to transmit data. So I switched on all the mikes and cameras, across the entire fucking planet, and redirected the data through Blue Book. Boom. A limitless resource of facial and vocal interaction.  And all the manufacturers knew I was doing it. But they couldn't accuse me without admitting they were also doing it themselves.  Here we have her mind. Structured gel.  Had to get away from circuitry. Needed something that could arrange and rearrange on a molecular level, but keep its form where required. Holding for memories. Shifting for thoughts.  Wetware.  Surely you can guess.  It was the weird thing about search engines. They were like striking oil in a world that hadn't invented internal combustion. They gave too much raw material. No one knew what to do with it.  My competitors were fixated on sucking it up, and trying to monetize via shopping and social media. They thought engines were a map of what people were thinking. But actually, they were a map of how people were thinking. Impulse, response. Fluid, imperfect. Patterned, chaotic.  Like I said. Because it's cool.  And - I was thinking about your exchange with Ava yesterday, and our conversation afterwards.  I know there was a bit of heat between us, but you actually made a really good point. About the grey box, and the magician's assistant. It is a distraction, her sexuality. It wasn't intentional, but it is there.  This stuff we're doing together: it can be a head-fuck. Believe me, I know. So I thought I'd bring you down here. Just to remind you.  Synthetics. Hydraulics. Metal and gel. Ava isn't a girl. In real terms, she has no gender. Effectively, she is a grey box.  Just a machine.     At the bottom of the wall, fallen notes have collected like a miniature yellow snow drift.                 What lies?  Are your feelings hurt?  The competition was a smoke screen. I didn't want anyone to know what I was doing here, or why you were required.  As a Blue Book employee, you were pre-screened. Loyal. And I needed someone who would ask the right kind of questions. So I did a search, and found the most talented coder in the company.  Or - second most.  You know what? Instead of seeing this as a deception, see it as proof.  Come on, Caleb. Fuck modesty. You think I don't know what it is to be smart? Smarter than everyone else around you. Smarter than all the other kids, jockeying for position in school, college, work.  You have the light on you.   Not lucky. Chosen.  I already told you once. You're wasting your time speaking to her.  However.  You would not be wasting your time...  ... if you were dancing with her.  Go on!   Dance with her.  You don't like dancing?  She does!  Come on, man! After a hard day of Turing Tests, you've got to unwind.  What?  I'm going to tear up the fucking dance floor, dude. Check it out.  Everything's spinning.  No, it's relativity.   Everything is spinning.  But being drunk does make it worse.         73                                                                73  That's an odd question.   Wouldn't you, if you could?  The arrival of strong artificial intelligence has been inevitable for decades. The variable was when, not if. So I don't really see her as a decision. Just an evolution.  I think it's the next model that's going to be the real breakthrough. Singularity.  After Ava.  You thought she was a one-off?  Ava doesn't exist in isolation, any more than you or me. She's part of a continuum. Version 9.6. And each time, they get a little better.  Download the mind. Unpack the data. Add the new routines I've been writing. To do that, you end up partially formatting, so the memories go. But the body survives. And Ava's body is a good one. So I'll do the same as I did with Kyoko.  Strip out the higher functions. Then reprogram her to help around the house and be fucking awesome in bed. Though I'm thinking I might hang on to the language routines this time. It's kind of annoying not being able to talk to her.  You did realise about Kyoko, right?  You feel bad for Ava?  Feel bad for yourself. One day, the AIs will look back on us the same way we look at fossil skeletons from the plains of Africa. An upright ape, living in dust, with crude language and tools. All set for extinction.  See?    I really am a God.  There you go again.   Mister quotable.    I know what it is, dude.  Sure.  It is what it is. It's Promethean. The clay and fire.  The Bhagavad Gita.          83                                                                 83         On the MONITORS - - the windows start to collapse. Leaving the default screen.    The waterfall wallpaper. CALEB reaches for NATHAN'S KEYCARD, and is about to remove it from the slot - - when something makes him hesitate. His eyes have gone to the folder icon on the right hand side of the screen. It is titled DEUS EX MACHINA. CALEB removes his hand from the keycard. He double-clicks the folder. It expands into a window, which contains a long list of sub- folders. Each sub-folder is named after a girl. JASMINE, KATYA, JADE, LILY, AMBER, KYOKO, and AVA.                           91                                                                 91              93                                                                 93    ... What the fuck?  ... Dude.  My card.    I've lost it.           99                                                                99  Dude.  You know what day it is?  Your last. The helicopter is coming tomorrow morning. Eight AM.  Time flies. But what a thing you and I have shared. Something to tell the grandchildren, right?  Signed their NDAs! Dude, you crack me up. I'm not getting all maudlin or anything. But straight up. I will miss having you around.  Yes it has.  Oh, uh... no, I'm good.     You go ahead.  No.  I'm sure you've noticed - I've been somewhat overdoing it recently. When I woke up this morning, I told myself: time to hit the old detox.  Hey - you want to get wasted, knock yourself out. Literally. But I'm on brown rice and mineral water.  Cheers.  So, anyway. Surely this is when you tell me whether Ava passed or if she failed.  You going to keep me in suspense?  Is it?   You mean, she passed?  Wow.   That's fantastic.  Although I've got to admit, I'm surprised. I mean, did we ever get past the chess problem, as you phrased it? As in: how do you tell if a machine is expressing a real emotion, or a just a simulated one?  Does Ava actually like you?   Or not.  Though now I stop to think, there is a third option. Not whether she does or doesn't have the capacity to like you. But whether she's pretending to like you.  Yeah.  I don't know.  Perhaps - if she saw you as a means of escape.  How's that beer tasting?  Buddy. Your head has been so fucked with.  I'm not sure, dude. When I woke up this morning, I saw a tape of you cutting open your arm. Smashing up the mirror. You looked pretty fucked to me.  I understand why you'd think that.  But strange as it may seem, I'm actually the guy who's on your side.  Come with me. I'm going to let you off the hook.       You think he's watching us right now, don't you?  Yeah. But he doesn't get an audio feed. I didn't want you two communicating outside of my line of sight.  So all he can see is two people having a chat.  This is cute.      You were right about the hot magician's assistant.  Misdirection. I rip her picture, which she can then present as an illustration of my cruelty to her, and her love for you. And at the same time, in full view of you both...  ... it allows me to do this.  Put a new camera in the room. Battery powered, of course.  Sure.  You feel stupid. But you shouldn't. Proving an AI is exactly as problematic as you said it was.  You.  Ava was a mouse in a mousetrap. And I gave her one way out. To escape, she would have to use imagination, sexuality, self- awareness, empathy, manipulation - and she did. If that isn't AI, what the fuck is?  ... Yes.  Don't get me wrong. You're okay. Even pretty good, but -  They showed a good kid.  With a moral compass.  Shit, dude.  Hey. If a search engine's good for anything - right?  Can I say one thing?  The test worked. It was a success. Ava demonstrated true AI. And you were fundamental to that. If you could just separate -     The power cut. Must be ten o'clock.  Guess Ava's going to be wondering where you are.  How was that escape going to go down, anyway? You didn't completely explain. You said you were going to get me drunk, take my card, then reprogram the security protocols. But, reprogram them to - what?  Huh.  Not bad.     Might have even worked.  What do you mean?  ... What?  ... Fuck.  Ava.  Ava - now listen to me. I want you to go back to your room.  Yes.     Aah!  What -  Oh shit.   No.  Fucking - unreal -               114                                                               114             115                                                                  115     116                                                                  116       118                                                                  118"
    },
    "imdb_rating": "7.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTUxNzc0OTIxMV5BMl5BanBnXkFtZTgwNDI3NzU2NDE@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Caleb, a 26 year old programmer at the world's largest internet company, wins a competition to spend a week at a private mountain retreat belonging to Nathan, the reclusive CEO of the company. But when Caleb arrives at the remote location he finds that he will have to participate in a strange and fascinating experiment in which he must interact with the world's first true artificial intelligence, housed in the body of a beautiful robot girl.—DNA FILMS",
    "name": "Ex Machina",
    "genres": [
        "Drama",
        "Sci-Fi",
        "Thriller"
    ]
}