{
    "filename": "Fantastic-Four_script.txt",
    "imdb_id": "tt0120667",
    "imdb_url": "https://www.imdb.com/title/tt0120667",
    "characters": [
        "Reed Richards",
        "Alicia Masters",
        "Compound Doctor",
        "Victor Von Doom",
        "Sue Storm",
        "Nightclub Boyfriend",
        "Ned Cecil",
        "Sexy Nurse",
        "Ernie",
        "Jimmy O'Hoolihan",
        "Nightclub Girlfriend",
        "Johnny Storm",
        "Ben Grimm",
        "Leonard",
        "Debbie McIlvane"
    ],
    "dialogues": {
        "Reed": "High open space, exposed structural elements.  Obviously aimed at first time visitors to create feelings of... smallness, inadequacy.  This wasn't our first stop, in case you forgot NASA.  And Victor's not that bad.  He's just a little... Larger than life.  He's financed some of the biggest breakthroughs of this century.  Reed Richards and Ben Grimm to see --  My research suggests that exposure to a high-energy cosmic storm born on solar winds might have triggered the evolution of early planetary life.  In six weeks another cloud with the same elemental profile will pass Earth's orbit.  A study in space could advance our knowledge about the structure of the human genome, and help cure countless diseases, extend human life --  Give kids the chance to be stronger, healthier, less prone to --  But I haven't fully explained my --  You remember in school we talked about working together.  That's what I was about to explain...    You're, you've, I mean, how have you bee--  Not at all.  You back this mission, and I'll sign over a fair percentage of any applications or --    Hilarious.  Ben, think about all the people we can help if this works --  We got what we wanted.  That's enough.  Those solar winds are flaring, but I factored them into my coordinates and --    I, uh, think I remember the number.  As far as crew, I was hoping Ben could pilot the mission --  External SRBs, orbital system engines. Its just like the shuttles you flew in --  Youthful high spirits.  I'm sure he's matured since then.  When have I asked you to do something you absolutely said you could not do?  I had it at four.  Wow.  Fantastic.  Material made from self-regulating unstable molecules.  I've been working on a formula for this.  He's made a few changes.  Victor's better at these things.  Yes.  Yes it is.  The shields on the station should protect us.  Let's start loading those samples. Get your suit ready, Ben.  Sure.  No...no...impossible.  It's...too fast.  The cloud is accelerating!  I don't know what happened.  We've got minutes until it hits, not hours...Victor, that storm's deadly -- the radiation's lethal.  We need to abort.  Ben's still out there --  Ben, we need you back inside.  Ben.  This is serious.  Turn around.  Come on, Ben, come on...  Not until Ben is back inside!  Victor's right.  Johnny, get to the command center.  Close the shields.   He's not responsive --  How's she doing?  Blood panels show no irradiation. Good.  You'll step up this protocol, every --  Sue...I want to tell you...I'm...  She's allergic to orchids.  Put that Amaryllis Apapathos by her bed.  The African lilies?  They're her favorites.  Three days.  I was worried about you. How are you feeling?  I don't know.  I just keep going over and over the numbers.  I should have done more, run more tests --  Yeah, you and Debbie and perfect --  What?  Come on.  She's got a good thing with Victor --  He's smart, powerful, successful --  Ben.  He'll give her the life she deserves.  She ended up with the right guy.  Things worked out for the best.  Are you alright?  Feeling better?  That's good.  That's uh...good.  I'm really happy for you and Victor.  I can tell you guys are enjoying what was the best part of our relationship --  Passion.  For science.  What?  What did I say?  I...I...I just wanted to --  Uh, Sue...?  I can't.  Sue...look at your hands.  Let's not jump to conclusions, we need a massive amount of evidence before making that leap.    We have to find Ben.  Ben, are you there?  ...Ben?  Ben did this.  He's had some kind of...reaction to exposure from the cloud.  And he's not the only one.  He's going home.  Look, we've got a friend out there in trouble.  We need to get to him before --    Sue.  Your clothes.  Lose them.  You've been working out.  Uh, Sue?  Ben.  Are you okay?            I swear to you, I will do everything in my power until there is not a breath left in me: you are going to be Ben again.  We're not going public with this. We're scientists, not celebrities.  Uh, during our recent mission to the Von Doom space station, we were exposed to as yet-unidentified radioactive energy, most likely some kind of nucleotide compoun--  Ben Grimm is a genuine American hero who's been through a terrible orde--  Look, we went up to space to find a way to understand DNA, to cure disease, save lives.  Well, now it's our DNA, our disease, our lives on the line... Thank you.  No more questions.  I'm afraid so...  Any visitors while I was away?  We had a tough year.  Oh, it is.  That's what we're here to find out.  We should stay here until we can define the extent of our changes...    Victor!  What are you doing here?  Not much.  We need to run tests to see the extent of the damage.  Victor wait... I just wanted to say, I'm sorry the mission didn't go as planned --  I ruined?  With all due respect, I told you to abort --  Victor, if we could understand what happened to us --  If we're going to identify the source of the mutation, we need to isolate your recombinant DNA so we can activate positional genomes.  No, just sit back.  We have a good sense of your strength from the firetruck.  We need to find the source of your strength.  Okay, this might smart a little.    Back it down, Johnny!  Not only could you kill yourself, but you could set fire to Earth's atmosphere and destroy all human life as we know it.  Okay.  I've uh, got some questions, from Sue.  That she thought might be better coming from me... Can you, you know, go to the bathroom...like normal...  Ben, I'm afraid I've got to ask --  O-kay.  We'll skip that question.  Is there something about flames? About flaming, that you --    It's not \"invisibility\" per se. You're bending the light around you with some kind of malleable force field.  That's what you projected on the Bridge.  Have you had any side-effects, from your powers?  You should be able to bend light around other objects, even people, if you could control your emotional state better --  I'm saying, if you had a little more self control, you could locate the trigger.  Can you remember the exact emotions when --  Okay.  Is there any way to duplicate that feeling?  Some memory or...  How's that coming -- whoa --  What in the world would give me that idea?  I mean, you broke up with me, right?  No, I distinctly remember: you walked out my door.  Ergo...  I think it was a little more complicated than --  There were a lot of variables to consider --  Sue...I just...I thought...  Our uniforms were exposed to the storm like us.  So they can transform like us, becoming invisible, changing size on demand or remaining impervious to flame.  They're not costumes.      Nothing...nothing...nothing...  Of course...of course...the cloud...    If we can build a machine to re-create the storm, we can reverse the polarity --    Of course.  Of course.  (preoccupied, mind  There's a system to it.  Wait!  Sue, don't touch tha--  That's what I'm trying to calculate. And it's not rubber.  It's muscle, tendon.  I seem to have the ability to manipulate the malleability of my molecular structure and redistribute my density to --  No way to know.  Without more tests, experiments.  BEN!  What?  What's going on!?  He talked me into it.  Ben!  Slow down a second and --    This isn't permanent, Johnny.  We need to be careful until we're normal again.  You need to control yourself and think before you --  A higher calling like getting girls and making money?  Victor, are you...are you okay?  What are you doing here?  But I'm not done with the machine --  Mass-produced?  This isn't a toaster.  You have no idea how it works.  The storm needs to be handled exactly right, or it could make our mutations worse, much worse, maybe even kill us...  Victor, please.  We need time to verify the data... We can't afford any mistakes -- there's only enough ions for two or three attempts.     He was going to take away all my data, equipment --  Which is why I'm working twenty hours a day, checking every variable --    I could get Ben to tap into the Baxter's main power to generate enough voltage --  You were?  You know, I bribed the projectionist ten bucks to keep it open late?  Sue, you were right.  It wasn't complicated.  I just wasn't ready to be...to become... You can be a little intimidating.  You always talked about how you liked the kind of man who could approach you...speak his mind.  One who wasn't afraid to tell you what he wanted.  Why didn't you say something?  Ben --  We're working as hard as we can --  Come on, this is nothing.  Ben, I don't know if this thing'll change us back or make us worse. I need you to be patient for a little while longe--  I am looking.  That's why I can't make a mistake!  I've got to get it right, and it's not right yet!  We need to test this.  I'm OK.  Just go, go after him.  Stop him.  I can...make it work.  The power...I need...more power...to control...the storm --  Oh god Ben.  Are you okay? You did it, you really did it...  Victor...?  What, what happened to you?  What did you do to your --  Victor, this isn't the way to --  Sue.  The only thing I ever knew without thinking was... I...love...   Johnny.  SUPERNOVA.  Now.  Sue, I need some of that anger, rage, frustration --  Time for your lesson, Vic.  Chem 101: what happens when you supercool hot metal...? Ben...  Well, we do have the suits...  Ben, I've been crunching the numbers on the machine.  I think if we can rework the power settings...  Sue, can I talk to you for a second?  I found a broken gasket, from space --  If one of us were to wear it...  No more thinking, no more variables... Sue Storm...will you... Sue?  Sue?  You there?",
        "Richards": "",
        "Alicia": "Who killed the party?  I don't think She's real big on hate.  Can I...?  See you...?  It's okay, I won't bite... ...not that I could.  Such a sad face... You know, sometimes being different isn't a bad thing.  See you round, Benny...  I'm Alicia, by the way.  I'm blind, not deaf.  Wanna come in?  Relax, it's casual.  My step-dad's.  I'm strictly into stone.  I was wondering when you'd walk by.  \"Sensual blind chick seeks three-ton, rock-hard he-man for deep spiritual relationship.\"  Bennie.  You feel pretty good as is.  I wouldn't know anything about that.  Tell me.  When you grew up in Brooklyn, how many astronauts did you know? You went your own way then.  You didn't listen to people.  So why start now...?  Look around.  I'll get us drinks. They always let blind girls cut the line.  That's my Benny.  We're going to have to work on your touch.",
        "Masters": "",
        "Compound": "",
        "Doctor": "Stable.  Vitals are strong.  Four hours.  We know what we're doing... One more day of observation, then you're all cleared.  Your tissue, your organs, your entire biophysical structure is changing. Every system is still functioning, somehow --  I don't really know.  A compound organic-metallic alloy.  Stronger than titanium or carbon steel.  Harder than diamonds --  At this rate, the infection should be complete in two, maybe three weeks --  I wish I could tell you.  I can't pretend to know what we're dealing with here.  I'll notify the CDC and --  The Center for Disease Control.  If this thing is contagious --  But...this disease...is progressive... degenerative...",
        "Sue": "He's right, Ben.  It's just business.  Ben, it's been too long.  Never better.  Ancient history.  You sure about this, Reed?  I was talking about us.  Working together.    I'll schedule the launch.  Call me in the morning to talk about resources and crew.  It's been changed.  Well, he's welcome to ride shotgun, but we already have a pilot on our payroll.  You remember my brother Johnny...  Victor did.  The synthetics act as a second skin, adapting to your individual needs to --  Great minds think alike.  Long way from the projection booth at the Hayden Planetarium, isn't it?  We can monitor the cloud's approach and observe the tests from here.  I understand the business reasons.  It's been a good two years, Victor... The company's accomplished so much.  Uh, Victor, I hope I haven't done something to make you think...  Johnny... Reed...  What are you doing?  You can't leave them out there.  I can try.  Johnny!  Reed!     I can only stay for one drink, Ben. I've got to meet with Victor.  Yes, thanks.  You always had a way with words. I should be getting back.  You're happy for me and Victor.  Which was?    It's never what you say.  It's what you don't say. What you don't do...  It's been two years, and all you can say is you're happy for me and some other guy... You know, Victor may be a lot of things, but at least he's not afraid to fight for what he wants... And it's nice to be wanted sometimes. To be heard...seen... Reed, look at me.  What?  What do you mean you --  It has to be the cloud.  It's fundamentally altered our DNA.  Apparently I can disappear.  Johnny.  Stop it.  Open up Ben, we need to talk.  I think that thing is Ben.  Victor, are you feeling alright?  We need to find him.  Victor, I'm sorry I --  What now?  Reed...?  What do we do?  Ben's out there.  Let's go get him.  What?  What...? Oh.  Shut up.  Any more ideas, Reed?  Maybe you should strip down next, see how it feels to have fifty people staring --  Oh.  Well then...   Johnny, slow down.  Let's think this through, a second.  We don't know much more than you do, at this point.  Which is why we will be going directly to the lab, where we can diagnose our symptoms and --  Jimmy.  Good to see you again.  How come Ben can't turn it on and off like us?  If it happened to him, then it could...  Grow up, Johnny.  You want to run around on fire for the rest of your life?       Victor, your scar --  I'm sorry I didn't get a chance to --  Thank you, that's generous, but I think I should stay here.  With my brother.  Until we get a handle on this.  We need to give you a physical, so we know what got zapped.  You were at 4000 Kelvin.  Any hotter, you're approaching supernova --  That's the temperature of the sun.  He cooked the equipment.  What about you?  You haven't eaten in days.  How come you're never on this side of the microscope?  Bruises...from the bridge?  I've had some headaches.  Migraines.  Excuse me?  Anger.  Rage.  Frustration.    I'm sorry, I'm sorry, I didn't mean to do that... You must think that was some kind of latent hostility or --  Are you kidding?  Reed.  I was ready for the next step, you weren't, ergo, I walked.  I just wanted to share an apartment. What was so complicated about that?  No.  There weren't.  There was you. And me.  No variables, no math.  It was actually the simplest thing in the world.  But your head got in the way... like it always does.  Same old Reed.  Too much thinking...    We're not taking them out.  Johnny, we need to stay here till we've stabilized.  What are you doing?    But we're the focus, right Reed? Reed...?  And you sure you can control this thing?  Last time didn't work out so well.  You really need to get a janitor.  This must be what it looks like inside your head.  Sorry.  My fault.  I won't...touch anything.  You said it was urgent.    He's working round the clock.  But the data needs to be tested, analyzed before --  If these molecules aren't stable, they could make us worse, maybe even kill us.  Please don't make this personal --  Victor, we can't do anything until the research is ready.  That's new...  Have you read these...?  From all over.  People want us to fight crimes... save their kids...solve their problems... ...when we can't even solve our own.  Reed.  How close are we to a cure?  We're not specimens, we're patients. This isn't just another science project to you, is it...?  He didn't.  What did he do to the uniform?!  Girl...?!  I'm driving.  You gave us names?  What are you, the \"face\" of the Fantastic Four now?  You two need a time-out.  Damn it, Johnny.  Ben!  Slow down...  He didn't mean it.  You know Johnny. He's always been a hothead --  Just give Reed a little more time. You know how he works -- analyzing every little step before he takes one --  No, it's not.  I thought I was done waiting for Reed... We're all in this together now, Ben.  Can I talk to you?  Don't let Victor push you into making a mistake --  Better than your life.  Victor's not the one who has to get into that thing.  We are.  Every variable but yourself.  You don't eat, sleep.  You can't live in your head like --  So clear it out.  Get out of your head.  Get out of here...  Reed.  Shh.  Just be quiet.  And look up.  Remember our first date here...?  God, I was so nervous.  Of course I was.  I'd read all your papers on bioethics.  Some of them two times just so I'd have something to say to you.  I gave him twenty.  I didn't want that night to end.  I did.  I did, Reed...but I wanted you to be that man.  When I walked out, I waited ten minutes outside your door.  Ten. Waiting for you to come find me.  That would have kinda defeated the purpose.  And Reed... I'm saying it now.    That's my nose, genius... These are my lips.  Ben!  Stop it!  Or I'll stop it.  Johnny?  Did you see Ben?  Is that what you call it?  \"Real\"?  Johnny, slow down.  Think.  You know mom didn't raise us to --  As soon as you stop acting like one. Come on, you're smarter than this. You think those people out there care about you?  You're just a fad to them.  Oh god, Reed.  What did you do, Reed?  What did you do?  Reed, stop, you need to rest your --  You need a doctor.  Ben?!  No, I'm sorry, for pushing you out.  Where is Reed?  What are you doing --  But Johnny...you can't fly.  Ben, you got what we all wanted. You need to stay here.  It's too dangerous.  What has he done to you?  Victor, please --  We know the machine works.  It worked on Ben, it'll work on you.  We can turn you back --  Victor.  You always thought you were god.  No, Victor... Let's.  Me too, Reed.  Can't...hold...on...    You know, about what we said up there, I think maybe --  Hilarious.  A gasket?  Reed, we're at a party.  Reed.  What are you doing?    Yes.  That's my nose, genius... These are my lips.",
        "Storm": "",
        "Nightclub": "",
        "Boyfriend": "Is that all you do?  Bar tricks and stealing chicks...",
        "Ned": "Well, Victor, the bank would like to congratulate you.  On the fastest freefall since the Depression.  We can't even give your stock away.  You promised a cure-all, and came back with this.  Who the hell's going to invest in a biotech company that turns its workers into circus freaks?  You've got a week, Victor.  One week to turn this around.  Or we pull out... This meeting is over.  This is how you \"turn things around\"? These freaks are on the front page and your company's in the obituaries.  Victor, stop.  The bank's lost enough already.  This isn't a negotiation. It's a notification.  We're pulling out.  Reward.  We all know the sales pitch, Vic.  And frankly, we're done buying... Gentlemen.  Hello...?    You know, you could always move back to Latvura, start fresh.  Maybe that's where you belong, back in the \"old country.\"",
        "Cecil": "Well, Victor, the bank would like to congratulate you.  On the fastest freefall since the Depression.  We can't even give your stock away.  You promised a cure-all, and came back with this.  Who the hell's going to invest in a biotech company that turns its workers into circus freaks?  You've got a week, Victor.  One week to turn this around.  Or we pull out... This meeting is over.  This is how you \"turn things around\"? These freaks are on the front page and your company's in the obituaries.  Victor, stop.  The bank's lost enough already.  This isn't a negotiation. It's a notification.  We're pulling out.  Reward.  We all know the sales pitch, Vic.  And frankly, we're done buying... Gentlemen.  Hello...?    You know, you could always move back to Latvura, start fresh.  Maybe that's where you belong, back in the \"old country.\"",
        "Sexy": "And where do we think we're going?  You're hot!  I mean, you feel a little feverish.  My shift ends at four, but I couldn't --  Stay right.  Left is trouble.  Last one down springs for room service.  You're on fire!  No: You're ON FIRE!",
        "Nurse": "And where do we think we're going?  I've noticed... But doctor's orders, you're not allowed to leave until we --  You know this is not a ski resort.  You are trouble.  You're hot!  I mean, you feel a little feverish.  My shift ends at four, but I couldn't --  Stay right.  Left is trouble.  Last one down springs for room service.  You're on fire!  No: You're ON FIRE!",
        "Ernie": "Hey, that's Ben Grimm there, the first mook from Brooklyn to go to outer space, so pay him some respect!  Make it a triple.  On the house, Benny.",
        "Jimmy": "",
        "O'Hoolihan": "Welcome back to the Baxter, Dr. Richards.  All that for you?  Good to see you too... Don't worry, sir.  I know how crowded that head of yours is.  Just the usual.  Told 'em you were circling round outer space.  Mr. Von Doom?  Are you oka--",
        "Girlfriend": "What are you doing?!  You could have burned somebody!  You know, if I had your power I'd be doing something with it, not wasting my time doing cheap bar tricks, hitting on some other guy's girl.",
        "Johnny": "Captain on the bridge!  Digital camera: $254.  Memory stick: $59.  The look on your hard-ass former CO's grill when he finds out he's your junior officer: priceless.  Keep the hot side hot, and the cool side cool!  Actually, the engines are SMEs. Hydrogenbase, carbon propellant. Couple generations past your last ride. I'm not as dumb as you look.    Please tell me your dawg's not trying to rekindle things with my sister.  Yeah, well, his eyes say different.  Let's see: you got Victor, stud of the year, more coin than God?  Or Reed, the world's dumbest smart guy worth less than a postage stamp.  Hmmm, it's a toss-up.  Don't you wander off, boy.  What about you?    Ben!  Ben!  Ben, wake up!  Wake up!  Back on Earth.  Victor's medical facility... We're in quarantine.  They're fine.  Everybody else...is fine.  I swear to you they've done everything humanly possible.  The best plastic surgeons in the world, Ben.  You had the best --  They said that's not such a good idea, the shock alone could --  Unfortunately, the doctors just couldn't do anything to fix your face!  Nice 'do.  Going for the \"grandpa\" look?  I don't know if \"we've\" noticed, but the sickest runs this side of the Alps are right outside that window --  Finish the tests, I know -- could you give me a hand with this zipper?  Not yet.  Luckily grandma still sends care packages.    So are you!  I've never felt better in my life. When do you get off work?  Meet me at 4:01, top of the run. That'll give you a minute to freshen up.  Me like-y.  I though we went over this.  Not this again --  Care to join me?  You guys will not believe what just happened!  Now what is up with that?  Cool.  What'd it do to you guys?  Please tell me you go silent too.  Flame on, flame off.  Flame on, flame off --  Okay, \"mom.\"  Oh, you dawg you.  Better not be my nurse!  Ewwwwwwww.  That is disgusting.  What is that thing?  Anybody know where the big guy's going?  Not even Ben deserves that.  This is wrong in so many ways.  I'm gonna need serious therapy.  Nice.  Okay.  Done thinking.  That'd be me.  Working on it.  And it's a lot harder --  Symptoms?  Please.  If having powers is a disease, then yeah we got it. And we are gonna blow your minds. There's a new day dawning.  The day of the Fantastic Four.  What he's trying to say is: every team needs a mascot...  Smile, Ben.  They want to like you. Give 'em your good side.  Or your less bad side.  Twenty?  From outside the place looks a lot taller.  Either we're moving really fast...or not at all.  Wait.  You mean there's chance we could be full-on-24-7-fantastic?  Is that a trick question?  C'mon, I can't be the only one who thinks this is cool.  This place is deluxe.  You got cable?  I can go hotter!  You're really cramping my style here.  Sweet.  Gotcha.  Okay.  Supernova bad.  What are you trying to say?  Just because I dress well and like to dance --  Oh, well that's easy: I'm hot. You're...well, you're a little limp. Sue's easy to see through.  And Ben's always been a hardass. Why aren't you writing this down?  Okay guys, we have a serious problem.  He's right.  These costumes are... missing something.  I can't put my finger on it --  I'm getting sick of being trapped here.  NASA wasn't even this strict!  How far's that rubber bend?  Right, whatever, have fun.  Hey, Ronnie Renner!  I'm a big fan.  My bad.  Sorry about that. Thanks for the lesson, bro.  Not too much, but I will say that it's all weather and no leather.  Kind of Armani meets Astronaut.  I go by the Human Torch.  The ladies call me Torch.  Uh, we call my sister the invisible girl...the Invisible Girl.  Well, I wouldn't say he's the leader.  That's it.  Just The Thing.  We would have gone with The Rock, but it was taken.  And \"Thing\" pretty much sums it up.  Actually, between us, I think he's got some problems staying rigid.  Dude.  That's my sister.    What the?!  Is that my --     What if some of us don't want to be \"normal\" again?  We didn't all turn into monsters like --  Let's see if we can get blood from a stone.  Blockhead started it!  Act.  Here we go again.  Reed, what if we got these gifts for a reason?  What if we have some, you know...like, calling?  Is there any higher?  This is who we are Reed.  Accept it. Or better yet: enjoy it.  Gotta take care of the fans, right?  And we don't want to let the people down now, do we?  Videogames?  You serious?  You talk to Reed and Sue about this?  Christmas come early!  Check it out!  Hey!  That's a prototype!  Yeah, for the last time, I hope.  I'm done with this freak show.  I'm moving back to the real world.  At least it beats living in a lab like somebody's science project.  Look around, sis!  She's not here.  So you can stop talking to me like I'm your little boy --  Let's try something new: you live your life.  And I'll live mine. And just for the record: they LOVE me.  What do you say we get out of here?  This your boyfriend?  Sue!  I'm sorry, sis, for leaving you guys --  Jesus, Ben! I go away, look what happens.  You got a lot of explaining to do.  Really?  With a name like Von Doom? Never saw that one coming.  Great.  Heat-seeker.  Sis.  Let me take care of you for once.  Well then this'll be one hell of a basejump.     Had a little relapse, huh?  Welcome back.      But all these people...  Damn, I love this job.  Dude, that's still my sister.  Hey, I'm Mr. Sensitivity now. Clear the way, wide load coming through.",
        "Ben": "Good thing it ain't workin... Reed, what are we doing here?  This guy's fast-food, strip-mall science --  You'd never know it.  Jesus.  That too?  What's the price for a smile round here?  I can't take this.  Heya Susie. One more thing he's got.  What about his first born?  He knew about NASA.  What if he made the call to shut us down --  Maybe you should think about yourself for once.  You always let this guy push you round --  I know, I know.  I'm just worried about what he wants... Speaking of which...  Way to not overthink it. So when do we leave?  Can't do it.  I cannot do it.  No.  I cannot take orders from that underwear model.  That wingnut washed out of NASA for sneaking two Victoria Secret wannabes into a flight simulator.  They crashed it into a wall.  A flight simulator.  Five times.  This makes five.  I can handle the ship.  I can even handle Mr. Blonde Ambition.  But I don't know if I should be flying or playing Vegas in these suits.  Who the hell came up with them?  Isn't that your speech?  This is your dream, Reed.  You should be the one up there.  I'll be watching over you.  Soon as I'm back, I'm gonna trade that in for a bigger rock.  What the hell you smiling at?  Just keep your mouth shut, and your mind on those SMBs --  What's wrong with being bald...?  Keep talking, there won't be a next time.  Is it safe?  Should?  He does the talking.  I do the walking.  Got it?  'Course not.  Strictly business.  Hey, two hearts got busted last time. Maybe she's not over it either.  Put your tiny little mind at ease.  I ain't done arranging your flowers, egghead.  Roger that, on my way.  Where...where am I?  Reed? ... Sue?  What's wrong with me?  Give me a mirror...  Give me the god damn mirror!  How long was I out?  Solid.  How you doing?  Reed.  Even you can't compute every little thing.  It was a freak of nature.  Last I checked, you don't have a crystal ball.  Let it go.  You go through something like this, makes you appreciate having the right woman in your life.  Reed, I'm not talking about Debbie.  I'm sorry, did that cosmic-bath loosen your screws?  Well maybe you should date him.  Do I have to do everything myself?  Wouldn't want to keep Vic waiting.  Hey Reed, what are you doing here? Great, why don't you join us?  God, I'm starving.  Gonna hit the buffet.  Pardon me...  I think I need to lie down.  Bad shrimp.  Really bad shrimp.                   Hello, Operator?  Deb... It's me.  I need you to step out front.  I got a surprise for you too.  Don't come any closer for a sec.  This is gonna be kind of a shock... You remember when we said \"together forever no matter what\"?  Deb, it's me.  It's still me.  I love you, Deb.  A few days in space, it'll be great, what's the worst that could happen?  Perfect.  Thanks.  You think you got trouble?  Take a good look, pal, how bad could it be?  Okay, easy there, buddy.  You had to choose my spot, didn't you?  This is really not my day.  A little help here?!  You wanna hit that button, sir?  What the --!  Am I okay?!  You wanna explain that?!  Or this?!  What the hell am I? 'Cause I sure ain't Ben anymore.            Be nice.  Uh...don't do drugs.  Yeah, nine years straight.  I'll take the stairs.  You got a chisel round here?  Well why didn't you say so?  You want me to lift some weights or something?  How bad is it?  You know I used to smoke.  Yeah. You don't wanna know the details.  Not unless you want that clipboard stretched up your --  You look like an eighties rock band.  I wouldn't be caught dead in that.    Yeah I'm surprised.  Surprised the fire department didn't shut this down.  I already got it.  Everything I want.  That's not funny!  Ernie.  Sorry for killing your business.  I'll take the usual, then I'm out... Better make it a double.  If there's a God, she hates me.  You wouldn't say that, if you could see me.  Trust me, this ain't one of those times.   Oh, he did.  Could be worse.    It's about to be a broken face.  Did you just --  Okay, that's it, tinkerbell!  You want to fly?  Fly.  It's not him.  It's them. I can't live like this.  It's easy for you to be patient.  Together?  Look at me, Susie.  You got no idea what I'd give...to be invisible.  Your nightmare...is my dream.    How'd you know it was me?  I'm not really dressed for a party.  No, I mean...I'm a little...dusty...  Those yours too?  What are you doing here?  About me?  How sweet.  Yeah, I have that effect on people.  Oh, you remember my name do you?  You happen to remember what you swore to do with every breath in your body?  Yeah.  I can tell.  Victor was right.  Glad \"nothing\" could take you away from your work.  Look at me, Reed.  Look at me!  I spent my whole life protecting you, from the schoolyard to the stars.  For what?  So you could play Twister with your girlfriend while I'm the freak of the week?  Stay out of this Susie.  Good thing you're flexible enough to watch your own back.  'Cause you're on your own now.   Go back to the drawing board.  What is this?  Where's Reed?  What do you want, Vic?  Reed said it'd be weeks till --  And you can?  Power it up?  Let's do it.  Oh my God... Th-thank you.  THANK  Vic... What the...?  Victor, the machine worked for me.  It can work for you --  You planned this...?  And no Thing to stand in your way.    Victor must've taken him.  We need to help Reed --  What...what have I done?   Damn, I've been wanting to do that.    Excuse me, Maam.  Can I borrow your car?  Not gonna be a problem.  Got it, teach.  Job, huh...?  Funny how things turn out, isn't it?  Forget it, egghead.  I'm good as is.  I like the sound of that.  No more cracks about how I look.  Showoff.",
        "Grimm": "",
        "Leonard": "And if he's not...?  They're ready for you, sir.  Our numbers are through the roof.  The IPO's tracking at fifty, sixty a share.  The bank's five times oversubscribed --  Then what is it?  Harry Winston sends his regards.  Recording, sir.  We see you perfectly.  Stable.  We're looking at low twenties.  It's a good number, considering the fallout from --  Sir, I'm sure he wouldn't put himself --  Actually, uh, people seem to think the scar \"humanizes\" you.  You know, maybe you should get some rest --  Sir, I've always wondered... Why Sue? You could have any woman in the world but --  Yes sir.  You've got the Mayor at eight, then a nine-thirty interview with the Journal --  Top left, like you asked. Today Wall Street.  Tomorrow, who knows...maybe Washington.  Uh, sir...Larry King called, to cancel. Apparently, there's a bigger story.  Sir.  Reed's comments at that press conference killed us.  How are we going to turn this around?  Is Reed any closer to a cure?  Sir, is everything okay?  What happened to your...?  Ben!  They need you back at the Baxter building.  It's...Reed.  Yes sir.",
        "Debbie": "Just get back soon, or I start looking for a new groom.  I don't care about rocks, I care about you. You bring him back in one piece, or you can forget being Best Man.  Out front?  You home, baby?  I got a surprise for you.  Ben?  Baby, you're scaring me.  Oh my G-g-g.  What did you...do to Ben?  Don't...don't...DON'T TOUCH ME!  What did you wish for, honey?",
        "McIlvane": ""
    },
    "imdb_rating": "5.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNWU1ZjFjMTctYjA5ZC00YTBkLTkzZjUtZWEyMjgxY2MxYWM4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Four astronauts have their lives changed forever, when they end up being hit by a cloud of cosmic radiation. Reed Richards now has the ability to stretch his body like elastic. Sue Storm (Alba) is now the invisible woman. Johnny Storm becomes the human touch and Ben Grimm becomes the 'Thing', a man made out of rock. But there is one problem. The journey's sponsor, Victor Von Doom has also been affected and with full power, is a dangerous force which needs to be stopped, before it's too late.—Film_Fan",
    "name": "Fantastic Four",
    "genres": [
        "Action",
        "Adventure",
        "Fantasy"
    ]
}