{
    "filename": "Fargo_script.txt",
    "imdb_id": "tt0116282",
    "imdb_url": "https://www.imdb.com/title/tt0116282",
    "characters": [
        "Car Salesman",
        "Gaear Grimsrud",
        "Shep Proudfoot (as Steven Reevis)",
        "Irate Customer",
        "Morning Show Hostess",
        "Hooker #1",
        "Hooker #2",
        "Morning Show Host",
        "Irate Customer's Wife",
        "Jean Lundegaard",
        "Jerry Lundegaard",
        "Carl Showalter",
        "Scotty Lundegaard",
        "Wade Gustafson",
        "Reilly Diefenbach (voice)"
    ],
    "dialogues": {
        "Car": "No, that's not it, Jerry.   The new vehicle, plus forty thousand dollars.   Shep didn't tell us much, Jerry.   Except that you were gonna be here at 7:30.   Yeah, you already said that.   I'm not gonna debate you, Jerry.   I'm not gonna sit here and debate. I will say this though:  what Shep told us didn't make a whole lot of sense.   You want your own wife kidnapped?   ...  You - my point is, you pay the ransom - what eighty thousand bucks? -  I mean, you give us half the ransom, forty thousand, you keep half.  It's like robbing Peter to play Paul, it doesn't make any -   What kind of trouble are you in, Jerry?   So why don't you just ask him for the money?  Grimsrud, the dour man who has not yet spoken, now softly puts in with a Swedish-accented voice:   Or your fucking wife, Jerry.   Personal matters.   Okay, Jerry.  You're tasking us to perform this mission, but you, you won't, uh, you won't - aw, fuck it, let's take a look at that Ciera.    Carl Showalter is driving.  Gaear Grimsrud stares blankly out.  After a long beat:   What?   What're you, nuts?  We had pancakes for breakfast.  I gotta go somewhere I can get a shot and a beer - and a steak maybe. Not more fuckin' pancakes.  Come on.  Grimsrud gives him a sour look.   ...  Come on, man.  Okay, here's an idea.  We'll stop outside of Brainerd.  I know a place there we can get laid.  Wuddya think?   Yeah, yeah, Jesus - I'm sayin', we'll stop for pancakes, then we'll get laid.  Wuddya think?   Oh, Jesus, yeah.    Carl is driving.  Grimsrud stares out front.  After a beat:   ...  Look at that.  Twin Cities. IDS Building, the big glass one. Tallest skyscraper in the Midwest. After the Sears, uh, Chicago... You never been to Minneapolis?   ...  Would it kill you to say something?   \"No.\" First thing you've said in the last four hours.  That's a, that's a fountain of conversation, man.  That's a geyser.  I mean, whoa, daddy, stand back, man.  Shit, I'm sittin' here driving, man, doin' all the driving, whole fuckin' way from Brainerd, drivin', tryin' to, you know, tryin' to chat, keep our spirits up, fight the boredom of the road, and you can't say one fucking thing just in the way of conversation.  Grimsurd smokes, gazing out the window.   ...  Well, fuck it, I don't have to talk either, man.  See how you like it...  He drives.   ...  Total silence...   Huh?  Grimsurd looks at his thumb.    Carl drives.  Grimsrud smokes and gazes out the window. From the back seat we hear whimpering.  Grimsrud turns to look.  Jean lies bound and curled on the back seat underneath a tarpaulin.   Geez.  That's more'n I've heard you say all week.  Grimsrud stares at him, then turns back to the window.  At a loud WHOOP Carl starts and looks back out the rear window.  Fifty yards behind a state trooper has turned on his gumballs.  Carl eases the car onto the shoulder.   Ah, shit, the tags...  Grimsrud looks at him.   ...  It's just the tags.  I never put my tags on the car.  Don't worry, I'll take care of this.  He looks into the back seat as the car bounces and slows on the gravel shoulder.   ...  Let's keep still back there, lady, or we're gonna have to, ya know, to shoot ya.  Grimsrud stares at Carl.   ...  Hey!  I'll take care of this!  Both cars have stopped.  Carl looks up at the rear-view mirror.  The trooper is stopped on the shoulder just behind them, writing in his citation book.  Carl watches.  We hear the trooper's door open.  The trooper walks up the shoulder, one hand resting lightly on top of his holster, his breath steaming in the cold night air.  Carl opens his window as the trooper draws up.   How can I help you, officer?  The trooper scans the inside of the car, taking his time.  Grimsrud smokes and gazes calmly out his window.  Finally:   It certainly is, officer.  Still got that smell!   Certainly -   Certainly.  He reaches for his wallet.   ...  I was gonna tape up the temporary tag, ya know, to be in full compliance, but it, uh, it, uh ... must a slipped my mind...  He extends his wallet toward the trooper, a folded fifty- dollar bill protruding from it.   ...  So maybe the best thing would be to take care of that, right here in Brainerd.   That's my license and regis- tration.  I wanna be in compliance.  He forces a laugh.   ...  I was just thinking I could take care of it right here.  In Brainerd.  The policeman thoughtfully pats the fifty into the billfold and hands the billfold back into the car.    Whoa...  Whoa, Daddy.  Grimsrud takes the trooper's hat off of Carl's lap and sails it out the open window.   Whoa, Daddy.  Jean, for some reason, screams again.  Then stops.   Yeah.  He gets out.    Marge's prowler is parked nearby.  Marge is on her hands and knees by a body down in the ditch, again looking at footprints in the snow.  She calls up to the road:   Hold it.  They both look out at the front lawn, Grimsrud expressionless, Carl smiling.  With muffled cries, the hooded woman lurches across the unbroken snow, staggering this way and that, stumbling on the uneven terrain.  She stops, stands still, her hooded head swaying.  She lurches out in an arbitrary direction.  Going downhill, she reels, staggers, and falls face-first into the snow, weeping.   Ha ha ha ha ha ha!  Jesus!  Grimsrud, still expressionless, breaks away from Carl's restraining hand to retrieve her.   ...days ... be here for days with a - DAMMIT! - a goddamn mute ... nothin' to do ... and the fucking -  ...  TV doesn't even ... plug me in, man...  Gimmee a - DAMMIT! - signal...  Plug me into the ozone, baby...  Plug me into the ozone - FUCK!...  With one last bang we cut:   ...  Who's Jean?   Oh, Jean's okay.  But there's three people up in Brainerd who aren't so okay, I'll tell ya that.   Blood has been shed, Jerry.  Jerry sits dumbly.  The voice solemnly repeats:   ...  Blood has been shed.   Three people.  In Brainerd.   That's right.  And we need more money.   We need more -    Look.  I'm not gonna debate you, Jerry.  The price is now the whole amount.  We want the entire eighty thousand.   Blood has been shed.  We've incurred risks, Jerry.  I'm coming into town tomorrow.  Have the money ready.   IS IT, JERRY?  You ask those three pour souls up in Brainerd if a deal's a deal!  Go ahead, ask 'em!   I'll see you tomorrow.  Click.  Jerry slams down the phone, which immediately rings.  He angrily snatches it up.   Yeah, I decided not to park here.  The attendant frowns uncomprehendingly at the ticket.   Yeah, I just came in.  I decided not to park here.  The attendant is still puzzled.   I decided not to - I'm, uh, not taking the trip as it turns out.   I just pulled in here.  I just fucking pulled in here!   I guess you think, ya know, you're an authority figure.  With that stupid fucking uniform.  Huh, buddy?  The attendant doesn't say anything.   ...  King Clip-on Tie here.  Big fucking man.  He is peeling off one dollar bills.   ...  You know, these are the limits of your life, man.  Ruler of your little fucking gate here.  There's your four dollars.  You pathetic piece of shit.    Carl Showalter is sitting at a small table with a tarty- looking blonde in a low-cut gown.  Each holds a drink.   Just in town on business.  Just in and out.  Ha ha!  A little of the old in-and-out!   Have ya been to the Celebrity Room before?  With other, uh, clients?   Yeah, well, it depends on the artist. You know, Jose Feliciano, ya got no complaints.  Waiter!  The reverse shows a disappearing waiter and the backs of many, many people sitting at tables between us and the very distant stage.  Jose Feliciano, very small, performs on a spotlit stool.  The acoustics are poor.  Carl grimaces.   ...  What is he, deaf?...  So, uh, how long have you been with the escort service?   Ya find the work interesting, do ya?   Shep!  What the hell are you doing? I'm banging that girl!  Shep!  Jesus Ch -  Shep slaps him hard, forehand, backhand.   Shep!  Don't you dare fucking hit me, man!  Don't you -  - punches him and flings him away.  Carl hits a sofa and we see his bare legs disappear as he flips back over it.  Shep enters frame to circle the sofa and kick at Carl behind it.   Stay away from me, man!  Hey! Smoke a fuckin' peace pipe, man! Don't you dare fuckin' -  Unghh!  After hitting him several times, Shep yanks Carl's belt out of his dangling pants and strangles him with it.  Carl gurgles.  Shep knees Carl repeatedly, then dumps him onto the floor and starts whipping him with the buckle end of the belt.   All right, Jerry, I'm through fucking around.  You got the fucking money?   Don't you fucking but me, Jerry. I want you with this money on the Dayton-Radisson parking ramp, top level, thirty minutes, and we'll wrap this up.   You're there in thirty minutes or I find you, Jerry, and I shoot you, and I shoot your fucking wife, and I shoot all your little fucking children, and I shoot 'em all in the back of their little fucking heads. Got it?     Wade's jaw works as he glares out at traffic.  He mumbles to himself as he drives.   Who the fuck are you?  Who the fuck are you?   I am through fucking around!  Drop that fucking briefcase!   Fuck you, man!  Where's Jerry?  I gave SIMPLE FUCKING INSTRUCTIONS -   Drop that fucking money!   Is this a fucking joke here?  He pulls out a gun and fires into Wade's gut.   ...  Is this a fucking joke?   You fucking imbeciles!  He bends down next to Wade to pick up the briefcase.   Oh!  Carl stumbles and falls back, and then stands up again.  His jaw is gouting blood.   ...  Owwmm...  One hand pressed to his jaw, he fires down at Wade several times.  Blood streams through the hand pressed to his jaw.   ...  Mmmmmphnck!  He fnkem shop me...  He pockets the gun, picks up the briefcase one-handed, flings it into his car, gets in, peels out.    Jerry recovers from the near miss and continues up.   Ophhem ma fuchem gaphe!    Carl mumbles as he drives, underlit by the dim dash lights, one hand now holding a piece of rag to his shredded jaw.   ...  Fnnkn ashlzh...  Fnk...    In his car, now parked, one hand holding the rag pressed to his mangled jaw.  He is staring down at something in the front seat next to him.  His other hand holds open the briefcase.  It has money inside - a lot of money.  Carl unfreezes, takes out one of the bank-wrapped wads and looks at it.   ...  Mmmnphh.  He paws through the money in the briefcase to get a feeling for the amount.   ...  Jeshush Shrist...  Jeshush fuchem Shrist!  Excited, he counts out a bundle of bills and tosses it onto the back seat.  He starts to take the rag away from his chin but the layer pressed against his face sticks, its loose weave bound to his skin by clotted blood.  He pulls very gently and winces as blood starts to flow again.  He carefully tears the rag in half so that only a bit of it remains adhering to his jaw.    It is pulled over to the side of an untraveled road.  THe door opens and Carl emerges with the briefcase.  He slogs through the snow, down a gulley and up the embankment to a barbed-wire fence.  He kneels at one of the fence posts and frantically digs into the snow with his bare hands, throws in the briefcase and covers it back up.  He stands and tries to beat the circulation back into his red, frozen hands.  He looks to the right.  A regular line of identical fence posts stretches away against unblemished white.  He looks to the left.  A regular line of identical fence posts stretches away against unblemished white.  He looks at the fence post in front of him.   Mmmphh...  He looks about the snowy vastness for a marker.  Finding none, he kicks the fence post a couple of times, failing to scar or tilt it, then hurriedly plants a couple of sicks up against the post.  He bends down, scoops up a handful of snow, presses it against his wounded jaw, and lopes back to the idling car.    Marge drives, gazing out at the road.   You should she zhe uzher guy!  He glances around.   ...  The fuck happen a her?  Jean sits slumped in a straight-backed chair facing the wall.  Her hooded head, resting on her chin, is motionless. There is blood on the facing wall.   Jezhush.  He shakes his head.   ...  Well, I gotta muddy.  He is plunking down eight bank-wrapped bundles on the table.   ...  All of it.  All eighty gran. Forty for you...  He makes one pile, pockets the rest.   ...  Forty for me.  Sho thishuzh it.  Adiosh.  He slaps keys down on the table.   ...  You c'n'ave my truck.  I'm takin' a Shiera.       ...  Are we shquare?  Grimsrud says nothing.    ...  Fuckin' ash-hole.  And if you shee your friend Shep Proudpfut, tell him I'm gonna NAIL hizh fuckin' ash.",
        "Salesman": "You bet.   They're playin' the Buckeyes!   Ya kiddin'!   Jerry, ya got a call here.",
        "Gaear": "He sits eating a Swanson's TV dinner from a TV tray he has set up in front of an easy chair.  He watches the old black-and-white TV set whose image - it might be a game show - is still heavily ghosting and diffused by snow.  The audio crackles with interference. Despite the impenetrability of its image, it holds Grimsrud's complete attention.  At the sound of the front door opening, Grimsrud looks up.  Carl enters, his face suppurating and raw.  He reacts to Grimsrud's wordless look with a grotesque laugh.",
        "Grimsrud": "Or your fucking wife, you know.   Where is Pancakes Hause?   We stop at Pancakes Hause.   I'm fuckin' hungry now, you know.   Nnph.   No.   I did.   Unguent.   I need ... unguent.   Shut the fuck up or I'll throw you back in the trunk, you know.   Shut up.  He releases the policeman.  The policeman's head slides out the window and his body flops back onto the street.  Carl looks out at the cop in the road.   You'll take care of it.  Boy, you are smooth smooth, you know.   Clear him off the road.    He sits eating a Swanson's TV dinner from a TV tray he has set up in front of an easy chair.  He watches the old black-and-white TV set whose image - it might be a game show - is still heavily ghosting and diffused by snow.  The audio crackles with interference. Despite the impenetrability of its image, it holds Grimsrud's complete attention.  At the sound of the front door opening, Grimsrud looks up.  Carl enters, his face suppurating and raw.  He reacts to Grimsrud's wordless look with a grotesque laugh.   She started shrieking, you know.   We split that.  Carl looks at him.   One of us pays the other for half.",
        "Irate": "",
        "Customer": "We sat here right in this room and went over this and over this!   I sat right here and said I didn't want no TruCoat!   You're sittin' here, you're talkin' in circles!  You're talkin' like we didn't go over this already!   We had us a deal here for nine- teen-five.  You sat there and darned if you didn't tell me you'd get this car, these options, WITHOUT THE SEALANT, for nine- teen-five!   You called me twenty minutes ago and said you had it!  Ready to make delivery, ya says!  Come on down and get it!  And here ya are and you're wastin' my time and you're wastin' my wife's time and I'm payin' nineteen-five for this vehicle here!   These guys here - these guys! It's always the same!  It's always more!  He's a liar!   We went over this and over this -   One hundred!  You lied to me, Mr. Lundegaard.  You're a bald-faced liar!  Jerry sits staring at his lap.   ...  A fucking liar -   Oh, for Christ's sake, where's my goddamn checkbook.  Let's get this over with.   Yah, I don't need no sealant though.",
        "Hooker": "There ya go, sugar.   Yeah.  Yeah.  Oh, yeah.   Chaska.   LeSeure.  But I went to high school in White Bear Lake.   Well, the little guy, he was kinda funny-looking.   I dunno.  Just funny-looking.   I couldn't really say.  He wasn't circumcised.   Yah.   Uh-huh.   No.  Like I say, he was funny-looking. More'n most people even.   He was a little older.  Looked like the Marlboro man.   Yah.  Maybe I'm sayin' that cause he smoked Marlboros.   A subconscious-type thing.   Yah.   They said they were goin' to the Twin Cities?   Yah.   Yah.  Is that useful to ya?",
        "#1": "",
        "#2": "",
        "Jean": "I'm talkin' about your potential.   You're not a C student.   And yet you're gettin' C grades. It's this disparity there that concerns your dad and me.   You know what a disparity is?   Okay.  Well, that's why we don't want ya goin' out fer hockey.   Hold on.  She picks up the phone.   ...  Hello?   Oh, hiya, Dad.   Yah, he's still here - I'll catch him for ya.  She holds the phone away and calls:   ...  Hon?   It's Dad.   Scott!",
        "Lundegaard": "We hear a morning show on television.  Jean Lundegaard is making coffee in the kitchen as Scott eats cereal at the table.    Jerry, Wade, and Stan Grossman sit around the kitchen table. It is night.  The scene is harshly toplit by a hanging fixture.  On the table are the remains of coffee and a cinammon filbert ring.    Jerry is at his desk using a blunt pencil to enter numbers onto a form.  Beneath the form is a piece of carbon paper and beneath that another form copy, which Jerry periodically checks.  The carbon-copy form shows thick smudgy, illegible entries.  Jerry hums nervously.  Glass rattles as someone taps at his door.  Jerry looks up and freezes, mouth hanging open, brow knit with worry.  Marge sticks her head in the door.",
        "Jerry": "Yah, Shep Proudfoot said -   Shep said 8:30.   I'm sure sorry.  I - Shep told me 8:30.  It was a mix-up, I guess.   Yah, you bet.  It's in the lot there.  Brand-new burnt umber Ciera.   Yah, how ya doin'.  So, uh, we all set on this thing, then?   Yah, no, I'm sure you are.  Shep vouched for you and all.  I got every confidence in you fellas.  They stare at him.  An awkward beat.   ...  So I guess that's it, then. Here's the keys -   Huh?   Yah, but the deal was, the car first, see, then the forty thousand, like as if it was the ransom.  I thought Shep told you -   Well, okay, it's -   Yah, well, that was a mix-up, then.   Yah.  But it's not a whole pay- in-advance deal.  I give you a brand-new vehicle in advance and -   Okay.   Oh, no, it's real sound.  It's all worked out.   Yah.  Carl Stares.  Jerry looks blankly back.   Okay, it's - see, it's not me payin' the ransom.  The thing is, my wife, she's wealthy - her dad, he's real well off.  Now, I'm in a bit of trouble -   Well, that's, that's, I'm not go inta, inta - see, I just need money.  Now, her dad's real wealthy -   Well, it's all just part of this - they don't know I need it, see. Okay, so there's that.  And even if they did, I wouldn't get it. So there's that on top, then.  See, these're personal matters.   Yah.  Personal matters that needn't, uh -   Hon?  Got the growshries.   Yah, real good.   How ya doin', Wade?  Wade Gustafson is mid-sixtyish, vigorous, with a full head of gray hair.  His eyes remain fixed on the TV.   Whatcha watchin' there?   ...  Who they playin'?   Is he stayin' for supper, then?   Sure, ya done there?   Back at 9:30.   Wade, have ya had a chance to think about, uh, that deal I was talkin' about, those forty acres there on Wayzata?   Yah, you said you'd have a think about it.  I understand it's a lot of money -   A lot.  It's a limited -   I mean a parking lot.   Yah, well, it's a chunk, but -   Well, you know Stan'll say no dice.  That's why you pay him. I'm asking you here, Wade.  This could work out real good for me and Jean and Scotty -   Yah, but that TruCoat -   Yah, but I'm sayin', that TruCoat, you don't get it and you get oxidization problems.  It'll cost you a heck of lot more'n five hunnert -   Yah, but this TruCoat -   Okay, I'm not sayin' I didn't -   Well, okay, I'll talk to my boss...  He rises, and, as he leaves:   ...  See, they install that TruCoat at the factory, there's nothin' we can do, but I'll talk to my boss.  The couple watch him go to a nearby cubicle.   So you're goin' to the Gophers on Sunday?   You wouldn't have an extra ticket there?   Yah.    Jerry re-enters.   Well, he never done this before, but seein' as it's special circumstances and all, he says I can knock one hunnert off that TruCoat.   One hunnert's the best we can do here.   ...  Yah, okay...   Say, let's watch the language -  He takes the phone.   How ya doin', Wade?   Oh, nothing, Wade.  How ya doin' there?   No kiddin'?   No kiddin'!  I'd need the cash pretty quick there.  In order to close the deal.   Yah.   Yah, okay.   Say, Shep, how ya doin' there?   Say, ya know those two fellas ya put me in touch with, up there in Fargo?   Well, yah, but he had a buddy there.  He, uh -   Well, that's okay, I just -   Carl somethin'?   Well, that's okay, he's a buddy of the guy ya vouched for, so I'm not worryin'.  I just, I was wonderin', see, I gotta get in touch with 'em for, I might not need it anymore, sumpn's happenin', see -   Yah, well, see, I did that, and I haven't been able to get 'em, so I thought you maybe'd know an alternate number or what have ya.   Okay, well, real good, then.    He is on the phone.   Yah, real good.  How you doin'?   Yah, it's pretty darned busy here, but that's the way we like it.   But I already got the, it's okay, the loans are in place, I already got the, the what, the -   Yah, so we're all set.   But the deal's already done, I already got the money -   Yah, well, they exist all right.   Well, but see, I don't have 'em in front a me - why don't I just fax you over a copy -   Yah, okay, I'll have my girl send you over a copy, then.   Yah, how much money was that?   Yah, no problem, I'll just fax that over to ya, then.   I mean send it over.  I'll shoot it right over to ya.   Okay, real good, then.   How ya doin' there, Stan?  How are ya, Wade?  Stan Grossman shakes his hand.   Oh, those numbers are all right, bleemee.   Yah, thanks, Stan, it's a pretty -   ...  Huh?   ...  My fee?  Wade, what the heck're you talkin' about?   Yah.   Yah.   No, but, Wade, see, I was bringin' you this deal for you to loan me the money to put in.  It's my deal here, see?  Wade scowls, looks at Stan.   Yah, right -   No, no.  I - I'd, I'd - pay you back the principal, and interest - heck, I'd go - one over prime -   No, see, I don't need a finder's fee, I need - finder's fee's, what, ten percent, heck that's not gonna do it for me.  I need the principal.   Yah, but I - okay, I would, I'd guarantee ya your money back.   Hon?  He shuts the door.   ...  Got the growshries...  He has already seen the shower curtain on the floor.  He frowns, pokes at it with his foot.   ...  Hon?   Yah, Wade, I - it's Jerry, I.  Then, slightly more agitated.   ...  Yah, Wade, it's, I, it's Jerry...  Beat.   ...  Wade, it's Jerry, I - we gotta talk, Wade, it's terrible...  Beat.   ...  Yah, Wade Gustafson, please.   No!  They said no cops!  They were darned clear on that, Wade!  They said you call the cops and we -   Well, they -   Yah, but think this thing through here, Wade.  Ya give 'em what they want, why wont' they let her go? You gotta listen to me on this one, Wade.   No!  No cops!  That's final!  This is my deal here, Wade!  Jean is my wife here!   You're darned tootin'!   Now come on here, no way, Wade! No way!   Yah!   They're gonna call, give me instructions for a drop.  I'm supposed to have the money ready tomorrow.   Yah, real good now.   No, I - they don't want - they're just s'posed to be dealin' with me, they were real clear.   Ya know, they said no one listenin' in, they'll be watchin', ya know. Maybe it's all bull, but like you said, Stan, they're callin' the shots.   Yah, geez, Scotty.  I'll go talk to him.  There is a tap at the horn from Wade, and Stan gets into the Lincoln.   ...  How ya doin' there, Scotty?   It's okay, Scotty.  They're not gonna want to hurt her any. These men, they just want money, see.   No, no, nothin's goin' wrong here. Grandad and I, we're - we're makin' sure this gets handled right.  Scott snorfles and sits up.   No!  We can't let anyone know about this thing!  We gotta play ball with these guys - you ask Stan Grossman, he'll tell ya the same thing!   We're gonna get Mom back for ya, but we gotta play ball.  Ya know, that's the deal.  Now if Lorraine calls, or Sylvia, you just say that Mom is in Florida with Pearl and Marty...  Scotty starts to weep again.  Jerry stares down at his lap.   ...  That's the best we can do here.   Yah, ya got yer, this loaded here, this has yer independent, uh, yer slipped differential, uh, yer rack- and-pinion steering, yer alarm and radar, and I can give it to ya with a heck of a sealant, this TruCoat stuff, it'll keep the salt off -   Yah, you don't need that.  Now were you thinking of financing here? You oughta be aware a this GMAC plan they have now, it's really super -   Yah, okay.    He sits in and picks up his phone.   Jerry Lundegaard.   Well ... yah.   Well, yah, I got an idea.  How's that Ciera workin' out for ya?   Well, what do ya mean?   What the - how's Jean?  A beat.   My wife!  What the - how's -   What the heck're you talkin' about? Let's just finish up this deal here -   What the heck d'ya mean?   Oh, geez.   The heck d'ya mean?  What a you guys got yourself mixed up in?   This was s'posed to be a no-rough -stuff-type deal -    Well, I'm sorry, but I just - I -   Oh, for Chrissakes here -   Now we had a deal here!  A deal's a deal!   ...  The heck d'ya mean?   Yah!   Yah!   Yah!  I ... those are in the mail.   Yah.   Yah.   ...  Yah.   No, Wade!  They were real clear! They said they'd call tomorrow, with instructions, and it's gonna be delivered by me alone!   No, no.  See - they, no, see, they only deal with me.  Ya feel this, this nervousness on the phone there, they're very - these guys're dangerous -   The heck d'ya mean?   No, see -   Where's Shep?  The mechanic points.   ...  Cop?  Marge and Shep face each other at the other end of the floor in a grimy and cluttered glassed-in cubicle.    Jerry is worriedly pacing behind his desk.  At a noise he looks up.  Marge has stuck her head in the door.   Huh?  Yah?   What...  What is it all about?   Naw, I...  Executive Sales Manager.   My father-in-law, he's the owner.   ...  Brainerd?   ...  Babe the Blue Ox?   No.  No, ma'am.   ...  Yah, okay.  He looks up at Marge's retreating back.  He looks back down at the papers.  He looks over at the phone.  he picks up the phone and dials four digits.   ...  Yah, gimmee Shep...  The heck d'ya mean?...  Well, where'd he go?  It's only...  No, I don't need a mechanic - oh, geez - I gotta talk to a friend of his, so, uh ... have him, uh ... oh, geez...    Jerry is at the kitchen phone.  Through the door to the dining room we see Wade picking up an extension.   Yah, I got the money, but, uh -   Yah, okay, but, uh -   ...  Yah, well, you stay away from Scotty now -   Okay, real good, then.  The line goes dead.  A door slams offscreen.    Jerry sits in the foyer, trying to pull on pair of galoshes. Scotty's voice comes from upstairs:   It's okay, Scotty.   Be back in a minute.  If Stan calls you, just tell him I went to Embers.  Oh, geez -  Thunk! - his first boot goes on.    Jerry recovers from the near miss and continues up.   Oh, geez!   Oh!  Oh, geez!  He bends down, picks Wade up by the armpits and drags him over to the back of the Cadillac.  He drops Wade's body, walks to the driver's side of the car, pulls the keys and walks back to pop the trunk.  He wrestles Wade's body into the trunk, slams it shut and walks back to the scene of the shooting.  He kicks at the snow with his galoshed feet, trying to hide the fresh bloodstains.    The car pulls into the driveway.   Yah.   Yah, okay.   Okay.   Yah.  Thoonk - the first boot comes off.   Well...  I'm goin' ta bed now.    Jerry is at his desk using a blunt pencil to enter numbers onto a form.  Beneath the form is a piece of carbon paper and beneath that another form copy, which Jerry periodically checks.  The carbon-copy form shows thick smudgy, illegible entries.  Jerry hums nervously.  Glass rattles as someone taps at his door.  Jerry looks up and freezes, mouth hanging open, brow knit with worry.  Marge sticks her head in the door.   Yah, no, I'm kinda - I'm kinda busy -   No, I -  But she is already sitting into the chair opposite with a sigh of relieved weight.   Yah, like I told ya, we haven't had any vehicles go missing.   Yah, I see.   The car's not from our lot, ma'am.   Well, I would know.  I'm the Executive Sales Manager.   We run a pretty tight ship here.   Ma'am, I answered your question.  There is a silent beat.   Ma'am, I answered your question. I answered the darn -  I'm cooperating here, and I...   I'm not, uh, I'm not arguin' here. I'm cooperating...  There's no, uh - we're doin' all we can...  He trails off into silence.   Well, heck, if you wanna, if you wanna play games here!  I'm workin' with ya on this thing, but  Okay, I'll do a damned lot count!   Sure right now!  You're darned tootin'!  He is yanking his parka from a hook behind the opened door and grabbing a pair of galoshes.   ...  If it's so damned imporant to ya!   Aw, what the Christ!  He stamps out the door.  Marge stares.  After a long moment her stare breaks.  She glances idly around the office.  There is a framed picture facing away from her on the desktop.  She turns it to face her.  It is Scotty, holding an accordion.  There is another picture of Jean.  Marge looks at it, looks around, for some reason, at the ceiling.  She looks at a trophy shelf on the wall behind her.  She fiddles idly with a pencil.  She pulls a clipboard toward her.  It holds a form from the General Motors Finance Corporation.  She looks idly around.  Her look abruptly locks.",
        "Carl": "No, that's not it, Jerry.   The new vehicle, plus forty thousand dollars.   Shep didn't tell us much, Jerry.   Except that you were gonna be here at 7:30.   Yeah, you already said that.   I'm not gonna debate you, Jerry.   I'm not gonna sit here and debate. I will say this though:  what Shep told us didn't make a whole lot of sense.   You want your own wife kidnapped?   ...  You - my point is, you pay the ransom - what eighty thousand bucks? -  I mean, you give us half the ransom, forty thousand, you keep half.  It's like robbing Peter to play Paul, it doesn't make any -   What kind of trouble are you in, Jerry?   So why don't you just ask him for the money?  Grimsrud, the dour man who has not yet spoken, now softly puts in with a Swedish-accented voice:   Or your fucking wife, Jerry.   Personal matters.   Okay, Jerry.  You're tasking us to perform this mission, but you, you won't, uh, you won't - aw, fuck it, let's take a look at that Ciera.   What?   What're you, nuts?  We had pancakes for breakfast.  I gotta go somewhere I can get a shot and a beer - and a steak maybe. Not more fuckin' pancakes.  Come on.  Grimsrud gives him a sour look.   ...  Come on, man.  Okay, here's an idea.  We'll stop outside of Brainerd.  I know a place there we can get laid.  Wuddya think?   Yeah, yeah, Jesus - I'm sayin', we'll stop for pancakes, then we'll get laid.  Wuddya think?   Oh, Jesus, yeah.   ...  Look at that.  Twin Cities. IDS Building, the big glass one. Tallest skyscraper in the Midwest. After the Sears, uh, Chicago... You never been to Minneapolis?   ...  Would it kill you to say something?   \"No.\" First thing you've said in the last four hours.  That's a, that's a fountain of conversation, man.  That's a geyser.  I mean, whoa, daddy, stand back, man.  Shit, I'm sittin' here driving, man, doin' all the driving, whole fuckin' way from Brainerd, drivin', tryin' to, you know, tryin' to chat, keep our spirits up, fight the boredom of the road, and you can't say one fucking thing just in the way of conversation.  Grimsurd smokes, gazing out the window.   ...  Well, fuck it, I don't have to talk either, man.  See how you like it...  He drives.   ...  Total silence...   Huh?  Grimsurd looks at his thumb.   Geez.  That's more'n I've heard you say all week.  Grimsrud stares at him, then turns back to the window.  At a loud WHOOP Carl starts and looks back out the rear window.  Fifty yards behind a state trooper has turned on his gumballs.  Carl eases the car onto the shoulder.   Ah, shit, the tags...  Grimsrud looks at him.   ...  It's just the tags.  I never put my tags on the car.  Don't worry, I'll take care of this.  He looks into the back seat as the car bounces and slows on the gravel shoulder.   ...  Let's keep still back there, lady, or we're gonna have to, ya know, to shoot ya.  Grimsrud stares at Carl.   ...  Hey!  I'll take care of this!  Both cars have stopped.  Carl looks up at the rear-view mirror.  The trooper is stopped on the shoulder just behind them, writing in his citation book.  Carl watches.  We hear the trooper's door open.  The trooper walks up the shoulder, one hand resting lightly on top of his holster, his breath steaming in the cold night air.  Carl opens his window as the trooper draws up.   How can I help you, officer?  The trooper scans the inside of the car, taking his time.  Grimsrud smokes and gazes calmly out his window.  Finally:   It certainly is, officer.  Still got that smell!   Certainly -   Certainly.  He reaches for his wallet.   ...  I was gonna tape up the temporary tag, ya know, to be in full compliance, but it, uh, it, uh ... must a slipped my mind...  He extends his wallet toward the trooper, a folded fifty- dollar bill protruding from it.   ...  So maybe the best thing would be to take care of that, right here in Brainerd.   That's my license and regis- tration.  I wanna be in compliance.  He forces a laugh.   ...  I was just thinking I could take care of it right here.  In Brainerd.  The policeman thoughtfully pats the fifty into the billfold and hands the billfold back into the car.    Whoa...  Whoa, Daddy.  Grimsrud takes the trooper's hat off of Carl's lap and sails it out the open window.   Whoa, Daddy.  Jean, for some reason, screams again.  Then stops.   Yeah.  He gets out.   Hold it.  They both look out at the front lawn, Grimsrud expressionless, Carl smiling.  With muffled cries, the hooded woman lurches across the unbroken snow, staggering this way and that, stumbling on the uneven terrain.  She stops, stands still, her hooded head swaying.  She lurches out in an arbitrary direction.  Going downhill, she reels, staggers, and falls face-first into the snow, weeping.   Ha ha ha ha ha ha!  Jesus!  Grimsrud, still expressionless, breaks away from Carl's restraining hand to retrieve her.   ...days ... be here for days with a - DAMMIT! - a goddamn mute ... nothin' to do ... and the fucking -  ...  TV doesn't even ... plug me in, man...  Gimmee a - DAMMIT! - signal...  Plug me into the ozone, baby...  Plug me into the ozone - FUCK!...  With one last bang we cut:   ...  Who's Jean?   Oh, Jean's okay.  But there's three people up in Brainerd who aren't so okay, I'll tell ya that.   Blood has been shed, Jerry.  Jerry sits dumbly.  The voice solemnly repeats:   ...  Blood has been shed.   Three people.  In Brainerd.   That's right.  And we need more money.   We need more -    Look.  I'm not gonna debate you, Jerry.  The price is now the whole amount.  We want the entire eighty thousand.   Blood has been shed.  We've incurred risks, Jerry.  I'm coming into town tomorrow.  Have the money ready.   IS IT, JERRY?  You ask those three pour souls up in Brainerd if a deal's a deal!  Go ahead, ask 'em!   I'll see you tomorrow.  Click.  Jerry slams down the phone, which immediately rings.  He angrily snatches it up.   Yeah, I decided not to park here.  The attendant frowns uncomprehendingly at the ticket.   Yeah, I just came in.  I decided not to park here.  The attendant is still puzzled.   I decided not to - I'm, uh, not taking the trip as it turns out.   I just pulled in here.  I just fucking pulled in here!   I guess you think, ya know, you're an authority figure.  With that stupid fucking uniform.  Huh, buddy?  The attendant doesn't say anything.   ...  King Clip-on Tie here.  Big fucking man.  He is peeling off one dollar bills.   ...  You know, these are the limits of your life, man.  Ruler of your little fucking gate here.  There's your four dollars.  You pathetic piece of shit.    Carl Showalter is sitting at a small table with a tarty- looking blonde in a low-cut gown.  Each holds a drink.   Just in town on business.  Just in and out.  Ha ha!  A little of the old in-and-out!   Have ya been to the Celebrity Room before?  With other, uh, clients?   Yeah, well, it depends on the artist. You know, Jose Feliciano, ya got no complaints.  Waiter!  The reverse shows a disappearing waiter and the backs of many, many people sitting at tables between us and the very distant stage.  Jose Feliciano, very small, performs on a spotlit stool.  The acoustics are poor.  Carl grimaces.   ...  What is he, deaf?...  So, uh, how long have you been with the escort service?   Ya find the work interesting, do ya?   Shep!  What the hell are you doing? I'm banging that girl!  Shep!  Jesus Ch -  Shep slaps him hard, forehand, backhand.   Shep!  Don't you dare fucking hit me, man!  Don't you -  - punches him and flings him away.  Carl hits a sofa and we see his bare legs disappear as he flips back over it.  Shep enters frame to circle the sofa and kick at Carl behind it.   Stay away from me, man!  Hey! Smoke a fuckin' peace pipe, man! Don't you dare fuckin' -  Unghh!  After hitting him several times, Shep yanks Carl's belt out of his dangling pants and strangles him with it.  Carl gurgles.  Shep knees Carl repeatedly, then dumps him onto the floor and starts whipping him with the buckle end of the belt.   All right, Jerry, I'm through fucking around.  You got the fucking money?   Don't you fucking but me, Jerry. I want you with this money on the Dayton-Radisson parking ramp, top level, thirty minutes, and we'll wrap this up.   You're there in thirty minutes or I find you, Jerry, and I shoot you, and I shoot your fucking wife, and I shoot all your little fucking children, and I shoot 'em all in the back of their little fucking heads. Got it?    Who the fuck are you?  Who the fuck are you?   I am through fucking around!  Drop that fucking briefcase!   Fuck you, man!  Where's Jerry?  I gave SIMPLE FUCKING INSTRUCTIONS -   Drop that fucking money!   Is this a fucking joke here?  He pulls out a gun and fires into Wade's gut.   ...  Is this a fucking joke?   You fucking imbeciles!  He bends down next to Wade to pick up the briefcase.   Oh!  Carl stumbles and falls back, and then stands up again.  His jaw is gouting blood.   ...  Owwmm...  One hand pressed to his jaw, he fires down at Wade several times.  Blood streams through the hand pressed to his jaw.   ...  Mmmmmphnck!  He fnkem shop me...  He pockets the gun, picks up the briefcase one-handed, flings it into his car, gets in, peels out.   Ophhem ma fuchem gaphe!    Carl mumbles as he drives, underlit by the dim dash lights, one hand now holding a piece of rag to his shredded jaw.   ...  Fnnkn ashlzh...  Fnk...    In his car, now parked, one hand holding the rag pressed to his mangled jaw.  He is staring down at something in the front seat next to him.  His other hand holds open the briefcase.  It has money inside - a lot of money.  Carl unfreezes, takes out one of the bank-wrapped wads and looks at it.   ...  Mmmnphh.  He paws through the money in the briefcase to get a feeling for the amount.   ...  Jeshush Shrist...  Jeshush fuchem Shrist!  Excited, he counts out a bundle of bills and tosses it onto the back seat.  He starts to take the rag away from his chin but the layer pressed against his face sticks, its loose weave bound to his skin by clotted blood.  He pulls very gently and winces as blood starts to flow again.  He carefully tears the rag in half so that only a bit of it remains adhering to his jaw.   Mmmphh...  He looks about the snowy vastness for a marker.  Finding none, he kicks the fence post a couple of times, failing to scar or tilt it, then hurriedly plants a couple of sicks up against the post.  He bends down, scoops up a handful of snow, presses it against his wounded jaw, and lopes back to the idling car.   You should she zhe uzher guy!  He glances around.   ...  The fuck happen a her?  Jean sits slumped in a straight-backed chair facing the wall.  Her hooded head, resting on her chin, is motionless. There is blood on the facing wall.   Jezhush.  He shakes his head.   ...  Well, I gotta muddy.  He is plunking down eight bank-wrapped bundles on the table.   ...  All of it.  All eighty gran. Forty for you...  He makes one pile, pockets the rest.   ...  Forty for me.  Sho thishuzh it.  Adiosh.  He slaps keys down on the table.   ...  You c'n'ave my truck.  I'm takin' a Shiera.      ...  Are we shquare?  Grimsrud says nothing.    ...  Fuckin' ash-hole.  And if you shee your friend Shep Proudpfut, tell him I'm gonna NAIL hizh fuckin' ash.",
        "Showalter": "In his car, now parked, one hand holding the rag pressed to his mangled jaw.  He is staring down at something in the front seat next to him.  His other hand holds open the briefcase.  It has money inside - a lot of money.  Carl unfreezes, takes out one of the bank-wrapped wads and looks at it.",
        "Scotty": "May I be excused?   Uh-huh.  Goin' out.   Just out.  Just McDonald's.   Okay.    Scotty lies on the bed, weeping.  Jerry enters and perches uncomfortably on the edge of his bed.",
        "Wade": "Yah, pretty good.   Norstars.   OOOoooh!  His reaction synchronizes with a reaction from the crowd.    Yah.   He just ate.  And he didn't finish. He's going to McDonald's instead of finishing here?   It's okay?  McDonald's?  What do you think they do there?  They don't drink milkshakes, I assure you!   You told me about it.   A heck of a lot.  What'd you say you were gonna put there?   I know it's a lot.   Yah, well, seven hundred and fifty thousand dollars is a lot - ha ha ha!   I thought you were gonna show it to Stan Grossman.  He passes on this stuff before it gets kicked up to me.   Jean and Scotty never have to worry.   Jerry around?   What's goin' on there?   Stan Grossman looked at your proposal.  Says it's pretty sweet.   We might be innarested.   Come by at 2:30 and we'll talk about it.  If your numbers are right, Stan says its pretty sweet.  Stan Grossman.   2:30.  Click.  Dial tone.      Wade sits behind his desk; another man rises as Jerry enters.   This is do-able.   What kind of finder's fee were you looking for?   Stan and I're okay.   We're good to loan in.   But we never talked about your fee for bringin' it to us.   You're sayin' that we put in all the money and you collect when it pays off?   What the heck, Jerry, if I wanted bank interest on seven hunnert'n fifty thousand I'd go to Midwest Federal.  Talk to Bill Diehl.   He's at -   What the heck were you thinkin'? Heck, if I'm only gettin' bank interest, I'd look for complete security.  Heck, FDIC.  I don't see nothin' like that here.   I'm not talkin' about your damn word, Jerry.  Geez, what the heck're you?...  Well, look, I don't want to cut you out of the loop, but his here's a good deal. I assume, if you're not innarested, you won't mind if we move on it independently.   -  All's I know is, ya got a problem, ya call a professional!   Well, a course they're gonna say that!  But where's my protection? They got Jean here!  I give these sons a bitches a million dollars, where's my guarantee they're gonna let her go.   A million dollars is a lot a damn money!  And there they are, they got my daughter!   Heck, you don't know!  You're just whistlin' Dixie here!  I'm sayin', the cops, they can advise us on this!  I'm sayin' call a professional!   Well -   Ah, dammit!   Well...  Why don't we...  He saws a finger under his nose.   ...  Stan, I'm thinkin' we should offer 'em half a million.   Dammit!   Dammit!  I wanna be a part a this thing!   It's my money, I'll deliver it - what do they care?   All the more reason!  I don't want you - with all due respect, Jerry - I don't want you mucking this up.   They want my money, they can deal with me.  Otherwise I'm goin' to a professional.  He points at a briefcase.   ...  There's a million dollars here!   Look, Jerry, you're not sellin' me a damn car.  It's my show here. That's that.   Okay ... here's your damn money, now where's my daughter?... Goddamn punk ... where's my damn daughter...  He pulls out a gun, cracks the barrel, peers in.   ...  You little punk.   I got your goddamn money, you little punk.  Now where's my daughter?   Where's my daughter?   Where's my damn daughter?  No Jean, no money!   No Jean, no money!   Unghh ... oh, geez...  He is on the pavement, clutching at his gut.  Snow swirls.   Oh, for Christ ... oh, geez...  Wade brings out his gun and fires at Carl's head, close by.",
        "Gustafson": "Jerry is sitting in his glassed-in salesman's cubicle just off the showroom floor.  On the other side of his desk sit an irate customer and his wife.    Jerry wanders through the service area where cars are being worked on.  He stops by an Indian in blue jeans who is looking at the underside of a car that sits on a hydraulic lift with a cage light hanging off its innards.      Jerry is on the sales floor, showing a customer a vehicle.    Jerry is staring up, mouth agape, at the underside of a car on a hydraulic lift.  Bewildered, he looks about, then asks a mechanic passing by, his voice raised over the din of the shop.    She sits in the lot, eating a breakfast sandwich."
    },
    "imdb_rating": "8.1",
    "description": "Jerry works in his father-in-law's car dealership and has gotten himself in financial problems. He tries various schemes to come up with money needed for a reason that is never really explained. It has to be assumed that his huge embezzlement of money from the dealership is about to be discovered by father-in-law. When all else falls through, plans he set in motion earlier for two men to kidnap his wife for ransom to be paid by her wealthy father (who doesn't seem to have the time of day for son-in-law). From the moment of the kidnapping, things go wrong and what was supposed to be a non-violent affair turns bloody with more blood added by the minute. Jerry is upset at the bloodshed, which turns loose a pregnant sheriff from Brainerd, MN who is tenacious in attempting to solve the three murders in her jurisdiction.—Anonymous",
    "name": "Fargo",
    "genres": [
        "Crime",
        "Thriller"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNDJiZDgyZjctYmRjMS00ZjdkLTkwMTEtNGU1NDg3NDQ0Yzk1XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}