{
    "filename": "Fast-Times-at-Ridgemont-High_script.txt",
    "imdb_id": "tt0083929",
    "imdb_url": "https://www.imdb.com/title/tt0083929",
    "characters": [
        "Linda Barrett",
        "Arnold",
        "Mike Damone",
        "Mark 'Rat' Ratner",
        "Ron Johnson",
        "Charles Jefferson",
        "Lisa",
        "Stacy Hamilton",
        "Mr. Vargas",
        "Jeff Spicoli",
        "Cindy",
        "Mr. Hand",
        "Brad Hamilton",
        "Dennis Taylor",
        "Pat Bernardo (as Blair Ashleigh)"
    ],
    "dialogues": {
        "Linda": "Did you see his cute little butt?  A third waitress enters.   We were!   No, be cool, that's Stacy's section.  Through the entrance, we see Stacy Hamilton. She is the fifteen-year-old trainee, sweet-looking with just the last traces of baby fat. She puts down a glass of water for Ron, spills some and mops it up.   How's it going.   Don't you like him?   Come on, Stacy, it's your section and your man.   Just take his order, look him in the eye and if he says anything remotely funny, laugh a lot.  She fluffs up Stacy's hair and gently shoves her towards the door. Stacy reluctantly exits.    Should we buy a frame for that?   Listen, Stace, you want to know about guys? I'll tell you. They're mostly chicken. Before I met Doug I chased after every guy I thought was cute. I thought if I gave out a vibe they'd get the message and call me up. Well, guess what? They don't call.   I called them. If I was sitting next to a guy and I wanted to sit closer, I'd sit closer. If I wanted to kiss him, I'd just do it. You want Ron Johnson? Grab him.   Face it. With some guys you have to make the first move. A lot of guys are just... wussies.   Stacy, what are you waiting for? You're fifteen. I did it when I was thirteen. It's no huge thing. It's just sex. If you don't, one of the other girls will.   If I didn't have a fiance in Chicago, I'd go for it.  A young Girl runs and catches up with Linda and Stacy.   Yes.   Okay, are you over sixteen?  The Girl nods.   All right, what you want to do is go to the Free Clinic and tell the doctor that you have sex regularly - several times a week -- and that you need Nornel One Plus Fifty's.   Not if you're over sixteen.   And don't let them talk you into a diaphragm either.  The Girl thanks Linda again. Linda and Stacy get to the back exit of the mall and Linda uses a key to open the door.   Believe it.  They exit the mall, into the night.    as they walk onto lunch court. They take a seat on the outskirts of the area and watch all the students crowding onto the eating area.   I hear some surfer pulled a knife on Mr. Hand this morning.   God. People exaggerate so much at this school.  The school couple, Cindy and Gregg walk by.   Hi, you guys. This is Stacy. Stacy, this is Gregg Adams and Cindy Carr.   If there's one thing that never changes... it's a cheerleader.  Stacy turns to see a girl with short, black hair passing by, wearing tight black spandex pants, and dark lipstick.   I know.  They watch her pass.   Actually, there are three girls at Ridgemont who have cultivated the Pat Benatar look.  Linda gestures out on lunch court.   None of them talk to each other.  Linda looks at them with bemusement but Stacy is wondering.   Oh, give me a break, Stacy. You're much prettier than them.  They sit and eat their lunches. Linda has her perennial diet lunch of yogurt and raw vegetables.   What do you mean 'better in bed.' You either do it or you don't.   What variables?   What's the big deal?   There's nothing to it.  She takes out a carrot stick and eases it down her throat. Stacv tries one but chokes.   You just have to practice a little first.  Relax these muscles. Think of your throat as an open tunnel.  The girls try sliding the carrot sticks down their throats without gagging.   Just kidding. About 10cc.   Was it great?   You'll always remember your first time.   So tell me, do you like Ron? Is it serious?   Hey! That's my line!  They both laugh and walk down the hall.   Don't you dare, you'll never hear from him again.   Doug sees beyond that stuff to what the person inside is like. That's why I'm marrying him.   Boy I am so glad to be through with all these games.  They enter the mall.   You've got to get used to working Christmas. People are always screaming and yelling... then they get home and they're all Christmasy.   I guess Ron hasn't called yet.   Stacy, it doesn't look good for the relationship.  Stacy continues making her ice cream, slapping the scoops onto the stainless steel dish.   Stacy. What does it matter? He's a stereo salesman. You want to marry him? You want to have kids with him? You want this guy to come home, fifty years old, and he's still got that little Pacific Stereo badge on? Come on.   Stacy. How many times do I have to tell you? You are really going to be beautiful... someday.   Hey -- Ron Johnson? It's his loss.  We follow Stacy, as she walks into the dining room to serve the sundae.    sitting together in the class. They are oblivious, lost in conversation.   Oh, come on. What is he? Fifteen?   Just watch out if he pulls up in a van, and then puts on a Led Zeppelin tape.   I sent a letter to Doug today. I'll be so glad when he gets out here.   Why don't you put your mother's secret book back?  Linda continues regally applying lotion.    Okay, penis, that's one, balls...   You're right. Probably penis, mouth and neck.   Climax together.   No. But it's a nice idea.   Well... they obviously don't know about Doug.  They laugh. Linda resumes applying the lotion. Stacy continues reading the book. A couple of beats pass.   I don't know. Thirty to forty minutes.   He works for the airline. He'll be out here. You'll meet him.  Stacy looks at Linda, almost disbelieving.    He's no high school boy.  There is a noise by the side fence leading into the Hamiltons' backyard. It is Mark Ratner and Mike Damone. They are already wearing swimsuits.   I think they're both virgins.  Stacy smiles, gets up and goes over to the fence.   No.   Hi, Brad.   God, he hardly even talks anymore.    who is now sunning herself by the side of the pool. She rubs her legs against each other, slowly, enjoying the hot afternoon.    who smiles at Damone and flips back into the pool with a splash. Damone steals a look down at his swimsuit. He's popped a big one.   Go ahead.   Stacy! I've got water in my ears. Do you have any Q-Tips?   Hi, Brad.  You know how cute I always thought you were. I think you're so sexy. Will you come to me?   Hey, Brad! Do you have any Q-Ti...  The daydream evaporates and we see real life again with an...    in the doorway of Brad's bathroom as she watches the sight before her.   Sorry. I didn't know anybody was in here.  Linda turns and goes immediately, as if she wants to forget what she saw as quickly as possible. She closes the door behind her.    It is night, and Linda and Stacy are watching Fantasy Island.   Hello.  Linda obviously is disappointed when she hears a female voice.   Yeah... you're kidding... What did he say... What did you say... How much did it cost? Look, tell him he can have a relationship with you or a 'more open' relationship with someone else... Listen, Debbie, can I call you later. I'm waiting for Doug to call.  She plops back on the couch with Stacy.   I'll bet he forgets to call again.  She notices that Stacy is crying over the TV show.   God, Stacy, it's not that sad. It's just David Soul and Ricardo Montalban.   You have been acting very strange the last few weeks.   What do you think it is?   It couldn't be.   Of course it was Damone. If it was Ron Johnson, you'd be out to here!   But it costs money to have an abortion. Even at the Free Clinic. You tell Damone to pay for it. It's the least he can do. It's the guy's responsibility too.  She puts the TV back on and they watch.   What?   You're right. I didn't tell you that.    Stacy is in Linda's room, sitting on her bed. Her eyes are red and moist from crying. Linda listens to her story.   That little prick.   That little prick.   There goes your stereo for another year. Mike Damone is a no-brain little prick. I'm not letting him get away with this.   Stacy, he's not a guy.  He's a little prick!  Stacy lies back on the bed.   Come on. There's lots of men around here. Keep your eyes open.   What do you want?   Romance in Ridgemont? We don't even get cable TV.   He's not coming.   He says he's got to stay in Chicago.  He says I should visit him sometimes.   Yeah, like maybe never.   Well I might go to Dartmouth.   I didn't tell anyone I applied cause I never thought I'd make it.   There's a world of guys out there. I just wish I didn't have to date any of them.",
        "Barrett": "Hello?   She went off to the beach. She'll be back later, though.",
        "Arnold": "Brad, can I talk to you a minute?   Brad, I really fuckin' hate McDonald's, man. Ever since they started in with the chicken, everything went downhill.   Oh, man, if you could swing something there, I'd do anything for you. I want to work with you guys.   All right!!  Brad notices Stacy and nods with complete inner cool.   You'll go. It's part of the final.   The bodies are dissected, Mike, and Mr. Vargas pulls out parts of the dead body and holds them up. Okay?   Brad! I know you're on your break, but would you cover me on register three?  Brad nods, exits:",
        "Mike": "walking the mall.    in another part of the dance, by the Junior class sponsored food counter. Damone is standing, talking to several girls, gesturing and being Damone, Mr. Attitude.",
        "Damone": "You should work for yourself.  Two Junior High Kids spot Damone, walk up to him.   What can I do for you, gentlemen?   I could be.   Twenty bucks apiece.   So don't buy 'em.   Scalper? You call me a scalper? I perform a service, my friends. The service costs money. Now do you want the tickets or not?  The Kids look at each other.   These are my special back-to-school prices.   See that Mustang? U.C.L.A. gave Charles Jefferson that car when he was a sophomore.  The underclassmen are impressed. They watch as Jefferson opens his car door and stands to his full height, over six-foot tall. He opens his trunk and pulls out no books, just a football duffel bag. He slowly walks by Damone, Rat and the underclassmen.   How ya doing! That car looks great, Charles!  Jefferson gives Damone a death glare.   Shit, that's my man.    Damone expertly fills two glasses three-quarters full of Kahlua, then adds a few drops of milk. Music is playing on a nearby speaker. Damone hands The Rat a drink and checks himself out in his mirror.   See that moustache coming in, Rat?  There is only a hint of peach fuzz, but he grooms it anyway.   See? You can almost press it out.  Damone turns around. His friend is preoccupied.   You... are a wuss. Part wimp. Part pussy.    It's definitely your mama.   All right... where did you see her?   Did you get her number?   Did you get her name?   It's never too soon! Girls decide how far to let you go in the first five minutes.    I would. Yeah.   I can see it all now. This is going to be just like the girl you fell in love with at Fotomat this summer. You bought forty bucks of fuckin' film and you never even talked to her.   Okay. Okay.  Here's what you do.  Damone gets up, moves to the door.   You start from the second you walk into biology. Don't just walk... move across the room.  He saunters over to the chair.   Don't talk to her. Let her know. Use your face. Use your body. Use everything. This is what I do. I just sent out the vibe and I have personally found that... girls do respond. Something happens.   That's the idea, Rat. That's The Attitude.   The business is changing, Rat. I'll tell you, these kids today... they don't even listen to Aerosmith.   There used to be three or four of those guys. Now we see 'em every time we come to the mall.  Damone is approached by a couple of young ticket Customers.   No Cult. I ate twenty-four pairs of Blue Oyster Cult tickets last time around. I was this close to working at 7-11. No Cult.  Suddenly we see all ticket business stop. Damone and his customers see someone menacingly coming directly for them. The small crowd parts as Charles Jefferson, football duffel bag in hand, walks up. With him is a thick, tough, miniature version of himself. This is Little Charles. They both stop in front of Damone.    I'm really not sure. I haven't heard anything yet, but I'll let you know the second there is the slightest news, sir.   Excellent. So that will be two tickets... All right. Fine, sir.  Jefferson and L.C. push past the customers.    Shit, he's my man. He knows where to come for tickets.  Damone turns to The Rat.   Well, Rat. Are you ready for the moment of truth?  The Rat adjusts his jacket, and nods.   Hey, Rat.   Ace the jacket.  The Rat considers the suggestion, gets rid of the jacket. They continue towards Swenson's.    walking the mall.   Check it out, Rat. The Surf Nazis... out for a Sunday stroll.  Damone and The Rat walk on. The Rat is barely interested. He appears deep in thought.   No problem, Rat. What you need is my special Five Point Plan.  As he talks, Damone passes a Country Farms shop. He plucks a free sample of cheese and sausage.   What do you mean? Men have died trying to obtain this information. I will give it to you for free.  The Rat and Damone continue on.   All right. Pay attention.  The Rat nods, always the student, as they pass a Wherehouse Record store. Damone stops right in front of a seductively posed life-sized cardboard stand-up of Debbie Harry, the alluring rock singer.  Damone begins his speech.   First of all, Rat... never let on how much you like a girl.  Damone turns to the cardboard cutout of Debbie Harry to demonstrate.    Oh. Hi.  ) Two. Always call the shots.  He turns to Debbie Harry, who looks on with an inviting cardboard smile.   Kiss me.  Three. Act like wherever you are, that's the place to be. (to Debbie Harry; debonair) ) Isn't this great?  Four. When ordering food, find out what she wants and then order for both of you... it's a classy move. (to Debbie Harry; Cary Grant And the lady will have...  Five. And this is most important. When you get down to making out, whenever possible, put on the first side of Led Zeppelin IV. (to Debbie Harry; seductive Why don't you put this tape on? It sounds great in the back of my van... why don't we listen from there?   And that is how you talk to a girl, Rat. Voila. You can't miss.   You wuss. It's no problem. One person says something to the other and that's how it starts...  Standing there in the front of the Wherehouse, The Rat nods his head and smiles. He's finally beginning to understand, and we...    He is sitting in a chair, leaning onto the back two legs, watching television.   Yo.   Mark. What happened to your date?   Did you go home and get it?    I'm really pretty busy...    as we see the flickering images of Leave It To Beaver.   You owe me for this one.   Hey, Mark. Is that you?   I come for the seafood. It's great! Hey... you know what, Mark? I found your wallet the other day. You want it back?   Well, I've gotta be running.   Nice to meet you, Stacy.   Hey! We came over to help you with Math homework!   Well, that's exactly why I brought some Wisk for the jacuzzi.   Hey, Linda! I'll judge your dive. I'm a champion diver myself.  Brad arrives home by the side gate and slams it behind him. He is home from a bad day at work. He walks out onto the patio and stands with his hands on his hips. For the first time, our former campus hero looks absurd. He is still in his uniform from Captain Kidd Fish and Chips -- it is a blue and white striped Pirates of the Caribbean outfit, complete with black plastic sword at the side, and a ridiculously large Ponce de Leon-esque hat. Brad carries the hat under his arm.   Poor guy.    talking while the others are at the other end of the pool.    as they talk.  Underneath the water, her leg accidentally knocks against his. Then he feels her continue. Damone feels Stacy's cool hand on his inner thigh. Moving upwards, stopping just short of the bulge in his trunks.    as it loosens and quivers just the slightest bit. This is uncharted territory, even for Mr. Attitude.    and we know he can't get out of the water yet.   No. I don't think so. Not right now.   Get a ride with somebody.   What a guy.  Damone turns to her after a moment, all Attitude.   You know Mark Ratner really likes you. You like him?   Do you have any ice tea?   I don't know.   I know what I look like.  Stacy places a glass of ice tea in front of him. They are all alone in the house.   Well...   This is great ice tea!    He continues staring straight ahead.   I don't know. It's getting pretty late...  She locks the door to the changing room and begins to walk towards Mike Damone.   Come on...  He could feel his leg starting to shake the slightest bit.   Listen. I feel pretty strange here. Because Mark really likes you, and he's my friend.   You're a really good kisser.    No. Are you crazy?  It is clear that this is as far as Mr. Attitude has ever gotten with a girl. Stacy takes the initiative, rubbing her hands through his hair, rubbing his sides, kissing his neck, then pulling away.   You first.    hopping on one leg, pulling first out of his pants, then his jockey underwear. Bashfully, he goes to sit next to Stacy on the couch. They begin to kiss, and it quickly escalates into heavy petting. Stacy pulls away.   Let's continue.  Stacy leans back and pulls him on top of her. He enters her and begins pumping so hard, so fast, that he doesn't notice he's banging the sofa into the wall of the changing room.  But just as quickly as Damone starts, he stops.   What? Are you all right?   I'm sorry. I'm really sorry.  He has a strange look on his face.   I think I came. Didn't you feel it?    as we read the confusion on his face. He is embarrassed, a little confused... mostly he just wants to be alone.   I've got to get home. I've really got to go, Stacy.   Oh. Hi.   Look, I'm kind of in a hurry.   Hello.  He pulls away, leaving a bewildered Stacy standing by her locker. She grabs some books and hurries in the other direction.   What's going on?   What? Now?  He clicks off the time on a runner, and then turns to face her.   Why don't you call me up tonight?   How do you know it's mine? We only did it once.    as he realizes she is sincere, and he truly begins to panic.   You made me do it! You locked the door. You made me do it! You wanted it more than me!   All right, I take it back.    He hugs his arms tighter across his chest, and decides to try a more mature tact.   There's only one thing we can do. We've got to get rid of it. We've got to get an abortion.   Yeah. My brother Art got his girlfriend one once.   Doesn't sound free to me.  So you want me to pay for it?   Seventy-five dollars, and a ride. Okay.  Stacy stands there, hands folded, nodding.    He is working at his desk, counting through a wad of money.    The front door to the Damone house opens, and out walks Mike Damone carrying some books. He looks troubled, burdened, and stares down at the walkway as he moves towards his car. He walks around, starts to pen the car door, then he sees it. There, in white spray paint across the driver's door, is the message: PRICK.   Shhhhhhhhhit.  He looks both ways, and starts back towards the house.    Mike Damone travels down Ridgemont Drive, making the turn into the school parking lot. There is a large cardboard panel taped on the side of his car.    He arrives at his locker, where, in white spray paint, there is another message: LITTLE PRICK. Several girls walk by, they laugh knowingly.   Hi... girls.  More students pass, looking strangely at the young man pinned against his own locker.   Let me tell you something, Rat. Sometimes girls just go haywire. It was a month ago, I've been trying to think of a way to tell you ever since. We started messing around and...  ... something happened. It's all over with. It's no big deal. I never called her again.  The Rat says nothing.   If you ask me, she's pretty aggressive. You understand what I'm saying?   She wasn't really your girlfriend anyway.   Jesus. I'm sorry.   Fine. Get lost.  Damone starts to push past him, but The Rat shoves his shoulder hard.   All right, Rat. You want to do something about it?  Damone begins the classic high school fighting ritual. He throws his books down. He takes a step back. He goes into a crouch. He gestures towards himself. Then Damone says the universally recognized high school fighting words.   Well come on.  The Rat shows no fear. As other kids begin to crowd around the two boys, Rat throws his own books down. He takes a step back, goes into the crouch. He gestures toward himself.   No. You come on, you wuss.  Assistant Coach Mr. Sexton comes running out of the boy's locker room, and steps in front of the two boys.   All right. All right. I just cleaned B-8. Give me a break.    in another part of the dance, by the Junior class sponsored food counter. Damone is standing, talking to several girls, gesturing and being Damone, Mr. Attitude.   Sign my annual, honey.  The girls look at each other, laugh. They walk away.   You're crazy. Those girls love me.   She wants it, Rat.  The Rat snickers, shakes his head.   I saw you. You had pure Attitude.  The Rat turns to look at his friend.   Whatever you say, Rat.  They take off together, blending into the crowd of kids walking the mall.   Sensitive -- what is that?   So what makes you so sensitive?   What do you read? What's the last book you read?    Yeah, well, I saw the movie. That must mean I'm sensitive too.",
        "Ron": "So you working hard or hardly working?  Stacy thinks it over, decides it's a joke and laughs . Ron looks at her soulfully.   You look like you could still be in high school.   How about your phone number?  Stacy smiles nervously.    Ron sits behind the wheel, humming casually along to the music on his car stereo.  Ron has on a light-brown leather jacket. He looks like a contestant for \"The Dating Game.\"   No problem.  He speeds off, turning up the radio to sing along.   'The Cuer-vo Gold, the fi-ine Columbian.'  You look nice tonight.   Where do you feel like going?   How about the point?    All right, the point it is.  We see Stacy's anxious face, as the car speeds up Ridgemont Drive, with music.   Thanks. Thanks a lot.  Silence. They look at each other, look away.   It's very warm out tonight.   Are you really nineteen?   I think I better take you home.   No. I mean back to your home.  But they make no moves in any direction. They continue making out. Ron begins unbuttoning her blouse and massaging Stacy's breasts. A moment later, he tugs at her pants. Awkwardly, she starts to help him. He tilts her backward onto the concrete dugout bench. They kiss feverishly, her hand pulling off her shoes, then her pants. Ron goes to work.    Is this your first time?      as Mike Damone finally walks in. Damone looks over the diners, then feigns great surprise when he sees The Rat.",
        "Johnson": "",
        "Charles": "who are seated in this class.",
        "Jefferson": "Don't... fuck... with... it.  He moves on. Damone resumes selling tickets.    When is Earth, Wind and Fire coming?   I'm taking my little brother.    who are seated in this class.",
        "Lisa": "Were those flowers really for me, Brad?   How much did they cost?   What's there to do at the Point?  Brad shifts his weight, tries to find the right words.   Brad. I don't want to have to use sex as a tool.   I don't want to talk about it here, Brad.  Brad prepares to respond. He squints his eyes, prepares for a truly sizzling comeback, when Dennis Taylor, short and prematurely balding assistant manager of Carl's Jr., comes bustling out of his back office. He quickly surveys the situation in the kitchen.    sitting nearby. We hear them over the drone of the assembly.   If you'd apologize I think Dennis would take you back.    Look, Brad, I've been trying to think of a way to tell you this. We're almost out of high school, this is our last year. I think we owe it to ourselves to be free, and meet some new people. Then, if we get back together, we'll know it's the right thing.   But I still want to be friends.   I saw your picture in the paper. You had the greatest look on your face!   Will you sign my annual, Brad?  Brad smiles, nods. He signs, and gives her his. We then see Brad's three Buddies from Carl's Jr. come up, pat him on the back and grab his shoulder. Brad studies them warily.",
        "Stacy": "Do you think that guy's cute?   Does anyone else want to take his table?   Yeah, but I fucked up. You can take it. Really.   What should I do?   I know, everyone says that.  He stares at her and she stares back uncomfortably.   What can I get for you tonight.   He gave me his card.  'Ron Johnson, Audio Consultant.'   Come on, Linda, I haven't had a boyfriend all summer. You promised when I started working at the mall that my life would change... Do you think he'll call this week?   So what did you do?   I can't do that.  They pass a janitor cleaning graffiti that says: LINCOLN SURF NAZIS and MAGGOT LUST FOR THE DUST.   Really?    He was hot, wasn't he?   I can't believe I start high school tomorrow.   Hi, Brad.   Hi... Where's Lisa?   U.S. History. Mr. Hand.    What's wrong with Mr. Hand?    as they walk onto lunch court. They take a seat on the outskirts of the area and watch all the students crowding onto the eating area.   No way! He just called him a dick.   Linda. That girl looks just like Pat Benatar.   Do you think guys find that attractive?   Yeah but they look more sophisticated. You'd probably think they'd be better in bed.   No there are variables that, like, I might not be good at.    Like, you know, giving blow jobs.   Well I never did it.   What happens... don't laugh at me, but when a guy has an orgasm... you know, like, how much comes out.  Stacy stops practicing and looks horrified. Linda laughs.    Oh! That's where that group got its name from.  They continue practicing as the boys look on. Stacy manages to get almost a whole carrot down her throat to Linda's amazement.  The group of boys break out in applause.  Stacy looks very embarrassed.    We see Stacy's room, a young girl's room with posters and frilly pillows. Stacy is in bed, and her Mother is just leaving the room.   Good night, Mom.  Her Mother shuts off the light, exits. Stacy pulls back the covers. She is fully dressed.    We see the window to Stacy's room slide slowly open, and watch her slip outside. She hikes down a drainage pipe to the street.    Thanks for picking me up.   Thanks. So do you.   I don't know. Wherever you want.    The point sounds fine.   That's a nice shirt.   It is. It's very warm. I wonder how long it will last?  Ron leans over and kisses Stacy lightly on the cheek. Stacy sits quietly for a moment, thinking, was that the first move? Then she lunges at Ron and kisses him square on the mouth. At first surprised, Ron then holds her there and kisses her in return. After a time, he breaks away.   Yes... I am really nineteen.  They continue making out.   What about those other guys you live with?   Yes.    as she feels a man enter her for the first time, we see the graffiti above her: Surf Nazis Lincoln was here --  Sieg Heil Led Zeppelin Dan y Roberto   It was okay.   It was nice.   Come on, Linda. It's just sex.   Why can't you do it?   Your friends use the pool too.   Don't strain yourself.  Stacy bristles, and heads inside the front door.   Brad! Have Mom or Dad seen this?   Brad, what would you say if I asked you to just put these flowers in the trunk of the Cruising Vessel and get rid of them at work?   I'll explain everything later.  Brad nods, as Stacy pushes the flowers into his arms.   Thanks for getting rid of those flowers.   It's just some guy I met at Swenson's. You don't know him.   Is everything okay at work?   You're going to break up with Lisa, aren't you?   Why? Because she won't sleep with you?   I'm just guessing.   Maybe you just need to give her some time. She's so nice, Brad. Everybody loves Lisa.   Hey, Brad. Are you still a virgin?   I don't know. I was just curious.   You are a virgin!   But your face did!  They laugh. Then Brad turns serious.   Maybe yes. Maybe no.   There... There's his car. I know he's at work tonight. He hasn't come into Swenson's since he called my house. My mother told him I was still at high school, after I told him I was nineteen. I guess I should tell him I'm fifteen.   Does Doug care that you're seventeen?   If he ever calls again I'll say I'm eighteen.   Yes, sir.   I think Christmas brings out the worst in people.   Not since November.  Linda nods her head, always the coach.    Don't you think it meant anything to him. Even if I am fifteen?   I should quit this job. I'm going to get so fat working here... nobody will ever take me out.   Thanks a lot.  Linda punches Stacy lightly on the shoulder.   Hi. May I help you?  The Rat feels the beginnings of cold panic, but barges through nonetheless.    We keep them.   We keep them, in case the people come back.  She reaches under the counter and pulls out a cardboard box with some rumbled jackets and other items.   Here they are. You can look through it, if you want.  The Rat chuckles to himself, struggling with The Attitude.   What's your other question?   Do you have a pen? This one's out of ink.    sitting together in the class. They are oblivious, lost in conversation.   What do you think of that guy who works at the theatre? You know, Mark Ratner.   Sixteen.  Linda looks nauseous.   Thanks for coming to get me.   This is a nice car.   Do you have Mrs. George for English?   Yeah. She is pretty good.   I've heard that, too.  The Rat finds a parking spot near the back of the lot, grateful that the long silence is over. He walks with Stacy to the front of The Atlantis.   I think I'll have the Seafood Salad Special.   Are you all right?   Not at all.  Just as The Rat is about to get up, the Waitress approaches the table.    The Rat and Stacy have finished the meal, and desert.    ) Sure. I'll... have another Coke.    looking strangely at the proceedings.   Nice to meet you.  Damone leaves. The Rat takes a few quick gulps of Coke, and gets up to pay the bill. As he moves out of camera range, we see the strange look on the faces of waitresses and diners.   Me, too. I'm real sorry someone broke in and stole your tape deck.  The Rat nods glumly.   Do you want to come inside?   No, they're away for the weekend. Brad and I are watching the house.   I don't know. Probably out. Want something to drink?   Well, I'm going to change real quick. I hope you don't mind.   Will you unzip me?   Thanks!  She walks down the hall to her room, easing out of her dress as she walks. She leaves the door to her room open.   You can come in, if you want!    Stacy stands there, looking gorgeous in an almost seethrough white robe. The Rat pretends not to notice.   Thanks. So...  What do you want to do?   Do you want to see some pictures? I kept a lot of scrapbooks and pictures and stuff from junior high. How stupid, right?   This is me in the eighth grade. Did you have Mr. Deegan?   Do you really have to go?   I guess it is getting late, Mark.  She shrugs him off, walks him to the door.    You really ought to look at this, Linda. There's a drawing on every page... and all these quizzes. It's like school.   Listen to this... 'What are your mate's three most erogenous zones?'   Wouldn't penis and balls be the same category?   All right! Here's another one. 'The most satisfactory lovemaking occurs when your mate climaxes first, you climax first, you and your mate climax together?'   Does that ever happen?   Listen to this ... it says 'Most women derive pleasure from sex, but they don't have real orgasms.'  Linda stops applying lotion, considers that thought.   How long does Doug take?    What's Doug do in Chicago?   Oh, really?   What do you think?   I didn't ask for any help. Did you, Linda?   O-kay, you guys can come swimming. But you have to leave as soon as my Mom gets home. Okay?   It's just Linda. And Mark from school.  Brad ignores the underclassmen, and notices Linda on the board in her maroon bikini. He smiles.   I know. He hates to have to wear uniforms.    talking while the others are at the other end of the pool.    as they talk.  Underneath the water, her leg accidentally knocks against his. Then he feels her continue. Damone feels Stacy's cool hand on his inner thigh. Moving upwards, stopping just short of the bulge in his trunks.   God, I don't think so. Better look in the house.  Linda towels off and heads back inside the Hamilton house. She knows how to walk.   I can't wait until I can drive next year. I walk every day. It's such a drag.   Sometimes I get a ride with my brother. But he usually works in the mornings, and then drives to school himself.   Mark is a really nice boy...  Stacy walks along, then stops and looks at Damone.   But I think I like you.  They turn the corner.   Do you want to come in for a second?  The Attitude starts to weaken. After a long pause, Damone responds.   Sure. Come on in.  Stacy unlocks her front door, they go inside.   I guess the annuals are coming in pretty soon. Are you going to get one?   Aren't you curious to see how your class picture turned out?   Do you want to take a quick swim?   Brad probably has some trunks you can borrow... I'm going to my room to change!  Damone stares straight ahead. She's going to her room to change. Stacy scoots down the hall toward her bedroom.    In the middle of changing, she has caught her own reflection in the mirror. She pauses a moment, looking at the young girl looking back.    You don't have to shout! You can come back here to my room!  Damone doesn't move. He pretends he doesn't hear. A moment later, Stacy comes bounding back down the hall in her green bikini. She grabs Damone by the arm.   Come with me! I know there's a suit in the changing room!  She pulls him away.   Pick a suit.   Are you really a virgin?   It's okay if it's your first time.  She gives him a kiss.   He's my friend, too.  She gives him another kiss. He kisses her in return. Standing there, feeling Stacy in her bikini, feeling her kiss him, Damone also felt some of his reservations slip away.   So are you.  Are you shaking?    Why don't you take off your clothes, Mike?   How about both of us at the same time?  Damone nods, and watches as Stacy unhooks her top and steps out of her bikini bottom. She stands naked in the shadows of the afternoon sun. She sits down naked on a red changing room couch, and gathers her legs up to her chest. She watches as Damone struggles with his clothes.   I want you to know that it's your final decision if we should continue or not.    Hey, Mike?   I think we're making a lot of noise.   What's wrong?   I guess I did.  They lay there, Damone still on top of her on the red couch.    as she looks up at him. She gives him a kiss. Damone gets up puts his pants and shirt on. He leaves the changing room.   Where's Mike today?   What's April 16th?   John Bonham?   Oh. I see.  The bell rings, and Mr. Vargas enters the room with his Sanka cup.   Hi Mike!  Damone turns to see her, is thoroughly unimpressed.   I didn't see you this morning.   I'm in a hurry too. I just thought I could say hi to you.    who goes running out of the \"Cold Room\", holding her mouth. The Rat runs after her.   I made a fool of myself.   What about the notes?   I don't know, I'm just so depressed. Everything is just so... depressing.  Linda shuts off the television.   I don't know... I just don't feel right.  Linda sits down next to Stacy on the bed.   What do you think it is?   It could be. I had a pregnancy test at the clinic. I'll find out Monday. I guess it was Damone.   I'm not going to tell him. He's an asshole. I hate him.   You know, there's one thing you didn't tell me about guys.   You didn't tell me that they can be so nice, so great... but then you sleep with them and they start acting like they're five years old.   Mike, there's something that's been on my mind and I have to tell you about it.   Mike. I want you to know that I'm pregnant.    as she looks down. They are words she never thought she would be speaking.   I know it's yours.    She does not flinch.   Take that back.   We've got to get an abortion?   It's already planned, Mike. It's going to cost $150 at the Free Clinic.   Half. Okay?  Seventy-five dollars. And a ride to the clinic.   Hello... is Mike there?   Hi, Mrs. Barrett. Is Linda there?   Okay. Thanks.  She looks at the clock again, then hears a noise in the driveway.   Brad! Hey, wait a second!  She runs out.   Yeah. This is it. I have some shopping to do.   Thanks a lot, Brad. I really appreciate it.  She gets out of the car.   This is going to hurt, isn't it?   Does it hurt more to have a baby?  The Doctor pauses and considers her question.   Uh, my boyfriend said held be waiting downstairs.  The Nurse studies her, decides she's telling the truth and allows her to leave.   Brad!  He puts an arm around her and leads her toward his waiting car.   Brad. Please don't tell Mom and Dad...  He helps her into the cruising vessel. He starts up the car and drives off.   No.   I really thought he would show up. I waited... and waited... and waited...   Then I called his house, and his mother told me he was in the garage helping his father.   I paid for it and everything.   Don't do anything, Linda. I'd rather just forget about it. I don't even like the guy.   Another summer of working at Swenson's.   You know, Linda. I've finally figured it out. It's not sex I want. Anyone can have sex.   I want romance.   Mike! You have a mess on C-9!   Get going.  The two girls smile, go back to their posts.    surveying the growing mob of annual-crazed students. From behind her comes Linda Barrett in a low-cut black dress.   Where's Doug?   Not coming? What happened?   Sometime?   But what are you going to do?   Dartmouth?!   I can't believe it! But what about Doug?   Hey -- Doug Stallworth? It's his loss.   Hey Mark! Turn around!  Ratner turns around, affects total and complete cool. He waves across the mall to her.   Come over here!  He looks back at his post at the theatre, decides it's okay to step away. He walks across the mall.   Hi, Mark.   I'm fine. Mark, I'm so glad you came over here because I want you to know something. I just thought I would tell you that I really enjoyed getting to know you this year.  The Rat maintains The Attitude.   I know everybody says it, but I really mean it.  The Rat looks at her from the corner of his eyes.   Yeah. I want you to have this picture, so you won't forget what I look like. And so you'll remember to call me over the summer.  She withdraws a picture from her pocket, hands it to The Rat.   I'd like that.  She gives him a kiss on the mouth, gets up and walks away. The Rat sits there, smiling at the way things sometimes turn out. He slips the picture into his pocket, a satisfied young man.",
        "Hamilton": "Stacy arrives home. The Hamilton home has that anonymous prepackaged tract look, like many others in this lower-middle class neighborhood.  Brad washes his car in the driveway and listens to the car radio.    The furniture in the Hamilton living room looks like it was gleaned for a sale at Pic 'N Save. Through the living room, one can see a very small, kidney-shaped pool.  Stacy checks an erasable telephone message sheet near the refrigerator. There are two names on it: BRAD/STACY. Brad's side is filled with messages. Stacy's is empty.  She notices a summer bouquet floral arrangement. Stacy reads the attached note. It reads: \"Memories of You, Ron Johnson.\" She quickly gathers it up and carries it back outside. She fans the door several times to dispel the odor.      We see the Hamilton's cul-de-sac home. All the lights are off in the house at this hour. Except for Brad's room.    who are seated in this class.    They walk in the front door. The Rat stands uncomfortably in the doorway to the living room.    We see The Rat's forlorn face as he trudges towards his car. He stops. He takes a breath -- it wasn't that late, he really didn't want to leave. The Rat turns and begins walking back up the Hamilton steps. Just as he does so, Stacy's bedroom light clicks off. It was too late. He kicks at his car.    who is again sitting alone in the bleachers. Watching. Several old lunch court friends pass by, on their way to the concession area.     Mike Damone yells \"banzai!\" and dives into the small pool. At one end of the pool is the jacuzzi, which is separated by a tile wall. Damone has already poured the Wisk into the jacuzzi, and the detergent has created a huge bubble bath effect. Damone surfaces and flips into the jacuzzi.  Stacy, looking great in a green bikini, sits kicking her legs by the side of the pool. Linda stands on the board. She is poised to dive. The Rat treads water and stares at both girls. Inside the Hamilton living room, the family stereo plays the music of Deep Purple's \"Woman From Tokyo\".    It features Linda Barrett, just as she stood on the diving board a moment ago. She is gorgeous. Her breasts seem even bigger than usual. Her nipples are hard, poking through the film maroon string bikini. Water rolls slowly down her cheeks, into the corners of her mouth. Her lips are parted slightly. Her eyes are filled with desire as she says...    They have arrived at Stacy's house. There are no cars parked out front. No one is home.    Damone stands in the white linoleum Hamilton kitchen. Stacy opens the refrigerator door.    who goes running out of the \"Cold Room\", holding her mouth. The Rat runs after her.    Stacy is on the phone, calling Damone. We see the phone messages sheet that lists two calls for Stacy, and none for Brad. The line rings four times, then it's answered.    He stands, hands on hips, just outside the door.",
        "Vargas": "Good day, everyone! I just switched to Sanka. I'm running a little slow today, so have a heart.   Today we're going to explore how this hospital works to preserve human life. We'll be visiting every floor, every level where these fine doctors and nurses take care of us, in life... and in death.   Over thirty children are delivered here each day...  The class moves on.   This is part of your third quarter exam, and I'd advise you to take careful notes on what we're about to see.   May I just ask you one last time to conduct yourselves with the utmost maturity...  The kids are beginning to get very nervous now as they are led down the hall to the \"Cold Room.\" The door to the \"Cold Room\" has only one sign on it. It reads: CADAVERS -- MEDICAL EXAMINATION ONLY. Mr. Vargas opens the door, and the class seems to gasp.   As you know, all the bodies in this room are recently deceased human bio-structures.  A student raises his hand.   Yes, Randy?   Most of them were derelicts, Randy. They sold the right for medical examination of their bodies for money. Something like thirty dollars, I believe. Isn't that right, Doctor Miller?   Now this gentleman here is named Arthur. Arthur died from heart failure last week and we are fortunate enough to view his body in its pristine state.  Mr. Vargas suddenly pulls the white sheet aside and we see the body of Arthur. The students' eyes widen. Some gasp. Others cover their mouths. Others begin furious notes. Nobody speaks. The body of Arthur is smallish and withered. It is orange, flaky, and not quite real looking. A deep cut has been made in Arthur's chest.  Mr. Vargas bends Arthur upright for a better student view. He gestures to the deep cut made in Arthur's chest.  The tension mounts.   This incision allows us to pull aside the skin covering of the chest cavity and really observe the human organs as they exist in their natural state.   I want all of you to take a look at the chest cavity for just a moment.  Mr. Vargas grabs the two sides of Arthur's chest cavity covering, and rips it open.   Here we have the human lungs and heart, which you can see is actually located in the center of your chest.  With a squish, Mr. Vargas reaches inside Arthur and pulls out the human heart for display. The class stands in silent shock. Only one comment escapes from any of them.",
        "Jeff": "Don't... fuck... with... it.  He moves on. Damone resumes selling tickets.    When is Earth, Wind and Fire coming?   I'm taking my little brother.    who is asleep in the bleachers.    who are seated in this class.    bright and clear-eyed, sitting in the front row. His hands are clasped in front of him on the desk. His textbook is open to the proper page.  Mr. Hand is suspicious, but continues with class.    who turns to Stacy.    Jeff Spicoli sits in his room, and it is his castle. Clothes lie in disarray on the floor. A huge half-waxed surfboard is propped against the window. We see Spicoli dressed in a too large white short-sleeved shirt, attempting to tie his father's fat paisley tie. He stops to take a hit from his bong, all the while talking on the phone. The music of Lynyrd Skynyrd's \"Freebird\" plays on the radio.    sprawled out in the bleachers with his surfer stoner buddies. He turns to one admiring stoner .",
        "Spicoli": "Something happened to them, mon.   Yeah. I'm registered for this class.   This is U.S. History, right? I saw the globe in the window.   Can I come in?   Sorry I'm late. This new schedule is totally confusing.  Mr. Hand takes the red ad card and reads from it with utter fascination.   That's the name they gave me.  Mr. Hand slowly tears the card into little pieces and sprinkles the pieces over his wastebasket. Spicoli watches in disbelief. His hands are frozen in the process of removing his backpack.   You just ripped my card in two!   Hey, bud. What's your problem?  Mr. Hand moves to within inches of Spicoli's face.   You... dick.  In the tense moment that follows, no one in the class is sure what might happen.  Mr. Hand simply turns away from Jeff Spicoli as if he ceased to exist and coolly continues his lecture.   The motherfucker pissed me off.   I didn't take that shit.  They all laugh, flip hair out of their eyes.   I called him a dick. And then I reached for his class notes, and I ripped 'em up. I said, 'Hey bud. Two can play this game.'  The Stoners go wild.   I'll tell you this. If he hassles me again, I can't be responsible for what happens... you know why?   You got it.  Gimme a dollar.  One surfer digs out a dollar for Spicoli. They look out at lunch court, see it teeming with straight kids. They turn and walk towards the parking lot.   Hey! Wait a minute! There's no birthday party for me here!   I couldn't make it in time.   I don't know, mon. The food lines took forever.   I don't know.  Mr. Hand appears mesmerized. He then turns and heads for the board. He writes in long, large letters as he slams the chalk into the green board. He writes: \"I DON'T KNOW\".    'Layin' ladies! Drinkin' wine! You gotta dollar -- You're a friend of mine! Gettin' loose! Feelin' fine! You and me -- It's get down time! We're on the Highway to Hell! The Highway to Hell!'  Spicoli finishes up with a spectular pump. The audience goes wild as Merv Griffin greets him warmly, and guides Spicoli to his seat. Spicoli motions for the cheers to die down. Griffin is obviously happy to see him. He touches Spicoli's arm lightly.   Outrageous, Merv. Nice to be here. I feel great.   I've been swimming, Merv.  The audience howls. It's a famous Spicoli line.   Seriously, Merv, everything is great. I was thinking about picking up some hash this weekend, maybe going up to the mountains.   School.  School is no problem. All you have to do is go to get the grades. And if you know something, all you have to do is go about half the time.   I don't go at all.  The audience is howling again. He is Merv's favorite guest.   Well, it pretty much speaks for itself. Peter, you want to run with it?   Merv, this is the action down at Sunset Cliffs at about six in the morning.   That's me, Merv.  The audience gasps.   Totally.  We watch as Spicoli catches the perfect wave, and it hurtles him through a turquoise tube of water.   Merv, I'm thinking... I've only got about four good hours of surfing left before these little clowns from junior high start showing up with their boogie boards.  The audience is howling once again... when suddenly we hear the loud noise of a door opening, followed by a shrill voice. It is Spicoli's eight-year-old brother, Curtis.  Jeff Spicoli's dream of glory evaporates.    It is a messy trailer, part of a trailer park by the sea. Spicoli's area is small, but he has made it his own. The walls are covered with posters, almost all of them naked centerfolds. It is obvious Spicoli's parents are not welcome in his room.   Ugh.  He groans, starts to struggle out of bed.   Leave me alone!   Leave me alone.    who is asleep in the bleachers.   Be noble. Be aggressive. The thing about Missile Command is to decimate before you can be decimated. Just like in real life.  The youngsters hang on every word of the sage advice.   I thought he was out of town.   Then don't hassle it.  They speed off down Ridgemont.   Naw. Any good?   All right.   Hold your beer down, L.C., I think it's a cop.  Spicoli slows down. The car behind him slows down.   This is a cop. He's definitely cruising me at busting distance.  The high beams switch on behind Spicoli.   What the fuck is this guy doing?  The car behind Spicoli then advances to the point where it is now almost touching the blue Mustang.   What the fuck is this guy doing?   It's a bunch of Jocks in a Granada!   All right. Die, Granada Jocks!  Spicoli guns ahead, in a real bullet move, and easily overtakes the Granada. Spicoli is proud of himself. He checks himself out in the rearview and turns to L.C.   Would you roll your window up, L.C.? It's messing my hair.  Spicoli pulls way ahead of the Granada, while L.C. rolls his window up. Spicoli looks over to L.C. and smiles wickedly.  Now Spicoli wants to show off. He pushes the pedal to the floor.   You know the thing I love about Mustangs? The steering wheel.  Spicoli fingers the bubbles in the wheel.   With a genuine Mustang steering wheel, you can negotiate a hairpin turn with ease, my man.   Are you okay?  There is silence. Outside the smashed car, the Granada Jocks pass Spicoli and L.C.   Just be glad you're all right.   Make up your mind. Is he gonna shit, or is he gonna kill us?   Will you just relax, mon? He's not gonna kill us. My father is a television repairman. He's got all kinds of tools. I can fix-this car.   I can fix it.   I think we may have gotten away clean.    bright and clear-eyed, sitting in the front row. His hands are clasped in front of him on the desk. His textbook is open to the proper page.  Mr. Hand is suspicious, but continues with class.   That's me.  The Delivery Man takes the pizza, sets it on the desk, as Spicoli whips out some crumpled dollars. Then he produces yet another crumpled dollar, and presses it into the Delivery Man's hand.   For you, my man.  The Delivery Man thanks him warmly, just as Mr. Hand rages into the picture.   Learning about Cuba. Having some food.    I've been thinking about this, Mr. Hand. If I'm here... and you're here... doesn't that make it our time?  Mr. Hand is so furious he's almost shaking.   So I thought I'd order us a pizza. Just leave me a lot of bologna...  Mr. Hand snatches up the pizza, and starts to throw it in the wastebasket. Then he thinks better, and heads for the door. He opens it just as a gang of young Stoners walk past.   You better save some for me, you swine!    who turns to Stacy.   Twenty-five bucks is pretty good.   Bitchin'.   Hey, mon, can I use the bathroom?  Brad squints his eyes, looks at the sign on the back room door.   Totally.   I can't find it, mon!   On the ledge?   There it is!  Brad sighs again. He loads a new filter into the coffee maker.   No towels, mon...  The Robber turns to look at Spicoli, and that is all that Brad Hamilton needs. Just like it is the most natural thing in the world, Brad reaches for the hot, steaming coffee pot he has just made and throws it into the gunman's face and hands.   Awesome. Totally awesome.    Jeff Spicoli sits in his room, and it is his castle. Clothes lie in disarray on the floor. A huge half-waxed surfboard is propped against the window. We see Spicoli dressed in a too large white short-sleeved shirt, attempting to tie his father's fat paisley tie. He stops to take a hit from his bong, all the while talking on the phone. The music of Lynyrd Skynyrd's \"Freebird\" plays on the radio.   I... am... so... wasted, mon. What is in this shit?  Doesn't that stuff cause brain damage?  Bitchin'.  Spicoli listens for a moment. He rubs his eyes, shakes his head. He is really buzzed.   Hey, mon, I am going to Mexico as soon as school is out. Two more weeks, bud. Week from Wednesday.  I am gonna take both boards, my duck feet, many cases of beer, and just jam.  No, mon, from school. I'm leaving as soon as school gets out. I'll be at Sunset Cliffs by nighttime.  Totally.  Later.  Spicoli hangs up, and concentrates on tying his tie. He almost strangles himself. Then suddenly the door to his room flies open and Spicoli's little brother Curtis bursts in.   Go away, Curtis. If you can't knock, I can't hear you.  Curtis slams the door and leaves. A moment later there is a knock.   That's better. Come in.  The door swings open and Jeff Spicoli sits in stoned shock at the sight before him. There, standing in the doorway of his room is Mr. Hand.   Mr... Mr. Hand.   Yeah. The Graduation Dance Mr. Hand. It's the last school event of the year.   Did I do something wrong, Mr. Hand?  Hand removes several copies of Oui Magazine from another chair and sits down. He sets his briefcase on Spicoli's dresser, next to a bag of pot, and opens it up for easy access.   I don't know. I guess so.   Hey, it's in my locker, Mr. Hand.    Wearily, Spicoli is trying to grasp the material.   ... so, like, when Jefferson went before the people what he was saying was 'Hey, we left this place in England because it was bogus, and if we don't come up with some cool rules ourself, we'll be bogus, too!' Right?   Hey, Mr. Hand, can I ask you a question?   Do you have a guy like me every year? A guy to... I don't know, make a show of. Teach other kids lessons and stuff?    No way, mon. When I graduate U.S. history I ain't even coming over to your side of the building.    You're gonna flunk me?!  Mr. Hand pauses a moment, then breaks into the nearest approximation of a grin we have seen all year. It isn't much, but it's noticeable. His lips crinkle at the ends.   All right! Oh, yeah!  Mr. Hand has now gathered all his material, and he stands to approach Spicoli's door. Jeff jumps up, extends his hand.   Aloha, Mr. Hand!    sprawled out in the bleachers with his surfer stoner buddies. He turns to one admiring stoner .   Hey, mon. Sign my annual.  Spicoli slips the annual into the kid's crotch. The stoner winces in pain, but still opens the book and lingers on all the signings in Spicoli's annual. They are all drug-related messages from fellow stoners. After a moment, Spicoli's friend signs: \"Thanks for the reds. Todd.\"   Hamilton!  Brad turns around, seen Spicoli sitting on the bottom rung of the bleachers. Spicoli looks back with true respect.   Awesome.  He throws Brad his annual. Brad gives him his. They sign.   Easy, mon.   Summer, mon! We're there!  He turns to his stoner bud.   Let's roll, my man.  Spicoli backs right into a young buzz-cut kid.   Hey, bud! Watch yourselff  Spicoli turns around to see he's backed into a squad of eight Lincoln Surf Nazis. They are all standing on the steps, waiting.   Hey, mon, I don't know what your trip is, but...  Spicoli dashes off down Luna Street. L.C. and the Surf Nazis take out in hot pursuit, chasing him through the parking lot, past Ridgemont High, and into the night. They will never catch him.",
        "Cindy": "Hi, Linda. God, you look so great.   Hi, Stacy.  Stacy smiles. Gregg and Cindy move on, repeating the same scene a few feet away.    who are seated at a back table, feeding each other.  Stacy looks at her finished sundae.   I just want to say that we are not 'Spirit Bunnies' anymore. We always hated that name. It bugged the heck out of Dina and me...   They don't call the Chess Club 'Checker Champs' or anything like that. We're going to go to everything this year, you guys. We're going to go to soccer, wrestling, basketball... everything. We know you've got a lot of spirit! Everybody -- riiiiiight? And we're gonna destroy Lincoln next week? Riiiiiiight?   We're going to be going to every game this year. We just want the crowd to participate and we want spirit from every little person in this entire school. Allll-Riiiight?  There is unenthusiastic, minor applause from the assembled students of Ridgemont High. Vice Principal Ray Connors, a tough-looking man with an H.R. Haldeman crew cut, approaches the podium. He has a sour look on his face.   Hi-yeeeeeeee!!!",
        "Hand": "that reads: \"No Shirts, No Shoes, No Dice\"   Aloha. My name is Mr. Hand.  Mr. Hand writes his name on the green chalkboard before his class. Every letter is a small explosion of chalk.    I have but one question for you on our first morning 'together.'  Can you attend my class? Pakalo?... Understand?... History has proven us one basic fact. Man does not do anything that is not for his own good. It is for your own good that you attend my class. And if you can't make it... I can make you.  An impatient knock begins at the front door of the classroom.   We have a twenty-question quiz every Friday. It will cover all the material we've dealt with during the week. There will be no make-up exams. It's important that you all have your Land of Truth and Liberty textbooks by Wednesday. At the latest.  The knock continues.   Your grade is the average of all your quizzes, plus the midterm and final, which counts for one-third. Got it?  The mystery knocker tries a lazy calypso beat on the front door. No one in Mr. Hand's U.S. History class dares mention it, much less answer it.  Stacy grips her desk with the tension of her first day.   Also. There will be no eating in this class. You get used to doing your own business on your own time. That's one demand I make. I don't like staying after class with you on detention. That's my time. I don't like wasting it. Just like you wouldn't want me to come to your house some evening and discuss U.S. History on your time. Pakalo?  Hand finally turns, as if he has just noticed the sound at the door and opens the door an inch. Jeffrey Spicoli stands in the doorway, red eyes glistening. His long, blond hair is still wet and streaming down the back of his white peasant shirt. He grins, oblivious to such trivial matters as attendance bells. A Student sitting near Stacy turns to his friends.   Yes?   What class?    Really?  Spicoli holds his red ad card up to the crack in the door.    Oh, please. I get so lonely when that third attendance bell rings and I don't see all my kids here.  Spicoli laughs. He is the only one.   Mr. Spicoli?   Yes.   No problem at all. I think you know where the front office is.  It takes a moment for the words to work their way out of Jeff Spicoli's mouth.   I've taken the time to print up a complete schedule of class quizzes, and the chapters they cover. Please pass them back to the desks behind you...  Hand begins passing out stacks of purple mimeographed sheets.   C... D... F... F... F... three weeks we've been talking about the Platt Amendment. What are you people? On dope? A piece of legislation was introduced into Congress by Senator John Platt. It was passed in 1906. This amendment to our Constitution has a profound impact upon all of our daily liv....  Mr. Hand stops on a dime. He is like a champion hunting dog that has just picked up the scent. He scans the room.   Where is Jeff Spicoli?  There is silence in the U.S. history classroom.   I saw him earlier today near the 200 Building bathrooms. Is he still on campus?  Silence.   Anyone?  One student sitting next to Stacy raises his hand.   Yes, Desmond?   How long ago?   Okay. Bring him in.  Desmond hustles out the door.   What is this fascination with truancy? What is it that gets inside your heads?  Mr. Hand begins to pace the aisles as he speaks. Occasionally, for emphasis, he bends down to lecture directly into the students' faces.   There are other teachers in this school who look the other way at truants. (points to attendance clip on the doorway It's a little game that you both play. They pretend they don't see you, you pretend you don't ditch. Who pays the price later? You.  Desmond returns to the room with a red-eyed Jeff Spicoli.   Thank you, Desmond.  What's the reason for your truancy?    You mean, you couldn't? Or you wouldn't?   Food will be eaten on your time!  Why are you continuously late for this class, Mr. Spicoli? Why do you shamelessly waste my time like this?   I like that.  He stands back and admires it. He turns randomly to Stacy.   Don't you like that, Miss Hamilton?   I really like that too. 'I don't know'... that's nice. 'Mr. Hand, will I pass this class?' 'Gee, Mr. Spicoli, I don't know'. I like that. I think I'm going to leave your words on this board for all my classes to enjoy. Giving you full credit, of course, Mr. Spicoli.  We hear the blare of the dismissal bell. Stacy and the other students get up to leave. Spicoli stays in place. He has just figured out a truly bitchin' comeback... and his mouth is forming the first word, when Mr. Hand cuts him off.   You can go now.  Hand turns back to his desk. The rest of the students have already left. Spicoli's audience is gone. He shrugs and lopes out the door.   Now in 1898, Spain owned Cuba. Outright. Think about it. Cuba, owned by a disorganized parliament 4,000 miles away. Cubans were in a constant state of revolt.  Mr. Hand begins pacing the aisles as he talks.   In 1904, the United States decided to throw a little weight around, and...  There is a brief, sharp knock at the door. Mr. Hand whips his head around, like McGarrett. He approaches the door like a cat.    Who is it?   Again?   Am I hallucinating here? Just what in the hell do you think you're doing?   Mr. Spicoli, you're on dangerous ground here. You're causing a major disturbance in my class and on my time.   And you, my friend. I'll see you for a two-hour detention every afternoon this week.  Spicoli eases back in his chair, shrugs. It was a good idea at the time.   That's right, Jeff. Mind if I come in?  Spicoli can only nod.    Thank you, Mr. and Mrs. Spicoli.  Hand walks into Spicoli's room, takes off his suit jacket and lays it on the chair back. He stops a moment and catches the stare of Miss January Penthouse on the wall, then turns to Spicoli.   Were you going somewhere tonight, Jeff?   I'm afraid we've got some things to discuss here, Jeff.   Do you want to sit there, Jeff?   Fine. You sit right here on your bed. I'll use the chair here.  As I explained to your parents just a moment ago, and to you many times since the very beginning of the school year -- I don't like to spend my time waiting for late students, or detention cases. I'd rather be preparing the lesson.  Mr. Hand takes a sheet from his briefcase and looks at it.   According to my calculations, Mr. Spicoli, you wasted a total of eight hours of my time this year. And rest assured that is a kind estimate.  He returns the sheet to his case and looks into Spicoli's weed-ravaged eyes.   Now, Mr. Spicoli, comes a rare moment for me. Now I have the unique pleasure of squaring our account. Tonight, you and I are going to talk in great detail about the Davis Agreement, all the associated treaties, and the American Revolution in particular. Now if you can just turn to Chapter 47 of Lord of Truth And Liberty.   Well, then, I'm glad I remembered to bring an extra copy just for you.  Hand reaches in his case and produces the book. He hands it to Spicoli.    who nods his head.   Very close, Jeff.  Hand reaches over and gets his case.   I think I've made my point with you tonight.   What's that?   Well, you'll find out next year.   If you graduate.   Don't worry, Spicoli. You'll probably squeak by.   Aloha, Spicoli.  Mr. Hand exits the room, and descends the staircase of the Spicoli household. Spicoli kicks the door shut, grins, and continues struggling with his tie.",
        "Brad": "We need fifteen Superstars, David!   I'll take care of the fry orders! Just get me the Superstars!   Hey you guys! You had shirts on when you came in here.   Come on, Spicoli. Why don't you just put your shirts back on? See the sign?   No, just a couple of surfers with no shirts on. I took care of it, Dennis.   They were left over from the last shift.   But they weren't mine.  Brad laughs, goes back to work.   Six more payments, gentlemen.  Brad joins his friends, and they walk towards the gymnasium.   Arnold. What's happening?  Arnold speaks confidentially to Brad.   You want to work at Carl's?   I can probably get you in there. Just let me talk to Dennis Taylor.   Sis.   Hey, Stacy.   Everyone wants to know where Lisa is. How should I know where Lisa is?  What am I gonna do? Now my little sister goes to the same high school. The party's over.  So who do you have first period?   Hey-yo.   Nothing... if you like 'Hawaii Five O.' You better get in class, Stacy. That's not the one to be late to.  Stacy hurries off.   You should see her in the morning.   Hey-yooooooooooo.   You hear about the surfer in Mr. Hand's class?  His Buddies shake their heads.   Told Hand to fuck off.   Whoa!_  Brad sees another friend pass through lunch court.   Thompson!  Brad waits for him to pass.   I hear Thompson got canned at Bob's this summer.   Where is he now?   Man.  They make you wear a fuckin' candy stripe suit over there.   Poor guy.   Mom says to clean up the pool.   Your friends use the pool. Your friends messed it up.   I take out the garbage.   They're not home yet.   I'd say... who the hell is Ron Johnson?   Of course.   Don't worry about it.  She gives him a kiss... on the cheek.   Let's go to the Point tonight.  She pulls away.   What's there to do at the Point? God, Lisa, we've been going together almost two years, and...   Tool? Tool for what? We've been going together almost two years!    Brad is alone in his room. He's prone on his neatly made bed, reading a paperback book entitled Power With Class. On the wall of Brad's room is a large framed photo of a Carl's Jr. hamburger.  Brad hears a muffled knock at his door.   Come on in.  Stacy walks into Brad's room.   Don't worry about it. Who sent the flowers?   I don't care it you tell me or not. I got problems of my own.  He begins pacing.   Are you kidding? Work is great. I kill at work. I don't even mind Mom and Dad making me pay rent.   I've been doing some thinking. It's my last school year. I'm a single, successful guy. I think I want my freedom.   Where did you hear that?   Well... it's true.   Everybody loves Lisa. Everybody loves Lisa. But everybody doesn't have to be her boyfriend.  Suddenly, Stacy pops the question.   Why?   Maybe yes. Maybe no.   I didn't say that.   Are you still a virgin?   Don't give me that shit! I know you're still a virgin!  Stacy smiles and stands up. She playfully slaps her brother on the arm and walks down the hallway to her room. We can see there is less frill and lace in Stacy's room. The junior high paperbacks are gone. There are no dolls in sight.    Lisa? I have something to tell you. Look, I'm a senior now. I'm a single, successful guy and I've got to be fair to myself. Lisa... I think I need my freedom.  Brad pauses, looks at the mirror soulfully.   Aw, don't do that... don't take it personally, okay? Please? I knew you'd understand, because...  The bathroom door opens -- it's Arnold, the boy who Brad got a job.   Okay, Dennis.  Brad begins polishing the counter and Dennis Taylor returns to his office at the back of the kitchen.  Brad watches him disappear behind the door that says: ASSISTANT MANAGER.  As soon as Dennis disappears behind the door, the one Businessman in the place rises and returns to the counter.    May I help you?  The Businessman has short, curly brown hair. He speaks in a whine.   Well, I believe you have to fill out a form. There's a pad right around here.   Well, that's not the way it works, really. And you ate most of your food already, too...   I can't do that. But if you wait a minute...   I'm sorry, sir. Just let me find the forms here.   Mister, if you don't shut up, I'm gonna kick 100% of your ass.   He insulted me first. He called me a moron.   Yes, sir.   I hope you had a hell of a piss, Arnold.    He arrives back in his room and locks the door. He yanks the burger picture off his wall, dumps it into the trash. Then he takes it back out of the trash and cracks the cardboard picture and plastic frame in half.    sitting nearby. We hear them over the drone of the assembly.   Man, I don't even want to see those guys from Carl's again.   Apologize to that wimp? No way. Fuck Dennis Taylor.  They sit in silence for a moment.   I'm just glad we're still together, Lisa, because I need you this year.    as he accepts the news.    as it falls slack.    who are seated in this class.    who is again sitting alone in the bleachers. Watching. Several old lunch court friends pass by, on their way to the concession area.   All right.   Fish and chips place.   Just a fish and chips place.  Brad says nothing more. The students look at each other.    Later.   Does Mom know you have company?   Hi, Linda.   Well, you guys, keep it down. I've got some work to do upstairs.  Brad turns and heads back inside. He is just out of earshot when they begin talking about him.    who is watching Linda from the window in his room. We see him from behind, peeking out the curtains.    We see Brad's room. The Carl's burger picture on the wall is conspicuously missing. There is music playing from his stereo -- Pink Floyd's \"You and Me\".  We see Brad. He is kneeling on the bathroom floor, his back to us. His green T-shirt is on, his underwear in a pile on the floor behind him. His arm is pumping slowly. Brad is jacking off.    It features Linda Barrett, just as she stood on the diving board a moment ago. She is gorgeous. Her breasts seem even bigger than usual. Her nipples are hard, poking through the film maroon string bikini. Water rolls slowly down her cheeks, into the corners of her mouth. Her lips are parted slightly. Her eyes are filled with desire as she says...    in a nice shirt, his hair combed back and looking great. He walks to Linda. She reaches out and grabs him for a kiss, pulling him close. Then she pushes him away, so he can watch as she carefully unstraps the top of her bathing suit. The incredible Linda Barrett's breasts fall loose.  She takes Brad's hands and places them on her, as she begins unbuttoning his shirt. They are just about to fall into passionate lovemaking when we hear...    in the doorway of Brad's bathroom as she watches the sight before her.    trying to cover himself and act nonchalant and keep his back turned at the same time. The words barely escape his mouth.   Wait just a... minute.    still kneeling. It had all happened so quickly, so fast   Doesn't anybody fuckin' knock anymore?  He slams the toilet seat down and we...   I go to school in the mornings. I have a work study program for the afternoon.  He bags one final coffee and punches up the amount.   $8.46, please.   Thank you, and thanks for coming to Captain Kidd.  Brad loosens his buccaneer scarf, and starts back towards the kitchen. He is stopped by the sudden appearance of Captain Kidd Assistant Manager, Harold.   Just write me out a bill.  While Harold leans down to tally up the fish order, Brad goes to a nearby employee's closet. He has completely perfected the art of changing back into his street clothes, and it takes less than a minute. He is just about to finish buttoning his street shirt when Harold sees him.   This is how I dress all the time.   I thought I'd take it off for the drive over to IBM. It's kind of uncomfortable.  Harold can barely fathom the idea.   You really want me to put all this stuff back on?    as he stands there, stoic looking.   I don't believe you're asking me to do this, but okay.  He begins taking off his street shirt. He looks at Harold, looks at the boxes, and returns to the closet.    looking perplexed. Then he realizes that he hasn't taken his Ponce de Leon hat off. Brad drives on.    as we see the Cruising Vessel move down the highway. We see the Captain Kidd hat go flying out the window. Then the plastic sword, and the scarf. Then a couple boxes of Captain Kidd fish. Then the rest of them. We see Brad rip past the IBM Building.   Well, to tell you the truth Mrs. O'Rourke, I've kind of been putting it off. I'm not sure what I want to do yet.   I don't know... Burt Reynolds.  There is no humor on Mrs. O'Rourke's face.   You know what, Mrs. O'Rourke? I broke up with my girlfriend this year. I lost my job at Carl's, and two other places. I wake up at 5:30 to work at 7-11, then I go to school, then I go back to 7-11. I have to pay rent, you know. My grades haven't been that bad, and now you're telling me that the fun is over. Well, I'm still waiting for the fun to start.   See you later.    He stands, hands on hips, just outside the door.   Since when do you shop at the Flea Market anyway?   Who did it?  Stacy stares out the window. Tears well in her eyes.   You're not going to tell me, are you?   All right, then. It's your secret.  Stacy smiles at Brad. Brad smiles back. The car drives on.   Go ahead. Just make it quick.   It's the first door on your left.  Spicoli disappears into the back room. Brad sighs, looks at the clock. It reads: 11:15. Then he hears Spicoli from the back room.   It's the first door on your left!   First door on your left!   They empty and close the big safe here at midnight.   I'm instructed to tell you that we are on a video alarm system and there are other hidden cameras in the store ...   Okay.  I just started here, and they just taught me the procedure. I'll give you the money, just let me figure this out.   You motherfucker. Get off my fuckin' case.  The Robber is about to react when the bathroom door opens and Jeff Spicoli starts out, wiping his hands on his pants.   There goes your ride home.  Brad pulls the under-counter alarm with newfound confidence. Jeff Spicoli stands there, mesmerized at the entire event.   Since when do you guys want to work at 7-11?   Well, 7-11 is a tremendous operation. It's really changed, man. They've got great food, great magazines, videogames... it's class. Total class.   Hey, Thompson! Wendell! Get a job!  They laugh, flip him off. Brad is back in his element at last. He moves into the main dancing area, works his way across the room, past the bleachers, when he hears a voice.   Later.",
        "Dennis": "Any problems?   Did you throw away those fries, Hamilton?   Those were perfectly good fries, Hamilton.  Perfectly good.   Come on. Clean that counter off Brad. Let's go. Play ball.   Can I help you, sir? Is there a problem?   Did you threaten this man or use profanity in any way?   Did you threaten this customer or use profanity in any way?   You're fired.  Brad looks around, expecting his friends to defend him. Dave and Rich seem very occupied with their work. Brad is stunned.    I'm very sorry this happened to you, sir.",
        "Taylor": "Hamilton! You have fifteen double cheese to box!  Lisa returns to her cashier post, leaving Brad's last words stalled in his mouth."
    },
    "imdb_rating": "7.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYzBlZjE1MDctYjZmZC00ZTJmLWFkOWEtYjdmZDZkODBkZmI2XkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_QL75_UX380_CR0,5,380,562_.jpg",
    "description": "A look at the lives and loves of a group of high school students. It's the final year of high school for Brad Hamilton who decides he should break up with his longtime girlfriend to play the field. He's at a loss however when she breaks up with him first. Jeff Spicoli continues to take delight in getting under the skin of his teacher, Mr. Hand. Others are looking for love, sex and just plain having a good time which, for the most part, they all seem to find though sometimes in unexpected places.garykmcd",
    "name": "Fast Times at Ridgemont High",
    "genres": [
        "Comedy",
        "Drama"
    ]
}