{
    "filename": "Feast_script.txt",
    "imdb_id": "tt0426459",
    "imdb_url": "https://www.imdb.com/title/tt0426459",
    "characters": [
        "Boss Man",
        "Bozo",
        "Grandma",
        "Bartender",
        "Beer Guy",
        "Vet",
        "Cody",
        "Honey Pie",
        "Harley Mom (as Diane Goldner)",
        "Edgy Cat",
        "Coach",
        "Drunk Girl (as Chauntae Davis)",
        "Tuffy",
        "Hot Wheels",
        "Finger Girl (as Hannah Schick)"
    ],
    "dialogues": {
        "Boss": "Listen, bud. I got a load ready to move and your man's not here.  We got a problem.   I love a woman with enthusiasm.  Is it clear?!  Is there a gun pointing at you?  Alright goddamn it! Who shot me!? Who did it!?  My goddamn foot is gone! Who fuckin' shot me? Who fuckin' shot me!?  Well, where's the sonuvabitch!?  What? What the hell happened down here?!  Jesus Christ on the cross... someone make sense.  So, your dead hubby shot me twice, three of my customers have been eaten, and there are angry creatures outside?  Huh?  Fan-fuckin-tastic.  Please elaborate.  I have a short wave radio upstairs.  I've got some tools and extra planks in the kitchen, if we're on the same page here.  But its got teeth.  Fire in the hole!  More importantly, how did you run away from these things?  In the kitchen, under the sink.  I got my .38 here. That's six shots and two refills. Downstairs, I have locker with a sawed-off and some gardening tools. Maybe a few boxes of shells.  Go for it. It's by the far wall. Channel 9 is the emergency frequency.  With what happened upstairs --  Well...  Morphine. My magic potion. I need a few drops.  You should try a little, it'll calm your nerves. Works like a charm.  Wait, before you do that, help me move. There's a small room off the kitchen where I can lay down.  It's much safer in there. Trust me.  I can't feel a thing, Hon.  You're a bad girl, aren't you.  The girl's got rhythm.  There it is.  Hell yeah.  How much I got, what?  You don't understand, sweety. Daddy doesn't pay. Daddy sees the show for free. But you do get points for being horny on a night like this.  You can't expect a man to buy a car without a test drive first, can you?  Now wiggle that sweet little ass over here and sit on Daddy's face, I wanna do some appraising.  Hoh-SHIT! Help!! Help me!!!   They're getting in! Somebody help!   Yeah... I will. I will. Promise.  What?  I don't know shit.  Wait, wait, wait.  Grass, man. I grow pot down there.  It spits out behind the parking lot.  My truck is near, but it ain't nearly big enough to haul the whole lot.  Fully.  Two.  Six.  Seven.  Thirteen clowns wouldn't fit.  Sounds sketchy.  Bullshit.  If you ask me, I'm gonna just lay right here, wait for sunrise, then walk on out of here.  If all of you run for it, they won't care about lil ol' me. They like the food that moves...",
        "Man": "Hey, man, that was righteous, but I need a shot with the sign up.   Listen, bud. I got a load ready to move and your man's not here.  We got a problem.   I love a woman with enthusiasm.  Is it clear?!  Is there a gun pointing at you?  Alright goddamn it! Who shot me!? Who did it!?  My goddamn foot is gone! Who fuckin' shot me? Who fuckin' shot me!?  Well, where's the sonuvabitch!?  What? What the hell happened down here?!  Jesus Christ on the cross... someone make sense.  So, your dead hubby shot me twice, three of my customers have been eaten, and there are angry creatures outside?  Huh?  Fan-fuckin-tastic.  Please elaborate.  I have a short wave radio upstairs.  I've got some tools and extra planks in the kitchen, if we're on the same page here.  But its got teeth.  Fire in the hole!  More importantly, how did you run away from these things?  In the kitchen, under the sink.  I got my .38 here. That's six shots and two refills. Downstairs, I have locker with a sawed-off and some gardening tools. Maybe a few boxes of shells.  Go for it. It's by the far wall. Channel 9 is the emergency frequency.  With what happened upstairs --  Well...  Morphine. My magic potion. I need a few drops.  You should try a little, it'll calm your nerves. Works like a charm.  Wait, before you do that, help me move. There's a small room off the kitchen where I can lay down.  It's much safer in there. Trust me.  I can't feel a thing, Hon.  You're a bad girl, aren't you.  The girl's got rhythm.  There it is.  Hell yeah.  How much I got, what?  You don't understand, sweety. Daddy doesn't pay. Daddy sees the show for free. But you do get points for being horny on a night like this.  You can't expect a man to buy a car without a test drive first, can you?  Now wiggle that sweet little ass over here and sit on Daddy's face, I wanna do some appraising.  Hoh-SHIT! Help!! Help me!!!   They're getting in! Somebody help!   Yeah... I will. I will. Promise.  What?  I don't know shit.  Wait, wait, wait.  Grass, man. I grow pot down there.  It spits out behind the parking lot.  My truck is near, but it ain't nearly big enough to haul the whole lot.  Fully.  Two.  Six.  Seven.  Thirteen clowns wouldn't fit.  Sounds sketchy.  Bullshit.  If you ask me, I'm gonna just lay right here, wait for sunrise, then walk on out of here.  If all of you run for it, they won't care about lil ol' me. They like the food that moves...   What's the damage radius?  How many picked up the broadcast?  Tornado cluster.  Get what you need to sell it.  Sir, we have movement!  Open it.  Gentlemen, help them to safety.  Relax. We know. We're the calvary.  What happened to you?  A trauma center. We have doctors waiting. You're in good hands now.  Do it quick and spread the mess.",
        "Bozo": "Shut up, fag.  Don't dilly-dally then. Rack 'em!    Ohhh, now that's a rough one.    Oh, come on. Crape Diem!  Wake up! Check your pants!     Whoa!  You boys wanna try your luck at the loot?  Come on, I'll even throw with my left hand.  Nothin' but a bunch of butts and pussies in here!  I got two hundred bucks says none of you can beat me!  C'mon guys --  Gimme some ACTION --  Got 'cha!  What the FUCK was that?  I didn't do it! It was fuckin' monsters, asshole!  Why don't you go check it out?  Anything?  I think it's hungry again.  I think we got --  Right, let's just call 'em names.  See that you monkey fucks! That's what you get when you mess with us! Woman or man, I don't give a fuck! Shit don't make me gay because you'll be sucking my dick!  Dude, they're humpin'!  Any more ideas, Animal Planet?  Go douche.  Yeah, thanks for that.  We? We learned fast? You are all that is left of we. No offense Pocohantas, but I think someone else should play \"Chief\" tonight. Someone that knows the lay of the land. Like me.  You!  You gotta know somethin', you're old.  Old people know stuff like this. Legends, tall tales, shit like that.  Spill it!    Come on! Think back!  That's just horse shit.  Yeah... allegedly.  The first order of business is gettin' a big fuckin' tampon in that cave!  They're probably on to the next buffet by now. There's a retirement home up the road, they'd be easy pickings.  ...Duh.  Oh, now you have something to say?  Oh? And what's that?  That's for bears and sharks, chunky chew.  Do you drive a short beer bus or something? You go out there, you get eaten. You stay in here, you get eaten. Anyone comes to help, they get eaten. Don't you see a pattern here, Spuds Makenzie?    Let's not get carried away...  So that's how it is? Fine! Shotgun, please.    Now who else is comin'?  What are you gonna do? Throw your teeth at 'em? Sit down, Cocoon.  You! Zorba! You're coming too! Now gimme the keys.  What?  Don't get your hopes up.  Alright you two, I don't want to hear any of this, \"oh, I dropped the key, wrong key, ain't no key here.\" When I want out, I want out, ok?  Just keep 'em handy, ladies.  Wish me luck...  I'm okay! I'm okay!  Come on. Come on. Come on.  Geeezzzus. Okay, now. Easy steps. Easy breaths. Easy steps.  Lamaze. Lamaze. Lamaze.   Just a bat! I'm okay! Just a bat!  Hello? Anyone there? We need help out here at the United Nations Tavern. Send guns, tanks, and all that shit.  Repeat. We need help. SOS. Calling all cars! Calling all cars! We need help at the United Nations Tav --  Shit!  Double shit!  Okay, I'm ready to come out now!  \"OH!?\" WHAT IS \"OH?\" What does \"oh\" mean?        I got Papa in the stones. He's neutered.  Dude, are you gay?  This one's great under pressure. I wish you luck.  Hey!  When you get to that truck... drive it like you stole it.  Oh yeah?    Tease.  Hey, cyclops. Let's have a quiet contest... starting now.  Ya know, in situations of duress, I have found that women are attracted to my authority.  Ah-ah-ah! You're doing that all wrong!  I know you're doing it wrong.  Move aside, princess.  You don't want the rag touching booze, that way you can hold it and ensure it explodes when you throw it.  I'm sure.  Perfecto. What we should do, though, is put those peanut barrels to use. Fill 'em with booze and line up some planks. If the walls come down... we hit 'em Donkey Kong style.  Next time, look within. Stereotyping can be ugly and hurtful.  Excuse me for being forward, but I'm curious about your dimensions.  Ol' Crazy Horse has seen it.  Welcome back.  Ingenuity, baby. Ingenuity.  Bonsai!  Hot potato!!!  Commence Plan B!  Just watch the floor and keep the others safe!  Bomb's away!!!  One down, one to go!!!  I need to get your number.  The fan has officially been buried in the shit.  Motherfucker! Give him back!  Oh Jesus!  I thought we lost you --  You FUCKER!   Get me FUCK BIRDS!  No you don't!   Hang on!  Brother!!!       Motherfucker!!!  Lord, if I die, bury me upside down so the world can KISS MY ASS!  Get these cuffs off me! I'm a goddamn hero for Christ's sake!  Thanks for waitin' for me back there, really fuckin' appreciate it!  I found a new weak spot on 'em, but it damn ain't pretty getting to it.",
        "Grandma": "You should be so lucky.  I didn't say anything.  Heavens no!  Maybe next time, dear.    G'morning.",
        "Bartender": "Save it. We don't deal in pamphlets 'round here. We stick to chemistry. And his drinks are on me.    Was that the last keg?  If you're stayin', move the truck, boss gets pissed about you using primo parking.  Don't sweat it, just clean it up before he's done.  Hey! Get quiet or get out.  You hold it right there, mister.  Drop the canon!  I'll drop you and not even think about it!  You got one second to --  Who are you?  Yeah.  Nah, I got the gun.    It was an accident. Sorry.  And the rest of 'em?  Hey!  The back phone is wrecked, too.  We'll it ain't pretty...  What the hell now?  And the head?  So, your husband ditched you?  Well, justice is funny.  I wouldn't do that.  I got shells, too. Box and a half tops. Machete behind the bar.  Who the hell would you call?  Upstairs.  I'll wait by the door.    If he doesn't shut up...  Oh!  Wha?  The key broke off!  The lot's too damn far, that's surefire suicide.  It's a tunnel.  It runs about a hundred yards and spits out on the backside of that hill down the way.  You're trusting that con? He'll ditch us and never look back.  Get in line!  This is a bottleneck waiting to happen.  This ain't time for a political stance.  Got ya.  Don't be stupid, drop the gun!  What the hell happened?  I have two left.  Make it count.  What's that?  That wall's coming down!  I can't hold him!!!  God...  Oh shit!     I think we're in the clear --",
        "Beer": "I mean, we'd been together for so long and then... bang! She drops me. Since then, it's been like a damn country song: she's gone, the car's repossessed, and a father figure made a pass at me. I'm not saying I ever had it. But I have definitely lost it. Now I haul this swill from armpit to armpit. I used to be a model for Christ's sake.  JC Penny. Spring wear.  Why is that?  Yup, one keg of Beast for the basement, then the truck's dry.  Right, 'cause this joint's hopping.  Oh god...  So, what now? Did those things leave?  Fuck no.  This is goddamn depressing.  I don't see them.  It's working. I think it's working.    I might be able to do something with the bottles.  I have a CB in my truck, we could get some help out here.  Anyone.  Then I guess we should just give up.  That's not a good idea.  Me too.  There's a sawed-off shotgun in here.  This could come in handy.  What do you know?  Prove it.  You aren't nearly as dumb as you look, are you?  Come on!  We're gonna die!  When this lights, run like hell.",
        "Guy": "I mean, we'd been together for so long and then... bang! She drops me. Since then, it's been like a damn country song: she's gone, the car's repossessed, and a father figure made a pass at me. I'm not saying I ever had it. But I have definitely lost it. Now I haul this swill from armpit to armpit. I used to be a model for Christ's sake.  JC Penny. Spring wear.  Why is that?  Yup, one keg of Beast for the basement, then the truck's dry.  Right, 'cause this joint's hopping.  Oh god...  So, what now? Did those things leave?  Fuck no.  This is goddamn depressing.  I don't see them.  It's working. I think it's working.    I might be able to do something with the bottles.  I have a CB in my truck, we could get some help out here.  Anyone.  Then I guess we should just give up.  That's not a good idea.  Me too.  There's a sawed-off shotgun in here.  This could come in handy.  What do you know?  Prove it.  You aren't nearly as dumb as you look, are you?  Come on!  We're gonna die!  When this lights, run like hell.",
        "Vet": "",
        "Cody": "Mommy, I want Nemo.  Mommy --",
        "Honey": "",
        "Pie": "Mother Nature is not a whore/Don't dump in her any-more/Mother Nature is not a whore/Don't dump in her any- more...",
        "Edgy": "That cash is gonna look much better in my pocket.  Jesus!  That's all she wrote...  What?!  That's motherfuckin' impossible!  Goddamn it! NO!  I got you!",
        "Cat": "That cash is gonna look much better in my pocket.  Jesus!  That's all she wrote...  What?!  That's motherfuckin' impossible!  Goddamn it! NO!  I got you!",
        "Coach": "Son of a -- In with anger, out with love.  For what, may I ask?  You know, Chach, catching you at this low point is pure serendipity.  Because I take the rubble of man and build superstars. In my briefcase here is a doorway to a self-help sensation. Give me a minute, because I'd like to buy you a drink and change your life forever. I have a brochure --  Of all the friggin' bars to be stuck in.    Ladies and gentlemen, if I may have your attention.  We have to think outside the box here. We don't need to fight them, we need to scare them. Scare them right back. This is a species stand- off. We just need to show them we're not vulnerable. That we're formidable.  I need a stick.  Stand back.  Let's get that board down.  Showing superiority. The scent of their dead may drive them away.  Come on. Come onnnnnn.  You see? What I tell you?  Oh dear...  I-I-I was just being proactive...  There's five here now, actually.  What are you talking about?  Cheese n' rice...  Thanks.  We've got your back, bro.  Come on, bro.  He is human kabob.  Great god, why do you damn me?!    \"Courage is being scared to death, but saddling up anyway.\" The Duke. I will go.  No, I don't believe in guns.  This doesn't run out of ammo.  No. You?  One... two... three!!!  Well, look at that.  Hey, little fella.  Looks like a brothel for plants.    I am sorry, I ramble when I'm nervous.  It's just that this seems like the opportune time for someone to be horribly... offed.  Sorry. I'm done now.  Like moles these things.  Grab onto ceiling and get out of water!  Do it!!!    They will write stories of your bravery.",
        "Tuffy": "'Round here, there are ways.  Keep these on, sweetheart.  Mommy's working on it.  Let's get this over with.  My god... what is that?  Oh my god! My son! My SON!  Cody! Mommy's coming! Mommy's coming!  Oh sweetheart! What was I thinking? Mommy is never gonna let you go!     And Red Mountain. Your daughter.  You're welcome.    I will.  Shut up! Shut your mouth. You have no idea what is running through me right now. No idea. I'm ready.  Don't worry, I'm fine. Really.  Trust me, I plan on having a full breakdown when this is over, but for now, we all have to be strong, right?    You have it.  Name it.    Let's run for the cars, cause mass confusion.  Hey! Hey! She's in the shaft!  Shut up!  It stopped. It fuckin' stopped!  She can make it!  You okay?  They didn't make it.   What is that?    Are you okay?!  They'll be back.  Don't worry about that. Just go.  They're alive!  Your family?  I'm sorry.  Oh god.  How'd you survive?",
        "Hot": "",
        "Wheels": ""
    },
    "imdb_rating": "6.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTI0MzI5MTY1OV5BMl5BanBnXkFtZTcwMzU4MjYzMQ@@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "With madness in his eyes, a shotgun-toting man storms into a dusty desert bar in the middle of nowhere. Drenched in blood, the mysterious stranger and his wife start speaking of unnoticed, unstoppable creatures preying in the dark, trying to warn everyone of the impending danger. Now, the ravenous monsters desperately want in. As the pitiless entities draw first blood, the utterly unprepared regulars realise that, in the face of impossible odds, there's not enough ammo in the world to stop the fanged intruders. Will they survive the night? Who will be the next course in the monsters' feast?—Nick Riganas",
    "name": "Feast",
    "genres": [
        "Action",
        "Comedy",
        "Horror"
    ]
}