{
    "filename": "Flash-Gordon_script.txt",
    "imdb_id": "tt0080745",
    "imdb_url": "https://www.imdb.com/title/tt0080745",
    "characters": [
        "Prince Vultan",
        "Princess Aura",
        "Klytus",
        "Luro",
        "Zogi, the High Priest",
        "Flash Gordon",
        "Dr. Hans Zarkov",
        "Prince Barin",
        "Kala",
        "Munson",
        "Dale Arden",
        "Arborian Priest",
        "Serving Girl",
        "The Emperor Ming (as Max Von Sydow)",
        "Fico"
    ],
    "dialogues": {
        "Prince": "",
        "Vultan": "Ho! -- Barin! - I knew my Hawkmen would catch you one of these days.  Not in my Kingdom -- here you're just a stray animal to be killed for our sport!  What would you do if you'd caught me in Arboria?   As FLASH and DALE are lowered on it.  No. What have you to say to Vultan, Prince of the Air?     You're a leader, he?    Enough!  These vagrants talk a brave fight, my Hawkmen! Shall we test their words?    Take them below -- put them together.  Prepare them!  Arm the disc!  You've won, Earthling! Drop him to doom!  What is this??     What creature wants to die? 63.  We'll save these Earthlings! - Curse Ming! -- Into the air, my Hawkpeople - fly!  I don't understand this. I think I've gone mad.  Don't look back, Hawkman. Head for that cloud-cover!  Where's this capsule of yours, exactly?  Pick it up, Captain!  What if he fails? This is suicide, Barin! I can't order my men to suicide!  The flight brought me back to my senses -- good luck and goodbye.  We'll build another.     He calls us crazy --  Through the force-field, my Hawkmen! The pass is narrow -- dive three-by- three! Any man who wishes to turn back may do so!     Who are these Earthlings, that so many would die for?  Onward, Hawkmen! Dive! We outnumber their arrows -- overwhelm them!  Ming!",
        "Princess": "",
        "Aura": "Don't kill him yet, Father. Give him to me!  I can handle Barin.  But you adore me, Father -- you ca refuse me nothing . Yes?  Take a deep breath! Grab my ankle after we hit the water -- I'll lead you!  Catch your breath -- then I'll take you up and find you a disguise. 25.  I'll fly you to the forest of Arboria - we'll find a way.  Do you realize how foolish you are to tell that to me -- Ming's daughter?  You're funny -- are all Eathlings like you, Flash Gordon?  The plasma core. It's e source of the energy-beam my father ia aiming at Earth. You can't stop it. Ming is merciless and all-powerful!  The slaves are Lizard Men. Once they had their own water Kingdom, the fairest of Mongo. Then they dared to rebel. They will suffer for it here forever.  You can't reach him. If a soldier spots you, it's instant death! -- Come!  Forget Dale Arden!  Forget her, Flash Gordon: I saw a look in my father's eye -- I think he intends to marry her.  Oh you ask so many questions. I'm taking you to people who'll help you. Trust me!  Trust me!  Here we are.  I've dressed you as a Royal Pilot, First Class. We'll slip into my personal car and you'll fly it.     Learn from me -- I'll teach you so much!        Frigia -- eleventh of the moons of Mongo. It's inhabited by the Bear Men who eat their own young...  Now pull up -- go starboard around that next moon rising -- Ardentia. 32.  Of course - the Sand Men. Every Moon is a kingdom -- seperate and hostile to all the others. They have nothing in common but Ming's rule -- and their hatred of him.  Fight Ming the Merciless? You saw what happened to the Lizard Men.  I don't know these words what's a \"team\"?  Telekinetic Thought Transfer.  I'm going to get together with Prince Barin in Arboria and tell him I'm arriving. He's the one who'll help you.  Because he does anything I ask. He loves me.  If I showed you how. But I'm not going to.  What are you doing?  Are you mad&gt; We're diving straight at Ardentia!      Enough!  There's Arboria!  Who?  Follow me.   Making their way swiftly through it between earth and heaven, crossing this green world on branches and trunks of monster vines. FLASH pauses.  Ssssh...... Trust me!     It's Barin's hunt! Watch!     It means nothing. They only shout that because it's treason not to. They hate Ming.  Go inside -- let me talk to Barin first.  Foolish Earthling - trust me!  It's so long since I've been with you, Barin -- I couldn't stand it. Please don't be too angry at me for coming.    I've dreamed of it!    Flash Gordon -- come out! 43.  Hide him from my father -- don't let him wander -- keep him for me!  You still must -- I'm playing a game!  He's a mere toy to me, my love -- when I'm tired of it we'll kill him!  It's the risk I ask, Barin hide him for me in Arboria.  Are you so afraid of my Earthling, Barin; Won't you even give him a chance?  I'll do that.  If your love for me is great enough, Barin, surely it will protect you from the serpent -- no? 46.  It's an even chance now, Flash Gordon -- that's better than Daddy would have given you --             Princess Aura returns to Mingo City The passage through the force-field opens at her approach --  Daddy darling -- am I with you? Are you getting me?  Barin -- my only -- I swear I didn't mean to get you into this!  Spare him Daddy -- oh please spare    When I think of being given to Klytus, I wish it was myself who had fallen.  Then what is it that melts into my eyes, Dale Arden? Feel it breaking --  Ming tired of her. He blew my Mother into outer space. I look into the night sky sometimes and wonder what star she's orbiting --",
        "Klytus": "Hail Ming! Shall I drown them in the Sea of Fire?   Sirs, Earth is the meaningless planet you are in the process of obliterating.  This woman will amuse you. 20.  She betrays you! She'll take him to Aboria!  Don't be too sure! 24.  Mongo is restless today. Your vessels stray from their appointed kingdoms....  Dale Arden and Flash Gordon? Will I send out the Imperial Fleet to bring them back?  Sire, it is not for me to tell Great, Ming that he is making mistakes.  We'll find vultan later. Where's Flash Gordon?  I can't remember. I feel danger -- but I cannot see it.  I foresee another thing. In one minute exactly, the Earthling space capsule will be seen on the scanner.  What?  Destroy it.  In my pocket.  I foresaw at blow --       You fight me in vain, Barin I do not foresee my death at your hands --",
        "Luro": "",
        "Flash": "What was that, fellas? 2.  Can I have an autograph for my kid, Mr. Gordon?  Sure -- my pleasure.  I sure hope we don't have to turn back. I mean this is first day of training camp, I wouldn't want to be  Maybe it'd be smoother if you went  When you're nervous, it can help to chew on something  I'm not a stranger exactly -- You know my name.  Of course.  Backwards?  I can fly all right -- I've had a couple of lessons! -- just don't if I can land! 7.    No but I'd sure like to! How'd The man fall ninety stories didn't break a bone?  Brace yourself I'm aiming at that field up ahead!  Dale! Are you all right?  Come on -- let's get out before she blows!  Hello. i'm Flash Gordon, this is Miss Dale Arden --  This crazy storm knocked us down could we use a phone?  Some weather huh?  Well, all right -- but it seems to me we ought to --  Mister, you are insane!  Go with the flow -- wait for a chance! 11.  Take off for where?  Made it where, Doctor?  Hello -- my name's Flash Gordon -- can you understand me? We're from EARTH -- we come as friends.  Hi!  Thanks, Doctor -- next time I'll call my own play.  What are you doing?   You got us into this -- HOW DO WE  Dr. Zarkov, I'm about to show you what it feels like to be clipped by a New York Giant --  I'm Flash Gordon of the New York Giants this is Dale Arden -- Dr.Zarkov hijacked us in an effort to save  But why? What in hell have we ever done to hurt you?  Oh no you don't! We came together and we're STAYING together!  Watch out! Behind you!  I can't -- I just can't --  Clobber a woman, Dale --  Hit what water?  You're saving my life. How can I Thank you?  Let's get one thing straight -- I've got to find Dale and that nut Zarkov too -- rescue them and try to save Earth too.  I'm no good at lying.  What's that?  Listen, where's he got Dale?  I can't! I mean I hardly know her,  What?? Marry her? What are you talking about?? 28.  Can I honestly?  Here we are where?  Those are ROCKET SHIPS in there! I can't fly a damn rocket ship!  Some lucky people live on that one too?  Why don't they team up and fight him?     Sue -- but that wasn't a team effort.  Why? 33.  You can really transfer your thoughts with that? Like I could get in touch with Dale?  Please.  That's right, Princess ··· and we're not pulling out until you put that gadget over my head and tune me in to Dale Arden!  Dale, it's me -- Flash! Am I with you?     No, Dale -- you're not dreaming I'm Flash -- I'm with you and you are with me!  Are you receiving my thoughts?       Speeding for the Kingdom of Arboria to get help! I'm in a spacecraft with Aura, Ming's daughter!  Listen, she means nothing to me -- not a darn thing. Where are you, Dale?    No! Where's Dr. Zarkov?  Fake 'em out! 36.  Just fake 'em out, Dale -- girls know how. But don't go too far. I mean get to Zarkov and release him, I'll have help by then -- I'll find you. Can you do all that?  Dale, you're some girl -- God, you really are. Do you get what I'm thinking now?  Dale, we're gonna get out of this jam -- I swear we will -- I'll find you, and when I do we'll -----      Sorry. I guess landings aren't my thing.  Where's Robin Hood?  It doesn't matter. How do we get down.   Making their way swiftly through it between earth and heaven, crossing this green world on branches and trunks of monster vines. FLASH pauses.  Listen -- are you sure this Barin will help me?  It's amazing -- I dreamed of this tree-house when I was a kid --        These are the guys who are gonna help me?    I know just how he feels -- we played the Pittsburgh Steelers last year.      I'm from Earth, Prince Barin. My friends and I were Ming's prisoners. She kindly brought me here to enlist your help.    Keep me for.....???? Oh, my god. I trusted you.  I'm not your enemy, Prince Barin. we share a hatred of Ming 44.  45.  I think I'll pass on this one.     Would you give Dale a message from me? Tell her I'm sorry how things have panned out -- I Loved her.  What the hell? Forget it. Sending that message by you is like sending a lettuce-leaf by a rabbit.  Whew! -- Your turn, Prince Barin.  What are you waiting for?  Boy. You oughta be handled with a forked stick yourself.         They run through the green tangle. FLASH trips over a vine. TIGER MAN picks him up.  You can speak?  Have we a chance, Tiger Man?  What do you mean?  Damn. End of the line.     How far will this take us?  Blue. We call is blue. 50.  Which way to the border:  What's the point of all this killing? Why don't we team up and overthrow Ming?  Where's Dale?  Dale baby!  Yes -- it was me --  Every thought, baby! --  We're all Ming's prisoners. I say let's team up and smash him.  Well, back home it's what I'm paid for -- I called a pretty good game against the Dallas Cowboys once ---  Oh god -- here we go again --     I've got to.     61.    Quite a lot!              Try to catch my wrist! -- the other one.    Guess the first thing you and me are gonna do after we land..!  Gonna do it first thing -- around here, never know if you'll get another chance! 65.  I'm coming, Dale!  Follow her -- climb!  Let him go -- I understand.  Thanks anyway for getting us this far!  67.  What's the game-plan?  Not unless you get out of my way, I  Vultan! Do you read me?  Flash Gordon calling Vultan! Over!  Okay, don't answer -- I'm on Hawkman frequency I know you are reading me. Now get this --  I'm being guided through the force- field under their control. You're on the beam when you've got the tops of two towers lined up exactly -- the high gold one behind the green one with the blue flag got that? Okay, Vultan, it's your decision the ball is in your court -- I hope I'll be seeing you, you crazy ole bird.          Which way to the dungeons, Soldier:  I am the ghost of all the good men murdered by Ming! Prepare for doom!  It's me! 74.  Anti-gravity shaft -- I got a guard to show me --  Nothing's easy on Mongo --  Cavern is sealed tight -- every door locked from the inside --  The cavern first! Gotta get Zarkov in there to --  On my god! 79.  With this ring, I thee wed!  Run!!!  From the crystal block.  How about that?  What's the matter, darling?  Zarkov is right.",
        "Gordon": "",
        "Barin": "I scent a Tiger Man near the lodge! Form battle lines above and below! 41.   ANGLE - BARIN advancing by himself, HEARING the triumphant SHOUTS of his men.  Not him! Bring him back for sport:  Aura! 42.  Angry at you?    You'll stay the night?  Get me a sword --  This is the fiercest Tiger Man we have ever hunted. I'm going to kill him now -- and dedicate his blood to you, my beloved.  I know you, Aura -- the more a man risks, the greater your passion. If I knew a greater risk, I'd take it.  What in hell? My help?    What? What are you saying?  I'll hide him, all right -- under six feet of Arborian dirt!  Snake keeper! Rouse your beast!  Who dares the beast?  I did him a mercy. This venom brings death only after long tortured madness. Your turn, Earthling.    There are six openings to the serpent. Five are safe -- the sixth is death. Choose one -- or take your end from my sword here and now.  Go again.     Fooled you, didn't I?  If I were you, I'd choose the sword --     A mere toy of yours, eh?  The hunt's on, my Tree Men!  Up and across we'll cut them off!     I saved you because your death must be mine.     Will you do that, Vultan?  Yes -- I would hunt you down and kill you without mercy.  Not a word. I was hunting him when you seized me. Before you finish me. Vultan I beg only that you let me finish him.  I had you in bow-sight you were dead!  Ready for me, Earthling?  What do you now of Aura?          A force-field covers the whole city, from here to here. With luck, Flash can lure them into lowering their defenses.  Ming destroyed your kingdom!  Vultan!  Look -- he still casts a shadow:  Zarkov! What have you done? 68.  This won't be easy, Flash --  How's it look to yoU?  You're blinded, Klytus -- drop your sword!",
        "Kala": "",
        "Munson": "Dr. Zarkov! Look at the report from the last balloon! 5.  Yes, sir -- you sure did. And this funny sun too ---  Sir, the President is on the TV behind  Go where?  You're crazy!  So what's it matter if I'm shot or go up in that thing? I'm a goner either way, right?  Goodbye, Doctor -- they were all right about you. Have a nice trip.",
        "Dale": "Will you SHUT UP? (as FLASH's head  Thanks a lot -- I look dumb enough to take candy from a stranger?  Who doesn't. Number one draft pick, cover of PEOPLE mag -- what'd the GIANTS sign you for, eighty-nine million? Big deal!  God, I hate flying -- I'm Dale Arden it's crazy of me to hate flying -- I'm a travel agent, you see? -- I've just been checking out a little hotel in Vermont -- can I still have that candy bar?  Are we going backward?  Holy cow! Look at the clouds!  Can you fly it?  Oh boy! Ever hear about the man who fell ninety stories from a window and didn't break a bone?  The window was ninety-one stories up!  I'm terrific. Flash Gordon, you have just made me a Giant fan for life.  You're Dr. Hans Zarkov!  I saw you in PEOPLE mag. After you left NASA, remember? It said you were utterly ---  I forget what it said: Flash, let's find some other phone, okay? I'm sure Dr. Zarkov is very busy.......  Look, Doc -- I don't book kamikaze tours -- never.  Flash! Sack him! 12.  Don't. Suddenly I like it in here just fine --  Just do what I'm doing. Flash --  Shutting my eyes -- dreaming I booked us to Disneyland.   You're mad.  Flash, it's no use - he's too crazy!  Watch it, fella -- you came with me!  You dirty old bastard can kill me too!  My God -- and I thought that book was another rip-off-     What's the play, Flash?  Can't what?    Help!! 23.  Flash!!  What is it -- some rotten drug?  Flash! Where are you??  Say, this stuff isn't bad at all.     I'm dreaming.  I'm receiving something -- 35.     Where are you Flash?  What? That bitch? Don't trust her! She's after you!  Naked in a bathtub.  I'm being fixed up for Ming.  Chained in a dungeon, I think. What'll I do, Flash?  How?  Sounds like fourth down and about ninety yards to go, but I'll try.     Very.  No, thanks. Just turn down the light a bit, would you? I'm shy.      They are inside, she watching tensely as ZARKQV throws switches and eyes displays.  Will it fly?  It has-to fly! We gotta rescue FLASH from that vampire before she -- 53.   Come diving out headlong into the grass.  What happened?  My God -- your hands! Your hands are gone!  Does it hurt?  Watch out, you old bird -- Ming wants to marry me.  Flash! Oh darling!  Flash -- when I was in that tub --  Did you mean it?  Is everyone on Mongo CRAZY? Haven't you guys ever heard of TEAMWORK?  Flash - don't do this.  Why?  I'm so homesick -- what I wouldn't give for a nice quiet night with some muggers in Central Park --    Flash!!    Flash, I love you! Win for me, Flash!??  Darling not in front of the Hawkmen -- you'll make me blush! --     Help!!  Fit me with what?    Nooo -- it's not true!  Oh Flash -- no -- you can't be dead -- it doesn't make any sense --   I don't believe you. You -- you awful Mongo person -- you were born without a heart:  You poor kid -- don't you have a MOM to talk to?  God, Aura -- no wonder you've had problems -- that bastard:       Flash!!!     Flash -- look out -- you're coming back! He can see you now, Flash!  84.  Look -- Earth!  Oh it's so beautiful!  We saved Earth but we lost the capsule -- we'll never get home again. 85.",
        "Arden": "",
        "Arborian": "",
        "Priest": "Do you take her, this Earthling, Dale Arden, to be your Empress of the hour? Do you solemnly promise to use her as you will -- not discard her until such time as you grow weary of her?  The wedding ring, please --  Recite after me -- with this ring I thee wed --",
        "Serving": "He is coming to see you now. Are you ready? 38.  Do you need any more of this?",
        "Girl": "He is coming to see you now. Are you ready? 38.  Do you need any more of this?",
        "Fico": ""
    },
    "imdb_rating": "6.5",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BN2Y4ZDBjMjEtZWQ0OS00NzYyLTg0M2ItMmUzYTEwN2RmMGVlXkEyXkFqcGdeQXVyMjgyOTI1ODY@._V1_QL75_UX380_CR0,11,380,562_.jpg",
    "description": "American footballer Flash Gordon is thrust into the journey of a lifetime: joined with Dale Arden and Dr. Hans Zarkov, the three earthbound space travellers will soon become the first humans to encounter alien life, and try to stop the tyrannical alien warlord Emperor Ming the Merciless from destroying the Earth.—Johnny-the-Film-Sentinel-2187",
    "name": "Flash Gordon",
    "genres": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ]
}