{
    "filename": "Frankenstein_script.txt",
    "imdb_id": "tt0021884",
    "imdb_url": "https://www.imdb.com/title/tt0021884",
    "characters": [
        "Complete credited cast:",
        "Little Maria",
        "Baron Frankenstein",
        "The Monster (as ?)",
        "Henry Frankenstein",
        "Elizabeth",
        "Victor Moritz",
        "Fritz",
        "The Burgomaster",
        "Doctor Waldman"
    ],
    "dialogues": {
        "Little": "Yes, Ma'am.",
        "Maria": "",
        "Baron": "",
        "Frankenstein": "",
        "Henry": "I was just clearing my throat.  You know, you're quite mad.  (matching Victor's tone  Of course I am. It pays to humor the insane.  Henry Clerval.  I know. You have a way of making an impression.  Come now. Magnus? Agrippa? Next thing you know, you'll be teaching toadstools to speak.  Dilettantes need not apply. What about you? Schiller, isn't it?  Really? I myself find sick people rather revolting. I'm here to secure my degree with a minimum of fuss and hard work that I might settle into a life of privilege treating rich old ladies with gout and dallying with their daughters.  Can you think of a better reason?  Do me a favor then... ...keep them to yourself.  The entire school heard it. It wasn't something one could miss.  What now? Writing about it in your journal won't help.    ...yes, and thanks to him, smallpox has been virtually eliminated. I've heard this speech before.  It smacks of magic.  Come now, you must take some satisfaction. You've risen to the top of your class. A position of prominence and regard.  Leave off!  Your Elizabeth must be quite a treasure, Victor ...to justify these prices.    You're saying all disease will eventually be eradicated?    Thank goodness. We'd be out of work.      Professor?  They just caught the man who did it.  They'll hang him all the same.  Keep your voice down. You don't know what you're saying.  You're making a scene!  You can't. Death is God's will!  That's blasphemy!  All the more reason for us to continue his work with the poor!  There are sick people who need our help. Here and now. Not in some future time. Consider that.  Victor. This has got to stop. Nobody's seen you in months. You haven't attended a single class.  We all know how hard you took Waldman's death. Even Krempe is sympathetic. But it is time to move on. It is time to concern yourself with life.  How much longer?  God's sake, what is that stench?  Things have gone worse with this cholera outbreak. Thousand new cases a day now. Classes have been suspended. University's shut down.  Listen to what I'm saying. The militia's arriving to quarantine the city. Most of us are getting out while we still can.   Schiller? You're leaving? Where's all that high talk about treating the sick?  Victor!  Thank God your fever broke. Slowly, now. Just a sip. I've been worried we might lose you. It's been touch-and-go for a week.  We feared cholera. Turned out to be pneumonia, brought on by nervous exhaustion and some idiot running around in a storm.  Mine and Professor Krempe's. We've been trading off nursing you in shifts. The rest of the time we're out working with the cholera victims. It's his turn for that just now.  We catch a few hours sleep where we can. Usually here at your bedside.  Nothing in moderation, Frankenstein.  It's the down-and-outs I pity most. Those who can't fend for themselves. They'll be dead by the thousands before this is done. They don't stand a chance out there.  Victor. This place looked like a charnel house. What went on here?  It'll be months before you're well enough. Meantime, your family must be frantic not hearing from you.  I found these. Some of the postmarks go back nine months. Why don't you open them? And when you've the strength, have the decency to ease their minds with a reply. Soon as the city ends quarantine, I'll even mail it for you. Along with this. It's a beautiful gift. Does her no good lying here.  A woman like that is far too rare to be taken lightly.  Our carriage is here.  Quite a place.  For what?  I am cautiously hopeful. With quiet and proper care he may eventually regain some or most of his strength.  What happened up there?  I prayed never to see these again...  Whatever they are.  I won't bother asking what or why. You wouldn't tell me anyway. I just hope you know what you're doing... ...because if this is a repeat of Ingolstadt, I won't be around to pick up the pieces.  Yes, don't worry. I'll look after your father. You look after her.  Only if you'll tell me who he is.  Victor.  Let it go.",
        "Elizabeth": "Are you sure it can't hurt us?  She'll be all right.  Oh God. The blood.  It's not ours to decide. All that live must die. It's God's will.  She was mother to me as well. But ours is the job of the living. It's up to us now to hold this family together. We must think of Father and be strong for him. I cannot do that alone.  He left a beautiful gift in her place. A baby boy. To cherish and love as our very own. Your brother  There, there... shhh...  Victor, have a care! You'll make him dizzy!  Oh, do give him here! He needs to be comforted and held!  That's the nature of all progress, William. Don't let your brother sway you otherwise.    Scandalous! What would your dear mother say?  And you look so lovely.  Go on, ask her. Please. I'm quite out of breath.  Smell the air. Wonderful.  Father's so proud.  Prouder still. You'll be the handsomest student there.  You will. What do you want, Victor?  No. Just very earnest. And very dear.  All my life I've known.  Is that what makes it so delicious?  Brother and sister still?  I wish to be your wife.  If only I could. But one of us must stay. Father's not strong. Willie's just a child. Who can look after them in your absence? Who can run the estate?  I will be here when you return.  My head is spinning. I want to give myself to you.  If we're to be married, must we wait?  Not as weak as I.  Our decision. Together.    Victor. I love you,  Let's return a tenth of the crop to the tenants. They had a hard winter.  Then there's no need to tell him, is there?  ...and not a day goes by that I do not cherish your faces in my mind's eye or ache to see you all again. Be assured that I am with you in spirit, and you are never far from my thoughts. I remain, as always, your loving and devoted Victor. P.S.     It says, give Willie an extra big hug for me.    He was almost expelled for calling one of his professors a \"pompous... Fellow...\"    It's far too ghoulish for your young ears.  The point is, your brother is a brilliant student well on his way to becoming the finest-and most compassionate doctor ever...  Nothing. Still nothing.  Something's wrong. I know it. I've heard rumors of cholera spreading south from Hamburg.  I should go. I should leave today.    Who? Victor?    Let this locket be a token of the vow we took the night I left. He's coming home to marry me.  Willie, it's not a toy for your friends.  Don't dawdle. It'll be dark in a few hours.    Is he not back yet?  It's far too late for him to still be out.   What is Father's outlook?  Thank you, Henry.  Justine and I grew up as sisters. I know her better than anybody.  William was as much her child as mine. We were both mother to him. I believe she would sooner have strangled the life from her own body.  I consider the charge imbecilic.  But why risk yourself? Hasn't this family suffered enough?  If what you say is true, it is a matter for the police!    I thought I'd never see you again!  What sort of task?  What of our marriage? Victor, we've had so much tragedy. I want this family to live again.  We need each other now, I need your comfort and strength, not separation and solitude.  Why the change? What about your work?  It is  Does this have something to do with that man you saw?  Victor, tell me why! Trust me!  You're soaking.  Brother and sister no more.    Victor!  You don't want to hurt me.      Vic... tor?",
        "Victor": "Frostbite. Gangrene. A simple diagnosis.    Ah. An explorer.  I heard.  Creature? A... human like creature?  Your men are right to be afraid.  You'd persist at the cost of your own life? The lives of your crew?  Do you share my madness?  We are kindred, you and I. Men of ambition. Let me tell you all that I have lost in such pursuits. I pray my story will come to mean for you all that is capricious and evil in man.    I loved her from the moment that I first saw her.  Don't cry, Elizabeth.  We'll build a fort. So the lightning can't get us.  Nothing can. Not ever.  Mrs. Moritz.  Mother?  As a boy, I stood at this window and watched God destroy our tree.  Father?  How could all my father's knowledge and skill fail to save her?  What kind of God is He to will this?  God took her from us.  Our brother.  The world is a dizzying place.  He needs to vent his outrage to the skies! Make yourself heard, Willie! Learning to walk is not an easy thing! Why should it be so?  Don't listen, Willie. Progress is a feast to be consumed. Women would have you believe you must walk before you can run. Or run before you can waltz!  Devil take walking, ladies! My brother shall learn to waltz!  But never your equal.  Quite a send-off, isn't it?  And you?  I'll have to do better than that.  To be the best there ever was. To push our knowledge beyond our dreams... to eradicate disease and pestilence... to purge mankind of ignorance and fear...  I'm not mad.  I've loved you all my life  This feels... incestuous.  I wish to be your husband.  Then come with me to Ingolstadt. Marry me now.  Only you.  You make me weak.  Your decision. For us.    Elizabeth. My more than sister.  I'll make you so proud, Mother.  We never finished our dance. Someday we shall.  The others will look to you while I'm gone, Willie. Be strong.  Elizabeth.  This will do nicely.    Those which stir the imagination as well as the intellect. Paracelsus, for one.  Or Albertus Magnus. Cornelius Agrippa...  Victor Frankenstein, sir. Of geneva.  Very well then.    Are you having me on?  Victor, Victor Frankenstein.  Do you really think I'm mad?  I'm afraid I rejected his application. He merely dabbles.  Rich old ladies and their daughters?  Quite a few.     That's no excuse for being a pompous ass!  You're a comfort to me, Henry.    Professor Waldman.  Krempe has a way of provoking my temper.  To say the least. I came here to expand my mind, but honest inquiry seems strangled at every turn. All we do is cling to the old knowledge instead of seeking the new.  No, I embrace it... as something to be used or discarded as we advance the boundaries of what is known.  These are exciting times, Henry. We're entering an era of amazing breakthroughs. Look at Edward Jenner. He wasn't content to bleed people with leeches, he pioneered a new frontier of thought  But you haven't listened, Never in history has so much seemed possible. We're on the verge of answers undreamt of... but only if we have the courage to ask the questions.  Preposterous.  It's utterly fantastic! This is the sort of thing I'm talking about! We should be learning this!  But the possibilities. Combining ancient knowledge with new? Something like this could change our fundamental views!  I doubt that decision is still mine to make.  Why?  ...and I further wish to extend my sincerest regrets to Professor Krempe for my display. My behavior toward him was both rash and inexcusable.  Numbers four and twelve directly into the nervous system?  ...and the medulla oblongata is the transition between the spinal cord and the two parts I've already named... cerebrum and cerebellum. Any freshmen feeling queasy yet? All of you, from the look of it. We'll resume your torture tomorrow.  Despite the lack of challenge.  The strain was evident.  What keeps me going are my friends.  Only you would think of that!  I tell you what we need, my friends. Forget the symptoms and diseases. What we need is a vaccine for death itself.    He was a frightened soul who acted out of fear and ignorance.  Good. I'll be there to hear his worthless neck snap.  It was wrong, Henry! It shouldn't have happened! The bastard deserves to die.  Why Waldman? He of all people should have cheated death!  I resent God's monopoly.  Blasphemy be damned! Waldman spent his life trying to help people!    Life and death. Why should You alone have the final say?  To understand the causes of life, we must first have recourse to death... and examine the process in minutest detail...     No longer pathetic and useless            I've been preoccupied.  That is my concern. I'm involved in something just now. I want to finish it in Waldman's memory.  Few months perhaps. I'm gathering the raw materials even now.  Materials. That's all they are Tissue to be re-used.            That one.        Not optimal. Must use. No time to replace. Body can't wait.     I stitched it together with my own hands...     A patchwork man of my own devising.      It took nutrients like a child receiving milk... blushed like a young girl with the blood I forced through its veins...  ...all in preparation.      This is a bad time, Henry. I'm busy just now. What do you want?  Yes? And?  You'll be leaving then. Just as well. You never were cut out for this, Henry. Goodbye.         Time running out. Rate of decay accelerating. Must strike now... or start again from scratch.  (muffled through the glass  It's alive. It's alive.  What have I done?   Massive birth defects. Result is malfunctional and vile. Have chosen to abort.          Stay away!             A... week?  Is that your diagnosis?  You've been going round-the-clock?    (thinking of his creation  I want to go home.  It can't survive.     \"...but it's been so long since I've heard from you. Remember the vow we took the night you left? You must be honest with me if your feelings have changed. Answer for the sake of our friendship, and both our future happiness.\" She wrote that four months ago.     Thank you, Professor. For everything.  Take me home, my friend.  There! Look!  Thank you, Henry.  This. My home. My family. If not for you, I'd be dead in a burial pit somewhere.  Elizabeth?    Who is it?  Yes.  Did you?    I always viewed her with brotherly affection. I had no idea of her feelings for me.  But to commit so ghastly and terrible a crime against a child she loved?  It's hard to believe.  Oh God. Oh God! No! NOOOOOOO!  Oh God. Justine. Forgive me.  My mind was not playing tricks. He was there in the storm... gloating over his crimes... challenging me to come.  I've no choice  They've done a fine job. Hanging an innocent for the crime of a fiend.  I know only that he is a killer. And I shall bring back his carcass.   You speak.  How did you find me?  Kill me and have done with it.  Then why am I here? What did you want with me?  Fine words from a child killer. You who murdered my brother.  How dare you. You're disgusting and evil.  I see it before me.  There was something at work in my soul which I do not understand.  Materials. Nothing more.  Trace memories in the brain, perhaps.    What can I do?  Friend?  Like you? Oh, God, you don't know what you're asking.  And if I consent?  Yes. I want this over and done with.  I'm all right. I'm safe,  I didn't find what I was looking for.  At shadows. My nerves got the better of me.  It's not something I can explain now. Perhaps someday.  So do I.  A month at most, that's all I ask. Elizabeth, please. Things have not yet resolved. I must take steps to see that they do. For our family's sake. For our sake. You are life itself. We shall seal our vow. The moment I am done.  You must regain your strength to preside at our wedding... and spoil your grandchildren later on. These are duties you cannot shirk.  We're all safe now. I promise  God forgive me.  Why... her?  My words.  The brain stem was destroyed by the hanging. We'll need another. The body looks like it will do, but some extremities are too decayed. They'll have to be replaced. The fresher the better.  What is this?  This was not taken from a grave.  No. I draw the line.    No. Not tomorrow, not next week, Marry me today.  It was misguided and pointless. Is your answer yes?  We'll leave this afternoon, right after the ceremony. Pack only what you need.    I do. But you must trust me for now.  Be especially on your guard. Stay cautious to a fault.  He is huge and deformed... and quite insane.  Are you sure you'll be all right?  I'll be back as soon as I've got her far away and safe. We'll hunt this fiend down together.    Damn it  Make sure you keep your pistols dry  Now husband and wife.  I remember the first time I ever saw you. Crossing the floor of the grand ballroom with my parents at your side. So beautiful even then.  Open this door for no-one!  Elizabeth.     Live.  Say my name.  Elizabeth. Say my name. Say you remember. Say my name.  You must. You must.  Say my name. Say you remember.  Yes. I'll help you remember.  ...one-two-three, twirl-two-three.  She's not for you.  Elizabeth, no! Say my name.    You killed her! You killed her!  All that I once loved lies in a shallow grave. By my hand.  You should have been my father's son. He would have been so proud.     I followed his trail north... always north... and always one step behind... never stopping... driven by my fires of rage... and revenge...  A year now I've followed him. Perhaps more. Only to arrive at this place. Tired. So very tired. I never did find... whatever it was... I was looking for... and neither will you, my friend. Value life above ambition... or those glittering prizes you seek will crumble to dust in your fingers... as they have in mine. See your loved ones again. I cannot.",
        "Moritz": "Of course, Doctor. Madam. Come along, Justine. Bring your dolly.  You must lead, Victor. The lady will always look to you for guidance, so your steps must be sure and strong...  ...aaand, one-two-three, one-two- three, twirl-two-three...  Nonsense, Justine. Hush. And now a sweeping arc about the room! one- two-three, twirl-two-three.  ...one-two-three, twirl-two-three... Excellent! You'll be the envy of all the young ladies and gentlemen!  Justine. Surely you can maintain better time than that.  You can do nothing here. Wait downstairs.  Justine! Pay attention!  Sir. I'm terrified for my girl.",
        "Fritz": "",
        "The": "Mrs. Moritz, would you and your daughter excuse us?  Victor. This is Elizabeth. She's coming to live with us.  She has lost her parents to scarlet fever. She is an orphan.  You must think of her as your own sister. You must look after her. And be kind to her.  Victor. Elizabeth is frightened by the storm. Go comfort her.     Victor, do as you're told!  I did everything I could.  My friends, fatherly pride won't allow this occasion to pass without my raising a toast.  To Victor. My son. Who read every medical book in my library by age thirteen... and then re-read them, which seemed excessive even to me. Drape yourself in glory, my boy. Study well.  When you return, you return a man of medicine. I will then be honored to call you \"colleague.\"  No. You'll surpass me.  Write to us often.  He always was opinionated.  That's where they cut things open and peer about inside.                           I wish we could thank our benefactor.  It does no harm.  Who's there? Felix? Children?  Let them play. There's plenty of wood for the fire.     I know you're there. Won't you speak to me?         Would you like to sit by the fire?  The music? Or the fire?  I'm glad you finally came to the door. A man shouldn't have to scurry in the shadows.  Why?    I can see you with my hands. If you'll trust me.  You're an outcast.  Friends? Do they live around here?  Why do you not go to them?    Perhaps I can help. Tell me who.  Leave him alone!  What's all the fuss? Why are you shouting?  Open it.  What does it say?  Brilliant! I knew it! Ever since you were children!  Join us for champagne! My son is coming home!      Have you seen Willie?  Claude rode over there to see if held lost track of time. They say he never arrived.      This is not... the grand wedding... I had hoped to give you...      Victor?",
        "Burgomaster": "",
        "Doctor": "",
        "Waldman": "You have a way of provoking his. I've been watching you. You seem impatient with your studies.  You disdain accepted wisdom?  I understand your frustration. I was young once myself. Walk me home. Something I'd like to show you.      You know for thousands of years the Chinese have based their medical science on the belief that the human body is a chemical engine run by electricity? They say we all contain streams of energy which flow through us like currents in the ocean, or rivers in the earth.  Their doctors treat patients by inserting needles like these into the flesh at various key points to manipulate these electric streams.  I once saw it done, as a boy in Canton. My parents were missionaries. The cure was nothing short of miraculous. I've never forgotten it. Been fascinated ever since.  Magic. Seems alive, doesn't it?  Electricity.  Why? God alone knows what it means. Until it has proven value, it's nothing more than a ghoulish parlor trick. Hardly fit for the classroom.  It is a thrilling direction to explore. Thrilling and dangerous. Nature can be wonderful and terrible. Science is not a realm for the reckless; it needs a conscience. We must proceed cautiously. Assess as we go. What I do on my own time is my own business. The same holds true for you. You wish to expand your mind? Fine, do so. You can even join me here, if you like. But not at the expense of your normal studies.    \"...a sincere and heartfelt apology which you will then read aloud to him before the assembled student body and faculty.    Go home, Victor. Write the letter,      Re-configure the leads?  Worth a try.  Victor. He was trying to be gracious.          I'm quite serious. Look at all the charity and clinic work we do. Up until thirty years ago, the concept of vaccine was unheard of.  I'm convinced. Not by treating symptoms, but by diving nature's most jealously-guarded secrets.  No. But someday.    No, it's not pox, it's a vaccine...  ...vaccine, from the Latin vacca, meaning cow ...or vaccinia, meaning cowpox...  ...no, no, cowpox in a minute quantity, perfectly harmless, gives you a natural immunity to small ox, which is the point of this whole bloody exercise...  I most assuredly am! It prevents disease and it's the law! Why am I explaining myself? Somebody restrain this damn fool!"
    },
    "imdb_rating": "7.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTQ0Njc1MjM0OF5BMl5BanBnXkFtZTgwNTY2NTUyMjE@._V1_QL75_UX380_CR0,3,380,562_.jpg",
    "description": "The 1931 horror movie \"Frankenstein\", tells the tale of when Henry Frankenstein who is a doctor, trying to discover a way to make a living human using human body parts from the recently deceased. He succeeds, but his creation is looked upon as a monster by the local inhabitants, who wish to destroy it.—The Professor",
    "name": "Frankenstein",
    "genres": [
        "Drama",
        "Horror",
        "Sci-Fi"
    ]
}