{
    "filename": "Frankenweenie_script.txt",
    "imdb_id": "tt1142977",
    "imdb_url": "https://www.imdb.com/title/tt1142977",
    "characters": [
        "Complete credited cast:",
        "Bob's Mom (voice)",
        "Mrs. Frankenstein /Weird Girl /Gym Teacher (voice)",
        "Bob (voice)",
        "Mr. Frankenstein /Mr. Burgemeister /Nassor (voice)",
        "Elsa Van Helsing (voice)",
        "New Holland Towns Folk (voice)",
        "Victor Frankenstein (voice)",
        "Mr. Rzykruski (voice)",
        "Edgar 'E' Gore (voice)",
        "Toshiaki (voice)"
    ],
    "dialogues": {
        "Bob": "My dad got hit twice.     Mr Whiskers leaps onto a garbage can, and clambers up onto the roof to safety.  Sparky unable to follow is distracted by a fly buzzing around the knocked over garbage can. He gulps it down and then suddenly stops. He feels a funny tickle in his throat, neck and tummy before the fly emerges from the stitches on his side.  Sparky continues to chase the fly into Bob's yard where Bob's Mom is hanging out the laundry.  As she turns, she sees Sparky's shadow cast on a bed sheet. The shadow is double his size and his teeth look huge. Bob's Mom thinks it's a hideous monster and runs screaming into the house.   What! *screams*   Toshiaki and Bob stand in the door way of the garage examining E's jar with healthy skepticism.   Aaah!  It bit me.   Yeah, well, our science fair project is even cooler.  Sea monkeys. We gotta come up with something better. Bigger.  The science fair is in two days!  You're the smart one.   Bob's Mom is having a drink in the garden. She slurps the last few drops before she heaves herself up to go inside for a refill.    Are you sure this is going to work?  Do we have to collect it on me?  No.  We could use a test dummy or something.  Computer simulation.  I have to pee.  Whoah, woah, w-w-w-woah woah, whoah, woah, woah, woah.    *Painful murmurs*  *Scream*  What were you boys doing on the roof!?  Science.  The man is a menace!  Mr. Rzykruski knew a lot.  I can't believe I broke my arm for nothing. None of us are going to win. E has an invisible fish.  Cool.  Victor! I need your help.  Sea Monkeys. You know how on the package, they're like in a happy kingdom and everyone's smiling?  They're not like that at all.  I asked him first!  Yeah.    He's right.  Freshwater!  Cool!  He's killed the little girl!  It's Elsa!  Give it more juice!",
        "(voice)": "",
        "Toshiaki": "But it's not rare. Lightning happens to people all the time here. There's a thunderstorm almost every night.  I heard it was a cemetery.  Nice catch Sparky.  Yes.  How are we supposed to see an invisible goldfish?  Let me see it.   Double top secret.   Toshiaki and Bob take a critical look at their science fair project: SEA MONKEYS - THE TRUTH REVEALED!        I know.  I know.  I know!   Bob is nervous.    Looking back over his shoulder...   No. That's why it's called an experiment. We have to collect data.  Ready?  Ten.    Nine.    Eight.  Seven.    Six.    Five.  Four.    Three.    Two.  One.  Science.  You're saying he faked it?  That fish you showed us, was it real?  Impossible.  He brought back Sparky?  Hmmmm.  You say you know Victor's secret. Now is your chance to prove it.  Interesting.  Ah-but I do.  Shelley.   Toshiaki exits the gardening shed and walks over to his bundle. He attaches two clips and hooks these up to a kite by using a series of extension cords.     Lightning surges down from the heavens, striking the disinterred bundle. The turtle bundle explodes. Toshiaki ducks for cover into the garden shed.     A bottle of Miracle-Gro lies empty on the grass. Toshiaki steps out of the garden shed and walks over to the scorched patch of grass. He looks around the garden.   Shelley?  Victor!     I need your help!  My problem's bigger!  Aaaaah!  No, no, no! Stop you put me down- I gave you life!  Victor! Victor I need help please."
    },
    "imdb_rating": "6.9",
    "description": "When young Victor's pet dog Sparky (who stars in Victor's home-made monster movies) is hit by a car, Victor decides to bring him back to life the only way he knows how. But when the bolt-necked \"monster\" wreaks havoc and terror in the hearts of Victor's neighbors, he has to convince them (and his parents) that despite his appearance, Sparky's still the good loyal friend he's always been.—Kathy Li",
    "name": "Frankenweenie",
    "genres": [
        "Animation",
        "Comedy",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BY2QwM2QyOTMtYTM5Yy00NzNlLWIzM2MtZDI1YjlmZTc0MmI3XkEyXkFqcGdeQXVyMTQyMTMwOTk0._V1_QL75_UY281_CR4,0,190,281_.jpg"
}