{
    "filename": "Freddy-vs.-Jason_script.txt",
    "imdb_id": "tt0329101",
    "imdb_url": "https://www.imdb.com/title/tt0329101",
    "characters": [
        "Dr. Campbell",
        "Gibb",
        "Jason Voorhees",
        "Trey",
        "Bobby Davis (Mark's Brother)",
        "Mark Davis",
        "Deputy Scott Stubbs",
        "Blake",
        "Kia Waterson",
        "Lori Campbell",
        "Bill Freeburg",
        "Freddy Krueger",
        "Will Rollins",
        "Mrs. Pamela Voorhees (Jason's Mother)",
        "Charlie Linderman (as Christopher George Marquette)"
    ],
    "dialogues": {
        "Dr.": "",
        "Campbell": "",
        "Gibb": "",
        "Jason": "by Lewis Abernathy    Jason! Git your ass over here!  Jason jumps at his father's voice, hesitates only slightly, then runs toward him, stopping abruptly several paces away.    What did I teach you, boy? Don't ever take your mask off out in public. I don't want nobody to see that ugly mug of yours.  Jason stands, looking at his bare feet. His father smacks him upside the head, shoving him towards the woodshed.    Go git in the woodshed.  Jason's pace slows as he enters the dark shed -- he knows what's coming next.    Drop them overalls and lay over them logs...  Jason slowly complies as his father loosens his belt. Suddenly, JASON'S MOTHER is just outside the doorway, calling:   Jason! Come here!  Jason gives his father a sideways glance, then scurries towards his mother.   What are you doing woman?  Jason's mother gives him a mason jar stuffed with dollars and change.   I saved up some money... I want you to take and go on up to that summer camp just up the road. Tell the man you want to stay there.   Just what the hell do you think you're doing, bitch?!   I'm sending him away for a few weeks.   You ain't sending him nowhere.  Bring me that money, boy!  Jason holds his ground for a second, unsure whom to obey, when his mother shoos him away.   Go on now... go!  Jason takes off up the road.  His father sneers:   Goin' ag'in me? I'll take you to the shed, woman!  Jason's mother pulls a knife from her apron.   You ain't ever taking anyone to the shed ever again.  Jason's mother charges at her husband, shoving him back into the shed with the knife.  Jason looks back. Through the open window he sees his mother's arm coming down repeatedly with the knife, his father's arms flailing helplessly.  Then both disappear from view.  After a moment his mother appears in the door- way, spattered with blood.  She smiles and waves to him, calling:    Go on, son... have a good time! Mommy will come and git you some day soon!  Jason turns and runs to...",
        "Voorhees": "",
        "Trey": "",
        "Mark": "",
        "Davis": "",
        "Blake": "",
        "Kia": "",
        "Waterson": "",
        "Lori": "",
        "Bill": "",
        "Freeburg": "",
        "Freddy": "by Lewis Abernathy    Where ya been all my death, baby?  Meagan screams.  Freddy leaps out of the casket in a tuxedo, crooning:    I've been waitin' at the altar for a long, long time!  Meagan looks down -- she's wearing a wedding dress, spattered with blood.  Behind her, the chapel has filled with dozens of DEAD PEOPLE in various stages of decay.  A SATANIC PRIEST appears in the pulpit and asks:   Well it ain't Raggedy Ann, bitch!  The Freddy doll flashes it's tiny glove of knives, thrusting them deep into Meagan's chest.    Murdoch gets into the command car, sitting down next to the S.W.A.T. COMMANDER sitting behind the wheel.   Aww... all dressed up and nowhere to blow!  Meagan screams, clutching at the last few tiny strands of cloth that cover her body.  She calls to Jesse, pleading:   Looks like a photo opportunity to me!  Freddy pulls out an over-sized camera with a gargantuan flashgun attached.  The flash bulb is the size of a beach ball and has a nuclear warning etched in the front.  Freddy sizes Meagan up in the viewfinder and sneers:    Say... cheesecake!  PHOOMPH!!! -- the flash bulb goes off with an atomic light.  Meagan screams as her skeleton is blown back against the blackboard -- vaporized!   Looking for some-body?  Freddy opens up his shirt to reveal a chest full of lost souls.  In the center -- Meagan.  Stormie charges Freddy, throwing her arms around him as she screams to Erwin:   Hmmmmm... I feel like seafood tonight.  Suddenly, Stormie's arms have become huge lobster claws.  She jerks away from Freddy, but too late -- Stormie starts to change into a giant lobster-woman! Freddy smiles -- now he's wearing a chef's hat and apron.    Stew on this, bitch!  Freddy knocks the lobster-woman over the side.  She falls into the boiling water far below -- KER-SPLASH!   Well, well, well... if it isn't my ol' pal, Erwin.  Erwin stares wide-eyed, frozen to the spot.    I've got something special in mind for you...  Suddenly, Erwin reaches into his sleeve and pulls out a pin.  Freddy gawks -- surprised.  Erwin pricks his finger.     Smokin'!  Lizzy rolls her eyes up and faints.  The cultists FIRE their weapons into the air and cheer as the building-high stacks of wrecked cars surrounding them HONK their HORNS and FLASH their LIGHTS.   Shouldn't dream and drive.  Freddy starts the car and pulls out, but what comes out from behind the billboard isn't a patrol car -- it's Freddy's NIGHTMAREMOBILE -- big chrome pipes belching HELLFIRE.  ANGLE IN JESSE'S REARVIEW MIRROR as Jesse's eyelids close and his head nods forward, revealing the night- maremobile closing from behind fast.  The nightmaremobile runs up to the back of Jesse's car just an inch from the bumper.  Freddy moves one of the dozen of levers on the dash.  CLOSE ON FREDDY'S HOOD ORNAMENT -- a small version of Freddy's glove.  It extends out towards the back of Jesse's car, one of the tiny knives inserting into the trunk lock and turning with a slight CLICK. The trunk lid opens.  ANGLE INSIDE TRUNK -- the plastic bags with Jason's remains are moving!  Freddy works another level and the tiny glove slits each bag.  The various pieces of Jason  crawl out of the bag.    Looks like the cat's out of the bag now!  Freddy laughs as the tiny hand closes the trunk.  The nightmaremobile pulls out from behind Jesse's car, BANGING into the rear quarter panel. WHAM! -- all four occupants of the car are jolted awake, startled.  Meagan looks out her window and sees the nightmaremobile as it closes in again.    Okay, Sheriff... This nightmare ain't big enough for the two of us... draw!  Trembling with fear, Jesse fumbles for his pistol. He pulls it out and FIRES.  Freddy laughs.  Jesse FIRES again.  Freddy just laughs.  Jesse FIRES again and again and again and Freddy just laughs and laughs and laughs.  From the saloon, Meagan screams:   Three's a crowd, bitch! Why don't you just go get [BEEP]    Go ahead... make my dream!  Freddy FIRES!   You know what they say... when you sleep -- you die!  Freddy flashes the glove of knives.    Then maybe I'll just CUT to the chase!  Freddy swings the glove but Stormie ducks, keeping her defensive stance.   Oh I'm so scared, honey. Come on! Hit me! Punch me right in the nose! I dare you!  Freddy juts out his chin, gesturing for Stormie to take a punch.  Stormie throws a right and pops Freddy right in the nose.   (continuing;  surprised Owwwww!  Stormie smiles but that soon fades as she realizes her fist is stuck in Freddy's nose.  Freddy takes in a breath and Stormie's arm is sucked up past the elbow. She screams.  Freddy takes a deep breath and snorts Stormie right up his nose, her screams turning into a faint BUZZ. Freddy smiles.    Now that's what I call getting a buzz.     Now the size of a flea, Stormie is clinging to one of hundreds of pointed tree trunks jutting out from the circular walls -- Freddy's nose hairs.  Stuck in those humongous hairs are clumps of icky gunk -- boogers.  Sitting next to Stormie, a particularly large and rotund booger clump opens its eyes and says (in the distorted voice of Harry Manfredini):   Ahhh... ahhh... ahhh--CHOO!  Micro-Stormie comes blasting out of Freddy's nose with globules of snot.  She flies across the massive cell, headed directly for the splattered Boogerman, screaming her head off.  Boogerman sees Stormie racing towards him and he screams too.   That's for the lift sister!  Hiya, kids!   Ready to get hitched?   Then let's do it!  Lizzy looks up and smiles.   You're a virgin?!   Mmmmmmm! Yes, you are a bit juicier than your retard sister... okay, you've got the job.  Get her ready.    Uh, oh...  The cultists attack Jason.  Jason grabs the first one with the Jaws of Life -- folds him in half like a rag doll.  Another attacks with a machete... bad idea.  One more cultist down and now Jason owns the machete.  Jason finishes off the last two cultists as Erwin barricades the studio door.  The cultists on the other side start POUNDING.  Jason starts swinging at Freddy with the machete, slicing through a camera cable.  CLOSE ON CABLE as it falls to the floor.  Freddy jumps back through the Dreamgate, closing it behind him.  Erwin runs over to Meagan and Lizzy.  He tries to wake them but can't.  As Jason lumbers over, Erwin looks up and says:   Oh, well... I just axed for that!  Freddy GROWS a new arm, complete with glove of knives. Jason throws the axe at Freddy, who ducks it.  The axe flies into the audience, SMACKING MUSSOLINI square between the eyes.  He falls back to the floor.  HITLER turns to EVA BRAUN and says disdainfully:   Oh, shit!  Jason throws Freddy to the ground, then raises up a boot and stomps Freddy's head, SQUASHING it like a tomato.  The Dream Demons squirt out.  Just then, the cultists BREAK DOWN the studio door. They raise their weapons to fire, when their heads suddenly IMPLODE.  They fall screaming to the floor -- dead.     I'll be seeing you in your dreams...  Freddy's nasty tongue slithers out of the handset and licks Meagan in the face.  She yelps and slams the phone down.",
        "Krueger": "",
        "Will": "Meagan, Jesse, Stormie, and Erwin enter the shadowy cemetery carrying lamps with shovels over their shoulders.  As they search through the cemetery, Meagan asks:",
        "Rollins": ""
    },
    "imdb_rating": "5.7",
    "description": "It's been nearly ten years since Freddy Krueger terrorized people in the dreams, and the towns folk want to keep him erased from their memory. Freddy still has one more plan on getting back to Elm Street. He resurrects Jason Voorhees and sends him off to kill. The more bodies which fall to the ground, the stronger in which Freddy becomes. This is until, Freddy realizes that Jason isn't going to step aside easily, and must be taken down himself.—Film_Fan",
    "name": "Freddy vs. Jason",
    "genres": [
        "Action",
        "Horror"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BODNlNWVjOTMtZjVjYy00MzRjLTg2MmQtNTM3MWVmZjFjYzgwXkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1_QL75_UY281_CR6,0,190,281_.jpg"
}