{
    "filename": "Friday-the-13th_script.txt",
    "imdb_id": "tt0080761",
    "imdb_url": "https://www.imdb.com/title/tt0080761",
    "characters": [
        "Annie",
        "Steve Christy",
        "Ned",
        "Marcie",
        "Jack",
        "Alice",
        "Bill",
        "The Truck Driver",
        "Officer Dorf",
        "Crazy Ralph",
        "Sgt. Tierney",
        "Barry",
        "Brenda",
        "Mrs. Voorhees",
        "Claudette"
    ],
    "dialogues": {
        "Annie": "Excuse me.  How far is Camp Crystal Lake?  Can I get a bus or something?  Name's Annie.  I don't know.  Camp Crystal Lake?  No sweat.  Thanks a lot for the lift.  Hiya!  I'm headed for Camp Crystal Lake. Can you help me out?  I can't remember being this excited about anything.  I want to be a teacher when I finish at Southern State.  I guess I've always wanted to work with children.  I hate it when people call 'em kids.  Sounds like little goats.",
        "Steve": "Wanta give me a hand here?      Push on this side.  Alice, this is Jack, Marcie and Ned.  Push.    I'd rather she painted.  Let's go, folks.  Shim it up just a scooch.      Perfection. Did you meet Brenda?    Come on back here and let's above the float in.  You draw very well.  This isn't your cup of tea, hunh?      You may not care a lot about this place, Alice, but I mean to make it my whole life.  It's been my whole life.  Gimme a chance.  Stay a week.  Help get it ready.  Next Friday, if you're not happy, I'll put you on the bus myself. I'll be grateful.  Thanks, Alice.    Yeah.  Brenda, after lunch hit the archery range.  If Annie gets here, have her start in on the kitchen.  Do your best.  Tomorrow we have a preliminary inspection by the state safety people. I'd like to look good.  No, thanks.  I'm fine.  Sandy.    I have six new counsellor up there. They're all babes in the woods in every sense of the word.  I mean...  Yeah.  I got it on before this-- --all started.  For two lonely nights.             I think water got into the electrical system.  You ride me back to camp?  I'll get one of my counsellors to drive me back tomorrow morning.  You've made a science out of coincidence.  Sure.    Yeah.  Hi.  What are you doing out in this mess?",
        "Christy": "",
        "Ned": "There you are dead wrong.  Sometimes I only think about kissing women.  I was just wondering if you thought there'd by any other gorgeous women at Camp Crystal Lake.  Besides yourself.  What about the dope paragraph in Mr. Christy's letter?  Yeah, and it also look like it hasn't seen a coat of paint in six years.  I thought we had two weeks...  Looks good.  He neglected to mention this place is called \"Camp Blood\" downtown.  Some campers drowned.  Then some counsellors got killed.  Late fifties sometime.  They never caught the guy who did it either.  Did anyone ever tell you you're beautiful when you're angry?  Want to see my trick shot?  It's even better.  God, but I love that sexy talk.  What do you want to be when you grow up?  Girls can't be cowboys.  Jack?  Doctor.  Now, if you were a flavor of ice cream, what would you be?  There are sand sharks in this lake and they can eat the bathing suit right off you.      Holy shit...  Wait, wait!   When I was finding these goodies in the shed.  I also found this letter which a camper never sent home. Listen.        The squaws are revolting!  God, but I love that macho talk! Emergency generators!  The Indian used campfires.  What hath God wrought?  Ha!  You wily oriental!  The phone was \"Mr. Watson, come in here, I need you.\" \"What hath God wrought\" was the telegraph.  Frankly, Scarlet, I don't give a damn!  You okay?                     Those things can be nasty.  Who played the role of Gorgon in Star Trek?  ALICE                 Aaaargh!  That my  Alice, you're just lucky there are no snakes in the dishwater here.  Ta-da!  But it's in the brochure!  \"Camp Crystal Lake has a full drama program.\"  You just saw it.  Hey, look, I'm sorry.  I'll never do it again.    Tell 'em I'm sorry?  I'm gonna go lie down and catch some z's.  Today wiped me out. Thanks, Alice.  Hello?  Can I help you?",
        "Marcie": "Sex is all you ever think of, Neddy.  You are a true pierce of work, Ned.    We got two weeks before the kids even arrive.  Then I'll act responsibly. Until then, hit me.  It's beautiful...  What are those for?  An Indian raid?  Here.  Meet me in my cabin after taps. Okay, Camper?  Neddy collects weird facts.  Next he is going to tell us that there are poisonous snakes in the outhouse and green lizards in the lake.  Help me!  Save me!  The frog people are after me!  It's swim time at Camp Crystal Lake.  Come on, Alice, I need protection!  Cowboy.  Okay, Fireman.  Rocky Road.  Pistachio, fudge ripple, creme de menthe and I are going back to work.  Steve never mentioned serpents.  Jack, would you get some paper towels?  Thanks.  Go ahead.  I walk on 'em all the time. Would you shovel Mr. Snake outta here?  Yeah.  Scared the hell out    No chance. of her.  How you doin'?  There's a lot of dishes if you just want something to do.  Oh, Lord!                     Neddy!  You can get all the protein   No way I am gonna play chef you need if you mix them      to all of you guys.  It's right.                        women's lib from here on  Last line of Gone With the Wind?  You okay?                     Those things can be nasty.  How'd it get in there?        Melvin Belli?  Soooooeeeeey, piggy, piggy.  Help him!                     Oh, my God!  Wait'll you're really in trouble and see what happens...  I hope that's the last time we see the Camp Crystal Lake Drama Program.  I don't blame him.  Yeah, like draining the lake!     Makes me want to hold on and never let go.  I love you.    He keeps on acting like such an asshole!  Don't call him.  I guess...  I'm a little scared of storms.  Always have been.  Since I was a kid.  I've dreamed this dream.  Maybe half a dozen times.  There is a thunderstorm. The rain comes down like pebbles.  I can hear the sound.  I try to close my ears off.  It doesn't work.  The sounds gets louder.  The rain turns to blood and the blood washes down in little rivers.  And the sound stops.  I call it my shower dream.  Lead the way!  Are you wet?  Mmmmmmmph?  Best over...  Like waves.  It's never been likes waves before.  Gotta pee.  You're lying on my bladder.        Jack?",
        "Jack": "Ha!  Ow!  Good call.  Quote:  Controlled substances are expressly forbidden.  Possession or use of marijuana or alcohol on campgrounds will means instant dismissal.  Unquote.  Steve's got a woodlore program.  You see any life rings?  For sure.  You want it listed separately?  Coach, athletic director somewhere.  She all right?                Get ready for the schneider.  BRENDA                Four zip.  What the hell?                Where'd you get that stuff?  It's gonna be a long summer.  How can you eat that stuff?   You like them rare? Looks like dead animals.  Steve taught me how to use the emergency generator.  The town power lines are supposed to be real shitty.  Give me a hand?  Here we go.    I'll be okay.  Holy shit...  You saved my life.  Thanks.  Whew.  Floor probably leaks.  This area is full of springs.  Just in cause this bugger goes bad.  I'm gonna pick up some lanterns from the equipment shack.  What is it?  Roll him over!                Get behind him more.  Not funny, Ned...  I'll spot you five points.  You just had some lucky shots.      Wind's up.  It's shifted a good hundred and eighty degrees.  I love you.  I don't love Neddy.    I thought you wanted to give him one of your motherly lectures.  Ned is gonna do whatever he wants to do, you know.  Looks like a storm.  You?  The brick?  It's just a dream.  This is no dream.  Want to escape for a while?  Just a little.  Wait a minute, woman.  Mmmmmmmph.  Umhummmmph.  Whassamatta?",
        "Alice": "Cabin B is ready.  You told her to sweep the courts.  You can changed in three.  Steve said for you to start on the boats.  I'll tell him.  Everybody except the girl who's supposed to handle the kitchen.  Annie.  I'm not sure I'll last all week. I'll tell Steve.  Oh, thanks.  I wish I could spend more time at it.  Just a feeling. Nothing personal.  I don't know.  Probably be best for everybody.  Next Friday.  Sure.  How come?  Did you want something?  Un-hunh.    It's long and personal.  It has nothing to do with you or the other kids.  And it's this place.  It makes no sense, but it spooks me.  Artist.  What'd you see?         I walked into it knowing I'd get hurt, but I thought I could stand anything. I just wasn't ready for that kind of pain.  We were supposed to meet in L.A. When I got back there, he sent a telegram saying he was going back to his wife.  I don't know.  I'll be along.  I didn't know I was asleep...What time is it?  Now I'm only eleven hours behind schedule.  Steve is going to have a small cow.     And then Steve looks at you with those hurt eyes--like you don't care about children...    You're very nice.                Help!        How the... did he get in there?  Okay.  Can I help?  The way I feel, that's perfect.  Bad bulb or no power.  It's getting a little gloomy in here.  Tomorrow is another day.  This just plain ain't my day.  Somebody probably dropped something too hard.  Help him!                     Oh, my God!  Ned?  We're gonna be working together for a while.  You're a nice guy without all the entertainment, okay?  Sure.  You're welcome.  He went to bed early.  Jack and Marcie are gonna be drenched.  I'm not always this stupid.  It wouldn't matter except Steve should be getting back pretty soon.  It wouldn't look so great if he fell over them.  Well, it hasn't been that long.  I think we should go wake them up.  Just in case.  I guess...  Good night, Brenda.  Absolutely.  I don't here it anymore.  It sounded like Brenda.  Did somebody leave the lights on at the softball field?  They're off now.  Okay.    Brenda?  Brenda?  You there?  Bill.    Marcie?  Marcie?  Brenda?  Jack?    Do you have a dime?  A quarter?  Hello?  Hello?  This damn thing's dead, too.  What's the matter with it?  Why don't we run?  Just run now?  Bill?!    Bill?  Bill?  Bill!  Bill?    Jack!  Marcie!  Help me!  The knife!  He's dead... She's dead... all dead... Please save me... oh... poor Bill... Oh my God, oh my God... oh God...  Jack?  Marcie?  Ned?  No, no, they're all dead...  They'll kill you!  Don't leave me!  All dead?  Neddy?  Oh, Marcie...  Bill--Bill--Bill is out there...  The killer is still out there.  Maybe we should wait for Mr. Christy.  I don't understand.    Mr. Christy will be back soon.  I won't let you!    Where are the goddamned bullets?  Please...  Help me.",
        "Bill": "I finished the boats.  Alice?  The others show up?  You think you're gonna last all summer?  No shit.  When?  Sorry.  How you doing?  Steve said you were thinking of leaving. True?  You okay?      Maybe I can help?    Filmmaker.  It still hurts?  What'll you do when you leave here?  Speaking as black raspberry, I guess I'm ready.  Frozen yogurt?  Almost five.  You can only do what you can do.  Alice?  Hope you will.  Slipped in.  Probably liked the scent of your perfume.  You okay now?  Yeah.  Scared the hell out    No chance. of her.  What the hell?                Where'd you get that stuff?  NED                   Too bad that Annie never  Trouble?  For sure.  This is almost like the one at my uncle's cabin in Maine.  Don't get up.  Take a second...  I had to.  I figured if I didn't save you.  I'd have to give you mouth-to-mouth and that would have ruined my appetite.  This puddle was enough to ground you all the way to China.  A short somewhere.    Lemme see.  Doesn't look too bad.  I don't want you getting      Melvin Belli. hurt.  How'd it get in there?        Melvin Belli?  Is it stuck?  Roll him over!                Get behind him more.  Chance to get even?  Where's Ned?  Not if they're where I think they are.  Anything's possible.  My parents taught me to leave sleeping lovers alone.  Good point.  Got to it just in time.  The generator was running on fumes.  I filled it up. That should keep it humming until Steve gets back.  Help you clean up?  Can't hear anything through that wind and rain.  I'll go take a look.  Where?  I'll go check on Brenda.  If it'll make you feel better.  Jack?  Hey, guys!  Okay.  Sucker's locked.  Who's got the key?    No.  There must be some in the desk somewhere.  Wet.  I don't know.  It's over twenty miles to the crossroads.  Steve'll be back in an hour.  Things will straighten out then. We'll take his Jeep and get help.     Oh, shit....",
        "Officer": "",
        "Dorf": "",
        "Crazy": "",
        "Ralph": "It's Friday the 13th.",
        "Sgt.": "",
        "Tierney": "I told you not to buy that hunk of junk!  Why not?    Bad enough we got a full moon; it's Friday the 13th.  They keep statistics. We get more accidents, more robberies, more rapes, more homicides, more of everything when there's a full moon.  It affects people.  Makes 'em nuts.  This is Tierney.  Roger.  Acknowledge receipt.  Estimate arrival time fifteen minutes.  How copy?  Have to drop you here, Steve.  Another coincidence.",
        "Barry": "Okay.  I meant everything.    I care very much.  I wouldn't know.  Claudette...  No, they won't...  Come on, Claudette.  A man's not made of stone.  I need you so much, Claudette.",
        "Brenda": "You're crazy!      Dancer.  Vitamin C's supposed to neutralize the nitrites or something.  I don't know.  Marcie's got me paranoid.  Not bad.  We wouldn't want you thinking you're the only show-off in camp, would we?  She all right?                Get ready for the schneider.  It's catch as catch can.  I'm making a salad.  The guys are planning to cook greaseburgers for themselves.  Oh, Lord!                     Neddy!  Whatever you make yourself.  How can you eat that stuff?   You like them rare? Looks like dead animals.  You can get all the protein   No way I am gonna play chef you need if you mix them      to all of you guys.  It's right.                        women's lib from here on  That was the telephone.  Shows how much you know.  It's something about tomorrow.  Right!  Right!  Wash it out real good.  I don't want you getting      Melvin Belli. hurt.  He's probably setting up another one of his practical jokes.  You think they fell asleep?  Long enough for me.  Give them a little while longer.  It's still early, anyway.  Good night, Alice.  That could drive a person bug-city.  Neddy?  Cut the screwing around, Neddy!    Christ, what a jerk.",
        "Mrs.": "There now, my dear.  Please.  I can't help you if you can't talk to me. There, there now...  It will be all right.  I'll take care of you.  It's just this place.  The storm. That's why you're all upset.  I'll go look.  I'm not afraid.  Oh, my lord...    We shall go straight to the police.  I will protect you.          No.  That won't be necessary.    It was my son they killed.  They said he drowned, but I know it was inadequate supervision...  No, he won't.  I killed him as well....",
        "Voorhees": "There now, my dear.  Please.  I can't help you if you can't talk to me. There, there now...  It will be all right.  I'll take care of you.  It's just this place.  The storm. That's why you're all upset.  I'll go look.  I'm not afraid.  Oh, my lord...    We shall go straight to the police.  I will protect you.          No.  That won't be necessary.    It was my son they killed.  They said he drowned, but I know it was inadequate supervision...  No, he won't.  I killed him as well....",
        "Claudette": "Have you seen Barry?  We've got to talk.  You said we were special.  I can't, Barry...  Does Chloe kiss as good as I do?  Oh, you...  Somebody'll see.    Let's go back, Barry..."
    },
    "imdb_rating": "6.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNWMxYTYzYWQtNGZmNy00MTg5LTk1N2MtNzQ5NjQxYjQ5NTJhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,3,380,562_.jpg",
    "description": "In 1957, a young boy named Jason drowns in a lake near Camp Crystal Lake. The next year, two counselors are murdered. In 1980, a descendant of the original owners reopens Camp Crystal Lake with some counselors' help. The counselors gets killed one by one by a mysterious person. Could it be Jason, out for revenge?—RedJames99",
    "name": "Friday the 13th",
    "genres": [
        "Horror",
        "Mystery",
        "Thriller"
    ]
}