{
    "filename": "Friday-the-13th-Part-VIII-Jason-Takes-Manhattan_script.txt",
    "imdb_id": "tt0097388",
    "imdb_url": "https://www.imdb.com/title/tt0097388",
    "characters": [
        "Young Jason Voorhees (as Timothy Burr Mirkovich)",
        "Jim Miller (as Todd Shaffer)",
        "Deck Hand",
        "Chief Engineer Jim Carlson",
        "Jason Voorhees",
        "J.J. Jarrett",
        "Sean Robertson",
        "Toby",
        "Admiral Robertson",
        "Miles Wolfe",
        "Suzi Donaldson",
        "Charles McCulloch",
        "Wayne Webber",
        "Colleen Van Deusen",
        "Rennie Wickham"
    ],
    "dialogues": {
        "Deck": "as Jim tosses a small anchor overboard.    as he continues away, his retreat blocked by the DECK HAND. The crazy old man pierces a dead serious stare at Sean.   This voyage is doomed.    as Sean continues along, hands in pockets. He turns a corner and collides with RENNIE, walking her dog. His eyes instantly brighten, as do hers.    as J.J.'s SCREAM echoes from an exhaust duct. WHIP PAN to find the crazed DECK HAND standing just below it, reacting with dread. He's the only one who has heard it.    as the Deck Hand flinches upon the thick, dull sound of her demise, followed by discordant feedback from her guitar...and eventual silence. He reaches into his breast pocket, his hand shaking badly as he sips from a flask of Early Times.    Wind is picking up, sweeping thick mist past a row of decorative flags. One of them flaps back...AND EXPOSES   as they walk along the edge of the pool.   He's come back and you're all going to die.  Rennie gazes at the Deck Hand, then back at McCulloch.    as we approach Tamara's porthole window, peering through it. We can't hear the words but we can clearly see the people.    as LIGHTNING STRIKES above it in the night sky. Camera slowly ADJUSTS to find the RADIO ANTENNA CABLE. A second later, JASON'S HAND REACHES FOR IT, GETTING A FIRM GRASP.    as Jason drops the cable he's just torn out, marching onward.   You're all going to die.  All heads spin as the deranged DECK HAND treads out from a shadowy corridor.   You're the last ones. He's come back for you.   Jason Voorhees.  There is a collective, disconcerting silence triggered by the infamous name.   He walks this ship, here and now.   You're the one who's insane!!  The raving man flees back the way he came. McCulloch raises the flare gun; Miss Van Deusen grabs McCulloch's arm, stopping him.    as Rennie moves past wet, empty lounge chairs towards the bow. She passes a row of translucent windows. The first three are normal...but the fourth has the SILHOUETTE OF   --spying on Rennie like a wolf watching a lamb. We MOVE a few windows down, getting a better view of her.    Rennie appears again, scanning her no-visibility surroundings.    as it slams open...and JULIUS steps out, not Sean, from a different deck door. TRACK with him as he treads along the side of the ship, skeet rifle raised.    --steaming and far from calm as the weather blitzes it. Miles appears, climbing a ladder to the upper deck level.    as Miles arrives, axe raised. He pauses to regard his surroundings, then moves on. RACK FOCUS TO FIND JASON RIGHT BEHIND HIM, having followed Miles up the stairs.    He's pacing along when a clattering noise from above makes him stop. Suddenly MILES' AXE THUDS INTO THE MAHOGANY DECK NEXT TO HIS FOOT. Julius gazes at it, jerking his head upward.    as Julius zooms up them to aid his comrade.    coming around a corner, stopping dead in his tracks, his stomach wrenching as his eyes fall on:    as a door opens and Miss Van Deusen guides a half-dozen SENIORS over to the LIFEBOAT STATIONS.    We slowly DOLLY BACKWARDS until Miles' AXE comes into frame, still stuck in the mahogany decking. A beat, then   ...and the charge EXPLODES INTO HIS CHEST. He stands there with his chest smoldering, almost like a gargoyle in effigy. A second later the poor old man falls forward, and:    as rain begins to wash the blood from his back. JASON'S FOOT TRUDGES INTO FRAME...then his HAND REACHES DOWN,",
        "Hand": "This voyage is doomed.   He's come back and you're all going to die.  Rennie gazes at the Deck Hand, then back at McCulloch.   You're all going to die.  All heads spin as the deranged DECK HAND treads out from a shadowy corridor.   You're the last ones. He's come back for you.   Jason Voorhees.  There is a collective, disconcerting silence triggered by the infamous name.   He walks this ship, here and now.   You're the one who's insane!!  The raving man flees back the way he came. McCulloch raises the flare gun; Miss Van Deusen grabs McCulloch's arm, stopping him.   SLUGS HIM SQUARELY IN THE FACE. The force of it sends the boxer REELING BACKWARDS OFF THE RAILING...    groping for a weapon to stop him, her fingers skittering across her table like a spider.    Her movements slow as the oxygen leaves her system. But Rennie's fingers miraculously find a recognizable object: the ink-dip pen given to her by Miss Van Deusen. She seizes it, getting a firm grip.    ...and the charge EXPLODES INTO HIS CHEST. He stands there with his chest smoldering, almost like a gargoyle in effigy. A second later the poor old man falls forward, and:    as rain begins to wash the blood from his back. JASON'S FOOT TRUDGES INTO FRAME...then his HAND REACHES DOWN,",
        "Jason": "Written by Rob Hedden    Hhhhelp....me....I'm drowning...   Mmmmmmommy....  ...And Jason finally slips under the surface for good.      raises the spear, taking aim.   Hhhhelp me....I'm drowning...    We're peering at J.J. predatorially through the steam, moving through it, behind the generators.    moving around the generators, eyeing her sleek leather pants as she bends over to plug in her axe.    appears for an instant through the vapor, then vanishes.    emerging from a cloud of vapor like her worst nightmare.    swings the guitar downward and buries it in J.J.'s skull.      as the flag whips our faces. We MOVE through it, down the empty passageway, coming to a porthole window. Rennie's window. We peer through it with unnerving intensity at the backside of Rennie as she pulls off her T-shirt, slipping on the blouse. Camera continues through the tiny round window, floating across the room, over Toby and the bed...until we're INCHES FROM THE BACK OF RENNIE'S HEAD. She suddenly spins around in fright, facing us point-blank, and:    holding the opposite end of the harpoon. He shoves it forward with one more staccato jerk and:    hovering over him, now clutching one of the scaling knives.   He begins to stride parallel to her, then disappears when the windows end and a wall takes over.    deciding that the time is right to strike. His hand moves to the bow entrance door knob, slowly turning it, pulling it open.    through the crack in the door, watching Rennie unexpectedly take off. He's about to move after her when ha hears:    moving down the same corridor, catching a glimpse of Eva before she turns a corner and disappears.    chasing after her with the smooth determination of a shark, never letting her get too far in the lead.    --entering the same corridor a beat after Eva exits it in the direction of the disco. He tramples onward.    appears on the corridor steps for a brief second. The spotlight goes black, then flashes on again. Now he's gone.    illuminates only ten feet from her, a crimson strobe assaulting his hockey mask. She's on a collision course with him.    hoists him off of J.J.'s body and flings him into:    Wayne's body is NOW ON FIRE...AND THE BLAZE IS SPREADING    He's having no problem catching up to the defenseless teenager.   SLUGS HIM SQUARELY IN THE FACE. The force of it sends the boxer REELING BACKWARDS OFF THE RAILING...   Hhhhelp....me....  Rennie whirls into a CLOSE UP, staring with disbelief at:    ...who is standing on the oval rug in her stateroom, his hands reaching out to her. But then comes the inexplicable: THE OVAL RUG TURNS INTO LAKE WATER AND JASON SINKS INTO IT. He's drowning in the middle of her room, choking on murky water.   Hhhhelp me....I'm drowning...    grabs her hand, pulling hard, then grinning wide.    Her head is pulled taut against the wall just below the porthole, with Jason's hideous mask framed in the circular shattered window. She's slowly dying.    as Rennie JABS THE PEN BACKWARDS, SENDING THE SHARP INSTRUMENT THROUGH THE EYEHOLE OF HIS MASK. Jason instantly releases her, reeling backwards.    Miss Van Deusen is darting across the deck, gathering up a trio of terrified seniors.        rapidly moving down the staircase towards them. Sean's view is CUT OFF as the lifeboat sinks below deck level.    trampling towards the hoist, about thirty feet away now. The boat has already disappeared over the edge.    as he relentlessly moves to the hoist cable, raising his axe.    standing by the hoist, hovering over the edge. Very angry.    A tattered billboard over one of the warehouses advertises the NEW YORK RANGERS HOCKEY TEAM, featuring a full shot of the HOCKEY-MASKED GOALIE.    looks at it long and hard. He tears off his life preserver wits renewed ambition.    Amongst the slime and cigarette butts is a discarded syringe. Jason picks it up.    He's just as quick, but smoother and more methodical.    ...but Jason is-far from human, easily negotiating the wrought-iron stairs and rapidly catching up.    appears at the parking lot stairs, STALKING STRAIGHT   as the automobile grinds back over him a second time.    as the walking corpse lifts a screaming McCulloch over his head, carrying him over to one of the scum-filled OIL DRUMS, SHOVING HIM HEAD-FIRST INTO IT. Jason grips McCulloch's thrashing legs as bubbles rise to the surface of the slime, a pathetic gurgling reverberating out the drum. At last McCulloch's appendages go limp. Jason releases him, moving on.    as an ELDERLY COUPLE rises toward us. Their reactions grow more bleak the closer we get, finally registering terror as we plow right through them.    heaves the dog in front of the train.    --seeing Sean and Rennie disappear through another connecting door. We storm our way through it into the next car right after them. A handful of TRAVELERS cower away from us.    fires out from the tunnel, grabbing onto Sean's ankle. Rennie screams as Sean is dragged down...but he manages to latch onto a chain securing a garbage receptacle. Jason pulls harder, stretching Sean to his limit as Rennie watches helplessly.    trips backwards and LANDS ON THE THIRD, ELECTRIFIED RAIL, RECEIVING TEN THOUSAND VOLTS. His body smokes and convulses, finally sizzling out. He appears to be terminated!!!    shoves his way through the preoccupied pedestrians; they've certainly seen weirder characters than him here. He moves past a group of STREET URCHINS listening to some rap from their ghetto blaster. His foot obliterates their stereo system with one stride. They instantly pull out switchblades and chains.    lifts the very large man and EFFORTLESSLY HEAVES HIM INTO   Rennie is blinding us with the sanitation Engineer's flashlight, giving us only brief glimpses of herself in the reflective wet surroundings.    has been sufficiently taunted. He moves after her.    as the bright beam leaves our eyes, Rennie dashing down the intersecting tunnel .    stomping through the sludge, picking up speed. He's wanted to kill Rennie most of all.    He's moving like a freight train now, an addict rolling after his fix.    --Looking through his unblinking eyes, whipping into Tunnel #1...where we catch a fleeting glimpse of Rennie flinging the contents of the oil drum. A half second later a WAVE OF GRAY/GREEN LIQUID FLIES AT US...    and his hockey mask is SPLASHED WITH TOXIC WASTE, SEEPING INTO HIS MASK'S EYE SLITS. He careens back as if her were a rabid dog receiving a load of point-blank buckshot.    as the radiant flashlight beam finds his mask, the plastic beginning to bubble and melt. RUSH INTO A TIGHT  HIDEOUS FACE: rotted flesh, some of it sizzling from the chemical. Worms slithering out his nostrils. And his eyes...or lack thereof. They're like two raw quail eggs frying in liquid green pollutant...and the yolks just broke, running down his face.    vision or no vision, he is lurching towards her relentlessly. She is literally sandwiched between hell and high water.    within ten feet of them, shifting directly for the ladder like he's working on some kind of radar.    has just started to climb the ladder when the wind and smell of the rushing toxic waste bombards him. His decomposed head swivels to face:    He doesn't need vision to confirm what his other senses already know. Jason's mouth begins to quaver...AND THE  Mmmmmmmmmommy...DON'T LET ME DROWN,  Hhhhelp me....  A split second later:",
        "Voorhees": "",
        "J.J.": "Is this axe awesome or what?    as J.J., a female rocker in the vein of band \"Vixen,\" continues to wail on her guitar. She's wearing a black leather corset, with wildly teased deep red hair. Holding the camcorder is WAYNE WEBBER, MTV-acclimated, wearing the latest hip prescription glasses.   No lie. I hear there's a big power room down below where I can get supreme concert hall echo. Come down and shoot a basement tape on me, okay?   Man, don't tell me you're still trying to scam on Tamara...  His non-answer means yes. J.J. walks over to him, grabbing his cheeks, shaking them like jello.   How long have we known each other? Don't be a dweeb, Wayne. She's not interested in you, only what you can do for her. She's a user.   So's this guitar. So what?   This place is aching for a video. Wayne, you're an asshole.  She finds an outlet and plugs in her equipment.    pops a cassette into her blaster, jamming the \"play\" button. A loud rock 'n roll rhythm track blasts out.    screams out the opening licks of her solo in sync with her playback. The generators are causing a breeze which makes her hair dance, steam flowing between her legs. She's lost in her music, building to a crescendo, bending the high \"E\" string above the upper octave fret. She opens her eyes with the pleasure of it and sees:",
        "Jarrett": "",
        "Sean": "It's a ship and that's right. Plus a disco, gym, game room and a lot more.   Which cabin is Rennie in, Mr. McCulloch?   But I thought...   Be right up, Dad.  He and Miles head up the gangway, both boys giving McCulloch one last glare.   Hello, Dad.   Dad, I don't think...   How about if we start up the forward engines and come around. 180 degrees...    as he continues away, his retreat blocked by the DECK HAND. The crazy old man pierces a dead serious stare at Sean.   Yeah, tell me about it.  Sean sidesteps him, moving on.   Rennie...   I heard you weren't coming.   I got you a present.   Forget it. It's a dumb little thing anyway.  Rennie opens it up, exposing a petite silver necklace with a Statue of Liberty pendant on it. She's touched.   I thought maybe we could hike to the top of the Statue when we got there, if you felt like it. It's supposed to be 22 stories tall.   I guess I'll see you later.  Sean leaves. McCulloch steps up to Rennie, pointing out to the foggy sea. Her respiration increases as she psyches herself up to look.   What happened?  Rennie, are you okay?    as Rennie sinks under the surface, all alone, thrashing in terror.    realizes she's in trouble. He immediately dives in after her, pulling her to the pool's edge, where Miss Van Deusen helps to lift her out.   It's okay...you're going to be okay.   Me too.  Let's go talk to my Dad.  He puts his arm around her, leading her toward the bridge.   Not completing a voyage is against everything he stands for. But I think I can convince him to call a Coast Guard cutter for you.   If I go with you, he'll never speak to me again.  But I'm never going to live up to his expectations anyway...so maybe it's the right thing to do.  He's made a big decision. Sean takes her hand as they walk on.    knocks on the bridge door. No answer. He's confused. He pushes the door open but something is blocking it. Sean puts his weight into it, shoving hard.   Oh Jesus...Dad??  Sean looks over at the helm...where his father is still sitting in the swivel chair, his back to them. Silent. Sean sidesteps the Chief Engineer's corpse, moving toward his father as Rennie remains frozen in shock.    Slowly walking toward Admiral Robertson...at least he thinks it's his dad because he's unable to see his face. Is it Jason now wearing the uniform?? When he's about two feet away from him...    reaches out and swivels the chair around. It is his father BUT HIS THROAT HAS BEEN SLIT. Sean staggers backwards, uncomprehending, his senses overloaded. We MOVE with him until he's backed into Rennie, clutching onto him tightly.   He's...he's dead...   Attention everybody, attention. This is Sean Robertson...   There's been...  What I mean is, this is an emergency...  Miles knows he can't be joking around. Wayne comes walking by, covering his camcorder with his jacket.   Repeat, this is an emergency...   I want everybody to meet on the bridge...   Stay calm, but get here as quick as possible. Walk with a friend if you can...  Eva wipes the rain from her face, then walks away.    trying his best to keep it together. He glances at his dead father, still unable to believe it.   God, I wish this was a joke, but it's not.  Sean slowly puts down the phone. He's lost in a daze. Suddenly the SHIP LURCHES, a huge swell SPLASHING THE BRIDGE WINDOW. Admiral Robertson's body falls from the swivel chair.   I don't know...we've gone off course or something...   I don't know what I mean! All's I know is that there's no one guiding this ship anymore...  Sean is starting to lose it. The fear of the ocean guiding her, Rennie rushes to him, gripping and shaking him.   I think so. But we have to lower the anchors so we don't drift any further...   The bow...front of the ship. There's a hoist on each side that lowers them  She starts to exit.   I didn't mean for you to go!   Mayday, mayday, mayday...   Please...can anybody out there hear me??  No response. WAYNE and MILES rush in.    Channel 16...the distress frequency...  Mayday, mayday, mayday...this is the Princess Ruby. Please, somebody answer...    as they hear the voice, reacting, relieved and thrilled.   The Captain and Chief Engineer... they've been...they're dead.   I...I don't know...   Yes...   I've got the numbers.   Hello? Are you there??  No response. A lump sinks into everyone's throat.   It's...dead.   She's...she's dropping the anchors. I thought the Coast Guard could find us easier if...    I don't know.    We could hit a reef, collide with another ship...we could be out here for weeks before anybody spotted us.  They are suddenly jolted with a DOOR SLAM as McCulloch storms onto the bridge.   It worked...we're back on course!  Sean feels his confidence instantly rejuvenated. Miss Van Deuten immediately embraces him. But a fraction of time later:   The fire alarm...   We have to get everybody together just in case the fire's for real.  Sean heads for the door, shoving it forward.   Rennie...??   It's gonna be okay...   The power room...   Rule one, don't panic. Rule two, assess the damage and act accordingly...   I don't know.  Her ultimate fear is staring her straight in the face. Suddenly the dim blue lights flicker on.   The emergency lights just kicked in...  Sean makes Rennie look into his eyes. His words are meant to convince himself as much as Rennie.   We'll be okay. I want you to wait by the lifeboats, just in case.   But Rennie...   Water has gotten to the engines.  We have to get everybody off this ship...   This is Jason's fault!   We have to get off this ship!!  They back away from the horrid sight and begin to run, the Abandon Ship alarm still attacking their ears.   Everybody in -- I'll get the hoists  McCulloch has no time for politeness, moving to the lifeboat ahead of the women. Rennie stops cold, gazing classy-eyed at the small boat.   Stop it!!   Come on...faster....    grabs an oar, turning back to McCulloch.   Start rowing!!  McCulloch takes the oar as Miss Van Deusen holds onto Rennie tightly, the girl's eyes squeezed shut. Sean looks up at the ship again, and:    Jason is none.   He's gone...   It's Julius!  Miss Van Deusen moves to help him and we:   Rennie...what'd they do to you??   We have to find the others.  Together they run off.   Hey!   Jason's here in New York.   There aren't any handles!!  Cocaine flowing through her veins, Rennie acts hyperkinetically, scratching her way over the seats just as:   Miss Van Deusen...  He takes two steps back to the car when:   You son of a bitch...  She lets it build until she's ready to explode...then:   You keep away from her!  Sean chases after Rennie. Camera methodically PANS BACK TO MCCULLOCH, crumpled on the ground. A very bitter man. He wipes his hands, getting ready to stand when THE SHADOW FALLS OVER HIM. His skin fades to porcelain white.   Not this time.  He caresses her face; it develops into a tender kiss. Finally she holds him back, letting it out. At the same time:    are lost in their shared quiet moment...until the GROWLING SOUND becomes audible. They look up, seeing:    abruptly flee down the alley, Jason in mad pursuit.   Come on...  ...but Jason arrives before the train. Toby barks and snarls, trying to protect them. Jason is unfazed. He treads toward them and:    makes Rennie look away, dragging her with him along the platform edge in retreat as Jason returns his attention to them. They reach the end of the platform, having no choice but to board the front car.    as they get to their feet, holding each other tight, looking down on the now-dead undead creature.   It's over, Rennie. It's finally over.  Camera RISES ABOVE THEM, RACKING BACK TO THE SUBWAY EXIT. Guess who has just made an encore...with more energy than ever!!!    look all around them, having never been to a city as big as this. They finally turn far enough around to spot JASON in a series of three quick cuts, each one closer than the last.   God...please no...  But Jason keeps on coming.    You have to call the police...    carefully sidestep it, continuing on. They make it another ten yards when A FIGURE LEAPS OUT FROM AN ALCOVE, GRIPPING A HUGE WRENCH. Rennie's scream echoes through the tunnel.   Can you help us get out??   What do you mean?     Run, Rennie...  She's struck with indecisive shock, looking into Tunnel #3, seeing:    The powerful flood thrashes the ladder about two inches below Rennie's feet, the force of it fiercely shaking their rusty support. They are clinging to the ladder with their eyes squeezed shut. Praying for survival.    as the sewage level begins to drop. Rennie opens her eyes, glancing straight down and seeing.   I hear there's a statue here that's 22 stories tall.  Rennie would smile if she could. She kisses his cheek. They amble on.    walk arm in arm, exhausted and oblivious to their pursuer. But something, some innate perception causes Rennie to slow...and stop. Her eyes register a horrid fear and she WHIPS AROUND TO FACE...",
        "Robertson": "Sean -- where the hell have you been? We're already into early departure protocol...    Let's take in the brow.   She's a beauty, isn't she? I should've retired from the Navy ten years ago.   Hell, there's just twenty or so of you -- we only need a skeleton crew and it's a pleasure to sail her anyway.  By the way, congratulations on winning the intramural diving championships, Miles. I'm sure you made your old man proud.  Admiral Robertson gives his own son a glance; maybe Sean should think about doing the same.   Actually, I thought I'd leave the honors to my son.   (to Chief Engineer, ignoring Sean Relinquishing command of the Princess Ruby to Captain Sean Robertson.  Sean has no say in the matter. Miles can feel his friend's nervousness as well.   But before you take the helm, take this.  He tosses Sean a wrapped box. Sean opens it. Inside is a navigational computer the size of a calculator, sitting next to a rusty old sextant.   Something old and something new. I used the sextant when I was your age, but now they have these goddamn computers to do all the work for you.   Aren't you forgetting something?  Sean looks flustered. Admiral Robertson storms to a large button, pressing it three times, piercing the air with three long blasts of the ship's horn. It underscores his frustration.   We're in foggy weather! Send out the international maritime signal that a vessel is backing down, followed by a security broadcast warning other ships!  He shoves the mike out at Sean, but he doesn't grab it, leaving the bridge, humiliated. There's an awkward moment for Miles, unable to find any appropriate words. He exits as well. Admiral Robertson stares out the bridge window, saddened and frustrated. It wasn't supposed to go this way.   Let's kick in the stablilizers, Mr. Carlson, and get the seas off the quarter. These kids are in for one hell of a storm.    gets a reflective look in his weary eyes.   How olds your boy now, Carlson?   A tremendous age. Take some advice from a salty old man: don't push him too hard.  The Chief Engineer nods with a sympathetic smile as the Admiral steps off the bridge, onto the stormy deck, contemplating the sea. The Chief Engineer moves to the radio/intercom console. He lifts a telephone, punching in a three digit number. PUSH IN TIGHT ON HIS FACE.    returns to the bridge as LIGHTNING flashes outside.   Better have them doublecheck the lifeboat stations as well...  Admiral Robertson stops cold upon the sight of Mr. Carlson. He hurries over to him, kneeling down, freezing as a pair of MUDDY FEET ENTER FRAME. Admiral Robertson bends his neck upwards to face:",
        "Toby": "begins to bark vociferously, rushing to her cabin door, scratching to get out.    as the canine continues to sniff out Jason through the maze of corridors. TRACK with the dog as he slows his pace, knowing he's getting close to something.    Low to the ground, creeping past a steam vent which obscures his vision, then turning down a metal staircase, weaving into another passageway. Then with absolutely no warning, A BODY FALLS FROM ABOVE, THUDDING DIRECTLY IN   rears back with teeth bared, but:    as the bullet tears up asphalt next to the dog's paws. Toby sprints off into the darkness.    cautiously approaching them. Rennie stands, absolutely relieved.    abruptly flee down the alley, Jason in mad pursuit.    leaps onto Jason, sinking his teeth into the monster's throat. Jason wrestles the animal into submission just as:    Limping on all fours, filthy with grease-matted fur. The whimpering dog crawls up to her, Rennie bending down, hugging her animal like she'll never let go.",
        "Admiral": "Sean -- where the hell have you been? We're already into early departure protocol...    Let's take in the brow.   She's a beauty, isn't she? I should've retired from the Navy ten years ago.   Hell, there's just twenty or so of you -- we only need a skeleton crew and it's a pleasure to sail her anyway.  By the way, congratulations on winning the intramural diving championships, Miles. I'm sure you made your old man proud.  Admiral Robertson gives his own son a glance; maybe Sean should think about doing the same.   Actually, I thought I'd leave the honors to my son.   (to Chief Engineer, ignoring Sean Relinquishing command of the Princess Ruby to Captain Sean Robertson.  Sean has no say in the matter. Miles can feel his friend's nervousness as well.   But before you take the helm, take this.  He tosses Sean a wrapped box. Sean opens it. Inside is a navigational computer the size of a calculator, sitting next to a rusty old sextant.   Something old and something new. I used the sextant when I was your age, but now they have these goddamn computers to do all the work for you.   Aren't you forgetting something?  Sean looks flustered. Admiral Robertson storms to a large button, pressing it three times, piercing the air with three long blasts of the ship's horn. It underscores his frustration.   We're in foggy weather! Send out the international maritime signal that a vessel is backing down, followed by a security broadcast warning other ships!  He shoves the mike out at Sean, but he doesn't grab it, leaving the bridge, humiliated. There's an awkward moment for Miles, unable to find any appropriate words. He exits as well. Admiral Robertson stares out the bridge window, saddened and frustrated. It wasn't supposed to go this way.   Let's kick in the stablilizers, Mr. Carlson, and get the seas off the quarter. These kids are in for one hell of a storm.    gets a reflective look in his weary eyes.   How olds your boy now, Carlson?   A tremendous age. Take some advice from a salty old man: don't push him too hard.  The Chief Engineer nods with a sympathetic smile as the Admiral steps off the bridge, onto the stormy deck, contemplating the sea. The Chief Engineer moves to the radio/intercom console. He lifts a telephone, punching in a three digit number. PUSH IN TIGHT ON HIS FACE.    returns to the bridge as LIGHTNING flashes outside.   Better have them doublecheck the lifeboat stations as well...  Admiral Robertson stops cold upon the sight of Mr. Carlson. He hurries over to him, kneeling down, freezing as a pair of MUDDY FEET ENTER FRAME. Admiral Robertson bends his neck upwards to face:",
        "Miles": "You're telling me this boat has a pool with a three meter board?   I think I'm gonna blow off New York and just stay on this thing.    Of course...wouldn't want to risk enjoying this trip.  McCulloch gives him a frown. Sean steps up to him tentatively.   Hey, Admiral Robertson. Love your ship.   You've really been generous to give us this cruise. I know I speak for everybody on board.  Everybody...with the possible exception of Sean. He avoids eye contact with his father.     A half-twist short. I'll hone that dive yet.  He swims to the side, leading us to a view of Rennie. She's very cautious about getting too close to the pool edge as she approaches Miss Van Deusen.   Sean, what's going on?  Then he sees the corpses. He needs no further answer.   Isn't there some international S.O.S. thing you can do???   I'll take the upper deck.  Julius nods. They separate. Neither boy notices the smoke which is starting to emerge from a deck vent...    He's scrambling as fast as he can across the slippery deck as the monster relentlessly pursues him.    Jason is right at his heels.    slips on a rung, regains control, and continues upward. He makes it three more steps, almost at the uppermost point when JASON GRABS THE BACK OF HIS COAT, TEARING HIM   ...Empty space for a half-second, then MILES' FACE JOLTS INTO FRAME with a look of ultimate agony. Something has abruptly stopped his fall. Something quite fatal.    ...who is staring right back at him with dead pupils.",
        "Wolfe": "",
        "Suzi": "",
        "Donaldson": "",
        "Charles": "",
        "McCulloch": "Remember girls, the shuffleboard tournament will start at six p.m. sharp. A non-attendance will restrict your time in port, understood?  They nod for his benefit, exchanging derogatory whispers as they head up the ramp. Camera ADJUSTS to find a small parking lot adjacent to the docks, where several cars are just now arriving -- parents dropping off their high school seniors, hugging them bon voyage.   You'll do no such thing, Mr. Wolfe...  Camera ADJUSTS to reveal McCulloch, holding his list, checking off their names.   Your itinerary has been carefully planned and make no mistake, it will be executed accordingly.   Rennie's not coming.  He's devastated.   She changed her mind.  Let's see...Mr. Wolfe is in stateroom one-eleven and you, Mr. Robertson, are in two-twenty-five.  A booming VOICE from above interrupts them:   You can stop right there, Miss Mason.  He motions the others onward. Busted. Tamara instantly hands Eva her drug-filled purse, paralyzing Eva.   It's already been done.  Congratulations on the 3.9 average, Miss Watanabe. You're in stateroom two- fifty-five.  Eva smiles awkwardly, reaching for her luggage, stalling to see what happens with Tamara.   All right. But if it mysteriously disappears en route, I'll have you sent back home the minute we dock. Understood?   Jim Miller and Suzy Donaldson never showed up. I'm a little concerned.   Let's go -- we're running two minutes late.   You have no right...   She doesn't know what she wants. She's never had a stable life.   I'm her legal guardian, not you or anybody else, and I alone know what's best for her. End of discussion.   Your father was looking for you, Mr. Robertson.  McCulloch appears behind them. The mood has been broken.   There's a storm predicted tonight.  Rennie looks at the ocean, forcing herself not to turn away.   You're making a big mistake, Rennie. It's not too late to put you back on land.   If Miss Van Deusen knew how afraid you were of...   Why are you doing this to yourself?   Facing your fear doesn't always conquer it.    through a porthole window...and through the viewfinder of a video camcorder. McCulloch shakes his head, turning away from Rennie and walking away. A sinister electric guitar solo screeches out. PAN with McCulloch as he passes the window, coming around 180 degrees into a CLOSE UP of J.J. JARRETT, fingering a sleek Gibson \"Flying V.\"   Have you seen my niece anywhere?   Senior predictions started five minutes ago and she hasn't shown up.   In your case I'm sure that's true.  He brushes past Wayne angrily.   What are you doing in here?   Are you girls using drugs?   I'11 be coming around your stateroom in exactly fifteen minutes, Miss Mason. You'd better have your biology project ready or I'm phoning your parents.   Then I'll make sure you remain on board while your classmates see the sights.  He's gotten to her with that one. McCulloch storms away.   Dear God...   Oh, I can see that. You've done a wonderful job of supervising the kids, Miss Van Deusen.   Stay away from her...both of you.  He starts to lead her away. The crazy DECK HAND blocks their path, slipping his flask away.   I'm in no mood for any more stall tactics, Miss Mason. Where is your final project?   Where did you get that alcohol?   That's it. You're not setting foot off this ship until we return home.   Oh, you've done it now. Not only are you going home, I'll see to it that you spend next year back in a high school classroom!  He storms for the door, swinging it open, coming face to face with:   You'll never get away with it.  And you can forget about ever attending any film school.  You're both going to be very, very sorry.  He storms off. Wayne looks very, very nervous. Tamara steps over to him, cuddling up.   I thought I told you to stay away from her.   I demand to know what is going on...   Where's the radio?   What are you talking about?  The Deck Hand takes a final swig from his flask, dropping it with unsteady hands.   You're insane, old man. Jason Voorhees has been dead for over thirty years.   A killer walks this ship indeed. And it's certainly none of us...  The crazed old man gets his drift. Everyone looks at him suspiciously. McCulloch grabs a SCALING KNIFE off the wall, taking a step towards him.   That lunatic has been spouting off about Jason since we boarded...  It's no coincidence.   Walking corpses are not real!   You'll do no.such thing and watch your mouth, young man! I'm in charge here!  They all look at McCulloch defiantly.   Christ...where's Rennie??   What?? You sent her out there with a murderer running around loose??   You had me worried to death!   I'm the one you should be listening to! Do you think dropping an anchor in the middle of a storm makes any sense whatsoever?  She tries to find some defense, but McCulloch leads her off before any wards come forth.   I refuse to discuss this ridiculous notion that a ghoul is terrorizing this ship.   Whatever you've been...imagining... has nothing to do with Jason Voorhees.  I want you to be safe, Rennie. That's all I care about.   This isn't a request.  He closes the door on her face, pulling out a key, locking the dead bolt. She pounds on it from the other side.   She's locked safe in her room, no thanks to either of you. (like Sean isn't even in the room Has he brought it back on course yet?  Sean doesn't look at him, still trying to assimilate the wall of components.   He's the son of the Captain, for Chrissakes. You'd think he'd be able to operate this thing!  Sean closes his eyes, trying to keep from losing his mind and temper. A fierce WAVE slaps the windows in front of Sean's face, motivating him to get his shit together. He checks the Omega and LORAN.   Well?  Sean doesn't answer, moving to the seat behind the helm. His father's seat. Sean takes the chair, adjusting the wheel, watching the compass. He studies a series of buttons on the console.   What's that?   Can you shut that damn thing off??  Sean moves to a bank of switches, his eyes darting around for the appropriate switch. Miss Van Deusen sees McCulloch remove the FLARE GUN from the cabinet.   I doubt very much that one even exists.   Use some common sense! Setting off a fire alarm causes panic...the same kind of panic caused by suggesting Jason Voorhees is on board.  Enough is enough.  He marches out the door. Sean finds the alarm kill switch, flipping it. The excruciating siren vanishes. He grabs a pair of rain jackets, tossing one to Miss Van Deusen.    almost flinches when the lights die and he's plunged into blackness. He moves forward, every step tentative. He passes the convection ovens and we REMAIN on them, spotting the frightened face of the DECK HAND in the shadows. The deranged old man is very sober now, clutching a LARGE KITCHEN KNIFE for defense.   Rennie??    The room is empty, shards of the porthole glass scattered across her rug. He steps over to it, bringing his head up to the gaping hole, peering outside. We wait for his attack...but it doesn't come. McCulloch's eyes take us to something across the room. The bathroom door is afar.    cautiously steps up to the door, silently grabbing the knob and SWINGING IT OPEN. It's empty. He hears something, spinning around. Again, nothing is there. McCulloch quickly moves to the telephone and dials. A few seconds pass.   Come on, answer!!   What did you do with Rennie??   She never should've set foot on this ship. This is your fault!    Not another word, do you hear me??   Why aren't you with the others, woman??  Finally the message comes forth:   Jason Voorhees is dead!!  A PRIMAL SCREAM OF AGONY immediately cries out behind them, the words unintelligible. They turn around to witness THE DECK HANG STAGGERING TOWARDS THEM, GRIPPING   raises the flare gun with zero hesitation and FIRES IT...   Dear Christ...   Get in the boat, Rennie!    You can and you will!!  He tries to slap her out of it, dragging her over to the boat, ignoring her terror-stricken frenzy.    If we don't find the shore soon we're all going to die.  Sean tries to ignore him, keeping his mind on rowing.   Come on -- everybody up the ladder.  He's the first one up. Sean looks at Rennie, concerned, then hoists Toby up in his arms. They all begin climbing the ladder.   A wonderful choice of places to dock a boat, Mr. Robertson.  Sean looks away, trying to keep from losing his temper.   You heard him! We have to call the police  Julius jerks away from McCulloch's grasp. But he knows McCullochis right.   Everyone split up -- we'll cover more ground that way.   My niece's life hangs in the balance right now!! Every second counts.  No more rebuttal. They hurry off.   It's okay -- she's with me.  She turns around, lowering her hands, utterly relieved.   Rennie, thank God...  But Rennie goes to Miss Van Deusen instead. It's a bitter pill for McCulloch.   Don't be ridiculous!    Yes.   He's a walking corpse, a phantasm from hell.  The others stare at McCulloch angrily. Miss Van Deusen turns to the confused policeman.   Rennie, for God's sake slow down!!  She doesn't hear him, or anything for that matter. Her eyes remain straight ahead, never blinking.   Perfect for a swim, isn't it?  She frowns at him, looking away.   You've been coming out here every summer for the last three years, young lady, and you still haven't learned how.   That's what you said last year. I think the time for your first swimming lesson has just come.  The splashing stops.   You don't want to end up drowning like that Voorhees boy, do you?  She's instantly tense.   He never learned how either and he's still at the bottom of this lake.   Oh, he is indeed. And ready to pull down anybody who falls in and can't swim.   Am I? Let's find out.  ...And quicker than she's able to react to it, MCCULLOCH  Better swim before Jason drags you down, Rennie. Come on, you can do it...  ...but Rennie thrashes in the water, struggling to keep from sinking under the surface.   You can and you will! Swim, Rennie!    I was only trying to teach you. But I pulled you out, Rennie. I saved your life.  Rennie just stares, incredulous.   You...are...NOT POSSIBLE.  But possible, and actual, he is. A PAIR OF ROTTED ARMS",
        "Wayne": "Too cool, J.J. Your parents came through.  She pops out the guitar cable from her practice amp.   Sure...but I gotta shoot some shockumentary footage first.  He avoids eye contact when he says it. She gives him a look.   She's sexy.   I'll catch you later.    He exits. She mumbles something under her breath, coiling up her amp cord.    as he walks onward. DROP DOWN to find his FEET as he passes a DARK ALCOVE...which happens to have SLIMY FOOTPRINTS AND SEAWEED leading into it. Camera FOLLOWS the footprints, RISING again and with dim recognition, our eyes fall on JASON. Lurking in the shadows. But not for long.   Yeah, motivating downstairs, I think. What's the problem, Mr. McCulloch?   Some of us don't want our futures predicted.    who casually lowers his camcorder.   Oh yeah.  She quickly slips on her robe again, all business. McCulloch realizes what has just transpired.   This is going to sound supremely lame...but I've had the major hots for you since our sophomore year, Tamara.  He gulps down the fizz. She forces a smile, stashing the incriminating videotape.   But I thought...   Wayne, you're an asshole.  He despondently exits.   Miles -- have you seen J.J.? She was supposed to be jamming down in the power room but...  Miles gestures for him to be quiet, listening very worriedly.   Jesus Christ...  He's too scared to even videotape it. Sean is bombarded with questions as he tries to figure out the radio.   Is the radio even working??    The Captain's been murdered. The buzz is that Jason might be on board.   No. And I'm not losing any sleep over it.   So what else is new?  Look Eva, you're asking the wrong dude to feel sorry for Tamara Mason. Wise up -- it's not hip to be her friend.   I'm sorry, but I've gotta find J.J.  He hurries on.   What are you taking, Julius?    We're talking the possibility of Jason Voorhees here.  Julius pauses. He's not stupid.   J.J. -- you down here?    --They slip off the bridge of his nose, skittering down through the catwalk and pipes to God knows where.    lies helplessly on the metal grid work, realizing his bleak predicament has just been squared. He pulls himself to a standing position again.   We got a major problem, Wayne.    His vision now gives him shadows and shapes rather than crisp images. He raises the gun and continues unsteadily forward.    takes another step, almost tripping on a set of stairs leading down to the next level. And when he arrives there...      instantly raises the rifle and FIRES...    ...and the body goes down. He's hit him!    stands there, breathing some relief. He gets an idea, looking through his camcorder eyepiece. Wayne begins to adjust the eyepiece diaptor.    as the figure on the ground slips in and out of focus, finally becoming crisp. WAYNE HAS SHOT A CREW MEMBER -- the same good looking one Tamara and Eva ogled earlier. He's holding a screwdriver from his waist band tool set, not a knife.    slowly lowers his camera as his heart rises into his throat.   No...  He raises his camcorder again, hoping a second view will reveal a dead Jason rather than this young man.    He gets half his wish: a HOCKEY MASK NOW FILLS HIS FRAME...but Jason is far from dead. Wayne catches a split- second glimpse of Jason's fist coming towards him, then the camera is KNOCKED FROM HIS EYE AND THE WORLD BECOMES   screams, blindly running as fast as he can. He trips, picking himself up, stumbling down the catwalk stairs. Wayne makes it about ten feet before he stumbles over something, bringing with it a harsh strum from an   Sure enough, his left shoe is resting on the pickups of a blood-streaked Gibson Flying V.    --sprawled out on the metal floor. He gropes around, his hands feeling something. It sends chills from his groin up through his scalp.   No no no...      which bobs up in front of her. Rennie cries out, scrambling to grab onto Sean as what's left of Wayne's body washes past them.",
        "Webber": "",
        "Rennie": "Me too. But I'm not sure Uncle Charles will be.   What about not-so-great writers?  Rennie smiles self-deprecatingly, Miss Van Deusen grinning back. But Rennie's smiles are few and far between, this one disappearing as she glances out the window.    as the countless gallons of harbor and lake water spread out before her, eery in the bog. A small ROWBOAT grazes across it occupied by two indistinguishable people.   Just felt a little chill.  Rennie rubs her arms, faking coldness.   Really?   That's wonderful, Miss Van Deusen...what's it about?  She parks the car, turning off the ignition.   I don't know what to say...    as she reaches the top of the gangway, her heart pounding. Rennie pauses, working up the courage to look out at the lake again.    The ROWBOAT she saw earlier is still there, even closer now.    contract, her blood pumping faster. Then she hears a   leans back in terror, falling into Miss Van Deusen.   I just got a little dizzy. I'm fine.  She continues up the ramp. HOLD on Miss Van Deusen, watching her go, somewhat troubled by it. RACK to McCulloch below her, also watching. Extremely concerned.    continues along the starboard side, not risking another glance overboard. She passes an older, very deranged DECK HAND, mopping the deck. HOLD on him, his bloodshot eyes following her like a crazed raven.   Hi, Sean.    We changed our minds.  Sean pats her dog. There's an awkward pause...they are obviously in the early stages-of a relationship. Sean reaches into his coat pocket, bringing back a small necklace-sized box.   But I didn't get you one...   Sean...it's beautiful.  Sean takes it from her, snapping it around her neck.   I'd love to.   I'm staying.   She didn't push me into coming.   I don't even know why I'm afraid, Uncle Charles. I can't even remember when it started. Don't you think it's time I found out and got over it?  He takes a measured pause.   I'm staying.  He's not going to change her mind.    through a porthole window...and through the viewfinder of a video camcorder. McCulloch shakes his head, turning away from Rennie and walking away. A sinister electric guitar solo screeches out. PAN with McCulloch as he passes the window, coming around 180 degrees into a CLOSE UP of J.J. JARRETT, fingering a sleek Gibson \"Flying V.\"    No inspiration. She puts down the pen, looking at her dog, who's curled up on the bed.   What do you think...time for some personal experiences to fuel our minds?  The dog's eyes blink, but no more than that.   I agree.  Rennie moves to her closet, finding a silk blouse and some black satin pants.    feels her throat catch with terror and an instant later:    are distracted to Toby for a second; when she looks back at the porthole, she sees:    snaps out of it, moving to the door, where her dog is frantically clawing with his fur up.   Okay Toby, calm down...  She's talking to herself as much as the dog. Rennie closes the curtains on her window, then steps to her door. She swings the door open for Toby...and exposes an empty hall. Toby scrapes his way out of the room, dashing off down the hall, snarling.    appears from the shadows, just as startled to see them. It's not Jason at all. Rennie can't help noticing the cocaine, trying hard to ignore it.   Have you seen my dog? I think he came this way.   No thanks.  Rennie continues on. After she's gone...    as she presses on, the corridor getting darker.   Toby?  No reply. She walks on, turning down the left hallway... but camera turns down the right hallway. Suddenly JASON REVEALS HIMSELF, quietly stepping from the GAME ROOM. He's holding a pool cue, which he proceeds to snap in half, providing a splintery sharp shaft.   Have you seen my dog anywhere?    as they walk along the edge of the pool.    Yeah...a lot.    There's something I haven't told you...  ...But before she can begin the next sentence, Rennie is shoved from behind.      flounders at the surface, nobody realizing the terror she's experiencing. She's too scared to even cry for help.    She's can't even hear Sean, her vision being splashed by the chlorinated water. She sinks under the surface, turning around...AND COMING FACE TO FACE WITH YOUNG JASON. The eight year-old corpse GRABS HER ANKLE AND  I can't swim.   It's not that simple.    Whenever I get near the water, I see this young boy drowning. He tries to pull me down with him.  The teacher didn't expect this, taking a thoughtful pause.   About four years ago...at Crystal Lake. I spent a few summers there with Uncle Charles inbetween boarding school.   No. It was just a normal summer. I've never been able to figure it out.   It wasn't her fault.  He gets Rennie to her feet just as Sean runs back with a towel. McCulloch grabs it from him, wrapping it around his niece, facing both Miss Van Deusen and Sean.   Just...leave me alone...  She pulls away from him, hurrying off, confused and frightened. McCulloch's retinas pierce the Deck Hand with scorn. He checks his watch, then storms off.   It's not real, it's not real...   I want to go home. I want off this ship.  After a moment...   Can he really take us home?   What about you?    as Miss Van Deusen steps up to Rennie's door, gently knocking.   What is happening???  Sean regains his balance, moving to the computer console, looking at the OMEGA and LORAN like he's never seen them before.   What do you mean???  Another wave hammers the bow. She's in a state of awful panic.   Can't you call for help??  Sean tries to get a grip and assess the situation, pacing frenetically.   Where are they?   Just radio for help, okay???  She hurries out the door, working on terror-induced adrenaline. Sean rushes to the radio console, depressing the keying button, speaking into the mike.    moving closer to the right anchor hoist, her back to us as well as Jason. She climbs behind the hoist, looking at the consoles. Then suddenly a BARK.   Toby?  She turns, catching a glimpse of her dog running down the side of the deck. Rennie leaves the hoist, going after Toby.   Toby? Where'd you go?  No sign of her dog. She remembers her mission, heading to the anchors again.    is oblivious as she reads the directions above the controls.    remains in the hoist box, making certain it is operating correctly. A second later, we see the fleeting outline of a HUMAN SHAPE appear behind her.   But Sean said...    as McCulloch guides his niece down the hallway, swinging her door open.   Can't we at least talk about it?   But what about the drowning boy I've been seeing?  He avoids eye contact. McCulloch takes her hand, ushering her across the threshold. She's standing inside her room now; he's in the hallway.   I'm not staying in my room, Uncle Charles.   Uncle Charles!  He ignores her, briskly walking away.    as she throws her fists against the door a final time, realizing it's futile.    as the alarm bombards Rennie's ears like everybody else's. She hurries to her curtained porthole window, working up the energy to look outside. Rennie gets a grip on them, FLINGING THEM OPEN. The DECK HAND'S CRAZED FACE IS GAZING BACK AT HER. Rennie screams; a second later he hurries off.    as Rennie's HAND jiggles her doorknob again, confirming that it's locked tight. RISE to find her desperate face; she begins furiously pacing and we DOLLY BEHIND HER ...but Rennie stops cold upon hearing:    stands frozen, feeling herself drawn to him like a magnet. She crawls to the edge of her rug, which is now a deep lake, and extends her arms to him.    feels the skin on her face crawling off her skull, her eyes expanding because she's now looking at:   Hhhhelp....me....    screams with guttural fear, letting go of herself, watching her younger self drown in the hole in her room.    disappears under the surface of the water...which seconds later CHANGES BACK INTO HER OVAL RUG.    groping for a weapon to stop him, her fingers skittering across her table like a spider.    Her head is pulled taut against the wall just below the porthole, with Jason's hideous mask framed in the circular shattered window. She's slowly dying.    Her movements slow as the oxygen leaves her system. But Rennie's fingers miraculously find a recognizable object: the ink-dip pen given to her by Miss Van Deusen. She seizes it, getting a firm grip.    sinks to the floor, scrambling on all fours to get as far away from the porthole as possible. She makes it across the room to her stateroom door just as:    The window...  Sean rushes to the shattered porthole, looking out, seeing nothing. He steps back to her.   I don't understand what is happening to me...  She breaks down; he holds her.    The ship noticeably rocks from the explosion. Rennie clings to him fearfully.   What is it??  One second later, the lights begin to flicker.    Sean paces feverishly in the blackness of her room, trying to think, talking to himself.   Is the ship going to sink??  He returns to Rennie, the panic settling back in.    I'm not going near any lifeboat!   I'm not!!   I...I can't...   Toby...  She climbs in, moving to her equally, relieved dog, McCulloch and Miss Van Deusen right behind her.    flailing her arms in the water right next to the lifeboat, drowning.   Hhhhelp...me....  Suddenly a DECOMPOSED HAND REACHES UP FROM BELOW,   She gazes in utter shock, screaming:   No!!!  They all follow her eyeline...but the water is calm, nothing there.   No!  She pushes his arm to the side just as the bullet  Please don't...    opens her eyes, looking into the dead boy's face as blood drips from his mouth. He collapses in front of her, giving way to a view of JASON TOWERING OVER HER. At the same time:    shoves Gang Banger #1 off of her as Jason returns his attention to her. She grabs a loose brick and FLINGS IT AT HIM, CRACKING HIS HOCKEY MASK, momentarily disorienting him. Rennie sprints away.    Blurry, disoriented, erratic. Suddenly A FIGURE JUMPS OUT  Drugs...  Then Jason came. He's here, Sean.  Oh Jesus. He never expected this.    Her vision is still a stoned one but clear enough to set her target. We come straight at the abominable creature and:    slams on the brakes, jerks it into reverse and FLOORS IT   stomps on the brake pedal and the tires SCREECH TO A HALT. They all take a moment to catch their breath, looking out the front window...    desperately throws it into forward again, gripping the wheel and RACING FORWARD.    There's a FIGURE standing in the distance. But it looks too small to be Jason. We RUSH TOWARDS IT, CHANGING INTO SLOW MOTION JUST BEFORE IMPACT. The figure is a dripping wet boy with a sinister smile. YOUNG JASON.    opens her dazed eyes, seeing Miss Van Deusen's body charring inside the wreckage. It's incomprehensible. She numbly gets to her feet, stepping towards it. Something makes her hesitate: she peers down at the asphalt...    A pool of gasoline has collected, flames dancing across its glassy surface. Suddenly a TINY ROWBOAT DISSOLVES IN, not unlike the lifeboat she was so afraid of. The rowboat glides across the surface of the burning gasoline, TWO PEOPLE RIDING IN IT. The flames and asphalt   Shimmering water, clouds and pine trees reflected in it. The rowboat floats into view. The two occupants are YOUNG RENNIE and MCCULLOCH. She's wearing a bathing suit and an innocent smile. And not an inkling of fear about the water. She stands, letting the sun soak into her.   What a beautiful day.   I'll take some lessons this time. I promise.  She bends over, splashing the water.   He is not.   You're telling a lie.    Her uncle's face blurs and clears as water splashes her eyes.   I...I can't...    is too panicked to obey.   Hhhhelp...me....  She coughs on some water then disappears...    Young Jason is grabbing her ankle and dragging her down. The whole image BURSTS INTO FLAMES and we:   You pushed me...   He was down there!!!  And Rennie runs off. McCulloch starts to follow but Sean grabs him, shoving him down.   I was at school when they told me. 'Rennie, we have some very bad news... your parents have been killed in an auto accident.'  Sean gently takes her hand, sharing her internal agony.   It seems like everybody I care about ends up...  She can't finish. PUSH IN as Sean kisses her on the forehead, then makes her look into his eyes.    are lost in their shared quiet moment...until the GROWLING SOUND becomes audible. They look up, seeing:   Toby...  She starts to move towards him and her dog SNARLS  What's wrong, boy?  Another protective growl, then:    abruptly flee down the alley, Jason in mad pursuit.    shrieks in horror as Toby disappears inside the pit just as the train roars by.     runs straight towards the track pit like a football punter, RECOILING WITH HER RIGHT LEG, KICKING JASON   as they get to their feet, holding each other tight, looking down on the now-dead undead creature.    look all around them, having never been to a city as big as this. They finally turn far enough around to spot JASON in a series of three quick cuts, each one closer than the last.   Somebody help us!! He's going to kill us!!!  But the heavy Times Square foot traffic ignores her, bustling onward. Rennie and Sean have no choice but to flee again.   Please, hurry...  A telephone sits right next to her, but this is New York.   You don't understand -- there's a maniac trying to kill us!!!   Look!  She's spotted a MANHOLE COVER, slightly ajar. They haven't the luxury of thinking about it, Sean sliding the cover back as Jason comes forth.    carefully sidestep it, continuing on. They make it another ten yards when A FIGURE LEAPS OUT FROM AN ALCOVE, GRIPPING A HUGE WRENCH. Rennie's scream echoes through the tunnel.    tries to help up Sean but he's been knocked into the opposite wall, barely conscious.    backs away but does not run. The time has come to face her fears.   You never got me in the lake, Jason. And you're not going to get me now either.  Her voice is defiant. She carefully backstops, the irritating light never leaving us.    drops the can, fumbling for the flashlight again.   Get up, Sean!!!  His eyes blink, only half coherent. Then an inconceivable terror registers in her ears...A LOW, DEEP RUMBLING SOUND, COMING FROM UP AHEAD. Her head jerks in the direction of her planned retreat:    An ominously empty tunnel, soon to be filled with the unthinkable. The sound of RUSHING LIQUID is growing at leaps and bounds.    as her trembling chin rises, looking at:    rotates her head and sees:    drags Sean to his feet with the strength of a possessed woman, pulling him over to a SERVICE LADDER attached to the intersecting alcove wall.    Climb!!!  She shoves him up it from below, Sean summoning everything he's got to obey her. Rennie shoots a stare back down the tunnel...    The overhead lights are banging around like an earthquake has just hit; the liquid will be arriving any second. Her vision WHIP PANS 180 DEGREES TO FIND JASON APPROACHING FROM THE OPPOSITE END, groping around with his scaly arms like the claws of a roto-tiller.    slips on the rusty ladder, regaining her footing. and rushing higher. She takes her final glance into the tunnel, the ultimate horror registering in her corneas as she sees:    The powerful flood thrashes the ladder about two inches below Rennie's feet, the force of it fiercely shaking their rusty support. They are clinging to the ladder with their eyes squeezed shut. Praying for survival.    as the sewage level begins to drop. Rennie opens her eyes, glancing straight down and seeing.    The ladder beneath them reappears...which gives way to a PAIR OF HANDS GRIPPING THE BOTTOM RUNG. The liquid drops further, unshrouding the now-dead corpse of EIGHT YEAR OLD JASON. He's a relatively normal looking boy, probably the way he looked back in 1957...right when he drowned in Crystal Lake.  Jason Voorhees has finally been put to rest.    walk arm in arm, exhausted and oblivious to their pursuer. But something, some innate perception causes Rennie to slow...and stop. Her eyes register a horrid fear and she WHIPS AROUND TO FACE...   Oh Toby...",
        "Wickham": ""
    },
    "imdb_rating": "4.5",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMDUyMGIxZDctNDVlMy00ZmVlLWIzZGUtMzQ2NWVhNTgwMjIzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "A whole high-school senior class is finally graduating, and they're rewarded with a luxury cruise called \"Lazarus.\" At the beginning they are all having fun, including Rennie, who has a serious problem with the water because she almost drowned when she was little. Jason has boarded the ship and starts his killing rampage until only the main characters are left. After that, they decide to look for the killer and kill him. Unfortunately, Jason gets them first. After only a few of them escape and the ship reaches New York, they discover that Jason got there first and is ready to pursue the survivors so he can kill them. Now a young teenage couple must escape or die in the dark waters of New York.manuel15_jesus@hotmail.com",
    "name": "Friday the 13th Part VIII: Jason Takes Manhattan",
    "genres": [
        "Adventure",
        "Horror",
        "Thriller"
    ]
}