{
    "filename": "Fruitvale-Station_script.txt",
    "imdb_id": "tt2334649",
    "imdb_url": "https://www.imdb.com/title/tt2334649",
    "characters": [
        "Cato",
        "Cale",
        "Oscar Grant",
        "Vanessa (as Bianca Rodriguez)",
        "Kris",
        "Chantay",
        "Grandma Bonnie (as Marjorie Shears)",
        "Wanda",
        "Tatiana",
        "Brandon",
        "Sophina",
        "Carlos",
        "Officer Caruso",
        "Katie",
        "Officer Ingram"
    ],
    "dialogues": {
        "Cato": "Sup Osc, bruh?  You lookin for Emi?  Hell yeah he is. He was just over here...  Oh yeah, tell Moms I said Happy Birthday. I had meant to call her this morning.  Bruh I wish I could, but I gotta bust a couple moves tonight. What's good for the countdown though?  You ready?  Sole?  Every fish we sell here can be fried.  What you need for moms, bruh?  Bet.  Pssst!  How it go?  That's wussup bruh! Imma hit you tonight! Yall can ride with me.  Let's catch BART out there. Tell everybody to meet at South Hayward Station.  Aight bet. We'll see you there in minute.  You know it's illegal to smoke \"Blacks\" on BART right?  But its cool. We'll let you slide cause its New Years and all.  Shit, we gay too. We can do the whole gay thing together.  Real shit... watch...     See?  Learn how to play the guitar, and I got you bruh!  Come'on bruh, this us.  Come'on bruh!  Fuck these niggas bruh!  Get off of him!  You alright bruh?  What the fuck?  Hey, hey officer, this shit is brutality! What the fuck you doing to them?  Fuckin fake ass cops. We got you on camera!  You gonna Tase me for using my cellphone?  They shot Osc! They fuckin shot Osc bruh!",
        "Cale": "(just loud enough for  She a snitch to?  Fuck you and that bitch.  That's my best friend right there.  Wussup with that shit you was hollerin?  This the cat from bitch ass Palma Ceia I was tellin you about.  Fuck that shit, Bitch! My girl right here too. I don't give a fuck.  Fuck Palma Ceia!!!",
        "Oscar": "What's your resolution?  You trippin. You look fine. Plus you Mexican. You cut carbs and you can't eat nothin yo grandma cooks.  Really? Who told you that?  I'm gonna quit selling trees.  You gonna give me a reason to?    Look, I'm not going out, you happy now?  Man, wussup? I been home hella long...  What I gotta do? I'm here, right now. I fucked up one time, alright?  Look I'm done with that shit. All I want is you and T, forever.  Let me show you.    You want to sleep in here with Mommy and Daddy?  Damn, it's after midnight.  Wussup, baby?  Don't worry T, aint nobody's moving right now. Go to sleep.         We got enough to get yall there.  Go start the car up. You got your keys?  Go. I gotta grab my beanie.  See? Told you we'd make it. The light aint even on yet.  Naw, Imma go up to the job. Get some stuff for tonight.  Prolly like seven.    Last shot right here, you sure you want to work on your birthday? You still got time to catch a cold...  No problem. Come on, let's go celebrate right now.  Okay...You still want me to get a couple crabs, right?  Yeah Ma.  Yeah...  Hold on.  Hello?  Yeah Ma.  Nah Ma, it's good.  Ma, don't trip off that. I got you.  Ye-  Yeah Ma, and I'm gonna use my discount.  Love you.  Shit. What's good?  Yeah. He here today?  I came to get some crabs too.  You should come through grandma house tonight.  Frisco. Fireworks and the whole shit-  Let me get three Dungeness.  Fat ones too, bruh.  Your family having a fish fry for New Years or something?  It's cool. I work here.  It's my day off.  Is he black?  Your boyfriend.  Grandma...  I'm at my job, and this girl here-  Well, yeah....  Grandma, Grandma, I'm off today. I'm just shopping for the party.  Naw grandma. But I got this girl here, she wants to fry fish for her boyfriend, but she don't know how. You think you could tell her what she needs to know and everything?         Good morning, Emi.  Had to grab some stuff for my Mom's birthday.  Emi, hold up man, I wanted to talk to you.  I just want... I need my job back. I need my job back.  Look, I was going through some shit, trying to get back on my feet. But I need this job man. I'll show up early every day. You can start me back off with one shift a week or whatever. I'm here. You can work me 40 hours a week and pay me for 20. I'm here.  You sure you got enough?  Trust me. She's happy to help.  Oscar.       At the house, just got back from the job.  I am.  Yup.  Bad news first.  How much?  Okay. What's the good news.  What? That's fucking bad news too.  C'mon Chantay.  Aight.  Aight. I got you.  Love you too, scrub.  Wussup bruh? My bad about last night. You still tryna get that?  Shit bruh I can come to you.  Aight, bet.      Hey Ma.  You look nice.  My girls come over last night?  \"Candyland\"?  Yall let her win too, I bet.  Yall hella weak for that. She gets no easy victories with me around.  What?  Yeah, the kettle corn. Hella good.  C'mon. What she say?  Dark butter?  She is gettin way too smart.  What? What the Fuck you say about my Mom bruh?  You tough in here with these guards huh?  Naw, we good.  Dark butter huh? She always listening.  She too smart for her own good man. The preschool said we should think about starting her in school early. Phina tell you that?  Yeah, we're gonna put her in private school. I was lookin at St. Bede the other day. It's this other school that starts them off learning Spanish, then it gradually gets them back going on English. It's like a new thing-  What you mean?  I know I know I know. This is my last time too. I told you that. I ain't goin down no more.  She too young to know what's going on right now.  She aint say that.  Tell her that I love her more than anything in the world. And that I-  I don't want her to see me like this.  In a box.  I don't want her to be exposed to this.  So you really not gonna visit me no more? I got four more months!!    Ma, hold up. Let me get a hug.  Ma!  Ma! Hold up!  Get the fuck off me!  Ma!  Get off me! Ma! Ma!      Ma! Ma! Get the fuck off me! Ma! Ma!  Shit! No, No, No Stop!         I got good news and bad news my nigg.  Sold it to a white boy bruh.  Gave me a rack for it.  For your troubles.  It's good bruh. Take it.  I'm good, that's all you bruh.  What flavor did you get.  Why you didn't get ice cream?  Oh yeah?  You think you're faster than daddy?  What's that right there?  You know... it's work.    Naw, I'm smooth. Just a little tired.     I got fired.  Showin up late. Missed a couple days when I had to get some money.  Keep it real, they fired me two weeks ago.  My bad-  I thought I was gonna be able to get my shit back.  Phina,  I didn't have to tell you shit.  I thought you wanted the truth... But you ain't trying to hear that.  I dumped it. I'm done with that shit. I'm tired. That's what I'm trying to tell you. Thought I could start fresh today. But that shit aint working out.  I don't know? Something legal. Gonna see if my sister can hire me again, while I look. Maybe if I can just not fuck up, for 30 days.. Oprah said that's all it takes to form a habit, right?  Happy Birthday!  Don't trip, it wasn't that much.  Who you goin for in the Super Bowl Unc?  If somebody would have told me that two years ago I would have laughed in their face.  When I was coming up, Teachers used to love to tell me, \"You can be the President of the United States.\"  But I'll never forget, in my fourth grade classroom we had this poster. It had all 40 some odd presidents on that thang. And I looked at all they faces. And it was all white dudes. At that point, I realized my teachers was lying to me. A part of me aint believed what no teacher has said to me since.  Oh, Come'on Ma, don't mention it. You shouldn't even be doing this.  I told you. I aint missin no more parties.  Yeah, nothing major. Gonna meet up with Cato, Jack, Jason and couple other cats. Head out to the City.  Naw. We gonna keep it low key. Probably just catch the fireworks, and then roll around after that.  Yeah, just chill, we'll be cool. Sophina's got work in the morning too.  I'm sure they will. I'm not gonna be drinking.  Yeah we might catch BART.  Yeah, we might have to do it.  Okay, I promise.  Alright we out, Birthday Girl. Love you.    Alright.  Happy New Year!!!! ARRRGHHHH!!!  Ok, ok, ok. My bad. Stop you guys. Time out.  Let's brush those teeth.  You want your teeth to rot? And your breath to smell like gumbo?  No you don't. Because then- THE  What?  Me and Mommy are gonna go see some friends for a little bit. We'll be right back.  We'll be back, in a few hours I promise.  I know, I know. But me and Mommy promised our friends we would go and visit them. We'll be back before you wake up, okay?  Scared of what?  Those are just firecrakers. You'll be safe inside.  I'll be just fine. I'll tell you what, tomorrow when we wake up, we'll play \"Candyland\". And then guess what we can do after that?  Better.  Better than that.  Chuck e Cheese's.  I promise. We'll play all the games. And daddy's gonna give you lots of tokens okay?  And me and you are gonna eat up all the pizza okay? We're gonna even eat mommy's pizza because she can't have carbs.  Don't worry about that.  I'm gonna head out now baby, okay?  You don't want to go in there with your cousins?  I love you.  Yall ready?    We gon miss the countdown bruh.  Wait, how we gonna do the countdown?  My phone don't got no seconds.  You bruh, you got a watch?  Turn the music off bruh!!!  Happy New Year baby.  Say bruh.  I know man, but a couple young ladies with me really got to use the bathroom man.  But you got one for employees right?  Look bruh, I aint rich. This my last ten dollars. All I got on me. Now you can take this $10, and open the store up and let them use the bathroom. Or you could go home, and when you get here tomorrow, its gonna be a puddle of piss right there.  Cause they aint gonna piss on themselves bruh.  These two right here.  Right on bruh. Happy New Year to you too. Thank you.  She pregnant...  No problem.  How long yall been married?  Money.  For real?  How'd you get the ring?  Yeah, I'm straight off that.  What you do?  Peter? Oscar.  What about the wedding though?  Hold up, bruh bruh.  This shit packed bruh. Let's catch the next one.      Watch out with that shit bruh. This aint the time. I got my girl here and shit.  I aint nobody's Bitch nigga!    Yeah, I'm good. Fuck them bruh.  We gotta get off this train bruh.  Aight. Imma meet you at the Hayward station, Okay?  The boys, bruh.  Split up!        What are you talking about? What did I do?  Alright, alright, Fuck.  What the fuck bruh, we didn't do anything.  Hold on bruh. Are yall arresting us or what?  Be cool bruh, chill out. Let me talk to her.           What the fuck is you doing bruh?  I'm just tryna get home. I got a daughter at home bruh.    Hell naw, we still up here at Fruitvale. They holding us here and beatin on us for no reason.  The fuckin police. I'm about to get us up out of here though. Imma hit you back.  Are you in charge man? Look...  What the fuck, bruh?  I'm complying, just take your fucking hands off of me! I'm fucking complying.  Chill out Brandon bruh. We about to go home. They can hold us here as long as they want, but they can't arrest us bruh, we aint do shit.  You can't arrest him. Fuck that shit. For what? We aint do noting!     Bruh I got a daughter at home, I'm trying to get to. I'm not trying to go to jail.  Man you a bitch ass nigga, foreal.  What? What the fuck?  Don't call me a nigga bruh!      Fuck, I can't move!   ..you shot me... you shot me. i got a daughter...",
        "Grant": "",
        "Kris": "What about Twenty Twenty though? That shit hard as fuck. Two twenties. We \"gettin' plenty\" in twenty twenty.  This was a burnt ass mission. Let's get back to the house.",
        "Chantay": "Hey, chump! What you doin?  I thought you were off today.  Oh... You call mom yet?  Oh okay. I got good news and bad news.  I need help with the rent for this month.  Like $300. I'll get you back in a couple of weeks.  I'm working overtime tonight.  No it's not. Double time and a half.  Hey, gotta do it. Moms understands. But I need you to get her a card and sign it for me.  And Osc, don't get me a fake ass card with white people on it. I want a black card. And not one of those joke cards either.  Thank you Oscar, love you.  Bye.",
        "Wanda": "Hello?  Hello Son! Thanks for the text last night.  As tempting as that sounds... this place would be a mess without me today. We close early though...  Yes, and can you pick some... are you driving?  You wearing your earpiece?  Don't lie to me. That's all you need is to get pulled over right now. Put your earpiece on, Oscar.  It's on now?  Okay pick up a couple of packets of dried shrimp too. Come by on your way, I'll give you the money.  Alright I'll pay you back tonight.  Okay, so you're buying this, with Farmer Joe's money... right?  Because that's the only kind of money you have right now... right?  Okay, well let me run in here. I'll see you later tonight.  Love you too.  What happened to your face?  We played board games.  Of course.  Do you remember that microwave popcorn you bought a while back?  Yes, kettle corn. I popped some of that for us, and I was putting it into a bowl. Tatiana's looking up at me, like she wants something.  She looks up at me and says,\"Grandma, do we have any dark butter?\"  Yeah, I'm thinking she saw \"Food Network\" or something. So I say, \"what's dark butter sweetheart?\" She says, \"When Daddy took me to see WALL.E he asked for light butter, so I want to try some dark butter this time.\"  Oscar!  Oscar, Calm down.  What happened to your face?  I'm not coming to see you anymore.  I'm not coming here, to these visits anymore. This is the last time.  You want to keep putting Sophina through this... go ahead. But Tatiana doesn't deserve this. She didn't have a choice.  I guess that's why she asked me why you love taking your vacations more than being with her.  So I'm the liar now.  Tell her yourself. Next time you call. Tell your daughter how much you love her over the phone. Or better yet, just let her come visit you?  Like what?  But this is how you are right now.  You've already exposed her to it!  I love you Oscar, I'm praying for you, and I'll see you when you get home.  Hey baby. You guys are just in time.  Oh my god, you guys got a cake too?  Osc. You know all I needed was two, you didn't have to spend so much money.  Well, I'm happy the did win. If the country really is as messed up as you say, I think he's our best chance of fixing it.  You'd make a great politician. You can talk your way out of anything.  I know, I still feel like it's just too good to be true.  Thanks for your help tonight.  I enjoy washing dishes. It's relaxing.  I really enjoyed having you here. You think it's safe for me to get used to having you around?  You guys got plans for tonight?  You guys gonna go OUT OUT?  Roll around?  You guys gonna be drinking?  Why don't you catch BART out there? That way you can drink and hang out, and not have to worry about anything.  No traffic either. You know its gonna be crazy. Going and coming back.  Promise me, if you and your friends go, you'll catch the train. I'm serious.  Aight. Don't make me follow you guys to make sure... you remember Prom.  Love you too, son. And Happy New Year.     Sophina?  Sophina, baby calm down. I can't hear you. Is Oscar there with you?  Where are you?  Did Oscar get arrested?    Sophina baby, what's going on?       Where are they taking him?  I'm on my way.  My son is Oscar Julius Grant III. He's been shot, and they told me to come here-    His lung? How is he... How is he going to be able to breathe?  But he's going to make it right?  Okay, okay. Please do whatever you can, okay? My son is a good boy.  Please do what you can. Please.  --and we ask that you may put your healing hands around your child, we ask that you may operate through these doctors, and breathe strength into their hands as they work on him. Heal him lord so that we may one day see his smile again.  Can I see him?  Just me.     I told him to catch the train. I told him to catch BART! I didn't know they were gonna hurt him. I didn't know. I should have just let him drive. I should have let him drive. I wanted him to be safe. Please please let me hug him.  Please let me go hug him. He didn't like to be alone!! I let my baby die alone!",
        "Tatiana": "I can't sleep...  Daddy.  I don't want to move to Livermore.  Mommy can I have two of the fruit snacks today?  But mommy I-  Good morning Mrs. Stacy.  We played \"Freeze Tag\" today.  They couldn't catch me.  You cheated!  Bisabuella!  No!  Yes!  You had gumbo, too.  You guys aren't gonna sleep over too?  But I don't want you to go.  But you should go to bed. You already brushed your teeth. Remember?  Nooo! Don't go.  I'm scared.  I hear guns outside.  But what about you daddy?  Go to the park?  \"Toys R Us?\"  What?  Really?  Okay.  What's a carb?  Love you too Daddy.  Daddy? Daddy? Time to go to \"Chuck E Cheese\"!  Where's Daddy?  Yeah. Where's daddy? Is he on vacation again?  Yeah.  Yeah.  But I don't want Daddy to live in heaven. I want him to be with me.  Well does he have his cellphone? Maybe if I call him and talk to him, he will come back.",
        "Brandon": "Two Thousand Nine... don't even sound right bruh. But Twenty Ten? Twenty Ten is the year my nigga. We gettin it in, for Twenty Ten. See? Don't nothing even rhyme with Two Thousand Nine.  Man fuck that. I'm boycottin 2009 bruh. Come twelve o' clock it's officially Twenty- Ten. We \"gettin it in\" in Twenty- Ten.  But that's skippin too many years bruh. You can't skip a whole decade.  Osc, Osc! Take a shot with ya bruh for the New Year.  To Twenty- Ten.  Make sure you keep your hands to yourself...  We aint gonna miss shit, we can get it poppin right here.  Right on lil bruh!  Happy TWENTY- TEN!!! FUCK TWO  Wussup now nigga?  They aint even want it when they seen us, bruh! Punk ass Southside niggas...  I've been trying to tell them bruh. She don't want to listen to me, cute ass. What you doing after this baby?  This is some bullshit. Yall not even the real police. You way too cute to be a cop anyway...  Why the fuck you keep pointing that taser at me, bitch? We didn't even do nothing wrong.  Get your hands off me.  Hey!  That's brutality you fucking toy cop!  Fuck, bruh!",
        "Sophina": "I'm gonna cut carbs.  FUCK YOU...You just gotta help me stick to it. It only takes 30 days to form a habit. Then it becomes second nature.  ... Oprah  What's yours.  Osc.  Don't go out there tonight, stay home.  Osc. Osc, hold up.  I don't know...Every time you touch me, I can't help to think about how you was touchin that Bitch.  You know what? You right, go.  No, you fucking got caught, one time. You gonna sit here and tell me that was the first time you kicked it with that Bitch. Never seen her before that huh?  What you mean, forever?  What? She's askin for you.  You know better than that T. What time is it?  Hella nosy...  No, T. You can take an extra apple if you want.  Don't argue T.  Com'on Osc. We gotta stop and get gas too.     You gonna go home and sleep, right?  Ugh. I'd rather die than come here on my day off. What time we supposed to be at your grandma's?  We gonna go to Frisco again? Catch the fireworks?  Let me get in here.  Bye.                Carrot cake.  Cause it aint your birthday nigga.  Can you take me by my grandma's house so I can get changed?  Probably when you stop having trees in the car before we pick up T.      Grandma, can you watch T tonight? We gonna go to Frisco.  But Rose got hella kids to watch.       Rose gonna watch T.  What you think?  You okay? You been hella weird today.  Osc. Wussup?  What the fuck you mean? Did they lay you off?  They doing cutbacks or some shit?  For what?  They told you today?  Don't fucking my bad me Osc! What was you doin when you was pretending to go to work? You know what? I don't even want to know.    You aint shit, you know that? You lie to me, you lie to your fucking daughter. You don't give a fuck about us.  So you would have just kept faking like you were going to work? And would have just been out bustin nocks? And doing whatever else, or WHOEVER else you do while I'm at work?  I want you to be honest with me. But off top. From the fucking jump. Not after you lie for two weeks get cornered, and don't have a choice. What did you today. Hmm. I bet you sold that fucking zip.  You threw it away?  You tossed a whole zip of weed. And you don't have a job.  Oh my God I could slap you right now.  What are you gonna do?  Look at me.  You really done with that shit?  You better be. Don't make me have to do this shit alone, again. I don't know if I can.      I keep thinking about how much it means for T.            Happy New Year, Osc.  I gotta go too.  Thank you so much.  It might not be a next one baby.  Find a spot... I'm good.  Osc! Osc whats going on?  Cato! They jumpin Osc!  You okay baby?  Baby, the boys already up here.  Just get back on the train, get back on the train, quick..  Osc, where you at? Are you on the train?  Who? Who's beatin on you?  The police got Oscar and them and we heard something I don't know if it was a beanbag or a taser or what.  Naw, he upstairs, with the Police and I can't see them. We downstairs-  We in Oakland, at Fruitvale BART.  I don't know, I think so.    What happened?  Where Osc at? What happened?   Please let me through, that's my boyfriend up there.    That's my fucking baby daddy right there! Is he dead? Did they fucking kill him?  They shot him. They shot Oscar! They say he alive, but he's bleeding and his eyes was closed.      Can you to take me to my car?  T, come on.  Come on T, we gotta take a shower.  Is the water okay T?  No.  Remember when I told you about God... and the angels?  And about how when we die we go to heaven?  Well, God needed another angel, so he took Daddy to come and live in heaven with him.  He can't. Once you go to heaven, you can't come back.  No. Daddy doesn't have his cellphone baby. You can't call him where he is.",
        "Carlos": "You gonna slow down? I'm not dragging your drunk ass all over Frisco.   Call the ambulance!",
        "Officer": "Is there a problem here?  Grant, back in your assigned visiting area.",
        "Caruso": "If you were involved in the fight get the fuck off the train right now! Don't make me come in there and pull you off. This ain't my first fucking Rodeo.  You. Get off the train.  Come on. Let's go.  Sit down right here.  Where are your friends at? Huh?    You alright Babe?  Shut up.     Are you gonna fucking comply? Are you gonna comply?  What?  Cuff these two assholes. They're fucking going to jail.  Oh yeah?  We don't have to tell you shit.  You should have thought about that before you decided to be a piece of shit.  I'm the bitch ass nigga huh?  Bitch ass nigga huh?!   Yeah! Yeah!  Don't worry about it. Don't worry.   Take off! Go!  Go! Fucking pull off!  Clear the door!     What the fuck happened?",
        "Katie": "Uh, yeah... I want to get a pound of, wait... Can I see what your sole looks like?  Yeah, no, wait. Your catfish. Let me see what that looks like....  Okay but, I want to fry it. Like a fish fry. Are these the ones you can fry?  Okay, let me have a second.  Ahh, yeah. Something like that.  Oh, okay. Well, I'm cooking dinner tonight for my friend, before we go to the city. And he really likes fried fish, like southern style. And I maybe lied a bit, and said that I know how to cook like that.  What? Who?  He's white. But he knows a lot of black people... He's not my boyfriend either...  I'm not sure what type of fish he wants. And most of these recipes are different on this site.      Hey!  Oh my god, Your grandmother is so sweet! I can't believe she was kind enough to do that.  Thank you so much... Katie by the way.  Oscar... like the Grouch!!  Take care.  Oscar. Oscar!  Right here. Its me, from Farmer Joe's.",
        "Ingram": "Hey, back up! Get back!  Get on your knees.   Fuck. I can't get his hands! Back up."
    },
    "imdb_rating": "7.5",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTQ0OTU1MDkxMF5BMl5BanBnXkFtZTcwNjI5OTA3OQ@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "This is the true story of Oscar, a 22-year-old Bay Area resident who wakes up on the morning of December 31, 2008 and feels something in the air. Not sure what it is, he takes it as a sign to get a head start on his resolutions: being a better son to his mother, whose birthday falls on New Year's Eve, being a better partner to his girlfriend, who he hasn't been completely honest with as of late, and being a better father to T, their beautiful 4 year old daughter. He starts out well, but as the day goes on, he realizes that change is not going to come easy. He crosses paths with friends, family, and strangers, each exchange showing us that there is much more to Oscar than meets the eye. But it would be his final encounter of the day, with police officers at the Fruitvale BART station that would shake the Bay Area to its very core, and cause the entire nation to be witnesses to the story of Oscar Grant.—The Weinstein Company",
    "name": "Fruitvale Station",
    "genres": [
        "Biography",
        "Crime",
        "Drama"
    ]
}