{
    "filename": "G.I.-Jane_script.txt",
    "imdb_id": "tt0119173",
    "imdb_url": "https://www.imdb.com/title/tt0119173",
    "characters": [
        "Cortez",
        "Chief of Staff",
        "Slovnik",
        "Wickwire",
        "Newberry",
        "Jordan O'Neill",
        "Stamm",
        "Theodore Hayes (as Daniel Von Bargen)",
        "Instructor Johns",
        "Instructor Pyro",
        "Flea",
        "Lillian DeHaven",
        "Master Chief John James Urgayle",
        "McCool",
        "Royce"
    ],
    "dialogues": {
        "Cortez": "We'll get to know them later.  Dressed in Navy greens, they stand in formation -- ten rows, ten deep, helmets in hand.  Pacing before them:   Aw, what is this...  Shit of a saint...  Aw, this is such bullshit...  Motherachrist...  No problem, sir!  Four years I petition to get into this program.  Four years.  Finally get here, and now it's co-ed?  Such bullshit.  Now I'm gettin' hammered just 'cuz she's on our crew.  Tellin' you, I'd rather be the last class with balls than the first one with chicks.  Hoo-yah!  Better'n sex in a car crash!    Entering my scan now...  FAVs clear.  Anyone?  Smoke her.  Only blanks.  Lemme do it.    This tank's not gonna cut it, el- tee.  Handle's stripped.  Nobody's comin' outta that crash, el-tee.  Nobody.  What, we're gonna pry 'em out with paddles?",
        "Slovnik": "",
        "Wickwire": "We'll get to know them later.  Dressed in Navy greens, they stand in formation -- ten rows, ten deep, helmets in hand.  Pacing before them:   Just trying to thin the herd. That's all they want to do right now.  I got eyes, Newberry.  Cuh-lass, face right!  They're more afraid of you.  It was made clear before you came -- harassment equals career suicide. Can't say anything good, so they don't say much at all.  To your face, anyway.  It was made clear. Anyway, stay ballsy.  First week's hell, then it levels out.  Until S.E.R.E. training, anyway.  That's hell-and-a-half.  Made it to Week 10 last time.  You're kind of a surprise yourself.  Fuck.  Yes sir.    'Sposed to be 20-minute intervals, no more.  Huh-uh -- but wasn't middla February last time, either.  Hey.  Way to gut it out.    Intagliata was out chasing breakfast.  They found his tracks. Well, shit.  When I was sittin' behind a desk in Washington, it made sense, somehow. Blame it on my big brother.  He was Spec-Recon.  And the stories he used to tell...  One time he was doing a rekkie of the Libyan coastline.  This is, like, right before we bombed Khadaffi into the past tense.  So his crew does a nighttime infil, maps all the big artillery placements and stuff, then turns around to get the hell gone.  But between them and the water are five Libyan guards, all armed to the nuts.  Nah, they were dead-ass asleep.  But on every guard's chest,they left one Marlboro cigarette.  Just a little calling card to say they'd been there -- and could come back any time they wanted.  So the shit you gotta go through? To get from here to there?  Brother said it was worth it.  Worth the training... worth the divorce... worth anything.  At first.  Not me.  You?  O'Neil?    That's okay.  Just an ex-girlfriend. And know I remember why.  Maybe I'll just head over to McP's with the others, have a drink or four.  Don't wanna come, do you?  I think you look beautiful.  Sure, sure.  Okay.  Well... thought I'd ask.  I'm sorry, O'Neil.  But as class officer, it's my obligation to report all violations.",
        "Newberry": "We'll get to know them later.  Dressed in Navy greens, they stand in formation -- ten rows, ten deep, helmets in hand.  Pacing before them:   Wow.  You see that girl?  How long i'zis for?  Swear each time's gettin' longer.  Evasive maneuvers or radio for emergency extraction, sir!  They got regular peeps on this island, don't they?  Go, go, go, go!",
        "Jordan": "Lieutenant O'Neil.    Do we know it's him using the beacon?  Not a decoy?  Chances of recovery?  North Korean beaches are the best protected, most heavily monitored in the world.  The civilian population is so propagandized that it acts as an Early Warning system.  Extraction team has to be small and silent -- I'd go with Seals over Delta Force. Problem is, don't want to hold a conventional sub off-shore for target practice.  Where's The Polk?    Quick-hit technique used by Capone. Rigged a getaway car with running boards and handles.  All his guys had to do was jump on and take a ride.  Check the files -- DPRK-57 -- I doped it out as a contingency plan:  Seal Team infiltrates, picks up the package, links up with recovery sub.  But don't waste time opening and closing hatches.  They just grab the periscope and hang on for neutral waters.  Only four minutes to neutral waters, sir.  Why not?  No, thank you, sir.  Thank you, sir.  We hear back from the Pentagon?  Hate this part.  Just sweating it out on the sidelines.    Thank you, ma'am.  Um, may I ask what this is regarding?  \"Coronado.\"  I know that, sir.  Ma'am.  It's just that... Beggin' your pardon, Senator, but... do you understand that this involves combat training?  Captain Dwyer.  Technically.  Uh, question, ma'am.  Would I be the only one?  The only woman?  Well, shit-a-doodle-do...   It's not so much furnished as equipped -- scuba gear and wetsuits in the mud room, life vests on coat racks, a training bag and boxing gloves hanging in the living room. In the kitchen we find...  A naked man.  He's steeping tea.   ... well, I survived Basic Training and three brothers -- so I know how to fight.  What scares me are the sexual politics.  I don't want to be turned into some poster girl for women's rights.   ... and sets it down beside Jordan, languishing in a tub. Snow builds on a window sill.  Facing Jordan, the man slides into the tub.   Just like you would be.  I take it you don't either.  Feet.  Royce.  We're the same age, we started the same time -- and now you're sitting in the upperdecks while I'm still down in the bullpen. What does that tell you about the Navy?  You need operational duty to really advance... you need combat training to go operational... yet combat training is off-limits to people with tits.  I'm topped out at Intel. Forget the glass ceiling -- I'm beating my head on a big brass ceiling.  This has nothing to do with you.  Get your dick back here.  It has everything to do with you.  Sorry.  But after our days... So if I try this thing... if I ship out to Coronado... what happens here?  Wai', wait.  What happens if it works?  Four months of training, three years of operational duty. What then?  Which is guy-speak for...  You know, right up until you said that -- I thought I did know.  Thank you, Royce.  It was shaping up like such a tough call -- and then you go and make it so goddamn easy. Really, thank you so much.  Excuse me, lieutenant.  I was told this is where I check in.  Still don't have my bearings yet. Direct me to the officer's quarters?  Fine.  And the officer's quarters?  Thank you, ensign.  Thank you, sir.  I'm fine, sir.  Thank you, sir.  But I expect a certain amount of pain.  Barber was my next stop, sir. Would've had it regulation sooner, only --  Really, I have no problem with --  None at this time, sir.  Sir, I just want you to know... I'm not here to make a statement.  I don't want to make men look foolish. All I care about is completing the training and getting operational experience -- just like everyone else, I suspect.  We better get a medic over --  Thank you, sir.  But I like these just fine.  I'll try anyway, sir.  Well, now I feel so much better.  Whose orders were those?  And how do you know that?  I didn't know they let you try again.  Especially at your age.   Two beds.  Matching lockers.  A desk, a chair, a mirror. All overwhelmingly dull.  Jordan drops the robe off her shoulders to take inventory of her body.  Both sides of her neck are bruised from the phone-pole run.  Her back and thighs are sand-burned. Mirror cuts abound.  She's already a mess.  Jordan uncaps some cologne.  It's a vestige of her old life she's not going to surrender.  She sniffs.  Savors. Dabs.  Looks back in the mirror...  And breaks out laughing.  It's like dropping a rose in a cesspool.      I can make this wall without --  Say again, sir?  Chief, sir, I don't understand why --  What \"all females\"?  If I'm the only --   Jordan pushes inside -- and stops when she sees the little two-step platform.  That awful crutch.  Someone has put it beside her bed.  Jordan wheels around to check...    Pardon the hour, sir.  But you told me to come to you immediately if I felt I was being mistreated in any way.  It's you, sir.  And it started the day I came here.  It's this double-standard, the separate quarters, the deferential treatment.  It's how you pulled out my chair and nearly served high tea the first time we met.  I can't afford civility, sir.  How am I supposed to fit in with these guys when you've got me set up as an outsider?  Even if I make it under these rules, I still lose, because there'll always be a flag in my file -- \"Yeah, she made it, but...\"  I mean, really -- why didn't you just issue me a goddamn petticoat to wear around the base?  Pardon?  I think you've resented me from the start, sir.  No, sir.  The shape doesn't bother me.  It's just that goddamn rotten stench.  Same rules for everyone, sir.  Across the board, sir.  Wouldn't dream of it, sir.  So I'll get a fair shot?   Jordan tosses her belongings into a laundry bag.  She slings the bag over her shoulder, boots aside the hated two-step on her way out...    Your new roommate.  Anybody usin' these drawers here?  Funny, the C.O. says I can.  That your desk?  I'll take this one.    What about you, McCool?  Any problem with the room assignment?  Just do it, okay?  Come on, Montgomery...    So it really has nothing to do with actual brain size?  Well, Flea, I appreciate the respect you just showed me.  But I don't need it and don't want it -- not that kind of respect, anyway.  It's just gonna hurt us both, okay?  Do that.  Hey.  You okay, Flea?    What, you gonna give it all up for a maple twist?  How dumb you gotta be? That's exactly what they --  Thanks, Wick.  See me, sir?  (catching C.O.'s  Uh, ma'am.  Sir, I want you to know that I had nothing to do with any of this.  Not this article, not --    Ah, c'mon...  Fine by me, sir!  You're kiddin' me.  Permission to get dressed, sir?    I see.  So when a man tries to rescue another man, he's a hero. But when he tries to rescue a woman, he's gone soft.  It also seems like a problem with the men's attitude, sir.  So maybe you should be sniffing around their shower room instead.    That's what I hear.  Who's \"we\"?  I don't know if there's any single reason.  But my father was Navy. And he had this old-time recruiting poster in his den.  It showed a girl trying on a sailor's uniform while saying, \"Gee, I wish I were a man! I'd join the Navy!\"  Was maybe 10 years old when I first saw it, and even then it felt wrong.  Made me mad.  And I don't think a month has gone by that I haven't thought about that poster.  \"Gee, I wish I were a man.\"  The woman I saw you with...  But are there... I mean, how many...  Royce...  It's hard to find time to sleep, Royce.  Much less keep up with my phone life.  I feel like there's men here, there's women here -- then there's men.  But hey, what'd I expect?  Me?  Why me?  I saw an article...  So why are you telling me this?  You know, Royce, I got enough heat on me without you turning up the jets, too.  Well, let me warm you:  I'm going though with this.  The more everybody fucks with me, fucks with my head, the more it just makes me want to finish.  So don't expect me back crying in your arms any time soon, okay?  Still can't make up your mind, huh? Gotta go, Royce.  Sure.  I'll join the crowd.    Newberry, get a photo.  South?  West?  North?  Didn't even bitch about the seat, did I?  I don't know...  Pri One is to protect the mission. If she represents a real threat, we have to do it.    If not, firing will only give away our position to hostiles in the area.  Now how smart is that?  All right, fire-and-evade maneuvers. Drop everything but weapons and the PRC radio -- we're gonna be high speed, low drag all the way to the link-up site.  Ready?   Fuck. Basher-Basher, this is Ground Crew Six requesting emergency extraction. Stand by for a PRC fix...  I'm lookin', I'm lookin'!  'Cool?  How long? Please, HOW LONG?  \"Don't know how much I can take\"... \"A little taste of death\"... \"Save the nail\"... \"It's been three days now\"...  Who is it?  Wick.  They got your crew, too?  You really came back for more?  Of this?  If you got a good one, Wick...  They had to kill 'em?  That's a good story.  He was married?  You got anybody, Wick?  How'd you make it last time, Wick? How'd you get through this part?    \"Dad.\"  Dick, Jane, and Spot.  Green Eggs and Ham.  You're not going to get anywhere.  You might as well put me in the cage.  Should I be afraid?  Wasn't deemed a threat.  No.  Yes.  I mean, depends on --  That's not right.  I think you're the liar.  We didn't know we were compromised. Firing would only've given away our position.  No.  Sure.  Just like your men do.  Should I practice bleeding, too, sir?  Would that make me a better soldier?  Don't do it, don't do it...  Don't tell him shi --  Fuck you and the boat you rode in on.  Sir.  Make you a deal, Flea.  Never tell me how I look -- and I'll never tell you.  Sorry, didn't mean to --  First big night of liberty and no date?  You're pathetic, Wickwire.    Thanks for lying.  But you're the class officer, Wick, and it'd just be weird if we hook up.  Besides...  Do you, uh, know...  We're going over to her place to make salad and pasta.  Just, you know, nothing special.  Sir?  See me, sir?  (a beat,laughing in  They're very wrong.  And I'd like to know where you got this information.  This is insane.  You've got no proof.  We hugged.  Because the men didn't want me eating with them.  Jesus Christ, let's get this right.  Sir, I just want you to know that this is either a gross mistake -- or someone's vindictive bullshit. In no way did anything happen between Ensign Blondell and myself. We're just friends.  I'm saying, we're just friends.  Sir, please... if there's any way to do this without dragging everyone through the mud...    Would you have the discretion to end it right then and there?   An hour later.  Sharing a quiet moment, Jordan and Royce cradle tea mugs while sitting on the rear porch that overlooks the Potomac and a fiery sunset.   All I wanted was an honest chance. And If I couldn't get it, I couldn't stay.  Maybe.  Though it didn't seem like he was getting any satisfaction out of it.  Almost like... Did I say he was class officer?  No shortage of suspects.  Royce.  Tell me you didn't keep a file on me.   CLOSE on multiple files being pulled out of a briefcase. One contains clippings -- \"G.I. Jane\" photos, editorials, political cartoons.  Another holds records of Coronado personnel -- Jordan's crewmates, instructors, the base brass.   It's done with, Royce.  Let it go.  I'm tired of fighting back.  I just wanted to come home and be safe and have you here and the river there and just forget the rest of the world, okay?  What about him.  Instructors typically pull three year assignments.  This guy's in and out in one year -- your year.  That sound right?  Sounds like an amazing coincidence.  I don't know, I don't care.  \"In Washington...\"  Wickwire said he was dry-docked in Washington between stints at Coronado...  You don't crap out of Spec-Recon and get another shot without dispensation from someone up in flag country. He's got a Sea Daddy somewhere.  Yeah.  Me too.  Don't say my name.  Or rank.  But can you do me a favor and pull a transfer order?    Who signed as his \"sponsoring officer\"?  What'd you find, Kathy?  Lieutenant j.g. O'Neil.  What chamber?  Which way is that?  Okay, which way?  Senator DeHaven...  DeHaven...  We can talk here or we can talk outside, Senator.  You tell me.  Lieutenant Thomas Wickwire.  You know him.  It should.  You nominated him for Spec-Recon just three days after you nominated me.  Did you set me up?  Did you set me up just to see me fail?  What changed?  If I have to ask again, Senator, I'll be asking in front of cameras.  So?  Isn't the President jumping on your bandwagon?  You don't know that.  What are you saying?  That a women's life is more valuable than a man's? That a women's death hurts a family more?  You were never going to let women serve in combat.  You always had a safety net.  Or thought you did.  So the rhetoric gets you headlines. But the reality gets you in trouble.  I wanted the choice.  The chance to prove myself, my skills, my work, me.  That's how it should've been.  You promise Wickwire a fast ticket, too?  I'm sure it is.  You know, I wonder what the SecNav would think about it.  If I spoke with him.  So I wonder what the President would think.  Sir?  What did he say?  Just walk away and never stop.  Good to see you again, too, sir.    Cortez, see if you can dig out the tools without losing the rest of out gear.  Try a wrench on that thing.   Base, this is Crew Leader Six.  We have a downed helo 12 miles west- south west of base with three aboard.  Repeat, we have a downed helo with three aboard...  Flea, 'Cool, Cortez, Newman -- take your minis, hit the water.  Go, GO!  Base, this is Crew Leader Six.  What is your E.T.A. on that rescue helo? Over.  Base, don't think you copied me.  We are 12 miles out.  Seafox tops out at 30 knots, which makes it a no- show for 18 minutes.  Over.  Shut your hole, Slutnik.    Chief, sir -- rescue team won't be here for 15 minutes.  What's your air situation?  Over.  15, sir.      Spotted you, Chief.  Pri One is to slip you some air, so we're coming down with a tank -- just something until the A-team shows.  Over.  Chief?  So we got two full mini-tanks, three minutes each.  'Cool?  How much air in yours?  Grab an oar, find a way to weight it down, we're gonna need it.  Cortez, help him.  Flea?  You take one of the two full minis -- and just follow my lead.  So I guess we get one shot at it.  Chief, sir... still with me?  Sir, let me suggest you stop giving orders and start doing exactly what I say, because that's the only way we're all getting out of here.  Now how's your vest check out?  Still good?  Flea, take the pilot up slow, feed him air.  Chief, sir, you and I are gonna take the express elevator outta here.  Remember to let your air out.  Ready?  Shut up, sir.  I'm concentrating.  The Navy Cross...  I was looking for him earlier, but...    So here we are again.  Staring three years of operational duty in the face.",
        "O'Neill": "",
        "Stamm": "We'll get to know them later.  Dressed in Navy greens, they stand in formation -- ten rows, ten deep, helmets in hand.  Pacing before them:   What is it with the damn phone poles?  We sign up for Spec-Recon or  No, goddamnit.  No.",
        "Instructor": "Count down... one, two... count down... three, four...  Down to BVDs!  Now face the Pacific... link arms... and take a stroll!  Out of the water!  Up!  Up!  Up!  Up!  Go regulation if you can't do the reverses, O'Neil.  Not doin' them very fine, O'Neil.  You'll try what we tell you to try, O'Neil.  Go regulation.  On your belly... on your back... on your feet... on your belly... on your back... on your feet...  Who'd you kiss to get back in here, anyway?  Hang on, here...  Don't have to use it, O'Neil, but it's gotta go out. Five... four... three...  ... two... one... MARK!  Automatic five-second deduction, which slips you under the wire. It's called \"gender-norming,\" O'Neil -- standard procedure for all females in physical training courses.  Where you been the last few years?  58 degrees this morning!  That's not a bad water temp, really -- if you're standing where we are!  Slurred speech, lack of proper motor control, short-term amnesia -- all early signs of hypothermia! Advanced hypothermia is easy to detect in a classmate!  He'll look like he's dead!  If you can't feel the other guy's pecker, you ain't in tight enough! I want nuts to butts!  Flea!  O'Neil!  Why is there a break in that line?    22 minutes...  By my watch... which, of course appears to be broken... they've been in 27 minutes without the benefit of protective gear.   The instructors are shuffling muster lists, reorganizing the class.  B.G., the BELL TOLLS again and again.     Change those clothes, be back here in six minutes!  And I am timing you!  O'Neil!  What're you gawking at?  Get it up!    O'Neil... O'Neil... O'NEIL!  One burst, one body, O'Neil!  What the fuck you trying to do?  Spell your name? You are not infantry!  Your firepower is limited!  Excessive killing only risks compromise...  Infiltrate... establish your hide- site... record any movement of troops, vehicles, patrols -- any activity inside your scan.  If you are compromised, you have two options!  Newberry!  If you are extracting, be damn sure to follow procedures you have learned in your classroom training! A helo cannot extract you from a wooded area!  You must bring it down in a clearing!  What's the minimum clearance for an MH-60 Black Hawk, McCool?  You will be penalized for early extraction, but you will be penalized more for capture -- trust me, far more!  Survival!  Evasion! Rescue!  Evacuation!  Welcome to  Lieutenant!  Don't back down!  You broke a dozen training rules back there -- before I lost count.  She's a trainee, just like the others.  Why are you coming down so hard?  She's a women, and that's why you're ridin' her bareback.  I oughtta report you.  ... underwater detonation devices employ mechanical timers, and as such, they are subject to variances due to water temperature.  That's why when clearing mines, we always use two timers.  The charts now being passed out contain calculations you must memorize before...  O'Neil?  You're wanted at the C.O.'s.  Lieutenant?  I was asked to give you this.  I believe he earned it for saving a man's life in Saudi Arabia.  He wanted you to have it.  He was very clear on that point.  The Chief was granted early retirement as of 17-hundred yesterday.  By 18-hundred he was gone.  Out of the Navy.  Maybe it's not my place to speculate on his private thoughts.  But I think the Chief knew that his way -- his world -- had come and gone.",
        "Johns": "On your belly... on your back... on your feet... on your belly... on your back... on your feet...  Hang on, here...  Don't have to use it, O'Neil, but it's gotta go out. Five... four... three...  ... two... one... MARK!  Slurred speech, lack of proper motor control, short-term amnesia -- all early signs of hypothermia! Advanced hypothermia is easy to detect in a classmate!  He'll look like he's dead!  If you can't feel the other guy's pecker, you ain't in tight enough! I want nuts to butts!  Flea!  O'Neil!  Why is there a break in that line?  O'Neil... O'Neil... O'NEIL!  One burst, one body, O'Neil!  What the fuck you trying to do?  Spell your name? You are not infantry!  Your firepower is limited!  Excessive killing only risks compromise...  ... underwater detonation devices employ mechanical timers, and as such, they are subject to variances due to water temperature.  That's why when clearing mines, we always use two timers.  The charts now being passed out contain calculations you must memorize before...  O'Neil?  You're wanted at the C.O.'s.",
        "Pyro": "Down to BVDs!  Now face the Pacific... link arms... and take a stroll!  Out of the water!  Go regulation if you can't do the reverses, O'Neil.  Not doin' them very fine, O'Neil.  You'll try what we tell you to try, O'Neil.  Go regulation.  Who'd you kiss to get back in here, anyway?  Automatic five-second deduction, which slips you under the wire. It's called \"gender-norming,\" O'Neil -- standard procedure for all females in physical training courses.  Where you been the last few years?  58 degrees this morning!  That's not a bad water temp, really -- if you're standing where we are!    22 minutes...  By my watch... which, of course appears to be broken... they've been in 27 minutes without the benefit of protective gear.    Change those clothes, be back here in six minutes!  And I am timing you!  O'Neil!  What're you gawking at?  Get it up!    Infiltrate... establish your hide- site... record any movement of troops, vehicles, patrols -- any activity inside your scan.  If you are compromised, you have two options!  Newberry!  If you are extracting, be damn sure to follow procedures you have learned in your classroom training! A helo cannot extract you from a wooded area!  You must bring it down in a clearing!  What's the minimum clearance for an MH-60 Black Hawk, McCool?  You will be penalized for early extraction, but you will be penalized more for capture -- trust me, far more!  Survival!  Evasion! Rescue!  Evacuation!  Welcome to  Lieutenant!  Don't back down!  You broke a dozen training rules back there -- before I lost count.  She's a trainee, just like the others.  Why are you coming down so hard?  She's a women, and that's why you're ridin' her bareback.  I oughtta report you.  Lieutenant?  I was asked to give you this.  I believe he earned it for saving a man's life in Saudi Arabia.  He wanted you to have it.  He was very clear on that point.  The Chief was granted early retirement as of 17-hundred yesterday.  By 18-hundred he was gone.  Out of the Navy.  Maybe it's not my place to speculate on his private thoughts.  But I think the Chief knew that his way -- his world -- had come and gone.",
        "Flea": "We'll get to know them later.  Dressed in Navy greens, they stand in formation -- ten rows, ten deep, helmets in hand.  Pacing before them:   It's really \"F. Lee Montgomery\" -- but that gets whittled down to just \"Flea.\"  For short, ma'am.  No, ma'am.  I'll work on it, ma'am.  'Snot me.  It's him.  How you doin', Miller?  Miller?  Look like donuts to me...  Clear.  Don't wanna evacuate 'cuz someone came down with uric poisoning, el- tee.  What's the word, el-tee?  We're about one minute from a major take- down here.  Really don't wanna be captured, el- tee.  Heard some bad things.  Where are you... HEY!  Where are you taking her?  Oh, no... no, no, no, no...  C'mon, c'mon...  Mark it, mark it!  Cortez?  What the hell you waiting for?   Close as I can get, el-tee!  If we could just fix on him...  Six o'clock!  Marking, marking!",
        "Lillian": "",
        "DeHaven": "Whoa, whoa, whoa.  \"Land-based maritime specialties.\" Gimme a second here to de-euphemize that...  Would that be anything like \"typing\"?  \"Restocking the cupboards\"?  That sort of thing, Mr. Hayes?  Well, I'm just an old dame without much time left, so you'll pardon me if I jump right in here before they discontinue my blood-type.  I am deeply concerned over the Navy's seemingly incontrovertible attitude toward women in the military.  Case in point...  \"The Lark Report.\"     Yes, I see your signature right here -- twice the size of everyone else's.  And your conclusion was \"pilot error,\" hmm?  I'd like to think our next Secretary of the Navy would be prepared for anything, Mr. Hayes.  That aside for the moment, I'm struck by the tenor, the ill-spirit of your report... the degrading remarks by other aviators... innuendo about her performance in unrelated situations... even a reference to her sexual activity the weekend prior. In my seven years on this committee, I've never seen a downed aviator treated like this.  Never.  I'm deeply disturbed by this report, Mr. Hayes.  Not just what it bodes for women in the military -- but for your own confirmation as well.  ... a full 35 percent of all jobs in the U.S. military are still, to this day, off-limits to women.  And that's simply gotta change.  Sure.  And we're gonna hog the bathroom, too.  White House boys want a private meeting.  I'll act surprised.   Shoes dumped on her desk, DeHaven changes out knee-high stockings while devoting one ear to...   'Zat it?  Ten minutes, nothin' on the table?  Sweetcakes, you best go back to the President and tell him to open up the phone book and start lookin' for his next nominee.  Well, it's just that askin' you all to integrate the Navy is like sending a man to do a woman's job. How do you propose to handle the Combat Exclusion Laws?  By calling women \"Honorary Men.\" Ingenious.        Lieutenant O'Neil, I am prepared to nominate you for the Navy's Special Reconnaissance program.  Should you accept, you'll ship out to Coronado next week and join in the big testosterone festival.  Complete the course, and you'll have a fast ticket to any assignment you want. That's my personal promise to you.  California.  This is just a test case, O'Neil. But if it works out -- if you work out -- it could well change the Navy's official policy on women in combat.  Or, actually, its official non-policy.  Now who's your immediate superior there?  My office will fill him in and help expedite.  Look forward to meeting you at the proper time.  Jumping off now...  Yes, dear.  There'll be more to follow -- but yes, dear, right now you're the pick of a very large litter.  And your success would mean a lot.  Jumping, now...    -- and now I got reporters from Toadsquat, Iowa, calling my office and askin' what I know about this \"G.I. Jane\" thing.  Are you truly mouthin' off to a senior member of the Senate Arms Committee?  I mean, I'll give you points for style -- just nothin' for smarts.  Well, seein's how this thing is out, you let me handle the r.p.m.  From this point forward, I want all press matters coordinated via my office. I'll be god-damned if I'm gonna watch Hayes pull flowers out of his ass and take credit for this one. Him or the President. This my shade?  \"Midnight Mahogany\"? 'Cuz I'm comin' dangerously close to lookin' like Ronald Reagan here.  Awright.  How's our girl doin', anyway?  Jordan, dear.  How are they treating you?  Hmmm.  Maybe I'll ask when I see you in person.  Gonna be visiting that all-woman's America's cup team in a few weeks -- If I were a gambler, I'd say Dennis O'Conner's days are numbered.  But they're in San Diego, so I thought I'd take a quick promenade of the base.  \"Security\"?  What the hell you talkin' about?  Your base isn't secure?  Then set out the good plates, we'll all have lunch.  My office will follow up with details.  Jumping off, now...  Think I overplayed it?  Congress and the Pentagon share a lot of plumbing.  They'll never know whose leak it is.   DeHaven snags a BUZZING PHONE.   Yes?    She made it through S.E.R.E. training.  Got a call this morning from --  Not that.  The White House just announced that it was sponsoring legislation that would, in one stroke, void all remaining elements of the 1948 Combat Exclusion Laws.  You there?  Senator?  ... just got word today.  The Senator wants you to know that she's disturbed by the matter, and she'll be looking into it carefully to make sure you were treated fairly.  If you need to reach us, we're here in Washington, 202-224-3121.    Ms. O'Neil.  Yes, of course.  I'm Douglas Champeau.  Unfortunately, the Senator is in chamber right now. How can I help you?  I mean, she's on the floor of the Senate.  She really can't be disturbed.  But if you care to wait, I'll find you an office with a phone.  It might be several hours, but --  See the secretary, please.  Cloak room.  I'll meet her there. Just her.  Jordan.  I always hoped we'd get together -- though just now I'm gearing up for a child-care vote that --  Sounds familiar.  Jordan.  Might we do this over lunch tomorrow?  I do very much want to talk, but now is scarcely --  Absolutely not.  Wickwire was there to help.  To be my eyes on the inside, to make sure you were getting a fair shot.  At least that was the intent.  Should probably ask him that.  Two seconds, Walter. In 1981, the Supreme Court was asked to rule on the issue of women in combat positions.  The Court cited the 1948 Combat Exclusion Laws as a legal foundation for keeping women ineligible.  That decision held for all these years -- until the White House, 10 days ago, moved to have the Exclusion Laws voided. To demolish that legal foundation.  What he did was light the bandwagon on fire.  Because he knows what I know -- that American families are not prepared to put their daughters in harm's way.  In face, I do:  Roper, Harris, Gallop -- they all come back the same.  I'm saying it's not going to happen. Not when the President is set to turn this into a third-rail issue should I choose to ever campaign against him.  He will fry me six ways to Sunday for sending daughters and young mothers off to war -- and, quite possibly, for bringing them back in body bags.  Jordan.  I don't expect you to fully understand this -- but sometimes there's more to be gained from the fight than the victory.  The reality is this:  We send far too many men off to war.  I don't need to compound the problem with women. Can you honestly tell me you wanted that life?  Squat-pissing in some third-world jungle with --  Just hold the goddamn clock, Walter.  I once promised you a fast ticket, Jordan, and I always meant to make good on that.  Come work for me.  I can always use a hard-charger on my team.  I've had no direct communication with him since this whole thing began.  And that's quite verifiable.  You'll think about my offer?  Well, I spoke with Mr. Hayes this morning myself -- and told him the deal was off.  No more test cases. He was only too happy to oblige. Don't play politics with me, little darlin'.  You'd be up way past your bedtime.  I'll call you in a few days.  Senator DeHaven is here for the graduation ceremonies.  Just a small press corps.  Routine.  That?  That would be the all-woman America's Cup team.  ... of course, we always prefer peace to war.  But if we're going to war, give women a piece.  Give them the choice to defend their country. And if the President doesn't like that idea -- if he wants to continue to deny women their equal rights -- then I'll be happy to step out back with him any time, anywhere...  Jordan?  Jordan, dear...",
        "McCool": "We're fucked.  We are so fucked.  Nice distribution, though.  Somebody throw a tent over this circus.  \"It's not a job -- it's an adventure.\"  This where you bailed last time, Wick?  Wick!  They really got donuts over there?  Or just some'a last night's dinner rolls?  Just askin'  I say keep paddlin'!  We're almost --  Had a grandaddy who wanted to be a Navy man.  Wanted to fire them big guns on a big-ass battleship.  But Navy said to him, \"Oh, no.  You can only do one thing on a battleship.\" \"Well what's that?\" grandaddy said. \"Cook,\" they said.  Now this ain't 100 years ago -- I'm talkin' United States Navy, middla World War II. And you know the reason they gave him?  You know why they tol' my grandaddy he couldn't fight for his country?  \"Negroes can't see at night.  Bad night vision.\"  See, you just the new nigger on the block, O'Neil.  That's all.  And maybe you moved in too early.  32 feet, six inches, sir!    You mind?  I'm trying to eat here.  What the... Got an unknown here. 100 yards north-northeast.  She part of the training?  Shit.  Think we're had.  I ain't gonna shoot her.      Fuck me.  What's our go-to-shit plan, O'Neil?  32 feet, six inches!    Down... stay down...  So what'd he want?  O'Neil?  What the shit is...  Visibility drops dead at 40 feet. If they're deeper than that...  Beacon's a no-go for us.  What?  Maybe half.  Not even.    Hoooooo-yah!",
        "Royce": "Gotta situation here.  Where are you?  Stuck in traffic?  All right, stand by, we're going to switch over to COMSAT...    Signals received only sparingly, in such a pattern that leads us to conclude it is a downed aviator trying to conserve his batteries.  You're the analyst for East China, O'Neil.  Analyze.  Halfway 'round the world.  So that's the problem -- we can get the team in, just not out.  Blank faces here, O'Neil.  You expect the extraction team to ride the sub bare-back?  Is that correct, O'Neil?  All right, sending the recommendation across the river. Royce out.  That was good headwork, lieutenant.    Intel has its own glory, lieutenant -- no matter how subtle.  By the way, I'll need that option paper by 11-hundred today so I can review it with Admiral Hanover.  And do we have any of that breakfast tea around here?  Jesus God, what now?  So why're you even considering it? Are you?  Spec-Recon.  Those guys are world- class warriors.  And they will not want you there, Jordan.  Well, you're doin' shit-hot at Intel.    So dump on me.    You're such a ball-breaker sometimes.  Especially at night.  I'll try to keep the door open.  If you wash out, I make it so that --      Jordan...  Goddamn.  My poster girl.  Not right now.  Little slow, sir.  When's the Pentagon going to send me a good crisis?    Lieutenant!  Take a dance!    How hard they making it on you?  That bad?  Well, not this.  I was doing the Pentagon scene few nights ago.  Got some fresh stuff -- about you.  You may be in a hostile camp.  I think someone may be taking steps to ensure that you crash and burn.  Don't you know?  How they're talking about you?  I can't walk two blocks in Washington without hearing about \"G.I. Jane.\"  You're all over the place, and whether you wanted it or not, the feminists are sizing you up for that poster.  Big symbols make big targets, Jordan.  I think someone's gunning for you.  I'm only trying to warn you in case --  That's not what I want, Jordan.  I mean... it is and it isn't...  Jordan.  You watch your ass.    Got time for a brain-pick?  O'Neil, Jordan.  You knew about us?  Computer -- no transcription, no com-link, no data-link.  In fact... shut-down sequence 0-Niner-0-8, mark.  The E-Ringers?  Full integration is gonna cost the services billions at the worst possible time -- when Congress is already swinging the axe.  The Navy?  They've made it clear they don't want to pull missiles out of subs to make room for women's heads.  What's it gonna cost to make a fleet of Trident's co-ed?  Possibly.  Just to spite DeHaven.  The first female President?  Women.  I don't know.  Seems...  Christ, I don't want to see her take a fall.  She thinks I do, but...    I don't... What, someone on base?  A \"mole\"?    And this class officer... \"Wickwire.\"  You think he was just trying to get even?  Striking back for...  Almost like someone put him up to it.  Okay, who?  The Chief?  Or maybe even Turrentine?  Your C.O.?  Somebody was yankin' your stings, Jordan -- maybe from 3,000 miles away.  I wanted to know who.  I still do.  C'mon, Jordan.  Do the headwork with me.  Someone screwed you over like this, left unanswered charges hanging over your head, and you're not gonna fight back?  Well, before you crawl off to die, Jordan, give me five minutes of good headwork.    Or like maybe he was baby sitting a problem child for the Navy.  Well, pardon me if I do.  Now who else?  Who could've leveraged a class officer like that?  C'mon, Jordan, keep your head in the game.  What?  \"Wickwire, Thomas Dane\"... Second run at Coronado... and correct, they had him stashed in the \"Appropriation Liaison Office,\" whatever that is.  I'd sure like to know who.  Government car -- tow it if you want.  Just point us to DeHaven's office first.  Capt'n.    Look.  It's not like you'd be completely out of reach.  And maybe we could call in a few favors, get you stationed at Norfolk instead of Coronado.  There are ways of dealing with these things -- I mean, if people are so inclined.  \"Yes, Jordan -- I'll wait for you no matter how long.\""
    },
    "imdb_rating": "6.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BODBkMWRmZWItZGQ3NC00ODA4LTlkYjAtODA3MzQ5Yjk4MGIzXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "When a crusading chairperson of the military budget committee pressures the would be Navy secretary to begin full gender integration of the service, he offers the chance for a test case for a female trainee in the US Navy's elite SEAL/C.R.T. selection program. LT. Jordan O'Neill is given the assignment, but no one expects her to succeed in an inhumanly punishing regime that has a standard 60% dropout rate for men. However, O'Neill is determined to prove everyone wrong.—Kenneth Chisholm <kchishol@execulink.com>",
    "name": "G.I. Jane",
    "genres": [
        "Action",
        "Drama",
        "War"
    ]
}