{
    "filename": "Gamer_script.txt",
    "imdb_id": "tt1034032",
    "imdb_url": "https://www.imdb.com/title/tt1034032",
    "characters": [
        "Kable",
        "Trace",
        "Gina Parker Smith",
        "Angie",
        "Ken Castle",
        "Simon",
        "Gorge",
        "Geek Leader",
        "Scotch",
        "Mean Slayer",
        "Humanz Dude",
        "Delia",
        "Backup Geek",
        "Humanz Brother (as Chris 'Ludacris' Bridges)",
        "Hackman"
    ],
    "dialogues": {
        "Kable": "They say you only got three battles left til you get out...                      My name is Tillman, freak.   I killed my best friend.  Who's talking?  What?   Why would anyone want my name?  Wait. How did you get this picture?            Have you seen them?                                 Freak.  Who the hell is that?     Not much to aiming... it's just hand/eye coordination. I'm the hand... someone, somewhere else is the eye.   Sometimes... they take over - you know, completely. They move you. Like a robot. But it doesn't work so good... that part's just for show. You can't really fight that way.  There's a delay...  Whatever you call it. A slice of a second is the difference between living and dying out there. When the trigger pulls -  It's just me.   Not interested.  Your head ain't on straight.  Yeah, probably.   - the fuck did you say?        Who?  How come I can hear you?   Gamers can't talk to cons.  No. Pay attention to the game.   Wait a minute... are you twelve?  Bullshit. This is unbelievable. How am I not dead yet?  What?     Guess that goes for me too.  Different how?  That way.   Are you kidding me?  We should go that way.  Kid, trust me - I was going house to house in Tehran while you were still sucking mommy's nipple.           Listen to me. I don't know who's behind it, or why, but I was supposed to die today. They're gunning for us. I can beat them, but not with you controlling me.  Turn me loose, kid.        You want to win, turn me loose.  Find a way.                   You.  You're not a guard... who are you?  I don't have any.  How do you know that?  We'll see.  I need you to get me something.   Drunk.     No shit...   Blow me.   Yeah? Anything else ya fuckin cheerleader?                  Who are you?   Your voice...   You guys suck.   You're the ones who broke me out?  A few.  She took my blood. Why?   Alright.    Why me?   I can't help you.       Don't say that.  Stop.  This isn't you.  (trying to contain his     I love you... love you...    Say anything else and I'll find you... I'll rip you TO FUCKING PIECES, do you understand me?                You're dead.  Now what?   How long will she sleep?  So talk.   Yeah. He was.  The idea was to replace your brain, bit by bit, cell by cell, gradual... the new tissue would never break down, never deteriorate. A new era in human longevity is what they told us. We were doing the world a favor.  Thank you for the history lesson.  I don't know what to tell you.     Scotch.   I'm not getting out.  I'm fine.  I'm sorry.   I can't stop it... can't...  I'm sorry...      It's you.    Baby... what did they do?                                   *   Where is she?  That's all the story you're going to get.     Delia...     Castle.  I don't care about you.               You don't care about me.       You should've let him fight for himself, Castle - he might've had a shot.  No, I get it - you're pulling the strings on all of this... ... which makes my next move pretty easy to figure.           Look at this knife... imagine me sticking it into your gut... think about it... make it real.   Damn it, kid...  ... is the fuckin pose really necessary?  Wait.   Shut it off.  The nanex.     Set us free.  It's nothing to you. A mouse- click.      You good, sweetheart?",
        "Trace": "She's not home.  But Castle's personal security will be, soon enough - trust me, you don't want to meet them. You know, it's pretty obvious that you'd come here first.  You asked me that once before.  You should really come with me...  ... like, NOW.  Hang on.  We only freed your mind.  Right now it's the desperate ones... convicts, addicts... the sick, the poor... the ones that fell through the cracks... they have no choice.  So what's next? The health care system is collapsing - Castle comes to the rescue again...  The promise of a longer life and a fatter wallet - you think people will refuse?  We can't let that happen.  You can help us, Tillman. You have to help us.  That would be like cutting out part of your brain.  The nanocells replace the cells they replicate... they become you.  We're going to have to keep her sedated until we can kill the link... otherwise she's broadcasting everything she sees or hears.  Alright. We're ready to rock. Let's transmit in three... two... one...    Nobody could.                                                *  Your daughter was taken into foster care by the state two years ago.  The foster parent paid good money to remain anonymous... to make sure the girl would be untraceable. But there's always a data trail, if you know where to look. We do.  I'm sorry, Tillman. Guess he needed an insurance policy. She's with Castle.  This is for you, you dumb bitch.           I hope you do the right thing with it.",
        "Angie": "Hi.  You know, just hanging out. Looking to meet people.  I'm Nika.  Do you want to go somewhere?                   Delia.   Her name is Delia.  My husband - he... it's not entirely true, regarding his sentence. In fact, he's due to be released soon...  I work in society.  It's a job.  Yes, I do.     I'm her mother.    Oh. Hi. Rick Rape, right?  I thought you weren't allowed to come here anymore.  Are you still a bad boy?           Please don't kill me.  I'll do anything.  I can't.  She has to say what I tell her.  I love you too.     Come on... do it...           I missed you... so much...  I couldn't stop them.                                       *",
        "Ken": "I ain't complainin'!    Gina, when was the last time you saw someone volunteer to be murdered? I'm sure you know that every last one of our Slayers is a bona fide death row inmate - ...each one offered a chance to participate as an alternative to their sentence. Stay alive for thirty sessions and get set free... that's not a bad God damned deal.  I'd remind your audience that Slayers was put together with the full cooperation and approval of the United States federal government... that the revenue it produces is responsible for funding our entire prison system - keeping the bad guys behind bars... and that the prop was voted for by a cock solid 68% of the American public.  There's a lot of men and women in prison that could never cut it as slayers... shouldn't they have the same opportunity to roll the dice for a ticket out? Besides - they only need to survive one session.  Simple.  It begins with a single nano-cell planted in the motor cortex of the brain -- this cell can replicate, replacing the cells `round it with perfect copies...  ... these copied cells contain remote access functionality. Therefore, nano plus cortex equals the nanex.    You like her? Her name is Gina. She's a good little bitch.  Similar, yep. But control is strictly localized to the parameters of our gaming environments.  You take Society for instance: once a cast member leaves the workplace they are completely free from the control and monitoring of their player.    Someone else making all the decisions for you... no responsibilities, no tough choices... think about it.  Good little talk.  Shush!  That's a God damn hoot.  Uh huh. You might wanna oughta let my boys take a look at your firewall.    Not bad for video, eh? The latest and greatest... defy you to tell it from real life. You imagine porn on this thing?    Kable.  I don't care about you.               You don't care about me.  ... you just want your little sugar pie, I know. So don't do anything stupido. My house, my rules.  Come on, I want to show you something.  I've got to thank you for leading me to them, by the by - the human- zuzz that is...  Of course, soon enough they'd be whistling my tune like everybody else... but meantime it was that little cracker program they dreamed up that got my attention...  that was a genuine nuisance, no doubt about it... One thing even they didn't know, though: I'm wired too.  I replaced 98% of my own noodle with nano-tissue years ago...  But mine's different. Built to send - to transmit . Whereas every other K-soft cell out there - including the ones in... your head, Kable - is designed to receive. I think it, you do it.  We're talking every Slayer, everyone in Society City... I believe your better half would fall under that category... provided they're within range of my transmitters...  You're thinking small, Kable. But not as small as me.  See, nano cells are real small, a thousand times smaller than even these dust particulates... Inhale it and they go to work: replicating, spreading... like a virus, multiplying in exponentials... six months time I could have 100 million people converted - ditch diggers, porn stars, presidents - and not one would be the wiser.  A hundred million folks that will buy what I want them to buy, vote how I want them to vote, do pretty much damn well anything I figure they ought to do.  For instance.    Neglected to mention: my smart boys reversed that hack those fellas worked for you - easy breezy, once we had access to their drives...  You're mine, boy.    Biggest, baddest Slayer in the game... don't seem like much, does he?  Oww!  Lucky shot. OK, not really.  I need an audience, boys.  That's right, you crawl on your belly like a toad... Is this bad? I'm really bad.  That's sweet.  Alright boys, you ready? A true test.  Just like last time. Remember?  You're stronger now... a little more fight in you... but I think the end result will be about the same...                                                       *  Shh.      (like he's explaining the  You... fucking... do it...",
        "Castle": "I ain't complainin'!    Gina, when was the last time you saw someone volunteer to be murdered? I'm sure you know that every last one of our Slayers is a bona fide death row inmate - ...each one offered a chance to participate as an alternative to their sentence. Stay alive for thirty sessions and get set free... that's not a bad God damned deal.  I'd remind your audience that Slayers was put together with the full cooperation and approval of the United States federal government... that the revenue it produces is responsible for funding our entire prison system - keeping the bad guys behind bars... and that the prop was voted for by a cock solid 68% of the American public.  There's a lot of men and women in prison that could never cut it as slayers... shouldn't they have the same opportunity to roll the dice for a ticket out? Besides - they only need to survive one session.  Simple.  It begins with a single nano-cell planted in the motor cortex of the brain -- this cell can replicate, replacing the cells `round it with perfect copies...  ... these copied cells contain remote access functionality. Therefore, nano plus cortex equals the nanex.    You like her? Her name is Gina. She's a good little bitch.  Similar, yep. But control is strictly localized to the parameters of our gaming environments.  You take Society for instance: once a cast member leaves the workplace they are completely free from the control and monitoring of their player.    Someone else making all the decisions for you... no responsibilities, no tough choices... think about it.  Good little talk.  Shush!    That's a God damn hoot.  Uh huh. You might wanna oughta let my boys take a look at your firewall.          He's so perfect.  He's scary.  Yeah...       He's right.    How can you be sure?  It's human nature. They'll be seduced by the power, the violence... the dominance...    Bigger than the game? No. Then again, who ever would've imagined a player could last over a dozen sessions with the same I-con...  Tillman is a perfect soldier, a tactical killing computer - you dropped him in with common murderers. What did you expect?    And in the hands of a talented player...  Of course we can never let him out. Not after what we did to him.  Tell me again why we don't just get rid of the problem... You know, off camera?  YOU - lack a flair for marketing. The people would never accept that. They need to SEE their gladiators brought down.  One thing I know is what makes people tick.                  Not bad for video, eh? The latest and greatest... defy you to tell it from real life. You imagine porn on this thing?           Kable.  I don't care about you.               You don't care about me.  ... you just want your little sugar pie, I know. So don't do anything stupido. My house, my rules.  Come on, I want to show you something.      I've got to thank you for leading me to them, by the by - the human- zuzz that is...  Of course, soon enough they'd be whistling my tune like everybody else... but meantime it was that little cracker program they dreamed up that got my attention...  that was a genuine nuisance, no doubt about it... One thing even they didn't know, though: I'm wired too.  I replaced 98% of my own noodle with nano-tissue years ago...       But mine's different. Built to send - to transmit . Whereas every other K-soft cell out there - including the ones in... your head, Kable - is designed to receive. I think it, you do it.  We're talking every Slayer, everyone in Society City... I believe your better half would fall under that category... provided they're within range of my transmitters...  You're thinking small, Kable. But not as small as me.  See, nano cells are real small, a thousand times smaller than even these dust particulates... Inhale it and they go to work: replicating, spreading... like a virus, multiplying in exponentials... six months time I could have 100 million people converted - ditch diggers, porn stars, presidents - and not one would be the wiser.  A hundred million folks that will buy what I want them to buy, vote how I want them to vote, do pretty much damn well anything I figure they ought to do.  For instance.    Neglected to mention: my smart boys reversed that hack those fellas worked for you - easy breezy, once we had access to their drives...  You're mine, boy.        Biggest, baddest Slayer in the game... don't seem like much, does he?  Oww!  Lucky shot. OK, not really.  I need an audience, boys.  That's right, you crawl on your belly like a toad... Is this bad? I'm really bad.  That's sweet.  Alright boys, you ready? A true test.  Just like last time. Remember?  You're stronger now... a little more fight in you... but I think the end result will be about the same...                                                       *  Shh.         (like he's explaining the  You... fucking... do it...",
        "Simon": "Gay... gay... gay... super gay... hm.  Daddy like...  Fan-girl, stop hacking. If I want you unmuted I'll unmute you.  Uh huh.  What is that? Aaaa.  Woah.  Hey sissy.  Wanna make out?  Maybe.  Nice.    Here we go.  Question: do I look like I need the money? We've discussed this before - Kable is not for sale.  It's been real.  D'oh.  What the fuh...?  Um.  Simon. I'm playing you, dummy.      It's a mod.  I know.     It's cool, yeah?     That was sick.  I'm nineteen.  Cause I'm a badass motherfucker.  Gibs.  Like, giblets. Kibbles and bits. Chunks. Pieces.  Death row psychos, so what?          They had it coming.  Yeah, but you're different.  Dude, I don't know. Cause you're MY psycho.  Damn, new area.  Think about it, Kable: all the shit we've been through together. What an epic run. It's going to suck to see it end.  Well, yeah - I get that for you it's different.  There's nothing there.    ... shit shit shit!    What the hell...?  But-          No shit... you're the guy from TV. The HUMANZ.  To what, um, brotha do you refer... brotha?  You were listening.  Alright, then. Kable said we got lucky - that they were gunning for us - what was that all about?  Huh?   What things?  One battle left, I think I can handle my bidness.  This is, come on... too heavy... I don't know what the hell you're talking about... I just play games, man. Games.  Yeah, dude, I intend to.  That... would be cheating.    I do. I do feel you.    YOU happened, jackass. You wanted control, you got it.  Yeah, that's right. So please don't fuck up...  What's the matter with you Kable? Kill something!     Dammit!  Kable. Dude. What are you doing? What the hell?  Kable, PLEASE... get back in the game! YOU'RE SCREWING MY ASS,     Um.           Shit, shit, SHIT!  I'm dead.  Good times.  Yeah, um... I need something too.  Could you dudes do a sandwich like: peanut butter, almond butter, walnut butter... pecan butter, pistachio butter... pretty much any kind of, you know, nut butter. And Welch's grape.  It's awesome.  Cool.          Ummm.         Sorry.",
        "Gorge": "Hi.  You know, just hanging out. Looking to meet people.  I'm Nika.  Do you want to go somewhere?                Please don't kill me.  I'll do anything.  I can't.  She has to say what I tell her.  I love you too.  Come on... do it...       Hooz there?",
        "Geek": "Tech support.  There are 2 networks accessing the same IP address.  Someone on the outside is sending him commands...      Pardon?  True dat.  Well played, Kable.",
        "Leader": "Tech support.  Someone on the outside is sending him commands...    True dat.  Well played, Kable.",
        "Scotch": "Tillman. Never thought I'd be so glad to see your ugly grille.       What about you? You're dressed like a semi-human being... they let you out already?    Uh huh. You don't look good.        Who are you?",
        "Mean": "",
        "Slayer": "",
        "Humanz": "Ken Castle wants you to believe that you are living in a safer, better world. He's a liar. Mind control is slavery. We will all be his dog if we allow this evolution to continue.  You like the software?  The walkie talkie, playa.  That's right, baby. You think about what the brotha said?  Kable wants the freedom to ass- kick. Do shit his way. You gonna give it to him?  We see and hear everything that goes on inside the so-called game.  Kable got a past... he knows things. Things he don't even know he know.  Things Castle's afraid of. As long as your boy stay on the inside Castle know he can keep him quiet - but if ever got out... Uh uh. Castle will never let that happen.  You're not hearing me - this is not something you can control. They gonna kill his ass, Simon. In the eyes of the world. And then what? You just another poor little rich honky. No Kable, no pussy, no shit.  Mm hm. That's right, it's a game. You want to win it, don't you?  Then you need to cutcho strings, puppet-massa.  Imagine a slayer that don't got to wait to be told what to do. No ping, you dig? A trained killing machine... operating in real time, on pure instinct.  A mod, that's all. Like that guidance system you hacked on three weeks ago lets you track motherfuckers around corners and shit.  The game got to mutate, after all. It got to evolve, you feel me?  Then let's rock, baby.     You a fool.  Stop playing that freaky shit off the rail.  It's a game of deception.  Whatever, that's cuz you got no power...    Bullshit.    His name's Tillman.  Whatever. You made it. You're really here.  Your ass followed.  Hey, Kable...  You're... great.    The nanex modifies the actual cell structure of your brain...  we can crack it, but it's not one size fits all; we needed your DNA to generate custom code.  Because Castle's scared of you.  It ain't just a game, you know, Tillman. Everyday there's more people steppin forward, wanna be a part of Castle's world. Throwing away everything it means to be human.  But this is only the beginning.  Think about it: the federal prison system is growing out of control, set to bankrupt the whole damn USA... Castle rides in on a white horse, says he got a plan to bail us out and everyone just fall in line.  This time he's pushin total control of genetic disease... birth defects a thing of the past... all we gotta do is exchange our cells for the ones he wanna give us.  Hell no.  They'll be standing in line to hand their babies over to him. Next thing you know, we all slaves.  Gotta bring the man down.  Tillman.  We know where she is.      Basically. We can't quarantine the foreign cells per se but we can disable their ability to transmit and receive.  Thirty minutes... you give us a robot, we give you back a super hot human.  Tillman.  We need to talk, my man.  Come on.     Ken Castle made his first billion designing virtual reality simulators for the US military. Six years ago he brought them something new - a breakthrough so profound, he said, that history would be divided up between everything before and everything that came after.  They tested it on soldiers... the first volunteer was Corporal Travis Scotch - a friend of yours, I believe.  The second was you.    Dig me, Tillman. Whatever happened in that project is something Castle wanna be buried. We need that shit, baby: what you saw, what you know.  You ain't gotta tell me shit, Tillman. I want you to show me.            His memories... translated as raw audiovisual data.  Current exponential rate of growth, I can't imagine a piece of tech that will take that long to come around.  They'll have better shit than this in Best Buy within 18 months.           Not the best commercial for K-soft technology.  A test.",
        "Dude": "Stop playing that freaky shit off the rail.  Whatever, that's cuz you got no power...      Whatever. You made it. You're really here.  Hey, Kable...  You're... great.  The nanex modifies the actual cell structure of your brain...  we can crack it, but it's not one size fits all; we needed your DNA to generate custom code.  Because Castle's scared of you.  But this is only the beginning.  Hell no.  Gotta bring the man down.    Basically. We can't quarantine the foreign cells per se but we can disable their ability to transmit and receive.  Thirty minutes... you give us a robot, we give you back a super hot human.  Current exponential rate of growth, I can't imagine a piece of tech that will take that long to come around.  They'll have better shit than this in Best Buy within 18 months.  Not the best commercial for K-soft technology.",
        "Delia": "Are you my Daddy Tillman?  Mommy. Why did Daddy Tillman hurt Daddy Ken?",
        "Backup": "",
        "Hackman": "Hey. Kable.  No. Wait. Look.  He's back here. Want to see?  I'm going to delete you too. On Sunday.  That's why they put me here.  I've got no strings... So I have fun... I'm not tied up to anyone... They've got strings But you can see There are no strings on me...  You got two whores, Kable...  On the outside... oh, I'm sorry - I meant your pretty girls... You want to get back to them but I'm going to visit them first...    What happened?     Fuuuuck!!!!"
    },
    "imdb_rating": "5.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTkzMDU0NTg3MF5BMl5BanBnXkFtZTcwNzU1MjU1Mg@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Ken Castle is extremely rich, popular, and powerful since he invented and started exploiting the virtual online parallel reality games. In these games, people can either pay to be a user or get paid to be an 'actor' in a system of mind-control. In the ultimate version, Slayers, death row convicts act as gladiators in a desperate dim bid for survival, which no one has achieved yet. The champion, John 'Kable' Tillman, is scheduled to die just before he'd gain release, but he persuades his teenage 'handler' to hand over the reins so he can fully use his talents and experience. Kable escapes to freedom, but Castle's men chase him. Kable has to fight his way back to Castle's headquarters to challenge his hidden evil plans.—KGF Vissers",
    "name": "Gamer",
    "genres": [
        "Action",
        "Sci-Fi",
        "Thriller"
    ]
}