{
    "filename": "Get-Carter_script.txt",
    "imdb_id": "tt0208988",
    "imdb_url": "https://www.imdb.com/title/tt0208988",
    "characters": [
        "Gloria",
        "Cliff Brumby",
        "Girl #1 (as Crystal Lowe)",
        "Thorpey",
        "Jeremy Kinnear",
        "Geraldine",
        "Doreen",
        "Eddie",
        "Jim Davis (as Mark Boone Jr.)",
        "Les Fletcher",
        "Jack Carter",
        "Cyrus Paice",
        "Security Guard",
        "Girl #2 (as Lauren Smith)",
        "Con McCarty"
    ],
    "dialogues": {
        "Gloria": "",
        "Cliff": "",
        "Brumby": "Jesus wept!  Now, Cliff, don't get mad.  I'll murder the little bitch!  Cliff ...  That's right, bloody Daddy.  And this is what you call having a few friends back for coffee, is it?  Running bloody riot over my bloody furniture, drinking my bloody booze...  ... spewing over my fucking goldfish.  Cliff ...  Shut up, Phyllis. Sandra!  Sandra! Unlock the door, you bitch.    What's it about?  I know all about Cliff's business.  What the bloody hell's all this?  You know what the bloody time is! It's two o'clock in the bloody morning!  Well?  The wife says the Fletchers sent you.  What's so bloody important it couldn't wait till the morning?  Listen, I'm not in the mood for bloody silly buggers.  What?  What about?  It's not business?  Listen, I don't like it when some hard nut comes pushing his way in and out my house in the middle of the night.  Bloody well tell me who sent you.  A new venture of mine. It's going to be a restaurant. Do you like it?  Last night, after you'd gone, I did a little bit of asking around. Seeing as you weren't very forthcoming, It seems that you are concerned about the death of your brother? I got to thinking it would be nice if the bloke you were after was the same bloke I wanted off my back, You know my life. Machines. The arcades. Nice business. Looks after itself. People put money in. I take it out. Not much rough stuff. It's a business that makes me very happy. But recently, I've had a spot of bother, One of my lads gets a bit over- anxious and flogs some machines in a club that's already got some. The upshot is I've had to eat shit and stop flogging my machines to other clubs. So far as I'm concerned, that's it. Apparently not. These people I've offended get the idea that it would be good to take over my whole outfit, So I'm worried. I can't fight them  I haven't that kind of set-up. But I've got to fix them before they fix me. Trouble is, if I try and they find out, I'm dead.  Five grand. It belongs to you. Along with a little name I'm going to give you.  Kinnear. Cyril Kinnear. Kinnear did it.  I don't know. All I know is that people were shitting bricks up at his place last Saturday. Your brother's name was mentioned. Next day, he was dead.  I don't know. That's all I was told.  Christ, what...  Jack, you're wrong.  Jack...     I don't want them cooking in here. You can put a hatch in that wall.  Who in Christ's name is that? It's a bloody madman.  Jack!  I had to. It was the only way I could get at them.",
        "Thorpey": "",
        "Jeremy": "",
        "Kinnear": "You see what it's like these days, Jack.  You can't get the material.  Sit down, Jack, I could weep. I really could. Sometimes I think I'll retire. Just piss off to the Bahamas and let somebody else employ them, Glenda, get Jack a drink. What is it, Jack?    Eric told me of your bereavement.  Do you know, I never knew he worked in one of my places!  If I'd known, I'd have fixed him up with something better.  Nasty way to go.  Harry! Jack, I don't want to be rude, but these men have brought a lot of money with them. Glenda, you don't offer a man like Jack a drink in those piddling little glasses.  Give him the bloody bottle. Now, where are we?  Oh... I think I'll stay as I am.  That's what you pay to find out. Right, Jack?  Harry, I don't like to push, but could you let us know how much your hand's worth?  That's right, Harry.  That, Harry? That's another hundred - twenty-five pounds notes of the realm.  Three hundred altogether, Harry.  I'll follow that and go two hundred.  You can always see me, Harry.    That's six hundred pounds, Harry. Two hundred to follow you, and I've raised it four hundred.  That's right.  No.  Calling my bluff, are you, Harry?  Oh, come on, Harry. I haven't won, have I? Go on, you're pulling my leg.  How about that, Jack?  Old Harry thought I was having him on.  Not going, Jack?  Of course, of course. Well, any time, just drop by.  Hello, Gerald.  Really? So?  I see. I think that can be arranged.  Yes, Eric. A word with you.  I want you to listen very carefully. Jack Carter, You know what he looks like?",
        "Geraldine": "",
        "Doreen": "I left last year.  Working at Woolworths.  Yes.   (She suddenly jumps up and empties her glass in Eddie's face.  Yeah.  No.  At me friend's house.  Wilton Estate.",
        "Eddie": "We weren't sure where it was taking place, like.  No. Frank was a good bloke.  One of the best.      Absent friends. You don't think he might have done it on purpose?  (finishing off his drink  (wiping his face with a handkerchief  No. I'll be off now. I should be at work.  No. It's all right.  Frank was a good bloke. It's the least I could have done.",
        "Les": "",
        "Fletcher": "",
        "Jack": "No.  To find out what happened.  Too bad.  Since when was that good enough?  I will.",
        "Carter": "Pint of bitter.  In a thin glass.  Yes.  Hello? Margaret? Why the hell aren't you here? What time? Is Doreen at the house? Who's with him then? When can I see you? Will you be there tomorrow? Now listen, Margaret...                  I won't be using the room tonight.  I'm staying with a friend.        You sure?           Was he in bad shape?     Doreen?  All right, are you?  Been staying with a friend?  Sorry about your father.  Tell me, Doreen, did the police say anything?    How's school?  Oh, what you doing now?  That must be interesting.  What you going to do? Live with Margaret?  Well, why won't you come with us to South America? My fiancee won't mind, Your dad would have wanted it.     Nice of you to come.  What?  Did you work with him, Keith?      Margaret.  Fine... I want to talk to you.  Doreen.    Hold it!   Hold it! Who killed Frank, Margaret?  Really.  I want to talk to you later.  Tomorrow morning, then?  That's what I was wondering.  Why would it?  Since when did he drink whisky?  Nobody seems to know.  Let her go. She'll be OK. Sorry about that.    Look, look. Get your suit cleaned.  (standing, pushes the note in his top pocket  You work here, Keith?  Keith, if anybody comes in here and asks for me, you let me know. Right?  I'm at the Las Vegas. Behind the dance hall. Do you know a man called Albert Swift?  Where would I find him?  Went to school with him. He was leader of our gang. He'll know what's going on in this town.  Grey suits you, Eric.  Is he?    Didn't you know this is my home town?  Funny, that.  No. I'm visiting relatives.  It would be. If they were still living.  A bereavement. A death in the family.  That's all right, Eric.  Very... So, who you working for these days Eric?    Yeah, Come off it, Eric. Who is it?  Brumby?  Kinnear?  I've always ad your welfare at heart, Eric. Besides which, I'm nosy.  And you should know, if I remember rightly.  So you're doing all right then, Eric. You're making good.  Good prospects for advancement, is there? A pension? Do you know, I'd almost forgotten what your eyes looked like.  They're still the same. Piss holes in the snow.  Yes, I retained that, Eric. Do you know a man called Albert Swift, Eric?  Don't miss the start on my account.  Yes, I can see your problem, Mr Kinnear.    Yep.  No? Funny that. Neither did I.  Yeah.  Yes.  Right. If you can afford it.  Soon. When you've lost your money. Won't take long.  Only comparatively.  What?  I work for him.    Who?    No, do you really?  Go on.  Really?  No.  Really?  While he was here. You went about together?  Was he?  Yeah, I'll do you a favour.  I have to. Things to see to.  Yeah, I'll do that. Told you it wouldn't take long, didn't I?  You should have told me who you were working for.  Oh, Cyril, eh? So it's all girls together, is it?  He's right. Tell him to save the cost of the phone call.  What happened to this car?  This is my brother's car.  Yeah.  Was the steering faulty?  What about the brakes?  How'd it happen, then?  Was he?  Large Scotch.  Old Thorpey? Haven't seen him in a long time.  That's nice. What'd you tell him?  Good lad.  See you later.      You coming to South America?  Where you going to live, then?  Where's that?  Nice family, are they? Church-goers and all that?  Good. I'm off tomorrow, so I don't suppose I'll see you again. There. Go and get your hair done.  Be good. And don't trust boys.  My brother, Frank.  Funny. Can I phone London?    ...making love to you. I want to stroke you and kiss you all over. Where are you?    Take your bra off. No, go on.  Now hold them. Gently.  Slowly. Imagine it's me.  When we're in South America, we'll make love in the sun. Roll over... and make love again... and again... For me... I fancy you...  Save it till Sunday. I'll be back then.  That'll be for me.  How many?  Good evening.  That's nice.  You stay in the car. I'll come and listen. ( What you want to tell me, Thorpey?  That's very kind of somebody. Who do I have to thank?  What happens if I miss the train?  Oh, really. You're getting very optimistic in your old age, aren't you, Thorpey?    Time's up, Thorpey.  Hello, Keith, Stay there, Thorpey.    No. Really, I am.  We're going inside.  Up the stairs, Keith. The door on the right.  Why don't you go and make us all a nice cup of tea?  Make us a nice cup of tea and I'll tell you. I might even let you watch.  (He knows she fancies him  Well now, Thorpey. It seems I've got a secret benefactor. It's nice to know that. Isn't it, Keith? There's only one trouble, I don't know who to thank.  Now, I want to know who it is, Thorpey.  All right. If you like, Thorpey, we'll stop mucking about.  Somebody doesn't want me poking my nose into something and I happen to know what that something is. Now stand up.  Who paid you to see me off?  Yes you can.  Who sent you, Thorpey?  There you are, you see. Now you could, couldn't you?  And quickly.  Ah, Edna, come in. Join the tea set.  Cliff Brumby. Ever been to Westsea?  Ever been into an arcade there and put a penny in the slot machine?  Ten to one, it belonged to Cliff Brumby, and like as not the bloody arcade as well. Right along the coast. Isn't that right, Thorpey?  Where's he living these days?  Address?  Yes, Edna, and I must say you've been great about the ...  You must be joking, Keep him away from the telephone. I'm going out for a bit.  Ta-ra.  Good evening.  I'm an old friend of Cliff's. I want to see him.  It's urgent.  Business.  Yeah, well, tell him the Fletchers sent me.  I know.  I made a mistake.  I made a mistake.  Never mind.  See you.  You're a big man, but you're in bad shape. With me, it's a full- time job. Now behave yourself.  Good night, Mrs Brumby.  They came back?  I'll buy you another.  Don't ask me.  You're lucky. They kill as well.  That little shit!  What about Keith?  Pension him off.    So shut up.  You wouldn't.    Think about it.  No.  You must be joking. I never eat breakfast, Did you sleep well?  Yes, thank you.  Are you tired?  No. I'm not tired, Do you eat breakfast?  I might have guessed.  And what orders would they be, Con?  Right. Now take me back to London.  Out.  Out.  Out.  Do us a favour?  No chance of that.  They're friends of mine.  I don't want to get rough, do I?  Strawberry Fair.  In.  Turn right. Open that door.  And go inside.  I'm going to sit in the car and whistle 'Rule, Britannia'.  How could I stay away?  Keith in?  Which is his room?  What happened to you, then?  Did they give you a rough time?  No, I didn't, Does Albert Swift still live over the ferry?  All right. All right. I want to square things with you first.  I'm sorry. Here. This'll pay for a course in karate.  How were things between you and Frank?  Nothing more? Just another feller?  But he was just another feller, wasn't he?  Though nicer than most?  (ignoring the statement  I call that regular.  Once a week you like a gentleman?  What was bugging Frank?  I don't believe you, Margaret. Frank wasn't like that. I'm the villain in the family, remember?    Listen, the only reason I came back to this craphole was to find out who did it. And I won't leave until I do. You understand?  You bitch! It was you who told them I was here, wasn't it?  I'll catch up with you later, Margaret.  No. I didn't know that.  So where are we going, Princess?  Of course. Where else?  How'd you know where I'd be?  Very lucky, I should think. You're drunk!  He must have been pretty sure I'd come.    Yes.  What name?  Why?  Why?  That's not good enough.     Good afternoon, Mr Brumby. Carter exits.    Is he coming here?  Aren't you scared Kinnear will find out?  What does he want that bloody great country place for?  What kind of entertaining?  Does Brumby get a kick out of that crap?  Did Kinnear say anything? After I'd left the other night?  (kissing her on the neck  Sure I'm sure.  I want to give you an Oscar.  Tell me about the girl.  The young girl. Who pulled her?  Was it Albert?  Is it one of Kinnear's films?  Who set it up?  Eric?  Then he must have pulled her.  Did my brother Frank find out?  You're a lying bitch.  Now tell me the truth.  And you didn't know her last name?  Well, it's Carter. That's my name, And her father was my brother. And he was murdered last Sunday. Now get up and get dressed.  Get in.  Where's Albert?  Where's Albert?  I know where I'll find him.  Hello, Albert.  Yes, you do, Albert. Talk or I'll kill you.  Do you want to go to the toilet, Albert?  Do you want to go to the toilet, Albert?  You can't get away from me, Albert.  Did Eric Pake pull her?  How?  When did you find out?  How?  Who?  And you told Brumby?  Who killed Frank?  Do you want to be dead, Albert?  What did you do?  Albert?  Did Eric know that Frank was my brother?  What did he say?  Is that all there is?  Then that's it, Albert.  You knew what I'd do.  I know you didn't kill him. I know you didn't.    Not till I'm dead, Eric.  Stay where you are, Peter.  You shouldn't have shown the film to Frank.  The guy on the swing-bridge?  I've come for you, Margaret.  It's Carter. Listen carefully, you hairy-faced git. I've got the film and enough evidence to put you away for a long time. All it takes is one call to the police.  I'll do a simple deal with you. All I want is ...  ... but I don't want him there until six in the morning.  OK? Right.  Get out.  Take your clothes off.  Keep your pants on. Lie down.  Police.    Stay away from the car or I'll blow you apart.    I bet you could use a drink, could you, Eric?  Eh? Have a drink.  Drink up, Eric. Drink up. I want you to drink all of that. Do you understand? Drink up. Just like it was with my brother, Frank. Go on, son. Drink up.  Drink up, Eric.  It was you who poured it down him. Eh, Eric?  Did you all have a good laugh, eh? Did you have a good laugh when he was spewing it up? The whisky is pouring all over Eric's face and suit.  Drink it! Drink it! Did you all pass the bottle round after the car went over the top?  Don't stop, Eric.  Goodbye, Eric.",
        "Cyrus": "",
        "Paice": "",
        "Security": "",
        "Guard": "",
        "Con": "Put us in it, Jack.  Sorry about this. But there you are. Orders are orders.  Gerald phoned us in the middle of the night, said he'd heard you've been making a nuisance of yourself.  He said it'd be doing him a big favour.  We know why you're all steamed up, and so do Gerald and Sid.    Put it away, Jack. You know you won't use it.  Now, Jack. Be reasonable. You know we're going to take you back - sooner or later.  Mind you don't catch cold.  See you when you've got your drawers on.  Hold it! Where do you think you're going?  Bollocks.  Hello, Jack.  Peter's very upset about his car. He's going to shit all over you.  Gerald wants to see him first.  He's told Gerald about you and Anna.  How far did he fall?  Really. Was he dead?  Better to go quick like that.",
        "McCarty": ""
    },
    "imdb_rating": "5.1",
    "description": "Years ago, Jack Carter left his Seattle home to become a Las Vegas mob casino financial enforcer. He returns for the funeral of his brother Richard \"Richie\" after a car crash during a storm, atypical of the careful house-father. Talking to the widow, daughter Doreen, and enigmatic Geraldine, Jack suspects it was murder. Cliff Brumby, whose club Richie ran, is financially linked to porn and prostitution baron Cyrus Paice, who claims to be just a front-man for ITC tycoon Jeremy Kinnear. Someone hired goon Thorpey to make Jack return to Las Vegas. Jack's partner Con McCarty is restless, apparently about their boss Les Fletcher, whose wife had an affair with Jack. Someone breaks into Richie's home, looking for a crucial CD.—KGF Vissers",
    "name": "Get Carter",
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTkzMDk3Njg3NF5BMl5BanBnXkFtZTYwNTIzMzU3._V1_QL75_UX190_CR0,0,190,281_.jpg"
}