{
    "filename": "Ghostbusters_script.txt",
    "imdb_id": "tt0087332",
    "imdb_url": "https://www.imdb.com/title/tt0087332",
    "characters": [
        "Winston Zeddemore",
        "Mayor",
        "Walter Peck",
        "Librarian",
        "Dr. Egon Spengler",
        "Dana Barrett",
        "Janine Melnitz",
        "Gozer",
        "Dean Yeager",
        "Male Student",
        "Dr. Raymond Stantz",
        "Female Student",
        "Louis Tully",
        "Dr. Peter Venkman",
        "Hotel Manager"
    ],
    "dialogues": {
        "Winston": "He ENTERS with sleeves rolled up, wiping a plate with a dish towel and wearing an apron.    Nevermind, Egon, wouldn't want you to strain yourself.  Ghostbusters Central.   Calm down... Where are you?...  We'll be right there.  He hangs up.   Ready for this one?  Some farmer says his wife was eaten by a giant chicken.    Driving.   But wouldn't it be somethin' if he sells that weather balloon idea of his?  He'll be a rich man!   Shouldn't be hard to find.   A werechicken?   Let's get it back to Headquarters and run some tests.  Then maybe we'll have some answers.    Ray, it's gettin' pretty late.  Maybe there really isn't any...    Then let's get it!    They ENTER cautiously, Ray holding his BEEPING meter out before him.  The barn is dark except for the moonlight slanting through the loft window and the beams of their flashlights.  As the WIND picks up, WOOD CREAKS, HAY RUSTLES, and a piece of JUNKY machinery turns with a SQUEAL.    Man, this place is creepy.   Look out!  Ray shines his flashlight toward the lofts.  Its beam catches a couple of startled pigeons as they fly out the window, pinion feathers WHISTLING.    RAY &amp; WINSTON     They stop as PKE meter starts BEEPING.  Ray checks the reading.   Man, he is ugly!   Hang on!  That's it!    A normal chicken with singed feathers stands where the Werechicken was. It CLUCKS, starts pecking at the dirt.   Ray, I just had a thought...  Ray pauses to look around at Winston.   What if that six-foot werechicken is Zeke's wife?  And off their looks, we --    What happened?  He's so quiet all of a sudden.     You've been turned into a werechicken!     We're too late!    They stare, wide-eyed.  After A BEAT --    looking around.   What was that?    No pun intended.   That's it!  Winston cranks the wheel.   Ten feet tall?   How could we lose a fifteen foot-tall chicken?   Thirty feet tall?    Ray tosses out the trap.    Being buffeted by wind, struggling to hang onto their throwers as they continue firing.  They have to SHOUT over the NOISE.    Trap's full!  Somebody forgot to empty it!    turn to each other.     Peter, get outa here!  It banks, gets the hell away.    turn off their proton guns and are KNOCKED down by the released force as the freed Monstrous Spirit whooshes skyward.  The STORM abruptly disappears, as if SUCKED up.  The trap stops shaking and SNAPS shut.   Yeah, but how do you freeze a 50-foot chicken in August?  A BEAT, then the three guys look at each other.  RAY, WINSTON &amp; PETER Egon's weather balloon!    On street below, looking skyward through binoculars.   What's it doing?    I don't want to hear it.   They did it!  All-right!!  They high-five each other.   Uh-oh.    It's just Slimer groovin' to his new James Brown tape.",
        "Zeddemore": "",
        "Mayor": "",
        "Walter": "",
        "Peck": "",
        "Librarian": "",
        "Dana": "",
        "Barrett": "",
        "Janine": "Egon!  What happened?    She stares at Egon, totally bewildered.   But what ...?  Nevermind.   Are you sure you wanna go to a meeting like -- this?    Staring after him in disbelief.",
        "Melnitz": "",
        "Gozer": "",
        "Dean": "",
        "Yeager": "",
        "Male": "",
        "Student": "",
        "Female": "",
        "Louis": "",
        "Tully": "",
        "Hotel": "",
        "Manager": ""
    },
    "imdb_rating": "7.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZmYxNzdiMGItMDNlMS00ZWYyLWIwOTItZDcyMTNiNTZiMzJhXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Peter Venkman, Ray Stantz and Egon Spengler work at Columbia University. where they delve into the paranormal and fiddle with many unethical experiments on their students. As they are kicked out of the University, they really understand the paranormal and go into business for themselves. Under the new snazzy business name of 'Ghostbusters', and living in the old firehouse building they work out of, they are called to rid New York City of paranormal phenomenon at everyone's whim. - for a price. They make national press as the media reports the Ghostbusters are the cause of it all. Thrown in jail by the EPA, the mayor takes a chance and calls on them to help save the city. Unbeknownst to all, a long dead Gozer worshiper (Evo Shandor) erected a downtown apartment building which is the cause of all the paranormal activity. They find out the building could resurrect the ancient Hittite god, Gozer, and bring an end to all of humanity. Who are you gonna call to stop this terrible world-ending menace?—Chad Grill",
    "name": "Ghostbusters",
    "genres": [
        "Action",
        "Comedy",
        "Fantasy"
    ]
}