{
    "filename": "Ghost-Rider_script.txt",
    "imdb_id": "tt0259324",
    "imdb_url": "https://www.imdb.com/title/tt0259324",
    "characters": [
        "Blackheart",
        "Barton Blaze",
        "Young Roxanne Simpson",
        "Team Blaze",
        "Motorcycle Gang Member",
        "X Games Announcer (as Cameron Steele)",
        "Broken Spoke Waitress",
        "Young Johnny Blaze",
        "Mephistopheles",
        "Johnny Blaze /Ghost Rider",
        "Gressil",
        "Mack"
    ],
    "dialogues": {
        "Blackheart": "",
        "Barton": "",
        "Blaze": "Sick, cutting out early.  Aaa n? You say that every time. Blaze kicks-starts the bike. It ROARS thunderously.   See you tomorrow, Little Mike! The bike HOWLS, hauls up on its back wheel. Screams out the shop leaving Little Mike holding his ears. The other workers WHOOP and HOLLER, especially when Blaze snags a pair of BOLT- CUTTERS from a passing tool rack on the fly.  So what are you waiting for? Blaze burns away, leaving the pickup for dust.  Car twenty-two!  Thank you gentlemen, that's it for today! Jed bangs on the cab roof. Coop waves. Jed and Murphy salute. The pickup peels away. Blaze retrieves his bike. Stands it back up, kicks it alive, guns the throttle and -- -- cold jumps straight out of the car. Seconds later he's powering away, ripping up a storm, chasing the pickup towards the horizon.   Good, good.          Truth is, Mr. Simpson, I've been thinking about clearing out of there. Maybe opening up a shop of my own -- Roxanne raises an eyebrow at this. News to her.  See, I've been saving up. You know, for the baby and all. And I-- DOORBELL. Roxanne rises to get it.  (distracted, looking to the   Lucas. Rick.           Don't worry, hon. It's just routine --  Hey. She's sound asleep. He crouches, touches her face.  Hey. Roxanne barely stirs, deeply groggy.  Everything's cool.  No. No. Everything's okay. Jed and Murph just got a little boisterous at The Prairie Dog last night. Cops wanted to read us the riot act, that's all -- She yawns, curls up, starts to drift away again.  Listen, I want to show you something --  I'm serious, Rox. This is important. He drags her up off the couch. Makes her stand up. She MOANS, scowls, but he gets her on her feet.   Put your coat on. You'll be glad you did. Promise. It'll be an adventure. A mystery tour.  Keep going. It's just up there.  You don't have to ride, just climb up. She steps up onto the wooden platform, smiles back at him.  Not if I can help it. He follows her up onto the ride. She weaves through the wooden animals. Starting to enjoy this secret adventure.  Keep going, keep going -- She comes around the other side, catches her breath. The whole valley is spread out before her -- a glorious scatter of diamonds on velvet.  Uh-oh.  Ever hear of a carnival wedding? Roxanne shakes her head. Blaze is fiddling with a crisp, new dollar bill, folding it, making something.  If a man and a woman walk around a carousel going backwards, they're considered hitched.  Swear to God. He finishes folding the bill. The \"one\" is now neatly set on top of an ORIGAMI WEDDING BAND like a paper jewel.  You want this?  How'd I ever find you?  I don't believe in fate.  I know. I'm gonna get my shit together. For Leal, this time, I promise you, Rox. I'll always be there for you. She takes his hand and places it on her belly.     We gotta go. Get your stuff together.  I fucked up. The police are coming. Grab your things. We have to go. She sags, clearly been through this before. He tosses a suitcase onto the bed, looks back at her.  Just do it, Rox!  as he storms into the bathroom. Reaches behind the high cistern, retrieves a hidden HANDGUN. He jumps down. Tears the side panel off the old bath tub. There's a stack of FLAT BLACK BOXES hidden within. Blaze drags them out, drops one - It pops open, spilling UNCUT DIAMONDS all over the floor. Blaze CURSES, struggles to gather up the loot.     Fuck.  The cop car is turning, heading back in their direction.  Roxanne --? belt hanging beside him -- the passenger seat mr)ty.  Roxanne?!    Let me see her! God-Dammit! I have a  Get your fucking hands off me! Lucas Cole, the deputy who questioned Blaze earlier, approaches. Blaze SEES him and calms down a little.  Please. Just let me see her. Cole nods to his men, who ease up on Blaze. He guides Blaze over to an observation window --  Is she going to make it?  )_a ch= going r4 make i r?  What about the baby? The doctor hesitates, glances at Cole.     What kind of deal?  What kind of work? Starke just keeps smiling. Lays a comforting hand on Blaze's shoulder as we drift towards Roxanne's beeping EEG.  Skeletal, aflame, but somehow still Johnny, his tortured visage recognizable even as the furnace blazes blue-white. His jaw bone pivots open to unleash an INHUMAN HOWL, at once predatory and tormented, a shriek of eternal damnation. Time speeds up again. The men run. The Ghost Rider accelerates from zero to sixty in a heartbeat. Lloyd runs fast as he can. Talk about pointless. The Ghost Rider seizes his head, drags him seventy yards, burning him black, discarding him -- The other men let rip. Guns blaze. BULLETS punch through the Ghost Rider, coming out his back as red hot slag. The demon hauls a deep curve, powers up onto his rear wheel --  she SEES. An abject abyss of pain and shame and torment. And Rain's terror is forgotten for just that moment, replaced with something best described as empathy.  stumbling through the crowded ward, head down, in obvious pain. OR. QUINLAN , struggles to keep up, filling out paperwork on the fly.  I just need to sit down for a moment. And I need some forceps, gauze, tape --  No, no. Do I look like troub-unghhh -- He grimaces as the jacket comes off. Bullet wounds, shotgun damage, torn flesh, and a lot of BLOOD.  Motorcycle accident. Couple abrasions, maybe some rib fractures --  Just step back, I'll handle it --  Nah. They're just -- gouges. Surface damage. They'll heal up fine. Ungh - do you have any -- painkillers?  Percocet? Vicodin, maybe? 28,  Just. Give. Me. Something. For. The. Pain. He staunches the blood, fixing her with such a stone stare that she involuntarily backs away.  backing into a quiet corner. He suppresses a sob, fumbling a hypodermic as he fills it with stolen morphine. He jabs the spike into his leg, sags as the drug takes effect. After a moment, Blaze calms, gets his bearings, notices that he's leaning against a bulletin board on which is pinned --  Excuse me?  I don't know what you're talking about  Lady, you don't know shit.  Now bark the fuck o t of my Ii Blaze mounts his bike, kicks it alive, leaves Nomi in the dust.     Like what?  You actually believe what you're telling me?      Does your grandfather understand English?  32,  Listen, I don't want to be an ass-hole, but can we just fast-forward the whole Yoda routine? The home team scores! Laforte WHOOPS wildly, loses his mask, COUGHS uncontrollably. Blaze stands. He's out of there.  Feel better, old man.  What does he want?  Why?  I've been looking for this man for five years now, storm-chasing --  Tracked him halfway across the country. How do I make him lift the curse?  What? What'd he say?  Why don't you just go to the police?  Your daughter -- why does Starke want her? Nomi takes a beat, looks away. Haunted, ashamed.  Just so you understand what you're asking, this thing inside me -- I can't control it. It just comes out. And when it does, it's like I'm a prisoner in my own body. There's no reasoning with it. It doesn't have a conscience. It doesn't even have a personality. It's just a -- -- hunger.  And then --? 35.  riding their cycles. Up ahead is a postal truck. Blaze HONKS, waves to the DRIVER. He's got a postcard in his hand. He hands it to the driver through the open door, then decreases his speed, falling back alongside Nomi. As they scream over a hill, we SEE the White Buffalo Indian Casino and Lodge in the distance.  You got any idea where Billy-Ray might be headed?  Then we should start with where he's been.  Your husband used to work here?  Look, this is important. We're talking about a kidnapping.  I'm just a friend.  That's enough.  I need you to understand something, Vince. I am, by nature, an inherently violent man and there's not much in the way of bad that I haven't already inflicted on this miserable world --  So unless the idea of learning to drive a wheelchair with your mouth sounds appealing, I suggest you apologize to my friend and tell us WHERE THE FUCK BILLY-  And?  Think about it. The goons relent. Blaze and Nomi exit, leaving Rodenburg slumped on the floor, cradling his mangled hand.  I think they're gone. Off Nomi's look, Blaze points at tire tracks in the dirt.  Dual tracks. Looks like your old man switched to a Hummer.  Guess the boys camped out for a while.  You don't have to explain yourself to me.  Doesn't make you a bad person. 49.  The room, many years earlier. Carrigan backhands Nomi across the face. The silent moment is caught in motion so slow it's virtually a tableau.  He used to hit you. A statement, not a question. She nods.  Just echoes, sometimes. Tell me about Starke. Nomi hesitates, not wanting to relive this.  -- Nomi as she waS. An inch away from eternity. She is lying on the bed, staring upwards, shallow breaths- Above her, a MOTH flutters by a light, casting distorted shadows.  But it felt like a mistake.  \"You look like --  -- you could use some help.\" Nomi nods, hugs herself.  Why send Billy-Ray after you?  Guess again. -- as HEADLIGHTS shine through one of the windows. Somebody's driving up to the house.           Please. Just tell us where they went and leave. There's no reason why you have to die. Rodenburg LAUGHS, looks at his friends in disbelief.  sits up. He looks to Doyle, TEARS OF FIRE streaming from his eyes. As he stands, his chest wounds ignites, the flames instantly cauterizing the flesh. He's suddenly engulfed in a heat haze. Wood smolders all around him. Doyle backs away, terrified. He FIRES his gun again and again, but the bullets just punch through Blaze, creating more flaming holes-  I'm sorry. soul, the fire expanding, engulfing Doyle.  Half man, half monster, his pitiless skull-face hazing and flickering between human and inhuman states.  Where are they taking the girl? Rodenburg whimpers. Ghost Blaze grabs Rodenburg's hair, wrenches his head back.  Where. Are_ They. Taking. Her?  Where?  He SEES the corpses, the burning vehicles, tries to deny the horror. But it's always the same -- another swath of destruction left in his wake, another righteous atrocity.  You asked for my help. I warned you what you were getting into. More a statement than an excuse. There are POLICE SIRENS on the wind. Blaze starts walking towards the pickup.  S'okay -- just need to rest now -- -- wounds'11 be healed by morning. Nomi stands, still shaken. She retrieves a cigarette from her purse, lights it.   I don't even know if it's that's an option anymore. Every time I get close, I feel myself being dragged back --  --it's like being born all over again. Like every law in the universe is being broken. Blaze sits forward, gritting his teeth against the pain.  See, the Ghost Rider -- it's drawn to darkness like a bloodhound. If it thinks you've sinned, it'll find you.  Nobody's innocent.  Think about it. Everyone's done somethincr. You. Me --  Every night I spin this fucking coin --  I'm just so fucking tired -- Nomi moves to his side, struggles to help him up.  What are you doing?  What time is it?  What time, exactly?  They're just a kind of record.  Let's go.  Roxanne? Yeah, she's alive. She just doesn't know it.  Coma. Probably never wake up.   That's what he does, doesn't he? She nods. That's what he does.  It's funny. That kid was supposed to be my second chance. Rox and I used to talk about it -- how things'd be different after she was born. Nomi didn't expect his honest vulnerability.  What, kids?  Make him pay, somehow -- I don't know. How do you beat the Devil? Walk up and bitch-slap him? Pretend you're Schwarzenegger and fire a bazooka up his hind ass? I'm basically making this up as I go along. Nomi smiles.  She's alive.  No. We'll wait. Dawn's less than an hour away.  Look, they're not going anywhere.  If I what? Burn them alive? Eat their spirits?  You still get it, do you? The Ghost Rider whales on whoever's got it coming, but it's Johnny Blaze that gets to remember their faces. And I Lb remember them. Every last one. Just then, we hear the RUMBLE of approaching MOTORCYCLES. Lots of them. Blaze turns, SEES a line of BIKERS chugging up the service road on ratted-out Harleys.  I'll find her. You stay here. Nomi moves to protest, but Blaze silences her. 68.  If things go South and the Ghost Rider takes over, I can't guarantee he won't --         Whatever happens --  You're welcome. Blaze leaves. Nomi starts in on the other bikes.  The room, the men -- but no Rain.  hidden in a dark alcove, struggling to contain himself. If the Gargoyle turns he will surely see him. The Gargoyle studies the flame, then notices an OPEN WINDOW nearby. He shuts it, lights his cigarette, turns back -- b= Blaze has moved on.  as he starts towards the toy skeleton. He's in agony now, each breath a cough of fire, each footstep igniting the floorboards. He SEES a storage room up ahead --  Shit.  The bad guys coming on battered bikes -- Arlo, Chester, plus FOUR OTHER GARGOYLES. And bringing up the rear, a seven ton Mack dumper driven by Carrigan. Landsdale rides shotgun. Blaze looks to Nomi, SHOUTS over the wind:  Give me your gun! Nomi passes it back. The Gargoyles OPEN FIRE. Bullets zing and whine. Blaze shoves Gunt's cycle off the pickup bed The heavy wreck CRASHES and bounces, wasting the first Gargoyle. The others swerve around the sliding debris  hauling himself back into the pickup bed even as --  being surrounded by Troopers, wrestled to the ground.  chained, cuffed, struggling with TWO DEPUTIES trying to drag him to a cell. Further up, Carrigan is being similarly escorted. Blaze looks to the faces of his fellow prisoners, dread seizing his body.  I have to talk to the warden. You have to put me someplace else --  Please, just listen to me. Put me in solitary, anywhere but here.  You don't understand, people will die -- WHACK! A baton blow to the knee. Blaze CRIES OUT, staggers --  Do not put me in here! Do not leave me with these men! They'll die if you do this!! ! The deputies force Blaze inside, using batons, boots. A stun gun SPARKS. Blaze falls. The cell door SLAMS. The inmates opposite are LAUGHING, waving, bashing their bars with every metal implement they've got as we --           here and now, cocking the gun, turning it back on himself.  fingering the trigger of the gun, edging closer to the unknown, the terrors that the afterlife holds for him. 90.  suppressing a sob. The pain is too much. It's overwhelming --  Fuck it. He presses the barrel against his forehead. Squeezes his eyes tightly shut, compresses the trigger -- -- but he can't do it. He lowers the gun, weeping with frustration and -- freezes, head cocked like he heard a voice. He scans the cemetery: graves, trees, nothing. Then he spins around ---  How--?  I don't know. 91.  Yeah, I think there's something. Maybe not angels playing harps and stuff, but -- something. Rain wipes her nose with her sleeve, wanting to believe it.     I don't have anything left to give, kid. Blaze stands, starts walking. Rain follows.  I'm not.  You can't.  I don't believe in fate.  It's not a church. It's a mission. They take people in. Blaze pays the driver. The truck roars away. Rain looks back to the mission, doubtful.  Our car broke down a few miles back and my daughter and I were wondering if we could crash here for the night. Tolbein sizes them up -- doesn't like what he sees.  What about a ride, then? Is there a town somewhere you could take us to? Other men have gathered behind Tolbein -- VISCOTT, WILSON. One of them, NUNEZ, nods to the South.  That's not really an option.  Look, you must have a cot, something. The kid's hungry --  This is Rain.  Those men outside --  I know my way around a flywheel housing.  Sure.  What do you mean?  No. 96.  She's dead.  No. Rhymer studies Blaze, decides he believes him.     Listen, I appreciate what you're trying to do, but I've never really been a come to Jesus kind of guy.  I can't stay. I'm sorry.     I don't have any money.  Distant thunderheads. LIGHTNING flickering. CLOSE ON Blaze, trying to drive Rain from his mind. We can SEE on his face that it's a losing battle -- for poor, cursed Johnny Blaze has finally understood his purpose on this earth.  battered and weakened, staggering. His flames are barely flickering, his bony flesh has become chalky and brittle. He's holding a jaw-beast skeleton, drops it to the floor -- The Scarecrow attacks. Hand-to-hand combat. Massive blows and blocks. The burning room SHUDDERS with each impact --     clutching precariously to a muddy hillside. Ghost Blaze  Vengeance. And Ghost Blaze raises his hand, HELLFIRE trickling down the length of his arm, swirling around his hand like a building static charge even as --  Guess so. After a long beat:  She's all yours, Starke -- -- and lights it without a match, somehow conjuring the flame from within himself. He takes a long drag. In the pits of his eyes, something glows there -- a kind of lambent darkness.  -- but you'll have to go through me if you want her. Starke stares into Blaze's eyes. Doesn't like what he SEES.  That's not a life. And least now one I'm interested in living.  Guess I'm willing to take my chances. Starke nods, accepting defeat. For now. He looks down at Rain, a bitter smile creeping across his face -- 116.  Yeah.  balanced perfectly on it's edge. How it fell like that, at the heart of the wreckage, is a mystery that will probably never be solved.",
        "Team": "",
        "Mephistopheles": "",
        "Gressil": "",
        "Mack": "ana necx at OOFJ2 Ann r i t s over, end.  bears down on them. Landsdale jumps from the cab, landing alongside Blaze. The two men struggle in the cargo bed, hand to hand, exchanging a volley of vicious blows. Nomi is desperate, doesn't know what to do. Landsdalp is getting the upper hand. He grips Blaze by the throat, forcing him over the side of the pickup bed, shoving Blaze's head towards the churning wheels of the Mack -- 81."
    },
    "imdb_rating": "5.3",
    "description": "When the motorcyclist Johnny Blaze finds that his father Barton Blaze has terminal cancer, he accepts a pact with Mephistopheles, giving his soul for the health of his beloved father. But the devil deceives him, and Barton dies in a motorcycle accident during an exhibition. Johnny leaves the carnival, his town, his friends, and his girlfriend Roxanne. Many years later, Johnny Blaze becomes a famous motorcyclist, who risks his life in his shows, and he meets Roxanne again, now a television reporter. However, Mephistopheles proposes Johnny to release his contract if he become the \"Ghost Rider\" and defeat his evil son Blackheart, who wants to possess one thousand evil souls and transform hell on Earth.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "name": "Ghost Rider",
    "genres": [
        "Action",
        "Fantasy",
        "Thriller"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BODAyNzkxZmEtN2U4Zi00ODE1LWI4ZWQtNDQzOTZiMDE1N2FhXkEyXkFqcGdeQXVyOTU2NDAzNDE@._V1_QL75_UY281_CR11,0,190,281_.jpg"
}