{
    "filename": "Ghost_script.txt",
    "imdb_id": "tt0099653",
    "imdb_url": "https://www.imdb.com/title/tt0099653",
    "characters": [
        "Sam Wheat",
        "Willie Lopez",
        "Molly Jensen",
        "Minister",
        "Mover (as Richard Kleber)",
        "Mover",
        "Rose (as Martina Degnan)",
        "Carl Bruner",
        "Surgeon",
        "Subway Ghost",
        "Elevator Man",
        "Emergency Room Ghost",
        "Susan",
        "Cemetery Ghost (as Sharon Breslau Cornell)"
    ],
    "dialogues": {
        "Sam": "I told you!  I can't breathe.    And about eighty years of dust.    Be great for bumper cars.  Hey, look what I found. There's a penny inside. For luck in our new loft. It's a good omen.  It's gonna be great.  I hate pitching to these Japanese guys. They make me nervous. I mean, what am I supposed to say, \"Who do you think'll win that big Sumo championship\"?  ...Molly.  Better pay off your Mustang first.  So Carl, what did the doctor say?  And what about the rash?  On your genitals again?  Morning Rose. Listen, when the Kobiashi people arrive, have Elenore take them right to the...  They're early!  Noon? Damn!  Listen, Dillon needs $900,000 in Albany by noon. Can you transfer it to his payroll account?  Discretion, huh?    I'm afraid that's the only Japanese I know. But I realize it's not our language fluency, or lack of it, that brings you to Market Security. Rather, I'm sure, it is our banking expertise, our ability to represent and anticipate all of your banking needs. As you know, we are not the largest banking establishment in New York. But, with combined assets of over 200 billion dollars, we have a firm commitment to the international marketplace.  Excuse me. Hello?     Uh hmm.  Okay.  Well, that's just fine.  Thank you. I'll remember that.  Saved your life.  Better than seeing this gorgeous body splattered all over the street. Here, look out.    What do you mean? It's comfortable. For T.V. I love that chair.  It goes with me.  It was the middle of December. I was sitting in my old office, the one Charlie's in. Suddenly, I heard this woman screaming. I thought someone'd been shot or something.  She was four thousand dollars over her limit.  She's still angry.  Get outta here, Frank! You should have seen her. All pink and flushed. Her skin was gorgeous, like a rose. And she's screaming, demanding to see the president. So Wilton brought her to me.  She didn't know that.  What's a Montana accent?      What are you doing?  At 2:00 am?    I feel inspired.             The matter?  Nothing... really.  No. Not really.  I don't know. A lot of things. I just don't want the bubble to burst... Whenever something good happens to me I'm just afraid I'm going to lose it.  What?  Ditto.  Oh Jesus. Another one.  I should cancel my L.A. trip... These things always happen in threes.  Yeah. So did they.        A glitch. What's up?  I changed it.  Nothing. I just want to nose around a bit... Can you keep your mouth shut?  I think I've stumbled onto something. There's too much money in these accounts.  That's what I keep asking myself.  I've been checking.  Not yet. I'm gonna dig around a bit.  We're going to the theatre. She wants to see \"Macbeth\" at the Spring Street Repertory.  I loved it.  Six times.  Molly, the \"New York Times\" is some frustrated little critic with pimples on his ass who flunked out of art school. Who cares what The New York Times thinks?  Your work's beautiful. That's a fact, Moll. It doesn't matter what anyone thinks.      What do you think, Moll?  What are you talking about?  People say \"I love you\" all the time. It doesn't mean anything.  Let me handle this.  Take the money. Just leave the wallet and my...  Molly!  No!!!!!!      Do it! Do it!  Molly? Molly!  Molly!          What's happening to me?!  Molly!    Don't stop! I'm not dead!  What?  Are you talking to me?  Who are you?  Who are you? What's happening...?        Oh God, help me.     Molly.     I am here, Moll. I am.  Wait, Moll. Not that one. That's my favorite...        Molly, we hated that concert.  Rolaids? What are you doin' Moll?  Hey, Molly! Wait!        \"Singing bye bye, Miss American Pie. Drove my Chevy to the levy, but the levy was dry. Them good ol' boys were drinkin' whiskey and rye, and singing this'll be the day that I...\"  You motherfucking bastard! What the hell are you doing here? What are you doing?  Molly, no! Get out!              Damn!  Get what? Who the hell are you? What were you doing at Molly's? What the hell's going on?    Sure lady!    Way to go. Milk her for every penny.    What a crock of shit!    What's going on?  Who are you talking to?  Are you talking to me?  I don't believe this. Hey you. My name is Sam Wheat. Can you hear me? Sam Wheat!  Say my name! Sam Wheat! Say it!  Jesus!  Go away. Hell no. I'm stayin' right here!  Someone else? Are you outta your mind?  Not till you help me.  I'm standing right beside you.  What?  Listen, damn it. You can help me. There's a woman, Molly Jensen. She's in terrible danger. The man who killed me broke into our apartment. He's going to go back. You've gotta warn her.  She has to! This man's a killer! He's got a key.  It's just a phone call. You're all I've got. Lookit. I'm not leavin' till you help me. I don't sleep anymore, so I can sit here day and night. I don't care how long it takes. I can talk forever.  You gotta go there.  \"I'm Henery the Eighth I am / Henery the Eighth I am, I am / I'm gettin' married to the widow next door / She's been married seven times before / And every one was an Henery / Wouldn't take a Willie or a Sam / I'm her eighth old man I'm Henery / Henery the Eighth I am, I am / Henery the Eighth I am / Second verse same as the first / I'm Henery the Eighth I am...\"  Just wait.  Just one more time. Please. It's a big place.    Ask her about the sweater in the closet, the one she knitted that's too big.  Four sizes.  She couldn't throw it out. I saw. I was there.  Tell her she's wrong.  I'm holding her hand.  I'm holding her hand.  God, I love her. I love her so much.    Come on Oda Mae, stop rambling.  I do not have an attitude.  Goddamn it, Oda Mae!  Relax, Oda Mae.  Jesus Christ!  Damn it. All right. I apologize.    Molly, you're in danger.  Say it!  I know the man who killed me. Willie Lopez. I know where he lives.  Write it down.  You do it!  321 Prospect Place. Apartment 4D.  Molly, he's got my wallet and my key. He was in here.    Where you going?  Listen to her, Carl, goddamn it. She needs some support here.  Come on, Carl. Open your mind.  Give him the address, Moll.  Way to go, Carl!  You killed me, Carl. You had me killed. Look what you've done to me! Look what you've done!  You fucker! You mother fucker! I had a life, Goddamn you. I had a life!        Why can't you hear me, Molly? I need you.  Don't open it. He's a murderer, Moll!  You were never our friend.  No, Moll. Don't do it. Don't let him in!    No!!!      Teach me how you do that! I want to learn! I'm not leaving til you teach me!     I don't get it.  How do you focus?  I'm angry all the time. It doesn't do a thing.  I did it!     How long have you been here?  Someone pushed you?  Who?  What the hell?  What is all this? What's goin' on?  Oda Mae. You're doing it. This is for real. How do you like that?  Come on. Look at this. You're doing great.  I need your help, Oda Mae. There's something we need to do.  Give it up? I'm already dead.  And how am I supposed to do that?  That was incredible, Oda Mae.  He spoke through you. It was amazing.  You're great, Oda Mae! You're a real medium. It's what you were born for.  Oda Mae, what's wrong?  Willie!  Oda Mae, we're in trouble...  I can stop them. But I can't do it alone. You've gotta help me.  You're right. And they'll be back. I'm your only chance.  I need you Oda Mae. I need you to get some fake ID's.  Help me now, they'll never bother you again. I promise.  I'll teach you. You'll learn fast.  See where it says \"New Accounts\"? That's where you're going.  Just do what I say.  Tell her you're here to fill out a signature card for a new account.  Yes. 926-31043.  Rita Miller.  Tell her Rita Miller.  Tell her Carl Bruner opened it for you by phone and asked you to come in today.  Just sign you name at the bottom on the first blank line.    Tell her to see that it goes right up to the third floor file since you have a transaction to make.  Tell the guard you're here to see Lyle Furgeson.  Don't say that! Tell him Rita Miller's here.  Don't embellish.        This'll be easy. Furgeson was so drunk at that party, he could have had a conversation with Tina Turner and he wouldn't remember.  Ask how Bobby and Snooky are.  Tell him you've been wondering how they did on the Gibraltar securities.  \"We sure did!\"  \"Good old Randy\".  \"Her\" shoulders.  You're closing an account.  926-31043.  31-0-43.  Say \"yes\"!  A cashier's check! Tell him a cashier's check.  Sign Rita Miller.    Oda Mae, come on. We gotta get out of here. Say goodbye.  Hurry up, Oda Mae.  Oda Mae. Take the check out of your purse.  Just do it.    Do what I say.  That's blood money, Oda. I was killed for that money. Endorse it now.  We're giving it away.  Look to your left.  Do what I tell you.  Yes, you can. If you don't do it, they'll track you down. Your only protection is to get rid of it, now.  I'm saving you, Oda Mae. You'll go to heaven for this.  Write \"St. Joseph's Shelter\".  I'm proud of you.  Come on, we're friends.  I think you're wonderful, Oda Mae.  Search, you bastard! You'll never find it. It's gone. They'll kill you for this, Carl. You and Willie. They'll wipe you off the face of the earth.  You bastard! You goddamn bastard!  It's dinner time, Carl. Don't you have a date with Molly, you creepy son-of-a bitch?     Old Carl had a little trouble at the office.  He needs to borrow four million dollars.  Oh shit!  Oda Mae! We're in trouble. They want the check. They're comin' to kill you. We gotta get outta here.  It's them.  They're heading for the door.  No they won't. I'm gonna get 'em.  Whataya mean? I'm a ghost, aren't I?  He's dead, Oda Mae.  No. It's not over, Oda Mae. There's still Carl.  Tell him to hurry!  Tell her she's wearing the blouse I spilled the Margarita on and the earrings I gave her for Christmas.  Gimme a penny quick.  Empty your purse. On the floor. Now.    (continuing; calling to Oda Mae  I'm sitting beside you.  With all my heart.  I'd give anything to be alive again, just to feel you once more.  No!  What's happening to me?  Get out of here! The fire escape.  Goodbye, Moll.    I can't stay anymore.   (with deep felt gratitude  I love you, Molly. I've always loved you.  It's so amazing, Moll...",
        "Wheat": "",
        "Willie": "Your wallet!      She came home. I couldn't get it. Give me a couple of days. I'll go back.     Carl, what're you doin' here?  Talking to? What the hell do you mean? What's going on?  What the hell are you talking about? I haven't said a word.  A lot of women know where I live.  Tell him you only wash dirty money on the first of the month.       Are you the one that can talk to the dead?  I said I need to know if you're the one.  This is important. I have a friend. He died recently. Some say he was mugged. I think he was murdered.    I can't wait til later.  Good question. Why don't you tell me?    Then what is it, lady?  You're the mindreader. I hear you've been tellin' people about me for days. What's my name?  How'd you know that?  Looks like someone just left.  Damn!    Oh God!    Help me!",
        "Lopez": "",
        "Molly": "What a mess!  Use your mask, dummy.  Sam, look, there's a whole eight feet up there.  We have all this height, Sam. We could add a second floor and put our bedroom upstairs. That would leave all this space.  For space. Just space.  Hey, Sam, turn around.  All together now. One, two, three.  (shaking her head, disagreeing  It's gorgeous.  Sell it? Carl, we just bought it.     A man and a woman are lying in bed when the woman's husband suddenly comes home. Frightened, she tells the man he has to leave instantly through the window. He has no time to dress.  It's raining outside. The man, running naked along the street, sees some joggers approaching.    And then the other jogger says, \"And do you always wear a condom?\" The man looks down, embarrassed, and replies, \"Only when it's raining.\"  Now just relax and have fun, okay? It's not the end of the world if you lose this account. You've always got me.  See ya.  Where you guys from, the New York City Ballet?  You bastard. Don't do that to me. You scared me half to death.  Carl? Did you invite him?  In the bedroom.  You like it, huh?  Sam, you kept that chair?  But it doesn't go with anything.  It's okay, I'll paint it.  They took away my MasterCard. It was Christmas, for godssake.  It wasn't four thousand. And I'd already sent in the payment! You're the ones that lost it.  No I'm not.  Can you believe it? And the next thing I know, he's telling me his life story. I couldn't believe it. Everything. About his divorce, how he'd just arrived in New York, how he didn't know any women. And all with this Montana accent.  The one you always slip into it when you get nervous. \"Yes, Ma'am. Thank you, Ma'am. Can I fondle your breasts, Ma'am?\"  Admit it. You liked me. You were interested.  Cute? Do you believe this? I should have been Picasso's mistress. I should have been living in Barcelona or Paris. But no, I'm moving in with a New York banker who thinks I'm cute.     I felt inspired.  What? Are you jealous? Sam, let me tell you something. He's not even looking at me. It's you he idolizes. He doesn't see me at all... Anyway, he's not my type.            What's the matter?  I can tell.  You're worried, aren't you? About moving in together?  Then what? The promotion?  You know what?  I love you. I really love you.  Don't watch that stuff.  Threes? Sam, get serious. Besides, you lead a charmed life.  I could tell.    Six? No I didn't. Sam, don't be so blasé. I'll have two major pieces in the show. The New York Times reviews her gallery all the time. This could be huge.  Eight million readers, that's who.    I've been thinking about it for days. More than thinking. I want to do it. I want to jump in whole hog... What is that look for?  Do you love me, Sam?  How come you never say it?  You say \"ditto\". It's not the same.  Sometimes you need to hear it.  What should we do?  Give it to him!  Sam, No!  Sam!!!!!        Sam? What's the matter? Is something wrong?  What is it, honey?    Don't leave me. I need you, Sam.  Oh God, Sam...      Frank, what's wrong? Frank?    Sam's address book.  No!  I miss him, Carl.  Wait. Wait. Not that one.  No.  I can't do it Carl.  Okay. Just a short walk.  Frank, what's wrong?  Hello.  Yes.  Who is this?    Hello, who's there?  Why should I believe you? Why should I believe any of this?  He did that? That's how he got me to go out with him.  I know. Oh God. This is all so crazy. I can't believe I'm talking to you like this. I don't believe in these things. I don't believe in life after death.  You're talking to him right now?  Where is he?  I'm sorry. I don't believe you. Why are you doing this to me? I don't believe a word you're saying. Sam is dead. He's dead.    Sam?  I don't understand. Why did he come back? Why is he still here?  I don't believe I'm watching this.  Danger?... What do you mean?  In here?  It was real, Carl. She was real.  She was in touch with him.  Carl, she knew things.  I told you, the picture in Reno, the starfish,... damn it, Carl. She said Sam knew who killed him. That he was set up... murdered.  She had a name, an address -- Willie Lopez, 321 Prospect Place. She said he had Sam's wallet.  That's what I have to find out.  Sam wants me to go to the police.  You don't believe me. You don't believe any of this, do you?  You white fascist bigot. Who do you think you are? Bed Stuy's part of New York, you know. This is America.  Look, you've gotta believe me. I don't even believe this stuff, myself. But this is real. Do you think I'd come here if it wasn't real? You told me to come if I had any new information. Well, here I am.      Things Sam only said to me.  I'm telling you. The killer's name is Willie Lopez. I've got his address. You've got to check it out.  What are you doing? Where's your file on Willie Lopez?  This isn't possible. There were words, private things. How could she have known all that?  Ways? What ways?  No! She was real. She said things. She knew about a sweater I knitted, about songs we sang... She knew about this place we went, Montego Bay...  Oh God, I wanted it to be Sam.  Who's there?  Don't worry. It's okay.      Are you alright? You look nervous, upset.  I didn't have time. I went to the police, Carl.  You were right, you know. I felt like such a fool. They brought out a file on this psychic woman ten inches thick. It was awful.  The sad part is that I believed her. I believed her, Carl. It was all a sham.  Why?... I was a fool. I don't believe anything anymore. Why would people do such things?    (appreciating his words  I can't. I'm sorry. I can't. It's too soon... You've been great Carl, but... I need you to leave. Please. I need you to.  Lionel?  Lionel, a woman who just left, a black lady, about my height, did you see her?  What did she want? Did it have anything to do with me? Did she ask about Sam?  Was her name Oda Mae Brown?  (hesitating, not sure what to say  Carl? Where were you? I thought we were having...?  Forgot? I was worried. Is everything okay? Are you all right?  Why? What happened?  Carl, stop this. It was all a hoax. I told you. It wasn't real. She's a charlatan. Does this have anything to do with her being at the bank today?  I was sure I saw her. Furgeson says she was taking out money. It turns out her name isn't even Oda Mae Brown. It's Rita Miller or something.      Oh my God. Is that the gas?    Trouble? What kind of trouble? Is it that woman, the psychic?  Carl, what's going on? Let me help you.  Carl, is that you?  Get the hell out of here. I'm calling the police.  No!       Go away!  Right. Yes, it's right on the corner. We're a red brick building with the entrance on the left side. Please hurry. Thank you Sergeant. We'll be waiting right here. Police are on their way.  What do we do now?  Is Sam here?    Oh, Sam.  Sam!  I love you so much.  The police!  It's Carl!  This way!    Sam? Is that you?  I hear you, Sam.    Ditto.  See ya.",
        "Jensen": "",
        "Minister": "As we say farewell to our friend Sam Wheat, we are reminded of his kindness, his generosity, his buoyancy of spirit...    As our loved one enters eternal life, let us remember that love, too, is eternal, that although we will miss him, our love will light the void and dispel the darkness.  ...and into Your hands we commend his spirit. May he rest in peace. In the name of the Father, the Son, and the Holy Ghost. Amen.",
        "Mover": "",
        "Carl": "Sam, this may be none of my business, but I'm concerned you're doing too much coke.    I'll never wash again.  You guys lucked out. Hell, I bet you could sell it tomorrow and double your investment.  What I wouldn't do for a place like this.  Oh, by the way, Sam, I had to move your 3:00 with Bob Kahan to 4:00 so you could squeeze in Gary Alan. He called yesterday and said he has to see you today about the Danway stuff. Three o'clock was the only time he could make it. Also, the board meeting in L.A. has been confirmed for the 12th. I got you on a 9:00 a.m. flight.    Sam, you'll be fine. You're great with people.    Jesus, look at that, a Testerossa. That's the car I'm gonna drive when I'm making two hundred grand.  He said it was contagious. Very contagious. I shouldn't be going into work today. But what could I do?  Not good. It's spreading everywhere.  Everywhere. He said be sure not to touch anyone.  Hold on.  Sure. Just let me have your MAC code.  You bet. I'll do it right away.  Sam? Molly? Anybody home?  Hi, Moll. Hi, Sam. So, how's it goin?  Wow! The place looks great. Really great.  \"Like\" is hardly the word. I never imagined it would be this beautiful. This is incredible.  You? You weren't even a VP yet.  The Mark Greenberg and Larry White accounts. I can't get in. Your MAC code doesn't work.  Why? What's up?  Yeah, sure. Tell me, what's going on.  Too much money. That's ridiculous. How could there be too much money?  It must be the computer.  Yeah, Mr. Fixit. Come on, move over. Let me see what I can do.  Okay, okay. Just call me when you're ready for help. So, what are you and Moll doing tonight?  It's hard. It's very hard.  Dave Brubeck. Newport '86. Should I toss 'em?  Oh, you want to save those?  We all do.  Oh, shit. I'm sorry. I don't know how that got in there.    Just for a stroll. It'd be good to get out.  Molly... you're not the one who died!  Thata girl.  Molly, there's no one on earth who'd like it to be true more than me, but you've got to be rational about this. I understand your desire to hold on to him, but this... this is absurd.  Molly, you're a grown woman. How can you believe some fortune teller from Brooklyn...?  I don't believe it, Molly. Not for a minute.  What kind of things?  Oh boy. This is getting deranged. We're going off the deep end here.  This is sick. This is really sick. How can you swallow this crap? Who knows if this guy exists? Maybe she's just setting someone up.  Find out? What are you talking about?  Sam wants you to go to the police? Molly! Jesus! Are you outta your mind? What are you gonna tell 'em? Some storefront psychic's been getting messages from the dead? Do you know how that sounds? You're talkin' ghosts here, for God's sake.         (scared, in over his head  Some woman knows all about you. The murder, everything. Where's she getting it from, huh?  She knows your name, goddamn it! She knows where you live!  This isn't a joke, man. You find that bitch, whoever she is, and... get rid of her, you hear me? I've got four million dollars stuck in that fucking computer. If I don't get those codes, if that money's not transferred soon, I'm dead. If I lose Balistrari's money, we're both dead.  What is wrong with you? Is everything a joke? You were supposed to steal his wallet. You weren't supposed to kill him. Was that a joke?  Jesus! These are drug dealers, man. Don't blow this for me, Willie. I've risked my job here. I could go to jail. A hundred thousand of that money goes to me. Now give me Sam's key. I'll get that address book myself.           Tell Mr. Balistrari there won't be any problems.  Molly, it's Carl. Can I come up?  Hi. Thanks. I know it's late. I'm sorry to disturb you. I felt bad about last night. This supernatural stuff just makes me so uncomfortable. I don't even read horoscopes.  No it's not. You needed me to hear you and I didn't and that was wrong. I want you to know that I'm your friend, Moll.  (holding out a paper bag  Listen, can I come in for a minute? I won't stay long. I've had one of those days. Maybe a cup of coffee?       You're kidding. You really did it? I don't believe... What did you tell them? What did they say?          You're not alone. You're young. You've got so much talent. You're fantastically gorgeous.  Just think about Sam. Think about what he meant to you, the years you had together, how wonderful they were.      Sure. It's okay. I understand. I really do.       Hello. Carl Bruner speaking.  Mr. Balsitrari  Oh yeah, yeah. That's great. I'll pick it up later.     Get me the First Island Bank of Nassau. It's on the rolodex.       Is someone playing with the computers?  Is this a joke? One of my accounts is closed.        What the...?    Ah!  Jesus! Oh God!  I'm sorry. Things just got so crazy. I completely forgot.  I'm okay. I'm alright. Look, can I talk to you for minute? Can I come in?    Molly, I know what the police said, but when you thought Sam was here, when you thought he spoke to you, what did you feel? What did he say?      Stomach. My stomach. Do you have anything? Pepto Bismol.  What are you doing to me. Get away! Get away!  You touch me again and I'll set her on fire. I mean it. I'll kill her. I'll blow up the whole building if I have to. Stay away!      What's a matter? You believe me, huh? You better believe me! I want my money. I need that money and I want it tonight -- at 11:00. If that psychic lady doesn't bring it here, Molly's dead.  You must have left the stove on.    Molly, I'm sorry. I've got to go. Look, there's something going on. I can't talk now. Some trouble at the bank.  I don't have time to talk now. What if I come back? Around 11:00?  I can't. I'm sorry to do this, but it's important. I'll be back.    I'll check the building.  Look out!  Molly, open up. It's me.  Molly. Open up. Are you there?  Molly!  I want the check. Just give me the check.  Don't interfere! She's a thief. It's not her money.      Where?  Where is it, goddamn it? Where is it?  You're lying! Don't lie to me!      Sam? Sam?  Sam?",
        "Bruner": "",
        "Surgeon": "",
        "Subway": "",
        "Ghost": "Stay off! This is mine!  Get off my train!  You stubborn asshole.       It's your mind, you idiot. It's all in the mind. The problem is you think you're still real, that you're standin' on the floor, that you're wearin' those clothes. Bullshit! You don't even have a body anymore. It's all up here. You wanna move things, you gotta use your mind. You gotta focus! You hear what I'm saying?  I don't know how you focus! You just focus!    Cause you're angry all over. You gotta be angry here, in the pit of your stomach. Bring it down here. Let it explode. It's like a reactor, you know. Pow!  Way to go.  From your gut. What do I keep tellin' you?    Since they pushed me.  Yeah, someone pushed me!  What? You don't believe me? You think I fell? You think I jumped? Well, fuck you! It wasn't my time! I wasn't supposed to go! I'm not supposed to be here!      Can you hurry this up? My husband's in the waiting room.  You should know better than to try that. It's not worth it. It'll wipe you out for days.",
        "Elevator": "",
        "Man": "Where do you want this?      So, what happened to you?  You're new, huh? I can tell.  Relax. It ain't like before, you know. It's a whole new ball-a-wax.  I'm waiting for my wife. She's in 4C. Cardiac wing. She's fighting it.       What'd I tell you? Bingo!  Sorry 'bout that.  Rosa Santiago.  Please be seated.  I hear you.  Haven't you ever heard of phones?  Thank God.  Hey, Snow, you lost or sumpin'?  Okay. You just wait here. Let me see if this guy's got a record.  There's no file for a Willie Lopez. He was probably some old boyfriend she was trying to get even with. This psychic woman's record goes back a long way. Fraud, numbers rackets, you name it. She's a real pro.      They have ways.  They've got a million cons. A lot of times they read the obits. All she had to do was see the word \"banker\". Hell, they even go through your garbage to find things they can use, letters, old papers. They don't need much.      I'm sorry. I know this is hard. People want so much to believe. They're grieving, vulnerable. They'd give anything for one last moment... money, insurance policies. Believe me, these people know what they're doing. Look, I know how you must feel. You know, you can press charges.  Who you kiddin'?  What're you doin'? You can't come in here. The cat don't like visitors. She'll pee all over the couch. You wanna pay for...",
        "Susan": ""
    },
    "imdb_rating": "7.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMmE4ZjI3YzctNjM0YS00MjBlLWFmYjItNDRiNTk0ZmRkYjVjXkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Even though Sam Wheat, the successful investment counsellor, still finds it difficult to express his deeper feelings for her after all these years, his young potter girlfriend, Molly Jensen, is the love of his life. However, a curious case of a systematic discrepancy will prepare the ground for a hideous urban homicide in one of Manhattan's dark alleys, trapping, seemingly forever, the unfortunate deceased's immortal soul in the realm of the mortals. With the condemned spirit unable to interact with the physical world--and as Molly's life, too, is in grave danger--Sam will have to turn to the spiritual medium, Oda Mae Brown, to warn and protect her. Can Oda and the ghost settle the unfinished business in time?—Nick Riganas",
    "name": "Ghost",
    "genres": [
        "Drama",
        "Fantasy",
        "Romance"
    ]
}