{
    "filename": "Ghost-Ship_script.txt",
    "imdb_id": "tt0288477",
    "imdb_url": "https://www.imdb.com/title/tt0288477",
    "characters": [
        "Complete credited cast:",
        "Santos",
        "Katie Harwood",
        "Captain (as Robert Ruggiero)",
        "Friendly Officer",
        "Second Officer",
        "Munder",
        "Chief Steward",
        "Purser",
        "Dodge",
        "Francesca",
        "First Officer",
        "Ferriman",
        "Greer",
        "Epps",
        "Murphy"
    ],
    "dialogues": {
        "Santos": "",
        "Katie": "Maybe last year.  Katie joins them from the outer room.   It's not your color anyway.   It isn't real.  Epps looks back at her from the other side of the room where she stands.   Many bad things have happened here. But you mustn't allow the evil inside. I tell you this because you can see me. The others can't. But you must leave. You must leave.  A LOUD GUNSHOT SOUNDS SOMEWHERE IN THE SHIP. When Epps turns back Katie is gone.",
        "Harwood": "",
        "Friendly": "",
        "Officer": "Epps steps in. She shines her light on the room. It is exactly as it was left. She crosses to the bed, shining her light under it. She sits down, trying it.    The SOUND OF SOMEONE BREATHING HARD CAN BE HEARD in the dark room. As the CAMERA SLOWLY MOVES INTO THE ROOM, we see that it is Greer, lying on the bed. His body is tense and his arms arch rigidly toward his chest. His jaw is clenched and he expels harsh, guttural utterances, experiencing something between a night terror and a seizure.    Epps sits down on the bed. She lies back, not sleepy. A beat as she holds there in the darkness.    Greer lies asleep on the bed. But his sleep is fitful, increasingly agitated, tormented. It is as if he tries to speak, but cannot. As THE CAMERA PUSHES SLOWLY IN, his words are forced and garbled, speaking in the same nonsensical language he spoke earlier, when he wakes with a start.",
        "Second": "",
        "Munder": "",
        "Chief": "",
        "Steward": "",
        "Purser": "Epps looks through a file cabinet behind a heavy wood counter as Greer and Murphy approach.    A file drawer comes open, revealing ticket receipts.  Epps looks on at it. The receipts are labeled \"FULL FARE PASSAGES\" and are divided by first, second, and third class. She goes through them, coming to a section that says",
        "Dodge": "Where from?   I'll sleep good tonight knowing that.    If it started out at twenty an hour the piece of shit'd be at the bottom of the Gulf by now. Whether it'll make St. Lawrence is anybody's guess.   Much obliged, skipper.   With that coxswain dickhead.   Are you kidding me? Jealous? Epps? Gimme a break.  Greer and Murphy trade looks as Dodge raises his beer.   What a laugh.  A MINOR COMMOTION can be heard as they sit there.   Fuck it.  He puts down his hand. Epps takes another drag from her cigarette, collecting her winnings.   Why not.  She gathers the cards, shuffles.   What is your first name?   It just occurred to me I don't know your first name. All this time and I don't know it.  She deals the cards in silence.   What?   Maureen?  She looks on at him as he holds there, takes his cards.   Roger.   Yeah.  She wants to laugh, but only studies her cards.   You think that's funny   Smugglers maybe.   Probably slipped her moorings, got tangled up in a current.   Somebody's probably looking for her as we speak.   Yeah, from one side of the harbor to the other. But we got half the Bering Sea and the whole Alaskan gulf to drag her over.   If you get it back in one piece.   It's a bloody navigation hazard. One boat can't control a ship that size.   Okay. We're gonna use a heavier than usual twin cable rig this time, consisting of a pair of number three gauge braided wire tows.  We'll tie off through the anchor alleys. And come down to the aft port and starboard pins. Here.  Thus, we need to get two of these...  Up there.  He indicates the bow of the Chimera.   Seeing as though a foot of one of these fuckers weighs about a hundred pounds, it ain't gonna be what you'd call easy.  Any questions?   Then we'll all be doomed. Any other questions?   Ready?    Hit it!  Epps reaches over and unhinges the crane hook and the tow cable explosively drops, banging loudly against the Chimera's hull with a shower of black rust.    Dodge cranks a portable pulley winch on the deck, the pilot cable slowly pulling the tow cable up through the anchor alley.  It is heavy and the winch shows the strain as Dodge cranks it. He continues, when something gives in the winch mechanism and the whole thing slides forward on the pilot cable, entangling Dodge's leg and dragging him on his ass along the deck.    Dodge slides toward the anchor alley like a piece of meat toward a sausage grinder, when the winch slams into it and stops dead, the cable continuing on with a loud shriek dangerously close to his face, until...    Dodge lies tangled in the winch.   Yes!   Alright, skipper, real easy.   Steady as she goes.    Throttle back.  The tug slows as the cables rise slowly from the water.   More.  The tug slows still more.   More.  It slows still more, until the tug just creeps along, and the massive tow cables rise entirely out of the water, straightening as the slack is pulled out.   Right there, skipper. Right there.  Murphy eases forward on the throttle and the turbines rise in pitch.   Sounds reasonable.   They shoulda thought of that when they let her float away.   Nobody just scuttles a passenger liner either.    What the...   (shouting up to the pilothouse  Mother fucker!   Threw a turbine blade.  Dodge looks over the smoking turbine, pulls back an aluminum intake blade, hot to the touch.   Son of a bitch!   The number one turbine's pretty well trashed. Number two runs, but it's way underpowered.   Hard to say. I gotta get in there and have a look. At least a couple days. Depending.   Nah. Everything was cool. It's just one of those things.   How about now?   What? You sure?   (geting up to have a look Lemme see.   Turbine rotor's shot.   Metal's crystallized. Gotta replace the whole deal.   Like I always say --   The right way and the wrong way.   Hard to say.   I'm telling you, you don't want to be running that fan like it is.   It's a full 2500 horses down. We couldn't drag that boat down hill on ice with it.   I gotta pull the blades and re-seat everything in a new rotor -- .   Three, four days.   What do you want me to tell you, that we can throw this sucker back in and start pulling her like nothing happened? Can't do it, skipper.  A beat as Murphy stands there, knowing he's right.   Man, it gives me the creeps. We got no business towing a ship that size anyway. I say we fix the turbines and hit the highway.   Yeah, a ship that's supposed to have been lost at sea fifty years ago. You don't think that's just a little freaky?   Yeah, well how the hell you get something like that wrong? That's a damn big boat. It's either sunk or it ain't.   Fucker!   (inspecting his skinned knuckles Damn mind of it's own.   Went aboard.   What the fuck we gonna do with it?  Greer, Murphy, Epps, and Dodge all look on.   What, you think there's something funny about it?    Didn't happen yesterday, I'll tell you that. Torn parts rusted bad as the rest of the boat.   Or somebody stopped them.   So what're we gonna do. That's the big question, right?   Then we're rich. We're damn, filthy stinking rich.   You gotta be kidding? What the hell we need that tub for, we got fifty million bucks?   Last thing we want is extra partners.   Yeah, yeah. I'm on it.    Murphy!  Murphy looks down to see his pant leg is on fire, as Dodge turns a cloud of halon on him, putting it out.   Propane tanks're gonna go!  Murphy crosses in the smoke, coming as close as he dares to the most intense part of the flames. He turns the extinguisher into them, holding it there.  The flames dim, as Dodge joins him on the other side, turning his extinguisher on it too. The fire seems to dim yet again as clouds of halon rise up.  Fire belches from a duct, crawling across the ceiling. Dodge fires his extinguisher at it, pushing it back across to the wall again.  Murphy extinguishes the last of the flames in the turbine well as Dodge brings a snaking tendril of fire down to the deck, and finally out.  They stand there in the sudden silence, the air heavy with smoke. A fine layer of halon powder lies over everything, but the fire is out.   One minute I'm minding my own business, the next thing I know the whole place is burning up.  An oxygen tank must've blown on the welder. Started an oil fire.   Seen better -- Ow!  Epps cleans the burn with hydrogen peroxide.   Thanks for the warning -- Ow! Damn!  Epps keeps cleaning as Dodge bears it.   I tell you one thing, we're not gonna be towing no ship now.   I'm buyin' me a nice outrigger. Spend my time hauling rich Seattle business men through the Puget.   What're you crazy?   What's so great about Sweden?   Yeah, but not as cold as those Swedish girls you only gonna dream about.   Yeah, yeah.   Sounds like the hull.   Light in those passages ain't so good.   Where's his boat, then? Where's his crew? He ain't gonna be out here by himself, that's for damn sure.   Gimme a break.  A beat as they sit in silence.   Bullshit. That boat hasn't made steam for fifty years. We found her. She's ours.   I say fuck the motherfucker. We're a professional salvage crew going about our business. What's some yahoo doing way out here by himself anyway?   Why not? Why the fuck not?  A beat as Murphy, Greer and Epps exchange looks.   Fifty million dollars. Fifty million. We gonna let this guy just take it from us? One guy?   I'm saying we gotta do whatever we gotta do to preserve our interest.   One guy isn't gonna be so stupid.   What if that fucker finds it before we're ready to go?   Yeah, reconsider fucking his shit up.   Pretty handy with that scatter gun, Epps. You raised on a farm?   Smokes?   Fresh ain't the first word that comes to mind.  Murphy checks the pockets, finding a wallet. He looks through it.   Damn barbaric is what it is.   So whoever did this might still be around.   Let's not be too hasty.   All the seals and gaskets're shot. Anything that was rubber burned up.  Murphy stands at the doorway, looking on.   I might be able to find something on the ship. But it's gonna take time.   Right.   I need lag bolts, especially one inch standard. And sheet metal. Preferably steel, about a sixteenth of an inch. Aluminium, even tin'll do.   You find anything that even looks like a compressor. I don't care what, grab it.   Dodge to Murphy.   You better get down here quick, skipper. I'm on \"C\" deck. Cabin 400.   I think you better see this for yourself.   I found him like this.  Greer is lying supine on the floor. His legs are rigid and his trunk is extended. His arms are flexed and twisted so that the palms are facing away, fingers splayed, wrists quaking over his chest as they fight to touch each other.  Murphy kneels beside him. Greer's eyelids are half closed, his eyes rolled up into his head. His jaw is clenched, face contorted in a bizarre grimace. And he speaks, uttering nonsense words in harsh expulsions, as though speaking in tongues.   A what?   I heard a scream. When I got there I found him on the floor. He was having some kind of seizure. I didn't see anybody else.   Then what the hell happened to him?  Another beat as they hold there.   Not me.  Another beat as this sinks in.    On a passenger ship in 1953?   Yeah, way wrong.  A beat as they consider it.   So. I got a question. Just from a, you know, purely technical standpoint. We call the Coastguard.  Coastguard shows up. What exactly is the plan?   Well, they're gonna be asking a lot of questions. About us. About those bodies. About the gold. Seems like we oughta be prepared is all.   Yeah, well. The truth is one thing. When there's more than a few hundred million dollars involved, that's a whole new deal.   For starters, getting that gold off the ship. What they don't know about isn't gonna bother them.  A beat as Murphy holds there.   With all due respect, skipper.  Part of that up there's mine. I'd kinda like to have a little say in what happens to it.  A beat as Murphy looks on.   I don't know what you're talking about?   Maybe you can tell me then.  Murphy shoves him hard into the wall.    The radio. Oh, yeah, the radio.  Murphy tightens his grip.   Take it easy, willya? What about the radio?!   What?!   What the fuck -- ?   I didn't touch the fucking radio.  Murphy tightens his grip still more.   I didn't touch the fucking radio!  Ever occur to you there's somebody else on that boat, skipper?   Look, I didn't touch it. Alright?  Murphy holds there a beat longer. He shoves Dodge back letting him go.   Jesus.  Dodge checks his throat as Murphy looks on.   What day is it?   Wrong. It's Friday.   Right. Wednesday.  A beat as they all hold there. Greer takes a seat.   The skipper seems to think I did it. That I'm more interested in that gold than my own safety or the safety of my fellow shipmates.  A beat as they hold there, as Murphy looks back.   Hell no. You think I'm crazy?  Another beat as they hold there.   Dodge to Murphy!  Murphy reaches down for his radio.   You better get down here right now! We're taking water! Big time!   Turbine chamber on number two must've blown! Took out part of the hull!    Dodge stumbles toward the bow, slipping on the wet deck. He goes down, sliding into the water that washes over the starboard rail.  He pulls himself up, using a cleat to push off. A deck locker opens and the contents tumble around him. He struggles to pull himself up to the base of the pilothouse. He climbs up and edges his way toward the bow.    The tug is slowly lurching over as Dodge climbs the crane, the top of which is sweeping away from the Chimera.  Below, the decks of the tug are swept with seawater as it sinks lower and lower.    As Dodge makes his way up, he's forced to climb onto the other side of the crane to keep from dangling over the water.  Above, Greer casts a line. It falls near, but out of reach as the swell of the water starts to swing the crane to and fro.  Dodge reaches out for the line again, his hand coming close but not close enough.  The swell brings the crane toward the boat one last time and Dodge reaches out, his fingers just coming to the line, coaxing it into his grasp. He pulls it back and hangs on, as the crane sways back with the foundering boat.  The crane falls away from Dodge, leaving him hanging in space by the line from the bow of the Chimera.    As he pulls himself upward, coming to the bottom of the rail well on the Chimera where Murphy reaches out, just short of Dodge's hand.  A SCREECHING SOUNDS and they turn to see the twin tow cables coming taught against the hull in the anchor alley's of the Chimera as the sinking tug pulls them tight.  With a CONCUSSIVE STRIKE, one cable is freed, snapping against the Chimera's hull like a giant steel guitar string.  It starts sliding along the hull as the tug drifts, pulling the cable with it, toward Dodge as he dangles in mid air.  Dodge pulls himself up, reaching for Murphy, but still short.  A LOUD HISSING SOUNDS and Dodge turns to see misty air escaping from ports and deck vents as the encroaching water forces it out of the tug below decks.  The tow cable LOUDLY SCRAPES THE HULL in a shower of rust, as Dodge struggles to pull himself up.  Murphy reaches out as Dodge extends as far as he can, their hands barely reaching.  The tow cable is a mere few feet away and closing, ready to scrape Dodge into the water or smear him across the hull like a bug on a windshield, when Dodge pulls himself up with everything he's got and Murphy grabs his hand.  Murphy pulls, lifting Dodge, as Greer grabs Dodge's other hand and they pull him up, the tow cable sweeping by with a  When they find out what it's carrying, they may not be so interested in what's legal.   The turbine blew.   Just wanted to check on our little baby.  A beat as they look on at the gold.   That oughta buy a man pretty much anything he wants.   I don't figure there's much I want money can't buy.   Right.  Murphy holds there a beat longer, then turns to go, as Dodge looks after him.   You'd think on a ship this size there'd be something left to eat.   There's a charming thought.   What say, Epps? You up for some roasted albatross?   No fucking way.    What?   Yeah, yeah.   Sorry.    Right.   Dodge.   This is Dodge. Over.  He is answered by silence, the CHANNEL REMAINING OPEN, WHEN  Who is this?  The RADIO CHANNEL OPENS, but only silence comes back.   Identify yourself, motherfucker!",
        "Francesca": "",
        "First": "Epps slowly pushes open the door. She holds a sack with a few items she's managed to scavenge. Light falls from curtained windows onto the room. A divan sits against the wall. A table stands in the middle of the room, a moth-eaten velvet table cloth sitting under a brass lamp on top. Two twin beds stand on either side. They are covered in dust and are moth-eaten, unmade, as if the occupants had just gotten up, fifty years ago.  In one corner is an armoire. Epps steps up to it, pulling back the door to reveal a rack of woman's clothing hanging there undisturbed.    Greer stops before a mirror to see himself. He finds an aspirin bottle, goes to open it. And as he does so, he sees that his hand is shaking uncontrollably.",
        "Ferriman": "",
        "Greer": "What's slow?   Hear that, Dodge? Epps don't think it's a problem.   Greer to Murphy.   The number nine on the starboard side's half flooded. Epps says it's a slow leak just under the waterline, about twenty gallons an hour. They must've pumped it before we left Sitka.   Let the buyer beware.   Not bad for dragging a leaky tub half way to Russia.   I must be in the wrong business.    Better than \"making hamburger for Mickey D.\"   Looks like Epps' gonna get some tonight.   Show your tatoos to that coxswain last night, did you Epps?   I bet you did.   Red sky at night, sailor's delight.    Greer to Murphy.  Greer studies the radar display as he waits.   There's a large vessel out about ten miles to the north-west.   I been watching it for close to an hour and it hasn't moved. I can't raise it on the radio either. Makes me think it might be in trouble.   Looks like it's adrift.   Too big. More like a freighter.   Smuggling what? Tundra grass?  A beat as Murphy holds there. He raises the radio mic.   Call the Coastguard?    Talk to me, skipper.  After a moment, Murphy comes back on the radio.   How's that?   What is it?  No answer.   Murphy.  No answer.   Murphy, goddamit.   What is it?   You mean tow her back? That's a thirty thousand ton ship you're talking about.   All we got to do is hit some rough weather and you can forget about it.   Hypothetically speaking, what if we get this boat to Sitka and find out somebody wants it back?   I don't care what, ain't nobody just gonna let us walk away with a ship that size.   You think the extra strain caused it?   Yeah.   One first class passage. Elizabeth James. Dubayy to Halifax. January 29th 1953.  Murphy takes it, looking it over.   That must be the old man right there.  The uniformed man in the photo is a gaunt, stern-looking man from another century, with dark, hollow eyes.   He'd let you off at the nearest port, that's for sure.   Sixty pounds.   That's what it says.   Are you crazy? Do you realize we got ourselves a ship? We own a ship, Dodge.   Take it easy, Dodge. It's only a piece of metal.    Morning, skipper.  Murphy has stepped out into the sunlight.   You're up late.   Yeah.  Murphy nods. A beat.   What the fuck you think we gonna do with it? It's ours, baby. It's all ours.  Murphy has stepped forward, taking an ingot, inspecting it.   How much you figure that's worth, skipper?   Ho, baby!   If they thought it was lost at sea, they probably just wrote it off.   All I gotta say is it looks like that somebody's us right now.  Greer cackles as he high fives Dodge.   Cargo like this could make a crew think twice.   Then why didn't they take it.   Must be a damn good reason to jump ship and leave fifty million dollars aboard.  A beat as they consider it.   So what? We gonna unload the gold and get a move on?   Yeah, but we still gotta haul that big piece of shit all the way back to Sitka.   I heard that.   Two hundred twenty. Two twenty one. (as Epps stacks the last one Two twenty two.  Greer makes a note.   Two hundred twenty two kilograms of solid gold.   Hell yeah.  They slap hands.   Looks like it took out the backup genny too.   What now?   And get a bunch of fools sniffin' around here?   Fifty million four ways. That's twelve million and change a piece.  What you gonna do with your share, skipper?   Moving to Sweden.   It's a beautiful country. Very clean. Very civilized. And cold.   Hell, yeah. I like it cold. Colder the better.   We'll see who's dreamin', m'man.   What the hell is that?  The SHRIEKING CONTINUES, ECHOING EERILY AS IF FROM THE SEA.   That shit is seriously bizarre.  The DISTANT SHRIEKING ECHO continues as they hold there.   What'd he look like?   She's so big somebody could come alongside her on the other side and we'd never know it.   I don't know.   Supposing he wants to get bad with us?   I say we off-load some of that gold now.   Pretty low all around.   Coffee.   Ho-ly shit.   And look what happened.   Stay away. Or else.   Maybe Epps's mystery man had something to do with it.   Yeah. Hell, what difference does it make if we report it now or later? We call this in now, gonna be Coastguard, FBI, who knows who, all over the place.  A beat as nobody's too sure about this.   I ain't no mechanic, just so you know.    Greer works to disassemble a compressor mechanism. He has difficulty getting the right purchase with his wrench, when he slips.   Dammit!  A beat as he inspects his hand. In the silence A DISTANT SHRIEK SOUNDS, maybe metal against metal or maybe human, somewhere in the ship. He holds there, listening.   Dodge?  He moves on, shinning his light as he goes.   Dodge!   Oragishlaoomnudrasadrafantoshviska getofedobrodijotosiantosg.   Never been more thirsty in my life.   Lost my sea legs.   No.   Lights?   I feel fine.   I don't know. Tuesday?   What happened?   Last thing I remember I was aboard the Chimera. Down somewhere in there scavenging around.   Say what?   Oh, man.   I wish I could tell you. I'd be real interested to know myself.  Another beat as they hold there, as Greer takes another drink of water.   We're not gonna be able to pump it!   Rotten stem to stern. Guess you couldn't expect much else.  Greer jumps down as Murphy, Dodge, and Epps look on.   We ain't exactly in what you'd call your high traffic neighborhood either.   Maybe you shoulda thought a that before you scuttled our boat.  Dodge turns to see Greer. A beat.   Lemme see, was that before or after the oil fire?  A beat. Dodge takes a swing at Greer.   Gettin' a little hot under the collar, I'd say.   Must be a little too the truth, eh Dodge?  Dodge jumps forward again, but Murphy hangs on.   After fifty years there ain't nothin' left but shoe leather.   We can always start shooting birds.  Epps coaxes a hit out of her last cigarette.   Looks like we're in a strong current.  Must be making almost five knots full on ass backwards.  Greer crosses to the window, stepping up.   Nasty little swell outa the north west too.  Murphy nods as he looks out.    They come to the side at the wheelhouse, seeing the bright orange letters \"NOAA\" emblazoned on the buoy's float pod as the ship drifts by.   A what?   We're still drifting.   I don't even want to know what that's gonna taste like now.   Must've heard something below deck and went down to check it out.  A beat as they hold there.    As Greer moves along too.   Yeah, yeah.   Sorry. Didn't mean to scare you.  She holds there a beat, looking around.   You okay?   What?   Can't find the shotgun.   Doesn't look like it much matters.   What about the gold?   Now hold up just a minute. Let's be reasonable here.   All I'm saying is that gold's worth a lot more to us now than it ever was.   I didn't sign up to go home empty handed. And I sure ain't gonna roll over for the freaky motherfucker did this.   Fine with me.   Oragishlaoomnudrasadrafantoshviska getofedobrodijotosiantosg.  He speaks nonsense, his face distorted in an ugly grimace, eyes bulging as Epps fumbles over the table, a tray of glass and silver crashing to the floor as he pushes her back, still choking her.  He backs her to the wall, pushing in, closing her windpipe the rest of the way.  Her hand searches behind her, knocking over a small vase, a basket, some books. It comes to a brass desk lamp. It falls, a little out of reach.  She is going to black out any second, as Greer strangles her.  Her hand comes to the desk lamp, grabbing it.  She raises the lamp, swinging with all her might, connecting with Greer's head.  He stumbles back, a gash laid into his face, as Epps sucks in air, gagging and coughing, her neck purple with finger marks.  She fumbles her radio up.",
        "Epps": "It's a slow leak.  She unclips and drops to the deck.   Maybe twenty gallons an hour.   Amidships starboard at the beam. Just under the waterline. I don't think it's a problem.    Epps coolly puts out her cigarette as a circle has gathered around her and the girlfriend, anxious to see a girl fight.   I don't know what you're talking about. I just bought this guy a beer.    Listen, I don't want any trouble, okay -- ?   Morning everybody.   Showed him a hell of a lot more than that.   It's my pen name.   One more?   What?    Maureen.   Maureen.   What's yours?  Dodge takes a drag from his cigarette, thinking about it.   Roger?    No.  She takes a hit from her cigarette as she plays her hand.   Could be a fishing boat.   Out here? What, so a seven hundred foot passenger liner drifted out of Spokane harbor and nobody managed to bump into her until now?   Go on.   Supposing one of those cables breaks under tow.    Epps hangs on to the top of the crane as it comes to the starboard anchor alley in the bow of the Chimera. Dodge pokes his face out from the other side.   Bring it on, dude.  Dodge disappears from the hole and his hand comes back with a smaller pilot cable, which Epps takes and threads through the loop at the end of the tow cable. She places the end of the pilot cable in a vice collar and uses a wrench to tighten it down, with the effect of joining the two cables.     The tow cable creates a spray of rust and smoke as it spills out of the anchor alley before Epps.    The last of the cable explosively whips out of the anchor alley in front of Epps and splashes in the water below. A beat as she holds there.   Dodge? You alright?   They must've scuttled it. Nobody just lets a ship float away.   Ever heard of insurance, big boy?   Check this out.   Everything's still here. Ticket records, receipts, books of account.  Greer picks one up.   Looks like one hell of a stick up his ass.   Coffee?    What'd you find up there?   She was sailing up north, right?   Well, suppose she got a little further north than she should have.  Got stuck in the ice. The passengers and crew evacuated. She froze into the ice pack, which moved further north, where it froze in solid. They write it off. Fifty years later, the whole global warming thing happens. The ice melts, she gets loose and floats around til somebody runs into her.  Murphy nods, considering it.   Nope.   So what did happen?   You think she's sailing without a crew?  Murphy looks out at the Chimera off the bow.   You're more practical than superstitious.   If this thing turns out to be a ship everybody thought sank a long time ago, we just hit the jackpot.   That's a lot of money for somebody to just let float away.  Murphy looks up at her from the gold.   Maybe they didn't want it back. Maybe the whole fat deal was insured.   And it looks like somebody got here before us too.  The steel hatch is twisted, as from a great hand ripping it back from the wall.   You mean, before she sank.   Probably didn't have time.   Why not call for help?   Or uninvited guests.   That's what I call a payday.   This's gonna hurt a little.   What other choices have we got?   Guess I'll just keep working.   I like my job.   That's a good thing?   It's coming from inside.  They hold there listening as the SHRIEKING CONTINUES.   Hey!  Epps moves off as the man walks around the corner.   Hey, wait a minute! Hey!  MOVING WITH Epps as she breaks into a run, going down the passageway. She comes to the corner, rounding it out onto another passageway. The man is nowhere to be seen.  Epps moves quickly down the passageway, coming to the next corner, rounding it out to see only another long passageway. She turns back, running right into Murphy.   Did you see him?   The guy. He just came this way.   There's somebody else on this boat.   I saw him. Just a minute ago. Some guy.   Of course I'm sure. I saw him.   It wasn't you. It was somebody else. There's somebody else aboard.  A beat as Murphy looks back at her.   I'm telling you, I saw somebody. I don't know who it was. But I saw somebody.   Maybe six feet. Lanky. I didn't get a good look. He was far away. But I saw him. I saw him as sure as you're standing there.   Maybe that is his boat.   So, we find this guy and make a deal with him.   So we kill him?   Maybe he isn't alone.  They consider this a moment.   Guess that'd be me. Again.   Say we run into this guy again.  A beat as they consider this.    Seen a lota movies.   No cowboy shit. Right.  Greer extends a thermos to Epps.   (pocketing it in her coat You're a pal.  She checks the squelch on her radio, pockets it too.   Yup.   Oh yeah.  Her bravado does little to hide her apprehension as she slings the shotgun on her back.   See you boys later.  Don't be late, I need my beauty rest.  She looks up, climbs onto the crane and up toward the darkened ship above them.    Epps.   Yeah. Just a bird. Just a stupid bird.  She wipes her brow on her sleeve, holding there a moment, when she smells something really awful.  She steps forward, following the smell, pushing aside the toppled oil drums to see an unidentifiable form in the beam of her flashlight. She steps still closer, training her light on the form to see that it is a human torso.  A large gash runs up its middle and the clothing has been torn by scavenging birds.  She hesitates, then steps still closer when she steps on something. She starts, then shines the light on the deck in front of her where the body's decaying head looks back with wide, unseeing eyes.  It takes everything she has just to hold there. She shines her light back to the headless torso.  She shines her light beyond that, and up, to reveal a bent steam pipe hanging out over the deck, stained with dried blood, a pair of legs dangling from the pipe when, just behind her, a booted foot comes into frame, lightly touching her.  She spins around to see another body above her. Except this one hangs in one piece, suspended from another bent steam pipe. It has been impaled length-wise on the pipe from rectum to mouth.  One of its arms has rotted off and lies on the deck below it.  A few feet away, a third body hangs impaled from another bent pipe.   Because of the gold.   So, what? We report this? Call the Coastguard?  Another beat as they hold there.   Hard to say.   I'm no doctor. But I'd say he's in a coma.   I don't know what else you'd call it. He's breathing on his own, but his pupils are completely blown out. He's totally unresponsive to pain.  What happened up there?   Other than the obvious, there's nothing wrong with him that I can see, not on the outside.   Greer?    He needs a doctor.   Same. Any luck?    They're dead in the water that morning. Four hours later the captain's relieved of his command. And that evening they issue a general  You're saying they mutinied for the gold?   Only something must've gone wrong.   Murphy.  They turn to see Epps in the hatchway.   It's Greer.   Any dizziness?   Headache, nausea, lights?   Sudden flashes of light.   Try Wednesday.   What?   But, who -- ?   Did you?    A tattered, bound book lies in the refuse of a forgotten corner. Epps picks it up. The cover has been ripped off and the pages are torn. But, as she looks through it, she sees that it is the ship's log.   Murphy.  Murphy steps over as she pages through the log book to the very end. The last pages have been ripped out.   Looks like part of the general log.  Epps points to a page that has been incompletely ripped out.   \"The crew have gone mad with greed and fight among themselves like wild dogs over fresh kill.\"   The same day she supposedly went down.   \"Their lacking diligence has undoubtedly caused the collision. Distress calls have been made.\"   The page's missing. Then their SOS was real.   Maybe the other ship took the worst of it.   It's a good bet they'll be asking a lot of questions when they get here too.   Murphy?  No one answers. She looks off across the stillness of the galley. Nothing.    Who are you?  From this distance and in the light it is hard to fully discern the girl's features.   But --  A HATCH CLOSES SOMEWHERE IN THE SHIP. Epps turns to look. When she turns back the girl is gone. A quiet \"TICK\" SOUND ECHOES in the pool. She looks down to see that the pool is now very, very deep, like a mine shaft falling away into the depths. And, as she stands there, dark water is quickly rising up from the bottom.  She steps back as the water gradually fills the pool to the top. It is very dark and the bottom is indiscernible, when the water begins to churn, as from bubbles of air reaching the surface. Epps steps closer, looking on as a faint red glow can be seen deep in the water below the churning bubbles.  As she watches, the red glow grows in intensity. The glow spreads, illuminating a broad area until it becomes clear that the water is not water at all but blood.  And, as the light grows still brighter, a figure is illuminated, well below the surface as it seems to rise up. Epps looks on as the figure rises higher into the light. It is a MAN, fighting desperately to reach the surface. The bubbles that rise up are produced from his silent screams.  Epps starts forward, but another figure rises to the same point, a WOMAN, also struggling. Another MAN floats up, then another, and another, people floating up, fighting desperately to reach the surface, unable to do so, drowning in blood.   My God....  Epps reaches out over the edge, plunging her hand into the blood, reaching for the man's hand, but they are too far apart.  She struggles desperately as the man fights to get to the surface.  The others are fighting for the surface too, as Epps reaches out, near tears, helpless to do anything.   No!!  Everything suddenly stops. A beat as Epps only holds there.  The blood is gone, as are the people. The pool is back to its normal state as though nothing had happened, Epps looking on in disbelief.   Yeah. (looking back to the pool Yeah, fine.  A beat as she holds there, looking on at the pool.    Why not?   Higher. You're gonna miss it.  Murphy holds the loop steady.   It's not gonna hold us.   Hey.   Couldn't sleep.   What do you think happened on this boat?   The what?   Are we smart enough to avoid that?   When you found me yesterday, at the pool. I'd seen... something.  Someone.   No. Someone else. A girl.  I'm not sure she was... real.  She looks up to Murphy.   I don't know what else you'd call her. One second she was there, the next she was gone.  Another beat as he looks on at her.   And I had a kind of hallucination.  There were others. I saw them in the pool. Drowning.  A beat as Murphy looks back, as she sees him.   Maybe hallucination is the wrong word. It was more than that. As though they were showing me.   What happened.   No. I think they are, were, just passengers. Innocent victims.   Something bad happened here, Murphy.   More than just a mutiny. More than just the gold.  A beat as he holds there.   She said the ship was evil. That we had to leave right away. That if we didn't, we might never leave.   I don't know.  A beat as she looks back.   Just lucky I guess.  Another beat as he holds on her.   Dodge. (no answer, knocking again Dodge.   Get up.   Check it out.  Greer raises his light to reveal rows of canned goods. They are industrial sized cans, from the 1950s. Greer takes one.   Better than starving to death.  Epps' radio CRACKLES AWAKE.    Epps, over.   Nope.   Right here.   Murphy?  No response as Epps holds there. The WHISPERING SOUNDS AGAIN, far off, unintelligible. It stops.  She moves on, shinning her light.   Yeah. Fine. I just thought I heard something is all.   Nothing. Let's get outa here.  They start to leave, when Epps notices something. She stops.  Beyond the standpipes, a faint glow can be seen in the darkness. Epps steps forward, crossing to it. Greer follows.    As Epps approaches, Greer behind her. The light is dim and low to the deck. She stops.   What do we do with him?   I can't believe you. Dodge's dead and all you can think about is cashing in your share.   Greer?  He does not hear her as he stands there. She approaches, stepping up.   You okay?  Another beat, as he looks off, into the light, when he slowly turns to see her.  A long beat as she looks back. He holds there, the same empty look about him, when he grabs her by the throat and squeezes hard.  She is stunned, breathless, but raises her hands to grip his wrists, fighting him.   Greer!  His grip tightens. He is much stronger and her efforts make little difference.   Let go!  She hangs on, starting to choke. She drops one hand, searching with it.    Murphy! I'm on C deck, cabin 400! Get down here now!!  Blood is running down his face as Greer comes for her again. She throws down the radio.  A bed stands between them. She feints right, then left. He's dazed and has blood in his eyes. She manages to slip by, but he dives, taking her down.  He drags her back along the floor, spinning her around. He raises a fist to ram into her face when WHAM!  Epps has shoved the butt of her flashlight into his crotch and he comes up SCREAMING. He grabs her face, striking her with his other hand.  She swings the flashlight again and cracks him across the head. He swings yet again and connects, knocking her across the floor.  She lies in a heap as Greer climbs to his feet, enraged and bleeding.  He unbuckles his belt as he approaches, pulling it from his waist to do God knows what.  Epps looks around to see him approaching. And we see that she has unhinged her gill knife.  As his foot steps near, she lets go and drives the knife with all her might into his boot, plunging the blade through his foot and into the floor. He SCREAMS.  After a moment he stops, looks to her. He is a bloody, wretched, enraged mess. He starts toward her as Murphy appears in the doorway.  Just as Greer is upon her, Murphy blind sides Greer from behind at full speed, knocking him down.  Greer and Murphy struggle as Epps climbs unsteadily to her feet. She staggers to them and raises the flashlight over Greer, bringing it down on his head.   Could be a stroke. Who knows?  The general log said the crew were fighting among themselves. \"Like wild dogs.\"   Maybe it was more than that.  Greer gets up, comes to the window, looking out at them. He presses his face to the glass.   They went crazy.   If the weather holds it might not be so bad.   (holding down talk button Murphy?  She waits, holding there as only silence comes back.   Murphy, this is Epps. Do you copy?  Again, only silence comes back until, after a moment, the channel opens again. No one speaks, though there is a palpable presence on the other end.    Who is this?  The channel opens again, only silence returning. The sound of the MUSIC BOX CAN BE HEARD, \"DAISY\" COMING BACK OVER THE     a geometric pattern of a lotus on the Persian carpet at her feet. When she looks up again she sees what the father sees.  The mutineer finishes, climbing off the woman. Another of the men pulls her up to reveal that she is no woman at all, but Katie.  The mother and sister lie in a bloody heap near-by as one of the other mutineers steps up to Epps.    Epps to Murphy.  Only WHITE NOISE COMES BACK as she rounds the corner out onto the promenade. At the other end, the aquarium can be seen.  As she approaches she sees that the tank is empty. Greer is nowhere to be seen and the skylight at the top is broken out.  A GREAT BOOMING SHUDDER rocks the ship. A LOUD SCREECHING OF METAL follows it.   What happened?   What?   Greer's gone. He broke out of the tank.   He's been shot.  Murphy kneels too, looking on at Greer's lifeless eyes.   It was you.  He only looks back at her as she stands there.   You killed them.   So you killed them?   And now you're gonna kill me, is that it?   Murphy, don't you see what's happening?   It's the ship. The ship's making you think this way.   It's a trap. There was no way we were gonna get away with that gold. Nobody ever does. It's just the bait. This ship sucks people in and it never lets them out.   I don't give a damn about the gold.    Epps scrambles behind a deck vent.    As Epps holds there she sees the vent opening. She pulls herself up and climbs inside.    Epps moves quickly along.    Epps stops where she is in the cavernous engine room, looking on at the massive hull rising above her as the RUMBLING GROWS IN INTENSITY. Though it seems to resonate throughout the ship, it seems to originate from here, from directly below, as though the hull were being dragged over a rocky bottom.  She steps back as the sound grows still louder, until it becomes absolutely deafening.  The ship begins to shudder. The steel bulkheads visibly move and the steel plates in the hull can be seen to bend back and forth.    A few rivets pop in the hull. Then a few more, as the RUMBLING   The giant claw begins to pull back, as the ship drifts off, water pouring in behind it.    A massive torrent sweeps over Epps as seawater pours in through the breach.    Epps is forced under as the water in the hull is already half way up the side, the ship listing WITH A GREAT GROANING   Epps comes up for air. A clatter of all manner of debris, tools and general detritus hammers against the far bulkhead as the ship eases over. A boiler breaks loose of its stays.  Epps looks up to see it coming right for her. She ducks under the water as the boiler slams into the bulkhead where she was.    Epps is forced down by the boiler, trapped between it and the bulkhead.",
        "Murphy": "Go.  Murphy turns back to see Greer, Epps, and Dodge looking up at him from the stern.   Of course they did.   What do you say, Dodge?   Better late than never.   You got a leak in the number nine compartment.   You pump it out and re-seam the hull, she'll be good as new.   Fifteen, at the most.   You're kidding, right?   He'll sell the scrap for three times what he paid.   You got that right.   You aren't jealous, are you Dodge?    What seems to be the trouble, ladies?   As I said, what seems to be the trouble?   I heard you. But I'm choosing to ignore you. Epps, let's go.  Epps starts forward but the Riveter stands in her way, taking Murphy by the collar.   You got about two seconds to get your paws off me, Tarzan.   Epps?  He looks to Epps like let's get the hell out of here. She grabs her coat.   Candy?   Red sky in morning, sailor take warning.   Yeah.   Alright. I'll be right up.   Merchant vessel at position one seven four one five west, five seven seven five north.  Murphy holds the radio mic as Greer looks on, Epps and Dodge standing back.   This is tugboat Arctic Warrior whiskey alpha sierra bravo four zero niner two. Over.  Only the quiet hiss of white noise comes back from the radio speaker as the bright point flashes on the radar screen.    Merchant vessel at one seven four one five west, five seven seven five north, this is tugboat Arctic Warrior whiskey alpha sierra bravo four zero niner two. Over.  Again, only white noise comes back as the point flashes on the screen.   Too deep to anchor out there.   What the hell would a freighter be doing up here? It's way out of the lanes. There's not a port for 800 miles.   Merchant vessel at position one seven four one five west, five seven seven five north, this is tugboat Arctic Warrior. Do you copy? Over.  Again, only the quiet hiss of static comes back.   Steer to one eight five. Let's check her out.   Alright. Back it off.  Greer throttles back and the boat slows.   Hit the lights.   Whoa, whoa.  Greer throttles down all the way and they drift, as the shadow looms bigger before them in the light from the boat.  As they approach, the shadow appears to be a giant rusting bow, rising up from the water, disappearing in the darkness above them. Murphy sweeps the searchlight to reveal more of what appears to be a large, darkened ship. As they come around, the name \"CHIMERA\" can be seen above the anchor alleys.   \"Chimera.\"  Murphy reaches for the mic, hits the LOUD HAILER.   Chimera.   This is civilian tugboat Arctic Warrior. Is there anyone aboard?  The quiet rumble of the tug's turbines is the only sound.   Chimera, I am hove to at your port bow. Is there anyone aboard?  They wait, looking on at the silent, darkened ship under the glare of their lights.   Epps, come with me. You guys sit tight.   We're in a stairwell just under the main superstructure.   This is definitely an old boat, maybe sixty years old. She hasn't been in service for at least twenty years. Probably a lot longer.  They top the stairs and walk into a wider passageway which takes them into an open area. Their lights shine around them, revealing sinks and counters and racks of old kitchen equipment, a few pots still hanging.  They move through the galley and into another, narrower, passageway.   It's funny.   Besides a little rust, everything's pretty well-preserved.  Greer and Dodge look at each other.   How she got out here is one hell of a good question.  Jesus.  Dodge and Greer hold there, waiting. Only silence from the other end.    Sorry.  Another beat in silence.   It's a passenger ship. It's a damn passenger ship.  Though it is dark, there is enough light to see its ornate opulence, tables and chairs in place near a large dance floor and orchestra well, and a magnificent crystal chandelier hanging over it all.    There's nobody on that boat.   Whatever the reason, she's adrift and abandoned. We've got every right to salvage her.   We've done it before.   You have any idea how much a ship like that could be worth in salvage? The fittings alone could go for a few million.   It's a risk I'm willing to take.   So we cut her loose and wait it out. A little weather couldn't be anything she hasn't seen before.   The damn thing's been floating around for God knows how long and it hasn't hit anything yet. So we take it easy. A little of the old push pull.  A long beat as they hold there.   Listen. Forget this job's just a pay check for a minute. You know I've been good to you. But I'm prepared to offer you something better now.  If we do this right, it's worth a lot of money. A lot of money.  They hold there looking on at him, waiting.   Salvage fees on a vessel like this could come in around four million bucks. At least. Who knows, could be more. Could be a lot more.  What I'm proposing is... we split it four ways.  A beat. Dodge looks to Epps and Greer.   Think about it. A million bucks a piece.  You want to spend the rest of your days drag-assing tank barges on the gulf coast, fine. Otherwise, let's get to work.    United States Coastguard, United States Coastguard, United States Coastguard. This is tugboat Arctic Warrior whiskey alpha sierra bravo four zero niner two. Over.  After a moment, a distance-warped, coolly professional, female voice comes back.   North Island, I wish to declare myself salvor-in-posession under section four two charlie of the International Maritime Convention.   A passenger liner. Over.   A passenger liner, north island. Over.   Passenger vessel \"Chimera.\" I will spell: charlie hotel india mary echo romeo alpha. No registry information is available at this time. I have determined to the best of my ability that the vessel has been abandoned on the high seas at position one seven four west, five seven north at...  Two zero one four hours zulu time. Over.   Roger, North Island. Arctic Warrior over and out.   I figure we go through at the Unimak Pass here. Refuel at Sanak Island.  Greer looks on from the helm as Murphy, Dodge and Epps stand over the map table.   With a little extra fuel, weather permitting, we should make Sitka in five days without another stop.   The law's on our side. If they want to challenge it, let them try.   Either way, we found it. It's ours now -- .  An EXPLOSIVE THUD shudders the boat. They look to each other.   What is it?   How long to fix?   Some classy tub in it's day, huh?   Chimera. Flag ship of the Dobbins Kirk Line. Nova Scotia.   (looking through scattered charts and papers I'd sure like to get my hands on the general log.  Epps steps up to the wall, where several framed photos hang.    Yeah. Thanks.  She brings him his cup, seeing the documents he brought back from the Chimera.   Some charts. A crew manifest.  Looks like her last voyage was January 1953. The question is where the hell's she been since.   Her destination was Halifax, yeah.   As reasonable an explanation as any, I guess.  Epps takes a sip of her coffee as she thinks about it.   Ever heard of the Mary Celeste?   She was a two-masted brig boat sailing out of New York in 1872.  One day she was sighted off the coast of Portugal by a merchant vessel, the Dei Gratia. As the crew of the Dei Gratia got closer, they discovered that no one was at the helm of the Mary Celeste. On boarding, they found her completely deserted. The captain, his wife, their daughter, and the entire crew, all gone. The last entry in their log made no mention of any trouble. The table was even set for dinner. And in the nine days after the last entry, she sailed 700 miles without anyone aboard.   Nobody knows. There've been a lot of theories, of course. But we'll never really know for sure.   I think we'd be surprised where a drifting ship might wind up with a little wind and the right current.   Only way to be.  Epps nods, takes another sip of coffee, looking on at the rusting hull of the Chimera stretching off in the light.   What's this?   I thought you said it was just a blade.   How much longer's that gonna take?   I know I know, two ways to do anything --   But how long?   We gotta get outa here, Dodge. A storm blows up and we're history.   What about running number two by itself?   How long, then?   How long?   Goddamit, Dodge.    North Island, North Island, North Island. This is tugboat Arctic Warrior. Over.  After a moment, the same professional, distance-warped voice comes back.   North Island, please repeat? Over.   North Island, have you got any additional information? Over.   Roger, North Island. I am tied to the passenger vessel Chimera. And she is afloat. Repeat, she is afloat. Over.   Roger, North Island. Please advise pending further information. Over.   Obviously it's some kind of screw up. The shipping records aren't a hundred percent accurate.   We all want to get outa here, Dodge. Especially me. With that boat in tow. You got three days.  Make the most of it.  A beat as Dodge looks back, then out at the Chimera.   Morning.   Guess I must've fallen back to sleep. Where's Epps?   She take a radio?   (still looking it over Hard to say. Maybe forty, fifty million.   Yes, it is.  A beat as they all hold there.   It's a hell of a lot of money.   A ship with fifty million dollars in gold aboard, adrift? And nobody seems to care enough to come looking for it?   Not for fifty million. An ocean liner maybe. But fifty million in gold, they come looking for.   Maybe. But there's always somebody whose interest's at stake.   Then it happened before they scuttled her.   That it could.  A beat, as they all look on at the gold.   Either way, they must've had a pretty good reason.   A salvage claim to a vessel's cargo's as valid as a claim to the vessel itself. It's ours.   It looks like it.  A beat as they let this sink in.   We leave it where it is. Stick to the plan.   So we get a little more for the boat. Besides, the gold'll be safer where it is.   It's worth the effort. Believe me. Besides we're gonna need her to prove the salvage.   For now the best thing we can do is to keep quiet about this.   Dodge, you gotta get on those repairs.   The sooner we get under way, the sooner we are to spending what's ours.   Terrific.  Epps arrives with a first aid kit.   How's that leg?  Epps cuts back the burned pant leg to see the burn.   We could call for help.    United States Coastguard, this is tugboat Arctic Warrior whiskey alpha sierra bravo four zero niner two. Radio check. Over.  A moment, then:   Roger that, North Island. Arctic Warrior whiskey alpha sierra bravo four zero niner two. Over and out.   Not much at all, I guess. Retire. Live out my golden years and all that.   How about you Epps?   Greer?   Dreamin's all any of you're gonna be doing if we don't get this boat running.   Warm water current maybe, making the metal expand.   Take it easy, you'll live longer.   Who?   What guy?   What? What the hell're you talking about.   Are you sure?   You sure it wasn't me?   If somebody's aboard her already, she ain't ours. She's theirs.   Not in the eyes of the law.   We don't exactly have the best bargaining position.   And what do you propose? That we knock this guy off?   Let's just take it easy here, alright? Nobody's gonna kill anybody.   Would you hold on just a minute here, please? Look, there's no reason to panic now. Epps saw somebody. Fine. It's a big boat.  Chances're real good he doesn't even know about the gold. If we stay cool, nobody'll be the wiser.  The gold stays where it is til we're ready to go. Like I said, it'll be a hell of a lot safer there than here.   We'll stand a watch. Four on, eight off. Low man first.   Dodge, get on that turbine. I don't care if you don't sleep for a week. The sooner you're done, the sooner we can get out of here. How's the food situation?   We'll have to take it easy then. I don't think we'll find much aboard the ship, but it's probably worth looking around.   If he's reasonable, maybe we can make some kind of deal. If not. We'll have to re-consider our options.   No cowboy shit up there, understand?   Got your light?   Murphy to Epps.  She settles back, exhausted.   Murphy to Epps.   You just shoot at something?   Couldn't have happened much more than a month ago.  Greer, Dodge, and Epps look on as Murphy kneels over the remains of the headless torso.   Bodies're too fresh.   Greek citizen. Merchant navy.  Obviously we aren't the first to come across this ship. They probably stumbled across it just like we did.   Could be meant as a warning.   That'd be my guess.   Maybe.  A beat as they consider the implications of this.   Dodge, if this isn't incentive enough to fix that boat, I don't know what is.   Can't you use something else?   Do what you need to do. Just do it fast.   Captain relieved of command.  He holds there a moment, moving his finger down to the final entry, reading: \"TRANSMISSION 2 Feb 53 21:24 hrs GMT. General  This is Murphy. Anybody trying to call me? Over.  He waits as no response comes, then THE CHANNEL OPENS AGAIN. Only silence from the other end as someone seems to be there, but is not saying anything. Murphy presses the talk button.   Greer? Dodge?  Again, there is no response, until the CHANNEL OPENS. Murphy holds there as he is answered by silence, WHEN A GRAVELLY,  Who is this?  The RADIO CHANNEL OPENS. Only silence comes back, as if someone were there but not speaking.   Who is this!!  The CAMERA PUSHES IN AS MURPHY LISTENS.   Greer! Dodge!  Only silence comes back from the radio when A MAN'S BLOOD CURDLING SCREAM sounds from somewhere in the ship.    Murphy.   What is it?   He must've seen something.  A beat as they consider this.   Just before I heard him yell there was somebody on the radio.   I don't know. No. Not Greer. Somebody.  Another long beat as they think about this.   It was a man's voice. Repeating some sort of children's rhyme. I don't know, it didn't make any sense. You didn't hear it?   I'll call us in. Dodge, see how many signal flares you can scrounge up. (to Epps, meaning Dodge Keep an eye on him.    United States Coastguard, United States Coastguard, United States Coastguard. This is tugboat Arctic Warrior whiskey alpha sierra bravo four zero niner two. Over.  No response.    United States Coastguard, United States Coastguard, United States Coastguard. This is tugboat Arctic Warrior whiskey alpha sierra bravo four zero niner two. Over.  Again, no response. He holds there, then finally:    Mayday. Mayday. Mayday. To any vessel. This is Arctic Warrior.  Arctic Warrior. Arctic Warrior.  Whiskey alpha sierra bravo four zero niner two. Last known position one seven four west, five seven north. I am afloat and drifting.  Require immediate medical assistance for one person, possibly comatose. I am a one hundred twenty foot civilian tug, hove to at port bow of disabled passenger liner Chimera. I repeat, Chimera. Over.  Only the desolate WHITE NOISE OF EMPTY AIR COMES BACK.   How's he doing?   No. I'll try again later.  A beat as they look on at Greer.   Possibly false. Hence the IMA record of being lost at sea. I don't think mutiny's out of the question here.   If they knew what they were carrying.   If they were close enough to shore, they probably figured they could get away in the lifeboats.   How do you mean?   I guess the best strategy's just to tell them the truth.   What do you propose?   There's no way we're gonna hide a few thousand pounds of gold from the Coastguard here. Besides, it'll be safer where it is.   Tell you what, Dodge. Once we get back to shore, you can do whatever you want with your share. But until then, the gold stays right where it is.  Dodge holds there. He looks to Epps a beat, takes a drink of coffee.   Just what the hell do you think you're doing?!   I think you know.   The radio!   You smashed it!   Don't lie to me!   You didn't want us calling anybody. Too liable to ruin your big payday.   Conveniently enough for you.   Drink up then.  Greer smiles, raising the jug to drink as the others take a seat, looking on at him.   How're you feeling?   You don't remember?   You've been out for about a day.   Dodge found you out cold in one of the cabins.  Greer only holds there.   We heard you scream. Any idea what you might've seen?   The ah... the radio's out.   Somebody took it out of commission last night.  A beat as they all hold there.   Smashed it up pretty bad.   Regardless of how it happened, there isn't much of a chance to fix it. The odds of another vessel in range of the walkie-talkies are almost astronomical. So, as of today, we're pretty much on our own out here.   February first.   Must not've been the captain's entry. He was probably out of the picture by then.  Epps continues to read.   Collision? With what?   But where's the damage?   If it was a ship she hit.  A beat as they hold there, when his radio CRACKLES TO LIFE.    Yeah.   What the hell happened!   Alright. Everybody grab your gear! This' is where we get off!   Dodge!   That just about says it all.  Greer stands at the bow of a lifeboat suspended from halyards above the deck.   The coast guard has our last position. They'll send somebody out soon enough. A ship this size you can't exactly miss.   Let 'em ask. This ship's legally ours now.    Easy, easy.  Murphy holds on to Dodge as he will have none of it.   Shut up.   I said, shut the hell up.  Murphy shoves Dodge back.   Both of you. I don't want to hear it again.  A beat as Greer and Murphy hold there.   So just stow it. You understand?  We don't need this right now.   You shouldn't be down here alone.  Dodge turns to see Murphy standing there.   If money can buy what he wants.   Then you're a lucky man.  Murphy tosses the shotgun to Dodge, who catches it.   We'll stand the watch on deck tonight. You're up first.   You okay?  Epps looks up to see Murphy standing at the door.   Tomorrow we'll see if we can't find some line and tackle. Use some of those bodies below decks for bait.   Let's just hope somebody sees us first out here.    They come to the side at the wheelhouse, seeing the bright orange letters \"NOAA\" emblazoned on the buoy's float pod as the ship drifts by.   It's a Noaa buoy.   Government weather. It's got a transmitter aboard.   Let's go, let's go, let's go.  Dodge finishes as Epps ties the other end off to a cleat.   The mooring hasn't come taught.   Doesn't matter.   Damn it.  They look on in silence, the buoy slowly receding as the ship drifts away.   Hey.   Wish I could say the same.  They watch the fire in silence for a moment.   I guess that's the sixty four thousand dollar question, isn't it?   Never mind. Before your time.  I think at least some of the crew went a little nuts. The usual stuff that happens when people stumble on a fortune. Equal parts greed and paranoia, usually resulting in homicide. What happened after that is anybody's guess. But, judging by our Greek friends down below, it doesn't look like the last time.   I don't know, are we?  A beat as she looks back at him. She looks back to the fire, watching it.   Not our mystery guest again.   Not real?  A beat as she only looks back.   What, like some kind of ghost?   Showing you what?   Maybe it was one of them did the handy work on those Greeks.   Victims of what?   That much I think we've already established.   What's that supposed to mean?   Why you? How come the rest of us haven't seen these people?   Well. Getting off this ship's exactly what we're trying to do.  Short of that, I don't know what else to tell you.  She only looks back at him, then into the fire.   Do me a favor and wake up Dodge. He's next on.  She starts to get up.   And Epps?  She stands, looking back at him.   You can tell the others about this. But, for my money, I think it's best you keep it to yourself.  She holds there a beat longer, then turns, walking off.   You're late.   (handing him the shotgun Don't fall asleep.    Dodge?   Murphy to Epps.   Either of you seen Dodge?  She looks to Greer who shakes his head.   He's not on deck and I can't raise him on the radio.   He took the shotgun and a light.   Alright. We stay together. Nobody goes any further than earshot.    Murphy to Dodge. Murphy to Dodge. Over.   Murphy to Dodge. Do you copy? Over.   Epps? You there?    As he moves along as well, eyes open.   Greer?   So whoever did this now has our shotgun.   Leave him till we can get some help.  From now on, nobody comes down here.   Leave it.   You think whoever did this is reasonable?   Nobody's going anywhere with that gold now. Anybody tries to board, we'll know about it.  You can do what you want, Greer. But neither of us is gonna risk saving your ass down here if it comes to that.   Must've been him all along.  Murphy and Epps look on from the outside in the promenade.   Smashed the radio. Scuttled the boat. Killed Dodge. Would've killed you. He's off his nut, no doubt there.  They watch him in silence a moment as Greer mutters and bobs.   What do you think?   Over the gold.   Crazy with greed. Not crazy. Not like him.  A beat as Epps looks off. In the window Greer drags his hideously distorted face over the glass, the blood from his wounds smearing in broad red streaks.   We lash a few of these together it might get us far enough into the shipping lanes to be rescued.  A beat as they look on at the rotting hull.   Hard to say which is worse, staying here or taking our chances in open water.   It's not the weather I'm worried about. The wrong current could drag us as far as the Aleutians before we come across another boat.   Epps to Murphy.  Only WHITE NOISE COMES BACK.   We hit land.   We're in an island chain. It's only a matter of time before we hit another one.   Let's get the hell out of here.   It should be enough to get us to one of those islands. Gimme a hand, wouldya?  She joins him and they lift it off its stand, taking it to the rail.   Prop it here. We need to pull these braces off. There's a hammer on the stand. There.  Epps crosses back to the stands.   I'll take that.  A beat as she looks to Murphy.   It was only a matter of time before somebody killed somebody.  You saw it coming as well as I did. Dodge had his plans, starting with scuttling the boat. And Greer too, except he went nuts. Couldn't take it, I guess. Could've happened in the middle of downtown Anchorage. But did it make him any less dangerous? I don't think so.   The way I figure it, it was them or me. I thought putting Dodge up on that pipe was a nice touch? Bought a little time. Made it look like whoever killed those Greeks was still around. But it's just us on this ship. Us and your... spirit friends.   I didn't want it to turn out this way.   I think I see it pretty well.   I know a little bit about human nature and what I've seen only confirms that.   I think maybe you been on this boat a little too long, with all that supernatural mumbo jumbo. There's nothing supernatural about greed. And that's what it comes down to, pure and simple.   I wish I could believe that. Either way, you know what I've done. I've got no choice.  He raises the shotgun.   I'm sorry.  He prepares to fire, when a CONCUSSION ROCKS THE SHIP. Epps ducks and Murphy fires, a spatter of buckshot shredding the vent behind her. A SCREECHING OF METAL DEEP IN THE SHIP SOUNDS as she gets up, diving for cover as Murphy shuttles the gun again.   There's no reason to make this any more difficult than it has to be.    Murphy climbs down a ladder to the lower decks.    Murphy follows, when A RUMBLING SOUND CAN BE HEARD.    Murphy slows and finally stops.    Murphy stops where he is to see water rushing in at the end of the passage. He begins backing away.    Murphy moves down the passageway, coming to the cargo compartment.    As the ship dips lower, the rushing water forms an eddy that pulls at Murphy. Murphy struggles, too heavy to resist as he is pulled closer and closer to the sucking maw that is the smokestack's opening.  The ship sinks further and Murphy is pulled to the edge of the stack. He frantically grabs for something to hold on to, without success, until he is finally pulled into the smoke stack and sucked into the bowels of the ship by the rushing water."
    },
    "imdb_rating": "5.6",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTM3NTA4NDIwMF5BMl5BanBnXkFtZTYwNTc4NDE3._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "In a remote region of the Bering Sea, a boat salvage crew discovers the eerie remains of a grand passenger liner thought lost for more than 40 years. Once on-board, the crew must confront the ship's horrific past and face the ultimate fight for their lives.ahmetkozan",
    "name": "Ghost Ship",
    "genres": [
        "Horror",
        "Mystery",
        "Thriller"
    ]
}