{
    "filename": "Good-Will-Hunting_script.txt",
    "imdb_id": "tt0119217",
    "imdb_url": "https://www.imdb.com/title/tt0119217",
    "characters": [
        "Lambeau",
        "Barbershop Quartet #2",
        "Barbershop Quartet #4",
        "Barbershop Quartet #3",
        "M.I.T. Student",
        "Chuckie",
        "Cathy",
        "Barbershop Quartet #1",
        "M.I.T. Student (as Vic Sahay)",
        "Morgan",
        "Billy",
        "Will",
        "Krystyn",
        "Tom"
    ],
    "dialogues": {
        "Lambeau": "Please finish McKinley by next month.  I'm hoping that one of you might prove it by the end of the semester. The first person to do so will not only be in my good graces, but go on to fame and fortune by having their accomplishment recorded and their name printed in the auspicious \"M.I.T. Tech.\"  Former winners include Nobel Laureates, world renowned astro- physicists, Field's Medal winners and lowly M.I.T.  professors.  Okay. That is all.  Yes.  It's Saturday.  Find out what?  This is correct? Who did this?  Nemesh?  Well, whoever You are, I'm sure you'll find this one challenging enough to merit coming forward with your identity.  That is, if you can do it.  Is it my imagination, or has my class grown considerably?  I look around and see young people who are my students, young people who are not my students as well as some of my colleagues. And by no stretch of my imagination do I think you've all come to hear me lecture.  But rather to ascertain the identity of who our esteemed \"The Tech\" has come to call \"The Mystery Math Magician.\"  Whoever you are, you've solved four of the most difficult theorems I've ever given a class. So without further ado, come forward silent rogue, and receive thy prize.  Well, I'm sorry to disappoint my spectators, but it appears there will be no unmasking here today. I'm going to have to ask those of you not enrolled in the class to make your escape now or, for the next three hours be subjected to the mundities of eigenvectors.  However, my colleagues and I have conferred. There is a problem on the board, right now, that took us two years to prove. So let this be said; the gauntlet has been thrown down. But the faculty have answered the challenge and answered with vigor.  Excuse me!  What're you doing?  What's your name? Don't you walk away from me. This is people's work, you can't graffiti here.    My God.  Excuse me. Is this the buildings and grounds office?  I'm trying to find the name of a student who works here.  Could you just check, because the young man who works in my building--  Building two.  No, no. Nothing like that. I just need his name.  Please, I'm a professor here and it's very important.  Excuse me, your Honor. Gerald Lambeau.  I'm a professor at M.I.T. Combunatorial Mathematics.  Do you have a minute?  Hello. Gerald Lambeau, M.I.T.  I've spoken with the judge and he's agreed to release you under my supervision.    That you meet with me twice a week and you meet with a therapist.  That's right.  Now, it won't be as bad as it sounds, Will. I've already spoken to one therapist, his name is Henry Lipkin and he's a friend of mine. He's also published four books and is widely considered to be one of the brightest men in his field. I'm sure it'll be better than spending the next six months in jail.  Henry?  What happened?  Wait a minute, Henry...     This rectangle is subdivided into rectangles. One edge of an inner rectangle is an integer. Can you prove that one edge of the larger rectangle is an integer?  Okay. How?  That would be a monumental waste of time, wouldn't it, Will?  I happen to know so.  You're thinking too hard. What if I did this?  Now, what if I do this?  Have you ever played checkers?  What's that?  --that?--  --That edge!    Will, you've managed to offend four of my colleagues so much that they refused to come back. You're meeting with the leading hypnotist in the country next week and Tom and I plan to sit in on the sessions, so I expect you to behave appropriately.      Shall we start the, uh...       Wait a minute, Barry.  Oh, for God's sake, Will.  I told you to cooperate with these people.  Get out, Will.  That's enough.  What's the point?  There is somebody...  He was my roommate in college.  Sean.  Hello.  Good to see you.  Is there someplace we can talk?  I didn't see you at the reunion.  You were missed. How long has it been since we've seen each other?  I'm sorry, that damn conference--  This kid's special, Sean. I've never seen anything like him.  Have you ever heard of a man named Ramanujan?  He was alive over a hundred years ago.  He was Indian. Dots, not feathers...  So this Ramanujan lived in a tiny hut in India. No formal education, no access to other works. But he came across an old math book and from this basic text he was able to extrapolate theories that had baffled mathematicians for years.  That's right, Sean. He mailed it to a professor at Cambridge who immediately recognized the brilliance in his work and brought Ramanujan to England.  They worked together for the remainder of their lives, producing some of the most exciting math theory ever done.  Ramanujan's genius was unparalleled, Sean. This boy is like that. But he's very defensive and I need someone who can get through to him.  I need someone with your kind of background.  You're from the same neighborhood. South Boston.  (looks squarely at Sean  Just meet with the boy once a week.  That would be fine.  Sean, please.  It's on the college.  Any vulnerability he senses, he'll exploit.  It's a poker game with this young man.  Don't let him see what you've got.  Hello, Will. Any trouble finding the place?  Will, this is Sean Maguire. Sean, Will Hunting.  Well, let's get started.  Tom.  Five minutes, Sean. Are you okay?  I'll understand if you don't want to meet with him again.  What do you mean \"he didn't talk?\" You sat there for an hour?  Why would he do that?  Oh, what is this? Some kind of staring contest between two kids from the \"old neighborhood?\"        Alexander, I know your theory. The boy is updating, he's strategy stealing...  --But what he's doing, he's attaching an edge to the adjacent vertex. He can always failsafe to either side--  No, there's a limit.  Maker builds \"K\" to the \"N.\" N is three to the K times--  Alexander, your theory is changed.  We're still working together, the boy's a little rough.  Was I exaggerating in nineteen eighty- four when I told you I'd win the Field's medal within two years?  At ease, gentlemen. We're looking carefully at all our options.  Not at all.  Pleasure to meet you.  You're here quite a bit, then.  You moved?  Seems like it's going well.  Well, have you talked to him at all about his future?  Maybe you should. My phone's been ringing off the hook with job offers.  Cutting edge mathematics. Think tanks. The kind of place where a mind like Will's is given free reign.  Sean, I really don't think you understand--  Excuse me, Timmy. Could you help us? We're trying to settle a bet.  Have you heard of Jonas Salk?  You've heard of Albert Einstein?  How about Gerald Lambeau? Ever heard of him?  Okay thank you, Timmy.  I did.  This isn't about me. I'm nothing compared to this young man. Sean, in 1905 there were hundreds of Professors who were renowned for their study of the universe. But it was a 26-year-old Swiss Patent clerk, doing physics in his spare time, who changed the world, Sean. Can you imagine if Einstein had given that up? Or gotten drunk with his buddies in Vienna every night? All of us would have lost something. And I'm quite sure Timmy never would have heard of him.  No, Sean. This boy has that gift. He just hasn't got the direction. We can give that to him.  Who?  You see, Sean? That's exactly not the point. No one remembers that. They--  Well, you're the only one.  This boy can make contributions to the world. We can help him do that.  Look, I don't know what else I can say.  I'm not sitting at home every night, twisting my mustache and hatching a plan to ruin the boy's life. But it's important to start early. I was doing advanced mathematics at eighteen and it still took me twenty-three years to do something worthy of a Field's medal.  Sean, this is important. And it's above personal rivalry--  No, no you hear me out, Sean. This young man is a true prodigy--  Look, you took one road and I took another. That's fine.  That's a wonderful theory, Sean. It worked wonders for you.  Sean, I came here today out of courtesy.  I wanted to keep you in the loop. As we speak the boy is in a meeting I set up for him over at Tri-tech.     This is correct. I see you used Mclullen here--  --This can't be right. This is going to be very embarrassing. Have you ever considered--  That's fine, but did you ever think--  Will, what happened at the Tri-tech meeting?  Will, on your own time, you can do what you like. When I set up a meeting, with my associates, and you don't show up it reflects poorly on me.  I'll cancel every meeting right now. I'll give you a job myself. I just wanted you to see what was out there.  The least you can do is show me a little appreciation.  Sure, then you'd have more time to sit around and get drunk. Think of how many fights you could have been in by now.  You're right, Will. I can't do that proof and you can. And when it comes to this there are only twenty people in the world that can tell the difference between you and me. But I'm one of them.  So am I. Yes. That's right, Will. Most days I wish I never met you. Because then I could sleep at night. I wouldn't have to walk around with the knowledge that someone like you was out there. And I wouldn't have to watch you throw it all away.  I can... I'm almost there.  What are you smiling at?  No.  I've got the first part. The rest I can do at home.  Will, the N.S.A. has been calling me just about every hour. They're very excited about how the meeting went.  What I mean, Sean, is that I'm sitting in your office and the boy isn't here. Well, it's ten past three. An hour and ten minutes late. Well, if he doesn't show up and I have to file a report saying he wasn't here and he goes back to jail, it won't be on my conscience, Sean. Fine.  The boy was here. He came in, sat down and we worked together.  He came in, sat down, and we worked together.  This is a disaster! I brought you in here to help me with this boy, not to run him out--  --And confuse him--  And here I am for the second week in a row with my professional reputation at stake--  Ready to falsify documents because you've given him license to walk away from this.  Look Sean, I don't care if you have a rapport with the boy -- I don't care if you have a few laughs -- even at my expense! But don't you dare undermine what I'm trying to do here.  He has a gift and with that gift comes responsibility. And you don't understand that he's at a fragile point--  What problems does he have, Sean, that he is better off as a janitor or in jail or hanging around with--  He can handle the work, he can handle the pressure and he's obviously handled you.  Oh, come on, Sean--  Oh, that's nice--  Now don't do that. Don't you do that! Don't infect him with the idea that it's okay to quit. That it's okay to be a failure, because it's not okay! If you're angry at me for being successful, for being what you could have been--  Yes you are, Sean. You resent me. And I'm not going to apologize for any success that I've had.  Yes you do. You're angry at me for doing what you could have done. Ask yourself if you want Will to feel that way for the rest of his life, to feel like a failure.  Is that what this is about, Sean? The Field's Medal? Do you want me to go home and get it for you? Then will you let the boy--  That's right!  You were smarter than us then and you're smarter than us now! So don't blame me for how your life turned out. It's not my fault.  He won't be a failure!  You're wrong, Sean. I'm where I am today because I was pushed. And because I learned to push myself!  No, that's fine, Will. I was just leaving.    You know, you're no longer required to come here.    Well, that's, I think that's terrific. Congratulations.  I just want you to know... It's been a pleasure.  This job... Do it if it's what you really want.  Yes.    Hello, Sean.  Sean...  So I hear you're taking some time.  Where're you going?  Why there?  Do you know when you'll be back?  I got one of those too.  Sean...  The drinks at those things are free.  How about one now?  Sean, do you have any idea what the odds are against winning the lottery?  About thirty million to one.  About thirty million to one.",
        "M.I.T.": "",
        "Student": "Excuse me, Professor Lambeau?  I'm in your applied theories class. We're all down at the Math and Science building.  I know. We just couldn't wait 'till Monday to find out.  Who proved the theorem.",
        "Chuckie": "Oh my God, I got the most fucked up thing I been meanin' to tell you.  You guys know my cousin Mikey Sullivan?  Well you know how he loves animals right?  Anyway, last week he's drivin' home...    Okay. He's driving along and this fuckin' cat jumps in front of his car, and so he hits this cat--  --and he's like \"shit! Motherfucker!\" And he looks in his rearview and sees this cat -- I'm sorry--  So he sees this cat tryin to make it across the street and it's not lookin' so good.  So Mikey's like \"Fuck, I gotta put this thing out of its misery\"--So he gets a hammer--  out of his tool box, and starts chasin' the cat and starts whackin' it with the hammer. You know, tryin' to put the thing out of its misery.  And all the time he's apologizin' to the cat, goin' \"I'm sorry.\" BANG, \"I'm sorry.\" BANG!  And this Samoan guy comes runnin' out of his house and he's like \"What the fuck are you doing to my cat?!\" Mikey's like \"I'm sorry\" --BANG--\" I hit your cat with my truck, and I'm just trying to put it out of it's misery\" -- BANG! And the cat dies. So Mikey's like \"Why don't you come look at the front of the truck.\" 'Cause the other guy's all fuckin flipped out about--  Yeah, so he's like \"Check the front of my truck, I can prove I hit it 'cause there's probably some blood or something\"--  And so they go around to the front of his truck... and there's another cat on the grille.  Is that unbelievable? He brained an innocent cat!  Will!  You're gonna get charged!  Stop brushin' me back!  Casey's bouncin' at a bar up Harvard. We should go there sometime.  I don't know, we'll fuck up some smart kids. You'd prob'ly fit right in.  You could put a pool in that backyard.  What Morgan, you're not gonna go talk to her?  Morgan, I'm not goin' to \"Kelly's Roast Beef\" just cause you like the take-out girl. It's fifteen minutes out of our way.  All right Morgan, fine. I'll tell you why we're not going to \"Kelly's.\" It's because the take-out bitch is a fuckin' idiot. I'm sorry you like her but she's dumb as a post and she has never got our order right, never once.  We're not goin'. I don't even like \"Kelly's.\"     Would you shut the fuck up! I know what you ordered, I was there!  What do you mean \"your sandwich?\" I bought it.  How much money you got?  Well give me your fuckin' change and we'll put your fuckin' sandwich on layaway.  I think you should establish a good line of credit.  Oh motherfucker...  Jesus Christ. Not even close.   No, and we got four of 'em.  Cause fuckin' Morgan's got a crush on her, we always go there and when we get to the window he never says a fuckin' word to her, he never even gets out of the car, and she never gets our order right cause she's the goddamn MISSING LINK!  What do we got?  Shut up.  Morgan, Let's go.    Hey, thanks for comin' out.  When's the arraignment?  You got fired from pushing a broom, you little bitch.  My uncle can probably get you on my demo team.  I told you \"no\" yesterday!  So, this is a Harvard bar, huh? I thought there'd be equations and shit on the wall.  Hey, how's it goin'?  So, you ladies ah, go to school here?  Yeah, cause I think I had a class with you.  Ah, history I think.  Yah, it's not a bad school...  History.  Good, it was all right.  Hey, come on pal we're in classes all day. That's one thing about Harvard never seizes to amaze me, everybody's talkin' about school all the time.  To tell you the truth, I wasn't there much. The class was rather elementary.  All right, are we gonna have a problem?  What'd you get? You get leniency?  You're fuckin' good.  Just submit, Morgan. He's got you in the Cobra Clutch.  Who'd you call?  I didn't get on Cathy last night.  I don't know.  Cathy! Why didn't you give me none of your twat last night?  She's missin' teeth, Will.  Plus, it's like, five to two Morgan ends up marryin' her. There's only so many times you can bang your friend's future wife...  Two weeks? That's nothin'. My Uncle Marty? Will knows him. That guy fuckin' drinks like you've never seen! One night he was drivin' back to his house on I-93 -- Statie pulls him over.  Guy's tryin' to walk the line -- but he can't even fuckin' stand up, and so my uncle's gonna spend a night in jail.  Just then there's this fuckin' BOOM like fifty yards down the road. Some guy's car hit a tree.  Yeah, he was probably drunker than my Uncle, who fuckin' knows? So the cop goes \"Stay here\" And he goes runnin' down the highway to deal with the other crash. So, my Uncle Marty's standin' on the side of the road for a little while, and he's so fuckin' lit, that he forgets what he's waitin' for. So he goes, \"Fuck it.\" He gets in his car and drives home.  So in the morning, there's a knock on the door it's the Statie. So my Uncle's like, \"Is there a problem?\" And the Statie's like \"I pulled you over and you took off.\"  And my Uncle's like \"I never seen you before in my life, I been home all night with my kids.\" And Statie's like \"Let me get in your garage!\" So he's like \"All right, fine.\" He takes around the garage and opens the door -- and the Statie's cruiser is in my Uncle's garage.  No, he was so hammered that he drove the police cruiser home. Fuckin' lights and everything!  The fuckin' Trooper was so embarrassed he didn't do anything. The fuckin' guy had been drivin' around in my Uncle's car all night lookin' for the house.  It's a good thing no one's Irish here.  I'm glad you came by, changed my opinion of Harvard people.  What do I look like, Al Cowlins? You want to take my car, drop her off?  You're walkin' bitch, Will's takin' the car.  Don't get too slap-happy, you're takin' me home first.  Just 'cause you don't have to sleep in the one room palace, don't start thinkin' you're bad.  Yeah, not tonight. Not any other night.  Since this is obviously not my first time in such altercations, let me say this:  Look, we can do this the easy way or the hard way.  At the current time I am looking at a number of different fields from which to disseminate which offer is most pursuant aid to my benefit. What do you want? What do I want? What does anybody want? Leniency.  --These circumstances are mitigated. Right now. They're mitigated.  He knows what I'm talking about.  A retainer. Nobody in this town works without a retainer. You think you can find someone who does, you have my blessin'. But I think we all know that person isn't going to represent you as well as I can.  Retainer...  Allegedly, what I am saying is your situation will be concurrently improved if I had two hundred sheets in my pocket right now.  Come now... what do you think I am, a juvenile? You don't got any money on you right now. You think I'm gonna take a check?  That's right, you know. He knows.       Get it, ma!    How you doin'?  How'd you know where to find me?  Oh, right.  Get in here, Chuckie!    What? No. This is my mother's house. I don't live with my mother. I just stop by, help out. I'm good like that.  She'll live. If she starts yelling again I might have to run in real quick and beat her with the stick again but...  Let's take a walk.     You caught that, huh?  Well, I don't have no trousers on...  I know why you're here. Will don't talk much.  I really don't know what to say. Look, I lie to women all the time. That's just my way. Last week Morgan brought these girls down from Roslindale. I told them I was a cosmonaut. They believed me. But Will's not usually like that--  Take it easy father!  All I can say is; I known Will a long time -- And I seen him with every girl he's ever been with. But I've never seen him like this before, ever with anyone, like how he is with you.  Yeah, it is.     Morgan, if you're watchin' pornos in my mom's room again I'm gonna give you a fuckin' beatin'!  Why don't you beat off at your house?  How's the woman?  What?  Sorry, brother. I don't know what to tell ya. You know all the girls I been with. You been with 'em too, except for Cheryl McGovern which was a big mistake on your part brother...  Some shows are worth the price of admission, partner.  My fuckin' back is killin' me.  Suck my crank. Fuckin' sheet metal pussy. So, when are you done with those meetin's?  Are they hookin' you up with a job?  Yah, but it's better than this shit. At least you'd make some nice bank.  It's a way outta here.  Look, you're my best friend, so don't take this the wrong way, but in 20 years, if you're livin' next door to me, comin' over watchin' the fuckin' Patriots' games and still workin' construction, I'll fuckin' kill you. And that's not a threat, that's a fact. I'll fuckin' kill you.  Listen, you got somethin' that none of us have.  Fuck you. You owe it to me. Tomorrow I'm gonna wake up and I'll be fifty and I'll still be doin' this. And that's all right 'cause I'm gonna make a run at it.  But you, you're sittin' on a winning lottery ticket and you're too much of a pussy to cash it in. And that's bullshit 'cause I'd do anything to have what you got! And so would any of these guys. It'd be a fuckin' insult to us if you're still here in twenty years.  Let me tell you what I do know. Every day I come by to pick you up, and we go out drinkin' or whatever and we have a few laughs. But you know what the best part of my day is? The ten seconds before I knock on the door 'cause I let myself think I might get there, and you'd be gone. I'd knock on the door and you wouldn't be there. You just left.  Now, I don't know much. But I know that.  Oh my God, I got the most fucked up thing I been meanin' to tell you.  Oh, Morgan.  No, I had to talk him down.  Little Morgan's got a lot a scrap, dude.  I'd rather fight a big kid, they never fight, everyone's scared of 'em. You know how many people try to whip Morgan's ass every week? Fuckin' kid won't back down.  Shut the fuck up.    Shut up, Morgan. Here's your present.  Yeah, I figured now that you got your big job over in Cambridge, you needed some way to get over there and I knew I wasn't gonna drive you every day...  Morgan wanted to get you a \"T\" pass.  But you're twenty-one now, so--  Me and Bill scraped together the parts, worked on it. Morgan was out panhandlin' every day.  Guy's been up my ass for two years about a fuckin' job. I had to let him help with the car.  Fuck you. I re-built the engine myself.  That thing could make it to Hawaii if you wanted it to.  Happy 21, Will.",
        "Cathy": "Fuck you and your Irish curse, Chuckie!",
        "Morgan": "--That isn't funny--  You guys are fuckin' sick.   Jesus.   No! Ugh!  Yah, that is a nice ass.  That fuckin' guinea, Will knows him.  Fuck this, let's get something to eat...  Fuck her.    What else we gonna do we can't spare fifteen minutes?  She's not stupid.  Double Burger.    I, I had a Kelly's Double Burger.  So why don't you give me my sandwich?    I told you, I just got change.  Why you gotta be an asshole Chuckie?  Did she get my Double Burger?  I don't got a crush on her.  Come on, Will...  No, why didn't you fight him at the park if you wanted to? I'm not goin' now, I'm eatin' my snack.  I'm serious Chuckie, I ain't goin'.  What happened? You got fired, huh?    Yah, that was different. Management was restructurin'--  Fuck you, you fat fuck.  What the fuck? I just asked you for a job yesterday!  My boy's wicked smart.  There goes that fuckin' Barney right now, with his fuckin' \"skiin' trip.\" We should'a kicked that dude's ass.      What are you, retarded? You went all the way out there in the rain and you didn't have the number?  Why don't we get off mothers, I just got off yours.  Keep fuckin' with me. Watch what happens.  Watch what happens.  Will, I can't believe you brought Skylar here when we're all wrecked. What's she gonna think about us?  Oh great, tell her that! Now she really thinks we're problem drinkers!  Some other guy?  Holy shit.  Did your Uncle get arrested?  I'm Irish.  Chuck, let's go.    I don't have a VCR at my house.  Save it for your mother, funny guy. We heard it before.    You thought we forgot, didn't you? I know I'm gettin' my licks in.  No I didn't...  Fuck you, I did the body work. Whose fuckin' router you think sanded out all that bondo?  Had one, now I'm fucked again.",
        "Billy": "Fuckin' Chuckie!   Like it can understand.  No! Ugh!  Who's that? She's got a nice ass.  Who's she talking to?  He's a pretty big kid.  You gotta' be kiddin' me. Why do we even go to her?  Yah, restructurin' the amount of retards they had workin' for them.  Least I work for a livin'. Why'd you get fired?  Submit, bitch! Submit! Submit!  Oh, Morgan!  You're a pretty funny guy. Here, have a nickel.  All right, then.  I've been shit faced for like two weeks.  Yeah, now that you can drink legally, we thought the best thing to get you was a car.",
        "Will": "Chuckie, what the fuck happened?  It's walkin' pretty slow at this point.   Watching his cat get brained.  --or a tail--    No! Ugh!  You think I'm afraid of you, you big fuck? You're crowdin' the plate.  Stop crowdin the plate!  What are we gonna do up there?  Fuck you.  Yah, Bobby Champa. He used to beat the shit outta' me in Kindergarten.  Yah, he's the same size now as he was in Kindergarten.  I could go for a Whopper.  She's sharp as a marble.  She didn't do it again did she?  Jesus, that's really bad, did anyone even order a Flyin' Fish?  Well, she out did herself today...  I don't know yet.    (smiling, good naturedly      Yeah, you're all invited over to Morgan's house for a complementary fish sandwich.    Get the fuck off me!  Next week.  Oh, I'm sorry.    Hey fuck you.  Yeah, Morgan. I got fired.  Management was restructurin'.  Of course that's your contention. You're a first year grad student. You just finished some Marxian historian, Pete Garrison prob'ly, and so naturally that's what you believe until next month when you get to James Lemon and get convinced that Virginia and Pennsylvania were strongly entrepreneurial and capitalist back in 1740. That'll last until sometime in your second year, then you'll be in here regurgitating Gordon Wood about the Pre-revolutionary utopia and the capital-forming effects of military mobilization.  \"Wood drastically underestimates the impact of social distinctions predicated upon wealth, especially inherited wealth...\" You got that from \"Work in Essex County,\" Page 421, right? Do you have any thoughts of your own on the subject or were you just gonna plagiarize the whole book for me?  Look, don't try to pass yourself off as some kind of an intellect at the expense of my friend just to impress these girls.  The sad thing is, in about 50 years you might start doin' some thinkin' on your own and by then you'll realize there are only two certainties in life.  One, don't do that.  Two -- you dropped a hundred and fifty grand on an education you coulda' picked up for a dollar fifty in late charges at the Public Library.     If you change your mind, I'll be over by the bar.  What?  I'm Will.  I kind of got that impression.  I didn't mean you. Listen, maybe...  Great, or maybe we could go somewhere and just eat a bunch of caramels.  When you think about it, it's just as arbitrary as drinking coffee.  Five minutes.  I was trying to be smooth. But at twelve-fifteen I was gonna come over there and talk to you.  The caramel thing is my pick-up line.  Hold up.  Hey!        There is a lengthy legal precedent, Your Honor, going back to 1789, whereby a defendant may claim self- defense against an agent of the government where the act is shown to be a defense against tyranny, a defense of liberty--  Henry Ward Beecher proclaimed, in his Proverbs From Plymouth Pulpit back in 1887, that \"Every American citizen is by birth, a sworn officer of the state.  Every man is a policeman.\" As for the other officers, even William Congrave said; \"he that first cries out 'stop thief' is 'oft he that has stolen the treasure.\"     Julius Caesar proclaimed -- Though he be wounded-- \"Magna...\"  How many?  Hey, Skylar?  It's Will, the really funny good looking guy you met at the bar?  Okay, you got me. It's the ugly, obnoxious, toothless loser who got drunk and wouldn't leave you alone all night.  Yeah, I figured maybe sometime this week we could go to a cafe and have some caramels.  You aren't, by any chance, Pre-law? Are you?  Fuck do you want?    What're those?  If I agree to this, I walk right now?  I'll do the work. I'm not going to meet with a therapist.  Probation, counselin', few days a week.     That's why I love stock-car racin'. That Dale Ernhart's real good.  I could work the pit maybe, but I could never drive like Dale Ernhart--  Yeah, I read your book. \"Mike\" had the same problems as \"Chad\" the stockbroker.  You're right. I know.  No, but, I mean you know... I do other things. That no one knows about.  I go places, I interact.  Certain, clubs. Like, Paradise. It's not bad.  It's just that feeling when you can take your shirt off and really dance. When the music owns you. Do you understand?  Do you find it hard to hide the fact that you're gay?  C'mon, I read your book. I talked to you. It's just something I know to be true.  Buddy, two seconds ago you were ready to give me a jump.  I'm sure you do. You probably got a real nice house, nice car -- your book's a best seller.  Look, man. I don't care if you're putting from the rough. There are solid arguments that some of the greatest people in history were gay; Alexander the Great, Caesar, Shakespeare, Oscar Wilde, Napoleon, Gertrude Stein, not to mention Danny Terrio, not many straight men can dance like that.  If you wanna hit \"Ramrod,\" take your shot. Take some pride in it. You go to church? So fuckin' what, God loves you.  I mean, Christ. A guy as well known as you? By the time you put your disguise on and skulk out of the house Sunday nights you probably look like \"Inspector Clouseau.\"  You're getting defensive... Henry. And hey, chief -- tell the wife, at least.  Christ, set her free.  Fuckin' hypocrite...  Of course.  It's an integer proof.  What? Hey, look buddy my time's almost up. You want me to sit here for an hour and write it out?  Look, I'll give you the key steps to it but I'm not gonna do the whole thing.  I think so.  You color-code it. Half-red, half- black.  If that's an integer--  Half-red, half-black--  --Half-red, half-black--  An integer.  Yeah, when do I get my hypnosis? You guys been talkin' for twenty minutes.  Seven.  Somethin's in my room.  It's like a small figure, hoverin' over me. Gettin' closer.  It's touching me.  Down there. And I'm nervous.  'Cause I'm not ready. But the figure tells me everything's gonna be all right. 'Cause the figure's a Libra too. And we start dancin' and it's beautiful--   Oh, come on! You're not pinnin' this one on me. He left, I wanted to talk to him for another twenty minutes. I was havin' fun.  C'mon, that guy was a fuckin' piece of work.    Okay... don't forget to get another therapist for next week.  I bet your parents were happy to pay.  Is Harvard gettin' all that money?  So you just want to use me and go?  In that case, fine. Want to see my magic trick?  Now, I'm gonna make all these caramels disappear.  It works better when I have my rabbit.  No.  I really don't 'date' that much.  No I haven't...    I was kinda' hopin' to get a \"good night laid\" but... I'll take a kiss.  No... I was hoping to get a kiss.  Now?  Hey, look lady, I'm just here for the free food.  Hey, I spent all my money on those caramels.  No.  Yeah, let's let the healing begin.  Did you buy all these books retail, or do you send away for like a \"shrink kit\" that comes with all these volumes included?  Probably not.  Yeah, I read those.  I'm not here for a fuckin' book report.  They're your books, why don't you read 'em?  That must have taken you a long time.    You people baffle me. You spend all this money on beautiful, fancy books-- and they're the wrong fuckin' books.  Whatever blows your hair back.  You're right. It really gets in the way of my jazzercizing.  Do you lift?  Nautilus?  Oh yeah? Me too. What do you bench?  Oh.  You paint this?  No.  This is a real piece of shit.  Poor color composition, lousy use of space. But that shit doesn't really concern me.  The color here, see how dark it is? It's interesting.  I think you're one step away from cutting your ear off.  You ever heard the saying, \"any port in a storm?\"  --Well, maybe that means you.  Maybe you were in the middle of a storm, a big fuckin' storm -- the waves were crashing over the bow, the Goddamned mast was about to snap, and you were crying for the harbor. So you did what you had to do, to get out.  Maybe you became a psychologist.  Maybe you married the wrong woman.  That's it isn't it? You married the wrong woman. She leave you? Was she bangin' someone else?  How are the seas now, D--  Time's up.  At ease, gentlemen.  Not far from here, South Boston.  Pretty boring, I guess.  You know, nothing special.  Do I have a lot of brothers and sisters?  Well, Irish Catholic. What do you think?  You wouldn't believe me if I told you.  I have twelve big brothers.  Yup, you're lookin' at lucky thirteen.  I swear to God.  It was great. There was always someone to play with, give you advice.  'Course I do, they're my brothers.  Marky, Ricky, Danny, Terry, Mikey, Davey, Timmy, Tommy, Joey, Robby, Johnny, and Brian.  All the time. We all live in Southie. I live with three of them now.  We'll do that.  You again. How the paintin' coming?  So what's with this place? You have a swan fetish? Is this something you'd like to talk about?  No.  Why thank you.  No.  No one. I didn't have the number.  No, it was your mother's 900 number. I just ran out of quarters.           How you doin', Krystyn.  Why not?  I'm takin' off.  I'm tired.  You know, I was on this plane once. And I'm sittin' there and the captain comes on and is like \"we'll be cruising at 35,000 feet,\" and does his thing, then he puts the mike down but forgets to turn it off. Then he says \"man, all I want right now is a blow-job and a cup of coffee.\"  So the stewardess goes runnin' up towards the cock-pit to tell him the mike's still on, and this guy in the back of the plane goes \"don't forget the coffee!\"  I know, but the joke's better if I tell it in the first person.  I have been laid you know.  Yeah, I went on a date last week.  Fine.  I don't know.  Haven't called her.  I know what I'm doing. She's different from the other girls I met. We have a really good time. She's smart, beautiful, fun...  Why? So I can realize she's not so smart. That she's boring. You don't get it. Right now she's perfect, I don't want to ruin that.  Why not? You told me every other fuckin' thing. You talk more than any shrink I ever met.  You ever think about gettin' remarried?  Hence, the word remarried.  Well I think that's a wonderful philosophy, Sean. That way you can go through the rest of your life without having to really know anyone.  I'm sorry, I been real busy.  Sorry. I'm sorry. Give me another crack at it. Let me take you out.  Promise?  I couldn't wait till tomorrow.  Didn't your mother ever tell you not to look a gift horse in the mouth?  You're not going into surgery tomorrow are you?  Then let's go have some fun.  Do you still counsel veterans? I read your book last night.  Why not?  Is that why you didn't write anything else?  Well, I've read you colleagues. Your book was good, Sean. All those guys were in your platoon?  What happened to that guy from Kentucky?  Do you ever wonder what your life would be like if you never met your wife?  You don't regret meetin' your wife?  When did you know she was the one?  Where were you?  You missed Pudge Fisk's homerun to have a drink with a woman you had never met?  So wait a minute. The Red Sox haven't won a World Series since nineteen eighteen, you slept out for tickets, games gonna start in twenty minutes, in walks a girl you never seen before, and you give your ticket away?  I don't care if Helen of Troy walked into that bar! That's game six of the World Series!  And what kind of friends are these? They let you get away with that?  \"I gotta go see about a girl\"? What did they say?  You're kiddin' me.  Would have been nice to catch that game though.  But I can always go to the other side.  Look, I wrote it down.  It's just simpler this way.  'Cause it's nicer than my place.  Exactly.  They don't come over here that much.  Aah, it's kind of a hike.  All right, all right. We'll go.  Sometime. I don't know. Next week.  I'd say... It's only four in the mornin', they're prob'ly up.  Then on behalf of my wiener, I'd like to ask for an advance.  Yeah, Morgan. It's a real rarity that we'd be out drinkin'.  I don't know what the fuck you're doin'.  You're givin' us a ride.  I was countin' on it.  Thanks, Chuck.  I don't know, Chuck. It's kinda outta the way.  Not tonight.  They're all sleepin' now. Let me get those keys.  How's it goin'?  Want me to take a look?  C'mon, give me a peek and we'll go to the battin' cages.  Why is it important to you? If I inherited all that money, the only thing important to me would be workin' on my swing.  You're rich. What do you have to worry about?  Instead you're going to bust your ass for five years so you can be broke?  I guess. I don't know. How do you remember your phone number?  Some, a little.  I guess so.  Like me?  Do you play the piano?  I'm trying to explain it to you. So you play the piano. When you look at the keys, you see music, you see Mozart.  Well all right, Beethoven. He looked at a piano and saw music. The fuckin' guy was deaf when he composed the Ode to Joy. They had to turn him around to take a bow because he couldn't hear the crowd going crazy behind him. Stone deaf. He saw all of that music in his head.  Not a lick. I look at a piano and I see black and white keys, three pedals and a box of wood. Beethoven, Mozart, they looked at it and it just made sense to them. They saw a piano and they could play. I couldn't paint you a picture, I probably can't hit the ball out of Fenway Park and I can't play the piano--  When it came to stuff like that I could always just play.  !!! !  I don't know what it's called.  I'm pretty sure it's right.    It's right. Take it home with you.  I couldn't go 'cause I had a date. So I sent my chief negotiator.  Then don't set up any more meetings.  Maybe I don't want to spend my life sittin' around and explaining shit to people.     Well, I'm sorry.  No.  What?  How do you know that?  Yeah, but how do you know?  And you're sure about that?  'Cause that's a serious thing you're sayin'. I mean, we might be in California next week and you could find out somethin' about me that you don't like. And you might feel like \"hey this is a big mistake.\" But you can't take it back, 'cause you know it's real serious and you can't take somethin' like that back. Now I'm in California, 'cause you asked me to come. But you don't really want me there. And I'm stuck in California with someone who really doesn't want me there and just wishes they had a take-back.  I can't go out to California.  One, because I have a job here and two because I live here--  I'm not sayin' I'm not in love with you.  What do you mean \"What am I afraid of?\"  What am I scared of?  Don't tell me about my world. You're the one that's afraid. You just want to have your little fling with the guy from the other side of town and marry--  some prick from Stanford that your parents will approve of. Then you'll sit around with the rest of the upper crust kids and talk about how you went slummin' too.  At least you have a mother.  What the fuck am I afraid of?!  I'm not honest?  Oh, is that what this is about? You want to hear that I don't really have any brothers? That I'm a fuckin' orphan? Is that what you want to hear?  No, you don't want to hear that.  You don't want to hear that I got cigarettes put out on me when I was a little kid. That this isn't surgery.  You don't want to hear that. Don't tell me you want to hear that shit!!  What, you want to come in here and save me? Is that what you want to do? Do I have a sign that says \"save me\" on my back?  Don't bullshit me! Don't fuckin' bullshit me!  I don't love you.  So why do you think I should work for the National Security Agency?  Codebreaking.  Come on, that's what you do. You handle more than eighty percent of the intelligence workload. You're seven times the size of the C.I.A.  Why shouldn't I work for the National Security Agency? That's a tough one.  I just wanted to call before you left. I'm takin' all these job interviews. So I won't just be a construction worker.  Yeah.  Take care.  It's a Carlton Fisk baseball card.  Pudge Fisk. You follow baseball?  Oh, well, it's just somethin' Sean told me. It's a long story.  You all set?  Yeah.  I don't know.  I guess.  What did I think?  Say I'm working at N.S.A. Somebody puts a code on my desk, something nobody else can break. So I take a shot at it and maybe I break it. And I'm real happy with myself, 'cause I did my job well.  But maybe that code was the location of some rebel army in North Africa or the Middle East. Once they have that location, they bomb the village where the rebels were hiding and fifteen hundred people I never had a problem with get killed. Now the politicians are sayin' \"send in the Marines to secure the area\" 'cause they don't give a shit. It won't be their kid over there, gettin' shot. Just like it wasn't them when their number got called, 'cause they were pullin' a tour in the National Guard. It'll be some guy from Southie takin' shrapnel in the ass.  And he comes home to find that the plant he used to work at got exported to the country he just got back from. And the guy who put the shrapnel in his ass got his old job, 'cause he'll work for fifteen cents a day and no bathroom breaks. Meanwhile my buddy from Southie realizes the only reason he was over there was so we could install a government that would sell us oil at a good price. And of course the oil companies used the skirmish to scare up oil prices so they could turn a quick buck. A cute, little ancillary benefit for them but it ain't helping my buddy at two-fifty a gallon. And naturally they're takin' their sweet time bringin' the oil back and maybe even took the liberty of hiring an alcoholic skipper who likes to drink seven and sevens and play slalom with the icebergs and it ain't too long 'til he hits one, spills the oil, and kills all the sea-life in the North Atlantic. So my buddy's out of work and he can't afford to drive so he's got to walk to the job interviews which sucks 'cause the shrapnel in his ass is givin' him chronic hemorrhoids.  And meanwhile he's starvin' 'cause every time he tries to get a bite to eat the only blue-plate special they're servin' is North Atlantic scrod with Quaker State.  So what'd I think?  I'm holdin' out for somethin' better. I figure I'll eliminate the middle man. Why not just shoot my buddy, take his job and give it to his sworn enemy, hike up gas prices, bomb a village, club a baby seal, hit the hash pipe and join the National Guard? Christ, I could be elected President.  What?  Define that.  Yeah.  Shakespeare, Neitzche, Frost, O'Connor, Chaucer, Pope, Kant--  Not to me, they're not.  Not without a heater and some serious smelling salts, no...  Oh, what? You're going to take the professor's side on this?  I didn't want the job.  I didn't ask for this.  Why is it a cop-out? I don't see anythin' wrong with layin' brick, that's somebody's home I'm buildin'. Or fixin' somebody's car, somebody's gonna get to work the next day 'cause of me. There's honor in that.  What?  What?  Fuck you!  Who the fuck are you to lecture me about life? You fuckin' burnout! Where's your \"soul-mate?!\"  Dead! She dies and you just cash in your chips. That's a fuckin' cop- out!  That's right. And you fuckin' lost! And some people would have the sack to lose a big hand like that and still come back and ante up again!  Gone.  She went to Medical school in California.  Oh I'm sure, that's why only one of us has herpes.  Fuck you.  Week after I'm twenty-one.  Yeah, sit in a room and do long division for the next fifty years.  Yeah, be a fuckin' lab rat.  What do I want a way outta here for? I want to live here the rest of my life. I want to be your next door neighbor. I want to take out kids to little league together up Foley Field.  Chuckie, what are you talkin'...  Why is it always this? I owe it to myself? What if I don't want to?  You don't know that.  I can come back.  Well, I'm here. So, is that my problem? I'm afraid of being abandoned? That was easy.  Do you want to talk about it?  What's that?  You're not going to fail me are you?  So what's it say?  No. Have you had any experience with that?  No, have you had any experience with that?       He used to just put a belt, a stick and a wrench on the kitchen table and say \"choose.\"     I used to go with the wrench.  Cause fuck him, that's why.  Is that why me and Skylar broke up?      I know.    Don't fuck with me.         Yeah, my name is Will Hunting. I'm here about a position.  Sorry to miss this.    Why didn't you yoke him?  You're kiddin' me.  You're kiddin' me. This is the ugliest fuckin' car I ever seen in my life.    So, you finally got a job Morgan?    Over at Tri-tech. One of the jobs Professor Lambeau set me up with. I haven't told him yet, but I talked to my new boss over there and he seemed like a nice guy.  Yeah, I think so.  Thanks you. So, that's it? We're done?  I just want you to know, Sean...  I'll keep in touch.  Thanks you, Sean.    See ya.  Hey, how you doin'?  I was just sayin' goodbye to Sean.  Thank you.  Bullshit.  I appreciate that.  Hey, Gerry.  Listen, I'll be nearby so, if you need some help, or you get stuck again, don't be afraid to give me a call.",
        "Krystyn": "Hi, Will.",
        "Tom": "I called Mel Weintraub this morning, to check for availability.  What do you want to do?  Who is he?  !!! !  What should I do?  Okay."
    },
    "imdb_rating": "8.3",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BOTI0MzcxMTYtZDVkMy00NjY1LTgyMTYtZmUxN2M3NmQ2NWJhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,9,380,562_.jpg",
    "description": "A touching tale of a wayward young man who struggles to find his identity, living in a world where he can solve any problem, except the one brewing deep within himself, until one day he meets his soul mate who opens his mind and his heart.—Dima & Danielle",
    "name": "Good Will Hunting",
    "genres": [
        "Drama",
        "Romance"
    ]
}