{
    "filename": "Grabbers_script.txt",
    "imdb_id": "tt1525366",
    "imdb_url": "https://www.imdb.com/title/tt1525366",
    "characters": [
        "Tadhg Murphy",
        "Dr. Jim Gleeson",
        "First Mate Roy",
        "Garda Ciarán O'Shea",
        "Skipper",
        "Deckhand Greg",
        "Paddy Barrett",
        "Declan Cooney",
        "Daly",
        "Una Maher",
        "Garda Lisa Nolan",
        "Brian Maher",
        "Irene Murphy",
        "Dr. Adam Smith",
        "Sergeant Kenefick"
    ],
    "dialogues": {
        "Tadhg": "He's a biggun.  Then what is it?  Oh ya bastard, Paddy!      Ya knew it was gonna do that.  Eurgh, the smell.  I dunno, it's a feckin octopus or something, it's covered in seaweed. But 'tis no feckin' lobster!  I'm watching this.  What?    Irene?  Someone's at the door.  All right, all right.  It's that bloody Declan Cooney and he's pissed as a fart.  Cooney, you look like death.   What are you doing?    Cooney?   Are you all right, mate?  Cooney?",
        "Murphy": "",
        "Skipper": "... Yeah.  Secure the lines.    Definitely something ...  Roy!  Can you see him?!  Don't lose him!  Roy! Don't panic, mate.     Swim for the buoy!  Put it on.  Just do it, boy.  Radio a mayday! Move!   C'mon, Roy, mate. Fight.",
        "Deckhand": "",
        "Greg": "You can't be serious?  Every bloody night.  Ye cheated! There's five aces!    I counted 'em!  Not so funny now, huh?  ... Shite.  C'mon, Roy, kick!  What happened?     Jesus Christ!    Skipper?  Oh Jesus.    Oh Jesus.   Oh Jes--",
        "Paddy": "Take a look at this.  He's not a lobster.  I didn't.    On me life.  So what is it?  An octopus?          Wouldn't you like to know?  But you would, though.  You would! If you were to know what I know you'd want to know.  Right, between you and me, I caught meself a sea monster today.  Swear to God, may he strike me down. Ya don't believe me?  I'm no liar!  Feck off, you.  In me bathtub.  Having a bath.  Ignorant gobshite.  Hmm?  Nothin'.   Didn't open me mouth.    Ah I'm joking, you know that.   One more, huh?             You dirty ...  Bastard.  So I get a reward for discovering it, right? A finders fee?  But I get something, right?  A Grabber.  I discovered it.      I get to name it.    A Grabber.  Stuck on the ceiling, it was. Like a pancake. Nearly ripped me throat out.  'Tis dead.  It spits like a frog and strangles ya. Whippet fast, and sharp.  It's gotta be worth a fortune.  I stood on it a few times.  Could you put it on the eBay, do ya think?  How can you tell?  Holy Christ, wait till I tell ya!  What?   What's wrong with ya?  Come look for yourself.      How am I supposed to wash meself?     It's the letter zed!  Tadhg Murphy got a look of it when I brought it in. It gawked on him, but that was it.  Why?  Are you serious?  Mostly bollocks.  It was raining! When it rains there's no such thing as dry land.  It'll piss it down.  The black rock caves. I caught the female just beyond there.    We're here.  Tides coming in. Another hour and this place will be under water.  You can be sure of it.  Mother of God.  The eggs are buried on the beach! There's feckin' loads of 'em!  Well done.  See ya later, lads.  They're hatching.  I woulda helped but I've a bad back, gives me shocking pain, you know yourself.  Diet and exercise.  I was always lucky.  Slow down for fuck sake.    Are we for real?    Are YOU for real? Show him.  Can you drink it?  Feck that.     A waste of whiskey.  It takes years of practice.  -- you've got a hooley.  It's gonna rain any minute.  Saturday night.  Oh it was a big one.  I also had a snifter of ...  A little home brew.  A bird never flew on one wing.  Ah come off it, this could save all our lives yet.  There ya go, pet.  You will in me shit.  I've got a hurley and a pellet gun.  Shoot pellets. But I don't have any pellets.  A water pistol? This thing likes the water.  Ya all right?  Ya haven't touched your pint.    Ya gonna finish it?  We're what?!  No!    NO!  I was just gettin' a taste for it.    Right you are! I'm sick of your bollocks.  Feck your photos, change the kegs! What? He's flutered, sure he'll be fine. G'wan, Smith! Fine fella y'are!  A Grabber.  He flew?!  Jumpers.  They jump.  It's the female. It's following her scent. Sure didn't she slime you in the lab? Like with me bathroom and Tadhg Murphy.  A mating ritual.  It'll try to mount you, somehow. Failing that it'll most likely rip you limb from limb in frustration.  What if we threw a bomb at it?  Not on me, no.  I vote we feed it Father Potts. Unless it eats shit it'll choke to death.  Feck, is he in here? I was joking, Father. I apologise.    A Grabber?  You think you can catch that thing?  You might not get past them, but someone else could.  What?   Feck off!   Brian should go.  She's a goner.  I got it. If its you it wants, then we give it what it wants. We fashion a dummy, dress it up like bait and confuse the shite out of it. It won't know where to look when there's two of you.  What is she doing at all?  Yoohoo! Come and get me, you rotten bastard!  Good luck, boy.  Jumpers.",
        "Barrett": "",
        "Declan": "",
        "Cooney": "Nah, just stripping an oil tank. This place is a death trap sure.  Where's Kenifick?  Why?    What's up?  What kinda things?  That'll do, boys.    Pack it up.  Don't forget the shovels.     Daly?",
        "Daly": "Now that is one arresting woman.    I got 'em.  -- What in the name of...?",
        "Una": "Sparks flying there, huh.  Do you like her?  You should talk to her.  God, ye're all the same.  Listen to you. Eight years I was waiting for him to get down on his knee. Have ya ever heard the like of it? My family thought I was mad wasting me time on him.  Ah feck you, Brian.  Good morning. Sleep well?  Oh yeah.   The big one.  Oh, there's a storm coming.  No, it's on the telly.  So, you're working with O'Shea?  He's a nice fella isn't he?    Quite a catch.  Single? So's O'Shea. Well, widowed.  Why do you think he's here? Sure there's no want for him round this neck of the woods but I suppose he wanted the peace. Or his superiors thought he did. He doesn't say, God love him.  So will you be sticking to the same room all week? Because we have a few doubles. There's more room in those, you know yourself.  Are you sure now? You never know if you want to stretch your legs later on. Give it a week and we'll be booked solid, so we will.  What's going on here then?  Looks like you're plotting something.  Huh. Carry on.  You're throwing a party?  Why?  A welcome party? But you're leaving in a fortnight.  You only just got here.    What was that?  I have a drink.  I've drunk enough.    Mother of Jesus!  A precaution to what?  This party isn't for me, is it, Brian?! You lied to me!  What thing?    Oh my God!  It's not gonna stop, is it? We won't survive the night. We're on a sinking ship.  We can't just sit here. It'll bring the walls down around us.  Or electrocute it?   I don't know.  If we can't destroy it, what can we do?  What do you mean?  Sure 'tis lepping about all over the shop.  You can't go downstairs, those things will tear you to pieces.  Not a hope.  Look what they've done to the carpets!  Love, you're not that fast.  I love that song.  Do you smell smoke?  Come on!",
        "Maher": "",
        "Brian": "We do indeed.  Ah leave him off, Una.  Ah feck them.  Same again?  I tell you what though if I weren't, you know, I'd be up them stairs like a shot.  Ha!  He called you a gobshite.  Fine.   You're barred.  What?  Are ye for real?  That? Sure you could kill that with a hammer.    How do you know?  It's filled with?  Just discussing something.  Great. It's her birthday next week now she thinks this is something for her.  If those things do come for us, we'd be lambs to the slaughter if bombed out of our brains.  What night was last night?  Comin' right up.  She's langers.  What's that?  You bring potcheen into my bar?  I'll take that.  If you're right, this will kill it?  We'll have to do shots. Properly tear the arse out of it.    It's Fr Potts last mass, so everyone that didn't leave yesterday for the thing in Dungary.  What?!  C.P.S. forty-one hundred pump action twin jet Super Soaker. Shoots twenty feet. The nephew's.  It's a water pistol if you use water. Fill it with petrol and you've got a flamethrower.  How's the heart, Mamie?    Both for you?  Right, right. Are you sure?  Grand, grand. C'mere Hilda, you're looking well. Did you lose weight?  Yeah, yeah. How much would you say you lost? Would I be right in thinking you're around fourteen stone?  No? Fifteen? Yeah, I better go with fifteen to be safe.  Base to Patrol. O'Shea we're running short here. We're dry on four taps and out of spirits and wines. Over.      Merciful shit.  Smith!  Smith, the lighter!  Hurry!  Smith!   Light me!  Nearly. Put the other light away. ... Stall on now. That's it ...  Almost there.  All right you ugly bollocks, have some of this shit!  Ahh, Christ!  What was what?  Here, honey, have a drink.  Have two.  It's nobody, honey.    Unless someone goes outside to change the kegs, we're done drinking for the night.    I'll give ya angina.    Outside, now! I claim ya!    It's just linen and cleaning stuff. Nothing we can really use.  Yep.  It's swinging one of Tommy Riordan's sheep at the door.  Too drunk to drive a car but not drunk enough. We're sobering up. All of us.  Have you got semtex on you?  How about we like push it off a cliff or something.  You'd need some sort of...?  They'd be in the kitchen.     On the table, I think.  She's right.  I could try...  You missed.  How are you gonna get to the truck?  You gotta go now.  We can't wait, son.  Run, O'Shea, run!  Let's bury the hatchet, Paddy... into the heads of those feckin' things!",
        "Irene": "Tadhg, you're stinking. Would you get in the bath already, I can smell you from here.      I said 'tis ... nothing. I don't know why we had to move here. There was nothing wrong with me Mam's house.  What was that?  What?  I'm not dressed.  Don't give that cowboy any money. He'll only piss it up the wall.  What does he want?  Jesus.  Tadhg!    Tadhg!  Honey?    Oh God. Oh God.",
        "Sergeant": "",
        "Kenefick": ""
    },
    "imdb_rating": "6.3",
    "description": "Police officer Lisa Nolan comes to Aran Island, Ireland, to take charge during a colleague's two-week holiday. Simultaneously, blood-thirsty, sea-dwelling aliens arrive at the quiet island to propagate. As dead whales wash up on shore and people start mysteriously disappearing, officers and a few locals slowly discover their peril along with one sure defense - high blood alcohol levels, which the aliens can't stomach. As a storm approaches, enabling hungry hatchlings access to the locals, an open bar kicks off a desperate bid for survival as inebriated police and friends stagger to remain cognizant long enough to thwart the alien invasion.—statmanjeff",
    "name": "Grabbers",
    "genres": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjIzMjE4NTY2Nl5BMl5BanBnXkFtZTcwNTM1NTk4OQ@@._V1_QL75_UY281_CR1,0,190,281_.jpg"
}