{
    "filename": "Gran-Torino_script.txt",
    "imdb_id": "tt1205489",
    "imdb_url": "https://www.imdb.com/title/tt1205489",
    "characters": [
        "Karen Kowalski",
        "Tim Kennedy",
        "Ashley Kowalski",
        "Barber Martin",
        "Grandma",
        "Walt Kowalski",
        "Vu",
        "Youa",
        "Father Janovich",
        "Trey (as Scott Reeves)",
        "Mitch Kowalski",
        "Sue",
        "Kor Khue",
        "Thao",
        "Steve Kowalski"
    ],
    "dialogues": {
        "Karen": "Yes you.  At least he didn't say anything this time.  Well, what do you expect? The man worked at a Ford plant for twenty- eight years.  Here's one from me. KAREN slides over a another wrapped gift. Walt opens it. It's a PHONE with really big numbers for old people. 42.  It's a phone.  I just thought... we thought that it would... make things easier.  There's nothing wrong with making things less hard on yourself.  There's these great places now, these communities where you don't have to worry about mowing the lawn or shoveling snow. People who are like you, alert, active, but are alone and would benefit by being with other folks their own age. 43.  I know, you were right.  Well, we tried. Now we can just drop it. No one can say we didn't try.  Well, pick it up.  Mitch?  He's your father. Ashley hands him the phone and he pushes the TALK button.  See you later, I'm taking the kids to the mall. Mitch never looks up from the TV.  I will. We hear Karen and the kids exit.",
        "Kowalski": "",
        "Tim": "",
        "Kennedy": "Shitty, but who's gonna listen?  Help yourself, Walt, you dumb Pollack.  What do we got, Walt?  You sure?  You speak English?  You born here? 86.  You got a vehicle? I see Walt drove you here.  The bus? Jesus Christ, you don't have a car?  I just replaced the tranny in my Tahoe and the sons a bitches fucked me hard, just under $3200.  You got that right. Come on in on Monday and we'll find something for you to do. Tao puts out his hand to shake.  It's Tim. What's your name again?  Okay. You owe me one, Walt.  Fuck the fruitcake, why don't you hand over the keys to that Gran Torino.  I bet.",
        "Ashley": "How long do we have to stay, this ghetto is a dead zone for my cell and I'm bored. Walt stands behind them with an armful of folding chairs, he overheard his Granddaughter. Mitch and Karen are embarrassed.  Me?  Grandpa Walt, can I help you with the chairs.  Wow, Grandpa, when'd you get the vintage car? Walt looks at her for a second, then steps on her still burning cigarette before answering.  I never knew you had a cool old car.  So, what are you like going to do with it like, when... you die? Walt lights up a smoke --  Then what about that super cool retro couch in the den, I'm going to State next year and I don't have, like, any furniture? Walt walks out without commenting.  It's Grandpa Walt.  You talk to him.",
        "Barber": "There, you look like a human being again. You shouldn't wait so long between haircuts, you cheap bastard.  That'll be ten dollars, Walt.  It's been ten bucks for the last five years and you know it, you thick-skulled, old Pollack son of a bitch.  See you in three weeks, you prick.            Oh great, a Pollack and a chink. 81.  Walt, you cheap asshole, I should have known you'd come in, I was having such a pleasant day.  Who's the Nip?  What, do you have shit in your ears?  Get outta my shop before I blow your head off, you long-haired faggy little gook! Tao is terrified, frozen stiff. Walt and the Barber throw their heads back and laugh. The Barber lowers the shotgun.  Kid, you shoulda just started with Hi' or Hello.'  Yeah. Be polite, but don't kiss ass.  Right. Son of a bitch, I just got my brakes fixed and those sons a bitches really nailed me. Screwed me right in the ass.  Or, my old lady bitches to me for two fucking hours about how they don't take expired coupons at the grocery store and the minute I turn on the goddamned game, she starts crying how we never talk.  Sweet Jesus, I shoulda blown his head off when I had the chance.       There, all done. Ten bucks American.  You? A straight shave? You've never ordered a straight shave, ever.  No, no. That's fine. Let me heat up a towel. Walt hands Martin the Barber a twenty.",
        "Martin": "",
        "Grandma": "",
        "Walt": "Thanks for coming, Al. Walt Kowalski looks young for his age. He has slate blue eyes, physically fit and has had the same buzz cut hairstyle since getting out of the military in 1953. Walt is also a perfectionist. Nothing escapes his hawklike eyes, eyes that pierce and judge. Walt looks around at how the young people have dressed at his wife's funeral. His eyes narrow at his GRANDDAUGHTER's belly button ring.  Jesus Christ. Walt's two sons, MITCH and STEVE, watch their father from across the pews.  Jesus. Walt coughs. He takes a handkerchief and wipes his lips. He looks down and notices a speck of BLOOD on the white cloth.     Yeah, well, I s'pose they knew there'd be plenty of ham. I think I'll go downstairs and get some more chairs.  Naw, we need them now, not next week.  I'll take care of it, you just painted your nails. Walt opens the folding chairs and looks out the window. It's snowing. Walt puts on his coat, he almost looks relieved to get out of the house.  I'd better salt the sidewalk before someone falls and breaks a hip. Walt taps the floor with his boot and DAISY, his very, very, very old DOG follows him outside. 4.       Jesus Christ, how many swamp rats can they cram into a living room? Walt spits in the snow and walks back to the garage.     It's only been in here since before you were born. 5.   Jesus, Joseph and Mary. Walt pulls the cover back over the Gran Torino.      Who the hell are you?  What?! Speak up, boy, get the shit out of your mouth. What do you want?  No. And have some goddamned respect, zipper head, we're mourning over here. Walt slams the door in Tao's face. Walt turns and is suddenly cornered by Father Janovich. Walt hates situations like this. 6.  Mr. Kowalski.  It's Mr. Kowalski, not Walt.  I appreciate your kindness to my wife and now that you've spoken your piece, why don't you move on to the next sheep? Walt starts to step away, but Father Janovich blocks him.  Is that so?  Well, I confess I never much liked church and only went because of the wife. And I confess I have no desire to confess to a boy who is fresh out of the seminary. 7.       Fine. Go.  Kill you to buy American.      Barbarians. Goddamned barbarians.  I thought these zips were supposed to be such hard workers. Christ, I had my own car when I was his age.       Damn chinks let their yards go to hell. Polarski would turn over in his grave if he could see what they did to his lawn. Tao walks past. Walt watches him pass.  I don't know why these goddamned slopes had to move to my block. This used to be a nice neighborhood.        Jesus Christ, dog, have you gone totally deaf? Walt opens the door. Standing on his front step is Father Janovich.  Listen, son, you're not my barber, you're not a friend, so why in the hell do you think you can call me Walt?  So, what are you peddling now?  Okay. You've done your good deed, now why don't you run along.  I don't think so, kid. Sorry.  You don't want to know.  The problem is I think you're an overeducated, 27-year-old virgin who holds the hands of superstitious old women and promises them eternity. 13.  I got one. A Mexican, a Jew and a colored guy walk into a bar, the bartender looks up at them and says -- get the fuck out.' The gang laughs, until they see Father Janovich step up to the bar. He smiles as he recognizes several faces.  I have to hand it to you, Padre. You are persistent.  Oh Jesus Christ, let's grab a booth.  I'll have a Pabst and a shot. What are you having, Father?  Bullshit, this is a bar, what do you want to drink? 19.  Attaboy. The waitress leaves.  So, what do you want?  Jesus Christ, why'd you do that?  You sure are fond of promising people stuff you can't deliver on.  Like what?  What would you know about it?  You stand at the altar and preach on and on about life and death without knowing anything other than what you learned in priest school. Everything you say sounds like it's out of the Rookie Preachers Handbook.  Death is bittersweet? Bitter in the pain, sweet in the salvation.' That's what you know of life and death? Good God, it's pathetic.  Plenty. I lived with death for three years in Korea. We shot people, we stabbed them with bayonets, we hacked seventeen-year- old kids to death with shovels, for Christ's sake. I did things that won't leave me till the day I die, horrible things, things I have to live with.  Well... I survived the war... got married... and raised a family.  Maybe so.       Daisy? The dog sleeps in her bed in the corner. Walt looks at the clock; it's 3:48 am. Walt looks out his bedroom window. He sees the faint beam of a flashlight in his garage. 21.  Son of a bitch. Walt pulls on his robe, opens the closet and pulls out the big, 30-06 M1 Garand Rifle he took home from Korea. Walt slides a magazine into the top of the M1 and chambers a round with a loud SNAP.  Shit.  Hello?  It's one in the afternoon. The CAMERA now INTERCUTS BETWEEN Walt and Mitch in the kitchen of his huge, modern suburban house. 23.  So, what do you want?  I don't know. Your wife already went through all of your mother's jewelry.  Nope.  Yup. There's a very painful pause in the conversation.  Uh-huh.                          Get off my lawn.  I said get off my lawn. Now. Walt's calm demeanor is unnerving to the gangbangers. The guns in their hands seem tiny compared to the big military rifle Walt holds.  Get off my lawn.  Don't think for a second I won't blow a big hole in your face and it won't bother me a bit, not any more than if I shot a deer. Now get off my goddamned lawn. Two of the Hmong gangbangers take a step back. Walt senses their fear. Only Smokie holds his ground.  Believe me, kid, I'll blow your damn head off, go back to bed and sleep like a baby. I couldn't care less.  You're nothing to me. In Korea, we stacked fucks like you five feet high and used you as sandbags. 28.  I said get off my lawn.            Bad dog. Bad deaf, dumb, blind dog. 29.       No. No more. The Hmong couple nod, say something with a smile and turn around.  Why won't these people leave me alone? Walt walks out to meet them at his property line and puts up his hands, indicating they've come far enough. Sue holds up a plant.  I don't want them.  No. You keep them. Why do you people keep giving me all this garbage? Sue is a little taken aback. 30.   No, I didn't. All I did was get a bunch of jabbering gooks off my lawn.  No, I'm not.  Just take your plant and leave me alone. Walt turns and starts to walk away. Tao's mother speaks rapidly in Hmong to Sue. They look at Tao and then to Walt.  What?  So?  For what? 31.  Get this straight, I see you on my property again, you're done. Walt turns on his heels and storms into his house.       I already told you I'm not going to confession.  Pardon?  Oh, I prayed for them to show up, but guess what? No answer.  Not that it's any of your goddamned business, but when things happen quickly like that, you have to react. In Korea, we never called the police' when a swarm of screaming gooks came pouring into our lines. We reacted.  I'm impressed. You came with your guns loaded, for once.  You have balls, Father. And what you said, you're right. I'm sure stronger men than me have found their salvation. Hallelujah. But there's one thing you're way wrong about. 33.  The thing that haunts a guy is the stuff he wasn't ordered to do.  I'm just amazed that you're still alive. I keep hoping you'll die and they'll get someone good in here, but you just hang in there, you dumb, Italian-Wop-Dago, you.  Ten dollars? Jesus Christ, Martin, you keep raising the price. You sure you're not part Jew? Martin the Barber laughs at Walt.  Here's ten, keep the change.  If you live that long, dipshit. Walt and Martin shake hands and Walt walks out. 34.  You... and your buddies. What's the matter with you? Don't any of you work? I see you lazy show- offs in the middle of the day, slowly walking across the street or harassing women. Nobody owes you bastards anything so go out and get a job instead of pushing little girls around, for Christ's sake.  What makes you spooks think you can bully a couple kids with impunity?  Look at me, Slick. You're crazy if you thinking I'm fooling around.  You have to be pretty goddamned dumb to think you can push people around without running into someone who will push back. The black guys are a bit dumbfounded. Walt stares them down.  But you might just be dumb enough not to recognize that your luck just ran out. All bravado drains away from the black guys. Walt is a rock. Walt grins slightly and spits on the ground.  Go home, clown... and pull up your goddamned pants. Walt turns to Sue.  Come on, I'll give you a ride. 38.       What in the hell's the matter with you? I thought all you Asian girls were supposed to be so smart. What are you doing walking around in that neighborhood? That's how you end up in the obituaries, that is, if they can identify your body once they pull it out of the goddamned river.  So, that goofball back there. He's your boyfriend?  Why in the hell would you go out with a clown like that. Why don't you date one of your... own...one of those other... Hu-mungs.  Right. Hmong. What is a... where is Hmong or whatever? Sue laughs.  Then why are you in my neighborhood, instead of back there?  Why'd you pick the Midwest, for Christ's sake? There's snow on the ground near half the year. Jungle people on the frozen tundra?  Whatever.  Still, you'd think the cold would keep all the assholes away. Sue laughs again at Walt's conscienceless racism.  Sure... You know, you seem okay. What the hell's the matter with your half-wit brother? He a little slow or something? 40.  Oh, poor Toad.       Old hag, giving me the evil eye? Walt opens the paper to the TV guide section and lingers at the HOROSCOPES for a second.  Aw, what the hell... Walt reads aloud to himself.  Your birthday today; This year you have to make a choice between two life paths. Second chances come your way. Extraordinary events culminate in what might seem to be an anti-climax. Your lucky numbers are: 84, 23, 11, 78 and 99. Walt drains his coffee and tosses the paper onto the porch.  What a load of crap. Walt lights up a cigarette and exhales. Walt watches as the only white woman on the block struggles to unload her groceries from her car. One of her bags rips. 41.  Christ all Friday. What's wrong with kids today? Walt gets up to go help, but before he can get to the sidewalk, another neighbor has gone over to help... It's TAO. Tao bends down and carries her bags up to her door.  Well, I'll be damned.       What is it?     Yeah, I see that.             We miss Momma, don't we, Daisy. A vehicle pulls up to Tao's house. A party is in full swing. Sue comes out and helps the Hmong women unload big platters of food and carry them to the house. Sue catches Walt's gaze and steps over to his porch.  What do you think?  I'll bet. Just keep your paws off my dog.  Really?  I'm fine right here. Walt reaches into the cooler for another beer. It's empty, just water and ice.  Son of a bitch. 45.  A piece of cake and some beef jerky.  Oh, what the hell. It's my birthday, I may as well drink with strangers instead of myself. Walt gets up and walks with Sue towards her house.  Don't call me Wally.  You do have a lot of beer, but no Pabst.  Ha ha. Are you sure it's okay I'm here? Everyone keeps looking at me and when I look back, they look at the ground.  What'd she say?  No she didn't.  She hates me.  What did I do? A little Hmong girl walks past and Walt pats her on the head. Everyone in the room looks in horror at Walt.  What?! What the hell are all you fish heads looking at?! Sue looks around and then pulls Walt out of the room.  That's dumb, but fine.  Swell. Anything else?  Good God, you people are all nuts.  Hey, Sue.  You said you guys don't look you in the eye, but that guy keeps staring at me. Sue laughs and gestures to the Old Hmong Man. The Old Hmong Man steps over and nods to Walt. 48.  Witch doctor? Sue smiles and nods.  Boo-ga, boo-ga. Kor Khue says something to Sue in Hmong. She turns and translates to Walt.  Huh?  Tell Kor to be my guest, fire away. Sue speaks Hmong to the Shaman. The Shaman responds and sits down across from Walt. He looks at Walt for a long time. Walt stares straight back at him. The Shaman mumbles to himself. Finally the Shaman turns to Sue and speaks very rapidly. As Sue translates, the Shaman watches Walt's reaction.  Excuse me. Walt gets up and steps into the kitchen. He takes several deep breaths. He's pretty shook up.  Je -- zuz -- Christ. Walt looks around at all the Hmongs eating and carrying on. Walt sees a young man give up his seat to an Elder. Walt sees a young woman go to each of the older folks and offer tea and cookies from a tray. Walt sees a child help an old man out of the bathroom. Walt coughs hard. He wipes blood from his lips. Sue comes in and looks at Walt.   Son of a bitch. I've got more in common with these goddamned gooks than my own spoiled-rotten family. 50.  Happy birthday. Walt opens the bathroom door. Sue stands there with a concerned look on her face.  Me? I'm fine.  I just bit my tongue. I'm fine. I'm great. Let's get some of that gook food, I'm starving.  Why?  I'm fine right here. I'm mingling.  Oh great.  What's-his-name who tried to steal my Gran Torino.  Yeah, Toad. Tao is in the corner, he avoids Walt's gaze. Sue walks over to a group of boys, leaving Walt alone. Walt doesn't know what to do with himself. He leans against the DRYER. The DRYER wobbles. Walt gets on his hands and knees. He looks under the dryer. He adjusts the short leg to balance out the machine. He just can't help it. All the Hmong kids watch Walt, trying not to laugh at this strange white man on his hands and knees fixing a dryer during a party. Walt looks up -- deer in the headlights.  It was wobbly, but I fixed it. It's fine now, shouldn't wobble anymore. The Hmong kids look away, covering their mouths with their hands. Walt glares at Tao, who immediately wipes the smile from his face. Sue walks over and hands Walt a drink.  What's this? 52.   Alright. Sue walks off. Walt sips his rice liquor and watches the interaction between the boys and girls. One particularly gorgeous young willow-wisp of a GIRL stares across the room at Tao. Tao looks back at her, but then looks away. The Girl keeps looking at Tao, smiling and twisting her hair. Tao doesn't approach her, but three other young men do. They do their best to charm her. She's polite, but not interested, she keeps looking at Tao. Walt laughs at Tao's ineptitude, shakes his head at this wasted opportunity. Suddenly the Girl steps over to Walt. She smiles --  Good question. What am I doing here? Anyways, I'm Walt.  Wa Yum?  Me? Not too much... I fix stuff I guess.  Well, I fixed my wife's friend's sink yesterday. 53.  That's one thing I've never been accused of. A bastard, yes. Funny, no. Wa Xam laughs.  A pleasure to meet you, Yum Yum. She laughs at Walt butchering her name and goes upstairs. The three young suitors follow her up. Tao watches her. Walt comes over to Tao, who is startled. Walt laughs.  Relax, zipper head, whatta you think I'm gonna do, shoot you? Tao looks like he wants to run away.  I wouldn't say anything either, if I was you. Walt sips his rice liquor. Walt can't help but rib Tao.  You know, I knew you were a dipshit even before the whole garage deal, but I have to say you're even worse with women than you are stealing cars, Toad.  What's that?     Good for you. Anyways, you're blowing it with that girl. Not that I give two shits about a Toad like you.  Wrong, egg roll. I completely know what I'm talking about. I know I'm not always the most pleasant person to be around, but I got the greatest woman who ever lived to marry me. I had to work at it, but I got her and it was the best thing that ever happened to me. Hands down. Walt points across the room. He sways slightly.  But you? You just sit there and watch as Ding Dong and Click Clack and Charlie Chan walk away with what's-her-face. She likes you, you know.  She was standing over there, orange dress, twisting her hair and smiling at you.  Yeah, yeah. Anyways, she likes you, I know, I talked to her. Great girl, charming girl. Love her. I love Yum Yum. But you? You just watch her walk out the door with the Three Stooges. Why? Because you're a big fat pussy! Walt drains his drink. 55.  I gotta go home. Good luck, puss- cake. You need it.       No. No thanks. No more flowers. The elderly Hmong Women nod and speak rapid sentences in Hmong to Walt. He has no idea what they are saying.  No more. Please, keep your flowers. The Hmong women nod, smile and chatter away, ignoring Walt. They walk past him and set the BOUQUETS on his porch.          What now, Gee? Gee holds up a plate covered with tinfoil.  No. Forget it. Stop bringing me stuff. Gee scolds Walt in Hmong.  No. I've had it. Gee opens the corner of the tinfoil. Walt looks at the food. 56.  I can't. You have to stop. Gee pulls the tinfoil off. Walt gazes at the food.  Is that the chicken dumpling thing you brought the other day?       What now? What? Vu rambles on in Hmong. Walt looks at his watch. He looks at Sue for the translation.  No he's not.  No. The kid is useless, I don't even want him on my property. I thought we already went over that.  How is this all of a sudden turned around on me? The goddamned kid tries to steal my car and somehow I'm the bad guy if I don't accept? 57.  Fine. Great. Tomorrow. Walt walks past them and into his house.  Jesus, Joseph and Mary. These Hmong broads are like badgers.       Son of a bitch, I didn't think he'd show. Walt waves Tao over. Tao barely looks at Walt.  Okay. What are you good at?  That's what I'm asking. What are you good at? 58.  That's about what I expected. Okay, why don't you go over by the spruce tree and count how many birds feed at the bird feeder.  Yeah, you can count? You slopes are supposed to be good at math, right?       No.  I want it done right, that's why.  Scaring away crows. Tao shoots Walt a dirty look. 59.     It's a perfect job for you, plus you people don't seem to mind squinting in the sun all day.       Don't get flip with me, zipper head. I ain't the one who tried to steal and don't forget it.  That I know. You have no teeth, kid. That's your problem. You have no balls.  Because unlike you I'm not useless. I maintain my property, whereas you swamp rats let your houses go to hell. Walt looks across the street at one very dilapidated house.  Wait a minute... How long do I have you for? Tao pauses... he doesn't want to answer.  How long, Toad? 60.  Go get my ladder out of the garage.  When you're done caulking the siding, nail that gutter back up, I can see it right out my kitchen window, it's been bugging me for three years. The neighbor says something in Hmong to Walt.  You said it, brother.        I don't see why not.  Tell him sometime after lunch.                 Jesus Lord almighty, knock it off.  Take the day off, you've done enough. 62.  Toad. Tao turns around. Walt wants to say something, but stops.  Nothing, never mind. Walt shuts the door.  That's right.  Wait a minute. Where's my regular doctor, where's Dr. Fellman? 63.  Jesus Christ.  Hello? It's me... Dad.  Um... not much, how about you?  Fine. That's fine... How about the kids and Karen? 64.  Good. There is a long, uncomfortable pause. Walt looks at some Xeroxed medical pamphlets scattered on his bed.  Well, that's good... How's... work?  Right. I s'pose.  No. Nope. Another pause.  Okay then.  Sure.       Hey, moron. Tao is startled and almost falls off the ladder.  I appreciate you're doing something on your own, but you're the only person I know dumb enough to get himself killed trimming tree branches.  You don't stand on the top step of a ladder and if you cut through that branch you're hacking away at, you'll end up kaput. Tao looks and sure enough -- a thick, black POWER LINE is five feet below the branch he's almost severed.  Go grab the extension ladder from my garage and I'll show you how to do it right, zipper head.  Looks good. Good job. Tao nods. 66.   Make sure you put the ladder back when you're done raking up the leaves.  This kid doesn't have a chance. The Honda now slowly passes Walt's house. Walt just stands there, sipping his beer. The Honda slows to a stop and the gangbangers glare at Walt. The REAR WINDOW of the Honda opens. Walt holds out his RIGHT HAND like a GUN. He closes one eye to better aim his imaginary gun and moves his thumb several times as if firing. Bang -- bang -- bang. The Honda takes off. Walt watches it drive off and lights another cigarette. Walt doesn't notice, but Tao witnessed this whole interaction from his yard.       For the love of Pete.  It must be a hundred degrees in here, turn on the fan. Tao flips the switch on the CEILING FAN, the fan wobbles and shakes, it looks like it's about to fly off. Walt stares up at the fan and shakes his head.       What are you talking about?  Where the hell do you think I got them, Toad? This may come as a shock to a thief, but I actually bought the things I have with money I earned.  You need the right tool for the right job. Every single thing here has a purpose. 68.   Post hole digger. Tao starts pointing at things on the workbench in quick succession, questioning Walt with his expression.  Hand spade. Tin snips. Nail punch. Tack hammer. Putty knife. Wire stripper. Drywall saw. Tile spacers. Silence. Walt can see something is bothering Tao, but he's too uncomfortable to speak up --  What?  I didn't buy all this stuff at once, blockhead. I've lived here for fifty years. A man stays in one place long enough he tends to attract a decent set of tools.  Look, kid, I think I know where you're going with this. You don't need everything to maintain a house. I'm going to let you in on a little secret. Walt rattles around his tool bench and slaps down THREE items in quick succession.  This is for you. Roll of duct tape, can of WD-40 and a pair of vise-grips. Any man who's worth a shit can do half his household jobs with these three things. In the odd chance that doesn't work out, you can borrow something. 69.  What's with what?  So... what exactly was the deal with those guys out on my lawn that night? Who are they?  I gathered that. What did they want with you?  You joined up with those pukes? Damn, you are a pussy. Why in the hell did you do that?  Well, at least you're honest about it. A LONG SILENCE. Walt finishes fixing the ceiling fan. 70.  So how'd you blow your first initiation? Tao nods towards the GRAN TORINO.  The Gran Torino? Tao nods. Walt laughs.  Christ all Friday.       Hello? It's me, Dad... Walt.  Well... I... um... I'm getting the old Westinghouse up out of the basement. Mitch mouths the word Shit.  So... I got it on the dolly.  Yeah... And it's a bit heavy... for one guy.  Yeah... I need a hand.  So are you busy?  Well... Yeah, I'd like to get on it. 72.  Giving it to Aunt Mary.  She's eighty-one.  To freeze food. Mitch opens another beer.  Uh-huh.  Your brother lives out of state.  Okay then.  You got a minute, Toad?       I just need a little push. All the weight is up top, so you stay down and give me a little shove at each step.  Naw, I got it.  I'm not crippled. I got it.  Listen, zipper head, now's not the time to go and...  Okay then, be my guest. Just don't let it slip out of your little girl hands and crush me. Tao laughs.       Yeah, but it runs like new. They don't make them like that anymore.  Sell it. I haven't used it in years and it was always in the way down there.  Oh, I don't know. Sixty bucks, maybe. Why, you need a freezer?  Twenty-five and it's yours.  Save me from wasting money on putting an ad in the paper. 75.       What?  It seems like justice to me. And if he misses a spot, he's doing it all over.  I ain't a role model.  Don't call me Wally.  I'm old school.  What's that supposed to mean? Sue shrugs him off. They look at Tao for awhile. 76.   Him? Don't be crazy. He tried to steal my car.  Hey. Watch the language.  Hand me a beer, Dragon Lady. Sue hands him a beer and Walt pops the top.  So tell me the problem with Hmong boys again. I'm not completely clear.  Why?  Not sure. No.  The girls go to college and the boys go to jail.  You still going out with that clown?  Good girl.       Is that why I see you out in your garden all the time? Besides, zipper head, we ain't in Hu-Mong.  So is joining a gang, you dipshit. 78.  So, you ever think about what you want to do with your life?  You've never thought about it?  Well, while you're thinking about it, try not to stomp all over my chives, you dipshit. Tao looks down; sure enough, he's standing on Walt's chives.  Put some mulch around the cucumbers. Tao spreads more mulch.  My oldest son's a salesman. He sells cars.  License to steal. I worked in a Ford plant for thirty years and my son sells goddamned Japanese cars.  That's right. And I put the steering column in the Gran Torino when it rolled down the line in 1972.  It is, isn't it?  How are you going about getting into sales? You thinking about school?  Well, you should.  Maybe you should get a job and save instead of spreading mulch in my garden.  That's funny.  Good question. Who the hell would hire you?  Aw, go on. I'm kidding. You could get a job, easy. 80.  I'd think about construction.  Naw, you could hack it. You just need a little adjustment.  That's exactly the point. I know some guys in the trades, but you have to get your shit together. We have to man you up a bit.  Yes. And you should ask out Yum Yum too.  You have to learn how guys talk. Now watch how me and Martin communicate. We just throw it back and forth. You ready?  Okay, let's go in. Walt holds the door for Tao and they enter. The Barber has his feet up reading a Playboy.  Afternoon, Martin, you dumb Italian prick.  Why, did you jew some blind man out of a few bucks, give him the wrong change? Walt and the Barber shake hands warmly. Tao is wide- eyed.  This is Tao. He's a pussy kid who lives next door and I'm trying to man him up a little. Walt points at Tao.  Did you see? That's how men talk to each other.  Okay. You go out, come back in and give it a try.  I said go out there, come back in and talk to the barber like a man. Do it. Tao shrugs, goes outside, lets the door shut then comes back in. The Barber stands there with a sneer on his face. 82.  Jesus Christ, Toad, you don't walk in and insult a guy. What are you, an idiot?  Not if you never met the guy. If you say that shit to the wrong stranger, they'll blow your goddamned gook head off! Walt and the Barber laugh again.  Anything but that.  Right. You should have said, Excuse me, I'm looking for a haircut if you have time.'  Or, even better is act like you just got off a construction job. 83.  Exactly. Don't swear at the guy you're talking to, swear about another guy who ain't there. My son of a bitch prick fucking boss made me work overtime and he knew I had bowling tonight.  See? You come back in, Toad. Be polite and then you bring up something you can both talk about. It ain't rocket science.  Just go back outside and try it again. And don't mention you're a pussy with no car, girl, job, future or whatever. Come in and act like a man, Toad. Tao goes out, turns around and comes back in.          If you do this, you're going to follow through, right?  No, not yeah, yeah. Yes, as in yes, sir, I'll do my best.  You better, because when I vouch for someone, it's my word and I don't want anyone making me look bad.  And don't lay down to people all the time. Always look a person in the eye. When you shake a man's hand, you can usually tell where you stand with him. Walt hands a pair of beat-up WORK GLOVES to Tao.  Here, stuff these in your back pocket.  Just don't blow this. 85.  Kennedy, you drunken Irish goon, how the hell are ya?  Not me. Walt pours himself a cup of the bad job-site coffee.  I already did. This is the kid I told you about. Tao, this is Tim Kennedy, he's the super on the job. Kennedy looks Tao up and down. Tao looks him in the eye.  He's done construction here and there. Whatever you need, he'll pick it up quick.  Sure.  I'll send you a fucking fruitcake at Christmas. 87.  Yeah, everybody seems to want that car.  You don't know the half of it. Come on, zipper head, let's let this big Mick get back to screwing off. Walt and Tao exit and walk back to the truck.  What are you gonna put all your tools in, an empty rice bag?  You'll need this. Walt then tosses Tao a utility knife holder.  And you'll need that. Now where the hell do they hide the hardware holders?  I'll get it, but you're paying me back with your first check. 88.  And you need this too. That should about do it.  Tools I got, but I ain't loaning you my tool belt. You can buy tools as you go.  Aw, forget it.       Hey there. Tao looks to the ground and heads in the other direction.  Wait a minute. Where have you been, I haven't seen you in days?  What in the hell happened to you?  Don't worry about it? Look at your goddamned face!  When?  Cowards.  Forget the tools. Where does your cousin live?  Alright. You need any other tools for work?  Go in the garage and get whatever you need.       That's the last of them. Walt pulls out his Colt .45 automatic and chambers a round.  You aren't that hard to track down. Walt boots him again. Smokie curls up in the fetal position.  I came to give you a chance. SOMETHING comes out of the shadows under the porch. Walt swings the barrel of the big Colt .45 at the movement. It's a cat. Walt puts his pistol away. Smokie exhales.  It's just you and me. Nobody knows or has to know I was here. You lay off Tao. Tell your guys he ain't worth it or whatever the hell you want. You don't talk to him, you don't go near him. This is your one chance. You lay off and no one will ever be the wiser. Smokie says nothing.  I'll take that as a yes. I don't want to come back here. But if I do, believe me, it'll be goddamned ugly. Walt kicks Smokie again and stalks off into the dark. 93.            How do you want your dog... I mean steaks cooked? Medium, medium well?  Is this Hmoog or Laab?  Isn't it usually a little spicier? Tao, Wa Xam and Sue laugh.  It does. Usually it's got more zing.  What? 94.   Aw, go on.  Well, who wouldn't? I'm surrounded by beautiful women, it's a beautiful day. Great food, good friends. Hell, even Toad isn't driving me nuts for once.  I'm just kidding. Let me tell you something, Yum-Yum. If Tao doesn't ask you out soon, I will.  I'll be damned. Movie? Dinner? Wa Xam and Tao nod. They're a bit embarrassed.  The bus?! That's no good. A charming young lady like this deserves to go in style. 95.  Sure. Why not.  Really. They shake hands.       Is everyone okay? Is anyone hit? Sue? Vu? Tao, where's Tao? Tao sits up from behind the couch. Blood pours down his neck. He's stunned.  Oh no. Walt lays Tao down and rips open the collar of his shirt. Walt probes around Tao's neck. 96.  Hang on... you're just cut, is all.  Yeah. Walt looks around at the BULLET HOLES in the walls. Tao follows his gaze.  They aimed high. Sure enough -- most of the bullet holes are above head level on the walls.  Where's Sue?  Call her.  I said call her. Get the goddamned phone and call and see if she's there. Tao scrambles for the phone and dials. Tao speaks Hmong to whomever answered. Tao starts to speak faster. He looks at Walt and shakes his head no. For once -- Vu and Phong understand what Walt was talking about. There is anguish on every face in the room.  This is exactly what I didn't want. Damn gooks. Why the hell am I even here?  In Korea I learned not to care. The best friends of my life are still missing somewhere in Korea. You harden yourself. Don't let anything get to you. Phong looks out the window and screams. She runs over and swings open the door. Everyone expects the worst... And it comes like a cold wind -- SUE WALKS IN LIKE A ZOMBIE. She has been brutally beaten. Her clothes are dirty and torn. BLOOD runs down SUE'S legs from under her shirt. Walt looks at her and the glass falls from his hand. Sue staggers into Vu's arms. Vu weeps. Sue hugs her mother and sobs. Tao reaches to hug his sister, but Phong screeches at him, pointing at Walt and back to Tao. Walt is destroyed. He steps outside into the dark.       No, no, no, no, no. 98.        Come on in. Father Janovich comes in and sits down across from Walt.  I've noticed that. Father Janovich picks up a photo album and flips through it. Pictures of Mitch and Steve as babies.  You know, there's no way that Tao or Sue are gonna have any peace if these gang guys don't go away. Go away forever. You know it as well as I do.  You heard what I said.  I'm not.  Yeah, well what would you do if you were me? If you were Tao? What would you do? Father Janovich shakes his head.  And you?  Wanna beer?  They're in the cooler, grab me one too. 100.  Nothing's fair, Father. Father Janovich and Walt sit for awhile.  Call me Walt. Father Janovich nods.  Not sure yet. All I do know is they don't have a goddamned chance.       I'm thinking.  I know you don't want to hear this, but you have to calm down.  You have to have a clear head, otherwise mistakes get made. Back away from what's happened, Tao.  Sit down.  I SAID SIT DOWN! Just listen up for a second and don't say anything. Tao sits down. Walt rubs his hands together.  I know what needs to be done. I need to prepare, this needs to be carefully planned. You know I'm the right man for this. So cool down for a little while and meet me back here at 4 P.M. I promise you, what needs to be done, will be done.  And do what? You want to go kill your cousin and those other Zips. Mr. Tough-Guy-All-Of-A-Sudden is out for blood. What do you even know about it? Tao is furious, but says nothing.  Trust me, Tao. Cool down and we'll meet back here at four. Okay? Tao doesn't answer. 102.  I said okay?' You won't do anything without me. You meet me back here at four? Say okay.'  I know, I know. Give me a break, it's the first time I've ever smoked in the house.       I don't suppose you still have steady enough hands to give a guy a straight shave, you withered, old Italian mummy?  That's right. I always wondered what they were like. Unless you're too goddamned busy? 103.  Here's a twenty. Keep the change in case you slip and hit my jugular.  So you can take it in right here?  That's great. Thank you.  Never had a fitted suit.  I've come for confession.  Nothing. Take it easy.  Are you going to let me confess or not?  Forever. Bless me, Father, for I have sinned.  In 1968, I kissed Betty Jablonski at the work Christmas party. Dorothy was talking with the other wives and it just happened.  I made nine hundred dollars profit selling a boat and motor and never reported the taxes which is the same as stealing.  And lastly, I was never close to my two sons. I don't know them. I didn't know how.  Whatta you mean, That's it?' It's bothered me for years. 105.  Is that so?  I gotta go, Padre. Busy day ahead.  I am at peace. Walt and Father Janovich shake hands. Walt exits. Father Janovich exhales loudly and drops into his chair.       You ever fire a weapon? 106.  Put that down. I got something for you.  In Korea, October, 1952. We were sent up to sweep a Chink machine gun nest that had carved us up pretty bad. I was the only one who came back... I received the Silver Star. I want you to have it.  When we went up that hill, we knew it was ten to one against us, but we went anyway. This trouble now, it's similar. We're walking right into it. We might not be coming home tonight.  Don't be a fool, these guys are waiting for that exact reaction. Tao is quiet for a minute.  How many what?  Thirteen for sure. Probably more. 107.  You don't want to know.  Go get the Silver Star. It's in a blue wooden box in the cellar. Tao goes downstairs. He turns on the light and goes into the cellar. Tao locates a BLUE WOODEN BOX and opens it. Tao holds up the MEDAL. He looks at it closely. AND WHAM -- Walt slams the heavy cellar DOOR shut behind him. Walt slides the BOLT LOCK into place with a loud  Quit smashing everything. You'll never get out of there, so just relax.  You want to know how it feels to kill a man? It feels goddamned lousy. And it feels even worse when you get a medal for bravery right after you mowed down some scared kid when he tries to give up. A dumb, scared, little gook, just about your age. I shot him with the same rifle you just held upstairs. 108.  You've come a long way. I'm proud to call you a friend. You have your whole life ahead of you, whereas this is what I do. I finish things. You'd just get in the way. Sorry. Walt goes back upstairs, leaving Tao locked up in his cellar. Tao howls to be let out.       Aw, pipe down, you hag.  Fine, I hate you too. 109.     I need you to watch my dog. Walt holds the leash closer. Phong folds her arms in defiance. Walt exhales loudly. Walt lifts up one of the LEGS OF HER LAWNCHAIR and slips the loop of the leash underneath it so Daisy can't follow him.  Her name is Daisy. Walt bends down on one knee and lovingly pets Daisy. He scratches her belly.  You take it easy, old gal. You good old girl. Walt gets up and walks away without looking back. Phong is stunned; she is silent for once.  Good afternoon, gentlemen.  Never been better.  I think I'll have something different. Walt looks at the liquor display. At the pinnacle of bottles sits a bottle of Johnnie Walker Blue.  Think I'll try that Johnnie Walker Blue Label. 110.  Naw, just having something special. Walt sips his Scotch and nods. It's good.  Why don't you get all the guys the same.  I'm sure. This is too good not to be shared. Walt finishes his Scotch and points for one more. Several regulars hold up their drinks towards Walt.  It's Walt. The key to my front door is under the ceramic turtle. Open the door and go let your brother out of the cellar. I have to go. The line goes dead as Walt hangs up. Sue jumps up out of bed, pulls on some clothes and runs downstairs. Phong blocks her path. Phong grabs Sue by the arms. 111.      Is that all you swamp rats or is there more vermin scurrying in the shadows? Smokie and Spider step out and stand on the porch. Smokie smiles at Walt. Walt spits on the ground.  Shut up, gook. I'm not here to listen to one goddamned syllable of what a shrimp-dicked little baby midget like you has to say. Spider pulls his PISTOL.  That's right, boy. Defend your boyfriend after he or you or whoever rapes a member of your family. Your own blood, for Christ's sake. Go ahead, pull your pistols, just like a bunch of ridiculous miniature toy cowboys. Smokie and several other Hmong gangbangers pull their guns.  You have no honor. You're the scum of the earth and when you're gone, do you think anyone will care? No one will mourn. You won't be missed. All the Hmong are spooked at Walt's absolute lack of fear.  No. Tao is too good for this. You pukes aren't worth one second of his time. Walt slowly puts a CIGARETTE in his mouth. Even this slight movement has the gangbangers waving their PISTOLS around. Walt laughs.  You boys are a little bit jumpy.  No, I think you'd better watch it. Walt looks around. Other than the gangbangers, a small group of people have gathered to watch this showdown.         Anybody got a light? No? I got one. Walt's slight grin fades. He mutters to himself...  Hail Mary, full of grace. Walt reaches into his coat pocket. Six Hmong gangbangers simultaneously level their PISTOLS and FIRE. BULLETS FLY. Walt is struck down. People scream. Walt falls dead. A ZIPPO lighter clutched in his hand. Walt never intended to kill anyone. Self-sacrifice. 115.",
        "Vu": "Shut up. Shut up! Shut up!! Tao looks at the ground. A PAUSE. Walt sees the earnest looks on the Hmong women's faces. Their expression begs Walt. Walt gazes back at Tao. Walt looks disgusted, he exhales loudly...",
        "Youa": "",
        "Father": "Death... is often a bittersweet occasion to us Catholics. Bitter in the pain it causes the deceased ... and their families. Sweet to those who know the salvation that awaits them. And some may ask, what is death. Is it the end? Or is it the beginning? And what is life? What is this thing we call life?  How you holding up, Walt?  Huh?  Right, Mr. Kowalski. Your wife and I became quite close these last few months. She asked that I watch over you when she passed on. I told her I watch out for my entire flock, but she made me promise I'd keep an extra sharp eye on you.  Dorothy mentioned specifically that it was her wish for you to go to confession. She said she couldn't remember the last time you went.  It is. Walt drains his lowball glass.  Hi there, Walt.  Sorry... Mr. Kowalski.  Oh, nothing. Thought I'd drop by and see how you were doing. Haven't seen you in church in awhile.  I'd really like to talk, Mr. Kowalski.  Why? Do you have a problem with me, Mr. Kowalski?  No, I do.  So, here's where my flock congregates when they're not in church. 18.  Hi, Mel. Hey there, Darrel.  Hi, Walt. Walt says nothing. He just sips his beer.  No. I came down to talk to Walt, if that's okay. Mel and Darrel look at Walt. It puts him on the spot.  I promised your wife. Walt looks over at Mel and Darrel and then back at Father Janovich.  I'll have a Diet Coke.  Ummmm... I'll have a gin and tonic.  I promised your wife I'd get you to go to confession.  She was very insistent. She made me.  Let's talk about something else.  Life and death.  I'd like to think I know a lot. I'm a priest.  I don't know about that... 20.  What do you know, Mr. Kowalski?  And what about life? Walt has to think for a second. He struggles with his answer.  Sounds like you know more about death than you do living. Walt downs a shot.  Good afternoon, Walt. Walt's eyes narrow.  I mean, Mr. Kowalski.  Why didn't you just call the police?  I do work with some of the Hmong gangs and I heard there was some trouble in the neighborhood. Why didn't you call the police?  What were you thinking? Someone could have been killed. We're talking life and death here. 32.  We're not in Korea, Mr. Kowalski. Walt says nothing.  I've been thinking about our discussion on life and death. About what you said. About how you carry around the horrible things you were forced to do. Horrible things that won't leave you. It seems that it would do you good to unload some of that burden. Things done during war are terrible, being ordered to kill, killing to save others, killing to save yourself. You're right, those are things I don't know anything about. But I do know about forgiveness. And I've seen a lot of men who have confessed their sins, admitted their guilt and left their burdens behind them. Stronger men than you. Men at war who were ordered to do appalling things and are now at peace. Walt nods. Father Janovich threw a bull's-eye. Almost.  Thank you.  What's that, Mr. Kowalski?  Mr. Kowalski, are you in here?  Are you okay? Walt nods.  The police finally left. No one is talking. One thing about the Hmong, they keep their mouths shut.  What are you saying? 99.  They took Sue to the hospital. She's scared. They're all scared.  I know that. Believe me, they all know that. Tao especially. He's sitting out there staring at your front door. You know what he expects, Mr. Kowalski.  I know what I'd do if I was you, or at least what you think you should do. If I was Tao I guess I'd want vengeance. I'd want to stand shoulder to shoulder with you and kill those guys.  What would I do? I'd come over here and talk to you I guess. I know you're close with these people, but this pisses me off too, Mr. Kowalski. Walt nods.  I'd love one.  Damn all this. It just isn't fair.  So, what are you going to do, Mr. Kowalski?  Alright, what are you going to do, Walt?  Mr. Kowalski, what can I do for you?  Oh Lord Jesus, what have you done?  What are you up to? 104.  How long has it been since your last confession?  What are your sins, my son.  Yes. Go on.  Yes. Fine.  That's it?  God loves and forgives you. Say ten Hail Marys' and five Our Fathers.' Are you going to retaliate for what happened to Sue? Walt says nothing. Father Janovich looks hard at Walt.  I'm going over to that house today, Mr. Kowalski.  It is. And every other day until you see the folly in what you are planning.  Go in peace.  Je -- zuz -- Christ.  I'm telling you. If we're not here, there will be bloodshed.  I'm begging you to stay.  I'm staying.  Walt Kowalski once said to me I didn't know anything about life or death because I was an overeducated, 27-year-old virgin who held the hands of superstitious old women and promised them eternity.' Walt definitely had no problem calling it like he saw it.' But Walt was right. I knew really nothing about life or death until I got to know Walt. And boy, did I learn.",
        "Janovich": "Death... is often a bittersweet occasion to us Catholics. Bitter in the pain it causes the deceased ... and their families. Sweet to those who know the salvation that awaits them. And some may ask, what is death. Is it the end? Or is it the beginning? And what is life? What is this thing we call life?  How you holding up, Walt?  Huh?  Right, Mr. Kowalski. Your wife and I became quite close these last few months. She asked that I watch over you when she passed on. I told her I watch out for my entire flock, but she made me promise I'd keep an extra sharp eye on you.  Dorothy mentioned specifically that it was her wish for you to go to confession. She said she couldn't remember the last time you went.  It is. Walt drains his lowball glass.  Hi there, Walt.  Sorry... Mr. Kowalski.  Oh, nothing. Thought I'd drop by and see how you were doing. Haven't seen you in church in awhile.  I'd really like to talk, Mr. Kowalski.  Why? Do you have a problem with me, Mr. Kowalski?  No, I do.  So, here's where my flock congregates when they're not in church. 18.  Hi, Mel. Hey there, Darrel.  Hi, Walt. Walt says nothing. He just sips his beer.  No. I came down to talk to Walt, if that's okay. Mel and Darrel look at Walt. It puts him on the spot.  I promised your wife. Walt looks over at Mel and Darrel and then back at Father Janovich.  I'll have a Diet Coke.  Ummmm... I'll have a gin and tonic.  I promised your wife I'd get you to go to confession.  She was very insistent. She made me.  Let's talk about something else.  Life and death.  I'd like to think I know a lot. I'm a priest.  I don't know about that... 20.  What do you know, Mr. Kowalski?  And what about life? Walt has to think for a second. He struggles with his answer.  Sounds like you know more about death than you do living. Walt downs a shot.  Good afternoon, Walt. Walt's eyes narrow.  I mean, Mr. Kowalski.  Why didn't you just call the police?  I do work with some of the Hmong gangs and I heard there was some trouble in the neighborhood. Why didn't you call the police?  What were you thinking? Someone could have been killed. We're talking life and death here. 32.  We're not in Korea, Mr. Kowalski. Walt says nothing.  I've been thinking about our discussion on life and death. About what you said. About how you carry around the horrible things you were forced to do. Horrible things that won't leave you. It seems that it would do you good to unload some of that burden. Things done during war are terrible, being ordered to kill, killing to save others, killing to save yourself. You're right, those are things I don't know anything about. But I do know about forgiveness. And I've seen a lot of men who have confessed their sins, admitted their guilt and left their burdens behind them. Stronger men than you. Men at war who were ordered to do appalling things and are now at peace. Walt nods. Father Janovich threw a bull's-eye. Almost.  Thank you.  What's that, Mr. Kowalski?  Mr. Kowalski, are you in here?  Are you okay? Walt nods.  The police finally left. No one is talking. One thing about the Hmong, they keep their mouths shut.  What are you saying? 99.  They took Sue to the hospital. She's scared. They're all scared.  I know that. Believe me, they all know that. Tao especially. He's sitting out there staring at your front door. You know what he expects, Mr. Kowalski.  I know what I'd do if I was you, or at least what you think you should do. If I was Tao I guess I'd want vengeance. I'd want to stand shoulder to shoulder with you and kill those guys.  What would I do? I'd come over here and talk to you I guess. I know you're close with these people, but this pisses me off too, Mr. Kowalski. Walt nods.  I'd love one.  Damn all this. It just isn't fair.  So, what are you going to do, Mr. Kowalski?  Alright, what are you going to do, Walt?  Mr. Kowalski, what can I do for you?  Oh Lord Jesus, what have you done?  What are you up to? 104.  How long has it been since your last confession?  What are your sins, my son.  Yes. Go on.  Yes. Fine.  That's it?  God loves and forgives you. Say ten Hail Marys' and five Our Fathers.' Are you going to retaliate for what happened to Sue? Walt says nothing. Father Janovich looks hard at Walt.  I'm going over to that house today, Mr. Kowalski.  It is. And every other day until you see the folly in what you are planning.  Go in peace.  Je -- zuz -- Christ.  I'm telling you. If we're not here, there will be bloodshed.  I'm begging you to stay.  I'm staying.  Walt Kowalski once said to me I didn't know anything about life or death because I was an overeducated, 27-year-old virgin who held the hands of superstitious old women and promised them eternity.' Walt definitely had no problem calling it like he saw it.' But Walt was right. I knew really nothing about life or death until I got to know Walt. And boy, did I learn.",
        "Mitch": "Look at the Old Man glaring at Ashley. He can't even tone it down at Mom's funeral?  Yeah, well your kid's wearing a Timberwolves jersey. I'm sure Dad appreciates that.  What are we going to do with him? Don't you think he'll get in trouble by himself over in the old neighborhood?  Ha ha.  Ashley, honey. Why don't you help Grandpa Walt with the chairs?  I'd really like to help, Dad, but we have to get the kids home, they're getting restless. Walt just looks at the TOYOTA EMBLEM on the Land Cruiser and then gives Mitch a disgusted glance.  I'll call in a few, see how you're doing. Walt nods and lights a cigarette as they drive off.  Did you see him look at the truck? It's always Rice-Burner this or Jap-Buggy that. Even at Mom's funeral, he can't let it go. 8.   He didn't have to.  And I suppose that's my goddamned fault?  Morning, Dad, it's your number one son, Mitch.  Right, good afternoon, then.  Me? Nothing. What would I want?  No. I was just wondering how you are, what's going on, anything new in the old neighborhood? Walt looks at the bullet hole in his Hamm's Beer sign.  Great. Smooth sailing then?  Well good... Say, Dad?  Do you still know that guy from the plant who has Viking season tickets?  Go ahead, Dad. Open it.  Just open it. Walt opens the package, it's a Gopher Reaching Tool -- the kind that has an alligator clamp so you can pick up objects that have fallen behind the stove, etc. Walt looks at his son and daughter-in-law.  It's a Gopher. It's so you can reach stuff. You know, it makes things easier.  Karen's right, Dad. You've worked hard your whole life. Maybe you should think about taking it a little easier? Walt lights up a cigarette.  And that's another thing, Dad. You should get rid of the coffin nails. Walt says nothing.  And the house, now that Mom's gone, it's got to be a lot to maintain, let alone clean... and you're all alone in here. It's worse than Walt thought. He puffs smoke.  Dad, take a look. We brought some pamphlets.  I told you, I told you this was a bad idea.  Son of a bitch! He just won't let anyone help him.  To hell with him, kicking us out on his birthday?! We should've stayed home with Ashley and Josh. They knew better, they wouldn't even come. The goddamned kids are smarter than we are! Mitch screeches the tires as they take off. Walt waits for them to clear out, before coming out on the porch with a can of Pabst. Daisy comes out and lies at his feet. Walt covers his mouth as he coughs. A dime-sized circle of dark, red blood is left in the palm of his hand. Walt looks at the blood as he takes another sip of beer.       I'm doing bills here.  Hello, Dad.  I know. What's up? The CAMERA INTERCUTS BETWEEN Mitch in his huge kitchen and Walt sitting on the edge of his bed.  I'm fine, fine.  Everyone is fine.  Good.  Busy.  Speaking of busy, I have a lot on my plate right now, unless there's something pressing. Walt looks at a pale, blue pamphlet. Mitch looks at his housekeeping bill.  Okay. Yeah, so it's not a good time right now. Why don't you call me over the weekend.  Okay, it was nice talking to you, bye, Dad. Walt hangs up. He lies down on his bed. 65.       Yeah, fine. Just don't spend too much goddamned money.  Thank God. Finally get the house to myself for once. The PHONE RINGS. Mitch looks at the Caller ID. It says; Dad. Mitch almost doesn't pick it up... 71.  Hello.  Hey, Dad. What's up? The CAMERA INTERCUTS BETWEEN Walt in his small kitchen and Mitch in his huge den.  Uh-huh.  Yeah, that'll help.  Uh-huh.  Oh.  Does it have to be done right this second? It's been down there for years.  Does it work? We were thinking about getting a freezer. What are you going to do with it?  Oh... Can't she give you a hand?  I know, I was joking... What does she need it for?  Yeah, well, I'd love to help you out, Dad, but I'm just walking out the door. I have to bring the kids to the mall. Sorry.  Why don't you call Stevie?  Well, I don't know what to tell you, I'm on my way out. Keys in my hand.  If you can't find anyone by next week, give me a call. Walt nods and hangs up. Mitch hangs up and takes a sip of beer. 73.  Aunt Mary. Like she needs a freezer.",
        "Sue": "What do you want?  Spider'? Is that what he just called you, Fong?  Mentally, I'm way too old for you. I'm going inside. 16.  Yeah, that's exactly what I'm doing, Fong. Sue rolls her eyes and goes inside. Smokie stares at Tao.  Oh really? What's that?  Another big, tough gangbanger with little-man' complex. Smokie leers at Sue. It makes her uncomfortable.  Whatever.  Don't go, Tao.  Run, Tao, run! Sue is slapped to the ground.    Thank you. Walt lowers his rifle and spits on the ground.  We brought you some shallots to plant in your garden.  They're perennials, they come back every year.  Because... because you saved Tao.  Well, you're a hero to the neighborhood.  Too bad, they think you are and that's why they're bringing you the gifts.  There's another thing.  This is my mother, Vu, I'm Sue and this is my brother, Tao. We live next door.  Tao is here to apologize. Sue shoots a hard look at Tao, who shifts uncomfortably.  Great, another asshole with a fetish for Asian girls. God, it gets so old.  My name? It's take your crude, overly obvious come-on to every woman who walks past and cram it.' That's my name.  Oh, of course, right to the stereotype thesaurus. Call me whore' and bitch' in the same sentence. 36.  What, are you gonna hit me now? That'd pretty much complete the picture. The Tall Black Guy pushes Sue hard against the wall.  So, what's with you, you have some sort of savior complex or something?  I know, I know. Take it easy. Walt looks at her for a second. She's not ruffled at all. They drive.  Yeah, kind of, his name is Trey.  You mean, Hmong? We're Hmong, not Hu-mung.  Wow! You're so enlightened. Hmong isn't a place, it's a people. 39.    It's a Vietnam thing. We fought on your side and when America quit, the Communists starting killing the Hmong, so we came over here. Walt is quiet for few seconds.  Hill people. We were hill people, not jungle people. Boo-ga, boo- ga, boo-ga.  Blame the Lutherans. They brought us here.  Thanks for the ride.     Tao is actually really bright, he just doesn't know which direction to go in.  It's really common. Hmong girls over here fit in better, we adjust. The girls go to college, the boys go to jail.  Hey, Walt, what are you up to? Walt points his index finger at the can of Pabst in his hand.  We're having a barbecue. You want to come over?  There's tons of food.  No worries, we only eat cats.  No, I'm kidding, you moron. Come on, come on over. You can be my special guest.  What have you had to eat today, Walt?  Come on over and get something to eat. We've got beer, too. Walt exhales loudly --  Happy Birthday, Wally.  As they say, When in Hmong.  It's fine. Phong appears from the crowd and points at Walt. 46.  She said welcome to our home.  No, she didn't.  Yes, she hates you.  Maybe we should go in the other room.  A lot of the people in this house are very traditional. Number one, never touch a Hmong person on the head, not even a child. Hmong people believe that the soul resides in the head, so don't do that.  Hmong people also consider looking someone in the eye to be rude. That's why everyone looks away when you look at them.  Yeah, some Hmong smile or grin when they're yelled at or get into a confrontation. It's a cultural thing. It expresses embarrassment or insecurity, not that they're laughing at you.  What?  This is Kor Khue. He's the Lor family shaman.  Something like that. The Hmong hold their clan Shaman in very high regards.  Kor Khue is interested in you, he heard what you did. He says he would like to read you.  He wants to read you. Tell you your soul. It'd be rude not to allow him this, it's a great honor.  Kor Khue says that you think you've been disrespected. You do not live your life. Your food has no flavor. You are scared of your past. 49.  Are you okay? Walt brushes past her and goes into the bathroom.     Are you okay?  You were bleeding? Walt smiles disarmingly.  Come on, you glutton, let's go downstairs.  To mingle.  Come on, you said not to leave you alone.' 51.  Well, look who's over there.  My brother Tao.  Rice liquor. Try it.  Tao is here to make amends, he's here to work for you.  Mother says that Tao dishonored the family and now he has to work off his debt. He'll start tomorrow morning.  It's very important to my mother that you accept. It'd be an insult to refuse.  My family is very traditional and it will very much upset them if you don't let Tao repay... Tao interrupts from the sidewalk...  Shut up. Shut up! Shut up!! Tao looks at the ground. A PAUSE. Walt sees the earnest looks on the Hmong women's faces. Their expression begs Walt. Walt gazes back at Tao. Walt looks disgusted, he exhales loudly...  Kind of ironic, huh?  What the hell do you think I'm referring to? Toad washing the car he tried to steal from you.  It's nice of you to kind of look after him like this. He doesn't have any real role models in his life.  You're a good man, Wally. I wish our dad would have been more like you.  No, I'm serious. He was hard on us, really traditional, really old school.  Yeah, but you're American.  You like him, don't you?  And you spend time with him and you teach him how to fix things and you saved him from that fuck cousin of ours and...  And you're a good man.  Hmong girls slip in and out of the culture more easily. Date who we want, stay close to our mothers, but are able to keep a foot on each side of the fence. The boys fall through the cracks.  It's tough. The boys float around. The fathers belong in a totally different world and the boys have no one to turn to. Does that make sense?  The boys don't ask their fathers for advice, because over here, their fathers no longer have the answers. 77.  It's more common than not. Walt reflects on this for awhile, then changes the subject.  No. I dumped him. He was a dim- wit. Walt nods.     Laab.  Oh whatever, Wally.  Jesus Christ, look at you. I've never seen you like this.  Look at you smile, old man. Kicking back, having a good old time. You're sure pleased with yourself today.  No, admit it. You are. You're feeling pretty good, aren't you?  Don't listen to him, Wa Xam. He's a white devil.  Yeah, they're taking the bus.  Hello?  Tao? Tao, are you alright?  What's going on?  Where? Where'd he go?!  No! No, Tao! Sue grabs Tao's legs and hangs on.  No! Don't you dare! Stay away from them, Tao! I don't want anyone else getting hurt.",
        "Kor": "",
        "Khue": "",
        "Thao": "",
        "Steve": "What do you expect? Dad's still living in the 50s. He expects his granddaughter to dress a little more modestly.  My point is that there's nothing anyone can do that won't disappoint the Old Man.    Why don't you have him move in with you?  A lot of people showed up after the service.  I'll do it, Dad."
    },
    "imdb_rating": "8.1",
    "description": "Walt Kowalski (Clint Eastwood) is a widower who holds onto his prejudices despite the changes in his Michigan neighborhood and the world around him. Kowalski is a grumpy, tough-minded, unhappy old man who can't get along with either his kids or his neighbors. He is a Korean War veteran whose prize possession is a 1972 Gran Torino he keeps in mint condition. When his neighbor Thao Lor (Bee Vang), a young Hmong teenager under pressure from his gang member cousin, tries to steal his Gran Torino, Kowalski sets out to reform the youth. Drawn against his will into the life of Thao's family, Kowalski is soon taking steps to protect them from the gangs that infest their neighborhood.—alfiehitchie",
    "name": "Gran Torino",
    "genres": [
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTc5NTk2OTU1Nl5BMl5BanBnXkFtZTcwMDc3NjAwMg@@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}