{
    "filename": "Grand-Theft-Parsons_script.txt",
    "imdb_id": "tt0338075",
    "imdb_url": "https://www.imdb.com/title/tt0338075",
    "characters": [
        "Music Expert",
        "Doctor",
        "Girl at Joshua Tree Inn",
        "Crying Girl",
        "Truck Driver",
        "Nurse 2 (as Alexa Motley)",
        "Barbara",
        "Undertaker",
        "Susie",
        "Phil Kaufman",
        "Gram Parsons",
        "Radio Announcer",
        "Nurse",
        "Reporter",
        "TV Interviewer"
    ],
    "dialogues": {
        "Music": "",
        "Expert": "He sang country music in a way that it had never been sung before. It was 'country rock', if you like. And it was kinda catchy. At least, the young people seemed to lap it up. It's fair to say that when Gram Parsons died, he died a star.",
        "Doctor": "Can I help you?  What are you doing?  We don't have a neurology department.  I have the paperwork.  Hello?   Hello...",
        "Crying": "",
        "Girl": "",
        "Truck": "",
        "Driver": "Hey, lady!  You... should be careful.",
        "Barbara": "Don't try and schmooze me, Kaufman, you repellent slimeball.  The latest victim?  It's a lot tidier than I remember.  Welcome to the seventies.  I'm here to fulfill Gram's wishes.  Do you know what this is?  It's Gram's will.  To whom it may concern: I would like it to be known that it is my wish to leave Barbara Mansfield my assets and belongings in the event of my death. Signed: Ingram Cecil Parsons.  Still the jester Kaufman, and still very unfunny.  It's better than a will, actually. It's a signed promise from Gram to leave me all his assets and belongings. And anyway, it's really none of your business what this is. I've come for the guitar.  Yes. Gram's guitar.   He always kept it here.  I don't believe you, Kaufman.   Barbara sits at a table in her shabby kitchen, reading the will. She lights a cigarette and sits back in her chair.   A door swings open, and Barbara appears. She is looking quite stunning, with a tight black suit doing equal justice to her womanly curves and her duties as a mourner. She strides down the sidewalk, and as a group of schoolchildren appears around the corner Barbara scatters left and right.   Yes?  Why, thank you...  I'd like to see the manager, please.  I'm sorry. It's just that the man I loved died yesterday. I was forgetting my manners...  The manager?  It's not a piece of paper. It's a promise from Gram to leave me all his money.  You don't seem to understand. These are his wishes.  Please tell me how I'm supposed to get my money.  Are you saying that I'm lying?  Parsons.  Was.   He was a musician.   Barbara is standing in her sitting room, the phone to her ear.   You might need to repeat that.  Stolen? What the hell do you mean, stolen? Who steals a body?  Where's the son of a bitch?  Well, he's stolen Gram.  They had some kind of weird pact. I think Phil's taken Gram out to the desert.  Some kind of voodoo thing with hot wax and dolls to stick pins in.  Now that is a wise move, if you ask me.  You'll learn about Phil Kaufman. If you stick around long enough.  I know he's a brainless, interfering asshole, yes.  That's him, isn't it?  Fine.  Hello Kaufman. I know what you're up to, you thieving bastard. I know where you're going, and I know about your sick, revolting plans, and I'm coming after you. And when I catch you...  Sonofabitch!  Okay, honey. Do you want to see who Phil Kaufman really is? Do you want to see what he's capable of?  Or maybe you already know I'm right.  Well why don't we find out?   Barbara drives and Susie sits in the passenger seat.   It doesn't look as if they've spoken for hours.   He's got Gram and I need him.  I know he's dead, Honey. But he hasn't been officially identified, and there's no certificate of death.  Let's just say I'm overly sentimental, okay?  Isn't everything?  I was a great support to Gram before Kaufman came along and spoiled the party.  What do you know?  In his whole life, Phil Kaufman didn't do anything because it was the right thing to do. You can bet the ranch that wherever he is, he's having some fun.  Sure it is, honey. That's why your bags were packed.  You might exclusively love Phil Kaufman - but unfortunately, so does he. You're just handy to have around.  The truth can hurt, can't it?   Susie seethes and Barbara smokes.   Nice? No, I suppose not.    Does it matter?  I do okay. Listen, I was an orphan at fourteen and a waitress at fifteen. I do what I do because it puts food on my table, and because if I don't look after myself, no-one else will.  I don't want anything from you. It would be a bonus to see Kaufman crash and burn, but I don't need to be there when it happens.  Gram was the first good guy I ever hooked up with. He wasn't perfect, but it worked between us. We just seemed to fit together. But Gram was already wild, and I made him wilder. Kaufman watched over him like a hawk, and when he felt things were getting out of control, he turned Gram against me. I lost the only decent thing in my life.  Gram was an adult.   He didn't need a nursemaid.  Yeah. Without my help and while Kaufman was babysitting.  That's fine. I just want what's mine and then I'm gone. Gone real fast.  Where's the catch on this piece of shit?  I told you what he's doing! He's going to set fire to my Gram in some freaky ceremony with witches and black magic and... dolls.    Hello Stanley. Remember me?     The psychotic girlfriend?  The hell you are, Kaufman.  Can we just cut through this?  You two stole the body. Theft.  Sweetie, I'm sorry, but you seem to be in the whole thing up to your neck. Accessory.  And you are an old fool who should have called the police, but hasn't. Stupidity.  Now, let's just call the cops and get it done. The sooner we get us a death certificate and bury him, the sooner his soul will be properly laid to rest.  Hey! What the hell are you doing?       Barbara is on the road, driving fast. Suddenly a blue flashing police light fills her mirror.   Thank God!  Please help me, they've got my boyfriend's corpse and they're going to perform a ritual with his body.  My driving license?  I've just told you that they've stolen a body and you want to see my driving license?  You people are supposed to be on the lookout for a hearse. A hearse is a big long car. You can usually tell which ones are the hearses, because they have coffins in the back. The one we're looking for is painted yellow. Does this look like a yellow hearse to you, asshole?  Is that a ticket? Are you writing me a ticket?  That'll be Gram Parsons, on fire.    We're in the desert. It is dark. If you want to catch someone in the dark, it's best not to turn on big flashing lights and make a loud noise with a siren.  No. But I'm really, really keen to find out.",
        "Undertaker": "Afternoon.     Joshua Tree Obsequies.  It's Latin. It means burial. Is there anything I can help with? Who am I speaking to?  Mister Parsons? I'm sorry, I'll take a look immediately.  Yeah, he was here.  New Orleans. Although he only just went, so he'll still be on his way to Los Angeles Airport. Big thrill for us here, as we're only a small facility. Nearly got Jane Mansfield in '67 when she passed through, but she got diverted to Frisco. Hello?  Hello.    Hellooo...",
        "Susie": "Guess who?  Try again...  God damn!     I'm so sorry, baby.  Would never have happened if you were there.  Well, if you were, you wouldn't have let him die.  Yeah, let's have this conversation again. Like you haven't just done six weeks on the road...  Come here...  This is a remembrance.  Hi.  Phil, you give me laughs and a great time. But I'm not sure if that's enough.  Yes, there's more than that! There's dependable, responsible, reliable...  I don't mind loving a crazy bastard, Phil. But you've got to be for something and not just against everything. You have to choose something to represent.  Your job is to arrange other people's lives. Maybe it's time to put a little thought into your own.  Who the hell is she?  Girlfriend? Isn't he married?  Why did you let her in?  How can she behave that way? Gram's not even in the ground yet.  What?  Don't you freak out on me.  Where are you going?    What are you doing?  Okay.    Is that a problem?  Well, that's good.  So what are you up to?  I don't know what this madness is, but I'm not getting involved.  I mean, I don't know what it is you're planning, but I'm not bailing you out again.  I'm going.  This time, I'm not coming back.  I'm going to find a man who buys his ties in bulk.  The son of a bitch isn't here.  Stolen Gram?  Why?  Don't be ridiculous.  I didn't ask you.  And you know him?  I don't need to listen to this garbage.  Generally, it's best to answer the phone to discover who's calling.  You don't know shit about him.  If you hate Phil so much, why are you chasing him across California?  Well, that's really touching. But... you've got to come to terms with the fact that he's dead.  I don't understand.  This is all about money, isn't it?  Why do you think you deserve anything?  Phil's not responsible for your problems with Gram.  I know that he can be a pain in the ass, but when it came to Gram, Phil only ever did the right thing.  Maybe that's what I like about him.  Have you any idea what it's like to really love someone?  I don't have to listen to this.  Okay, you vindictive bitch. I'm going with you to Joshua Tree because my life seems to have been turned upside down and I want to know why. But you don't know me and I won't let you judge me. Do it again and I'll smash that pretty little face of yours off the fucking road. Got it?  You're not a very nice person, are you?  It might get you further.  So what do you want from us?  Why do you hate Phil so much?  Surely Phil was just looking after Gram?  Except that now he's dead.  I don't like you much, Barbara.  Phil?    Phil!  What happened to your head?  Hold that thought.  I need to know what it is you're doing.  Dolls to stick pins in.  I'm with him.  Just do whatever feels right to you.  That's for failing to reinforce my expectations.  I reckon I am.  Some decorum would be nice.  I'm not having a conversation with you about how much gasoline you need to burn a body.  I'll be waiting.  Get out of here.   Finish it.",
        "Phil": "A phone rings in the dark. A little light falls from the open window, illuminating an old bakelite telephone. It sits on a small table alongside a large amount of empty bottles and a couple of overflowing ashtrays.   A three wheeled motorcycle is being driven through the night at great speed. The trike is moving very quickly, its headlights cutting through the darkness, its wheels sending a spray of sand flying towards us, as the driver fights to keep it on the road. This is PHIL KAUFMAN, and he's in a hurry.    That phone - still ringing; shrill, insistent. There is a bed next to the table. It is covered in clothes, but there is also a man's shape, which now moves.    Still that insistent ringing, and the covers suddenly fly off the bed. We see the man from behind as he shakes the sleep away and looks for the damn phone.       The man finally answers the phone.   At last the ringing stops.  Hello?  Ah, what... who are you?  Hold on.   Tell me who's dead.  Are you sure he's dead?  Listen. Call an ambulance. Where are you?  Have you got a car?  Call an ambulance. Then get out of there. Okay? Okay?  Okay. I'd like to see Gram Parsons.  Yes. Alone, if possible. And would you have a gurney standing by in case I need to move him?  Actually, I'm his road manager.  No.  Now listen here...  Sheesh!  Hello buddy. How you been?  Well, I can't stand around here chatting with you all day. Things to do...  Naw, I'm cool thanks.  Just taking some stiff down to neurology.  Urology.  Okay. Just hold your horses - I'll go check the paperwork.  No. You have your paperwork. I need to go check my paperwork.   The Trike pulls up outside a rambling old house. Two enormous plaster eagles flank the front door, a giant Harley Davidson sign hangs from the roof, and there's a six foot flashing neon star in the front window. Phil gets out, walks up to the door and pulls some keys out of his pocket.       Phil walks into the room and pours himself a drink. He slumps onto the couch, takes a sip and closes his eyes. We see movement behind him, as an attractive girl slips through a door and approaches Phil from behind. This is SUSIE, and she puts her hands over his eyes.   Martin Luther King.  This.... ...isn't.... ...the best time... ...Baby....   Phil and Susie are sitting at the kitchen table.   He takes a drag from her cigarette and passes it back.  Yeah, out of a job again.  How do you know I wasn't?  I was still 'on staff'. He was still my responsibility.  So where have you been, anyway?  How long this time? Two weeks?  Yeah, but I usually leave a note. And there's a paycheck involved.   Susie guides Phil to a chair and sits him down.   What's this?        Susie walks in with a coffee. She sits beside Phil and strokes his head until he wakes. She kisses him and passes him the cup.   Hello.   Susie leans on the table, staring out of the window.   Phil walks up behind her.   When you're here, I spend my time wondering when you're going. And when you're back, I wonder where you've been.  You mean there's more than that?  There's dull, boring, normal. You should hook up with someone who works in a bank. I know a guy, actually. He has fish for dinner every Friday, cleans his shoes twice a week and buys his ties in bulk because it works out cheaper that way. I'll put you in touch.  I represent the combined forces of charm, enchantment and exuberance.   There is a loud banging on the front door. Phil glances out of the window, and looks momentarily puzzled. He opens the door, and a beautiful woman stands on the step.   Long time, no see, Barbara.  Meet Barbara.  Gram's ex-girlfriend.  What do you want, Barbara?  That's nice. I have no idea what you're talking about.  Did he write that with joined up writing or was it before he knew how?  That's not a will Barbara, and you know it.  Guitar?  It's been a while since you were around, Barbara.   Phil and Susie sit on the sofa, an island of calm in a sea of chaos. Around them, the floor is covered with papers, clothing, empty record covers, torn open cushions and books. A broken drawer is propped against the table. A lampshade hangs crazily from its bearings, throwing strange shadows around the room. Suddenly, Susie gets up and kicks a cushion across the room.   Hey, well done. You found the only unbroken thing.  It's all part of the grieving process.  Nothing.  Do me a favor and get the guitar, sweetheart.     Phil is holding the phone.         He frowns.      Phil straightens up.         He speaks curtly.   Yes, you can help me as a matter of fact. I am...   The phone sits on the table but the room is empty.   Phil is lying down in the back of Susie's station wagon, his feet sticking out of the back. Susie comes out of the house carrying the guitar, and sits on the steps, where she watches him. After a minute:   These things aren't that big.  Not really.  It's best you don't know.  Well, that's the point.  Right.  Again.      You Larry Osterberg?  Very nice.     What's that noise?    Right.  Oh, I'm Phil Kaufman.  I'd like to hire your car.  Well, I need to pick someone up at the airport.  Yes, of course. It's just that I'm told your car is more suitable.  Well... it's a hearse.  It's... a joke.  A prank.   A surprise.  No, it's more of a fifty dollar surprise.  Booked how?  Well, here's two hundred dollars to unbook it. Let 'em carry their own trombones.  You don't need to count it.   You could trust me.  That last twenty is for gas. Anyway - I haven't even seen the car yet. I'm the one who's operating on trust.  Bernice?  It's yellow.  It's supposed to be black.  That might be my point.  I paid you two hundred dollars for a black hearse.  Okay.   Where are the keys?  I gotta go.  Okay.   Well, let's boogie.  Well, I've paid top dollar, so it's nice to see I'm getting the best...  You are famous throughout the greater Los Angeles area.  But you are the only guy with a hearse. Don't go getting carried away...  Pull over.  Shit.  Nothing.  We'll wait here.  Soon.  Why do you ask so many damn questions?  Look, will you please shut up asking me stuff?  Morning.  We'll make the pick-up in the morning.  I'm here to pick up a... coffin.  Yes I am.  Okay.   A casket.  It   was due out on the next flight to   New Orleans, but I'm driving it   now. The stiff doesn't like to   fly.  Yeah, but it's my day off.  Mine or the...?  Parsons.  They'll be along. With this being a rush job, they said you'd understand.  Yup.   That's a she.  Yeah...  Gone?    Whaddya mean, gone?  Nice work.     So how do I get my box back?  You're a damn thief.  Can you speed things up?  I'd like to get to the Joshua Tree while it's still light.  What?  Joshua Tree, yeah.  Joshua Tree, Louisiana. Just outside the city.  It's small. Just another local community struggling to get by.  Use your phone?  Susie is packing. The phone rings and she hesitates for a moment. Then she continues loading her case, leaving the phone unanswered.   Yeah.   I'm a real lucky guy.  Well, I don't care if it is first thing in the morning - but I sure need a coffee. I tell you, I've never seen so many darned bits of paper to sign! It's paperwork which is slowing this great country down. We're drowning in triplicate!  Good morning officer.  I was just saying how people with work to do - people like yourself, officer - are just getting engulfed by paper. Grab the end, will you? Doesn't that just drive you plain crazy?  One casket, six sheets to sign. Six! That can't be right. Does that sound right to you?  And the very last thing I want to do is to hold you up further with my chatter. Thank you for your help, officer. You have a good day, now.  Yessir?  And there you have it, officer. You see the gentleman we're meeting from the plane doesn't yet know about the sad passing of his... aunt.  Yeah. We're doing it this way for the avoidance of doubt.  Thanks for everything, officer. We'd best be off...  Yes!    We did it!!  What was all that babbling about earlier?  What the hell does that mean?  Well of course they make you feel uneasy. They're supposed to make you feel uneasy.  You hit the wall.    Hello, officer. I guess they make these hearses wider than they need to...  Well...  Fantastic.     Well done.  You... you just drove into a wall! Of course it's your fault. Jesus!  Here it comes...  Well?  Well, what are we doing now?  Nice going, hippie. Went right through the gap that time.  Well, we got it. Whoooh!!!  Jesus... What now?  What are you talking about?  C'mon, we gotta keep moving.  Look, I can see you're a bit... sensitive about this whole... casket thing.    I... look, it's not right to throw me out onto the street with a coffin.  Thank God.  What the hell are you doing?  You can't do that.  What talk?  Can we please talk about this later? This is not a great place to be right now.  Oh, just a minute. Now I understand... You think there's a body back there.  You think there's a body in the coffin!  I can fully understand why you'd think that. I mean, it is a coffin and all. But would I - would I really - steal a real live dead body?  Absolutely, completely, totally.  They are made of finest... poplar. That's very heavy wood.  Look, I'm not going to argue with you now. Poplar is very well suited to the making of coffins.  I'm... selling them on to a company in Palm Springs. Lots of stiffs, lots of money. And then of course, it's very environmentally sound. And... look, under the circumstances, perhaps we should renegotiate the financial arrangement between us.  Fifty-fifty? That baby's worth two grand.  So then Bobby transfers 'em into hardboard boxes just prior to the cremation and I drive the caskets over to a guy I know in Palm Springs who resells them.  Well I'm not sure the 'one careful owner' thing works with coffins.  Yeah, well. I saw how outraged you were back there, when I mentioned money. Just think of it as recycling.  Why?  Well, while I acknowledge the power of your argument, we have to be somewhere else. So just settle back and enjoy the ride.  What now?  Sure am.  Nope. We're special rock 'n roll undertakers. Musical morticians.    High test.  Who says it's for the car?  Nope.  Why would we want to do that?  You want to go home to pick up fresh clothes?  And then drive back out tomorrow?  Just drive the car, okay?  No.  No.  No.  Well, I do everything.  This little number is for drinking money. By trade I'm a Road Manager.  No, not like a well-paid gopher. I'm responsible for movement, maintenance and management. I'm a confidante and a companion, a partner and a patron, an ally, agent and ambassador. I'm like an executive nanny. Not a gopher.   Susie is moving her suitcases into the sitting room when there is a banging on the front door. Susie opens the door and Barbara is standing outside.    The girls are still arguing.   Hello baby, it's the love machine. How are ya?   Barbara smiles unpleasantly.  Hello Barbara. How nice to hear from you again. And so soon...  Sorry Barb, gotta go.  It's been real, though.   Barbara slams the phone down. Then she picks up the receiver again and smashes it onto the table.   So what's that about?  You've hardly left the car since we met. How can you have sunstroke?  You're a winner, that's what you are. A winner...  Turn off here.  It is if you're a coffin smuggler.  It would be really nice if we could get through a couple of hours without crashing the car.  Of course you were.  I don't believe it. Middle of nowhere, and... quick - stand in front of the car!  Pretend we're having a conversation.  I don't know what about! Ever since I met you, you've talked. Yabba, yabba, yabba, every waking minute. Religion, your supersonic, supercharged car, the darkside. Now you need to talk, and you can't think of anything to say.  Whatever your damn fool religion is called, I think it works.  Oh, well done. Good work.  Afternoon, officer.    How's it going today?  Fine, fine. We just... stopped to take a look at...  ...the fine view you folks have got around here.  That's a great line...  Anything.  I think he's onto us, Larry. He's just having a little fun at our expense.  God damn!  He meant a coffin.  Look, the place that I get the coffins from probably haven't filed a report yet. It'll all be sorted out within the hour. Trust me.  Jesus!  Time.    Yeah, that would be great. Then we could suspend you from a bridge in a straitjacket and set the rope on fire.  Okay.   Show me.  Yes, I think we should go.  Nicely done.  We'll be moving on, now that your sign no longer appears to be impeding our forward progress.  What the hell are you doing?  Well...   turn it off!  So, we've escaped but we can only drive in a circle?  Can we please go?  Why would they do that?  You worry too much.  Jesus - what the hell is that?  Very perceptive.   What's it doing?  Pull over - let's... eat.  We need to stop. I'm starting to get hungry. I'm not nice hungry.  What gave you the impression this was a democracy?  You frighten him.  Everyone else, he announces the food when he brings it. Diplodocus this and Allosaurus that. Us he just slaps it down and runs for cover.  It's probably the rabbit food.  I understand. Really I do. That stuff'll mess you right up every time.  Gotta make a call.  Hey man, where's the phone?   The sitting room is empty.          The phone rings.     And rings.   Who?  None of your damn business.  No.  Yeah, that'll be it.     Shopping.    All gone.     C'mon.  Better get going.  Yeah, he was a real blabbermouth. In fact, I thought he was never gonna stop talking. Anyway, although that's real interesting, we've gotta keep to the schedule.  Well, I think we should just make our delivery as soon as possible, don't you? Get our package to Palm Springs. Remember?  Stolen... his son? That's outrageous! I'm appalled that you could even think we'd do such a thing.  We've really got to go.  Okay, then. Well, if you're satisfied, let's go.  Heavy, yes. Well, it is made of wood. Wood is heavy. Actually.  Gosh, they must have given us a full one. We'll have to sort that all out when we get to Palm Springs and...  Well, technically, we stole Gram Parsons.  I'd save that line for court.  What are you doing now?  Calm down.  Well, when you've quite finished, we should go.  Shit!  Welcome back, hippie.  Do what?  Well, I gave my word.   This is what Gram wanted.  Do you have friends?  Well, what would you do for them?  That's what I hate about people like you. Everything's 'within reason'. There are always boundaries, provisos. You only operate with a safety net.  You've missed the point. See, it doesn't matter what he would do, or what you and your tie-dyed friends think is the correct way to behave. To me, it only matters what I do. Where you have boundaries and limits and thresholds - I only have right and wrong. If I make a promise, I keep it - that's right. If I break that promise - that's wrong.  A hippie hit it.   I thought you'd gone.  What the hell does that mean?  Dolls?  What the hell are you talking about?  Enough of this shit.  They've gotta be in here.    It's fate.  Whatever happened to peace, love and understanding, hippie?  Yup.  I'm going to cremate him, here in the desert where he felt most at home. That's what he wanted.  I know you have to.  It's too late to claim him now.  It means that you were never there when it mattered to Gram. It means that you stopped being a father the moment he stopped doing your bidding. It means that you learned to care too late. That's what it means.  Not to me, no.  No - he gave it his all, but in a way you could never understand. And all he ever wanted from you was approval. He wanted you to be proud of what he had achieved.  It's no good telling me.   You should have told him.  Too late...  I was both, yes.  Yes.    That's right.  I guess not.  I only failed because I couldn't save him from himself. You failed him all his life. You never believed. I never doubted.  I was his road manager and his friend. We loved it out here in the desert, and we made a pact that whoever died first, the other would come down here and set them free. Gram gave his word and I gave mine.  I don't take drugs.    God damn!  Did you call them?  Are you going to call them?  There isn't a reason. If someone tried to steal my son's body, I'd stop them. For sure.  I'm expecting to.  Better make the point.  Are we sure that this is helping?  What's that for?  Well... I'll have to do that more often.  Did you really take all those drugs?  C'mon, time to go...  Just checking.  Are you coming?  Cap Rock. This is perfect. Really peaceful...  You wanna give me a hand here?  Sorry, Gram.  Now we... do it.  Take the top off.  Flesh burns easier than wood.    Right.  Do you think that's enough?  Enough?  Only a little left.  I'm sorry I wasn't there for you when it mattered, but I was there before, and I've been there ever since. Gram, good luck to you, wherever you are.  That's my last one, man.  Nah, I just didn't factor in the booze inside of him. Gram always...  I think our work here is done.  Go!  Hello, Gram.  Do you think you should?  They're very handy for transporting dead people around. Nothing better.  You're more than dead, Gram. You and the box are down to bones and brass.  What can I do for you, Gram?  Well, you're here. And seeing as I just burned you to a cinder, you shouldn't be.  What for?  Well, that's okay, Gram.    But I don't need thanking.  I'm just taking care of business. That's what you paid me for - that's what I do.  Actually, I just quit.  Goodbye, Gram. I'm glad it all worked out.  I said I'm glad it all worked out.  Doesn't matter. Can we go now? I'm getting sick of sand.  Singed my damn mustache, that's for sure.  Yeah.    Let's roll, hippie.  Where d'you think you might be when I'm done?  Yeah, but where?",
        "Kaufman": "A phone rings in the dark. A little light falls from the open window, illuminating an old bakelite telephone. It sits on a small table alongside a large amount of empty bottles and a couple of overflowing ashtrays.   That phone - still ringing; shrill, insistent. There is a bed next to the table. It is covered in clothes, but there is also a man's shape, which now moves.    Still that insistent ringing, and the covers suddenly fly off the bed. We see the man from behind as he shakes the sleep away and looks for the damn phone.       The man finally answers the phone.   At last the ringing stops.",
        "Gram": "In my hour of darkness, in my time of need, Oh Lord grant me vision, Oh Lord grant me speed. Oh Lord grant me vision, Oh Lord grant me speed.  Sure is hot.  Phil.  Not gonna hurt me now, is it?  Nice wheels. Very stylish.  I am dead, then?  Oh, well.    Here's mud in your eye.  You assume I want something.  Well, okay. I just wanted to say thanks.  Doing the thing that we agreed, keeping your word, keeping them all away...  You don't?  You shooting for a raise?  Well, I s'pose I should be getting along.  What?",
        "Parsons": "",
        "Radio": "",
        "Announcer": "",
        "Nurse": "You wanna run that by me again, sir?  You want to see Gram Parsons?  And you are.... his physician? Or perhaps a close relative?  So you're not his physician or a close relative?  Mister Parsons is awaiting a post mortem. He will then be delivered to his family. I suggest you speak to them if you wish to pick through his personal effects. Sir.  No, you listen here. Mister Parsons is dead and no longer appears to need a road manager. Which makes two of us.",
        "Reporter": "And another light burns out in the desert. Gram Parsons - the standard bearer of the new country music movement - is dead, following an overdose of drugs. While many of America's young people are today in mourning, their parents will view this as another example of how today's drug culture can so easily claim a life. We'll leave you tonight with the young man's own words. Gram Parsons wrote a song called 'In My Hour of Darkness', which contains these words: 'In my hour of darkness...'",
        "TV": "",
        "Interviewer": ""
    },
    "imdb_rating": "6.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNDZiOTE5NDMtYmYyNC00NzZmLTk2NjktMzViOGZkZDI3Y2I3XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "There are times when it's right and proper to simply bury the dead. This is not one of those times... Gram Parsons was one of the most influential musicians of his time; a bitter, brilliant, genius who knew Elvis, tripped with the Stones and fatally overdosed on morphine and tequila in 1973. And from his dying came a story. A story from deep within folklore; a story of friendship, honour and adventure; a story so extraordinary that if it didn't really happen, no one would believe it. Two men, a hearse, a dead rock star, five gallons of petrol, and a promise. And the most extraordinary chase of modern times.—Anonymous",
    "name": "Grand Theft Parsons",
    "genres": [
        "Adventure",
        "Comedy",
        "Drama"
    ]
}