{
    "filename": "Gravity_script.txt",
    "imdb_id": "tt1454468",
    "imdb_url": "https://www.imdb.com/title/tt1454468",
    "characters": [
        "Complete credited cast:",
        "Ryan Stone",
        "Matt Kowalski",
        "Aningaaq (voice)",
        "Shariff (voice)",
        "Explorer Captain (voice)",
        "Mission Control (voice)",
        "Russian Space Station Captain (voice)"
    ],
    "dialogues": {
        "Ryan": "Installation ninety-five percent complete. Running level one diagnostics on circuits, sensors, and power. Standby.  I'm fine Houston.  Not any more than usual, Houston. Diagnostics are green. Linking to communications card. Ready for data reception. If this works, when we touch down tomorrow, I'm buying all you guys a round of drinks.  OK, here we go... Booting comm card now. Please confirm link. Houston, please confirm reception of data.  Stand by, Houston. I'm gonna reboot the comm card.  Comm card reboot in progress.  Houston, I'm fine, it's just... ...Keeping your lunch down in zero G is harder than it looks.  No, we've been here for a week Houston, let's just finish this.  Card is up.  Try again.  Houston, could you please turn that music off?  Thank you, Kowalsky.  Now, Houston?  Could Houston be misinterpreting the data--?  Mmmm. Let me see what's going on.    Visual examination doesn't reveal any damaged components. The problem must be originating in the comms panel.  I'm on it.  An hour.  Assistance appreciated.  Certainly.  Like a Chihuahua that's being tumble dried.  Whoa...! AWOL!  Thanks. Sorry. In my basement lab things usually fall to the floor.  Call me a genius if I can get this board initialized in the next hour.  Should we be worried?  Explorer, engage arm and pivot to cargo bay.  I was just happy that they didn't cut the funding to my research.  Six months.  Assuming it works, it's just for hospital use. This one is a prototype.  My eyes are brown.  Mm-hm.  The silence. I could get used to it.  Houston, from first inspection comms panel appears to be dead. Am I a go to cut link to auxiliary?  Proceeding to over ride.  I can't. If I turn it off now we'll lose the whole system.   Sorry. I'm sorry. It's done.  Kowalsky, visual of debris at nine o'clock.  Dr. Stone requesting faster, faster transport.  Dr. Stone requesting faster transport to the bay area. Explorer get me down.  I'm trying...  It's stuck!  Nooooo!  No.     Ok. Ok.  I'm trying. I'm trying.  Ok. I'm trying! I can't it's stuck, Hold on.  Yes. Yes. I copy. I'm detached!  I don't know. I don't know! I'm spinning. I can't. I can't.  GPS is...down. I can't, it's down, I can't.  I told you! Nothing. I see nothing!    It's too fast.  I can't breathe. I can't...breathe...  Houston, this is Dr. Ryan Stone.. I'm drifting but I have a visual of Explorer.  With North at 12 o'clock, the Shuttle is at the center of the dial.  I can see the Chinese station. No, no, no, it's the International Space Station.  ISS is at 6, no, 7 o'clock.  Lieutenant Kowalsky, do you copy?  Explorer, do you copy?  Houston, do you copy?  Houston, this is Mission Specialist Ryan Stone. I'm off structure and I'm drifting.  Do you copy?  Anybody...? Anyone...? Please copy.   Lieutenant Kowalsky?...  YES! YES! I copy! I'm here!  My light?  Here! Here!  I'm... I'm alright... I'm fine.  3.6 psi, I think.  Steady at eight percent...no seven...  Copy.  Please hurry.  Oh. Sorry.  Arghh!  Okay. Okay. Okay. Okay, Ohh I got it.   No... No... No... Wait... Don't.  Nooooooo!!!! Dammit!!!  Ahh Dammit!  Ahhh Dammit.   Why aren't they answering?  Can they hear us on an alternate frequency?  Why ninety?  02 down to six percent.  Yeah. Pretty scary shit.  Where is he? Where is he?  Oh, my God. Oh, my God.  I'm trying. I'm trying.  I got him. I got him.  02 down to five percent.  I apologize for not complying. I should've stopped working as soon as you instructed me to.  Yes?  Agreed.  02 down to two percent.  What?  Home?  Lake Zurich.  Illinois.  I don't know...  The radio. I listen to the radio...  Anything. Doesn't matter. As long as they don't talk. I just drive...  No...  I had a daughter.  Sarah... She was four. Stupidest thing- a school trip to the swimming pool. She was playing tag- she slipped, hit her head, and that was it... She loved tag. I'm sure she was laughing.  When I received the call I was driving and ever since that's what I do. I wake up, I go to work and then I just drive.  02 down to one percent.  Uhuh?    Mmm...Mmmm.  I'm red lining... My O2 tank pressure is low...  Shouldn't we be turning? We're  Break... You have to break.  I got it. I got it.  The tether broke. I'm detached. I'm I'm detached.  I've got you. I've got you--  No. No. No. Don't you. No. Don't you. Don't. Don't. NO  Gotcha!  What? No--  No!  I'm not letting you go! We're fine.  You're not going anywhere, you're not  Please don't do this.  Please don't do this. Please don't do this.  No!  I had you! I had you.  My CO2 alarm went off. My CO2 alarm went off.  Yes. Yes. I see it. I see it.  Yes.  Ok.  Sunday drive...?  I've never flown a Shenzhou--  Ok.  Only on a simulator.  I crashed it. I--  Every time. I crashed the Simulator every time.  I'm going to take the Soyuz and come get you.  No. I'm coming to get you.  But... I...  I'm... I'm going to make it.  Dad wanted a boy.  Not yet.  What?  You... you have beautiful... you have beautiful blue eyes.  What?  No... I'm coming to get you.   Matt...  Matt!  Come on, come on.  OK. Where are you? Where are you? Comms. Comms... There you are!  Matt. This is Ryan. Copy?  Matt. This is Ryan. Copy?  Matt, I made it. I'm here. I'm inside the Station... Do you copy?  Come on Matt. Talk to me. Tell me where you are. Give me your position...  Where are you? Give me a visual... tell me what you see.  Oh, come on. You've been yammering nonstop since we left Cape Canaveral, and now you decide to shut up?  Come on Matt, talk to me!  Say something... Anything.  Tell me about Mardi Gras. Tell me about the hairy guy. What happened?  Oh Matt. I'm not ready for this.  Houston in the blind.  This is Mission Specialist Ryan Stone reporting from the ISS... All communication with Mission Commander Matthew Kowalsky has been lost. Radio transmission is absent. Visual is nonexistent. To confirm, I--Ryan Stone--am the sole survivor of STS-157.  What now?  OK... where was it?... where was it?  Where is the power?... Here you are.  Good... good... just like training...  Undocking... undocking... Yes... red...  Ok... Ok... I remember this... undocking...  We don't have four minutes to spare. We're going manual...  Okay. Arming the system...  Firing the pyros...  Rezerv rasstyk!  I engaged manual control- R O A K and RYD are activated.  Oh, no. No, no, no.  Great. Fantastic. Perfect.  Clear skies but with a chance of satellite debris.  Okay. We detach this and we go home. Piece of cake.  Oh shit.  Shit!  No... no... no..  I hate space.  Shut up!  Ok.  Alright. That's good.  Okay, let's stabilise you.  Ok. Let's visit the Chinese station. Houston in the blind, Tiangong is approximately 100km... to the west and I am off it's course by about 3 degrees. I will correct trajectory.  Ok.  Ok. I'll engage main thrust in five... four... three  two... one...  One...  One... one...  Come on. Come on!  You gotta be kidding me.  Where's your backup?  Where's your goddamn backup?!   This is Dr Ryan Stone, can you hear me? Houston, this is Ryan Stone, can you hear me? Copy? Houston, this is Ryan Stone, can you hear me? Copy?  Houston, this is Ryan Stone, can you hear me? Copy? Houston, this is Ryan Stone, can you hear me? Copy?  Houston. Houston! This is Mission Specialist Ryan Stone. Do you copy!   Houston, you're coming in over the AM frequency. Please confirm identity.  Repeat. This is Mission Specialist Ryan Stone from STS-157. Do you copy?  Is this the Chinese Station? Is this Tiangong? Copy?  Do you speak English?  S.O.S. Do you understand?  Mayday! Can you copy? Mayday! Mayday!  Yes! Mayday! Mayday!  Aningang?    No, Mayday's not my name. I'm Stone, Dr. Ryan Stone-- I need help.     Where are you, Aningang? Is the sun out? Are there birds? Are there trees? Can you smell the ocean?  Is it beautiful where you are? Here it's colder than hell and lonelier than shit, but it's beautiful Aningang. Utterly, terrifyingly beautiful.  Make your dogs bark again, Aningang. Will you? Please...  Dogs! Woof. Woof. Woof.  Woof. Woof.  Auuu. Auuu. Woof. Woof.  I'm going to die, Aningang.  I mean, we're all going to die. Everyone knows that. But I'm going to die today...  Funny that. To know.  And you know what Aningang... I don't care. I don't care if I die. I don't have anything... not anymore.  But the thing is... I'm still scared. I'm really scared...  No one will mourn me. No one will pray for my soul. Will you mourn me, Aningang? Is it too late to say a prayer? I'd say one for myself, but I have never prayed in my life... no one ever taught me how...  No one ever taught me how...  A baby. There's a baby with you.  You are singing to your baby? Is that a lullaby? That's so sweet!  I used to sing to my baby too.  I hope I see her soon.   That's nice. Keep singing, Aningang, just like that. Sing me to sleep. I'll sleep and sleep and sleep. Sing to me, Aningang... sing...sing....  No... no.. don't.  How did you?  But how did you?  How?  You never told me where.  No.  We can't.  There's no fuel. I tried everything.  I tried everything.  They're for landing so.  I never got to land the simulator, I told you.  And I crashed it every time.  How did you get here?  What?  Landing, landing. Landing is launching.  Okay, landing, landing, landing is green.  Okay, okay landing, alright.  Soft landing jets trigger automatically at three meters before landing. ... you're a clever son of a bitch Matt. So to land I need to get rid of the BO and Engine module, okay?  Listen to me Matt. You're going to see a girl with brown hair. She's Sarah, her hair is probably a mess. That's okay, she doesn't like to brush it.  Tell her mommy found her red shoe. She was so upset about that shoe Matt, but tell her it was right under the bed.  You give her a big hug and a kiss for me and tell her mamma misses her. Tell her she's my little angel and that she makes me so proud, so so so proud, and that I promise I'll try and make her proud too. You tell her that I'm not quitting, that I'm going to keep fighting. You tell her I love her Matt... I love her so much.  Tri module separation, go...  Okay Houston, here comes the tricky part, the Soyuz has to think we're only three meters above the earth.  Let's reset you then.  Okay. I only have one shot at this. One shot...  What's the point if we don't try?  Wow... you were right Matt... it's magnificent....  You're losing altitude, Tiangong. You keep dropping and you're going to kiss the atmosphere. But not before I get to you. You have my last ride home.  Okay, I'm done with just driving. Let's get go home.      Ahhhhhh!  Come on. Come on.  Seriously?  In the Soyuz the power button is erm....here!  Ah, ok ah undocking, undocking....eenie, meenie,...  Ok. That doesn't sound good....  Miini... moh...  No hablo chino.  Mini... moh...  Okay....okay...  Good...good...There. And this should be...  Okay... Houston in the blind...  This is Mission Specialist Ryan Stone reporting from the Shenzhou. I'm about to undock from the Tiangong and I have a bad feeling about this mission.  Reminds me of a story, Houston--  Okay, you know what, Houston? Never mind the story...  It's getting hotter in here.  The way I figure it, there's only two  I either make it down in one piece and I'll have one hell of a story to tell...  ...Or I burn up in the next ten minutes.  Whichever way it goes, no harm no foul.  Because either way--  It'll be one hell of a ride.  I'm ready.  Yeehaaa!  Ahhhhhhhh!       Thank you.  Ahhhhh!!!",
        "Stone": "",
        "Matt": "Okay, let me tell you a story. It was '96. I'd been up here 42 days. Every time I passed over Texas, I'd look down, knowing the second Mrs Kowalsky, was looking up, thinking of me. Six weeks I'm blowing kisses to that woman. Then we land at Edwards and I find out she'd run off with a lawyer before I was off the launch pad, so I packed my car and I headed to...  Five hours off the reservation and I show 30% drain. My compliments to Engineering. Except for a slight malfunction on the nulling of the roll axis, this jetpack is one prime piece of thrust.  Tell them I still prefer my '67 Corvette though. Speaking of which did I ever tell you the--  Even Engineering?  He appears to be doing the Macarena of some sort. Though that would merely be a best guess scenario on my part.  Not a problem.  Seventy-five minutes shy. Never crossed my mind.  Right back atcha, Houston.  Am I a go to assist Dr. Stone in removing the panel?  Thank you, Houston. Mind if I join the fun?  How are you feeling?  It's been a rough week. If it makes you feel any better, I puked up everything but my kidneys on my first ride.  Hey -- you're the genius up here. I just drive this bus.  Let the boys down there worry for us.  So doc, now that you work for NASA, how do you like it?  How long was your training?  So, what is this scanning system?  Listen, they don't bankroll prototypes, even for your pretty blue eyes.  Right now your eyes are blood shut.   And to think he went to Harvard.  You gotta admit one thing. You can't beat the view....     \"Mmm?\" So what do you like about being up here?  Hmmmm. Terrific.  Houston, I have a bad feeling about this mission.  It's the same feeling I had at Mardi Gras in 1987...?  Well, it's day one and I'm bumping my way down Bourbon Street looking for the sister of a friend of mine. The streets are swimming with people, I'm thinking there's no way I'm finding this girl...  Then all of a sudden I look up and -- there she is.  I am about to yell out when I notice she's holding hands with a short hairy guy in board shorts and a Margaritaville T-shirt. Then I realize, the guy's no guy. My sister's friend is holding hands with a--  Roger. Explorer, prep airlock!  Houston. Elaborate.  Copy all Houston. Put a bow on it Dr. Stone.  I'm not going to ask you again.  Not one second. Now! Shut it down!  Alright Shariff, let's do this.  Houston. Update.  Right of disposal. Most likely a spy sat gone bad. Now it's space junk.  Explorer, ready to disengage HST.  What's the blowback, Houston?  Define \"multiple\" sats.  Half of North America just lost their Facebook.  Explorer, this is Kowalsky. Confirming visual contact with debris. Debris is from a BSE sat. To repeat--  To repeat I have-  We have to go. Go, go! Go!  Explorer permission to retrieve Dr. Stone.  Unstrap! You can't tune out the world up here.  Try releasing the safety clip.  No, don't wait for us. Get inside.  Man down! Man down!    Explorer has been hit. Explorer do you read? Explorer, over. Explorer--  Astronaut off structure! Dr. Stone is off structure!      If you don't detach that arm is going to carry you too far!   Listen to my voice. You need to focus. I'm losing visual of you. In a few seconds I won't be able to track you.  You need to detach. I can't see you anymore.  Do it. Now!  Houston, I've lost visual of Dr. Stone... Houston, I've lost visual of Dr. Stone.  Dr. Stone! Do you copy?! Repeat! Do you copy?  ...Give me your position!  Report your position.  Give me a visual.  Do you have a visual of Explorer?  Do you have a visual of ISS?  I need you to focus. Give me a visual... anything.              Your O2. Give me your O2.    Nearly there.    Gotcha.  Now, I'm going to tether you to me.  I know. You never realized how devastatingly good-looking I am.  But I need you to stop staring and help me with the tether. Okay?  Ok. So far so good. Now listen. I'm going to give you a little push, just so you're clear of the jets--  Sorry. Not a push, more like a nudge.  See? Where you go, I go.  Better. Let's get out of here.  I know what you mean.  You're burning oxygen, we're going to go back to the shuttle. How's that for a plan. Copy?  Right copy that.  Houston in the blind, this is Kowalsky. Dr Stone and I are making our way to base, please prepare Airlock for arrival. Copy?  Houston this is Kowalsky. How do you copy?  It seems like communications are lost.  We don't know. That's why we keep talking. If someone is listening they might just save your life. Set your watch for ninety minutes.  Houston clocked that debris at fifty thousand miles per hour. Factoring in our current orbit, I reckon we've got 90 minutes before we play duck and cover again.  Okay. Pretty scary shit being untethered up here, isn't it?   You did all right.   Houston, in the blind. This is Kowalsky. Our current location is approximately 900 meters out from the Explorer. Dr. Stone and I would like to retrieve the body of Mission Specialist Shariff and return it to Shuttle. Am I a go to retrieve?  Roger that.  Grab him!  Quick. You're pulling me away.  Clutch him like he's your Valentine. I can't gauge my thrust with you two yo- yoing around.   Jesus...    All right, here we go. Careful of the edges.  Houston, in the blind. To confirm. Mission Specialist Dr. Stone and myself, Mission Commander Matthew Kowalsky, are the sole survivors of  We were going to be hit no matter what. There was nothing you could've done to change that.  Hey.  Alright... We have to get ourselves to the Space Station. There.  It's a bit of a hike, but it's our only... It's our best option. Agreed?  Dr. Stone...  Agreed?  Alright. After you.  Houston in the blind, this is Kowalsky. Dr. Stone and I have determined to proceed to ISS and use one of their Soyuz for re-entry. ISS if copy, please send rescue mission. Repeat please dispatch rescue mission.  We're getting there.  Beautiful, don't you think?  The sunrise. That's what I'm going to miss the most.  So, where's home, Dr. Stone?  Ryan. Where's home?  Ah ha. Down there. Mother Earth. Where do you pitch your tent?  Where the hell is that?  Illinois. Central time zone. That makes it roughly... 8pm right now. What are the good people of Lake Zurich doing at 8 o'clock in the evening?  What would you be doing?  Come on. It's 8 o'clock. You've just clocked out of the hospital after putting in your customary 18-hour shift. You're driving home...  There we go. Let me guess. NPR? Classical. Top for--  What do you miss down there?  Is there a Mr. Stone?  Nobody special? Someone down there, looking up, thinking of you?  What was her name?  Well, well, what d'you know. I have good news and bad news.  The good news is we're five minutes from the ISS and I know where the Russians stash their vodka... and that's a good thing cus I'm running out of fumes. Bad news is I'm gonna be ten minutes short of......breaking Anatoly's record.  What?  The tank may be empty but there's still oxygen in your suit, so sip, Ryan. Don't gulp. It's wine, not beer. Sip. We'll get you there.  Let's go.  Houston in the blind we have visual of the ISS. Station must have been evacuated because first Soyuz is missing. Second Soyuz exhibits surface damage and chute has deployed. It's use as escape pod for re-entry to Earth is impossible.  Sip, Ryan. Sip. Drifting is good. We want to drift. I wasn't kidding about those fumes. This can has one or two good thrusts left. If we're lucky....  Steady...  Ready... aim...  ...fire.  I can't. Can's empty. We're coming in fast and we're going to hit hard. Grab onto anything you can and hold tight!  Grab a hold. Grab anything.    Shit... shit...  You have to let me go.  You have to.  Those ropes are too loose, I'm pulling you with me. You have to let me go or we both die--  Ryan!  It's not up to you.  You're going to make it Ryan.    You need to board the station. Can you see the airlock?    That's because you're breathing CO2 and you're losing consciousness. You need to board the Station.                  No you're not. . I have too much of a head start. That ship already sailed.  Ryan, you're going to have to learn to let go.      Alright. Keep going  What kind of name is Ryan for a girl?  Are you close to the airlock?  Keep going.  So, now that we have some distance between us- you're attracted to me, aren't you?  Well, people say I have beautiful blue eyes.  I have brown eyes... that hurts.      You know, Ryan is a nice name for a girl. Wow, you should see the sun on the Ganges. It's amazing.         Ahhhh! Alright, check your watch. 13 hours, 11 minutes. Call Anatoly, tell him he's been bumped.  Bit gloomy in here. How `bout a little light?  Trust me, it's a hell of a story.  That's better.  I found a little extra battery power. I'm just happy you're still alive. To be honest, I thought your chances were slim to none. By the way, did you find the vodka?  Oh well... To Anatoly! Na zdorovje.  No? Right, let's get out of here.  We're `bout a hundred miles to the Chinese Station. A little Sunday drive.  Course we can.  Well, there's always something we can do.  Did you try the soft landing jets?  Well landing is launching it's the same thing, didn't you learn about that in training?  But you know about it.  Listen you want to go back or do you want to stay here? I get it, it's nice up here, you can just shut down all the systems turn out all the lights, and just close your eyes and tune out everybody.  There's nobody up here who can hurt you, it's safe. Then what's the point in going on, what's the point of living?  Your kid died, doesn't get any rougher than that, but still it's a matter of what you do now. If you decide to go that you've gotta just get on with it, sit back enjoy the ride. You have to start living life, Ryan.  Ryan, you have to learn to let go ... Hey?  It's time to go home.",
        "Kowalski": "",
        "Aningaaq": "",
        "(voice)": "",
        "Shariff": "Nearly there. Replacing battery module A1 and C.  No... no... no Houston, don't be anxious. Anxiety is not good for the heart... The system is ready to re- activate.    Kinda like winning the lottery, isn't it?  Including holidays?  Nothing rad, it's just a new set of eyes to scan the universe.  Kowalsky!  Is this great or what?!  Roger.  They shot down their own satellite?  Heads up!  Need some help there Matt?"
    },
    "imdb_rating": "7.7",
    "description": "Dr. Ryan Stone (Sandra Bullock) is a brilliant medical engineer on her first shuttle mission, with veteran astronaut Matt Kowalski (George Clooney) in command of his last flight before retiring. But on a seemingly routine spacewalk, disaster strikes. The shuttle is destroyed, leaving Stone and Kowalsky completely alone - tethered to nothing but each other and spiraling out into the blackness.—MuTaTeD",
    "name": "Gravity",
    "genres": [
        "Drama",
        "Sci-Fi",
        "Thriller"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNjE5MzYwMzYxMF5BMl5BanBnXkFtZTcwOTk4MTk0OQ@@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}