{
    "filename": "Groundhog-Day_script.txt",
    "imdb_id": "tt0107048",
    "imdb_url": "https://www.imdb.com/title/tt0107048",
    "characters": [
        "Ned",
        "Doris the Waitress",
        "Buster",
        "Phil's Assistant Kenny",
        "Mrs. Lancaster",
        "Old Man",
        "Anchorwoman",
        "Larry",
        "Groundhog Official",
        "Rita",
        "Gus",
        "Ralph",
        "Phil",
        "Man in Hallway",
        "Nancy"
    ],
    "dialogues": {
        "Ned": "Phil! Phil Connors! I thought that was you!  My oh my! Phil Connors. Don't say you don't remember me, 'cause I sure as heckrfire remember you. Well?  Ned Ryerson? Needlenose Ned? Ned the Head. Come on, buddy. Case Western High?  I see you clicking through that brain of yours. Click-click, c li ck- cli ck, click-click--Bing! Ned Ryerson, did the whistling trick with my belly button in the talent show. Bing! Ned Ryerson, got the shingles real bad senior ^year^ almost didn't graduate. Bing again! Ned Ryerson, went out with your sister Mary Pat a couple of times-- 'til you told me not to anymore. Well?  Bing!  Phil, I sell insurance. -16-  Do you have life insurance, Phil? 'Cause if you do, I bet you could u s e more-- who couldn't?--but I got a feeling you don't have any. Am I right?  That's okay. I'll walk with you. When I see an opportunity, I charge it, like a bull. Ned the Bull, that's me now. Some of my friends live and die by actuarial tables, but I think it's all just a crap shoot anyhoo. Ever heard of single .premium life? That could be the ticket for you, buddy. God, it's good to see you! Hey, what're you doing for dinner?  Hey, look out for that first step! It's a doozy!  Hey, Phil!  Phil! Phil Connors! I thought that was you!  My oh my! Phil Connors. Don't say you don't remember me, 'cause I sure as heck-fire remember you. Well?  Bing! First shot right out of the box. So how's it going, ol' buddy?  Now it's funny you should mention your health 'cause you'll never guess what I do. -30-  Bing again! You're sharp as a tack today. Do you have life insurance, Phil? 'Cause if you do, I bet you could use more -- who couldn't?\" -- but I got a feeling you don't have any. Am I right?     Hey, Phil!  Phil! Phil Connors!      Hey, Phil! Phil Connors 1  He remembers me!  Phil! Phil Connors! I thought that was you!  Uh, I gotta get going. Nice to see you, Phil.  But Phil told me you were his accountant!  Let me just tell you about single premium life--",
        "Buster": "He came out, and he saw his shadow. Sorry, ladies and gentlemen, but it looks like it's going to be a long winter.   There, little fella.  Jake! Call the police, and get the word out. Somebody kidnapped Phil. We're going after him. Come on, Tommy!     Nobody takes my groundhog and gets away with it. .. · .     Okay! I know this road. There's no way off ' cept the way we come up.",
        "Mrs.": "Did you sleep well, Mr. Connors?  Would you like some coffee?      I wonder what the weather's going to be like for all the festivities.     Did you sleep well, Mr. Connors?  Would you like some coffee?   I wonder what the weather's going to be like for all the festivities.  Is that the Italian dessert with the brandy and the chocolate mousse?  Oh, will you be checking out today, Mr. Connors?  Painting something, Mr. Connors?  W o u l d you--        Isn't it a wonderful collection?  You can take a book up to your room if you like.      Really? That's quite a long time, isn't it. I hope you're finding things to do in our little town.  Oh, my! -120-  I'm not surprised.",
        "Lancaster": "Did you sleep well, Mr. Connors?  Would you like some coffee?      I wonder what the weather's going to be like for all the festivities.     Did you sleep well, Mr. Connors?  Would you like some coffee?   I wonder what the weather's going to be like for all the festivities.  Is that the Italian dessert with the brandy and the chocolate mousse?  Oh, will you be checking out today, Mr. Connors?  Painting something, Mr. Connors?  W o u l d you--        Isn't it a wonderful collection?  You can take a book up to your room if you like.      Really? That's quite a long time, isn't it. I hope you're finding things to do in our little town.  Oh, my! -120-  I'm not surprised.",
        "Old": "",
        "Man": "Morning .  Think it'll be an early Spring?  Hey, Phil! -15-  Nothin's goin1 on. We're closin1 the road. Big accident up ahead. Blizzard movin1 in.  Are you nuts? We got a major storm movin' in.  Pal, you got that moisture on your head.  Mister, the only place anybody's goin' on this road is back to Punxsutawney.  Morning.  Think it'll be an early Spring?         I'll say. -28-     A real beauty, huh. We picked it u p at a--  Well, the sticker says $62,999 bu t if you want--  He ain't there.  You can wait all night, but he ain't coming out. He don't live there. They keep him in the library.  Plug him once for me. -78-  Morning.  Think it ' 11 be an early Spring?  Oh.  Oh, my God! He's having a heart attack!  Lay him down! -108-  What do I do? He's not  He's turning blue! Help!  Jerry, you okay?  I think that did it.  Phil! Good morning!",
        "Anchorwoman": "",
        "Larry": "Did he actually call himself \"the talent?\"  Prima donnas.  What happens to some people? They're born nice. They grow up nice. You put 'em on TV and - bam! Prima donnas.  Rolling.      You ready? We better get going if we ' re going to stay ahead of the weather.  We better get started. We're going to miss it.  You want me to roll tape?        Rolling. -34-   You ready? We better get going if we're going to stay ahead of the weather.   You ready? We better get going if we're going to stay ahead of the weather.   I don't believe it. Someone bought every distributor cap in this town. We're going to be stuck here all night1   The guy's nuts. He's out of his gourd.     This oughta be good.   You ready? We better get going if we're going to stay ahead of the weather.  What ' s that?   Yeah, great.  Sure, why not?  Is he making this stuff up?  Sure .  Look, I told you! He's nuts!",
        "Groundhog": "A family of groundhogs is nestled together in their burrow sleeping off the end of a long winter.",
        "Official": "Right. -80-  Hi, there, mister. Something I can do you for?  Hey! What 're you -- !  All right! We got him now. -82-",
        "Rita": "Gil, if it's all right with you I ' d rather follow-up on the nurses' strike. -5-  Yeah, okay.  I've never done a weather story before. What's Punxsutawney like?  Do you always joke?  A lot of people around here think you're not very sincere.  I'll line up a crew and transportation. If you don't feel like driving, we can all go up in the van together.     No, thanks.  It's okay. I'll handle it.  What's the problem, Phil?  You're not staying here.  No, Larry and I don't care but I thought you might, so I booked you at a very nice bed and breakfast on Cherry Street. Here's the address.  Whatever I can do.  Whatever I can do within reason. Would you like to have dinner with Larry and me?  You mean like a date?  Oh, no.  Well, that's something to look forward to. I'll see you in the morning.  How could he be late?  It's just so-- inconsiderate.  Here he comes. Phil! Hey, Phil. Over here!  Where've you been?  You're incredible.  Ready when you are.  Looks like they're starting. Roll tape. -18-   You want to try one that's a little sweeter?  That was really lousy.  A real professional would have handled it. You acted like it was a personal insult. Who do you think you are -- Wolf Blitzer?  Yes, I do. As far as I ' m concerned there are no little stories, Phil. Only little reporters with big egos who think they're too good for the job they have to do.  Is that so.  Nice working with you, Phil. See you around. Rita walks away, leaving him sitting alone.  Here he comes. Phill Hey, Phil! Over here!  Where ' ve you been? -31-  I know you're losing it. What are you doing over here? The camera's over there.  What is this?  I can't!  Are you drunk?  I don't know. Can you?  What are you trying to say? -32-        What?  Phil , there is no tomorrow on this one. It's Groundhog Day.     Larry!   Are you going to get on your mark?  I'm begging you, all right? Gould we please just do this?   That's it. I'm going to kill him.      For Channel 9 News, this is Rita Hanson in Punxsutawney.     You never talk about work.  Do I want to know? -39-  You whatl This is not some kind of rock and roll tour. We don't have the budget for that--  Phil, what are you doing?   Could I have some coffee, please?  Thanks.  Okay, so tell me. How'd you know where to put the camera?  I know, but the groundhog doesn't do exactly the same thing every year, does he? -40-  You're having deja vu?   Uh-huh. I'm waiting for the punchline.  I'm wracking my brain, but I can't even begin to imagine why you'd make up something like this.  Okay, I'll bite. What do you want me to do?  I see. You know, Phil, you can charm all the little P.A.'s at the station, all the secretaries, and even some of the weekend a nchors, but not me-- not in a thousand years. -41-  Not if I was dying and your breath was the only cure; not if having your child was the only way to preserve the human race. Just get it out of your head because it is NOT GOING TO  Yeah, , I ' m . ready, Larry.  Good luck, Phil.  Is this some new fad diet? Don't you worry about cholesterol? -52-  What makes you so special? Everybody worries about something.  \"The wretch, concentered all in self, Living, shall forfeit fair renown, And doubly dying, shall go down to the vile dust from whence he sprung, Unwept, unhonored, and unsung.\" Sir Walter Scott.  That's really funny. When are you going to grow up, Phil?  You really do have a death wish, don't you?  I wouldn't even know what it means to go wild.     And how. . , do we manage that?  I'll take my chances with the -weather. But you have a good time.  Phil!  You look good. I mean, it came o ut all right. How'd you know where to put the camera?        I don't know, Phil. What are you dying of?  I ' d just want to know where to p ut the camera. What are you looking for, Phil-- a date for the weekend?   Is this real or are you just going to make me feel like a fool?  Close.  I guess I want what everybody wants-- you know, career, love, marriage, children. So far I don't have any of it. -62-  I have a job. Doing stories on the Punxsutawney groundhog is not my ultimate goal. No offense.  This is getting too personal. I don't think I ' m ready to discuss these things with you. What about you? What do you want?  O h , please--  Phil, you know, you have so much talent and ability. If you'd just drop the attitude and act like a decent human being, then maybe I ' d --   I don't know what.  I don't know. It's sort of like the way I feel about UFO's. I'd have to see it to believe it. -63-  Yeah, I'll be right out, Larry.  I've got to get back. I'll see you later.  That was great. How did you know     Okay.  Tequila,with lime. Gold, if you've got it.  Okay.  Same for me, please.  Your call.  I always drink to world peace.  Same for me, please.  To world peace.  It's okay. I think it could be really challenging. Of course it's about a million miles from where I started out in college.  At Bryn Mawr? No, uh-uh. \"Believe it or not, I studied Nineteenth Century French Poetry.  At Bryn Mawr? No, uh-uh. Believe it or not, I studied Nineteenth Century French Poetry.  This is terrific.  How do you know so much about Punxsutawney?  That is so true! I've always thought that, too.  Oh, yuk, don't make me sick.  There's something so familiar about this. Do you ever have deja vu? -68-  I ' m just amazed. And I'm not easily amazed.  How you can start a day with one kind of expectation and end up so completely different.  Yes. I like it very much. They stop dn front of Phil's hotel. She turns to him.  You could never have planned a day like this, but it couldn't have been more perfect.  Thanks. See you tomorrow.   I don't know, Phil--     Thanks, but --        You don't even know me!  What's wrong with you!   Oh, no. I can't believe I fell for it. This whole day was just one long set-up. And I ate fudge. Yucchh! I hate fudge.  Stop saying that! Do you really expect me to trust you? The whole secretarial pool is a Phil Connors recovery group. -71-  That's for making me care about you.  Are you all right, Phil? You look terrible.  Let him finish, then I'll call the station.  Where were you this morning? How could you possibly miss the shoot?     Let's go! Phil just snatched the groundhog!   What is he doing? What can he be thinking? He must1 ve just -- snapped.    I ' m sorry. What was that again?  You're God?  That's reassuring. For a mintute there I thought you might be crazy.  Because you survived a car wreck? -85-  Really?  Why are you telling me this?   No t you-- him.  You're not a god, Phil. Take my word for it. This is twelve years of Catholic school talking.  Please.  Because it's not possible.  What are you doing?  Lovely ring.  This is some kind of trick.  How about that guy?  Her?  How do you know these people!  This is nuts. -88-  (trying to puzzle it  Everyone knows that.  How are you doing this?  B u t , Phil-- -89-  Larry?  I don't --     How did this start?  This is great.  Just how well do we know each other?  Did we ever...you know?  Come on.        Not that it would've been so awful.  I just had to know whether to smack you or not.  Good.  I don't know. I don't know how else you could know so much. Maybe it is really happening. -92-  It sounds so-- lonely.  Maybe I should spend the rest of the day with you-- as an objective witness. Just to see what happens. Okay?  It would take me a year to get good at this.  Is this what you do with eternity? -93-   MMMM. Pepperoni and olives. My favorite .  (taking a bite of  What's the worst part?  No --  No, you're not.  Or completely clean.  Wait! Have we done this before?  You getting me up here, the card gam e, the pizza--     Well how does it feel to be doing something completely new?  Sometimes I wish I had a thousand lifetimes. One to be a great journalist. One to, I don't know, go back to school, study art, or auto mechanics. One just to take care of all the busywork, you know, pay the bills, get my car tuned up. One to be the wild woman of Borneo. One to be Mother Theresa. Maybe it's not a curse, Phil. It all just depends on how you look at it.  I want you to know, it's been a really nice day for me.  Maybe, if it's not too boring for you, we could do it again.  You're still here!  I thought you were supposed to disappear-- or I was or something.  You rat! -96-  You knew I was waiting for midnight!  Oh, I can't believe you! (she slugs him with a  No.  I'm sorry.  No, it's all right. I'm not tired. What were you saying?   Really? -97-     Good-night, Phil. -98-  Oh, hi, Phil.  Thanks!  We're just setting up.  Really? -99-  Sounds good to me. Larry?  All right. Thanks, Phil. Good work.     There would still be an absolute morality. There has to be an absolute good, regardless of the circumstances.  I don't know. From my freshman Philosophy course, I guess.  Nothing. I just can't believe you're such a fine sculptor.  Where do you have to go in Punxsutawney?  Here?  -- basking in the warmth of their hearths and hearts, I couldn't imagine a better fate than a long and lustrous winter.    Late for what? Phil?  Could you break it down and wrap out of here by yourself, Larry?  Thanks . -107-     The hospital?  All right, now what's going on?  Phil, this is too -- I must be dreaming. -1 1- 1  Is he -- ?  In a minute.  May I see that?  \"Every night, by cold bricks  Now what?  This is incredible. Who's wedding is this? -113-  I don ' t understand . You rush from one person to the next in a town you only visit once a year, you know everything before it happens , and you -- - I don ' t know , you seem to be Punxsutawney ' s leading citizen.  Who are you?  No, there's something going on with you.  That's pretty amazing. \" -115-  Do ctor Connors?  Making a snow man? I'll help.  Can I look?        What?  (looks back at the ice    Glad to see you, too.  Are you always this jolly in the morning?  You must've had some dream. -1 1 9 -  Phi l? Phil!     Where're we going?",
        "Gus": "You mean like if the world was gonna end?  You're right. Everyday is the same, I can't get out of here and nothin' I do matters.  What was the question?  Hey, uh --  Yeah, Phil-- like the groundhog.  Hey, Phil? How're we going to get out of this?",
        "Ralph": "No, he's askin1 you a question, ya idiot.  What if nothing mattered?! Jeez, I know what I'd do. I ' d j ust spend all my time drivin' fast, gettin1 loaded and gettin' laid. That's it.  (fumbling with his  Thanks , man .  Oh, hey, take a left!  You missed it!  You can say that again.  No more rules!   That's two!  I'm having a great time!  Yahooooo!  Don't believe I've had the--  Well, who don't?",
        "Phil": "Oh, no! Not again.  Forget it! I'm not going.  Get away from me. I'm working.  No way. All that moisture coming up from the Gulf is going to miss us completely and take a dump on Harrisburg.  Jesus, Gil, give me a break, will you! I covered the goddamn groundhog last year and the year before that.  You should've killed the guy who made you do that.  Then you should've killed yourself. I don't want to get stuck with the groundhog for the rest of my life. -4-  Many people are morons.  What'11 you give me?        Oh, it's an enchanted place. A magical world. It's the Constantinople of the whole Western Appalachian-Susquehanna Drainage system.  About 70 to 80% of the time. Inside I'm actually a very shy and sensitive person.  Tell me the names of these people.  I think I'll take my own car. I ' m not that fond of my fellow man. -6-  Nice face.  Why don't you ride up with me?      They don't really think of me as a weatherman around here. More of a \"personality,\" but with the credibility of a first-class broadcast journalist. Once you look at my tape I think you'll see what they mean.   Dan, can I call you back? I've just been handed something and I better get on it... (he picks up some papers and rustles them for effect ...Okay, thanks. -7-     (gently pushing her  Our relationship? We went out a total of four times! And only twice did anything happen. It was fun but I don't see that as a big commitment.  See? So we've already done this. Let's move on. Next case.  That's what I ' m trying to tell you. You don't want to be with me. You can do better. Look, Stephanie, if I ever said or did anything to mislead you I'm sorry for that, but right now I have to do this groundhog thing and I don't have a handle on it yet.  I'll tell you what. I ' m going to do some serious thinking while I ' m in Punxsutawney, okay?   I'm on my way to Punxsutawney... (forced to repeat it, a little embarrassed Punx^su-taw-ney....Work or fun? I think that all depends on you.  . . . . I thought maybe you could meet me up there tonight and let me vulgarize you for about seven hours....So I ' m supposed to spend the night in Punxsutawney all alo ne? Thanks.   Rita! I can't stay here.  I hate this place. I stayed here two years ago and I was miserable. It's like a minimum security prison. I'm not staying here. -10-        Really? Will you be my love slave?  No thanks, I've seen Larry eat. Why don't you ditch Larry and let me take you someplace nice?  Yeah.  Okay. I get it. You're a little intimidated by me, you're all excited about the shoot tomorrow, you want everything to go just perfect. I understand. You just get some sleep. Tomorrow will be great. -11-      Never again.  Morning .  I ' m predicting March 21st.   Like a Roumanian orphan, Mrs. Lancaster.  I don't suppose it1 d be possible to get an espresso or a capuccino around here.  Forget it. This '11 be fine. -14-  My guess is it'11 be cold and overcast, high today in the low 30's, dropping to the low 20's tonight, but I'm predicting that all that moisture coming up from the Gulf is going to miss us and dump some locally heavy snow, possibly blizzard conditions with travel advisories in the Harrisburg area and maybe as far east as .Philadelphia. (off her surprised  Unfortunately yes.   I 'm sorry. Have we-- uh--  Ned?     So what're you doing with yourself, Ned?   No kidding.  You know, Ned, I ' d love to talk to you but I really have to--  Dinner? Umm, I don't think that's going to work for me.  I got hung up with some jerk I went to high school with. So, did you sleep okay without me? You tossed and turned, didn't you?  Who told you?   Once a year, the eyes of the nation turn here, to this tiny hamlet in Pennsylvania, to watch a master at work. The master? Punxsutawney Phil, the world's most famous weatherman, the groundhog, who, as legend has it, can predict the coming of an early spring.  And here's the big moment we've all been waiting for. Let's just see what Mr. Groundhog has to say.  Hey! Over here, you little weasel!  Great shot, huh, folks? Well, that was certainly worth the trip. Now we'll be hearing from Mr. Buster Greene, President of the Punxsutawney Groundhog Club, the so-called Seer of Seers who will interpret for us. -19-   Well, that's it. Sorry you couldn't be here in person to share the electric moment. This is one event where televison really fails to capture the excitement of thousands of people gathered to watch a large squirrel predict the weather, and I for one am deeply grateful to have been a part of it. Reporting for Channel 9, this is Phil Connors.   That's as sweet as I get. I'm outa here.  Is it my fault the little rat went south on us? -20-  God, you really take this stuff seriously, don't you.   You really don't know me very well, do you. 'Cause if you did you could never say something like that about me. I care! Call me a cockeyed optimist but I happen to think there's more to this job than just getting my ugly mug on the boob tube every night.  Yes, that is so.  So as far as us getting together, would you say the glass is half empty or half full?  You don't have to rush off, you know. That storm is 'going to miss us completely. -21-   I'll call you after I see the network guy. I should be back there in a couple of hours...What?...1 can't hear you-- you're breaking up...Hello? Sabrina?  Sabrina ? Can you hear me? Shit! He slams the phone back into it's cradle, then looks up and notices slow traffic up ahead. He honks his horn as the traffic comes to a complete stop. He keeps honking but nothing moves. He rolls down the window and looks up ahead. The highway is a parking lot.  No. No!  What's going on, Officer? -22-  What blizzard? A couple of flakes! An isolated phenomenon of nature.  No, no. All that moisture is going to miss us and hit Harrisburg.  But I have to get to Pittsburgh today!  So all the long distance lines a re down? What about the sa tellite? Is it snowing in space?...But I have to call Pittsburgh...Isn't there some special line you keep open for emergencies or for celebrities?...Well, I'm both really. I'm a celebrity in an emergency. Can you patch me through on that line? -23-  You never saw me on TV-- on the news?  I ' m the White House correspondent for NBC news.  Ask me anything?  Three bedrooms, two and a half baths. Looks much bigger than it , is.  Good start. I ' m sure they'll be very happy. So what do you say? You want to play doggie obedience school with me? -24-  Sit! Stay!  He stands at the sink, looking at himself in the mirror, flexing his muscles .            Nice going guys. That's yesterday's tape. -26-  Chapped lips --     Morning.   Didn't we do this yesterday?  Don't mess with me, pork chop. What day is this?  Okay. Sorry. I'm having a bad day.   D i d I? I don't know--  Yes, thank you. I ' m feeling a little strange.  Did you ever have deja vu, Mrs. Lancaster?  No, that's spaghetti. Never mind.     Ma'am? Excuse me. Where's everybody going?  Ned Ryerson?  To tell you the truth, Neddy, I ' m not feeling real well. Could you excuse me?  (very distressed and desperate to get away from this guy Do you sell insurance, Ned?   Did I say \"fuck off, \" Ned? I can't talk to you right now.   I've got to talk to you. I think I'm losing my mind.  Slap me, Rita.     I said hardl  Do it!   Better. Almost too hard, Rita.  No, drunk is more fun. Can I be serious with you for a minute?  Yes. I ' m being serious. I' m having a problem-- no, I may be having a problem.  I'm trying to say that if I was having a problem, just hypothetical ly, I ' d like to know that you're someone I could count on in a crisis.  Were not going to miss it. (indicating the other  Okay, put it here.  Put the camera here .  We were in the wrong spot yesterday .  Just trust me. Put the camera here . -33-  No hurry.  Okay, let's do it.  Roll tape.   We ll, it's Groundhog Day-- again-- and you know what that means. Everybody's here on Gobbler's Knob waiting in the cold for the appearance of the most famous groundhog in the world, Punxsutawney Phil, who's going to tell us just how much more of this we can expect.  My forecast is we're going to see the groundhog peek its head out of its hole, look around a little bit, then he's going to come out, scamper over to this general area, look at the crowd for a second, make a little burping noise and run back into the ground.  O k ay ? And here we go-- -35-  Phil is on the phone desperately trying to make a call.   I know there's a blizzard, but I have to get a call through to my doctor in Pittsburgh. It's a medical emergency. . . .No, don't give me the Punxsutawney Fire Department. When do you think the long distance lines will be working again?. . . But what if we don't have a tomorrow? We didn't have one today, my friend... Hello...Hello?     I ' m conducting an experiment.           Okay, campers, rise and shine, and don't forget your booties because it's COOOLD out there today.  It's cold out there everyday. What is this -- Miami Beach?  (with forced good  How was that?  Could I talk to you about a matter that is not work related?  Do you know what I did last night?  I destroyed my hotel room.  No, it's okay. This morning it was all right again. That's what I have to talk to you about.  Because I've done it before.  I ' m not talking about last year. I ' m talking about today. I lived it before.  Big time. Rita, I know it's nuts but I keep reliving the same day o ve r and over-- Groundhog Day-- today. This is the third time.  No, really. It's like today never happened. I shaved my head last night, today its all grown back. I could probably cut off my limbs, one by one, and - pop! They'd grow back. Just like a starfish. I probably don't even have to floss?  'Cause I'm not making it up. I'm asking for your help.  The truth? I'd 1ike you to spend the next 24 hours with me and don't leave my side for a second.  Wa it a second--  So much for the truth.  Yeah, but you're still a psychologist. You must have had some course in school that covered this kind of thing.  So based on that what would you say?  You're saying this thing is not really happening to me?  Then how do I know this conversation is really happening?  Then forget about me paying you.  Wait! Are you saying I'm crazy? -43-  You think that's a realistic possibility?  Gus, what would you do if there was no tomorrow? -45-  No, I mean like if it was never going to end. If everyday was the same and you were stuck here and you couldn't get out and nothing you did mattered?  That's it. It just doesn't get any better than this, does it? Good friends, good conversation and quality brew. Drink up, boys.  Hey, friends don't let friends drive drunk. Give me your keys. -46-  It's nothing. Get in.   Seatbelts.  This is great, Ralph!  No problem --  So many rules -- -47-  \"Don't do this--\"  \"Don't do that -- \"  No more rules!  Having a good time?  Phil. -48-  Right.     Yahooooo!  It's cold out there everyday. What is this-- Miami Beach? -49-     Mrs. Lancaster, has anyone been around here looking for me this morning? Maybe a state official, blue coat, hat, gun, nightstick, badge, driving a late-model Ford br Chevy, black and white with bub ble lights on top--   Apparently not.  Ned! Ned Ryerson! Ned the Head!  You here to see the groundhog?  What's your name?  Where'd you go to high school? -51-     Who was your twelfth grade English teacher?  I'm waiting.  Walsh. Nancy, Lincoln, Walsh.  I'm not really sure. We'll have to see.  I don't worry about anything anymore.  That's exactly what makes me so special.   What?  (stares at her for a long moment \"There was a young man from Na n t uc k e t-- \"  At this rate-- never. (he pulls out a pack of  Just the opposite, Rita. I have a life wish. I'm just trying to enjoy it. Taking pleasure in the little things. Don't you ever just want to cut loose and go wild? -53-  Yeah, well, that's where I come in. Going wild is one of my specialties. Last night I got completely loaded and drove head- on into a police car.  That's my point. I know you won't believe me, but we could do anything we want today and it wouldn't matter one bit. Absolutely no consequences. Complete and total freedom.  You leave that to me. Why don't you send Larry back and hang out with me for the rest of the day? You never make it through that blizzard anyway.  Don't worry. I plan to.  Nancy? -54-  Nancy, right?  Nancy Taylor? Lincoln High? I sat next to you in Mrs. Walsh's English class.  Phil Connors.  You don't remember me, do you?  We used to shoot spit balls--  I even asked you to the prom.  Yeah.  I ' m great. Wow, you look terrific. Hey, listen, I gotta d o this report--  Weatherman. Channel 9, Pittsburgh.  But maybe after we could --     Oh , Rita .      O-rita.   Yes, it is. You don't usually find this many trashy novels in one place.  No, thank you. I've actually read them all. I was just rereading some of the dirty parts.  Indefinitely. I've already been here for 211 days.           You guys ever been held up before? (they shake their  Yeah. By the way, I'm Phil.   Herman and Felix. Okay. Take it easy, boys. And thanks.  I'll take it. How much?  I'll tell you what. I'll give you $70,000 if you just knock off the car salesman stuff and let me get out of here with my car.  Yeah, we are, we are. But first I have this movie theater fantasy I want to talk to you about.     (more to himself than to Angie Yeah, but eventually you' d just get tired of screwing around and then you'd want a real relationship, wouldn't you?  Get down, Brunoi  Someone decent, someone who you respected, who respects you. -60-  Down , Bruno !  It's tough to find a relationship like that, especially if your time is kind of limited. But you still have to try, don't you?  Bruno! I told you! Off the bed!  There ' s got to be more to it than this.  Psychic. So did you have a nice evening?  I got my whole body tattooed and part ied all night with some nymphomaniac biker chicks.  No, they're gone. Rita, if you only had one day to live, what would you do with it? -61-  No, I mean like what if the entire world was about to explode?  No, I just want to know you better. What do you like, what do you want, what do you think about, what kind of men are you interested in, what do you do for fun?  I'm just trying to talk to you like a normal person. Isn't this how normal people talk?  Okay, so talk to me. C'mon, I'll buy you a cup of coffee.  You have a career.  How about the other stuff? You seeing anybody?  What I really want is someone like you.  Why not?  You'd what?  Then maybe you'd like me?   Why don't you stay for a while? The road's going to be closed anyway. Do you really want to be stuck in the van with Larry for three hours?  Rita gets in the news van and drives off with Larry. Phil stares out the window, more\" determined than ever to win her over.  Well, you heard it right from the groundhog's mouth. Bundle up good, 'cause it's going to be a long winter-- at least in Punxsutawney. Reporting for Channel 9, this is Phil Connors.         Oh, hi, Rita. You still here?      Jack Daniels.   Oh, hi, Rita. You still here? -65-  Wouldn't you know it. Buy you a drink?   Tequila with lime, gold if you've got it.   What should we toast to?  To the groundhog!  Tequila with lime, gold if you've got it.  To world peace.  You like your job?  You weren't in broadcasting?   Really? What a waste of time.  You weren't in broadcasting? -67-  La fille qui j'aimera Sera comme bon vin Qui se bonifiera Un peut chaque matin.  Best fudge in town.  I like small towns. I think they engender real community more than big cities.  No kidding. Here-- try the white chocolate.   No white chocolate.  What?  About what? -69-  Do you like how this day is turning out?  You're wrong. I've been planning this day for weeks. Rita ignores the remark and hugs him. Phil tries to kiss her but she gently puts her fingers to his lips, stopping him.  Tomorrow? Wait, aren't you going to come up to my room for a while?  No·reason to end a perfect day.  No, you should. The, uh, the poetry! I've got some books, Rimbaud, Beaudelaire, we could l ig ht a fire-- -70-  (seeing it all slip   But there is no tomorrow for me!  Why not? Rita, I love you!   Please! You have to!  No, it was real. I love you.  But I can change! I really can--           It's cold out there everyday. What is this -- Miami Beach? Haw. Not hardly. And you can expect hazardous travel later today with that, you know, blizzard thing.  Hi, Nancy.  No, I guess not. I thought you were someone else.     You don't know me? I've been playing here every day for two months.  I don't know. I seen you.  They call me-- Punxsutawney Phil.  Yeah, like the groundhog.        Who are Watson and Crick.  What is \"Twelfth Night.\"  Count Basie.  Two thousand six hundred and s e ve n ty -o n e--  two thousand six hundred and se v en t y -t w o --  two thousand six hundred and seventy-thr-ee-^-  Hey, pick up after your dog!  He's going to!  There and there. And there!  Two thousand six hundred and seventy-four, two thousand six hundred and seventy-five, two  S i x hundred--  Two thousand, four hundred--   Yeah, I got a problem, buddy! I can't stand this place anymore! I can't stand this street and I can't stand the fourteen bars and the five banks and the one star food and the bad weather and the \"quaint\" little shops and most of all, I can't stand anything-- ANYTHING-- with a groundhog on it.   Phil.  Yeah, like the--  --groundhog.   There is no way this winter is ever going to end as long as that groundhog keeps seeing his shadow everyday. I don't see any other way out. He's got to be stopped and I've got to stop him. For Channel 9 news, this is Phil Connors.  The groundhog looks right into his sights. Philsqueezes the trigger. LOUD GUNSHOT. The glass window is still intact, not a scratch on it. The groundhog looks up playfully. Phil fires off four more rounds but, again, no results. Phil can't believe it. He charges the glass and pounds it with the rifle butt. He can't even chip it. Suddenly he is seized from behind by TWO STRONG MEN who take the rifle from him and wrestle him to floor. The librarian comes running up and looks at the groundhog.  (at the end of his  Coming to the end of the trail, Phil. Then we're going out in a blaze of glory.  Okay, pal. It's showtime.      He slowly opens his eyes and blinks. He looks around and realizes he's back in his room at the bed and breakfast.  Ah, nuts!        I'm a god.  No, I'm A god. Not THE God-- at least I don't think I am.  No, it's true. It's the only possible explanation. I'm a supernatural being.  (to Rita, ignoring the  --but I always wake up the next day without a scratch, without even a headache. I'm telling you, I ' m immortal.  Because I want you to believe in me.  How do you know I'm not a god? -86-  How do you know?  Hey, Billy!  This is Bill. He's been a waiter for three years because he left Penn State and had to find work. He likes the town, he paints toy soldiers, and he's gay.  This is Doris Kleiser and her fiance Fred.  They're supposed to get married tonight but Doris is having second thoughts.  This is Ralph. Say \"Hi,\" Rita.  Ralph hates his life here and wants to drive around town smashing into policemen.  Yes, it's a trick. But maybe the real God cheats, too. Maybe God isn't omnipotent-- he's just had a lot of practice.  Tom. Worked in the coal mine ·til they shut it down.  Nancy. Went to Lincoln High School in Pittsburgh. Takes herself out to lunch once a week.  I told you the truth. In five seconds there's going to be a grease fire in the kitchen. Five, four--  --three, two, one.  I know all about you, Rita. I know you like producing, but hope for better than Channel 9, Pittsburgh.  You like boats but not the ocean. There's a lake you go to in the summer with your family, up in the mountains, with an old wooden dock and a boathouse with boards missing in the roof, and a place you used to crawl underneath to be alone, and at night you'd look up and see the stars. You're a sucker for Rocky Road, Marlon Brando, and French poetry. You're wonderfully generous; you're kind to strangers, and children; and when you stand in the snow, you look like an angel.  I told you! I wake up every day right here, right in Punxsutawney, and it's always February second and I can't turn it off. If you still don't bel iev e me, listen--  Listen! In ten seconds Larry is going to walk through that door and take you away from me.  But you can't let him. Please believe me. You've got to believe me.  Look.  Afer I got over the shock, it was kind of fun for the first year or two. I had anything I wanted. Except you, of course. -90-  I don't know. I just woke up. Just like always.  Rita, this is Ned Ryerson. He's an asshole.  Trust me on that one.  No, it isn't. You hate fudge.  I told you. I know everybody.         You're European trained, aren't you.  You weren't interested.  I understand.  You did.  So do you believe any of this?  I used to try to stay up all night sometimes. I thought if I could stay conscious I could figure out what was going on, or at least hang onto something from the day before. But I gave up on that a long time ago.  (trying to shrug it  Yeah, sure. That'd be okay.     It's not in the wrist so much as the fingers. Be the hat.  Uh-uh. Six months. Four, five hours a day.  Now you know. It's like waiting for a bus that never comes . You should see me play pool -- and bowling, juggling, hacky sack. I can ride a unicycle.  I'll get it!  Hi, Marty. $11.75 including the delivery charge, right?  Of course. I told you, I know everything .  That's not the worst part.  The worst part is starting over everyday. Tomorrow you won't remember any of this. You'll go back to treating me like a complete jerk --  It's not your fault. I am a jerk. -94-  Okay, I ' m not. It really doesn't make a lot of difference. I've killed myself so many times, I don't even exist anymore. I'm just completely empty.  If you're going to be this positive all the time I may have to rough you up a little.  Which part?  No, this is the first time.  Well, what?  Good. Really good.  Me, too.  I hope so.  I know.  Not 'til six.  I never said midnight--  But I never said it.  Does that mean you're going?  It's okay to go to sleep you know. I promise I won't touch you-- much.  I was saying that the cow was eventually returned to it's rightful owner.  That's right.  What I was going to say was, I think you're the kindest, sweetest, prettiest, most wonderful girl I ever met in my life.  Shhhh. That's good. (satisfied she's still  I know a guy like me could never deserve to have someone like you, but if I did, I swear I would love you for the rest of my life.  Good-night, Rita.  Rita?  Thought you might like some--  Careful, it's hot. Larry?  You know, I bumped into Buster Greene, he kind of runs this thing, and he tipped me off that we might get a better shot over there.  I mean, maybe we should go for it. What do you think?  I'll get that.   You and I never talk, Larry. You got kids?  Where would I find the Philosophy section?  I ' d like a piano lesson, please. -100-  I'll give you a thousand dollars.  Buon Giorno, signore. / '. . ' · - :  \"Winter slumbering in the open air wears on his smiling face a dream of Spring.\"  Technically, yes.  In fact, the groundhog's legendary ability to predict the weather may be more than just the German folklore of the region. Higher temperatures trigger hormonal changes in the testosterone levels of male groundhogs, which may in fact wake them from hibernation and send them out to battle with other males ;for mating rights. So, the truth is they're not looking for their shadows, they're looking for groundhog chicks.  Groundhog Day, February second, also known as Candlemas Day or the Feast of the Purification of the Virgin Mary, the day Mary first came to the temple for ritual blessings following the birth of the infant Jesus, and celebrated since the Middle Ages by the sacramental lighting of candles. Hence the old Scottish couplet which long predates the .American groundhog tradition: \"If Candlemas dawns bright and clear, there'll be two winters in the year.\"  But what if the rules changed? What if none of your actions had consequences?  Oh, is that so, Miss Plato? Then let me ask you this. Where does this \"absolute good\" come from? From the sky? -103-  What?  I gotta go.  I got piano and then drums.  Come on, I'll drop you off.  Ned? Ned Ryerson! I don't believe it. I've missed you so much. -104-  One day. I'm gifted.  Hey, mister. Hey. Come on, let's get you somewhere warm.  (helps the old man to his feet There you go.  How is he?  What'd he die of?  I want to see his chart. Excuse me.  Not on my watch.  Come on . Hang on . Hang on , there . Breathe . -106-  ...When Chekhov saw the long winter, it was a winter bleak and dark and bereft of hope; and yet, we know winter's only one more step in the cycle. And standing among the people of Punxsutawney -- (Phil looks directly at  For Channel 9 news, I ' m Phil Connors.    Sorry. I'm gonna be late.  Hey! Did you forget to look both ways? You didn't even look one way.  Yeah, well, my doggies are freezing, but I ' m still gonna watch out for cars. See you around, kid.  If you're going to eat steak, get better teeth, will you? Enjoy the rest of your lunch, gents.  Rita!  I'm sorry, I'm really pressed right now. Meet me outside the hospital about 5:00 and we'll talk about it.  Try the curlycue fries. Killer.  She's not diabetic. It's an overdose. Let's get her up here and pump her stomach, then I want a complete blood work-up, STAT.  Call me Phil.  Exactly.  A giraffe? Let's see. It's just like a dog with a biiiiig-- what was it?  A big tail? Okay, a big tail.  There. A dog with long legs.  Oh! Right! A dog with a big head.   Come on. We have to hurry.   That little bastard has never thanked me once . I ought to j ust let him fall. Teach him a lesson.  Yeah, you and me both. Come on, We're almost done.  Yeah. Let's go.  Come on. You'll see.  Just some friends. Dorisi  How's it going, Fred?  Are you kidding? Don't buy that playing hard to get stuff. She's crazy about you, you stud.  Congratulations.  I don't know. I just thought about you two, tried to picture what you ' d want more than anything in the world and it came to me. Bing! Wrestlemania.  What do you want to know?  I really don't know.  Okay, I wake up in Punxsutawney on February second -- every day. It's supernatural. I don't even try to explain it anymore. So, I live each day as if it's the only day I've got.  You want to know what's really amazing? I've been waiting for you every day for ten thousand years. I dream of you every night of my life. You've been my constant weapon against total despair, and just knowing you exist has kept me alive. How's that?  Hello, Mary. Rita, this is one of Punxsey's finest musicians.  N o , I--  Wait! Don't move!  No, stay there. Stand right th ere.  O kay, look.  This is how I see you. When it all gets too much, I just close my eyes and there you are-- just like this. Take it home and keep it in the freezer.  This one's for the Frog Prince.  Nothing.  Will you come with me?  It doesn't matter. Really, it doesn't.        You're here! My god! I can't believe you're here!  No! It's happened. Don't you get it? It's tomorrow! It's --  I love those guys.  No groundhog! Rita! They're all gone!  Did I just dream it?  Yeah!!!!  It really happened! You're really here!  You're really actually here.  Let's go!  Anywhere! Everywhere!  Florence! Say hello to Rita. She loves me.  That's all right. I--  Thanks, Carl.  And so began my final lifetime, and ended the longest winter on record. I would find myself no longer able to affect the chain of events in this town, but I did learn something about time. You can waste time, you can kill time, you can do time, but if you use it wisely, there's never enough of it. So you'd better make the most of the time you've got. -121-  Larry never got through the blizzard, so none of my groundhog reports ever made it on the air. But Rita and I-- we lived happily ever after.",
        "Nancy": "I don't think so. What part of the news do you do?  Oh , I ' m so sure .  Okay, how big is the White House?  Thanks. I'll pass.  Can you think of another reason anybody'd be out here at dawn on a freezing day?  Nancy Taylor. And you are--  What is this?  Lincoln High school. In Pittsburgh. Who are you?  Are you kidding?  .Mrs. Walsh.  Is this some kind of come-on?  I'm sorry, I--  T h at --  --is amazing!  I don't-- sure, I think--  Yeah, oh, God--  Phil Connors.  How ARE you?!  You're a reporter?  Right, I should've known--    Yeah, yeah, I ' d like that --     (not entirely"
    },
    "imdb_rating": "8.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZWIxNzM5YzQtY2FmMS00Yjc3LWI1ZjUtNGVjMjMzZTIxZTIxXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_QL75_UX380_CR0,2,380,562_.jpg",
    "description": "A weather man is reluctantly sent to cover a story about a weather forecasting \"rat\" (as he calls it). This is his fourth year on the story, and he makes no effort to hide his frustration. On awaking the 'following' day, he discovers that it's Groundhog Day again, and again, and again. First he uses this to his advantage, then comes the realisation that he is doomed to spend the rest of eternity in the same place, seeing the same people do the same thing every day.—Rob Hartill",
    "name": "Groundhog Day",
    "genres": [
        "Comedy",
        "Drama",
        "Fantasy"
    ]
}