{
    "filename": "Happy-Feet_script.txt",
    "imdb_id": "tt0366548",
    "imdb_url": "https://www.imdb.com/title/tt0366548",
    "characters": [
        "Baby Gloria (voice)",
        "Lombardo (voice) (as Johnny Sanchez III)",
        "Rinaldo (voice) (as Jeff Garcia)",
        "Baby Mumble (voice) (as E.G. Daily)",
        "Mrs. Astrakhan (voice)",
        "Gloria (voice)",
        "Nestor (voice)",
        "Ramon /Lovelace (voice)",
        "Noah the Elder (voice)",
        "Miss Viola (voice)",
        "Raul (voice)",
        "Norma Jean (voice)",
        "Seymour (voice)",
        "Memphis (voice)",
        "Mumble (voice)"
    ],
    "dialogues": {
        "Gloria": "",
        "(voice)": "",
        "Nestor": "",
        "Raul": "",
        "Seymour": "",
        "Memphis": "",
        "Mumble": "You ever feel small?  Like you're no-one, cos the world is full of us, and everyone's the same  How do you stand out from the crowd? How do you find someone special?  I know. I know. \"You sing your heart out.\" That's how mum found dad in the first place  With them it was love at first song.  But with me everything was a different, right from the moment I was born  First rule of survival: get yourself laid before winter.  Apparently I only just made it.  Afterwards Mum went off to the sea to keep warm. Dad stayed home like dad's do, incubating.  Tell me what it is about the cold and the dark. Soon as the sun goes away, everyone gets religious  Caruso's the leader because he's so incredibly old. Some say more than 40, but you know how penguins exaggerate.  My dad was never that devout. Often his mind was on other stuff.  I guess he was wrong about a lot of things.  (hopping from one foot to the    Is she coming soon?  Tell me again what she's like  Sorry. When I get happy my feet get happy too.  But Why Dad?  Gee I'm hungry  What's fish look like.  Did she get one. Did she bring one back.  Can I see it?    After that, with food being so scarce everyone was busy busy busy. Mom and dad were working so hard I didn't see much of them. Besides I had school to go to.  Swimming? Catching Food?    Mine is more sort of a...  Bim bam-a-loolah a bim bam bom  You like it?  It's not?  Oh, La la la la la  La la la la la la la la!!  But that's what I'm doing,  Whats funny? What's funny?  I'm thinking.  What?  Feelink...ok.  I'm being spontanuous.  Oh yes.    Its tough when you realise you'll never fit in. Plus I was beginning to moult  I couldn't face the class in this mood So I just kept going.  Looking for what? I don't know? A different type of penguin?  And that's exactly what I found.  Not the nicest place in the world but at least you could do what you liked here.  Me? Oh, nothing. What are you doing?    But ...but. I'm a penguin.  I don't have juicy bits! Look... all bone and feather! Feel for yourself.  Wait! WAIT!  Every seen anything like this?  Hey! What's that on your leg?  How...?  Unbelievable.  You don't say  At least those aliens didn't eat you.  So - You think I could appeal to your better nature?  Compared with that, school almost seemed like fun  Most days I hid at the back, dreaming about the world beyond  Time passed. We all grew up  But right up to graduation I never did find my heartsong  Caruso. He couldn't help himself.  Dad, Ma, can I go with the others  Dad? I'll learn to sing later. I'll find my voice out there. In the deep. Truly.  Dad. Pul-eeeze.  Yeooow!!  Thanks Pop. See ya Ma.  Outta my way flipperbirds! Coming through!!  Whatcha waiting for? It's fantast...  I had an instinct I'd be good at this. Actually we all were. We were the best.  Ella?  I've got you! No I don't.  Yes I do.  The only bad thing about being with Ella. It was always so darned crowded.         Hey. The fish is for Ella Take it. Really. Its for you      \"...AaahhhhHhhhhhhhhhhhhHhhhhhh...\"  I know. I know     OK! I'll quit. OK!    OK. I'm awake now. You got me  Saw you. Richard? Eddie? Ella....  ......aaarghH!  Everybody out!! LEOPARD SEAL!!   Yeah go chase someone your own size, ya big.......blubberhead.  Do what?  Well...I just kind of go ...like this...and then this...  Or how about ...  Wow, there are so many of you!  The shortage has affected you too?!  Why funny? That's terrible  So why aren't you guys collecting them  ....you think I could get some of it?  You really think so?  So for a while I forgot about finding a song altogether.  ...We were a team  ...there was so much to do, so much to see  ....stuff down there beyond my wildest imagining.  Oh! There you are  Guys!    I want to speak to you.  But its dead. It can't hurt you  But that's what we have to find out. Don't you see. Things like that could be eating the fish.  The who?  Why stones? Wait for me  I was wondering. Have You ever been abducted by Aliens?    ... and he said he was abducted by Aliens.  Looks like they bestowed it very tight.  So these Mystic Beings, did you see them?  Did they have frontways eyes? No feathers? Fat flabby faces? Did they probe you and stick a pointy thing into you?  But I haven't had any answers yet!  We don't collect them. All we have to do is , well... We sing  La la la la la la la laaaaaaaaaaaaa!!  See. That's how I ended up with you guys. And emperor who can't sing isn't an emperor at all.  You can?!  Tall and tanned and young and lovely The Girl from Ipanema goes walking And when she passes each guy she passes goes `Aaaah'  Oh, and I want her so badly How can I tell her I love her? Yes I would give my heart gladly  But each day when she walks to the sea, She looks straight ahead not at me....\"    Ella. Wait!  I'm sorry.  Don't care? I never stopped thinking about you.  I can't sing.  But I'll show you something better  Sing something to this!  Just try it. This once.  Okay, that'll work. Just keep it going.  This is it Ella! This is the song inside me!  I'm just showing them Happy Feet    My own opinion? I think living beyond the ice there are creatures we've never met before Aliens. Mystic Beings. Big, flabby......   This is craziness  You too pa?!  No. Dad. No. What have they done to you. You're talking like Caruso.  No. You're nuts. All of you. I'm outa here.  Its no use Ella. I can't live with that.  Guys. Can Me and Ella be alone for a bit  OK. Here's what I'm going to do. I'm going to talk an alien. I'm going to find what's causing the shortage  Its the only way. You're right. Unless we have food theres no future for any of us - you, me the adelies, anyone  Give me a year, just until the next great gathering. If I don't make it back ....at least I tried  Now go back. I love you. Go.  To find the mystic beings.  We'll ask Loveday. He's been there.  Just one question! And I want a straight answer! Where do I find the Mystic Beings?  No. He's choking! The Talisman's gotten way too tight.  Stop. You're hurting him.  LOVEDAY, where did you get it?  They didn't bestow it on you?  If it wasn't bestowed, what happened?  And then....?  You looked up and...... It just got caught around your neck?    But this thing was made by someone. And if we find them, they could take it off.  So where do we Go, Loveday  The forbidden place is over the mountains...  ...In the land of the Elephant Seals!!?  ...Beyond the land of the Elephant Seals!!?  So who's coming  Hear that?!  Excuse me, we need directions...to the Forbidden Shore.  We're looking for the Mystic Beings  Aliens, the ones who made this.  Could they be taking our fish?  But If your grandpappys saw them and they survived, maybe they're not so fierce.  Come on Loveday, lets go  They don't know. They've never been there  So we walked ... and walked .. and kept walking. Over the hills and into Blizzard country  We need to huddle!  Form a moving circle! Share the cold, share the warmth!  I said a circle!    You think this is it? The Forbidden Shore?  Hello?! Is there anyone out there?  Hello!!  What is it?  They must be here somewhere. They wouldn't leave all this stuff lying around.  A whale?  The ones with teeth!!  No!! Stay on the ice pad where its safe    Aliens?!  Stop! Please!....  ...It's very important!   They've stopped!  Say Hi to Ella for me  Oh. One other thing. You guys  Excelsi yah!!!     Too loud.  Too loud!  The Convergence?  I'm trying to talk to the Aliens!  On the black iceberg. The ones taking all the fish!  They kill whales! That's impossible  So if I wanted to talk to them, where would I go  Where's that. Do you think the Whale would take me there?  When I finally saw one, the Alien was even more hideous than I'd imagined  ... frontways eyes, no feathers. Big teeth with blood around them. Strange fleshy beak. A meat eater    We can't live without them!  Speak Adelie? Skua-talk?  Oh no! Not the pointy thing!  I woke in darkness. Unable to move. Was I dead? And if I was dead, where was that light coming from  Wow. They brought me home  Excuse me, where are we.  Oh. So we're dead. Right  Where?  Every day after that, it rained fish in the afternoon.  Fish on land and fish underwater.  Sometime you got a live one but there was nowhere really to chase it  Aliens everywhere, watching you eat, watching you sleep    After a while, you learn to stop fighting it. Stop protesting, take the knocks.  ...just take what comes and live inside your mind  Sometimes I thought about dad and mum. Sometimes the Amigos, and others I'd met along the way. But mostly I thought about Ella, wondering who she ended up with. Whether she had enough food to eat. whether she still remembered our song.  What? What did I do?  You like that? Well how about this.  Yes. Yes. At last something was happening. I was finally getting through to them!  Hi, where is everybody!?  I used to live here. When's the Great Gathering?  This is all that's left?  Ella! Is it you. You haven't changed a bit.  Are these all yours?  So. You never....  But that's fantastic. I've got so much to tell you - to tell everyone. I found out who's been causing the Scarcity!  I know who's been taking our fish! I made contact with Aliens! They're coming here. Right behind me. Listen.  No, honestly Aliens will be here soon! You have to believe me. We came in a big hollow bird and they landed on the ice and....  But its true!!  It's so they can find me. That's them now. Listen.  You said they didn't exist.  No. Do this. Do Happy feet.  Its what they understand. They can't talk, they can't sing. They speak with their feet. Do it.  Come on, everyone! Happy Feet! It's our only chance!    That's it! Excellent! ¡Riba Riba, penguinos! Shake those hips. Come on, bust a move!!  From that day on, No one quite knows how it happened, but the black icebergs began to disappear and the fish became abundant once more.  Ella's gave up teaching to look after our chick. We take turns looking after her and going to get the fish.  I worry about her, sure. Theres so much big stuff out there it can be kind of frightening.  But the way I see it. Theres so much out there we don't understand...,  Or am I not making sense here?"
    },
    "imdb_rating": "6.4",
    "description": "This is the story of a little penguin named Mumble who has a terrible singing voice and later discovers he has no Heartsong. However, Mumble has an astute talent for something that none of the penguins had ever seen before: tap dancing. Though Mumble's mom, Norma Jean, thinks this little habit is cute, his dad, Memphis, says it \"just ain't penguin.\" Besides, they both know that, without a Heartsong, Mumble may never find true love. As fate would have it, his one friend, Gloria, happens to be the best singer around. Mumble and Gloria have a connection from the moment they hatch, but she struggles with his strange \"hippity- hoppity\" ways. Mumble is just too different--especially for Noah the Elder, the stern leader of Emperor Land, who ultimately casts him out of the community. Away from home for the first time, Mumble meets a posse of decidedly un-Emperor-like penguins--the Adelie Amigos. Led by Ramon, the Adelies instantly embrace Mumble's cool dance moves and invite him to party with them. In Adelie Land, Mumble seeks the counsel of Lovelace the Guru, a crazy-feathered Rockhopper penguin who will answer any of life's questions for the price of a pebble. Together with Lovelace and the Amigos, Mumble sets out across vast landscapes and, after some epic encounters, proves that by being true to yourself, you can make all the difference in the world.—Anthony Pereyra <hypersonic91@yahoo.com>",
    "name": "Happy Feet",
    "genres": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZWU2NDkxYjktNWVlMS00MTM4LWJjMDAtOWYxZjJkZWFhYzAxXkEyXkFqcGdeQXVyMTA1NjE5MTAz._V1_QL75_UY281_CR0,0,190,281_.jpg"
}