{
    "filename": "He's-Just-Not-That-Into-You_script.txt",
    "imdb_id": "tt1001508",
    "imdb_url": "https://www.imdb.com/title/tt1001508",
    "characters": [
        "Army Recruit (as Carmen Perez)",
        "Sorority Girl (as Zoë Jarman)",
        "Crying 20-Something (as Kristen Faye Hunter)",
        "5 Year Old Girl",
        "6 Year Old Boy",
        "Sous Chef",
        "Jogger",
        "Tokyo Girl",
        "African Woman (as Délé)",
        "Consoling Friend",
        "Army Recruit",
        "Sorority Girl",
        "Mother"
    ],
    "dialogues": {
        "Sous": "",
        "Chef": "",
        "Jogger": "",
        "Tokyo": "Shigeru's inability to commit clearly stems from his failure to properly imprint on his mother during breast feeding.",
        "Girl": "Why did you do that?  Made.    Of.    Dog.    Poo.    Shigeru's inability to commit clearly stems from his failure to properly imprint on his mother during breast feeding.  No, that's OK. I got it.  Thanks for mixing that up.  Alex asked me to get the dip together. Thanks for getting it started.  Hmmm - could use a little more dill.  Alex, you want me to start cleaning up?  No.   I got it.  YES!!    Suck it!  Did you say it's past three?     Man, I gotta go.",
        "Consoling": "",
        "Friend": "I'm sure he forgot your hut number.    Or didn't get enough approval from his father. Or was eaten by a giraffe.",
        "Army": "",
        "Recruit": "",
        "Sorority": "",
        "Mother": ""
    },
    "imdb_rating": "6.4",
    "description": "Needy Gigi Haim is a young woman seeking her Prince Charming somewhere among her unsuccessful dates. After dating estate agent Conor Barry, Gigi anxiously expects to receive a phone call from him, but he never calls. Gigi decides to go to the bar he frequents to see him, but she meets his friend Alex who works there. They become friends and Alex helps Gigi to interpret the subtle signs given out by her dates.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "name": "He's Just Not That Into You",
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNzdlMTI1NDYtMDdhOS00MGUwLWEzZDQtMTllYmQ3N2Q1YzJiXkEyXkFqcGdeQXVyNDI3NjU1NzQ@._V1_QL75_UY281_CR3,0,190,281_.jpg"
}