{
    "filename": "Heist_script.txt",
    "imdb_id": "tt0252503",
    "imdb_url": "https://www.imdb.com/title/tt0252503",
    "characters": [
        "Fast Food Cook",
        "Mickey Bergman (as Danny Devito)",
        "Bobby 'Bob' Blane",
        "Don 'Pinky' Pincus",
        "Jewelry Store Guard",
        "Waitress",
        "Joe Moore",
        "Betty Croft (as Patti Lupone)",
        "Coffee Cart Man (as Mike Tsarouchas)",
        "Fran Moore",
        "Fast Food Customer",
        "Jimmy Silk",
        "Jewelry Saleswoman",
        "Counterman",
        "D.A. Freccia"
    ],
    "dialogues": {
        "Waitress": "Heat it up?",
        "Joe": "",
        "Moore": "Gold.    ...waal, so it takes a little bit of thought...             Five is correct.                 ...what is it, I'm a doctor...                            What do you think?  I won her in a raffle...    I'll tell you what, then why'nt you go build one...  ...we'll be here...    ...we'll be here.    What do you want me to bring you back?  Everybody's lookin' in the shadows.         ...what's he likely to do...?   What'd you, come into some money?     You know where I'm going.     Me and the girl, gone get on the boat.  ...that's right.  ...that's right...  I worked for it. What're you gonna do...?       I met him a long time ago.  Yeah, I think I did.       I'm burnt.   They got my picture.    Yeah, I'm gonna have'em pound the dents out.  Waal, they're honorable scars.  Kind of you to say so.  Anybody can get the goods, the tough part's, getting away.  Plan a good enough getaway, you could steal Ebbetts Field.  What'd I tell ya...?  Yeah, why're you telling me that?  ...why're you telling me that, Bill? That half of it's mine. I know half of it's mine. Because, you'll remember, me and my crew? Went in there and got it.  ...you remember that?  Yeah--well, it's a shame...   I need my money. I owe the crew... I owe my crew, Bill...  Yeah, if it was you n'if it was me.     I owe my crew. And I got to go. I got to get outta town.  Woulda shoulda coulda.  You're too kind.  What is it I understand...?  Here's mine? I did the job. Me and my crew. We brought you the swag, we're going to take our cut.       What do you want, we're supposed to do, sit back, put our feet up while you fucken rob me?  I got to go.  What do you want from me?   They got my face on a Cereal box...  Gimme our cut, we worked for, my crew, we do the Swiss Job.  Bag's empty... The bag's empty, Billy... Put the bag down, it's empty...    Alright.  I said alright.  No.  I'm telling you I'll think about it. Lemme think about it.             I'm sorry...  What is it I tell you?  Izzat right...    Sell the beat. Call the guy, sell the boat.  You quote him our figure, sell it to him for cash.  That's the sweetener.  You say \"cash,\" he knows we're hungry. He'll counter ten, twenny percent less, you kick around, and accept it.  Let him get it tomorrow.   You bring him the title for the boat.  ...I'll meet you in Mexico.     I ain't going til I make sure we're goin get the money...  ...I can't go down there with nothing...  We're gonna play some ringolevio.     I'm gonna need your help--Look here:    Alright.  That's right.  It's very sporting of you to say so.  I'm going to need some walking-around money. And I'm going to need my men's share, on the last job.  Give it to me  ...you got it in your pocket.    ...stunning.  ...how do I insure my cut?  ...you lost your amateur standing. Here's what the thing is: I go with the gold. I go with the gold, or there's no deal. I take my half, you take your half on site, we're done.  Now:   what's your little surprise.    ...he's got terrible manners.     Okay, so You called us one, we called you one. The way you get along's you're gonna go along. Okay, we're done negotiating, gimme the money I'll see you on the fourteenth...    I'll tell you what, you make the decisions, and I'll bitch at you. It's Fun to Play Pretend!  You do whatever the fuck you have to do...    You want to show me another way?  Then we go together.   Zat so?  Yeah, well, the time was I was the Law West of the Pecos.  And now the Time Was, I got to get out of Town.      You wanna wash any laundry out inna street...? ...you said you were gone take care of it, take care of it. ...are you in or out...?    Is he going soft on me...?  Well, then. What's the thing?     Am I missing something...?  I got to Bobby...  Tick tock.  The cops got me on tape.   I got to go...  But everybody gets his cut from the Jewelry store.  I'm trine a figure out a way, get somebody, throw me inna briar patch.    Awright, you want to go to work...?                   Yeah, well, you know, that was his road game.       I got to redo some of these figures.  Because, lemme explain it to you: because when it starts to go sour, someby's gonna be pissing their shit, look'n around, shoot someb'y inna head, I'd like to have an alternative idea, is the explanation.     One minute twenty seconds...    Y'ever cheat on a woman? Your girl, something... Stand her up?  D'you ever do that?  When you called her up, d'you have an excuse?  What is she didn't ask?   What was your alibi, a waste of time?         I found a Hotwalker for him.  Well, it could be...  ...then don't pry. I have to redo the figures on the train...                  Hey: what the hell...? What the hell...? Scuse me, scuse me, officer, we were sposed to have a detail, doing security for us...  No, it burns my butt... we're out there, we're out there, side-of-the-road, workin' on the highway, for... I know it's not you, I'm sorry, I know it's not you, but...  If this was the first time...          But it's not the first time... we're sposed to have police pro...            I'm trina... I'm trina... You fucken lame, you want to leave me dead, th'whole crew, the side of the highway?  You fucken cowboy, I oughta Tell me why I don't leave him out inna ditch somewh... Get us the fuck outtahere.  ...put you down like the fucken dog you are... you gonna come, shoot your way to stardom? Don't do any...  I don't want you to do anything unless and until... we hit the City, ditch the car.  You do it, you do it. You do it, Pinky...         It's gonna work if we make it work.   How's Fran doing?    Well, it's always the pretty girl stays home, innit?  That's what I hear.  I'm very resilient.  I got a more striking profile.  I never liked the way I looked anyway...    ...he can't hear what you don't say...        How we doing?  I'm done. Well, that's it them.   You got the detonators?  I know we checked'em. What I'm doing, I'm. I'm asking you a question.  Yeah, well, I went to the Other camp, which is Fuss it to Death, and Fuck it into a Cocked Hat, or do you want to run the show...?        Yeah:    Let's go get the money.   It's either gonna be a monumental heist, or a real amusing anecdote.  Why?  I hope to tell you...     What?  Well, it's a nice boat.  That's right.    ...what is it?  ...what car?  ...they found it, how'd they find it?    I tole you to it? I tole you to ditch it in...  Did you wipe it down...?  Did you wipe it down...?  The job stands...  Shut up. The job stands. This joint is burnt.  Meet at the Overpass.  The meet at the overpass.   The 14th...  Get him out of here.       ...that's right.    You get his cut to Bobby...?  I'm okay now.  ...we're taking down the Boat guy.  That's right.  It's enough, get us away...  That's right.  So was World War One.  Yeah, well, it's all in a lifetime...  That's what they tell me.  I'll send you a Papaya.  Say good-bye to your niece.    Cute, huh?         I would of done that.  ...that's right...  Soon as we get the money.      Call the guy.   Get us the money...    Landline.    Buncha Old Men, talkin' about Old Touches...  Cuttin up Old Touches, th'time So and So overslept. You know what...?  Then I'll tell you what, is pee ess, if my name's on the thing, then whose fault is it in the First Place, we're having, fight our way Back to Even.  ...that's right.   In a contest of Cunning, a Stupid Person will get the better of a Smart one Every Time... Who said that...?  Well.   Help me remember it, huh...?  You know, we're goin' down there with nothing...  ...yeah?  Is it enough for you...?  I'm about ready to go South.  ...that's right.  Hey, I got you, what do I care...?                 Flirt with the guy.  No problem. Can we meet him at His Bank.  Superior.   You get the address.   When?  Right now. Right now, tell him we got another buyer, we...               ...would you move into the light...? No, don't turn around. Just move into the light...      What do you want? What're you, the Social Service Lady?  ...what did you, come to take the Baby back...?   What do you want?    How about that.    ...try him back...  ...call him back...  Hold on, here...     Din't you just make yourself dispensable?  You my self-help program...?    That would be my wife.  That's correct.    You wanna play the dozens. Here you go: They called, there was a bookkeeping error at the Hospital, you died at birth. Your turn...  Eh? Cat got your tongue?   You wanna make peace.  Don't you know when a man's whipped, for chrissake?   ...the boat guy?  Call him back. Get him back.    I'm gonna be Don Ameche in a taxi, honey. Get up.  Get out. Get out.    You wanna tell me what I'm going to do...?        It's me, put it away.       ...what's the move...?        I can't go for the gold til I can see how to get it home...  Uh huh... why'd you leave him the plans?   Why'd you leave him the plans?   He forgot his \"cheat sheet.\"     S'why he came back.   He said that's why he came back.   Well, hell, for the luvva god, we're going to do something, let's do it. Okay. Okay: Fran:   You want to suit up?          Oh yeah.  Uh huh...  Yeah?           ...get me the name of a freight forwarder.  ...a freight forwarder. Okay. Alright.    ...what's the Lady's name?  What do we chat her up about?     You got to givvem breakdown calls on actual vehicles, which means you'll have to go to the Rental...    ...take the wrappers off, hang em in the air, get the drycleaning smell out.  ...where have you been...?          ...I don't give a fuck. The only thing is: Get the Gold. Get the gold, Baby. Get the Gold. They ain't gonna pay for Yardage...              Mrs. Croft? Betty Croft...?    I understand. ...I believe we've met before, on my last...?   We will be conducting a Security Check. I will be coming through the metal detector in approximately ten minutes. I will be quote Armed, and carrying a toolkit in which are hidden three potentially lethal or dangerous items. This is a test of the security personnel and of the apparatus under your control. Now. I must caution you that, from that time to this you will be under covert surveillance, and should you attempt to communicate              ...yeah... okay... okay... it's okay.          Gimme a cuppacoffee.                   Where's the, uh, where's the girl's usually here, your Supervisor? They lett'n you play all ? They lett'n you play all by yourself?  Uh huh...        ...how tired I am, I left my...    Please tell me the code for the main gate.      Please tell me the code.             ...we have a report of...   ...make sure they're breathing...                                     Is he with her...?    Where's my explosion, I'm up here naked...   Who?  Forget it.   Let's...  Yeah, well, that's a Hazard of the jjj...  I told you on the day, they had me, you...  I stay with the gold.  You're gonna side with the guy, you're gonna side against me? You gonna talk against me, Fran?  I stay with the gold. I stay with the gold.  I got to go with the gold.  You go.   See you at the rendezvous...      Then we'll all go together.  You don't have to, Baby...    I follow you to the rendezvous... Gimme the keys...      ...stay with the ggg...  ...what's, what's the deal, you're gonna leave me, alone, in the...                   I ain't feeling too well.            ...thank God.  It would mean my job...             No, she won't be calling in till she ditches the guy.  She could talk her way outta a sunburn.  Let's finish up...    Yeah.  Says he's fine.  That's what he said.      Good of him to keep in touch.           How're you doing? Blane's Okay.      Billy's Okay, Pinky called, he...   Let my wife go.        What is your real name?  What was it before you changed it?    Let the girl go, I'll give up the gold.  I'll give up the Gold, Me and the girl leave on the boat.  Search the boat.    You let me walk away.  Me and her.  What did you do to her...  Hold on, hold on, let's siddown...  One second.   Hold on...  Take the gold. Take the gold off, leave me the boat.     Where would you like it to be...?              How you doing?        I just did.    Hey, you can't worry about every little thing...    Ain't that so.  Well, what more can you say of anyone?  Yeah?  ...what?  Because he asked them to.  Yeah, that's no bargain.   Send your cut there...?  That I will, Pal.  Zat where I'm going?          Yeah, I knew you'd show.  Yeah, I wouldn't clear my throat, without a backup plan...  End of the day, though, end of the day, what's the important thing...?  What's the important thing...?  You heard. Come on, get in.  C'mon, get in, we'll talk on the road.     You heard about Pinky...  Yeah, well, it just went bad there, that little bit. Dinnit...?    ...yes, it did... it got kind of convincing.  Well, you can't do it halfway, can you...?  Indeed you do.   Well, but didn't you do great. Played it down to the last recorded syllable...  Never seen it done n'y better.   You hotwalked that dude so good.  Cooled him out the livelong day.   You made it look so real.    ...what d'you mean, \"that's part of it?\"  I was talking about Pinky.  I said we paid the price.         And you said.   We paid part of it.  ...what's the rest of it...? What's the rest of it...?           Oh.    Was it...?  Well, you can't think of everything.  I'm sorry.  I'm sorry...    He ain't gonna shoot me?  Then he hadn't aughta point a gun at me. It's insincere...   Oh, God, I'm tired...  Well, no.   You told me, \"you knew him before.\"  You said that. Well. You must be under quite a lot of stress.  It was a pretty plan, though, wunnit...?  Thanks for everything.  You think so?  Well, I missed this trick, though, didn't  ...what?",
        "Fran": "No.   I've got my friends...    You put this boat on the rocks, you bought it.     You have to ask him.     ...Mister Fletcher, tell you what, you put down your deposit, we're gonna fit you one out. Your specs.  Well, this one's not for sale.       Excuse me...  You just come back... Stay in the shadows.  Then where's the place to be...?  Well, then, you stay there, then...     Stay here.   Let Bobby do it...     ...alright:    what if we...  ...what do you tell me?     What is it you tell me?  \"Any situation, stand it on its head.\"  So:  stand it on its head. What if we...    For cash?  I don't get it.  Where's he gonna get the cash at night?  And you? Hello, Mr. Fletcher...? Could you, I'm looking for Mr. Robert Fletcher. Would you tell him Fran, from Moore Marine.  How're you going to Mexico...?  F'you're taking the boat, Baby, take the boat tonight...   Well, would you tell him...  What're you gonna do about the Other Guys?      Well, I hope I am driving tonight, and I run into some fucked abutment IF THAT'S WHAT THEY'RE CALLED, and Thank you...  Yeah, but I get to drink it first... Can I ask you something...       ...that's right.  ...that's right.    ...seems to be coming along nicely.      ...our friend was telling me \"What Made Him a Criminal...\"    Why would you put a man in a position, he's got no way out?  That's right.  ...he's my Husband.    Z'it gonna work?  ...I love you, Joe...  You know why? Because you're thorough.     No, I'm the Frontier Wife.  You ready to go?      You'll miss the guys.  ...that's right...  No, but you do.  Well.   You've been kicking yourself some...    You did, Baby...  ...that's right...  We'll get the boat money...  That's enough to start over.  The Lord hates a coward... Mr. Mr. Fletcher -- Mr. Robert Fletcher... Well, do you... he asked me to call him back at... Thank you... How you doing?  South we go, Baby.      Hello, Mr. Fletcher, I... This is Fran, from... Yes, I'm sorry to... you gave me this number. On your ccc... Yes, I'm... Well, no, yes, I'll be glad to call back Monday, but we aren't going to have a boat... but we, we just had a situation where, if, No, I realize that, Sir, I don't want to keep you from your pl... I'm calling, because you told me that... Well, it could wait till Monday, but we have another buyer interested in the bbb...  I'm calling to say that if, if you want to make a cash, an immediate cash deal, at the figure which... Well, thank you, sir, that is exactly my attitude.  Superior... Well:            ...hello... hello...?             ...hello...?            Joe, leave him...  ...Joe  ...slipped off.  ...he's gone. I'm sorry, Joe.       Well, you know, I'm with my friends...  No, that's right...       He came back for me  Yes.   ...that's right.   ...you point me.   Well, it's only words.          I'll be alright...    ...what difference, you're going to screw it out of him anyway...               Here they come.      Where's the girl...?          How...?      Joe, he's right if...  I'm saying...  ...you can't make the Roadblock, Joe...        ...no...  ...you left'em up there with Joe...    Just, would you just, however long, the...    We're in a hurry...  You didn't have to hit him...     ...why did you have to hurt him...?    Where the, where the hell, excuse me. Good morning. We've been sitting here, since...  That's not going to do you a whole raft of good. That's dead as Kelsey's nuts...    Don't smoke the cigarette.    We've been here since...  This is great, this is great, a four hour breakdown n'i'm gonna get arrested, all in One Swell Day. Whatsa Charge...?  ...what you hauling...?  Marine 'quipment.    ...it's an auxiliary engine, some rich guy's toy...     You guys wanna wave your magic wand n'make it different, that's awright with me...   Yeah. Lookit the paperwork.    Tell you what, keep the paperwork.  ...lest you need to Throw me in Jail, f'sitting in a Truck...  Hey, y'gonna leave, just when we're gettin' to know each other...?  Ships-in-the-night...     ...you think pretty good on your feet.       Why'd you have to hit him?  Is he going to be alright?  I.    Uh... let's get out of here...  Yeah, you're gettin' too close to me.  Let's get to the Rendezvous.  Let's get there.  Yeah, no, let's go now.  Tell'im what's wrong with it.  Tell im, you had this same problem one time, your truck, and maybe it's the same th...      Yes.   Thank you. I know what you said.    ...not yet.  This is the exit for the meet.  ...this is the...  ...alright.      You missed the exit for the meet.  What am I, just going to go off with you forever?  Take me to the Meet.  I need a drink.  ...I need a drink.     Turn around.  I, uh, I need some time, I need a little time, to...      leave it.  Leave it... walk away from it.     For godsake...    Walk away from it... what are you going to ...come on. Come on... Are you crazy...                   Yeah, well, Can I, uh, can I make a credit card call on that phone?       Well, thank you, Sir. It would be nice, to meet a gentleman... to meet a gentleman for once in my life... But I, uh... I, uh...      I, uh... thank you, I just need to uh...     ...that was the stupidest thing... the stupidest thing that...             Don't hurt him...      I gave you up, Baby.     I gave up the gold.  I gave you up. I had to.          I'm sorry, baby.    Good, good plan, baby...  That's the right way to do it.  That's right.  Shame about Pinky...  Y'all loaded up?  Yeah.   I heard. I'm sorry about that.  Yes, It did.  ...and, so, you got hurt.  No, anything you do, you got to do full-out. Don't you?  And, sometimes...  That's right. That's what you taught me. That's part of it.  I went to a good school.  ...thank you, Joe.    Well, you know...  I don't get you?  Uh huh.  Yes.    That's right.               Well...  You knew it was over...    Cause it's over. It's all done.    That's the deal.  No.    That's right. I did.  Get in and drive I'm sorry.  Hmm.  Cute as a Chinese baby...  You'll be alright.  You always are.  ...the best laid plans of mice and men...  I said Nobody's Perfect. You take care. Alright, let's go.",
        "Jimmy": "",
        "Silk": "",
        "Jewelry": "",
        "Saleswoman": "",
        "Counterman": "No, I don't think so.",
        "D.A.": "",
        "Freccia": ""
    },
    "imdb_rating": "6.5",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZDBiNTNlZTMtZjlmNC00ZGI0LWI2YjctODA4MzNlYjEyNzQ2XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "Joe Moore has a job he loves. He's a thief. His job goes sour when he gets caught on security camera tape. His fence, Bergman reneges on the money he's owed, and his wife may be betraying him with the fence's young lieutenant. Moore and his partner, Bobby Blane and their utility man, Pinky Pincus find themselves broke, betrayed, and blackmailed. Moore is forced to commit his crew to do one last big job.",
    "name": "Heist",
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ]
}