{
    "filename": "Hellraiser_script.txt",
    "imdb_id": "tt0093177",
    "imdb_url": "https://www.imdb.com/title/tt0093177",
    "characters": [
        "Dinner Guest",
        "Steve",
        "Evelyn",
        "2nd Victim",
        "3rd Victim",
        "Bill",
        "1st Victim",
        "Derelict",
        "Larry",
        "Moving Man 1",
        "Frank the Monster",
        "Moving Man 2",
        "Julia",
        "Kirsty Cotton",
        "Frank"
    ],
    "dialogues": {
        "Dinner": "",
        "Guest": "",
        "Steve": "We're on the Cointreau.  I'll do it.  So lie down.    You're not going?  Need any help?  (covered in embarrass-  Kirsty?  I thought we'd lost you.  It's late.  Please.  I want to see you home.  All right?  If there's a train.  We walk.  Why don't you stay at Larry's house?  There's plenty of room.  I see.  Meaning what?  I beg your pardon?  We're not all frigid.  Oh no.  (moves closer to  Hey, sex-bomb -  I just called in.  How about tonight?  I'm a late riser.  Catch you later.  What are you doing? Kirsty!  Christ.  What was that about?  What happened to you?  What things?  What's wrong?  I won't let anybody take you.  What?    I'll come back later, huh?  'Bye.  She was trembling all over.  Maybe she's gone back to her -  - father.      Got in downstairs.  Looking for you.  What's going on?  You forgot something -  (signalled more than spoken    Come on!   Come on!",
        "Evelyn": "Doctors -      See you again soon.  Yes.  You must.  We're so happy you're back.  Does it still hurt?",
        "2nd": "Tip it!  Tip it!  Eh, Chas, slow it down like the man says.    Got any beer?    Want to buy a bed?  That your daughter?    Oh.    I've got it.  I told you -  We're leaving.    Will you sign for the bed?  I'd like some more lager.  Did you hear me?  What do you have to do to get some service around here?",
        "Victim": "You're sure we're not going to be interrupted -  Only I like to be careful.",
        "3rd": "",
        "Bill": "Probably thought you'd sue.  HE'S sorry.    You must come round.",
        "1st": "We're not going to get it in.  Look, do you want the bed in or not?  Oh, sod you.  Famous last fucking words.  Have you got it?  What's the problem?  Who are you calling a fucking ass-hole?  It's this bastard bed that's your fucking problem!  He's fucked off.  Sorry.  He's gone upstairs.  So we're fucking off too.  Excuse me, Miss -  Miss!",
        "Derelict": "",
        "Larry": "It's one of these.     Ah!  Success. Voila!  Well.  This is it.  It's just been empty a while.    The best part of ten years.  I wanted to sell it off at one point, after the old Lady died, but I couldn't get Frank to agree.    Look at this.      He won't complain.  He can pay off some of his creditors.  You know we have to let Kirsty see this place, before we do anything to it.  She'll love it.  You don't like it?  You're still blaming me.  You wanted to come back to London.  We came back.  So what's the argument?  Oh Christ.  Julia ...  (exasperated, to  I hear you.  Where are you?  Frank.  He's been here.  There's stuff in the kitchen.  He must have made a hasty exit. That'll be Kirsty.  Hello ...? Hello ...?      I'm surprised it's even connected ... Shit.  Who's there?  Kirsty?  Where are you?    I thought you were going to stay with us for awhile?  You'd like the house.  Do you want me to come over?  Well I want you to see the house.  Well come over, will you? See the place?  O.K. Honey. Well you take care. I love you.  Well?    Wait!  Wait!  Watch the fucking paint work.  Just take it slowly.  It'll go in.    How are you doing through there?  I'll get it.  Honey!  You like?  I'll show you around when we've got this damn bed moved.  Upstairs. Treat her gently, huh?  She hates moving.  (a gently chiding  Kitchen's through on your left  Uh-huh.  Her mother's dead.  Julia's my second wife.  Damn right.  Now are we going to move the bed or not?    Wait!  Wait!  Slowly, will you?  Slowly!    Christ!  My fucking hand!  You fucking ass-holes.  ... Oh Christ ...  ... oh ... Christ ...    I cut myself.  I don't know, I haven't looked. You know me and blood.  (he leans againts  I'm going to throw up.  So damn stupid.  I'll be scarred for life.  - always hated the sight of my own blood.  I go out like a light. Anybody else's?  no problem.  But mine ... you know ... goes straight to my head.  Anyhow, this damn doctor's poking around and I'm saying: I'm going to pass out, and he's saying, no you're not, no you're not.  Next thing I know -  - I wake up On the floor. And it was HIM who was looking sick.  I should do it!  I know.  And he's saying: I'm sorry.  I'm sorry.  Right ... Anyone for more?  Come on, you're only young once -    Steve?  Are you O.K.?  Bill?  Absolutely not.  Sit down.  We've got celebrating to do.  Only when I laugh.  It's round on the left -      Are you there?    Are you there?  Julia?    Oh, babe ...  Can I get you anything?  Sure.   Julia?   Are you all right?   Hello?  I'm O.K., honey.  It's all right ...  Never better.  You sleep well.  I love you, honey.  Kirsty.  Is this upsetting you?  Are you all right?  Only I'll turn it off -  What was that?  No.  Something else.  No.  I'll do it.  What's wrong with you?  I'm here. You're shaking. There's nothing to be afraid of. I'll just go check upstairs ...  Oh baby.  Come with me then.  We must have rats.  See?  Quite safe. Let's go  down.  I'll make it better.  ... oh babe ...  ...I love you, honey ... let me ... oh God ... I love you ...  Oh baby ... I love you ...    What's wrong with you?  I don't understand you.  One moment you're all over me, the next it's:  Don't touch me. I just don't understand.  ... maybe we should never have come back.  I guess.  You don't like her at all do you?  She doesn't even want to leave the house.  It's like she's waiting for something.  I don't know.  I don't know. It's beyond me.    Maybe all she needs is some company.    What's wrong?  What are you talking about?  Of course.  It's all right, sweetheart. Julia's told me everything; and it's all right ...  Whatever Frank did was his error. And it's finished with now.    He was insane, baby:  a mad dog. I put him out of his misery -  I'll go to the police, when I'm feeling stronger.  Try and find some way to make them understand, though God knows I don't really understand myself.  Did he hurt you?    I'm afraid it's true.  No you don't.    Where are you going?  Stay with me -  - it's all right.   Really it is ...  Come to Daddy.  Come to Daddy.",
        "Julia": "We're going to freeze to death.  Maybe somebody changed the lock.  Just a thought -  It smells damp.  How long since you were here?  Why didn't he want to sell it?  Not exactly modern.  I thought half of it was your brother's?  You mean we're moving in?  It's better than Brooklyn.  No.  I'm not.  All right.    Larry! Larry!    Squatters?  He's here?    It looks like a bomb's dropped.  There's some in the 'fridge.        That's right.  Who are you?    Oh.  Oh yes.  I'm sorry.  Of course.  You're very welcome.  Kirsty.  There's a towel in the bath- room.  Just to your left.      Well?  But you said -  What about Larry -       Oh my God.  Oh my God.  Oh my God.    What have you done?  Is it deep?  You're NOT going to faint.  Let me see.  It's probably going to need stitches.  No, you're not. We'll get you out into the fresh air.  Take it slowly.  You're done worse.  No you won't.  Just an accident.  He's all right.  Will you drive?  He needs stitches.  The keys are in the kitchen.  Would you excuse me?  I think I'm going to go to bed.  I'm glad you enjoyed it.    Who's there?  Oh my God.  Who are you?  Tell me who you are.  No.  God no.  What happened to you?  Back from where?  Ssh!  What do you want me to do.  Yes.  What?  Not much.  Why not?  Just soda.  Please.  (looking straight  There's a first time for every- thing.  You want something to drink?  Yes.  I just think we'd be better off upstairs.  Let's not talk about it.  Right.  Come on in.  Make yourself at home.  That's right.  I prefer the floor.  Right.  Why don't you take off your jacket? You're warm.  Maybe I will.  Am I?  What's wrong?  Enough?  Jesus Christ.    Just feeling a bit sick.  I'll be O.K.  Just leave me be a while.  Maybe a brandy.  I'll be down in a minute    Hurting.  Good.  Who?  Just a moment.  Put on some music will you babe?  Keep your voice down.  You're hurting.  Who was it?  Quite sure.  Well?  Then you tell me ... you explain what happened to you?  The Cenobites.  And the box?  Where from?  So they cheated you  And the blood let you out?  You won't have to.  We'll be gone.  Somewhere they'll never find us. Not in the whole wide world.  I've seen worse.  Fine.  Thunder.  Maybe I left a window open - - I'll go see.  It was nothing. Larry ...  I just hate the thunder.  Don't go upstairs.  Please ...  Don't.  ... no ...  No.  No, you mustn't.  PLEASE. No.  Please ...    I don't.  I said no.  Everybody does.  Come in.  She'll tell them everything ...  That's probably her now.  Or the police.  Don't you care?  Maybe we should just leave -  Well we can't just stay here -  I don't know where to begin ...  It's better you see for your- self -  Damn her.  Kirsty?   It's very late.  What's the problem?  Of course.  There's no need to shout.  You look terrible.  Have you had an accident?  This afternoon.  I'm sorry, I don't follow. What was there to see?  Dead.  Where are you going?  (calling after  No, damn you -  Frank!  Help me, Frank. For God's sake.  No, Frank -  Kirsty ...",
        "Kirsty": "I got through.  I found a room.    I said: I found a room.    YOU'D like my room.    I'm not going to change my mind, Dad.    Maybe tomorrow.  I got to go look for a job.  I love you too.  Hi.  Not much.  Dad?  Big house.  Me like.  Is Julia here?    O.K.  I'll be nice.  You get on with the muscle work.  I'll make myself some coffee.  Shit!  Shit!    Have you got a towel?  Hi.  I got soaked.  Which is where?  Did Dad tell you I got a room, by the way?  Waterloo.  Centre of the known universe. Julia?  What's happening?  Where's my father?  Sure.  What happened?  Sure.    That's right.  Cointreau.  I won't be able to stand.  Just upstairs.  I AM house-trained.  I know.  Hello?  Oh, it's you. Are you all right?       You know I do know the way home.  Not that late.     What do we do if there isn't?  Yeah, there's room.  And there's Julia.  She's so damn ... English.  Oh, I don't know.  Up-tight. Frigid.     Oh no?  It's not what I heard.  In a moment.  You keep your - Oh. Hi.  I don't finish till twelve.                      I just wanted to be sure you were O.K.  Yeah.  I love you too.  Maybe you should give it some time.  (skirting her real feelings  I don't know her.  She's so ... sealed up. If YOU love her she must be worth loving.  Just give me some time.  Really?  What?  Sure.  Oh my God.    Keep your fucking distance. Julia!  Where's Julia?  Christ, what have you done with her.  No.  No.  No.  Get the fuck off me.  Don't touch me.  Or so help me -  This isn't happening.    You want it? Fucking have it!      This isn't happening.  I think so.  Tender.  I want to speak to my father ...  Why not?  Um.      Where the hell did you come from?  It's just a puzzle box.  Who are you?  Well, I didn't mean to open that thing.  You can go back wherever you came from.  This isn't for real.  Don't touch me!  Steve.  Thank God you came.  These THINGS ... they want to take me -  No!  Don't let them take me, Steve -    Just go.  PLEASE.  I'll be O.K. I'm going to go see Dad.  He'll look after me -  Will you GO, damn you?  Sure.  Why not?  'Bye.    Wait!  You did this before, right?  To a man called Frank Cotton?  But he escaped you.  HE did.  I've seen him.  He's alive.  I'll take you to him.  Then you take him instead of me.  Back wherever you come from.  Please!   Dad!   It's me! It's Kirsty!  Please, answer me!  Please -  Where's Daddy?    I was here this afternoon.  I saw everything.  Oh God.  Thank God. I thought something might have ... I have to talk to you.  No.  You don't understand. Your brother - Frank - he's here in the house.  And he's -  Finished?  Gone?  I don't believe it.    Yes!  I have to get out.  I can't stay.      God -  Go on.   Kill me.  I don't care.  You bastard  Frank.    We have to get out of here. They'll kill us for the fun of it.  Julia?  Don't!  Shit.  Shit.  Shit.",
        "Cotton": "",
        "Frank": "Can I come in?  Can I come in?  You're Julia, right?    I came for the wedding.  Well can I come in or not?  That's nice to know. Have you got a towel?  I don't want to see the dress.  I don't want to see the dress.  You know what I want.  I want you.  That's better  Forget him.    Don't look at me.  I said: don't look. Help me.  Frank.  Believe me.  It's me.  It's really me.  His blood ... on the floor ... It brought me back.  Just help, will you?  Please God, help me -  ... somebody ...  You can't let me stay like this. Please.  You can't.  The blood brought me this far. I need more of the same.  Or I'll slip back ...    Well?  Don't look at me.    See?   It's making me whole again. Every drop of blood you spill puts more flesh on my bones. And we both want that don't we? Good.  Come here. Come here, damn you.  I want to touch you ...    Who's a pretty boy then?  I'm hurting  My nerves ... are beginning to work again.  One more.  Maybe two - - to heal me completely.   Then we can be away from here, before they come looking.  The Cenobites.  It's only a matter of time before they find I've slipped them. I have to get away from here.  Poor Larry.  Obedient as ever.  Ssh. Don't want babe to hear.  You won't cheat me will you? You'll stay with me.  Help me. Then we can be together, the way we were before.  We belong to each other now, for better or worse ... ... like love.  Only real.    Better.  Much better.  I'd like some clothes.  And maybe a cigarette.  Of course.  I wanted access to experiences ... pleasures ... that only they could offer ...  That's what they call themselves. They're not human.  Maybe they were once, but they're not now. They rearrange their own flesh for pleasure.  It cost me a fortune.  All I had.  It's a puzzle you see. You solve it, and the Cenobites come through ...  God knows.  Sometimes I think they're just behind the walls ...  Oh no.  They kept to their bargain.  They gave me experiences I'd never forget ...  But their pleasure was my pain.  Terrible pain.  Appalling ... My body was forfeit.  But my spirit ... they left that here. In the boards.  In the walls. Watching the world, but never able to touch it ...  There are ways to resurrection. Blood's one of them.  I won't let them take me back, Julia.  I want to be whole, and then get out - I won't let them take me.  You can't love him.  So where's the harm?  Then find me somebody else, before they come looking. Tomorrow?    Kirsty?  Kirsty.  It's Frank.  It's Uncle Frank.  You remember.  Come to Daddy.  You've grown.  You're beautiful.  What?  What will you do?  What can you do? There's nothing to be frightened of.  I bet you make your Daddy proud, don't you?  Beautiful.  I used to tell myself that. Used to try and pretend I was dreaming all the pain.  But why kid yourself?  Some things have to be endured.  Take it from me. And that makes the pleasures so much sweeter ...  Give that to me.  One last time.  Give me the box.   Come to Daddy.  Some things have to be endured ... ... take it from me ... ... Come to Daddy ...  I don't think so.  She'll want Larry first.  Maybe.  There's very little I can do about it.  Like this?  Look at me! LIKE  I need a skin.  Then we leave -  You're not leaving now -  Where are you, beautiful?    Come to Daddy.  Don't cry for him.  He's dead. He always was.  Poor baby.  Hush now.   It's all right. Frank's here.  That's right.  Are you losing your mind, baby?  This is Frank you're talking to.  FRANK.  What's going on? No.  You set me up!   You bitch. You set me up!  Bitch!  Come to Daddy!"
    },
    "imdb_rating": "6.9",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BOGRlZTdhOGYtODc5NS00YmJkLTkzN2UtZDMyYmRhZWM1NTQwXkEyXkFqcGdeQXVyMzU4Nzk4MDI@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "When Kirsty's father, Larry, and stepmother, Julia, move into Larry's childhood home, Kirsty and her boyfriend take a room nearby. Unfortunately for all involved, Larry's house is already occupied: before the family's arrival, Larry's disreputable brother, Frank, used a supernatural puzzle box to summon a gang of other-dimensional demon sadists. Now, Frank requires a series of blood sacrifices to escape the clutches of Pinhead and the cenobites.—mrosesteed",
    "name": "Hellraiser",
    "genres": [
        "Horror",
        "Thriller"
    ]
}