{
    "filename": "Hellboy_script.txt",
    "imdb_id": "tt0167190",
    "imdb_url": "https://www.imdb.com/title/tt0167190",
    "characters": [
        "Hellboy",
        "Tom Manning",
        "Sammael",
        "Abe Sapien",
        "Ilsa Haupstein (as Bridget Hodson)",
        "Agent Clay",
        "Agent Moss",
        "Agent Quarry",
        "Karl Ruprecht Kroenen",
        "Agent Lime",
        "Grigori Rasputin",
        "Young \"Broom\"",
        "Trevor \"Broom\" Bruttenholm",
        "Liz Sherman",
        "John Myers"
    ],
    "dialogues": {
        "Hellboy": "Those comics -- They never got the eyes right.  What's with the hair, Clay?? Finally got those implants??  Who's the squirt?  Got tired of me?  I don't want him.     I wanted to see her. It's nobody's business.  \"Myers\", huh? You have a first name??  Whatcha looking at, John??      Look at them ugly suckers, Blue. One sheet of glass between them and us.  I break it, they see us, Happy Halloween. No more hiding. Outside. I could be outside --  Don't get psychic with me.  How am I ever gonna get a girl?? I drive around in a garbage truck    Hold on -- hold on -- I thought we checked this place. Fakes, and reproductions.    Who wards off demons.  Reliquary --  Would'ya look at this babies? Made 'em myself. Holy water, silver shavings, white oak: the works.  Oh, well. Lemme go in and say \"hi\".    Hey. Stinky. Kitchen's closed. Whatcha havin'? Six library guards, raw? Plus belts and boots? Man, you're gonna need some heavy fiber to move that out --  Hold it -- Hey, Sammy, whaddayasay we work this out?? Peacefully. I'm not a great shot, but -- \"The Samaritan\" here, uses really big bullets, so whadyasay we work this out?  That's all for you, Sammy.  Nah -- he's taken care of.  See? I don't like that --  Skip to the end, willya?  How do I kill it -- ?  That voice --  Don't tell me, it's Zeppo.  What do you think you're doing??  No one ever helps me. It's my job.  Damn -- Okay. Here --    It's a tracking bullet. Crack the pin. Load it.  Lemme go ask --  Are you okay?  Good. Stay here.  Waiting for me, Sammy?  Uh-oh -- between a rock and a hard place --  Aw, crap --  Hey! Hey! I'm on your side!!  Aw, I forgot --  Screw you.  I'm fireproof. You weren't.  Myers??? How's your arm?  I just fried Stinky. Tell Father I'll be home. He shouldn't wait up.  No, no, no, it's fine: I do my job, I take a break.  Myers?  Goodbye.  Uh, I brought beer.  Just a scratch. I wanted to see you.  We miss you at the Bureau. Abe's crazier every day. And Father's still mad at me -- Come back, Liz. Come back. I --  The Nanny Squad.  Goodnight, then.  Yeah, I gotta go, too. Lots to do --  What took you so long?  What are you, a Boy Scout?    This -- ? This is nothing. You know what'll kill me? Her.  I'm lucky that way.  Don't worry. I'll get him soon enough --  How hard can it be? I punched the crap out of that thing that he sent -- ouch!!  Me?? C'mon --  Oh, stop that -- Damn! Be careful, there --  I dunno, maybe five seconds -- ow!    Is it bad?  Didn't even buy me a drink.  Well, let's see -- there was that moment, when I had a train on top of my head --     How many buildings does she have to burn? She belongs here!  Oh, as opposed to -- ?  Mmmh -- \"Pamcakes.\" We're going out --      What was that??  Are you coming or not?  There you go, Doctor. This should cover your tailfin -- On loan from the Vatican, a bone from Saint Dionysius. Ugh. Looks like a pinky.  Rotten eggs and the safety of mankind.  Son of a -- !  \"Sammael: seed of destruction. Death becomes the fertile ground.\"    Hey, Chunk-face!  You can do better than that. Big monster like you.  See? It hurts! You shouldn't hit people!  Aw, crap.  Second date. No tongue!!  I hope that hurt.  My job.    Abe -- ?      I knew those men better than you did --  No, it doesn't make it right, but I stopped that creature, didn't I?  What are you trying to say?      You!!! You did it, buddy --        Shh! Just a second.  Myers, you're a talker. What's a good word -- a solid word for \"need\" --  Nah, sounds too \"needy.\"  Um... Liz -- I -- there's something I'd like you to -- something I need you to hear.  Out? Out out?  You're going alone?  Him!! Why him? Why not me?    It's nothing. Just a list -- It's not finished --           What are you two talking about. What's so fascinating?? So important??  No cream and sugar, moron. She takes it black.  Toldya.  Hi...  Shh. I'm... on a mission.  Don't tell anyone, huh?     That's it: she's laughing. I'm done.  Come on! Look at him, those shifty eyes, that -- phony grin...!! You gonna eat that?  Oh, the yawning trick. That's so 1950's! Watch his arm --  It's not that easy, okay? Plus, you're nine. You're not old enough to give me advice.  Something's wrong --  Father -- I'm back. I'm back. I'm back.  I wasn't here. You died alone --  Hi.  I am. But -- I have something to say, too. I never had the guts before -  But I understand what you don't like about me. I do. What I am makes you feel out of place -- out there --  Listen. I'm not like Myers. He makes you feel like you belong. And -- that's good. It really is. I -- wish I could do something about this -- But I can't. I can promise you only two things... One: I'll always look this good. Two: I won't give up on you. Ever.  Good.  \"One falls, two shall arise.\" So: you pop one, two come out. You kill two, you get four. You kill four, you're in trouble. We have to nail 'em all at once. And the eggs.      Boy Scout.  Sparky?? Who came up with that? Myers?    Sebastian Plackba #16...  Let me ask for directions.    Sixty feet further, comrades, and three rows in...  This here is Ivan Klimentovich: Say \"hi\" Ivan.  We'll be alright... as long as we don't separate --    ...Polo.  On a scale of one to ten: two. But -- -- she'll take care of you, Myers. She's a tough one.  Don't move. We --  No. Don't --  Son of a --    Screw that.  You killed my father --  Give your soul to God, Your ass is mine.    You like playing possum, you Nazi pinhead? Then try playing dead.  Are you okay?  You'd better stay here. I'll find a way out. We'll come back for you.  Yup.      Hang on kid, I'm coming for you!!  Sorry. Just couldn't leave you two alone.    No.  Noooo! Noooo!!!  For her.    I can live with that.  Keep her safe. No matter what. I'll deal with whatever's back there.  How big can it be?  They never work --  Ugh -- Now, this is gonna hurt --  Ouch -- It did hurt.  \"You, on the other side: let her go. Because for her, for her -- I'll die. I'll cross over.\" \"And you'll be sorry I did.\"",
        "Tom": "Look at that. That's a costume. These people amaze me.    That word -- conceal --  Phil -- Phil -- hold your little green horses. Let me tell you and the American public one thing -- this \"Bureau for -- what was it?  -- Defense, right, well -- I'm here to clear up this once and for all. There-is-no-such-thing.",
        "Manning": "Look at that. That's a costume. These people amaze me.  With their conveniently blurry footage of their beloved \"Hellboy.\" And they claim that he works for the FBI-?    Exactly -- so, why is it that they're all out of focus? C'mon!! God knows, people manage to get good pictures at a wedding!!  That's the alleged best man -- ?  That word -- conceal --  Phil -- Phil -- hold your little green horses. Let me tell you and the American public one thing -- this \"Bureau for -- what was it?  -- Defense, right, well -- I'm here to clear up this once and for all. There-is-no-such-thing.  Every time the media get a look at him, they come to me. I'm running out of lies, Trevor.  I do. How many escapes?  This year alone: five!  Your \"guest\" happens to be six foot five, bright red, and is government funded.  A \"phase\"? What do you think this is, \"The Brady Bunch?\" These... freaks --  (lowers his voice, tense  Hey, fishstick -- don't touch anything --  See what??    Oooh!! Who was here? Nixon? Houdini? You mind sharing your mystic insights?  He'll make it --  But not everyone was so lucky. Two agents died today. Clay probably won't survive the night. You're reckless.  Ah, I see. That makes it all alright then.  That's what you do. That's why we need you. You have an insight. You know monsters.  In the end, after you've killed and captured every freak out there -- there's still one left: you.    We've collected and destroyed thousands of eggs. No trace of this \"Sammael\" or this \"Rasputin\" character. But we have this address --  Sebastian Plackba #16. Volokolamsk fields, fifty miles from Moscow. We leave as soon as we get clearance and equipment --  Hellboy's coming -- But I'll be in charge this time. Either we wrap this up or I'm closing this freak show for good.  When we do: No mumbo-jumbo. Double- core Vulcan-65 grenades.  We've installed a very handy timer. Set it, walk away. Cable pulls the safety pins, K-boom! Easy to clean, easy to use...  Each of us gets a belt.  Forget it. This is practically a city. And it stinks, and it's muddy. We'll go back, check into a hotel, regroup after breakfast. We'll have to make a grid, go by quadrants. Maybe satellite photography.  What's that --  We should go back -- you -- you could tear that door apart --  -- should go back. Now!  I'm in charge. We go back!  Ouch!!    You call that thing a cigar??  You never, ever light a cigar that way.  Use a wooden match. It preserves the flavor.  Thank you.",
        "Sammael": "",
        "Abe": "Agent John T. Myers, Kansas City, 76. \"T\" stands for Thaddeus, mother's older brother. Scar on your chin happened when you were ten, you still wonder if it's ever going to fade away.  Story of my life.  You mean, outside... with her.  Nothing psychic about it. You're easy.  Liz left us, Red. Take the hint.  (pulling his hand away    There's not much here: the entity's name is Sammael, the desolate one, son of Nergal --    No, listen this: Sammael, the desolate one, lord of the shadows, son of Nergal --  hound of resurrection --  -- Hound of resurrection?  harbinger of pestilence, seed of destruction --  It doesn't say --  I need to touch it to \"see\"...  The past, the future, whatever this object holds.  Don't worry about fingerprints. I never had any.  They were over here, Professor.  Professor..? You -- are very sick --  You were burned by some organic acid.  Red. How long was it latched onto you?  Professor...  Touched you five seconds. Laid three eggs.  The eggs are very sensitive to heat and light. They need a humid, dark environment to breed.  Yes, you are.  There's a pulse. And it's coming from --  there --  cistern on the other side. Most of the eggs are there --  I'm glad I'm not human. This place would be an embarrassment.  Remind me why I keep doing this.  Oh, right --  Listen -- I'm not much of a problem solver... Three decades and I've only gotten two sides. But I know this much: if there's trouble -- all we have is each other. And I'm stuck here. So -- Take care of the big monkey for me, will you?",
        "Sapien": "",
        "Agent": "No way in.",
        "Clay": "They're not speaking. Professor Broom had him grounded.  Okay. You saw the fish man, right?  Well, come on in and meet the rest of the family.      It'll fill in. Where do you want your dinner, Red? By the couch?  Agent Myers is your new liaison.  Nah. I'll be around, Red, just back in the field.  Manning says I'm too soft on you -- The candy. Give him the candy.  Well, you did break out --  It is. You got yourself on TV again.    His horns. He files 'em. To \"fit in.\"  We're on the move.    Okay, boys, let's synch up our locators.      C'mon, champ. You look a little woozy, there.  We should go back and request permission to --    See? It's thicker. Isn't it? It's not that doll-hair thing --  Red, wait!  Red's on the move!! I'll cover him!!  Damn it, Red.  Clay, Code 30, this is Clay, over...",
        "Moss": "Jesus --",
        "Quarry": "No way in.  Abe --  Moss, what the hell was that?  Whatever it was --",
        "Lime": "Jesus.  Should we send out some scouts?",
        "Grigori": "Tonight, We will open a portal and awaken the OGDRU JAHAD: The seven Gods of chaos. Our enemies will be destroyed. In an instant, all impurity in this world will be razed and from the ashes a new eden will arise.",
        "Rasputin": "",
        "Young": "Jesus! would'ya look at the size of that whammer!  Thank you --",
        "\"Broom\"": "",
        "Liz": "Back so soon?  To wash down my lithium pills? I may get a few perks, H.B. But I'm still a patient.  You better have that looked at.  No. Not this time, H.B. It's been months since I've had an episode. And you know what? I'm learning to control it.  I'm learning where it comes from. And for once in my life I'm not afraid.  Looks like your ride is here.  Listen, H.B. I've got a chance out here. If you truly care about me, don't come back anymore.  Goodnight.  I don't like the term \"firestarter.\" I just don't. And \"Pyrokinesis\" sounds like psychosis or something. I dunno -- maybe that's right. Not being able to let go -- Scary. Sometimes you hear so-and-so lost control and just exploded. They're lucky it isn't true. With me -- it is.             Mommy! Mommy!    Help meee!!!          Doesn't sounds like him.  Choice, huh? That's cute. I've quit the Bureau thirteen times. I always go back. Where else would I go?  It feels good to be outside!! It's been so long...  Don't get used to it.  It's only for the weekend, Professor Broom. Then I'll be on my way --        A little something I learned in therapy. I'm depressed -- One rubber band. I'm impatient: two rubber bands...  (notices the small feline army  Well. Is it long?? I'm going out, but --  For a cup of coffee, but go ahead, read.  No. Myers is taking me.  What did you want me to hear -- ?  Oh, okay then. Maybe later then.  He's just pushy.  Cocky.  A brute.  I know.  Don't know. Really. I grew up with him. I've missed him too, but now, every time I see him, I get confused. Hardly a day goes by he's not in my mind. Even now, I feel he's here --  Coffee's warming me up.  You offered me a cup of coffee. I've got one, so just sit down.    He hasn't spoken to anyone in three days. Not a word. He doesn't eat, he doesn't sleep...  I've never seen him like this. Never. Should I stay? With him, I mean?  Hi --  I've changed my mind. I'll come to Moscow. If you -- are still going --  Red, I --  I like that...      Come out and see.  Marco...  What -- ?  You want to know -- Now -- ? Here? Red, white, whatever -- Guys are all the same.  Oh, my God...      Hit me -- All of my life I've run away from it... Now I want it to happen! Do it.  I know now: I love him. I've always loved him.  Go now.  In the dark -- I heard your voice -- What -- did you say -- ?",
        "Sherman": "",
        "John": "",
        "Myers": "Hello, I'm --  Yes, I --  Pardon?  Jesus Christ!    Sir, I'm --  How did it --    How does he know so much about me?  Where am I -- exactly, Sir?  On the desk, yes. In Latin.    1945, you mean. Hitler died in '45.  You're not coming?  Grounded? Who's grounded?  Who?!      Oh. Uh. Hello. I -- I have these. For you.  Uh-oh -- John. Staring at what?  His what??!!  Oh-n-no -- I --  Helping you -- I just --  Jeez... What the hell is that?  Wait! No, what are you doing?    Yeah, yeah, crazy costume, uh? Trick or treat!!  My arm is fine. Where are you??    Wait -- Wait -- You can't go anywhere -- I gotta go with you --  No. Stop. Don't do this -- Listen to me -- Tell me where you are --  Yes?  Sir, may I go first??  C'mon, time to go home. Tape you up.  No. I never was.  You want me to hold him down?  Down there. Did you ever loose track of him?  I'm in way over my head, I know that much.  No, I'm not. He respects Clay. Not me. I don't know why you chose me, Sir. But I'm not qualified.  Oh, please. I'm not \"pure of heart.\"  Professor, that girl you were talking about --  I think I can help -- Talk to her -- I can bring her back.  Hostage negotiations.  Miss Sherman? I'm Agent Myers, FBI.  Miss Sherman? I'm Agent Myers, FBI. The hospital called us. They don't feel they're capable of caring for you any longer, and --  Liz -- can I call you Liz? It's a beautiful name --  It's still impressive by my standards: My name's John.  Dr. Broom asked me to invite you back to the Bureau. No special precautions, no security escorts. You and me in a taxi. Like regular folks.  Miss Sherman, he's asking you back, but it's entirely your choice.  Hey!! The music!! Turn down the music!!  Jesus! That's not -- That's not safe, Miss Sherman -- Miss Sherman?  Nice view --  A smile, huh? That's good.  I'll get you a fresh pack.  Where do you --  \"Need\" is a good, solid word.  Start in, you got nachos coming.    Anything else you --  Well good n-  I admire him. He's a force of nature.  No... He's determined. Unstoppable --  Strong.  My uncle used to say... we like people for their qualities but love them for their defects.  He -- loves you.  What about you?  It's freezing, isn't it?  What do we do now? Newark, New Jersey, entertainment capital of the world.    We all have a side that we try to hide...  Hey! What the hell?  I'll carry his --  We're almost there.    So, he thinks that you and I... That's why he's mad at me --  But it's not true, is it?  That you feel that way about me.  Watch out. It's slippery...  What?  I can't, I --  Don't do it!! Don't do it!!  No!! Don't do it!! Listen to me!!    Alone?"
    },
    "imdb_rating": "6.8",
    "description": "At the end of World War II, Nazi officers Karl Ruprecht Kroenen and Ilsa Haupstein start an experiment to raise the forces of Hell through Russian dark mystic Rasputin on a Scottish island, but it's interrupted by an Allied commando guided by professor Trevor \"Broom\" Bruttenholm. He prevents killing the human-demonic half-blood, which was accidentally created and raises this \"Hellboy\", while rising to head of a secret C.I.A.-linked U.S. agency Bureau of Paranormal Research, which secretly studies and uses the occult, including supernatural freaks. As \"father\" Broom is aging, he hand-picks brilliant, sensitive Agent John Myers as new minder/companion, as regular \"warrior\" Agent Clay can't empathize and lacks flexibility mental. Hellboy is quite a handful, regularly spotted by worried civilians on unauthorized excursions, especially to pyro-telekinetic freak friend in a mental asylum. Johnny, Hellboy, and Clay team up on missions against paranormal threats with aquatic-bionic freak Abe Sapien. Their task proves to be daunting, as monster Sammael multiplies every time it \"dies\", while Rasputin and the Nazis reemerge, armed for revenge.—KGF Vissers",
    "name": "Hellboy",
    "genres": [
        "Action",
        "Adventure",
        "Fantasy"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNTc1ZWY0ZTEtZTVmNi00MTg0LTg4NmQtZTI4OWNiMmQ0MWZkXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_QL75_UY281_CR8,0,190,281_.jpg"
}