{
    "filename": "Highlander_script.txt",
    "imdb_id": "tt0091203",
    "imdb_url": "https://www.imdb.com/title/tt0091203",
    "characters": [
        "Kate",
        "Kurgan",
        "Angus MacLeod",
        "Ramirez",
        "Connor MacLeod",
        "Det. Walter Bedsoe",
        "Chief Murdoch",
        "Sunda Kastagir",
        "Dugal MacLeod",
        "Kirk Matunas",
        "Rachel Ellenstein",
        "Lt. Frank Moran",
        "Fasil",
        "Brenda Wyatt",
        "Heather (as Beattie Edney)"
    ],
    "dialogues": {
        "Kate": "",
        "Kurgan": "",
        "Angus": "",
        "MacLeod": "",
        "Ramirez": "",
        "Connor": "",
        "Chief": "",
        "Murdoch": "",
        "Sunda": "",
        "Kastagir": "",
        "Dugal": "",
        "Kirk": "",
        "Matunas": "",
        "Rachel": "",
        "Ellenstein": "",
        "Fasil": "",
        "Brenda": "",
        "Wyatt": ""
    },
    "imdb_rating": "7.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTYxMzc0NDk1NV5BMl5BanBnXkFtZTgwNTcyMDEyODE@._V1_QL75_UX380_CR0,7,380,562_.jpg",
    "description": "In New York City, the owner of a sophisticated antique shop Russell Edwin Nash is challenged to a sword fight in the parking lot of the Madison Square Garden by a man called Iman Fasil that is beheaded by Russell. He hides his sword and is arrested by the police while leaving the stadium. Russell recalls his life in the sixteenth century in Scotland, when he is Connor MacLeod, and is fatally wounded in a battle against another Clan. However, he surprisingly survives and his Clan believes he has a pact with the devil and expels him from their lands. Then he meets Juan Sanchez Villa-Lobos Ramirez, who explains that he is immortal unless he is beheaded. Further, the immortals dispute a game killing each other and in the end only one survives receiving a prize with the power of the other immortals. Russell is released by the police, but the snoopy forensic agent Brenda J. Wyatt is attracted by the case since she found fragments of an ancient Katana and follows Russell. But the also immortal Kurgan is hunting down MacLeod, and Brenda is in the middle of their battle.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "name": "Highlander",
    "genres": [
        "Action",
        "Adventure",
        "Fantasy"
    ]
}