{
    "filename": "Hollow-Man_script.txt",
    "imdb_id": "tt0164052",
    "imdb_url": "https://www.imdb.com/title/tt0164052",
    "characters": [
        "Girl in Car",
        "Warehouse Guard",
        "Carter Abbey",
        "Sebastian's Neighbor",
        "Boy in Car (as Jeffrey George Scaperotta)",
        "Wino",
        "Mom",
        "Frank Chase",
        "Sarah Kennedy",
        "Sebastian Caine",
        "Janice Walton",
        "Dr. Kramer",
        "Linda McKay",
        "Matthew Kensington",
        "Mrs. Kramer"
    ],
    "dialogues": {
        "Warehouse": "The Porsche pulls to a halt in a reserved parking space and Sebastian exits, wearing a Hawaiian shirt, shorts, and Birkenstocks. He notes the other cars parked in the lot, then crosses to bunker in the center of the warehouse, guarded by a MARINE, shouldering an M-16.   The elevator doors open and Sebastian pushes past the Marine Guard.    The elevator door opens. The Guard turns around. The elevator is empty.    The elevator door opens. It's empty.  SEBASTIAN'S POV - as we push past the guard and down onto the street.    Linda and Matt exit their car and cross toward the elevator.    As we watch the footsteps head back through the puddles toward the warehouse, we see Frank pass us in his car.    Linda and Matt stumble out into the blazing sunshine. Emergency crews close from all directions, sirens roaring. A trail of smoke drifts higher and higher into the sky.  An ambulance pulls up next to them and the paramedics hop out, immediately putting a blanket around her and treating Matt's wounds.",
        "Guard": "Morning, sir.  Your team s in early. Something special going on?  Have a good day, sir.  Hey, Doc. Haven't seen you for awhile?  Sebastian keeps his face turned away as he crosses to his Porsche.   You got that right, sir. I was beginning to worry 'cause your car hadn't moved.   What happened?",
        "Carter": "Amazing. She's normal, absolutely healthy. If you didn't know any better, you'd think nothing had happened to her.   And remember, for every Jonas Salk, there are a bunch of guys who aren't famous cuz they died.   Kinda like a firecracker with a bad fuse...  Sebastian shoots Carter a questioning look.   Don't know if it'll go off.   He's going to blow out his heart.    Holy shit.  Then as if someone had poured acid all over the bones, the skeleton evaporates into nothingness.   Let's get him into recovery.    Hey. How's he doing?   Man, I'm tired. That was a long day.   Getting a pulse.    Dr. Caine. What's up?   Going out? Hey wait a sec!  Carter scrambles to his feet.   What do you mean going out for a bit?   But you're not supposed to leave the compound.   That's the rule.   You can't just change it.  Sebastian hits the elevator button. The doors open.   Shit.  Carter runs down the corridor.   Yeah, it's Carter. We got a problem.   Look, this isn't a monkey we're talking about. It's Dr. Caine. Don't you think you're over reacting?   Sure... all the time.   The usual.   Hanging out in the girl's locker room. Kicking Jimmy Margiani's ass.   School asshole. Drove a red Trans Am. Back then, I was the size of a small planet and made a rather large target.   Sure. World domination. Manipulating stock markets, consolidating a political power base. But those are more recent fantasies.  Carter pulls off the electrodes and Sebastian slides on his latex facemask.   I don't know, man. Out in the real world... I mean, there's a responsibility...   Hell, I try and do that now.   I read that in a survey at a major university they asked college students \"Would you steal if you were guaranteed to get away with it?\" 82% said yes.   So, Doc what did you do?   When you were out.   Aw, you just walked around? Come on. There's more, right?   Man, I'd be walking up to people saying shit like \"This is God, go,get a haircut.\" Or hanging out in the changing room at Victoria's Secret.   Well, did you see anybody?   Yeah? And did you mess with her?   Hello?  Carter looks at the security monitor of the recovery room. Sebastian's heat signature lies still on the bed.   No. No. He's here No, I'm staring at him. He's right there in his room.   That's all twelve hours.   Well, it wasn't me.   He's not in there.  Linda enters the chamber. She notes that Sebastian's face and makeup are on the sink vanity. Linda crosses to the phone and hits the \"PAGE BUTTON\"   Isn't it obvious? Right now, we're the only ones who knows he exists. If he gets rid of us, no one knows and he becomes the most powerful man on earth.   So what do we do until then. Sit around waiting for him to kill us off?  Everyone looks around for some leadership. Finally.   You sure this'll work.  Linda sits down at a computer terminal, activates it.   Let's do it.  Matt and Carter exit. Linda locks the door behind them.   It's me.  Matt pulls off his goggles.   Nothing.   He couldn't.   There. Behind those pipes. He's not moving.  Carter points. Matt checks his thermal. A red heat signature clings to the wall.   Doctor Caine?  Can you hear me?  No response.   Covered.  Matt fires the dart at the heat signature. It bounces off the wall ... Nothing there.    H...Help... MMmmphg  Carter suffocates. He passes out. With a sudden crack, he's thrown against the side wall. A large cut opens up across his head and his body goes limp.",
        "Abbey": "",
        "Sebastian's": "A knock on the door.   The lights! Turn off the goddamn lights! Ah Christ!  Linda jumps up and crosses to Sebastian. Matt rushes to the wall and turns off the lights. Darkness. The room is lit by the glow of machinery.   I can't... I can't close my eyes. I can't close my eyes.   So I ... I'm...   My arms. I can.. where? ... I can feel them...   Mirror. I ... I want to see.   I ... It's hard to think.  Sebastian's voice is now behind him. Matt turns around.   The transformation... I remember every molecule in my body shattering.   At first... but then everything went black. I couldn't see or hear or feel anything. It was all just black... like I wasn't connected.   At least my senses are starting to return... You're wearing your Shalimar, aren't you?  Linda realizes that he's standing very close by. Her hair lifts slightly and Sebastian inhales. Chills go down her spine.   This is weird. I'm looking through myself at the floor. I'm looking right through myself. I can't tell ...  He bumps into a chair.   ... where my body is.  A moment of silence.   You really can't see me. Can you?   No, just tired.  It's funny. I can see everything... more than before... but I can't see myself.   Not to bad, considering.  They turn round. The voice is coming from behind them. The group rises from their various workstations and turn toward where the voice came from.   Odd, isn't it?  A rheostat switch on the wall turns and the lights dim. Though it's a simple act, it feels somewhat ominous.   Over here.  Sebastian has moved. As everyone turns toward him again, he can't stifle a slight giggle.   Sorry. Couldn't resist.  His voice again come s from somewhere else in the room.   Boy, you people have no sense of humor.  A chair slides back from a desk and bends under Sebastian's weight.   Show me. So ...    Stop there.  Frank halts the tape.   Index that. That was when it started burn. Epidermal reaction.   Just a little longer.   Fine.     Thirty minutes. Yes,,_I know. I wrote the procedure.   You like this don't you?   Being in charge.  It's clear she does. But she's certainly not going to admit it.    Sarah. Are you awake?  Her heavy breathing mixes with Sebastian's.    Hmm.  Sarah's hair moves slightly, as if a hand were running through it. And then we see her shirt move, like fingers were tracing over it. Down from the shoulder to her breast. Around her nipple. Sarah moans slightly, as if she were dreaming, but she doesn't stir. And then her breasts cup slightly, as if they were being touched... softly... gently. Her breathing becomes harder, more labored, erotic... and then she... BOLTS AWAKE. Bar eyes wide with fear. She jumps and cups her own breasts and looks around the room. It's empty, of course. She jumps over to the monitor and checks on Sebastian's room. The heat signature isn't there.   Restless. Hard to sleep when you can't close your eyes.  As Sebastian talks, we can see the electrodes around his jaw pump up and down.   Got up a couple of times. Knocked about.   Next I want to run a VV and UVF analysis of the platelets.   You okay?   No. I was looking at the clock. Why?  Sarah draws the plunger back, sucking Sebastian's blood into the hypodermic and then yanks the needle out.   You've no idea how much fun I've had. I'm going to hate going back.   How so?   Maybe we won't give it to them. His voice comes from behind her now.  We see indentations on her shoulders where his fingers press down.   I was thinking... tonight's my last night. Ever fantasize about making love to an invisible man?  Linda pulls away from him.   Well, don't do it for me. Do it for science.  Linda walks away. Sebastian laughs.   Oh well. Missed your big chance.   Wait... something... something doesn't feel right.    Hey...   You look worried. It must've been bad.  Sebastian's voice is weak and strained.   Well, remember your Nietchze. Whatever doesn't kill me, makes me stronger.  Linda smiles.   I guess if I'm going to be stuck this way for awhile, I'd better make some adjustments.   Well, it gives you a face to talk to at least, and we can all work in normal light again.    Sebastian packs up a few personal belongings in an overnight duffle. He crosses to his bookcase and pulls out some books and throws them into the bag.  But as he does, he notices a light come on in the window across the courtyard. Sebastian turns off his bedroom light and moves toward the window. He peers across the courtyard into the Brunette's apartment.  He watches the Brunette as she comes into the living room from her front hallway. She drops her keys on the table and begins unbuttoning her blouse as she crosses to the window. Just as the blouse slips off her shoulder, she pulls her blinds shut.    Linda pushes through the living room, into the bedroom.    The elevator doors open and Linda steps inside. The doors close shut behind her. A beat later we see the indentations of footsteps come around the corner. We follow the breathing and stumbling footfalls back into...    We push over to the bathroom sink. The faucet turns on and the water starts running.  We see the water cup under the faucet and splash against Sebastian's face. His face appears briefly in the water. Then the water slips away.  For second it sounds like he's crying, but then we hear something far worse. He's laughing. Nervous laughter.   Relax, Linda. No one's gonna find out.  They all turn around. At the door is Sebastian, back in his latex outfit.   When you were a kid, you ever dream about being invisible?   What did you imagine you'd do?   What's the usual?   Jimmy Margiani?   Ever think up anything along the grand scale?    Then ...   Goodnight.  Linda-jumps.   Sorry, didn't mean to frighten you.   Be quiet!  A photograph of Linda drifts through the air and settles atop a flaming candle. It ignites into fire, twisting and turning in mid-air, then falling on the floor as ash. A beat later water runs from the sink faucet. It forms in the shape of hands and splashes against his face, dripping away.   And the cyclops screamed out, \"Who is it who blinds me?\" and Odysseus replied \"Nobody is my name\". And the Cyclops raged to his friends \"Nobody is killing me. Nobody\".  The barking continues. A moment later the chamber door slides open. We push down the...   Shhhh. It's Nobody-It's nothing.  The Plexiglas door to the doggie's cage swings open and some invisible force grabs little doggie around the neck. The force squeezes its little fur ball throat until the barking stops.   Nobody's gonna hurt you.  The force keeps squeezing until the little doggie goes limp. Then the dog smashes against the Plexiglas over and over until blood spills out its mouth. The Plexiglas door swings closed again and moments later the door to Sebastian's cubicle closes as well. The water runs in Sebastian's sink washing the blood away from his now half visible hands.    I am now.  The sheets raise and drape off of him.   No. Why?   How'd that happen?   Sarah... You saying I had something to do with it?   I was in my room all night.   Hmmm.  We see the footsteps start to head back toward the warehouse.   What the hell?  He breaks into a run. Feet splash water and he races back toward the warehouse.    We hear breathing and footsteps as we push through some bushes and head toward a bay window which looks into the Kramer living room.  Through the glass we see LINDA and MATT seated across from DR. KRAMER. We can't hear what they're saying but it certainly looks serious. Kramer puffs on a pipe and strokes his beard, shaking his head.  Kramer rises and shakes hands with Linda and Matt, and the three of them head toward the front door.  We move away from the window and track toward the front door. As the door opens we begin to hear the tail end of the conversation.   What? No good morning for me? Don't you like me anymore?   That's okay. It's going to be busy day.   I'm sorry. But I can't lot you turn me in.   You have no idea what it's like. The power of it. The freedom. I can't let that go.   There's nothing to talk about. See ... I've done things that can't be undone.  A long beep as the intercom clicks off.    Janice enters the office.   I'm here.    Janice struggles with her unseen assailant, slamming into walls and knocking into filing cabinets.    Linda and Matt knock.   Marco...Polo... Marco... Polo...  His voice keeps shifting. Matt fires.   Not even close.  Matt sweeps his front leg back and forth, like a blind man using a cane. But his foot isn't hitting anything. He sees a FIRE EXTINGUISHER mounted on the wall. He rushes it, turns it on the hallway and sprays. And SOMETHING LUNGES through the foam. GRABS HIM, sending him tumbling down the tunnel. Matt is thrown against the wall. Blood coming from his brow. He scrambles away, spraying more foam. Sees a shape in the mist, raises his pistol and FIRES. The shape leaps away. The DART FLIES. Doesn't hit. Matt scrambles back into a corner. His pistol is empty.   She's a pretty sweet fuck, isn't she?   I'm sorry, but I just feel that our friendship is holding me back. I'm sure you understand.  THE DOOR OPENS. Linda reaches through, grabs Matt. She pulls him to his feet and through the door.   You missed.  Her hair flies up, and she swings against the wall. She tries to move, but she's pinned there. Her hands struggling against the force.   I've always liked your feistiness.  Sarah's head shifts slightly. Her head shifts violently, accompanied by the celery crunch of her neck snapping. Sebastian exhales, his breath filled with the intoxication of power.   Now? Now you die.  The three of them whip around.   I would say that what I am experiencing is psychological awareness. I like you being in complete and absolute control.  They identify the general area the voice is coming from: Back inside the Chamber! They slowly move toward the Chamber door. With lightning speed they slam the door shut, locking Sebastian inside the Recovery Chamber.   You're never gonna bring me back Linda. I never want to come back.   Or maybe I'll fuck you. One last time for old times sake.  Linda slams her fist against the wall of the Chamber.   Imagine you two, carrying on right under my nose. Out of curiosity, what did he give you that I couldn't?   Okay, sweetie. I'll be quiet. If that's what you want...  Sebastian TOGGLES the intercom switch OFF. We pan over to one of the working video screens ... Matt and Frank stride down the hallway. The chair swivels and the observation room door swings open slightly.   Figured it out? You were always so clever.  Matt's pulled back across the lab by the cord around his neck. He grabs at the cord trying to breathe. Linda watches him being pulled away.   The villagers with their torches? Lock up your daughters! Sorry, Lin. It's not gonna happen that way.  Linda hits the lights. The lab is now very, very dark.   See, I've spent all my time down here thinking up this plan. When they find you, they'll find a pile of charred corpses. The result of a terrible accident, I'm afraid.  Linda reacts to the voice as it grows nearer. She navigates the maze of equipment, heading toward the crack of light at the front door.   I guess because I don't have to look at myself in the mirror anymore  Remember that first night I was out? I did something bad, just to see if I could get away with it. And when I did, I realized I could have it all. I can kill in broad daylight. And nobody's gonna tell the police they were fucked by a ghost. Anything I desire I can make happen, but not if people know.  Linda and Matt have reached the door of the lab. She pushes through it and slams it behind her.    A drawer opens, revealing a set of clothing neatly folded. Shirt, pants, shoes. They begin to move.",
        "Neighbor": "",
        "Wino": "",
        "Mom": "",
        "Frank": "Sorry, Boss. Forgot. Sebastian glance up at a glass booth overlooking the Laboratory floor. TWO PEOPLE in the booth.  We are live and in color. On your mark. Frank and Janice looks down on their colleagues. Sebastian nods their way.  Subject Isabelle Two. Currently in phase shift... one hundred twenty six days, eighteen hours.  Confirmed. Vitals still in the normal range.  I got an erratic heart beat.  Brain activity returning to normal. The monkey grunts and groans. Blinks its eyes. Linda hovers over it stroking its fur.  Are you nuts?   Yeah. Pretty sure he was.   To put your affairs in order?   Okay, kids. Let's make some history.    No change in bio-electric.   Listen up! Electric activity increasing in all limbs. Brainwaves are through the roof.   Maybe it can't.   Electrical activity is stabilizing.   I feel like we're playing Marco Polo.   No worries. I'm on it.  THERMAL POV - Every body in the laboratory shows up as a heat signature, including Sebastian. Frank points.   Gotcha, big man.  THERMAL POV - The HEAT SIGNATURE reaches for a chair.   Recording. Subject Doctor Sebastian Caine. Currently in phase shift... Three days, seven hours.   Vitals still nominal..   Yeah?   Don't you sleep?   Okay. I'm here if you need me.  He watches as Sebastian's heat signature moves toward the door.   Quiet. He worked in the lab till about 10:30 and then went to sleep.   Pretty clever really. All it does is recycle the signal. He flips this switch, it takes a snapshot and that's all we see.   Dogs aren't people. Are we in any danger?  Linda doesn't know.   Already in. It was only a second level encryption.  The Security System specifications pops up.   Oh the system is fine. It's just I'm just extraordinary.  Frank types a few more keys, and his eyes widen.   But apparently someone is more extraordinary than me.   There's nothing wrong with the system. Our codes have been removed.   Here's a clue. Only one code remains.   Dr. Sebastian Caine.   Doctor Caine?   Did you find him?   What happened? I don't understand.   But he's not a killer.  They all look at Linda.   It'd take hours to crack the encryptions.   If the room temperature is the same as his body temperature, thermal visors'll be no good.  Linda grabs a Tranq gun and heads for the door.   Linda...it's not safe.   But...   He'll be okay.   He's got to be okay.  Frank stands frozen.   Where are you going?   But...   Sarah, wait for the others    Slowly, deliberately, her own arm moves down the wall and around, until the tranquilizer gun points right at her stomach.  Sarah watches in horror as her own body betrays her.   Sarah! Sarah!  Goddamnit. Stay with me now. Don't you let up... Sarah! Sarah!  No response. Frank doesn't know whether to stay or go after her. He starts toward the door several times but can't leave Carter. Finally the door opens.   Sarah! I'm losing him.  But it's Linda and Matt.   Did you see her?  Linda rushes over to check on Carter.   She went to the supply room. Carter needed blood.  Linda grabs a stethoscope and listens to Carter's heart.   She didn't listen.  She-slowly pulls Frank's hand away from the wound.   But...   Her too?  Matt nods. Linda slams the cubicle wall with her fist.   Yeah? And just what are we supposed to do now?   Come on, Matt. Let's go get the elevator back on-line so we can got out of this hell hole.  Matt gives Linda a kiss...",
        "Chase": "",
        "Sarah": "Can I have a word?  Don t you think you should test the protocol on the liver samples before you inject Isabelle?  That s beside the point.  Fine. You can mop up afterward.  Kill? More like liquefy.  Yes, Sir. ... but somehow it feels like  Fuck you.  She storms off. Sebastian turns to Linda.  Normal. CARTER ABBEY, the late thirties lab assistant, wheels in a cart of equipment. Linda taken a seat by the table and pushes aside the sheet.  Elevated heartbeat.  Heart rate s up. She s scared. Sarah soothes her.  It's okay, baby. It's okay.  Goddamnit. Blood pressure elevating. Brain activity going through the roof. The brain appears, seemingly growing from the inside out. The shape of a large half-formed monkey grows from the inside out. A SKULL APPEARS howling in pain, in horror.  We ve got a problem.  It s her heart. We can see the heart beating in the ape s  She s going into cardiac arrest.  We re losing her. Her machine flatlines.  We ve got something! The heartbeat starts up again. The body continues its march toward,visibility.  Still. erratic.  Come on, monkey.  Stabilizing. The entire form glows, then blinks, then glows again, as if it was discharging some stored energy.   I think she s gonna be okay   Screw you, Matt.   She's right. We haven't even finished collating the phase two research.   You don't even know if any of the protocols will work on humans.   Pulse 88, BP 140 over 95. A bit elevated.   No reason for concern. He's ready.  Linda takes a moment and studies Sebastian's face. She's almost teary eyed.   Vitals are stable.  They wait and watch.   Heartbeat's elevated. Pulse at 100. ... 130 ...   Pulse is 165 ... 170 Blood pressure 180 over 100. ...   Pulse is 180 .... holding stable.  Screaming.... Then the organs go. Then the blood vessels. Leaving only a skeleton howling in pain. The jawbones spread wide ... Screaming... screaming...   Pulse is dropping. 170.. 150 .... 160..  There is NOTHING left of Sebastian Caine.   Vitals returning to normal. Pulse 110 ... dropping. Blood pressure 130 over 75.  A long beat as everybody's eyes stare at the instruments.   Pulse steady at 70.  A long beat.   Sebastian, how do you feel.   Fine. It's not like I have anything else going on in my sad pathetic life.   I'm fine. Go on ahead.   Dr. Caine! Goddamnit, Dr. Caine! Are you in here?  She listens. It's silent. She tries holding her breath, listening for his breathing. But there's nothing.  Sarah reaches over to a microphone. Hits a few switches.   Dr. Caine?   Dr. Caine, please report in.   Dr. Caine, report in please!   Shit.  She looks around the room. He must be in here.   Dr. Caine? Sebastian? Come on, this isn't funny. I know you're in here.  Nothing. No response. Sarah waves her hand around, reaching out, trying to find him. After a few beats she stops and rubs her head.   I must be going crazy.  Suddenly, Sarah gets an idea. She quickly exits the observation room.   I found him later in the lab, running samples.   Because I wasn't sure. I'm still not. I mean, I could've easily been dreaming.   God, I feel so stupid.   No. I mean...  It was probably nothing. I shouldn't've mentioned it.   Yeah, I'm sure. I mean, y'know, why would he do that, right? Just, this place at night can be kinda creepy, y'know.   Yeah. Why?   No. I...I'm fine. Hold still. This might hurt a bit.  The surface of his skin sheens in the light as Linda searches for a vein. She slaps his arm several times, then plunges a hypodermic needle into his skin. His skin bends and gives. The needle remains in sight after it slips through the visible surface. Sarah presses down on the hypo plunger, releasing a dye into his bloodstream.   Dr. Caine... this might sounds stupid, but are you... are you looking at me.  The red dye twists into a long snaking red tube up and down his arm. His vein.   Just felt like someone was staring at me.  Sarah pulls the vial off the needle and labels it with a grease pencil. After a few beats the red dye in Sebastian's blood stream dissolves and disappears, as does the liquid in the vial.   Heartbeat elevated.    He's not breathing.  Muscles are beginning to appear. And eyeballs. Frightened eyeballs.   Pulse erratic.  Sebastian pulls against his bonds. One set tears off.   I got no pulse. No pulse.   I think he's going into shock.  We slowly FADE OUT to the sights and sounds of our scientist- doctors working on Sebastian... And the beeping of Sebastian's erratic heartbeat.   You awake?   Notice anything unusual last night.   Franklin Three. He's dead.  Sebastian pulls a sheet around him. He moves across the dimly lit room like a ghost.   His neck was broken and his windpipe collapsed.   I thought maybe you could tell me.   He was alive last night when I left and he was dead this morning. And you were the only one down here.   A windpipe doesn't just suddenly collapse. Someone or something killed it.   Then we have a problem, because I the cage was locked from the outside. That means it was opened, the dog was killed and the cage was closed and locked again. Only a human could do that.   He killed a dog with his bare hands.   The man has checked out of reality.   This way.  They shear off the main corridor into the side corridor. Carter lies crumpled up ahead. Sarah slides to his side. Carter's head rests in a pool of blood. She checks his pulse while Frank takes a protective position.   Pulse is weak. Breathing... shallow.   It's pretty severe. We have to get him to the lab.   For godsakes, help me.  Frank snaps to. Grabs an arm. The pair hoist Carter up and carry him down the hallway.   His pulse is faint.  Sarah grabs a sheet from the counter top. Folds it and presses it against the head wound.   He's lost a lot of blood. Here. Hold this.  She guides Frank's hands to the wound.   Keep applying pressure.  Sarah pulls out a saline solution I.V. bag and slap it on the rack. She fumbles with the needle as she tries to find a vein.   Don't move your hand until I got back.  Sarah heads to the door.   This'll hold him but he needs blood.   Supply is right down the hall. I'll be two seconds.   If I wait, he'll die. Keep pressure on the wound.   Frank?  She eyes the supply room, looking for a sign of movement.    Who's there?  She listens. Is that breathing she hears? Now she's starting to panic.   Dr. Caine?  She starts to back away, but she's already in the corner. She clutches her tranquilizer gun, but there's nothing to aim at. The vials of blood on the shelf gives her an idea. She reaches over, grabs a vial and throws it on the floor. GLASS SHATTERS and BLOOD SMEARS across the linoleum. Sarah tosses another vial and another. Becoming more and more hysterical. Splattering more and more blood. But she runs out of vials. Shaking with fear, she searches the blood looking for a footprint, or movement. But there's nothing there. Sarah waits a beat, clutching the tranquilizer gun. Takes a step. Waits a beat longer.  Finally she relaxes. It was just her imagination. She heads toward the door when she hears a terrifying whisper in her ear.   Please no. Let me go. Oh god, let me go.  The arm holding the tranquilizer gun begins to move.   What are you doing? No!  Sarah fights, but her arm moves nonetheless   Help me! Oh God. Somebody help me!  No... please. Don't do this to me.  She struggles, shaking back and forth. Writhing. In anguish and in fear.   What do you want?",
        "Kennedy": "",
        "Sebastian": "Damnit. Sebastian pears out his window. Across the courtyard, a light comes on in a neighboring window. He sees a BRUNETTE, mid-twenties, absolutely stunning, enter her living room. The Brunette thumbs through the mail, tosses it and then begins to undress. Sebastian loans over to the window, getting interested. But when the brunette reaches her bra and panties, she crosses to the window and lowers her shades.  Damnit. Sebastian leans back in his chair and closes his eyes. He s obviously tired. He opens his eyes and stares up at the ceiling. Painted across the white matte finish in big red letters is a brief reminder -  You Should Be Working.  Sebastian sighs, leans forward and begins pecking away again.    I am a goddamn genius. He hits a few more keys and a telephone keypad appears on the screen. He dials.   You know Da Vinci never slept. Said it was waste of time.  Sebastian peers at the image of Linda in the computer window. He notices something behind her in the bed, the young man sleeping face down.  Who s that? Linda pulls the camera off the top of the of the computer screen and positions it so Sebastian can t see the bed.  Touche.  I cracked the reversion. Upon hearing this, Linda receives a jolt of adrenaline.  Look at this. Sebastian hits a couple of keys. A moment later the molecular structure appears on Linda s computer.  Watch this.  91% sure.  The usual. Coffee and twinkies.  I know. You think you could hunt down Matt and get to the lab early. I want Isabelle prepped for a live test.  Well y know. It s daylight in Switzerland. I gotta call the Nobel Committee and tell them to get our prizes ready. See you in a few. ON LINDA S COMPUTER SCREEN as Sebastian clicks off. Linda crosses to her bed, and shakes the guy awake.  Morning, Ed.  Sorry, Ed. You know the rules. Sebastian presses his thumb against a glass screen. A laser reads his print. Scan readout: CAINE, SEBASTIAN Clearance:    ALPHA ALPHA THREE Division:CLASSIFIED The doors whisk open and Sebastian steps inside.  Caine zero zero two seven.  Most normal people say good morning.  How many tissue samples have we successfully regressed? Hundreds, right? How many have gone on to work on the full system? None.  No, that is the point. I m not going to waste six months of my life on an outmoded testing procedure. This thing works. I know it. I feel it. Linda comes down the corridor, listening in on the tail end of the conversation.  You think I m going to kill Isabelle?  Sarah, thank you for your opinion, but I m the project leader. Understand? She says ...  How did you ever convince me to hire her?  Yeah, well she cares more about the animals than the research.  Who da Man? You da Man.  Vitals? Sarah, checks over the various readouts ... heartbeat, blood pressure, the rest.  How many times do I have to tell you, Frank you aren t God.  I am.  You guys ready to roll?  Okay. Roll  em.  Why thank you, Dr. Kensington, for that keen scientific observation. I ll be sure to include it in my memoirs.   Ready. She wraps a bungee cord around nothing and pulls it tight. She then takes some dye and sprays it. A surface appears, floating beneath the restraints. It sheens in the light as Linda searches for a vein. She slaps the surface several times. A small bulge appears, like a vein.  Nice try, Sparky. Matt relinquishes the needle.  Do you see this?  Subject began manifesting almost Immediately. Protocol is reacting quickly. Isabelle starts to struggle against her restraints. She begins to howl.  What? What problem! Sarah checks her monitors.  No! It s got to work. The body is only half there. It looks as if its caught in decomposition. Linda rubs the cardiac paddles together.   How is she?  To the finest research team I've ever known.  A round of \"Hear, hears\" and they all clink glasses and drink.   Hey...   Where would I go?  He looks out over the sweep of the city, the twinkling lights of D.C. and darkness of the Potomac river.   Twenty years ago there were no computers, no fax machines, no cell phones. I was just wondering what the world will be like twenty years from now... if what we're doing will change everything.   Something like that.   Actually it does.  I guess since you were there from the beginning, you know me better than anyone else on this godforsaken planet.   Yeah... but I was working so hard, I didn't realize I'd have no one to share it with.  Sebastian heads back inside. But he stops and turns back.   I don't suppose we could turn back the clock for a night and you could come home with me?  Her look says it all. Too much water under the bridge.   Right. Sorry. Too much champagne.  He turns and heads back into the party. As he heads in he passes Matt heading out. He and Sebastian exchange \"Heys\".    What's it like? Talk goddamnit! Tell me what it's like!    Six years ago, this committee commissioned me with a very specific task...   To successful phase-shift a human being out of quantum sync with the visible universe and then return him safely, with no after affects.  Next to Sebastian a video shows a small monkey shifting from the visible spectrum. It's hair, skin, organs and skeletons slowly dissolve before our eyes.   Well, we found out sending them to \"never-never-land\" was easy, it's the getting back that's hard.  Sebastian fast forwards a few moments until the video screen shows the bizarrely tangled heap of flesh and bone that used to be alive.   Every time we've tried to bring a test subject back from phase-shift. Cellular bonds would dissolve, the primary DNA strands would decay. But now...  Sebastian pauses. Something's bothering him.   But now...  One of the senior advisers, DR. HARRY KRAMER, distinguished 50s, finally breaks the silence.   But now...  But now, we feel we are closer than ever to resolving this issue. We've been experimenting with a new regression formula that looks rather promising. A FOUR STAR GENERAL leans forward.   Sir?   Shouldn't be more than another year, Sir.  Frustrated sighs all around the room.   Maybe sooner.   Keep your voice down.   I wasn't ready for them to know.   I had more than a reason. I had a goddamn epiphany.  They reach his Porsche.   What do you think they'd do if they know we could send a subject into phase shift and pull it back out again? How many seconds would it take for them to take over the whole project, bringing in their soldiers to test the formula on. We'd have lost control of it by the end of the week.   I know. But not yet. There's too much for us to learn. I don't want my hands tied by their political agenda when we go to phase three.   That's easy. I've decided to test the procedure ...   ... on myself.  The team sits around the conference table. Their jaws drop and they stare at him with wide eyes.   Was Jonas Salk nuts?   If we're that unsure, how can we morally justify testing it on someone else?   We'll have plenty of time to collate and cross-reference later. Monkey data doesn't matter anyway. The only real data is human data.   How are we gonna find out? Besides, we've succeeded with a gorilla and their DNA is 98% the same as humans. And the 2% is not that significant.   We're all concerned. I know that. But if we're gonna move forward ever, this is something we have to do.   The risks. I couldn't ask...   I'm Project Leader. It's my formula and my call. The best way to express your concern is to make damn sure you do your best work. I'll want about four weeks to...   To run some more reversions and tissue tests and then we'll attempt the phase shift. I'll stay shifted for three days of testing and then we'll perform a quantum regression.    A knock on the door.   Come in.  Linda pushes into the room and closes the door behind her.   What?   You don't understand.   Lin, trust me... nothing's going to happen.    Yes?  Matt sticks his head in.   Okay.   No. I'm ready.  Matt leads him into the hallway.   A little.   I don't think so.   You know, that could be the last joke I ever hear.   Fine.  Sarah checks his vitals.   To be expected.   Hey... it's gonna be okay.  Linda nods. Back to business.   I'll inject myself. If anything goes wrong, they can't blame you.  She hands the hypo Sebastian and steps away. Sebastian stares at the golden formula silently for a moment.   Yeah. If I'm killed, pretend I said something deep and clever.  Then... Back to business. He inserts the needle into the I.V. Sebastian. Presses into himself and depresses the plunger.   Nothing so far.   Recheck the protocol. It can't be non- reactive.   Goddammit.  Another long pause. Sebastian concentrates.   Okay wait, my arm... it's getting a bit warm... yeah, it's ... it's starting to tingle...  Excitement overtakes the room.   Okay... it's spreading to my back... like, like a fever...   Shit... it's starting to burn... Oh god. It hurts. I didn't think it would hurt.  The HEART BEAT thumps faster, accelerating   Pain!   No. Oh god! NO! STOP IT! STOP IT!  The muscular system begins to dissolve, leaving a struggling skeleton wrapped with tentacular blood vessels and stuffed with the major organs. The beating heart, the heaving lungs.   The lights! Turn off the goddamn lights! Ah Christ!  Linda jumps up and crosses to Sebastian. Matt rushes to the wall and turns off the lights. Darkness. The room is lit by the glow of machinery.   I can't... I can't close my eyes. I can't close my eyes.   So I ... I'm...   My arms. I can.. where? ... I can feel them...   Mirror. I ... I want to see.   I ... It's hard to think.  Sebastian's voice is now behind him. Matt turns around.   The transformation... I remember every molecule in my body shattering.   At first... but then everything went black. I couldn't see or hear or feel anything. It was all just black... like I wasn't connected.   At least my senses are starting to return... You're wearing your Shalimar, aren't you?  Linda realizes that he's standing very close by. Her hair lifts slightly and Sebastian inhales. Chills go down her spine.   This is weird. I'm looking through myself at the floor. I'm looking right through myself. I can't tell ...  He bumps into a chair.   ... where my body is.  A moment of silence.   You really can't see me. Can you?   No, just tired.  It's funny. I can see everything... more than before... but I can't see myself.   Not to bad, considering.  They turn round. The voice is coming from behind them. The group rises from their various workstations and turn toward where the voice came from.   Odd, isn't it?  A rheostat switch on the wall turns and the lights dim. Though it's a simple act, it feels somewhat ominous.   Over here.  Sebastian has moved. As everyone turns toward him again, he can't stifle a slight giggle.   Sorry. Couldn't resist.  His voice again come s from somewhere else in the room.   Boy, you people have no sense of humor.  A chair slides back from a desk and bends under Sebastian's weight.   Show me. So ...    Stop there.  Frank halts the tape.   Index that. That was when it started burn. Epidermal reaction.   Just a little longer.   Fine.     Thirty minutes. Yes,,_I know. I wrote the procedure.   You like this don't you?   Being in charge.  It's clear she does. But she's certainly not going to admit it.    Sarah. Are you awake?  Her heavy breathing mixes with Sebastian's.    Hmm.  Sarah's hair moves slightly, as if a hand were running through it. And then we see her shirt move, like fingers were tracing over it. Down from the shoulder to her breast. Around her nipple. Sarah moans slightly, as if she were dreaming, but she doesn't stir. And then her breasts cup slightly, as if they were being touched... softly... gently. Her breathing becomes harder, more labored, erotic... and then she... BOLTS AWAKE. Bar eyes wide with fear. She jumps and cups her own breasts and looks around the room. It's empty, of course. She jumps over to the monitor and checks on Sebastian's room. The heat signature isn't there.   Restless. Hard to sleep when you can't close your eyes.  As Sebastian talks, we can see the electrodes around his jaw pump up and down.   Got up a couple of times. Knocked about.   I guess I didn't hear. I had the radio on.   I didn't think it was a problem.   Next I want to run a VV and UVF analysis of the platelets.   You okay?   You just seem a little nervous.   No. I was looking at the clock. Why?  Sarah draws the plunger back, sucking Sebastian's blood into the hypodermic and then yanks the needle out.   You've no idea how much fun I've had. I'm going to hate going back.   How so?   Maybe we won't give it to them. His voice comes from behind her now.  We see indentations on her shoulders where his fingers press down.   I was thinking... tonight's my last night. Ever fantasize about making love to an invisible man?  Linda pulls away from him.   Well, don't do it for me. Do it for science.  Linda walks away. Sebastian laughs.   Oh well. Missed your big chance.   Not really. I was just starting to enjoy myself.   Wait... something... something doesn't feel right.   I can't br... br...  Sebastian begins wheezing.    Hey...   So I guess it didn't work.  Linda shakes her head.   You look worried. It must've been bad.  Sebastian's voice is weak and strained.   Well, remember your Nietchze. Whatever doesn't kill me, makes me stronger.  Linda smiles.   I guess if I'm going to be stuck this way for awhile, I'd better make some adjustments.   The latex'll limit the amount of light delivered to my optic nerves.   Well, it gives you a face to talk to at least, and we can all work in normal light again.   The testing's making me sick.   I can't believe I have to spend another night here.  Suppose you're gonna go home now, meet up with that boyfriend of yours now.  Linda and Matt exchange a glance. Linda quickly covers.   No. That's okay. It's just, being a guinea pig is more work than I thought. I'll be fine.   Just stopped by to let you know, I'm going out for a bit.  Sebastian turns back into the hallway.   If I don't get out of here, I'm gonna go crazy.   Why not?   Yes, but I made that rule. It's my rule and I'm changing it.   Carter, I was suppose to be like this for three days. Three fucking days and I'll be damned if I'm going to spend the rest of my life as a prisoner in this godforsaken dump. Now I'm going out. I'll be back in a couple of hours. Okay?  The elevator doors close with Sebastian inside. Shit.   Yeah, well. You know how it in sometimes.   Thanks, but everything's cool.  Sebastian starts his car. It chugs a few times before turning over and speeding out of the warehouse.    Sebastian packs up a few personal belongings in an overnight duffle. He crosses to his bookcase and pulls out some books and throws them into the bag.  But as he does, he notices a light come on in the window across the courtyard. Sebastian turns off his bedroom light and moves toward the window. He peers across the courtyard into the Brunette's apartment.  He watches the Brunette as she comes into the living room from her front hallway. She drops her keys on the table and begins unbuttoning her blouse as she crosses to the window. Just as the blouse slips off her shoulder, she pulls her blinds shut.   Shit.  Frustrated, Sebastian steps away from the window and then stops. Something has occurred to him.   Don't even think it...  He looks down and notices his hand is trembling. His breathing is a little heavy. A little nervous. He catches a glimpse at himself in the mirror.    Once...just once.  The Brunette's living room light switches off and the bathroom light switches on. We see him fighting an internal battle and we see him lose it. He grabs a hold of his hand and peels the latex skin off.    Linda exits the elevator and heads down to Sebastian's door. She knocks. Waits. No answer. She knocks again. Waits.  And then she tries the door. It's unlocked. She pushes the door open.    Linda pushes through the living room, into the bedroom.    The elevator doors open and Linda steps inside. The doors close shut behind her. A beat later we see the indentations of footsteps come around the corner. We follow the breathing and stumbling footfalls back into...    We push over to the bathroom sink. The faucet turns on and the water starts running.  We see the water cup under the faucet and splash against Sebastian's face. His face appears briefly in the water. Then the water slips away.  For second it sounds like he's crying, but then we hear something far worse. He's laughing. Nervous laughter.   Relax, Linda. No one's gonna find out.  They all turn around. At the door is Sebastian, back in his latex outfit.   I got a little stir crazy, so I went to my apartment to pick up some stuff.   What are you talking about?   Just what did you see in my apartment?   Don't make a mountain out of molehill. I didn't let anyone see me.   Come on, Linda. You don't expect me to be some kind of prisoner.   I'm still Project Leader, Linda. It's my decision to make.   Matt?    How much blood do you think you've taken so far?  The surface of his skin sheens in the light as Linda searches for a vein. She slaps his arm several times, then plunges a hypodermic needle into his skin.   Every day... feels like you're sucking me dry.  Linda presses down on the hypodermic plunger, releasing a dye into his bloodstream.   It's funny. All these years I've known you, I never pegged you for a megalomanic.   The shoe being on the other foot. You getting to run things.   Don't patronize me.  And for the record, you've got no idea what it's like. I get up every morning and you people stick needles in me. You bombard me with radiation until I vomit. And then at six it's over for you. You get to go home. But Sebastian is still here. Sebastian can't leave, or else. That's the worst part, you know. Here I have this ... this GIFT and I can't even use it.   You're goddamn right it's a gift. And if you weren't so goddamned short sighted, I'd be out there right now trying to master it.  Sebastian looks around at the other scientists staring at him. He tosses the hypo with the needle onto the instrument tray and heads toward the door.   Looks like I'm going nowhere.   Do them yourself.    No.  Linda looks over his shoulder.   Funny, huh? I've become a literal metaphor.  He puts the books down.   I know. And you being right doesn't make it any easier for me.   I'm not scared of being stuck this way. With a little more make-up and practice, I could...  ... pass. Y'know, get by in the world. But the testing...   What if it's years? I don't know how much more testing I can take.   We've got it. We've got it.   Come on, baby. Come on.  But the blood cells nearest the blank patch twinkle out existence, and then those around them also blink away until after a beat, the screen is empty.   You're sorry? You're fucking sorry?  Sebastian picks up a glass beaker and hurls it against the wall. It shatters.   Six weeks of this shit and you're sorry!  He grabs more equipment and begins tossing it in a rage. Carter and Janice grab him and restrain him. After struggling against them a beat or two, Sebastian calms down and pushes away from them and heads out the door.   I'm going to the lab.   Waste of time. Da Vinci never slept.   Ah, my two favorite people. Good morning.   You know some days you just wake up feeling the world is full of potential. Like your eyes have been opened.   Cook up a batch and let's see where we go.   I trust you. Now if you'll excuse me, I need to have my head examined.   When you were a kid, you ever dream about being invisible?   What did you imagine you'd do?   What's the usual?   Jimmy Margiani?   Ever think up anything along the grand scale?   And what if it weren't fantasy? What if you were out there in the world and could do whatever you wanted with no consequences whatsoever. How far would go? I mean... if it were real?   Let's say you saw a woman with amazing tits. Would you brush against them?   Human nature. So if you could get away with more, would you do more?   Eighty two percent? Makes you wonder if the world's ready for what we're doing.   What do you mean?   I just walked around. Y'know.   Like what?   Kind of sophomoric, don't you think. Besides, it was late and I wasn't out that long.   There was this one girl.   Naw...  Sebastian gives Carter a sly grin.   Well maybe a little.  I tell you though, a man could get used to it.    Then ...   Goodnight.  Linda-jumps.   Sorry, didn't mean to frighten you.   Be quiet!  A photograph of Linda drifts through the air and settles atop a flaming candle. It ignites into fire, twisting and turning in mid-air, then falling on the floor as ash. A beat later water runs from the sink faucet. It forms in the shape of hands and splashes against his face, dripping away.   And the cyclops screamed out, \"Who is it who blinds me?\" and Odysseus replied \"Nobody is my name\". And the Cyclops raged to his friends \"Nobody is killing me. Nobody\".  The barking continues. A moment later the chamber door slides open. We push down the...   Shhhh. It's Nobody-It's nothing.  The Plexiglas door to the doggie's cage swings open and some invisible force grabs little doggie around the neck. The force squeezes its little fur ball throat until the barking stops.   Nobody's gonna hurt you.  The force keeps squeezing until the little doggie goes limp. Then the dog smashes against the Plexiglas over and over until blood spills out its mouth. The Plexiglas door swings closed again and moments later the door to Sebastian's cubicle closes as well. The water runs in Sebastian's sink washing the blood away from his now half visible hands.    I am now.  The sheets raise and drape off of him.   No. Why?   What of?   How'd that happen?   Sarah... You saying I had something to do with it?   I was in my room all night.   Any big plans for tonight?   Really? Whatever happened to that guy your were seeing?   Being locked down here, I'm forced to live vicariously. Someday you'll have to tell me what he's like.   Au domain.  Sebastian watches Linda walk away. He glances at the camera and starts to peel off his face.   Hmmm.  We see the footsteps start to head back toward the warehouse.   What the hell?  He breaks into a run. Feet splash water and he races back toward the warehouse.    We hear breathing and footsteps as we push through some bushes and head toward a bay window which looks into the Kramer living room.  Through the glass we see LINDA and MATT seated across from DR. KRAMER. We can't hear what they're saying but it certainly looks serious. Kramer puffs on a pipe and strokes his beard, shaking his head.  Kramer rises and shakes hands with Linda and Matt, and the three of them head toward the front door.  We move away from the window and track toward the front door. As the door opens we begin to hear the tail end of the conversation.   What? No good morning for me? Don't you like me anymore?   That's okay. It's going to be busy day.   I'm sorry. But I can't lot you turn me in.   You have no idea what it's like. The power of it. The freedom. I can't let that go.   There's nothing to talk about. See ... I've done things that can't be undone.  A long beep as the intercom clicks off.    Janice enters the office.   I'm here.    Janice struggles with her unseen assailant, slamming into walls and knocking into filing cabinets.    Linda and Matt knock.   Marco...Polo... Marco... Polo...  His voice keeps shifting. Matt fires.   Not even close.  Matt sweeps his front leg back and forth, like a blind man using a cane. But his foot isn't hitting anything. He sees a FIRE EXTINGUISHER mounted on the wall. He rushes it, turns it on the hallway and sprays. And SOMETHING LUNGES through the foam. GRABS HIM, sending him tumbling down the tunnel. Matt is thrown against the wall. Blood coming from his brow. He scrambles away, spraying more foam. Sees a shape in the mist, raises his pistol and FIRES. The shape leaps away. The DART FLIES. Doesn't hit. Matt scrambles back into a corner. His pistol is empty.   So... just out of curiosity, how long has my best friend been fucking my ex- girlfriend.   She's a pretty sweet fuck, isn't she?   I'm sorry, but I just feel that our friendship is holding me back. I'm sure you understand.  THE DOOR OPENS. Linda reaches through, grabs Matt. She pulls him to his feet and through the door.   You missed.  Her hair flies up, and she swings against the wall. She tries to move, but she's pinned there. Her hands struggling against the force.   You.  The trigger pulls .... Pop!  A dart explodes from the gun and imbeds in Sarah's stomach. She whimpers as her eyes glass over. Suddenly she's released. She stumbles backward and falls lifeless to the floor. A moment of stillness, all we can hear is the sound of someone breathing.  On Sarah's face... a slight-indentation runs down her cheek..  Almost sweet... almost tender. And slight indentation runs across her breast and strokes down her body. The sense of violation and vulnerability is awful. Sebastian sighs.   I've always liked your feistiness.  Sarah's head shifts slightly. Her head shifts violently, accompanied by the celery crunch of her neck snapping. Sebastian exhales, his breath filled with the intoxication of power.   Now? Now you die.  The three of them whip around.   I would say that what I am experiencing is psychological awareness. I like you being in complete and absolute control.  They identify the general area the voice is coming from: Back inside the Chamber! They slowly move toward the Chamber door. With lightning speed they slam the door shut, locking Sebastian inside the Recovery Chamber.   You're never gonna bring me back Linda. I never want to come back.   Or maybe I'll fuck you. One last time for old times sake.  Linda slams her fist against the wall of the Chamber.   Imagine you two, carrying on right under my nose. Out of curiosity, what did he give you that I couldn't?   Okay, sweetie. I'll be quiet. If that's what you want...  Sebastian TOGGLES the intercom switch OFF. We pan over to one of the working video screens ... Matt and Frank stride down the hallway. The chair swivels and the observation room door swings open slightly.   Figured it out? You were always so clever.  Matt's pulled back across the lab by the cord around his neck. He grabs at the cord trying to breathe. Linda watches him being pulled away.   The villagers with their torches? Lock up your daughters! Sorry, Lin. It's not gonna happen that way.  Linda hits the lights. The lab is now very, very dark.   See, I've spent all my time down here thinking up this plan. When they find you, they'll find a pile of charred corpses. The result of a terrible accident, I'm afraid.  Linda reacts to the voice as it grows nearer. She navigates the maze of equipment, heading toward the crack of light at the front door.   I guess because I don't have to look at myself in the mirror anymore  Remember that first night I was out? I did something bad, just to see if I could get away with it. And when I did, I realized I could have it all. I can kill in broad daylight. And nobody's gonna tell the police they were fucked by a ghost. Anything I desire I can make happen, but not if people know.  Linda and Matt have reached the door of the lab. She pushes through it and slams it behind her.    A drawer opens, revealing a set of clothing neatly folded. Shirt, pants, shoes. They begin to move.   Caine. One One One One One.   You said it yourself, Lin. I shouldn't hold on to the past.  The door starts to shut.   Oh God!  Linda stalks toward him.   I'm gonna find everyone in your family and kill them-. Your sister... she never liked me. I think I'll go after her and her little boy first.  Sebastian smashes her head against a metal post. Her head cuts open, blood dripping down.   I just wanted you to know that before you die.  Linda collapses to the floor. Sebastian's foot presses against her neck, squeezing it. Linda gags for breath. But through the shoot of water that is Sebastian, we see something also... a watery smudge.   Remember the day we met? You were wearing a red dress and you were so pretty. Now... Now look at you.   You fucked it all up.  Linda looks at her feet. The last elevator emergency brake grips its cable. She grits her tooth and grabs hold of the ladder.",
        "Caine": "",
        "Janice": "Okay. We are rolling record on videos one through twelve. Frank hits a series of buttons and speaks into a microphone. Recording.  We re still in the green.  Isn't it a little soon to be moving into phase three anyway?   We're hot. All systems nominal, Houston.  Frank coordinates all the data being fed into the computers. He pushes a series of buttons and speaks into a microphone.   Something's happening.  Frank leans into the microphone.   I didn't think the human brain could spike that high.   So, what was it like?   Index Mark. 112125.  Janice scribble the numbers in her notebook. Linda crosses, nursing a cup of coffee.   What are the tranqs for?   Are you saying he's dangerous?   I don't blame him.   And you think he's violent?   What if he doesn't come back?   I do.   Some security system.   Dr. Caine? Are you in here? Dr. Caine?  Suddenly, Janice jerks back.    Her face blue, eyes bulging. An I.V. cord wrapped around his neck. Linda jumps back.",
        "Walton": "",
        "Dr.": "The stately stone house sits on a finely manicured lawn in one of the nicest neighborhoods in town. Linda's car is parked on the curb in front.  We break from a typical establishing shot and as the CAMERA tracks closer to the house, we realize that we are",
        "Kramer": "But now?  Linda and Matt look up at Sebastian expectantly.    The stately stone house sits on a finely manicured lawn in one of the nicest neighborhoods in town. Linda's car is parked on the curb in front.  We break from a typical establishing shot and as the CAMERA tracks closer to the house, we realize that we are   I'll call General Caster right now and convene the oversight committee tomorrow.   Just sit tight and wait for my call.  Matt and Linda head down to her car. Kramer heads back inside.    Kramer heads back into the living room. His wife appears a the upstairs railing.   What was that about?   Just a little trouble at work.   You coming up?   In a minute. I have to make a few calls.  Mrs. Kramer retreats back to her bedroom as Dr. Kramer crosses over to the telephone. He picks up the receiver and starts dialing. In the middle of dialing, the phone goes dead. He clicks the hookswitch up and down trying to get a dial tone. Nothing. He checks the connections on the phone and then follows the wiring to the wall. The line's plugged in. Weird. He hears a door creak open in the kitchen.   Hello? Hello?  Kramer crosses to the darkened kitchen. The kitchen door leading to the backyard is open. Puzzled, he crosses to it. A wind stirs across the pool and backyard, swirling dead leaves in small twists of wind. The windchime rings lightly. Kramer steps out.   Help! HELP! MARTHA! HELP!  As Kramer runs, he looks behind him. But no one's there. WHAM! Something slams into Kramer and he tumbles, rolling into the pool. But as he hits water there's not just one splash, but TWO. In the water next to him is human shaped AIR-POCKET. It's Sebastian displacing the water. And because of the water displacement, we can clearly see two arms pushing Kramer beneath the water's surface.  MARTHA KRAMER opens the bedroom window and looks down at the pool. All she can see is her husband drowning... his flailing limbs kicking up a massive air bubble around him. She races from the window. Kramer kicks and flails for a few moments and then his limbs stop moving. A moment later he floats to surface, face down. The AIR POCKET bobs over to the pool ladder, and rising from the pool, we see Sebastian's body outlined in sheets of water. The shape melts away in a cascading waterfall until all we can see of Sebastian are the hundreds of tiny droplets still clinging to his body, caught in the light like twinkling bulbs on a Christmas tree. The shape disappears into the darkness. A moment later Martha emerges from the house and sees her husband floating face down in the pool. She screams.",
        "Linda": "Sebastian, do you know what time it is?  What is it this time?  Not your business. Not anymore.  So you calling about anything in particular, or were you just hoping to catch me sleeping in the nude?  You cracked it?  You sure?   Eleven months with no progress and you suddenly come up with it out of the blue? How?  I hate you.  Yeah, I think I can find him. What are you going to do?  Hey... come on. DR. MATTHEW KENSINGTON, late 20s too, stirs from under sheets.  Sebastian just called. We gotta get to the lab. Matt bolts up.  Give me some credit, will ya.  He cracked reversion. Matt pulls his jeans on.  We better take our own cars.  I know. It s just You re his best friend. He ll feel betrayed.  You okay?  Yeah. She s become a lot more aggressive in the last few days. Linda takes the goggles from Matt.  Go take care of that bite. I ll get her.  Knock it off.  Isabelle! THERMAL POV - Dark hallway. Movement. A red shimmering heat signature. It comes running at Linda. HOWLING. Linda fires. A T-DART flies. Thwack... It stops in mid-air. Then falls. But it doesn t hit the floor. Instead, it stops inches above the ground. THERMAL POV - the heat signature lies in a heap at Linda s feet.  What s that make it?  But I m catching up.  You said you wanted the beat vet in the country.  Maybe that s why she s so good.   Testing De-Phase protocol. Injecting serial protein Caine One Two Five. Linda removes a glowing vial of orange liquid from a centrifuge nearby.  Propped.  Come on, Isabelle. You can do this. Sebastian lowers the hypo. The skin bonds and gives. The needle remains in sight after it slips through the visible surface. Matt presses down on the hypo plunger, releasing a dye into his bloodstream. The gold liquid twists into a long snaking tube up and down the limb. It s the shape of a vein. The liquid begins to react. Small flashes of light blip up and down the strand of color. Ba-bump.. ba-bump... the heartbeat starts to speed up.  It s working. It s actually working. Matt pulls the sheet back. Muscles are beginning to appear. And eyeballs. Frightened eyeballs.  Subject may be in pain or extreme discomfort.  Got the crash cart. Carter charges the crash cart and rolls it in.  Clear! Linda slams the paddles on the monkey s chest. The jolt of electricity makes the monkey visible again for a brief moment. Then the skin and flesh fade away again.  Come on Isabelle. Come on. You can do it. You can fucking do it. Everybody s pulling for her.  Welcome back, Isabelle. Sebastian puts his hand on Linda s shoulder... a move that does not go unnoticed by Matt. We did it.  We should celebrate.   I thought you'd gone.   A little \"I am become death... the shatterer of worlds\"?   Since the day I met, all you wanted to do was change the world.  She puts her hand on his shoulder.   Listen, I know we've... I mean... well ... I just want you to know how proud I am of you. I know it probably doesn't mean a lot...   You're positively maudlin. You should be happy. Do you have any idea what you've accomplished?   Nothing. It's just... He is who he is. Sometimes I just have to be reminded.    I'm sure he had a reason.  You did have a reason, didn't you, Sebastian?   It's their money, Sebastian. It's going to happen eventually.   Sebastian ... humans can talk, build houses and cook in microwave ovens. Gorilla's live in trees. That's a helluva 2% if you ask me.   Why you? Why not one of us?   What if you're too valuable to lose?   In the past six years, I've never once challenged your decisions, but this ... Sebastian. I don't think you should do this.   Oh please. How long were we together? You must've said it a million times ... Nobody knows who built the lunar lander. All they remember in the first man on the moon.  Sebastian shrugs and nods.   But what if something happens to you... what about the project?  Sebastian smiles.   He refuses to listen to reason.   Sorry. I just can't let it go.  Matt props himself up on the pillow.   So how can we let him do this?   In a heartbeat.   Let me ask another question.   Is the human race really ready for what we're doing?  Matt groans and rolls over.   No really. Is it ready? We're barrelling down a road that begs moral and ethical questions that I don't think we can answer.   This night is still young.  I mean, when you think about it, it's creepy. Do we really want to live in a world where people can just disappear in the blink of an eye?   O.K. How're you feeling?  Sebastian takes a deep breath.   Start recording.   Subject: Male, Age 29, weight 166 lbs.  Matt jabs a hypodermic into small vial of colored liquid. Draws up 20ccs.   We can still shut down, Sebastian.  He shakes his head.   Injection was administered at  ... 18:23:47.  The colored liquid snakes it's way into his bloodstream.   Keep talking. Tell us what you're feeling.   Nothing's happening.  Another moment passes by.   Maybe we overlooked something.   Frank?   Here we go.  Slowly the flesh on Sebastian's arm begins dissolving, revealing the complex network of nerves, blood vessels and flesh beneath it.   What do you feel? Keep talking. KEEP  Prop the crash cart.  Carter grabs the crash cart, rolls it in. Matt tears off the I.V. leads into Sebastian's arms.   We can't!   Bio-quantum phase shift occurred at 18:26.  The screaming continues and the restraints continue to twist and turn. Suddenly the restraints go limp.   No. He passed out from the trauma.    You did it, Sebastian. You're the first.   His breathing's hypnotic. How long's it been?   Where are the others?   I keep looking at that hole, wondering if he's really there.  She notices something out of the corner of his eye. The sheet twitches.   Did you see...  The sheet twitches again.   Your eyelids are transparent.  The sheets slowly stop thrashing.   Yes.   Your arms ... your whole body... It worked, Sebastian. It worked.  The sheet rises and slips away. The wires, seemingly connected to thin air, spread out like a spider's web and then fall away one-by-one. The monitors all go dead.   Your system received quite a shock.   Sebastian.  Linda's hair drops back to her shoulders.   Sebastian?  No answer. Linda and Matt look at each other, slightly alarmed.   Gimme symptoms. Dizziness, nausea, headache, body-ache, disorientation.   Why don't you ask him?  Linda motions to the gap between her and Matt. The four of them stare at the nothing.   He can't close his eyes so they're sensitive to light.  Linda's explanation puts everyone at ease.   C'mon Sebastian. Knock it off.   It's late. Time you got some rest.   Hate to pull rank, but you're my patient now and you need rest. We've got a busy day tomorrow.  Heavy sigh.   We've set up a thermal camera for observation and I've arranged one of us to be here 24/7 in case you need anything. The team's gonna be on alpha- call alert for the duration. If anything goes wrong, we can all be here within...   I was trying to be reassuring.   What's that?   Please. I'm just doing my job.    You gonna be okay?   Carter'll be in at six to spell you and I'll be in by nine. Call me if anything happens, okay?  Through the glass wall, Linda sees Matt knocking and waving her out.   Days only get longer from here.  Linda catches Matt's eye. Gives him a look. \"You coming over?\" Matt nods, \"yes\", imperceptible to everyone but Linda. She smiles.    Why didn't you call me?   I can talk to him.   Sebastian? Goddamnit.  We hear Sebastian's laughter echo in the room.   That's what worries me.?   What happens when we turn the project over to the Army. Ever wonder how much fun they're gonna have?   Stop it, Sebastian. It's not funny.   Grow up.   Got some sleep. Big day tomorrow.   Recording?  Frank peers down at her from the booth, his voice echoing through the chamber.   De-Phase protocol. Injecting Serial Protein Caine One Two Seven.  Matt removes the glowing vial of orange liquid from a centrifuge nearby. Carter hands Matt a hypo. Matt jabs it into the vial, drawing up the colored liquid. Linda sprays Sebastian's arm with dye.   Ready?   Tough.   What's wrong?   Carter!  Carter grabs onto the mass of flesh and muscle, trying to hold it back. But the restraints snap. The half-visible man is screaming. He grabs Carter and throws him across the room.   Sebastian! Sebastian!  And just for a second, Sebastian is fully visible. And free. He looks around like a scared animal and rips off all the wiring.   Sebastian!   He's reverting. Got him on the table.  Matt, Linda and Sarah pull the shifting body up and onto an operating table. Carter pulls himself up and heads back to the group.   Get me a I.V. of A.G. seven.   Sebastian... can you hear me? Can you hear me? How are his pupils?   Guess so.  I was just thinking about the Apollo missions. Y'know? Grissom, White and Chaffee... What it was like for them on that launch pad that day, thinking they were gonna reach the stars only to burn to death.   But he didn't die, did he?  What if we can't bring him back? What then?   No. I want to be here for him.  Linda pushes through the door of the recovery chamber and takes a seat by Sebastian's bedside. A little hurt, Matt heads down the corridor.   Hey...     You almost died.   I should be making you feel better. Not vice versa.   You could almost pass for human.  Sebastian rises. He looks eerily removed from reality with his cold blank expression.   Could be the barium or the radiation.   Do you want me to stay?    Linda and Matt each rush to their respective cars.   I'll meet you at the lab. I'm gonna swing by his place, just in case.    I don't want him to see.   Sebastian?   Sebastian?  She notices that the bathroom light is on.   Oh shit.  She scramble for the bedroom phone and quickly dials.   Yeah, Matt, it's me. He was here. No. He's taken his make-up off. I don't know...He must be outside somewhere. I don't know where he went. I'm coming back to the lab. How? How'm I supposed to do that? I CAN'T FUCKING SEE HIM! We're going on alpha call.  I want everyone at the lab now. We're gonna need thermal visors and we may need tranqs.  As she hangs up the phone, and heads out. The CAMERA doesn't follow, but instead pushes through the blinds and out the window. As we cross the courtyard, we begin to hear muffled cries of terror. We hold on the Brunette's window as we...    Use your imagination.   The Metro stops running after midnight and he's on foot, so he can't have gotten too far.   This program is classified. If he's out there it means someone might find out about him. He could destroy the whole program.   Bullshit! I went to your apartment and I happen to know you did a helluva lot more than pick some stuff up.   You, of all people How could you?  Caught dead to rights, Sebastian sinks into his chair. He thinks she knows.   You put yourself and this project at risk.   I saw your face and your clothes.   That's not good enough. When you're outside the lab there are a thousand variables none of us can control. It's just not safe for you to be out there.   You volunteered for this, Sebastian. You knew going in there could be consequences.  For the security of this project, I'm gonna have to ask you to confine yourself to the compound.   You're right. It's your decision. But if you leave the compound again, I'll notify the oversight committee. Then they can make the decision. You understand?   Pack 'em up... Everyone go home.    Hold still.  She wraps a bungee cord around the nothing and pulls it tight. She then sprays the inside of his elbow with dye.   Not enough to worry about.   What are you talking about?   I didn't ask for this, Caine. But when a classified experiment disappears in the middle of the night, someone's gotta run the show.  Look, I know how hard this has been for you.  He knocks her arm away and pulls the hypo, out of his arm.   Now it's a gift?   Where're you going?   Want to talk about it?   \"We are the hollow men, the stuffed men, headpieces filled with straw.\"   I don't want to fight you. I just want what's best for the program.   You can be scared. That's okay.   You're talking like you've given up. It's only been a few months.   That's all we need.   I'll go talk to him.   Good morning.   I restructured the third genome on your radiated protein strand. Thought you might want to take look.   I thought you'd want to take a look at it.   I'm telling you, I know him. Something's going on.   If he knew about us, he'd be angry and that wasn't angry.   It's fine. I just didn't know you were there. Goodnight.  As she leaves the Lab, he follows her down the hallway.    Linda passes through the revolving doors of her apartment building. A few beats later, as if caught by a gust of wind, the revolving door slowly turns on its own.   What was it?    Linda breathes a sigh of relief.   Thanks. No, just checking. 'Kay, bye.  Phew.  Matt pulls her into him.   He never left the room.   Are we sure?   Quiet night at home. Maybe a book.   He's still in the picture. Why?   Maybe someday I will. See you in the morning.    Forgot something.   Asshole.   Either way, we aren't equipped to handle this. We have to inform the committee.  Everybody murmurs in agreement.   They'll go after him.  Who has tonight's shift?   Pretend nothing's wrong. Everyone just do what you're doing so he doesn't become suspicious. Okay? Matt and I'll go tell Doctor Kramer and we'll lot the committee deal with it.  Sebastian's POV - He backs away and races down the hall.   Thank you, sir.   Oh, sorry. I...I'm in a hurry.    Matt sits across from her, twirling a pen in his hand. They both stare at the phone.   When did he say held call?   I'm gonna call him.  Linda picks up the phone and dials.   Yes, Dr. Kramer please. Excuse me?  When? I'm so sorry.  Linda blanches as she hangs up the phone.   He's dead. Drowned in his pool last night.  Linda picks up the phone again and dials.   Yes, General Thompson please. Thank you.  As she waits the phone line clicks dead.   Hello? Hello?  She clicks on the hookswitch.   I'll be right back with help.  Linda taps in his floor code.   Foster One Delta Eight Three Five.   That's a first.  Linda taps the keypad again.   Foster One Delta Eight Three Five.   Tell me this isn't happening.   We've got a problem.   There's no set check in procedure. It could be weeks.  A graphic of the elevator system pops up on the screen. Frank highlights the security terminal. Frank hits a few more keys. The screen reduces to a series of numbers.   You think you can got in?  Frank rewrites a few of the numbers.   Whose?   Okay, Sebastian. Fun's over. Tell us where you are.  She waits. Then...   Sebastian... where are you?   C'mon Sebastian. You're scaring me. Tell me where you are and we can talk about it.   Sebastian! Sebastian!  I want search parties. Thermal goggles and tranquilizers.   Sebastian?  No response. They push through the door. The room seems deserted. Signs of a struggle. File cabinets opened, drawers tossed.   There's something over there.  Linda moves toward it. Whatever it is its hidden from Matt's POV by the supply cabinet. As Linda gets close she pulls of f her thermal goggles to see...   Jesus. Oh my god.  Matt rushes over. Sees the lifeless corpse.   She was strangled. Multiple blows to her head.  Linda begins a medical check of the rest of the body. Matt stoops down and examines Janice's face.   We got a big problem here.  A lamp tumbles from the desk and smashes to the floor. Both Linda and Matt jump. Linda frantically dons the thermal visor and scopes the room again. Nothing. Matt notices the lamp cord beneath Linda's leg. Points it out to her. She sighs with relief... she pulled the lamp off the table.   Get everybody to the conference room. Now!  Matt picks up the phone. Clicks the hookswitch. Clicks the hookswitch again.   Gimme that.  She checks the phone, punches some numbers. Nothing.   It was just working.   Shhh.  Linda takes a few cautious steps. Senses something.   Give me the visor.  Matt, suddenly concerned, hands her the visor.  THERMAL POV - Linda checks out the corridor. Empty. Linda takes Matt's hand.   C'mon.  They move quickly up the corridor. See Frank, Sarah and Carter.   Janice is dead.   It's clear.  Matt, Frank, Janice and Sarah step in, locking the door behind them.   He wasn't. He is now.   No. We find him, before he finds us.   We designed it to help find the rats we kept dropping in year one. They were too small for thermal scans.  A map of the compound appears on the screen.   I've got movement in Corridor Six.    Check. Check.  Her voice echoes from the other unit.   Be careful.    Take a right at the next accessway. He's working his way back to the offices.  We see Matt and Carter on one of the working video screens as they push down the tunnel.   If he keeps heading in that direction.  Matt nods to Carter. The pair splits, heading down separate accessways.   I lost him. Matt, I lost him.   He was there.   I got movement again! He's right on top of you!   Right on top of you.   What's going on? Are you okay?   Matt, he's coming toward you.   Got outta there.  Matt breaks into a run.   He's close!   He's coming right at you!  Then checks the Thermal goggles. Several heat signature dot the tunnel.   Twenty, maybe thirty feet.   Those signatures ... they're coming from the heating vents.  Through the goggles, Matt sees the tunnel turning red.   Get out of there!   I'm going!   That's why I'm going.  Corridor eight is clear. Get Carter to the lab. We'll meet you there.   Do it.   I know. He's gone.   Habitats.   He's let the animals out. It wasn't him we were tracking.  Linda leans against the wall, still clutching her tranq gun at the ready. The heat is getting to bar. Bar scrubs are soaked, her hair's a mess. She wipes the sweat from her brow.   You okay?   Me .... Don't ask about me. If he freed all the animals, we could have dozens running around the lab.   Get to the lab, lock the goddamn doors and pray to God Frank can reprogram the elevator.   Where is she?   I said no one goes anywhere alone.   He's dead.  Linda would love to cry about it, but doesn't afford herself the luxury.   Oh god. Sarah!  The group breaks into a run. Linda pushes into the chamber and falls at Sarah's side. Matt cradles Sarah's head. They look for some sign of life as Linda fights back the tears.   No...   This didn't happen. This hasn't happened.   He's here!   Sebastian!  Silence. The three cautiously move out. They stand back to back, each one facing out. They move toward the door of the Chamber.   Sebastian. Sebastian, listen to me.  No response. They all their tranq pistols level waiting for some sign. Hearing each other breathe. They slowly move outside the Chamber into the corridor.   I don't know if you can understand this, but what you're experiencing is a psychological breakdown. This isn't who you are.  A beat.   You goddamn bastard! You goddamn bastard. You're gonna pay for this. I'm going to bring you back to visibility and then I'm going throw your ass in jail.   Fuck you!   Shut up, Sebastian. He's more of a man than you'll ever be.   Sebastian? Sebastian? No.. No...  Linda bangs on the glass. She looks. No movement, no nothing. She listens. Shit. She takes off running.   Matt! Frank!  Tracking with Linda as she rushes down the hall.   Matt! Matt! Frank!   Jesus!  Linda rushes over and slams into Matt. They fall to the ground. Linda crawls over to Matt, but her head snaps back and her lips erupt with blood.   No!  She clamors over to him. But Matt rises in the air and is tossed against the lab table. Linda levels her dart pistol and fires haphazardly at the air. She hits nothing but objects jerk and move in a line as Sebastian heads for cover. Linda manages to grab Matt and pull him to her.   Hang on!    You won't get away with this. They'll find out about you. They'll hunt you down.   How can you be so brutal?   Just keep going. I'll fix you later.   Matt... Matthew. Stay with me now.  Linda pulls his scrubs open. The wounds are many and deep.   Shhh. Don't talk.  BAM! Something slams against the door. Bam! Slams against it again. The old deadbolt is buckling. Linda looks around the room and sees the storage freezer.   We gotta move. Hang on.  Linda helps Matt up and into the storage freezer.   You feel that?  Matt smiles.   Your losing blood, but he didn't hit the vitals.  She looks around.   Sutures and thread.  She rises, and looks outside the porthole into the room. Suddenly it fogs up and she almost sees a face. She stumbles backward, and the door starts rattling. Linda scrambles over to hold the metal crowbar in place. Sebastian pulls and rattles on the freezer door. To no avail. It's not gonna budge. Finally he gives up. The door stops shaking. Linda is relieved, briefly.  Still. Then she hears the click of the door locking.   Goddamnit.  Linda looks around the storage room. She grabs a roll of duct tape and pulls off a length.   This is temporary.  She takes paper towel and cleans off Matt's wound. She tapes it, using duct tape.   You still with me?   Just keeps getting worse.  Linda returns to the door. Shakes it.   Oh shit.  The inside thermometer has dropped to five degrees.  Linda grabs the metal bar and starts smashing it against the porthole. The metal bar just bounces off the glass.   There's got to be.   Matt! MATT!  She checks his pulse. Thank god he still has one, but he's not gonna last long. They're both already starting to turn a little blue. Linda stares desperately up at the shelves, trying to find some sort of advantage. Then she sees something. She looks back at the door lock and then she rises ... and grabs AN EXTENSION CORD coiled on the shelf.   We're not dying in here.    Sebastian!  And there's Linda. Slicked with dirt and blood. She holds a oxygen container with a cut line.   I can't let you leave. Come on out and I'll give you one last chance.   Aaaaaaahhhh!  She hits the top of a LIGHTER duct-taped to the hose. A line of PRESSURIZED FIRE BLOWS into the elevator. WWHHHOOOOSSHHHH! Sebastian goes up in flame. Linda runs toward the elevator. Just as the door's about to close, she slides. Her foot jamming into it. She lets loose with the flame again. Sebastian, backed into the corner, has no where to go. He's yelling in pain. His latex FACE BUBBLES and burns. The surgical scrubs SINGE BLACK. With no other escape route, he dives toward the door. Linda looks up to see his flaming body fly over her, back into the corridor. Linda kills the tank as Sebastian continues to burn. The elevator lights flickers and the security panel goes up in a shower of sparks. The elevator dies. Linda pulls herself to her feet and turns to see...  Half of Sebastian's head MELTED AWAY, his latex facade a gruesome smoke-damaged mass. His clothes are half burned revealing large blistering bubbly welts underneath, like deformed blackened bubble wrap.  Sebastian crawls to his feet, but Linda hits him with another shot of flame.  Sebastian pulls at his clothes as he crawls around the corner.   You wanna see God? I'll show you God.  Linda turns the corner to see a heap of smoldering latex and clothing strewn about the corridor floor. Sebastian, looking like some ugly creature, pushes down the corridor. He throbs with his blackened skin blistering and cracking up and down his body. Linda lets loose another jet of flame. It's smaller than the first and doesn't quite hit Sebastian. Linda checks the tanks pressure gauge. It slowly drops. Linda follows the blackened horror into the maze of tunnels. But as he pushes along the corridor, his burns slowly re- absorb themselves. Sebastian is no longer visible. A quiet moment in the hallway as Linda realizes how vulnerable she is. She looks around for him desperately. Nothing. But something on the ceiling catches her attention. She blasts it with the last jet of her dying torch. THE SPRINKLER SYSTEM, hit by fire, comes to life. Water sprays down on the tunnel. Sebastian is caught in the downpour, his invisible frame outlined by water. It comes toward her, the hot skin steaming in the water. He grabs Linda and slams her against the wall. His watery hand smashes her across her face. Linda reels. On the floor, she looks to see Sebastian stalking toward her. She crawls away, but he grabs her by her hair, pulls her to her feet and slams her against the wall.   Nitro...  Matt peaks inside.   He's rigged the centrifuge.   Grab on.  Linda hooks the crowbar onto the hatch lip and pulls herself up. She reaches back down for Matt.   Fuck you. Give me your hands.  Linda grabs Matt's hands and pulls for all she's worth. She struggles, but they both manage to got him through the hatch.   Climb!   Climb!  Matt starts up, rung after rung. Linda climbs right behind him.   Keep moving.  He does, through sheer force of will. Blood from his wound drips down on Linda's face. No telling how much further they have to go in this darkness. Light leaks in from the maintenance hatch below.   Oh God!   Move!  Panicked, Linda pushes Matt up the ladder as she stares down at the rising fire wall. But the fire dissipates before it hits them, though a stray tongue of flames reaches up to lick the soles of her feet.  They hear a terrifying moan and looks up to see the elevator peaking far above her. It slows to a stop and  C'mon. Before it slips.  They begins to climb up again. Matt shimmies through the tight hollow, and squeezes out the other side, followed by Linda. She breathes a sigh of relief and just hangs there a moment when ... Ah! Something grabs her. A singed throbbing hand emerges from the darkness, gripping at her leg.   It's him.  She kicks at it and sees a dark dirty face - a swirl of dirt, grime and smoke with hollow eyes - rise up the ladder.   Get off me.  Sebastian pulls himself up Linda's body. Translucent dirty hands paving at the fabric of her clothes. Linda tries to climb with this thing on her. But Sebastian grabs her around the neck. She begins choking for breath. Linda fights to keep her grip on the ladder... She looks down at the ten foot drop to the elevator and then... She lets go!   Let go of me.  Sebastian presses her up against the ladder. Presses into her from behind. He has her trapped. His dirty hand reaches out and strokes her hair.   Go to hell.  Linda stamps on the brake release. The ELEVATOR TUMBLES ... along with Sebastian. It slams into the fiery abyss a hundred yards below. Linda hangs, one hand holding onto the ladder, the other holding onto Matt. Matt pulls her back onto the ladder, using all his remaining strength.   We lived.  Linda looks over her shoulder at the traces of the ruin and she sees a shimmer of heat rising from the ground... almost as if something was there.",
        "McKay": "",
        "Matthew": "",
        "Kensington": "",
        "Mrs.": "What was that about?   You coming up?"
    },
    "imdb_rating": "5.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMmFjMzY0ZjgtMjZhOC00MTRlLWEyM2EtYjBhOGVlMTQ0MTgzXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "Having discovered they could turn animals invisible, a group of scientists test the subject on a human. Head of research, Dr. Sebastian Caine decides to use himself as the subject. After the experiment can't be reversed, it takes a toll on Caine's personality, causing him to hunt down and kill his colleagues",
    "name": "Hollow Man",
    "genres": [
        "Action",
        "Horror",
        "Sci-Fi"
    ]
}