{
    "filename": "Hot-Tub-Time-Machine_script.txt",
    "imdb_id": "tt1231587",
    "imdb_url": "https://www.imdb.com/title/tt1231587",
    "characters": [
        "Young Adam",
        "Chaz",
        "Blaine",
        "Kelly",
        "Adam",
        "Jacob",
        "April",
        "Nick",
        "Young Nick",
        "Zoe (as Crystal Lowe)",
        "Repairman",
        "Lou",
        "Phil",
        "Young Lou",
        "Jenny"
    ],
    "dialogues": {
        "Young": "What the hell do you want, old man? Lou PUNCHES his YOUNGER SELF in the face. Young Nick and Young Adam are freaked out, as is regular Nick. Adam doesn't notice, as he's arguing with Jennie.  What the fuck, dude?! I think you broke my nose! My parents are gonna sue the shit out of you!  How do you know my parents? 80.  I don't give a shit about hair.",
        "Adam": "You know it. I'm gonna bang all sorts of chicks this weekend!  Sorry, honey. Adam gives his beautiful fiancee a playful kiss. She shows him some PHOTOS.  Check out that young stud. Can you believe he's about to get married? Lily and Adam look through more PHOTOS of a YOUNG ADAM partying at a SKI RESORT with his FRIENDS: -- In full 80s SKI GEAR on a mountain... -- Eating PIZZA at \"Papa Enzo's,\" stuffing their faces... -- Drinking BEERS at the \"Brew Haus,\" an awesome pub... -- In the HOT TUB with SIX GIRLS... Adam snatches the last photo from her.  Ignore that one. Nothing happened. I love you. Lily laughs.  I'm not sure.  Oh! Jennie.  She's nobody. Ski instructor.  You didn't know me yet. Lily still looks at him a little hard.  Lily, I was 17. She had boobs and a face. Of course I'm gonna take her picture. Lily still looks a little bothered.  Of course not! I think of you. As Adam goes to EMBRACE her:  Sweetie? She comes out a moment later with a CARDBOARD BOX, which she empties onto the BED. About FIFTY PORNO MAGAZINES spill out, ranging from TITS MONTHLY to BLACK ASS.  How did you know where I hid my... treasure? Lily carefully picks up a BROCHURE from the pile, holding it by the corner, not wanting to touch it.  OK! You caught me! I occasionally... reminisce... about Jennie O'Keefe!   About two hours ago when you were on the phone with your mother.  What are you so worried about?  Baby, the girl in that picture was nothing more than a crush. I could never get her and there's no possibility I'll ever be with her. She was a total stranger. Lily gets a CURIOUS LOOK on her face.  Well not the creepy \"your mom was in an accident, now come with me\" kind. But yeah, the hot lady in the supermarket kind of stranger. You have to admit - it's kinda hot.  You kidding me? It would be fucking incredible. 5. Lily smiles seductively, as Adam starts to get it.  Wait a minute. Are you suggesting... yes. YES! Adam excitedly heads for the door.  OK, I'll go down the hall. You get into character.  This fucking rules. Adam leaves the room and Lily REMOVES HER SHIRT, talking sexy and slowly building the fantasy...  Love where you're going with this, baby! Keep it up! She unbuttons her pants and SLIDES DOWN HER JEANS.  You should probably take them off!  Sorry! Continue! You were just about to take off your panties! She slowly slides out of her panties, kicking them away. Now she's TOTALLY NAKED. She continues to role play.  Special delivery for -- Jesus Christ! The black man doesn't know which way to look. He covers his eyes and drips coffee, as he blindly steps toward the door.     Yeah. Wow.  Babe, look at Nick... In the car, Nick air drums to whatever's on the radio.  You think with him in charge, we're gonna get into any kind of trouble? We'll probably eat too much pizza and I'll twist my ankle getting off the ski lift.  Sandwich. Thanks. He puts it in his BACKPACK. She looks like she was expecting a different reaction, but she lets it go. He kisses her.  I told you, I'll call you when-- She snatches it out of his hands. Adam looks confused, as she pockets the phone.  You should. I'm a lame-o.  I'm so psyched about this weekend!  You're a good friend. I'm sorry for putting my career and self sufficiency above bowling night.  Live the dream.  OK, I sure wi-- CLICK. For a moment, there is an uncomfortable silence.  Don't her parents own the supermarket?  This looks like a place where people die. Mostly from murder. A BALD, miserable-looking GUY in his late 30s  exits a room, carrying TWO SHOPPING BAGS. He gets in the back seat. Adam looks happy to see him.  Lou!  Dude, it looks nice.   What'd you bring? 11.  She's got a hell of an attorney.  She told me it was for a friend.   Thanks for coming, man.  Be nice. I know Jacob's kind of a douche, but I'm trying to be closer to him since Mom died. Jacob gets in the back next to Lou.  He's not gay. He's just... what are you again?  Will you two please shake hands and make up? We're gonna be spending a lot of time together. Jacob distractedly TEXTS on his phone.  It's gonna be fun.  Thank you.     That's the sacrifice. Jacob nods, agreeing with Lou's concern.  I did OK for myself.  Fifth. Thank you.  Assuming I got laid when I was zero.  I'm fine. Maybe some cold feet, but that's normal. Thank you everyone for your concern.   Is this about something else?  No, let's do this. I'm sorry I wasn't around when you were growing up, OK? I was in college. And then I was working. Dad left. Someone had to take responsibility.      You might like it. Havenhurst is pretty awesome. Jacob shrugs, but Lou gets excited.     No I won't.  Uh... I'm not having sex with anyone this weekend. Lou looks at Adam, trying to figure things out. 17.  I'm not having sex this weekend. Without the winking.  I'm pretty sure you don't.  Yes!  Oh man. The Brew Haus is a PF Chang's. Lou notices a TGI Friday's, with a sign advertising a \"Hannah Montana 3-D Experience!\" He looks utterly disgusted. 18.  Pink Paradise. Best strip club ever. The car rounds the corner and a SIGN comes into view. The beginning reads \"Pink.\"  I'm not playing drinking games with my grandma.  Guys! Everyone looks at Adam.  Let's give it a chance. We don't know for sure that the room sucks. Nick nods, appreciating the optimism. He opens the door:     At least some things never change.  Shame on you.  It's been a few years.          Thanks for coming, man. It means a lot to me. Jacob nods halfheartedly.  Nick, look. You had great intentions. No one's blaming you.  Yes! Lou gets up and throws down his napkin.  Coming right up. Adam CRANKS A KNOB. As the BUBBLES comes to life, we begin a TUBBIN' MONTAGE over Reel 2 Real's \"I Like to Move It.\" 28. -- In the tub, the guys DRINK like fish, pouring various combinations of VODKA, RED BULL, MOUNTAIN DEW, BACARDI, and anything else they can get their hands on. -- Jacob's LAPTOP is propped on the edge of the tub, playing BETTER OFF DEAD. Every so often, one of our guys takes a drink, playing a game, the rules of which only they know. -- Adam takes a big bite of the SANDWICH Lily gave him. -- Nick uses his iPhone to take video and pictures. More drinking games. The guys wear funny HATS and roll dice on a PIECE OF WOOD. Adam has to drink some tub water. -- The guys keep reaching into ADAM'S BACKPACK for MIXERS. -- Nick, Adam, and Lou LAUGH. Then, Lou lifts up Jacob's head, which he has been FORCIBLY HOLDING UNDER WATER. Jacob coughs and spits out water and looks pissed. Then he smiles and helps submerge Nick's head in the same way. -- Slam! Another bottle of vodka killed. Crush! Another empty Red Bull his the patio. -- A BEAR eats some DORITOS that have been left on a PICNIC TABLE. Yards away in the tub, the guys laugh and taunt it. -- Lou BLEEDS from where the bear has obviously SCRATCHED HIM across the chest. Still, he dances in the tub. -- Just for an instant , the guys are 3 BLACK GUYS and ONE WHITE GUY, before changing back. -- The guys wear their SNOWSUITS in the tub. Adam very dangerously jumps in, attached to a SNOWBOARD. -- The CUTS get QUICKER and QUICKER, as hands reach into the backpack. More vodka. More Dew. More Red Bull. More Bacardi... The cuts SPEED UP and INTENSIFY until finally in a BRILLIANT FLASH OF LIGHT, we  Red Bull or Fresca? Jacob takes the Fresca, as Lou inspects the CLAW MARKS.  Yeah he did.  If by showing him, you mean we laughed and he got bored and wandered off into the woods with your sneakers, then yeah, we got him good.  You just puked.  Let's do it! 30.  Well this place has improved. -- In the lift line, Lou passes a GUY wearing a BIG HEADBAND.  I'm really glad we stayed. It's gonna be good to get away for a couple of days. I mean not like I want to be away from Lily. You know.  I love her. But you guys are right. I'm gonna be with her for the rest of my life.  It gets easier, right? No offense, but watching you talk with Courtney-  Nick? 32.  I feel like we're in Scarface. Only with skiing. Skiface.     Spazzes?  I'm Crockett, obviously! That's the Don Johnson one, right? The dude flips out a SWITCHBLADE.  I've never ridden the horse before.  I don't know what kind of animal I'm riding, but it's the best animal of all time. I feel great! Adam uses his SKI POLES to push off the top of the mountain and he goes FLYING DOWN THE SLOPE.  He zips along, never changing course or slowing. He BARELY MISSES a few TREES. But he can't stop himself before --  What a rush! He notices the girl on the ground and goes to help her up.  Oh wow, are you OK?      Diplomatic immunity. Blaine looks confused, as Adam RIPS Blaine's lift ticket, but he ends up RIPPING BLAINE'S JACKET too.  Sorry, I was trying to... you can probably patch that up. Blaine PULLS Adam close by the collar and clenches his fist.  You look JUST like this girl. I had the biggest crush on her-- Blaine grabs the bag out of Adam's hand and SHOVES ADAM away.  What is going on? Lou strolls up to the guys, with his arms around TWO HOT CHICKS. He looks elated.        We all have plans. It's my fucking wedding!  What the FUCK is going on?! Nick stands up and calmly takes charge.  This happens?  This is a big glitch.  Guys, ignoring the ridiculousness of how we got here for a moment--  How are we supposed to get back? For a moment, everyone sits and absorbs the question. Then:  Wait a minute. Just tell him.  Sir, we... This is ridiculous.  That went well. Lou starts walking off by himself.  Well, maybe one drink. Just to confirm.      We're in 1987.  Seriously, we have to get back.  We seriously have to get back! The guys subdue Adam, as a BIG-HAIRED WAITRESS brings drinks.  I still can't believe it's really her!  I should go talk to her. To apologize, of course. You know, nothing inappropriate.  No, no. No ass kicking. I just wanted to say I'm sorry about earlier. I lost control of the old skis there. Looks like I shoulda taken another one of your classes!  Certainly not when I was a kid! I mean, that would make no sense! Adam tries to recover. 45.  I was here for a convention. Power tools. And regular tools. All sorts of tools. I'm big into tools. It was a couple years ago. Jennie looks very suspect of Adam.     Yeah, he's my brother. She takes Adam's PALM and writes something on it.  We got invited to a party later.  How about figure out how the hell to get back to the present day? Nick walks back to the table and SLAMS down a pile of CASH. 46.  Where did you get that money? Nick points out the Japanese Businessmen.   Fellas, we are not making progress and we're losing time.     Here goes nothing! They simultaneously DOWN their drinks. Nothing happens. Like the chimps in 2001, each of them begins FIDDLING WITH KNOBS and PUSHING ON LIGHTS, trying to find the magic button. After a few moments:  Guys, we're running out of ideas here! 48.  I mean we tried the scientist, the tub -- what the fuck do we do next? Lou DOWNS ANOTHER SHOT and gets a crazy look in his eye.          So do you think we should run away?  If we're still here in four months, I will happily go to jail, because I'll be fucked anyway. A GUY walks out of the bathroom, wearing only a TOWEL. He looks startled.  You have a problem.     So you guys wanna fuck with him or what?  We are not going to the party. 52.  Did we go to the same school? Lou turns and addresses Adam directly.     This sweater makes me look like a jerkof f .        That band's from the 90s.   So, you like these guys?  So I lied to you earlier. I wasn't here for a power tool convention. Jennie instinctively looks around for her friends.  The truth is, Jennie, I've always liked you. But I've never really known you. I really wasn't supposed to meet you again.  I came here from the future. She rolls her eyes - she's heard all the one-liners.  Astronaut pants?  No! No spaceship. No astronaut pants. Just regular time travel. With normal pants.  Oooh, Atlantic Avenue. That's gonna cost you.  I'll tell ya what... Adam moves her token up a few squares and makes a show of looking over his shoulder, as if someone might see.  I'm not supposed to do this. But I'm gonna upgrade you to Marvin Gardens. It's a suite. Plus, there's an excellent buffet and a view of the pool. Jennie laughs, despite herself. She looks around, as if someone might see her. Adam notices. 64.  No one's gonna see you hanging out with the creepy spaz. Don't worry.  Hey, it's cool. I was being creepy and spazzy.  I'm from the future.  What are you doing with a douche like him anyway? You're so much better than that.  So if I lived here, I'd have a shot? For a moment, Jennie is thrown off. She's about to say something, but checks herself. Instead she nervously stands.     Jennie! 66. He looks over and sees Nick SNORING in the other bed.     I didn't necessarily say that.  Oh my god! She kisses him again and they start to go at it. Just then --  Lily?  No, she just-- Adam looks to where Jennie just was, but now the bed is covered with PHOTOS OF JENNIE. There's also a LARGE BOX OF TISSUES and some HAND LOTION.  What's all this? Jennie?  Nothing's wrong with it. It's beautiful. In the next bed, Nick rolls over and wakes up.  Stay out of it, Nick!  No. It wouldn't at all. Lily turns and walks out the door.  Lily, it wouldn't! I love your vagina! I love your vaginaaaaaa!     Who are you talking to? Nick looks at Adam and covers the receiver.  What do you mean \"Courtney?\" Adam picks up ANOTHER PHONE.  Hello?  Get off the phone!! But Nick is down the rabbit hole.  What were you thinking? The DOOR OPENS and Lou strolls in, looking quite fresh.  Has anyone seen Jacob?  Guys! I refuse to accept that we're stuck in 1987! Maybe you're loving it, Lou. But you don't get it. Nick's insane, Jacob's become a bigger douche than before, and I need to get back for my goddamn rehearsal dinner? Which is tomorrow!  Yes.  Maybe we have to learn something?  You know, like Groundhog Day. We have to learn the meaning of life or some shit. Just then, a KITTEN licking a PUDDLE on the base of the tub JUMPS in the hot tub and VANISHES IN A BRIGHT LIGHT! For a moment, everyone is quiet.  It didn't explode. It vanished. It went back... to the present.  Our old present.  OK. You guys know what to do.  This isn't working.  We'll split up. Get as many different cats as you can. Let's all meet back here in an hour.  I got regular cats. I figured maybe the kitten was a fluke. Nick takes the box out of his hands and puts it down.  What am I looking at? It's some kind of stain.  I'm not smelling it.  What is that?  So you're telling me that Red Bull plus hot tub equals time travel?  Who the fuck is Hank Musselman?  How did you even figure this out?  What's wrong with you?  Yes there is! Come on! Adam heads for the door, as Lou and Nick follow.  Why would you do that?! Behind Adam, Nick looks at the group of TEENS and his eyes almost BUG OUT. He elbows Lou.    I thought you were with douche patrol.  Ah.  To get my bag. We get that, we have the Red Bull, and our ticket home.  What race?  You're an idiot.  You live here?  Look. Blaine. I think we got off on the wrong foot. You have some issue with me.  She didn't blow me. She lied to you to make you jealous. I'm not trying to steal Jennie. I just wanna get my bag.  Yeah, I'll just take it and get out of your way. 83.  Whattya say? Can we work this out like gentlemen? Blaine PULLS A KNIFE. Tad and Chaz also PULL KNIVES.  Listen asshole! I want my bag!     Your girlfriend sucks one hell of a mean dick. Adam makes a SLURPING SOUND and Blaine fumes.          Jacob, I'm sorry for not always being the big brother I should've been. I was away at college, Mom gave you my Sega - there were a whole host of issues. Jacob nods and speaks genuinely to Adam too. 86.  Friends? Jacob takes Adam's hand and helps him to his feet.  I didn't think you guys would show.  It's gonna make my victory taste all the more sweeter. Like a Peach Snapple.  You'll see. Blaine actually looks rattled, as the two men get lined up. Adam is on a SNOWBOARD.  You're not afraid of getting beat by a guy on a skateboard, are you? 87.  Reckless and terrible's my middle name. Because I feel the need...  for speed! Chaz holds out his arm as a starting line.  Catch ya at the bottom.  Here goes nothing. Instead of weaving back and forth, Adam just stays in the crouch, PICKING UP SPEED. He recklessly PASSES BLAINE, despite the many TREES and OBSTACLES on the course. He BEARS DOWN AND TRAVELS LIKE A BOLT OF LIGHTNING! Blaine finds the guts to alter his STYLE, skiing more recklessly too. He begins catching up to Adam. Blaine skis up next to Adam - they're both going full force.  I was born in a hospital like a normal baby! Adam bends down and picks up even more speed, NARROWLY MISSING trees and rocks. Blaine tries to keep up. Adam has the finish line in his sights, when he rolls the dice once too often. His SNOWBOARD GETS SNAGGED on a rock and Adam TUMBLES TO THE GROUND. 88. The SNOWBOARD FLIES OFF INTO THE AIR!  Ah, it was nothing. I just fell down the mountain.     Chicken parm? Adam takes the sandwich from Lou. He looks at it closely.     It was our first date. You know those nights that are just perfect? This wasn't one of those nights.  If Lily knew where we were, I'm sure she would've walked home. And I wouldn't have blamed her.  We were so hungry by the time we found that deli, we would've eaten anything. So what if it wasn't foie gras and pino noir. It was chicken parm and Italian soda. And it couldn't have been more perfect.  You could say that. You could also say it gave me horrible diarrhea.        Lily had every opportunity to leave. She didn't know me at all and she certainly didn't owe me anything after the night I put her through. But she stayed.     She saw me at my worst and she stayed. Lily holds the bucket, as Adam pukes into it.  Don't you see? This is more than a sandwich. It represents all that shit. All that puke. 92.  She gave me this as a reminder of her love. Or to give me horrible diarrhea so I didn't leave the room during the bachelor party. But mostly as a reminder of her love. Adam holds up the sandwich.  This is the reason I need to go home. Adam stands up and walks toward the door with the sandwich.  I'm gonna go prep the tub. Lou holds up a BAG OF CHIPS.  Jennie! What are you doing here?  Whoa. 93. Jennie continues talking, shamelessly exposing herself.  Yeah, I... can't. She covers up, embarrassed.  No, I'm not sure there ever was an opportunity. Jennie, you're terrific. You've brought me so many moments of joy, you'll never know. But I shouldn't have given you the wrong idea. Jennie looks sad and vulnerable, as Adam talks.  The truth is there's a girl I need to go see. We have plans to spend the rest of our lives together. And I can't wait any longer.  And I'm totally cool with it. Adam smiles, feeling the rush of knowing he's ready. But then he sees how sad Jennie is. He moves closer to her.  One day, you're going to find the right guy who's willing to give up everything and travel across time and space for your love. She nods and tears up a little bit, as Adam HUGS her.  I know you would.     I don't want Jennie.  Nooooo! 95. Adam runs at Blaine and tackles him to the ground. On the ground, Adam BEATS THE LIVING HELL out of Blaine, messing up his face. It makes the Jared Leto scene from Fight Club look tame. Eventually, Adam's friends pull him off. Adam crawls to the Red Bull can and it's empty.     The Red Bull's gone. He fucked us.  Come on, Lou. 96.  Yeah, no, I get it. Lou goes around and gives them all hugs.  OK, whenever you're ready, Lou.  What happened? Did it work?  Where's Lou?  Lou?  What happened?  Will you fill in some of the blanks for me, please?  Wait, fuck, Lou what time is it?     Why would she have sex with you?  Good to hear.  You went missing and were never found.  Wait a minute, what happened to... you know. Other Lou.  Lou... 101.  What did you do?  Jesus Christ.  I don't wanna hear any more. 102.  I don't wanna hear any more! They sit in horrified silence for a bit.      I'm so happy to see you and I can't wait to spend the rest of my life with you.  You're the one. Lily notices Adam's on CRUTCHES.  Ahh! 105.  What does that mean for us?  Oh. Great! Jacob CLICKS OFF and disappears, as Lily approaches. Adam can't help but beam from ear to ear.  You're so beautiful.  Come on, let's get out of here. We have unfinished business. Lily smiles. She gets into it.     OK, you're a nurse and a snake bit my penis.",
        "Chaz": "Dude, they let you bring a skateboard on the mountain?  Whatever it is, it works.     Hey man, no hard feelings, all right? If your bro says you're cool, then we're cool. Tad puts his arm around Jacob and leads him into the party.  Don't tell me. Prague. Do you want some coke?  You really are a gas, Jacob. Tad and I think you're the cat's pajamas.  Rohypnol. Geoffrey's father is a pharmacist, but we don't hold that against him.  Roofies... I like that!",
        "Blaine": "I'm gonna serve you a knuckle sandwich, airhead. You all right, babe?  Your lift ticket's been revoked. Blaine throws it on the ground and laughs to his friends.  You're dead meat, scumbag. Just then, SNOW POWDER flies in Blaine's face. Blaine lets go of Adam, as Jacob snowboards up and stops short, coming to his brother's side.  Guys!     This is mine now. Adam looks at Blaine angrily, but Jacob holds him back.  I thought I told you to stay off my mountain, partner!  You talking to my girl? Huh? I can't hear you. Adam fights to breathe, as Blaine chokes him harder. 61.  Can't breathe? Is that right? Can you breathe, partner? What's that? I can't hear you. Just tell me you can't breathe and I'll stop. Adam still struggles. Blaine just shrugs.  He's not saying anything. I guess he can breathe. Jennie pulls on Blaine's arm, trying to free Adam.  Babe, stop. Jennie, stop! Blaine turns and accidentally ELBOWS JENNIE in the face. She goes down. He releases Adam and turns to help her.  Baby, I'm sorry.  See what you made me do?!  Welcome to my lair.  I don't live here. Adam approaches Blaine, trying to speak maturely.  You get blown by my girl? I'll say that's one hell of an issue.  Oh, your bag. I was wondering when you'd come around for that. Tad holds up the BACKPACK over by the crates.  You will? Adam EXTENDS HIS HAND.                Safe's on a timer. It'll open tomorrow. We race at dawn. Winner gets the bag. Loser leaves town. Lou turns to Nick.  Then I guess you don't want your bag. See you at dawn.  This was my idea.  A what?  What's that?  I've seen you in action. You're reckless and terrible.  You can't beat me! I was born on this mountain!  You looking for this? Across the patio, a drunk, disheveled Blaine holds the CAN.  You couldn't leave well enough alone, could ya? You couldn't just win the race and call it a day? You had to have Jennie too.  That's funny. I don't want this soda, either. Blaine smiles like an asshole. Adam's face goes desperate, as Blaine OPENS THE CAN and DRINKS THE WHOLE THING.",
        "Kelly": "",
        "Jacob": "You look dirty and you smell bad.  How is that to your advantage? 13.  Metrosexual.  For your information, I fuck chicks. Hot ones.  Yeah, well at least I'm young and my life's full of potential. I hear you're homeless now?  Yeah, about that. Why aren't we going to Aspen? Vermont's lame.  Yeah, whatever. And with that, the guys travel in silence for a few moments, the lifeblood drained from the car. Finally...  And you're OK with that? I don't know your sexual history, but you sure you got it out of your system?  So you're averaging like one girl every eight years.  Just looking out for you. That's what brothers do, right? They look out for each other?  Forget it.  I said forget it. 16.  I still say Vermont sucks.  so this is the coolest town ever?  What?     Captain America.  Or a continuation of everything that's sucked so far.  I say we go to Foxwoods.  What the hell is with this place? 21.  What's the big deal about a hot tub?   When's the last time you guys actually went skiing?  Then you're an idiot.  You gonna be all right?  I dunno - do black dudes ski?  I'm just not sure you're representative.  I don't even know what that means.    To my brother, I say thank you for including me. I promise to try to make the most of it. The guys look confused at the backhanded graciousness.  Totally agree.  I'm totally blaming him. I didn't even want to go skiing. 26.  Guys, I'm still hungry.  I really don't see the appeal. It's like a glorified bath.  Fuck it. Jacob strips down and gets in. As he submerges, he actually starts to loosen up a bit and smiles.  I'm not convinced this is anything more than a bath, but it's nice.  I need a vitamin water. Adam reaches in his backpack, taking out two choices.  What is this, a shitty car club? The guys COMPLETELY MISS the BILLBOARDS ACROSS THE STREET: -- \"Coming soon: the most spaced-out Mel Brooks film yet!  There you are! My brother's had a few too many triple Venti nonfat lattes if you know what I mean.  Are you OK? Adam nods. Blaine looks confused. CHAZ and TAD look enamored with Jacob.  It's a snowboard. You know - no wheels.  Thank you. It's mostly North Face. A little EMS.  Come on. Let's just go. Jacob ushers Adam off the slope, as Blaine shoulders the bag. 37.  Has anyone else noticed that things around here are weird as shit? Adam and Nick nod. Lou shakes his head. 38.  I have no idea, but look... Jacob turns up the VOLUME on the TV. The NEWS airs.  What are we gonna do? I have plans next weekend.  Yeah, you're an idiot. Black holes are in space. Not at a ski resort.  No, we traveled through time. We're not invisible. Lou looks upset.  We're from the future.  Should we warn him?  You can stop saying that. I don't think it's making a difference. 43.   Can you give us a second? She walks away, as Jacob turns to the guys.  This is gonna be a problem. He takes out his wallet, showing his CREDIT CARDS and CASH.  Guys, we're in trouble. Our cards aren't gonna work and our new money looks fake. The guys look concerned, but then Nick notices something:  How'd it go? He shows them his palm.  That was NOT a good idea!  That's not what I--  Uh, yeah it is. Lest we forget the lessons learned from Bill and Ted.  That's not fair. You can't go right to Back to the Future.  Back to the Future had a time machine.  Hey Lou?     It's 8:45. The other guys look at their watches, surprised.  Because you're old and lame?     Do you have Coke Zero?  He did a bunch of drugs and went on a rant about how much he resents Ace of Base.  I know. He made me borrow Tad's video camera. He wants to document the performance and sue the band for infringement when we get back. Adam sees Tad and Chaz behaving like cocks across the room, making hot girls drink too much. 56.  They're rich, popular, and they shower me with compliments. They're pretty much the best friends I've ever had.     Oh wow, all right. Let me think. I've never told anyone this, but I was afraid of scary movies until I was 18. I even ran out of the theater a couple of times.  That's the gay ear, you know. As Adam looks STRAIGHT AHEAD -- He sees Jennie all by herself, browsing the hosts' CASSETTE TAPE COLLECTION. Adam takes a moment to check himself. Then he reaches for his DRINK and GULPS THE WHOLE THING, before getting up and WALKING OVER to her, catching her off guard.  I'm not gonna have sex with her. She killed a guy!  Great, so she's a prostitute. I'm not sleeping with a hooker either.  She probably has a hairy vagina.  I'm not having this conversation. It's pointless. I don't have a condom. 63.  Like a fucking madman? He slaps Jacob's arms.  Stop talking to me! Despite the fact that this looks like very good sex -- it is very bad sex for Jacob.  Thanks. I like you guys, too. A THIRD DOUCHEBAG arrives and gives a SECRET HANDSHAKE to Tad and Chaz. He drops off a PILL BOTTLE. This is GEOFFREY .  What is it?  Rohypnol?     These are roofies!  Hey guys!  Yeah I was. But it turned out those guys are date rapists.  You guys are posers! You're not better than me!  Just stick to the plan and you're gonna be fine. Adam looks at Jacob seriously for a moment.  I know. I'm sorry too. I put a few things before my family and took my guilt out on you.  I guess it was an inevitable I'd end up part of a roofie ring. Adam smiles and extends his hand.  Brothers. They EMBRACE. Lou looks disgusted.  Adam, what is it?  This is disgusting.  And we can do whatever we want without any real consequences. That's a lot to give up.  Where's the Red Bull?  Not necessarily. Everyone looks toward Jacob.  The Red Bull isn't really gone.  It's in him. A beat, as everyone sorta gets it.   I hate you a little less also. Lou LIFTS BLAINE'S LIMP BODY. 97.     We're back? It all looks the same.  Told you.  This is why we shouldn't have sold that iPod. Adam puts his hand through Jacob, who speaks with purpose.  The Japanese have apparently cornered the technology sector over the past 20 years. We've dealt American businesses quite an irreparable blow.  Pretty much nothing for us personally. We just get cooler phones and iPods and shit.",
        "April": "",
        "Nick": "I'm more than willing to forget about earlier, but this shit's going on Facebook.     I have no idea what Facebook is. My phone has a button that says Send To Facebook. I've been sending shit there for months. Adam looks out the window, smiling.  Ditto, buddy. I'm gonna help you make up for all the good times you missed when you were being a responsible member of society.  This trip represents everything awesome about being a dude. 9.  We're gonna drink too much, eat whatever we want... I might not even change my socks.  Best of all, we don't have to answer to anyone. Nick's PHONE rings and he answers it with his built-in BLUETOOTH. His phone voice is a little more \"sensitive.\"  Hi honey.   I'm with Adam, honey.  You said not to do it.  I bought three bags of pretzels. But I'm gonna eat them...    The whole damn chain. Just be thankful Lily doesn't have any family money. Nothing makes your dick softer.     So you're sorta like a bum now, huh?     Why would I take offense to that?  Because he's black?  Not really.  So... what? Your wife likes black dick now?     I don't wanna hear about it.  Yeah, isn't Lily your fourth?  Guys, come on. Let's move past it. This is gonna be a fun weekend.  That's the biggest mistake of your life?     Gentlemen... welcome to Havenhurst.     What the fuck is going on? The car climbs a twisty part of the road.  Please god let it still be there...  Yes! It lives! The car continues to climb and the whole sign comes into view: \"Pinkberry.\"  OK so the place skews a little older. Let's check in. We're not spending our time inside anyway.    Gentlemen... in this room lies the beginning of our awesome weekend.  We'll feel a lot better once we hit the slopes. Plus, I know there's one thing to look forward to.  There's plenty of time for tubbin'. Let's ski.  I think we look good. 22.  All right, we race down the mountain. Loser buys first round. Premium shit only.  What does that mean?  Of course black dudes ski. Aren't I wearing skis?  You're calling me an Uncle Tom?  It means black dudes ski.  Catch ya at the bottom. Nick takes off and... gets about 15 FEET, before he hits a GRASSY PATCH and falls over.    No, the black ones... without the pleats... Because the pleats make me look fat... No, I put it on the Amex... Because I'm the best man... I know, but I'm organizing... I'm gonna get cash fr-- I'm gonna get-- I'm gonna collect cash from the guys... Yes... Yes... Yes. I love you too. Nick hangs up and we see that Adam, Lou, and Jacob have been walking with him, listening to his end of the conversation.     Thank you. The waiter walks away and Nick RAISES HIS GLASS in a toast.  I'd like to propose a toast. To my best friend, Adam. He may be throwing his life away, but at least he's throwing it away with a hot chick at his side. The guys LAUGH and clink glasses.  And so what if you only have one vagina for the rest of your life. Speaking as someone who's seen your wife's vagina -- it's definitely one of the good ones. Lou and Jacob look confused, but clink glasses anyway, as Adam mouths \"What the fuck\" to Nick. Jacob raises his glass.  To Adam!  Come on, man. It's our friend's bachelor party. We're just trying to roast him a little bit.  Thank you.  OK I'll admit this trip is not off to the best start. But we're due for a victory! Nick thinks and actually gets an idea. He SNAPS his fingers.  Hot tub! A lightbulb goes off for Adam too.  Jacob. Son. The hot tub is the whole thing! You ski all day. Then you hit the town, get trashed, and lure some fine ladies back to the lodge for some good old fashioned tubbin'. Nick CRACKS A BEER and pats Jacob on the back.  So the town's dead? Fine, we skip that part and go right to the tub. Trust me. If there's fun to be had, the tub is a good start. Nick gets in.  Yes! It's amazing. Now it's just Jacob outside the hot tub. The other three guys are already starting to look more energized and happy, splashing around. After another beat of consideration...  Hit him with some bubbles.  Oh my god, I wanna die.  Guys, look... Their gaze turns to the MOUNTAIN PEAK, on which is a fresh LAYER OF POWDER. It looks like perfect skiing conditions.  Believe me I know.     You're gonna be fine. You'll settle in, get the premium cable package - the usual deal. Adam nods.  You'll wake up every morning, comforted by the fact that your wife doesn't wield her family's wealth over your head like a hangman's noose. Adam looks concerned, as Nick wistfully goes on...  You'll breathe the air of life, making the occasional decision - maybe get some lawn furniture. How about steak for dinner? Yes, let's get that juice machine I saw on TV. Let's fucking go for it. Nick stares off into the distance.  Sorry, I lost myself there.  That is a lot of cocaine.  I'm gonna pass.  We're not spazzes. The dude extends the coke once more.  Adam, you gotta chill. You just did one line.  You're not riding the horse. The horse is heroin. Adam can't stop moving and fidgeting.  Adam! Jesus.  I'm ruined!  Now hold on, we don't know for sure that we're in 1987. The TV shows a  COMMERCIAL for the COMMODORE 64 computer, with a JINGLE that SINGS: \"Are you keeping up with the Commodore, 'cause the Commodore's keeping up with you...\" 39. When it's over...  OK, we're in 1987. Adam stands up, completely losing it.  Everyone relax. I think I know what's happened. And when we're done discussing it, we're all gonna feel a lot better. Everyone looks to Nick, who seems to have the answer.  Two words: black hole. He lets it hang in the air for a moment, as if it's suddenly going to gel for everyone. But the guys look confused.  I saw a special on the Science Channel. And guess what? Sometimes this happens.  Yes. And the best thing for us to do is to stay put. The universe will eventually reverse itself and work out this little glitch. Nick sits down, looking satisfied in his know-it-all-ness.  Black hole.  We're waiting for a scientist.  OK. You tell him, Adam.     Holy shit. It's that bellhop.  God bless our country.  Hey, if it's available, I'm ordering it. I always wanted one of these when I was little. The waitress puts down the CHECK. Jacob picks it up, realizing something.  I've got an idea. As Nick gets up and approaches the businessmen, Adam looks around the room and by the bar, he spots -- 44. Jennie. He stares at her from across the room. Lou and Jacob notice.  Bam!  Close. It's a thousand bucks.     Adam, don't worry. Time's not moving forward in the future.  Well then I give you Back to the Future.  Why not? 47.  Well so did Bill and Ted.  Adam, all we did is get drunk in the hot tub. Everyone's EYES GO WIDE.  Well, it was worth a shot. ANGLE WIDENS to reveal other PEOPLE in the tub. A GUY AND GIRL make out, two STONERS pass a joint, and one TOPLESS CHICK just chills out.  Jesus Christ, what the hell, Lou?!  This is probably his room! We're not registered here in 87. Lou thinks for a moment and looks a \"little\" sorry.  Let's just go to sleep. We'll figure everything out in the morning. It's pretty late. Jacob checks his watch, rolling his eyes.  Why am I so wiped out?  Was this like an 80s thing?  These will be ready in 15 minutes.  Mmm hmm. You get drunk while you enjoy a delicious gelatin snack.  Don't know. I just invented it. Party chick looks into his eyes, dreamily.   I love you.  Nick! Nick! Nick! He finishes the last of the beer, and the crowd celebrates.  I should.  It's a beautiful vagina. Among the prettiest I've ever seen.  I just really need to get a few things off my chest. You're domineering and you think you have all the answers, but you don't. Not by a long shot. Nick is getting emotional.  You think you're better than me? Last night I made jello shots and everybody loved me. 68.  They didn't care that I only brought home 60k last year. They loved me for me. They didn't go throwing their rich parents' weight around.  I don't know, Courtney.  It's so good to hear your voice. I love you, princess. I really do. You just make it so hard on me sometimes.  You're right. It's OK. I just want it to be OK. Adam starts registering some of this conversation.  Courtney.  Baby, I gotta go. Just think about what I said. We're so great together. It's like when we're having sex - the way our bodies become one, as we both embrace the passion of the moment-- On the other end, COURTNEY'S DAD has picked up the phone.  OK, so that may have been bad.  Oh, we're going to jail.  What do you mean?  I saw it too. The guys run over to the tub. The bubbles are on low, but there's NOTHING IN IT.  So it is the tub! Lou POINTS at something. 72.  Oh, sorry man. Hey! How's that iPod working out for you?  If you like that, I've got a phone back at the lodge that will knock your socks off.  Oh yeah? More important than Bluetooth?     You're gonna franchise out the Gelman's Mom and Pop!  Walk with me a minute. Let me tell you about some companies you should really be looking into...  Come here. He leads Adam near the tub, where Lou points at something.  Red Bull.  There was just enough Red Bull for the kitten. Not nearly enough for a human. It's a weight distribution thing.  He bet me 20 dollars I wouldn't lick the stain.  Yeah, except one little problem. There's no Red Bull in 1987. For a moment, they're all bummed again. Then Adam gets an encouraged look on his face.   Look. Lou looks to where Nick is looking: YOUNG ADAM, YOUNG NICK, and YOUNG LOU wait with other kids for Jennie to return to their lesson.     Adam, where are we going? Adam gets a look of determination again.  Yeah, this is kind of a shitty place to live.  What is this town's obsession with knives?  What are we gonna do?  You did it, man.  It was a beautiful fall. Lou goes into Adam's backpack and pulls out the SANDWICH, which he begins unwrapping.  That sandwich was special, huh?  We don't have to go yet, Adam. Things are just getting fun.  I'm sorry man. I'm really sorry.  It's worth a shot.  What are you talking about?  Makes perfect sense, man. Lou squeezes Jacob's shoulder.  OK, well maybe if we-- A BRIGHT FLASH CONSUMES THE SCREEN! And when it dies down, we see Adam, Nick, Jacob  in the hot tub where we left them. Only Lou is missing.  I didn't feel anything.  Dammit. Even the deck furniture's the same. We fucking blew it. It didn't work.  Ahhh! 98.  Lou, I gotta ask you something.  Exactly. Aren't there now two of you living here in 2010?  No way...    What did you do?  How could you?  This makes no sense at all.  I was thinking we'd invite Adam and Lily over for dinner when they get back from their honeymoon. That's... if it's OK with you?  So... how are your parents?",
        "Repairman": "",
        "Lou": "Yes, I'm living in a transient motel. Let's get that purple elephant out of the room.  Thank you. I hate your guts.  All my belongings.  In a sense.  Our system is fucked, gentlemen. You tell me how a whore wife can fuck some black dude - no offense - and still take her cuckold of a husband for all he's got.  It's offensive.  And because he's fucking my wife. And because you're black. And because of all the oversensitive horrible garbage... you know what? Forget no offense. Just offense. Are you offended?  Then shut the fuck up.  Yes and thank you so very much for giving her the referral. 12.  I'm gonna slaughter you in your sleep tonight.  Oh, Adam's stupid brother's coming? Boo! Drive away before he gets in the car!     You look gay and you smell like a basket of fancy soaps. Advantage me.  You have sex with trains?  For your information, you fuck dudes. Gay ones.   You told him?! I hate all you people.  I've gotta take a shit. 14.  That was an ugly experience.  In a few years, when I'm dying of an exotic disease that causes my penis to bleed until it falls off, someone remember to tell the hospital to check out the filthy crapper at the Albany Rest Stop. It's the AIDS monkey of toilets. The guys put down their sandwiches.  I don't know how you're doing it, man. I mean, Laurie's hot, don't get me wrong.  Right. Lily. But one vagina? Forever?  He didn't do that well for himself. 15.  That would be awesome. Adam gives Lou a distasteful look.  Boooooring!  You're confusing Vermont with yourself. This weekend is going to be incredible and you will not ruin it for me.  Fuck yeah it is! We're gonna ski the trail and bone some tail!  Fuck that. You'll bone your own.  Adam, trust me. Biggest mistake of my life - not fucking a whore at my bachelor party.  Fuck yeah. And he's not making that same mistake.  Ohhhh. I gotcha. You're not having sex this weekend.      I don't even have the heart to tell you what I just fucking saw. But say goodbye to Papa Enzo's. This town sucks.  I wanna die.     This guy's a dick.  No, fuck that. He's a dick. Oooh tough guy. He's gotta be Mister America.  Go fuck yourself. Phil finally drops their bags at their room and then:     Yeah, I bet it's gonna be lame as shit in there. The furniture probably smells like mold.  I actually kinda like that idea.  It's like a Stephen King novel, except not as cool.  Thank. God.  Black dudes don't ski.    This kung pau chicken pairs very nicely with the 97 cab. Very impressive choice, Nick.  Also, this is the worst bachelor party I've ever been to. Everyone puts down their forks, cathartically fed up.  I'm blaming him.  Why did we even bother with dinner? Adam and Nick get up too.  Quiet, men are talking. Aiden approaches.  I would like you to die. And then I would like you to leave. Aiden walks away, freaked out. Lou turns back to the guys.  It's tub time.  Oh my god. The water is perfect. 27. He POURS A VODKA and SLAMS IT BACK. Adam climbs in with Lou, pouring his own drink.  Well?  That fucking bear got me good.  But we showed him, didn't we?  Fuck yeah. Lou picks up Adam's half-eaten sandwich and takes a BITE.  That's why I'm eating your sandwich. I'm fucking starving.  Really, asshole?  Guys! I'm so glad you're here. I want to introduce you to Michelle and Sandy. These lovely ladies are having a roller skating party next weekend and no offense, but fuck your wedding -- I'm totally coming back. By the way... Lou rolls out a ZIPLOCK BAG full of cocaine.  There's coke everywhere around here. This place rules! Lou dips into the coke and rubs it on his gums and we:  Don't you ruin this. If you wake me from this dream, I'll kill you.   We're in 1971.           I'm still gonna do it.  We find a scientist.  This Dukakis guy seems like he might be the real deal. An affable MAN IN A SUIT approaches.  Where's your white coat?  This is bullshit! I told you--  Five o'clock. Happy hour. The guys look at him, confused.  If it's '87, the PF Chang's will be gone, which means the Brew Haus still stands. It's Saturday. They have wet T- shirt contests on Saturdays. 42. The guys' eyebrows raise. After a moment:  Fuck that guy. ON THE STAGE, TWO GIRLS compete for wettest t-shirt. They both decide that NO T-SHIRT is the wettest option.  She's aged remarkably well. Oh, right. Why don't you just go talk to her?  Sure... Adam GETS UP. He slowly makes his way over across the room. Jennie is talking to TWO OTHER GIRLS as Adam approaches. He lurks near them like a creep. Jennie eventually notices him, as he keeps stealing glances. She doesn't look happy.  sweet! What are we gonna do until then?  We're millionaires!  I agree. You left so much money on the table. It's a fucking iPod! You could've gotten a LOT more!   A hot tub time machine.   I love this place. As Lou pours himself another, Adam starts to lose it again.  I know what we do next.  Rental car agency fucked us! There's no flux capacitor. Lou pulls Jacob over and straps him in the driver's seat, before walking around to the passenger side.   We'll travel to 2010. Then one of us will come back and get one of you. And so on and so forth.  Go light on the clutch. I don't wanna lose our deposit. Jacob starts the car.  Oh shit, they found me! I don't know how but they found me! I always wanted to say that. Punch it! Jacob HITS THE GAS.  Let's see the look on this pig's face when we hit 88 and disappear into thin air! Yeah! The SPEEDOMETER hits 75, 80, 85, and then 90. And then 95. The car SHAKES VIOLENTLY.     Yeah?     I wonder if we'll still be here for our court appearance.  I have no tolerance for intruders.  I'm still pretty OK with it.  Just help me put him outside. 51.  Yeah, fuck that, we're going to that party!  Hear me out. Lou paces around the room like Patton addressing the troops.  We saw the scientist. He was worthless. We tried the tub. Dead end. I got us a fucking time machine. From Hertz. It might as well have been a Nissan. Adam shakes his head, as Lou continues.  Gentlemen, it's fucking 1987. Nixon's in the White House, gas is free, and we're about to put a man on the moon!  The point is you haven't even met your wife yet! She can't fault you ago! Even if 23 years ago somehow ends up being tonight! Adam starts listening a little more closely, as some of Lou's logic actually makes \"some\" sense.  It's time to start facing the fact that we may not be going home. And if that's so, then we owe it to ourselves to make the best life we can for ourselves. The guys listen intently, as Lou's speech reaches a passionate climax.  Because I don't want to be that college freshman who spends the first semester hiding in his dorm room, only to realize that come spring, he has no friends. No! 53.  I want to be that college freshman who fucks chicks way out of his league before they have an opportunity to realize he's not as cool as he's pretending to be! Nick nods. Even Jacob smiles.  Are you with me?  Close enough. We'll talk some more at the party.     If he doesn't lose that arm soon, I'm gonna take it from him myself. With that, Lou wanders off toward another room, leering at and groping girls as he goes. 54.  Dare. 57. Sandy and Jacob confer, figuring out the dare. Lou meets Jacob's eyes -- he smiles, knowing Jacob has his back.  You son of a bitch! Have you ever played this game before? It's supposed to be awesome! Lou nevertheless grabs a TWIZZLER from the snack bowl and shoves it down the back of his pants. His face contorts uncomfortably and he is almost on the verge of tears.  This is a horrible thing you're doing and I hope you never have to experience what I am currently going through. Lou sits down and Michelle consoles him.   I don't care. Whatever. This is not the point of the game.     Fuck you, your turn.  Sandy, I don't know what you did with this wine, but it is delightful.  Mmm. Fantastic. Do you mind if I borrow my friend? We'll only be a moment.  You're gonna fuck her!  That guy was undesirable. You heard her. It was about the money.  She's not a hooker. She's a girl who did what she had to do to make a few bucks.  Listen, she's probably awesome in bed.  Exactly! Jacob looks confused.  Perfect! Me neither! No one here uses condoms. It's like heaven. Only with a lot more coke. Lou takes his COKE out of his pocket and SNORTS a bunch.  How do I look?  Rock and roll. Lou exits the bathroom and calls out to the girls.  Who's ready to get laid by an awesome penis?!  Tab?  Guess who re-popped his 80s cherry? This guy! He points at himself in a celebratory manner, as behind him -- The Towel Guy whose room this is comes RUNNING UP.  Help me put him in the closet. 70.  He's grabbing drinks with Tad and Chaz. Which is what we should do. We'll start at the Brew Haus and do a three drink crawl up the street-- Adam gets more fed up than ever.     I get it, man. Life is about these moments. Moments where a regular Joe becomes a hero. Moments where you dig deep and find the motivation... the courage... the guts to do what's right and what's necessary. It's moments like these... Lou suddenly notices some COCAINE on the edge of the tub. 71.  Jesus, how come nobody told me there was coke out here? Lou SNORTS A BIG LINE.  What was I saying? Adam and Nick get out and towel off. Lou follows.     This is the present.  Um... The HOT TUB IS NOT PLUGGED IN, and yet it's clearly running.  Maybe these aren't the right kittens? Adam points at him in a \"now you're thinking\" way.  You can count on me!  Hate to tell ya, pal. Browns are gonna lose by 3 in overtime. 73.  Not only that, but I bet you Elway's gonna throw a touchdown with 37 seconds left.  Care to make it interesting?  Name's Musselman. Hank Musselman. I've got a cool name, huh?  I win -- your wife gives me a blowjob. A classy one. For the first time, Candace looks less than bored. She does a bad job of feigning disinterest.  You win -- you can kill me. Any way you want. Knife, gun, torch, sword... I'll even make a video exonerating you.  I'm serious. You look like a man who has everything. Except the license to kill. Care to gamble? Rick looks at Lou long and hard. Lou doesn't flinch. 74.  Exactly.      There!  Smell it.        Scientific method.  I thought it was some guy's jizz.  It worked, didn't it?  Holy shit! Lou immediately approaches the kids, even as Nick tries to hold him back.  What the hell do you want, old man? Lou PUNCHES his YOUNGER SELF in the face. Young Nick and Young Adam are freaked out, as is regular Nick. Adam doesn't notice, as he's arguing with Jennie.  What the fuck, dude?! I think you broke my nose! My parents are gonna sue the shit out of you!  Herschel and Evelyn aren't gonna do a damn thing. They're losers.  How do you know my parents? 80.  Listen to me. Start putting minoxidil on your scalp. Tonight. Then, when Propecia comes on the market, start taking it. Every day. Hair is important.  I don't give a shit about hair.  You will!  Or I'll tell everyone about how you jerked off to that issue of Playgirl.     Hey, you don't have to justify to me, pal.     I'm God.  Moment of truth. Lou takes off his hat and feels his scalp - no hair. 81.     Oh, that's just great. Jacob runs up, in a friendlier disposition.  Yes! The race is on!  Duh, it's 1987? We're at a ski resort? Disputes like these are settled with a downhill ski race. Usually at dawn. It's the law. 82.  Whoa! You got blown?!  See? I told you!  That chick blew you?!  Gay. Blaine and his goons approach from below. Adam puts on his game face.  Yes!  Chicken parm. It's my favorite.  Keep the sandwich.  Do you have any stories about these chips or can I eat them?  Holy shit! You may have killed this guy! No wait... wait... I've got a pulse. Eh, so much for that. Nick puts his hand on Adam's shoulder.  Nah, I'll take a rain check.  Listen, your lives at home sound all beautiful and happy with your barbecues and swimming pools and \"oh, that sandwich reminds of some gay shit I did one time.\" Adam and Nick don't look thrilled to be reduced to this.  But my life back there sucks. And in case you haven't noticed, my life here fucking rules. So I have a coke problem? I'll go to rehab. I have no money? I'll stop winning sex and start winning dollars. Lou DRAGS BLAINE by the foot closer to the tub.  Guys, I was tailor-made for 1987. And you'll excuse me, but I value banging young chicks way more than all of your friendships combined. No offense. Adam, Nick, and Jacob kinda nod and understand.  I don't hate you as much as I used to.  One small step for man! One giant asshole puking in a hot tub! Here goes nothing! Lou does the HEIMLICH MANEUVER on Blaine. It takes ONE... TWO... THREE THRUSTS until Blaine PUKES IN THE TUB! For a second, it's just a BIG SPLASH of VOMIT and nothing else.  Right on schedule! SURGERY  that makes him look at once older and younger.  Oh, the face, eh? I was curious how you'd react. Didn't think you'd be scared.  You're damn right it's me.  You just traveled 23 years in three seconds. Took me 23 years. It's good to see you guys!  It better! You know how much I pay the groundspeople around here? A lot. But that's all right, I'm fucking loaded. Look at all this. Everyone looks confused.  I'll give you the short version, because time is of the essence. First of all, to settle an old bet, time most definitely has been moving forward. It is exactly three days since you've arrived here in beautiful Havenhurst. Jacob looks at Nick.  Secondly, I'm filthy rich. Made sports bets. Sued Ace of Base. I own most of V ermont. 99.  I've been reimagining the state as my own personal playground. You could say I'm a little bit like Michael Jackson, except I don't fuck kids. Two YOUNG HOTTIES walk by and wave at Lou.  I do fuck them, though. Haven't gone above 24 years old in 10 years and even then, it was a mistake. A horrible mistake.  Way ahead of you, Adam. You have 2 hours to get to New Jersey in time for your rehearsal dinner.  Not even a little bit. I have a helicopter waiting in the parking lot and a private jet on my airfield five minutes away. The guys look stunned.  I had some time to plan. God, it's good to have you guys back!  By the way, Adam, I hope you don't mind. Right after you left, I fucked Jennie silly. 100.  You get the big time assist. All that talk of her finding the right guy who's willing to give up everything? Made her wetter than a log flume. She's all-time top five.  Time travel paradox.  Think really hard about that one. What happened to me when I was 19? Nick shrugs. He looks at Adam. Suddenly, both their eyes nearly pop out of their skulls.  Yeah, you're gonna have some lingering memories of both versions.  You don't wanna know.  The kid sucked, OK? He couldn't take even a little bit of direction. Pretty soon I realized that having two versions of the same dude walking around -- as cool as that sounds -- didn't make very much sense to me.  So I took care of the problem.  I had to do it.  I killed myself.  Yeah, it was really some existential shit. I mean, here I am committing homicide and I'm actually committing suicide.  It was easy actually. For a minute, I thought I might be dealing with that whole Timecop thing. You know, the same matter can't occupy the same space at the same time bullshit and we both go poof? Especially after that whole nose thing. But no, it was just a murder. I didn't suffer.  It was strangulation.  You'll have to introduce me when we get there. Your families won't know me. Although I'm sure they're huge fans. So hey, getting married, huh? Taking the plunge! Adam looks disturbed. Nick looks confused.  My fault entirely, madam! The room is ABUZZ with CHATTER, as Lou makes a nearly REGAL ENTRANCE, wearing a WHITE TUXEDO.  I was partaking in a little ski adventure and I mistakenly wandered into your fiance's path. His broken leg is my broken heart. My most humble apologies. Lou scrapes and bows and regally kisses Lily's hand. She looks genuinely flattered. Lou gets up and whispers to Adam.  See? I'm awesome here. You shoulda stayed out of that tub.  So you're friends with the bride?  Naughty girl. You're secret's safe with me.  I'm from here. Maybe I know him.  No, never heard of him. He goes back to MAKING OUT WITH HER and we:",
        "Phil": "I'm ready to be tipped. 20.  Ahhhh! My arm!!!",
        "Jenny": ""
    },
    "imdb_rating": "6.4",
    "description": "Three friends on losing streaks: Adam, whose girlfriend dumped him, Nick, with a dead-end job and a cheating wife, and Lou, a suicidal alcoholic. To help Lou recover from car-exhaust poisoning, Adam and Nick, with Adam's nephew Jacob, go to a winter resort that was their old party place. It's now a dump, but the lads rally for a night of drinking in the hot tub. Somehow, the hot tub takes them back to 1986, on a fateful night for each of them. Maybe if they do everything the same way they did that night, they'll get back to the future so Jacob can be born. There are serious temptations to do things differently. Will they make it back to their sorry lives? And what about Jacob?<jhailey@hotmail.com>",
    "name": "Hot Tub Time Machine",
    "genres": [
        "Comedy",
        "Sci-Fi"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTQwMjExODA4Ml5BMl5BanBnXkFtZTcwNTYwMDYxMw@@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}