{
    "filename": "Hotel-Rwanda_script.txt",
    "imdb_id": "tt0395169",
    "imdb_url": "https://www.imdb.com/title/tt0395169",
    "characters": [
        "Jean Jacques",
        "Gregoire",
        "Thomas Mirama",
        "Receptionist",
        "Odette",
        "Paul Rusesabagina",
        "Colonel Oliver",
        "Dube",
        "Tatiana Rusesabagina",
        "Fedens",
        "Head Chef (as Kid Sithole)",
        "Policeman",
        "General Bizimungu",
        "Old Guard",
        "George Rutaganda"
    ],
    "dialogues": {
        "Jean": "Our house has been burned.  It is true.  You can't go to that place, they know what you are doing here.  It is good that you are going, Paul, because now we know we have one person who will save us.",
        "Jacques": "",
        "Gregoire": "Come on, Zozo, cockroaches can jump, some of them can fly.  I'm sorry, ma'am, but I see only two here in the computer.  There are no more rooms.    What do you want?  I don't have to listen to you anymore.  Let me ask you Mr. Manager, do you notice a smell of cockroaches? If I were to leave this room, I'm sure I could find this smell. I know people who could cleanse it. But maybe it doesn't bother you? Why is that? Are used to this smell? Not me, I need a clean room to escape it.  Please, except my humblest apologies...  Where are we going, sir?  The fog is too heavy, sir.  We should go back, sir.  I saw the sign.  That's him. That's Rusesabagina!",
        "Thomas": "I've heard bad things, Paul. My assistant says we should get out of Rwanda.  What good is it if we are murdered in our bed?  Yes, and he is in the Hutu Power Militia.  No, he is a friend, but he tells me to listen to the radio. All day they talk about the great slaughter.  Forgive us, Paul. We must talk.  We are leaving Rwanda, Paul.  My assistant, the Hutu Power man, says we should get out now, that soon it will be very bad.  His name is Naramaranga, but please, Paul, even though he is Hutu Power, he is a friend, he likes me. He told me there is a signal. It is \"Cut the tall trees.\" When they hear the signal, the militia are to go to war.  Please, Paul, tomorrow I will bring you my car. You will sell it for me and get a fair price. We will go to Tanzania until there is real peace.",
        "Mirama": "",
        "Receptionist": "Oh, sir, please can you...",
        "Odette": "Good to see you, Paul.  I must go, Paul.  No thank you, Tatiana.  The radio says Tutsi rebels.  Forgive me, Paul. Danielle says that Roger has gone.  Get his clothes off.  He's not injured.  Nothing.  Thank you, thank you, Paul.  Yes, that's right. I helped set up the treatment center in Nairobi. I'm in the Mille Collines Hotel right now with my husband, Peter, and my two boys. If you do not help us we will be murdered.  That is not true.  What if he is not there?  We owe you our lives.  The Americans are talking about us.  Was anyone hurt?  Will the Hutu army agree?",
        "Paul": "Thank you. He can get the beer.  What's wrong?  You are with me, Zozo, don't worry.  It depends where you sit Zozo. In coach it is like the bus to Giterama.  Maybe. But in business class there are fine wines, linens, Belgian chocolates.  Many times.  Turn off.  Slow down.  Boys, do you know the way to Mr. Rutagunda's warehouse?  This is thirsty work, let me treat you to some beers.  I will try my best George but these days I have no time for rallies or politics.  Time is money, George. We need extra beer today.  Very good.  Thank you.  At least.  The ice has melted!  Don't. Let's go.  Sit up, smile, Zozo, don't attract attention to yourself.  Here, Zozo, for your trouble.  Pull up at the front door.      Gregoire!   See to this right away.  It's an emergency, sir.  Gregoire will deal with it, excuse me.  How dead?  Dump the bad meat, save the shells, fill them will ah, a stuffing, something local.  Yes. Call it 'fresh Scottish Lobster in a cassava and Tipali crush'.  Mr. Ambassador, please come in.  Colonel Oliver, you are very welcome.  Please, serve the hors d'ouvres now.  It's a single malt, Glenmorangie. I thought you'd like it. Anything you need, gentlemen, let me know.  Yes, Benedict, what can I do?  I'm sorry, it's a private function.  I will be grateful if you keep my name out of your newspaper. Wait here and you will see who has attended as they leave.    Take it to the bar storeroom. Put three bottles of Glenmorangie... ...GLEN-MOR-AN-GIE, into it.  Yes, I'm sorry Madame Denver, it is because of the rebels.  The Tutsi rebels are far away on the border. And soon there will be peace.  I will try to arrange something.  How was your meal, sir?  I have heard, Mr. Ambassador, that they have discovered oil here, under Lake Kivu.  No. You pick it up.  How are your dish-washing skills, Gregoire?  Gregoire, there are no cockroaches in this hotel, do you understand?  No, Bik, it's a code word for Tutsis.  Excuse me?  Leave it to me.  Of course.   A neat bungalow and gardens behind the high wall. Paul parks and gets out. A DOG runs and greets him, BARKING.   Down, Pealiss.  Good evening, Odette, who is sick this time?  Your brother's here?  My best to Jean Baptiste.   The old guard opens the gate, Odette drives off.        Let's have dinner first.  Hello, Anais.  You are not Anais?  Oh, Carine, that is a shame. I have a present for Anais.  Goodness, I cannot tell. I guess I must find another present.   A crowded family table. Tatiana, Paul's four children, Thomas and Fedens, and the twins Anais and Carine.   Roger, your turn.  Thank you, Roger.  Why the hurry, Roger?  No, I don't want you going on the street.  Who is this Simon?  Homework?  Wash your things, and be back soon.   Roger runs to a wooden fence, gets down, moves two boards and squeezes through into a path, almost a tunnel in dense reeds.    After dinner coffee for the adults. Tatiana, Thomas and Fedens at the table. Paul, in his usual position, at the head, listening, like Solomon.   Today I talked to my friend the American Ambassador and Colonel Oliver of the United Nations. They are preparing a banquet for the peace signing. The BBC are flying in their best reporters. The world is watching. There will be peace. Don't listen to this man.   Paul, Tatiana, are by Thomas's car. They say good night to their guests. Anais and Carine sleep in the car.  Paul nods to the old guard to go open the gate. Just then Roger emerges from the thicket, wide-eyed, afraid.   Where?  What?  Please, be quiet.  No.  What would you have us do? Argue with these madmen? We cannot interfere.   Thomas and Fedens wait, anxious, as Paul appears.   You better stay the night, it is too dangerous to be on the streets.   Paul lies in bed unable to sleep.   The clock reads 3:00 am.   I couldn't help.  No, I could not. What do you know about favors Tatiana, about barter and deals? All day long I work to please this officer, that diplomat, this tourist. To store up favors so that if there is a time when my family need help I have powerful people I can call upon. Now you would have me waste a precious favor on a stranger.  He was not family. Family is all that matters. Do you think if you or I were being dragged from here, any one of them would lift a finger to help us?  Connections? I have no connections, only favors. If I call to help Victor, a General will think \"Paul Rusesabagina is a fool. He thinks my favors are so numerous and so insignificant as to waste them on everybody.\" Then my hard work is doubly squandered. I insult the General and I do not get to use my favor at all. Please leave these things to my good judgment.  Welcome, gentlemen.  I am delighted to see you, Mr. Daglish.  Promoted. House Manager.  Let me check.  Ah, I see the mistake. You were reading CBC - the Canadian broadcasting people instead of BBC Gregoire. Of course, the BBC, five rooms. They are being prepared as we speak. I have ordered fresh flowers and complimentary champagne.  Just give me a moment to get your keys.    Benedict, you should meet the BBC people. They could use your expertise.    Madame, this is Benedict Nangori, one of our best journalists. He covers all the big stories. I thought you should meet.  Give me the phone.  Madame Denver. I have very good news. I have a present for you, in return for the cancellation of your gorilla expedition I have arranged a safari at Lake Kivu lodge. A wonderful experience. No, no extra charge. A luxury coach will leave in one hour. I'll send maids up to help you all pack. You're welcome.  Call Kivu Lodge, ask for George, tell him I need three rooms. And send a team of maids up to the Americans. I want those rooms turned around in twenty minutes.  Forgive the hurry but I do not want you to miss the lunch buffet on the paddle steamer across the lake. It is the most spectacular sight in all Africa.  Exactly, we can't have our guests starving. What would they think of the Mille Collines back in the United States?  Same as last time.  The fifth room is your broadcast room.  Of course.  I'm sorry, Mr. Daglish, this is the Mille Collines. No working girls here.  I'm afraid I can't do that, Mr. Daglish. Ah, Zozo.  You remember Zozo, from the Diplomat?  Forgive me, George, my step was off.  Excuse me, gentlemen.  What's wrong?  Go to the terrace, I will join you.  Give me this man's name.  Thomas, Fedens, I am a man who looks after his family. If there were danger I would be the first to leave?  Calm yourself, it is fireworks to celebrate the peace.  ello. Tatsi. Yes, they are here. Yes. I  Already the press are packing their bags. The BBC man told me there's no story here. We are boring now. I'll be home soon.  Let us all go home and sleep.  Call when you get home.   And don't worry, Thomas. Good night.   Paul's at the wheel, driving. A thick mist. Barely a car on the road. Shadows dart past faint house lights. The windscreen clouds. Paul switches on his wipers. A Toyota truck, loaded with Militia, appears from the mist, speeds past. Paul switches the preset buttons on the radio as he drives. He can only find fevered drum-based MUSIC.        Paul turns onto his street. The houses are dark: windows shuttered; gates closed; not a soul about. Paul stops before his gate. HONKS twice. The gate doesn't open. He hops out and opens it with a key. Gives it a push and pauses as he heads back to the car. He hears the far off sound of gunfire. Distant explosions light the night sky.     Paul drives in. His compound is curiously dark.     His headlights sweep across his pitch-black house.    The door slowly opens. Paul steps in quietly, tries the light switch, nothing. He listens. The only sounds are distant explosions and gunfire. The beam of his flashlight cuts the blackness, illuminating: magazines arranged on a coffee table; an empty chair; children's toys in a basket.     Paul continues his search. Scans the counter. There's food on the stove. The table is set. He hears a GROWL, quickly cut short, from one of the bedrooms.     Paul shines the light into a room. Looks for a second, then closes the door, and walks to the next. He stops and listens with his ear to the door. Nothing. He pushes it in.     Paul's light sweeps across the room and illuminates:  Eyes - terrified eyes, a room full of faces, staring back.  THEIR POV: A dark figure behind a blinding light.  The dog breaks free, runs to Paul.       Pealiss!  Jean Baptiste!  What is going on?  Murdered! By whom?  Nonsense. Why would the rebels kill the president when he agreed to peace?  I sent them home. Go and call them.  Come on, everyone out of this room, find a seat in the living room.    Send them home. We are not the police. What do we have to protect them?  They know you are Tutsi!  Dawn. Then they go.   Tatiana rushes out the front door, Paul after her.  Paul catches her and puts his hand over her mouth.   Shhhhh.   Paul and Tatiana exit the back of the house with flashlight in hand headed towards the rear gate.  Paul searches along the chain link fence, finds a section loose, he pulls it back, clambers underneath it. Tatiana clasps her mouth, afraid to utter a cry.   Ssshh!   Paul bursts through the back door and sets Roger down.   Tatiana is beside them.   Where are you hurt, son?  What happened, son? Where did you get this blood?  Leave us, give us some space.     PAUL sits on the edge of the bed, staring out the window.  Behind him Tatiana has Roger cradled in her arms, he still trembles wide eyed as she tries to get him to talk.   Let him sleep.     Paul steps out, closes the door behind him. A small delegation of the men wait nervously.   Shut up!  Stay with the children.  Who is in charge?  I am Paul Rusesabagina, a good friend of General Bizimungu.   The Captain stops by his jeep, studies his clipboard.  Tatiana with Roger in her arms, her kids and all the neighbors herded together.   What is this about?  Yes, it is a calamity for us all.  No. I work at the Mille Collines.  I used to work at the Diplomat.  Of course.  Captain, I must take my family. It is not safe here.      Gentlemen, you'll find some chocolate, and maybe a few beers in the fridge. Don't let them go to waste.  I've got them.  Let me explain.  Please, I don't use guns.  Captain, what could I pay you not to do this?  Why not? These are not rebels, look at them. Soon they will be worthless to you. Why not take some money, for your work?  Name a price.  I don't have that much.  Wait! Wait!  Here, here, a thousand US dollars - fifty thousand francs for my family. To let us drive off to the Mille Collines.  Six.  Have you any money?    Captain, let these people give you some money, whatever they have.  Give me everything, everything you have.  Wait, wait.  Ten.  I'll give you a hundred thousand francs for all of them.  I don't have it here. At the Mille Collines. I can get it for you.  I swear, Captain, one hundred thousand francs, enough for a house. I will get the money, you keep them outside.    I'll be back.    Now let them go.  Don't be foolish. There's more money to be made here.  Come inside.  Please, I am the house manager. Return in thirty minutes and we will deal with all your requests, thank you.  What happened to all the rooms?  Take this room. Tatiana, bring the children.  Them. They almost got us all killed. I have done enough for them! We cannot look after them anymore.  What!    Can I help you?  What is his room number?  Go downstairs, I will help you.  What are you doing?  This won't do.  Any luck?  I'll try.  I need a great favor.  I need you to go to this address and bring my brother-in-law and his family.  This would be an enormous favor to me. I am a man of means, Mr. Garandi. When this nonsense is over I will be most grateful.  Thank you for your patience, ladies and gentlemen. Now, how can I help you.  Where are the receptionists? Where's Gregoire?  What!  Gregoire, what are you doing here?  Get out of this room and get back to work.  I am in charge now. Get back to work or I'll fire you.  Yes, Colonel Monsieur Xavier, the Minister of Finance.  Of course.  Get the key to suite twelve, take these people there right away.  What's going on?  Wait over there.  I said everyone go over there.  Yes sir, but these people  they cannot stay here. I've heard you have a refugee center at the airport Stadium?  Turn that off. We have a hotel to run.    Paul Rusesabagina, Mr. Godefroid. The house manager. I met you on your last visit.  Sir, that would be very bad for our reputation. We are an oasis of calm for all our loyal customers. What would they think if Sabena deserted them now? I assure you the United Nations has everything under control.  There is one thing I need right away.  This is my letter of appointment, signed by Mr. Godefroid, the president of Sabena. The Mille Collines is a five star establishment, we will run it that way. If you don't want to work for me, then leave now.  I want the hallways cleaned now, a menu prepared for the dining room. Where's the pianist?  I want you on the piano in the Kigali Room tonight. Back to work.  Take these people to the rear car park, they can't stay here.  Get Odette!  What happened?  What's happening?  Where is she?  Has Roger spoken yet?  How can we help him.  Give him time.  This goes out live?  When will they be here?  Thank God.  I'm glad you filmed this. Now the West will have to stop it. Excuse me, gentlemen.  Tatsi, come.  Go back inside.  Did you find the twins?  Was there blood?  This is not bad news, Tatsi. Perhaps they fled or could not make it home. There is hope.  Thank you for your help.  No. They are not dead. Stop this.  Colonel, what can I get you?  Canadian Club?  Congratulations, Colonel. You have saved us all.  Excuse me, Colonel.  I don't understand.     Paul opens the door. Tatiana and the kids pack bags, prepare to leave.   Children, go into the hallway.  Please, go.  All the whites are leaving.  They are being evacuated.  We have been abandoned.  Listen to me woman. I said all the whites are leaving. The French, the Italians, even the Belgian UN soldiers.  I don't know. Colonel Oliver says the UN has three hundred soldiers for the whole country. Black soldiers, Pakistanis.  The most the Colonel can spare for the hotel are four men, and they're not allowed to shoot.  If anything should happen, if the Militia arrive, you must take the children and go to the roof.  Do what I say, woman. You hear me? I will meet you there.  You are not staying sir, you are leaving.  I would never do that.  This is a Rolex, I can't take it.  Open up the ballroom, we'll put them there. And Zozo tell the kitchen to make rice and beans - a lot of it.   Paul enters, drops to the bed. Tatiana curls up next to him.   What are you saying, Tatsi?  Enough of this. We stay together. Let me rest, I will feel better then.  Yes, sir. What is wrong?  Why sir?  I...ah...need some time. Please give us twenty, thirty minutes. People are sleeping.  Please, have some cold drinks. I will be as quick as I can.  Come on son, everything is all right.    Go to the roof now.      Wait here, please.  Good day, General Bizimungu please. Do you know where he is? Please ask him to call Paul Rusesabagina. It is urgent.  Colonel Bagsora. Where? Can you find him?  Who would order such a thing?  Did you find the General?  We have a big problem. The Hutu army have come and ordered us all of us out of the hotel.  I do not know, sir. I think they will kill us all.  The staff, the guests.  Now we have eight hundred guests and one hundred staff. I have ten minutes left. I wish I could have done more, sir. Please, thank all my friends at Sabena. You have been good to me and my family.  Yes, thank you Mr. President.  The French. They supply the Rwandan army.  What are you doing?  Go and get more beer.  The guest list. It hasn't been updated since the murder of the president.  That will take time.  Call, sir?  Rusesabagina. Paul Rusesabagina.  They have gone.  They are gone. Thank you, sir. What did you do?  Thank you, sir, you saved our lives.  Why?  There will be no rescue, no intervention force. We can only save ourselves. Call any foreigner you know, tell them what will happen to us. Say goodbye but when you say goodbye, say it as though you're reaching through and shaking their hand. Let them know if they let go of that hand, you will die.  We must shame them into sending help.  Get on the phones while we still can. At least we can say they heard our cries. Zozo come with me.  Send two of the housekeeping carpenters to the lobby.  Everyone gather together now. Zozo get them all together.  No one can remain in this lobby any longer. I have rooms available. Who can pay? The rental is six hundred francs per day.  Go with Zozo to the ballroom. We will find you bedding. This is a hotel. No one will be allowed to stay in the lobby.  Good. I want you to go around and take all the numbers off the doors.  Nothing. I want no numbers on the doors.  Good day. Here is your bill for the last week. If you cannot pay, or think you will not be able to pay, go to the ballroom. Zozo will take care of you.  I'm afraid you will have to move room.  I'm going to put you on the third floor.  Yes they are. However if the army return they will expect important people such as yourself to be in these grand rooms.  Also, this is your bill for the last week.  I'm sorry it is not Glenmorangie.  The United Nations are still here.  Yes, General. I am glad you came by. I overheard something that I think you should know about.  A discussion between an American Embassy official and a UN Colonel.  The American assured the colonel that they would watch everything.  Satellites.  Yes, they can photograph the epaulets on your shoulder.  The American said intervention is too costly, better to get photographic evidence and snatch up the high command.  'Snatch them up and put on a war crimes trial. Lock them all away forever. No political risk, and big publicity.' That's what he said.  I thought I'd better tell you.  Indeed, general. Excuse me momentarily.  Where has all our beer gone?  How much beer?  I am worried about thieves and criminals coming into the hotel. Perhaps you could arrange for some police to guard us.  I understand General, but when I last talked to the president of Sabena he promised me that anyone who helped protect Belgian property would be rewarded.  \"Well rewarded\" Those were his words.  The front gate would be best, General. They could check all guests.  I admire you, General. How do you keep command of your men amidst such madness?  I wish I were like you. Look at my staff, they won't work, they listen to no one.  We, who is we?  Yes.  Why not?  I confess.  It's true I have a deal with General Bizimungu. He was just here. I worked out another money making scheme for him. New arrivals will be taxed at the gate.  Do you know what my deal is with Bizimungu. I pay him and he keeps you alive. Anyone want to take their money back?  Here, here take it. And you don't have to pay your bill. I will move you into the ballroom or out into the gardens.  And, yes, I work with George Rutagunda. I buy rice and beans, beer and soap. I will have to visit his warehouse soon because we are running out of food. Who wants to come with me?  Anyone who wants to come with me stay behind. If not, please leave.    George will not hurt me, I am too profitable to him.   Roger is asleep, on a couch in the living room, several kids sleep on the floor.  TO THE BED: Where Tatiana suppresses bursts of laughter as Paul relates the Gregoire story in whispers.   As soon as the General left he came running back.  Help me, sir, I have been possessed by a witch. A witch you say? Yes, yes, I did not know I was in that room. The president's room, why would I be in the president's room? (own voice) Indeed, the General asked me the same.  Asked you what? (own voice) Does Gregoire think he is president now?  Lynch Bages, 84. Perfect with lamb, or fine rare beef.  Maybe Gregoire and the witch ate it.  We're running out of beer and other supplies.  I have to go out to get food.  To Rutagunda's place. It is close by.  I have to, Tatiana, we are only as valuable as the service we provide.  I'm not going alone. I'll take Gregoire with me. He's a good Hutu, and he wants to impress me now.  regoire it is good to see you back to  Don't worry. I have a job this morning. I must go to visit my good friend George Rutagunda. You know George?  Fetch the van.  For supplies, you drive.  Just drive, Gregoire.  Hello?  Let's go.  We are to meet Mr. Rutagunda.  He will be here.  Excuse me.  Our cards, please.  You have our cards.  How much?  I need rice, beans, beer, and your best whiskey.    G  You have no whiskey?  What do you mean George?  )  Let's go.  Are you sure this is the river road?  Stop. You've driven off the road. You'll put us in the river.  Go back! Go back!  Tell no one what you saw, do you understand?  That's a big one. Here we go.   Tatiana feeds the children - rice and beans. Paul arrives.   Roger, you have no greeting for me.  There, do not worry, no tears.  It's alright. This is the only place I can find some peace.  A kiss.  I have a confession. When we met...  Yes, when you worked as the nurse.  I had you transferred to Kigali.  I bribed the Minister of Health to have you transferred to Kigali.  To be closer. So that I could marry you.  It was substantial.  A car.  What does it matter.  A Volkswagen.  Colonel, Odette Camundu ... she must be on the list.  We have to get out of here Tatiana.  I'll try but we have to leave, with or without them. I want you to promise.  I need one last favor. Go back and get the twins.  How do you know?  I will give you my house.  It's a fine house. Here is a paper.  Madame Kawunda, please.  I need you to witness this signature. Madame Kawunda is the Minister for Agriculture. She is a very reliable witness.  Please witness this deed.  There, now go and find them. They have no papers. No one knows they are Tutsi. They will be alive.  You must be back by 7:00a.m. tomorrow.  Seven, remember.  Zozo you are family, join us.  You are my dearest friends. I promise you before God that I will not sleep until I have you out of here. All of you.  You are my family now, Zozo, my brother. I will get you out of here.  Let us remember this night and tell the world that even in hell there are good people.  We wait until 7:00. If he is not here with the twins he is not coming. We leave. That was your promise. Go help the children.  Zozo, tell those people to get back to the ballroom. They can not be here.  What are we waiting for? Come on.  Yes.  I will get you all visas. I promise. I will get you out of here.  Get on the truck, Tatiana.  Look, our children are crying, please get on the truck.  I have to stay.  I cannot leave these people. I will wait for the twins.  I will follow on the next plane. Go.  I love you. Keep the children safe.   The room is still littered with clothes, kids drawings, the personal junk accumulated over four weeks.  Paul tries to arrange things, then collapses on the bed, paralysed with doubt - Why did he do this?  Then the door bangs.   Dear lord, how did they know?  When?  Please, General, I will give you money, whiskey.  Please, I have money. They're driving into an ambush, it's on the radio.  Thank God you are safe.  What are you doing?  Did you explain to the good General that I have temporarily run out of stock?  You will get it in due time. Now, please, get back to the gate.  What is this about no water?  We can still get CNN here in hell.  I'm sorry, General. The cellar is empty.  No. We have no way of finding other stock but I have money for you from the guests.  I ran out of whiskey. Please go down and guard us.  Get down there and stop them, please.  Get down and stop them.  What do you mean you cannot shoot?  Then go and pretend you are soldiers.  We are almost out of everything.  We had a good life, you and I. I want to make our peace. To thank God for the time we had.  We have to have a plan.  Our children cannot see us die first. If the Militia comes, you must hurry up to the roof. I will meet you there.  We have to. If I do not come, you must take them all by the hands and jump.  The machete is no way to die. Promise me you will do it.  No. It was only a storeroom.  They fired a rocket at us.  I ran out of bribes. Bizimungu took them away.  Will you protect us.  What is it?  They will surely kill us here. It's over here. We have to take the chance.  We'll be chopped here.  I can't. I have nothing left to bribe with. Can your men at the gate hold out for another day?  Give me their uniforms. I will put people at the gate, in disguise.   Tatiana is beside him. He opens the envelope, finds his makeshift house deed and a note.   It's from Garandi. I am sorry. There is no hope for the twins. The old lady's house has been destroyed.   Paul sleeps fitfully. It is almost dawn, then he sits up.   The Diplomat!  I have to go to the Diplomat.  General, sir. I am glad to find you. I have found you some supplies.  The finest, and cognac, champagne. Come and I will get them for you.  Bring back your policemen...  We must go to the Diplomat.  Your police are at the gate?  Where are they going?  What do you mean, General?  When?  It might be damaged, General.  No.  No, sir.  I hope we all get to do many things. Can we go now?    I do not want to go to Gitarama, General.  The Militia are at the hotel?! We must go back now, General, please, for my family.    You are a marked man.  The Americans, and the UN they have you as a war criminal. You are on a list.  When the Europeans left, their soldiers gathered lists.  If you do not help me, you will stay on that list.  Who will tell them? You need me to tell how you helped the hotel. The others who have gone, they blame you for all their misfortune. They say you led the massacres.  You think they will believe you?    What are you going to do, shoot me? It will be a blessing. Go ahead shoot. I will pay you to shoot my family. You can do nothing to me!  They have him in the lobby, go quickly.   Paul bursts in.    The place is a mess. And it's empty!   Oh God, please Lord.  Tatiana! Oh God. Have you seen Tatiana?    It's alright, they're gone.  We can't wait. We all go together or not at all.  It is time to leave. The Mille Collines is closed.  It's the rebels.  We've made it!  Anais, it is so good to see you.  RUSESABAGINA: saved the lives of all one thousand two hundred Rwandan refugees who took shelter at the Mille Collines Hotel.  PHOTO TURNS TO PHOTO OF REAL PAUL AND HIS FAMILY.         Paul, Tatiana, the twins, and all their family now live in Belgium, where Paul owns and operates two taxi cabs.",
        "Rusesabagina": "",
        "Colonel": "Our intelligence, Mr. Ambassador, is that the Hutu government has been stockpiling weapons and are preparing a massacre.  How about a battalion of U.S. Marines.  You're right, Mr. Ambassador, Paul knows how to get anything, even U.S. troops.  To Peace.  Paul, you know who this is?  Get him a room, but tell no one he is here. Paul will look after you.  No. But I fear it's intention may have been to kill the peace accords and spark a civil war between the Hutu Militia and the Tutsi rebels.  Unfortunately we're here as peace-keepers not peace makers, we can't take an aggressive role.  Yes. With some re-inforcements I'm confident we could impose order.  Yes we have.  We're awaiting a decision, excuse me.  Paul, I've sent my soldiers to rescue the Lady Prime Minister, she'll need a room.  I'm sorry, I can't possibly take them Paul. I'm overrun with refugees. As soon as we can stabilize the situation we'll take them.  Hold the line here. Do not shoot!  They murdered my soldiers. Ten Belgians who I sent to get the lady minister.  You have a battalion, you could stop this now. The Hutu army is no match for you.  You will remember this day for the rest of your lives.  Anything. Strong.    We think you are dirt, less than dirt, worthless.  Don't bullshit me, Paul. You're the smartest man here. You have them all eating out of your hand. You'd own this fucking hotel, except for one thing.  You're fucking black! You're not even a nigger, you're African! They're not staying to stop this thing. They're gonna fly right out of here with their people.  They're only taking the whites.  Great news, Paul, we're going to get you out of here.  The UN has been notified that the following families have received travel visas from the following countries.  Abukesu - Tanzania, Arumangu -Zambia, Bawroanga - Kenya,  Gituaranga - Zambi, Horangora - Belguim  Paramisambi - Zambia, Rusesabagina - Belgium.  Zamacanga - Ghana. A plane will land at the airport tomorrow and the named families will be flown to Kenya. Two UN trucks will be here at 7 a.m. The named families must be ready to leave then.  I can't do that. Our camp at the airport is overwhelmed already. We could not defend you there. You are better to stay here and work to get an exit visa.  Paul, only those I called can get on the trucks. I do not want to have to pull people off, you understand?  Yes.   Where are the Rwandan police?  That explains it. I'm sorry to tell you this but we've heard rumors the Militia are getting ready to storm the hotel.  I can't, I don't have the men.  There's one option.  The rebels have fought their way into the city. They have many Hutu prisoners. They're willing to exchange them for you all.  I think so. They are in disarray now. The rebels are winning, and the Hutu high command are anxious to get some of their men back.  By convoy.  A man came to my headquarters, asked that I give you this.  Paul, I need you to buy me a day or two. I don't have the fuel for this convoy. I will have to scrounge it.  No, Paul, they're afraid. They've demanded to be moved back to headquarters now.  I wish I could, Paul. Try to hold out. One more day.  Don't stop. Push through.  Keep going.",
        "Oliver": "Our intelligence, Mr. Ambassador, is that the Hutu government has been stockpiling weapons and are preparing a massacre.  How about a battalion of U.S. Marines.  You're right, Mr. Ambassador, Paul knows how to get anything, even U.S. troops.  To Peace.  Paul, you know who this is?  Get him a room, but tell no one he is here. Paul will look after you.  No. But I fear it's intention may have been to kill the peace accords and spark a civil war between the Hutu Militia and the Tutsi rebels.  Unfortunately we're here as peace-keepers not peace makers, we can't take an aggressive role.  Yes. With some re-inforcements I'm confident we could impose order.  Yes we have.  We're awaiting a decision, excuse me.  Paul, I've sent my soldiers to rescue the Lady Prime Minister, she'll need a room.  I'm sorry, I can't possibly take them Paul. I'm overrun with refugees. As soon as we can stabilize the situation we'll take them.  Hold the line here. Do not shoot!  They murdered my soldiers. Ten Belgians who I sent to get the lady minister.   You have a battalion, you could stop this now. The Hutu army is no match for you.  You will remember this day for the rest of your lives.  Anything. Strong.    We think you are dirt, less than dirt, worthless.  Don't bullshit me, Paul. You're the smartest man here. You have them all eating out of your hand. You'd own this fucking hotel, except for one thing.  You're fucking black! You're not even a nigger, you're African! They're not staying to stop this thing. They're gonna fly right out of here with their people.  They're only taking the whites.  Great news, Paul, we're going to get you out of here.  The UN has been notified that the following families have received travel visas from the following countries.  Abukesu - Tanzania, Arumangu -Zambia, Bawroanga - Kenya,  Gituaranga - Zambi, Horangora - Belguim  Paramisambi - Zambia, Rusesabagina - Belgium.  Zamacanga - Ghana. A plane will land at the airport tomorrow and the named families will be flown to Kenya. Two UN trucks will be here at 7 a.m. The named families must be ready to leave then.  I can't do that. Our camp at the airport is overwhelmed already. We could not defend you there. You are better to stay here and work to get an exit visa.  Paul, only those I called can get on the trucks. I do not want to have to pull people off, you understand?  Yes.   Where are the Rwandan police?  That explains it. I'm sorry to tell you this but we've heard rumors the Militia are getting ready to storm the hotel.  I can't, I don't have the men.  There's one option.  The rebels have fought their way into the city. They have many Hutu prisoners. They're willing to exchange them for you all.  I think so. They are in disarray now. The rebels are winning, and the Hutu high command are anxious to get some of their men back.  By convoy.  A man came to my headquarters, asked that I give you this.  Paul, I need you to buy me a day or two. I don't have the fuel for this convoy. I will have to scrounge it.  No, Paul, they're afraid. They've demanded to be moved back to headquarters now.  I wish I could, Paul. Try to hold out. One more day.  Don't stop. Push through.  Keep going.",
        "Dube": "",
        "Tatiana": "I asked Odette to take a look at little Anais. She has a rash.  Yes, with Fedens and the children.  You will not stay for dinner.  He wants your wisdom.  Of course.  Simon, next door, the Charingas' boy.  And he did extra chores.  Your assistant, he is Hutu?  That station is filth.  What is it?  Oh, my God, it's Victor. Why do they want Victor?  Do something.  Call your friends in the army. Call someone. Victor is harmless. This is a mistake.  I'm going to talk to them.  We must do something.  I'll fix a bed.  Why didn't you call your contacts in the army?  You could have asked for a favor.  Victor was not a stranger, he was our neighbor.  They do not have your connections.  Paul!  The president has been murdered.  Where are Thomas and Fedens?  I tried already. The phones do not work.  They came through the bushes, over the wall. What could I do?  Please. Let them stay 'til morning. The militia will not come here, they know you are a Hutu with influence.  Please, Paul, 'til first light.  Gone where? Tell me, Danielle.  Roger!  Oh, my God!  Will you take a little milk?  What is it, Paul.    No, no, good Captain, you do not have to. We have the car and our van.  Paul, don't let them die.  What about them?  What are you going to do? You cannot drive them out onto the road. They can stay with me.  I will not have them on my conscience. They will stay in my room.  Trying Thomas and Fedens. We've got to get them here.  It will do just fine.  No answer. Please send someone to get them, please.  No, Odette says he's in shock.  He needs to be in a safe place. Have you heard from Mr. Garindi?  Oh God.  My brother, his wife. Did this woman know of them? Did they leave the children with her?    My sister is dead, Paul. They would not leave the children.  What's wrong?  What about us?  The soldiers will stop the killers.  But who is left?  What for?  You could leave, Paul.  Your card says Hutu. Take our children, go and get the twins, pay money at the roadblocks. Get them out. Please.  Where's Roger?      So where is the lamb?  What's the matter?  The foreigners abandon us and you do inventory. You are so conscientious.  Go out! Where?  No, no.  You cannot go alone.  Where are we going?  Please, Paul, why do we have to go to the roof?  I hear we must pay for everything. How much for this?  You are a very good man, Paul Rusesabagina.  In Ruhengeri?  Yes.  What?  Why?  What was the bribe? What am I worth to you?  Tell me what it was.  What sort of car?  I want to know.  A Volkswagen!  I hope it was a new Volkswagen.  I will not leave without the twins.  Please, please try one more time.  Sit with us Zozo.  A little longer, Paul?  Ask them to wait a little longer. For the twins.  No.  No! Sit down now.  Let go. Let me off this truck.  Let me go. Children get off.  Paul!  What's happening?  Did he bring the twins?  We are almost out of water.  What sort of plan?  Please do not talk like this.  What's wrong?   The bodies move, look up, it's not them. It's refugees hiding. Paul, delirious with fear, runs along the parapet.  BELOW he sees soldiers herding the Militia.  He runs back to the stairs.  INSIDE THE STAIRCASE: He jumps four stairs at a time.  INSIDE THE CORRIDOR: Soldiers are chasing off the Militia.  TO HIS ROOM: Paul staggers in, crazed with fear. He looks under the bed.  INTO THE BATHROOM - empty.  He's about to run out again, sees the connecting door to the adjoining hotel room is slightly open.     INTO THE ADJOINING ROOM: It's empty, then A WHIMPER.  FROM THE BATHROOM, he moves in, cautious.  IN THE BATHROOM: Nothing. He moves over, pulls back the shower curtain.  Reveals: A cluster of women and children, the older ones holding hands over the mouths of the younger ones. And there at the back: Tatiana and his kids.   Have you seen my sister Fedens?  Two little girls, twins, an old woman had them.  Oh, my babies.",
        "Fedens": "Why should we leave? I have a new job, things have never been better for us.  Please, let us take Tatiana with us. You are Hutu, you will be safe.  What was that?",
        "Policeman": "Mr. Rusesabagina, good morning.  In the passenger seat PAUL RUSESABAGINA, late 30's, flashes a smile. He is dressed in a sharp blue suit (always dressed in a neat suit and tie, it is a matter of pride).  A quick shake of hands. Money passes from one to the other.",
        "General": "Paul, this scotch is exceptional.  Oh, Paul, talk to the coat check, please.    Of course, the president is a clever man, he knows what he is doing. Thank you for coming to Rwanda. . You will see what a beautiful country this is.  Keep that cockroach Benedict away from me.  Paul, join us.  Have a drink.  I am glad you are well.  As long as it is scotch. Your white friends have abandoned you, Paul.  The United Nations. Madmen are on the streets, Paul. But I will take care of you.  Your cellar is well-stocked, right?  What did you overhear?  What did they say?  Watch everything? How? They are gone.  Satellites?  The high command? Our high command?  The Americans! Who are they to put us on trial. Let us imagine Paul when their president Kennedy was shot, they said it was a black man. Then their politicians, their radio stations gave orders `we must wipe out these black people before they wipe out us.' What do you think would have happened? No different.  The police are very busy.  He did.  If I were to spare a few policemen, where would I station them?  I will see what I can do.  I am strong, Paul, like a lion.  Get to work, you slug.  Make sure, Paul, your guests are generous.  You said you had no whiskey.  Come here.  Where are my supplies?  You have cockroaches dancing on tables and you tell me the cellar is empty? Did they drink my whiskey?  Rwandan francs! They are only good now for wiping your ass. There is nothing more I can do for you people. No police. No protection. You're on your own.  Whiskey?  I'll be over.  Get in.  After the Diplomat!  They can go where they want. They are in charge now.  We have decided to move the government to Gitarama.  Today.  Maggots!  Do your work.  Here.  To celebrate.  You know what the Scottish call it?  Ishca Baha - the water of life. I went on a tour once of the finest single malt distillery in the world. Have you ever been to Scotland?  Wonderful country, wonderful golf. I wonder - will I ever go back? What do you think?  Pack those carefully, put them in my jeep, and guard them.  I am going to do you a great favor. I am going to take you with us to Gitarama.  You cannot go back to the hotel. The crazy men are going there now. Better to come with me.  We are better here.  How so.  I am on a list! What list?  You lie.  I committed no war crimes.  I led no massacres.  You will tell them I did nothing.  Get back!  Get them out of here.   Augustin Bizimungu escaped with the Hutu Militia to the Congo. In August, 2002 he was captured in Angola. A UN war crimes tribunal has charged him with crimes against humanity.   PHOTO OF: THOMAS AND FEDENS                               Thomas' and Fedens' bodies where never found. Paul adopted their twin daughters.",
        "Bizimungu": "Paul, this scotch is exceptional.  Oh, Paul, talk to the coat check, please.    Of course, the president is a clever man, he knows what he is doing. Thank you for coming to Rwanda. . You will see what a beautiful country this is.  Keep that cockroach Benedict away from me.  Paul, join us.  Have a drink.  I am glad you are well.  As long as it is scotch. Your white friends have abandoned you, Paul.  The United Nations. Madmen are on the streets, Paul. But I will take care of you.  Your cellar is well-stocked, right?  What did you overhear?  What did they say?  Watch everything? How? They are gone.  Satellites?  And what will they do with these satellites?  The high command? Our high command?  The Americans! Who are they to put us on trial. Let us imagine Paul when their president Kennedy was shot, they said it was a black man. Then their politicians, their radio stations gave orders `we must wipe out these black people before they wipe out us.' What do you think would have happened? No different.  The police are very busy.  He did.  If I were to spare a few policemen, where would I station them?  I will see what I can do.  I am strong, Paul, like a lion.  He is staff?  Get to work, you slug.  Make sure, Paul, your guests are generous.  You said you had no whiskey.  Come here.  Where are my supplies?  You have cockroaches dancing on tables and you tell me the cellar is empty? Did they drink my whiskey?  Rwandan francs! They are only good now for wiping your ass. There is nothing more I can do for you people. No police. No protection. You're on your own.  Whiskey?  I'll be over.  Get in.  After the Diplomat!  They can go where they want. They are in charge now.  We have decided to move the government to Gitarama.  Today.  Maggots!  Do your work.  Here.  To celebrate.  You know what the Scottish call it?  Ishca Baha - the water of life. I went on a tour once of the finest single malt distillery in the world. Have you ever been to Scotland?  Wonderful country, wonderful golf. I wonder - will I ever go back? What do you think?  Pack those carefully, put them in my jeep, and guard them.  I am going to do you a great favor. I am going to take you with us to Gitarama.  You cannot go back to the hotel. The crazy men are going there now. Better to come with me.  We are better here.  How so.  I am on a list! What list?  You lie.  I committed no war crimes.  I led no massacres.  You will tell them the truth.  You will tell them I did nothing.  Get back!  Get them out of here.   Augustin Bizimungu escaped with the Hutu Militia to the Congo. In August, 2002 he was captured in Angola. A UN war crimes tribunal has charged him with crimes against humanity.   PHOTO OF: THOMAS AND FEDENS                               Thomas' and Fedens' bodies where never found. Paul adopted their twin daughters.",
        "Old": "That house.  Mr. Paul.  Out, get out now!  Wait!  Sit down.  We have to evacuate some nuns from a convent. They are on their way.  You know we cannot shoot.  We are peacekeepers, it is not in our mandate to shoot.  Get out, or I'll shoot you.",
        "Guard": "Mr. Paul.",
        "George": "You will join us at the rally today?  Politics is power, Paul. And money.  Business is good at the hotel?  I am always glad to see you Paul.  Hell man, that is not beer, put it back!  Forget the Carlsberg, give him Grolsch. I won't charge extra.  A bargain buy, from China. Ten cents each, I'll get a dollar.  Look at them, they want to see the tribes dance to their tune. Here is our dance.  Come on, Paul. Show them our dance.  To our president. May he find peace.  Paul. My old friend.  Everything is double the price now, you do understand that?  No whiskey, no spirits. Your rich cockroaches at the hotel, they will have to do without their scotch. Anyway, I have bled that cow enough Paul.  Their money is no good to them. Soon all the Ineysi will be dead.    Take the river road back. It is clear.  George Rutagunda was convicted of crimes against humanity.   He is now serving a life sentence in a Tanzanian jail.",
        "Rutaganda": "At his desk in front of a fan. GEORGE RUTAGUNDA, late 30's, huge, gold chains, Rolex watch,  but the same Interahamwe shirt. He squeezes an orange rind into a cup of espresso.  Behind him, through his office window, the white van is being loaded with cases of beer.  George holds out his massive shirt.    The fog still hangs like a cloud. As they pull up, a group of young Militia emerge from Toyota trucks.    The warehouse is filled with looted televisions, artwork, cars. George points to the stacks of beer."
    },
    "imdb_rating": "8.1",
    "description": "1994. In Rwanda, the classification of the native population into Hutus and Tutsis, arbitrarily done by the colonial Belgians, is now ingrained within Rwandan mentality despite the Rwandan independence. Despite the Belgians having placed the Tutsis in a higher position during the Belgian rule, they have placed the majority Hutus in power after independence.Paul Rusesabagina, a Hutu married to a Tutsi, Tatiana Rusesabagina, is the House Manager of the Hotel Des Milles Collines in Kigali. The Milles Collines, owned by Sabena (the national airline of Belgium), is a four-star hotel catering primarily to wealthy white westerners. Paul, who knows how to work the system to run the hotel effectively for its guests and for Sabena, is proud that most of the Caucasians who he meets in this professional capacity treat him with respect. After a specific incident, the relative calm between the Tutsi guerrillas and government-backed Hutu militia takes a turn. Paul's thought that the native population as a whole who are not directly involved in the conflict will be protected as the UN peacekeeping forces and thus the world is watching doesn't happen as the western world largely evacuates from Rwanda and abandons the natives. Such begins what will become a genocide of the Tutsi population. Paul, who is able to get his immediate family to the hotel which is still largely seen as a place of sanctuary, will have to use the considerable skills he has used to run the hotel as well as he has instead to keep himself, his family and any others taking refuge at the hotel alive, whether they be Hutu or Tutsi. Meanwhile, Colonel Oliver, a Canadian heading the UN peacekeeping forces, and Pat Archer with the Red Cross do what they can to assist Paul and to get people to safety first to the hotel then out of the country, while field journalists, like photographer Jack Daglish, try to bring the genocide back into the global media to have the world once again care about what is going on.—Huggo",
    "name": "Hotel Rwanda",
    "genres": [
        "Biography",
        "Drama",
        "History"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZGJjYmIzZmQtNWE4Yy00ZGVmLWJkZGEtMzUzNmQ4ZWFlMjRhXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}