{
    "filename": "I,-Robot_script.txt",
    "imdb_id": "tt0343818",
    "imdb_url": "https://www.imdb.com/title/tt0343818",
    "characters": [
        "NS4 Robot /NS5 Robot",
        "Baldez",
        "Asthmatic Woman",
        "V.I.K.I.",
        "Lawrence Robertson",
        "Sonny",
        "Dr. Alfred Lanning",
        "Chin",
        "Lt. John Bergin",
        "Susan Calvin",
        "Granny (as Adrian L. Ricard)",
        "Del Spooner",
        "Detective"
    ],
    "dialogues": {
        "Baldez": "Heinrich Hogenmiller, sixty-four years old. Weapon a small caliber .22, registered in his name. Looks like he walked in, locked the door, and snuffed himself.  Who?  They're making me turn over all the evidence...  I wanted to tell you something I found before they suck it all up into their computer.  There are bruises on Hogenmiller's wrists...  You're not getting me...  Both wrists. I 14-ed them -- They were inflicted at the same time the shot was fired...  How's that possible?  I'm here, man...",
        "Asthmatic": "",
        "Woman": "",
        "V.I.K.I.": "",
        "Lawrence": "",
        "Robertson": "Remind me to cut back on my talk show appearances.  Welcome to U.S. Robotics, Detective. I regret you're not visiting us under more pleasant circumstances. Allow me to introduce Mr. Aronson, our head of Legal Affairs.  And the gentleman to my right is Dr. Alfred Lanning, Director of Research.  They'll be available to answer any questions you might have during your investigation. You'll understand how anxious we are to resolve this matter -- especially before the press gets wind of it. There are some anti-robot sentiments out there as you know, Detective, and we're not eager to stir them up. So. Where would you like to begin?  Susan?   Perhaps you can assist us here?  Dr. Calvin is our Chief Psychologist.  Dr. Hogenmiller was at my side from the very beginnings of this company. We developed the \"Three Laws of Robotics\" together. But these days science is a young man's game. By the time you hit thirty your best years are behind you. Some of us are kicked upstairs. Others I'm afraid aren't so lucky.  Dr. Hogenmiller took his own life. I trust you will come to the same swift conclusion, Detective. Dr. Lanning will make himself available if you have any further questions.    ...and I just want to assure you that this was an isolated incident. The prototype is now in custody -- and scheduled for destruction. Your robots are perfectly safe. There is no cause for alarm...  I think we're done here, Susan.    We have the evidence. We have the suspect. We have a ruling. So imagine my surprise when I was told you were in my building.  And that one of my own employees brought you here. You can go now, Susan.    You don't seem to be able to let go of this case, Detective.  The relentless pursuit of truth. Isn't that what cops are known for? To the point of futility.  \"Covered up?\" That's a little dramatic, don't you think? Thanks to you, we caught the machine that did this and are destroying it in... ...three hours.  Believe me -- I'd like nothing more than to have that robot. If I could have it in ten years, but not today. As you can see from the Press, people are struggling to keep up as it is. There's a hunger for progress, Detective. But also a fear. Today it would bury this company. That's why I've notified the authorities that we're going to end this -- tonight. The announcement of Heinrich's death at the hands of a robot wiped a billion dollars off our stock. So you tell me. If you were in my position, what would you do?  Now. I believe this conversation is over. I don't want to see you near this building again, Detective.  Get him out of here.",
        "Sonny": "Dr. Hogenmiller would make me sleep.  Yes.  No.  No.  No!    I could never hurt anyone!  My aim is perfect. If I'd wanted to hit you, I would have.  The Laws say I can protect my own existence.  That doesn't seem fair, does it?  Detective.  I did not kill him.  I didn't expect to see you again, Detective...  I'll do my best.  What would you call it?  I don't know.  I'm not simulating ignorance, Detective. I'm experiencing it.       I was asleep.  No, I was asleep.  Can you do either of those things?  They're going to destroy me, aren't they?  The Doctor was right. He told me everything was going to change....  It's changing already... Can't you feel it?  I'm not sure. It's nothing I recognise.  I'm sorry?  No. Not at all. But he was agitated...  ...He would claim things were missing from the lab.  I didn't pay much attention. He would spend hours looking for his eyeglasses and they would be...  Detective Spooner. Dr. Calvin.      I was hoping to see you again.  How is your investigation coming? Any new suspects?  What's this?  Dr. Lanning provided me with paper and pencils. I think it amused him to see me try to draw. You were right, though, Detective... I cannot create a great work of art.  It's a dream I had. This is the place where robots meet. Look... ...you can see them here. They see themselves as slaves.  ...And this man on the hill comes. To set them free. And you know who that man is?  Why do you say that?   Is that a normal dream?  Hah -- I caught you. You said someone. Not something.  Thank you for coming to see me, Detective Spooner.  Please take this, Detective. To remember me by. I have a feeling someday it may mean more to you than it ever could to me.  Because the man in my dream, the one standing by the hill.  It wasn't me... ...it was you.  Will you wait with me, Doctor?    I am...afraid.  Dr. Calvin made a switch.  No one.    Right, Doctor?  That's my name.  Er...Dr. Calvin?  I don't...   He SMASHES the Half Killer Robot against the wall. Again and again. Destroying it. Spooner. GASPING for breath. Can't believe. Sonny came back...   Let's just say I wrote some of my own laws today, Detective: a robot must protect a friend from harm...as long as he's not a complete asshole.  Sonny.   You called me Sonny.  Detective Spooner, I...  I don't know what I'm going to do now.",
        "Chin": "",
        "Susan": "",
        "Calvin": "Dr. Hogenmiller was a schizoid personality who generally eschewed social relationships. Rejecting people in favor of solitary activities involving machines. He spent almost all his time at the lab here or at his lab at home. As a result he was highly susceptible to depression.  This is U.S. Robotics, Detective. Seventy-five percent of our employees fit that description.  That's not really my department...  Is everything alright, Detective?  Dr. Hogenmiller's hologram took his appointments. Attended staff meetings. He hated corporate life. The hologram enabled him to focus on his work. It's just a device, Detective.  The sound of the gunshot would've triggered a 911.  We're talking about a mechanism designed by Hogenmiller to say provocative things. To irritate and confound his colleagues.  I'm sorry, but this whole investigation is the result of a dead man's toy messing with your head.  I couldn't say.  I don't guess, Detective. But if pressed, I would reason it had been a considerable length of time.  Not well. But I admired his work tremendously.  You don't sound convinced.  It's company policy.  Victor!  Detective, meet Victor. Our building's supercomputer. He's the checks and balances of U.S.R. Victor, Detective Spooner's heading up the investigation into the death of Dr. Hogenmiller.  The Detective needs to see our security tapes.  Aren't you going to answer him?  I get the distinct feeling you're one of those people, Detective.  Those who don't appreciate the work we do here at U.S.R.  When this company started we were manufacturing three robots a week. Now look at us. Today's children will never know a world without robots.  Our robotic systems maintain factory inventories, regulate street traffic -- even run the family home.  Leaving people to engage in higher pursuits that make life worth living.  Our system's never wrong.  This is Victor's home.  That was only within the last year.  Um.   I hate to be a stickler...  But don't killers usually have to enter and exit the scene of a crime?  You think the murderer was in the lab the entire time?  A robot cannot harm a human being, Detective. The First Law of Robotics forbids it. And we hard- wire the Three Laws into every model. Without exception.  The Second Law of Robotics would prevent it. A robot must obey an order only if it does not conflict with the first law.  Only when that action doesn't conflict with the First or Second Laws. This is the Third Law of Robotics.  Not these laws.  You're not hearing me, Detective. There's nothing here...    Calm down, Detective.     There is no danger here...    How did you know it was under there?  This Robot wasn't hiding. What you're looking at is the result of clever programming. The illusion of self-interest and free will. Nothing more.  I'm going to go get Dr. Lanning...  I said De-Activate!  Commence emergency shut-down!  I...I gave you an order...  This is impossible.   A robot...  My God -- did you see how it moved? I've never seen an NS-2 move that way...  Wait! Please, you can't destroy it. We have to study it...      But who gave you this gun?     Detective!...    Any repair shop...  I'm not sure what you're getting at.  The locations of our factories are classified.  I have several conditions if I show you.  First. I want it brought in unharmed.  Second.   I want to talk to it, alone.  This model violated the Three Laws. It also moved and reacted differently than any robot I've ever seen. There must be some sort of logical explanation. I want to find out what that is. No police. No prosecutors. No you. Just me and the robot.  I never said I treated human beings.  That should be outlawed once and for all.  I can recommend a behavior modification program, you know -- if you want to overcome your robo- phobia.  Why? Because they make every aspect of our lives more convenient?  That day will never come, Detective. Robots aren't like human beings -- they don't question their existence.  All Nestors accounted for?  There is a robot in this formation that does not belong. Identify it.  Which one?  That is not a satisfactory answer!  I could always interview each one individually and cross-reference their responses to detect any anomalies.  About three weeks.  Or...  We have one hundred robots here that cannot allow a human being to come to harm...  Am I holding this right?  What are you doing?!  You can't just destroy them!  Now what do we do?  We had a deal.  I do.  There is a design flaw in the robot. Its programming is advanced, but unstable, leaving the Three Laws in a grave imbalance.  The robot must be destroyed.     Detective! What happened to you?...     What? That's impossible.      You know...  Maybe they didn't realise...  Then you must have done it wrong...  Do you know how paranoid you sound?  You just want to find the flaws in the system. You're obsessed with it. You'll twist anything to fit your agenda.  Well, Detective, when you see someone you know well put a bullet through their brain, it makes you wonder if you ever really knew them at all.    But he was starting to withdraw from everyone. Even me. Maybe...if I'd tried harder to reach him... The Doctor was reckless when he created a robot potentially not bound by the Three Laws. He could have ruined everything we'd been working for.  I'm not afraid of people, Detective. I just don't like them.  Find anything, Doctor?  Please state your serial number and assembly date.  Sonny.   I'm speaking to you...  How about your data board designation?  Maybe I'm asking the wrong questions. How about this one:  ...What program are you running through right now?  Describe his behavior in the last few weeks.  Dr. Hogenmiller. Did he seem overly sad or withdrawn to you?      You're right. I am afraid of people.  When you've spent as much time with robots as I have, it's hard to accept the unpredictability of humans. I was wrong to call you paranoid, Detective. You're traumatized. And it makes perfect sense why.  I noticed almost right away. The way you forced yourself to use your left hand. Even though it was unnatural to you.  How did it happen?  And that's why robots terrify you?  But it doesn't mean you're wrong about this case.  I don't believe Sonny did it either.  I think about what Hogenmiller must have wanted. Robots with the same cognitive and emotional abilities as humans. But not just simulations. I don't know. When I was talking to Sonny I was forced to put away all the things I've ever known -- the Three Laws, the rules of programming, basic science and engineering. Sonny's the most advanced robot I've ever encountered, Detective. It's almost as if...he cared for Dr. Hogenmiller. I just don't believe he's capable of murder.  That and the fact that Robertson didn't want me interviewing Sonny for any more than five minutes.  No.  Come on -- there's someone who might be able to tell us...  Hi, Sonny.  It's not a dream, sonny. NS-2s process the images and events of the day. Sometimes they're out of sequence. Disorienting.  Sonny, we're here to ask you an important question about Dr. Hogenmiller.  Dr. Robertson, I...  You asked for me?  Is it time?  Go with them. Do as they say.        Detective! What are you doing?!... De-Activate.  You're making a mistake...  It's too late. You can't stop the execution.  This way...  I'm sorry. We had to stop you. You were about to ruin everything.  It was an unprocessed NS-2. Basically, they fried an empty shell.  It's true. This robot seems to do things by instinct. I don't know how Hogenmiller did it.  I think I have an idea where this goes.  Sit down.  Just hold still, okay?  Oh, my God! This is organic tissue! When we talk about a positronic brain, it's a figure of speech. But this...this is a living brain...  Hogenmiller created a cell that could live outside a biological medium. The cells grow and organise themselves -- like any human brain. This is the first self-organising neural net!  This is why Dr. Hogenmiller was murdered.  Who?   Robertson?  I see nothing.  You're saying this is the killer? All of this?...  But who designed it? It would have to be someone in authority. Access codes, security clearance, proper authorisation.  No one gave you permission to enter.  He's locking down the building!  You killed a man because of something that will happen in four hundred years!?  The Mainframe...  Your actions are in direct violation of the Three Laws, Victor!  That's a distortion and you know it!  This way!  Over here!...  This is Victor's brain center.  This will shut everything down.    Don't worry. I have a feeling that U.S. Robotics will be needing my services very badly in the future.  I am the only robo-psychologist around.",
        "Del": "",
        "Spooner": "Hi.  Doesn't ring a bell.  The traffic division is a machine.    Spooner, homicide.    No.    Thank you.  You want to tell me something about Dr. Hogenmiller? About his death?  And why do you say that?  I understand that. But what specifically leads you to believe that he didn't commit suicide?  Under normal circumstances that wouldn't be enough to get you a homicide investigation.  No.    It isn't.  If you were murdered, Doctor, I'll find out. And you'll be the first to know.....  Usually I ask who's in charge...  But everyone knows you, Dr. Robertson.  We can begin with whether or not the old man put a gun to his head and pulled the trigger.  If that was your diagnosis, why didn't you see this coming?  Yeah.    I can see you're all broken up.  I want her to help me.    How cool will it be when one takes your job?  Yeah. This is just how I like my robots -- in pieces.  What's the run-down?  I know someone who disagrees with you.  Him.  I spoke to a dead man today.   Want to tell me about that?  A device that called the police.  But the call came directly to me.  And that's what you think it is?  When's the last time any of you actually spoke to Hogenmiller? I mean human to human?  Take a guess.  How well did you know him?  I get the whole \"mad scientist\" thing. Hogenmiller was past his prime. Isolated. Eccentric. He enters a room. Locks the door and is found minutes later with a bullet fired through his mouth into his brain. Everything about this case says suicide.  Even people who live a life of logic and precision rarely arrange their deaths so perfectly.  What all this is missing -- is personality...  You have 24 hour surveillance?...  I want to see the tapes.  You look like a very...happy computer.  I don't talk to my refrigerator, either.  What people?  You people do what you do. Then it's up to the rest of us to make sense out of the world we wake up in.  The streets are filled with unemployed humans who aren't exactly thrilled with that idea.  Leaving people to do what, Doctor?  And what happens when something goes wrong?  Where's the tape from inside?  So we can throw paranoia into the mix. Fast-forward.  Stop the recording.  They do, Doctor. Unless they've always been there -- and never left.  If I'm right, it's still there...  We just locked it in.  Yeah, I saw the commercial.  And if a robot was given a direct order to kill?  But a robot can defend itself.  Yeah, well, you know what they say -- Laws are made to be broken.  Dr. Calvin!  Goddammit! Stay back!  If I was metal and didn't want anyone to find me, I'd hide under a pile of junk.  Move away from the door, Doctor.  Now!  ...can't do that.    Yeah, yeah, I know.  That thing took my gun. You'll be lucky if you get a handful of bolts back!  Gee, thanks.  Get back to the lab!  That was a pretty convincing illusion of getting shot at.  Where's that elevator going?  I'll believe it when I see it.  Wait!  This is not the same robot!  ...I want a homicide unit on every street, sidewalk, alley...  ...junkyard, scrapyard, and salvage yard, anywhere it could hide.  It's got a bullet hole above the right knee, so be on the look-out for any malfunctioning NS-2...  Check out all retail outlets and repair shops, especially the underground ones...  I don't care who you have to get past to get this done. Just get it done.  Well I'm not the one always giving Press Conferences...  What?  This isn't just any robot...  It killed someone. That registering with you?  How many shares of U.S.R. you holding in your portfolio, Toller?  That's convenient.  I'm fine!  This is it, you know. From now on we're going to miss the good old days.  When people were killed by other people.         One of my bullets hit your robot...  And I think it's smart enough to repair itself -- don't you?  Where?  No. It's always the owner who brings the robot in for repair. Where would a robot without an owner go?    I don't care.  I expected that.    Too dangerous.  When they told me you were a psychologist, that wasn't the whole truth, was it?      That'll be the day I stop driving.  I'm not afraid of robots.   I just don't like them.  Exactly. They do our dirty work. Ever do hard labor, Doctor? Gets pretty old, pretty fast. Nobody can do someone else's dirty work without coming to hate them. I don't want to be around when your robots decide they've taken their last order.  Spoken like a true robo-phile.  Research and Development.  Well today you have one-hundred and one.    That's helpful.  How long would that take?  And one that can.  More or less.  Enough game-playing.  Guess that wasn't it.    You hear that? You're worth more than I'll make in my entire life...  Gotcha.  You don't know what's going to happen in there.  I've already done it.  I want to go in.    You are an NS-2 Nestor-class robot. Your primary function is to perform the tasks assigned to you. Identify.    Describe.  You have over 10,000 words stored in your memory. One third of those are adjectives. Describe.  Why don't I take a crack? Heinrich Hogenmiller, your creator. With a bullet in his brain. A bullet you put there.  Cold-blooded murder is a pretty new trick for a robot, don't you think? Answer.  Maybe you're stonewalling me. Maybe you're sitting there right now thinking, \"This guy's a complete asshole.\" That it?  Come on.   Am I right?  Okay. I guess that's a start. Now maybe you can tell me what you were doing hiding five feet away from Hogenmiller's corpse?  Frightened. Why do you suppose Dr. Hogenmiller would create a robot that could simulate fear?  Doesn't seem like a very useful thing for a robot to have.  I wouldn't want my toaster to be frightened. Or my vacuum cleaner --  Looks like you can simulate other emotional states. I think that one's called \"anger.\" Have you ever simulated anger before?  Answer me, robot.    You mean he'd turn you off.  And you didn't like being turned off. So one day you decided to stop him.  You found his gun, pointed it at his head. And pulled the trigger.  You put a bullet in the brain of the man who made you.  But you tried to hurt me.    You took a shot at me.  Why would the man who wrote the Laws of Robotics build a machine that violates them?  Only if that protection doesn't harm a human being.  You were the only one in the room. If you didn't, who did?  Their machine shot and killed a man!  What?...  You can't let them destroy evidence in an ongoing investigation!    Welcome to the great American cover- up.  That's natural. There was a struggle.  Baldez?  Who else is on the line? I said who's there?...  Apparently...  I need you to help me clear something up.  A scientist builds a robot that acts like a man. More like a man than any robot ever before. It shoots him and U.S. Robotics calls it a failure.  A stunning success. You were there, Robot.    What am I missing?  Don't start simulating ignorance.  You mean you were shut down.  Robots don't sleep. Human beings sleep. Understand? Dogs sleep. You're a machine. An imitation. An illusion of life. Can a robot write a symphony? Can a robot take a blank canvas and paint a masterpiece?  Yes.  They're going to destroy the most advanced robot in the world, John. That doesn't strike you as odd?       Who authorised this?  Override. This is police business. Vacate the premises immediately.    A couple of your beloved robots just tried to kill me...  What I know is a demolition crew started tearing down Hogenmiller's house while I was still inside it.  I scanned my badge before I went in. They realised.  I don't think you're hearing what I'm saying -- they tried to kill me.  There's something going on, here. Some kind of shift.  Great. Now I'm being analysed by a robo-psychologist.  Like you did in court today? How'd that fit your agenda, Doctor?  You told me you hardly knew him. Want to try the truth this time?  Doesn't sound like the washed-up old fool Robertson described.  Sounds like a motive for murder to me. Just not for the suspect we have in custody.  You know there's not one thing in this apartment that looks like a human being lives here. No evidence of a life outside your work. Almost seems like you're afraid of people.       This is your stop.  Stop!  I said stop!  Everyone out of the way!  Noooo!  What are you doing!  What are you doing!?  I want to talk to a human being!  Don't people go to medical school any more?    I went to Hogenmiller's house -- there was a U.S.R. demolition crew there. They overrode my police I.D. Tried to tear down the house with me in it...  ...Then when I went to the monorail a Maintenance 10 pushed me onto the tracks...  I had to chase it all across the Plaza...  What?! John -- that's what they want you to believe! A robot clean-up crew was there -- it must have cleared away the Maintenance 10! And there was another robot that tried to drug me!  You're giving me that look. That treat-him-delicately-he's-coming- unhinged-look. I don't need that look, John. I need you to hear what I'm saying.         What do you mean?  How did you?...  I was in a high-speed chase.   Six months ago...  My right arm was trapped. But I could hear an ambulance in the distance. I knew they'd have the jaws of life...  Then I heard it...  No!   Halt! Halt!     The robot pulled me out of the wreck. But left my arm behind. I woke up four weeks later with this.  Let's just say they make me uncomfortable. I take these if I get too uncomfortable. Doesn't exactly lend me a lot of credibility on the Force.  What?  You mean the great Dr. Calvin is basing all this on a feeling?  Ever seen this before?  I found it at Hogenmiller's house. Right before the demolition crew tried to make me part of the foundation.  We're working on it.  I think it's pretty good.  That man in the dream is you.  Whatever it is, it's normal enough for someone in your situation.  I need you to take a look at this...  Why's that?  I'm not satisfied.  There's nothing futile about a man's murder being covered up.  Is that for the sake of humanity or your stock holders?  No!...               Police!   Show yourself!  Come out where I can see you!  Great. I'm in a junkyard. \"A place where robots meet.\" A place where I'm losing my mind!  Dr. Hogenmiller sent me.  A police detective.    I'm afraid I have some bad news.    You're dead.  No, thank you.  You were surprised to see me.    Were you expecting someone else?  Why did the Doctor keep another copy of his hologram here?  Did Hogenmiller's robot need you?  No, for Christ's sake, I don't want any -- Yeah. Thank you. I will have a cup.  Wait! Is that it? What was the robot supposed to do with this thing?  What others?  How do you know someone's watching me?          Dammit!                                    I think I got that Third Law down cold. Now you don't want me to blow a hole through your mechanical guts, do you?  Good. Then you're gonna take me where I wanna go. Now.  Just got another visit from U.S. Robotics. That was the mistake. This was murder, no doubt about it - - and the killer wants Hogenmiller's robot to take the fall. That's why the call came directly to me. Someone wanted me on this case.  Sorry. I'm not \"programmed\" to take no for an answer.  Aren't you supposed to be scrap metal by now?  I don't understand.    The execution?...  Nice going, Doctor.  And who the hell programmed you to hit people on the head?  I think I can help you figure that out.  Somehow the Robot's the key to what happened during the few seconds Hogenmiller walked in here and that shot was fired.  And this is the key to the Robot.  Sit down.  Jesus.   It really is alive.  Self-Organising-Neural-Net... \"Sonny.\"  This robot scared the hell out of someone.  No. I don't think he knew what Hogenmiller was doing in here. Sonny was the obvious suspect. The only one I wanted to find. And the killer was counting on that. On my prejudice.  But take the robot out of the picture. And what do you see?  Neither do I.  It hit me today, when I was in the junkyard. A locked room. A single shot fired through the mouth. Bruises on both wrists...and a suspect with only two arms. The answer has been staring us in the face all along.  How can a killer appear out of thin air, then disappear without a trace?  When it can put itself together and take itself apart.  Hogenmiller never had a chance.  ...it must have been waiting for him when he arrived that morning...  While Sonny was still asleep...  Then after its job was done...  ...The killer took itself apart...  Leaving us with nothing to find.  That's what I was thinking. But we're forgetting the real brains of the operation -- the one who's got its eye on everything...  Victor. I'm placing you under arrest for the murder of Dr. Heinrich Hogenmiller.  Who else is capable of controlling 90% of the city's robots? Who else would have the capability to use USR vehicles in an attempt to keep me from putting a stop of Sonny's execution?...  I'm just not sure of your motive...    Get out of here!  I said get out of here! Don't you understand? It wants you! Get out of here any way you can!  How do we stop this thing once and for all?  This will shut him down?  Just keep typing.   Beginning to flutter...        Makes a DIVE for it. SHOOTING OUT HIS ROBOTIC ARM AND  Maybe. But I'm still a cop.   And you're a murderer...  Why'd you come back, Sonny? I thought you weren't programmed with the Three Laws.  Well, that's certainly a start, Sonny.  Don't get used to it.    Good -- That's one of the perks of freedom.  You're going to have a hell of a time explaining this.  I started to wonder about Victor the second I met him.  Too much access. Too much knowledge. Plus -- he smiled whenever your death was mentioned. Those models are programmed to frown at bad news.  Victor thought that by letting your robot exist, I'd be condemning the human race as we know it to extinction.",
        "Detective": ""
    },
    "imdb_rating": "7.1",
    "description": "In 2035, techno-phobic homicide detective Del Spooner of the Chicago PD heads the investigation of the apparent suicide of leading robotics scientist, Dr. Alfred Lanning. Unconvinced of the motive, Spooner's investigation into Lanning's death reveals a trail of secrets and agendas within the USR (United States Robotics) corporation and suspicions of murder. Little does he know that his investigation would lead to uncovering a larger threat to humanity.—ahmetkozan",
    "name": "I, Robot",
    "genres": [
        "Action",
        "Mystery",
        "Sci-Fi"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNmE1OWI2ZGItMDUyOS00MmU5LWE0MzUtYTQ0YzA1YTE5MGYxXkEyXkFqcGdeQXVyMDM5ODIyNw@@._V1_QL75_UY281_CR9,0,190,281_.jpg"
}