{
    "filename": "Indiana-Jones-and-the-Temple-of-Doom_script.txt",
    "imdb_id": "tt0087469",
    "imdb_url": "https://www.imdb.com/title/tt0087469",
    "characters": [
        "Indiana Jones",
        "Kao Kan",
        "Chinese Pilot",
        "Short Round (as Ke Huy Quan)",
        "Mola Ram",
        "Captain Blumburtt",
        "Willie Scott",
        "Wu Han",
        "Chen",
        "Maitre d'",
        "Lao Che",
        "Weber",
        "Chinese Co-Pilot",
        "Chief Henchman (as Philip Tann)",
        "Chattar Lal (as Rushan Seth)"
    ],
    "dialogues": {
        "Indiana": "Lao She.  Wah hung how, nee nah?  Wah hwey hung jing chee jah loo nee kao soo wah shu shu.  I don't like to show off.  Sure, I found him.  Then last night I had a little trouble. Somebody tried to slit my throat.  It was dark, but I think one of your sons tried to get Nurhachi without paying for him.  Next time I'll cut off more than his finger.  As I recall the deal was consid- erably more.  Put the gun away, sonny.  Now I suggest you pay me what you promised -- or your girlfriend here is going to be squealing a new tune.  Try again Lao -- the deal was more.  Bingo...you see, Lao, with a but of persuasion, even you can be an honest fellow.  What's that?  Inside are the remains of Nur- hachi -- the first Emperor of the Manchu Dynasty.  Now what about the antidote, Lao.  Let go of her, Lao.  And give me the antidote.    No, Wu Han's an old friend I brought along. So, the game's not over. Put the antidote on the table, Lao.  Wu Han  --  listen to me  --  I'm going to get you out of here.  The antidote -- !  Look out, damn it, I need that antidote!  Hey,doll!  Don't move!    If I wasn't dying, I'd kill her...  Step on it, Short Round!  Relax, I've been giving him lessons.  Don't get your hopes up -- where's the antidote?  Poison never agrees with me. Pull a right, Short Round, and head for the Wang Poo bridge!  Somehow I think you've got bigger problems.  There, Shorty!  Through the tunnel!  The airport...No, look out, Short Round!  Left, left!      Siam.  Thanks, Weber.  Since I was nice enough to let you tag along, why don't you give your mouth a rest?  Okay, doll?  Oh yeah?    No. Do you?    Get over here, damn it!  Short Round, come on, grab onto me tight!  Okay, Shorty.  You all right?  India...  He told me they knew I was coming here.  The old man saw it in a dream.  He said that's whey they were at river -- they were waiting for the plane to fall down.  That's more food than these people eat in a week. They're starving, too...  We'd appreciate that.  This was an unexpected detour.  We'll have to go to Delhi now and find a flight west.  I'm a professor.  I have to re- turn to the university.  Can you give us a guide to take us to Delhi?  Thank you.    Hasn't the Pankot palace been de- serted since the Mutiny of 1857?  I don't understand.  What's hap- pened here?  What evil?  It's a sacred stone in a shine that's supposed to protect a village.    It's just superstition, Shorty. Like a ghost story.  Was the stone very smooth? It was probably brought here from a sacred river.  And it had three lines painted across it? The lines represent the three levels of the universe.  I've seen stones like the one you lost.  But why would the Maharajah take this sacred stone?          I'm sorry, I don't know how I can help you here.  The English authorities who con- trol this area are the only ones who can help you.  I have friends in Delhi and I will make sure they investigate this...  It was destined that I came here -- and the future cannot be changed...      Sankara...  Damn it , Willie, get on -- we've got to move out!  Nope, you got a little surprise over there, Shorty.  All right, let's go.  I want to get to Pankot before tomorrow night.  Those aren't birds -- those are giant bats.  I think maybe we'll camp here.  Hey, Willie -- I think you better get out now.  Me seduce you?  Honey, you're the one who took your clothes off. I just came over to remind you that you never know what else might be in the water.  Don't worry, I'm coming in!  What is it?  A what...?  Uh, listen -- Willie -- I got a better idea.  First of all -- don't panic!  Don't let it pull you deeper!  Don't let it curl around you!  Listen, Willie.  Do exactly what I tell you now.  Can you move your arm?  Okay, I want you to lift your hand -- and pet the snake.  Yes, stroke it right along the maxillary and precaudal verte- brae.  Pet it on the head!  Go on, pet it!  Keep stroking it!  What's happening?  That's good  -- you're doing fine.  See -- I got you out...  (looking at  I met Short Round when he tried to pick my pocket.  Shorty's family was killed when they bombed Shanghai.  He was living on the streets.  By the way, how'd you end up in Shanghai?  What about the future?  I'd like to find one of those myself.  Yeah, but he's got to be dead and buried for a couple of thousand years. Fortune and glory...  Maybe...  Something that kid gave me last night.  It's a piece of an old manuscript.  The drawing shows a priest named Sankara who lived centuries ago.  It's Sanskrit.  It tells the story of Sankara climbing Mt. Kalisa where he met the Hindu god Shiva.  Legend says he told Sankara to go forth and combat evil.  To do that he gave him five sacred stones that had magical powers.  It could be.  I think you should sleep closer. I meant for safety.  Couldn't keep away, huh?    Honey, I knew you'd be the first one to give in...  You're going to start something I'm going to have to finish. Okay, doll, you asked for it.  That's it.  Pankot Palace.  Just a statue.  He said he couldn't take us any farther.  He has to go sell the elephants.  Any more complaints?  It doesn't feel like there's been any permanent damage.  Hello?......    We'd appreciate it if the Mahara- jah would let us stay tonight. We'll be on out way in the morn- ing.  You look like a princess.    No.  But I am interested in the occult.  And this is a krtya.  It's like the voodoo dolls of West Africa.  The kryta represents your enemy -- and gives you complete power over him.  You think so?  You're hanging on better here than you did in America.  The Prime Minister doesn't seem that naive.  Maybe he likes older women.  Cheer up, you lost your prince, but dinner's on the way.  We are honored to be here.  I had a question, Mr. Prime Mini- ster.  I was examining some of the Maharajah's artifacts.  Yes, very fine.  But not all of the pieces look old.  Some were carved recently and look like images used by the Thuggees to worship the god- des Kali.  I suppose stories of the Thuggees die hard.  Well, I don't know... we came here from a small village and the peas- ants there told us that the Pankot Palace was growing powerful again -- becuase of some ancient evil.    You know the villagers also claimed that this palace stole something from them.  Sorry, I thought we were just talking about folklore.  Something magical.  A sacred rock.  When they lost this rock their fields and animals dies.  They also said their children were taken from them.      That was a misunderstanding.    Even if they were trying to scare us away, a devout Hindu would never touch meat. Makes you wonder what these people are...  We're guests here, Shorty.  You wish is my command, your Highness.  Okay, Short Round, let go of it.  The Turks say that a whip can be an enemy even to its owner.  If you get some rope, it'll be easier to learn with, your Highness. Now, I think we'll say goodnight.  You don't like him do you?  No.  He was afraid of you.  He knows a tough  guy when he sees one.  I better see how Willie is.  I brought you something.  No -- real food.      And mating customs...  You're taling to an authority in that area.  You want me so bad, why don't you invite me?  I think you're too used to get- ting you own way, Willie...  Don't catch cold.  You're dreaming, Willie.  You want to make it real, just knock on my door.        Five minutes... fat chance.           Okay, Shorty ... see you in the morning...I'm going to have a little -- word with Willie.               It's okay, it's over -- go turn off the fan.  This a cheap trick to get me over here?  What -- the bug?  Gee, I wouldn't want to touch an ugly critter like that!    *(He reads aloud an inscription in Sanskrit).    *(He repeats aloud the inscrip- tion also written on the cloth  Lock your door and don't leave until we get back.  You're right, there's something all over the floor...  We'll have to crawl.  There's a chamber here.  Come on --  Damn!  Yes, we're in here...  Uh -- Willie?! Willie, you better get down here!  Willie, come here!  Hurry up, we're in trouble!!  Willie, damn it!  Get down here,   Move, Willie!  Faster!  Willie, open the door!  GET US  GET US OUT!  Willie, shut up and listen!  There's got to be a ful- crum release!  Look around!  A fulcrum release lever!  Look around, Willie!  There's got to be a liever hidden somewhere!  Come on, you can do it!  That's it -- the release lever -- look inside!  Reach inside!  The lever!  Willie, do it!  NOW!  Willie!  Not that one!  We had enought of that one, thank you...  It's a Thuggee ceremony.  They're whorshipping Kali, the goddess of Death and Destruction.  No...the heart's still beating!  Quiet!  The village knew their rock was magic -- but they didn't know it was one of the lost Sankara Stones...  Legend says that when the stones are brought together the diamonds inside of them will glow.  Okay -- now listen -- you wait here and keep quiet.  Shorty, keep an eye on her.  I'm going down.  I'm not leaving without those stones.    Why?  What is that?    Two are still missing.  That's what you've got these chil- dren -- these slaves digging for?  Nobody can say you don't have a vivid imagination.    It's okay.  You're all right now.  Hey, I thought you were supposed to be a real tropper.  Willie?  You've got to go to sleep now.  I don't blame you... this hasn't been what you'd call a fun vaca- tion...  I've spent by life crawling around in caves and tunnels -- I shouldn't have let somebody like Willie go in there with me.  When she saw the insects she passed out cold.  I carried her back to her room.  She was sleeping when I re-entered the tunnel to look around.  Then she must have run out of the room and you found her.  Nothing.  Just a dead end.  That tunnel's been deserted for years.  Thanks, but I don't think Willie is ready to travel yet.  Yes.  Yes, they believe you.  No... they won't kill me.  You won't lose me, Willie...  No!  I've found it -- you can't -- Kali knows!  -- been too many lies -- there's no god's heaven -- just -- the horror! I've seen it -- life preying on life!  -- rivers -- destroying mountains -- a comet in space -- exploding! Aaahh! -- the screams -- pitiful people -- their pain -- the hate -- and greed -- always greed!  -- but I've found -- Kali's touch! Death -- no more lies -- the death I've been searching for! Quit crying!  She can hear you -- Kali knows fear -- don't you under- stand -- Kali is freedom!  Yes, I understand.  Kali Ma protects us now and for- ever, and we must pledge our devotion by worshipping her with an offering of flesh and blood!  No!  Give him to me!  Come on, quick!  We're going to get them out of here -- !  And then we're going to get these out of here -- ! And somehow I'm going to see this place destroyed.  Ah, sir?  Excuse me --  Listen, I'm from the union and I'd like to talk about the working conditions here.  Could you step inside a minute?  No, wait!  There's got to be another way out.  Those empty cars have got to go out of the mines.  Come on, let's see if we can catch a ride...  Okay, Shorty -- go!  Go!  We've got to get across to the empty cars.  Wait here until I signal you.  Come on!  Come one, what's wrong?  I see the problem...  Come here and take the brake!  Slow on the curves or we'll fly off the tracks!  Let up on the brake!  Let her go!  Our only chance is outrunning them!  Get over on the other side!  One down, one to go!  Yeah -- this time you're gonna help!  Okay  -- one -- two -- NOW!  Okay, Shorty, hit the brakes!  Grab onto me -- I'm going to try and slow us down from underneath!  What's wrong?  Ouch...  There!  Dive!  Lucky I found a short cut.  Look, there's a light at the end of the tunnel...  Willie -- the bridge!  Climb up to the bridge!  Let my friends go!  That's far enough!  You want the stones, let them go and call off your guards!  Then I guess we're all going to take a big dive!  Mola Ram -- you're about to meet Kali -- in Hell!  You're betrayed Shiva. *(He re- peats in Sanskrit Sankara's warn- ing  *(He repeats Sankara's warning  Not quite.  The last Sankara Stone.  Yes, I've seen its power  The last Sankara Stone.    It's still a long way to Delhi. Who knows what might happen.",
        "Jones": "",
        "Kao": "",
        "Kan": "",
        "Chinese": "",
        "Pilot": "Good lord!  Dive for the clouds!  Dive!  They hit a fuel line!  Reduce speed -- get everyone out of the plane!  Please to remain calm.  We start passing out parachutes now --  Put it on!  What's wrong with you?  You've got to jump!",
        "Mola": "You were caught trying to steal the Sankara Stones.  There were five stones in the beginning.  Over the centuries they were dispersed by wars, sold off by thieves like you...  No.  They are here -- somewhere. A century ago when the British raided this temple and butchered my people, a loyal priest his the last two stones down here in the catacombs.  They dig for the gems to support our cause.  They also search for the last two stones.  Soon we will have all five Sankara Stones and the Thuggees will be all powerful!  You do not believe me?  You will, Dr. Jones.  You will become a true believer.  Your Highness will witness the thief's conversion.  Hold him!  The British in India will be slaughtered.  Then we will over- run the Moslems and force their \"Allah\" to bow to Kali.  And then the Hebrew God will fall and finally the Christian God will be cast down and forgotten.  Soon Kali Ma will rule the world!  They've stolen the Sankara Stones -- they must be stopped!  You are in no position to give orders, Dr. Jones.  Impressive, Dr. Jones. But I don't believe you would kill yourself!  Your friends will die with you!  Give me the stones!  No, the stones are mine!",
        "Ram": "You were caught trying to steal the Sankara Stones.  There were five stones in the beginning.  Over the centuries they were dispersed by wars, sold off by thieves like you...  No.  They are here -- somewhere. A century ago when the British raided this temple and butchered my people, a loyal priest his the last two stones down here in the catacombs.  They dig for the gems to support our cause.  They also search for the last two stones.  Soon we will have all five Sankara Stones and the Thuggees will be all powerful!  You do not believe me?  You will, Dr. Jones.  You will become a true believer.  Your Highness will witness the thief's conversion.  Hold him!  The British in India will be slaughtered.  Then we will over- run the Moslems and force their \"Allah\" to bow to Kali.  And then the Hebrew God will fall and finally the Christian God will be cast down and forgotten.  Soon Kali Ma will rule the world!  They've stolen the Sankara Stones -- they must be stopped!  You are in no position to give orders, Dr. Jones.  Impressive, Dr. Jones. But I don't believe you would kill yourself!  Your friends will die with you!  Give me the stones!  No, the stones are mine!",
        "Captain": "",
        "Blumburtt": "That God all that mumbo jumbo rubbish is disappearing.  Of course.  Admittedly, it's taken time.  Britian's controlled India for almost two hundred eyars now.    No, he's a very shrewd old boy. Power behind the throne and all that.  He actually runs this whole province.  I believe we're being called to dinner.  Of course.  The Thuggees were an obscenity that worshipped Kali with human sacrifices.  The Brit- ish Army wiped them out about the time of the Mutiny of 1857.  I'm not worried, Prime Minister, just interested.    Rather bizarre menu, woundn't you say?    What?  Who?  Miss Scott panicked?  Did you discover anything in that tunnel, Dr. Jones?  Well, Mr. Prime Minister, my re- port will duly note that we found nothing unusual here in Pankot.",
        "Willie": "Well -- I thought archaeologists were always funny little men searching for their mummies -- Aaahhh!  Look at this!  He put a hole in my dress from Paris!    So, what's the big deal?  Let me see it --  Ow, you're hurting me, you miser- able little hood!    Who cares?  Where's that diamond!    Aw nuts!  For crying out loud, a kid's driv- ing the car?!  Listen, we just met for crissake! I'm not that kind of gril!  You don't look very good.  Look at what you've done to me! I'm a mess!  My lipstick's smeared, I broke two nails, I've got an aw- ful run in my stocking -- !  What're we going to do?!  Where're we going?!  I'll take the extra ticket. Where's this plane going anyway?  Siam?  But I'm not dressed for Siam...  So, what're you supposed to be, a lion tamer?  I'm freezing.  What do you mean, tag along?  From the minute you walked into that nightclub, you haven't been able to keep your eyes off me.  Wake up!  It's the drug he drank to stop the poison --  You got to be kidding!  No!  No, I can't!  Wait -- who's flying the plane?!  Nobody's flying the plane ...  Give me that parachute, I changed my mind --  There's nobody flying the plane!  You know how to fly?  You got it!  Are you crazy, a lift raft?!  We're not sinking, we're crashing!  Wait for me!  No... I'm not cut out for the kind of life you lead. Oh no...I ripped my dress.  Where are we anyway?  Holy cow -- India?  How do you know we're in --    What do you mean -- how?  Dream -- nightmare is more like it.      I'm sorry, I -- here, please.  Took what?  I don't understand how losing one rock could destroy this village. Is it really powerful?  Their children?  What'd he say now?  Whoa!  Easy now -- nice elephant...    Figures...  Pankot?!  I thought we were going to Delhi!  Hey, wait a minute! Can't somebody take me to Delhi?! I don't want to go to Pankot!      What're you complaining about, this is expensive stuff!  Those are very big bird.  They must be pretty dumb to drink that awful-looking water.  Stark naked?  You wish... If you're trying to seduce me, Dr. Jones, this is a very primitive approach.  Somehow I feel safer in here.  Indy!  Help me!  A snake!   Hurry, help me out of here! What're you waiting for?!  What?!  It's got me !  Indy, help me!  It's pulling me deeper!  It's curling around me!  Damn it, stop talking and do something!  What's wrong?!  Indy please help me!  What?!  Just one arm!    Oh -- my -- god -- it's going to crush me!  It's starting to let go!  It's letting fo.  I think it's -- I think it's going to sleep!  Thanks for nothing!  I hate snakes!  Where'd you find your little body- guard?    All these fires -- you expecting more snakes, Dr. Jones?  Well, when my nightclub career was run over by the Depression, some pinhead convinced me that \"a girl could go places in the Orient...\" So, look where I got.  Oh, that's easy -- I'm going to latch onto a good-looking, in- credibly rich prince.    Is that what you're hoping to find at this palace, Dr. Jones?  What's that?  What does the writing say?          Did you see it?!  It was one of those bats! God, what else is out there...?!  Just try and control yourself.  Why are we stopping here?  What's the guide talking about? He hasn't said a word the whole trip.  He's afraid of something.  You mean we have to walk the rest of the way?  -- shot at, fallen out of a plane, nearly drowned, squashed by a snake, attacked by a bat -- I smell like an elephant! I tell you I'm not going to make it!      Hard to believe, isn't it...?    You should have been there...  Is that him?    Oh -- good.  And maybe the pres- ent Marahajah is a little younger? And thinner?  Dinner?  And with a prince?!  My luck is changing.  But look at me -- my god, I've to to get ready!  It's sort of like being in heaven.    Listen, Mr. Lal, what do you call the Maharajah's  wife?    I think this Maharajah is swim- ming in money.  Maybe coming here wasn't such a bad idea.  Finally!  That's the Maharajah -- that kid?!  I've never been so hungry in my life...    Suddenly I'm not so hungry...      I'm going to puke in it...  So you have something, you know, simple -- like soup or something?  I wanna go home...    Oh, it is real food...it's beautiful.  You're nice.  Listen, I'm taking applications -- how'd you like to be my palace slave?  Yeah -- and nothing else. That shock you?  You mean like love rituals...  Primitive sexual practices?  You're dying to come into my room, aren't you?  Too proud to admit you're crazy about me, Dr. Jones?    Dr. Jones -- ?  Five minutes... you'll be back over here in five minutes...                He's not coming...I can't be- lieve it...  Well... No!  I'm not going over there...  Sleep tight, Dr. Jones! I could've been your greatest ad- venture...        No -- don't you see -- crawling --  Get -- the -- bug -- off!  Oh no -- oh no!!  Please -- oh please, I'm going to die!  Get it off!  What did I do to deserve this trip?!  I'm packing!  I'm getting out of here right now tonight!  I don't care if I have to walk to Delhi, I'm -- hey!  Wait a minute!  What're you -- where're you going?!  Hey -- where are you?!     Indiana Jones?!  Are you in there?!          Oh hell -- I bet I get all dirty again!    I'm coming, what's the rush?! Ohh!  What's that?!  There's stuff all over the floor!  I can't see a thing!  It's all wet and icky!  Aaahh -- things are moving!!     A what?!  I can't find any lever!  Help me Indy!  There's a hole!  I found a square hole!  I am -- it looks horrible!  I can't, Indy!  I can't!  Oh God, it's soft -- it's moving!  Get is off me -- get it off!  You left me out there!  What in the hell were you doing in here?! I want to leave this place right now!!  What is it...?  Oh my God!  He ripped out his -- he killed him!  Let's go!  Let's get out of here!  Diamonds...?  Wait -- what're you doing?  Down?  Down there?!  Are you crazy --!  You're gonna get killed chasing after your damn fortune and glory!  Oh hell, where's he going?  What're you -- ?  Keep your paws off, letch!      Oh my God, you scared me!  Listen, you've got to help.  We found this tunnel --  No -- you can't go!  Something aw- ful's happened.  They've got Short Round and I think Indy's been --  We found a tennel that leads to a temple below the palace!  Please, come with me, I'll show you!  I'm afraid they'll kill them!  We saw horrible things down there -- they had a human sacrifice and they ripped a man's heart out!  It's some kind of cult!  And they've got the sacred stones that Indy was searching for.  What're you talking about -- I'm not a dope fiend!  I saw it!  I'll show you!     Oh, Indy, you got away!  Tell them what happened, they won't believe me --  They think I'm insane.  Tell them I'm not, Indy.  Please -- help me ...           Indy?  Did you walk to them?  So now they believe me.  Then they'll send the soldiers down into the temple...  I was scared to death last night when I thought they were going to kill you.    Indy!  Help me!  Indy?!    No -- no!  Look out -- !  What're we going to do?  What're we going to do?!  I can't!  What happened?  What's wrong with him?  I got one!  Indy, I got one!  Indy, look out!  Get down here, Shorty!  I got us a ride!  Come on, let's see hoe hand your head is!  I don't appreciate being cooked like a french fry!  What above the curves?!  What're you doing?!  We're going too fast!!  Anymore ideas...?  Oh no!  I'm okay -- I'm fine -- I love to flirt with death...  What's that?...Indy?!  (frozen in  Some short cut!  Indy -- looks out behind you!  I guess Mola Ram got what he wanted.  And the diamond hidden inside...  It's a real miracle.  And they don't even know what it really is.  You didn't do so well yourself. Finding that stone could've got- ten you all the fortune and glory you were talking about.  Oh no, I'm finding a native guide who knows the way.  No more de- tours for me, thank you Dr. Jones.  If you think I'm going to Delhi or anyplace else with you, after all the trouble you've gotten me into...",
        "Scott": "",
        "Wu": "Not this time, my friend... I followed you on many adventures -- but into the great Unknown Mystery, I go first, Indy...",
        "Han": "Not this time, my friend... I followed you on many adventures -- but into the great Unknown Mystery, I go first, Indy...       Looks delicious!  Ah, dessert!  Chilled monkey brains!",
        "Chen": "",
        "Maitre": "",
        "d'": "",
        "Lao": "Dr. Jones.  Nee chin lie how ma?  You never told me you spoke my language, Dr. Jones.  For this special occasion, I ordered champagne and caviar.  So, it is true, Dr. Jones?  you found Nurhachi?  You have insulted my son.  Dr. Jones -- I want Nurhachi.  This is Willie Scott. And this is Indiana Jones, the famous archaeologist.  Dr. Jones found Nurhachi for me and is about to deliver him -- now.  Sit down!  To your health, Dr. Jones.  A bonus, Dr. Jones.  That is poison.  You just drank the rest of it.  There is an antidote for this poison.  You give me Nurhachi -- I give you the antidote.  The poison works fast, Dr. Jones. Where is Nurhachi?    You fool!  Don't be sad, Dr. Jones -- you will soon join him.",
        "Che": "",
        "Weber": "No, no, they're all right! Let them through please.  Dr. Jones, this is positively the last time our airline can hold a plane for you.  Now you must hurry!"
    },
    "imdb_rating": "7.5",
    "description": "Indiana Jones teams up with a nightclub singer named Wilhelmina \"Willie\" Scott and a twelve-year-old Chinese boy named Short Round. They end up in a small distressed village in India, where the people believe that evil spirits have taken all their children away after a sacred precious stone was stolen. They also discover the great mysterious terror surrounding a booby-trapped temple known as the Temple of Doom. Thuggee is beginning to attempt to rise once more, believing that with the power of all five Sankara stones they can rule the world. It's all up to Indiana to put an end to the Thuggee campaign, rescue the lost children, win the girl and conquer the Temple of Doom.—Anthony Pereyra <hypersonic91@yahoo.com>",
    "name": "Indiana Jones and the Temple of Doom",
    "genres": [
        "Action",
        "Adventure"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMzc0MWJhNTUtNWI0Yy00NTk4LWJkY2ItNDI4OTZmZjNlMTMwXkEyXkFqcGdeQXVyMjI0NTA4NzA@._V1_QL75_UY281_CR6,0,190,281_.jpg"
}