{
    "filename": "Insomnia_script.txt",
    "imdb_id": "tt0278504",
    "imdb_url": "https://www.imdb.com/title/tt0278504",
    "characters": [
        "Rich",
        "Fred Duggar",
        "Kay Connell (as Crystal Lowe)",
        "Coroner",
        "Francis",
        "Mrs. Connell",
        "Officer #2",
        "Hap Eckhart",
        "Rachel Clement",
        "Farrell",
        "Will Dormer",
        "Officer #1",
        "Pilot",
        "Chief Nyback",
        "Ellie Burr"
    ],
    "dialogues": {
        "Rich": "What do you mean, you can't believe it?  And remember when he did all those donut holes that one summer?  The white nights been hard on you?  Well no wonder.  In the winter there's no sunlight for five straight months.  Pretty cool.  Get a hobby, will ya?",
        "Fred": "Helping?  Suppose you want to see the body.  We can walk from here.  Ellie!  Go type something!  No.  Like I said, no.  We know about those things up here.  She left the party early.  Friends said she had a fight with her boyfriend and stormed out.  Around twelve-thirty.  Randy Stetz.  Her boyfriend.  We've questioned him, searched his place. Didn't find anything.  Has her books in it.  I'll stick it in the evidence locker...  Why are we taking it back?  What are you doing here?  Nothing.                Nothing.    He's bolting!  Put that thing away!  Farrell's down!...  Dormer...  Dormer!  He's gone.  Dormer.  Still no sign of the bullet that went through Farrell.  Partner or no partner.  That guy's a prick.  Make sure they're set to channel 6...  You don't think they should start further back?         They found Farrell's bullet.  Says it looks like a 357.  After the autopsy Rich can drive 'em both to the lab in Anchorage.  Have a murder weapon by morning.  That is, if it's alright with you.  Lots of moose.  I'll call him now.  This isn't Seattle, Detective.  We don't have copies. This is the only one.  Dormer...     We should go say hello to Mrs. Connell.  Forget your pager?  I beeped you over two hours ago.  Got a fax from the lab.  Murder weapon was a 357 Ruger.  And something else that might interest you.  Remember this?  One of the paperbacks we found in Kay Connell's knapsack.  Mrs. Connell found this copy in the house. It's signed.  Personally.  This is a local writer.  Kay had all his books.  I think we should check it out.  You were acquainted with the deceased, Kay Connell?  In what manner?  Where you signed this?  What happened at that signing?  Did she?  We understand, Mr. Byrd. You want to sit down, Detective?  How do you mean?  Randy Stetz?  Mr. Byrd.  Anything you can tell us could help out with this case.  Are you sure about that?    Margaret!  Get Judge Biggs on the phone! I'll get another warrant for Stetz's place.  That's it.  Let's bag it.  Randy...  C'mon, Randy.  You look like shit, cowboy.  Looks like we can wrap this one up.  We're getting together for a couple of beers later on.  Might not be the Seattle thing to do.  But you're welcome to come.  Didn't you grow up with him?  Just a bad seed.  What Detective Dormer needs is a little shut-eye.  My people are from Barrow.  Way up north.  Like being swallowed up in a black hole.  Nancy Drew!  Pull up a seat!  Something's on Nancy's mind.  If Spencer's not too drunk to fly.",
        "Duggar": "",
        "Coroner": "Did a fundascopic examination and found papilledema and petechiae of the retina.  Clear cause of death was herniation of the brain stem due to intracerebral hemorrhage.  Beaten to death.  Superficial.  None.  She was a nice girl.  Played flute with my granddaughter.  Detective.  Thought you were sending one of your lackeys.  It's different when you know them, isn't it? Just sign over there and she's all yours.  Your partner didn't suffer much...  Maybe for a minute or two.  Just enough time to reflect.  You're looking a little green, Detective.",
        "Francis": "What?  C'mon, Ellie.  What's it matter?  Ow.  Ellie!  Think I found something!  He was an asshole.  He used to pick fights at the gas station.  They don't have titanium shades over at the Pioneer.  You lose all sense of time.  You hear what happened, Ellie?  Let it go, Ell.  We got the bad guy.",
        "Mrs.": "I haven't tidied up, since Fred told me not to touch anything.  I don't believe in keeping a child's room like a shrine.",
        "Connell": "I haven't tidied up, since Fred told me not to touch anything.     I don't believe in keeping a child's room like a shrine.",
        "Officer": "We did the interviews with all the nearby houses like you asked.    Found something.",
        "#2": "",
        "Hap": "Jesus.  Just look at all that.  I thought we had a population problem. Everyone should just move up here. Just look at it, Will.  Nothing wrong with smelling the roses.  This ought to be interesting.  Hey, Charlie.  Eight years.  \"2nd prize Great Kodiak Salmon Catch.\"  They're all over us, Charlie.  I.A.'s calling themselves the \"Corruption Task Force.\"  Can you believe that? Trying to root out any mistakes or \"oversights\" any other Detectives may have made over the years.  They're turning it into a witch hunt.  Something on the news about it practically every night.  Beaten to death.  Even the best make mistakes.  Lower forty-eight?  Oh?  And how's that?  Me.  See you have the same decor as my room.  Same view, too. I've been watching that tugboat for the last half hour.  So small, pulling all that weight. We have to talk, Will.  You know what about.  When's that, a week?  Two weeks?... We have to figure out a plan of action now.  To do nothing.  Dammit, Will.  Warfield had me locked up in his office again for five hours yesterday.  Five hours.  Asking all kinds of questions...  But he's zeroing in on me.  On us. Everyone's talking about it.  Well, I gotta tell you.  With a wife, three kids, and a pension plan in the balance, it's rattling hard.    You know I remember that.  Maybe not.  We could talk to Buck...  Cut some kind of a deal.  I heard that's what Flynn's doing...  Goddammit, Will.  You grab on to something and you don't let it go.  I don't know if it's because you think it's the right thing to do or because your pride won't let you do anything else.  I can't tell any more. But I can tell you one thing.  I'm getting too old for this cowboy cop stuff.  Breaking the rules.  Cleaning up messes.  We're a dying breed, Will. You're a dying breed.  I.A., the D.A., all those reporters - they don't care what you did at Leland Street seven years ago.  They don't care that you've made this your life.  They don't care about getting the bad guy...  They're watching us, Will.  Like it or not.  They're watching us.  What are we thinking?  You know smoking stunts your growth.    At least there's variety.  Will?  I think, I think I'm gonna talk to Buck when we get back to Seattle.  I wish I could stick it out like you.  I just, with Trish and the kids...  I'm thinking I could get off with probation.  Keep half my pension.  That's all I want.  You don't have to be involved, Will.  Hey - you do everything around here?  What about prints?  Nice.  Lighter than I remembered.  Smith and Wesson 45.  Or goes straight to the Sports Section.  Who gets first dibs? Will?     They're watching us, Will...     You sure about that, buddy?",
        "Eckhart": "",
        "Rachel": "Lower forty-eight.  You're not from here.  I can tell by your walk.  Unsure.      Sign here.  Ready to order?  Just about.  I'm sorry about your partner.  It's been on the radio for the last two hours.  Nothing but that.  Like when they found Kay Connell's body. We're not used to this sort of thing up here.  He was standing right there just a couple of days ago.  Your partner.  Exactly where you are now. I hope I was nice to him.     John Warfield.  He's called a couple of times.  Want me to lie?  Here.  It's on the house.  I got it. Don't know why I bother.  It's been broken for two years.  Oh.  A man came by to see you earlier. Said he was your new partner.  No.  He didn't say what his name was. Only that you were expecting him.  That's not what he thinks.  Short.  Dark hair.  Not that memorable.  Detective Dormer?    There's a guy down the hall.  Complaining about the noise. Says he can't sleep.  Are you alright?  Did something happen?  Will...  Will.  What happened?  One of your cases?  What happened?  Will.  What if someone finds out?  Well, that's not going to happen now.  There are two kinds of people in Alaska. Those who were born here and those who've come here to escape something in their lives. I wasn't born here, Will.  I'm in no position to judge anyone.  I'm not about that any more.  It's all about what you're willing to live with.  I found a new friend.  Will.  What is it?  I would have seen if he came back.  What is all this?",
        "Clement": "",
        "Farrell": "I read that kind of crap.  Uh, right.  About two miles outside of town.  Glock 40.  All plastic save the barrel and firing pin.  Never rusts.  What do you carry down in Seattle?  Excellent!  Maybe this guy doesn't read the papers.  Sorry about...  Over there.  Detective Dormer!  You don't seem like the bring-an- underling-who's-in-the-hospital-a- Snickers-bar kind of guy.  Oh, a real tear-jerker.  Brody, the good guy, just got shot.  Oh.  I'm sorry.  About Hap.  Detective Eckhart.  I wish I'd had the chance to get to know him better.  Take him fishing or something.  We just gotta catch the bastard, right?  What I saw?  Pretty much nothing.  That fog was so thick.  The bullet seemed to come out of nowhere.  I don't even remember seeing any shapes.  Then I saw you.  But only when you came up close.  Then you disappeared again. I guess I heard more than I saw.  Sorry.  Lonnie and I went to high school together.  Oh, you know.  Don't feel that much. Bullet went right through.  We'll get the other one, though.  After the autopsy.  I can't believe it.  Randy Stetz.  That doesn't mean anything.  Our dads were on the same boat. We used to wait for them together.  How do you like our beer?  Better than Fred's home town.  Rich found the gun.  What is it?",
        "Will": "I don't need to look at it.  Tell that to her, partner.  \"Halibut fishing capital of the world.\"  My partner...  You did your homework, Officer.    Just after Leland Street.  Seven years.  You have, Chief.  Nice kid.  Keeping you busy up here, Charlie?  So far.  Four unwarranted shootings, witness intimidation, and cocaine theft.  They're all over everybody.  That's I.A.'s pit bull.  Detective...  Guess that's what they call Alaskan hospitality.  What about these contusions?  Any signs of rape?  Wait.  He washed her hair.  Combed it.  Cleaned under her fingernails.  Clipped them.  Toes, too. You found nothing on the body?  No fibers, skin flakes, hairs...  He knew exactly what we'd be looking for. Made sure to cover up all his tracks.  Detectives Will Dormer and Hap Eckhart. There should be a reservation for us.  I'm always all business.  Is it really 9:30?       Come on in.  What do you want to talk about?  We'll talk when we get back to Seattle.  You know my plan of action.  That's right.  He's asking everybody questions.  He's just rattling your cage.  We say nothing.  It goes away.  Simple as that.  Weston Dobbs killed an eight year-old boy and left him hanging in the basement like a piece of meat.  You remember that?  One word to I.A. and he walks.  No way.  Mike Flynn's a dirty cop, Hap!  We are nothing like Mike Flynn.  We did what we needed to do to make sure that son-of- bitch Dobbs paid for what he did.  And every bastard like him.  We say one word about it and every case we ever brought in is going to blow wide open and they'll all walk.  Every last one.  And I am not going to let that happen.  No deals.  No compromises.  No discussions.  I care.        You got to be kidding me.  Think I'll pass.  What kind of calls you get around here?  Don't give misdemeanors a bad rap.  It's all about the small stuff.  Small lies.  Small mistakes.  Small oversights. People give themselves away in a traffic violation just as much as they do in a murder case.  It's human nature.  Aren't you going to write that down?  Typical seventeen year-old. She went to a party Friday night?  No diary.  What time was that?  Who was the last one to see her alive?  These are designer.  Expensive. Could Randy Stetz afford these?  Well her mother didn't buy them for her.  Kay Connell had an admirer.  I want to talk to the boyfriend.  You don't seem all that sad.  Did you love her?  Kay Connell.  Did you love her?  \"She was nice.\"  Wow.  That makes me all soft inside.  Ever occur to you she didn't love you back?  You heard me that time.  But she was seeing someone else on the side.  Friday night, at the party - what'd you fight about?  What kind of stuff?  The other guy?  After that she left the party to go to him.  Ran like hell to go to him...  Now you listen to me, you little shit. This fuck-the-world-Metallica-t-shirt crap may work with your mamma, but it doesn't work with me.  You got mad at your girlfriend because she was seeing someone else.  You want to be the last person who saw her alive or are you going to tell me who that is?  You don't know.  Just a little.  I want you to check this out, Ellie.  Do it again.  The small things - remember?  The second you're about to dismiss something - look at it again.  Who's that?  Good.  He's up next.    Can't wait to see what's for dessert.  Looks like the natives are restless.  Don't do this, Hap...    You tell Buck and I'm involved whether I like it or not...  I'll just have another Scotch in my room. If you don't mind.  Where is it?  We're sure it's hers?  Biology and Algebra.  Find out who she studied with.  Make-up.  Find out where she bought it.  Lab.    Who here reads this kind of crap?  Read them.  Tell me anything that strikes you.  Lab.  That's it.  No.  We put it back where we found it.  You said it was a fishing cabin.  This murder was in the papers, right?  Call all of them from here to Anchorage. Tell them we now know that Kay Connell left the party with a dark blue knapsack, but we haven't recovered it yet. We can get it in by the morning editions.  Fill this with random books.  Make it look heavy.  It'll eat this guy alive if he thinks he overlooked a detail.    Nothing.                Nothing.  That's him.  Fan out.  Stay here, Ellie.  Go!  Go!  Go!  Police!  Goddammit!  You!  Head back up to base... You!  Go right and follow along the water... Hap!  You go left...  Go!  Where is he?    Freeze!     Hap!  Hap!  And then I lost him.  In the fog.  Twenty, thirty seconds.  I followed the sound down to the water.  That's where...  That's where I found Hap.    I had him, Charlie.  Right in front of me.  Not two feet.  I could smell the son- of-a-bitch.  Playing with me.  And I missed the shot.  He was right there and I missed the shot!  Then my goddamned gun jammed...  I had him!  I'm going to check on the roadblocks...  You were nice to him.  He liked you.          Next time.  Go ahead and lie.      Goddammit!  Goddamned...thing!       Hap!  It's good to be accurate, Ellie.  You're doing your job.  I was here.  I'm going to the hospital to talk to him now. You get the search party together.  No fewer than thirty people.  I'll meet you in exactly twenty-five minutes.  Don't waste any time.  I'm not.  How's the book?  Thanks.  He would have liked that.  That's why I'm here.  I need to know exactly what you saw yesterday, Farrell.  Anything.  It's important.  No.  No.  Don't be sorry.  It's not your fault.  How's the leg?  Right.  Got lost in the rocks.  ...Anything catches your eye, you put it in a bag.  Anything looks strange, you put it in a bag...  ...Anything he may have dropped, moved, kicked, or stepped on, you put in a bag. Cigarette butts, gum wrappers, paper clips, coins, buttons - nine times out of ten a suspect leaves something behind...  The woods.  One group heading south, the other heading north.  Anything?  Alright.  Go back and set up some follow- ups for this afternoon.  He had to have exited here.  Over those boulders.  I saw him move, he's nimble. Would have taken the hardest way out.  Thanks.  Habit.  Fred Duggar?  I'm not expecting anyone.  What did he look like?  I need to borrow something.              I could say the same thing about you.  Who's playing?  She your only sibling?  No. Well.  I had a brother.  He died when I was eleven.  It's okay.  Happened a long time ago.  He was killed in a fire.  In New Mexico.  Not really. I remember I was more embarrassed that he had died.  Embarrassed that it made me different.  So I didn't tell the other kids at school what had happened.  They'd ask me where he was, where he'd gone.  And I'd make up stories.  He was visiting an aunt up north, he'd broken his leg, he was in a Swiss boarding school.  Stuff like that. Nice kid, huh?  Just kept making up more and more lies...  I'm going back to the Lodge, Ellie. Still need to go through some of Kay Connell's school records.    I'll pick it up.  You head back to the station.    I thought it was better if I came.  Under the circumstances.  Thanks, Doc.  So where's the other bullets?  What's with all the moose antlers around here?  When's Rich coming?  First I need a copy of the key.    Goddammit, Warfield, if you're gonna check up on me every...          Right.  Then change it.  I don't remember.  Listen, Ellie.  I don't have time for this shit.  Five feet, seven feet, twenty feet.  Put down whatever you want in your report, alright?          These should have gone out two hours ago.     You go ahead.  I'll be there in a second.  Why don't I give her a ride?  Good to see you, too, Randy.  You're not missing much.  You were good friends with Kay Connell, weren't you?  Best friend?  That's a long time.  Must be tough for you.  What happened.  What about Kay's other friends?  You want me to take you somewhere?  How about this.  You like this?  Thought you wanted something fun...  You and Kay were like sisters?  Told each other everything. That why your picture's torn up in the top drawer of her bureau?  Why her boyfriend's hand was clamped on your ass at her funeral?  You like games, little girl?  Well how about this one - you're standing right where her naked body was found wrapped up in a garbage bag.  Who was Kay seeing besides Randy Stetz?  Who gave her those dresses?  I need a name.  You don't know.  But you were such good friends...  What was?  Who?  Who?  What was it?  Lucy.  Desi.  Goddammit!  What?  Good.  No.  That's right.  So?  I don't think it'll lead anywhere.  Well.  If he's local.  Give him a call.         I'm fine.  Walter Byrd.  You think this is a nice meeting we're having here?  Friendly?  Two people getting acquainted? You sick, coward, fuck.  I get up every morning of my life just to bring someone like you down.  Beating a seventeen year- old girl to death.  Washing her afterwards, cleaning her.  Make you feel like a real man? Huh?  I outta end this right now.  Take a rock and smash your fucking skull in...  That was an accident!  You hear me?  I didn't know it was him! I didn't know it was him!  What's your game, Byrd?  The phone call.  The knapsack.  Let's get one thing straight, Byrd.  We are partners on nothing.    I said you're going to get a phone call.  Kay Connell had a signed copy of one of your books.  You're going to be brought in for questioning.    What do you mean, \"wild card?\"  What do you mean \"wild card?\"  I have a cold.  Back to the Lodge.  I trust you.  Duggar called him?  Not really.  No.  But it sounds like something I would've said.  See you tomorrow, Ellie.         Goddammit, Byrd!     I didn't know!      Fuck!               What is it?     I'm fine.  No.  The light.  It keeps coming in...      There was this guy named Weston Dobbs. Twenty-four.  Worked as a part-time stock boy in a copy store.  Every morning he'd sit at the only window in his apartment and watch an eight year-old boy get picked up by his carpool across the street.  And every afternoon he'd watch the boy get dropped off again.  He did this for about six months.  Until one day he got up the nerve to cross the street and grab the boy before his carpool came. Kept him in his apartment for three days. Tortured him.  Raped him.  Made him do things...  When he was done, he got a rope and a kitchen stool and hanged the boy in the basement of the apartment building.  But he didn't do a good enough job.  The little boy's neck didn't break and he died from shock.  The landlord found him five days later.  Me and Hap.  A year and a half ago.  I knew the second I met Dobbs that he was guilty.  Smug, cold.  Dead eyes.  We had circumstantial evidence, but nothing to tie him to it.  Nothing concrete.  Went over every inch of that apartment.  We took some blood samples from the boy's body and planted them in his apartment. Arrested him the next day.  There've been other cases.  Where we've changed results.  Pushed witnesses. Manipulated evidence. But Dobbs.  I wanted Dobbs more than anything.  We're under investigation now.  Back in Seattle. Hap wanted to talk.  As soon as we got back.  Thought he could work out some kind of deal.  Do you think it was wrong?  What we did?      What was the nature of your relationship?  She was an attractive girl.  Did you have sex with her?  But she was an attractive girl.  Did you have sex with her?  But you wanted to.  You gave her gifts.  Expensive dresses.  A heart necklace.  Doesn't sound like a mentor to me.  What about him?  That's an understatement.  I like it fine.  They haven't been easy.  It's legitimate.  The case is closed, Ellie. I got the next round.  What the hell are you doing calling me at the station?  Randy Stetz is in jail.  Congratulations.  The tape.  There's nothing more to talk about.  We do nothing well together. Nothing!  You understand me?  What the hell do you know?  I told you that was an accident!  Don't you pull that shit with me.  Couldn't get it up, Walter?  Like this?  This an accident, Walter?  It took ten minutes to beat Kay Connell to death.  Ten minutes.  Get the fuck out of town, Byrd.  Leave and never come back.  Six-thirty.  I have to get back.  Had a lot of help from Nightmute's finest.          No.  I'm here to end this.  No back-up.  Procedure went out the window a long time ago.  That's where you're wrong, Walter.  There is no secret.  Because the biggest difference between you and me is what we will or will not live with...    Walter!  Drop the gun, Walter.  Another J. Brody mystery.  God, you're a pain in the ass.  You, too.  Walter Byrd killed Kay Connell.  Her things are in the house.  Byrd's dead.  Yes.  No.  But I covered it up.  I lied.  Because I just couldn't be wrong. Don't ever get that way, Ellie.  Don't ever lose your way.  It blurs the line.    Let me sleep.  What about your shoulder?",
        "Dormer": "",
        "#1": "Where do you want us?  We did the interviews with all the nearby houses like you asked.",
        "Pilot": "Detective?  Better check your belts.  We'll be landing in about fifteen minutes.  Tell your dad the game's gonna start late this week, Ellie.",
        "Chief": "Will Dormer!     I'll be damned!  Christ.  I haven't seen you boys since...  What's that, then?  Seven years?  Where does it all go?  That was some amazing time, though, wasn't it?  You haven't changed a bit, Will.  I knew that was coming.  I deserve it.  Pay attention to this man, Ellie.  He'll teach you how to be a great cop.  That's all, for now.    I told you seven years ago this was a stepping stone to retirement.  Looks like it's a good time for you to get up here, too.  With all the bad business going on down at Special Branch.  Just five bad apples so far?  What's the D.A. got them on?  How about you?  How you faring?  Got a bunch of messages here from some guy named Warfield.  Wants me to keep him posted on all your movements up here.  I'm just glad Buck could spare you a couple of weeks.  Take you out of the frenzy.  I gotta tell you, though, I sure don't miss big city police work.  Not that I was ever a great detective.  But up here there's no Bureaucracy.  No Public Relations.  No blurred lines. Just good guys and bad guys.  Simple.  Except for this.  Couldn't get a thing from the body.  Not a trace.  Town's never dealt with anything like this before.  I've briefed everybody about your coming. They know to follow your lead.  This is Detective Dormer and his partner Detective Eckhart.  On loan from Buck Lundgard, Seattle Robbery and Homicide Special Branch.  They'll be helping with the Connell case.        And then you lost him.  About how long 'til you heard the suspect's second shot?  I think you need a glass of this.  There's a bunch of those tunnels out there, Will.  From bunkers over sixty years old.  I don't even know half of them myself, and I grew up here.  Will, you can't blame yourself.  It's only gonna make you crazy.  Right, Ellie.  I want you to take care of the investigation into Detective Eckhart's shooting.  We need paperwork, Ellie.  You know that. Just write up a quick report.  You're no good right now, Will.  Go back to the Lodge.  Try to get some rest.  ...We're going to bring down a couple of guys from Ridgemount, but I want us to step up the investigation here...  ...Nightmute hasn't lost an officer in thirty-seven years, and even though Detective Eckhart wasn't from here, he was as good as one of us on this case.  I had the honor of working with him down in Seattle for a number of years.  He was a fine detective and an even better man.  Fred, you'll be working with Detective Dormer directly from now on.  Will?  Anything you'd like to add?  Okay.  Then let's get to it.     I was hoping not to send you back with so much paperwork, Will.  When are you taking off?  Can't talk you into staying for a couple of days?  Do some fishing?  Show you what normally goes on around here.  Too bad...  ...Brought some real class to the place. But, Seattle needs its hero back. Couldn't have done it without you, Will.  Detective Dormer's not leaving for a few hours.  Maybe you could drive him to Spencer's.",
        "Nyback": "Will Dormer!     I'll be damned!  Christ.  I haven't seen you boys since...  What's that, then?  Seven years?  Where does it all go?  That was some amazing time, though, wasn't it?  You haven't changed a bit, Will.  I knew that was coming.  I deserve it.  Pay attention to this man, Ellie.  He'll teach you how to be a great cop.  That's all, for now.    I told you seven years ago this was a stepping stone to retirement.  Looks like it's a good time for you to get up here, too.  With all the bad business going on down at Special Branch.  Just five bad apples so far?  What's the D.A. got them on?  How about you?  How you faring?  Got a bunch of messages here from some guy named Warfield.  Wants me to keep him posted on all your movements up here.  I'm just glad Buck could spare you a couple of weeks.  Take you out of the frenzy.  I gotta tell you, though, I sure don't miss big city police work.  Not that I was ever a great detective.  But up here there's no Bureaucracy.  No Public Relations.  No blurred lines. Just good guys and bad guys.  Simple.  Except for this.  Couldn't get a thing from the body.  Not a trace.  Town's never dealt with anything like this before.  I've briefed everybody about your coming. They know to follow your lead.  This is Detective Dormer and his partner Detective Eckhart.  On loan from Buck Lundgard, Seattle Robbery and Homicide Special Branch.  They'll be helping with the Connell case.        And then you lost him.  About how long 'til you heard the suspect's second shot?  I think you need a glass of this.  There's a bunch of those tunnels out there, Will.  From bunkers over sixty years old.  I don't even know half of them myself, and I grew up here.  Will, you can't blame yourself.  It's only gonna make you crazy.  Right, Ellie.  I want you to take care of the investigation into Detective Eckhart's shooting.  We need paperwork, Ellie.  You know that. Just write up a quick report.  You're no good right now, Will.  Go back to the Lodge.  Try to get some rest.  ...We're going to bring down a couple of guys from Ridgemount, but I want us to step up the investigation here...  ...Nightmute hasn't lost an officer in thirty-seven years, and even though Detective Eckhart wasn't from here, he was as good as one of us on this case.  I had the honor of working with him down in Seattle for a number of years.  He was a fine detective and an even better man.  Fred, you'll be working with Detective Dormer directly from now on.  Will?  Anything you'd like to add?  Okay.  Then let's get to it.     I was hoping not to send you back with so much paperwork, Will.  When are you taking off?  Can't talk you into staying for a couple of days?  Do some fishing?  Show you what normally goes on around here.  Too bad...  ...Brought some real class to the place. But, Seattle needs its hero back. Couldn't have done it without you, Will.  Detective Dormer's not leaving for a few hours.  Maybe you could drive him to Spencer's.",
        "Ellie": "Hey, Mr. Angstrom!  Police business.  I don't babysit any more, Mr. Angstrom. Just made detective three weeks ago.    It's a huge honor to meet you!  Ellie Burr.  I'm here to take you to the station!  Detective Eckhart!  I know!  Welcome to Nightmute!  I just want to say how incredible it is to have you working with us, Detective Dormer.  I've followed all your cases. Theodore Dineli, Frank and Casey Prud'homme, the Port Angeles shootings...  ...And especially the Leland Street Murders.  That was my case study at the Academy.  Sure thing, Spence.  That's where Ronald Langley cut you in the basement of his father's house on 325 Leland, isn't it?  Actually...  I just made detective three weeks ago.  Yes, sir.  Oh.  Right.  Okay.  Don't worry about him...  He's just mad 'cause you're taking over.  Fred wants us to meet him at the Connell's.  Brought you a bear claw.  Just in case you were hungry.  Local delicacy.  Oh.  You know.  Small-time stuff. Nothing like what you must get.  Mostly drinking-related problems.  Domestic abuse.  Barroom fights.  Stuff like that.  In the summer months it's pretty quiet. That's when there's work out on the boats.  The rest of the year, though...  Hey, there, Joe!  That's Joe Willy.  Took his family hostage in November.  That was the most exciting thing that happened last year. I wasn't there, though. Chief barely lets me handle anything above a misdemeanor.  But they're so boring.  All small stuff.  Let me just...  Down at a local dive the kids like to hang out in.  He fixes boat engines.  He's a little surly, isn't he?  We already did.  But there wasn't any...  You want me to write that down?  The bartender at Darrow's.  He was there Friday night.  Over here.  On the beach.  Yeah.  All over.  Brought some coffee...  Anything yet?  But...  You wanted to see me?  But what about the Connell case?  I'm on the Connell case.  Detective Dormer?  I'm sorry to bother you, but I was asked to write the report on... ...you know what I was asked to write the report on... ...Could you, just to be accurate, for the report, could you just point out where you were when you saw Detective Eckhart yesterday?  I'm so sorry about what happened.  I know you did everything you could...  He has to be a prick, Fred.  He's a great detective.  ...and it was at this point that Detective Dormer headed towards the noise...  Remember, Kepp, shoot everything... ...wherein he discovered the wounded Detective Farrell Brooks, having been  Francis!  You're supposed to be Farrell.  Shot in the thigh and writhing in pain.  Accuracy.  That's what. Now get down.    You there, Rich?  Detective Dormer!  What are you doing here? It's two-thirty in the morning. Shouldn't you be asleep?  Oh.  We always have play-offs in the middle of the night.  It's the best time.  The Puffins and the Hawks.  We're in extra innings.  The Hawks have a really good line-up this year.  That's my sister.       What about you?  You have any siblings?  Oh, I shouldn't have...  That must have been awful for you.  You okay?    Try to get some sleep!  Detective Dormer!  You look like you're in a hurry.  I just wanted to ask you about these pictures.  I know they're not great quality, but this is where you said you were when you first saw Detective Eckhart, right?  But here's the thing.  I retraced your exact steps according to your statement. You couldn't have seen Detective Eckhart from there.  I mean, not in that fog.  How much closer would you say you were?  Five feet?  Seven feet?     Which way are you walking?  I needed to get your signature on something.  The report on Detective Eckhart.  Chief made me finish it this morning.  Said it was taking too long.  Aren't you going to read it?  Now I can help you with the Connell case. That writer's coming in tomorrow.  Walter Byrd.  About an hour ago.  Said he was more than happy to cooperate.  You haven't been sleeping much, have you, Detective Dormer?  Isn't that the difference between a good cop and a bad cop?  A good cop can't sleep 'cause a piece of the puzzle's missing.  A bad cop can't sleep 'cause his conscience won't let him. You said that once, remember?  Oh!  I forgot to tell you.  The Puffins won.  The baseball game.  Our team...  ...We won.  When did you first meet her?  Randy Stetz beat Kay Connell?      Hi, guys.  Yeah.  I know.  I heard.  I found this out on the beach.  Shell casing.  9mm.  None of us carries a 9mm duty weapon. And the murder weapon was a 357.  It's a legitimate point, isn't it, Detective Dormer?  Worth pursuing?     Me, Pop!  Ellie?  You okay?  Where's all my academy stuff?  Didn't want to miss anything.  Good.  Sure.  I thought what you did on this case was amazing.     We're really going to miss you around here.  Very funny, Farrell...  Hi, Rachel.  Detective Dormer?     Shit!  Detective Dormer!  You're shot.  I'm going to make a tourniquet.  I know.  You shot Detective Eckhart, didn't you?  Did you mean to?  Why?  This one looks worse.  No!  I will not let you sleep.  If you've lost your way then you have to make it right. That's the only way.  That's what you'd tell me.  I've been a detective for four weeks and I say you're coming with me.  C'mon...  Don't worry.  I'll have a cool scar.",
        "Burr": ""
    },
    "imdb_rating": "7.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYzlkZTEyYjUtMTY5NS00ZjU0LTk5OTYtM2M0ZDg1NmNjMzhkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "In Nightmute, Alaska, seventeen year old resident Kay Connell is found murdered. As a favor to the local Nightmute police chief, two Los Angeles Robbery Homicide police detectives, Will Dormer and Hap Eckhart, are called in to assist in the investigation. Although renowned in the police world, both Dormer and Eckhart are facing some professional issues back in Los Angeles. In Nightmute, Dormer has a major case of insomnia due to a combination of the incessant midnight sun and from a secret he is carrying. This insomnia is causing him to be delusional. Something he is not dreaming about is that the murderer has contacted him, informing him all about the murder and the fact that he knows everything that is going on with Dormer. They begin a symbiotic relationship in keeping secrets for each individual's benefit. But ambitious young local detective, Ellie Burr, might piece the story together on her own.—Huggo",
    "name": "Insomnia",
    "genres": [
        "Drama",
        "Mystery",
        "Thriller"
    ]
}