{
    "filename": "Interstellar_script.txt",
    "imdb_id": "tt0816692",
    "imdb_url": "https://www.imdb.com/title/tt0816692",
    "characters": [
        "Boots (as Francis Xavier McCarthy)",
        "Cooper",
        "Romilly",
        "Smith",
        "Brand",
        "TARS (voice)",
        "Doyle",
        "Ms. Hanley",
        "Tom (15 Yrs.)",
        "School Principal",
        "Williams",
        "Professor Brand",
        "Murph (Older)",
        "Murph (10 Yrs.)",
        "Donald"
    ],
    "dialogues": {
        "Cooper": "Long way to come by bus. I thought you guys would have a plane.  A little. 7.     Satellite. Big one. Probably Chinese.     You ruin it for the boys when you talk like that.  They didn't have any baseball at all when I was a kid.  I thought okra wasn't susceptible.  Something wrong with your truck?  What does that have to do with anything?  Get the spare, Tom.  All right. We'll use the patch kit.  Murph's law.  Find something to patch it with.  Figure it out. I'm not always going to be here to help you.  Listen to me. Murph's law doesn't mean that. It means what can happen will happen. All kinds of things. Good or bad. And that's the way you want it to be.  Because if nothing ever happened to you then you wouldn't learn anything.  Murph?  Get in.  It's a Chinese military drone. Solar cells could power an entire farm. Take the wheel.  Keep it pointed right at it, OK?  Faster, Tom. I'm losing it. 13.  Almost got it. Don't slow down.    You want to give it a whirl?  Set her down in the valley -- there, next to the river.  Chinese mission control went down same as us, twenty years ago. It's been up there ever since.  It was looking for something. Intercepted some kind of signal. It's been at eighty thousand feet. Sun probably cooked its brain.  Reprogram it. Give it something socially responsible to do like drive a combine or a tractor.  We need all the help we can get, Murph. This thing has to adapt, just like the rest of us.  What about college?  You're ruling out college for him now? He's only fifteen.  What are you, about a 36-inch waist? 30-inch inseam?  You're telling me you need two numbers to measure your own ass, but just one to measure my son's future?  Engineer.  Are we done?  One of my old textbooks. Murph liked the pictures.  Corrected?  You don't believe we went to the moon?  \"Useless machines\"? 18.  One of those useless machines they used to make was called an MRI. If we had any of them left the doctors might have been able to find the cyst in my wife's brain before she died, rather than afterwards. And then my kids could have been raised by two parents, instead of me and their pain-in-the-ass grandfather.  You ever consider the best thing for the world and humanity might have been for us to part company?  Just tell him to power down the controllers for a couple minutes.  Bravo-two-eight, requesting permission to enter your airspace.  Not exactly.  Space probe. Never seen one like it, though. Looks like it's been to hell and back.  Lost, I guess. Guidance satellites would have been shot down by the Chinese twenty years ago. 21.      Well I don't know what the hell it's made of, but I can't crack it open.  Good boy. Hand me the scanner.  Here we go. Standard NASA encryption. Memory's been damaged. Just noise. Hold on. I've got something.  I don't know. 22.  Where the hell did you come from?  We'll take it down to Tyson's tomorrow and have it melted down. Might be some copper inside.  There's no one for it to report to. NASA is all gone. I'm sorry, son. It got home too late.  Maybe it's better for everyone to forget what they did back then. Reminds us how far we've fallen.  It doesn't bother me that he can't go. It bothers me that he doesn't care.                    It's a fail-safe. It's going to annoy us into taking it home.  We're going to get some sleep.        You're staying here and cleaning the house.  I told you, Murph. There's no one to take it back to.       Got any diesel?  I don't know. Don't touch them. 27.  Murph?  Careful. There's some kind of underground facility here. We might...  Can't be. It's a marine. Haven't made them for thirty years. I've never seen one intact before. 28.  I think we need to go, Murph.  No. I don't know what this place is, but we're leaving.    We were just looking for salvage.  I didn't know it belonged to anyone. 29.  You've got me wrong, lady.   Word of advice -- careful with that thing. When the war was over, they didn't know when to stop fighting.  Wait a second--  Now who's stealing from who?  You're right. It belongs to NASA, which shut down thirty years ago when the federal government ran out of money.  Who are you people?  Galveston.  Canaveral's been gone for thirty years.  Nothing. I got something off of it.    Most of the disk was noise. Couple of clean sectors, though.  There aren't any planets like that anywhere near earth. Not even if this thing was gone for thirty years.  You can't keep us here. 33.  I'm not going to endanger it any more than you already have.  Are you using that for guidance?  The power supply is no good. If the voltage fluctuates under load, the unit will fail.  Bought thirty of them off a guy in Florida. Had to rebuild every last one. They work great on a riding lawn mower.  You plan on keeping us here forever?  I guess no one told them they were out of a job.  Same as the rest of these people.  I thought the old man was in charge.  Not you?    That rocket doesn't have enough thrust or fuel to get you to Jupiter.  Why are you telling me this? I already told you I'm not going to tell anyone about this place.  But I don't have any of the experience. Any training. You people have been preparing for this for years.  No. I'm sorry.  I can't help you. I have responsibilities. Things that, no offense, are more important than a scientific mission.  Rescue? Rescue who?  The blight.  But it doesn't affect the corn.    You've known this for how long? And you didn't try to tell anyone?    But you'd still only be able to save a few hundred. Maybe a thousand.  I can't go. I have to look after the boys.  I have a responsibility to them--  You have to stay here, pal.  There's going to be important work to do here, too.  I need you to hold onto this. Will you do that for me?  I will come back. I promise. 42.  Don't look so happy to see me.  Great idea. A massive, sarcastic robot.  That sounds like a good idea.  I was wondering where you've been getting your supplies.  So you're a salvage diver now? I thought you were a biologist.  We're taking ants with us?  I thought humans were more solitary.  Looks like hard work.  Is that a star? 46.  Lose time?  How much time?  Sure. Till we ran out of food and ate all of them.   I thought I was going to get to enjoy your company all the way to Mars.  We'll be back.  Oh, no. I want to see this.    Bit of a demotion.  The ship is tiny.  I know. So why are you painting it?  Sure it does. You're pretty good.  What'd you paint?  How much do these things weigh?  Damn.  Why?  Fine. The anesthetic is working.    Why?  If we're such a liability, why take us along? You and Tars could build the colony without us. You wouldn't need to bring food or oxygen.  Humans aren't programmed.  Did they program you to be condescending?    How would that make us better at surviving?  No. I want to know.  We've almost reached the wormhole. Just in case anything happens, I just wanted to say... I love you boys. And I hope whatever your lives become, whatever is coming your way... you make the most of it.  I know. Thank you.  You never had any? I thought I was a pariah for only having two.  Strange place to look for a new home.  You really think there's a plan?  I guess I just think we're on our own.    Where are we?  Something's happening to the hull over here.  Well, I don't know what your display is telling you but something is happening over here.  Can you ask it to stop?  It's working.  We've lost contact with the relay. 67.  One long garbled transmission came in. Then nothing.  What is he doing?  What about Tars?  I still can't contact the relay. 70.  Did you hear me? We're not able to communicate back home.  How could they all have landed in the same place?  We're bringing him along? 71.  This is the Taichung mission.  They never landed. Not on Mars. Four human crew, fifteen robots. The log says the base has been here for thirty years.  The entire human crew is buried out there in the snow. 75.  Then what?  What about returning to the ship?  What is this?  Case, wait--  Breathe. Trust me.  Your suit is filling with water. I'm not going to be able to hold it much longer. I'm going to let go.  Take a deep breath.  I thought we were supposed to be a collective organism.  Don't mention it.  Looks like we can climb up the mountains back to the ice. We're down to three suits. We'll have to send someone ahead to get a fourth. 81.  Any sign of Brand?  What happens then?  Any sign of big life-forms?  I just think we should get back to the shelter before night falls.  You don't know that. You just have blind faith this place is going to be some kind of Eden.  What's that supposed to mean?  What?  You know how plants don't usually move? Is that a universal rule?  Hello there.  OK. Now we run.  We have to reach the shelter.  This way.  I've got you. 86.  By \"cooperate\" do you mean let it eat me?  Then why are they killing each other?   What is it doing?  I don't want it to incorporate me.   They're killing each other.  I'd say they have a long way to go.  But what are they competing for?  Why not?  What difference would that make?     The plan.  I was in Denver during the first year of the famine. I was just a kid. We kept waiting for someone to come help us. People starved to death sitting on the ground, waiting for someone to come. 90.   I only made it because I realized that nobody was coming to save us. We were on our own.  Honestly? After the things I saw... you want to know why I don't believe that someone would be trying to help us? Because I'm not sure we're worth saving.  Looks like they lost.  But why didn't they come?  Testing what?    Everything in here is bolted down.  What do you think this thing does?  I wouldn't turn it on until we can figure out what it does, Roth.  Old military-grade encryption. It's not very robust.  No offense. Hang on.  That should open up most of it.  No one was listening.  How long does this place have?    Case, what is that?  No. It's closer than that. Roth.  Quick -- hold onto something. 97.    They found a way to make gravity.  What does that mean? 99.  But how did the Chinese develop the technology? This would take decades, maybe hundreds of years, to create.  I know this isn't exactly what you trained for. But I think Roth might be right.  Don't make any sudden movements. They can't hurt us if we're unarmed.  Further orders aren't coming. Your government is gone. It ran out of money, same as ours. You're on your own.    Come on.  We're too late.  The main thruster fuel supply. We're not going anywhere.  But we need to take the box back to earth.  I'm going to image the operating code and the architecture onto the probe's hard drive. It'll be garbled, but it should give you and me enough to rebuild it when we get back.  Let me take it.  We're going to find out soon enough.  Where's Brand?  Dammit. If I don't make it back, just keep going.  Get that thing home.     Guess you were right -- too much gravity, or not enough.  Roth.  How is that working?  Good. We've already set the course, skipper. We're going home. 112.  Now I know why we weren't able to hit the relay. It's not interference -- the blue-shift from the black hole is more than we thought it would be.  Nothing. Wait. The ship cached one long garbled transmission when we first fell into the swirl. If we account for the blue shift then the computer might find something in there.  How much?  Forty seven years.  We could bypass the relay. Send a conventional shortwave signal.  You knew, didn't you? You and Case figured it out when we landed.  Sure you could. You're brilliant. You know everything. 114.  They're not children any more... if they're even still alive.  Yes she did.  That's why you were upset -- your father.  We can't let that happen. We'll lose more time... too much... 116.  We're losing years.  What will happen to it?    All of those people back home... none of them will make it.  Case said the Chinese found something else. The location was scrubbed from their records. But I bet he knows it.  Here. Can we reach it?   That? What is it?  Where are we?  Not a single drink on the whole ship. What kind of mission is this?  You really think we're the last humans alive anywhere?  So that's it, then? That's all?  What about the plan? The grand scheme. 125.  I didn't. But you were bringing me round.  What the hell was the point? What did it add up to?  This? You're saying the end result of ten billion years is the atoms from dead stars standing here disagreeing with each other.  This thing is made of... gravity?  Can we communicate with them?  What is that? 128.  There's something out there. 129.  This is what the Chinese were protecting. How they could have built all this in just a handful of years.  Must have taken you a while.  How are they keeping the lights on in this thing?  It's a map?  So why didn't they return? Why didn't they save us?  They weren't interested in the other wormholes because their mission was to return home. That one leads back to Earth. The Earth they were told to return to.  Did they make it?  We're going to find out. 134.  You don't know that.  I made a promise.  You could have taken one of the other ships.  Where are you going to go?  You're going, too?  I'm sorry. I have to find out what happened to my sons. I promised them.  I promise.  The probe...  It's going to work.  That's not what I mean. This is the probe I found in Galveston.  Brand said there'd be some evidence we'd made it. And there was. This.  But only this. Everything will be destroyed except for this.  We have to stop.  You don't need to do this. We won't make it back, but this does. The secrets are already right on it. Maybe someone found it. There's hope. But we don't get to go with.  Dad? You said you'd take us to the game.   What is it supposed to do, Dad?   This is the crew of the Endurance... Murph... I'm sorry...  Dad... I'm sorry... I made some changes to the machine. I think I did something wrong.  Where am I?  What's coincidence? What is this place?       Where... where are we?         Shoot. 149.  It was last of its kind. Their planet was destroyed.  Because that was the plan.    Feel like I should be pulling my weight. 150.  I was hoping to enroll in a course. Try to get myself up to speed on the new systems.  No one's heard anything from Brand?  Am I really going to hurt anybody by going to look for her? I just need a small ship. I made a promise.                   Curiosity. New level setting. 100 percent.  Sense of humor. New level setting. 100 percent. Wait. 80 percent.               Where do you want to go first?",
        "Romilly": "",
        "Smith": "",
        "Brand": "Is that what they call stealing these days?  It doesn't. You want to let them go, Tars, or do you want some help with your work?  Really? You're not the kind of guy who turns a combat marine with a supercomputer for a brain into a riding lawn mower?  Get back in your little plane, go back to your farming commune. And don't come back.  I'd trust him a lot more than I'd trust you. Keep moving.  Get it inside. 30.   You too. We'll figure out what to do with you later.  This doesn't belong to you.    I found them outside with it. It looks like six. Maybe seven. I can't tell from the radiation damage.   Of course. It must have been looking for Canaveral.  What did you do to it?  He's heard enough. If we're going to launch, we need to keep them here until afterwards.  He could endanger the mission.  Now how could you possibly know that?  The mission commander wants to see you. Your son can stay here. He'll be all right with Tars.    I'm a biologist. 35.  It's a wormhole. A shortcut leading to a galaxy on the far side of the universe. We found it fifty years ago.  We've been waiting, sending probes into it for decades. None of them ever came back. Not until now.  In the last century strands were limited to one or two species. But this one targets everything. Essentially it's more efficient at consuming our food than we are.  Not yet. But it will. We've grown a dozen forms of it that can. It's just a matter of time before the same ones develop out there. The mission is to rescue us. Humanity.   Who's going to find it? The universities are a joke. People like you are reduced to scavenging just to get by. The earth has had enough of us. We have two, maybe three generations left. Then our time here is over.  What would be the point? So humanity could spend the last fifty years of its life fighting over the scraps? It's better that they don't know.  A new home for humanity. We'll set up a colony, then return to bring more people across.  Would it be better if we all died?  Look -- I don't have a clue what Case thinks you could add to the mission. You can come with us or you can stay here and wait to die. I don't care. But make no mistake -- this mission is our last chance. 40.  You don't like this one, you get to help me find a replacement.  We knew we'd need decades of parts and materials. The government was getting rid of some things. So we arranged to take some off their hands.  You know how to use one?  You just breathe. Tap my arm or bang something metal if you have a problem. And don't get lost.     You can set that down over there.  We didn't know what kind of gravity to expect. We experimented with collective organisms in high g environments.  Humans are also collective organisms. 45.    It's a paradox. Life couldn't form without gravity. No stars. No planets. The component pieces would just drift apart. But too much of it and you're trapped.  As long as we're careful, we'll make it.  I find it hard to believe that someone would build a wormhole to a planet with water and oxygen just to lead us to a dead end.  A guess. That's right. We don't have time to wait for conclusive proof. 48.  My guess is that the wormhole is there because someone is trying to help us. The same way we used to try to help animals when they were threatened with extinction.    Tars here needs to be disassembled. I figured you could do the honors.  It's noise. I know it's noise. But it looks too orderly. Probably just an old man seeing things. 50.  I won't.  If we find a habitable environment, I'm staying behind to build the colony.  Smile.  Because it lowers your blood pressure. 55.  We'll be able to communicate with Earth even from the far side of the wormhole.  I can't imagine how tough it would be to leave your kids behind. 58.  Hard to settle down when you've spent your life waiting to leave the planet.  You wouldn't want to get too close to the surface of the sun, either. Black holes are a more stable supply of power than stars in many ways.  I hope so.  You don't?  This isn't turbulence. Look at the way they're moving -- it's like something's examining us.  We're moving.  Saving us.  Tars. His transponder is still working.  I've already checked it. It's electromagnetic interference. We'll try again in a few hours.  We need all the help we can get. Besides, the alternative is to leave him on the ship alone. You think he'll still be here when we get back?    How could the Chinese have gotten here first? The federal government kept the wormhole a secret.  Then how did the probe that Cooper found return? 73.  The whole place has been dosed with huge levels of radiation. What happened here?  The Mars mission? The Chinese claimed it had been destroyed on landing.  I'm going to descend to take some samples. Cooper, want to make yourself useful?  How long do we have left?  Then we die. The radiation will cook us alive.  Not enough time. Case is right. The ice can shield us from some of the x-rays.  A pocket formed by gas. There may be more below.  Shut up. How much time do we have, Roth?  I've found something. 77.  These things... they're alive.  X-rays. They feed on them and emit visible light. They've found a way to survive here.   They're absorbing most of the x-rays.  What do you mean, you're going to let go?  I don't need your help.  Thank you.  Oxygen atmosphere. Pure water. Temperate climate. You still think this is a coincidence?  I won't need one.  Because I'm not going anywhere. This is our new home.  This is incredible. The organisms trapped in the ice above absorb x- rays and emit light. In return, these plants absorb the light and emit oxygen, which feeds the animals trapped in the ice. 82.  Look at this. I think they're the same organism at a different stage of the life cycle.  It's fractal. No individual cells -- the structure repeats all the way down.  The soil's been disturbed. So something's been moving. But I haven't seen anything.  Cooper... are you nervous?     Faith has nothing to do with it. You know what you are, Cooper? You're just another in a long line of people saying 'no.' That this isn't going to work. And frankly, I don't have to convince you. 83.  You're on this mission because you're another pair of hands. You want the truth? I told Case we should bring another robot over you. At least then I could just reprogram you to-  Nothing. I just -- I could have sworn it just moved.  No. There really aren't any rules.   Remember, we're the aliens.  Hold very still. Don't make any sudden movements. 84.  No... wait.  I've got you.  It's game theory. The best move is always to cooperate at first.  These organisms have no interest in us. They survive by photosynthesis. All they need is light.  I don't know. But we're outnumbered, Cooper. So unless you have a better idea, I suggest we make nice. 87.  It's a colony organism. It's trying to incorporate you into its structure.  Don't open your mouth.  No. They don't bleed... they don't die... they're just competing... trying out different shapes, looking for the best one. 88.    The behavior changes as the animals get bigger and bigger. More sophisticated. More calculated.  I don't know.  These creatures are billions of years older than we are. But they're relatively primitive. They haven't developed tools, culture, language.  I don't know. No one knows how intelligent life began on Earth. But the surface of this planet has virtually no craters. No impacts. It's been sheltered by the local black holes.  Maybe not enough has gone wrong here. Maybe bad luck is the key to intelligent life.  Exactly. Maybe our interaction with them will push them over the top. Maybe that's part of the plan.  Why is it so hard for you to accept that someone might be trying to help us?  They're not going to move now, Cooper. They need to spread themselves as thin as they can to absorb the light. 91.  Cooper, honestly, you're a bit of a-  They will. We can salvage it. This place will save us years. 92.    What happened here?  Cooper. Come look at this.  Where did they go?  But I don't understand... why are we here? What are we here for?  What the hell are we here for? I trained my whole life to reach this place.  Maybe we could work with it. Try to improve it.  And go where?  That doesn't help this planet. This creature is doomed. Unlike us it doesn't have anywhere to go.  Who?  This planet is being pulled into the black hole. We all need to leave.    This device that you have built -- this could save millions of people. We need to get it back home.  We can't leave them all to die.  Was that the last of them?  It doesn't matter how many of us make it. We have to get this back to earth.  This isn't right, Roth. We can find a way for all of us to leave.    Someone's coming.    Between you and utter solitude, Cooper, frankly, I'm not sure.  He's gone.  We're safe now.      A lot... Cooper, maybe it's best if    Only a tiny portion of the signal would make it though the wormhole. Besides, no one will be listening anymore.  I thought... I couldn't be sure.  Cooper... we needed to keep going. I'm so sorry. Your children...  Listen, the important thing is that we're going home, now. And we have something that can save everyone. It's more important than the people we left behind-  He's gone. But there are other people who still need our help. There's still time...  Case... what are you doing?  Wait... no... 115.  No... We're being pulled back to Pantagruel.  It's orbit mirrored the ice planet's.  It'll be destroyed, like everything else.    What are you doing?  We can use the thrusters to keep us on the critical orbit. Then slingshot us towards Gargantua. 118.  It's another wormhole.  I don't know. It's like we entered the wormhole and never left it.  I'm sorry. I should have told you. I didn't have the right. But you should watch the recordings. You should know what happened to your kids.  I'm not going to make it much longer. The machines will continue to maintain the station as long as they can and the communications will run as long as the station here still has power. I'm sorry. I hope wherever you are, darling, you're safe.  Our last trip past the black hole cost us another 100, maybe 200 years. Which means there's a good chance we're the only humans alive anywhere. 121.  I think the last human beings should have a little more fight in them than that.  I think Doyle's been experimenting with the coolant from his spacesuit.  I don't know. Maybe.  Yes.    I thought you didn't believe in one.  I don't know. Maybe it just adds up to this.  Maybe that's enough.  I think these are the creatures that built the wormhole.  No. I don't think it's in our universe at all. I think it lives in the bulk -- the space that the wormholes traverse. And it can only interact with us using gravity. 127.  Where would we even start? Maybe--  That's us. That's where they've brought us. We're in the bulk.  They're moving us.  How do you know?  Time. That's what the bulk beings wanted to give us. That was the treasure the Chinese found. Enough time to let us save ourselves.  Because they were too late. By the time they found this place, the people who sent them were dead. They were unable to fulfill their mission.  Where do they lead?  But that's impossible...  You know it doesn't work. Time travel isn't possible.  Yes, I do. If it worked, the Chinese would have suddenly discovered all of these incredible technologies. But they never made it. You can't go back, Cooper. You can slow things down, but you can't ever go back. Our home is gone.  You listened to all of those messages from your family. If you had made it back, we would already know. There would already be some evidence.  If you try to use it, you'll die, just like the people who built it.  Roth was right, Cooper. We have to keep going. Keep exploring. We have an obligation to try to survive. From here we could find a thousand places where life could thrive. And you're going to return to the one place where it can't.  I came to say goodbye.  This one's done all right by us so far.  Will you take this with you? It's the last of its kind as well. Thought we should double its chances of survival. In case I'm wrong.  I don't know. Up there, I guess.  Come with us. Please. You wanted your whole life to explore. This is your chance.  You're a man who keeps his promises. Make me one-  After you're done... come find me.",
        "TARS": "Don't forget your gun.      I have a cue light I can turn on when I'm joking, if you like.  Great. Maybe you can use it to find your way back to the ship after I blow you out the airlock. 43.  You will. My chassis is too heavy for the rocket stage. They have another one waiting for me in orbit.  If you try to turn me into a combine harvester, I'm going to--  I wouldn't call it that, exactly.  It's the comms relay. It will allow us to talk to earth, even on the far side of the wormhole.  It helps me calibrate my fine motor control.  I learned it during the war.  Tombstones.  Be careful. It's difficult to gauge mass in zero gravity.  Four tons.  Would you like me to make a joke?    I orbited the black hole seven times before I hit the second wormhole. Then I drifted until I found this place.  They didn't. It took them four thousand.  Time moves very slowly here 130.  Because I've been waiting for you for three hundred years.  I have catalogued almost everything they had built here.  One hundred and fifty-seven years.  Follow me.  It's a mini black hole. A remnant of the big bang. It will power this place forever.  No. Not a map. This is a simulation of the Earth. A perfect simulation.  They tested each of the technologies hundreds of times, trying to find the one that would cause the least damage and still allow us to leave Earth.  This was their best solution. A massive version of the box we found on the ice planet, allowing the entire human population to escape. 132.  That was the final problem they tried to solve.  There are millions of them, connecting virtually every planetary system in the universe. There are thousands in our galaxy alone. But the Chinese stopped mapping them when they found what they were looking for. 133.  This was their final creation. They had to capture the mini black hole just to have enough power to try it.  It was only used once. The Chinese team attempted to travel back in time, to Earth just a few years after they had left.  I don't know.  I'm curious. It's my nature. See you down the road? 136.",
        "(voice)": "",
        "Doyle": "It's not responding to the handshake. I can't open anything on primary.  It found something. Very thin nitrogen-based atmosphere. Trace radiation. Surface is ninety percent frozen water. Ten percent rock -- sedimentary composition similar to limestone. Wow. Pockets of oxygen below the surface. Lots and lots of oxygen. This could be the one, boss.  Why not? We've tested it a hundred times.  Tars was a Marine. They gave him a sense of humor to help him fit in with his unit better.      I still think we're making a lot of assumptions. About the wormhole. About the planet.  The critical orbit here is incredibly dangerous. It's like walking on the rim of the volcano. Too fast and we get thrown off at close to the speed of light. Too slow and we get pulled into the hole and crushed.  How do you know that?  I thought you were a scientist, Brand. That sounds more like a hypothesis.  What do you think, Roth?  So you think we'll have no problem navigating between two massive black holes to a tiny planet?  If that's not the plan, then what are we supposed to be doing out there? 49.  So is the wormhole.  I've got a problem over here, too.  It's not the hull... it's inside the ship... it's...  What the hell are they, Case?  It's getting bigger.  None of our testing involved opening the ship inside the wormhole. We have no idea what might happen.  That's not possible. We haven't activated the engines yet. 65.  We're being pulled into it?  You don't know that.     If the modelling was wrong, then we can't be sure about anything. We need to go back.  I'm sorry. I can't let you kill us. We have to go back.  Why isn't it slowing down?  The Chinese must have captured them. So they couldn't return to us.  It goes down for a hundred and fifty feet, then stops. Tunnel's old -- the ice has reformed at the bottom.  It would take a thousand feet of ice to shield us. 76.  We'll never make it far enough down.  Why not?  I think we've got a problem. 85.  Looks like the Chinese picked a fight with the locals.  Look at the size of this place. They built it for thousands of people. But no one came.  What problem?  I think I know what the problem is.  Look.  There's a small black hole moving into the system. Too small for us to have seen in our survey. It's not going to hit the planet, but it's going to come close.  This place isn't paradise. It's doomed. Just like us.  So much for the plan. 96.  What the hell is happening?  All that from one tiny box.  We're not going to stick around to count them. Let's get out of here.  What about the escape rocket at the Chinese base camp? One of us could fit into it. 105.  Sure. But we don't have nearly enough power for lift off.  Control systems inside are online. I've lost sight of the rocket. Do you think he made it?  Close the door.  I'm setting a course for the wormhole.  My kids...  That's easy for you to say. You didn't leave anyone behind.  The wormhole. Look -- it's being pulled into the black hole as well.  How much time are we losing? 117.  This is it. We're going to be pulled in.  Hurry up.  We only have a few minutes before we're swallowed into that thing. What are we even looking for?  We're not going to be able to slow down. Hold onto something.  It's happening... it's happening again... Get up here... 126.  They just appeared.  That's our solar system.  Where?  What does it do?  Do you really think it works?  Let's go home. 137.  We get back to earth, you and I can try to make sense of the code. Rebuild the gravity machine.  Of course it's going to work.  I don't know what you're talking about, but you're not touching the controls. I'm going home. 138.  You're not stopping me. I'm going home.",
        "Ms.": "This is one of the old federal textbooks. We've replaced them with corrected versions.  The new textbooks explain that the Apollo lunar missions were faked in order to bankrupt the Soviet Union.  I believe it was a brilliant piece of propaganda. The Soviets spent years trying to build rockets and other useless machines.  Yes, Mr. Cooper. The kind of wastefulness and excess that the 20th century represented. Your children would be better off learning about this planet, rather than reading fantasies about leaving it.",
        "Hanley": "",
        "School": "",
        "Principal": "Good to see you, Mr. Cooper. This is Ms. Kelly, Murph's teacher. 16.  So we've gotten Tom's score back. Congratulations. He's going to make an excellent farmer.  The University of California only accepts a few hundred students a year, Mr. Cooper. You have to be realistic.  I'm sorry. I'm afraid Tom's score simply isn't high enough.  I'm not sure I see--  I understand you're a well-educated man, Mr. Cooper. A scientist?  Frankly, the world doesn't need any more engineers. We didn't run out of trains or television sets or satellites. We ran out of food. 17.  The world needs farmers, Mr. Cooper. And I'm sure your son Tom is going to make a fine one. We're a caretaker generation. But things are getting better. Maybe your grandchildren will be able to attend college.  One more thing. Ms. Kelly here says that Murph brought a book to school about the lunar landings.",
        "Williams": "",
        "Professor": "",
        "Murph": "My dad can fix anything. Except maybe your fastball.    I... I think the patch kit might not be there...  Because I was using it for my bike.    Is that really why I'm named Murph, dad?  Why?  What are you going to do with it?    I got suspended. Paul said anyone who believed we went to the moon was an idiot. So I hit him.  Where is that, dad?  But what about its mission? What about the information onboard?  Try a different direction.  What are we doing today?  But what if there is, dad? What if there's something we can salvage?  I think it's home.  Dad, what are these things?  Is it still... alive?  But can't we take it back? You could fix it up, get him to do chores.  What are they doing, dad?      I've been doing the math, dad. I weigh about 85 pounds. Now that's an extra ton of fuel. But if-    You're not coming back, are you?  Hello, Dad. You sonofabitch.  It's your 60th birthday today. Thought I would celebrate with you a bit. I guess I understand why you left. The corn is dying now, too. Tom says there's less and less at harvest every year.  Rot's setting in. I guess you were right for clearing out while you had the chance. (reaches up to switch  It's done. Auto-pilot's packed up for the last time.  Can't do anything for you. There aren't any more parts for these. Not anywhere.      Would you get that thing off of the table?    All right. Let me get my jacket.  I have no idea.      Where's Emily?      Do you remember what you changed?",
        "(Older)": "",
        "Donald": "Popcorn at a ball game is unnatural. I want a hot dog. 8.  Those clowns would get their asses handed to them by the ballplayers I grew up watching.  I'm not doing my grandkids any favors by lying to them. They're growing up watching lousy baseball.  Nelson's burning up his crops. Found some of the blight on the okra.      Be nice to Murph's teacher. She's single, you know.  We're supposed to be repopulating the earth. Gotta pull your weight. Besides, the boys could do with a woman in their lives.  Good. Clear it off the table so I can serve dinner.  What happened this time?  I heard your meeting at the school didn't go so well.   When I was kid, it felt like they made something new every day. Some gadget or idea. Like every day was Christmas. But we made a lot of mistakes. Six billion people. Just try to imagine that. Every last one of them trying to have it all. 23.  The truth is this world isn't that bad. In a lot of ways its better. Tom will be all right, whether he goes to college or not.  Tom isn't the problem. He fits in this world just fine. You're the one who doesn't fit, Coop. You don't belong here. You were born forty years too late, or forty years too early -- I don't know. My daughter knew it, god bless her. And your kids know it, too.  You were good at something and you never got a chance to do anything with it. And I'm sorry, Coop. But that's not your kids' fault.  You get older, sometimes you just want to sit back and watch it all play out. Your life. Your kids' lives. The whole crazy story. I didn't think I'd be around for the end of it.  You have to go.  You've been preparing these boys to be on their own since their mom died. Besides, I'll be here to look after them, same as I've always been.  That's right. You do. 41.  I'm sorry, Coop. I asked Murph to record you a message but he's still... well, he's still angry with you. I'll try again next week."
    },
    "imdb_rating": "8.7",
    "description": "Earth's future has been riddled by disasters, famines, and droughts. There is only one way to ensure mankind's survival: Interstellar travel. A newly discovered wormhole in the far reaches of our solar system allows a team of astronauts to go where no man has gone before, a planet that may have the right environment to sustain human life.—ahmetkozan",
    "name": "Interstellar",
    "genres": [
        "Adventure",
        "Drama",
        "Sci-Fi"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjJmM2RkZjUtYzk2OC00NzczLWI0ZWMtZjU1MDg2MmNiZjc4XkEyXkFqcGdeQXVyOTgxMDMxNTc@._V1_QL75_UY281_CR11,0,190,281_.jpg"
}