{
    "filename": "Into-the-Woods_script.txt",
    "imdb_id": "tt2180411",
    "imdb_url": "https://www.imdb.com/title/tt2180411",
    "characters": [
        "Baker's Father",
        "Little Red Riding Hood",
        "Lucinda",
        "Rapunzel's Prince",
        "Baker's Wife",
        "Jack",
        "Baker /Narrator",
        "Cinderella",
        "Jack's Mother",
        "Witch",
        "Stepmother",
        "Florinda",
        "Wolf",
        "Rapunzel",
        "Cinderella's Mother"
    ],
    "dialogues": {
        "Baker's": "The STEPFAMILY'S carriage is passing through a large hollowed opening in the base of a huge tree. We can hear the STEPSISTERS bickering, their blonde hair bobbing animatedly.  Jack! Jack!  Son.  I'm sorry. I did a foolish thing.  They were there and I wanted them. I didn't think. I was being careless --    When your mother died, I was... I hated myself and I ran from my guilt and my shame...  Yes, and my son. And I'm sorry for that.  I never expected...  Aren't you making the same mistake?  Aren't you running away? (the Baker looks",
        "Father": "Son.  I'm sorry. I did a foolish thing.  They were there and I wanted them. I didn't think. I was being careless --    When your mother died, I was... I hated myself and I ran from my guilt and my shame...  Yes, and my son. And I'm sorry for that.  I never expected...  Aren't you making the same mistake?  Aren't you running away? (the Baker looks",
        "Lucinda": "Cinderella!  We are waiting!  (pointing to her    She means me.       Yes. The steeple tower. We saw him there!",
        "Rapunzel's": "",
        "Prince": "They roar in derision.    An exquisite tower, surrounded by a thicket of tall rose bushes, with no entryway, just a lone window at its peak. At the bottom of the tower, the WITCH looks upward:   Rapunzel...  Rapunzel...  I must find that girl!  Have you seen a beautiful young woman in a ball gown pass through?                    Good brother. I was wondering where you'd gone.  I have been looking all night for her.  Her?  The beautiful one I danced the evening with.  Where did she go?  Disappeared, like the fine morning mist.  She was lovely?  The loveliest.  I am not certain of that! I must confess, I too have found a lovely maiden. She lives here in the woods.     Yes! In the top of a tall tower that has no door or stairs.  Where?  Two leagues from here, due east, just beyond the mossy knoll near the rose thickets.  And how do you manage a visit?  I stand beneath her tower and say, \"Rapunzel, Rapunzel, let down your hair to me.\" And then she lowers the longest, most beautiful head of hair - yellow as corn - which I climb.  Rapunzel, Rapunzel! What kind of name is that? You jest! I have never heard of such a thing.  I speak the truth! She is as true as your maiden. A maiden running from a prince? None would run from us.  Yet one has.                              Over here!  Who is she? Where did she go?  Don't play the fool, woman!  I can capture my own damsel, thank you.  Well, what are you waiting for? See if you can find her.  The woods can be a dangerous place...              The ball is over. Send everyone home.  She won't get far with one shoe.  Do as she says, Steward. We only need one.     This very night!  Have you no other daughters?  I would recognize these beautiful eyes anywhere. This is the true bride!  Rapunzel? Rapunzel?  Rapunzel? Is it you?     I can see you!  There's no need for worry. It was an earthquake in a far-off quadrant of our kingdom. Nothing to fear at all. As many of you know, we had another little shaker just days ago. I will personally investigate the disturbance. Now everyone, back to your villages, and on with your lives!  My darling. Are you all right? Why did you run off?  You never have to be afraid. Now come with me.  You! The one who blinded me.       Hello.  The Giant?  Of course. A giant.  I should think. And why are you alone in the woods?  He would let you roam alone in the woods?  How brave.  Yes./ ANYTHING CAN HAPPEN IN THE    Well, yes, I do.  Of course, you're right. How foolish./    I must leave you.  Now I must go off to slay a giant. I shall not forget you. How brave you are to be alone in the woods. And how alive you've made me feel.             My darling! I did not recognize you. What are you doing here? And with a child? You must go back to the castle at once. There's a giant on the loose.  My love. What is it?      I thought if you were mine, that I would never wish for more.  I was raised to be charming, not sincere.  I'm not going to leave you.  Is that what you really wish?  I shall always love the maiden who ran away.",
        "Wife": "Hard-working and honest, he is kneading the dough which she then takes and puts in the oven.                  You're certain of your way?  Now, don't stray and be late!     We have no bread.  What curse?      Lost what?  Beans?  Here. Take this...  Why?  Look!  Beans. The Witch's beans! We'll take them with us.  I can help you.    You don't remember?!       (giving him a little    You forgot your scarf.  I want to help.            She must be generous of milk to fetch five pounds?  And if you can't fetch that sum? Then what are you to do?  (loudly, for the benefit of the boy Beans? We mustn't give up our beans! Well, if you feel we must...  Oh, these are no ordinary beans, son. These beans carry...magic.     Five! They're worth a pound each, at least.  Yes.  I was just trying to help.  No one would have given him more for this creature. We did him a favor. At least they'll have some food.  Do we want a child or not?  We have one chance. Don't you see that? And if we fail...  Why do you say that?  You're not him.  If you can't do this for yourself, can't you at least do it for me?    Are you alright, miss?  What a beautiful gown you're wearing. Were you at the King's Festival?  Aren't you the lucky one. Why ever are you in the woods at this hour?  (Breathless as she  I've never lied to royalty before. I've never anything to royalty before!  If a prince were looking for me, I certainly wouldn't hide.  Oh, my husband's somewhere in the woods. He's undoing a spell.  Oh, yes. But tell me, the Prince, what was he like?                    But why would you run away?  Princes, castles, gowns...  But you will return to the Festival tomorrow eve?  You don't know? What I wouldn't give to be in your shoes. (looking to her  Wait! I need your shoes!  Milky-White!  Already?!  Well...  I see you've got the red cape!        She ran away. I never reached home. I've been looking for her all night.  She might just as easily have run from you!    I'm sorry I lost the cow.  PULL BACK to reveal the PRINCES side by side on a precipice, overlooking the distant castle.  Rapunzel, Rapunzel? Let your hair down to me.  (in her best princely  Excuse me for this.     I was trying to hold her here for you...  Yes, of course.  Oh! It's you! And you've the cow!  Three.  Three!  Compare this to your corn.     And I almost had the fourth, but she got away.  We? You mean you're going to let me stay with you?      A golden egg! I've never seen a golden egg.  Five gold pieces?  You took five gold pieces?! I didn't take, you gave.  Where are the five gold pieces?  Now I never said you could. I You would take money before a said you might. child?!  You can start by buying a new cow with the money you took from the boy.  You go to the next village, you'll find a cow there.  I'm going to get the slipper.  The GOLDEN slipper!  I have met a maiden with golden slippers these two previous nights.  Yes, I'm sure of it. I'll meet you back here.  Because we have to if we're going to be together...  What is happening?  Please, stop! Just hear me out!  I didn't attack you. I attacked your shoe. I need it. I have a magic bean in exchange for it.  Wait, please. I haven't much time! I need that shoe to have a child.  Does it make sense that you're running from a prince?  (starts to take off a  Thank you! Thank you!    It's mine.      Please give me the slipper, kind Prince, and all will come to a happy end.   Thank you. Thank you!    I've found you!  You've got the cow!  We've all four!  And the hair as yellow as corn.  We've got them all.  Of course she is.  She has to be!   What? You didn't get a real white cow?  She's dead.  We're running out of time!  What?  Wait! We followed your instructions. One, the cow is as white as milk. Correct?  And two, the cape was certainly as red as blood.  And three, the slipper--  I pulled it from a maiden in a tower  Well, nothing. I happened to be     It's working!   Thanks for the slipper.  I think so.  Yes, he's fine.  What's happened? Everything's so different.  Calm down.  Yes.  Please take him for a few moments.  You needn't hold him as if he was so fragile.  I can't take care of him all of the time.  Who might that be?  No!   I think it best we get back to the village. We'll take the girl with us.  You come with us.  It's a giant!  Look! What have you done to her?  Jack! Jack!  We should fan out. It'll increase our chances.  I'll be all right.  We'll count our steps from right here.  No. You stay with the baby.  Yes. He's asleep. He'll be safe with the girl.  See?  What if, what if! Five hundred paces. Go!  One, two...     One eighty-one...one eighty-two... one eighty-three... one eighty-four... (looks up; startled; Hello, Your Royal Highness.  You must be here to slay the Giant.  Yes. Surely you've heard there is a giant in our midst. Not an earthquake...  Yes, it's a lady giant. Unusual, huh?  I came with my husband. We were ... well you see ... it's a long story.  No, actually it was my choice.  Brave?      Wait one moment, please! We can't do this! You have a Princess!  And I have a...baker.     What was that?/ WAS THAT ME?/ WAS THAT             One eighty-four... one eighty-three... one eighty-two...",
        "Jack": "A spaced-out twelve year-old who is trying to pull his bony cow MILKY-WHITE towards his dilapidated cottage.                                         What in heaven's name are you doing with the cow inside the house?  I thought if he was nice and warm he might produce some milk.  It's a she! How many times must I tell you? Only shes can give milk!       Birds flying en masse over their house.     Bullseye!  What are you doing? Stop your pretending!  Now listen to me well, son. Milky-White must be taken to market.  Mother, no-- he's the best cow in the  Was. She's been dry for weeks. We've no food or money and no choice but to sell her.  But Milky-White is my best friend!  Look at her!         Why do I have to go to the next village?  Because everyone in this village knows the cow hasn't given a drop of milk in weeks.  But that's cheating.  We're starving, Jack. Don't you understand that? You're not to take less than five pounds for her. Are you listening to me?     How much are you to ask?  No more than five pounds.  Less! Than five. ... than five! She lets go and puts the COW'S leash in his hand and pushes him down the road towards the woods.                   Hello, sir.  I was heading toward market -- but I seem to have lost my way.  Sell my cow, sir. No less than five pounds.     I hadn't thought of that...  Beans in exchange for my cow?  Magic? What kind of magic?  How many beans?  Could I buy my cow back someday?  One day, I'll buy you back -- Promise!        But they're magic -- the man said --  Get your head out of the clouds!  Mother -- no!     You and your worthless adventures! Will you never learn, Jack?! To bed without supper for you!              Good fortune! Good fortune, sir! Look what I have! Five gold pieces.                            So, here's your money, sir! Five gold pieces. Where is my Milky-White?  Let's go find them!  But you said I could buy her back. Do you want more money?     Stop it! Stop my egg!  Oh, brilliant! My Milky-White. And the owners. And my egg!  From the Giant's hen!  And you can have it. Along with the five gold pieces.  Now I'm taking my cow.      You said I could have my cow!        Hey there - nice cape!  Whoa! I don't want it. Where did you get it?  Well, look what I have! A golden egg.   I stole a hen that lays golden eggs from the kingdom of the Giant.  It's true. And you should see the Giant's toy harp. It plays the most beautiful tunes without your even having to touch it.  I could.  I could!  I am not a liar! I'll get that harp. You'll see!     Jack! There you are! I've been worried sick about you! There's a dead giant in our backyard!  There is?  You know there is. You could have been crushed!  But Mother, look. The most beautiful harp.     You could have been killed coming down that plant.  What's happening?     Wow!  Milky-White. You're back! I missed you so much!  I'll do it. She'll only milk for me.  Squeeze, pal! You can do it.  The corn! The corn!  You can use the silky hair of the corn--  She's milking!  Jack? Jack...?  Jack! Has anyone seen my Jack? He ran off again and I've been...  Jack is just a lad! We had no food to eat so he sold his beloved cow in exchange for magic beans.  You leave my boy alone!     You big bully! I'll hide my son and you'll never find him. You'll never, ever...  Promise me you won't let them get Jack. Promise!  You're hurting me!  Make her stop!  I'm sorry, sir...  I'm sorry. I came upon her. She was at the bottom of a cliff...                                             Maybe I shouldn't have stolen from the Giant...  Where are you going?  We need your help.  If there were just some way we could surprise the Giant.  He wouldn't leave his baby.  What? No!  I'm excited.  You needn't worry -- this is easier than a beanstalk.  Wait until my mother hears I've slain the Giant.  What?  Was she killed by the Giant?  The Steward will pay for this.  After we slay the Giant, I will slay him.  What he done was wrong. He should be punished.          Here I am!  Ready!  Over here!  Where is he?  Help me. Help me!  What home? I have no one to take care of me.",
        "Baker": "Once upon a time, in a far off kingdom, there lay a small village at the edge of the woods...  And in this village...  ... lived a young maiden...  ... a care-free young lad...     ... and a childless baker...  Hard-working and honest, he is kneading the dough which she then takes and puts in the oven.    ... with his Wife-- \"                             The poor girl's parents had died--  And now she lived with her stepmother...  ...who had two daughters of her own.  All three were beautiful of face, but vile and black of heart.  The young lad had no father, and his  Well, she was at her wit's end--     And then there was a hungry little girl who always wore a red cape...  Hey!     I don't suppose you're planning on buying any of these?  And you might save some of those sweets for Granny.     Who might that be?     Then what is it you wish?  What are you talking about?        I had a brother?  Where is she?  Beans?               How could you do that to me?   I'm so sorry...          I'm not wearing that.  It was my father's. You heard what she said. This is all his fault.  I want nothing to do with him!     No. I can do this on my own.    Now tell me. What am I to return with?                   Deep within the woods, Cinderella had planted a branch at the grave of her mother. And she visited there so often, and wept so much, that her tears watered it until it had become a magnificent tree.  On her path to Granny's, the little girl suddenly found herself in a very unusual part of the wood.  You frightened me!  How am I supposed to get it?  I can't just take a cloak from a little girl. Why don't you take it!  This is ridiculous!  Hello there little girl.  Have you saved some of those sweets for Granny?  So I see! Now tell me...where did you get that beautiful cape?  Is that right? I would love a red cape like that.  May I take a look at it?  I need it badly.  I'm sorry. I just wanted to make sure that you really loved this cape. Now off you go to Granny's -- and be careful that no wolf comes your way.     What are you doing here?  You shouldn't be here. It's not safe in these woods!  No! THE SPELL IS ON MY HOUSE--    Hello there, young lad.  What might you be doing with a cow in the middle of the forest?  And what are you planning to do there?  Five pounds! Where are we to get five pounds?     Huh?  Magic that defies description.  Six.     ...possibly. Here.  Good luck there, young lad.  Take the cow and go home!  Magic beans! We've no reason to believe they're magic! Are we going to dispel this curse through deceit?  Five beans?!  Of course. But...  I'm just not sure I'm cut out to be a father.  Because of my father.  I don't know...  All right. You take the cow and go home. I'll find the rest of the things. On my own.  The old enchantress had given the name Rapunzel to the child she had hidden away and locked in a a doorless tower. But little did she know that the girl's lilting voice had caught the attention of a handsome Prince.\"  As the little girl approached her Granny's oak tree, she was surprised to see the door standing open.  And with a single bound, the wolf had devoured the little girl. Well, it was a full day of eating for both.  I can't believe I just did that.  No thanks!  I'm a baker.  You need to be more careful, young lady.  Are you certain?  Thank you. Thank you!  The first night of the festival ball brought Cinderella her wish. The Prince danced only with her, `til he turned and she had slipped away.        A giant?     Wait a minute! I'm not sure I want to sell.  No, no, no! It's not that--  Wait. I didn't say--  Hey, come back!  What are you doing here?  Yes. I've got the cape. Only two items left.  Two. We've the cape and the cow.  What have you done with the cow?!     But she didn't!    We were just going to do that. Here.  You can have this--  I don't like that woman.  I shouldn't have yelled.  Go back to the village. I will make things right. And then we can just go about our life. No more witches or dim- witted boys or hungry little girls.  GO!, please -- go.  As the Baker's Wife bolted from the tower, the second night of the festival was thrown into chaos when Cinderella once again ran from the Prince.  Moo... Moo......  The STEPFAMILY'S carriage is passing through a large hollowed opening in the base of a huge tree. We can hear the STEPSISTERS bickering, their blonde hair bobbing animatedly.  Please, if you would be so kind, may I compare this ear of corn with your hair?  Milky-White!  I thought you were returning home!     Two.  Where did you find it?  Three!  We've one entire day left. Surely we can locate the slipper by then.  Well...perhaps it will take the two of us to have this child.      Where did you get this?      You took five gold pieces?! I didn't take, you gave.  Now I never said you could. I You would take money before a said you might. child?!  No, no, no - it's not how it sounds!  When dawn broke, the Baker and his Wife had but one day left to reverse the Witch's curse. As for Rapunzel's Prince, he returned yet again to the forbidden tower.  Jack took the little girl's dare and before he knew it, found himself fleeing from a Giant.  We've only one day left! I don't know where to start.  Right, where do I buy a cow?  What are you going to do?  The yellow slipper?  Yes. The golden slipper, that's what I meant. How are you going to get it?  You think you could get one?  Right. Why are we always separating?  The entire kingdom shook when the beanstalk came crashing down, killing the Giant...  ...as for Cinderella, she fled from the Prince... again.  And in her haste, the Baker's Wife took no notice of a second beanstalk climbing skyward.  As the Prince anxiously waited, the Stepmother took matters -- and Florinda's foot -- into her own hands.  Minus one toe, Florinda mounted the Prince's horse, unaware of the blood dripping from the slipper.  Lucinda was next.  Minus a heel, Lucinda did her best to swallow the pain.  As punishment for their cruelty, Cinderella's birds swooped down upon the Stepsisters... and blinded them.  As for Rapunzel, the Witch had banished her to a swamp in the darkest depths of the forest.   Come on! We don't have any time...  You've got the slipper!  And the cape as red as blood.  We've done it!  We had a cow as white as milk. Honestly we did.  And we thought you'd prefer a live cow.  It's here...  She's going to bring Milky-White back to life.  She's a witch! She can do anything!  It's almost midnight!  And four, I compared the hair with this ear of corn.     What?  That was quick!  And it came to pass, all that seemed wrong was now right. The Witch succeeded in reversing her mother's curse. Cinderella finally stopped running from her Prince.  Jack was reunited with his beloved cow and his mother could now dress in the best a golden egg could buy.  And the Baker and his Wife were proud parents of a strapping baby boy.  And so with the kingdom filled with joy, those who deserved to were destined to live happily ever...     And the baby?  But as they made their way back into the woods, their familiar paths were nowhere to be found and their lives were about to take an unexpected turn.  Hello, little one. Are you alright? What are you doing here? With a suitcase?  What do you mean?  We can help you find Granny's without the path.  Why does he always cry when I hold him?  He doesn't want me. He wants his mother!  I'll take care of him -- when he's older...  It's the Steward and the royal family.  What brings you into the woods?  What is the Royal family going to do?  A giant woman!  We haven't seen him.  Don't upset the Giant!  Listen everyone. If we're going to get through this we have to stick together.  Okay, I promise.  Jack! Jack!  We're never going to find him.  No. You can't be on your own.  What if we get lost?   You would leave our son with her?  But what if the Giant comes back...  Wait! Take this. It might be cold.     Four eighty two... four eighty three... Excuse me, ma'am. Have you seen a boy... (notices she is     Earthquake? It's no earthquake -- there's a giant terrorizing the kingdom!  Hah, the Prince? No doubt he's off somewhere seducing some young maiden.  You look just like the Princess -- but dirty. Oh no, you are the Princess!  I'm sorry. I didn't recognize you.  If you'd like you can come with me. You will be safe in our company.  This way.    She should be back by now.  No, I must go and look for her--  Let go of him!  (at the top of his  Where did you find this?  It's my wife's!  What are you saying?  No. No...!  This is my fault. I let her wander off alone. I should have made her stay with me.     Yes! He's the one to blame! It's because of you there's a giant in our midst and my wife is dead!                                (to JACK)         Away from here.  It doesn't matter whether we're together or apart.  You don't understand. My wife was the one who helped. I depended on her for everything.     Son.  What are you doing here?  I don't want to talk to you. It's because of you all of this happened. Go away!  I'm sorry. I did a foolish thing.  Why would you do that? Why did you take the Witch's beans?  They were there and I wanted them. I didn't think. I was being careless --  -- Selfish.    You stole them and you were caught, and then you did what you do. You just ran away.  When your mother died, I was... I hated myself and I ran from my guilt and my shame...  ... and your son.  Yes, and my son. And I'm sorry for that.  If you're looking for forgiveness, you're not going to get it.  I never expected...  Then what do you want?  Aren't you making the same mistake?  Aren't you running away? (the Baker looks  Give me my son.  (pulling the baby close to comfort  We need to rid this kingdom of the Giant -- together.  She'll be back soon; here's the plan. We're going to feed Jack to the Giant.  We're going to use you as bait to lure the Giant towards the tar pit.  Okay, we don't have much time.  Here's what we're going to do...  Careful, there. Not so fast.  Jack, there's something you have to know. Your mother...  She didn't make it.  No. It wasn't like that. She was fighting with the Giant, trying to protect you, and she was pushed by the Steward -- and -- she fell.  No, Jack --  You'll do nothing of the kind.  It's not as easy as that.                                Go, Jack! Be careful.   Ready?  Jack, Jack!  Jack, I'm here.   Are you okay? Are you alright? We did it! We did it! Come here.  Now we can all return home.    -- of course you can come home with me.  If you want to.  Here -- give him to me.   Hey, hey, hey, come on now. Hey, please, come on, come on, it's okay. I know you miss your mother.  I miss her too.  Sssh!          Shhhh.  Once upon a time...in a far CAREFUL THE THINGS YOU SAY,/ off kingdom...there lay a CHILDREN WILL LISTEN./ small village at the edge of CAREFUL THE THINGS YOU DO,/ the woods... And in this CHILDREN WILL SEE./ AND village lived a young LEARN. maiden...a carefree young lad...and a childless baker...with his wife. LRRH, JACK, and CINDERELLA join the BAKER.",
        "/Narrator": "",
        "Cinderella": "FLORINDA pulls at one of LUCINDA'S bows.  LUCINDA eyes FLORINDA'S hair.                      The festival lasts three nights. Surely you can let me be there for one of them.                                   Thank you, Mother.     Yes.  Please. Don't let them know I'm here.  Thank you.  Well, what brings you here -- and with a cow?                         It's not quite what I expected.  I have no experience with those things.  Yes... No... I don't know...  I must get home.          Don't come any closer to me!  You have attacked me once before.  Magic bean? Nonsense!  That makes no sense!  I must go!                      The tree has fallen. Mother's grave, destroyed.  I shouldn't complain. I'm sure others have suffered worse after the earthquake.  Well, I'm sure the Prince will see to it that the Giant is rid from our land.   What?  Please. Please... Get up! I'm not a princess here.  I had to disguise myself. I'm not permitted to leave the palace unescorted.  Thank you.  I'm sure she'll return.  How awful...  Keep away from him.                           (to JACK)          Maybe I shouldn't have attended the Ball...  You would leave your child?  But wait...  I knew you wouldn't give up.  What? No!  The birds can help! Oh good friends we need your help more than ever. What of the prince?  That doesn't matter now! What's important is that we find a way to defeat the Giant. Oh yes, thank you birds.  The birds will do their part.  Your father's being very brave. We're going to be very brave too.   The Giant went in that direction.  I'm well aware of that.  Maybe I'm not your only love.  If you love me, why did you stray?  If this is how you behave as a prince, what kind of king will you be?  I think you should go.  Consider that I've been lost. A victim of the Giant.  My father's house was a nightmare. Your house was a dream. Now I want something in-between.  And I the faraway prince.  I'm glad you're here to help me.  What's wrong?  Why?  Not somebody. A giant who's done a lot of harm.    I know.                                   Good birds!  Where are they?  Jack?  Oh, be careful, are you alright?  He's not with you?  Let me take him.  I'll gladly help you with your house. There are times when I actually enjoy cleaning.",
        "Jack's": "What in heaven's name are you doing with the cow inside the house?  It's a she! How many times must I tell you? Only shes can give milk!     Birds flying en masse over their house.     What are you doing? Stop your pretending!  Now listen to me well, son. Milky-White must be taken to market.  Was. She's been dry for weeks. We've no food or money and no choice but to sell her.  Look at her!       Because everyone in this village knows the cow hasn't given a drop of milk in weeks.  We're starving, Jack. Don't you understand that? You're not to take less than five pounds for her. Are you listening to me?  How much are you to ask?  Less! Than five. ... than five! She lets go and puts the COW'S leash in his hand and pushes him down the road towards the woods.                  Get your head out of the clouds!     You and your worthless adventures! Will you never learn, Jack?! To bed without supper for you!              Jack! There you are! I've been worried sick about you! There's a dead giant in our backyard!  You know there is. You could have been crushed!     You could have been killed coming down that plant.  Jack? Jack...?  Jack! Has anyone seen my Jack? He ran off again and I've been...  Jack is just a lad! We had no food to eat so he sold his beloved cow in exchange for magic beans.  You leave my boy alone!     You big bully! I'll hide my son and you'll never find him. You'll never, ever...  Promise me you won't let them get Jack. Promise!",
        "Mother": "What in heaven's name are you doing with the cow inside the house?  It's a she! How many times must I tell you? Only shes can give milk!     Birds flying en masse over their house.  What are you doing? Stop your pretending!  Now listen to me well, son. Milky-White must be taken to market.  Was. She's been dry for weeks. We've no food or money and no choice but to sell her.  Look at her!    She shoves the entire bun into her mouth.          Because everyone in this village knows the cow hasn't given a drop of milk in weeks.  We're starving, Jack. Don't you understand that? You're not to take less than five pounds for her. Are you listening to me?  How much are you to ask?  Less! Than five. ... than five! She lets go and puts the COW'S leash in his hand and pushes him down the road towards the woods.    Ladies. Our carriage awaits!  The Festival! DARLING, THOSE NAILS!/  The King is trying to find his son a wife -- not a scullery maid! We must be gone!                 What is it that you wish, child?                 Get your head out of the clouds!  You and your worthless adventures! Will you never learn, Jack?! To bed without supper for you!    Mongrel!  Carry on!        It's a perfect fit, Your Highness!  Only a little stunted kitchen wench, which her late father left behind but she cannot present herself. She is too dirty.  Jack! There you are! I've been worried sick about you! There's a dead giant in our backyard!  You know there is. You could have been crushed!     You could have been killed coming down that plant.  Jack? Jack...?  The kingdom is under attack.  How dare you? She wants the boy!  Jack! Has anyone seen my Jack? He ran off again and I've been...  Jack is just a lad! We had no food to eat so he sold his beloved cow in exchange for magic beans.  You leave my boy alone!     You big bully! I'll hide my son and you'll never find him. You'll never, ever...  Yes, that's true.     Promise me you won't let them get Jack. Promise!",
        "Witch": "I don't want your bread.  It's not what I wish. It's what you wish.  Nothing cooking in that belly now, is there? And there will never be...  Unless you do exactly as I say. In three days' time, a Blue Moon will appear. Only then can the curse be undone.  The one I placed on this house!  In the past, when you were no more than a babe, your father brought his young wife and you to this cottage. They were a lovely couple. But not lovely neighbors. You see, your mother was with child and she developed an unusual appetite. She admired my beautiful garden and she told your father that what she wanted, more than anything in the world was--     In the moonlight, we see the BAKER'S FATHER, wearing a hunting jacket, scale over the WITCH'S wall and into her garden. From behind a wooden trellis, she WATCHES him as he gathers her greens:             No. But you had a sister.  She's mine now and you'll never find her! Small price to pay for what else your father stole from me. It cost me my youth, my beauty. My mother warned me she would punish me with the curse of ugliness if I ever lost them.                    And when your mother died, your father deserted you. Your father was no father -- so why should you be?            Why are you standing there?! Go get the cape!  Get it! Get it! Get it!  You go up to the little thing, and you take it.  It's the rules. Why do you think I asked you in the first place? I'm not allowed to touch any of the objects!     Rapunzel. Rapunzel. Let down your hair to me.  Don't you look lovely today, my dear.  I brought your favorite. Blackberries, fresh from the garden.  One midnight gone!  Get that cow!                        I gave you protection and yet you disobeyed me.  Your prince will never lay eyes on you again. He will never lay eyes on anything again!  It doesn't matter because where you're going, no one will ever see you again.  I see a cow. I see a slipper.  Wait a minute! That cow doesn't look as white as milk to me.  This cow has been covered with flour!  Then where is she?  Of course I'd prefer a live cow! So show me the dead cow and I'll bring her back to life!  Stand back!  Quiet! Feed the objects to the cow.  You heard me! Feed them to the cow!  Fill this!  Wrong ingredients. Forget about a child!  Yes.  Yes.  Yes.  You what?! What were you doing there?  I touched that hair! I told you! I cannot have touched the ingredients!  Yes! Pull it from the ear and feed it to the cow. Quickly!  At last!  We'll get him for you right away. Don't move!  Would you like a blind girl instead?  Not always.  I don't know where they think they're going. The giant's already destroyed the entire village. Only thing left of my garden are these beans.  We have no choice. Find the boy and give her what she wants.  And if we don't she'll kill half the kingdom!  Rapunzel! You're safe! Thank goodness.  Surely you remember? Of course you don't recognize me!  This is who I truly am, my dear. Now you don't have to be embarrassed by me. You must come with me. There's a Giant in the land.  She's not going with you! You will come with me.  Then you leave me no choice.     I was just trying to be a good mother!  Rapunzel, no! You will never be safe with him.  No! Rapunzel!       Look who I found!  I'll let go of him when I give him to the Giant.     Wake up! When you're dead, you're dead.  Now it's time to get this boy to the Giant before we're all--  This is no time to be soft-hearted! He's going to the Giant and I'm taking him.      Shhhhhhh!      No?/ YOU'RE SO NICE./ YOU'RE NOT              Once upon a time...in a far CAREFUL THE THINGS YOU SAY,/ off kingdom...there lay a CHILDREN WILL LISTEN./ small village at the edge of CAREFUL THE THINGS YOU DO,/ the woods... And in this CHILDREN WILL SEE./ AND village lived a young LEARN. maiden...a carefree young lad...and a childless baker...with his wife. LRRH, JACK, and CINDERELLA join the BAKER.",
        "Stepmother": "Ladies. Our carriage awaits!  The Festival! DARLING, THOSE NAILS!/  The King is trying to find his son a wife -- not a scullery maid! We must be gone!  Mongrel!  Carry on!        It's a perfect fit, Your Highness!  Only a little stunted kitchen wench, which her late father left behind but she cannot present herself. She is too dirty.  The kingdom is under attack.  How dare you? She wants the boy!  Yes, that's true.",
        "Florinda": "Get up here!      I know.  No, she didn't!  Tighter!  Ow! Not that tight! Clod!         Yes. The steeple tower. We saw him there!",
        "Wolf": "Branches and leaves rush by in a blur. Suddenly, the CAMERA stops, and in the distance we see LRRH strolling down a path of exotic flowers as she munches on a treat. We hear HEAVY BREATHING. The CAMERA continues stalking its prey, moving closer towards LRRH through the brush. ANGLE on LRRH, as she continues walking and eating.  Good day, young lady.  Whither away so hurriedly?  And what might be in your basket?  And where might your Grandmother live?                For Granny.  Goodbye, little girl./ AND HELLO...   Come in, my deary.  The better to hear you with, my dear.",
        "Rapunzel": "Thank you, Mother.                No, no, please!  No!  No!  No!  I'm no longer a child. I wish to see the world.  No!  What did you do to him?  She looks up and cries with delight when she sees her PRINCE across the water.  My darling!  How could she do this to you?  What?     Who are you?     I was afraid.  I will not come with you!       ...and then banished me to an island -- in the middle of a swamp!  Take me away from here.  Don't you understand? I never want to see you again. Ever!",
        "Cinderella's": ""
    },
    "imdb_rating": "5.9",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTY4MzQ4OTY3NF5BMl5BanBnXkFtZTgwNjM5MDI3MjE@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Into the Woods is a modern twist on the beloved Brothers Grimm fairy tales in a musical format that follows the classic tales of Cinderella, Little Red Riding Hood, Jack and the Beanstalk, and Rapunzel, all tied together by the couple from the tale of Rapunzel, here a baker and his wife, and their wish to begin a family tied up with the witch who has put a curse on them.—Anonymous",
    "name": "Into the Woods",
    "genres": [
        "Adventure",
        "Comedy",
        "Drama"
    ]
}