{
    "filename": "It's-a-Wonderful-Life_script.txt",
    "imdb_id": "tt0038650",
    "imdb_url": "https://www.imdb.com/title/tt0038650",
    "characters": [
        "Cousin Tilly",
        "Violet",
        "Mr. Gower",
        "George Bailey",
        "Pa Bailey",
        "Mary Hatch",
        "Mrs. Bailey",
        "Mr. Potter",
        "Harry Bailey",
        "Clarence",
        "Ernie",
        "Sam Wainwright",
        "Uncle Billy",
        "Bert",
        "Ruth Dakin"
    ],
    "dialogues": {
        "Cousin": "Uncle Billy... telephone.  Bank examiner.  Parlez-vous francais? Hey, send us some of them picture postcards, will you, George?  Hey, George, your suitcase is leaking. George waves up at them and continues on across the street.  What happened? We heard a lot of yelling.    Fifty-six!  Here they come!  I wish they were rabbits.      Mrs. Bailey is on the phone.  George! George! It's Harry now on long distance from Washington!  He reversed the charges. It's okay, isn't it?  Wait till Martha hears about this.  What did they have to eat?  In a plane?  No, he stopped at the bank first.        George, shall we hang up?  Hurry, Uncle Billy, hurry. Long distance, Washington.  Hey, here's Harry on the phone.  Harry, your nephew, remember?    Yeah, he's in his office.  He had it on his desk counting it before he closed up.",
        "Tilly": "Uncle Billy... telephone.  Bank examiner.  Hey, George, your suitcase is leaking. George waves up at them and continues on across the street.    Fifty-six!  Here they come!  I wish they were rabbits.    Mrs. Bailey is on the phone.  Wait till Martha hears about this.  No, he stopped at the bank first.  George, shall we hang up?  Hurry, Uncle Billy, hurry. Long distance, Washington.  Harry, your nephew, remember?  Yeah, he's in his office.",
        "Violet": "(then, flatly, as she sees Mary  She was here first.  Please, Georgie.        Good afternoon, Mr. Bailey.     Oh, this old thing? Why, I only wear it when I don't care how I look.    Hey, George...  Hello, what am I bid?      I think I got a date. But stick around, fellows, just in case, huh?    Hello, Georgie-Porgie.    What gives?  Where are you going?  George, don't you ever get tired of just reading about things?      Huh?      George, can I see you for a second?       No, George, don't...  I know, but...    I'm glad I know you, George Bailey.  Yeah  yeah... sure I will.  Merry Christmas, George.  I'm not going to go, George. I changed my mind.",
        "Gower": "I owe everything to George Bailey. Help him, dear Father.  You're late.  George! George!  You're not paid to be a canary.  No.  No.  Take these capsules over to Mrs. Blaine's.  She's waiting for them.  Ummmm...  Yes  charge.  Aw, get going!      Where's Mrs. Blaine's box of capsules?    What kind of tricks are you playing, anyway? Why didn't you deliver them right away? Don't you know that boy's very sick?    You lazy loafer!  No... No... No...    Oh, George.    Aw, forget it.  Hope you enjoy it.  No. No.",
        "George": "I'm coming, Harry.  Make a chain, gang! A chain!  Mr. Potter!  So long!  Wish I had a million dollars.  Hot dog!  (calling toward back room  Yes, sir.  Two cents worth of shoelaces?    Here you are.      Made up your mind yet?  With coconuts?  You don't like coconuts!  Say, brainless, don't you know where coconuts come from?  Lookit here  from Tahiti  Fiji Islands, the Coral Sea!  Of course you never. Only us explorers can get it. I've been nominated for membership in the National Geographic Society.    I'm going out exploring some day, you watch. And I'm going to have a couple of harems, and maybe three or four wives.  Wait and see.  Yes, sir.  No, sir.  Mr. Gower, do you want something... Anything?  Anything I can do back here?  I'll get them, sir.  Yes, sir. They have the diphtheria there, haven't they, sir?  Is it a charge, sir?  Mr. Gower, I think...  Yes, sir.  Got to see Pop, Uncle Billy.  It's important.    Pop!  Pop!  He's not a failure! You can't say that about my father!  You're not! You're the biggest man in town!  Bigger'n him!  Bigger'n everybody.  Don't let him say that about you, Pop.  Capsules...          Just look and see what you did. Look at the bottle you took the powder from. It's poison!  I tell you, it's poison!  I know you feel bad... and...  Don't hurt my sore ear again.  Don't hurt my ear again!  Mr. Gower, I won't ever tell anyone. I know what you're feeling. I won't ever tell a soul. Hope to die, I won't.  Nope. Nope. Nope. Nope. Now, look, Joe.  Now, look, I... I want a big one.  Big - see!  I don't want one for one night.  I want something for a thousand and one nights, with plenty of room for labels from Italy and Baghdad, Samarkand... a great big one.  Now you're talkin'. Gee whiz, I could use this as a raft in case the boat sunk. How much does this cost?  That's my trick ear, Joe. It sounded as if you said no charge.      I'm working across on a cattle boat.    Mr. Gower... Mr. Gower... thanks ever so much for the bag. It's just exactly what I wanted.  Oh, it's wonderful.  Oh... Oh. Wish I had a million dollars.  Hot dog!  Hey, Ernie!  Hi, Bert.  Ernie, I'm a rich tourist today. How about driving me home in style?  Hello, Violet. Hey, you look good. That's some dress you got on there.       Okay, Mom.  Boy, oh, boy, oh, boy  my last meal at the old Bailey boarding house.  Oh, let him have the plates, Mother.  I'm going to miss you, too, Pop. What's the matter? You look tired.  Oh...  I wonder what's eating that old money grubbing buzzard anyway?  Got a match?  What do you mean, and be bored to death?  I hope it works.  Father, did I act like that when I graduated from high school?  We have that all figured out. You see, Harry'll take my job at the Building and Loan, work there four years, then he'll go.  Well, no younger than I was.  How's that?  Oh, well, you know what I've always talked about  build things... design new buildings  plan modern cities  all that stuff I was talking about.  No, I'll settle for half that in cash.  Well, I... Annie, why don't you draw up a chair? Then you'd be more comfortable and you could hear everything that's going on.  You would, huh?  Oh, now, Pop, I couldn't. I couldn't face being cooped up for the rest of my life in a shabby little office.  Oh, I'm sorry, Pop. I didn't mean that remark, but this business of nickels and dimes and spending all your life trying to figure out how to save three cents on a length of pipe... I'd go crazy. I want to do something big and something important.    You see what I mean, don't you, Pop?  Pop, do you want a shock? I think you're a great guy.  Oh, did you hear that, Annie?  I'm going to miss old Annie. Pop, I think I'll get dressed and go over to Harry's party.  Here you are.  Oh, oh. Sam Wainwright! How are you? When did you get here?  Old college graduate now, huh?  Yep.  Hee-haw!  Hello, Mr. Partridge, how are you?  Hello, Violet.  Hiya, Marty. Well, it's old home week.  What's that?  Oh, yeah, yeah.  Oh... me? Oh, well, I feel funny enough already, with all these kids.  Well, excuse me, Violet. Don't be long, Marty. I don't want to be a wet nurse for...  Well... Well... Well...  Oh, why don't you stop annoying people?  Well, hello.  Well, I don't.  Me?  Uh-uh. That was a little girl named Mary Hatch. That wasn't you.     I'm not very good at this.  Okay  what can we lose?  They're cheering us. We must be good.    Hot dog! Just like an organ.  And I told Harry I thought I'd be bored to death. You should have seen the commotion in that locker room. I had to knock down three people to get this stuff we're wearing here. Here, let me hold that old wet dress of yours.  I guess I'm not quite the football type.  You... look wonderful. You know, if it wasn't me talking I'd say you were the prettiest girl in town.  I don't know. Maybe I will say it. How old are you anyway?  Eighteen? Why, it was only last year you were seventeen.  Oh, no. Just right. Your age fits you.  Yes, sir, you look a little older without your clothes on.  I mean, without a dress. You look older...  I mean, younger. You look just...  Oh-oh...  A pox upon me for a clumsy lout.  Your... your caboose, my lady.  Ummmmm...  Hey  hey, Mary.  Okay, then, I'll throw a rock at the old Granville house.  No. You see, you make a wish and then try and break some glass. You got to be a pretty good shot nowadays, too.    In that place?  I wouldn't live in it as a ghost. Now watch... right on the second floor there.    Well, not just one wish. A whole hatful, Mary. I know what I'm going to do tomorrow and the next day and the next year and the year after that. I'm shaking the dust of this crummy little town off my feet and I'm going to see the world. Italy, Greece, the Parthenon, the Colosseum. Then I'm coming back here and go to college and see what they know... and then I'm going to build things. I'm gonna build air fields.  I'm gonna build skyscrapers a hundred stories high. I'm gonna build bridges a mile long...  Are you gonna throw a rock?  Hey, that's pretty good. What'd you wish, Mary?    What'd you wish when you threw that rock?     Come on, tell me.  What is it you want, Mary? What do you want? You want the moon? Just say...    ...the word and I'll throw a lasso around it and pull it down. Hey, that's a pretty good idea. I'll give you the moon, Mary.  Well, then you could swallow it and it'd all dissolve, see? And the moonbeams'd shoot out of your fingers and your toes, and the ends of your hair. Am I talking too much?    How's that?    Want me to kiss her, huh?    Hey, hey, hold on. Hey, mister, come on back out here, and I'll show you some kissing that'll put hair back on your head. What are you...    Okay, I give up. Where are you?     Here you are. Catch.  Wait a minute. What am I doing? This is a very interesting situation.  Hmm... A man doesn't get in a situation like this every day.  Not in Bedford Falls, anyway.  Gesundheit. This requires a little thought here.  I've heard about things like this, but I've never...  Oh, my mother's way up the corner there.  They're way downtown. They'd be on my side, too.    Mary... Mary, I'm sorry. I've got to go.  Did you get a doctor?    Thanks.  Thank you very much.  Well, I handled that, Mr. Potter. You have all the papers there. His salary, insurance. I can personally vouch for his character.  Yes, sir.  Just a minute  just a minute. Now, hold on, Mr. Potter. You're right when you say my father was no business man. I know that. Why he ever started this cheap, penny-ante Building and Loan, I'll never know. But neither you nor anybody else can say anything against his character, because his whole life was... Why, in the twenty- five years since he and Uncle Billy started this thing, he never once thought of himself. Isn't that right, Uncle Billy?  He didn't save enough money to send Harry to school, let alone me. But he did help a few people get out of your slums, Mr. Potter. And what's wrong with that? Why... Here, you're all businessmen here. Doesn't it make them better citizens? Doesn't it make them better customers? You... you said... What'd you say just a minute ago?... They had to wait and save their money before they even ought to think of a decent home. Wait! Wait for what? Until their children grow up and leave them?  Until they're so old and broken- down that they... Do you know how long it takes a working man to save five thousand dollars?  Just remember this, Mr. Potter, that this rabble you're talking about... they do most of the working and paying and living and dying in this community. Well, is it too much to have them work and pay and live and die in a couple of decent rooms and a bath? Anyway, my father didn't think so. People were human beings to him, but to you, a warped, frustrated old man, they're cattle. Well, in my book he died a much richer man than you'll ever be!  I know very well what you're talking about. You're talking about something you can't get your fingers on, and it's galling you. That's what you're talking about, I know. Well, I've said too much. I... You're the Board here. You do what you want with this thing. Just one thing more, though. This town needs this measly one-horse institution if only to have some place where people can come without crawling to Potter. Come on, Uncle Billy!      (indicating Board room  What's that?  Oh, no! But, Uncle Billy...    Oh, there are plenty of jobs around for somebody that likes to travel. Look at this. There... Venezuela oil fields  wanted, man with construction experience. Here's the Yukon, right here  wanted, man with engineering experience.  Thar she blows. You know what the three most exciting sounds in the world are?  No, no, no, no! Anchor chains, plane motors, and train whistles.    Oh, am I glad to see you.  She's home cooking the fatted calf. Come on, let's go.  Hello.  Well, how do you do. Congratulations. Congratulations. What am I doing?  Harry, why didn't you tell somebody? What's a pretty girl like you doing marrying this two-headed brother of mine?    Is it a good job?  And you did, too?       Right down here.  Now you just turn this way and go right straight down.  Hello, Mom.  She's swell.  Keep him out of Bedford Falls, anyway.  Uh-huh.  Hmmmm...  Hmmmm...  Hmmm...  Hmmm...  Sure  Sam Wainwright.  Yes. Sam's crazy about Mary.  Well, how do you know? Did she discuss it with you?  Well then, how do you know?  Oh...  And all's fair in love and war?  Mother, you know, I can see right through you  right back to your back collar button... trying to get rid of me, huh?  Well, here's your hat, what's your hurry?  All right, Mother, old Building and Loan pal, I think I'll go out and find a girl and do a little passionate necking.  Now, if you'll just point me in the right direction... This direction? Good night, Mrs. Bailey.    Hello, Vi.    Nothing.  Oh, I'll probably end up down at the library.  Yes... what are you doing tonight?  Are you game, Vi? Let's make a night of it.  Let's go out in the fields and take off our shoes and walk through the grass.  Then we can go up to the falls. It's beautiful up there in the moonlight, and there's a green pool up there, and we can swim in it. Then we can climb Mt. Bedford, and smell the pines, and watch the sunrise against the peaks, and... we'll stay up there the whole night, and everybody'll be talking and there'll be a terrific scandal...  Shhh...  Okay, just forget about the whole thing.  Hello, Mary. I just happened to be passing by.  How's that?  About what?  My mother just called you? Well, how did she know?  I didn't tell anybody. I just went for a walk and happened to be passing by...    Well, I'll come in for a minute, but I didn't tell anybody I was coming over here.  When did you get back?  Where'd you get that dress?  It's all right. I thought you'd go back to New York like Sam and Ingie, and the rest of them.    All right, for a minute. I still can't understand it though. You know I didn't tell anybody I was coming here.  No, I don't want to be rude.    Well, I see it still smells like pine needles in here.  What's the matter? Oh, yeah... yeah...  Well, I...  Oh... yeah, yeah. That's all right.  Well, of course I like her. She's a peach.  No, marriage is all right for Harry, and Marty, and Sam and you.      I don't know. You tell me. You're supposed to be the one that has all the answers.  You tell me.    I forgot my hat.  Hello, Sam.          Huh? Yeah-yeah-yeah... soybeans. Yeah.  Rochester? Well, why Rochester?  Oh, I don't know... why not right here?  You remember that old tool and machinery works? You tell your father he can get that for a song. And all the labor he wants, too. Half the town was thrown out of work when they closed down.  Money? Yeah... well, a little.    Oh, Mary... Mary...  Mary...     Hey, look! Somebody's driving this cab.  Oh, look at this. Champagne!  Where are we going? Look at this. There's the kitty, Ernie.  Here, come on, count it, Mary.  You know what we're going to do? We're going to shoot the works. A whole week in New York. A whole week in Bermuda. The highest hotels  the oldest champagne  the richest caviar  the hottest music, and the prettiest wife!    That does it  come here.    Just a minute, dear. Oh-oh...  I'll be back in a minute, Mary.  Hello, everybody. Mrs. Thompson, how are you? Charlie? What's the matter here, can't you get in?  What is this, Uncle Billy? A holiday?  Come on in, everybody. That's right, just come in.  Now look, why don't you all sit down. There are a lot of seats over there. Just make yourselves at home.      Why didn't you call me?  All right now, what happened? How did it start?  When?  All of it?  Holy mackerel!  The whole town's gone crazy.  Hello?                        Yeah... ...you can take this one off now.  Now, just remember that this thing isn't as black as it appears.  I have some news for you, folks. I've just talked to old man Potter, and he's guaranteed cash payments at the bank. The bank's going to reopen next week.  Well, no, Charlie. I didn't even ask him.  We don't need Potter over here.  No, but you... you... you're thinking of this place all wrong. As if I had the money back in a safe. The money's not here. Your money's in Joe's house... ...right next to yours. And in the Kennedy house, and Mrs. Macklin's house, and a hundred others. Why, you're lending them the money to build, and then, they're going to pay it back to you as best they can. Now what are you going to do? Foreclose on them?    Well, now that's what you agreed to when you bought your shares.  Now, Tom, you have to stick to your original agreement. Now give us sixty days on this.  Tom! Tom! Randall! Now wait... now listen... now listen to me. I beg of you not to do this thing. If Potter gets hold of this Building and Loan there'll never be another decent house built in this town. He's already got charge of the bank.  He's got the bus line. He's got the department stores. And now he's after us.  Why? Well, it's very simple. Because we're cutting in on his business, that's why.  And because he wants to keep you living in his slums and paying the kind of rent he decides.  Joe, you lived in one of his houses, didn't you? Well, have you forgotten? Have you forgotten what he charged you for that broken-down shack? Here, Ed. You know, you remember last year when things weren't going so well, and you couldn't make your payments. You didn't lose your house, did you? Do you think Potter would have let you keep it? Can't you understand what's happening here? Don't you see what's happening? Potter isn't selling. Potter's buying! And why? Because we're panicky and he's not.  That's why. He's picking up some bargains.  Now, we can get through this thing all right. We've got to stick together, though. We've got to have faith in each other.  Hey! I got two thousand dollars! Here's two thousand dollars. This'll tide us over until the bank reopen. All right, Tom, how much do you need?    There you are.  Your account's still here. That's a loan.  Okay. All right, Ed?  Aw, now, Ed... what'll it take till the bank reopens? What do you need?  Twenty dollars. Now you're talking. Fine.  Thanks, Ed. All right, now, Mrs. Thompson. How much do you want?  Never mind about that. How much do you want?    You don't have to sign anything. I know you'll pay it back when you can. That's okay. All right, Mrs. Davis.  Seven... Bless your heart, Of course you can have it. You got fifty cents? Seven...    We made it! Look... ... look, we're still in business! We've still got two bucks left!  Well, let's have some of that. Get some glasses, Cousin Tilly. We're a couple of financial wizards.  Get a tray for these great big important simoleons.  A toast! A toast to Papa Dollar and to Mama Dollar, and if you want the old Building and Loan to stay in business, you better have a family real quick.  I wish they were too. Okay, let's put them in the safe and see what happens.   (he runs around looking for her   Look, will you get my wife on the phone?  She's probably over at her mother's.      I don't want Mrs. Bailey. I want my wife.  Mrs. Bailey! Oh, that's my wife! Here, I'll take it in here. Mary? Hello. Listen, dear, I'm sorry...  What? Come home? What home? Three-twenty Sycamore? Well, what... whose home is that? The Waldorf Hotel, huh?          Oh, Mary...  Darling, you're wonderful.  What's that?  Come on... Bring the baby. I'll bring the kids in the car.  All right, kids  here  get in here. Now get right up on the seat there. Get the...  get the goat!  All in...  Mr. and Mrs. Martini, welcome home. The Martinis cross themselves.      (handing bottle to Martini  Oh...  Oh, I'm afraid I couldn't get away, Sam.  Oh, now, don't rub it in.  Goodbye.  Goodbye, Sam.  Thanks for dropping around.  Hee-haw.  Thank you, sir. Quite a cigar, Mr. Potter.    Yes. Well, most people say you stole all the rest.          Would I? You're not talking to somebody else around here, are you? You know, this is me, you remember me? George Bailey.  Well, what about the Building and Loan?  Well, Mr. Potter, I... I... I know I ought to jump at the chance, but I... I just...  I wonder if it would be possible for you to give me twenty- four hours to think it over?  I'd like to do that.  All right, sir.     (getting madder all the time  ...And that goes for you too!  And it goes for you too!       I know what I'm going to do tomorrow and the next day and next year and the year after that. I'm shaking the dust of this crummy little town off my feet, and I'm going to see the world... And I'm going to build things. I'm going to build air fields. I'm going to build skyscrapers a hundred stories high. I'm going to build a bridge a mile long.  What is it you want, Mary? You want the moon? If you do, just say the word; I'll throw a lasso around it and pull it down for you.  Hi.  Mary Hatch, why in the world did you ever marry a guy like me?  You could have married Sam Wainwright or anybody else in town.  You didn't even have a honeymoon. I promised you... ...Your what?    Lassos the stork! You mean you... What is it, a boy or a girl?  Hold on... hold on... hold on now. Don't you know there's a war on?            Extra! Extra! Read all about it!  Harry! What do you know about that?  What do you mean it's okay?  For a hero? Harry!  Oh, you old seven kinds of a son of a gun. Congratulations!  How's Mother standing it?... She did? What do you know... Mother had lunch with the President's wife!     What? Uncle Billy? Has Uncle Billy come in yet?        What man?  Oh... Talk to Eustace a minute, will you. I'll be right back.     Good morning, sir.  Mr. Carter, Merry Christmas.  We're all excited around here. My brother just got the Congressional Medal of Honor. The President just decorated him.  Good year? Well, between you and me, Mr. Carter, we're broke.  Well... ...now, come right in here, Mr. Carter.  No, no. He wants to talk to Uncle Billy.  You just hold on.  I don't blame you at all, Mr. Carter, Just step right in here. We'll fix you up.  Just make yourself at home, Mr. Carter.  I'll get those books for you.  Oh, hello, Vi.  Why, of course you can. Come on in the office here.  Uncle Billy, talk to Harry. He's on the telephone.         It takes a lot of character to leave your home town and start all over again.  He pulls some money from his pocket, and offers it to her.  Here, now, you're broke, aren't you?  What do you want to do, hock your furs, and that hat? Want to walk to New York?  You know, they charge for meals and rent up there just the same as they do in Bedford Falls.  It's a loan. That's my business. Building and Loan. Besides, you'll get a job. Good luck to you.  Say hello to New York for me.  Now, let's hear from you...  What's the matter? Merry Christmas, Vi.  Oh, Mr. Carter, I'm sorry. I'll be right with you. Uncle Billy in?  Unc... What's going on? The bank examiner's here, and I...  Yeah, yeah. He wants the accounts payable...  What's the matter with you?  Eustace...  Come here a minute.  Did you see Uncle Billy with any cash last night?  Now look, did you buy anything?  All right. All right. Now we'll go over every step you took since you left the house.  And did you put the envelope in your pocket?    Listen to me. Do you have any secret hiding place here in the house? Someplace you could have put it? Someplace to hide the money?      That's what it means! One of us is going to jail! Well, it's not going to be me!    What? What wreath?    Yeah, just started.  Left them at the office.    Must she keep playing that?          Zuzu! What's the matter with Zuzu?  What is it, a sore throat or what?  The doctor? Was the doctor here?  Is she running a temperature? What is it?  Gosh, it's this old house. I don't know why we don't all have pneumonia. This drafty old barn! Might as well be living in a refrigerator. Why did we have to live here in the first place and stay around this measly, crummy old town?  Wrong? Everything's wrong! You call this a happy family? Why did we have to have all these kids?    Going up to see Zuzu.     Well, what happened to you?  Wait now. Where do you think you're going?  All right, all right. Here, give Daddy the flower. I'll give it a drink.  Yeah, all right. Now, I'll paste this together.  There it is, good as new.  Now, will you do something for me?     Will you try to get some sleep?  I know  I know, but you just go to sleep, and then you can dream about it, and it'll be a whole garden.  Uh-huh.  Is that Zuzu's teacher?  Let me speak to her.    Is this the sort of thing we pay taxes for  to have teachers like you? Silly, stupid, careless people who send our kids home without any clothes on? You know, maybe my kids aren't the best-dressed kids; maybe they don't have any decent clothes...  Aw, that stupid...          Oh...    Tommy, stop that! Stop it!      What's the matter with everybody? Janie, go on. I told you to practice. Now, go on, play!  Mary...  I'm in trouble, Mr. Potter. I need help.  Through some sort of an accident my company's short in their accounts. The bank examiner's up there today. I've got to raise eight thousand dollars immediately.      No, sir. There's nothing wrong with the books. I've just misplaced eight thousand dollars. I can't find it anywhere.  Yes, sir.  No, sir. I didn't want the publicity. Harry's homecoming tomorrow...  No, sir. No, sir. I haven't.    I can't get hold of him. He's in Europe.  They don't have that kind of money, Mr. Potter. You know that. You're the only one in town that can help me.      Five hundred dollars.  God... God... Dear Father in Heaven, I'm not a praying man, but if you're up there and you can hear me, show me the way. I'm at the end of my rope. Show me the way, God.    Oh  Welch. That's what I get for praying.  Where's my insurance policy? Oh, here...  I'm all right.  I'm all right.        You what? To save me?  Go through with what?    Yeah, I got a bust in the jaw in answer to a prayer a little bit ago.    What are you, a mind reader or something?  Well, who are you, then?  Odbody... A-S-2. What's that A-S-2?  Oh, brother. I wonder what Martini put in those drinks?  Hey, what's with you? What did you say just a minute ago? Why'd you want to save me?  I wouldn't be a bit surprised.    Well, you look about like the kind of an angel I'd get. Sort of a fallen angel, aren't you? What happened to your wings?  I don't know whether I like it very much being seen around with an angel without any wings.    Only one way you can help me. You don't happen to have eight thousand bucks on you?  Oh, that's right, I keep forgetting. Comes in pretty handy down here, bub.  I found it out a little late. I'm worth more dead than alive.         I said I wish I'd never been born.  What did you say?     Say something else in that ear.  Well, that's the doggonedest thing... I haven't heard anything out of that ear since I was a kid. Must have been that jump in the cold water.  What do you know about that... What's happened?  It's stopped snowing out, hasn't it? What's happened here? Come on, soon as these clothes of ours are dry...  What do you know about that? Stove's hotter than I thought. Now, come on, get your clothes on, and we'll stroll up to my car and get...  Oh, I'm sorry. I'll stroll. You fly.  You haven't got your wings. Yeah, that's right.    Well, I had a car, and it was right here.  I guess somebody moved it.  Oh, say... Hey... where's my car?  My car, my car. I'm the fellow that owns the car that ran into your tree.  What do you mean, what tree? This tree.  Here, I ran into it. Cut a big gash in the side of it here.    Oh, I don't know. Either I'm off my nut, or he is... ...or you are!  Well, maybe I left the car up at Martini's. Well, come on, Gabriel.  Clarence! Clarence!    There's a place to sit down. Sit down.  Oh, hello, Nick. Hey, where's Martini?  No, no, Martini. Your boss. Where is he?  Okay  all right. Double bourbon, quick, huh?    What's the matter with him. I never saw Nick act like that before.  Oh, yeah. Hey, little fellow  you worry me. You got someplace to sleep?  You don't huh? Well, you got any money?  No wonder you jumped in the river.  Oh, that's right.  Made what?  Look, I think maybe you better not mention getting your wings around here.       Look, Nick. What's wrong?  Well, Nick, that's your name, isn't it?     Mr. Gower! Mr. Gower! This is George Bailey! Don't you know me?    What do you mean, I wasn't there? I remember distinctly...    Look, who are you?  Yeah, yeah, I know. You told me that. What else are you? What... are you a hypnotist?  Well then, why am I seeing all these strange things?  Then if I wasn't born, who am I?  What do you mean, no identity? My name's George Bailey.  What?         Hey... hey. Where did the Building and Loan move to?  The Bailey Building and Loan. It was up there.  Hey, Violet! Hey, listen  that's Violet Bick!  I know that girl!  Hey, Ernie  Ernie!  Ernie, take me home. I'm off my nut!  Aw, now, doggone it, Ernie, don't you start pulling that stuff. You know where I live. Three-twenty Sycamore. Now hurry up.  Yeah  yeah  hurry up. Zuzu's sick.     Look here, Ernie, straighten me out here.  I've got some bad liquor or something.  Listen to me now. Now, you are Ernie Bishop, and you live in Bailey Park with your wife and kid? That's right, isn't it?    Okay. Just step on it. Just get me home.    Of course it's the place.    Mary! Mary! Tommy! Pete! Janie! Zuzu! Where are you?     Bert! Thank heaven you're here!  Bert, what's happened to this house? Where's Mary? Where's my kids?    Bert, now listen to me. Ernie, will you take me over to my mother's house? Bert, listen! It's that fellow there  he says he's an angel  he's tried to hypnotize me.     Mother...  Mother, this is George. I thought sure you'd remember me.  Oh, Mother, Mother, please help me. Something terrible's happened to me. I don't know what it is. Something's happened to everybody. Please let me come in. Keep me here until I get over it.    Well, sure I do.  Today, over at the house.  (quietly, trying to use logic  Sure I know where he lives. He lives in Bailey Park.  Oh, I'm not sure of anything anymore. All I know is this should be Bailey Park. But where are the houses?    That's a lie! Harry Bailey went to war! He got the Congressional Medal of Honor! He saved the lives of every man on that transport.    Clarence...  Where's Mary?  I don't know how you know these things, but tell me  where is she?  If you know where she is, tell me where my wife is.        Where is she?  Mary!  Mary!  Mary! Mary!  Mary, it's George! Don't you know me?  What's happened to us?  Mary, please! Oh, don't do this to me.  Please, Mary, help me. Where's our kids? I need you, Mary! Help me, Mary!     (recognizing some of them  Mary!    Clarence! Clarence! Where are you?  Clarence! Clarence! Help me, Clarence. Get me back. Get me back. I don't care what happens to me. Only get me back to my wife and kids. Help me, Clarence, please!  Please! I want to live again!  I want to live again. I want to live again. Please, God, let me live again.       Don't... George?  Bert, do you know me?  What did...   (feeling in watch pocket  Mary! Mary!  Hello, Bedford Falls!  Merry Christmas!    Merry Christmas, movie house!    Merry Christmas, emporium!    Merry Christmas, you wonderful old Building and Loan!          I know. Eight thousand dollars.    Reporters? Where's Mary? Mary!  Oh, look at this wonderful old drafty house! Mary! Mary!  Have you seen my wife?  Kids!  Pete  kids  Janie  Tommy. I could eat you up!  Where's your mother?  Zuzu  Zuzu. My little gingersnap! How do you feel?    Hallelujah!  Mary! Mary!  Mary! Let me touch you! Oh, you're real!  You have no idea what's happened to me.  All right.  Violet Bick!  Harry... Harry...  That's a Christmas present from a very dear friend of mine.    Attaboy, Clarence.",
        "Bailey": "Help my son George tonight.    I'm not crying, Mr. Potter.  All I'm asking is thirty days more...  Just a minute, son. Just thirty short days. I'll dig up that five thousand somehow.  Times are bad, Mr. Potter. A lot of these people are out of work.  I can't do that. These families have children.    But they're somebody's children.  Well, all right...    Mr. Potter, what makes you such a hardskulled character? You have no family  no children. You can't begin to spend all the money you've got.  George, George...  Run along.  All right, son, thanks. I'll talk to you tonight.            Looks like she can keep Harry on his toes.  Did you know that Mary Hatch is back from school?  Came back three days ago.  Nice girl, Mary.  Kind that will help you find the answers, George.  Oh, stop that grunting.  Can you give me one good reason why you shouldn't call on Mary?  Hmmm?  Well, she's not crazy about him.  No.  Well, I've got eyes, haven't I? Why, she lights up like a firefly whenever you're around.  And besides, Sam Wainwright's away in New York, and you're here in Bedford Falls.    Uh-huh.  Oh, George!      First Harry, now George. Annie, we're just two old maids now.          Well?  Mother? What do you want?    Get over what? I don't take in strangers unless they're sent here by somebody I know.    When'd you see him last?  That's a lie. He's been in the insane asylum ever since he lost his business.  And if you ask me, that's where you belong.  Harry, how about your banquet in New York?",
        "Pa": "George, welcome back.  Putting a pool under this floor was a great idea. Saved us another building.  Now, Harry, Sam, have a lot of fun.  There's lots of stuff to eat and drink.  Lots of pretty girls around.    Hey, Ernie, if you got any money in the bank, you better hurry.                 There you are, George. I got the faculty all up out of bed. And here's something for you to play with.",
        "Mary": "I love him, dear Lord. Watch over him tonight.    I'm still thinking.  You like every boy.    I'll take chocolate.  I don't like coconuts.  A new magazine! I never saw it before.  Is this the ear you can't hear on? George Bailey, I'll love you till the day I die.          Hello. You look at me as if you didn't know me.  You've passed me on the street almost every day.  Uh-huh.     Neither am I.    Beautiful.  Do I look as funny as you do?  Well, why don't you say it?  Eighteen.  Too young or too old?    You may kiss my hand.    Oh, no, don't. I love that old house.    Oh, no, George, don't. It's full of romance, that old place. I'd like to live in it.  Uh-huh.    What'd you wish, George?         Oh, no.  If I told you it might not come true.    I'll take it. And then what?        Over here in the hydrangea bushes.         Ouch!        I'm going to scream!  What are you doing, picketing?  Yeah, so I noticed. Have you made up your mind?  Have you made up your mind?  About coming in. Your mother just phoned and said you were on your way over to pay me a visit.  Didn't you tell her?    Well, are you coming in or aren't you?  Tuesday.  Do you like it?  Oh, I worked there for a couple of vacations, but I don't know... I guess I was homesick.  Yes, and my family and... oh, everything.  Would you like to sit down?  Would you rather leave?  Well, then, sit down.  Thank you.      Don't you like her?  Oh, it's just marriage in general you're not enthusiastic about, huh?  It's George Bailey, Mother.  I don't know. What do you want?            Hello.    Oh, well, that's awfully sweet of you, Sam. There's an old friend of yours here. George Bailey.  Yes, old moss-back George.  Wait a minute. I'll call him. George!  He does so. He asked for him. Geo... George, Sam wants to speak to you.    Mother's on the extension.    We can both hear. Come here.        George... George... George...     Good old Bert.  I feel like a bootlegger's wife. Look!  After that, who cares?    George, let's not stop. Let's go!  Please, let's not stop, George.  How much do you need?       Remember the night we broke the windows in this old house? This is what I wished for.    Oh, who cares. Bread! That this house may never know hunger.    Nice meeting you.  Have fun.      Hi.  To keep from being an old maid.  I didn't want to marry anybody else in town. I want my baby to look like you.  My baby.  George Bailey lassos stork.  Hello darling.    Bless you!  Did you bring the wreath?  The Merry Christmas wreath for the window.  Is it snowing?  Where's your coat and hat?  What's the matter?  Go on, Pete, you're a big boy.  You can put the star up. Way up at the top. That's it.  Fill in that little bare spot right there.  That's it. Isn't it wonderful about Harry? We're famous, George. I'll bet I had fifty calls today about the parade, the banquet. Your mother's so excited, she...    Come on out in the kitchen with me while I finish dinner.  Have a hectic day?  All right, darling, you're excused. Now go upstairs and see what little Zuzu wants.  Oh, she's got a cold. She's in bed. Caught it coming home from school. They gave her a flower for a prize and she didn't want to crush it so she didn't button up her coat.  Just a cold. The doctor says it's nothing serious.  Yes, I called him right away. He says it's nothing to worry about.  Just a teensie one  ninety-nine, six.  She'll be all right.    Where're you going?   I'll get it. Hello. Yes, this is Mrs. Bailey.  Oh, thank you, Mrs. Welch. I'm sure she'll be all right. The doctor says that she ought to be out of bed in time to have her Christmas dinner.      Hello, Mrs. Welch. I want to apologize...  hello... hello... She's hung up.  George...    Bedford, two-four-seven, please.  Yes, Janie, pray very hard.  You too, Tommy. Hello, Uncle Billy?         George, darling! Where have you been?  Oh, George, George, George.  Oh, George, George!  You have no idea what happened...  Well, come on, George, come on downstairs quick. They're on their way.  Come on in here now. Now, you stand right over here, by the tree. Right there, and don't move, don't move. I hear 'em now, George, it's a miracle! It's a miracle!  Come in, Uncle Billy! Everybody! In here!",
        "Hatch": "All right, dear.  Mary! Mary!  Who's down there with you?  George Bailey? What's he want?  You tell him to go right back home, and don't you leave the house, either. Sam Wainwright promised to call you from New York tonight.  Mary! Mary! The telephone! It's Sam!  Mary, he's waiting!  He doesn't want to speak to George, you idiot!",
        "Mrs.": "Help my son George tonight.    Looks like she can keep Harry on his toes.  Did you know that Mary Hatch is back from school?  Came back three days ago.  Nice girl, Mary.  Kind that will help you find the answers, George.  Oh, stop that grunting.  Can you give me one good reason why you shouldn't call on Mary?  Hmmm?  Well, she's not crazy about him.  No.  Well, I've got eyes, haven't I? Why, she lights up like a firefly whenever you're around.  And besides, Sam Wainwright's away in New York, and you're here in Bedford Falls.    Uh-huh.  Oh, George!  All right, dear.  Mary! Mary!  Who's down there with you?  George Bailey? What's he want?  You tell him to go right back home, and don't you leave the house, either. Sam Wainwright promised to call you from New York tonight.  Mary! Mary! The telephone! It's Sam!  Mary, he's waiting!  He doesn't want to speak to George, you idiot!     First Harry, now George. Annie, we're just two old maids now.  Are you going to go to Potter's?  But my husband hasn't worked in over a year, and I need money.  But it's your own money, George.  I can get along with twenty, all right.  And I'll sign a paper.  Could I have seventeen-fifty?  Harry, how about your banquet in New York?",
        "Potter": "Well, you're begging, and that's a whole lot worse.    Have you put any real pressure on those people of yours to pay those mortgages?  Then foreclose!    They're not my children.  Are you running a business or a charity ward?      So I suppose I should give it to miserable failures like you and that idiot brother of yours to spend for me.  Gives you an idea of the Baileys.  Mr. Chairman, I'd like to get to my real purpose.  Wait for what?  I claim this institution is not necessary to this town. Therefore, Mr. Chairman, I make a motion to dissolve this institution and turn its assets and liabilities over to the receiver.  I'll go further than that. I'll say that to the public Peter Bailey was the Building and Loan.  Peter Bailey was not a business man. That's what killed him. Oh, I don't mean any disrespect to him, God rest his soul.  He was a man of high ideals, so-called, but ideals without common sense can ruin this town. Now, you take this loan here to Ernie Bishop... You know, that fellow that sits around all day on his brains in his taxi.  You know... I happen to know the bank turned down this loan, but he comes here and we're building him a house worth five thousand dollars. Why?    You see, if you shoot pool with some employee here, you can come and borrow money. What does that get us? A discontented, lazy rabble instead of a thrifty working class. And all because a few starry-eyed dreamers like Peter Bailey stir them up and fill their heads with a lot of impossible ideas. Now, I say...  I'm not interested in your book. I'm talking about the Building and Loan.  Sentimental hogwash! I want my motion...    George, there is a rumor around town that you've closed your doors. Is that true?  Oh, well, I'm very glad to hear that...  George, are you all right? Do you need any police?      Well, mobs get pretty ugly sometimes, you know. George, I'm going all out to help in this crisis. I've just guaranteed the bank sufficient funds to meet their needs.  They'll close up for a week, and then reopen.      I may lose a fortune, but I'm willing to guarantee your people too. Just tell them to bring their shares over here and I will pay them fifty cents on the dollar.      If you close your doors before six P.M. you will never reopen.       Oh, they are, are they? Even though they know the Baileys haven't made a dime out of it.    The Bailey family has been a boil on my neck long enough.  Come in here.    You like it? I'll send you a box.   (pleasantly and smoothly  The envious ones say that, George, the suckers. Now, I have stated my side very frankly. Now, let's look at your side.  Young man, twenty- seven, twenty-eight...  married, making, say... forty a week.  Forty-five. Forty-five. Out of which, after supporting your mother, and paying your bills, you're able to keep, say, ten, if you skimp. A child or two comes along, and you won't even be able to save the ten. Now, if this young man of twenty-eight was a common, ordinary yokel, I'd say he was doing fine. But George Bailey is not a common, ordinary yokel. He's an intelligent, smart, ambitious young man  who hates his job  who hates the Building and Loan almost as much as I do. A young man who's been dying to get out on his own ever since he was born. A young man... the smartest one of the crowd, mind you, a young man who has to sit by and watch his friends go places, because he's trapped.  Yes, sir, trapped into frittering his life away playing nursemaid to a lot of garlic-eaters.  Do I paint a correct picture, or do I exaggerate?  My point? My point is, I want to hire you.  I want you to manage my affairs, run my properties. George, I'll start you out at twenty thousand dollars a year.  You wouldn't mind living in the nicest house in town, buying your wife a lot of fine clothes, a couple of business trips to New York a year, maybe once in a while Europe. You wouldn't mind that, would you, George?  Oh, yes, George Bailey. Whose ship has just come in  providing he has brains enough to climb aboard.  Oh, confound it, man, are you afraid of success? I'm offering you a three year contract at twenty thousand dollars a year, starting today. Is it a deal or isn't it?  Sure, sure, sure. You go on home and talk about it to your wife.  In the meantime, I'll draw up the papers.    You wouldn't mind living in the nicest house in town. Buying your wife a lot of fine clothes, going to New York on a business trip a couple of times a year.  Maybe to Europe once in a while.    How does slacker George feel about that?  Bad ear.    Bailey...  Take me back there. Hurry up. Come on, look sharp.              Yes. They called me up from your Building and Loan. Oh, there's a man over there from the D.A.'s office, too. He's looking for you.      Have you notified the police?    What is it  a woman, then? You know, it's all over town that you've been giving money to Violet Bick.  Not that it makes any difference to me, but why did you come to me? Why don't you go to Sam Wainwright and ask him for the money?  Well, what about all your other friends?  I see. I've suddenly become quite important. What kind of security would I have, George? Have you got any stocks?  Bonds? Real estate? Collateral of any kind?  Yes... how much is your equity in it?    All right, George, go ahead. You can't hide in a little town like this.      Happy New Year to you  in jail! Go on home  they're waiting for you!",
        "Harry": "I'm not scared.  I've eaten.  I don't care. It's George's tux.  Annie, I'm in love with you. There's a moon out tonight.  Pop, can I have the car? I'm going to take over a lot of plates and things.  Oh, Mom  I'm chairman of the eats committee and we only need a couple of dozen.  Gangway! Gangway! So long, Pop.  Very funny. Very funny.  Okay, Mom. You coming later? You coming later, George?  Couldn't want a better death. Lots of pretty girls, and we're going to use that new floor of yours tonight, too.  Aw, Pop, just a little.    He has?  Well, I gotta make some dough first.  Oyez  oyez  oyez... The big Charleston contest. The prize? A genuine loving cup.  Those not tapped by the judges will remain on the floor. Let's go!  Come on, George, let's hurry.  Well, if it isn't old George Geographic Explorer Bailey! What? No husky dogs? No sled? Uncle Billy, you haven't changed a bit.  Say, where's Mother?  Oh, wait. Wait... Wait a minute.  Ruth Dakin.  Well, I wired you I had a surprise. Here she is. Meet the wife.  George... about that job. Ruth spoke out of turn. I never said I'd take it. You've been holding the bag here for four years, and... well, I won't let you down, George.  I would like to... Oh, wait a minute. I forgot the bags. I'll be right back.  Hello, George, how are you?    Oh, I left right in the middle of it as soon as I got Mary's telegram.  Good idea, Ernie. A toast... to my big brother, George. The richest man in town!",
        "Clarence": "You sent for me, sir?  Splendid! Is he sick?  Oh, dear, dear! His life! Then I've only got an hour to dress. What are they wearing now?  Sir... If I should accomplish this mission  I mean  might I perhaps win my wings?  I've been waiting for over two hundred years now, sir  and people are beginning to talk.  The Adventures of Tom Sawyer.  Oh, thank you, sir. Thank you.  Sit down? What are...  Well, naturally. Of course.  Where? I don't see a thing.  Why, yes. This is amazing.  Oh, wonderful!  Hey, who's that?  A boy?  Who's that  a king?  What did you stop it for?  Who is it?  Oh, you mean the kid that had his ears slapped back by the druggist.  It's a good face. I like it. I like George Bailey. Tell me, did he ever tell anyone about the pills?  Did he ever marry the girl? Did he ever go exploring?  I know. I know. He didn't go.  Yes, but what happened to George?  No!  Yes, but George...     I didn't have time to get some stylish underwear. My wife gave me this on my last birthday. I passed away in it.  Oh, Tom Sawyer's drying out, too. You should read the new book Mark Twain's writing now.  I didn't fall in. I jumped in to save George.  Well, I did, didn't I? You didn't go through with it, did you?  Suicide.  Yeah, it's against the law where I come from, too.  Heaven. I had to act quickly; that's why I jumped in. I knew if I were drowning you'd try to save me. And you see, you did, and that's how I saved you.  Your lip's bleeding, George.    Oh, I know all about you. I've watched you grow up from a little boy.  Oh, no.  Clarence Odbody, A-S-2.  Angel, Second Class.    That's what I was sent down for. I'm your guardian angel.  Ridiculous of you to think of killing yourself for money. Eight thousand dollars.  I told you  I'm your guardian angel. I know everything about you.  I haven't won my wings yet. That's why I'm an angel Second Class.  Oh, I've got to earn them, and you'll help me, won't you?  By letting me help you.  Oh, no, no. We don't use money in Heaven.  Oh, tut, tut, tut.  Now look, you mustn't talk like that. I won't get my wings with that attitude. You just don't know all that you've done. If it hadn't been for you...  No, you don't understand. I've got my job...     What'd you say?  Oh, you mustn't say things like that. You... ...wait a minute. Wait a minute. That's an idea. What do you think? Yeah, that'll do it.  All right. You've got your wish. You've never been born.    You've never been born. You don't exist.  You haven't a care in the world.  No worries  no obligations  no eight thousand dollars to get  no Potter looking for you with the Sheriff.       Your lip's stopped bleeding, too, George.  Our clothes are dry.  I can't fly. I haven't got any wings.  What's the matter?  You have no car.  It isn't me!    I was just thinking... It's been so long since I...      You'll see a lot of strange things from now on.  No.  No.  I jumped in the river to save you so I could get my wings.  Oh-oh. Somebody's just made it.  Every time you hear a bell ring, it means that some angel's just got his wings.  Why? Don't they believe in angels?  Then why should they be surprised when they see one?  Two hundred and ninety-three... ...next May.  You see, George, you were not there to stop Gower from putting that poison into the...    No, of course not.  Don't you understand, George? It's because you were not born.  You're nobody. You have no identity.  There is no George Bailey. You have no papers, no cards, no driver's license, no 4-F card, no insurance policy... George looks in his watch pocket.  They're not there, either.  Zuzu's petals.  You've been given a great gift, George. A chance to see what the world would be like without you.  Home? What home?  How'm I doing, Joseph. Thanks. No, I didn't have a drink!  They're not here, George. You have no children.  Run... George! Run, George!  Help! Joseph, help!  Help, oh Joseph, help! Joseph!  Strange, isn't it?  Each man's life touches so many other lives, and when he isn't around he leaves an awful hole, doesn't he?  You know where he lives?  Are you sure this is Bailey Park?      Your brother, Harry Bailey, broke through the ice and was drowned at the age of nine.      Yes, George?  Oh, well, I can't...   I'm not supposed to tell.  You're not going to like it, George.  She's an old maid. She never married.  She's...",
        "Ernie": "George is a good guy. Give him a break, God.  Hiya, George!  Sure, your highness, hop in. And, for the carriage trade, I puts on my hat.  How would you like...  Want to come along, Bert?  We'll show you the town!  Family man.  You still want me to hang around, George?       If either of you two see a stranger around here, it's me.  Bert, the cop, sent this over. He said to float away to Happy Land on the bubbles.  By the way, where are you two going on this here now honeymoon?  That does it! Then what?    Don't look now, but there's something funny going on over there at the bank, George, I've never really seen one, but that's got all the earmarks of a run.  Hey, Bert, here he comes.  Hiya... Good evening, sir.  Entray, monsieur, entray.         I know  I know  I know. I think it's marvelous.    Okay. Three-twenty Sycamore?...  All right.  He pulls down the flag on the meter and starts the cab.       Look, bud, what's the idea?  I live in a shack in Potter's Field and my wife ran away three years ago and took the kid...  And I ain't never seen you before in my life.  Is this the place?  Well, this house ain't been lived in for twenty years.  I don't know, but we better keep an eye on this guy. He's bats.        The line forms on the right.  Mr. Martini! Merry Christmas! Step right up here.  Mr. Gower!  Just a minute. Quiet, everybody. Quiet  quiet. Now, this is from London. Mr. Gower cables you need cash. Stop. My office instructed to advance you up to twenty-five thousand dollars. Stop. Heehaw and Merry Christmas. Sam Wainwright.",
        "Sam": "Here comes George. Hello, hee-haw!  Oh, this afternoon. I thought I'd give the kids a treat.  Yeah  old Joe College Wainwright, they call me. Well, freshman, looks like you're going to make it after all.    Yeah. He's followed every game and his mouth's watering. He wants me to find out if you're going to come along with us.  Well, you better make it fast. We need great ends like you  not broken down old guys like this one.  Hee-haw!  \"Momma wants you, Marty.\" \"Momma wants you, Marty.\" Remember?  Aw, go on.  Aw, great. Gee, it's good to hear your voice again.  You mean old moss-back George?  Hee-haw! Put him on.      No, wait a minute. Wait a minute. I want to talk to both of you. Tell Mary to get on the extension.  I have a big deal coming up that's going to make us all rich. George, you remember that night in Martini's bar when you told me you read someplace about making plastics out of soybeans?  Well, Dad's snapped up the idea. He's going to build a factory outside of Rochester. How do you like that?  Well, why not? Can you think of anything better?  That so? Well, I'll tell him. Hey, that sounds great! Oh, baby, I knew you'd come through. Now, here's the point. Mary, Mary, you're in on this too. Now listen.  Have you got any money?  Well, now listen. I want you to put every cent you've got into our stock, you hear?  And George, I may have a job for you; that is, unless you're still married to that broken-down Building and Loan. This is the biggest thing since radio, and I'm letting you in on the ground floor. Oh, Mary...  Mary...  Would you tell that guy I'm giving him the chance of a lifetime, you hear? The chance of a lifetime.  That old George... he's always making a speech. Hee-haw!  We just stopped in town to take a look at the new factory, and then we're going to drive on down to Florida.  Why, sure. Hey, why don't you kids drive down with us, huh?  Still got the nose to the old grindstone, eh? Jane, I offered to let George in on the ground floor in plastics, and he turned me down cold.  I'm not rubbing it in. Well, I guess we better run along.  So long, George. See you in the funny papers.",
        "Wainwright": "",
        "Uncle": "Avast, there, Captain Cook! Where you headin'?  Some other time, George.  There's a squall in there that's shapin' up into a storm.  Who is it?  Bank examiner!  I should have called him yesterday. Switch it inside.  Avast there, Captain Cook. You got your sea legs yet?  Hey, George, don't take any plugged nickels.  George! George! Come on home, quick! Your father's had a stroke!  Yes, Campbell's there now.    (trying to control himself  Boy, oh, boy, that was telling him, George, old boy. You shut his big mouth. You should have heard him.  Well, we're being voted out of business after twenty-five years. Easy come, easy go.  Hey, you'll miss your train. You're a week late for school already. Go on.  Oh, never mind. Don't worry about that.  They're putting us out of business. So what? I can get another job. I'm only fifty-five.  Go on  go on. Hey, look, you gave up your boat trip, now you don't want to miss college too, do you?  Whoopee!  Uh-huh. Breakfast is served; lunch is served; dinner...  Peanut?  Nobody ever changes around here. You know that.  How do you do.  Huh?  Well, what do you know  wife.    It was a surprise to me. This is the new Mrs. Bailey, my nephew's wife. Old, old friend of the family.  And I want to tell you, we're going to give the biggest party this town ever saw.     Oh, boy, oh boy, oh boy. I feel so good I could spit in Potter's eye. I think I will. What did you say, huh? Oh, maybe I'd better go home.  Where's my hat? Where's my...  Oh, thank you, George. Which one is mine?  Oh, thank you, George, old boy, old boy.  Now, look  if you'll point me in the right direction... would you do that?  George?  Old Building and Loan pal, huh...  That way, huh?  I'm all right. I'm all right. \"... the sweetest flower that grows... \"  George...  George, can I see you a minute?    I just did, but they said you left. This is a pickle, George, this is a pickle.  How does anything like this ever start?  All I know is the bank called our loan.  About an hour ago. I had to hand over all our cash.  Every cent of it, and it still was less than we owe.  And then I got scared, George, and closed the doors. I... I... I...  Yes, hello? George... it's Potter.          George, was it a nice wedding? Gosh, I wanted to be there.    Those Rockefellers!  We'll save them for seed. A toast! They raise their glasses.      Eight thousand...  Well, good morning, Mr. Potter. What's the news?  Well, well, well, Harry Bailey wins Congressional Medal. That couldn't be one of the Bailey boys? You just can't keep those Baileys down, now, can you, Mr. Potter?  Very jealous, very jealous. He only lost three buttons off his vest. Of course, slacker George would have gotten two of those medals if he had gone.  Yes.  After all, Potter, some people like George had to stay home. Not every heel was in Germany and Japan!    Huh?  What?  Sure, sure I am.  Oh, shucks...    Hmm? Well, I...    I should have my head examined. Eight thousand dollars. It's got to be somewhere.      Nothing. Not even a stick of gum.  This way.    Yeah... yeah... maybe... maybe...        Isn't it wonderful?  (emotionally at the breaking point",
        "Billy": "Avast, there, Captain Cook! Where you headin'?  Some other time, George.  There's a squall in there that's shapin' up into a storm.  Who is it?  Bank examiner!  I should have called him yesterday. Switch it inside.  Avast there, Captain Cook. You got your sea legs yet?  Hey, George, don't take any plugged nickels.  George! George! Come on home, quick! Your father's had a stroke!  Yes, Campbell's there now.    (trying to control himself  Boy, oh, boy, that was telling him, George, old boy. You shut his big mouth. You should have heard him.  Well, we're being voted out of business after twenty-five years. Easy come, easy go.  Hey, you'll miss your train. You're a week late for school already. Go on.  Oh, never mind. Don't worry about that.  They're putting us out of business. So what? I can get another job. I'm only fifty-five.  Go on  go on. Hey, look, you gave up your boat trip, now you don't want to miss college too, do you?  Whoopee!  Uh-huh. Breakfast is served; lunch is served; dinner...  Peanut?  Nobody ever changes around here. You know that.  How do you do.  Huh?  Well, what do you know  wife.    It was a surprise to me. This is the new Mrs. Bailey, my nephew's wife. Old, old friend of the family.  And I want to tell you, we're going to give the biggest party this town ever saw.     Oh, boy, oh boy, oh boy. I feel so good I could spit in Potter's eye. I think I will. What did you say, huh? Oh, maybe I'd better go home.  Where's my hat? Where's my...  Oh, thank you, George. Which one is mine?  Oh, thank you, George, old boy, old boy.  Now, look  if you'll point me in the right direction... would you do that?  George?  Old Building and Loan pal, huh...  That way, huh?  I'm all right. I'm all right. \"... the sweetest flower that grows... \"  George...  George, can I see you a minute?    I just did, but they said you left. This is a pickle, George, this is a pickle.  How does anything like this ever start?  All I know is the bank called our loan.  About an hour ago. I had to hand over all our cash.  Every cent of it, and it still was less than we owe.  And then I got scared, George, and closed the doors. I... I... I...  Yes, hello? George... it's Potter.          George, was it a nice wedding? Gosh, I wanted to be there.    Those Rockefellers!  We'll save them for seed. A toast! They raise their glasses.      Eight thousand...  Well, good morning, Mr. Potter. What's the news?  Well, well, well, Harry Bailey wins Congressional Medal. That couldn't be one of the Bailey boys? You just can't keep those Baileys down, now, can you, Mr. Potter?  Very jealous, very jealous. He only lost three buttons off his vest. Of course, slacker George would have gotten two of those medals if he had gone.  Yes.  After all, Potter, some people like George had to stay home. Not every heel was in Germany and Japan!    Huh?  What?  Sure, sure I am.  Oh, shucks...    Hmm? Well, I...    I should have my head examined. Eight thousand dollars. It's got to be somewhere.      Nothing. Not even a stick of gum.  This way.    Yeah... yeah... maybe... maybe...        Isn't it wonderful?  (emotionally at the breaking point",
        "Bert": "He never thinks about himself, God; that's why he's in trouble.  George...     No, thanks. Think I'll go home and see what the wife's doing.  How would you like to get a ticket next week? Haven't you any romance in you?      Come on, we got to get this up. He's coming.  The groom, idiot. Come on, get that ladder.  Get that ladder up here.  Hurry up... hurry up... hurry up.     What's up, Ernie?  All right, put up your hands. No fast moves. Come on out here, both of you.  Stand back.  Come on, come on.  Look, now why don't you be a good kid and we'll take you in to a doctor. Everything's going to be all right.  I hate to do this, fella.  Oh, shut up!  Where'd he go? Where'd he go? I had him right here.  Well, which way'd they go? Help me find 'em.  Oh, it's you!    Hey, George! George! You all right?  Hey, what's the matter?  What the Sam Hill you yelling for, George?  Know you? Are you kiddin'? I've been looking all over town trying to find you.  I saw your car piled into that tree down there, and I thought maybe... Hey, your mouth's bleeding; are you sure you're all right?  Mary, I got him here from the airport as quickly as I could. The fool flew all the way up here in a blizzard.",
        "Ruth": "Ruth Dakin Bailey, if you don't mind.    Oh, of course. I've heard him speak of you.    Oh, well, my father owns a glass factory in Buffalo. He wants to get Harry started in the research business.  Oh, yes, very. Not much money, but a good future, you know. Harry's a genius at research. My father fell in love with him.",
        "Dakin": ""
    },
    "imdb_rating": "8.6",
    "description": "George Bailey has spent his entire life giving of himself to the people of Bedford Falls. He has always longed to travel but never had the opportunity in order to prevent rich skinflint Mr. Potter from taking over the entire town. All that prevents him from doing so is George's modest building and loan company, which was founded by his generous father. But on Christmas Eve, George's Uncle Billy loses the business's $8,000 while intending to deposit it in the bank. Mr. Potter finds the misplaced money and hides it from Uncle Billy. When the bank examiner discovers the shortage later that night, George realizes that he will be held responsible and sent to jail and the company will collapse, finally allowing Mr. Potter to take over the town. Thinking of his wife, Mary, their four children, and others he loves will be better off with him dead, he contemplates suicide. But the prayers of his loved ones result in his guardian angel named Clarence Odbody coming to Earth to help him, with the promise of earning his wings. He shows him what things would have been like if he had never been born.—alfiehitchie",
    "name": "It's a Wonderful Life",
    "genres": [
        "Drama",
        "Family",
        "Fantasy"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZjc4NDZhZWMtNGEzYS00ZWU2LThlM2ItNTA0YzQ0OTExMTE2XkEyXkFqcGdeQXVyNjUwMzI2NzU@._V1_QL75_UY281_CR2,0,190,281_.jpg"
}