{
    "filename": "Jason-X_script.txt",
    "imdb_id": "tt0211443",
    "imdb_url": "https://www.imdb.com/title/tt0211443",
    "characters": [
        "Fat Lou",
        "Kicker",
        "Johnson (Soldier #1)",
        "Tsunaron",
        "Jason Voorhees /Uber-Jason",
        "Azrael",
        "Dallas",
        "Kay-Em 14",
        "Dr. Wimmer",
        "Briggs",
        "Rowan",
        "Janessa",
        "Sgt. Marcus (as Marcus Parilo)",
        "Sgt. Brodski",
        "Professor Lowe"
    ],
    "dialogues": {
        "Fat": "Let's go! Time to load up!  YLLO, a professor of archaeology lowers his veil.   Shit! Temp's dropping! We should have left this rock an hour ago!   Hey teach! This rock's starting to freeze! Get your ass back hre!   Oh my God . . . what the hell is . . .   This is Beowulf approaching from sector fifteen.  Through the front windshield we see - -  GRENDEL, a class IV Catamaran Transport. It looks like two huge torpedoes attached by three thin walkways. Not new, but by no means old.    Grendel to Grendel's mother, we are enroute.   I'll need the sergeant's okay on that.   Alright, relax. 20 minutes. Soon as we've passed Tara's rings we'll make the course correction.   Disengage auto-pilot.   New COURSE, seven-eighty-one.   Engage auto pilot.  Suddenly, Bernie is ripped from his chair! Electricity SHOOTS through the console as Bernie's DIALOG becomes jibberish.",
        "Lou": "Let's go! Time to load up!  YLLO, a professor of archaeology lowers his veil.   Shit! Temp's dropping! We should have left this rock an hour ago!   Hey teach! This rock's starting to freeze! Get your ass back hre!   Oh my God . . . what the hell is . . .   This is Beowulf approaching from sector fifteen.  Through the front windshield we see - -  GRENDEL, a class IV Catamaran Transport. It looks like two huge torpedoes attached by three thin walkways. Not new, but by no means old.    Grendel to Grendel's mother, we are enroute.   I'll need the sergeant's okay on that.   Alright, relax. 20 minutes. Soon as we've passed Tara's rings we'll make the course correction.   Disengage auto-pilot.   New COURSE, seven-eighty-one.   Engage auto pilot.  Suddenly, Bernie is ripped from his chair! Electricity SHOOTS through the console as Bernie's DIALOG becomes jibberish.",
        "Kicker": "Yo, Teach, what the fuck?   Get your ass back to the shuttle. I'll check it out.  KICKER moves past the group and into the Van.   All right, all right, enough with the history lesson. Lets find these two quick . . so I can kick some little punk ass.  Kkinsa shines a flashlight around the dark tunnel.   Back to the shuttle! All of you! I'll find them.   We don't have time for this shit.  As they pass we see a section of the jagged metal ceiling twitch and squeeze together. That can't be a good thing . . .  STONEY and Adrienne stop at a huge metal door. Above the door . . .  Now wait a minute! I don't think you should open that door.   We're outta here!  Yllo pulls away, leans over the frozen girl, grabs the frozen string of blood and -CRACK-breaks it off.   Don't touch that!  Gas rolls out. Suddenly ALARMS SOUND and LIGHTS STROBE.   Defense droids. I'm on it.  Kicker slams the Cryo door shut as lasers slice into it.    They're only class two. I can handle this. No problem.   Stand back!  He pulls a gadget from his pack, punches in a series of buttons.   Come on!  Kicker throws open the door and starts BLASTING! Yllo and the kids follow him into the hall, the two stretches in tow. They disappear around the bend - towards the exit.  A beat then . . . screaming. They run back into view. Behind them - -   We need another exit! I'll hold 'em off! Teach, find a way out!   Sorry kid, leave this to the pros.   Leave him behind!   Then duck.  CHA-CHUNK . . he cocks his grenade launcher and fires at the ceiling.  KABLOOM!! Rocks and falling debris reveal the violent surface above.   Make it happen!   They've got me! Let go!    This will be!  The others dive for the ground as -  -  KAFOOM! A FIREBALL rises up out of the hole!   Oh man, what the hell happened?   Damn. Are they playing?    Sarge, this is Kicker. Dallas got it to. Real slice and dice. What should we do?     Roger that.  Time to kick some ass!  From behind him a shape materializes. A hand reaches out of the darkness.  KICKER JUMPS! Spins around with his weapon at the ready!   Don't friggen do that!   Fuckin A...   Negative.  Rizzo stands over Thorgan to see the monitor.   Jesus, Sarge, what is this thing?",
        "Tsunaron": "",
        "Azrael": "I've got my project. What are you losers gonna do?   Cool . . . check out my arm.   Not a problem?!  Kay-Em injects him again.   I'm missing a fucking arm heeeerrrr-  Oh, that's dreamy.  The lasers begin strategically slicing through hinges.    That is soooo cool!  Kicker cracks the door and tosses his gadget.   Oh shit I forgot my arm!   Watch it punk, I'm armed.   You'll pay for that.  Dallas and the grunts laugh.   Lucky?!  Azrael sits in a large machine. This is . . .  The NANO-TECH 2000. It can repair non-fatal injuries with the use of Nano-Technology.  Azrael is scanned by the NT-2000 and so is his injury. It goes into action as articulated mechanics begin to re-attach his arm.   Another hour and I'd have lost the arm.   I better get extra credit for this shit.   Don't I deserve a sick day or some shit like that?  Yllo exits.  You got lucky.   Speaking of which, duck!  Dallas hits the deck as Azrael FIRES, disintegrating another. Beyond it lunge a half dozen more.  Dallas and Azrael scramble to their feet, take aim, when --   What the?!   Pause play.  Suddenly the aliens freeze in place. Jason stares at them, then turns to Dallas and Azrael.   Hey cool. They brought ancient hockey guy back to life.  Jason walks up to them. Titls his head like a dog hearing a high-pitched whistle.  Why aren't they running.   Hey! We're playing a game here. Get off the court!  Jason raises his silver blade high.   Asshole that does not count as a kill.   Oh, come on!  JASON is confused. He spins and slashed taking Dallas' head clean off. The head falls to the ground, then Dallas speaks.   Alright, asshole.  The sound of an ENGINE SHUTTING DOWN.  Jason finds himself standing alone on a huge open court, all white, sterile.  No creatures, no Dallas or Azrael. A both ends of the white garganuan room we see a small tinted glass.  Azrael's voice booms over a loud speaker.   Clear off the court, asshole.   Yeah yeah I better call the labs, see what the hell is going on.  Jason stares at the tinted glass of Azrael's booth.    Lab...this is AZ in the game grid. Your guy got out and runined our game.    I said the guy in the mask is in here ruining our game.  Jason starts to close in on Azrael's pod.    Send someone to the grid to pick him up. He looks lost.    All right fine, we'll head back--  Suddenly, JASON shoves his fist through the glass.",
        "Dallas": "Punk?  Dallas slaps Azrael across the back of the head as he passes.   That's nine to four, geek-boy.   You got lucky. I could have waited until he ate your head.   He's good.  Azrael smiles knowingly. He takes aim and lets loose a blast at Jason. Aliens scatter as the blasts hits Jason dead on. Dallas joins in unloading on the hulinking terror.  THeir assault has no effect on Jason whatsoever.   That sucks. Why won't he go down?   He's not part of the program.   No, we're playing a game...not you numbnuts...  SLASH! The blade slices through Azrael's shoulder to the bottom of his rib cage. Blood spurts as his right side pulls away from his body. Azrael does not seem hurt, only pissed.   Yes it does.   Okay, enough of this shit.   I don't have all day, kid.   Jesus!  The sounds of Azrael's DEATH broadcast over the lab.  When Jason retrieves his hand, he holds a bloody mass of Azrael's insides.  IN THE LAB, Brodski takes charge.    Sarge! Get the fuck down here! We got a real shitstorm in the --  DALLAS fights to get out of his virtual reality suit and get himself into combat mode...BUT...  JASON hears the movement. Turns, flings his silver blade.  It flies across the room, throught the glass and impales Dallas' throat to his chair.  The blade shrots out the electronics in the grid and plunges the room to black.",
        "14": "The air's laced with type two ozone, it reads as a solid.   In twenty-eighty-two many of the survivors moved their facilities underground to escape . . .   Was that out loud?   Girth is better than length and women prefer a shaved scrotum during oral sex.  Yllo glares a Thorgan.   The room's still operational. She's perfectly preserved.  Yllo's face lights up, grabs his radio.   Hold your breath. Initial cryo gasses will render you unconcious.   Female, nineteen years old, eight months . . . 34-26-34 . . . bitch is built like a brick shit house.   Time of hibernation 2049. Crystallization at seventeen percent. Suggest extensive Nanotech. Chances of rejuvenation eight-one percent.   Subject was dead prior to incubation.  Yllo moves to get a good look at Jason.   Subject is critical. Needs nano stabilization immediately.   Subjects scan virus clean . . .  Brodski attempts to shove Kay-Em out of his way . . . BUT she stands her ground . . . grabs his crotch.   Mmm, you like the rough stuff don't you, big boy?  Brodski and Yllo look at Thorgan.   The mask is an artifact from a sport outlawed in twenty-twelve.   A medieval sport where two teams club one another with elongated sticks. Very sexy.   Subject is stable and cell reconstruction has begun.   Again proving that your ancestors were savages.   Live signs full strength. Heart rate above normal -  Rizzo's disoriented, confused. Gel slops all around her.   Kay-em 14.   Cybernetics science droid, fluent in over six...   I'm afraid I cannot assist.  Rizzo is very frustrated.   You need to get laid!  Thorgon looks up from his work.   E-x Grunt Condor has flatlined.   Heart beat irregular...no blood flow... impossible...this....this... does not make sense.  Jason's heard enough. He swings his cleaver, but Kay-Em ducks. Turns and leaps through the hole in the celing.   Now that's just gross.   I'm quite sure I wasn't designed for this.  Crutch comes to a fork in the walkway.   I got a brand new pair of roller-skates, you got a brand new key...   There's not enough time.  Rizzo catches up.    You know what you get if you shove two bananas up your ass? Two shit covered bananas.    Impact in ten minutes. It will take fifteen to reach the bridge.  Mamma's little baby love shortnin, shortnin, mamma's little baby love shotnin bread...   Allow me. I'm trained in all aspects of the human psyche.  Rizzo backs away -- as Kay-Em nears the mike ...   Kkinsa, dear, it is I, KAY-EM 14... open the fucking door you silly bitch!  Rizzo shoves Kay-Em out of the way.   I didn't say I was good at it.   I seem to have misplaced mine.  Kay-Em 14's right arm is missing, wires sticking out of the stump.   Engage magnetics.  Kay-Em 14's left hand magnetically locks to the Cargo frame a   We've lost too much pressure. An hour, tops.   No...  That's the sound of the men working on the chain gang.   I'll never experience my fantasy of three sex droids, two humans, and a Knofflapod. Damn.   Sory...   Now this is getting exciting.   It's just you and me, then.   Ow!   Sometimes I just wish I had a kitten.   Who are you apologizing to?    Where her severed arm had once been, a chain gun is now attached. A laser cannon is mounted over her shoulder. Her body has been reinforced with steel from around the lab. Sinks, trays, you name it. She's the junk yard man's terminator. Then --   Do I have to?   Oh, alright.    We see a somewhat computerized image of Jason through Kay-Em's personal scan. One the display we see:   Come on, boy. Let's see if we can open up  can'a whoop ass!  BRAAAATTTT! The chain gun rings! Jason is SLAMMED into the HULL DOORS.   Don't worry about me. I live for this shit.  And with that, Kay-Em BLOWS the now standing Jason into another wall with the laser cannon.   She's the Yellow Rose of Taegu, the girl that I adore. Her cunt it smells like cock juice; she's a good two-dollar whore. You may talk to me of Seoul girls or whores from Tokyo, but the yellow rose of Taegu beats them all, I'd you know.    She was a young and charming girl; her age was scarce sixteen.  JASON rushes KAY-EM 14!   She took me in and she kicked out a sailor and marine.   She had no titties on her chest; that didn't bother me,   For what she had between her legs was big enough for three.   Why you low life, scum sucking, rat dick blowing, sum bitch. Your mamma must'a had some huge balls.  Of course, as anyone knows, you don't diss Jason's mother.  Jason leaps, tacking Kay-Em 14! They roll into another glass case. Glass, formaldehyde and specimens rain down on top of them.  Having lost his machete, Jason BASHES at Kay-Em with his fists. OVER and OVER. He catches a rhythm. Kay-Em is trapped below.    That was very good. You should feel very good about yourself right now. Good effort.  How could you hit a girl you sumbitch?!  Kay-Em 14 places the chaingun over Jason's chest.   Okay, dip shit. Time to finish you off so I can go home and boink your momma with a corndog. The kinky bitch.  Chaingun and laser cannon UNLEASH A MASSIVE DISPLAY on the fleshly body of   Bang, bang Maxewells silver hammer came down upon his head. Doo-pee- do-do. Bang, bang Maxewell's silver hammer made sure that he was dead...  Jason climbs to his one good leg but i t only serves as a better aim for Kay-Em 14.  KA-FOOM! The laser cannon blows Jason's left arm to hell.    This time, Jason's body doesn't move.   Oh...my...god. What have I done?  Thorgan!  Kay-Em turns and races down the hall.   Thorgan I'm a murderer!    Sumbitch won't be giving us anymore trouble.    Blew half his skull away, one leg, one arm and left his entrails stretched across the lab. And look at me! I'm covered in his filthy blood!   A real mamma's boy that one. Dissed his mamma and he nearly threw a tantrum. Little good it did him.   No, fuck me.  The door opens and Jason steps into the walkway.  But he's no Jason we've ever seen before. His leg and arm are now SHINY METAL. His clothes are BLACK, no longer tattered. His mask is  Yeeee-haw!!!!   That's the best you can do?  Jason yanks his machete from the side of Kay-Em's neck. Severing her head from her body. It flies down the hallway behind the kids.   Is that it? Come back and fight like a man!   I think I'm going to throw up...   Oh, goody. I'm so pleased. I'd clap if I could.  Boeman CLICKS on a console keyboard.   You must shut down the engines.   It was my pleasure, my love. Perhaps if all works for the best you can rebuild me and we can try that doggie style thing again.    I get no kick from champaign, mere alcohol doesn't faze me at all, but I get a kick out of you.   Uh-oh. That's not a part of the program. Thorgan, we've got a problem!    AS it skitters across the floor --   Ahhhhh!  -- and right out the air lock   Hello? A little assistance here?  They turn to see Kay-Em's head floating close by. Thorgan graps at her and pulls her head into his arms.   I am now. I missed you, Thorgan.   I love you.  Those two aren't the only two.",
        "Dr.": "",
        "Wimmer": "",
        "Briggs": "He was...he was right here!   Got it.  BRIGGS and GEKO split up, moving around a large metallic tank.    Gun ready, he moves around the crated fuselage slowly.   I don't see anything.   That's GEKO. mAYBE you kids should stay out of this.  Briggs removes his gogles only to find Jason standing before him, holding Geko's body...impaled onto his silver blade.  BRIGGS fires...screams.   He doesn't show up on...  PAINFUL GURGLES then two more blips disappear.",
        "Rowan": "",
        "Janessa": "Bitch looks dead to me.  The RADIO CRACKLES . . .   First field trip and you think you're a Scientist. Move out of the way geek.  JANESSA moves to look inside the chamber.  As the gas and steam clear - we hear the sound of CRACKING ICE, see a jagged mass of frozen crystals . . . and within it . . . a body. A chunk of ice CRACKS and falls tot he floor then THE MASK of JASON VOORHEES looms forward!  JANESSA screams as JASON'S BODY, stiff as a board, CRASHES to the ground sending ice shrapnel everywhere!   Okay rent-a-cop, do your shit. I gotta date tonight.   They're just subclass B droids. I'm so not impressed.   Oh, was that the hand you beat off with?   Oh that's scientific.   She's not that great.   It's just like Thorgan's. What do you think this means?  Thorgan grabs his crotch.   Small brains make your balls itch?   All this science shit, makes me horny.  Take off your cloths, we don't have much time.  She drops her shirt to the floor. Yllo retrieves it, hands it back.   You're quicker than usual.   You prefer an apple?  He forces her into the hall, closes the door, locks it. He returns to the console.   Oh my God! Adrienne?   Maybe she tripped.  Brodski and Kicker burst into Lab Two, they react to the carnage.   You know, Stoney's done everyone on this trip but me..what's up with that?  Brodski scans the room - a tactical assessment.   Look ice chip, why don't you just chill out and let us handle this?   What are you doing?   What do we do?!!   Okay, I'm guessing you should hurry.  The top corner of the door bends...Jason peers through.   That was fun.  Kay-Em 14 sits up, sings.   Thorgan?!   I think your metal lover's losing it.   What?!   Okay, tell you what. You die, we'll run.  Rizzo and the others back into a corner. Jason has them. There's nothing they can do.  Rizzo holds the gun steady, waiting for point blank range.   You geeks wanna gimmie a hand?  Janessa is buried beneath a pile of rubble. Boeman helps her to her feet.   This is just great.   Boeman, can you reach DeLongpre? We'll push you in.   Forget her, she's a pain in the ass. Let her hang there.  Crutch's body floats into our heroes, his intestines spilling from his open gut, tangling around our heroes.   That ought'a help the situation.   Okay that hurt.   Shit. He's gonna send himself right at us.  Jason takes aim.    Get off of me!  They stand slowly, eyeing the rubble.   Let's just get out of here.   So what else is new?   Are you crazy?! Pull the lever!  Boeman yanks the lever.  As the others climb into the lab --    You happy? You've killed us all!  Thorgan rushes over to the big Nano-tech machine. Places his broken arm on the slab. The machine quickly goes to work.  A schematic of his arm appears on the wall.  Janessa stares at him.   What's the point?  Delongpre shrugs.   No.   A little late to be thinking about escape, isn't it?   You know, Yllo seemed to think we could catch this guy alive, well, he'd be worth millions.  The others stare at her as if she were crazy.   I'm just saying.   YeaH, GREAT IDEA! And I'll keep the big guy distracted with a blow job.   You're so bossy.   Thorgan, you little shit, is that you?  No answer. She quickly turns to her pack and pulls out the bottle of tranquillizer and a monster syring.e She fills this rhino syringe with a massive dosage. Enough to bring down a Rhino...or Jason maybe?  She starts moving down the walkway toward the Cargo Bay. Surely she's not that stupid.   Damnit! You scared the hell out of me!   Jason. He's what happened. Then Grendel hit Space Lab.   Yllo's dead. We...we thought you were too.    Lights a flare, blinding Jason for the moment. Then she sinks the Rhino syringe into his chest! Jason stumbles...falls hard on his ass and sits there staring at her.   Well go on! Pass out!  Jason tears the syringe away and tosses it aside.   Shit.  Jason starts to climb to his feet. Janessa turns to run.   He....He...   He came for me, I had to run!   I...I don't know what I did...   He was chasing me!   I don't know...sorry?   They're not gonna make it. Close the door before he gets us all.   Close the fucking door!   Pull me in!",
        "Sgt.": "",
        "Brodski": "Yllo, Sergeant Brodski. Get your ass back to the shuttle!!   Kicker! Get them the hell out of there!  Janessa removes a Metallic cube from her backpack, clicks a button and a flat stretcher expands and hovers a few feet off the ground.  Kicker grabs Yllo.   What the hell were you thinking?  YLLO ignores him, turns to his team.   Not so fast Yllo! There's a protocol here.  The E-X Grunts step in front of kids.   My god! This is way over your head, pal. We need to call some experts and . . .   You're a teacher.   What if they're carrying? Did you even check?   Thorgan!!   How do you know that piece of cursed rock down there doesn't carry something metal tits can't detect?   Damnit, Yllo! I don't like it.   I still think we should send for a team of real scientists.   Right now, I care only for the safety of this crew. You don't know anything about these two -  The stretcher with JASON moves by them. Brodski looks down.   Jesus what the hell is that?   My job.   I like her already.   Give it a rest Yllo. She needs some time.   I'm with you kid.    Lab two, relax. What's the matter? He's dead.   Jesus, God!   Dallas! That you? Come back!    Dallas?! Dallas?! Do you copy?  Nothing. Finally...   Kicker, Sven. Get into the grid and tell me what the hell is going on!  She gets up and heads for the door.   I doubt that. I think we can handle whatever your ancient hockey player can throw at us.    Dead?   Report to weapons. We're going on a hunt.   Yllo, what's your head count?   This place should be safe. Get them back here. I don't want to be hunting around and kill one of your kids by accident. As much as I've dreamed of doing that.  Brodski goes to Rizzo while Yllo buzzes Stoney's cabin.   I need to know what you know about this guy.   Not an option. I'm going to hunt this son of a bitch down.  Rizzo shakes her head. She can't get through to this guy.   I've been a grunt for fifteen years. There's not a problem I can't fix with enough ammunition.  Yllo is getting no response.   Not a chance.   You got that right.  They arrive at the door of the WEAPONS ROOM.   You sumbitch! Three dead! On my watch! If that...that thing is out there, it's dead! You got it!!!   Now get out of our way...get back to the lab and baby sit your snot nosed brats... we've got a job to do!   Got it! Let's move out girls. Yllo go to Lab two and cover out backs.   I'll try.   Alright, the teach requests we take this guy out at the knees. I say shoot to kill.  The boys fidget with excitment. Bout time they see some action.   So after you've killed him, put one in his knee so we can say we tried.  The men LAUGH and high five.   Go to infrared, stay in radio contact.  Teach you there?   You just keep an eye out.   Let's move out.  The doors HISS open.   Two teams, Port, starboard.  They split up.   Kicker, anything?   Briggs, Geko, talk to me!     DAMNIT to hell! We're coming to you!   Teach! Where the hell are you?! Where's our visuals?!!   wHAT'S My status?! I've lost three men and your worthless fuck! After I kill this asshole I'm coming your Yllo!    As he races around a crate. Sven's body is within sight. His killer nowhere to be seen.   Kicker? Where are you?  Elsewhere we hear GUNFIRE followed closely by a SCREAM!   Find Crutch! Set up an ion field around the cargo bay. We'll torch the sucker! Yllo...you're a dead man!  Brodski races toward the Cargo exit.    What?  Yllo considers then.  Where is everybody? What happened?   Give me a break! What happened?   Space Lab?! Wait'll I get my hands on Yllo.   Takes more than a steelbalde to take this old dog down.   Yup, that ought'a do it.  Jason turns on Janessa.  She stands frozen in fear.  Jason raises his machete and --    He-help me...  He holds his hand out to her. Then--   You stupid bitch!  Everyone jumps as Sergeant Brodski leans against the walkway door frame. He's bound his wounds with a make-shift tourniquet wrapped around his mid-section.   Damnit to hell, you left me back there to die!   Yeah, yeah.  Well, what have you got to say for yourself?   Bomb?   How much you need?   Blowing the walkway? You come up with that yourself?   Kid, you ever thought about the marine corp?  Delongpre calls fromthe far end of the walkway, welder in his hand.   Well fuck me.   Damage?  Boeman climbs to a console.   I'm pulling, damnit!  But Jason grabs Janessa's ankle and jerks. She's pulled from the Sergeant's grasp.  She flops around in the sucking wind as Jason watches. He lets go.  She flies toward the hole, slams into it.  Everything goes quiet for a moment. As he body has sealed the hole then --   Well, that's a shame.   We need weapons.   Can't shut em' down from here.   I'll go.  The kids give him the \"are you crazy?\" stare.   Get out of here!  SERGEANT BRODSKI, still in Jason's clutches, kicks at the door panel.  The door starts to close as Jason begins hacking with his machete.   That all you got?!!  Jason hacks and hack, stabbing through the space suit, until finally, the tough old leather neck is silent for good.    Still barely alive barrels into Jason, vlinging to his back. He turns, slashes with his knife and severs the hoses.  Jason and Brodski tumble towards EARTH II.   Yeee---Haaaaa!!  Slowly they begin entering the atmosphere.  Immediately Brodski is engulfed in flames and is gone. He was a good man...stay to the end to make sure the job was done right.  Spread eagle and alone, facing the planet below, Jason continues his descent.  His fingers wiggle as his chrome mask begins to heat up. It begins to glow. His metallic arm and leg glow.  Flames build as he rockets towards Earth II.  Flesh BUBBLES and OOZES.  His legs and arms begin to flail as hunks of burning flesh fall from his body!",
        "Professor": "",
        "Lowe": ""
    },
    "imdb_rating": "4.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYzc0MDllYjktYzFjZi00OTgwLWJmZWMtODlmMTVlODQyZTgwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "In the Year 2008, Jason Vorhees is cryogenically frozen in a Government Facility in Camp Crystal Lake, along with scientist Rowan. Many centuries later, in the year 2455, Earth is uninhabitable, and humans have moved to another planet known as Earth II. However, a team of students awakens both him and Rowan on a spaceship known as the Grendel. Jason begins killing the students and crew of the ship. Along the way, he is upgraded to Uber Jason. It's now up to Rowan and the surviving students to stop Jason, this time on a spaceship.—updated by Lucy Gillam",
    "name": "Jason X",
    "genres": [
        "Action",
        "Horror",
        "Sci-Fi"
    ]
}