{
    "filename": "Jennifer's-Body_script.txt",
    "imdb_id": "tt1131734",
    "imdb_url": "https://www.imdb.com/title/tt1131734",
    "characters": [
        "Nikolai",
        "Officer Roman Duda",
        "Jonas Kozelle (as Joshua Emerson)",
        "Jennifer",
        "Keyboardist",
        "Mrs. Dove",
        "Mr. Wroblewski",
        "Officer Warzak (as Juno Ruddell)",
        "Colin Gray",
        "Dirk",
        "Chas",
        "Mick",
        "Toni Lesnicki",
        "Needy",
        "Chip Dove"
    ],
    "dialogues": {
        "Nikolai": "I'm Nikolai Wolf, and this is my band.  I hope we can live up to such...high praise.  Yeah. But I think it's so important to connect with our fans in rural areas. Plus, the audiences in small towns really appreciate us.    Dirk, what about her?  No, the hot one. The one who just walked away. She's it, man. She's exactly what we're looking for.  She's a kid. We're in God's country, man. Everyone out here's a fundie bible-banger. Of course she's a virgin.  Dirk, we didn't haul our asses out to this corn palace for nothing!  Good evening, Devil's Lake.  Sorry. Anyway, we're Soft Shoulder. And we just want to make you happy.  Are you girls all right?  Those guys? They were the first ones out the door. Ran for the van like a bunch of Marys. Frankly, I'm ashamed of them.  God, it feels like hell out here. Come and hang with us in the van for a while, just until they hose this place down.  You're in shock. Here, drink this. You'll feel better.  We'll be able to afford new gear soon enough. I have a feeling we're gonna blow up.  Shut your mouth, object.  You wish.  Told you, Dirk. You owe me a beer.  We got a waxing moon. Perfection.    Then grow a pair and fetch me the ritual! God.  What? I found it on Google.  We come here tonight to sacrifice the body of...  ...this chick from Devil's Kettle.  That's fascinating.  I only hump nines and tens. You're a seven at best, even with the chicken cutlets.  I'm gonna carve you like a pumpkin, bitch. Don't you know that me and my boys are in league with the Beast himself?  We've spent months making offerings to the \"man downstairs,\" and whaddya know? Satan delivered! We went from college radio to being courted by the majors in two months.  But that's not enough, Jenny. We want designer drugs. We want groupies that have their own groupies. We want speedballs and stadium tours and Skittles sorted by color. In short, we want more. And to get more, we have to butcher you. And bleed you.  Sorry, darling.    With deepest malice, we deliver this virgin unto thee.  It's a bowie knife.  \"There's a starman waiting in the sky...\"  Good evening, babies. Are you ready for some bad vibrations?  Shut up. It's good PR.      I think this girl's flipping out.  Look at her.",
        "Jennifer": "The sprawling ranch house is dark from the outside except for a single FIRST FLOOR WINDOW-- Jennifer's-- still illuminated. There's a chicken coop and a wire livestock pen in the backyard. We're definitely in deep north country.  JENNIFER CHECK lies on her bed, fidgeting as she watches TV. She's a girl of 16 with LONG, MATTED HAIR and a thin, frail body. Her features are gorgeous, but she looks sick and haggard. She picks at her skin with yellowed, Nosferatu-like fingernails and chews idly on a limp lock of hair. Jennifer wears a tight T-shirt that says KETTLE HIGH FLAGS and underwear.  An `80s HORROR MOVIE flickers on the TV. Jennifer half- watches, distracted.  Huh?    Jennifer gasps, staring at her wounds in shock and disbelief. She looks back up at Needy. A beat of silence. Suddenly, THE GIRLS' BODIES LEVITATE RAPIDLY TOWARD THE CEILING. They wrestle in a bloody, screaming airborne heap, their figures entwined. Their bodies FALL, collapsing back onto the bed with a thud.  Needy raises the box-cutter and plunges it into Jennifer's HEART. Blood GEYSERS from the wound.     Three police cars squeal up to the curb with sirens and lights engaged. OFFICER ROMAN DUDA, 22, a muscular young COP, jogs authoritatively toward the house. He shakes his head, dumbfounded.   Hey, Monistat.  You and me are going out tonight.  Soft Shoulder are playing at the Carousel.  And it's all-ages, for once, which means I won't have to play Hello Titty with the door guy.  They're this indie band from the city. I saw their MySpace and the singer is extra salty. And there will be lots of other salty morsels there for you. Come on Needy, it's the weekend!  Thursday counts as the weekend in college. And we're going to be in college twenty-three months from now. University of Northern Minnesota Duluth- woo!  Please, please you're a social disease?    I'll pick you up at 8:30. My mom has a date with that guy who owns the ham store.        You're lucky you get to ride with me to the club in style!  Oh, hi Chip. Do you like puppies?   It smells like Thai food in here. Have you guys been fucking?  Okay, let's go to the club.  Eat my ass, Chip. You're just jello `cause you're not invited.  You're totally jello! You're lime green jello and you can't even admit it.  God, I can't wait until I'm old enough to get wasted. Have you ever had peach schnapps?  Peach schnapps are excellent. They even taste good when they come out of your nose mid-puke.    He thinks he's cute enough for me. No wonder he's in retard math.  I can't believe we traded a cute hockey player for that.  Do you think he's circumcised? I always wanted to try sea cucumber.  What? I like the Wides.  Arrest me, pfft! You're not even out of the academy yet, Roman!  How will I wait that long?  You can tell they're from the city.  You would think that. You're such a small-time Gomer. I wish we had more guys like that in Devil's Kettle. All stylish and shit.  Hey, I think they need two groupies. Come on! It'll be like Almost Famous! I'll be Penny Lane and you can be the other girl.  Don't be J.V., Needy. They're just boys. Morsels. We have all the power, don't you know that?  These things are like smart bombs. Point `em in the right direction and shit gets real.  Hi. Um, we just really wanted to meet you or something? I'm Jennifer Check and this is my friend.    Can I show you my appreciation right now?  Like, I'll buy you a drink? I mean, I'll see if I can get you a drink. They make this great 9/11 tribute shooter? It's red, white and blue, but you have to drink it fast or it gets all brownish.  What? Are you scared of rock stars too?  I think the singer wants me.  Yeah, right! I'm not even a backdoor-virgin anymore, thanks to Roman. By the way, that hurts. I couldn't even go to flags the next day. I had to stay home and sit on a bag of frozen peas.  Well, if Nikolai wants innocent, I can do innocent. I'll be Little Miss Fucking Sunshine.  Don't cock-block me, Needy.    Okay...okay...    Needy, stop it. Just stop it!    Happy Friday!, D-bag!  Yeah. Why wouldn't I be?  Needy, you're delusional. I got a little banged up when you made me go out that window, but I'm fine.  You do have a tendency to overreact. Remember at Girl Scout camp when you thought there was an earthquake and it was really just two guys with a ghetto blaster?  Anyone we know?  Sucks to be them, I guess.  What's wrong with you? I mean, besides the obvious surface flaws.  Don't talk to yourself. It's one of your more freakish Needy behaviors and it makes us both look like total gaylords.  Eww, you need a mani bad. You'd better find a Chinese chick to buff your situation!    No way! Parrish ate shit?    Hi!  I'm crazy-sorry about your profound loss. You are crying about Craig, right?  I know. I was close to him too. You know, I was there last night in that horrible place. I saw Craig a few minutes before the fire broke out.  Yeah. I was probably the last person to talk to him. Like, ever. Literally.  Well, we got to talking about you, actually. And do you know what he said? He said you were like a brother to him. Not a bro. An actual brother.  I know, I know. Hey, you know what else Craig said?  Forget it. It's too intense.  Well, he said he always thought you and me would make a totally bangin' couple. Isn't that so weird?    Come with me. Just for a while. We'll help each other get through this nightmare. It's what Craig would have wanted.  (firmly covering his  What?  Mm-hmm. They're waiting.  Do you miss Craig?  Don't worry. You're going to see your buddy again.  No.   Jennifer's hair is still wet from the lake, but she's changed into shorts and a tank top. Music blasts from her stereo. She admires herself in the mirror, popping her ass.   I feel sooo scrumptious!  You know, like when you kiss a hot guy for the first time and your whole body feels like it's on vibrate.  It's that good.  Move-on dot org, Needy! It's over. Life's too short to mope over some white-trash pig roast.  I tell it like it is. Besides, you should be happy for me. I'm having the best day since, like Jesus invented the calendar.  So blow it off.  Pooh. I'm crossing you out.  What could possibly be more important than me and my godlike powers?  Chip is looking cute to me lately. So tell me, is he packing some serious pubic inches? What's the story down there?  Bo-ring!  No. I feel like boo-boo. My skin is breaking out. My hair is dull and lifeless. God, it's like I'm one of the normal girls!  PMS isn't real, Needy. It was invented by the boy-run media to make us seem crazy.  Yeah. It's poorly produced. Could the bass be any lower in the mix?  I'm fine. It's just, like, wearing off or something.  No, dick ridge! Just forget I said anything.  Oh, hey Colin. Listen, can I copy your bio lab again? I never got around to dissecting that kitten fetus.  Oh. You want to know if I'll go out with you.  Just go ahead with the pitch.  I don't like boxing movies.  Wait!  Why don't you just come by my place tonight? I just got Aquamarine on DVD. It's about this girl who's like, half-sushi. I guess she has sex through her blowhole or something.  I'll text you my address.  I'm used to guys asking me out.  He's into maggot-rock. He wears nail polish.    I gotta go parlez French. Slam you later.  You made it.  No baby. This is our house, just for you and me. We can play Mommy and Daddy.  Silly. I've been sending you signals all year. Couldn't you tell? You give me such a wettie.  You scared? I thought boys like you were into vermin.  Nice hardware, Ace.  Oh, don't you dare pass out! I need you to be conscious.  I need you frightened.  I need you hopeless.  I'll be Perfect Prom Barbie and you be her.  You can be Ugly Ashley or Ken. Choose.   We're sisters now, you know.  Don't tell my mom about this. She'll make me get a shot.  What's up, Monistat?  God, enough screaming already. You're such a cliche.  But we always share your bed when we have slumber parties.  Whoa. I have never heard you drop the F-bomb before. What's buggin'?    Go ahead, narc me out. I've got the cops in my back pocket. I'm fucking a cadet, remember?  I want to explain some things to you. You've already seen too much and besides-- best friends don't keep secrets. Right?  Remember the night of the fire?  Well, I got pretty messed up. I almost died. You know those guys in Soft Shoulder? Totally evil. They're basically agents of Satan with awesome haircuts. I figured that out as soon as I got into their molester van.  Guys? Where are we going?  Are you guys rapists?!  Yes...yes! Of course I'm a virgin! I've never done sex ever. I don't even know how. So maybe you should find some other girl who does. Know how.  Just let me finish. So they drove all the way out to the falls. I tried to figure out an escape, but it was so dark out there...    Please let me go. I'll do anything. Anything you want.    Please...  Being tortured would make most girls black out or something. But I'm so hard core, I was with them the whole time. I could feel them gutting me Under my ribs, up into my belly, then right through my heart.  I'm here, aren't I?  I mean, yeah. They went Benihana on my ass. It should have killed me. But for some reason, it didn't.  Whatever. Anyway, I don't really remember what happened after that. I just-- woke up a few hours later and found my way back, somehow.  I couldn't bring myself to hurt you. I mean, I'm a really good friend. But I felt so hungry. I had to do something.  Ahmet. You made it out.  Are you lost?  Does your host family know you're alive?  Does anyone know you're alive?  Come with me. We'll sort this out.  Ever since then, I just somehow knew what I needed to do to be strong. And when I'm full--like I am right now--I'm like, immortal! I can do stuff like this.  No biggie. Watch.  That's some X-Men shit, right?  You know. Full. Like full of tasty morsels.  Forget it. You'd probably tell on me anyway. Not that anyone would believe you. You always think the world is coming to an end.  You should talk to someone about these disturbing thoughts you're having. We're all concerned. Especially Chip. I think he's having second thoughts about you.  My, aren't we a C-U-Next-Tuesday?  Come on. Let me stay the night. We can play \"boyfriend/girlfriend\" like we used to.  You said to leave. So I'm outtie- 5000.  See you at school.   Didn't you hear me calling your name?  Yes, I was.  I think you were maybe spacing out. You were like this: Derrrrr.  Yes, exactly like that. Listen, I need to talk to you about you-know- who. Our little Needy.  Are you worried? `Cause I'm super- stressed about her. God knows how I even sleep at night.  I think I know what's wrong with her. In fact, I know I know what's wrong with her.  I feel bad telling you this. Okay, you know Needy's been a total Lithium candidate since the night Colin Gray died. But that's not just because he was brutally murdered and stuff. It's because....I don't wanna say this.  Needy and Colin were intimate. By that I mean he was poking her donut on a semi-regular basis.  I know this must be hard for you to hear.  That's what she wants you to believe. But trust me, her and Colin were doing stuff you haven't even heard of. Total varsity moves.  Well, apparently he had a thing for me-- no surprise there. And I figured Needy was busy jumping your jock that night, so I agreed to a little pity date. Colin brought me to that empty house so we could have some privacy. But he wanted to go too far, so I left after a few minutes. Next thing I knew, they'd found...  ...what was left of him.  Huh?  I'm sorry you had to hear this from me. I'm just so worried about Needy. She's losing her shit. Colin was her everything.  I wouldn't be surprised if she winds up in the nuthouse.  Well, you've been talking to her more than I have. How bad is it?  I can only imagine the paranoid theories she's come up with.  I just can't believe she would do this to you. I care so much about you, Chip.  More than I've ever had the guts to admit.  Needy didn't deserve a boy like you.  Ooh, you're so salty!  Say it like you mean it.  Say I'm better than Needy.  We really shouldn't be doing this.  Natch.  I have just the place.  You're in big trouble anyway. Come on.  Never, Trevor. I'm hot like magma.  Swimming.  Come on in, Chip. Show me your breast stroke.  It's not so bad.  I'm sorry. I was just trying to make you laugh. I think now, more than ever, we need laughter. We've both lost a close friend.  I feel so empty.  Please come here and kiss me again. Make all this madness go away.  Fuck this J.V. shit!  God, do you have to undermine everything I do? You're such a player-hater.  Nice insult, Lizzie McGuire. Got any more harsh digs?  And now I'm eating your boyfriend! See? At least I'm consistent.  I am not insecure. God, what a joke! How could I be insecure? I was the Snowflake Queen!   I'm gonna eat your soul and shit it out, Lesnicki.  I go both ways.  Ow-Ow-Ow.  Got a tampon?  Thought I'd ask. You seemed like you might be pluggin'.  Fuck this noise. I'm out. You losers are more trouble then you're worth.  Nah. I mean, you say I've been a bad friend all these years. I might as well throw you a bone.  Needy is crouched outside Jennifer's window, hiding in the shrubbery. She looks almost feral, with wide eyes and a hungry expression. Through the window, we see Jennifer sitting at a vanity and combing her hair, oblivious to the intruder in her yard.    We're seeing a FLASHBACK of the night Needy slaughtered Jennifer. Needy plunging through the window. Jennifer thrashing. The blood. The struggle. The levitation. The arrival of the police.",
        "Keyboardist": "",
        "Mrs.": "Jennifer! What is it, baby? Oh my God! Oh my God!        By the time they found Colin in that godforsaken house, he looked like lasagna with teeth. I'd know-- I had to identify the remains. My boy's not in the realm of the undead. He's not flying around in the firmament with magical wings of flame. He's in an overpriced rosewood box that's headed six feet downtown.  So you can take your pain and shove it up your asses, kids. I got the monopoly on pain!",
        "Dove": "",
        "Wroblewski": "I'm sure those of you who made it here today have all heard the news. It's a dark day for Devil's Kettle, a day we can never, ever forget.  The administration here has decided that today will be a unstructured day of support and remembrance. We've lost nine precious students-- including Ahmet from India-- several parents, and a teacher, Ms. Parrish.  This tragedy is obviously beyond anything we can measure. More than ever, we need to band together and draw strength from each other.      Let it all out, kids.  Virgin Mother!  Before the period ends, I have an announcement.  As you know, this is the one month anniversary of the Carousel fire and also the murder of Jonas Kozelle...  ...As I was saying, Needy and Jennifer, I finally have some good news to share with all of you. The members of the rock group Soft Shoulder have decided to extend a helping hand to our community.  As you know, their song \"Through the Trees\" has become our unofficial anthem of unity and healing. So, they've decided to release it as a benefit single.  3% of the profits will go to local families who have been affected by loss.  Excuse me?   That's enough.  Can I have everyone's attention please?  Welcome to the Turnabout Dance. I hope you've all had an opportunity to consume the Pecan Sandies and Cran-Grape that were so generously donated by the Parents Club.  But the real treat is yet to come. It's happening right about now, this treat of which I speak. We have some very special guests tonight. They were kind enough to take a break from their sold-out national tour and play our dance for free.  Boys and girls, please welcome...Soft Shoulder!",
        "Colin": "Hi Needy.    Well, I'm glad you made it out. Really.    Sure. Actually, I sort of wanted to ask you something.  No! Well-- yeah. How did you know?  Well, we've been having a lot of fun in class, you and I, and I just thought maybe we could go to a movie or something. There's a midnight showing of Rocky Horror at the Bijou next weekend...  It's not...fuck it. Never mind.  Oh. Great! Okay.  Yo?  Jennifer? Anyone there?  What's going on? This isn't really your house, is it?  Do you even know my last name?  Jennifer...    I gotta go...",
        "Gray": "These are Colin's friends.    Did he...?    Jill...  By the time they found Colin in that godforsaken house, he looked like lasagna with teeth. I'd know-- I had to identify the remains. My boy's not in the realm of the undead. He's not flying around in the firmament with magical wings of flame. He's in an overpriced rosewood box that's headed six feet downtown.  So you can take your pain and shove it up your asses, kids. I got the monopoly on pain!",
        "Dirk": "You're sure she's...  Fine. Okay. You know, I know I'm not \"just the bassist.\" I'm a person who happens to play the bass guitar. And I would like some respect...      I don't know if we should go through with this.    Dude, that is a hot murder weapon!  Bowie. Nice.  This sucks old-man balls.  Why?  What could she do to us?",
        "Chas": "You're totally lesbigay.  You stare at her like you want to dry hump her.  Like, hump her through pants.  Of what? That rich bitch?  Soft Shoulder are American heroes.  Rumor?! RUMOR? It's true! It's on their Wikipedia page!  (growling, almost",
        "Mick": "You're the man, Wolf.  That's it?",
        "Toni": "You said it.  I just had one of my night terrors.  Right, right. I'm all mixed up since I started working swing again.  I dreamed some bad people were trying to nail me to a tree with hammers and big stakes and shit. Just like Jesus.  They were trying to get to you too, but I wouldn't let `em. I'm a hard-assed, Ford-tough mama bear.  It's like, don't y'all touch my daughter. I'll piss on you like Calvin.  That's what you think. One of these days you're gonna be crying out for me and I might not be there.  No. I just did my scratch tickets, snorted a few Lunesta and went straight to bed. Is something going on?  Don't nothing happen in Devil's Kettle.  Anita, that ferret stinks. He needs to be washed from craw to cornhole.  You look beautiful.  No, you've got that tiny waist, like a fashion model. I always thought you looked like Cindy Crawford.  One of the great beauties of our time. She's even got a mole like you, except hers is on her face.  Well, if Chip gives you a hickey, you can just tell everyone I burned you.  Now that's a word you don't hear every day. Hold still.  Hooker helmet.  If you can't have big what-nots, you might as well have big hair!",
        "Lesnicki": "",
        "Needy": "Every day, I get letters. I think I get more letters than Santa Claus, Zac Efron and Dr. Phil combined. I'm kind of the shit.  Grassy-ass, Raymundo.  Sometimes the letters are from people who say they're praying for me. They tell me everything will be okay if I just accept Jesus Christ into my heart. I say the words, but nothing ever happens. Nobody comes back. Nobody gets off the cross.  Occasionally I get presents from starfuckers who saw my picture in the paper and want to marry me or something. They think they can take me away from all this.  Like I'd really date some perverted Chester with a hard-on for jailbait. I might be insane, but I'm not desperate.  A lot of people ask me if I'm sorry I did it.    Welcome to the Mental Olympics. They're big on recreation here. Supposedly it helps us vent our aggressions. We've traded in our hatchets for rackets, our Drain-O bombs for double dutch.  Even the cutters get in on the action when they're fully conscious.  Me? I'm just trying to stay invisible.  Personally, I think they're trying to wear us out. Keep us sluggish so there won't be an uprising. Well, those J.V. tactics won't work against me. I'm a kicker. K-I- C-K-E-R. It even says so on my chart.     I wasn't always this cracked. I used to be normal-- well, as normal as any girl under the influence of teenage hormones. But after the killings began, I started to feel, I don't know... loose around the edges or something. I was coming undone like those jeans I made in Home Ec. Falling to pieces like Patsy Cline. Shredded like moo-shu pork. Dead inside.  God, I hate this fucking song.  This is where it all went down. \"Devil's Kettle\" sounds twisted, I know, but the place just is named after a dumb waterfall.  Well technically, it's two waterfalls. One of them is normal-- it empties into a river basin. But the other one goes into a hole. And it doesn't come out. The scientist guys can't explain it. They've dropped all kinds of things down there--bouncy balls, red dye, radioactive slime-- but nothing ever surfaces.  Maybe it's another dimension. Or, you know, just really deep.  I've probably spent years of my life in this house. Hundreds of sleepovers, thousands of aimless homework sessions, a million phone calls. I've climbed through Jennifer's window so many times. But tonight, only one of us is going to come out.  Jennifer didn't always look this rough. Actually, she was the prettiest girl in Devil's Kettle when she wasn't so...hungry.  She hadn't fed in weeks.  You'll throw me a bone, huh? Huh? You killed Chip! You goddamned monster! You...ZOMBITCH!  Know what this is for? Cutting boxes.    Is she dead, Mrs. Check? Did I get her?  Hi, Roman! How's the Force treating you? I like that jaunty cap. Blue like your balls.  Everything's going to be okay now. I rule.  Hey. Didn't you used to baby-sit me in like 1998? When my mom worked the overnight at Hormel?  Yeah. Gracie, right? Gracie. I really like your hair, Gracie. How many cans of Salon Selectives did it take to erect that monument?  Watch it, Puffy Combs. That's police brutality!  Ugh, don't say attempted. That sounds so JV. Small time. Teeny- weeny, just like Officer Duda up there. And trust me-- I'd know.  Let's get our facts straight: I successfully committed a hard core, fully premeditated murder back there. I fucking destroyed that brat, OK? I, Needy Lesnicki, put a stop-payment on Jennifer Check.  Why am I even in these cuffs? I just saved every guy in this town from becoming Satan Chow. I'm a hero.  Confessions are for pussies. You've got a declaration, Grace.  So I killed her. Whatever. It won't undo anything. Three pulses-- three lives-- all stopped cold by adolescent bloodlust. It's hard to believe that just two months ago, me, Jennifer and my boyfriend Chip were completely normal people.  We were our yearbook pictures. Nothing more, nothing less.  Jesus, Chip..  Chip couldn't drum for shit. He only knew \"Land of a Thousand Dances\" and the solo from \"Wipeout.\" Lucky for him, the pep band gig wasn't too demanding.  If you can believe it, that's Jennifer. Yeah, the same girl I iced with the box-cutter. Only back then, we were tight. Sisters, practically. People found it hard to believe that a babe like Jennifer would associate with a dork like me. But we'd been the Wonder Twins since we were practically preverbal. Sandbox love never dies.  What? She's my best friend.    She's not rich.  What's up, Vagisil?  Tonight? Why?  What's Soft Shoulder?  It's Thursday.  I have to study.  Fine. What time is the show?  He seems nice.  Okay.  Needy is standing in a small, dingy bathroom, trying on different configurations of clothing.  \"Wear something cool\" meant something very specific in Jennifer-speak. It meant I couldn't look like a nerd, but I couldn't upstage her either. I could expose my stomach, but never cleavage. Tits were her trademark.  Chip, it's a rock show. This is my rock look.  Jennifer needs me. She really wants to go see this band. It's extremely important to her.  The lead singer, of course. Girls like her don't go out with drummers.  No offense. I mean, she'd probably make an exception for a drummer who was also the lead singer.  Who's Phil Collins?  Anyway, this singer guy is like 22, so he could get locked up in the state pen if he actually dated her. But Jennifer says he's extra salty, so...  \"Salty\" means beautiful.  Jennifer's here.  (straightening her  She's my best friend, Chip. Remember? This necklace is no joke.  Jennifer is waiting in the front hallway. She's heavily made-up and dressed in a predictably sexy outfit. She dangles a set of car keys in front of Needy and CHIP.  Wow.  I think she remembered two buttons.  You're gross!  Chip was right. The Carousel is definitely not a club. Clubs are for attractive people in populous urban areas. Clubs have DJs and champagne and separate bathrooms for guys and girls. All we have is a broken jukebox, a few domestic taps and the Sticker Toilet.  Needy and Jennifer enter the bar. Every guy in the joint stares at Jennifer, who snaps her \"MINOR\" wristband distastefully.  I don't think so.  Hey, it's Ahmet from India. The foreign exchange guy. He's all by himself.  He seems okay. He's got that cool elephant statue in his locker.  Ew!    They look so-- so cool.  No!  Hey, if you don't mind me asking, why did you want to play all the way out here in Devil's Kettle? You live in the city, right?  Those guys are rank, Jen. Just forget about it.  Only because he thinks you're a virgin. I heard them talking.  Oh my God.  He's way too old for you.    You're okay, I promise. You got burned worse when you wore that tin-foil bikini to the beach. Everything's fine.  We're great. Maybe you should try to find your band?  Aren't you a little freaked out about this? What about all your stuff? It's probably melting, and when you get to the next stop you'll have to do like, a crappy acoustic set! Nobody likes that.  Why? Why should we? We have the Malibu. Let's just get out of here. We can go to El Ojo and get Northwoods Nachos with extra Badger Sauce! Please? I'm starving.  I watched her get into that van and I knew something awful was going to happen. But for some reason, I felt drawn toward them. Toward him. He was pale and twisted and evil, like this petrified tree I saw when I was a kid.  Needy's face is fixed in the same haunted expression. Nikolai turns to look at her, his teeth bared in a vicious smile. Needy turns and sprints off in the opposite direction, away from the van and the fire.       Needy stumbles into her bedroom, overwhelmed. Her clothes are smoke damaged and her cheeks are sooty. She grabs her cheap, taped-up cell phone and dials CHIP's number shakily.   Thank God you're there. I hoped you were sleeping with your phone.  Jennifer's gone. She ran off with that rock band. And the Carousel burned down.  No. I think they're mostly dead.  We went out the bathroom window. Everyone else was trying to use the door. It was like a stampede. The people who fainted got run over and you could hear their bones breaking.  There was all this screaming and popping, like a million Black Cats all going off at once. And the smell...  No! Anyway, it took me like an hour to walk home. But Jennifer's still with those creeps! They had one of those white molester vans with no windows. The back was all blacked out.    Swing shift. Listen, I'll call you in a minute. Stay awake.  Needy opens the door. Nobody there. She slams the door, turns around and SCREAMS.    Um, Jennifer?  What happened?      You-- you're all right!  Last night. At my house. You were hurt. You had two black eyes and blood everywhere and...    A lot of people died, Jennifer. They burned to death, or they choked, or they just got trampled. More than half of the people there didn't make it out. It's like, all over the news. National news. Kids are dead. Parents are dead.  We know everyone!  I don't get it. What's wrong with you?    Her blood was still under my nails. See, I'd been up all night scrubbing the carnage off the linoleum.  We see Needy on her hands and knees in the eerie blue light of dawn, sobbing as she diligently scrubs blood and bile off the floor with a dirty sponge. The black, spiny vomit repulses her, and she gags.  She reaches for a Swiffer WetJet mop and pulls the trigger. No solution comes out. She curses, hysterical and sleep-deprived.   Work, you...twat! Swiff, darn it! Swiff! Swiff!      No anything today.  I feel guilty just breathing.  Chip, I need to tell you something kind of weird. It's about Jennifer.  You know last night when we were talking and someone came to my door? That was Jennifer. But she didn't talk. She just stood there, smiling at me, but a bad kind of smile. She looked like she'd been beat up or shot or something. She was all bloody.  And then she barfed up this disgusting prickly stuff that was like roadkill and sewing needles all mixed together.  Yeah, like almost that bad!  No. It was something evil.  Chip, I'm a National Merit Scholar. I don't tell whoppers and I'm not crazy.  Discombobulated?  Oh. Hi, Colin.  Uh-huh.  Thanks.  I just am. We have Composition together. He's a really good writer. You know-- he's so dark and emotional and all.  Walk me home?  That's the thing, it's not a blur at all! I remember everything, in like ultra-high-def detail. The band, the fire, everything. Especially what happened after.  Please, I need someone to believe me. Jennifer was-- she was destroyed. She was dying in my hallway, Chip. I saw. I used my CPR training to check her pulse. And I felt her dying, on the inside, I mean. I've known her so long that it's like sometimes I can feel what she feels. We're like E.T. and Elliot Ness.  Thanks, Chipper.  Needy is preparing herself a fried bologna sandwich in the kitchen. Needy's ALBINO FERRET chases a ball across the cracked floor. Needy scrapes the sandwich out of the skillet and takes a bite.     Fried bologna is the bomb! You want some, Greedo?  Something's wrong...   Needy is seated at the kitchen table. She accidentally drops the remains of her sandwich on the floor, where the ferret quickly pillages it.  Crap!  Oh, hi, Mom. I didn't know you were awake.  It's four o' clock, so technically you had a day terror.  What did you dream about?    You know, I can take care of myself, Mom.  Hey Mom? Did you get a chance to catch the news after you clocked out this morning?  Nothing. Forget it.  Yes ma'am.  Needy is sitting at her lamp-lit desk, reading an old E.C. horror comic and eating a banana. The phone rings. Needy picks it up.  Needy speaking.  Good for you.  Yeah.  Lucky you. See, I'm still kind of depressed about, you know, the giant smoldering funeral pyre in the middle of town?  That's really nice.  Jesus didn't invent the calendar.  That's my other line.  It'll just be a second.  I can barely hear you.  Fifteen.  I have to go.  I have to meet Chip at McCullum Park.    Why are the cops at your house?  What?! Like, he was shot by gangbangers?  Some animals must've got to him.  Who would do that?  This can't be a coincidence.  A fiery death trap last night, and now a cannibal eats our starting tight-end? Come on!  Seriously Chip. Most small towns only have something gruesome happen like, once every decade maybe. Devil's Kettle gets two nightmares in 24 hours? It's freaktarded. It's not right.  I don't know. I'm extremely intelligent but I obviously don't know everything.  You're shaking.  Want my sweater?  Pink is cool. Rap guys wear pink.  We were famous. We were saints. Our town's only bar had burned to the ground and our star quarterback was somebody's Quarter Pounder. The whole country got a huge tragedy boner for Devil's Kettle. And the press-- God, they couldn't get enough of our little world of shit.  The days marched on as usual, but most of us were too numb to enjoy ourselves. Most of us.  Still, we were healing. Like CHIP, we figured things could only get better. We had faith.  We were fucking idiots.    Are you PMS-ing or something?  Oh.  What about the other 97%?  The other 97%. I mean, that's just crass. Right?  Crass. It means scummy. Greedy. Am I the only one who actually does the vocab drills?  No, they're not. I was there, Chastity. They didn't actually help anyone escape the fire. I don't even know how that rumor got started.  Oh, that's crap...  They've milked our pain-- our loss- - to get a stupid record deal! No one would even know who they were if they hadn't been playing here that night. They used us.  I'm already sick of that song.  No offense, but you look kind of drained. Is everything all right?  What's wearing off? Are you on pot?  That was random.  Colin's a really nice guy.  No. He was just asking Jennifer out on a date.  Sure. I'd like that.  Thanks.  I didn't assume that.  Mmm.  No, this is nice.    Oh. Cool.  Oh. It's got little bumps on it. I can hardly wait.      I have to go. I'm sorry. I just... feel like something...something terrible...  I'm so sorry, Chip. I'm so sorry. Everything is just wrong.  Fudge! Fudge! Maple fudge!  Needy throws the car into park and races up the front walk. She unlocks the door, shaking and fumbling. She bursts into the darkened house.    Mommy! Mommy? Please be home!  I've always been able to feel what she feels. Just not like this.  Why do I have to be Ugly Ashley?  What's wrong, Jennifer?  Better. We should get a Band-Aid though.  I never tell on you.  Needy trudges into her dark bedroom. She strips off her clothes and stumbles into bed.  Get out!  What the fuck is happening?  I saw you! I saw you! The car...the...I...  I'm calling the police.  What do you want?  Yeah, it rings a bell.  Needy is still cowering on her bedroom floor, captivated by the tale in progress. Jennifer is reclining in the bed with a relaxed, supernatural glow.  What did they do to you?  Needy's expression is both incredulous and horrified. Jennifer is totally matter-of-fact. She picks at her nails with a wooden cuticle stick from Needy's night stand.   They...killed you.     We see Jennifer staggering down the street, battered, mutilated and bloody. She spits a few TEETH onto the curb, clutching her chest. We see her wander toward Needy's house...     I remember.   What do you mean, \"when you're full\"?  What about my mom's Kia? Why did you attack me out there? Why were you covered in blood? You didn't even look human.     What are you doing?  They did a big memorial assembly for Colin at school, and we had to watch another presentation about curfews and the buddy system and how to deal with grief. But nobody seemed to care anymore. Sorrow was last week's emotion.  Jennifer and I hadn't spoken since our encounter in my room. Actually, I hadn't really spoken to anyone. I was busy with research. Paranormal research.  I gotta show you something.  Not here. Behind the school.  Evidence.  Yes, but I promise you this is the last thing I need to show y--  Please just let me show you.  Look at this.  Demonic transference. It's something that happens when you try to sacrifice a virgin to Satan without using an actual virgin!  I think that's what happened to Jennifer. Those guys from that band were trying to sacrifice her in the woods. But what they didn't realize is that she hasn't been a virgin since junior high! Jennifer's a total cum-dumpster! It all makes sense now! Read this...    She's eating boys! They make her strong. Really strong. And when she's hungry, she gets weak and cranky and her hair is all full of split ends. And look at this...  It says that before the demon feeds, it vomits a gruesome substance on its prey. Like I saw!  And possibly Ahmet from India.  No. No! Of course not!  No...Listen, I'll make an appointment with Mr. Feely. I'm real sorry about this sudden onset of teenage paranoia. My hormones and emotions are aswirl, and my moods are erratic...  This has been a crummy school year, Chip.  Listen, I'm done with all that devil stuff. Do you know what you're wearing to Turnabout?  I was so in love with him. I didn't want to mess it up with my infectious crazy. Only I wasn't actually crazy. Everyone else was crazy. But when you're the only sane one, you might as well be crazy. It's subjective, you know?  I don't know yet.  Oh yeah, your mom's an Avon lady.  Right. Well, I'll try to find something magenta.  Needy stands in front of a full-length mirror, wearing a big `80s-style magenta prom dress. It sags on her flat chest and looks ridiculous.   I look pork stupid.  Who's Cindy Crawford?  Ow! You're too close to my neck.  Gross, Mom. Chip isn't that ostentatious.  What are you doing to my hair?     Needy is fully dressed and garishly made up. Toni holds a digital camera at arm's length and takes a shot of the two of them together. The mother/daughter photo looks ghastly. Toni's eyes are closed and Needy pouts miserably.   Chip!  One thing people don't know about me is that I'm fast. I just never went out for track because I look bad in shorts. Also, Jennifer told me track was for lezzies. But I am. Fast, I mean. Even in that fucking afterbirth of a dress, I could really tear up the asphalt.  I had to. I was running for his life.    Where's Chip?  He walked? Mrs. Dove, you mean to only tell me that in these dangerous, godless times-- you let your only son walk alone at night?  Which way did he go?    I'm coming!  Holy crap!  Saint Jude, patron saint of hopeless causes: Please give me the power to crush this bitch.  She's just hovering, CHIP. It's not that impressive.  You're a jerk.  You know what? You were never a good friend. Ever. Even when we were little. You used to steal my toys and pour lemonade on my bed and make me be Ugly Ashley when we played Barbies!  Why do you need him? Huh?    The cutest guy in school. The mailman. A teacher. You could probably even have a huge star like Chad Michael Murray. So why Chip? Why him? Is it just to piss me off? Or is it because you're insecure?  Yeah, two years ago. When you were socially relevant.  You were skinny then, too!      Where are you going?    Oh, Chip!  I'm gonna call for help.  I think 911 is always a free call.  It's not working. It's full of Jennifer-goo.  No! You're not going anywhere!  I love you.  You're clearly delirious.  I'm never leaving.  No!    Did you know the original Goths were a Germanic tribe that settled in Rome? They didn't wear black. They wore regular linen tunics. I don't know why nobody else knows that.    They found Chip the following morning. The police couldn't find an explanation for the \"substance\" in the pool, so they chose not to mention it to the press. In fact, they treated the whole incident like a bad dream.  Trouble was, some of us would never wake up.  Needy is lying in bed, shaking, her arm in a cast. Her mother tries to rouse her.  I never went back to school after that. Didn't talk much either. My mom bought some books so she could teach me at home like crazy Christians with 14 kids do. But I wasn't a very cooperative student.  What nobody realized was that I was doing a different kind of homework. I was watching her every night. Waiting.  Waiting for her to get weak and dull. Waiting for her to burn through the life-force she'd stolen from Chip.  It took weeks, but I finally made my move. Remember?  Even in her last moments of life, she somehow managed to be cooler than me.  She left an insanely hot corpse.  I don't even know who Needy Lesnicki is anymore. I'm a different person now. A person who uses curse words and kicks orderlies and and sees things that aren't there. A very bad, very damaged person.  But sometimes, change can be good. For instance, most occult scholars don't know this, but if you're bitten by a demon--and you live-- you just might absorb some of the demon's abilities.  You just might get lucky for once in your miserable life.      East, toward Madison.  I don't have any money or drugs, so you'll have to settle for ass.  I'm following this rock band.  Tonight's gonna be their last show.",
        "Chip": "Those jeans are hella low. I can almost see your front butt.  I can see, like, your womb.  Why are you blowing me off for some dumb concert, anyway? We were supposed to have Movie Night. I even rented Orca. It's like Jaws, except with a harmless whale.  I've never even heard of Soft Shoulder. Which one is Jennifer stalking?  Thanks a lot!  Like Phil Collins.  Forget it. He's seminal, but whatever...  Salty. You guys ever going to stop using that secret language?  Then you must be soy sauce, babe.  How do you know?  That's fucking weird.  You always do what Jennifer tells you to do.    I think you forgot, like, two buttons.  The Carousel is not a club.  I'm not jello! That place is gross. Everyone there has a mustache.    Chip's bedroom is pitch black until a cheap cell phone lights up under the covers illuminating his sleeping form, clad only in jockey shorts.    What's wrong?  Like, burned down? To the ground? Is everyone okay?  Shit. You're okay, right?  This is real, right? This isn't just, like, some crazy dream like last time?  Who cares about Jennifer and those douchebags with douchebag haircuts? People just burned to death. In our town!  Where's your mom?    No band practice today.  It's surreal, right? I mean, when just one guy dies in Devil's Kettle, it's like time stops. And now so many people are dead, nobody knows when it's okay to start again.  Word.  What?  Yuck. Like those porcupine meatballs my mom makes with the rice sticking out?  It was probably because she inhaled a whole bunch of smoke.  You might want    to talk to the school shrink,    Needy. I'm not saying that to    be a dillhole. I'm actually kinda    concerned.  I didn't say you were crazy. It's just that everyone's a little messed up about this. It's okay to feel...  Yeah, you know. Fucked up.  How are you friends with Colin Gray? I thought Colin Gray only talked to the Dead Girls.  Oh. I can relate. I'm also like that, even if I'm not all obvious about it like a poseur.  You know it.  The whole night must be a total blur, right?  \"After\" is the part I don't really get, to be honest.  I believe you.  I need to see you right now.  Camille is playing piano. Knock it off, Camille!  Can you meet me at McCullum in ten?  They're not. They're at Jonas Kozelle's house. He got murdered.     Human teethmarks.  I don't know. It just happened after school. No one's supposed to know yet, but my dad went over there and talked to the cops. Jonas's mom is catatonic. She's just staring out the front window like a zombie mannequin robot statue.  What do you mean, Needy?  Don't get spooky on me, babe.  What, do you think it's, like supernatural?  Well, the bad luck's gotta be over now, right? It can't get any worse, right? Obviously it can't. It can't. I mean, you agree, right? There won't be another victim.  I'm cold. It's very cold out here.  It's pink.  Hi.    Can I come over tonight?  I went to Super Target and bought more condoms.  Not that that has anything to do with my coming over.  Well, I'll see you tonight.  Needy and CHIP are kissing on Chip's water bed. Chip fumbles for one of those \"fragrance plug-ins\" and PLUGS it into the wall. Needy looks over.  For ambiance. It's Jammin' Jasmine.  My mom has Holiday Scents too, if you're interested.  Needy has eased off her top to reveal an endearingly plain white bra, complete with center bow. CHIP, also shirtless, cops a feel. He reaches into his pocket and pulls out a fluorescent orange CONDOM. Needy looks at the wrapper.  It's supposed to make it feel good for the girl.  Chip fumbles below his waist, obviously struggling with the condom. Needy leans forward for a closer look.   CHIP is doggedly pumping away on top of Needy, his eyes closed in concentration. Needy's vacant eyes are suddenly brimming with tears.  What? Am I hurting you?  Am I too big?  Needy! What's wrong?  Needy clutches her throat, hyperventilating. She stands up and struggles to get dressed. Her breath rasps. Chip is freaking out.  Is it something I did?  Do you need more foreplay?  Needy races toward the door with Chip in pursuit.  Needy!  You feel-- What does that even mean? I'm worried about you.  Needy runs toward her mom's CAR, a beat-up Kia parked on the curb. She climbs into the car and starts the ignition, trembling and crying.  She pulls out onto the street and guns it. She swings a hard left. The streets are all almost identical, lined by working-class homes. She turns on the radio. The song is, of course, \"Through the Trees\" by Soft Shoulder. She pounds the dashboard, hysterical.  Hey. Did you buy Turnabout tickets yet? I don't get paid until next week.  What is it?  What is it?        Uh-huh.  You--you really think Jennifer killed Jonas and Colin?  Really? You think she ate those guys?  Is that what you think?  It's all right, Needy.  No shit.  I was thinking a suit with black shoes and a boutonniere, right here.  What color dress are you gonna wear? I need to order your wrist corsage.  How about magenta? You're definitely a winter. My mom says winters should wear regal jewel tones like magenta. Or possibly teal.  Well, they call them \"sales reps\" now.  That'll look dope.  Chip is standing in underwear and black dress socks, taking his suit out of the closet. Suddenly, there's a loud KNOCK on the door.  I'm in underpants, Mom!  I need to give you something.  Hang on.  Ladies' pepper spray?  I've been thinking about it for a while, and I think you need to be carrying this. There's obviously a sicko out there who likes boys. Boys your age. And I don't want you going out there unarmed.  I can take care of myself. I've been using the Bowflex.  Did you hear what Colin Gray looked like when they found him?  Lasagna with teeth?  You heard. So unless you want to wind up looking like another exotic Eye-talian dish, take Mommy's rape spray.  Are you picking Needy up at her house?  Meeting her at the dance. I'm gonna walk. It's so warm outside. It's like 40.  I want pictures with your sister before you go.  Yes, ma'am.   Chip's mother snaps a series of stiffly posed photos of Chip and his little sister, Camille. We can see the PEPPER SPRAY tucked into the interior of Chip's jacket.  One more. Back to back. Big smiles. Camille, we don't touch ourselves down there. That's our lady garden.  CHIP makes an incoherent noise and jumps as Jennifer appears, improbably, right in front of him. She's wearing a gorgeous white formal gown and looks perfect.  You weren't calling my name.  I couldn't hear it.  I was?  I know.  She hasn't been the same for weeks.  Then tell me.  Say it!  Needy's not like that.  But you were with Colin the night he was killed.    Never mind.  I just can't believe this.  It's bad, man. It's bad.  Oh, you have no idea.  Yeah, you too.  You're so salty. I need water. It burns. The salty burns my mouth.  What? Why?    This feels weird. Can we go somewhere else?  Murphy Pool? I don't think we can go in there. I knew some skater guys who went in there. They got in big trouble and now they have to pick up garbage for 100 hours.  Needy jogs toward CHIP's house. Exhausted and sweaty, she presses the doorbell. She falls to her knees on the front stoop, panting and wheezing.   Needy? Is something wrong?    Well, it's only five blocks. My God, your hair is...  He usually cuts across the park.  Camille, let's sit like a lady! No one wants to see your kiki.  Why don't you try...  Anita?  Aren't you cold?  What are you doing?  Ha ha.  The water looks disgusting.  Are you kidding? It's totally bubonic in there. I think I see a dead possum with a Doritos bag in its pouch. And that looks like a used syringe over there...  I know.  Me too.      Needy. You saved me.  Oh no, I'm out of minutes!  Oh yeah. You're right.    I'm toast, Needy. I'm definitely gonna die. I think I already died before you were here, but I woke up when I heard your voice.  Yeah me too. And you look hot in that dress.  No. When you're dying, you can see everything a lot clearer. You can see what's true and what's not. The things that are true have this glowing halo of light around them, like a picture of the Baby Jesus, or Barbara Walters when they use the special lens. And I know for sure that you're totally hot.  You'd better get out of here. The police are going to come and I don't want them to, you know, make a mistake.  But I have to go.   We see the POLICE (including newly minted officer ROMAN DUDA) informing Chip's mother that his body has been found. She collapses onto the floor, curling up into the fetal position."
    },
    "imdb_rating": "5.5",
    "description": "Nerdy, reserved bookworm Needy Lesnicki, and arrogant, conceited cheerleader Jennifer Check are best friends, though they share little in common. They share even less in common when Jennifer mysteriously gains an appetite for human blood after a disastrous fire at a local bar. As Needy's male classmates are steadily killed in gruesome attacks, the young girl must uncover the truth behind her friend's transformation and find a way to stop the bloodthirsty rampage before it reaches her own boyfriend Chip.The Massie Twins",
    "name": "Jennifer's Body",
    "genres": [
        "Comedy",
        "Horror"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTMxNzYwMjc1Ml5BMl5BanBnXkFtZTcwNDI3MDE3Mg@@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}