{
    "filename": "John-Wick_script.txt",
    "imdb_id": "tt2911666",
    "imdb_url": "https://www.imdb.com/title/tt2911666",
    "characters": [
        "Ms. Perkins",
        "Avi",
        "Kirill",
        "Hotel Manager /Charon",
        "John Wick",
        "Aurelio",
        "Kuzma",
        "Helen",
        "Gregori",
        "Marcus",
        "Addy",
        "Viggo Tarasov",
        "Victor (as Toby Moore)",
        "Iosef Tarasov",
        "Winston"
    ],
    "dialogues": {
        "Ms.": "",
        "Perkins": "",
        "Avi": "No, sir.  N-no, sir.  Wait, wait! Little Russia. There's a small bank near Cannon Court...  Viggo owns it. It's where he keeps his money. Every dollar of business he does clears through that building.",
        "Kirill": "Babushka.",
        "John": "This is John.            ...it had to be you... ...be seein' ya'...    Yes?  Oh.   Sorry.  Well played, Norma.    So... you gotta' name?  Moose. Seriously?  All right, then... ...Moose, it is.    That oughta' do it. Wanna' try it out?  Good girl, Moose. Good girl.  Thanks.  It ain't for sale, kid.        Come on, then.  Good night, Moose.  Do you need to go out?    What's gotten into y-  Moose!     ...Moose...    Hello, Aurelio.  Have you seen my car?  Where is it?  Thank you.     ...they killed my dog.             Evenin', Ed.  No...just sorting out a few things with the Russian mob.  Thanks, Ed... but you still owe me.  Good night, Ed.  Yeah, that was me.  This is Wick. John Wick, that's right. Yeah, it has been awhile. I'd like to make a reservation for four.  Ten o'clock? Perfect. Thanks.  You, too, Charlie.  Thanks.  I got me a hobby or two.  Sorry, Charlie, but no.     I'm on my own nowadays.    Thanks.  I make no promises on that.  See ya', Charlie.  I called ahead.     Reservation for John Wick.  Depending on business, it may be more.    Same owner?  Is she still singin'?  That's good to hear.  No, thanks.    A nice Pinot. Mid-range. I'll leave that to your discretion.  Thank you.          Guest.  Thanks.  Thanks.  A table.  Yes, thank you.  Single Malt. Irish, if you've got it.  And start me up a tab.  Perfect. Do you have a meat and cheese plate?  No.   Thank you.    And where is Viggo?    Please close out my tab.  Good evening.    As for the car, I got that back, but as for Moose, well... I'm takin' a page from Exodus on that one: an eye for an eye. No... no, better yet, Genesis.  Adah and Zillah, hear my voice; Wives of Lamech, listen to my speech. For I have killed a man for wounding me, even a young man for hurting me. If Cain shall be avenged sevenfold, then Lamech seventy-sevenfold.  Make your peace with God, Iosef... ...for the Devil shall see you soon.  Evenin'.    Is the doctor in?  Send him up, please.  Depends.    How good's your laundry?  No, I thought not. Send me up a beer, too, will you?  Anything cold.     Did she chip off?  Good to hear.  What sort of movement am I lookin' at?  And after?  Thanks, doc.  Evenin'.  Maybe not... but I know this place.  No.   Wait...  Sorry.  John Wick.  How about you?  You gotta' name?    Please... call me, John.  Hello, Winston.  That, it has. I'm glad to see the old place still up and runnin'.  Hey, Jimmy.  I'm no good with time, but... it's been awhile.  She got the card, the flowers... she knows you -all of you- loved her. And thanks, Jimmy. It meant a lot to me as well.  I'd love a martini.  Good man.  Thanks, Jimmy.  Hey, Jenny.  I'm not quite sure, but with that said... here I am.  I know.    No, ma'am.                                 Do you know where Viggo is?    Just because I'm good at killin'... doesn't mean I like it all that much. Give me something.  What about it?      I'm thinkin' so.  Hey, Harry.    You keen on earnin' a coin?  Do you mind babysittin' the breathin' one for, I dunno... ...the next six hours or so?    Good night, Harry.     You don't have to worry about that anymore. I'll be going to bed soon.  Yes, in fact. For four.  Perfect. Oh, and... Do you cater? Excellent. I'll need a car, and... well... something a bit less trivial.  You willin' to put a bullet in my back, Marcus?  Been awhile, Marcus.  Why'd you take the job then?        Good night, Marcus.  Yeah, that's about right.  No.  We tried, but... wasn't in the cards.    Imagine what one would do if they did.  Goodbye, Viggo.  Americano, please.    And a bear claw.  Oh, and the bathroom?  Thanks.   Not you.  Take me to Viggo's stash.  His stash. Personal Holdings. Piggy \"fucking\" Bank.  Open it.  Open it.  So will I.  That'll do. Thank you.    Yeah.    Yeah, we're good. Thanks.  Unless I complete the call, then... yes.     No.   I didn't.      Buried deep. Fuck.  Miko, huh?  That's quite the name.  Are you coming or not?  That's what I thought.  Come on.   Let's go home.  Good girl, Miko... good girl.",
        "Wick": "33.",
        "Aurelio": "16.                  Where'd you get that?        Out.    Now.  I'm talkin' about you takin' this fuckin' car and gettin' the fuck outta' my shop.  The fuck you do. Tell me...  ...did you kill him?  You pull a gun? On me?   In my house?  Flick off the safety.  Pull back the hammer.  Now, either shoot me...  Maybe not.     But he'll understand.      Hello, John.  I have, but it's not here.  If I turn down the work, the Russians turn to Takeshi and his crew. You'll find them down on Third and Main.  Yes, John?  I know, John. I know... but \"they\"... ...\"they\" are extremely dangerous people.              This is Aurelio.     Because he stole John Wick's car.  And Viggo?  Your son killed his dog.",
        "Kuzma": "",
        "Helen": "",
        "Gregori": "",
        "Marcus": "Yes? Why, hello, Viggo. What's it been? Seven years? Seven years... Life?  Life is good.  As I keep telling those -like you- who keep calling, Viggo... I'm retired.  Come again? John Wick? Consider it done.    I owe you, John.  Too long, I'd argue.  Because if not for me, it would have been someone who'd have just now pulled the trigger and simply walked away, leaving you to gasp your last.  Besides, we're the last of our kind; an endangered species of a sort. And I find comfort in knowing that there's someone like me still out there.  It's always \"just\" something, John.  Just\" a wife, \"just\" a son, \"just\" a friend, \"just\" a house, \"just\" a car... \"just\" a dog... or \"just\" a cat. Each of these I've lost in no particular order, and each time the pain I felt was quite real. And my chosen reciprocity to each was no more -and no less- brutal than any other.    Good night, John.",
        "Addy": "",
        "Viggo": "I hear you've struck my son.  Might I ask why?    Yes?                You should know by now that I live by one simple rule... Should a whelp snap at your fingers, you crush it's fucking skull.    Yes.   You do.  Use that tone with me again...      It wasn't the \"what you did\", Iosef, which draws my ire, but \"who you did it to\".  Careful, son... that old man happens to be three years younger than I.  His name is John Wick... ...and when he was fifteen, he lied his way into the marines and headed off to Vietnam. He specialized in force-oriented reconnaissance, meaning he often crossed over into enemy territory to both collect information and -should the opportunity present itself- fuck with the enemy in whatever way that he saw fit.  John earned four hundred and seventeen confirmed kills over the course of his five tours. The majority of those were done by hand, by blade, and by small caliber... which is unheard of.  It got to him, though. Hell... How could it not? Even though he won every military distinction on record, including the Medal of  -John was eventually discharged - with high honors, of course- and found himself in the city...  ...lookin' for work.    John was the goddamned boogeyman; give him a name, request a method, and he'd get it done. Come hell or high water, by God... he'd get it done.  Then one day, he fell in love and left the game. The years scrolled past, age set in, and he -like myself- had to watch the love of his life die. Suddenly alone, with no family to speak of, John deserved to live -and die- in peace. Instead...    Until I say otherwise, you are under house arrest. Am I understood?  John Wick.     Good God...            Good, good. I've a favor to ask. One that pays quite well.                     Is that really necessary?  So be it.  No, thank you.  It's been what? 30 years?  Left the game, got married, settled down... I envy that. Kids?  Lucky bastard.  I fucked a bartender and -ta dah!- nine months later, I had me a piece a' shit tossed on the old doorstep, but... when it comes down to it... He's still my son.  Funny how one would both die and kill for something they do not love.  Goodbye, John.  Kill him.   People don't change. Do they, John?            Tell me, John... and please... be honest... am I dying here?  For me to die like this...  I was sending Iosef to a safe house in Moscow. I arranged for transport via... a grain ship... out of Newark...  ...please...",
        "Tarasov": "",
        "Iosef": "Nice ride.  How much?     I'm glad you didn't wanna' sell, old man. I enjoyed this.    I'ma gonna' keep this muthafucker! Hey, where's Aurelio at?  I gots my ways, yo! Now, it's hot as shit, so I wanna paint job, papers, fuckin-    What the fuck are you sayin'?  What?  What the fuck are you talking about?  Did you lose your shit, Aurelio? We own you. You do what we say.  No. But I sure as hell fucked up his dog.      Poor me a double, aye?    I don't know what y-      What? The old man?          How the fuck long do I have to stay down here?    What?  Yes, sir.  Well, come on, muthafucka!   LET'S  You missed, bitch!",
        "Winston": "Hello, Jonathan. It's been awhile.    Mr. Perkins...  ...your membership to the Continental has been -by thine own hand- revoked."
    },
    "imdb_rating": "7.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTU2NjA1ODgzMF5BMl5BanBnXkFtZTgwMTM2MTI4MjE@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "With the untimely death of his beloved wife still bitter in his mouth, John Wick, the expert former assassin, receives one final gift from her--a precious keepsake to help John find a new meaning in life now that she is gone. But when the arrogant Russian mob prince, Iosef Tarasov, and his men pay Wick a rather unwelcome visit to rob him of his prized 1969 Mustang and his wife's present, the legendary hitman will be forced to unearth his meticulously concealed identity. Blind with revenge, John will immediately unleash a carefully orchestrated maelstrom of destruction against the sophisticated kingpin, Viggo Tarasov, and his family, who are fully aware of his lethal capacity. Now, only blood can quench the boogeyman's thirst for retribution.—Nick Riganas",
    "name": "John Wick",
    "genres": [
        "Action",
        "Crime",
        "Thriller"
    ]
}