{
    "filename": "King-Kong_script.txt",
    "imdb_id": "tt0360717",
    "imdb_url": "https://www.imdb.com/title/tt0360717",
    "characters": [
        "Hayes",
        "Jack Driscoll",
        "Manny",
        "Herb",
        "Bruce Baxter",
        "Captain Englehorn",
        "Mike",
        "Jimmy",
        "Choy",
        "Maude",
        "Carl Denham",
        "Preston",
        "Ann Darrow",
        "Harry",
        "Kong /Lumpy"
    ],
    "dialogues": {
        "Hayes": "Haul away ...  Dead slow ahead both, Captain.  Jimmy!  You run those ropes up on deck like I told you?  How about you return Mr. Driscoll's pen first?  He doesn't mean any harm. I'll keep him out of Jyour way.  It's just he likes it down here, it's where I found him ... four years ago ... stowed away in one of them cages. His arm was broken in two places, he was wilder than half the animals in here. Still won't tell me where he came from - all I know, it wasn't any place good.  You gotta straighten up. You don't want to be on this ship for the rest of your life.  No, you don't, Jimmy. You wanna get yourself educated. Give yourself some options. Take this serious.  Where did you get this?  If someone were to tell you this ship is headed for Singapore, what would you say?  We picked up a castaway - found him in the water - he'd been drifting for days.  If you find this place -  If you go ashore with your friends and your cameras ... you won't come back ... Just so long as you understand that.        Dead slow ahead, both. You should stop the ship.  We're shallowing!      Half astern, both, Captain!  Rocks to port, Captain!  he's taken a pounding ...  Shaft's not bent, far as we can tell, but she's stuck hard against the rock -  You want me to bring them back?  shrugs HAYES v/o  ... of those Ages that are gone, leaving hardly a sign and no memories ...  We are accustomed to look upon the shackled form of a conquered monster, but there, there you could look at a thing monstrous and free.\"    All hands going ashore ...  ... report to stations! Jump to it!  What the hell are you doing? You want that boat to sink? Stow those rifles midships - come on, hurry it up!  Lower away!  Not you, Jimmy.  Stay here.  No!  esus, Jimmy!    I was in the army. I was trained - I had a drill sergeant!  Don't make me regret it.  growling    Alright, you got five minutes! Everybody stay in sight!    Denham! Where'd he go?      Run!  Jimmy, do a head count. I wanna know how many injured and how bad -  Anyone else?  If anything happens, I want you to run! Understand?    o back! Back across the log!  Get Jimmy out of here.    deadly calm  Do as I say.  Run!",
        "Jack": "No! I can't stay, Carl. I have a rehearsal for which I am now ... ... three hours late.  It's the script.  You told me I had more time. I'm sorry. Look I gotta go.  You got my notes - I gotta go. See you.  You're going to pay me?  Sounds great!  Thanks...  Carl ... you've written \"Two Grand\".    Never mind, pay me when you get back!  Oh, Christ!  Oh Christ!  Goddammit!  I don't do it for the money, Carl. I happen to love the theatre.  What'd you keep down here?    Maybe, I'll take this one.  Oh Christ - oh God!  It's nice to meet you too, Miss Darrow..  She turns ... The First Mate is staggering towards her - there's a knife sticking out of his back!  That's assuming she knows who the First Mate is.  I was joking, Carl.  See's what? What?    Why would they get spooked? What's it called?  What's wrong with this place?   (  l ... l ... Island.  It was pure effluence.  Try to resist that impulse.  Actors. They travel the world but all they ever see is a mirror!  Good legs.  Sea legs - I meant - you know ... sea legs. Not that you don't have good legs, I was just ...  ... making conversation. Jesus! Miss Darrow!  About the scene - today, with you and Bruce -  Interesting theory.  It wasn't what I had intended ... but it -  You made it your own ...  It was funny, actually ... you were funny.  You don't have to be nervous.  I'm writing it for you.  Why would I write a play for you?  Isn't it obvious?  Well, it's in the sub-text.  It's not about words ...  How did you think this would end, Carl?  What is that?  That.  Rocks!  She doesn't want the chocolate!  Where's Ann?  Ann!  top! Stop! Turn back, we have to turn  They've taken Ann!      She's gone!  Carl? What is it? You saw something ...  Ann!      Hey fellas - we don't have time for this. We've lost too much ground already! Come on, - get up!    Carl!!!  What is it?! Where's Carl?  Holy Christ!  Leave it!!!      I always knew you were nothing like the tough guy you play on screen - I just never figured you for a coward.    Carl!!!   CLOSE ON: JIMMY is looking VACANTLY into space, JACK kneels down.   Jimmy?  Keep the Gate open.      Are you out of your mind? Carl!  Ann ... He'll kill you!  Get in the boat!  Take her!  ... foolish ....    Where is she??      Everyone has to leave.  Head for the exits ...    Follow that ape!   JACK SWERVES on to the SIDEWALK ...    JACK steers the CAB wildly along the SIDEWALK scattering PEDESTRIANS in all directions!  KONG follows in HOT PURSUIT!  bend and DRIVES straight into a FRUIT VENDOR'S STALL!  ANGLE ON: The CAB, covered by the RUINED STALL, SLAMS into the WALL of a BUILDING. JACK is thrown forward on IMPACT ...  KONG rounds the corner and BOUNDS PAST JACK'S CAB ... hidden beneath the RUBBLE ...  KONG searches for the CAB, ROARING in FRUSTRATION!  KONG'S HUGE EYES glance in the WINDOW, just as:  KONG suddenly FREEZES! He inclines his HEAD; unsure if what he is seeing is REAL.  KONG'S POV: ANN is walking towards him!  KONG tentatively inches TOWARDS ANN!  ANN stops ... KONG stops. They stare at each other for a long moment ... ANN offers KONG a small SMILE, and reaches her HAND out hesitantly towards his ARM.",
        "Driscoll": "",
        "Manny": "Who wrote it, Annie?  The trick is to start the build right at the back of your throat... Works well out through the nose too.    You think the kitchen'll still be open on Third?  Ann ... Annie! It's no use.  I'm sorry, Ann. Ever since you were small people have been letting you down. But you gotta think of yourself now. You should try out for that part.  It's what you've always wanted. Oh, I know what you're thinking - every time you reach out for something you care about ... fate comes along and snatches it away.  But not this time, Annie ... not this time.",
        "Herb": "Delighted to meet you, ma'am. And may I say what a lovely dress.  Hear! Hear!  You wanna go with the six inch lens?      You gotta leave me!",
        "Bruce": "Be a sport and lend us a hand.     ANGLE ON: BRUCE is clearly unimpressed with the TINY CABIN. He reacts to the SMELL.    on his cabin wall ... He steps back, admiring them.      BRUCE enters his CABIN ... A moustache has been drawn on all his POSTERS. BRUCE looks annoyed ... then takes another look.  CLOSE ON: BRUCE glancing in the mirror - imaging himself with a moustache. Not bad.    I've never been on one with a woman before.  No, they're a nuisance.  Just being around is trouble.  It's a dangerous thing, having girls on ships. They're messy and they're unreliable!  beefed up the banter ...  It's just a little humor, Bud - what are you, a Bolshevik or something?  For Godsake, Denham, leave the native alone.  Twenty-four hours?  What?!  What the hell kind of place is this? Are you sure about this, Denham??? Don't we have a stand-in for this type of thing?  Nobody's gonna think these are fake!  I'm not moving.    He's - he's ... um ... well, he's up there ... filming.    Hey, did you hear me? We're gonna be stranded here!  Miss Darrow was a great gal - no question. She was a wonderful person. It's a terrible loss. We're all gonna miss her.  Hey, pal, wake up. Heroes don't look like me - not in the real world. In the real world they've got bad teeth, a bald spot and a beer gut ... be seeing ya.  Well to be honest with you, I had some anxious moments ...  For a while there it looked like I wasn't going to get paid ... But as it turned out, Mr. Denham here has been more than generous -",
        "Baxter": "",
        "Captain": "I can't give that order! Sir, the ape's holding a girl -  Sir ...?!",
        "Englehorn": "I cannot do that ... we're waiting on the manifest.    You haven't given me the first thousand yet.  Ma'am...  So you are ready for this voyage, Miss Darrow?  Nervous?  It isn't every woman who would take such a risk.  Do I have a choice?  Dead slow ahead both, Mr Hayes.    My apologies for not being able to offer you a cabin. Have you found an enclosure to your taste?  What are you, Mr. Driscoll, a lion or a chimpanzee?  I told you to lock it up.    There's no land south-west for thousands of miles. It takes us way outside the shipping lanes.  I won't sail blind in these waters.  There's nothing out there.    There's a warrant out for your arrest. Did you know that? I've been ordered to divert to Rangoon.  No, Denham - you risked everything I have.     D  I want you off my ship.  Set a course for Rangoon, Mr Hayes.  Check our position. Use the stars.  Station the for'head lookout, and get me the depth by lead-line!  Reduce speed, steerage way only.  15 degrees Port. We're getting out of here, Mr. Hayes ... we'll find clear conditions.  20 degrees starboard!  Get me another reading!  Douse the lights!  Stop engines!  Give me some power! Half astern, both!  Take the wheel, Hayes!  Full ahead!  Hayes!  What about the prop?  I don't give a damn about Carl Denham ... I want this ship fixed and ready to float on the next high tide. We're leaving Mr. Hayes.  Seen enough?    Wheel amidship ... Full ahead, both engines.      You can take Hayes and fifteen others. I'll put a guard on the gate until you return ... The rest of you, stay with the ship.  You got guns, you got food, you got ammo. You got twenty-four hours.  This time tomorrow we haul anchor.  Don't thank God, thank Mr. Baxter ...  He insisted on a rescue mission. Me? I knew you'd be okay ...  That's the thing about cockroaches; no matter how many times you flush them down the toilet they always crawl back up the bowl!  Driscoll ... don't be a fool! Give it up, it's useless ... She's dead.  You want to trap the Ape? I don't think so.    Keep him down!  Get her out of here! Get her out of his sight!  Kill it!  It's over, you Goddamn lunatic!  Shoot it!!!  Jimmy - get out of here! Get to the boat! All of you! Run!  Row! Get the hell out of here!  Hold her!",
        "Mike": "Really?  Well - that's my job.  Excuse me?",
        "Jimmy": "Compliments of the chef -  Lambs brains in walnut sauce.  Doing it now, Mr. Hayes.  I do.  I do, Mr. Hayes, I do! Look, I've been readin'.    ... on long term loan. Look at this.  \"Adventures on a Tramp Steamer\". See - just like us.  No. You're looking for something else ...      Captain! You'd better come up quick!  Why does Marlow keep going up the river, why doesn't he turn back?    She went to her cabin.  Com'on Mr. Hayes, look at `em. None of them knows a which way to point a gun.  Miss Darrow needs me!  Just keep walking, Mr. Hayes. Pretend you didn't see me.  defiant  You were younger than me when they gave you one!  Is that what took Miss Darrow?  So? We gotta find Miss Darrow.    I'm not a coward - I ain't gonna run.  I ain't gonna run.  No! Let him go! Kill him! Kill him!    No!   CLOSE ON: JIMMY is looking VACANTLY into space, JACK kneels down.",
        "Choy": "This room very comfortable, plenty dim light ... fresh straw.  Lion, tiger, hippo - you name it. What, do you sell them to Zoos?  Zoos ... circus ... Skipper get big money for rare animal. Careful! Camel have bad accident on floor. Stain unremovable ...      Lumpy! Help me!",
        "Maude": "",
        "Carl": "",
        "Denham": "Come on, fellas - you know the deal - we agreed to push Maureen's start date so she could get her teeth fixed.  Trust me, Bruce and Maureen are gonna steam up the screen - once we get them on the ship.  The one we've hired to get to the location.  Yes, I understand that - but fellas, we're not making that film anymore - and I'll tell you why.  The story has changed, the script has been rewritten.  Life intervened! I've come into possession of a map. The soul surviving record of an unchartered island, a place that was thought to exist only in myth ... until now!  I'm talking about a primitive world ... never before seen by man! The ruins of an entire civilisation - the most spectacular thing you've ever seen! That's where I'll shoot my picture!  Excuse me, boobies?  What are you - an idiot? You think they asked De Mille to waste his time on nudie shots? No - they respected the film maker, they showed some class! Not that you'd know what that means - you cheap low-life!   Gimme that - quick!  Preston, you have a lot to learn about the motion picture business.  I want the cast and crew on the ship within the hour.  Tell `em the studio's pressured us into an early departure.  hat are they gonna do - sue me? They  hat's why I have you, Preston.  Get in there!  tep on it!  on't worry Preston - I've had a lot  And two dozen of Mr. Walker's finest ...  You got it ... and tell Maureen - she doesn't have six hours to put on her face. If she wants to be in this picture, she's gotta be on that boat!  She pulled out?!    exasperation  I gotta get to a phone ... talk to Harlow's people.  Myrna Loy? Clara Bow? Mae West?    ooper huh?  Not an option.  I said I'd find a girl.  For Godsake, Preston - think like a winner. Call Jack ... I need that Goddamn screenplay!  Defeat is always momentary.  Excuse me ...  Ma'am, I think you dropped this.  Vaudeville huh? I worked Vaudeville once... that is a tough audience. If you don't kill them fast, they kill you.  t was obviously a terrible  mock sincerity  ... You wouldn't happen to be a size four by any chance?  No! Oh God, no! You've got me all wrong. Miss Darrow, please! I'm not that type of person at all!  I'm someone you can trust, Ann. I'm a movie producer. Believe me, I am on the level, no funny business. Please, sit down - Please ... Please.    Singapore. On board ship he meets a mysterious girl. She's beautiful ... she's fragile ... haunted ...  She can't escape the feeling that forces beyond her control are compelling her down a road from which she cannot draw back. It's as if her whole life has been a prelude to this moment - this fateful meeting that changes everything. And sure enough, against her better judgement -  Yes!  Oh really?  Why is that?  So you're interested?  That's settled then. I don't want to rush you - but we are under some time pressure here.  Ann? I'm telling you, You're perfect - look at you! You're the saddest girl I ever met ... you're gonna make `em weep, Ann - you're gonna break their hearts!    ure. Why - wait! You know him?  What a writer, huh? And let me tell you Ann, Jack Driscoll doesn't want just anyone starring in this picture. He said to me, \"Carl, somewhere out there is a woman born to play this role ...\" And as soon as I saw you, I knew -  It was always going to be you.  Not exactly ... it's actually this one over here.  Don't let appearances deceive you. It's much more spacious on board.  Is this all of the equipment? This is all of it? We're taking the Bell and Howell? Good. You got all the lenses - you got the two and the six?  Yes - Get it on board, fellas. Come on.  Who?  Englehorn! Cast off! Hoist up the mainsail - raise the anchor, whatever the hell it is you do - we gotta leave.  What? Who? English - please!    Can we talk about this later. Can't you see we're in the company of a VIP guest?  Wonderful idea, thank you, Preston.  Two thousand - it's a deal ... Will you take a cheque?   ANGLE ON: DENHAM enters his CABIN looking FLUSTERED. He is STARTLED to find JACK DRISCOLL waiting for him. DRISCOLL is a WRITER, well dressed in a SHABBY sort of way.   Jesus, Jack - you scared me!  Listen, if anyone comes to the door, don't open it. You haven't seen me ... say I got depressed and committed suicide. Say I stuck my head down a toilet! You want one?  What's this?  This is a script? Jack ... this is fifteen pages.  I'm supposed to be making a feature length picture.  Jack - No - you can't do this to me! I have a beginning but I need a middle and an end! I gotta have something to shoot.  Alright, fine. We might as well settle up.  I'm not going to stiff a friend.  How does two grand sound?  Thought it might.    So I did ... Sorry about that Let's start from the beginning.    It is the 29th, isn't it?  I'm sorry. Let me just ... It'll just take a second.    I keep telling you, Jack, there's no money in theatre.  You're much better off sticking with film.  o, you don't.  If you really loved it, you would have jumped.  Knock knock! We can't have our leading lady deprived of the necessities of life. Do me a favour - run a bottle down to Jack. It'll fend off his migraine.    Jack has his heart set on coming. Call me a softie - I couldn't say no.  I don't care, Mike! You're the sound recordist - make it work.  Ann! Come on in! Let me introduce you to the crew! This is Herb - our cameraman ...  Lumpy! You heard the lady!  ANN, I don't believe you've met -  Wait a minute! Ann -  ANN! Stop! Stop - right there -  She's standing at the railing ... she doesn't know it yet, but they're sailing towards disaster. You got that?  ait a second, we're killing off the  Come on, Jack! It was an honest mistake. Ann is near-sighted - it could happen to anyone.  The point is: she's horrified. She has to look away. And that's when she sees it.    Jack, keep your voice down! I don't want the crew getting spooked.  All right ... It has a local name, but I'm warning you, Jack, it doesn't sound good.      There's nothing officially wrong with it. Because technically it hasn't been discovered yet.  All right everyone, from the top.   And ... action!    Bruce, wonderful performance. You can relax for ten minutes.  That was very natural... I felt moved.  We're close. Head south-west.  'll make it worth your while.  hen you've nothing to lose.  Gentlemen please, we're not looking for trouble -    A lion or a tiger. A man-eater. That's how all these stories start.  orry fellas, you'll have to do better    Hayes! Why are we turning around?    nother week - I haven't got a film  What do you want? Tell me what you want? I'll give you anything.  I'm finished. It's over for me, Jack.    I don't know ... what is it, a coffee stain?    Of course it's deserted. Use your eyes, Preston. The place is a ruin! Nobody's lived here for hundreds of years.  will handle this.  Look chocolate ... you like chocolate?  Good to eat! Take it ... take it!  t's alright - it's just a bunch of   DENHAM is swigging from a HIP FLASK. HERB and PRESTON are gathered gloomily around a TABLE, while DENHAM strides around the ROOM, swigging and talking in a animated fashion. The STORM BATTERS and CRASHES outside.   We got away. We gotta be grateful for that gentlemen.   DE finish it and    The wide angle will do just fine.    low  You're the star of this picture! Get into character and head towards the animals.  need you in the shot, or people will  ou're making them nervous! No sudden  Run Jack!  No!!!  Herb! Come on!  Come on Herb - I'm pulling you up. Come on, hold on to your end.  I'm not going anywhere without you!    He died believing there is still some mystery left in this world - and we can all have a piece of it - for the price of an admission ticket! Goddammit Preston we're gonna finish this film for Herb. We'll finish it, and donate the proceeds to his wife and kids.    Thank God.  ey buddy! I'm outta the bowl! I'm    And the ape will be hard on his heels. We can still come out of this thing okay - More than okay. Think about it, you've got a boat full of chloroform we can put to good use.  Isn't that what you do? Live animal capture? I heard you were the best.  Jack!    Sure thing, buddy! Good luck!  I'm sorry.    Wait ...  to ENGLEHORN  Drop the net!  Gas him!  Do it!  No!  I need him alive!  Wait!  he whole world will pay to see this.   REVERSE ON: DENHAM glancing up, catching the STRANGE LOOK in  hank you! Thank you! Thank you! Thank  nd now Ladies &amp; Gentlemen, I'm going  Ladies and gentlemen: I give you Kong - the Eighth Wonder of the World!!  Don't be alarmed, ladies and gentlemen. It is perfectly safe. These chains are made of chrome steel!  dramatic  We have in the auditorium tonight, a surprise guest. The real life hero of this story ... the man who hunted down the mighty \"Kong\"!  The man who risked all to win the freedom of a helpless female! A big hand for ... Mr. Bruce Baxter!  Ladies and Gentlemen, imagine if you will an uncharted island ... a forgotten fragment from another time ... And clinging to life in this savage place, imagine a people untutored in the ways of the civilised world. A people who have dwelt all their lives in the shadow of Fear! In the shadow of ... \"Kong\"!  lease remain calm, Ladies and  Behold her terror as she is offered up to the mighty \"Kong\"! A big hand folks for the bravest girl I ever met! Miss Ann Darrow!  Here's your story, boys - \"Beauty and the Man who saved her from the Beast\".    et him roar! It makes a swell  It wasn't the airplanes ...  ... it was beauty killed the beast.",
        "Preston": "You won't like it, it's non-alcoholic!  It's not ethical!  ho's gonna pay for the ship?  Red label, 80% proof - packed in a crate marked \"lemonade\".  She doesn't want to be in this picture.  But we're not shooting in Singapore.  he`s unavailable.  Mae West?! No! She has to be a size four!  ou gotta get a girl who'll fit  es she is, but she is doing a picture  We gotta delay the shoot - shut production down ... We can't sail tonight!  Carl!        Miss Darrow, if you'd just - Hi, my name is Preston, Carl's assistant.  Please, follow me. If there's anything that you need ... `excuse me fellas, if there's anything that you need please don't hesitate to ... ask ...  Your cabin's just down here, Mr. Baxter. May I say how excited we are to have you back with us, Sir.  Let me get the door for you - welcome to your state room sir.    The closet ... your costumes - I hope you'll find everything is in order. If there is anything that you need, please do not hesitate to ask...fresh water, perhaps? I can bring it to you personally.  They're still trying to find a place for him to sleep.    What do you mean?  Why did they build the wall?     PRESTON LYING AWAKE FREAKING OUT intercut with close ups of THE  It's deserted ...  What about Mike? He didn't get away - he's still there!  It's not your fault. What happened to Herb - it's no ones fault.  Drop the bridge! Do it now, for chrissakes!     ANGLE ON: DENHAM turns away and turns on an INSTANT SMILE for    a waiting PHOTOGRAPHER.    ON THE SOUNDTRACK a sudden burst of UPROARIOUS LAUGHTER!     ... about there still being some mystery left in this world ...    I've no idea. I heard he offered her all kinds of money and she turned him down flat.",
        "Ann": "That's a funny one! Isn't that funnier?  Twenty girls in feather boas prancing around like circus ponies! That's depressing!  It's a play.  Who wrote it, Annie?  It'll pick up .... Ain't that right, Manny?    The trick is to start the build right at the back of your throat... Works well out through the nose too.  Have you eaten today?    Hey - you're all I've got.  Come on - take me to dinner.  You think the kitchen'll still be open on Third?  Soup and biscuits - perfect.    Hey, open up! We work here.  They're not going to get away with this.  Ann ... Annie! It's no use.  The show it's over - it's done. going back to Chicago. I'm sorry ...  I'm sorry, Ann. Ever since you were small people have been letting you down. But you gotta think of yourself now. You should try out for that part.  It's what you've always wanted. Oh, I know what you're thinking - every time you reach out for something you care about ... fate comes along and snatches it away.  But not this time, Annie ... not this time.    Why would I want to do that when we can talk about it in person?  But I already sent you my resume - you returned it unopened.  Please, just an audition - that's all I'm asking.  Mr. Weston, I know this role backwards.  Mr. Denham - I want you to know that I'm not in the habit of accepting charity from strangers, or for that matter ... taking things that don't belong to me.  It's just that, I haven't been paid in a while ...  What type of person are you?  You're filming in the Far East?  She falls in love.  But she doesn't trust it. She's not even sure if she believes in love.  If she loves someone - it's doomed.  Good things never last, Mr. Denham.  Well I really -  See, that's where you're wrong, Mr. Denham, I make people laugh, that's what I do.  Good luck with your picture.  Jack Driscoll?  Well, no - not personally. I've seen his plays.      Ann Darrow.  Sure...  Nervous - no. Why? Should I be?   CLOSE ON: ANN tests her mattress with her hands. ANN straightens &amp; turns, perching on the edge of the BUNK.        He's on board?   ANN is holding a copy of JACK'S PLAY \"ISOLATION\" ... she is standing in front of a mirror rehearsing her introduction.   It's nice to meet you Mr. Driscoll - I'm actually quite familiar with your work. Oh yes! ... Hello, Mr Driscoll - it's so nice to meet you! Actually, I'm quite familiar with your work. I'm a huge fan! I've read everything you've ever written.  Oh! This old thing! I just - threw it on!    That's alright Mr. Denham, I know who this is ...  Thrilled to meet you. It's an honour - to be part of this.  Actually - I am quite familiar with your work.  Yes, and what I most admire - is the way you have captured the voice of the common people.  I'm sure you've heard this before, Mr Driscoll, if you don't mind me saying - you don't look at all like your photograph ...     I was afraid you might be one of those self obsessed literary types. You know - the tweedy twerp with his nose in a book and his head up his -  I think this is awfully exciting! I've never been on a ship before.  I guess you don't think much of women on ships, do you?  Well, I'll try not to be.  Well! Is that a nice thing to say!  I know, it wasn't what you wrote. But Mr Baxter felt very strongly that when a man likes a woman - then he must ignore her. And if things turn really hostile ... no?  I know ... I should have -  I'm sorry - I was ...  I was nervous.  Please - don't say another word. Good night.   ANN is pacing the cabin. She is wearing a SHAWL over pyjamas. She smiles as she turns pages of a loose leaf manuscript. ANN looks up at JACK.     Why would you do that?  Yes.  Not to me.  I guess I must've missed it.   CLOSE ON: JACK and ANN still KISSING.     Mike?   ANN alone in her CABIN, is overwhelmed by a terrible SENSE of   A growing sense of UNEASE fills ANN with DREAD.    CLOSE ON: ANN, a sense of foreboding...     ANN alone in her CABIN. She looks down and notices her HANDS are   SHOCKED to find it EMPTY with clear signs of a STRUGGLE.      JACK bursts into the CABIN. CLOTHES are SCATTERED EVERYWHERE. clearly a sign of a struggle.    CLUTCHING her tightly, KONG carries ANN away from the ALTAR.         CLOSE ON: ANN shuts her eyes ... KONG'S FIST THUDS into the ground inches away from her.  THUD! Another FIST SLAMS into the GROUND!  ANGLE ON: KONG ROARS and beats his chest in a dramatic display of ANGER and FRUSTRATION. He rips a TREE from the ground as his ANGER spirals into violent MADNESS.  a brief moment KONG and ANN lock in EYE CONTACT!  Hey! Here! Over here!    WIDE ON: KONG rolls over, THUMPING his arm against a TREE, crushing a DINOSAUR.  ANN is WINDED ... she clings to KONG'S FINGERS as he strangles the second BEAST with one hand, snapping it's NECK with a BONE CRUNCHING sound.  shot, grabbing KONG'S ARM in his JAWS! KONG ROARS, sending both TYRANNOSAURS SPRAWLING TO THE GROUND. The FIRST TYRANNOSAUR scrambles back to it's feet! KONG holds ANN protectively as he braces himself for the FIGHT OF HIS LIFE. The TWO TYRANNOSAURS CIRCLE him ... when SUDDENLY! A THIRD TYRANNOSAUR comes from behind.  AS IT FALLS it SNAPS AT KONG'S FOOT.         FALLS. AND more SMASHING AGAINST THE CHASM WALLS ... SHE FALLS AND   BOTH ... and for a moment ANN &amp; KONG LOCK EYES. SHE THEN BACKS  ATTENTION BUT HE LOOKS AWAY. HE LUMBERS AWAY. KONG has DEADLY INTENT in his EYES. ANN watches as he DISAPPEARS into the JUNGLE.  ANGLE ON: ANN, CONFUSED for a minute ... THEN RUNS AFTER HIM.   Wait!  It's alright ... it's okay ...  Look - it's you ... \"Kong\". See ... you. \"Kong\". This is you.    Beautiful.  Beau-ti-ful.   CLOSE ON: ANN SLEEPS PEACEFULLY in his HAND.  ANGLE ON: KONG gently lifts ANN ... he STARES at her ... his FINGER touches ANN'S HAIR.           Please! Somebody help us!    No!    No, he won't.  No!  Stop it! You're killing him!  Let go of me ...    Let me go to him!  Go back!  Leave him alone!  No! No! Help me, no!    Yes ... yes it is.  No!!!   CLOSE ON: The MASKED FACE of a PILOT as he heads straight for  No! No!",
        "Darrow": "",
        "Harry": "It's hysterical, Manny. As long as we're laughing we won't be crying over the box office. Talk about depressing.",
        "Kong": "KONG meets the TYRANNOSAUR HEAD-ON at FULL SPEED! He swings, with his FOOT smashing the TYRANNOSAUR against the FALLEN LOG ... ANN loses her GRASP and FALLS ... as the DINOSAUR SPRAWLS onto the ground beside her ... in a flash, KONG CATCHES HER mid-fall ... ROLLING AWAY as the TYRANNOSAUR LEAPS UP and tries to take another swipe.    AS IT FALLS it SNAPS AT KONG'S FOOT.        his blood is up, he is ready to take on the world. HE STANDS NEXT   WIDE ON: KONG steps out of a LARGE ROUND CAVE onto a LEDGE that juts out high over SKULL ISLAND ...  This is KONG'S LAIR ... Over the ledge is a DIZZYING DROP of at least 1000-feet down to the JUNGLE.  The \"VENTURE\" can be seen - moored off the TIP of the ISLAND, some three miles away.  he moves away and sits to one side of the LEDGE.  The SKY is a FIERY ORANGE as the SUN goes down ...   SILHOUETTING the FIGURE of KONG ...  CLOSE ON: ANN looks around the CAVE taking in her STRANGE SURROUNDINGS ... her eyes fall upon a HUGE GORILLA SKULL and SKELETON which lie within the recesses of the CAVE ...  ANN turns and looks back at KONG ... realizing these are the BONES of his FOREBEARS ... that KONG was not always alone.  SOUND, sends ANN scurrying towards KONG ...   ANN breaks into a few tap steps ... NO RESPONSE. She leans   down and picks up some STONES ... JUGGLING them, attempting to amuse him as she did before. KONG's gaze remains averted ...  He looks out over the JUNGLE CANOPY. ANN follows his GAZE, taking in the RUGGED LANDSCAPE which is bathed in the last EVENING RAYS of the SUN. She stares out to sea, a RAIN CLOUD casts shadows over the OCEAN.    ANGLE ON: MOONLIGHT steams into the CAVE ... KONG sits on his   ANGLE ON: JACK is climbing up through ROCKS towards KONG'S LAIR!  BAT-THINGS flutter ... AGITATED ... SENSING an INTRUDER.  CLOSE ON: JACK freezes.  STALACTITES that hang from the ROOF of the CAVERN.  He scans the LAIR for any sign of ANN ... but can't see her. The OLD BONES of a LARGE GORILLA lie across the CAVE from JACK.    ANGLE ON: JACK moves forward, towards KONG. He stays in the SHADOWS of the ROCKS.  JACK CRAWLS FORWARD onto the LEDGE.     ANGLE ON: JACK creeps CLOSE to the SLEEPING KONG'S BACK ... his SHOULDERS gently heaving with each breath.   ... ANN is ASLEEP in KONG'S HAND!  in his sleep!  JACK is less than 8 FEET away from ANN.  CLOSE ON: ANN'S eyes OPEN. For a MOMENT she stares blankly at JACK ... then REALISATION arrives quickly - he has come for her! She looks at JACK with disbelief.  neither DARES to move, or make a sound.  to stay motionless in KONG'S PALM.  the CAVE and SWARM around the LEDGE ... their FEAR of KONG is overwhelmed by the tempting SIGHT of JACK and ANN.    CLOSE ON: JACK extends his HAND towards ANN ... she reaches out ... their FINGERS TOUCH ...  ... and KONG'S EYES SNAP OPEN!     TIME seems to SLOW: JACK attempts to GRAB ANN'S WRIST, but KONG'S FINGERS CLOSE around ANN with stunning SPEED! KONG ROLLS to his FEET, pulling ANN away from JACK!  him.  The BAT-THINGS SWARM above KONG.    ANGLE ON: SEVERAL BAT-THINGS are gripping and CLAWING KONG'S BACK in an effort to weaken the huge ape ... he suddenly POUNDS HIS BACK against the WALL of the CAVE, SQUASHING THEM ALL!  The surviving BAT-THINGS wheel away from KONG, HISSING ANGRILY ... 16 lie on the cave floor, STUNNED or DEAD. They FLUTTER towards the BACK OF THE CAVE, preparing their NEXT ATTACK.  KONG LOOKS for ANN ... she has GONE!     KONG ROARS with ANGER and GRIEF.     ANN breaks away from JACK, rushes at ENGLEHORN, grabbing his   arm just as he prepares to throw another CHLOROFORM BOTTLE.    ANGLE ON: KONG swipes at the MOORING MAST and sends it crashing down to the streets below.  WIDER ON: KONG stands atop the BUILDING, ROARING &amp; DRUMMING HIS CHEST in ANGER.  ANGLE ON: ANN as she desperately begins to climb up a SERVICE LADDER on the outside of the STEEL DOME ...",
        "/Lumpy": ""
    },
    "imdb_rating": "7.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjYxYmRlZWYtMzAwNC00MDA1LWJjNTItOTBjMzlhNGMzYzk3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Carl Denham needs to finish his movie and has the perfect location; Skull Island. But he still needs to find a leading lady. This 'soon-to-be-unfortunate' soul is Ann Darrow. No one knows what they will encounter on this island and why it is so mysterious, but once they reach it, they will soon find out. Living on this hidden island is a giant gorilla and this beast now has Ann is its grasps. Carl and Ann's new love, Jack Driscoll must travel through the jungle looking for Kong and Ann, whilst avoiding all sorts of creatures and beasts. But Carl has another plan in mind.—Film_Fan",
    "name": "King Kong",
    "genres": [
        "Action",
        "Adventure",
        "Romance"
    ]
}