{
    "filename": "Kundun_script.txt",
    "imdb_id": "tt0119485",
    "imdb_url": "https://www.imdb.com/title/tt0119485",
    "characters": [
        "Taktra Rimpoche (as Tsewang Jigme Tsarong)",
        "Takster",
        "Dalai Lama (Age 12)",
        "Dalai Lama (Aged 2)",
        "Father",
        "Lama of Sera",
        "The Messenger (as Lobsang Gyatso)",
        "Dalai Lama (Adult)",
        "Reting Rinpoche",
        "Lord Chamberlain",
        "Master of the Kitchen",
        "Lobsang (5-10)",
        "Dalai Lama (Age 5)",
        "Ling Rimpoche",
        "Mother"
    ],
    "dialogues": {
        "Takster": "I was never alone.  Two Chinese were with me every minute of the day.  Their talk is always of liberation and helpfulness.  They put their words like honey on a knife, but if you lick the honey, you will bleed.  They think they have convinced me. They think I am on their side. They have allowed me to leave Kumbum and come to Lhasa believing that I will try to turn you to their ways. If I do not succeed, I am to eliminate you.  Eliminate you.  Don't eat all those sweets. You'll get sick.  I do.  The Chinese have one goal.  The complete dissolution of our nation. The destruction of our culture. There is no room for Buddha in their world. Our only hope is to fight.  This is not a fight to put bread just in one's own mouth. This is a fight for Tibet.  These are not human beings. They are worse than ghosts.  You are in great danger. The Dalai Lama cannot fall into Chinese hands. You must flee.  It may not be your decision to make.",
        "Father": "No.  This must stop.  I am the father.  You sit there.  He will grow up all wrong. Only you can serve him, only you can wash his bowl. Too tidy, everything just so. He must know his place.  Long life.  I am sorry, Lhamo.  Not the way to talk to people.  No.  Are you?  Of whom?  I do, now.  I do, beautiful horses. Thank you, Holiness.  Where will you keep them?  I will buy them for you.  Hmmm.  Sometimes you strike the goat, to scare the sheep.  He will not be ours much longer.  Goodbye, Kundun.",
        "Reting": "Chenrezi, the Buddha of compassion. The Wish Fulfilling Jewel. The Fourteenth Dalai Lama.  Long life.  Centuries ago, a young boy was born.  His name was Gedundrub. The night of his birth, robbers came to his home and his family fled hiding the baby in a cattle pen. When they returned the next day, the baby was safe. They found him guarded by a pair of black crows. He was the first Dalai Lama. The Living Buddha of Compassion. Now, you have chosen to come back to this life once again.  We name you Tenzin Gyatso.  Your job is simple. You are to love all living things. Just love them.  Care for them. Have compassion for them. \"As long as any living thing draws breath, wherever he shall be, there in compassion, shall the Buddha appear, incarnate.\"  You will be the leader of the Tibetan people when you come of age.  Until that time, I will be your teacher, and as your Regent, I will rule in your name. I will tell your Lord Chamberlain you are ready to see him.  He will see you now.",
        "Rinpoche": "This is yours, you say. What else belongs to you?  Yes, those are yours.  With permission?  \"Kundun\"  He is the Presence.  So is your youngest.  I wish you long life.  This is Tibet. We are not under your authority.  Chenrezi, the Buddha of compassion. The Wish Fulfilling Jewel. The Fourteenth Dalai Lama.  Long life.  Centuries ago, a young boy was born.  His name was Gedundrub. The night of his birth, robbers came to his home and his family fled hiding the baby in a cattle pen. When they returned the next day, the baby was safe. They found him guarded by a pair of black crows. He was the first Dalai Lama. The Living Buddha of Compassion. Now, you have chosen to come back to this life once again.  We name you Tenzin Gyatso.  Your job is simple. You are to love all living things. Just love them.  Care for them. Have compassion for them. \"As long as any living thing draws breath, wherever he shall be, there in compassion, shall the Buddha appear, incarnate.\"  You will be the leader of the Tibetan people when you come of age.  Until that time, I will be your teacher, and as your Regent, I will rule in your name. I will tell your Lord Chamberlain you are ready to see him.  He will see you now.  \"I take refuge in the three jewels, The Buddha, the Dharma and the Sangra.\"  \"I take refuge in the three jewels, The Buddha, the Dharma and the Sangra.\"  \"Until I attain enlightenment.\"  The Four Noble Truths.  I accept it. What is suffering?  I accept it. What are the causes of suffering?  How does one progress from the realization of one Noble Truth to another?   Answer.   I accept it.  Careful!  Careful!  \"To be born in a time when the Buddha has appeared. To be born in a time when the Buddha has taught. To be born when the teaching of Buddha is alive.\"  \"To be born where the dharma is practiced. To be born in a time when people have compassion for other people.\"  As a result of previous karma, you have obtained this human life. By means of this rebirth, through work and study, you can attain all everlasting happiness. In the words of Shantideva: \"With the boat of this precious life, You can cross the waters of Samsara. How rare to find this boat!\" \"Oh, ignorant one, do not fall asleep now!\"  It is possible, Holiness.  Completely.  What would you do, Holiness?  It is a difficult situation.  Doubt is an affliction.  Reliquish it.  Accept.  We should not accept any conditions from the Chinese.  Enter.  I was never alone.  Two Chinese were with me every minute of the day.  Their talk is always of liberation and helpfulness.  They put their words like honey on a knife, but if you lick the honey, you will bleed.  They think they have convinced me. They think I am on their side. They have allowed me to leave Kumbum and come to Lhasa believing that I will try to turn you to their ways. If I do not succeed, I am to eliminate you.  Eliminate you.  I can be Governor of Lhasa, they say.  Don't eat all those sweets. You'll get sick.  I do.  The Chinese have one goal.  The complete dissolution of our nation. The destruction of our culture. There is no room for Buddha in their world. Our only hope is to fight.  This is not a fight to put bread just in one's own mouth. This is a fight for Tibet.  These are not human beings. They are worse than ghosts.  You are in great danger. The Dalai Lama cannot fall into Chinese hands. You must flee.  It may not be your decision to make.  He goes for a short time, until the danger can be determined.  He will not leave Tibet.  He will return.  He will return. The Precious One will not abandon you.  I hope you will not feel badly about all the things of childhood you missed.  You lost so much.  I am sorry.  Goodbye, Kundun.",
        "Lord": "Fifth Dalai Lama.  Seventh Dalai Lama.  Thirteenth Dalai Lama.  Fourteenth Dalai Lama.  May I listen to the news with you, Holiness?  Roughly five thousand men.  No.  Not very big.  No.  This war is almost over.  No, we don't.  In the Pacific Ocean.  It is an island.  American territory.  I do not know, Holiness.  He warned about the future of Tibet.  When it is time.  I am sorry for you to have to witness this, Kundun.  Tragic.  Unnecessary.  Holiness? I have a letter.  The Thirteenth Dalai Lama's warning. He wrote to you, the year before he died.  The year before you were born.  \"It may happen, that here in Tibet, religion and government will be attacked both from without and within. Unless we guard our own country...\"  \"...it will now happen that the Dalai and Panchen Lamas, the Father and the Son, and all the revered holders of the faith, will disappear and become nameless.\"  \"Monks and their monasteries will be destroyed. The rule of law will be weakened. The lands and properties will be seized.  They themselves will be forced to serve their enemies or wander the country like beggars.\" \"All beings will be sunk in great hardship and overwhelming fear; the days and nights will drag on slowly in suffering.\"  You are the man who wrote this letter.  You are the man who has come back to lead us.   You will soon have great responsibilities.  You must know what to do.  Ask whatever you will.  The war is over. This is a time in when nations are redefining themselves.  Yes.  As a free country. But our attempts have proven futile.  We continue to be badly outmaneuvered by the Chinese.  India is a newly independent nation.  They are struggling. India is in no position to help us.  Britain chooses not to.  America, we shall see.  Quite simple.  Yes.  Good.  They crossed the river, Holiness. They have invaded in six locations, Chando Province, Kham, eastern Tibet.  Eight thousand, five hundred, soldiers and officers. We have recently requested mortars, anti-aircraft guns and ammunition from India.  We have several hundred in the area.  The radio contact said one officer had died.  Then he said, \"The Chinese soldiers - they are coming.\" And then, the radio went dead.  One country did sponsor the resolution.  A land called \"El Salvador\".  In the Americas.  Your prime minsters would argue that such negotiations should take place in Lhasa.  He is a modern man. Just like he was the last time.  It means we have lost our status as an independent nation.  It is unlikely.  America, perhaps. There is great anti-communist feeling in America.  The Chinese would see such a pact as an open declaration of war.  Shall we consult the protective deities, Holiness?  Did you ever doubt it?  The Khamba's gun is his most prized possession.  I admire them so. They face a modern, well equipped army, and still, they fight.  Land reform is underway in Amdo.  The large estates are being confiscated and redistributed. Landlords are being punished.  The Communists put their guns in the hands of the Khamba children and force the child to kill the parent. They have dropped bombs on the monastery of Lithang in Kham.  It has been destroyed. Women and children, trying to escape from the fighting, have been shot with machine guns, fired from airplanes.  Non-violence means co-operation when it is possible.  Resistance, when it is not.  They will take Lhasa next.  The crowd will not disperse until you give your assurance that you will not attend the Chinese festivities. Many who have been invited to dine with the Chinese do not return home.  I will alert the Chinese delegation. You know, I would never have let you go alone, Kundun.  We are now accused of aiding the rebels.  The Chinese said we can expect drastic measures to be taken to crush this revolt.  The Chinese are planning to attack the crowd and shell the Norbulinka. You are asked to indicate on a map where you will be so that the artillery men will not mistakenly aim at you.  \"The Gods will be avenged!\"",
        "Chamberlain": "Fifth Dalai Lama.  Thirteenth Dalai Lama.  Fourteenth Dalai Lama.  May I listen to the news with you, Holiness?  No.  Not very big.  No.  This war is almost over.  No, we don't.  In the Pacific Ocean.  It is an island.  American territory.  I do not know, Holiness.  He warned about the future of Tibet.  When it is time.  I am sorry for you to have to witness this, Kundun.  Tragic.  Unnecessary.  Holiness? I have a letter.  The Thirteenth Dalai Lama's warning. He wrote to you, the year before he died.  The year before you were born.  \"It may happen, that here in Tibet, religion and government will be attacked both from without and within. Unless we guard our own country...\"  \"...it will now happen that the Dalai and Panchen Lamas, the Father and the Son, and all the revered holders of the faith, will disappear and become nameless.\"  \"Monks and their monasteries will be destroyed. The rule of law will be weakened. The lands and properties will be seized.  They themselves will be forced to serve their enemies or wander the country like beggars.\" \"All beings will be sunk in great hardship and overwhelming fear; the days and nights will drag on slowly in suffering.\"  You are the man who wrote this letter.  You are the man who has come back to lead us.   You will soon have great responsibilities.  You must know what to do.  Ask whatever you will.  The war is over. This is a time in when nations are redefining themselves.  Yes.  As a free country. But our attempts have proven futile.  We continue to be badly outmaneuvered by the Chinese.  India is a newly independent nation.  They are struggling. India is in no position to help us.  Britain chooses not to.  America, we shall see.  Quite simple.  Yes.  Good.  They crossed the river, Holiness. They have invaded in six locations, Chando Province, Kham, eastern Tibet.  Eight thousand, five hundred, soldiers and officers. We have recently requested mortars, anti-aircraft guns and ammunition from India.  We have several hundred in the area.  One country did sponsor the resolution.  A land called \"El Salvador\".  In the Americas.  Your prime minsters would argue that such negotiations should take place in Lhasa.  He is a modern man. Just like he was the last time.  It means we have lost our status as an independent nation.  Shall we consult the protective deities, Holiness?  The Khamba's gun is his most prized possession.  I admire them so. They face a modern, well equipped army, and still, they fight.  Land reform is underway in Amdo.  The large estates are being confiscated and redistributed. Landlords are being punished.  The Communists put their guns in the hands of the Khamba children and force the child to kill the parent. They have dropped bombs on the monastery of Lithang in Kham.  It has been destroyed. Women and children, trying to escape from the fighting, have been shot with machine guns, fired from airplanes.  Non-violence means co-operation when it is possible.  Resistance, when it is not.  They will take Lhasa next.  The crowd will not disperse until you give your assurance that you will not attend the Chinese festivities. Many who have been invited to dine with the Chinese do not return home.  I will alert the Chinese delegation. You know, I would never have let you go alone, Kundun.  We are now accused of aiding the rebels.  The Chinese said we can expect drastic measures to be taken to crush this revolt.  The Chinese are planning to attack the crowd and shell the Norbulinka. You are asked to indicate on a map where you will be so that the artillery men will not mistakenly aim at you.  \"The Gods will be avenged!\"",
        "Lobsang": "He thinks he is king here. No respect.  Kumbum. It is not far away.  I will be very smart.  Don't be a baby, move over.  You!  You think you are so big!  Long life, Lhamo.  Yes!  Then it is yours!  The Dalai Lama is not supposed to eat pork.  It is not good for your brain.  You could buy them.  What do you think?  You can't do anything real until you are Dalai Lama.  Not until you are eighteen.  Go study.  I get in trouble if you do not study.  I do.  I am the goat. He is a naughty sheep.  Have you chosen your new Prime Ministers, Holiness?",
        "Ling": "The Four Noble Truths.  I accept it. What is suffering?  I accept it. What are the causes of suffering?  How does one progress from the realization of one Noble Truth to another?   Answer.   I accept it.  \"To be born in a time when the Buddha has appeared. To be born in a time when the Buddha has taught. To be born when the teaching of Buddha is alive.\"  \"To be born where the dharma is practiced. To be born in a time when people have compassion for other people.\"  As a result of previous karma, you have obtained this human life. By means of this rebirth, through work and study, you can attain all everlasting happiness. In the words of Shantideva: \"With the boat of this precious life, You can cross the waters of Samsara. How rare to find this boat!\" \"Oh, ignorant one, do not fall asleep now!\"  He goes for a short time, until the danger can be determined.  He will not leave Tibet.  He will return.  He will return. The Precious One will not abandon you.",
        "Rimpoche": "",
        "Mother": "What is the harm?  What is the harm?  Oh, no.  Where will he go?  Good day.  Please, come in, so cold.  Of course, please, this way. Your servant may use the kitchen.  Lhamo, no.  No, no, no.  Lhasa! He always says he will travel far away.  He always wants to go.  Say, Kumbum Monastery.  It is not far at all, and it is a beautiful place. And your big brother is abbott there. You will not be alone.  You will be fine. You will be a fine monk.  Om mani padme hum. Om mani padme hum.  Your father had been very sick. He had been sick from the time you began growing in me. We thought he would die.  Yes.  A cow had died. One night, you stopped all your moving, and I said to your sister, \"His time has come.\"  At dawn, you were born. One eye was closed, and your sister opened it with her thumb.  We gave you the sweet drink.  You did.  We washed you and wrapped you in sheepskin and took you to your father.  That day he father got better And that day, a pair of crows came to nest in our roof.  I just remembered.  I miss him too.  Sera Monastery?  From Lhasa?  My oldest boy is an incarnation.  I will be back in a few days.  Two.  Yes, yes.  Your brothers are here.  One more kiss.  But why?  Who is Lhamo? Who do they say he is?  We do not know.  Long life.  You have escaped once more.  I have news.  The Regent has resigned his post.  Well, some say. It's not for you to worry about. Another will be chosen.  I turn you over again, today, Lhamo.  One day, you will not be able to come running to us.  Me?  I have one more piece of news.  A baby is coming.  Oh, no!  Who can it be?  Did you come to tell me we are leaving Lhasa?  You decide."
    },
    "imdb_rating": "7.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMzYyNzU4NTAtZDRmNi00ZWFlLTk3MTYtNjU5YTc5ZmM2YzZhXkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "The Tibetans refer to the Dalai Lama as 'Kundun', which means 'The Presence'. He was forced to escape from his native home, Tibet, when communist China invaded and enforced an oppressive regime upon the peaceful nation of Tibet. The Dalai Lama escaped to India in 1959 and has been living in exile in Dharamsala ever since.—Deki",
    "name": "Kundun",
    "genres": [
        "Biography",
        "Drama",
        "History"
    ]
}