{
    "filename": "L.A.-Confidential_script.txt",
    "imdb_id": "tt0119488",
    "imdb_url": "https://www.imdb.com/title/tt0119488",
    "characters": [
        "Sid Hudgens",
        "D.A. Ellis Loew",
        "Mickey Cohen's Mambo Partner",
        "Dick Stensland",
        "'Badge of Honor' Star Brett Chase",
        "Dudley Smith",
        "Mickey Cohen",
        "Lynn Bracken",
        "Pierce Patchett",
        "Officer Arresting Mickey Cohen",
        "Johnny Stompanato",
        "Ed Exley",
        "Bud White",
        "Jack Vincennes"
    ],
    "dialogues": {
        "Sid": "",
        "Hudgens": "",
        "Dick": "",
        "Stensland": "Bud ain't in the mood for small talk, Stompanato.  Leave it for later, Bud.  We got to pick up the rest of the booze and get back to the precinct.  You and women, partner.  What's next?  Kids and dogs?  What's going on?  Seen him around.  He used to be a cop.  Hey, partner.  Grab a cup.  Fucking Exley.  Guy's got a pole so far up his ass, every time he farts the flag waves.  For ours, Pancho. And you're getting off easy.  Don't look so down in the mouth, Bud.  You nailed him good.  Rain check me, partner.  I got something big going on tonight.  No.  I'll tell you sometime.  Not now.  Don't want to jinx it.  But it could take the edge off that jail time I got coming.  It's confidential, Bud.  Like that magazines Vincennes scams for. <u>Hush-Hush</u>. I'll see you tomorrow.  And hey, if it works out, you'll get a piece of it.",
        "Dudley": "Drop the formalities; it's Christmas Eve.  Call me Dudley.  Excellent.  How's this? The sanctity of the night is an invitation to the darker criminal element.  Our vigilance will not be diminished.  That's Smith with an S.  This way, gentlemen.  This is Sergeant Ed Exley.  Son of the legendary Preston Exley.  He's the watch commander tonight and a damn fine job.  I was fortunate enough to be partnered with his father when I was a rookie.  It makes a man feel old.  That's a fact. Feel free to get a feel for the place.  A word with you, lad.     To the memory of your father.  The day he got the Medal of Valor. A simpler time.  That was his favorite toast. I saw the test results on the lieutenant's exam.  You placed first out of twenty-three.  You'll make lieutenant inside a year.  Patrol division?  You don't have the eye for human weakness to be a good detective. Or the stomach.  You're a political animal, Edmund.  Am I...?  Would you be willing to plant corroborative evidence on a suspect you knew was guilty in order to ensure an indictment?  Answer yes or no.  Would you be willing to rig crime scene evidence to support a prosecuting attorney's working hypothesis...?  Yes or no, Edmund.  Would you be willing to beat confessions out of suspects you knew to be guilty?  Would you be willing to shoot hardened criminals in the back to offset the chance --  Then for God's sake, don't be a detective.  Stick to assignments where you won't have to make those choices.  Patrol, Internal Affairs, but not the Bureau.  At least get rid of the glasses. I can't think of one Bureau man who wears them.  Stensland's a disgrace.  Straight D fitness reports from every C.O. he ever served under.  But White is a valuable officer.  No, Edmund.  He's a man who can answer yes to those questions I ask you from time to time.  That'll be hard to come by.  The men hate a turncoat.  You'll reap the benefits, but are you truly prepared to be despised within the department?  So be it.  Sergeant, we'll get right to it. Nine civilian witnesses have identified you as hitting Ezekiel Garcia.  John, I doubt you've ever drawn a stupid breath.  Don't start now.  Lad, may I have a word with you?  Say goodnight to your friend and join me by those back tables.  He made his play amd he got what he wanted.  They're making him a detective.  Call me Dudley.  Lad, I admire your refusal to testify and your loyalty to your partner.  I admire you as a policeman, particularly your adherence to violence as a necessary adjutant to the job. And I am most impressed with your punishment of wife beaters.  Do you hate them, Wendell?  And for good reason judging from what I know of your background.  It would've happened years ago if you hadn't carried him.  Why the loyalty, Wendell?  Your partner's through. Department scapegoat on the Chief's orders.  He's been billed, he'll be indicted and he'll swing.  Don't underestimate his skills. As a politician he exceeds even myself.  But the department needs smart men like Exley and... direct men like yourself  Wendell, I want you to come to work for me.  They're yours.  Take them.  Four of the defendants recanted their testimony.  I need you for an assignment the Chief's given me the go-ahead on. A duty few men are fit for, but you were born for.  You'll be working out of Homicide.  Will you work for me?  How what, Wendell?  You should stay away from a man when his blood is up.  Then maybe you should stay away from him all the time.  Edmund, you don't want it and you can't have it.  It's mine.  I'll make you my second in command.  Why?    With Mickey Cohen in prison, Los Angeles is organized crime free. The Chief wants it to stay that way, Edmund.  The means are not for the weak-hearted.  Come, Wendell, you can do better than that.  We know all that, lad.  Tell us, who do these shooters work for?  We want you to go home. Uncuff him, Michael.  Mr. Sifakis is a known loan shark from San Francisco.  He arrived this afternoon at Union Station. Looking for business opportunities in our fair city.  An organized crime associate in need of re- education in the ways of polite society.  It's part of the play, Edmund.  A sincerity test.    Wendell, you need to accompany Detective Lieutenant Exley on official police business.  I'll finish up here.  'Nite Owl Massacre.'  Hyperbole aside, this is a heinous crime that requires a swift resolution. The public will demand it and this department will provide it.  Six victims.  One of them, one of our own -- Dick Stensland. As it happens, he was a Nite Owl regular.  In the wrong place at the wrong time.  Robbery looks like the motive.  We have rubber glove prints on the register and preliminary forensics strongly lean toward a trio of gunmen.  We do have one hot lead, so listen well.  Three Negro youths were seen last night discharging shotguns in the air at Griffith Park. A park ranger I.D.ed them as driving a 1948 to 1950 Mercury Coupe, purple in color.  An hour ago, a canvassing crew found a news vendor who saw a purple Merc Coupe parked across from the Nite Owl around 3:00 A.M.  The D.M.V. worked all night to get us a registration list on '48 to '50 purple Mercs.  There are 142 registered to Negroes in L.A. County.  Fifty two-man teams will shake three names apiece.  Hot suspects you'll bring here. Interrogation rooms have been set up.  They'll be run by Lieutenant Edmund Exley.  Hollywood Squad.  Ed, I want confessions.  I think you'll be surprised what Edmund's capable of.  Masterful, Edmund.  Your father would've been proud. This one's on the verge.  Don't get sidetracked.  Stay with the Nite Owl.  You've got it, Wendell.  We're going through the front.  Your father would've been proud.  There always are.  But there are also three men and three guns. Matched forensically.  A few loose ends don't matter.  Breaking a big case sticks you in a whirlwind.  A little self-doubt? It's natural.  Just keep it inside.  Between you and you.  Where did you intend to start. Prostitution?  Gambling? Go back to Cleveland, lad.  This is the City of Angels and you haven't got any wings.  John Vincennes.  It's three A.M., lad.  Lucky for you that my wife and four fair daughters are at the beach in Santa Barbara.  A disgrace as a policeman. Straight D fitness reports from every C.O. he ever served under. What about him?  What's this all about, lad?  You're Narco, lad, not Homicide. And since when do you work with Edmund?    Have you discussed this with anyone else, John?  Not even with Exley?  Sergeant Vincennes' body was found in Echo Park at ten o'clock this morning.  Killed by a single .38 round to the heart.  One of our own, gentlemen.  We cannot tolerate it.  Justice must be swift and merciless.  That's all.  Edmund, a word with you.  We received a tip this morning.  Did Vincennes ever mention the name Rollo Tomasi?  Anonymous.  Probably nothing.  You're perplexing to me these days, Wendell.  You're not your old, cruel self anymore.  I need proof that the extracurricular work I had planned for you remains within your grasp.  I've long been involved in containing hard crime in such a way that myself and a few colleagues might someday enjoy a profit dispensation.  That day will soon be here and you'll share handsomely.  Grand means will be in our hands, Wendell.  Imagine crime limited to the criminal element who perpetrate it. Imagine the means to keep the nigger filth sedated.  But don't stop there.  Extrapolate.  Imagine the police in control.  It's big, lad.  You have your extracurricular secrets, I have mine.  We'll hold a clarification session soon.  For now, I need your fearsome old habits at the Victory Motel. We're going to brace a man who may know who killed Jack Vincennes. Can I count on you?  This is Mr. Hudgeons, Wendell.  It's for your own safety.  Now what can you tell us about Sergeant John Vincennes?  But you were business associates?  Alright.  We'll drop that line for now.  Next topic.  Please comment on Pierce Patchett.  Wendell.  I want full and docile cooperation on all topics.  And?  Reciprocity, Mr. Hudgeons, is the key to all relationships.  And?  Wendell!  I wouldn't trade places with Edmund Exley right now for all the tea in China.  Hush-hush...  I'm loathe to kill my brother officers, Edmund.  Jack was a shame, but Dick Stensland had the audacity to try to sell me my own heroin.  Through his whore girl friend.  I sent him to make the buy.  The rest is history.  A vacuum, Edmund.  That's what we have in Los Angeles.  Sending Mickey Cohen up created it.  My containment work maintained it. Certain photographs guarantee it. Organized crime has been held back, but there's still a demand for the services it provides.  Absolutely.  Prostitution and gambling are victimless crimes. The heroin we'll run down to the coloreds.  Anesthetize them.  As long as it's not a middle class problem, no one will care.  It's still a crime free city... for respectable people.  This isn't politics, Edmund. There won't be winners and losers when it's over...  Just the living and the dead. It's always been that way in the Bureau.  You should've realized that before you became a detective.  We're policemen! Let me do the talking.  They'll make you Chief of Detectives.  Why not, lad?  Absolute justice?  <u>Really</u>?  Would you be willing to rig crime scene evidence to support a prosecuting attorney's working hypothesis?  Would you be willing to beat confessions out of suspects you knew to be guilty?  Are you willing to shoot hardened criminals in the back to offset the chance they'll --  Fabled L.A. Cop Dies Defending City",
        "Smith": "Fabled L.A. Cop Dies Defending City",
        "Mickey": "",
        "Cohen": "Bullshit.  What's the charge?  <u>Bullshit</u>.  What do you mean Deuce Perkins got clipped last night?!  I don't want a floor plan; I want to know who!  Who's taking the ticket for this, Johnny?  And what about the merchandise Deuce was holding for me?  Some ferstunkener is moving in and we don't know who?!  Maybe we should ask Hedda Hopper!",
        "Lynn": "A case each of gin, Scotch, and rum.  Everything top shelf.  None of that watered-down stuff you push on Errol Flynn.  Before five tomorrow.  Merry Christmas yourself, <u>Officer</u>.      It's not what you think.    Hello?  I'm sorry, but I'll make it up to you.  I promise.  I've been expecting you.  Pierce called.  Told me what happened to Sue.  It's Officer White, isn't it?  Can I get you a drink?  I was friendly with Sue Lefferts, but we weren't really friends. You know what I mean?  Of course I am.  What kind of question is that?  No I haven't.  Do you know why Pierce is humoring you?  Yes.  But do you know?  That's right.  Our motives are selfish, so we're cooperating.  I don't know.  I never heard of the Nite Owl till today.  Like I said we were friendly, not friends.  Pierce meets people.  Sue came on the bus with dreams of Hollywood.  This is how they turned out.  Thanks to Pierce, we still get to act a little.  He's waiting for you to mention mention.  It's Lynn.  I remember you from Christmas Eve.  You have a thing for helping women, don't you, Officer White?  You say 'fuck' a lot.  There's blood on your shirt.  Is that an integral part of your job?  Do you enjoy it?  Did they deserve it today?  But you did it anyway.    He takes a cut of our earnings and invests it for us.  He makes us quit the life at thirty.  He doesn't let us use narcotics and he doesn't abuse us.  Can your policeman's mentality grasp those contradictions?  No.  I'm really a brunette, but the rest is me.  And that's all the news that's fit to print.  It was nice meeting you, Officer.  Are you asking me for a date or an appointment?      I wondered when you might ring the bell again, Officer White.  You should see yourself.  You look like you're ten years old.  If you'd called first, I wouldn't look this ridiculous.      You're wondering if Patchett told me to be receptive.  It doesn't matter.  I like you, Bud.  I really do.  It doesn't matter.  All they get is Veronica Lake.  You got the real Lynn Margaret Bracken... Where'd this come from?  So you saved her.  Do you like being a cop, Bud?  You found Patchett.  You found me. You're smart enough.  Be a detective if that's what you want.  I know who you are.  You're the policeman Bud told me about.  He said you were smart.  He also said you were competing with your dead father.  How did he put it? Trying to measure up to a ghost.  He can take care of himself and I'm not afraid of you.  And you forgot one thing, Lieutenant. Pierce also taught me how to fuck... Can I get you a drink?  I'm curious about you.  Because Bud hates you more than he loves me.  It galls you that I know so much about you.  You don't have information to compete.  The way you've underestimated Bud White?  Oh, the best I ever had. Absolutely the best.  The silver screen's loss is your gain.  You want to know what Bud's like in bed?  I see Bud because I want to.  I see Bud because he can't hide the warmth he has inside him.  I see Bud because he makes me feel like Lynn Bracken and not some Veronica Lake look-alike who fucks for money.  I see him because he doesn't know how to disguise who he is.  There's more if you want to hear it.  Does all that make it harder for you to hate him or easier?  You don't like that you don't know how to play him.  He doesn't follow the same rules of politics you do.  That makes him dangerous.  I came out here with a dream. That's gone, but I settled for reality.  No.  This is the means to the reality.  But I'm not going to tell you what it is.  Because you'll use it against me. Won't you?  You're tougher than Bud thinks you are.  Like recognizes like.  I'm pretty tough, myself.  Actually, Bud's only tough on the outside.  Come in out of the rain.  In the morning we'll have both our stories for breakfast.  He's the opposite of you.  He's more like me.  Cold, calculating.  Come in out of the rain, Bud.  We talked.    I thought I was helping you.  I thought --        Bisbee, Arizona.  The air's good for pensioners and I know where everything is.  Right now, before I back down.  We should go now.  Some men get the world.  Others get ex-hookers and a trip to Arizona.",
        "Bracken": "",
        "Pierce": "",
        "Patchett": "She's fine.  I am.  Are you soliciting for police charities?  The last time, you people called at my office.  I was here, hosting a party.  Who was killed and why do you think I can help?  I don't know him.  Mr...    Of course...    He no longer works for me. Find Susan's killer, Mr. White. I'll give you a handsome reward. <u>Whatever you desire</u>.  Against your code?  Do you care about criminal matters peripheral to Susan's murder?  Then you wouldn't feel obligated to report them?  Then listen closely, because I'll only say this once and if it gets repeated, I'll deny it.  I run call girls.  Lynn Bracken is one of them and so was Susan Lefferts. I treat my girls very well.  I have grown daughters, myself, and I don't like the thought of women being hurt.  I sense you share this feeling.  I think she'd been hit in the face with a tennis racket.  She is -- was -- a big doubles fan.  Wait.  Our deal still holds?  I needed a Rita Hayworth to fill out my little studio.  There's Gardner, Hepburn, Grable, Turner.  Lynn Bracken is my Veronica Lake.  I use girls who look like movie stars.  Sometimes I employ a plastic surgeon.  No, Mr. White.  Pierce Morehouse Patchett.  Now, I sense you're on your best behavior, but that's all I'll give you.  If you persist, I'll meet you with my attorney. Now, would you like Miss Bracken's address?  I doubt she knows anything, but --  Of course... this is personal with you, isn't it, Mr. White?      I believe the Nite Owl's your area of expertise, Mr. Exley.  I saw you on television getting your medal. And you're that other celebrity Hollywood policeman, aren't you?  I'll tell you what I told Officer White when he asked me about Susan's death.  For the last time.  I may suborn women into illicit activities, but they're handsomely compensated, I treat them well and make sure the men they deal with show them every due respect.  A vulgar term, but yes.  Lynn Bracken.  Why do men and women usually see each other?  No.",
        "Johnny": "",
        "Stompanato": "Officer White.  I heard you got a hard-on for wife beaters.  Look, Mickey C's doing time and half the other guys who'd hire me are dead or left town.  I need money.  If your snitch-fund's green, I'll get you some fucking-A collars.  There's this guy.  He's blond and fat, about forty.  Likes the ponies.  Been pimping his wife to cover his losses.  Knocks her around to keep her in line.  I figure the address is worth twenty.  Yuletide cheer, fellas.  They shot him in his library.  Nobody.  At least not yet.  Gone.  Not a trace.  Wendell White, how's tricks, <u>paesano</u>?  What do you want, <u>officer</u>?  Should I?  Oh, yeah.  That was a long time ago.  Before your day.  The last few years he's been muscle for hire.  But I heard he's disappeared.  More's gonna cost you.  (in considerable  Deuce Perkins.  Mickey C's narcotics lieutenant.  The night he got clipped, eighteen pounds of Mickey's heroin went missing.  Meeks is probably in Rio or someplace like that by now.  I don't know.  I swear it!  Hey, you want an autograph, write to M-G-M.  <u>What</u>?  You are making a large mistake.",
        "Ed": "Nobody was born with the name Bud.  What do you do, Bud?     Where to, Trash?  I don't know...  Between the two of you guys, you should bring along a photographer.",
        "Exley": "What's on the call sheet?  Decorated?  I get the idea.  You got a description?  To the solving of crimes that require absolute justice.  The youngest applicant by eight years.  I was thinking Detective Bureau.  You're wrong.  Dudley, we've been over this.  I... No.  No.  No.  No.  I know you mean well, Dudley, but I don't need to do it the way you did.  Or my father.  All right, men.  You've had your fun.  Time to break it up.  What's going on?  I have the report right here. They're home with bruises and muscle pulls -- Oh shit...    You're going in my report!  All of you!  Let me out!  That's an order!  The public demands justice, sir. This was a full-fledged riot of policemen.  Shift the guilt to men whose pensions are secured.  Force them to retire.  But someone has to swing.  Indict, try and convict Stensland and Bud White.  Secure them jail time.  Feed them to the sharks, sir.  Protect yourself; protect the department.  White's a mindless thug.  I'll testify, sir.  I'm not afraid to do what's right.  <u>Detective</u> lieutenant.  I know that, sir.  I also know that when he made lieutenant, it was as a detective.  Jack Vincennes.  He's the technical advisor on 'Badge of Honor,' sir.  He lives for it. That's the way to get him.  Yes, Dudley.  I am.  That's right.  <u>Throwing me</u>?  You're the payoff expert.  I'm just doing my duty.  What about you?    His blood's always up.  Don't get sick!  Not in here!  Sir, I took the call.  It's my case.  Yes, I do, sir.  Hold on... We need to canvass. See if a purple Mercury was seen around here tonight.  We got a call earlier on three Negro youths.  Firing shotguns in Griffith Park from a late-model purple Mercury Coupe.     It's a surprise.  You like surprises, don't you, White?  We need you to I.D. the body. There's no next of kin and you knew him best.  So tell me...  Is that Dick Stensland?  Hell of a way to avoid a prison sentence.  Someone held up a coffee shop, panicked and killed six people.  We know this is difficult.  Just take your time and look again.  When was the last time you saw her, Mrs. Lefferts?  He might as well have put a bounty on them.      I'll take those odds. Take off.  We got it from here.   Think of us as back-up.  Quiet.  I'm ranking officer here. We go as a team.  End of story.  Damnit...  Glasses.  Shut up, Carlisle!  Casitas Youth Camp... Coates twenty-two, a boxer... Manager saw them burning clothes.  I'll break them, sir.  They call you Sugar Ray because of Ray Robinson? They say Robinson can throw a four punch combination in one second.  Do you believe that?  You're twenty-two, aren't you, Ray?  Did one of the officers work you over a little?  You look like Robinson after that last LaMotta fight.  'Course LaMotta looked a lot worse.  So you're twenty-two, right?  Just getting my facts straight. Twenty-two makes it a gas chamber bounce. You should have pulled this caper a couple of years ago.  Get life, do a little Youth Authority jolt, transfer to Folsom a big man. Orbit on some of that good prison brew, get yourself a sissy --  That fucking Larry.  I almost believed him.  Nothing, Ray. That Larry, he's a pisser.  You did the Casitas Youth Camp with him, didn't you?  Sugar, Larry told me you went sissy up at Casitas.  You couldn't do the time so you found yourself a big white boy to look after you.  He said they call you 'Sugar' because you gave it out so sweet.  Ray, you protected Ty and Larry up in Casitas, didn't you?  I heard you like to shoot dogs.  Oh?  you feel that way about people, too?  Ray, we got the shotguns.  Why were you throwing clothes in the building incinerator?  You guys were arrested this morning, but none of you have last night's clothes.  <u>You</u> were seen burning them.  Add to that the fact that you hid the car you were cruising around in last night and it doesn't look good.  Were you on hop?  You were passed out when you got arrested.  Were you hopped up, Ray?  Where do they get their stuff? Come on.  Give me one to feed the D.A.  Just a little one.  I'm going to take a break.  You know, Ray, I'm talking about the gas chamber and you haven't even asked me what this is all about.  You got a big guilty sign around your neck.  Fontaine next, but give Jones the newspaper.  I want him primed.  Larry, Ray Coates ratted you off.  He said the Nite Owl was your idea.  You want to tell me about it?  I think it was Ray's idea.  Talk and I think I can save your life.  Larry, this is a gas chamber job. If you don't talk, you'll be dead in six months.  Son, six people are dead and somebody has to pay.  It can be you or it can be Ray.  Larry, he called you queer.  He said at Casitas you took it up the ass.  He said --  Why'd you burn the clothes?  Hurt who?  Was she a hooker? Hurt who?  She may still be alive, whoever she is.  Where's the girl?  Did you kill her?  You wanted Larry to lose his cherry, but things got out of hand.  Is that right?        Where is she now? Did you leave her someplace? Did you sell her out?  Give her to some of your buddies?  Tell me where the girl is!  Officer White, put down that weapon and --  A naked guy with a gun?  You expect anyone to believe that?  How's it going to look on your report?  You don't know what the word means, you dumb bastard.  'Give me one to feed the D.A.... Roland Navarette.  Lives on Bunker Hill.  Runs a hole-up for parole absconders.'  Anyone seen Jack Vincennes?  Nobody move!  I need the girl to give me a chronology of events.  No details. Just times.  But --  No.  that won't be necessary.  There are loose ends out there, Dudley.  I --  Something's wrong.  I feel it inside.  Doesn't that sound crazy?     Clean?  Until he gunned down six people.  Then who phoned in the report?  The Nite Owl.  Anything bothering you about the case?  What are you talking about?  Mrs. Lefferts, I just want to ask a few questions.  Officer White?  (thinking  I don't doubt it -- Oh, God.  I need an I.D. ASAP.  You talk only to me on this one.  I need to speak to you.  I want you to follow Bud White.  It's not a request.  I need to know what White knows.  Follow him or I'll have you pulled off 'Badge of Honor.'  Permanently.  Yesterday yes, today no.  What happened last night?  You make a mistake?  Listen, I think I made a mistake, too.  Do you make the three Negroes for the Nite Owl killings?  It's a simple question.  Rollo Tomasi.  Rollo was a purse snatcher.  My father ran into him off duty.  He shot my father six times and got away clean.  No one even knew who he was.  I made the name up to give him some personality.  Rollo's the reason I became a cop. I wanted to catch the guys who thought they could get away with it.  It was supposed to be about truth and justice and Rollo.  But somewhere along the way I forgot all that... How about you, Jack? Why'd you become a cop?  I've given up angles for awhile. I just want to solve this thing.  I want to do it right.  A third.  I don't think we can make a case without Bud White.  What's that for?  Rita Hayworth at the morgue and now Veronica Lake with White. What the hell's going on?  What's Fleur-de-Lis?  Yeah.  But first I want to brace Stompanato.  Check the bar.  I got the restaurant.  Since when do two-bit hoods and hookers give out autographs?  L.A.P.D.  Sit down.  Take a walk, honey, before I haul your ass downtown.    What?     How was I supposed to know?    Is the Veronica Lake look-alike one of your whores?  What's her name?  Why's she seeing Bud White?  Anything else you want to add before I talk to her?  Not good enough.  This is Exley.  Tell him Sergeant Vincennes is coming in to talk to him.  I'm going to Lynn Bracken's.  I'll meet you at the Dining Car.  Miss Bracken, I'm Lieutenant Exley.  Really?  What did White say?  Let's concentrate on my smarts. Pierce Patchett made you, didn't he?  He taught you how to dress and talk and think and I am very impressed with the results.  But I need some answers and if I don't get them, I'm going to take you and Patchett down.  Scotch.  Why?  Don't underestimate me, Miss Bracken.  How was I?    How about White?  I want to know why you see him. Is it a Patchett payoff?  I'll take your word for it.  I don't hate White.  I really don't.  It's just, in my business, it's the wild cars you have to watch out for.  You cut to the heart of things, don't you?  What about Lynn Bracken?  She going to be a hooker all her life?  Some reality.  Why not?    You, me and White, huh?  No... Where'd the tip come from?  I want to know what you and Jack Vincennes talked about last night. Anything and everything.  Start with the I.D. on the corpse.  We got a dead ex-cop and a girl who looks like Rita Hayworth at the Nite Owl.  Another dead ex-cop under the house of Rita's mother. It's not a good week for ex-cops.  Anything?  So on active duty, Meeks didn't make an arrest from 1938 to '43.  Where are the police academy files?  Just show me where they are!  Why?  She told you?  Who told you?  Did Dudley have anything to do with you finding out?  Listen to me.  Dudley killed Jack. It has something to do with Buzz Meeks.  Look.  Dudley and Meeks go way back.  Stensland, too.  Think, goddamn you.  Think...  Stensland and Meeks.  What were they up to?  <u>Stensland and Buzz Meeks</u>.  Two-man triggers knocking off Mickey Cohen lieutenants.  When they killed Deuce Perkins, they got heroin as a bonus.  The Nite Owl!  Stensland was going there to sell the heroin.  It wasn't the Negroes.  The Griffith Park report was a phony. And, who says the purple Merc was spotted outside the Nite Owl?  The first guys to the car when Jack and I got there were Bruening and Carlisle.  They didn't find the shotguns. They planted them.  It's Dudley for the Nite Owl.  Pierce Patchett figures in, too. That's the angle Jack was working. Dudley must work for Patchett.  What?  Stay smart, Bud.  We build a case. We play by the rules.  With a wrecking ball.  You want to help me swing it?  Let's go see Pierce Patchett.  Run a good-cop-bad-cop.  You expecting problems?  (a screaming  I don't think his ex-cop did him much good.  It's a suicide note.  Says he killed Jack because Jack had figured out a pornography scam Patchett was running.  We had one thing figured wrong.  I don't think Dudley workd for Patchett.  Patchett's dead.  He sent you after me.  I'd say Dudley's tying up his loose ends.  I got a guy who owes me in the Sheriff's department.  West Hollywood station.  He can be at her house in two minutes.  Is she inside?  Hold her as Joan Smith.  No one sees her unless I okay it.  Ellis Loew.  Jack thought he was up to his neck in all this.  Ask for Captain Dudley Smith. We'll have a party.  Hot dogs and sauerkraut.  I want D.A. bureau men to tail Dudley Smith twenty-four hours a day; I want you to get a judge to authorize a wire tap on his home phone; I want authorization to check his bank records and I want it all in an hour.  None.  Call it a hunch.  Without what, his smearing yours first?  What's he got on you, Loew?  Pictures of you and an out of work actor with your pants down?  The proof had his throat slit. So far you're not denying it.  I don't know how.  Bud...  What's Dudley's scheme?  <u>Not everybody</u>.  You tip-off Dudley and Officer White visits you alone next time.  We should check the records, and, we should talk to Lynn.  You want to talk to her?  Forget everything else for a second, Lynn.  Is there anything you can give me on Dudley Smith?  A police captain.  I think he's behind all of this.  Okay.  Look, if it helps, Bud hates himself for what he did.  I don't know if it's pathetic or romantic, but when this is all over I'd like to see you again.  Me?  You called it.  I got a message that...  Shit... Come on.  You figured this was a set-up? And you showed up anyway?  You know, all I ever wanted was to measure up to my father.  We got him!  I'm thinking we might walk away from this.  Tell that to Jack Vincennes.  To Stensland.  Why?  And now you'll provide them.  <u>No</u>.  Something like that.  Yes.  I do.  That's it.  That's the whole story.    Where will you go?  When?  Where is he?  Thanks for the push.  You just did what you did.  No rank, no glory.  From me to you.  It'll mean something if it's yours.  Do you think I ever could've been in the running?",
        "Bud": "And you fuck people up for a living.  That don't make me you. <u>Capisce</u>, shitbird?  Happy New Year, greaseball.  Central, this is 4A-31.  Send a prowler to 1486 Evergreen.  White male in custody.  Code 623 point one.  Domestic assault and battery.  I won't be here, but they'll see him.      Touch her again and I'll know about it.  Understand?  Huh?  You got someplace you can go?  Go get yourself fixed up.  Merry Christmas.  That obvious, huh?  Turner Meeks?  Never heard of you.  You okay?    Somebody hit you?  What is it then?  You know him?  I got to write my report first.  Yeah yeah...  No, sir.  I won't.  I won't do it. I won't testify against my partner or anyone else.  That an old fashioned you're drinking? My name's Bud.  They stick you with a name like Wendell, you look for an alias.  I'm sorta between jobs.  Look, what do you say we, uh...  This business, Captain?  Does that paper say we've been indicted?  Does it say Exley's a hero for squealing me and Stensland off?  Captain, what do you want?  Dudley, what do you want?    What's going to happen to Stensland?  He'll give himself cirrhosis over this.  <u>He's one</u> <u>year from his pension</u>.  He helped me out once.  That's all.  Him and me both.  <u>Fucking Exley</u>.  <u>What do you want</u>?  Doing what?  Mowing your fucking lawn?  I knew you had juice, but... There's no goddamn bill on me?  How?      Of course... But how?  How'd you get them to retract?  Domestic.  Assault and battery.  I'll be there in five minutes.  I hear you like to hit women.  Yeah, sure... I got a couple of hours before I have to be at the Victory.  Want to grab a beer?  What?  That new mystery girl you've been seeing?  What are you talking about?  Where are we going?  Yeah, that's Stens.  What happened?  Can you take them?  I got I got something I gotta do.  What I gotta do is for Stensland. My partner.  I need an address on a customer of yours.  Her name was Lynn.  Yeah.  And I think you already know who I mean, so cough it up.  Give me both.  Billing first.  You must slay 'em at the country club.  Are you Pierce Patchett?  I'm a homicide detective.  Where were you last night?  Richard Stensland.  Officer White.  How about Susan Lefferts?  You know her?  We met outside Hollywood Liquors on Christmas Eve.  This is where Lynn Bracken's booze bills go.  Sue Lefferts died at the Nite Owl. I'm investigating.  Where's the other guy?  Buzz.  Thanks, but no thanks.  I don't have one.  Lefferts looked beat-up Christmas Eve, but didn't act it.  How come?  No.  That's right.    You wanna go downtown and discuss this officially?  What little studio?  That's why her mother couldn't I.D. her... Jesus fucking Christ.  I got her address.  Hit the road, gramps.    Yeah, plain scotch.  Are you sorry she's dead?  Have you ever heard of Dick Stensland?  You use words like that, you might make me mad.  Yeah I know.  Patchett's running whores and judging by his address, probably something bigger on the side.  He doesn't want any attention.  Why was Susan Lefferts at the Nite Owl?  Did Lefferts have a boyfriend?  How'd she meet Patchett?  Tell me about Patchett.  You want some advice, Miss Bracken?  Miss Bracken, don't ever try to fucking bribe me or threaten me or I'll have you and Patchett in shit up to your ears.  Maybe I'm just fucking curious.  You fuck for money.  Yeah.  When they deserve it.  I'm not sure.  Yeah, just like the half dozen guys you screwed today.  You look better than Veronica Lake.  Now, <u>Pierce Patchett</u>.  He had you cut to look like Veronica Lake?  Look.  I want to see you again.      One in six.  Where's the girl?  <u>WHERE</u>?!  Give me one minute.  Get her to the fucking hospital.  Get the fuck away from me.  It'll look like justice.  That's what that fat fuck got.  <u>Justice</u>.      It's Bud.  Who was that guy who was here earlier?  When I was ten, my old man threw a bottle at my mother.  I guess I got in the way.  Yeah.  But not for long.  I used to.  What I do now is strong-arm.  Sitting duck stuff... No, I don't like it.  If I could work Homicide like a real detective...  There's something wrong with the Nite Owl.  That prick Exley shot the wrong guys.  But they made him a hero and whoever killed my partner is still out there.  In here I know it.  But I can't prove it.  I'm not a detective. I'm not smart enough.  I'm just the guy they bring in to scare the other guy shitless.  That simple, huh?  I got a few Nite Owl questions.  I'm tying up loose ends.  Padding my report.  You know how it goes.  Anything off.  Anything that didn't make sense.  Whose shoe?    But she's moving away from the door. Who was sitting at this table?  <u>Ear plugs</u>.  It doesn't exactly play like dumb panic.  It's like they knew they were going to kill everyone before they went in...  Mrs. Lefferts, I'm Officer White with the L.A.P.D.  I'd like to ask a couple of questions.  Five minutes.  That's all.  Tell me about the boyfriend she had.  The one you mentioned at the morgue.  Ma'am, I'm sure she was.  What was that boyfriend's name?  Stens?  Was it Stens?  Look at a picture for me.  You said a neighbor heard a ruckus.  Was it outside, inside?  What's through here?  Easy.  Tell me about the ruckus.  Buzz Meeks... Holy shit.  Yeah.  A great big one.  Here.  Compliments of the Los Angeles Police Department.  I ain't your <u>paesano</u>, you wop cocksucker.  You remember an ex-cop named Buzz Meeks?  He works for a guy named Patchett.  His file listed you as a known associate.  Now spill.  More.  How 'bout I give you your balls back?  Bullshit.  Where would a two-bit ex-cop get 18 pounds of heroin?  He's under a tract house in San Berdoo.  And he don't smell too good.  What happened to the heroin, Johnny?     What work?  You lost me, Dudley.  I don't know what you're talking about.  Sure, boss.  Sure you can.  Did you talk to Exley?  I want to know about Exley.  How'd you get to know so much about him?  You gonna tell me what happened with you and Exley?  So tell me about it.  No.  Now. You fucked him.  Lynn.  I knew Stensland and Meeks knew each other.  Meeks was with Sue Lefferts on Christmas Eve.  The night I met Lynn.  Lefferts' mother I.D.ed Stensland as Lefferts' boyfriend, but Stens pretended he didn't know either one of them.  Johnny Stompanato told me when Meeks disappeared, he was trying to move the 18 pounds of heroin that went missing when Deuce Perkins was shot.  Then something goes wrong.  Meeks gets killed.  Maybe Stens got greedy, killed Meeks and left him under his girlfriend's house. The night he died, Stens was all mysterious.  Said he had something big going down.  Somebody got wind of it, killed them all.  Dudley.  Dudley's guys.  It all keeps coming back to Dudley.  Let's just kill them.  For Jack, for Stensland, for anybody else who got in the way. I've been trying to be smart.  A detective.  But killing those two fuckers, that would be justice.  There are no rules!  Why the fuck are you doing this?  The Nite Owl made you.  You want to tear all that down.  Which one are you and which one am  Patchett uses a lot of ex-cop muscle.  Come on.  He had help getting up there.  Two of his fingers are broken.  At least not anymore.    Call him.  What about him?  Dudley Smith.  Spill.  If I let you go, there'll be ten more lawyers to take your place tomorrow.  They just won't come on the bus, that's all.  They never made a match on the shotgun serial numbers.  What if Breuning and Carlisle took them from the evidence room?  Couple of cold pieces that had been hanging around a year or two.  You do it.  I'll check the files.  I want to see them.  <u>What</u>?  You wanted to meet here?  Too late.  Here.  A lot of bad stuff happened here. It's as good a place as any for it to end.",
        "White": "",
        "Jack": "Let's go someplace quiet.  I'll give you the low-down on Mitchum.  Two sets.  Karen, this is Sid Hudgeons from <u>Hush-Hush</u> magazine.  Is she?  You lost me, Sid.  Who?  I need an extra fifty.  Two patrolmen at twenty apiece and a dime for the watch commander at Hollywood Station.  No.  It's felony possession of marijuana.  Stand there with your camera. I'll stop here so you get Grauman's Chinese in the backgrouns.  Police!  Yeah, it's subtle.  Hi... I'd like to get a delivery to Beverly Hills.  Look, a friend of mine gave me this number.  I just --  This is Sgt. Vincennes. Requesting a name and address on a phone number.  Hollywood zero-one- two-three-nine.  I just called it.    White, you better get a lease on Stens before he kills someone.      What do I have to do?  The show, sir?  Okay.  I'll do it.  You're the key witness?  I should've known.  What's the Chief throwing you?  Yeah, Exley.  What's the payoff?  You're playing an angle, college boy.  You're getting something out of this so you don't have to hobnob with the fucking rank and file cops who'll hate your guts for snitching.  If they're making you a detective, watch out.  Some Bureau guys are gonna burn in this and you're gonna have to work with friends of theirs.  I'm snitching three old timers who'll be fishing in Oregon next week.  Next to you I'm clean.  And smart.  Just remember, Bud White'll fuck you for this if it takes the rest of his life.  They already suspended him.  Just pray he cops a deal and stays on the Department because that is one civilian you do not want on your case.  I won't be there.  They're toning down my profile.  Gee.  The Great Jerk-Off Book Caper of 1953.  Yeah, Cap.  Back in Narcotics.  Working whores with squad two.  Sid, it's Vincennes.  No.  But I've got something going with Ad Vice.  Don't know.  I'm chasing picture books.  Fuck shots, but the posers don't look like junkies.  It's well done stuff.  I thought you might have heard something.  What about Fleur-de-Lis?  Their slogan's 'Whatever you desire.'     If we go by the list, we have about zero chance of making the collar.  But I know a guy who knows what's going on south of Jefferson.  I'm betting he could put us at 50/50.  Leonard Bidwell?  How's the left these days?  I saw you fight Kid Gavilan.  I like your style.  You got a brother up in Folsom.  I know because I put him there.  How'd you like to make it 1960?  I know the judge and Sergeant Exley here is friends with hte D.A.  We're looking for three colored guys who like to pop off shotguns. One of 'em owns a purple Merc coupe.  You wanna buy your brother ten years...?  You don't have to say anything.  Just look at this list and point.  Here.  That's five minutes from here.  <u>Shit</u>.  Someone beat us here.  Hey.  What do you got?  So long, Vice.  Badge of Honor, here I come.  What?    Freeze!  You think golden boy can handle it, Cap?  He's good.  I'll give him that.     Sid, how are they hanging?  What's he doing here, Sid?  Sure, he just tried to throw me off the force last Christmas as a little joke.  And Reynolds?  Yeah.  Something like that.  Fleaur-de-Lis.  'Whatever you desire.'  Yeah.  Me and Patchett go way back.  Really?  How?  Yeah.  Me neither.  Loew's free.  Congratulate him.  Sid, why would a guy like Pierce Patchett get involved with running dope and hookers?  Around.  I'm pretty sure I can get you a part on the show... But tonight? Pretend it's an acting job, kid. Showbiz.  It'll be our secret.  Come on, Sid.  Where are you?  It's Vincennes!  Open up!  Sid, cut the crap.  I --  Shut up!  He's dead.  I was just there. Somebody slit his throat.  Loew didn't go with him.  You're sure?           Yeah.  Sergeant Jack Vincennes requesting.  I need the home address on a Pierce Patchett.  Give me a minute, will ya?  Damnit... <u>What</u>?  Even I'm not that crazy.  Yesterday that might've meant something.  Pull me off.  You'd be doing me a big favor.  Transfer me, suspend me.  Just leave me alone.  Yeah.  My whole life.  I ain't a priest, Lieutenant.  I can't hear your confession.  What?  You should be the last person who wants to dig any deeper into the Nite Owl, <u>Lieutenant</u>.  Is there more to that, or do I have to guess?  So what's the point?  I don't remember...  I'm trying to figure what angle you're playing <u>this</u> time, but I sure as hell can't see one.  The Nite Owl was solved, Lieutenant.  Okay, college boy, I'll help you. But I want half the collar.      He's in the Brown Derby with Johnny Stompanato. Check that.  I gotta go.  Bud White.  He sees us and we're dead.  Jesus... Maybe White's not so dumb after all.  Movie star hookers.  Whatever you desire... It's Fleur-fr-Lis again.  High line whores.  With plastic surgery to look like movie stars. And who knows what else?  It's run by this guy Pierce Patchett.  You want to talk to him?  She is Lana Turner.  She <u>is</u> Lana Turner.  Guy's as cool as they come.  What are you going to do?  Great.  You get the girl, I get the coroner.  <u>Buzz</u> Meeks?  Of him.  He was around when I first joined the force.  A bad egg.  Come on, Exley.  Where are you?  Two minutes, Dudley.  It's important.  You remember Buzz Meeks, Dudley?  Twelve years ago he worked a vice roust with Dick Stensland.  They arrested a Pierce Patchett on an extortion scam.  Guy ran hookers. He'd have them photographed with their johns, then double-dip for some blackmail.  Charges got dropped.  Insufficient evidence. You were supervising officer on the case and I was wondering if you remember anything about it.  Part of it has to do with a murder.  I've been working with Ed Exley on it.  It's a private investigation.  I fucked something up and I want to make amends.  No.  Have you a valediction, lad?  Rollo Tomasi...",
        "Vincennes": ""
    },
    "imdb_rating": "8.2",
    "description": "1950's Los Angeles is the seedy backdrop for this intricate noir-ish tale of police corruption and Hollywood sleaze. Three very different cops are all after the truth, each in their own style: Ed Exley, the golden boy of the police force, willing to do almost anything to get ahead, except sell out; Bud White, ready to break the rules to seek justice, but barely able to keep his raging violence under control; and Jack Vincennes, always looking for celebrity and a quick buck until his conscience drives him to join Exley and White down the one-way path to find the truth behind the dark world of L.A. crime.—Greg Bole <bole@life.bio.sunysb.edu>",
    "name": "L.A. Confidential",
    "genres": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMDQ2YzEyZGItYWRhOS00MjBmLTkzMDUtMTdjYzkyMmQxZTJlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_QL75_UY281_CR1,0,190,281_.jpg"
}