{
    "filename": "Lake-Placid_script.txt",
    "imdb_id": "tt0139414",
    "imdb_url": "https://www.imdb.com/title/tt0139414",
    "characters": [
        "Complete credited cast:",
        "Janine",
        "Stephen Daniels",
        "State Trooper",
        "Mrs. Delores Bickerman",
        "Deputy Sharon Gare",
        "Deputy Burke",
        "Hector Cyr",
        "Kelly Scott",
        "Deputy Stevens",
        "Officer Coulson",
        "Myra Okubo",
        "Paramedic",
        "Jack Wells",
        "Walt Lawson",
        "Sheriff Hank Keough"
    ],
    "dialogues": {
        "Janine": "Excuse me?  Is it true you're going to look for some kind of monster in Black Lake?  We heard a man got bit in half.  Here I come.  Ready or not.     Where is he?    He just took him in his jaws.  Yes.  You should have signs posted, for God's sake!",
        "Stephen": "",
        "Daniels": "Fine. There you go.",
        "State": "",
        "Trooper": "",
        "Deputy": "",
        "Burke": "Something's got the anchor line!",
        "Hector": "(spotting Kelly;       (extending his hand to  I'll need any and all topographic studies.  I apologize, I just don't want to lose the light, we've got time for a quick scout, you've had work done.  Hector Cyr, I said it once, let me know when it sinks in, have you seen it?  They've been migrating north, Kelly, this lake connects to the ocean,--  C'mon, we're losing light, why does the big one heckle me?  That hurt my feelings.  If he's here, I'll find him. Did she tell you we had sex together?  Even so, you're allowed to boast. You look thin by the way, I've mentally undressed you, I can see your ribcage.  They have saltwater glands, they can swim across oceans, it's only a matter of time.  They can survive winter.  As long as their nostrils don't freeze, they survive, am I foolish to explain things, he had such trouble with my name?      'Cept he wasn't before, was he? You know, when friends or family members say things, they tend not to register so sometimes it helps to hear it from a total stranger. You're fat.  What's going on?  Such the flirt.  Some decomposition, little acidic, it has been swallowed. Is this the man who was killed?  Well, you've got a croc alright, they're keystone species.  Species, keystones affect the entire ecosystem, that could explain all these worms, the water. You've got a crocodile. Bury your friend.        You're a beautiful woman.  And law enforcement, such dangerous work.  The idea that you could die suddenly with no offspring, disconcerting, let's mate, commit your genes to perpetuity.  Cocktail?  They come on land and they're brazen.  They're also attracted to noise, you can see I make a lot of it.    And you like me.  Deep down, gut check.  I'm growing fond of you and it's liberating to say so.  That hurt my feelings.     Jesus Christ!!  What are you doing?!  I'm laying a spring trap!  I keep telling you, they can come on land, I don't wanna wake up in the middle of the night--  This could end up saving your life,--  You'll be glad you didn't    Hey look, I'm sure you shoot me then, you'll be     finished first in your tongue massaging my          class but I think you need hemorrhoids, just before     to be retired to the big rubber running off to get your      room, where you can play with sister pregnant, who you     soft stuffed reptiles. probably already call mom.  This man takes a pistol     He's crawling around-- to pee!  They don't really attack underwater and--  No crocodile has ever--  And what if I tranq him Kelly?  He drowns.  You think about that?  Crocodiles don't sever with their teeth, their molars are blunt.  What I'm saying is if it's a crocodile that cut a man in half he would have to be over twenty feet which would make him well over a hundred years old, it would be unthinkable to destroy him.    As if. Will you miss me?  No thank you, but maybe later you can chew the bark off my big fat log.           Was he a good man?  Whenever somebody dies I consider it such a waste that I didn't know him better.      This is a setback.    I probably could've accomplished freeing him myself but he had a look of mayhem on his upside down face.  Promise you won't kill me, first.    Obviously some asshole in Hong Kong flushed him down a toilet.  Maybe he doesn't play well with others.    Let him go!  I'm sick of you      What's that?  Just spit him back out.  Some shall live, some shall die, arbitrarily, sound like any higher power we know?  Sobek.  Half man, half croc, oldest God--  That sounds good but underneath it's hurtful. Nightcap?  It happens when I land.  'Cause this is the cove he obviously lives in.  I need to see his habitat.  He's not gonna hurt me.       I suddenly feel a bit foolish. You're different from the others.  (terrified; trying to        I know under the circumstances, biting off my head might seem viable.  It would cheapen you.       Move over!!  I'm trying!!!  Bastard bit my chopper.    I'm a civilian!  You don't have any authority--  Then do it!!  So profound and fat.     You think I'm that nuts?  Nothing's real.  Nothing's real. I'm rich, people are automatically my friends, sycophants ooze out like oil slicks and and and--  With crocodiles... everything's even.    Didn't even sound good?    Yes.  You may.  But maybe... I don't know...  Could we have intercourse?  They'll kill him.  They're not going to be able to snag him in pitmans.  Tranq him in water, he drowns.    Forget about him being God, he's thirty feet long, he is a miracle of nature, who somehow made his way to Maine.  This is a grand beast. A grand dragon.  An attempt should at least be made to capture him alive.  I have enough flaxedil with me to put him out.  And I think I know a way to--  Look.  I know I'm crazy, but when they come, they will kill it.  They have to, politically, he's too dangerous, if something were to go wrong... the odds are he will be destroyed,--  Which is exactly          Please, Hank, let me finish what...                 I'm having a sane moment, this  If he were neutralized when they got here... they might consider saving him.  We lure him on land and pump him with the drugs.  Jack.  We've all seen it.  He's probably a hundred and fifty years old, he's bigger than an elephant.  We both know what they'll do.  He follows anything that moves. You guys can be in the trucks with tranq guns.  If he charges, drive off, plus Hank you've got your hand- held cannon.  We could do this with no safety risk.  If it works, we save a beast that should be saved.  That's actually the easy part.  Not much drag.  As long as I can keep him from swinging, we're okay.      Hold on!  I got something on the screen.  He's coming.            (sarcastic, through walkie  We're in about four feet of water now.  Oh, shit.  Motherfucker.  Where is he?     No!    I can't see him, but this is definitely blood.  Maybe you got him.  I don't know!  No.  Look.  He's got nothing left.  I'm okay.  Guess I finally got bit.    He's gonna live?  And Hank. I know you weren't really trying to hit him.  Thanks for the rescue.  You talk to Bickerman?  Women's intuition.  Are there anymore?",
        "Cyr": "",
        "Kelly": "Me too.    I was working for you when \"us\" started, what's--  Kevin, as long as we... What was that last part?  Yeah, that part.  There's... somebody who's um...        Yes, well... famished.          What do you expect, mugging me from behind?  Well you shouldn't have.  How did you even know where I was.  I don't like to be scared, Myra, I have a thing about fright, don't ever scare me.  Really?  I never realized he was so psychic, how could he detect that, did he tell you there's somebody else?  You?  You?  You and Kevin.  You don't know what to say, lucky for you action speaks louder than words.  I'm not upset, Myra, okay.  I just never thought of you as a y'know...      I really... I should get back.    Kevin.  How's it going, what's happenin', family good, great, nice to catch up, get out.  A tooth?    Sorry?  This is what we do?  Are you on drugs?  I'm not going to Maine, I won't even go west of Forty-third Street--  I'm not even a field person.  This was Myra's idea, wasn't it? Get me out of the office for a few days, until--  I never do field work and even if I did, Maine, to look at a tooth of a dinosaur who bit somebody, couldn't you dream up something--  I am not going to Maine.  That's ridiculous.  Did he say anything?  And you didn't see anything?    Is the dead guy in there?  Um. No, no.  Let's go.  I need to get a microscopic look at it.  Maybe I should see...  I'm fine, thank you.  Well. At wakes.  I can look at dead things.  Wait.  Okay.    And this is how he came to the boat?  Okay. And is there a place nearby I could go to vomit?  You talk to the married couple?  What kind of backup do we have?    You have a thing against museums?  Ever even been in one?  What is that?    It's just that--  Mosquitos.  I have a thing about mosquitos.  Kelly Scott.  Are we all museum bigots in Maine?  Yes, it did seem prehistoric but I'm sure he just carried the thing for luck.  Not that it worked, obviously.  It probably somehow got lodged into his body.  Why are you staring at me? Do I have a smudge on my face, it would be so you not to have told me.  Excuse me.  One other thing, it's a small point, but... I have a thing about being humored, and I'm feeling humored, more by him, but you seemed quick to join in.  Please.    We don't mean to invade your privacy but... was he ill, was he sick?          Yes, camp, I thought that meant Holiday Inn, I never heard \"tents\", will there be toilets?  What?  It looks like a branch.  You threw it at me!!  You threw it at me!!       Alright. Did you see that?  Don't throw heads at me, and stop calling me \"Ma'am\"!  How big do the bears get?  And they're sure he didn't get tangled under the outboard somehow?  It really is beautiful, isn't it?  I was told they discriminate against people with hygiene. I never believed it.  I told you.  How would you know, what--  So I don't like tents, why--  What's wrong with my       --as Emily Post, it doesn't fingernails these are      make sense-- perfectly good--  I am a paleontologist. I also was dating my boss he turned out to be involved with a co-worker who was also my friend and for the sake of comfort, theirs, I was shipped off to Maine. I don't feel like going back yet.  I'm not making it up.  I've come, I'm here, I'm staying. Unless there are ticks.  Oh my God.  If this is who I think it is. It is.  Hector Cyr.  He's a rich kook mythology professor.  He's done some work with our museum.  He also treks the world to swim with crocodiles.  Crocodiles.  He's an expert on them.  And if he's here... then he must think that's what's in this lake.  There have been Northern sightings. But not this North.  (frustrated)  No.                        Mister...  It couldn't be a crocodile.    I never had sex with you!  Hey.  But they're nighttime hunters, Hector, he'd probably be on land now anyway.  Hector.  They look scared.  My hair.        U.S. Wildlife won't send anybody without a confirmation.  Something's in that water.  Oh God, worms.  I got a thing about worms.  Adult males will charge hatchlings. If there's one out there...  Because they just consult their little indigenous charts.  (still looking at the    Skipping stones.  Look how flat that water is, you can get ten skips on a good one.  I beg your pardon?  I am not staying on shore.  I didn't fly up here to roast marshmallows--  I am going out on that boat and why are you picking on me, is this some kind of--  hazing, new fingernails    I'm not picking-- in the woods?       Good.    You hurt his feelings.  I think you should go apologize.  We're a team here.  It     He's a fruitcake! won't kill you to get along.  Look.  The thing about Hector... he takes this crocodile business very... he thinks they're Godly.  In his defense, every primitive culture known to man deified them. He's a mythology professor, he thinks crocs are divine conduits.  It's to make you understand him, with understanding comes tolerance. Too bad they don't put proverbs in Twinkies, my load would be lighter.  I'm sorry.    I'm just saying last resort.  They respond pretty quick.  I'll wait till you get down before I turn it on.  Good luck.  What? Oh as if I'm interested.    He may be a kook but he's also been all over the world with them.  He even swam in the Grimetti with killer Niles all around him, he never got nipped.  He said he knew it when he looked into their eyes.    Well Hector's a giant cracker.  What is this?  Well.  He's probably rugged handsome I guess.  Yeah.  It shouldn't be taking so long.  That was a bust.  What was that?    Hurry up!!  Shit!!  Hank!!  I think.  My hair. Where's Hector?! Where is he?    There he is.  Here he comes!  Yeah. Nobody saw anything?  That's probably good.     Um... y'know... Yeah.  I'm fine.  I uh... I'm fine.  Hard to believe there could be a monster under such peacefulness.  Excuse me?  What are you talking about?  Gee, that was so poetic, Jack.  I'm all moist.  Nice?  Nice would be \"you look pretty,\" nice is not some man- eating monster has tricked my brain into making you look good.  You did, you--  A man just died, you're hitting on me with science.  Hank?  Are you okay?      Scales were oval.  It was an Asian crocodile.  He had to be thirty feet long.  Why he's that big, I don't know. Why he's here... the wetlands are being developed, crocodiles are moving.  Australia, Fiji, the things have started to cross oceans.  Hank!  Yeah.  I got some stuff for your cut.  I wonder if he's some kind of mutant. That bear had to be surprised.  It's okay.     Just gotta pull it a little tighter.  Father's a surgeon.  I can even stitch in a pinch, wouldn't be a bad idea here.  Keep it dry.  No swimming.     This is the first time I've actually... y'know been in the middle of anything.  I've never really even gotten dirty before, with me showers have always been preventative.  Maybe.  I've always read about what's happened.  I've never... I know it sounds silly but, it's nice to be someplace while something is actually... y'know... happening.  We should probably go to bed. Get rest, get some rest.  Go to our separate beds, get some rest.    We seem to say goodnight a lot.  Night.    What?    Thing we can lift it?    I'm not mushing it.  That is it!!  No.  I keep getting hit with heads!  You calm down!  I'm being very calm.  I'm composed. This is the second time I've been hit with a severed head, I'm entitled to complain.  What?  What is she doing now? Mother of God.  Look ten feet into the water.     How long have you been feeding this thing?  A mistake.  Alright, Jack!  Jack!       Excuse me?  I'm no psychiatrist.  But I would think there have to be better places to look for autonomy, than--  Oh, bullshit.  No.  Can I tell them you won't go back in the water?  What?  Okay.  Good idea.  They could try to tranq him on land.  And how would we neutralize him?  Well...  He has been going after everything. It could work. But this is not a happy cow.  (looking through    He's mooing.  Such a simple idea and it's working.  What does that tell you?      Hector!!  We gotta get to Hector!!  Did you get him?  Wait.  I think the drugs are kicking in.  He's through fighting.  Look at him.  You're not okay, your leg's a mess.  He heeds a tourniquet.  You're gonna be okay.  Yeah, you got bit.  I'm gonna fix it.  We need to get it some medical help. And him too.  Okay. That's where they're taking the croc, Hector, they've got some big tank there.  Yeah.  Thanks to you.  I'm sure this would offend you on principal but... could we keep in touch?  Well...  No, no, I'll be a while anyway. I'm gonna say goodbye to the lake.  No, I actually want to stay for a little while.  I'll miss you most of all scarecrow.  Yeah.  But we do. Hey, we'll always have Maine.  Likewise.    No.  You think?  Probably not.  Good thinking.",
        "Scott": "",
        "Stevens": "",
        "Officer": "",
        "Coulson": "",
        "Myra": "",
        "Okubo": "I tapped you.    Kevin told me you were upset.    It started before you, Kelly, I never would've--  It was just a quick thing which we thought was over, and and...  It wasn't suppose to happen, I don't know what to say...  Kelly--  Backstabber?  Liar?  Shitbutt?",
        "Paramedic": "We're gonna airvac him to Portland.  We gotta take him.  We got room for one.",
        "Jack": "What did this?     We set?  Jack Wells.  A museum sent you?  Did you make anything of the tooth?  Let's go.  Ma'am, your first impression isn't going well.  Mrs. Bickerman, the reason we're up here... a man was fatally attacked yesterday by some animal in this lake.  Do you know how your husband died?  You killed him.  You gonna dig up that lady's husband?  You threw it at me!!       Alright. Did you see that?  Stop hitting me!           Ma'am!  What is going on here?  Big but... a bear couldn't do that to a moose or man in water.  On land maybe.  But...  Hank says he's sure.  Never been to Maine before?  Why are you here?  Really.  The Museum of Natural History doesn't send out investigators to--  And even if they did, I doubt he or she would have problems with tents.  You don't like tents, mosquitos, look at your fingernails, you have about as much business being in the woods--  What's wrong with my       --as Emily Post, it doesn't fingernails these are      make sense-- perfectly good--    Well.  You don't have to stay out here, why don't--  What?  Who?  In Maine?  Me.    What's that?  Are they feeding?  They look like they're jumping.  Same thing from Fish And Game.  Well until we see it, we're not gonna be convincing too many people.  Baby crocs?  If one could be out there... why does Fish And Game tell me it's impossible?  Listen... if you really do know crocs, you should know how stealth like they are.  I wouldn't be standing a foot from the water.  He could be right there and you wouldn't see him.  What are you doing?  Listen, uh... Hank and I think it best if you stay on shore.  Whatever's out there did flip over a canoe--  It's too dangerous for--  You flew up here because your boss--  hazing, new fingernails    I'm not picking-- in the woods?      Okay. We're up at six.    He thinks they're what?  Let's just all get some sleep.    Good. See ya soon.      We went in different directions. That water is thick, you can't see through it!  You okay? Kelly?  No. U.S. Wildlife is on their way.  Police want to keep it quiet, if the press gets word... lake monster.  They just want us to sit tight.  Are you okay?  A man died.  You don't have to be so tough.  I thought I might track the shoreline tomorrow, look for prints.  You know they say the brain confuses fear for passion.  When you get scared, the brain releases a chemical, same chemical it releases when somebody's... in high school, the thing to do was to take the girl to a scary movie.  I'm saying between the moonlight, a beautiful lake and a monster that bites heads off... you look good.  Forgive me for trying to be nice.  I didn't say it like that.  I was trying to pay you a compliment, I was guising it as science 'cause I know you're comfortable in that arena. Science.  Just forget it.  You cut, we'll hold him.    But why Maine and why alone?  Crocs are social, why's this guy on the move by himself?  Let him go!  I'm sick of you         I couldn't believe... did you see the size of that thing's mouth?    Sorry.  Ow.  Shit.  Who taught you be be a nurse?  No thanks.    You're having the best time of your life, aren't you?  That's why you're here.  To get in the middle of something?  Thanks for the... bandaid.        Well.  Goodnight.  We could not say it and... Well, that thing is ambulatory if you want somebody in your tent to...  Get back from the shore.  We know how fast he can leap out.  They won't be here till at least noon.  We got a few hours to kill.    I heard something.    That's pretty big.  Maybe.  Don't mush it.  You're mushing it a little around the--    Really--    Calm down.         He just appeared.  You have no idea how he arrived in this lake?    Hey!!  You wanna kill yourself, that it, you looking to commit some kind of divine suicide?  No! You might think they're Godly, you might get some spiritual lift backstrokin' with dragons but you just put a deputy at risk and--  'Cause he just ate a cow, you stupid--  Just heard from Wildlife and Florida Fish And Game.  They should be here by four.  We might as well pack.  Well, you can try talking them into that, if--  Forget it.  No way.  So maybe Wildlife will try to save him, they're more equipped to--  Even if we could tranq him-- how would we get him on land.  And again.  How would you get him on land?  We won't let him get hurt, Ma'am.  Are we crazy?  We've got a cow hanging from a helicopter.      The more he thrashes, the better.  We're ready.    It can't work.  He looks like a giant tea bag.  (looking through    You do?  (into walkie-talkie; now  Can you confirm visually or just radar?  Okay.  Lead him in. Okay, everybody up on the trucks. We aim for the stomach or side... there's little chance the darts will pierce his hide.  Everybody up on the trucks.     You wouldn't?       Little closer.  Three, two, one...  Fire!!  Keep firing!  Shit!!    Where is he?!           Hector.  Do not move.    Go!!  Drive!!  Take him!!  Hector, you see anything?  I don't think we really want to wait for him to catch his breath.  I don't care.  Hank.  End it.  Yeah and every time we think there's no more danger--  Get him onto shore.  Don't count on it. We better take him out.  Thank God.  You take care.  She didn't tell us about the other croc 'cause she was afraid we'd blow it's head off.  Just those two.  Okay.  Well... I got stuff to pack up and...  You too.  You wanna ride in my truck?  You sure?  I don't mind...  If I'm ever in New York...  Y'know, if we didn't live in separate worlds and...  It was... something meeting you.  I thought I should say goodbye to the lake too.  Yeah, I thought about that as I was driving... and... I haven't found somebody in my world.  You found anyone in yours?  So I was thinking... maybe if I met anybody in my world who was good for you and if you know somebody in New York good for me, we could fix each other up.  Worth a try.  We don't wanna be alone forever, do we?  That was... y'know if the guy asks me can she kiss, now I'll be able to tell him if you can.",
        "Wells": "",
        "Walt": "Imagine.    Sheriff!!",
        "Lawson": ""
    },
    "imdb_rating": "5.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNGI2N2RmM2YtYTE5Yy00ZTg2LWI3NTMtODkwZDgwZTVhYjI3XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "Shortly after the horrifying underwater attack in Maine's Black Lake, the local Fish and Game officer, Jack Wells, enlists the help of the New York City palaeontologist, Kelly Scott, to investigate. With only a mangled body as their starting point, Jack and Kelly embark on a dangerous mission to find the mysterious creature, as Sheriff Hank Keough, a mythology professor, and an eccentric inhabitant all want to locate the elusive predator first. But, something deadly is lurking beneath the silent pond, and it's already taken a liking to the juicy human flesh. What is the secret of Lake Placid?—Nick Riganas",
    "name": "Lake Placid",
    "genres": [
        "Action",
        "Comedy",
        "Horror"
    ]
}