{
    "filename": "Larry-Crowne_script.txt",
    "imdb_id": "tt1583420",
    "imdb_url": "https://www.imdb.com/title/tt1583420",
    "characters": [
        "Samantha",
        "Trainee Wong",
        "Dorothy Genkos",
        "Team Leader #2",
        "Jack Strang",
        "Team Leader #4",
        "Cubby",
        "Avery",
        "Cox",
        "Vacuum Shopper",
        "Larry Crowne",
        "Mom with Baby",
        "Team Leader #1",
        "Team Leader #3",
        "Alvarez"
    ],
    "dialogues": {
        "Samantha": "",
        "Trainee": "",
        "Wong": "",
        "Dorothy": "A seven-speed Mix-o-Meter Food Processor! $21.69!",
        "Genkos": "A seven-speed Mix-o-Meter Food Processor! $21.69!",
        "Jack": "",
        "Strang": "Finally. Dotty G. and her forty-two- K a year are history. Who else would do us that favor?  The \"R\" Bomb is going to do some collateral damage to this place.  What say we drop a brick in the pond to warn the herd?  Firing someone.  Like a Team Leader.       I say Crowne.  Who else? Avery won't retire. We fire him, it's a law suit.  Alvarez is about to drop a kid. She'll go part time in a week.         She was his squeeze for a few weeks, weren't you, Vick?  The memory haunts me.  Big brick in the pond, though.  Cubby. Make tracks. 8.  I don't think you do.  I take it back.  Crowne-ie, you did a heck of a job.  Becasue you never went to college you're forever retarded.  Never.  S. M. U. Class of '86! Go 'Stangs!  In a way, you are.  Son of a cock. Larry Crowne.  Two extra large. One Salad Bucket. Box of Frosty Cinnamon Eggs. Sixteen- fifty.  Tell me about it.",
        "Cubby": "",
        "Avery": "Sweatpants! Two pair! $6.69!",
        "Cox": "Separating the chaff from the wheat. Chaff is the bad stuff, right?  Before E.O.Q. Them's our orders.  Someone they'd never expect to be let go. To look fair. I like it.  Suggestions on who it should be?  What Salary Tier is Crowne at?  Sweet. We'll need Actionable Cause, of course.  How's his review record?  Okay. So. Sluggers, gimme a reason... 6.  You're that familiar with his record?  Let's call it. Today, end of shift, UniMart bids Crowne adieu.  Crowne. At UniMart, we care. So we take care. Which makes moments like these tough for all of us.  Corporate has mandated a restructuring in all UniMart stores. That's the word they use. I call it a pain in the touchas. It is touchas, right? Where you get kicked?  Hurts to get kicked back there, no matter what language you speak.     Thank you for your service to our country, Larry. And, in total seriousness to UniMart too 10.  The timing on this is always a bitch.",
        "Vacuum": "",
        "Shopper": "",
        "Larry": "Three-pack of men's elastic waist mid-thigh boxer shorts! $2.69!     They do love the comfort food. Don't you, Li'l Pickle Bug...     Team Leaders zone departments before punching out. It's policy.  Probably to clean up after the party.  Speck-tack-alar.  Ah, who's counting?  Remember how we saw \"The UniMart Way\" video, Vick? You and me, alone in this room, and look at us now.  I think I know what this is about.  Sounds like you're firing me.  UniMart is firing me...  Why me? 9.  Why not Strang?  I've been here longer than you, Jack. I started 21 years ago as an Inventory Associate at the store on Euclid.  I won't make the Front Office?  I went in the Navy. Right outta high school. Five years, and by then...  I thought I was Employee of the Month.  No. No. No. No. No. No. No. No. No. No. No. No. I'm going to lose my house...  Guys. Guys. Guys. Guys. Guys. Guys. Guys. Guys. We can fix this. Can't we fix this?  Stick it out. You go to college?  Thanks for seeing me off.  I was holding for Barry Raphael in Home and Real Estate?  Barry is gone? I need to talk to someone in Home and Real Estate.   I wish! I'm Customer number 566 7878 2031 339 and I can be there in three minutes!  Three minutes!     I m hoping not to lose my house.           That's RiverBank's plan for me?     How do I offer this up to Personnel?  This?  There isn't.  Just following up with an in-person visit.  You have a great location here.  I used to work for UniMart! I could spill you some 411.  I know their trade secrets.  And I'm ready to learn new strategies. I'll stop by again so you can keep me in mind.  I'll work every day.  As I recall, I gave my notice and worked all my shifts and that was 12 years ago.  Not sure I could work here anyway. The atmosphere is too pleasant and the clientèle too A Number 1.  No charity today. I got things to do.  Nothing. I was just saying that.            They said it's because I didn't go to college.  Buying out Denise's half of the house was the worst advice, ever.  I love you too.  Hard to do.  Aren't there unemployed engineers and geophysicists?  You won the Lottery.  I'll see if there's a class in here for PowerBall 250. 22.  They give these away free.            First time. I was in the Navy.  Galley Mate. 23.  No. No, no. I need an all-new career and a place to go everyday.  Is this Public Speaking?  Sorry! Parking's impossible today!  New to the Student Body.  I'm going to be late for my first day of school.  Please tell me this is Speech 217.  Look at us, in two classes in a row.  That Ms. Tainot is something else isn't she? I'm new to this coll ge life and, I confess, she sca es e This whole place scares me.     I'm sorry. Larry Crowne, and I'm babbling.  I like this guy...  Money woes. Paying for gas, getting to school. You ever come across a moped or a scooter for sale or trade?  \"College Graduate.\"  That's a hunk of junk.  It doesn't work.     Two hundred.  Two hundred.  Forget it.  All I need is the open road.     Speck-tack-alar. Nice machine. Where you headed?  School. College. I'm a student. What do you do?  Yeah? I'd say 'have a great day' but that would be stating the 35.  You take care.         I am?  It's only been one day  New to the sport.  Larry Crowne. With an 'e'.  Not much fashion sense.     You mean me?  My presentation will be on the subject of a very particular procedure. \"How to make French Toast\", but I'll speak English...  Most people think syrup comes out of a plastic bottle.  That went fast...  Why not.  I just bought it and ride around.  Other than school, I have nothing to do.  I know where a yard sale is, like everyday.  Follow me, boys and girl!  College buddies.         Entrez vous, sea food plate.  Good choice.  I did most of the cooking, actually. You know about Denise?  The usual stuff between three people.  Dark.  Stay outta my way.  Cooking for friends is sort of fun. Three hundred times a day is not.  He is?  'We'll be right back after these messages.'  Capice.  L rry.  Peace indeed. 48.     Speck-tack-alar.  That was a great presentation. I learned a lot from it.  Smart stuff. Super smart.  Breaking even is not making profit, it's a theoretical assumption. Economics abhors an assumption.  So what happens here?  I have no idea what that means, but you betcha.  Holy smokes!  You got inventory.     What is all this worth?  Where?             Denise. Larry.  This a good time?  I'll call you later.  Well. Okay. Uh. Here's the deal.  I'm going to miss a few months on the checks for the house.  I hoped not to, but I there it is.  I'm sorry. 56.  Let's start with six.         I tried. I'm too much of a risk.        Raul? Yes.  I do?  The USS Coral Sea. Boss, I don't want to quit school.  I gotta get to class before I miss the whole day. And I can't work mornings Mondays, Wednesdays, Fridays.  Deal. When will we talk salary?        Then say it. Just give the answer. You know it. Say it.  insist.  I'm sorry, Ms. Tainot. I will not miss another class, this I vow. 63.  Inappropriate subject in mixed company.       She's marred.  Complimentary coffee is usually lousy.  I got a job.  Perry's Coffee shop. Breakfast all day. And I'm going to school.  I was afraid of that.         I can't make the payments on the house. I'm going to lose it, aren't I?  You guys are forced to say that, aren't you?  Should I begin?  first crossing of the Equator...  Unless you're looking at a chart, you don't even know the Equator when you cross it...             Square footage at this price is a bargain.     Chapter four. 74.      Ms. Tainot?     Do you need a ride? Hop on.  I was heading home. Right? We're done scooting?  Seriously. I offer you a ride.  I've yet to give anyone a lift on this but I think I can get you home with a scraped elbow, worst case.  An attractive woman like you walking alone is a dumb idea.  In those shoes?  Put this on. Strap your legs round my engine and 80.  Ain't you a ball of fun?  I do want to survive this night.  Where am I taking you?  I may use this as a presentation in class.  I like your class. You're making us all do things we never thought we could.  Someone's getting pinched...  Bad night for that guy.  Unit 114.  You don't want to give me your pass code.  This it?  I'll get the door for you 83.  What?  What?  What are you talking about?  When I say 'what', it means I get it and have already purposefully forgotten everything. Call it irony.  Goodnight, Ms. Tainot.  I assumed you preferred Ms 84.  That's a long story and it's late. My helmet?     Thanks.  We all have crushes on you. Even the gals.  Wow...  Yes, you do.. In you go.  Close the door. Lock it!  Goodnight, whoever you are!                 Epilog. School today.  If we had ended up making out, you still wouldn't hear it.  How are the Triplets? Groggy, Puffy, and Grumpy.  Last i ht? Let's see, what was I doing? Studying some. Working some. Can't recall. I've forgotten everything that happened last night as best a gentleman can.  I wouldn't want that.  Sure. Nothing happened. At all.  None.              I have to sell my car. 91.  If I could afford a new top I could afford to keep it.  Half my UniMart salary.  I'm looking back on the year Denise left as the good old days.  Everyone keeps saying that.  The odds of two people on the same street winning the lottery are worse than one person on the street winning the lottery.     Vick? How you doing? Larry Crowne.  Why are you on the Register? 93.  Cash. No receipt.  'Consumerism'.  The handwriting is loopy. Looks like 'Consumerism'.  You missed Matsutani's class. Review for the final.  What? Why?  Talia. Don't be a fool. Stay in school. Don't throw away your education.       Japanese characters go the other way and that says Soy Sauce.         Might not make it. I have finals!         She's insane.  Frances Taylor-Briegh. You have a problem with your order?  Mrs. Tainot.  There's no way in creation I screw up French Toast.  You'll be the judge of that.  So, your meal is satisfactory?  Would you let my boss know so I don't lose this job?  Shall I prepare you another batch?  Then I will return to my station..               Priceless at a buck apiece.         You'll get me top price.  Here's lunch as promised!       Jack Strang. Wow. This is irony.  Jack. I need two bucks back. Times are tough.  Ah. Forget it. Keep the change.     I add chicory and a bit of vanilla. Trick I picked up in the Navy.  Didn't expect that. Thanks, Mrs. Tainot.       This has turned into a full time gig. Out of necessity.  I'll have to see.          Cars not much. Devices some.  In my old job, I'd have steered you to a Vortex unit. The MapGenie interface is clumsy and the menu needs too many inputs.  Ah. The Auto On Feature is engaged. Menu. Select. Features. Auto Voice. Select. Change? Yes. On. Off. Done? Yes. Save. Back. Back. Back. Exit.     All better now. Should be able to find your way.  My Boss. Back to work. Thanks for the good news...     I met you.",
        "Crowne": "Three-pack of men's elastic waist mid-thigh boxer shorts! $2.69!     They do love the comfort food. Don't you, Li'l Pickle Bug...     Team Leaders zone departments before punching out. It's policy.  Probably to clean up after the party.  Speck-tack-alar.  Ah, who's counting?  Remember how we saw \"The UniMart Way\" video, Vick? You and me, alone in this room, and look at us now.  I think I know what this is about.  Sounds like you're firing me.  UniMart is firing me...  Why me? 9.  Why not Strang?  I've been here longer than you, Jack. I started 21 years ago as an Inventory Associate at the store on Euclid.  I won't make the Front Office?  I went in the Navy. Right outta high school. Five years, and by then...  I thought I was Employee of the Month.  No. No. No. No. No. No. No. No. No. No. No. No. I'm going to lose my house...  Guys. Guys. Guys. Guys. Guys. Guys. Guys. Guys. We can fix this. Can't we fix this?  Stick it out. You go to college?  Thanks for seeing me off.  I was holding for Barry Raphael in Home and Real Estate?  Barry is gone? I need to talk to someone in Home and Real Estate.   I wish! I'm Customer number 566 7878 2031 339 and I can be there in three minutes!  Three minutes!     I m hoping not to lose my house.           That's RiverBank's plan for me?     How do I offer this up to Personnel?  This?  There isn't.  Just following up with an in-person visit.  You have a great location here.  I used to work for UniMart! I could spill you some 411.  I know their trade secrets.  And I'm ready to learn new strategies. I'll stop by again so you can keep me in mind.  I'll work every day.  As I recall, I gave my notice and worked all my shifts and that was 12 years ago.  Not sure I could work here anyway. The atmosphere is too pleasant and the clientèle too A Number 1.  No charity today. I got things to do.  Nothing. I was just saying that.     They said it's because I didn't go to college.  Buying out Denise's half of the house was the worst advice, ever.  I love you too.  Hard to do.  Aren't there unemployed engineers and geophysicists?  You won the Lottery.  I'll see if there's a class in here for PowerBall 250. 22.  They give these away free.       First time. I was in the Navy.  Galley Mate. 23.  No. No, no. I need an all-new career and a place to go everyday.  Is this Public Speaking?  Sorry! Parking's impossible today!  New to the Student Body.  I'm going to be late for my first day of school.  Please tell me this is Speech 217.  Look at us, in two classes in a row.  That Ms. Tainot is something else isn't she? I'm new to this coll ge life and, I confess, she sca es e This whole place scares me.     I'm sorry. Larry Crowne, and I'm babbling.  I like this guy...  Money woes. Paying for gas, getting to school. You ever come across a moped or a scooter for sale or trade?  \"College Graduate.\"  That's a hunk of junk.  It doesn't work.     Two hundred.  Two hundred.  Forget it.  All I need is the open road.     Speck-tack-alar. Nice machine. Where you headed?  School. College. I'm a student. What do you do?  Yeah? I'd say 'have a great day' but that would be stating the 35.  You take care.         I am?  It's only been one day  New to the sport.  Larry Crowne. With an 'e'.  Not much fashion sense.     You mean me?  My presentation will be on the subject of a very particular procedure. \"How to make French Toast\", but I'll speak English...  Most people think syrup comes out of a plastic bottle.  That went fast...  Why not.  I just bought it and ride around.  Other than school, I have nothing to do.  I know where a yard sale is, like everyday.  Follow me, boys and girl!  College buddies.     Entrez vous, sea food plate.  Good choice.  I did most of the cooking, actually. You know about Denise?  The usual stuff between three people.  Dark.  Stay outta my way.  Cooking for friends is sort of fun. Three hundred times a day is not.  He is?  'We'll be right back after these messages.'  Capice.  L rry.  Peace indeed. 48.  Speck-tack-alar.  That was a great presentation. I learned a lot from it.  Smart stuff. Super smart.  Breaking even is not making profit, it's a theoretical assumption. Economics abhors an assumption.  So what happens here?  I have no idea what that means, but you betcha.  Holy smokes!  You got inventory.     What is all this worth?  Where?       Denise. Larry.  This a good time?  I'll call you later.  Well. Okay. Uh. Here's the deal.  I'm going to miss a few months on the checks for the house.  I hoped not to, but I there it is.  I'm sorry. 56.  Let's start with six.         I tried. I'm too much of a risk.        Raul? Yes.  I do?  The USS Coral Sea. Boss, I don't want to quit school.  I gotta get to class before I miss the whole day. And I can't work mornings Mondays, Wednesdays, Fridays.  Deal. When will we talk salary?        Then say it. Just give the answer. You know it. Say it.  insist.  I'm sorry, Ms. Tainot. I will not miss another class, this I vow. 63.  Inappropriate subject in mixed company.       She's marred.  Complimentary coffee is usually lousy.  I got a job.  Perry's Coffee shop. Breakfast all day. And I'm going to school.  I was afraid of that.         I can't make the payments on the house. I'm going to lose it, aren't I?  You guys are forced to say that, aren't you?  Should I begin?  first crossing of the Equator...  Unless you're looking at a chart, you don't even know the Equator when you cross it...             Square footage at this price is a bargain.     Chapter four. 74.      Ms. Tainot?     Do you need a ride? Hop on.  I was heading home. Right? We're done scooting?  Seriously. I offer you a ride.  I've yet to give anyone a lift on this but I think I can get you home with a scraped elbow, worst case.  An attractive woman like you walking alone is a dumb idea.  In those shoes?  Put this on. Strap your legs round my engine and 80.  Ain't you a ball of fun?  I do want to survive this night.  Where am I taking you?  I may use this as a presentation in class.  I like your class. You're making us all do things we never thought we could.  Someone's getting pinched...  Bad night for that guy.  Unit 114.  You don't want to give me your pass code.  This it?  I'll get the door for you 83.  What?  What?  What are you talking about?  When I say 'what', it means I get it and have already purposefully forgotten everything. Call it irony.  Goodnight, Ms. Tainot.  I assumed you preferred Ms 84.  That's a long story and it's late. My helmet?     Thanks.  We all have crushes on you. Even the gals.  Wow...  Yes, you do.. In you go.  Close the door. Lock it!  Goodnight, whoever you are!          Epilog. School today.  If we had ended up making out, you still wouldn't hear it.  How are the Triplets? Groggy, Puffy, and Grumpy.  Last i ht? Let's see, what was I doing? Studying some. Working some. Can't recall. I've forgotten everything that happened last night as best a gentleman can.  I wouldn't want that.  Sure. Nothing happened. At all.  None.              I have to sell my car. 91.  If I could afford a new top I could afford to keep it.  Half my UniMart salary.  I'm looking back on the year Denise left as the good old days.  Everyone keeps saying that.  The odds of two people on the same street winning the lottery are worse than one person on the street winning the lottery.     Vick? How you doing? Larry Crowne.  Why are you on the Register? 93.  Cash. No receipt.  'Consumerism'.  The handwriting is loopy. Looks like 'Consumerism'.  You missed Matsutani's class. Review for the final.  What? Why?  Talia. Don't be a fool. Stay in school. Don't throw away your education.       Japanese characters go the other way and that says Soy Sauce.         Might not make it. I have finals!  She's insane.  Frances Taylor-Briegh. You have a problem with your order?  Mrs. Tainot.  There's no way in creation I screw up French Toast.  You'll be the judge of that.  So, your meal is satisfactory?  Would you let my boss know so I don't lose this job?  Shall I prepare you another batch?  Then I will return to my station..               Priceless at a buck apiece.         You'll get me top price.  Here's lunch as promised!       Jack Strang. Wow. This is irony.  Jack. I need two bucks back. Times are tough.  Ah. Forget it. Keep the change.  I add chicory and a bit of vanilla. Trick I picked up in the Navy.  Didn't expect that. Thanks, Mrs. Tainot.       This has turned into a full time gig. Out of necessity.  I'll have to see.          Cars not much. Devices some.  In my old job, I'd have steered you to a Vortex unit. The MapGenie interface is clumsy and the menu needs too many inputs.  Ah. The Auto On Feature is engaged. Menu. Select. Features. Auto Voice. Select. Change? Yes. On. Off. Done? Yes. Save. Back. Back. Back. Exit.     All better now. Should be able to find your way.  My Boss. Back to work. Thanks for the good news...     I met you.",
        "Alvarez": "Four Toby Jug beer steins - $2.69!"
    },
    "imdb_rating": "6.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYjQ4MzlmZDUtN2ViMi00ZTAwLWFkMmItNGRlZmM1NjQ1ZmJjXkEyXkFqcGdeQXVyMzI0NDc4ODY@._V1_QL75_UX380_CR0,22,380,562_.jpg",
    "description": "Until he was downsized, affable, amiable Larry Crowne (Hanks) was a superstar team leader at the big-box company where he's worked since his time in the Navy. Underwater on his mortgage and unclear on what to do with his suddenly free days, Larry heads to his local college to start over. There he becomes part of a colorful community of outcasts, also-rans and the overlooked all trying to find a better future for themselves...often moving around town in a herd of scooters. In his public-speaking class, Larry develops an unexpected crush on his teacher Mercedes Tainot (Roberts), who has lost as much passion for teaching as she has for her husband. The simple guy who has every reason to think his life has stalled will come to learn an unexpected lesson: when you think everything worth having has passed you by, you just might discover your reason to live.—Universal Pictures",
    "name": "Larry Crowne",
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ]
}