{
    "filename": "Law-Abiding-Citizen_script.txt",
    "imdb_id": "tt1197624",
    "imdb_url": "https://www.imdb.com/title/tt1197624",
    "characters": [
        "Clarence Darby",
        "Nick Rice",
        "Detective Garza",
        "Mayor",
        "Kelly Rice",
        "Rupert Ames (as Joshua Stewart)",
        "Sarah Lowell",
        "Judge Laura Burch",
        "Bray",
        "Clyde Shelton",
        "Bill Reynolds",
        "Denise Rice (as Emerald Angel Young)",
        "Warden Iger",
        "Jonas Cantrell",
        "Detective Dunnigan"
    ],
    "dialogues": {
        "Clarence": "",
        "Darby": "Your Honor need not worry on my account. I assure the court that I am aware of the opportunity I've been given. And I am deeply grateful to all concerned.  If I may. It has come to my attention that Rupert Ames has been spreading                   * lies about me to the tabloid press.                   * About certain alleged activities of                   * which I have no knowledge. Sexual and otherwise. Libel and slander...yes?  Well, no matter. My tongue will wag in court, under oath. His tongue will wag in hell.  He'll get the chair?  ...it was a burglary gone wrong. We thought the house was empty. Rupert found the woman and child at home and went crazy. I was stoned and in fear of my own life, so I fled...  ...and may I say for the record how very sorry I am that I failed to prevent Rupert Ames from committing those terrible crimes...  ...been given a chance to put the drugs and foul living behind me. To atone for my past failings and weakness of character. It is a gift given me by God's grace...  ...and the grace and wisdom of this court. I cannot thank you enough, sir. I cannot.     Wait...wait...  Almost. Almost.    \"Did not go well.\" Way to go, Rupert. You even fucked up dying.  Knew. Past tense.  Depends. Who's this?   lowers the binoculars, stunned.       Kiss my ass.  What'll it cost me?  What's there?  How do you know?     Drive.  Drive, fucker! I'll put your brains on the dash!  Depends on you. Go.     In the ditch.  Knees. Let's go.  It's fucked up.  This my guardian angel? Hello?",
        "Nick": "Yes. Yes, I can.     I've seen the crime scene photos, Mr. Clyde. Many times. They're horrifying. But they don't alter the facts of the case.  This isn't about what we know. It's about what we can prove in court.  Look. We've had only one real break in this case. The fact that one asshole has decided to testify against the other asshole.  Mr. Clyde. I can't claim to know what it's like to be in your position. Losing your wife and child. But please try to grasp how limited our options are. This is how the justice system works.  Thank you, voice of doom.  *  It's your office.  What do you think?  You were top of your class at Yale, don't give me that shit.  Clarence Darby. This document guarantees that you will provide testimony against Rupert Ames in the matter of which you were both accused. In return, you will be  shielded from further prosecution for those capital crimes. But you will plead guilty to the lesser charge of breaking and entering.    We don't do chair. We do needle.  Whoa, Jonas, take my elbow.                          *  You're shitty on stairs. At least let me take the leash so the dog doesn't pull you down.  I'll pass.  Since everything in this case has gone sideways so far. Tell your boy to save it for the courtroom.  Asshole.  You good here?   Clyde, a tiny defeated figure far below, waits at the bus stop. He's gazing up, seeing this photo op happen.    breaks the handshake with a flush of discomfort, signals the federal marshal:   Marshal, escort your man, please! Mr. Darby is done here!     Shit day. Better now. How's she doing?  She was busy?  I had to say some things to a man today I didn't want to say. And I did something I didn't want to do.  None of those things.  You in there. Listen up. Your mother just said the world sucks. You may wanna rethink this whole thing. My advice? If you're asking? Just stay in there. I promise you, nothing will ever make as much sense as it does right now...  ...plus there's shit you don't need to know about. Rap. Internet porn. Madonna's entire back catalog.     Huh? Wha--?  What?  It's a work thing. Grownup stuff. You know that happens sometimes.  I believe we've established that. I let go, you'll stop reminding me? We'll celebrate this weekend. Tonight is all about your friends. Knock                    * yourselves out, don't give mom any                  * grief. I'll try to be home in time to tuck you in, okay?  Nice evasion. Thanks.  How long she have to wear this stupid thing?  Poor honey. Sucks, doesn't it? But you're very pretty. Yes, you are. Even with a radar dish on your head.  I don't know!   I'll ask because somebody has to.                    * Is there any chance, no matter how remote, that this was an accident? A mix-up? Weird shit happens?  Clarence Darby. That's what he said when he agreed to testify against the man we executed tonight.  Check the court transcripts, they're public record.  How about I ride-along? Give you a fast, accurate ID on this guy?  You said yourself we should move fast. This thing'll be all over the morning news cycle. We'd all look a lot better if we have the right man in custody by then.  I think so. Hard to tell.  A shame?  I can read a C.I. profile. What I see is an asshole dirty up to his ears in the drug trade. So you cops look the other way? He gets a free pass as long as he keeps feeding you convictions?  You gotta be kidding me.                            *  How could we lose him?                              *     I had my \"ewwww gross\" moment last night too.  Hey. I saw a guy's veins dissolve.  Oh, shit. We've gone national.        My daughter is traumatized! She's                      * only ten! It's a goddamn snuff film!                   * In my home!                                            *    Belonging to who?  Mr. Clyde.  Well. I'm here. So?  I think that's obvious.  You murdered two people. Rupert Ames and Clarence Darby.  Clarence Darby was found on your property. Old abandoned shed?                *    You sick fuck, you sent it to my house! My daughter saw that video! It fucking traumatized her! She couldn't stop sobbing!  We know you did it.  You think you can play us? You gonna take me on?  I'm gonna bury you, fucker!  What?  You're gonna confess.  Confession or not, we're gonna nail him on two counts of first-degree.  Kid gloves? He's a psycho with a power saw.  No.  Okay. He got under my skin a little. That's done.  ...background check's gotta be thorough, I want to know everything there is to know about this son of a bitch. Get all the ADAs on it, tell 'em I better not see them sitting around on their asses or texting their pals...  Yeah, he was good. And Hanson's                        * always reliable. But try to limit their hours, okay?     Fuck.  I saw her bed empty. Scared the shit out of me. Don't know why.    I know. Shhh. We're all good. You're safe. Nobody's gonna hurt you.  Filled to capacity. It has been for years. They had to re-open this for the overflow. Part of it anyway.                   *  For the record: You've waived legal counsel. You've offered to confess to the murders of Clarence Darby and Rupert Ames. Yes?  I know what lumpy means. Sorry to hear it. But we're not here to talk about prison conditions, we're here to talk about things you've done.  What do you want from me?  A bed. In your cell.  You want the variable temperature control too?  Anybody?  You looking to deal? All right, how's this? How about I don't kick your fucking teeth down your throat?  Sorry, Jonas. Okay, kid gloves. My daughter slept in our bed last night. She hasn't done that since she was six. You gave her nightmares. So excuse me if I don't feel like cutting any little deals today.  This is bullshit. He's jerking our chain big-time...  And the prison phones?    Let's move on to Clarence Darby.  *  It's a legitimate concern.  My office types it up, you sign.  You don't want to sign, don't sign. We've got you on videotape, we'll go to trial. In ten years, when your appeals are exhausted, I'll attend your execution. I'll make sure nobody tampers with the drugs.  I've eaten there. So?                              *  Not gonna happen.  Because I have no interest in making it happen. And you have nothing left to bargain with.  Tell me.       What do we have so far?                                *       Agent Davies?  Why do you have him in the dome?    Why'd you kill your cellmate?  Here's what I think. You suckered us in. You ordered that meal for the purpose of killing him.  I see you totally disconnected from reality, that's what I see!  Thank you, Judge Burch. Consider your court order signed. Freedom? Not likely. In fact, you just bought a one room suite in the dungeon. Very exclusive.  You're doing everything wrong. Making all the wrong moves.  Sam. I know you got hit hard. I know you're furious. But I'd like my shot at prosecuting this case. This started with us. Let me finish                  * it. Give me that chance.                             *  Blowback?                                     *  You're insane.  Or what?  Let's keep him that way. Strict rules apply. Law says he gets one hour outside his cell a day, that's what he gets. Just one, under heavy guard. The other twenty-three hours, he's in that cell, he's a ghost, he doesn't exist. No contact whatsoever.  We underestimated him before. I'd like to know what this prick is capable of. Update on the background check?  That's it? Nothing else unusual?                       *  What kind of government work leaves a blank spot, Sam?    Yeah. I guess he is. It's...killing his cellmate. I need that to make sense.  Yeah, I know, but...we're not talking some gang-banger. This man is precise. Does things for a reason.     Sam? What is it? Not far, maybe six blocks. I'm having dinner with my wife.     He's coming here?  Yes. Yes, we're all here. Downstairs? Okay. Understood. He said not to take the elevator.  What are we dealing with?  What was Clyde? Some kind of spy?  Ask Clyde?  How good?  Yeah. Tournament level in college, matter of fact.  What about Clyde?  I have been. Any thoughts?     Let me talk to mom first.  Sorry about date night.  Thing or two.  Hey, I was thinking. Maybe you could pack an overnight bag for you and Emma in case you need to...you know...spend the night in a hotel. Or something.  No reason. It's like a fire-drill thing. You know. In case.  It's okay, baby -- I'm fine, I promise. Go back to your game.  Nothing. I got paranoid for no reason, that's all. I'm fine now. I can't believe I let that son of a bitch Clyde get to me like that.  I'm sure we're fine.                               *  I'll make goddamn sure.                            * Sarah, roust the ADAs. Tell 'em                    * we're pulling an all-nighter.  Ready to turn this place upside down?  See if there's anybody locked up here -- or working here -- ex-cop, witness for the prosecution -- anybody who might have had anything to do with the original Darby-Ames case, or has any previous history with Benson Clyde. Start with the cellmate. Flag anything, no matter how insignificant it seems...  Well?  What do you have?  Tear it apart, make sure. Memory.                      * Speakers. Wiring. Everything.                          *    It was a good bluff. But you're done. Fucking with my head. Scaring                    * my family half to death. Done.  You strip away all the polite shit,                    * that's what we're really about.  Good night, Ben.  So far. Now we double-down. Make                    * absolutely certain.                                 * Let them all sleep a few hours,                     * then bring 'em back for round two.                  *          You're gonna be all right.     He's got someone working with him. On the outside. He's got to.  Fuck you.  If not?  Put the gun away! Are you crazy?  We're not risking anything. Or letting him tear us down. You're not getting us to throw out the rules, like you. No way.  What? What then?  Who?  That's not helpful! We have fourteen                  * dead! You could ask them what he's capable of, but they're in no position to answer.  No way. Find a replacement.  And have them switch the location of that dinner.  Exactly. He could have gotten your schedule in advance -- been planning to take you out at the dinner along with everybody else. That eenie- meenie act could have been horseshit. We have to get a few moves ahead. Plan for every contingency.  Hey baby -- no, I'm fine. Really. Honey, calm down...  Our shit just hit the fan in a big way -- we're all over the news... Yes, all eight died. Sarah's in surgery right now... ...they think so, but... ...okay, I'll meet you there. Love you.  Of course it has. Thanks.     Any word?  Thank God. That's good.  You didn't lose me. You won't. Does the school know we're pulling Emma out of class?  You are. Getting our daughter out of harm's way. And yourself. Detective. Will you escort my wife, please? There's not much time. I'll be there to see you off. Okay? Please?  Sarah's fine. That's the good news.    Give it to me. And your cell phone. I need to borrow it for a few days.  Hey, hey...she's fine, don't be scared. That's not allowed. And there's no reason for it.  I know.  'Cause your mom wants to see a few Broadway shows. You gonna begrudge her that?  Okay, you're right. Maybe I am a little. But only a little. The part you can believe is that this is all going to be fine. Sarah, us. I mean it. Okay?  No credit cards. Too easy to track. Meals, hotel, whatever -- pay cash.  I'll keep this. It can be traced. Use this one instead. Don't answer unless you see it's me.                           *  I love you.  Jesus.                                                 *  I'm telling you, Clyde has someone          * working with him. Someone on the outside.  Somebody from his past. Could be            * that spook we met on the stairs,            * for all we know -- he'd know how to         * plant this shit...  To fuck with our heads? To get us to bring in our ADAs so he could blow them up?  Jonas, think -- last few days, have         * you used any ice? Any salt?  Before or after he was arrested?  I'll buy you a new toothbrush.                         *  Holy shit.  It's not bad, Jonas. I think you can muddle through.  The background check my office was compiling -- these properties we                    * think Clyde owns? If he is working                  * with somebody, they could be                        * operating out of any of these. We                   * should check them.                                  *  It's not even complete. Sarah was                   * in the middle of it -- untangling property ownership from under assumed names, shell companies. She's the expert on all that.  Save it for tonight. Hope you're in the mood for Chinese takeout.  That stuff in your house -- it's all gone too far. I started this. I owe everybody at least one last try at defusing it.  I thought we'd have some privacy.  Be the perfect place for it. Outside the wall. Look like you were shot trying to escape.    Something like that.  No. It's to prove a     point. Just because I have     the power, doesn't mean I have     to use it.  One can show mercy.  Yeah. So why don't you?  Don't give me that. Death doesn't scare you.  Until one side admits defeat. What if I did that? What if I said... ...you were right. I was wrong. What if I say I should have prosecuted both men ten years ago?  I'd have lost.  Yeah... She is? Great news. I'll stop on my way back. And Royce? Put some get- well flowers in her room, they sell 'em in the lobby. Thanks. Six hours in surgery.    No?  What kind are you?  Yeah.  I can't. I can't imagine that.               *  I won't make any more deals with murderers. If hearing that makes a difference...if that was the point of all this...you've won.     Hey.  How you doing?  I'm afraid so.  You're alive. That counts for a                      * lot.                                                 * I'm sorry I put you in harm's way.                   *  We're all over it. Jonas is safe --                 * out of reach.                                       *  ...yes, you pain in the ass, of course I got your kung-pao...you think I'd forget...just don't give Betsy any, I can't deal with dog farts all night...  I'm minutes away. Relax.           The second explosion. I saw a rocket               * fired.                                             * Clyde does have somebody on the outside.  How'd you kill Jonas? I know about the second explosion, I saw the contrail, so I know you got somebody working for you. But the first explosion -- how?    I'm trying to get over my friend being dead. Aside from that, fuck you.  Didn't bring your family back, though, did it? Has it made you feel better? All this? You done making your point?  Sarah. Give it a rest. It's over. We're done. I'm done. The mayor is nailing my coffin shut. The best thing you can do right now is distance yourself from me as much as you can -- see what you can salvage of your career.  \"Joe's Lube-and-Drive Garage.\" Went out of business in '94. Now why would Joe's extinct Lube- and-Shit Garage be of the slightest possible fucking interest to you, me, or anyone?    I know who he's got on the outside. I'll ask again. Do we finish this tonight?  Where the hell is he going?  You don't suppose Nomos Custodial                    * has a service contract with City Hall, do you?  That's right below the ballroom. The Mayor's event.  No. Let him go. We know where to find him. Let's get to that courtroom.  There.  Can you open it? Disarm it?  No!  He won't set it off until that room is full! People are still arriving, red carpet shit, that's at least another half hour!  You have to!  If I'm him, I've rigged cameras in that ballroom -- live video feed -- first sign of an evacuation, I trigger the bomb. We have to think ahead of this fuck!  I came to talk. Guess who wasn't in his cell? Imagine my surprise.  Beautiful how you played us. Getting yourself tossed into solitary --                  * pre-rigged with exits from all five               * cells. Whichever one we put you in, you had your bases covered. I thought I was such a bad-ass putting you down here. Turns out I was doing what you wanted.  Been thinking. If I'd done things differently -- made different decisions from the start -- we wouldn't have gotten to this point.  Here we are. Your decisions put us here too. This mess is on both of us.                       *  We can't change decisions we've made. We can only account for decisions we make from here. I know what mine will be. What about you? You gonna finish dialing that number, or what?  You looking to deal?  Okay, here's the deal. The deal is...there is no deal. I told you. No more deals with murderers. I'm sticking to that. That's my decision. It's what you                  * taught me. Strange as it sounds,                   * I'm grateful for the lesson.                       *  Your turn. You make the right decision, I'll see what I can do for you. But the wrong decision is one you'll have to live with the rest of your life.  Me too...  ...because like I said, it's a decision you'll have to live with the rest of your life. Which at this point I figure is... ...another 35 seconds.  Check mate.",
        "Rice": "",
        "Detective": "",
        "Garza": "I know this prick. I'm pretty sure                    * he's one of our C.I.s.  That's not the name he uses now.                    * But I'm pretty sure he's one of Bernstein's informants.  That's him. \"Wayne Dunlap.\"  We scored a lot of good intel off this fuckhead through the years. Almost a shame to bag the guy.  He's helped us put a lot of bad people behind bars. Look. Arrests, convictions...    Check this shit out.  Welcome to the county jail annex.                  * All new inmates come here. It was                  * in the papers.  Jesus Christ, man, dial it back...  Go around. I'll get us in back.  Keep the press off this floor, understand?  Wanna sit in?  Right...sorry.     Jesus Christ. What the fuck hit us?",
        "Mayor": "We're worldwide news this morning. Almost twenty dead, among them some of this country's top attorneys. I had friends in that room. Hell, I almost attended myself.  What you saw or think you saw is                   * beside the point. What matters is                  * that the FBI wanted to rendition                   * this man out of my city. The reason                * he's still here causing havoc is you. You wanted to prosecute this case. Your ambition kept him here                  * and provoked this tragedy.  Detective. Your job is hanging by a thread. I'd think a man of your experience would know when to keep his mouth shut and his ass covered.  When I go in front of the cameras today -- unlike some people who seem unwilling to do so when asked -- I'm going to make goddamn sure the media doesn't hang this abject disaster around my neck. Why? Because I'm hanging it on yours. You're done. Gone. Fired. Non- existent. Get the fuck out.  Thank you all for gathering on this solemn and anxious occasion...",
        "Kelly": "",
        "Sarah": "It's okay.  You're due upstairs in three minutes! You're gonna be late!  *  Okay. Um. You can take both men to trial, spend a year and millions of taxpayer dollars, and probably lose. Or you can cut a deal and at least put one of the men who did the crime on death row. It's a no-brainer.                      * You make the deal.                                    *  I'll avoid that.                                      *  There they are. Like clockwork.  Oh, Jesus.  Show them. The bad part.  The bad part. I was just on with the Governor's office. He commuted Rupert Ames' sentence. They were trying to call us to stop the execution. They couldn't get through.  I remember it too. Some things stick in your head.  He says he'll only talk to you.  I don't believe this guy.  Ten years he's been planning this?             * Patient people make me nervous. This? This freaks me out.                      *  How about outside help? That P.I. who helped us on the Jacovitz case?  Hey Kell! Hey Emma, how's my dynamo?  Who needs a life, right? Talk to your husband, maybe he'll give us a day off one of these years.    He's got no next-of-kin. No family                     * since his wife and daughter were                       * killed...  He's a tinkerer. Little inventions                     * and gizmos...  ...he holds two dozen patents that have made him a lot of money the last ten years. He's invested a lot of it in real estate. Weird stuff.  Properties with no real value. Around                  * airports, chemical plants. Stuff                       * nobody wants...  He votes. He gives money to charity, mostly victim's funds...  ...but he also gives a big chunk to macular research.  RPI. That's the charity you work with, isn't it?    Properties, investments, a few small                   * businesses he owns -- a lot of it's                    * hidden behind false names and shell                    * companies, but we're still digging...                  *  We boring you, Jameson? You got someplace to be?     We dug pretty deep for one night. Still got a ways to go, but on a first look? Nothing. Nada. Zip.  Due diligence. My middle name.                      *  ...tell Hansen we need hard info on those addresses...don't let the shell game on ownership title slow him down...at this point we'll take educated guesses...  Hey. Nice flowers. Thanks.  This place has great drugs. Damn. I should've totaled my leg long ago.  They're all dead?  It wasn't you. It was that son of a bitch. I hear he's threatened Jonas?          *  We got the latest batch of background in. Hansen and the other guy did some good work here--  This lists over fifty shit-value properties in industrial zones that nobody in their right mind would want to own -- stuff around chemical plants, factories. All are owned by Benson Clyde. Look at twenty-two.",
        "Lowell": "",
        "Bray": "",
        "Clyde": "...eyes...  ...her...eyes...  ...her eyes...she can't...  She can't...close her eyes.    When I found my wife and child dead, my little girl's eyes were open. The last thing she saw of this earth were the faces of the men who took her life. Can you understand that?  Can you? Really? You?  No? You married? Children?  My daughter was ten. I married late in life.  You, Mr. Price? Married? Kids?  Facts? Those men are guilty. Both of them. You know they are.  Maybe you just haven't tried hard                     * enough.  In return for immunity. So he gets away with it.  Yes. It counts for half. Don't reward one of the men who murdered my family. Please.  Ah. I see my mistake. I came for justice. Instead I got a system.  Sorry. My fault.  You took them from me.  Can't speak?  Tetrototoxin. Fascinating stuff. It paralyzes you, but leaves all other neurological functions intact.  That means you can't move. Or talk. But you can see. Hear. Feel. That last one's important. Feel. You can feel everything. Got some other items here. Drugs to revive you in case you pass out. Stuff like that.  Wearing off a little. No worries.  Oh. These. Don't want you bleeding out. This will take a while.     Earlier on the phone? I said I'd get you out? You asked me what it would cost? Well.  We'll start with an arm and a leg. Go from there.  I've been waiting to say that line                    * for years. But it wasn't very funny, was it? No. Played much better in my head. Maybe it's my delivery.  Gosh. My heart's beating. You?                        *  Yes.  Counselor.  Why so formal? We go way back. Call me Benson. Or Ben.  So. Maybe you can explain what this is all about.    Dunnigan. I thought I'd made it clear I would only speak to the gentleman across the table from me.  Darby? I knew about Ames, of course. I've been following the news about his horribly botched execution. But Darby too? Quite a coincidence.  Are you going to continue to insist on being part of this conversation?    I didn't know I had one. It's 150 acres, uncultivated. The other day I found a creek I never knew I had. Hunters trespass all the time. You going to try to pin the dead deer on me too?  It occurs to me that an even moderately clever person could try to frame me for the murder simply by killing him on my property. One of Darby's drug rivals? That's an unsavory world. A jury would have to weigh that possibility. What else you got?  That's odd. See, if I were to do such a thing, I'd probably wear something so I couldn't be identified. Some kind of mask maybe. But you say it's actually me on the video? Did the camera capture my good side?                                          *  No trouble here, Detective, we're fine. Thank you, though.  Your daughter is, what, ten now? That's a wonderful age. My daughter was always so busy at that age, so interested, so into everything. Jumping around. I called her \"Bean,\" she jumped around so much.  I am sorry, Nick, that your daughter experienced that. You're right. That video should not have arrived that way. The person who sent it should have thought twice.  Unless there's hard evidence tying me to these crimes -- forensic or otherwise -- why am I here? Why are we having this conversation?  It's not about what you know. It's about what you can prove in court. Your words. Like when you called it a justice system. You know the thing about a system, Nick? Any system can be played.  Clarence Darby did. And I'm much smarter than he was. Or you.    Or. Set me free.  Did I stutter? Make your case. Or. Shake my hand on the courthouse steps and send me on my way. I'll even make it easy on you. I will confess, how's that?  Let's start tomorrow after a good night's sleep. We'll all be fresh and rested.  I admit I expected something more modern. That jail downtown?                        *  Right. Prison crowding. It's a problem.  We'll get to that. First, what I'd really like to talk about is the cot in my cell. It's lumpy. Hardly any padding? Steel springs? Very uncomfortable?  Start with things I haven't done. Like get any sleep last night. I said let's begin today fresh and                * rested. You recall my words?                      *  A bed in my cell.  Yes, please. One of those Sleep- Matic adjustables. Those are best.                *  That would be nice.  I'm sure they have a wrench.                    *    My daughter can't have nightmares, because she died with Clarence                  * Darby's breath in her face. You                 * gave him a reduced sentence and his             * freedom. All I want is a good night's sleep.        I hacked the Fedex database, diverted the package to me, made the switch, sent the package on. It's automated tracking numbers moving millions of packages daily. Nobody's questioning who receives what, or why.  Get a phone company uniform, hack the prison database, schedule an official visit. They'll wave you through the gate, like they did me. It's simple if you know how things work. It's a system. You learn how it works. You play it. Any system.  Score.  *  I could tell. I love music. All of                   * it. It's like air in my lungs. So the thing about Clarence Darby is, I want my record collection and player brought to me. The vinyl discs as well as CDs.        I appreciate your compromise.    ...his penis with a box cutter. His skin with a filet knife. His teeth with pliers. His eyes...for those I used my fingers. Check the video I made. All that will match up. I kept him alive for an hour, give or take. Time it.  What now?  How about a signing bonus? The small concessions you've made so far have kept my cooperation flowing...why not give me a reward for signing?  Don't be such a hard-ass, Nick. I don't want much. Just a good meal. The food here? Sucks. No offense.  There's a place in town on Halston. La Traviata. Ever been?                            *  You know it, don't you, Nick?                      *  They cater. Tonight, at 7 p.m., I                  * would like my meal delivered to my cell from La Traviata. With nice silverware, crisp linens...  Why not?  C'mon, Nick. We've just started bargaining. You haven't even heard what I'm offering yet.  Miss Lowell? Is your laptop still on? Would you please do a search?  William...Baxter...Reynolds.  March of '06.  Detectives Dunnigan and Garza will like this offer, Nick. It'll clear one of their department's missing- persons files. And it'll solve them their third homicide this week.  How do you think I located Clarence Darby after he got out of jail and legally changed his name? Reynolds told me -- though it took some                       * convincing.                                          *  You want the location of the body? Tonight, 7 p.m., I get my meal                    * delivered to my cell from La Traviata.     GPS position is as follows...  Rack of lamb?  The guards will think me gauche.     I suppose if I don't share, you'll beat the shit out of me. Make me squeal like a piggy. That sort of thing.  I wonder what the little people are eating tonight?  I claim self-defense.  And, again, you'll have to prove that in court. As I've said before... ...make your case. Or set me free.    It would seem that way.  I'm seeing fire in your belly, Nick. I like it. Keep going. This is our deal, after all...        Cause and effect. Your actions                * provoke reactions. The choices you            * make come back to haunt you.                  * There are things I've set in motion.          * Dominoes that will fall. Didn't see           * the rack of lamb coming? Start a list. All I can do at this point...if I feel like it...is stop them from happening. Ready to talk deal?  See how insane you think this is. You're going to release me from this place with all charges dropped within twenty four hours...  Or I start killing everybody.  Clock's running, Nick.         You're up early. Trouble sleeping?  Amazing, isn't it? How primal that is. That pull? What a man is capable of when it comes to his family?                        *  I hope you never face what it is to                    * lose them, Nick. It's like dying yourself. There's nothing worse.  Good night, Nick.  Is it casual Friday? I've never seen you not wear a tie.  I want a phone in my cell. If I'm conducting my own defense, it would be useful. Also in case you and I need to be in touch, Nick.    How many more people die while you stand around dithering? How many do you get killed before my point starts sinking in?  I've been waiting for my explanation for ten years. So far...  If it hasn't dawned on you, this is a war. As in any war, there will be collateral damage. The question, as always, is how much damage you're willing to take before you withdraw.  Do it. It would be decisive. Stupid, but decisive. Can you handle the blowback, Detective? The \"shit like that?\"  I like rules. I've wanted you to follow them from the start. Like the one that says you prosecute a man who murders my family. So. Rules. A phone buys you another twelve hours. But if you haven't cut my deal and let me go by the deadline...  I'll kill someone in this room.  Eenie...meenie...miney...moe...  ...my mother...told me...to pick...a person...and that...person...is...  Interesting location you've chosen.  For what? A talk? Or... Maybe you've decided to take Detective Dunnigan's advice.    You have some kind of signal worked out? You scratch your nose and blam, I'm a goner?  Might solve all your problems. What's stopping you? Afraid of the blowback?  Ah. Nice. Good one.  Mercy. Right.  I think we've come a little too far for that, haven't we, Nick? I mean, what do I say? Sorry, my bad? Which way to the execution chamber?    I'd say you're making progress. You should have, you know. Prosecuted both.  With your head held high. And without any blame from me.  But she's okay -- good. Miss Lowell is a fine young woman. Oh, hey...your wife and little girl get out of town all right?  Just a guess. It's what I would do. Get 'em out, make sure they're safe. C'mon. Like I'd ever have hurt them anyway.  There are limits. Even in war. I may be many things, Nick. But I'm not Clarence Darby. I'm not Rupert Ames. I'm not that kind of monster.  Not the kind who'd hurt your wife and child. Christ, look at me. Mine were my salvation -- then they were killed -- and all I had left was this. Life without them in this fucking charnel-house world.  It hurt to lose them, didn't it? Your family. Even knowing they'd come back.  Imagine knowing they wouldn't.  Good. I envy you. For me, knowing                     * mine won't come back is the only thing that's crowded my thoughts for ten years. If I could take a rusty knife and cut out that part of my brain, I would.  Counselor. I have no doubt, as we stand here, that you really believe that. I wish I could. Are we done? You gonna scratch your nose, or can I go?     Hey. Some legal team from the mayor                 * showed up here this morning. I hear                 * you're off the case. Told you they'd                * scapegoat you, didn't I? Nick? You there?                                    *  Say you find a guy with a bad cocaine problem. Hungry ex-wives. Greedy mistress. Heavy gambling debts.                     *  Say that guy's a veterinarian. You                  * hand him a million in cash, he'll                   * do what you ask. Especially if he's                 * looking to blow town for good...  You own the vet, you own the dog. Explosive wasn't even that big. Stuff I use, it didn't have to be. Hidden in plain sight. That's my specialty. Haven't you figured that out yet?  What's next for you? Mulling career options? I suppose law is out.  Fair enough. I'll miss you Nick. It was a good dance.  Just warming up. This is Clausewitz shit, my friend. Total war.  I'm gonna pull the whole thing down. I will topple the gleaming pillars and drag the whole fucking diseased, corrupt temple down on my head. Stay tuned. It'll be Biblical.  Ted...had to get that vacation in. Visited my sister in the Keys...  Hey, what's all that hoopla at the main entrance?               Imagine mine.  That's how you play. Make the other guy think it's his idea. You came to talk, so talk.  But it happened. And here we are.  You want to hold hands? What's your point?  If I don't? What are you offering?  I'm willing to listen.  I'm sorry.                Well played.",
        "Shelton": "",
        "Bill": "",
        "Reynolds": "*  What are you asking her for? She's                      * just an intern.                                         *  *  Yes, your Honor. Defense approves.  You'll do a maximum of five years. With good behavior, you could be out in three.  Hellooo, kettle to pot. Since when do you shy away from publicity?  He's your boy too now. You tell him.  Dickwad.",
        "Warden": "Rupert Ames. Do you have anything to say?",
        "Iger": "Rupert Ames. Do you have anything to say?  We're still trying to sort through this thing.  Lethal injection is a series of drugs given in a specific order. Somebody had to have replaced one or more of those ingredients with something else. Industrial solvent? Acid?  We also have rules prohibiting                  * personal items such as beds.                    *  It's not just a bed. Every inmate               * here will be on the phone to their              * lawyer filing lawsuits for equal treatment. Can you justify that?                *  Vinyl records and CDs can be broken into shards. They make excellent weapons. My answer to that one, Mr. Clyde, is not no, but hell no.                       *  The player stays out here. You hand the remote to the on-duty guard every night at lights out. Those terms aren't negotiable.  You looking to get your ass kicked? By every inmate on this cellblock. You keep this up, they'll take it out on you. Harshly.  Just trying to keep you alive in here. That's all.  ...no plates, they break into nice jagged pieces...nothing sharp, nothing that can be made sharp...no forks, no knives, no spoons....lose that carafe...we will have no potential weapons of any kind this evening, thank you...you can eat with your fingers...  Idiot.  He killed his cellmate. We had to separate him out.  We don't have the authority. Not without a court order. This place was re-opened under protest as it is. Some areas are off-limits to our use -- tied up in a legal challenge by the ACLU as cruel and unusual. Especially solitary. It was nicknamed the dungeon...  Nice trick with the rack of lamb. Didn't see that one coming.  You'll have it all to yourself -- the first man down there in over twenty years. Quite an achievement.  Everybody back to sleep.  Well, that's good news.  Jesus.                                                 * Thank God that wing was empty.                         *  How do I explain this to the city?",
        "Jonas": "",
        "Cantrell": "Mr. Clyde. I don't see this helping.  Divorced. I have a son and daughter. Both in college.  Things have gone against us. Tainted crime scene, evidence thrown out...  The other man doesn't. He'll go down for the crime. That has to count for something.  It's your decision.  Young lady. Someday you might have our jobs. You know the issues of                      * the case before the court. Speak.  When the day comes that you argue a real case in court, you might refrain from summing up with \"duh.\"  State also approves, your Honor.  I'm not blind. Yet. I'll do it.  No. She needs to imprint on me. Not you, not somebody else.  That's the whole point of this phase. She needs to get the idea that she and I are partners. Then the real training can begin. Unless you wanna lead me around the rest of my life.  Bill! You let all your clients give testimony on the courthouse steps?  Fuckface.  Long as nobody bumps into me.  Till the stitches heal. Week or two.  What's going on? Nick?  Nick, goddamn it, what?  Gentlemen, we face a terrible shitstorm of scrutiny in the days to come. We need answers. Start with what we know.  How could the chemicals be switched? We're in a goddamn prison!                           *  Oh, fuck me. Fuck me.  Is that necessary?  That man is frosty.  Agreed, but softly. Nothing hard- ass, no grand-standing. Kid gloves.  Depending on who's writing the headline, he's a grieving husband and father who got revenge on the men who murdered his wife and child. Public sympathy is to be respected and feared. This could blow up in our faces if we're not careful. We can't look like we're pissed off or have an ax to grind. Are we pissed off? Do we have an ax to grind?  Then stop acting like it.  Nick.  I can justify the expense.                      *  We're talking a high-profile double homicide. Order the bed.  Clarence Darby's defense attorney. He brokered the testimony deal with us ten years ago. He's been missing now since...  Weird how?    Huh. Strange.  What's wrong with solitary?  Which makes it premeditated. Again.  Let's not mistake this! This is not about the two of you!  What can he do? We've got him boxed in. He's isolated, for God's sake.        Motherfucker! Whatever point you had was lost long ago! Eight kids dead in that yard, most of them just out of college! Eight! I have to talk to their families. I have to try to explain why their loved ones are dead.  Who's he pointing at?  Fuck him. Let him try.    Shit. I'll be in front of a room full of lawyers. The A.B.A. dinner. I'm the keynote speaker.  That's last minute.      Nick? These guys won't even let me pack a bag. Not even a toothbrush.  Who? Who could he have?  Him? No--why would Clyde let him come talk to us?  I--I don't know...    I don't remember! You track your            * use of ice, Nick? You keep a daily          * log?  Nice?  Fellas... I'm grateful for all your efforts. I just wanted to say it.  Where are you going?      Who's winning?  If I had my Braille set, I'd clean you out. Not much of a game if you have to tell me what my cards are.  People forget. No worries. Enjoy your game, fellas.  I'm good. Unfamiliar places take me a little longer. But I get there.          How long, man, I'm starving...     It's okay. It's gonna be okay.      There. That's better.",
        "Dunnigan": "Let's not guess, let forensics do its job.  Some kind of bypass on the phone                     * lines.  Twenty minutes before the execution,                 * the prison stopped receiving incoming calls and emails. Cell service went                  * dark too. Signal was probably jammed.  The Governor's incoming number triggered this device and shut out any further calls.  One more thing.                                       *  This mean anything to you?                            *  \"His tongue will wag in hell.\" Those very words? It was ten years ago.  You think, or you know?  Okay, raise Bernstein, I want everything he's got, including an address. We roll with tactical.  Is that Clarence Darby?  Jesus, look at this. No wonder Bernstein loves him.  Isn't that what you did ten years ago? Give this guy a free pass in return for a conviction? Maybe we played this asshole to our advantage on the street, but you're the one who put him there. So, no offense, but you might wanna go fuck yourself a little.   No way he's getting out of this neighborhood.     Yeah, we know. Nick, we know. The body's been found. The pieces, anyway. Call just came in. In some old shed on a farm outside                     * the city. About a hundred and fifty acre piece of property.  Benson Clyde. You have the right to remain silent...  ...understand your rights as I have explained them?   You murdered two people. Rupert Ames and Clarence Darby.  Dunnigan.  Cut the shit. We know you did it. Save everybody a lot of time and trouble and just confess.  Yes.  Whoa-whoa, Nick, ease off!  Okay, enough.    Is he serious about confessing?                * What's his deal, is he crazy?  It's a steel cot! It's bolted to                  * the wall!                                         *  What do you have in mind?  It's a little above my pay grade.  Who's William Reynolds?    That is correct, Agent Davies.  You think it was a bluff?                              *  It used to be a Sleep-Matic adjustable bed. Now it's not.  Love it when they cry wolf.    He could have planted those bombs a month ago.  Maybe I got a better idea. Maybe we end this war right now. Fourteen people dead! I have to say                  * this out loud? Prisoners die in custody all the time. Attacking a guard. Trying to escape. Shit like that.  Don't tempt me.    Buys us another twelve hours, we could use that right now. That puts the deadline at... ...about 7:30 tonight.  Until his deadline passes, you're in protective custody. Not negotiable.  This way, Mr. Cantrell. Garza, you're with Mr. Price.  It would be a Clyde move. But it's          * not proof. Could he have planted this stuff in         * your house before he was arrested?  It's the presidential suite. Last person who stayed here was actually a president. Of a country. Security here is amazing.  I'll try to wrangle additional                      * manpower. Big job.                                  *      Nick? Jesus... Look. No hard feelings, but there is no \"we.\" You're radioactive. I                      * can't even be seen talking to you...  All units. Subject vehicle is on the move.  Everybody maintain distance.        Five and six, stick with that building in case he's trying to cowboy us. All other units, stay with the van...     What floor?  I hope you know what the fuck you're doing. Negative. We're letting him go. All units hang back. Repeat. We are letting the subject go.  What? C-4?                                           *    No? What the fuck are you talking about, this could go off any second!  I will not take that risk!  Okay, Nick. What's the move?  I think the Mayor will have your back."
    },
    "imdb_rating": "7.4",
    "description": "Clyde Shelton's family is brutally murdered. The ones responsible are caught. However, because of improper procedure, the D.A., Nick Rice only has circumstantial evidence. So he decides to get one of them to testify against the other. When Shelton learns of this, he is not happy. Ten years later, the one who was convicted is being executed but something goes wrong; his execution goes awry and he suffers. They learn that someone tampered with the machine. And the other one is found dead, killed in a gruesome manner. Rice suspects Shelton, so he has him picked up. At first, Shelton agrees to a plea agreement with Rice but changes his mind. It appears that Shelton is not done, it appears he blames the whole system and is declaring war on it going after everyone involved with his family's case. So Rice has to stop him but Shelton is way ahead of him.—rcs0411@yahoo.com",
    "name": "Law Abiding Citizen",
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BODY5MWNlNWYtM2VlZC00ZWM5LWJhOWYtYzhjMjIzZjc5MDg0XkEyXkFqcGdeQXVyNDI3NjU1NzQ@._V1_QL75_UY281_CR3,0,190,281_.jpg"
}