{
    "filename": "Legion_script.txt",
    "imdb_id": "tt1038686",
    "imdb_url": "https://www.imdb.com/title/tt1038686",
    "characters": [
        "Gladys Foster",
        "Percy Walker",
        "Bob Hanson",
        "Michael",
        "Audrey Anderson",
        "Sandra Anderson",
        "Burton",
        "Estevez",
        "Jeep Hanson",
        "Ice Cream Man",
        "Howard Anderson",
        "Minivan Boy",
        "Gabriel",
        "Kyle Williams",
        "Charlie"
    ],
    "dialogues": {
        "Gladys": "What a nice young couple you are. What brings you out to these parts?  Oh, what a nuisance.  Oh, don't worry yourself about that, sweetheart. It'll all be over soon.  Thank you, dear. How far along are you?  The father must be very proud.  You mean he's...  Oh, I see.     So you're not married, I take it?  That's too bad.  But what about the baby?  Yeah, but it's gonna burn.    All those babies.    They're gonna burn.  Shut up, you stupid fucking cunt! All you do is complain! Complain! Complain!    You're all going to fucking die!    Its windows are completely caked with dust. The men WIPE AWAY a layer of brown from the glass, allowing them to peer inside the car.",
        "Foster": "",
        "Percy": "Lord as my witness, Bob, one of these days that thing's gonna hit you back.  Yeah, they got names for that kind a relationship.  I told you to get the satellite TV. But you don't wanna listen.  History Channel, man!  Nice work, Bob. What the hell's that?  Lot a folks could be hurt.  There ain't no radiation comin' from those things. Plus that don't explain the radio being out too. Some of those stations broadcast over hundreds of miles. Any quake that big and we would a felt it.  Shoot her, Jeep!    Seventy, maybe eighty miles.  To get my bible!  Well somebody's gotta start prayin'...  (raises a bottle of  Now, son, I'm sure you don't wanna go spillin' blood for no good reason in front of all these decent people, do ya? Our friend Bob here ain't worth the trouble it'd cause ya. So whaddya say `bout just lettin' `im go and then you can be on your way? Nice `n' easy.  Lord, have mercy.  Everybody just stay still!  Listen!  You hear what I'm hearing?  It sounds almost like...  The fuck y'all lookin' at me for?  Bob!    Come on, motherfuckers!   Come on!  You sayin' this is the Apocalypse...?    C'mon, Bob. Have you looked outside recently? Those aren't exactly our regular customers out there.  Makes you wonder about Mary.  They're out there. Sons of bitches. I can feel `em. Damn it's cold!  Navy, two tours. But the second one didn't work out so well, so I didn't get to go back for a third. Suppose that makes me lucky in a way. Served with Bob, you know. That's how I ended up in this place.  Dark.   Like this.  So what's with that gun?  Your piece. The one you killed grandma with. Don't reckon it's for huntin' buck.  Protection from what?  People.  Just regular people or uh...  Irregular people then.  So it's a work thing, is it?  This business of yours... You like it?  When I was a kid my father would sit by my bed every night before I'd go to sleep and he'd say to me, Percy, if you don't wake up tomorrow, if it turns out that today was your last day on earth, would you be proud of what you've done in this life? Cuz if you ain't, then you better start gettin' square.",
        "Walker": "",
        "Bob": "Whaddya talkin' about, Percy? We got a special relationship here.  Where ya been, Charlie?  This ain't a resort you know.    I got orders stacking up here.  (sees the two cigarettes  What?   I quit two years ago.  It was a gift from my ex-wife, alright? I'm sentimental. I don't wanna forget how much I hate her guts.  Goddamn it. Where the hell is Jeep?  Hey, Leonardo...!  The fact that this truck's hood's up mean anything to you?  (approaches, peering past  Whaddya workin' on that's so goddamn important you're not doin' your job?  Whaddya doin'?  Jeep, I like Charlie. I do. And I think it's real good of you to lend her a helping hand, but she is not your responsibility.  Don't walk away from me while I'm talkin' to you!  How long you gonna follow her around like a puppy dog? Cleanin' up the messes she makes while she steps out with every guy around here other than you?!  You really think she's gonna stick around here after that baby's born and off her hands?  (points up at the PARADISE    Yeah, I can. And I'm sayin' you're about to make the same damn mistake I made, believing in something that's never gonna happen...Or someone. It's time for you to move on from this place, Jeep. I don't wanna see you wake up one morning old and pissed off, realizing you're lost just like everybody else who stops here.  Now get to work on that truck. I wanna have these people on the road by nightfall.  (holding up a silencing  What's wrong with you today?  What the hell do I need that crap for?  I got all the history I can take.  What's your problem now?  You know this was the top-of-the- line model when I bought it.  You shouldn't be watchin' anyways. Okay, baby, this is gonna do it.  See?   Clear as day.  It's just one of those test things.  In the back past the kitchen.   Make it fast.  Hey, Percy, give that old radio of yours a shot. Maybe they got some news about the TV.  Not if it was centered in the desert.  Yeah, `cause of the radiation they give off.  Well, for cryin' out loud. There's no use in speculating. I'll just call my brother up in Needles. He must a heard something.  Whaddya talkin' about?  You're shittin' me.  Relax, Mrs. Anderson. Nothing to get excited about. Probably just working on the lines.  Sides, I'm sure Jeep'll have your truck fixed up quick as can be, and then you'll be on your way.  (glances over at the  That's not gonna happen.    Goddamn phone's out.  What happened?  Don't move!  (struggles to cock the  The fuck was that?!   What the fuck was that!?  I don't understand how she was still standin' after Percy hit `er with that goddamn fryin' pan. Broke her fuckin' neck. I saw it. I swear I did. And did you see that kid's gun? The hell's he doin' with a gun like that?  It's okay, Jeep.   It's okay.  There's nothin' to be ashamed of, Jeep. Not everybody can play the hero.  (catching Percy by the  The hell you need that for?!  She's cold as a freakin' ice cube. If I hadn't just seen her walk in here, I'd say the old bag's been dead for hours.  I don't get it.    Why don't they come closer?  You see anything?  Careful. Old lady could have some kind of rabid poodle locked up in there.  Jesus.  Least now we know where that smell was coming from.  Okay, now we're talkin'.  Give me the shotgun.  Take one step closer and I'll drop you right here.  Mister, after what we've been through here today, you're lucky we didn't shoot you first and greet you later. Now let me see your teeth.  Your teeth goddamn it!       Lemme see `em!  Okay... Suppose you tell us your name then.  Sorry about all that, Michael. This old lady just went crazy inside my place here. She had these teeth. Never seen anything like `em. Practically bit a man in half.  So what are you doin' out here? Gotta say you don't exactly look like a police officer. Even one from L.A. Then again, you have to be, right? I mean, who the hell'd be crazy enough to steal a cop car?  Back off, fella... Now, I don't care if this is the second coming of Jesus fucking Christ, I say it's time for you to either get talkin' or get the hell outta here!  Wait. I don't think that's such a good idea.    C'mon, Jeep. We gotta go!  Jeep, get the flashlights!  Alright, Rambo. You got us up here. Now you mind explaining what the fuck we're fighting?  Yeah...The hell is that?  Shells!  Fuck!    Gun!  (jamming the gun in her  Pull me up!  Hold on.  Right and yesterday I was the fuckin' Easter Bunny. You know, fuck this. I don't even believe in God.  How do we know he didn't bring them here himself?  Wait a minute, isn't Mary supposed to be a vi--  On the house.  You hungry?  Well I figure just cuz the world's coming to an end, it doesn't mean a man's gotta starve. All I can say is thank heavens they left the gas on.  Just gimme another minute with him, okay?  What the hell are you talkin' about? This is our chance!  We back in business?  Jesus Christ, what the hell is that boy doin'!  Damn it all to hell!  (pulling Charlie away from  Where the fuck is he?!  What the fuck?  Bob flails around trying to pull the boy's small, but deadly strong arms away from his neck.  What a way to bring a child into the world. She ever tell you his name?  Jeep, sooner or later she'll realize you're the best thing that's ever happened to her.  Can't a father be wrong sometimes?  I'm sorry Jeep. This shouldn't be happening to you...  Who?  Don't do it, lady!  Sonuvabitch!  Leave me, Jeep.     My place is here, remember?  Run.  Sorry...   We're closed.",
        "Hanson": "Bolts awake.   Breathing hard.   Covered with sweat.",
        "Michael": "ALLEY WAY. And then SILENCE...    I'm following my own orders now.  Charlie freezes a few feet from the car when she sees those piercing eyes already familiar to us. Michael looks at her, as if she was exactly who he expected to see. In moments Bob, Kyle and Jeep form a protective shield in front of Charlie. Bob raises the shotgun.  That how you greet all your customers?  Michael.  You don't know, do you?  I'm running out of time.  They're here.  You're going to need this.  He can handle it. He doesn't have a choice.  If you want to live, you'll do exactly as I say.  When you fire, you keep your thumb off the slide. Don't hesitate. Don't do anything brave. There's no safety.  Alright. There's a safety switch on the side of your gun. Push it all the way down. Two clicks.  Now when this starts, you hold on tight, you hear me? If you don't, you're going to blow your hand off. Understand?  Get ready!  Now!   Shoot now!  Spread out! Don't let them get close to the windows!  No...     Not anymore.  I told you not to do anything brave.  Someone needs to be on the roof.  The first time God lost faith in Man he sent a flood. The second time...he sent what you see outside.  I'm saying this is an extermination. Those things out there are vessels. The Possessed. The weakest willed are the easiest to turn.  No...by angels.  That's where your book is wrong.  I know because until last night, I was on their side.  Not anymore...  That's fine, because He doesn't believe in you either.  Not you... Her.  Because your child is the only hope humanity has of surviving.  Exactly.  None of that matters anymore. Either your child lives or Mankind dies.  That's right.  We won't have to...  If you want to live you'll do what I say. This first attack was a test of our strength. The next one will be a test of our weakness. Something much worse is on its way.  We'll keep watch on the roof in shifts of two. Jeep, go get some tools. We need to close up this window before somebody else goes out.  I was a soldier, a general, in His army.  I was given an order I didn't believe in... He lost faith. I hadn't.  Sometimes we have to face the thing we fear the most in order to be free of it.  It's almost time for the next shift.  No.    We're not going anywhere.  We can't risk being on the move when the child comes. It's too dangerous.  I don't think so.  Don't. You open that door and we could all be dead.  Wait.    Come with me.  Run.  Are you hurt?  Get ready!  Just do as I say.  He's coming. We have to hurry.  Charlie, I need you to push. I need you to push as hard as you can.  We're almost there...  Take him... Give her a minute.  No. Killing the child would have ended the war before it had begun. Now, at least, he will have a chance to grow up, a chance to lead the world out of darkness.  You'll need to teach him how.  Each of us has a burden. This one is yours and yours alone. Maybe someday you'll understand what that means.  The Possessed can't come near the child, so He sent someone that can. Someone like me.  Gabriel. My lieutenant.      He's come to do what I wouldn't.  There was never meant to be a Second Coming. But we've just changed that. The child lives. The future is unwritten. There's still hope.  No, Jeep! You must protect the child now!  My path ends here. You are the true protector. You always have been.  Find the Prophets.   Learn to read the instructions.  I knew he'd send you, Gabriel. You were always so eager to please Him.  To not feel their burden...is a dream.  The child lives. What happens to me doesn't matter now.",
        "Audrey": "Yeah, that's cuz I woke up hoping to get double teamed by a couple of meth head truckers in the bathroom of some desert shithole. Good thing we stopped here.  Maybe it's a terrorist attack or something...?  What's that on the road?  Not clouds. Clouds don't buzz.  Shut up, mom!  Mom!   Open your eyes!  Daddy!  Daddy!  So you're here to protect us?  Mom!  Hey...  Hey! You guys, I think I got something here!  Does that mean we can leave?  Yeah, I got it. All the way down. Two clicks.  Dated this guy last summer. A marine. Had a thing for guns. Parents hated him.  My parents hate everything I do. That's why we were moving.  They thought a more \"wholesome\" environment would help me \"change my ways.\" So fucked up. Only reason they care at all is cuz they don't want to be embarrassed in front of their friends at the country club.  What?  Is it over?  No, I can handle it.  Kyle, are they...  Hey! Get back in your car!      It's a trap!  They're not gonna make it.    Kyle!  Kyle!  Fuck you!  What am I supposed to do? Just `cause I'm a girl doesn't mean I automatically know how to do this!  Yeah, but, how do you know how to do this?!  What is that?!  Who's coming? Whaddya mean hurry? This isn't something you can exactly hurry, is it?  Michael, who's coming?!  Oh my god...we did it!    Charlie, you did it!     It's okay...It's okay...Shhh...  Mama? Can you hear me? We did it...The baby's alive.      Sandra backs away from them, moving toward the front door. Hers is the face of madness.     Mom!    I can try.  Go faster!  I can't believe it.   Is it really over...?  We're here.  Jeep!  Get off her, you fucking asshole!  Do it, Jeep! Do it now!",
        "Anderson": "Ah, shit. They're gonna be pissed.",
        "Sandra": "It's disgusting.  Really, how can she go out in public wearing that?  Howard, don't. You'll embarrass me.  I'm being punished for something, I know it.  If there's a real emergency aren't they supposed to give us some information about what to do?  So then why's the TV out?    Oh, this is just great.  Nice to meet you, Gladys. I'm Sandra and this is my husband Howard.  We're moving out to Scottsdale. But our truck broke down, and so we're stuck here while it's being fixed.  Say, Gladys, it seems the lines are down around here. The phone and TV, you know?  And I just was wondering if you might have heard something on your way up? You know, about what's going on?  Gladys, please. There's no reason to --  Howard, it's okay!     Don't listen to her!  Somebody help me!  You ladies best get back inside.  What is it? What's happening? Who is this man? Why's he driving a police car?  It's okay!     Everything's okay!  I can't!   I can't!  (springing after her  No!  Howard!  Let me go!     He's alive!  He's alive!  How come you know so much about them?  How are we supposed to survive here for a month?  Thanks.  Couldn't eat if my life depended on it.  Never much cared for beer. Howard's the beer drinker in the family.  Howard?  Who's there?  Howard?     Is that you?  Howard. Her husband. Ten feet away from the door.     NAILED  Howard!  Let me go!     He's alive!  Howard!  Catatonic.     Stay away from me!    Don't come any closer!  You heard what he said. They just want the baby. Maybe if we just give it to them, then they'll let us go!  Why?! You never wanted him in the first place!  It's just one baby.   Just one.",
        "Burton": "Goddamn' animals. Nights like this I wish I could take a match to this city just so I could watch all these motherfuckers burn.  A fresh start. That's what this place needs.  Pow!   Pow!     Pow!  Shut the fuck up and drop the bags now!  Turn around! Turn the fuck around!  Let `em go!  I said let `em fuckin' g-g-g-g--  What are you doing, Michael?   These weren't your orders.  Then you will die along with the child.",
        "Estevez": "Jesus... You know Burton, I'm so happy we get to share beautiful moments like this. They really brighten my da--  Freeze!  Drop the bags! Hands on your head!  Hands on your head!    On your head!  Take the shot, Burton!  Burton!?  What did you say?  Burton, you fuckin' know this guy?!",
        "Jeep": "Bolts awake.   Breathing hard.   Covered with sweat.       Sorry to wake you, Charlie.  You're the only thing I like worrying about.  Go ahead, make fun of me. Everybody else does.  So you're still going through with it...?  I could help you. We could do it together, you know? I want to.  Go on.   I'll be right there.  You okay, Charlie?  Yeah...  Nothin'...  Found it under a bunch of stuff in the storage shed. I know you never like to throw anything away...  What...?  (heard this before, pushes  Don't say that about her!     She's not like that!  Look, I know it doesn't make any sense to you, but it's just something I have to do.  C'mon Dad. You can't blame yourself for what she did--  Damn it!  The carburetor's shot.    Don't know why. Looks brand new.  I could try to rebuild it, but it'd take a while, and I don't think we have all the parts. If we call right now, we might be able to get a new one down here tomorrow morning.  What?  I couldn't pull the trigger. I froze. I saw what I needed to do, but I was afraid... She could've killed you!  Or Charlie...She would've killed me if it wasn't for...    How `bout the trunk?  (sees something up the  Wait a minute. Check it out. It's LAPD. What's an LA cop doing way out here?  Charlie, wait!  No, shark teeth, Pop.  C'mon, Dad, tell `em you're sorry. Tell `em you were only kidding!  Dad, I can handle it.  I said, I can handle it!  Fuck it.  Where is it?!  You mean you're...  You're sayin' she's the mother of the Messiah?  What did you do...you know, before you came here...?  Well, what changed?   What made you leave?  So what happens to you...after this is over?  We should get back out there...  Red Rock...  Guess it's your turn not to sleep.  You okay?  You shouldn't say things like that, Charlie. It isn't right. You'll get through this. I know you will.  You know, you're not the only who's suffered, okay? Let me know when you stop feeling sorry for yourself.  He's still in here!  He's bleeding!  Dad!  She's never said. I just assumed it was Joe Danvers. You know how she's always had a thing for bad boys.  I thought you said I should move on?  What was that...?  We're not gonna make it outta here, are we?  Something's happening.    They're moving away.  Your orders...  You were the one who was supposed to kill the baby? That was the order you didn't obey.  No!  Me?!   What about you?  But I don't know what to do!  Prophets? What Prophets?   What instructions?!  C'mon!  We have no choice!    We have to get to Red Rock!  Dad!  But Dad...!  I'm trying!  Fuck!  (throwing the car in  Okay, we need to figure out our weapon situation.   Hopefully Michael didn't take everything out of the car.  Yes. Now just put it down... Slowly.  Okay. Okay. Handgun. Shotgun. A a flare gun... And a grenade. Alright. Load this. Audrey, can you figure out how to load that flare gun without killing us all?  Try real hard, okay?  I can't fuckin' see!  Oh, no.  The instructions...  Thank you...  Oh, shit!  No...It's just starting...  Better not hold him too long. Might get attached.  Nothin' to be sorry about. It's true. I did follow you around. At least now I know there was a good reason.  Okay, all we gotta do is --  Duck!  Audrey, the flare gun!  Get down on the floor!    The baby?  And what about...     What?  C'mon, we're almost there.  Charlie, no!  We made it.  Taking it in.     Breathing hard.  I'm sure they're just over the next ridge.  Don't be afraid.    We'll be okay. Believe me.",
        "Howard": "You're right. It is disgusting.  I don't know. Why don't we just ask her?  (shouting across the  I feel satisfied with that answer. I really do.  Excuse me...?  Any news about when our truck might be fixed? You said your boy would have us on the road two hours ago. The rate we're going, we'll be lucky to make it to Scottsdale by Christmas.  I'm sure it's a mistake.  Maybe there was an earthquake?  They keep sayin' we're overdue for a big one.  Exactly.    Could be nothing to worry about.  Maybe it just hit the relay stations. Aren't those usually in remote areas?  Who the hell do you think you are, lady?! Now, I'd like you to apologize to my --    Sandra?    What's happening?  Oh, honey, listen.    It's the Ice Cream Man.    Help me, please!",
        "Minivan": "",
        "Boy": "Mister...     I'm sorry!     I didn't mean to!  You're gonna die now.  C'mon, don't be scared. I just wanna play with your baby.",
        "Gabriel": "Unlike you...the rebellious son. Pity about your wings. They would have helped you now.  You think you can defy Him and not pay the price?  Yours is a fool's sacrifice. You can help them sneak out the back door, but they won't escape. And neither will you, brother.  There is no other way...  You always wanted to live like one of them...Now you'll know how it feels to die like one of them.      Charlie screams! Jeep pushes her and the baby out of the way just as Gabriel comes down hard in front of them, kicking up a cloud of dust. Gabriel's mechanical wings haltingly retract. The crash has done some serious damage. Much of his skin has burned away. Chunks of his armor and flesh are missing as well, including a large part of his head, revealing that under his human visage is a NIGHTMARISH CREATURE. Gabriel charges at Jeep fast. Jeep whips up his Glock, BLAM! Gabriel takes the bullet, then slaps the gun out of Jeep's hand. Jeep throws a wild punch, connects with Gabriel's chin, rocking him back. More annoyed than surprised, Gabriel knocks Jeep savagely to the ground. Jeep struggles quickly to his feet, comes right back at Gabriel swinging. But Gabriel simply knocks him to the dirt again. Jeep slowly gets up once more, bleeding, hurt.   Raises his fists. This kid will simply not give up. Jeep moves in again, swinging hard, but Gabriel blocks it, shoots out a hand and grabs Jeep by throat, lifting him clear off the ground.  So brave. So pointless. You should have worried more about saving yourself.  Go to sleep...  \"And as the child's cries are extinguished, an eternal darkness at last descended upon the world.\"  The creature is gone at last. The sound of a BABY COOING. Charlie picks the child up out of the brush. She helps Jeep to his feet and together they slowly make their way to the top of the ridge.",
        "Kyle": "Shit...  Darren, your fuckin' directions suck, man.  Hey...  You know that shit right there ain't good for the baby.  Now hold on, girl, let me bum one before you do.  Tell ya what. You let me have one of yours, and I'll give you two from the new pack you're gonna sell me.  Am I in the right place?  Sonuvabitch. There another phone around here? You know, one that works?  I can handle that.   You got pancakes here?  Three seventy-five, huh?  If I can smoke `em, I'll take `em.  Hey man?  Can I use your phone? My cell doesn't get a signal out here and the pay phone outside is busted.  Yo, am I the Invisible motherfuckin' Man here?    Do you have a phone or not?  Let me talk to him...    (strange STATIC can be  What the hell...  I don't think so.  Phone's dead. Just tried to make a call.  Press your hands over the hole!  Don't look at me like that, lady! I'm tryin' to fuckin' help you! Now put your goddamn hands over the hole before your husband bleeds to death!  How far to the hospital?  They're fuckin' clouds!   What the fuck do they look like?  Well, I don't care how long she's been dead, the bitch ain't stayin' in here with us.  How the fuck am I supposed to know, man? You askin' me to explain the behavior of a motherfuckin' pestilence.  No Twilight Zone shit if that's what you mean.  Agh!   What the fuck is that?  Nothin' here.  Bitch's got motherfuckin' dead cats in her hoopty! What the fuck is wrong with white people?!  Yeah, it was a real motherfuckin' necessity we figured that out, man.  I'm from Nevada, man.  Know what?  Easy!   Easy!  What the--?  Now that we're locked in here, what the fuck are we supposed to do?  Where the hell did they go?  Ice cream.  You've got to be fuckin' kidding me.     Oh, shit.     Oh, shit.   Oh, shit.  Is that it?  They're running!      We got `em!  We got `em runnin'!  Where's Howard?  I'll go.  Possessed by what?    Demons?  So what, we're supposed to just hold those things off until Mary over there squeezes one out?  Oh we're fucked.     We are so fucked!  Okay, what's your plan?  You were in the Army?  What was it like?    Being in a war?  What?  No. I uh -- keep it for protection.  From people.  Yeah, people who might try to give me a hard time, you know?  Yeah, well, no, not regular, regular people.  I'm talkin' people whose job it is to give other people a hard time. Kinda person who doesn't get enough fiber in their diet, you know what I'm sayin?  Exactly.    Strictly business.  Who the fuck are you to be sweatin' me, man? I got my reasons for doin' what I do.  ...Then you just flip this --  I bet they did.  Yeah?  The only time my old man ever paid attention to me was when I was doing somethin' bad. So you know what I did?  I got really good at being bad.  I don't know.      Get ready.    It's a trap. They saw them coming and turned on the lights. It's a fucking trap!  Hey! Get back in your car!      It's a trap!  I got you!  Kyle drops to his knees. Up on the roof, Audrey watches helplessly as Kyle falls.",
        "Williams": "",
        "Charlie": "You okay, Jeep?  (stepping out of the  Another bad dream?  It's just stress, Jeep, that's all. You do too much worryin'. About this place. About your dad. About me...  See what I mean? You're worried about a girl eight months pregnant and it isn't even your baby. Now that's enough to give anybody nightmares.    Jeep, I'm not ready to be a mama. Christ, I can barely take care of myself as it is.  You gotta stop carryin' the weight of the world on your shoulders.    Guess I should think `bout quittin' then.  You can buy a whole pack inside.    Bob'll probably let you use the diner phone if you ask him real nice...And pay `im somethin'.  Yeah, we got a buttermilk stack for three seventy-five. We also got french toast for four dollars if you're into that. I personally like the pancakes though.  Yeah, I'm okay. This guy's just lost.  I hope Salem Lights are okay, `cause that's all we got left.    Yeah, so why you still carryin' that fancy lighter `round for?  That's for sure.  Where do I start?  Yeah, in the Fifties.  Don't look like a test.  Percy's right. I didn't feel nothing.  Have a seat wherever you want, Ma'am. Specials are on the board.  Okay, what'll it be?  And how'd you like that cooked?  Coming right up.  Yeah.  So they say. I'll be right back with your water.  Just about there.  I wouldn't know.  Out of sight. Out of mind.  Nope.  No, I prefer it that way. I don't a need a man tellin' me what to do.  I've got it under control.  What did you just say?  Go to hell, lady.  Total fucking Jesus freak.  (nods, peakish, to  Oh, thank God, the police!  We don't know anything. Nothing's working here. The TV, the radio, the phone...  Let `em go!  Charlie screams as she's yanked painfully toward the window, losing her grip on Howard's belt. Through the broken window, she sees the face of a RAGGEDY LOOKING MAN. He smiles at her like a father coming home to his baby girl.     Thanks...  He brings them here and then he saves us from them? You're a genius, Bob.  Me?!   Why me?!  No way!     Go fuck yourself, Bob!  (approaches Michael, panic   That can't be. I'm only eight months pregnant.  It's coming soon, isn't it?  Percy?  That can't be more than an hour up the highway from here.  Hey...  You mean besides the fact that I just found out that I'm the mother of the Messiah?  Crazy thing is...I didn't want this baby. I even went down to the clinic, you know that? I remember sitting there in the waiting room, absolutely sure I was doin' the right thing...And that's when the feeling started. Like I was falling into the deepest, darkest hole imaginable. I couldn't breathe, I couldn't speak. I kept thinking this must be what death is like. And when finally they called my name, I ran. For a while after that I tried pretending that it was just cold feet, that I could go back if I wanted to, that I could decide to end it like I'd planned. Then I'd start to have that feeling again and I knew I didn't have a choice. Somehow this had already been decided. And it made me hate this thing that's been growing inside me.  How come you have so much faith in me, Jeep? God knows I've never given you or anybody else a reason to. Or is it that you just can't find any other hard-luck case to follow around?  We have to get `im back in here!  Oh, no.   Audrey...  Do you have no heart?!     She's just a kid!  You can't let her die!  Michael!  I'll get some water!  Where is he?!  Oh, no!  I don't...I...  So are we safe now?   Is it over?  And what happens until then...?  What makes you think I can do that? What makes you think I want to do that? If he's so important, why don't you take him?  What's he talking about?  Michael, what the hell's he talking about?!  Audrey...?  Give him to me!  No...   I...  Wait!     We can't leave him!  Come on, Jeep!  Is this what I think it is?  Jeep, your arm!  What is it?  The swarm, it's fading!  Look, I'm sorry for what I said to you earlier, `bout you following me around. I didn't mean it.  C'mon, Jeep!  Jeep!  Alive.  Nothing could have survived that.  She saved us, Jeep. Audrey saved us. Now c'mon, we gotta go!  How can this happen?  How can this happen in a world so beautiful?  Stop!   Please! Don't kill him!  Stop it!   I'LL GIVE YOU THE BABY!  I don't want this responsibility!  Yep, we sure did.  Taking it in.     Breathing hard.  What if we're on our own now?    Someday when my son is older, I will tell him about the time of his birth when all the world was covered in a great darkness...  ... And how just at the moment when everything seemed lost...  ...a mighty warrior fell in order to save me.  And a boy faced his fear and rose up to save us all."
    },
    "imdb_rating": "5.3",
    "description": "An out-of-the-way diner becomes the unlikely battleground for the survival of the human race. When God loses faith in humankind, he sends his legion of angels to bring on the Apocalypse. Humanity's only hope lies in a group of strangers trapped in a desert diner with the Archangel Michael (Bettany).—Anonymous",
    "name": "Legion",
    "genres": [
        "Action",
        "Fantasy",
        "Horror"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZjJmNGEzM2EtNTVjMi00ZWMyLWE5NGItMTFhZjlmZGM5NTExXkEyXkFqcGdeQXVyNDI3NjU1NzQ@._V1_QL75_UY281_CR3,0,190,281_.jpg"
}