{
    "filename": "Liar-Liar_script.txt",
    "imdb_id": "tt0119528",
    "imdb_url": "https://www.imdb.com/title/tt0119528",
    "characters": [
        "Skull",
        "Dana Appleton",
        "Audrey Reede",
        "Jane",
        "Pete",
        "Greta",
        "Jerry",
        "Fletcher Reede",
        "Max Reede",
        "Judge Marshall Stevens",
        "Richard Cole",
        "Samantha Cole",
        "Mr. Allan",
        "Kenneth Falk (as Chip Mayer)",
        "Miranda"
    ],
    "dialogues": {
        "Skull": "",
        "Dana": "Good morning, Fletcher.  Fifty per cent? With a pre- nup and proof of adultery? What's your case?  Interesting, though based on your track record, I expected a little more.  Let go!  Very funny, Fletcher. You want to play hardball, I'm game.  Fine, thank you.  I don't think so, Your Honor. Mr. Reid made it abundantly clear that the last thing in the world he wanted was to --  Your Honor, under the terms of the prenuptual agreement, if Mrs. Cole commits adultery, she is entitled to nothing. We have in our possession an audiotape made by a licensed private investigator of an explicit act of sexual congress with a man who is not her husband.  However, my client has no desire to see his ex-wife destitute. Against my advice, he's willing to offer her a cash settlement of.two point four million dollars.  Can the sarcasm, Reid. All right, I admit it -- I've seen you make even the lamest case fly. But this time I have you. Even Clarence Darrow couldn't explain this away.  All right! Double the offer! Four point eight! And not a penny more.  I see. And do you .know what Mrs. Cole and her male visitor did during their frequent... visits?  With the Court's permission, I would like to play the tape.  Your witness.      Your Honor, he's badgering the wintness!  Uh...no questions.  (defeated, to",
        "Appleton": "",
        "Audrey": "(checks her  Thanks, Max.     Stanford. I'm delivering a paper.  Do you have to take him to tho se things? They're so violent.     Jerry. His name is Jerry and yes, he's going.  I've been seeing him seven months, what do you think?  . Well you have to remember when  Relax, Fletcher. It looks like Jerry's taking that job offer in Boston.  Ready?  Are you alright?  I just wanted to say good- night to Max, but he must still be out with Fletcher,  Uh...would I . . . ? What did you say?  I can't just pick up and move to Boston with two days notice.  It's just not that simple... What about my job? I've been at UCLA three years.  There are other factors involved. T here they are now.       ·.  Did you have fun? How were the wrestling matches?  Some thing's come up. We need to talk.    Max's birthday?  It's the eighteenth.      (indicating the  . . . I can't go to Boston.  Max.  It's Fletcher.  I can't move Max three thousand miles away from his father.  I know.  I know. But if they're three thousand miles apart they'll never see each other. Fletcher will never come to Boston and how can I send Max cross-country to him?  I know, it's not logical, it's emotional. I'm sorry.  Are you sure?  Hello...  What happened?  Max is going to be so disappointed.  Do you want me to put him on the phone?  Right.     All right, birthday boy, make a wish.  C'mon, honey. It can be anything-- whatever you want most in the world.  Max, your dad is sorry. He had to work.  Yes, well, he... promises he'll see you tomorrow.    Hey, Fletcher. T was wondering if you were going to still pick up Max after school today.  (not believing     I see. And how is that?  But last night you weren't?  What were you doing?  (barely holding  No, I'm sorry, Max. He can't make it. I will. I'll work it out.  What wish?     Hello.  Fletcher, something else is about to happen to you.  Max and I are moving to Boston.  Jerry asked me to marry him. He wants Max and I to fly with him this weekend to pick out a house. And I'm going to go. God knows I don't have any reason to stay here.  Well then you'll have pretty much the same relationship you have with him now.  That was the straw and this is the camel's back saying goodbye.  Heading home.          Wait? You know, I just had an insight into myself. I ' m crazy. You call me up and . tell me to wait here because you'll be right over and -- here's the crazy part -- I actually wait.  I missed a department meeting. I. . . Did you come in a cab?  Where's your car?  I can. One thousand, six hundred, and fifty-four dollars and eleven cents.  Well I can't remember when I've had more fun, now if you'll excuse me, I have a class.  What do you want to say?  Let' s define \"fair.\" Last crushed because his father lied to him about coming to his birthday party. Fair?  -- Was none of my business. When it happened two years ago it was my business, but now I don't have to care anymore. See, that's the magic of div orce . But it does matter to Max. Everything you do matters to him... and everything you don't do.  We're suppose to be on a plane  You're really coming?  ...Six?  I hope so. Do you know what your son was doing at nine- fif teen las t ni ght? He was making a wish on his birthday c ake. He was wishing that, for just one day, his dad couldn't tell a lie.         Max, honey. Your dad had a very big case today. It probably just--  Okay.  Honey, don^t say that.  Max, there's something I-want to talk to you about. . .     Soon. My semester's almost over. You only have a week left of school... You like Jerry don't you? So what do you say, should we check it out? Jerry wants us to come with him tonight. He has to pick out a place to live and he really wants our help?  Of course you can.  Hello.     .        Max was sitting on the porch again, waiting for his dad. I won't let you do this to him anymore. I won't let you do this to me.     Max has the window seat, Audrey arid Jerry are next to him. Audrey has on her headset and Jerry is looking for his seatbelt. NEITHER SEES FLETCHER. Fletcher SCREAMS to get their attention. But it's TOO  (checks under his  Just a second, Max.  Fletcher?!  Fletcher, are you crazy? What were you doing?  You can come visit anytime. It's only a four hour flight.  Don't put Jerry in the middle.  All I want is for Max to be happy.  You better know your jury. You're hot exactly Max's hero today.  What?",
        "Reede": "",
        "Jane": "Hi, Mr. Reid.  I don't know who sent it. But it's for Mr. Allan. It's his anniversary.    What do you think?",
        "Pete": "",
        "Greta": "M ax ! What's new?  Oh, there's a surprise.  You did.  . Let's see.. .   ·  (jotting down a  (jotting down a  This is your fifth week.      .   ·   .  (jotting down a  Court's closed.        Hi, boss. What's happening  Boss, what's wrong?  Red?  Are you all right?  Home? Was the case settled?  Well, then how can you.go home?  Okay.  '·...dick with them.\" Okay. Your accountant, Philip, called to remind you about getting together. .  (jotting down a  So then you're here?  I ' m having a little trouble following you. what do I say to your mom?  Thanks for clearing that up. And that's it, except your ex called and asked when you were cowing over to see your son.  Do you want your messages?  Are you okay?  No! He loves you. I've seen y ou together. You're his hero.  Kids...  What?  Well, yeah, but...  Just today?  Yes, those are going around.  Of course not.  A ll right. Remember a few months ago, I wanted a raise--  -- and the firm wouldn't.give me one. And I asked you if you would give it to me out of your own pocket and you said the company wouldn't permit it because it creates jealousy among the other secretaries? Was that true or did you just not want to pony up the dough?  I remember when you. bought me t hi s silver frame. From Tiffany's. . . . Tiffany's?  (gives him the  A few years ago a friend of mine had a burglar up on her roof.  A burglar. -He fell through the kitchen skylight and landed on a cutting board on a butcher's knife, cutting his l e g. He sued my friend. The  My point is, it's hard to get justice. But this is justice,  He runs directly into Miranda.  Am I too late? Have you been se xu al ly molested yet? I could circle the block.  (totally wierded  Mr. Reid, what has gotten intc to you?!",
        "Jerry": "Max, my man!  Fletcher, good to see you?    (calling to  Uh, yeah, just, uh... how long are you gonna be on the phone?            The company wants me to get started right away.  Ju st come check it out. You a nd Max, see the town. Let's Then, if you want to turn me down and scar me for life, fine.  It's New England. They're lousy with colleges. You can't swing a bat back there without hitting a college.  Max , my man! My happy birthday man!  One-two-three-four-five... and one for good luck.  Whoa! Great! I have my glove in the car. We'll stop in the park on the way home and play c atch. Then tonight we'll oil  Well, if you don't hire your brother, who will?  They called me again from B oston. They really want me there tomorrow.  How come?  He'll love it there.  Fletcher?  Audrey, I have never said a bad word about your ex --  But how much responsibility does Fletcher take for Max, now? He'd never come over if you didn't remind him.  So because your ex-husband is unreliable, we can't-'-  I still want to marry you.    A little going away present. I was gonna get you a bowl of clam chowder but they only had Manhattan.  Max has the window seat, Audrey arid Jerry are next to him. Audrey has on her headset and Jerry is looking for his seatbelt. NEITHER SEES FLETCHER. Fletcher SCREAMS to get their attention. But it's TOO  I design security systems.  The biggest.  It's okay. Boston means this  Appreciated.  No, you go play with your son.",
        "Fletcher": "A dark street. . . a stormy night... two desperate men struggle... one man is taken to the hospital, the other to ja il. The prosecutor wants you to believe this is an open-and-shut case of a poor man, brutally victimized.  Well, for once I agree with t he prosecutor. This is an open-and shut case -- but the true victim is my client.  Put yourself in his shoes for a moment--walking home from church, alone, in a frightening part of the suburbs.  You're nervous, timid, looking over your shoulder -- when suddenly, you encounter him-- pouncing from the shadows. You quiver in fear. The streetlight flashes on something shiny in his hand-- a knife?  And in that terrifying instant you do what any respectable citizen would -- you defend y ou rse lf. Only after you shatter his arm and collarbone do you realize it's all a mistake... the man was merely walking away from an ATM machine, the apparent flash of metal caused by his bank card.      · And why? Why does the State  Shame on you, Mister Prosecutor! Shame on you!  Instead, let cold reason be your guide as you decide the fate of this church-going, orphan-rasing widower!    Stay out of my neighborhood after dark.  No, I'm late picking up my son.  How's my hair?  Maximillian!  Malfunction in vector 3 ! ! Malfunction in vector 3!! Look out! It's on tickle mode!!    Mom? !  You know, you were much easier when we were married... So where are you off too?  O h really? Where I live, we use a boy on a bike.    The boy must learn the way of the war rior . An d wh o be tter to teach him than Rowdy Rod- . Piper and Big John Stud?  He must be schooled in the way of the face-claw, the sleeper- hold, and the purple nuxple. For only then--    What? No kiss for me?    T o Stanford? Overnight? Does this mean you two are...  MEDIC!! I've been hit.  Well, great... I'm so happy for you two. I am just Mister H appy man. Happy, happy, happy.  Aud, I am so sorry...    Wave to the soon-to-be ex- boyfriend, Max.  Absolutely, Maxattacker. We just have to stop by the office for one minute.  (patting his  Philip!  (trying to brush  Oh, me too. I can never get enough of charades. We'll have to do it again sometime.  Soon.  Not that soon. I'm taking Max to see wrestling--  I don't think so. See, Max is really shy around strangers.  Tell you what -- give me your card as a reminder. I'll call y o u . Soon. Promise.  Fabulous! I love it.  Ah... The Partnership Committee meeting still scheduled for Friday?  Oh, I'm... fixing the card, Look, they spelled Mr. Allan's name wrong. Have an apple.  Hey, Pete! Great tie!        ·.  Thomas--looks like you're losin' weight.  (wedging past  Oh, yeah. You're going to love it. Uh, why don't you play in my office for a minute? Fax something, sue someone, have a good time. We'll be leaving in a second.  Damn!   I completely forgot.  You're a saint. I should get you something.  Ah. Well, I always do the classy thing. Any calls?  Tell him it's in the mail.  Write him a long, explanatory letter. Then bill him for the letter.  I ' m on vacation.  It's a long vacation.    Tell her I broke my leg and had to be shot.  --And then send out a notice of judgement on my win today!  Miranda! I didn't see you. Hey, you look lovely, today. Here, I bought you a gift.       Of course we are. A promise i s a promise. We are gonna see wrestling or my name isn't Fletcher T. Reid.   (the wrestler     Max Factor... Happy birthday. How old are you today? T h ir t y ? Forty?  Well, you've held up well. I only wish there was some way to commemorate such an occasion, some small symbol to mark this day, like....  . . . A present! .     Baseball stuff.      Tonight. After your party, you have my word on it.  Big fun. Manly fun. Am I right, Maxie?    Did you see that? He struck the child!    Tonight?  Oh , yeah, right. Seven. I knew that. I did. I blocked it out weeks ago. The se ven tee nt h of May. Max's birthday.  The seventeenth of May is the day I .remind myself that the eighteenth is Max's birthday. See you tonight.  Thank you.  Mrs. Cole, the only problem here is that after you've provided years of faithful service and loving support, of raising his children -- They are his?  After all that, your husband wants to deny you a fair share of the marital assets based on one single act of  Hm?  --Seven acts of indiscretion, only one of which he has any evidence of, and all of which he himself is responsible, for.  Mrs. Cole, I stayed up all night last night studying your c ase. Not just your case... b ut you. And, by now, I feel I know you. You are the victim here. The wife of a cold, distant businessman. Starved for affection, driven into the arms of another man--  (not missing a  And you've always been a good wife.  There's such a thing as being t oo nice. That's why you need aggr essive representation. To show the court that there is more than one side to this st ory. All I'm asking is the opportunity to see that justice is done on your behalf. Will you give me that opportunity?  He stares into her eyes. A moment, then...  Good for you!  Oh, pshaw.  Excuse me?  Urn, actually, something has come up. A problem on a new caaa--                .  Nothing. I just nailed my ·knee into the desk... Listen, I'm really sorry I can't 'make it.  I'll make it up to him, I promise. I'll pick him up from school tomorrow, okay?  Ah, no.     I have to go.  I've had better.  \"I've had better?\"      \"I've had better?!\"        New in the building?  Ah. Well, you must allow me to give you the grand tour.  No. Just the ones I want to bang like a drum.  Absolutely.  Unquestionably.  No.  Because I resent your p re sen ce. You fill me with an unpleasant mixture of disgust and guilt. Further, I don't believe you'll use the money for food, but I believe you'll use it for, at worst, drugs, or, at best, whiskey, or  I've had better.  Dana.         \"  Fifty per cent of your estate.  Our case is simply this. . .  Wa it! Wait!    I've got it in writing!  I'm trying!  Well, I'm a little upset about a bad sexual episode I had last night--  Yes, Your Honor.  Yes, Your Honor.  Mr. Rand had severe ethical objections to my client's case.  I have lower standards, Your Honor.  What are you doing?      I realize that, Your Honor, but I ' d really, really, really like a continuance.       I can't lie!        It certainly does.  Fantastically fair. Phenominally fair. In fact, I'd say beyond fair, bordering on stupid.    The best that money can buy, Y o u r Honor.       ·  We have evidence that you are not going to-believe.  .  Bastard!  No? ! Mrs. Cole, this offer was a miracle. I'm talking about a walking-on-water, Lazarus-rising-from-the-dead,  Seven!     ·  Mrs. Cole, you don't        ·. understand, I--  I think you need help.  Your cellulite, Tubster.              Red.   Red. All right. Focus,  . The pen is blue!! The pen is     .       No. I have to be in court at one-thirty.  I don't know, I don't know!!!  I only proposed a settlement t o dick with them. I never had any intention of going th ro ug h with it.  .  I'd rather shave my ass and sit in vinegar..                 I don't think I can. I had a case I was certain would settle and it didn't. I have to go to trial this afternoon, God help me.  It's true... I really do want to see Max, today.  How about that. I really do.  Yes, but-this time it's different.  ( he walked into  No.  Having sex.  No. It was with someone I don't even like. But I thought it would help my career and at the moment that seemed more important than attending my son's birthday!          Answer, answer, answer...  Audrey, let me explain. Something has happened to me--  What do you mean?  What?!  .  Audrey, please.... Is this because of what I just said on the phone?  Where are you?  When you gee there, stay there. I'll be right over. We have to talk.    I'll be right- there!  Aaaah!    None, whatsoever. I mean, I ' d like to respect you, and if it weren't for your mistreatment of the associates, your rudeness to the staff, and the fact that your work sucks, I would.  I was afraid you wouldn't support my partnership if I turned you down. Plus, I have an immature need for sexual conquests.     Gotta focus. . . gotta focus.  The color of the pen is -- re d !      .    C'mon, you can do this! The color of the pen is -- RED!  Depends on how long you were following me.  · Chevy Camaro, I almost hit a ge ezer, I sped some more, I failed to yield at a crosswalk, I changed lanes in the intersection, I changed lanes without signalling, and I changed lanes in the  No.  It's in my other pants.  Hanging from my boss's credenza.  No.  Yes -- but that's beside the point! My license actually is in my other pants, and they actually were hanging from a credenzaJ I wouldn't lie to you! I mean, I would if I could, but I can't!  I didn't say that. I have other reasons. Seventeen reasons, to be precise. Unpaid parking tickets. Be gentle.  Audrey, wait!  I can explain--  Yes.  Thank you. . I can't tell you how much this means to me.  Ow.  You scratched my car!  Right there!     (angrier and  Audrey, wait. I want to talk to you about this Boston situation.  You can't go. It's not fair. Taking Max three thousand miles away is not fair.  Last night--  All right-- now let me tell you something...you're absolutely right. I'm guilty of all charges. I'm throwing myself on the mercy of your -court.  I have an idea. I'll come over tonight, right after court lets out and play with M ax. Have him invite some fri ends over. We'll have a game and everything. Then, you and I can sit down and talk.  No, Audrey. Just talk to me abou t this first. Please. Au drey, I've lost you. Don't make me lose Max, too.  This is iron-clad. This is the mother of all promises. What time?  Ten-to-six.  I will be there.  Oh my God! That-'s it! An innocent kid - - a heartfelt plea-- a birthday wish! Sure, it' s impossible --but it 'makes sense!..! If he can wish it, he can unwish it!  Hi. Listen, I need to talk to     Well, actually-- ·  Uh, hi. Uh, I'm a lawyer and I work at a big law firm with a lot of other lawyers and I do stuff in a law court. Thank you.  Mostly, I ' m a divorce lawyer.  It means if you're daddy left your mommy, he'd call me.  (growing more and  They could but then J wouldn't make a living.  To marry a younger woman. To escape a loveless marriage and have cheap meaningless sex. To cling to an illusion of youth as his body gives way to sore backs, flat feet, spare tires, gum disease, hair loss, liver spots, kidney stones, clogged arteries, diabetes, goiter and eventual death.  Monster-Max.  No. I ' d like to, but I can't right now.  I ' m sorry I missed your party la st night. How was your Uncle Glen?  That's why he should have worn make-up.  Yeah, okay, urn... Your mother told me about... the wish you made last night. It came true.  Yes.  No matter what.  In the Olympics, yes.      On    . Channel 23, no.  Not in a million years.  Uh-uh.  Only if you can't 'swim.  Because your mom buys it.  I . . . I don't know. I ' m . . . Hey, you know I'm coming over to nig ht. We're gonna play together.  . Yes! This is absolutely an  Now, listen, Max, I need a favor from you. I ' m in a little trouble today. I need you to take that wish back.  Not to you.  Max, sometimes grownups... need to lie. It's hard to explain, but i f . . . Look, here's an example. When Mommy was pregnant with you, she gained a little weight. Se venty pounds. I thought she was gonna give birth to a car. But she'd say to me \"How do I lo ok?\" So I'd say, \"Oh, honey, you're beautiful, you're glowing.11 Otherwise, I would've hurt Mommy's fee ling s. Understand?  Right. No... Max, I don't know how to get along in the grown-up world if I have to stick to the truth. I could lose my case, I could lose my promotion, I could even lose, my job... Do you understand?  Will you help me anyway?  That's my boy!  Now, do whatever you did last night... only this time, make an un-wish.  Great! Great! Now to test --  (rubbing his sore  Only what?    Why not?!  I explained this to you! I have to lie. Everybody lies! Mommy lies, even the wonderful Jerry lies--  I am coming over, tonight, Max. You believe me, don't you?  I'll see you tonight, buddy... That's a promise.  Short and shrivelled.  No --  No --  No --  Philip... I don't want to come over to your house!  No.      My son hates me.  O h yeah? Last night at his birthday party, he made a ·wish. That I wouldn't be able to tell a lie for one whole day.  It came true.  It's true. Didn't it seem odd to you that I kept telling the truth all morning?  That's right!     I am incapable of lying.     Apparently until 9:15 tonight. It's a twenty-four hour curse.  You don't believe me.  Go ahead. Ask me something I ' d normally lie about.     Greta, please... Yes Judge Stevens, hi!.. Fletcher Reid. I ' m scheduled to be in your court in half- an-hour... Judge Stevens, I badly, badly need a continuance. . . so I can go home and stay there the rest of the day...111? Am I ill?  In a way.  Jumbo's House of Junk.  I'll give you the raise!      Hold on, please,  Mom... Well, I wasn't actually on vacation... Because I didn't want to talk to you... Because you insist on talking to me about Dad's bowel movements -- size, color, frequency... I'll call you later... No, not really.  Oh dammit! I cut him off! I cut off the Judge! Greta...  I'm on my knees in a nine hundred dollar suit. Don't leave.  Yes?  No. . . but what' s your poijit!    Aaaah!  Extremely.     He's a pedantic, pontificating, pretentious bastard, a belligerent old fart, a worthless, steaming pile of cow dung.  Well, I'm due in court... bye- bye.  (eagerly and a  --   until now.  Fu-- fu--    Well, it's working. I feel sorry for them already.  Your Honor, I object!  (can't help  No questions.  (afraid to ask    Would the Court be willing to grant me a short bathroom break?  Not unless you want to mop up.  What did I think? That I could piss for forty-five minutes?!  I ' m abusing myself! Do you mind?!       Yes, I can.  Hello.  (summoning up  The twins.  Sure.  (sees Virginia  I've slipped into the seventh circle of Hell, thank you, and you?  Well, basically the plan is I walk you through the tape step by step, I ask you questions--  Exactly.  Do esn't it? And I'll finish up with a dramatic series of questions, something like... \"Mr. Falk, isn't it true that you and Mrs. Cole have never made lo--\"    C'mon! Gotta rephrase the question!  Respondent calls... Lawrence Falk.  Mr. Falk, do you know my client, Virginia Cole?  Isn't it true that your relationship with my client is entirely platonic, not?  If I might rephrase your Honor. Is your relationship with my client entirely patonic, not?  Yes, is your relationship with my client not entirely platonic, or yes, is not your relationship with my client entirely platonic?  How 'bout just answering the question you think I'm asking?              '  Did you ever not make lo-- Did you not ever make lo--  (screaming at     I have no further witnesses, your Honor.  What are you doing? Call me.    You don't understand. I can't lie . Until nine-sixteen tonight, I can't even.ask a question that calls for a lie!         Mrs. Cole -- may I call you Virginia?  But that would be a lie, wouldn't it?  Isn't your true name...  Not really. It's just the first and smallest in the tissue of lies that is the Kleenex of your life. Let's take one simple document as a sample of your veracity, shall we, Carlotta?  Tru e blue? What if I asked you to remove your contact l enses? What color would they be then?  And here it says you're a b l on de . Are you? C'mon, Carlotta, there's a very easy way for us to check. If you don't remember, perhaps Mr. Falk will.  So on this single document, you basically lied at every opportunity. I'm sure a woman as vain as you would also lie about her age. It says you were born in 1964. What's the truth? 1962? '60? How young did you try to make yourself?    Oh, you bet it does, your Honor! My client lied about her age because she was only 17 when s he got married. Which makes h er a minor. And in the great state of California, NO MINOR  (knows he has    What?  He was entitled to prevent you. You committed adultery.' You only won because you're a liar, remember? .  But -- but -- you said he was a good father.  No.                                            .  Excuse me. Just a second. Y our Honor? Your Honor? Wait!  Screw that!! She lies and she wins ?! What are we, nuts?  T his woman --my client -- goes down with the frequency of a nuclear submarine and we just gave her thirty seven million dollars because she's a liar! And now as an extra added little bonus, we're going to let her steal, the kids, too?     -Let' s see what I' ve done today. I've helped a gold digging slut get richer. I'm taking this guy's kids away. I don't like you in the least, now I'm one of your partners!    Yo u wanna know the truth? Oh yeah, let's let it rain... The truth is is that I've traded my life...a beautiful wife, an incredible son for THIS PISS         Audrey!   It's Fletcher--  Wait, the most amazing thing's happened to me! I am feeling so good... Pack?! Did you say pack?!  A ud rey , wait. Please, I need to talk to you. I .swear, I'm a changed man. Just come to the courthouse with a thousand dollars and bail me out... Hello? O ne more call!! I need another call!!  And what about our water su pply ? You don't think \"the man's\" dumped enough toxins to render every dick in this cell as lifeless as a beached minn ow? You're damn rightJ \"The man\" does anything he w an ts. We're nothing but pu ppets... Little game pieces they move back and forth.  That's me. Fletcher T. Reid. Pawn no. 332-154-9867.  Audrey? Greta?!  Greta! Greta!! . . . . Look at you, you well preserved, underpaid, overworked, underappreciated thing you. G iv e me a hug! You came and got me out!! Hug me!!  Y ou know what?! I love you. I loveyouloveyouloveyou. I wa nt to hug you. Come here..,  Just the truth, Greta. Fifteen years of being stuck in a lie is nowhere near as powerful as one day of being stuck in the truth.     (checks his  Shiiiiit!!!  Listen; I know I'm driving a little crazy but i have an emergency to attend to...  W h y ? What for? For changing lanes?  No ! I paid them! This morning! That's the truth!      I swear!!  The computer is wrong! It computer's a liar!  (checks his  That's right, no! I'm not gonna lose my son because some stupid clerk was too lazy to update the computer. Now if you want to follow me, car after I get where I'm going. I'm a lawyer and I k now my rights! Understand?!  (looking                    .  'Scuse me, sir. Do you have any - -  Could you spare some?  Alright, I get your point. But this is a crisis! Look, I'll give you ten bucks.  Tw ent y.       .  Thirty-four. That's all I have.       I just need to use the phone to call a cab. I work here.  Hold it! I've got ten years worth of dirt on you and this firm, and I'm in the kind of mood today to get a lot off my chest. You let me use the phone or I start talking!!    You're saving my life, Philip.  No. It's not silly.       I don't like you.  I don't like you. I'm sorry. I find you boring. I hate ch ara des . And you wouldn't know a good time if it sat on your face. I'm sorry. It was easier than telling you how I really felt. Are you upset?  Then why are you always trying to socialize with me?  Philip, I don't like you as a person, but I'm crazy about you as my accountant. I ' d never hire a new accountant. Never!  Not at all.  Bedelayed. Bedelayed. Fog, rain, something, anything...  Excuse me. . . excuse me. . . Come on folks, let's let the frantic man pass... Sorry... Thank... you... Standing on the right, passing on the left. They can't make this- deal any easier than it is... Come on... coming through...    Ahhh!! !    Damn..;  What? I'tii practically naked!  It's called a ZIPPER, Hodgy...  Look out!! ! --  The RUNWAY is ENDING!.  Just then, Max looks up...SEES HIS DAD. Audrey is now trying to help Jerry find his seat belt.      (mumbles to     (to Audrey and   Okay, okay... The whole truth and nothing but the truth,  I know you've met somebody... somebody pretty great... and the truth is I wish you didn't but you did and... All I ' m asking i s . . . Please don't move to Boston. Please don't take Max away.  I don't want to visit him. That's what I've been doing-- visiting him, dropping by, stopping in. I want to be in his life. I don't want to be some jerk that sees him at Easter. I want to be his father.  I know I have no right to ask, but can I talk you out of taki ng that job? I can get you a better job here in L.A. I've got all kinds of connect ions... what do you do again?  How symbolic. Okay great. You know Pac-Tec?  One of their systems shorted out and burned down a supermarket. I got them off. Another proud day for justice. If I ask them they'll beat your Boston offer in two s ec on ds .    ..  Just let me present my case.  I have been sent from the future to destroy you. . . Argghhh!  You wanted me to stop lying. But lying isn't the problem. .. Why we lie ~ that's the problem. Sometimes we lie to make someone else feel better. But sometimes we lie because the truth gets in our way... But being an adult means you sacrifice some things for more important things. Much more important things. I was so stupid, Max. Malfunction in vector one. All this time you've been here and I could see you anytime I felt like it. And I... didn't. Please don't go to Boston. Max, I love you more than anything else in the world and you know it's true. I couldn't say it if it weren't true. Not today.  Max. .. it's 9:22.  Max, you made the wish at 9:15. I've been able to lie for the last seven minutes.  No! It wasn't a lie. I just wanted to be honest with you and tell you -- there was no wish to guarantee it anymore. You just have to believe me.  Malfunction in vector seven. I have lost control of my affection reflex...  Procreate!          Procreate!  Sr. . .  I take back every dirty, dishonest thing I ever said about you, wrote about you, faxed about you, E-mailed about you.  So, you up for a little friendly competition?  I wasn't talking about basesball.",
        "Max": "My mom's a teacher.      Well... he wears a suit and goes to court and talks to the judge and--  What time is it?  Dad!  That's no lady, that's mom!  Hey mom, dad's taking me to see wrestling!  Dad, are we really going to go to wrestling?  What are you doing?  Well. . . it's my birthday tomo rrow. We're having a party and everything.  Yeah?  We're not going, are we?  Five.  What is it?  Baseball stuff!        Look what dad got me!  Mom, let's go. I want to play.         He said he was coming. He promised.  I wish, for just one day, Dad couldn't tell a lie.  Is dad picking me up?  I guess my wish didn't come · true.  I wished that, for just one day, Dad couldn't tell a lie.      Dad!    Mr. Reid it'would be wonderful for the children to hear something positive about lawyers!  Dadzilla. You came to play catch?  Stupid. His big nose and stupid orange hair...  I want to play kickball with my friends.-  Really? You mean you have to tell the truth?  No matter what?  Is wrestling real?  Will sitting close to the TV set make me go blind?  If I keep making this face--  .If I go in the water right after lunch, will I drown?  Why do I have to eat squash?  How come you're always too busy to play with me?  Baseball?  So you can lie?  To who?  You didn't think she was beautiful.  I did it. ^  Did it work?  Only...  Yesterday, when I wished it, I r ea lly meant it. This time when I unwished it I only did it 'cause you told me to.  I can't.  Because I don't want you to lie.  But you're the only one who makes me feel bad.  I have to go.    Dad...  Great. You know Paul and Emanuel from across the street?     Oh boy. We're setting up a whole field in the yard. Where we buried Petey the hamster is second base. You're still coming right?'    I don't want to talk about it.     When would we move?  Could I get a sled for when it snows?  Okay.  Thanks.                     ·.  Max has the window seat, Audrey arid Jerry are next to him. Audrey has on her headset and Jerry is looking for his seatbelt. NEITHER SEES FLETCHER. Fletcher SCREAMS to get their attention. But it's TOO  Mom, it's dad!   ..  So then, you were...      Transformer!!! .  Come on, dad, let's play catch!!  Here you go, mom. Oh, you mean with a ball...",
        "Richard": "All right, Virginia, how much will it take to put an end to this?",
        "Cole": "Don't worry. I'll see you no matter what. I promise.",
        "Samantha": "",
        "Allan": "·It's good to see you again, Fletcher. '.  Marvelous! Marvelous! That's what I love most about this firm-- the collegial atmosphere, the hearty good- fellowship!  And thanks for those flowers for my anniversary. My wife loved them.  Don't let me interrupt, Fletcher. I just want you to know I'll be observing this a fternoon. Miranda insisted I see you in action.  I'm looking forward to it. Go get 'em!    That son of bitch pulled it off!  (re: the    You just killed your career. I hope you're happy.  Used to work here.  (to security  Still euphoric, Reid?",
        "Miranda": "Let the Judge decide what's true. That's what he gets paid for. You get paid to win.  Then we'll just have to find someone who'will.  Thanks. I heard about your victory today. You're making quite an impression on the partnership committee.  Actually, something important h as come up. You're not busy tonight, are you?      You're good. You're really good.  N o, I mean it. The Cole case is worth a truckload of money to this firm, not to mention the press it's going to g en er at e . You win this case and I guarantee you'll make partner.          S o . . . was it good for you?      Flet cher. Fletcher, Fletcher, Fletcher. I must confess-- after last night's incident, I was. . . hurt. So hurt. I was tempted to do whatever little things lie in my power to scuttle your chances of making partner.  But then I thought, \"No, that 's not fair. Fletcher didn't mean to insult me.\"  Isn't that right, Fletcher?    Ah, Fletcher, so nice to bump i nto you. Are you busy?  Good. Would you follow me, please?  Fletcher, did you know that the partnership committee is being headed up by Mr. Allan himself?     Pardon me for interrupting your, meeting. Mr. Allan, you remember Fletcher Reid.  Oh, that's right. You used to work together. .Tell me, what do you think of Mr. Allah?  I said... What do you think of Mr. Allan?  Kissing his career goodbye."
    },
    "imdb_rating": "6.9",
    "description": "Fletcher Reede, a fast talking attorney, habitual liar, and divorced father is an incredibly successful lawyer who has built his career by lying. He has a habit of giving precedence to his job and always breaking promises to be with his young son Max, but Fletcher lets Max down once too often, for missing his own son's birthday party. But until then at 8:15 Max has decided to make an honest man out of him as he wishes for one whole day his dad couldn't tell a lie. When the wish comes true all Fletcher can do is tell the truth and cannot tell one lie. Uh-oh for Fletcher Reede.—Anthony Pereyra <hypersonic91@yahoo.com>",
    "name": "Liar Liar",
    "genres": [
        "Comedy",
        "Fantasy"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYjZlYmJjYWYtZDM0NS00YmZlLWIyMTAtMDY5ZTNjZTgwMDhjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}