{
    "filename": "Limitless_script.txt",
    "imdb_id": "tt1219289",
    "imdb_url": "https://www.imdb.com/title/tt1219289",
    "characters": [
        "Detective (as Brian A. Wilson)",
        "Valerie",
        "Morris Brandt",
        "Hank Atwood",
        "Eddie Morra",
        "Marla Sutton",
        "Pierce",
        "Melissa",
        "Kevin Doyle",
        "Lindy",
        "Gennady",
        "Carl Van Loon",
        "Mrs. Atwood",
        "Man in Tan Coat",
        "Vernon"
    ],
    "dialogues": {
        "Valerie": "Look, enough, okay--?  Steve handles the rents. So feed your fucking bullshit to him.  --Like the rent's not low enough--!  You could be a bike messenger and come up with that! 17.  --Look, I'm just telling you, he's been talking about calling these people he knows from the club to muscle you out -- I've told him not to do that, but he's really pissed.  W-What?  Look, that's none of your-  How do you know I'm in school!  Are you some kind of creep? Have you been following me?!  You can only see a corner of it. How did you know?  Well, who asked y-     What the hell are you doing up there?  Are you tearing up your floor or something?!",
        "Morris": "You're lucky somebody wiped the room. Weak circumstantial at best. Just between us -- were you there?     I've been all over them... we can't allow any disparity in race or physical type between you and the rest of the lineup -- they're as close to your clones as I could possibly get away with -- it's going to be one big handsome blur to this guy-  Oh, that's me... I want everyone in the same shirt, better for the blur factor...  Not the dimmest clue. He was dithering.  \"Maybe the third from the right... No not him...\" --Oh. Here you go.   Thing of beauty. You had it made? 99.",
        "Brandt": "You're lucky somebody wiped the room. Weak circumstantial at best. Just between us -- were you there?     I've been all over them... we can't allow any disparity in race or physical type between you and the rest of the lineup -- they're as close to your clones as I could possibly get away with -- it's going to be one big handsome blur to this guy-  Oh, that's me... I want everyone in the same shirt, better for the blur factor...  Not the dimmest clue. He was dithering.  \"Maybe the third from the right... No not him...\" --Oh. Here you go.   Thing of beauty. You had it made? 99.",
        "Hank": "How do you know this?  There is absolutely no truth to the rumor of this merger. None whatsoever. My husband is having some tests, this is a difficult time, and I would appreciate your directing further questions to our attorney...",
        "Atwood": "How do you know this?  Go on.  I wanted this to be as confidential as possible. 96.  My husband experienced some pain and dizziness this morning. He's at Lenox Hill, undergoing tests.  Obviously, it wouldn't be in our best interests for this to be reported by the press, as it might put some of his interests at risk. I just want you to know that we have every intention of signing the contract, and, as soon as he is able, we will proceed.  Thank you so much. I rely on your discretion.  There is absolutely no truth to the rumor of this merger. None whatsoever. My husband is having some tests, this is a difficult time, and I would appreciate your directing further questions to our attorney...",
        "Eddie": "They found me.  I might have five minutes.  I'll never know how they got past security in a half-billion dollar building.  They've become sophisticated. Before they couldn't have done this. But now...?     I will never let them touch me. 2.  My neighbor must've heard the noise. Opened his door to complain.  He bought me half a minute. I wish he hadn't. Last thoughts are self- pitying and mine are no exception: the waste. The waste of it all. I mean, how many of us ever know what it is to become... the perfect version of ourselves. I'd come that close. To having an impact on the world.  And now, the only thing I'd have an impact on...  ... was the sidewalk.  Not so long ago, this was me. 3.  I was a writer. Two years after my copywriting job at Dexter &amp; Kerr came to a non-mutual end, I had, in an extraordinary burst of desperate energy, bullshitted my way into my first book contract. This was it:    Now, at last, I was ready to write.  Gearing up, that's all.  Getting psyched.  A few days did pass this way... maybe a few months...  Friends fled.  And banks became attentive. But just in case you think nothing ever happened to me.... 4.  Just like that.  I was kind of under the impression you cared a little more than just--  Look, I'm going to give 90 pages to Mark on Friday. If you could just wait, see what he says-  And it's all shit to you now?  Then you know I could use a friend.  Well -- what'll work, then?  Not with that enthusiastic invite--  She knew what was beckoning: the lower bunk in my childhood bedroom in Newark. We'd even had sex on it once. And it was a thing to be pitied and avoided.  Lindy. I really thought I had it in me to do something. --I wasn't getting around it, but it was fucking there. And now, I, ah... don't think it is. There. --Anything. At all.  If, what? 6.  I never think about Melissa--!  --Hey, well -- wait -- you didn't tell me what happened yesterday.  You got it--?!    She was right. I was almost 35. No one talks about \"potential\" at 35. I had missed the on-ramp. Soon I'd be sleeping in the lower bunk of my childhood bedroom... my father happy to welcome me into the challenging field of dental supply inventory...  Of all the useless relationships better forgotten and put away in mothballs, is there any more useless than... the ex-brother-in- law?  But who's counting.  Sedentary job, you know...  As a matter of fact, I've got a book contract.  How about you? Still dealing, Vernon?  No.  Nah, I should go--    It's one o'clock in the afternoon, Vern.    So... how's Melissa?  I'm making conversation, Vern.  How don't you know? You're her brother.  A couple of kids...  Who's the husband?  It's just a question, Vern.  Is that what she said--?! \"A coke thing.\"   How's it going... Well... I'm behind. I'm behind on my book, and it's pretty well polluting my days and nights if you really want to know.  Not one fucking word, Vern. 11.  Oh, no-- no, no, no-  You're still dealing.  You mean a lab in some little Yalie's basement? Give me a--  Okay, what is it?  What's in it? 12.  I'm too old for this, Vernon.  Vernon. Look at me. Do I look good? I smoke too much: my chest is sore. A fucking corpse has more energy than I do, I've got weird aches, possible lumps, rashes, maybe they're a condition, or a network of conditions. One of these days they're all going to hold hands, light up, and I'll keel over dead. My life's in the crapper, and I DON'T think it's going to take a sudden upswing into the stratosphere if I do some brand new, shiny designer DRUG!  I don't want it, Vern.  All the way home she was back on my mind ... Melissa.  She'd been so smart. Smarter than anyone around her. And oh, how she loved to provoke people... 14.  I thought, by now, she'd be curing cancer, directing movies, running for the Senate...  What had happened? Her life made no sense. I mean, I could see a direct, plausible link between this Eddie, broke and buzzed at three o'clock in the afternoon, and an earlier Eddie...  ...vomiting on his boss' desk during a presentation...  ... or stealing his dying Aunt's Percocet.  But there was no link between my Melissa and this upstate Melissa dumped, cold-calling people from her living room.     40 long blocks later I was \"home.\"       Well. There was less than nothing to lose. 16.  I didn't want to see anybody.  Especially not my landlord's nasty young wife.  Tuesday.  Just tell him-  I suddenly had extra reason to get away from her. I had thoughtlessly ingested a substance.  I had gotten remarkably little information from Vernon about what this drug would do.  ...What if it was a hallucinogen... oh my God... listening to her rag, if I were tripping...? I'd jump out a fucking window.  And then... I felt it.     Levels more, layers more, 3-D more... galactically more. But the same. Just the depth and beauty... of clarity.  What's wrong?  \"I was blind but now I see.\" 18.  You don't like me, and I don't blame you -- you see a schlumpy energy- sucking defeated sack of shit sponging off your husband. You're hoping I'll blow my brains out. But my existence shouldn't make you this upset. What is it?  Something wrong at school?  People who aren't don't usually carry dry, academic constipated out of print books about Dorothea Lange.  I just saw the book--  I've seen it before.  It was true. 12 years ago. In college... 19.  ...sitting on the couch of a T.A. I was trying to make, waiting for her to come back out of the bathroom... hoping she'd have a condom...    Somehow, my unconscious had served that up... a memory I'd never even recorded. Or was it there the whole time... and all I needed... was the access?     Vern was right. This was no recreational drug.  If you're writing a paper, that's not the book I'd use.  Cal Berkeley has her oral history. I'd start there. Her son is still alive. You could Google him. Sons of famous people always want to dish dirt about their parents. You'd get something no one else has, and you'd've gone the extra mile, a nice little apple for the professor.  Information from the odd museum show, a half-read article, some PBS documentary, was all bubbling up to my frontal lobes, mixing itself together into a sparkling cocktail of useful information.  She didn't have a chance.     We'd really worked on her paper, too. In 45 minutes it was a polished gem. She was pleased.  One nice little side effect...? I stayed hard for hours.     Happy and sore, I returned home.        ... But it couldn't be my home, could it? Who would live like this?  What was this drug? I couldn't stay messy on it, I hadn't had a cigarette in six hours...  ...hadn't eaten... So. Abstemious and tidy. What was this -- a drug for people who want to get anal?  I wasn't high, wasn't wired --just clear. What I needed to do. And how to do it.      The next morning, I sent a little probe down into my brain. No surge of brilliance came up to greet me. I felt thick and stupid -- a shuffling zombie without my coffee and cigarette. In short... 22.  I was back.     But something remained.  No.  Yes.  Three pages. That's all you have to read. If you read them in the next hour, and you don't want to keep reading I'll give back the advance.     But how would I finish? It was \"enhanced\" Eddie who displayed all that brilliance. Not me.  Vern! It's Eddie.  Vern -- last night 90 pages just wrote themselves! I totally chucked the novel I pitched them --I suddenly SAW, Vern, how this whole societal economic class struggle -- and its solution -- didn't have to be futuristic or fictional -- it was actually ACHIEVABLE here, in our lifetime -- and I could just lay it out, like, like a manifesto, or something, like Mein Kampf except not by a crazy racist fuck!  Okay, I won't talk any more about this if you let me in.   Yeah. That stuff's amazing.   What's... um... what's it called?  \"The boys in the kitchen...?\" Vern, that doesn't sound FDA approved.  Okay, so what did we have here? Some unknown, untested, possibly dangerous drug scammed out of some unidentified lab somewhere, given to me by a highly unreliable guy I hadn't seen in years.  Yes. Definitely. 26.  Uh... sure.  It was amazing how quickly it all slotted back into place...  ..the dealer-client dynamic......  ...the easy sacrificing of dignity for the guaranteed return of a dime bag, or a gram, or in this case a little pill that was going to cost me a month's rent. 27.            Yes... I... I need to report a murder. Eddie. Morgan. --Edward J. I won't.  It took them forever. And the longer I sat there, the clearer I saw... Vern had known whoever had done this. He'd opened the door.    And one guess what they'd been looking for. 28.  At least you got your last meal.  You never did like to cook...    Heyheyhey! I'm the one that called you!  ... No, ex-wife's brother. I just ran into him on the street and he invited me up to, you know...  Wha-- No! Talk! What're you --  He was -- I don't know, I heard he was sort of an antiques dealer.  Yeah... of, uh... Viennese kind of... chairs... sort of curlicue leg kind of things--  Melissa?  I hadn't heard her voice in 10 years.  Right before. I'd just run into him on the street.  Melissa --you don't think I had anything to do with-  Not on this line, no.  Melissa... maybe...  31.  Do you want to... meet somewhere, or...?  Then... I'll see you at the funeral.  Okay.  But I knew, when his attention wandered to something more pressing, that he was going to let me go.  Only then did it occur to me that someone could have followed me from Vern's apartment.       Probably not. Hopefully not. Worth the risk?     Back on MDT, it was obvious what I should do.  Vern's cash...  ...combined with an unprecedented surge of motivation...     ...enabled me to finish the book in four days.     A tablet a day... kept the torpor away. And what I could do with my day... was limitless.  I now had cultural appetites.  Learned to read music in a week...  Even half-listening to any language, I became fluent...  The only cloud was the nagging feeling I was being followed.  Was I? Or did MDT create paranoia?    The focal point of my existence quickly became... protecting my stash.  Call it a homage.  I had a new, improved game. 35.    Which means a prosaic author's work rests on a foundation of acclaim-  So you're saying praise and fame are unrelated to achievement, that the greatest hits CD cannot possibly contain good songs? That Shakespeare's catchiness belies mediocrity?  Well, then I'd guess you'd rather not hear about what I, personally, think could launch a thousand ships?  Fish in a barrel.  And it wasn't just women. I was, for the first time in my life, a presence... 36.  Of course, all this seemed to work better with people I didn't know... than with people who knew me...  ...so, Mom, your 401 K is totally mis-invested -- these guys are have done ONLY the most Pliocine era fundamental analysis and paid no attention to eye candy psychology surrounding the stock --  Okay, remember when I explained default flops? Did any of that stick? CDS's? CDO's CBO's?  I quickly returned to the unfamiliar audience.  --Sure you get a short term spike, but wouldn't that rapid expansion devalue the stock completely in two years?  Against aggressive over-expansion? There aren't, because there are no safeguards in human nature.  We're wired to overreach -- you look at history, I mean, all the countries that ruled the world? Portugal? With its big, butch navy? All that's left is salt cod and cheap condos -- the Brits? Now they just sit on their dank little island, fussing over their suits. Nobody stops and thinks, hey, we're doing pretty well, we've got Poland and France, and a big Swiss bank account -- let's not invade Russia in the winter! Let's go home and pop a beer and live off the interest!  Hey, I want in on it!  My brain was just pouring this stuff out. Everything I'd ever read, heard, seen, was now organized and available --here it is, here you go..  Thank you so much.  \"I must have a portfolio.\" Very well -- if I must, I must.     But Vern's cash was low. And it takes cash to make cash...  But it takes cash to make cash...  I'd like to re-negotiate my advance.    Yes, but I now see that writing, as a profession, is for marginalized whiners not fit for anything else.  No, I mean it, look at the life. Incarceration, loneliness, burrowing down into your own psyche, increasingly insulated from any truth, because you're not in the currents of the world any more, you're rattling around inside the cage of your brain, self- cannibalizing...  Oh, if you're good, there's some remuneration, eventually, after paperbacks, but at best your career'll be oozing along like a snail, a few thousand more copies, whoop-dee-doo, you're \"developing a readership,\" -- for what? So you can end up in Phoenix on a Saturday night reading from your own work at some holdout indie book store to a bored audience of ten? --Half of them there for the wine and cheese?       I would have to start very, very small... in a down market. No one was making money. But no one had     Armed with Vern's last 800 dollars, I made 4000 in a day. It was too slow.  Next day: $7,500.00 Still too slow. I needed more capital...  Why not?  Because I quintupled my money four days in a row.  It's not luck.  You think?  And that's a problem for you because--?  I won't. And what if I do? You think I keep detailed records of my investors? You'll have your money back long before they figure out what happened.  My new friend, Kevin Doyle, showed me how you could leverage two and a half times your cash at a day- trading firm...  I'd been upping the dose for over a week. It seemed to cut my learning curve.  It was instinct. But informed instinct -- instinct based on huge amounts of research, which, thanks to MDT, was conducted more rapidly and comprehensively than anyone at Lafayette Day Trading would ever know...  But not for the big fat defense contract he bribed his way into. That's still on. Should be announced in a week.  At the end of the week my brokerage account contained... over a million dollars.  I'd heard the old metaphors about the stock market: it was a collective nervous system, a global brain, a numerical representation of the will of God...     Whatever it was, I was jacked in, booted up - my mind was living tissue inside the greater, functioning whole. By the end of the second week I had 2.6 in the bank....  The word quickly got out.     You have... 19 messages.  Four job offers... my bank, raising my line of credit... a reporter...       And finally, Kevin Doyle, trying to sound casual.  Apparently he does.  Self-improvement month. Someone gave me a wake-up call. 46.  Why? It stuck, didn't it?  Who says I didn't? So what -- it's not getting over? Is that it?  Begging for what.  Gosh. This is so unexpected.  Of course, we started up again.  Her place... 47.    My place...  Every place.     Nothing.  No.  With success comes enemies.  No proverb. An inevitability.  Then... I found myself at the door. With no consciousness that I had moved.  It had been three days.  I'm eating, Kevin.  Have a toast point.     Medication. I'm on special medication. 50.  --Yes, that's partially what I'm    Look, there's no time for human judgement anymore. You see a chance, you blink, and it's gone. We entered the age of decentralized, online decision- making, with the decisions being made by hundreds of millions of individual investors around the world, people who don't even know each other -- making a killing in less time than it takes to sneeze.  Same rules, even in a panic. It's not understanding how companies work. It's understanding how mass psychology works.  Yes. I do have a formula, Mr. Pierce.  I don't have delusions of grandeur.  I have an actual recipe for grandeur.     But these companies aren't the question, are they?  Well -- you're upmarket energy -- what do you want with these little solar/windmill/hippie outfits?  --Unless you wanted to play both sides of the fence, control the whole energy enchilada. But these wouldn't get you there in emerging markets. You'd need... 53.  Whoa, whoa. This must be some big- ass merger you're contemplating.  And there's really only one company with enough bling to justify a merger with Van Loon Associates...  Carl, it's just rationalization.  Is Hank Atwood going to go for it?  Come on -- the two of you together? The world would have to come to you begging for energy like Oliver Twist with his little bowl of gruel.  It doesn't matter. It won't come off. 54.  You'd have to back off Libya.  I don't think you'd want to hear about it from some shmuck who needs a ride home.  Ooh. Now you're curious.    I'm at your disposal.  The Spartans weren't big on amenities.    I didn't go in.  I wanted to walk, move, digest, ingest...  There are moments in life, moments when you know you've crossed a bridge, your old life is over. Van Loon was my bridge. One week, two weeks from now, I would be hobnobbing with ambassadors, flying to Dubai for meetings, blowing off supermodels, vacationing in Medici villas... And that too, was only a bridge...  Suddenly...  There was another skip. 56.  How had I gone that last 20 blocks? I got another ten...    ... then...  I was back uptown.  What bar was this? Was it Harlem...?  Same bar? Different bar? How long had passed...?  And it happened again--  And again...  And again...  And again...  When it finally stopped, I couldn't account for the last eight hours of my life. 58.  There was nothing to do but walk home.     It was my first sleep in two days.     Should I? Would I start \"skipping time\" again?  Even off MDT, I decided to give Van Loon's files a shot.  They were fucking hieroglyphs.  I can't make the meeting, I'm, uh... I'm sick.  I need to, ah, analyze this data-  Already I recognized it... the thick tongue, the leaden synapses. It was regular Eddie - the Eddie that, now, was unbearable to be.  Well, I can't pass a fucking test right now!  Okay, Kevin. Okay. 60.  It was my first morning off MDT in a month. The beginnings of a headache was curling around my head like a big fat, greasy python.  But the time-skips had me scared.  My thought -- such as I had one -- was to tap dance with Van Loon until I could find out more about  Uh... iconoclast... owns, um, a lot of Colorado...  What is this, Atwood 101? Everyone knows about Atwood.  Nowhere.  Yeah, his Great Leap Forward.  Excuse me.  I couldn't have.  ...or could I?     If I could walk, talk, conduct business, seduce a woman, fight-- with no memory... could I kill someone? Was it even me? Who was  Melissa--?  Melissa, I want to talk to you. Please. Meet me somewhere...  Nonono -- at Charlie's, across the street. At two.  Please. Melissa -- it's important, please come -- you have to tell me what you're talking about!     I realized that there were other people who might know about MDT...  Vernon's other clients.       Hello, may I speak to Paul Kaplan, please?  I'm a journalist. From Electronics Today magazine.  I'm... I'm so sorry. Goodbye.  I, ah, may I speak to Jerry Brady?  Uh-- Bill Johnson.  Oh my God. What's wrong with him?  Of all the people I called, three were dead, and the rest were sick.  In the end, my stupidity saved me.           What was I dealing with? Who could tell me? I hoped against hope... that Melissa would show.     Melissa...? 67.  You... how are you doing?  I guess I lost some weight...  Since when do you read the Post?  Melissa, what do you mean?  No.  Why?  And...?  A lot.  Yeah. 69.  Finish your story.  How many times had I thought of her, my first real love...  But that Melissa had unraveled in time and space -- she was a ghost now. I was never going to see her again, never bump into her in the street... 70.  But when I run out--  Who invented MDT?    No one seemed to be watching my apartment, maybe I could chance it.     I was getting sicker by the moment. Luckily I had one pill on me... 71.  I... I... ahh...  I'm here now!     I'll get you a check.  Gennady, look-  I wasn't thinking. Look, we just need to go to my bank- OOF! 72.   It's aspirin.  That's the whole thing, plus twenty.  Aspirin and vitamins.  I had to get my stash.  I'm sorry -- I'm sick. I wasn't going to make it home-  IT WON'T HELP--! I need to get-- it's very simple: I need my pills.  They're... for my headaches...  It's... complicated.  Not... the way you...  No. That won't--  Hello?  W-what?  I knew what was going on. 75.     It was supposed to be legal.  I have a supply... stashed...  I just need... to get it...      Not to my apartment. I moved it.  I was smart. I was on MDT.  Hi -- Have you got it?  Are you sure?  Don't get out.  Call the cops.   Yes. What's happening?  Just be still, stop talking.  What?  Listen to me. Can he see you?  Can he see you?!  There is something.  Listen to me. Reach into the bag and take one of the pills.  Yes.  You will know what do to, Lindy. Take one, and you'll know.  You'll come on in thirty seconds. And yes, you will think your way out, that's what it does. Are you taking it--?  Lindy. I love you. --Lindy? Are you there? 80.     We'll stay here for a couple of days. We'll be powered up, we'll be able to think our way out of this...  I'm back. All right?  I can take care of you now.  A lot's going to happen for us. And everything that I will have... I will share with you. I will love you.     Looking for me? 83.  I was under the impression that our business was settled.  So now you're going to rob me? I thought you were a businessman.  What shit.  Well, so do I. You took the last one.  I can't get more -- the dealer's dead.  Nothing. I. Can. Do.  A hundred can't happen. The dealer's dead, I have to call three people to even get a line on--  I might... be able to get ten.   Ten. And no guarantee there's more.  Self-pity and MDT were not compatible. One has to go on...  ...Patch up what's left... 85.  I was sick. I shouldn't have gone to the meeting. I tried to cancel, but Kevin imploded on me--  A hundred and five, is what you were talking to, Carl. Delirium.  I sent over my revised projections--  I know, but I think if you look at  I'm sorry.  Two months after I started MDT, I was helping broker the most important merger in corporate history.  I found that if I maintained an even dose... remembered to eat... drank no alcohol... the blackouts didn't recur.  I was quickly back up to speed...  Is it possible to construct an... imperceptible compartment?  Quite large. 87.  I would never again stash my MDT, not in an apartment, not in Fort Knox.  I don't want it known that I have any security. You won't precede me, you'll follow me, never less than ten steps behind... `inconspicuous' doesn't begin to describe you. You're not there. You're a CEO'S wife -- you're wallpaper.    Safer though my stash now was, I was not sitting around until it ran out.  Can you make more?  Meaning...?  That's too long.  Two million dollars if you do it in six.  It was all going to work out...  I thought we straightened this out, Detective.  What is it about?  Luckily, I could now afford Morris Brandt, the best lawyer in New York.  Time was bought, and I was released -- for now.  I don't remember.  Carl Van Loon and Hank Atwood remained unaware that soon, I would be in a witness lineup as a possible murderer.  ...well, a unified front between Van Loon and Atwood would be lethally effective, and not a moment too soon.. SyCorps, Andine and others are jockeying for the same industrial concessions in Mexico that both our companies are secretly sniffing out...  Well, the governmental bribe structure is, in itself, corrupt, so of course information about its inner workings, like anything, can be bought. And there are other barbarians waving cash at the gates. I have a list here, in descending order of threat...  It flew. Of course, he's not going to tell you right now... 91.  Might be an act.  When this is over? I don't know. You haven't given me the answer.  All right. If all this comes off... what's my take?  I trust you.  Well, given the scale of my contribution, it can't be anything lese than forty. Let's say forty- five.  What is the asking price?    It was, as it turned out, a good moment to move.  No one knew, or would ever know, that I now carried the pills with me at all times.  Right away, it was obvious he was on MDT.  Next week? You can fuck yourself. Not that you'll feel anything. 94.  Obviously, this could not go on. But there is very little on this earth that 45 million dollars can't solve. And tomorrow at nine, Atwood would sign the papers.  Okay, the decision could have changed -- that makes sense -- but the discourtesy doesn't. It's still on.    I realize that this is a useless platitude, but... if there's anything we can do...  Cagey fuck like him giving away power of attorney? 97.  But Atwood wouldn't get better. Because Atwood was out of MDT.  Well. Why be surprised? How many other meteoric rises might be explained by MDT? At least I had some; my life wasn't in jeopardy. Only my money...  ...and my liberty.  Why?  Of course.    Who was out there? The woman's husband? Was some bellboy I undertipped about to end my life?    They'd kept me all day.  I'd missed my meeting with Gennady.  But I had more important business...  Not a word, Carl.  Personal time, Carl. Phone off. You're not telling me there's been any movement.  A coma?  It had gotten out, somehow. But I felt thick, stupid, tired. A small pain was starting behind my eyes. I'd been unable to take my MDT, and I was overdue.     Was it Brandt? Or someone else? The police station? A coat room? How? How?  In an hour I'd be useless. In two I'd be sick. In 24, dead. 101.       I couldn't think.     Only MDT could help me. I had no MDT. And then... 102.  One thought. Was there anywhere...  ... anywhere at all...I could have left one pill...?  I had to keep thinking. Somewhere safe...      It wasn't downstairs security, alerting me to a visitor. 103.  It was my inner door. Someone was in the building, ten feet away, right now.    And so... here I am.  I knew they would kill me, slowly and horribly. But this choice would at least be mine.  But we're instinctive creatures. We want to live. 104.  So, my foggy brain tried to remember... where one tablet of MDT... might be.  It was possible. And possible was enough.             I'm plum out.           Not much of a triumph, was it?  Because I would die here, too.  Only MDT could help me, and the last of it was in this fuck's bloodstream...                            Later, it would be noted that my neighbor was in the music business. One of his drug deals had obviously gone bad... And the night was still young.  I'm sure you're curious about what's happened to your boss. I certainly am. If my attorney was really working for Mr. Atwood, to save his life, then why is he dead? At what point was the Pony Express supposed to ride in with the life- saving medication? Or, did the Pony decide that he should be running his own Pony show? Minus the dog.  I would not go back. I would not be stopped.  I have a lunch.  Who's that?  Eiben-Chemcorps. What are they -- research?  Nice to see you.  We appreciate everything you've done for us--  Maintain?  What are you saying? 113.  Have you been watching me from the beginning?  Who's \"us?\"  How did it get on the street?  And what about for you? Why don't you take it?  And in return...? I do what.  And later...? What will you be \"bothering\" me with?  And if I don't like your ideas?  Luckily I can do that myself.  My lab?  Which one? 115.  You sure?  Tell me something.  Did I kill that woman?  After you.  Please.  Don't underestimate your own creation.  I mean, you invented it. What does it do? It puts me 50 steps ahead of you fucks. 117.  You think I didn't spend my days on MDT devising a personal defense structure that would scare the shit out of the Israelis--? You think there's not people with a bead on you right now, right in this building? You think this conversation is private?  You want to push that button? I'll show you my silos if you show me yours.  Or I'll think of something. Isn't that what MDT does? Makes you think of something? Might even tell me how to get off it.  What if I just ask the drug... how to tell the drug... how to fuck itself? I mean, isn't it like the 8-ball?  It always answers.",
        "Morra": "",
        "Marla": "",
        "Sutton": "Written by you.  Eddie... give me a call when you get in...  Eddie, I'm 40 pages further in... call me... it's a little grandiose, but I'm still reading...  Okay, how did you do this? I'd, uh, I'd really like to -- shit, just call me the minute you get in, call. Okay? Okay.        First, ah... I want to apologize, Eddie, if I in any way communicated a lack of faith in your abilities.  Mr. Dunham has read your pages, and we're prepared to make you what I hope will be a very exciting offer.  Eddie, we take you very seriously as a writer.  Yes, but if your goal is to have a",
        "Pierce": "Until they weren't.       Well, you want to call it?    You know, remind me: who the fuck, exactly, are YOU?! --I'm sorry, Carl, I'm about at the end with this unqualified, posturing little-  Since when is this little pisher the fucking Delphi Oracle?!",
        "Melissa": "--Oh, please, you think professional women mentor one another? You think there's some mutually supportive empathetic touch-feely network of kindly pie- bakers? --Those bitches hate each other! Quick, who was the worst boss you ever had? A woman, right?! We can't delegate, we can't command -- I mean, there's a reason we're not generals--!  Eddie. You were there?  God. This is all so weird...  No, no, no, Eddie, I know that. I wish I was more surprised. He was... involved in some stuff... I better not say any more.  Eddie, I've got to do the funeral. And God knows what else. I just... we can't meet, okay?  No. I don't want that - please don't... I'll call you at some point, when this is over. Okay?  Okay.  Hi, Eddie... it's Melissa. Listen, call me back as soon as you-- 63.   Eddie--?  We're talking now.  You can't see me, Eddie.  Don't tell me I look good, because I know I don't. I didn't want you to see me this way... You look good.  Yeah, well, MDT'll do that to you.  I know you've been doing it. I just read the Post. Eddie. Short-selling stocks? Second-guessing the markets? You? Come on.  These days, the Post's about all I can read.  I mean, I did it too. And I only took nine or ten hits. Vernon didn't tell you any of this, did he?  Well, when he told me about this amazing new drug... 68.  I was like, down the hatch. And it was amazing. I read Brian Greene's The Elegant Universe in 45 minutes and understood it. My work rate increased... just, insanely, overnight. My boss started to hate me -- they offered me his job. And then I got scared.  I'm not stupid. I mean, nobody can keep up that level of mental activity and not crash. I stopped taking it.  I got sick. Headaches, throwing up... I went back to Vernon to see if I maybe shouldn't take another hit, or half a hit, and then he told me about... about the people who were dying. One guy didn't die, but he's a vegetable, his mother has to sponge him down every day... How much have you been taking, Eddie?  Well, maybe they've worked out the bugs. Maybe... maybe this isn't the same batch...  You're off it right now, aren't you?  Are you getting a headache?  Well, I didn't take more. And I didn't die. But after a while I found I couldn't concentrate on anything for longer than ten minutes. I missed deadlines. I got lazy... and slow... put on weight... the magazine let me go. My husband checked out. Sex? Get out of here.  That was two years ago, and I haven't been the same since. I can't read any more -- I mean, the fucking New York Post?  After this, I'm going to have a migraine for three days. And I've got to pee. Which is another thing.  You have some left? Good. Go home and take it. Take the dose down, but don't just stop -- you'll die if you just stop. Try to taper off. Otherwise, the headache's just the beginning... I have to go--  I don't know. I have to go--  I don't know-- Goodbye, Eddie.",
        "Kevin": "No, no, there are safeguards-- 37.   Yeah. It'll all happen again.  You must have a portfolio, but if you don't, I'd be very interested in working with you. 38.  Eddie, I was having drinks with a friend of mine, and... ah, you won't believe this...  Hey.  He'll be here in ten. Now look, since we have a minute, be warned: Van Loon's mercurial. 49.  One minute your best friend, the next...you're a leper. And he needs direct answers... anything tentative and you've lost him forever. I think we should rehearse a few scenarios..  You up for this? You sure? Because I've got a little bit on the line    ..and, oh, you know, she's on the wait list... Rosemary's pretty devastated...  Hello--? Eddie--? What are you talking about?  Yeah, well, you can't have the fucking flu right now -- he'll never give you this chance again!  ... Don't you get it?! This is your test--!  And how am I going to look if you don't?",
        "Doyle": "No, no, there are safeguards-- 37.   Yeah. It'll all happen again.  You must have a portfolio, but if you don't, I'd be very interested in working with you. 38.  Eddie, I was having drinks with a friend of mine, and... ah, you won't believe this...",
        "Lindy": "I don't think I can keep this.  If I didn't care, maybe I'd be able to stand to watch you do this.  Stop. You think I don't know what you do all day? I've loved you. I know the good stuff, and I know the shit.  You're the one living it. Don't think I don't know it's worse for you.  Don't you dare try that shit on me! 5.  I see where it's going. You'll lose your apartment. And then what? You'll move in with me--  --And then it'll go on this way, and I'll rag on you, and finally boot you out -- and then what? I mean, have you run the film?  You know what...? I'd have had you move in anyway... if...  If it was me you wanted. And not Melissa.  I have to get back.  I got it.  Yeah. I'll have my own assistant. You believe that?  Yeah, thanks. I do. 7.  Oh, please.  Carl Van Loon wants to meet you?  But you're not in the finance game. What can you do for Carl Van Loon? (shaking her head,  Since when do you speak... what happened to you?  God, Eddie -- I felt so bad about that.  You didn't do all this for me.  All right, all right -- boy, you are really begging for it.  \"I'm proud of you.\"  I'm actually... more than proud. I'm a little...  ... intimidated.     What are you doing, hon?  What, you think somebody's watching?  Is there anything you want to tell me, Eddie? Now's the time.  Old Chinese proverb? 48.  You should sleep. Isn't your Van Loon meeting tomorrow?  What. What.  Are you all right?     It's all right, Lisa.  Eddie-- What is it--?  Okay. Okay, I'll get you to a  What kind of pills? 74.  What headaches? What are you--?  Are you on some drug?  Oh. Oh. So all this energy of yours, all this focus... has been some drug, Eddie?  You need a doctor.    ...a smart drug...?  Oh, Eddie... you jerk.   No.  And I'm supposed to just GO?! In the middle of my work day?! To your APARTMENT to get you more DRUGS?    You did--? Why?!  Then where did you keep it--? 76.  Oh, you prick.    You asshole... in my fucking        Yes. --Eddie, there's someone following me.  He got into the cab behind me, and they're making every turn I'm making! 77.  What the fuck did you put me in the middle of--?!           Help! Help!! 78.  There's... a... man... chasing me. He has a long, tan --  Are you still there?    I'm hiding, but I'm stuck. He'll find me!  He killed a cop--  He's going to kill me, Eddie!     Not yet. --I don't know what to do! What do I do--!  What?!  S-swallow one of those things?!  He's got a knife -- I can't think my way out of a knife--!    Eddie...? I feel it.             Who's back, Eddie?  That was never what I wanted.  You know... you were always smart. You could have done this. Not this... but some of these things... maybe a third of these things... without any smart drug at all. A third of all this... to most people...? ...would be plenty. 82.  I understand that stuff now, Eddie. And I don't blame you for taking it. No one could ever tell you, till you take it, what it can do. Invincibility in a bottle. And I know I'm going to think about taking it again every day for the rest of my life.  But once you can see everything that way, mapped out like that, on a grid... and always be right...? Who'd want to wing it? Who'd want to fuck up? Who'd want to be human?  I just came up to say goodbye. I don't ever want to see you again. I'm not even going to stay in New York. Don't try to find me, and don't try to help me.",
        "Gennady": "Because I don't see you before. And I don't fucking like you already. Why do I give you 100 thousand dollars?  You're lucky.  Okay, you tricked their computer, you got some fix on the game. 42.  So you're a crook.  You people all get caught.  Okay, you take this... you mine. You don't pay, you know what we do? We cut you around the waist, peel your skin, pull it up over your head and tie knot in it. And you don't die from that. You suffocate.  ...you stupid shit, I be there Thursday for the money, ten o'clock! 45.  You fucking forget about me? Huh?  One o'clock? And you not here?! Eddie tries to catch his breath.  A check? A check?! You out of your fucking mind?! What you think we are, some financial institution?  I cut your balls off!  What you got there?  Don't look like no aspirin I ever see!  What is it? Something good, eh?  I feel good. What in that shit?  You fucking full of shit, Morgan. I know you lie about the movie script too. 73.  You think you can run out on me? You think I don't know where you are?  Walk.  I want some more of that shit.  The pills.  So you get me more.  Oh. Well. Too bad for you. Because how you gonna go to those fancy meetings with your nose fed to my dog? 84.  Make some calls. One hundred pills.  You know I don't really do this. So clean, like this. What I do to you, I do in stages.  Ten. Fuck your ten.  Oh, I think guarantee.  Next week...? I require twenty pills.  I don't think your Forbes 400 new financial friends would appreciate the details of your little dilemma with the police?  Thursday. You have them here.  I told you I want more. You don't listen. Maybe you think I'm joking...  But I'm down to this last one.  See, I dissolve pill in solution. You shoot it - goes straight into blood and to brain. Works much better.  Now. Where do you keep yours?  They will find it. Or I will make you tell me. Which is quicker? We see, huh? 106.  This is a waste of my time, you know that? I am getting out of this part of the business... starting import-export company. Very exciting stuff. A lot on my plate. I need to learn to delegate...  First, I will cut skin from you, flay you... you stay alive nice long time... then maybe we cut meat from you, steaks... or maybe softer parts... I get inspiration...",
        "Mrs.": "I wanted this to be as confidential as possible. 96.  My husband experienced some pain and dizziness this morning. He's at Lenox Hill, undergoing tests.  Obviously, it wouldn't be in our best interests for this to be reported by the press, as it might put some of his interests at risk. I just want you to know that we have every intention of signing the contract, and, as soon as he is able, we will proceed.  Thank you so much. I rely on your discretion.  There is absolutely no truth to the rumor of this merger. None whatsoever. My husband is having some tests, this is a difficult time, and I would appreciate your directing further questions to our attorney...",
        "Vernon": "Shit! It's gotta be-- 9 years--?   Hey, you!!!  Jesus, Eddie, pack it on, why don't you? 8.    Come on, let's get a drink. I wanna hear about this book.  Ah-hah. That's why you agreed to the beer.  Well, I don't know how Melissa is.  I don't see her. She lives upstate now, she's got some kinda internet home sales kinda job... a couple of kids...  What are you, jealous?  Walked out on her, if you really want to know. But what do you care? You guys weren't even married six months, were you--? I mean, it was just a coke thing, right?  But I wanna know about this book. How's it going?  How much have you written of it?  Wow. Creative problem, huh?  I think I have something that can help you.  You don't even know what it is.  No -- yeah --will you listen?! This isn't recreational. I've been doing some consulting for a  No, this is an exclusive product coming on-stream next year, they've had clinical trials, and it's FDA approved.  Look, they've identified these receptors in the brain that activate specific circuits, and-- you know how they say you can only access like 20 percent of your brain? Well, what this does--  It works better if you're already smart."
    },
    "imdb_rating": "7.4",
    "description": "An action-thriller about a writer who takes an experimental drug that allows him to use 100% of his mind. As one man evolves into the perfect version of himself, forces more corrupt than he can imagine mark him for assassination. Out-of-work writer Eddie Morra's (Cooper) rejection by girlfriend Lindy (Abbie Cornish) confirms his belief that he has zero future. That all vanishes the day an old friend introduces Eddie to NZT, a designer pharmaceutical that makes him laser-focused and more confident than any man alive. Now on an NZT-fueled odyssey, everything Eddie's read, heard or seen is instantly organized and available to him. As the former nobody rises to the top of the financial world, he draws the attention of business mogul Carl Van Loon (De Niro), who sees this enhanced version of Eddie as the tool to make billions, but brutal side effects jeopardize his meteoric ascent. With a dwindling stash and hit men who will eliminate him to get the NZT, Eddie must stay wired long enough to elude capture and fulfill his destiny. If he can't, he will become just another victim who thought he'd found invincibility in a bottle.—Relativity Media",
    "name": "Limitless",
    "genres": [
        "Sci-Fi",
        "Thriller"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYmViZGM0MGItZTdiYi00ZDU4LWIxNDYtNTc1NWQ5Njc2N2YwXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_QL75_UY281_CR3,0,190,281_.jpg"
}