{
    "filename": "Little-Nicky_script.txt",
    "imdb_id": "tt0185431",
    "imdb_url": "https://www.imdb.com/title/tt0185431",
    "characters": [
        "Chief of Police",
        "Adrian",
        "Dad",
        "Peter",
        "Peeper",
        "Lucifer",
        "Todd",
        "Gatekeeper",
        "Valerie Veran",
        "Cassius (as Tommy 'Tiny' Lister Jr.)",
        "Nicky",
        "John",
        "Beefy (voice)",
        "Referee",
        "Holly"
    ],
    "dialogues": {
        "Adrian": "I've been waiting on this day for ten thousand years.  He throws a dart that hits one of the heads in the forehead.   Well Dad says it's the breaks that make the torture.  You have to let people feel a sense of relief.  Cassius whips a dart which hits one of the HUMAN DARTBOARDS in the eye.   Then again, the beauty of Dad retiring is what he says doesn't matter anymore.  Cassius pulls out the dart.  The eye comes with it.    What!?   You sure about this decision, Dad?   And he's dead serious.   Um, excuse me, we're having a private conversation here.   Twenty-thousand years ago, Grandpa Lucifer said, \"It is better to rule in hell than serve in heaven.\"  Well, I'm getting tired of serving in Hell.  We need a place where we can rule.  Cassius throws a rock at the Monster.  He yelps, then turns around, motioning like he's thinking about coming back. Cassius sees this and gets enraged.    Could you concentrate for five seconds?   What do you think about...Earth?  Cassius seems to think this isn't a bad idea.   We could create our own hell there.   Eventually, Cassius.  But first we corrupt as many as we can so that when we do destroy them...   It's our time, brother.  The two look at each other.  They start running toward the fire wall.  Knocking souls out of their way.   Oh, this is delicious.   Well, we must get people sinning if we want to fill up our New Hell.  How are things going down at City Hall?   Brilliant.  This is so much fun.  I never want it to end.   When an adult goes to Hell, that's terrific.  But when a child goes... that's why I'm in this business.  Adrian looks across the street and sees Nicky walking with Valerie.  He's shocked.  Valerie is holding up a pair of drawstring pants from her collection.     You shouldn't have come here.   He's sick?   He should have thought of that before he denied me my birthright.   How about this?  I stay here enjoying my Schnapps and you go back.  Nicky's body jerks around.   Ta-da.  So what time is my brother expected back?   You know what you'll get?  An indescribably horrific torture administered by demons for the rest of eternity.   Sure, why not?  They high five.  Adrian smiles and waits.  It is real hot down there.  We hear a train coming in the distance.  A fan circles slowly.  They all wait for him.   To the defilement of Earth and the corruption of its people.   It is awfully hot down here.  How do you manage to stay so cool?   This liquid will probably quench my thirst.  Cool me off.   Or maybe it will trap me inside for all eternity.   Oh, Nicky, I've missed you.  Come on out and say hello...    I'm calling you out, brother...  Adrian is mentally pulling Nicky out of John.  Nicky/John wages an epic battle with himself as Adrian smiles.   Hello, Cassius.   You know, New Hell really only needs one new Satan.   But Cassius could use some company for the rest of eternity.  So get in the flask.  He puts the Flask in Nicky's hands.   Of course I can.  Drink or she dies.  Unlike you, she won't come back from where she's going.   I hear a train coming.  Drink.  The train sound is coming CLOSER.  Valerie looks at Nicky. Nicky raises the flash to drink.     Ahhh!   See you in Hell!  WHAMM!  The train comes by, hitting both Adrian and Nicky.   Where's Nicky?   I came through that gate alone.   Somebody explain what's going on.  Puts the Gatekeeper in a headlock.   Perhaps a titty twister will loosen your lips.  He twists a breast.  The Gatekeeper babbles out the information immediately.   How much time does Dad have before that happens?  Adrian twists hard.   Thirty minutes.  Hmmm.  I hope you don't mind if I take a seat while I wait for you.  He moves to the throne and throws the lips off.   Ten thousand years.  And I never once got to sit here.  He sits on the throne and it starts to shake a little.  He grins as two horns grow out of his forehead.   Wow.  And this is just a little taste of my power.   Ah-ah.  Not so fast, demons.  There are a couple of million evil souls on Earth ready to be harvested.  Anyone interested?  The demons stop.  Now loyal to Adrian.  All except Jimmy.   Welcome to the party.  It's so nice to see all of you here.   I'm very proud of you.  You've taken to sin with minimal prompting.  The crowd cheers.   You're acting as if there is no Heaven or Hell.  The crowd cheers.   Well, I have some news.  Adrian morphs into the Cardinal from earlier.   At the stroke of midnight, my father will be completely deteriorated.  And all of your souls will be mine.   Soon you will see things more horrible than you can even imagine.  Adrian scans the crowd.  He sees...   Not that horrible, but still pretty bad.  Adrian motions to some of his guards.  They nod.   So while we wait, for your enjoyment, I bring you a dear sweet man and an international icon...Henry Winkler!  A frightened HENRY WINKLER is lead onto the stage prodded by two DEMONS.   Covered in bees!  We see Henry Winkler is suddenly covered head to in a swarm of bees.   You know, from this angle, you're kind of cute.   Yummy.  Everyone is grossed out.   Keep it up and I just might make you my Queen for a night or two.   Little Nicky.   Is this a joke?   Not bad, little brother.  Let's see what you've got.  Nicky thinks, holds out his hands.  A rainbow shoots out onto the stage between them.  PAUSE.  We see that a cute little chipmunk is standing on it's hindlegs eating a nut.   Enough.  I'm going to kill you with my bare hands.  Adrian punches Nicky hard in the jaw.  He goes flying off the platform.  Nicky's body falls towards the ground.  It's about to hit, when a soft bed of posts and fluffy pillows break his fall.   Absolutely not.  Adrian turns to his demons.   A little help over here.  A bunch of Demons advance.    He looks up and glares at Henry.   Henry!    He turns his attention back to Nicky who is grabbed by demons.  Adrian brings the flask to his lips, but he won't open his mouth.  Adrian pinches Nicky's nose closed so he has to open his mouth.   Goodbye, Nicky.  We hear CASSIUS banging against the walls.   I was going to let you out, eventually, Cassius.  I swear.   What?  No tongue?  Adrian pulls his head back, his tongue is huge and he turns into a GIANT BAT.  He lets out a huge roar, then flies around, laughing, scaring people.  Valerie runs over and picks up the flask.  She looks inside.   No!",
        "Dad": "What are you boys doing?  Cassius releases Nicky's hand.   Cassius, didn't I tell you to stay out of your brother's mind?   Maybe this will help you remember.  Dad's eyes flash red and Cassius punches himself hard in the nose, sending him back against the wall and down to the floor.  Dad gives Nicky a wink.  Nicky smiles.  Dad has an air of confidence and power.   Now everybody sit down.   Okay, kid, we'll listen to it later.  He leads the boys to the throne area.  We see outside the window the peeper staring in sexily.  Dad looks, shakes his head.  Just then, THE BIRD appears and attacks him.  Dad closes the curtains.  Nicky, Adrian and Cassius sit on little stools at the foot of his throne.  Dad lights a cigarette with his finger, the tip of which glows red like a cigarette lighter and looks down at his three sons.   My dad, your granddad, Lucifer, was thrown out of Heaven by G-d and rules here in hell for ten thousand years. And after this ten thousand years had passed, he decided to abdicate his throne...  Confused, Nicky sheepishly raises his hand.   ...to step aside.  ...and let me become the ruler of hell. This, as some of you might know, is my ten thousandth year as Prince of Darkness.  So I think the time has come to discuss who will succeed me.  Jimmy the Demon walks in.   Yes, Jimmy.  He whispers in Dad's ear.   No, no, that's not what I said.  He can keep his thumbs, but the fingers gotta go.   This was a very difficult decision, because I have three wonderful sons.  I mean, Adrian, so smart, so ruthless. And Cassius, so strong, so tough.  And Nicky, so...so...   Such a sweet boy.  But after much thought and careful consideration, I've decided that the ruler for the next ten thousand years is going to have to be...me.   The important thing for the stability of our rule is to maintain the balance between good and evil.  And I don't think any of you are ready for that responsibility yet.  You need the wisdom that comes only with the passage of time.   Right.  Right.  Send him in.  I'm sorry, boys.  I've got to get back to work.  Nicky, Cassius and Adrian start filing out.  Adrian stops.   I'm telling you, pal, it's the right thing to do.  HITLER , is being brought in by Jimmy.  They head towards the closet.  Inside the closet is a crate of pineapples.  Hitler picks out a relatively small one.  Dad shakes his head \"no.\"  Dad walks over to the closet.  Hitler picks out a really big pineapple. Dad nods \"yes.\"  Hitler sadly hands it to Dad.  Jimmy bends Hitler over and as Dad raises the fruit...   Now that was an experience.  \"You are only coming through in waves.\"  That line blows my mind every time.   I don't care what kind of mood you're in at the start of that song.  When it's over, that mood has been altered.  Wow. Great shit.  What's next?   Who is this, Metal-lick-a?   I was just playing with you.  Dad and Nicky dance to the song.     I'm sorry.  After careful consideration, I regretfully have to decline.   In exchange for eternal damnation of your soul?  You're too nice of a guy for me to want to do that to you, Mr. Marino.   Yeah, but Joe was coming here anyways. Just go back to Earth and enjoy your records and the Hall of Fame and the beautiful family and all that.   Now you're talking.  Dan exits.   And I also happen to be a Jets fan.  Nicky and Dad share a laugh which is interrupted by faint sirens.  The Gatekeeper enters in a hurry and falls to his knees.   Oh, boy.  Oh boy.  Calm down.  Get off your knees.  The Gatekeeper stands up.   This is bad, Nicky.   I'm gonna die, Nicky.  If the gates are broken, no new souls can get in, which means I'll start to deteriorate into nothing.  GRANDPA LUCIFER enters.   Everything's fine, pop.   Please, pop, just go back to your room.   Sure, pop.  Whatever you want.  The gatekeeper walks towards Lucifer.   To do that Cassius and Adrian have to come back through the other way.   I'm too weak.  The process has already begun.  Dad holds up his hand.  His pink is hanging by a thread.  We see the bigfoot MONSTER grunt disgusted by the sight.   Nicky, the worst thing that could happen on Earth is you get killed, in which case, boom, you end up back here.   Here.  Get them drunk from this.  One sip and they'll be trapped inside.  Once you've got both of them, you bring the flask back through the gate.  Dad's pinky is hanging.  Jimmy pulls it off and examines it. The Monster gags.   Son, just do your best.  Nicky looks teary eyed.  The moment is broken by the Monster, who runs in and pushes Nicky through the fire.  Nicky goes through the solid fire wall.  PAUSE.  The Monster taps his own wrist and looks at Dad as if to say, \"gotta get a move on.\"   That's a train, son.  Don't stand in front of them.   Please, Nicky, get back up there.  Try to hurry.  Nicky climbs up and heads back toward the fire wall.   What are you gonna do?  Look at me, Nicky!  I got no legs, I got no hips, I got one ear...  Dad's remaining ear falls out.   I got no ears!  I can't hear!   I can't hear you, Nicky.  I can't hear anything!  Jimmy picks up the ear.  Jimmy speaks into it.   Put it back on my head.  I'm falling apart here.   I can't see shit.  You're all still here, right?  Adrian enters.  They all cheer.   Yea!  I can't believe little Nicky came through.   Boooo.   Ahhh!  He pushes Lucifer out of the way.   Hell's gonna bust wide open.  Demons, get him out of the chair!  The demons approach.   I was a good Devil, wasn't I?   I tried to do some interesting stuff...   Really?  That means a lot to me.   You came through, Nicky.   You're back in Hell now, kid.  There's no butterflies here.  If you want butterflies, you need to be on Earth.   Nicky, I let my butterflies die once upon a time and it's never stopped hurting.  That's right, you heard me, Holly.  I'm still in love with you.   And don't think I forgot about how crazy you get after a few daiquiris.   Listen, I got down low.  Your mom's got up high.  You take care of the middle.",
        "Peter": "Sounds like our devil dance actually worked this time.   Mr. Sleepyhead must have some major ties to the dark side.  A sleazy STREET VENDOR shuffles over towards Nicky.  He eyes the flask which is half hanging out of Nicky's pocket.   Gotta be one of his disciples or something.  Suddenly, the Vendor grabs the flask (and Nicky's half-eaten drumstick) and runs off.   Should we wake him up?   Rise and shine, devil guy.  Some dude just stole your shit.  Nicky feels for the flask.  It's gone.   Did you check out the dragon mouth?   Check this out.  The number of the beast.  They laugh and hi-five.   Look who's back from the dead.   Oh, I dumped a fat sack of reefer in the mix.  Tried to spice up the bash.  Nicky takes a big bite of cake.   Please.  You got to.   How you feelin' over there, Satan Abdul Jabar?   Me, too.  We're gonna get going.   We're going to see Ozzy play at the Meadowlands, right now.  Wanna come, Nicky?   Dude, it's us.  Let us in.  Nicky opens the door.  Peter and John stumble in.   What'll we do now, Beefy?   Dude.  Seriously?    Alright!  John takes Nicky's head and slams it hard into the kitchen counter.  Nicky is dazed.   You sure you're down with this?   We know where to find Nicky.  COPS grab John &amp; Peter and drag them inside.   Fifty million bones, bro.  He nods to a DEPUTY who gives them a briefcase of money.   Excellent.  But I gotta warn you, man. He's not human.   We thought the son of Satan would understand a move like this.  Peter and John high-five.   So even though you're not really the chief, we still get the rest of the cash, right bro?   Beat it, ya freak.  John and Peter high five and John swigs from the bag.    Peppermint...alright.  Adrian raises his eyebrows.  We see that the homeless lady is actually VALERIE in disguise.  She looks back, tense.  John offers Adrian the flask.   Drink up.  Here's to fifty million clams.   Whatever.  Knock it back, grab Nicky and let's get outta this hell-hole.  Adrian smiles at John, then raises the bag.  He stops just before it hits his lips.  He looks at John curiously.   Definitely.   This don't look good.   You mean, like, experiment with a Bunsen Burner?  What are you talking about?   Ozzy.  They faint.  The Bat's eyes go wide in fear.  Ozzy grabs the bat, his mouth grows big, and he bites the bat's head off.  Valerie hands Ozzy the flask.   You gotta kill yourself.",
        "Peeper": "Showtime!  We see a young mother walk into the room outside the Peeper's window.  She is wearing business attire.   Rough day at the office Mrs. Dunleavy?  Well you'll feel better once you slip off those work clothes and get into some sweats.  The mother sits on the bed and pulls off her shoes, rubbing her feet.   Oh my G-D, yes!  I wish you would let me rub those feet.  Of course I wouldn't use my hands.  Heh heh heh heh...  He sips some wine.  The mother starts to unbutton her blouse.  She takes it off, revealing a nice bra.   Looks like Victoria just told me her secret.  The peeper frantically writes in a dirty notebook.  Mouthing the words as he goes.   Thursday the ninth, eight-thirty p.m., first brassiere sighting...  I will pleasure myself to this image for months.  MONTHS I TELL YOU!  The mother starts to unbutton her pants.  Her young son walks in wearing a scouts uniform.   Young Scottie Dunleavy.  What unfortunate timing.  You mother was just getting comfy.  The son talks to his mother excitedly.   Yes, yes, I'm sure you tied many great knots today or whatever.  Now get out.  The son, not going anywhere, sits in a chair.   Now what.  This simply won't do.  The peeper takes out a cell phone and dials.  The son answers.   Hello, Scottie.  Why don't you go downstairs like a good boy and let your mother freshen up.   Just a little birdie.  A birdie who wants to see if your mother's panties match her bra.   Tell her no.  Tell her it's just a big bird.  The peeper starts flapping his arms and making bird noises. We SEE Scottie with his sling shot.  The mother nods yes.  He shoots it.  It hits the peeper square in the head.  He falls to the ground with a thud.   Mrs. Dunleavy, please come help me.  And wear your bikini.  The peeper looks up.  He sees Scottie pushing a television out the window.  It lands on top of the peeper.  He's dead.    We see the tunnel turn into more of a slide now and the peeper races towards the opening which is lit by fire.  He  Am I in hell?   I deserve this!   Just a couple of big fans of Nicky and the work his Dad does.",
        "Lucifer": "What's with all the whoo-whoo noises?   Last time you said that the renaissance happened.    Can I take him with me and have sex with his head?    Who's sitting over by a rock fishing in a small pool of fire/pond.   You know, I was the one who created Hell.   I started slow, though.  For years, I was just giving people hot foots. Actually, you can give all the credit for Hell to my first wife; she was the inspiration.  She was an ugly one, too. One day, she asked me if I wanted super sex.  I said I'll take the soup.  The Monster laughs really hard.   Take it easy there, Chewbacca.  In fact, you look like her mother, except she had more hair.  The Monster laughs even harder.   You know what was in Hell when I came down here, Cassius?   Nothing.  No mountains.  No castles. Looked like a giant parking lot.  It wasn't even called Hell.   Boogerland!   I can't enjoy anything.  I go fishing. I catch nothing.  I go to orgies, I catch everything...  We hear the Monster laughing again as we PAN DOWN Grandpa's fishing line to:   Royal flush, you lose.  Off with the bra.  The Demons and Gatekeeper are sitting around playing strip poker.  The Gatekeeper takes off his bra.  From behind, we see his breasts flop out.   Last time I saw a pair of jugs that big, two hillbillies were blowing on them.  The Gatekeeper throws his hand down and storms out.  The Monster laughs uproariously.  Nicky enters and moves to what's left of his dad.  Arms, torso, and a head (with one ear).   All boobs and no balls.   I don't get no respect.   Let me handle that.  Lucifer walks over to the closet.   And I'm not using a pineapple this time.  He pulls out the flask.",
        "Todd": "I know exactly how you feel... The night Reagan was elected, I said to my mother, \"Is this man going to blow up the world, Mommy?\"  Then we both cried for like an hour.  Somebody's here.  Call you later.  Todd gets up and opens the door.  It's Nicky, with Beefy by his side.  Nicky is nervous, and his speech sounds practiced.   Uh, don't you want to know what the rent is?  Nicky looks down at Beefy.  Beefy looks up at Nicky.  Both nod imperceptibly.   Eight-hundred, split down the middle. Tuesdays and Thursdays I rehearse with my scene partner so the living room will be off limits.   Right.  And as far as household items: we can share the soap, but we'll split the cost 60/40. Cause the person who physically goes out and buys the soap shouldn't have to pay as much as the other guy.  Aren't you boiling in that outfit?   It's like eighty degrees in this hallway.  You from the South?   Why is that funny?   And sorry, man, but no dogs allowed.  Todd turns and goes into the apartment.   Yeah, your bedroom is right over there.  The door closes.  Beefy looks down at the welcome mat.  It reads: I \"heart\" METHOD ACTING.  Beefy raises his leg over it.    Beefy turns to Nicky.   What are you doing?  Todd is standing in the doorway.  Beefy runs to the fire escape.  *******************   I know it's your living room night.  But can I finish watching the Globetrotters' game out here?  To me it's classic Comedia Dellarte.    The TV clicks on.  We see TODD sit down and look at the TV. Nicky's behind him.       A black guy?    Todd's baffled, looking at his roommate on TV.  Beefy is watching from the fire escape.   What's Nicky doing down there?   Did you just talk?    Beefy is watching, transfixed.    A homemade cake is laid out.  It reads: CONGRATULATIONS, NICKY.  JOHN, TODD, PETER AND BEEFY are there.   So your father's the devil, you're a talking dog sent from Hell, and you guys are who?   I gotta say this cake tastes a little funny.   I was in love one time but she said I wasn't financially reliable enough.  And she needed that.   No.   Why?  Did she hurt you?  Do you miss her?  Need a shoulder to cry on?   Oh, would you grow up.   You guys want to stay?  I have a futon in my bedroom.   That is the most frightening thing I have ever seen.  Nicky stands and moves to the window.  He looks out longingly over the sleeping city... achingly.  RACK FOCUS behind him, we see Todd nodding encouragingly in the reflection.    Beefy and Todd are watching TV.  They look over to see the insects scurry under the front door and morph back into one exhausted Nicky.   Been breaking all morning.    Nicky's outraged.    Nicky stands outraged.   ...which is by far DePalma's best work...   Looks like they're following a giant trail of bug shit.   I've always wanted to kill someone.  Can I do it?   Die, Grandma, die!  Nicky's arm comes out with a thumbs up.  Pause.  The hand drops back in.  He's dead.   Where is he?  He's late.   You guys.  That was so uncool.   Run, Beefy!  Run!   They castrated him.  He can't shoot arrows, he can't piss smoke.   One thing I really regret is never having experimented sexually.   His name is Andrew.  I know that guy.   Oh my G-d, he just opened his mouth and swallowed that spit.",
        "Gatekeeper": "Welcome!  The peeper looks left to see the GATEKEEPER standing at his station greeting the new SOULS with mock cheer.   What do you think?  A GIANT BIRD appears and bites the peeper's crotch area.  We leave the peeper in the pit and tilt up to...   Hey, what are you doing?!?  They get closer to the fire.   You can't go through there.  The fire flows in, not out.  They dive through the fire wall.  It FREEZES.   You know something?  You guys suck!  You really suck!  Sirens go off.  Dogs start barking.  Lights flash.  And we hear the sound of DAMNED SOULS hitting the back of the firewall hard.   Your highness, Cassius and Adrian have escaped from hell.  They went through the fire, and they broke it.  I think they took the New York tunnel.  I tried to stop them, but they overpowered me, sir.   Thanks for being so understanding, your worship.  You're the man.  You've always been the man.  Dad's EYES GLOW RED as the Gatekeeper stands up.  Two huge boobs grow out of either side of the Gatekeeper's head.  We only see them from the front for a second. From behind the gatekeeper, we see the boobs but not the nipples as he talks to Nicky.    I'm lucky to get away with just the head boobs, right?   That's what I'm thinkin'...  Dad is staring off.  He looks shaken.   Oh, this is gonna be a whole new lifestyle for me, isn't it.   Hey.   Thanks.   You got it.  Could you maybe not tell anyone about this?   Bus?    You like that?  You think that's funny?  The Gatekeeper swirls his tassels.   How about that?  You like that?  The Monster howls with delight.   Doesn't sound very good behind there.  I hope Nicky's kicking some ass on Earth.  The Monster is smoking a cigarette and wearing a leather biker's hat.  He nods along in agreement.   I know, your wickedness.   It's Stanley, sir.   What was it called, sir.   That's nice, Grandpa.  Why don't you just enjoy the fishing?   You'll get nothing out of me.   The only way to save your dad is for you and your brothers to pass through the gates at the same time before he deteriorates completely.   Thirty minutes.  And then whoever claims his throne will have unimaginable power.  Adrian throws him down.   Absolutely.   I don't know how you came up with some of it.",
        "Valerie": "Excuse me, does that flask belong to this man?   Look, I know you come out here and sell stolen stuff all the time.  But today, the guy you stole from just happened to walk by and bust you.  So why don't you admit today's not your day and give him his flask back?   No, but maybe that cop over there might have something to say.  Valerie points to a cop across the street.  The Street Vendor ponders this for a second, then...   Fine.  I will.  Nicky picks up the flask and the drumstick.   That's okay.  I get messed with all the time and when I saw him doing that to you I just lost it.  I hate when people take advantage of tourists.  It ruins it for the rest of us.   I'm sorry.  I just assumed.  Your accent maybe.  Where are you from?   Really?   Why are you laughing?   My dad's an optometrist.   I'm sorry.  It's really tough when your parents get older.   Well, I'm sure a nice southern boy like you will figure something out.  Nicky is experiencing new sensations as he looks at her.  He hands her the half-eaten drumstick.   That's alright.  I already ate lunch.  I actually wouldn't mind getting a Gelati.   If you want to.   \"Octopus people?\"   It's not that cold.  Here, let me wrap it.  Valerie takes a few napkins and wraps it for Nicky.  Just then the PREACHER walks by.  He quickly turns his head, sensing Nicky.   This town is really going to hell lately.  So what part of the city do you live in?    You have a dog?  What kind?   I'd love to have a dog.  But I go to school full time.  It wouldn't be fair to the dog.   Parsons School of Design.  I knew growing up I wasn't much to look at, so I put my energy into making things that are pretty.   My perfume?  He takes her wrist to his nose.  He stares at it, licks it.    It's called \"Comptoir Sud Pacific.\" Which I think is the French word for coconuts.  Nicky stops and looks at her.   Sometimes, sure.   Basically, yeah.   You know what's nice about you?  You just seem happy being yourself.  You don't try to act cool.   What?  Up the street, Adrian's eyes redden.  NICKY looks like he's been stunned by something.   What was that?   You're a jerk.  She turns and walks away.  Nicky looks over and sees Adrian. His inner voice speaks to him.   What the hell's your problem?  She runs away crying.  Nicky turns to Adrian who's still across the street.    Nicky crouches outside her window and peers in.    Cool music.  She is up late.  Working by candlelight on a fantastic design.  Something's not working.  She drapes a beautiful fabric over another.  She smiles at the combination.  She is happy being creative.  Nicky feels his heart swell as he watches her.   Nicky?  Oh my G-d.  Stay right there.  Pause.  Valerie opens the window and sprays a can of mace right in Nicky's face.   What were you thinking coming here?    We see Nicky hurtling toward the street.  Holding his eyes.   Oh my G-d, I'm so sorry!  Suddenly he stops.  Suspended above ground.  Valerie doesn't hear the expected thud.   Nicky?  He floats up, but he can't see.   Are you dead?   What are you doing?   Why would you be floating?   Am I supposed to not be freaked out right now?  Because I am.  He's floating up.  He slows down.   I'm over here, Nicky!  To the left.  Nicky is parallel with her.  He hovers in front of her, eyes still watering.  She punches Nicky in the face, and he flies back ten feet.   Look, just because you're floating doesn't mean I'm gonna forget about you giving me the finger.   What do you mean, \"possessed?\"   Yes...   ... \"The Devil?\"...   Okay, now I get that \"deep south\" joke.  Nicky laughs.  Valerie joins in.   I don't know if I should believe you.  Nicky starts to drop.   Okay, I do.  Get back up here.  He floats up to her holding out his hand.  Nervously, she takes his hand and suddenly she is lifting off and they are flying.   This is amazing.  They soar past some more buildings.   He's kind of ruining the mood.   Can we go fly over Central Park?   We're going to Jersey?    \"Mister Crowley, what's inside of your head...\"  Nicky's jaw drops as he stares at her.   Don't do it.   You think so?  Why don't you come a little closer and I'll show you a better angle.  He moves a little closer, and she spits on him.  He smiles. Opens his mouth and catches her spit.  He swallows.   Nicky!   Where'd a sweet Southern boy learn to fight like that?    Nicky. Nicky.  No response.   You gotta fly out...I know you can do it.  Do it for the butterflies.  A long beat, then:   Put him in, Ozzy.  Ozzy spits the bat head into the flask.   Grand Central, Nicky.  Start running.    Nicky picks up a big rock and hands it to Valerie.   I love you.   Thank yo.",
        "Veran": "",
        "Nicky": "Looks like an American teenager's room - models, a dresser, heavy metal posters  everywhere (but no bed - Devils don't sleep).  Nicky is air guitaring to the song.  Over at the stereo, we see the cassette playing titled   The head demon, JIMMY THE DEMON, opens the door, scaring NICKY who falls backward into the table, breaking it.    Hey...   Okay, but Jimmy, when the house is rockin', don't forget the knockin'!   Good, thanks.  Cassius snaps his fingers in Nicky's face.   Actually, I'll take a rain check on0  Nicky is slammed into a nearby desk as if by an invisible force.    Yes, you got me...  Nicky's head slams back down again.    Got me for sure, yes...  He grabs a lamp off the desk and cracks himself over the head.   Oh no.  Please Cassius...  Nicky's hand is being possessed.  It gets closer and closer until it latches on to Nicky's crotch.   Aaaaah.  Cassius concentrates even harder, making Nicky twist his own hand.  Nicky screams even louder.  Adrian smiles.  They don't notice that DAD, wearing a sweatsuit (and with very small devil horns), enters behind them.   Nothing, Dad.  Just re-arranging the furniture.   Hey, Dad, I'm almost finished laying down my monsters of metal compilation tape.  I really think it's a masterpiece.   Don't worry about coming up with anything.  It's cool.   Hallelujah.  They all look at Nicky.   I mean...tough break.   Definitely.   Well, I thought that after messing with your head, I'd give you a little kick in the keester.  Hits the tape player.  \"Enter Sandman\" blasts.   Metallica, Dad.  Come on.   You're a good devil, Dad.   Coulda been much worse.   How bad?   We gotta get this bad boy burning again. Ideas?   So go get 'em, Dad!   So go get 'em, Jimmy!   You're not saying it's up to me?  The MONSTER puts his hands over his eyes shaking his head as if to say, \"oh no.\"   I've never been to Earth.  I've never even slept over at some other dude's house!   Are you telling me I have to go to Earth and kill my brothers?   No.  This can't be happening.   Okay. Earth.  The Blue Marble.  This doesn't look too bad.  Nicky sees a fast approaching light, furrows his brow and  I got hit by a big light that was attached to a lot of metal.   Well, I guess I'm going to have to take a mulligan on this one.   I'm Nicky.  Beefy drops the sign from his mouth.   I just need to find my brothers and be on my way, Beefy.   Okay, \"bro,\" this jig is up...  Just get in the bottle.  Just slide right on in there.   Oh.  Sorry.    It's freezing up here, Beefy.   I also have this odd pain in my mid section.  Kind of a hollow feeling...   So far, so good.  Now what?   Hey...Popeye's chicken is ass kickin'!   I got energy up the ying-ying.  Let's get cracking!  NICKY stands with a drumstick and jogs off the curb right into the path of a moving bus.   That's a pretty brassiere.   Could you maybe not tell anyone about this?   You got it.  Nicky turns and walks toward the firewall.  As soon as his back is turned, the monster pantomimes to the Gatekeeper, \"I love your boobs.\"  The Gatekeeper gives a flirtatious laugh .   From now on.  I'm just going to avoid all moving metal objects.   Hello, friend, my name is Nicky.  I understand you're seeking a roommate, as per your advertisement in the Village Voice.  Would it be possible for me to fill the slot?   Yes.  What is rent?   Off limits.   No.   Yeah.  The deep South.  Nicky laughs a little too hard.   I don't know.   Got ya.  Is it okay if I do the sleep thing?    Nicky is sleeping on top of the hissing radiator, fully clothed.  When he inhales through his nose, we hear that familiar snoring/snorting sound.  But when he exhales, we hear disturbing \"speaking-in-tongues\", Exorcist-style voices.  SLOW PAN across the room to the doorway where Todd stands, looking concerned.   This is intense!  And it happens every day?  Sometimes twice?  I gotta tip my hat to you people!    Okay, just point me in the right direction next time.   Well, let's rock and roll.  Nicky looks at the next person walking by.  It's a CHINESE DELIVERY GUY on a bicycle.  Nicky clotheslines him, taking him off the bike in a sleeperhold/headlock.   Get in the bottle.  Dad's falling apart. You froze the gate and you're killing him.  Drink!  Nicky puts the flask to the Chinese Guy's lips.   just get in the flask!  The Chinese Guy breaks loose, gives Nicky a roundhouse kick to the head and runs away.  Nicky gets up.   Adrian and Cassius!  You think a kick to the head is gonna make me throw in the towel?  Well, in the immortal words of Judas Priest, \"You got another thing comin'.\"  Beefy shakes his dog head and sighs as we see Nicky hold the bottle up to a few more PEDESTRIANS.   Beast.  The Monster laughs.   All that running and chasing is making the sleep thing want to come early.   Oh nooooo....  Fire shoots out of Nicky's mouth.   Which way did he go?   Iron Maiden live double disc is simply phenomenal.  He runs off.   Hey...   Yes.  I would like my flask back.  The street vendor stands, very angry.   No, I'm just calling you... a guy who has my flask.    I don't know?  A YUPPIE JOGGER is checking out the flask.   It was handcrafted in hell by Satan himself and is only to be used for the capture and containment of my blood brothers so that the firefall of Hades will burn brightly once again.   Sir, I would prefer if you didn't raise your voice.  It's making my muscles tighten.  We see that Nicky's eyes are starting to glow red.   Hey, mister.  I'll be seeing you in a few years.  Valerie gathers her blanket, starts walking away and Nicky follows her.   That was amazing.  Thanks so much.  You didn't have to do that.   You think I'm a tourist?   The South.   Yeah.  Deep south.   She laughs along with him, not sure why.   I don't know, but I like it.  Say.  Your glasses are nice.  They make your eyes look sparkly and big.  It's fun to look at them.   My dad's in hell, and he's falling apart.   If I don't save him, I don't know what I'm gonna do.   Here, have a Popeye's.  This drumstick ain't for beatin' it's for eatin'.   Could I come with you to getting a Gelati?   Want to?  A million angry octopus people couldn't hold me back!   Uh, it's a deep south expression.  Nicky laughs.   It's freezing my hands.   I have an apartment.  I don't remember exactly where.  My dog knows, though.   I'm not sure.  I'd ask him, but he's uptown talking to his contacts.   School?   What's that pleasant smell coming from, your skin?   Valerie, it feels like there's a bunch of butterflies flapping around in my stomach.  Is that normal?   Good.  I was concerned.   So you're saying, make all pants with a drawstring, then heavier set gals don't have to feel humiliated by telling their waist size in front of the whole store?   Wow.  Maybe you should make drawstring socks for gals with fat ankles.  Valerie laughs.   Thanks much.  You know what's nice about you, Valerie?   Your juicy, heart-shaped ass.    I...I don't know why I just said that. I meant to say that...   ...I've always wanted to have sex with a gross pig.  What do you say we go behind that dumpster, pull our pants down and see what happens?  Valerie's very hurt.    Please, get out of my mind!  Adrian's eyes flash.   Hey, Valerie!  She stops and turns.  Nicky RAISES his fist to resist Adrian's force.  It's too much.  His middle finger comes up, giving her the \"finger.\"   Adrian, you gotta come back to Hell. Dad's sick.   Yeah, he needs souls to live.  When you guys left, you broke the gates.  We gotta get the gates burning again before he dies.  Adrian processes this.   Well maybe you should go back and talk it over with him.   Adrian, please...  Nicky, fighting control over his body, walks slowly and crazily into the middle of the street where he sees a large truck bearing down on him.  JOHN and PETER get blood splattered on them.  Peter looks down to see the \"666\" forms in blood on their clothes.   What can I do about it?   Nobody's as evil as my brothers.  Those dudes put the wick in wicked.   But those are my roommate's sodas...   Release the evil?     That guy in the striped shirt snaps his fingers like someone I know...     It looks like the work of a brother...   If it's Cassius, yes.  Nicky races for the door.   I'll take the shot.   Release the evil.  His eyes get red.  Staring at the ball, it explodes.   Okay, too much evil..  Bill Walton's hair is on fire.    Could I get another ball?  The court announcer throws out another ball.  Nicky stares at it again with red eyes.   I command you not to blow up and go into that metal circle.  Nicky throws an underhand shot.  The ball arcs through the air and is about to go in when the ref comes out of nowhere and swats it away.   I know you're having fun, Cassius, but you gotta come back to Hell.   Listen up, New York.  Your souls are in great danger...  Nicky gets hit by a hot dog.   Alright, how about this?  I get one more shot.  The ref will cover me.  I miss it, the Globetrotters forfeit the game. I make it, he doesn't ref the second half and we all start conducting ourselves like decent human beings again.  The crowd is silent.   And we get free pizza.  The crowd roars.   You know, Dad got very sick when you left.    Nicky's head starts turning and does a 360 (like the Exorcist).  He ends his flight by slamming down a thunderous dunk, cracking the backboard's glass into pieces.  He hits the ref on the way down.  The crowd CHEERS, finally happy again.   Never doubt my skills.   Sorry, Cassius.  Maybe it was the super devil juice Dad gave me.  HE thought I might need it for just such an occasion.    No.  No way.  Dad said it was only for me.  The ref rips the flask from Nicky and drinks.  Cassius screams like bloody hell as he is sucked out of the ref's mouth and into the bottle.  WHOOSH!  The ref slumps to the floor.   Absolutely nothing.  The Blizzard always came straight with his messages.  But wrap your minds around this one.  Nicky gets up and we see his is sitting on a hibachi.  He pus on a James Taylor album and plays it backwards.   What's reefer?   Not again, fellas.  It kind of hurts.    All right...  Nicky loosens up his neck and makes his head go around 360 degrees.  Everyone cracks up, high fives.  Even Todd LAUGHS. PAN OVER to Beefy, who has bloodshot eyes.   I'm only fifteen...thousand years old.  Everyone cracks up.   A little strange.  I can't stop thinking about this girl, Valerie.   We had the greatest afternoon of my life until Adrian made me tell her she had a heart-shaped ass.   No thanks.  I'm afraid I wouldn't be able to give Ozzy the focus he deserves.   See ya, fellas.  They leave.   Todd.  Which way to the Parson's School of Design?    Coconuts...  Nicky goes to the fire escape and starts to climb.  His nose leads him.  He reaches the window, sniffing heavily.   You smell like coconuts.   No thanks.  I'm looking for a girl named Valerie who also smells like coconuts.   Thanks, much.  Good luck with the genital tucking.   Adrian?    He's so enraptured he leans forward trying to kiss her.  His head bumps the window.  She turns, startled.  She sees the beaming Nicky.   Hey.   Oh that stings!  My eyes are on fire!  Nicky stands up and stumbles around.   I'm not sure, but it didn't involve getting blinded with poison.  He bounces off the front rail, stumbles backward and goes flying over the back rail.   Valerie?   No.   I think I'm floating.   I don't know.  Maybe it's because of your sweet voice.   I can't see you but I can smell you. And you make me feel alive in a way I've never felt before.  CUT TO REVEAL he's floating outside the student's window. The student's dripping candle wax on his belly.   Oh.  Sorry, Andrew.  Valerie?  Nicky resumes floating up.   That wasn't me.  I was being possessed by my brother, Adrian.  He's the one who call you a gross pig.   Remember when I told you my Dad was in Hell?   Well, that's because he's the Devil. And he wants to keep his throne for another ten-thousand years.  Which is fine with me, but not with my brothers, so they broke out of Hell, causing my dad...   ...to decompose.  And I love my  Dad very much.  So I came to Earth to save him but then crazy eyes stole my flask and I met you and...well, my dog tells me I just might be in love with you.  His vision is clearing and he can start to see her.  She is totally in shock but still here.   You gotta believe me.  You gotta believe in the butterflies.   Let me take care of that.   Next time.  Tonight, I want to share the most beautiful thing I could possibly imagine.   East Rutherford.   I never thought I'd ever see Ozzy live until he was dead.  Please tell me you like metal.   My dog was right.  I'm in love with you.  They slow dance tighter.  The music swells.  John and Peter look up from their seats far below.  Nicky sees them while he's holding her tight.  They give thumbs up.    Moo ya san jie bay!  The Koreans just glare.  Nicky's confused.   What's going on here?  But when he heads downhill, the GUYS IN WHEELCHAIRS start to catch up.  They get closer and closer until... Nicky makes a last second right turn into an alley.  The wheelchairs can't slow down and crash into a double decker tourist BUS at the bottom of the street.  The TOURIST on the top level look over the edge to see the crash.   Ow...what was that for?   Release the evil.  Nicky's body splits into about five-hundred horrifying insects, all with a miniature NICKY HEAD.  The Nickysects run right at the crowd, and the crows immediately starts running the other way, completely freaked out.   I seem to be in trouble, Beefy.   I didn't murder anybody   I was with Valerie, I swear.  This is Adrian's work.  I've got to find him.   This is baloney!   I'm not Nicky.  I'm not home!  I don't live here!   I thought for sure I gave 'em the slip.  Todd i s looking out the window.   Good idea...kill me.   Yes.  I'll meet you at Grand Central at noon.  Okay.  Do me.  I command you.   That just hurt a lot.   Dad, Adrian's got the whole city after me.  He's always a step ahead.  What am I gonna do?   Uh, I'll do my best, Dad.  Do you have any advice at all for me?   Urrr...uggh...  Oww.  Adrian, this is very painful.  Nicky comes flying out.  John's body slumps to the floor next to the chief's.  Adrian looks in the \"Schnapps bottle\" to see the flask wrapped in paper.  He peeks inside.   I won't drink.  You can't make me.  Adrian looks over at Valerie.  Suddenly she comes flying over to him.  He grabs her by the throat.  We hear a train coming in the distance.   Let her go.   I have to, Valerie.  We see Beefy skid to a stop, raise his leg and a full size archery arrow shoots out of his penis and tracks right into  Valerie!!!  Nicky leaps down onto the tracks, wrestles Valerie away from Adrian and tosses her off the tracks.  Adrian looks at Nicky.   That's terrific.  Now could you ladies point me to the Black Palace?  I should check in with my dad...  Nicky trails off as he sees the Angels laughing at him.   The home of eternal damnation, house of Hades, H.E. double toothpicks...   My brothers told me my mother was a mountain goat.  Which would explain my chronic halitosis.   My mom wasn't a goat?   An angel?   Wow.  What...what did she look like?    How come you're not older?   Are you Adrian and Cassius' mom, too?   I don't think so.   Where did you meet my father?   And that made you want to make a baby with him?  The Angels laugh.   Well tell her I said \"hi\" back.  Angel makes a motion towards the phone, then stops.   How did you see me?   Hey, that's Dad's throne!  How did Adrian get that?  Is Dad okay?   Valerie's crying!   I gotta help her.  I gotta help Dad.  I gotta help everybody.   But how can I win?  Adrian is stronger and smarter than me.   A speech impediment?  The girls laugh.   What is it?   Well, nice meeting you, Jenna, Christa.  Would it be okay if I called you Mommy?   Well, Mommy, get me to the big apple cause I'm gonna rock that town like a hurricane.   Release...the good.  When he opens them, BEAUTIFUL BUTTERFLIES are floating around the head of five of the DEMONS.  They stop approaching. THEIR EYES TURN FROM WHITE BACK TO NORMAL.  And their facial expression changes to happiness.  They wave at the butterflies.   Release the good...  Five more are stopped by something.  They look down and see fluffy white BUNNY RABBITS at their feet.  They start petting them.  The REMAINING DEMONS advance on Nicky.   Release the awesome.  ...then stop, their path blocked by a very large bucket of POPEYE'S FRIED CHICKEN.  The Demons consider the bucket of chicken.  One Demon takes out a piece.   Put it in your mouth and let it slide down your throat-hole.  The Demon bites into it.  He can't help but grin a little.   Adrian, I'm asking you nicely, in the name of all that is good: release my friends and get in the flask.   No.  It's the inner light.  And with it we can defeat anything you've got.   Okay, Adrian, you've left me with no choice.  Nicky leaves frame and he flies up towards Adrian.   Love lifts me up where I belong.   Now I'm asking you nicely, get in the flas...  Adrian grabs a pillow and hits Nicky hard in the face, sending him flying off the bed.   Oh, you wanna a pillow fight, do you?!  Nicky is an expert pillow fighter.  He lands a series of awesome, almost Matrix-like pillow moves.  Adrian is dazed.  Nicky finishes him off by tossing the pillow high in the air to him.  Adrian looks up to catch it and just before it lands, Nicky steps up and pops him in the face.  Adrian goes down hard.  Nicky towers over him.   Now will you get in the flask?   Sole ruler of Hell and Earth is what I heard him keep saying.  We HEAR the sounds of a struggle.  All the Demons and all the people of NEW YORK form a large circle around the flask.  Valerie and the gang make it down off the stage.  We HEAR crazy sounds as the FLASK starts to jump.  The crowd REACTS.  A big dent pops out from the inside, followed by a horrible thud.   That was Cassius!  The FLASK starts rolling over and over on the road.  People get out of the way as if it were real people fighting in the street.  They root for their side.   From my dad's side of the family.  She laughs and kisses him on the mouth.  The crowd CHEERS. But Nicky won't stop kissing her.  She starts to struggle for air.  Nicky presses harder and starts to laugh.  The crowd stops CHEERING.  Valerie is waving her arms for help.  Nicky turns into Adrian during the kiss.  Adrian lets her go.  And we hear ADRIAN'S familiar laugh.   Butterflies...  And Nicky shoots right out of the top of the flask and lands on his feet.  Adrian lands and stares down Nicky.  The clock is one minute from midnight.  Adrian swoops down.  Nicky thinks quick and pulls out the BALL his Mom gave him and smashes it on the ground.  Out of it forms metal G-d: OZZY OSBORNE.   I'll just go to Heaven.   Sorry, Henry.  Release the Evil.  Henry is covered in bees once again.    Nicky picks up a big rock and hands it to Valerie.   Do me.   I love you.  Valerie smashes the rock on Nicky's head, killing him.   I came through for you, Mom and the butterflies, Dad.   What about you and Grandpa and everyone in Hell?   I will, Dad.  But in the words of Motley Crue, this will always be my...home sweet home...  He pats him on the back.   Zachariah, say you're sorry.",
        "John": "'Bout time...  Nicky snores.  It sounds like \"I will eat your hearts.\"  The worried people run away.  Nicky snores.  Children on the Carousel, going real fast, upset.  Nicky snores.  Peter and John walk over to a position near Nicky's bench.   There's our man.   What's with that guy?   Yo, man, I think that devil guy just got ripped off.   Yeah.  You do it.  Peter gets up and shakes Nicky who comes to with a loud  That way.  Nicky is about to run off.  Looks at John's shirt.   The Dark Prince is here.   Six, six, six, pick up sticks.  They high-five.  The only happy fans in their section.   By the way, Nicky.  Check this out.  He spins his Black Sabbath backwards.   What's Ozzy trying to say there?   No wonder your uncle's so weird...   Come on.  One more time.   She was human?   I dated a Japanese girl once.  My parents disapproved.  Not cause she's Japanese, but cause she was only fifteen.   By she, do you mean he?   Easy, Liberace.   That's a big pass, Elton John.   Whoa, that chick must be the real deal, then.  Later on.   There's like a total mob scene coming this way.  We hear VOICES of an approaching crowd coming outside.   What would your dad do, Nicky?    Alright!  John takes Nicky's head and slams it hard into the kitchen counter.  Nicky is dazed.   Look at Queen Latifah steppin' up.   Little nervous.  Wanna puke.  They approach the cops guarding the door.   Looking for the chief.   Sure do.  You got what we want?   We think he's the son of Satan.  PAUSE.  The chief LAUGHS, then everyone else does.  He walks over and picks them up by their throats.   Noon...  They look at the clock.  It's noon.   ...ish.  Peter is sweating, kinda nervous.   But what about the cash?  Can we keep it or what?   No thanks...but we'll take that bottle of booze.    Schnapps...   Wanna hit?  Hands it to him.  He takes it.   Weed lowers the body temperature.  I read that...in, uh...er, science magazine.  Adrian stares at John.  He raises the bag again.   And give you a good buzz.   Uh.  No it won't?  John starts to tremble a bit.   Urr...uggg...errr...   Urrr...uggh...  Oww.  Adrian, this is very painful.  Nicky comes flying out.  John's body slumps to the floor next to the chief's.  Adrian looks in the \"Schnapps bottle\" to see the flask wrapped in paper.  He peeks inside.   Can't Beefy use his penis powers to get us out of this?   He means getting it on with someone like that freak.   Of course you do, Tommy Tune.   You want a queen?  Got one right here.  John points at Todd.  They laugh.  Adrian gets closer to Valerie.  Just then a big butterfly appears on his shoulder. He looks down to see:  Nicky standing there with his army.   Ozzy.  They faint.  The Bat's eyes go wide in fear.  Ozzy grabs the bat, his mouth grows big, and he bites the bat's head off.  Valerie hands Ozzy the flask.   He'll never make it.",
        "Beefy": "Hey, terrific!!  Now get off the track and come with me, shitstains.   My name's Beefy.  I'm an old friend of your father's.  He's asked me to help you out.   It's not gonna be easy.  Your brothers can possess people.  So they probably won't look like themselves.  You have to be suspicious of everyone.  Nicky looks at Beefy warily for a beat.   It's not me, moron.   Makin' friends already.   You're on Earth now, kid.  Gonna have the same physical needs and limitations a human has.  We'll stop by K-mart.  Get you some warm clothes.   That pain is hunger.   Put it in your mouth.  Nicky puts it in his mouth.  Holds it there.   Move your teeth up and down.  Nicky does.  He chews for a long time.   Now you gotta swallow it.  Tilt your head back and let the meat slide down your throat-hole.  Nicky does.  He gets a looks of complete joy on his face.   It sure is.  Now eat it up.  You're gonna need your energy.   Great.  Now your father gave me some deposit money for a nice pad on the Upper East Side.  But I misplaced it.   So I found this other joint for you. But you're gonna have a roommate.   You'll be alright.  Go on.  Big day tomorrow.  Don't forget to do that sleep thing I told you about.   Look, it's okay for me to shit the street.  But you gotta use a toilet.   Come on, there's like ten million people in this city and the clock is ticking.   I think we have to work on narrowing down our list of suspects.  Now I'm going to go check in with some of my contacts uptown.  Beefy hears Nicky's strange terrible snores.  He's asleep. Beefy sighs.   Kid's got a lot of evil in him, just begging to come out...  Beefy walks away.   Remember, it's not the size of the boat, it's the motion of the ocean.   Your brothers are upsetting the balance of good and evil.   You can't do jack shit... unless you learn your evil powers.   Go get a soda out of the fridge.    \"But those are my roommate's sodas...\" Does that sound like a statement the son of the devil would make?  Nicky, ashamed, gets a Coke out of the fridge and places it on the coffee table.  He and Beefy sit on the couch and stare at the Coke.   You have the power to change the cola in that can into any other liquid - engine oil, bat's blood, moose piss.  You just have to release the evil within you.   I'm just saying, there's wickedness in you... I can tell from your snores.  Nicky stares at the can.   Release your evil...  Nicky frowns and bites his lip.  The can rattles a little.   Trying to capture his brother in a flask and preserve the balance of good and evil on Earth.  Todd looks over, suspicious.   No.   Take him to the hole, Nicky.  I mean, woof!  Woof!  Todd looks at Beefy, terrified.   I used to get baked like this with my first girlfriend, Heather.  We'd get so stoned she would forget I was a dog.   Actually, she was a sewer rat.  Man, that pissed my parents off.   Busted.    Maybe you love her.  But what do I know? I'm baked out of my mind.   You better snap out of it soon, kid. Cause we're going after Adrian tomorrow. Seven AM.  Nighty, night.  He falls asleep and starts snoring.  We hear the SOUND of THREE LITTLE GIRLS singing \"Ring Around The Rosie\" as he exhales.   The shit has hit the fan, kid.  Take a look.   Look.  You were really high.  Things happen.   I think you're looking at him.   He superimposed your head onto \"Scarface.\"   I don't know, this is a little out of my league.   He'll be here.  Just keep your cool, kid.  They hear FOOTSTEPS.  They turn and see the chief of police backed up by the huge police force.   We've been ratted out.  Beefy and Todd turn to see John and Peter looking sheepish.   Now that hurt the both of us.  Valerie is able to escape momentarily.  Adrian reaches for her, grabbing her.  They both spin and fall down onto the tracks.  Right into the oncoming train.   I can't screw.  I can't screw.  Valerie's crying.   That turn you on there, RuPaul?   No if you do something bad right before you die.  PAUSE.  Everyone looks around.  Nicky spots Henry Winkler.   Only a quarter, ma'am.  She tickles the baby.  It giggles and a small stream of fire shoots out of his mouth and singes the Old Lady's eyebrows.",
        "(voice)": "",
        "Referee": "",
        "Holly": ""
    },
    "imdb_rating": "5.3",
    "description": "When somebody's mother is an angel and his father is the devil, life can be really confusing. For a sweet boy like Little Nicky, it just got a whole lot worse. His two evil brothers Adrian and Cassius have just escaped from Hell and are wreaking havoc on an unsuspecting earth. His dad is disintegrating and it's up to Nicky to save him and all of a humanity by midnight before one of his brothers becomes the new Satan.Anthony Pereyra {hypersonic91@yahoo.com}",
    "name": "Little Nicky",
    "genres": [
        "Comedy",
        "Fantasy"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTQ4MTk3Mzk5NV5BMl5BanBnXkFtZTYwMTQ3NzI3._V1_QL75_UY281_CR1,0,190,281_.jpg"
}