{
    "filename": "Lone-Star_script.txt",
    "imdb_id": "tt0116905",
    "imdb_url": "https://www.imdb.com/title/tt0116905",
    "characters": [
        "Charlie Wade",
        "Hollis",
        "Young Hollis",
        "Mikey",
        "Mercedes Cruz",
        "Fenton",
        "Amado",
        "Enrique",
        "Buddy Deeds",
        "Cliff",
        "Molly",
        "Deputy Travis",
        "Pilar",
        "Sam",
        "Celie"
    ],
    "dialogues": {
        "Charlie": "",
        "Wade": "This beaner fare doesn't agree with me, but the price sure is right.   Jimmy got a kitchen full of wetbacks, most of 'em relatives. People breed like chickens.   I roust some muchacho on the street, doesn't have his papers, all he got to say is \"Yo trabajo para Jimmy Herrera.\"  Wade folds the money and stuffs if in his pocket--   You got to keep the wheels greased, son. Sheriff does his job right, everybody makes out. Now this is gonna be one of your pickups, Buddy. First of the month, just like the rent. Get the car, Hollis.  Wade and Hollis slide out of the booth to stand.   Come again?  Buddy looks Wade in the eye, seemingly unafraid.   There's gonna be some left over for you, Buddy. I take care of my boys.   You feeling bad for Jimmy? Have him tell you the size of the mordida they took out of his hide when he run a place on the other side. Those old boys in Ciudad Leon--   You do whatever I say you do or else you put it on the trail, son.  The CUSTOMERS are all watching now, nervous. Buddy thinks for a moment, not taking his eyes off Wade.   Who said anything about shootin' anybody?  Buddy has his gun out under the table.  He slowly brings it up and lays it flat on the table, not taking his hand off it or his eyes off Wade.   You're fired. You're outta the department.   You little pissant--   You're a dead man.  He turns and nearly bumps into Hollis. He gives the Deputy a shove.   Get the goddamn car. We're going to Roderick's.    Watching Young Otis with narrowed eyes--    A man puts a slip of paper in Otis's pocket, pats his back. Otis winks to acknowledge the bet, turns, makes eyes at a PRETTY WOMAN sitting at the bar, who is eyeing him back.  He lays the beers and glasses on the table, starts away.   Pour it.   Pour it.  Expressionless, he starts to pour the beer into Wade's glass. The Sheriff looks up into his face--   I know you?   Otis what?   One of Cleroe Payne's boys?   I sent your Daddy to the farm once.   Why you think that was?  Otis feels people watching.  He doesn't want to lose face--   As I remember it was because he had a sassy mouth on him. Must run in the family--You wouldn't be runnin' numbers out of this club, now, would you, son?   Runnin' numbers without I know about it is both illegal and unhealthy. You remember that.  The beer is poured. Otis starts away--   Whoah, son. You're not finished. Pour his.   Shut up, Hollis. Pour.  Otis meets Wade's look now, pours the other beer--   How come you don't took familiar?   Houston, huh? I hear they let you boys run wild up there.  No response. Wade deliberately pushes the glass away so beer splashes on the table and drips into Hollis's lap--   Aw--look what you done now. Better get something to wipe it up, son.  Half the people in the room are watching now, the other half moving away to relative safety. Otis tries to keep a lid on his temper, looks around the room--   I told you to do something. Are you gonna hop to it, or are we gonna have a problem?  Otis is starting to shake, but holds his ground--   Don't want to turn tail in front of your people. I understand.  He starts to turn away then WHAP! brings the butt of his pistol up under Otis's chin, knocking him to the floor. A woman SCREAMS and Otis, enraged, grabs the chair he has fallen over, starts to get up--but Wade has the pistol levelled at his face--   Come on, Houston, give it a try! Come to Poppa--  RODERICK is out on the floor now, hands held out in a gesture of peace, as YOUNG MINNIE watches from behind the bar, petrified--   That the problem, son?  You Slow?   You telling me what to do, Roderick?   What's this I see? Is that whiskey in them glasses on the Bar? Roderick, I'm gonna have to cite you for a violation of state law--   And people better clear out of here! Now!  A few people start for the exit.  Wade swivels and BLAM sends a bullet past Minnie that shatters a crystal decanter behind the bar.  People run for the door. Wade squats down to look Otis in the face--     You learn how to act your place, son. This idn't Houston.  He stands and we FOLLOW him toward the bar--   Who is that? Come out here where I can see you!  BLAM! A GUNSHOT, and Wade falls to his knees--   You sonofabitch--  Wade falls on his face. A FLASHLIGHT BEAM flicks ON and plays over his body. We PAN back along the be to see Buddy, holstering his Pistol. He hears something, swings the flashlight up.   Hola, amgio. Problemas de llanta? [Hey, friend. Tire problems?]   What's in the back?   I heard somebody been haulin' wets on this road.   This same person been bragging all over the county how he don't have to cut that big gringo Sheriff in on it-- he can run his own operation 'thout any help. Como se llama, amigo?   You know this road got a bad reputation, Eladio--   Bandidos, Injuns--   There's many an unfortunate soul been ambushed out on this stretch. Hope you're carrying some protection.   You carryin' a firearm, son?  Don't lie to me now.   Just a shotgun, huh? Better let me take a look at that.  ELADIO opens the truck door and digs under the seat. Wade winks to Hollis, then turns and BLAM! shoots ELADIO through the head. Hollis jumps back startled and horrified--   Little greaser sonofabitch been running a goddarn bus service. Think he can make a fool out of Charley Wade! Get them wets outta the back, Hollis, see what we've got--   You got a talent for statin' the obvious, son Muchachos! Venga afuera!Brazos arribas! [Come on out! Hands up!]  Young CHUCHO hears FOOTSTEPS approaching. We PAN as he looks-- a man's BOOTS appear at the top of the arroyo. We TILT UP to see a Sheriff, BACKLIT, then CRANE to see it is Sam, back in the PRESENT looking over the site, troubled. His car sits on the empty road behind him. He frowns, turns to go--    MUSIC CONTINUES. Wade stands over the table in the f.g., Young Hollis hanging back in the doorway. Wade is smiling his cold smile, cursing--    Cold and unblinking. MUSIC CONTINUES--    Twisted in a snarl as he curses. MUSIC CONTINUES--    MUSIC CONTINUES. Wade grabs the table and violently jerks it over onto Young Otis, cards and money flying--    MUSIC CONTINUES. He waves his pistol, indicating something behind Otis--    MUSIC CONTINUES. Wade levels his gun at Young Otis's back, then turns to wink at Hollis like he did before he shot Eladio--    MUSIC CONTINUES. Finger closing around the trigger of the .45--    MUSIC CONTINUES. Eyes burning as he aims--    BLAM! THWAP! A bullet plows through his neck, knocking him back against the bar.  MUSIC CONTINUES. His gun falls from his hand--",
        "Hollis": "So Buddy walks up to the porch and there's old Fishbait McHenry, cleanin' the dirt out his toenails with a pocketknife--he was the most hygienic of all the McHenrys--  The breakfast companions are laughing already--   \"Fishbait,\" says Buddy, in that quiet way of his, \"What you know about them tires that went missing from markets?\" Fishbait thinks for a minute, then he lifts up a loose board from the porch floor and calls down into it, \"C'mon out, Pooter, they caught us!\"   He known who it was onnacouna the tire tracks in the dirt from the back of the garage to where they loaded up. \"Old Fishbait,\" he says, \"never lifted a thing in this world if there was a way he could roll it.\"  More laughter--   Sam! I was just telling a few about your old man.   Big day coming up--I wish we'd have thought of it while he was still living. But he went so unexpected.   Oh, you know, the usual troublemakers. Danny Padilla from the Sentinel, that crowd.   King wasn't Mexican, Fenton--   There was a faction pulling for that boy who was killed in the Gulf War-- Ruben--   Right. But nobody here ever noticed him till they read his name on the national news--   That's not the whole story. The Mexicans that know, that remember, understand what Buddy was for their people.  Hell, it was Mercedes over there who swung the deciding vote for him.  Sam looks to the register where Pilar's mother, MERCEDES CRUZ, whacks rolls of change apart on the counter. She seems to be avoiding looking toward him.   She put it even at three to three, so as the Mayor I get to cast the tiebreaker. The older generation won't have any problem with it. They remember how Buddy come to be Sheriff, that it was all 'cause he took their part.   Hell, everybody heard that story a million times.    Hollis is hooked into it now--   The two of us were the only deputies back then me and Buddy--it's what-- '58--   And the Sheriff at the time was Big Charley Wade. Charley was one of your old-fashioned bribe-or-bullets kind of Sheriffs, he took a healthy bite out of whatever moved through this county.  He looks down at the table--   It was in here one night, back  when Jimmy Herrera run the place.   Started right here in this booth.  We PAN down to the table, The food has changed. The tortillas are in a straw basket instead of plastic. The jukebox changes to ANOTHER SONG and the LIGHT DIMS slightly. A hand with a big Masonic ring on one finger appears to lift a tortilla-- underneath it lie three ten-dollar bills.  The hand lifts them up and we TILT to see the face of SHERIFF CHARLEY WADE, a big, mean redneck with shrewd eyes. It is 1957--   \"Mas cerveza por favor.\"   We made our collection at Roderick's place and that was the last anybody seen hide nor hair of him.  He went missing the next day, along with ten thousand dollars in county funds from the safe at the jail.   Not a peep. Buddy run the man out of town.   Oh--he come to an accommodation. Money doesn't always need to change hands to keep the wheels turning.   Look, I know you had some problems with your father, and he and Muriel-- well--   --but Buddy Deeds was my salvation.  Sam nods, speaks softly--   Sam! Hey podner! You caught me playing hooky--   Sounds great. Where do I sign up?   You go by your old house?   Just as well. The new people just painted it some God-awful color--   Was it Davy Crockett or Jim Bowie?   Charley? I believe he was. Used to go for lodge meetings over to Laredo. What's he got to do with your body?   I told the story enough times--hell, we were just in the car, he was stewing about the fight with Buddy while we drove over to Roderick Bledsoe's--   He owned the colored roadhouse before Big O--   No. I think his widow's still in their place in Darktown, though.  You think it's Charley Wade, huh?   There's no call for that, Sam. Fella made himself a pile of enemies over the years.   We got that dedication tomorrow. This is a hell of a time to be draggin' up old business.   And I understand why you might want to think he could.  This is a low blow, but accurate enough to shake Sam.   Look at all this, would you? My tackle, the boat, all to catch a little old fish just minding its business on the bottom of the lake.  He gives Sam a look--   Hardly seems worth the effort--does it, Sam? Sam walks away--   I prefer it in the bottle--   Sometime in the early '70s a reporter from a national magazine was talking to the governor of our Lone Star state, and he asked him, \"Governor, what's your ideal of what a real Texan ought to be?\" Governor said, \"That's easy, son- you just go down to Rio County and get a look at Sheriff Buddy Deeds.\"  Applause--   Thank you. We've got one more person to hear from--     --and he's somebody who probably knew Buddy better than any of us, Sam--would you say a few words?   And now my fellow Council member and one of Frontera's most respected businesswomen, Mrs. Mercedes Cruz, will do the honors for us.   Oh no--oh Jesus--oh my Lord--   You killed him--   Hooligans--   It happens again, we build a fence around it.   Come on now, Missy, get your clothes in order--  Sam is trying to kick and punch at his father, pausing in between to pull his pants up. People are BOOING and HONKING their HORNS all around--   What am I s'posed to do with her, Buddy?   Sam! Quite a do the other day. It meant a lot to folks that you said something.   We have a murder?   I wish I could tell you I remembered something new, but I can't.   Do you?   You lived in the man's house what-- seventeen, eighteen years? And you didn't get to know him any better than that?   Hey, Sam.   Your father had the finest sense of justice of any man I ever met--   Buddy Deeds--    MUSIC CONTINUES. Wade stands over the table in the f.g., Young Hollis hanging back in the doorway. Wade is smiling his cold smile, cursing--    MUSIC CONTINUES. Watching squeamishly as Wade goes to work on young Otis, the overhead light swinging wildly--    MUSIC CONTINUES. Frowning as he senses something wrong--    MUSIC CONTINUES. Mouth open in horror--   The three of us cleaned up and took him to the post and put him under. Can't say I was much help.   Widow's benefits. He figured it would make the disappearance look better, and that Mexican gal was just scrapin' by after Charley killed her man. They didn't get hooked up till late--   What's the call, Sam?  Sam rolls it over in his mind before answering--   Word gets out who that body was, people are gonna think Buddy done it.  Sam gets up--",
        "Young": "Name's Otis.   Payne.   Uh-huh.   I know that.   Some crop needed pickin' and the man was shorthanded.  A very insolent answer for the time and place--   Runnin' numbers illegal.   I prefer it in the bottle--   Been away. Up to Houston.   You spilt it, you wipe it up.  Wade stands, steely-eyed, and looks at Otis nose to nose--   You going to tell her?   You going to tell him?   He doesn't need to know all my business.   He's gonna find out.   So? What's he gonna do, arrest us?  Young Pilar frowns, tosses more bark--   It's supposed to be some big sin, even if you love each other.   You believe that?    She turns to look at him--   No.  We PAN with her gaze to see Sam, PRESENT DAY, sitting on the bank, lost in thought--   Voy a romper las rinones si no hago pipi--[I'm gonna bust my kidneys if I don't pee--]  We TRACK back with Young CHUCHO to see we are at the side of a dirt road on the scrubby flatland near the border. Eladio's battered pickup truck has wood-slat sides and a canvas top. Eladio begins to undo the nuts on the flat tire as Young CHUCHO climbs down into a dry creek bed to relieve himself--   Los demas son tan espantados que prefieran mojar sus pantalones. [The other guys are so scared they'd rather wet their pants.]  CHUCHO tightens as he sees something, ducks down--   Mira, Eladio [Look!]  We PAN to see the Sheriff's car approaching in a cloud of  Oh no--oh Jesus--oh my Lord--   You killed him--   What the hell are you doing? You fucking asshole!   Let me go!  Pendejo!   Come on now, Missy, get your clothes in order--  Sam is trying to kick and punch at his father, pausing in between to pull his pants up. People are BOOING and HONKING their HORNS all around--   You got no fuckin' right! You stay out of my fuckin' life!   What am I s'posed to do with her, Buddy?   Sam!  The kids are dragged forward into the HEADLIGHTS that are being turned on to see what the ruckus is. Both are crying, struggling--   You leave her the fuck alone!   Please, don't tell my mother! She's gonna kill me!  They step closer into the glaring HEADLIGHTS which WHITE OUT the scene, then FADE.   Donde esta? Estoy perdido--[Where are you? I'm lost--]   No puedo ver la orilla! [I can't see the bank!]   Vi a Rosaria arastrado para el corriente--[I saw Rosaria taken away by the current--]   Mercedes Gonzales Ruiz.    MUSIC CONTINUES. Wade stands over the table in the f.g., Young Hollis hanging back in the doorway. Wade is smiling his cold smile, cursing--    MUSIC CONTINUES. Trying to look unimpressed--    MUSIC CONTINUES. His eyes following as Wade comes to stand over him--    MUSIC CONTINUES. Wade grabs the table and violently jerks it over onto Young Otis, cards and money flying--    MUSIC CONTINUES. Watching squeamishly as Wade goes to work on young Otis, the overhead light swinging wildly--    MUSIC CONTINUES. Frowning as he senses something wrong--    MUSIC CONTINUES. Turning to see Buddy--    Horrified, splattered with the Sheriff's blood. MUSIC",
        "Mikey": "This place is a gold mine.   What?   Right.   You finding lots of cactus and shit?    Looks like a lot of cactus to me.    Cliff--   Cliff--    MIKEY in the f.g. now, looking down at something as he pulls his headset off again--   Cliff, you gotta look at this--  Cliff wearily turns and approaches from the b.g.   Was Coronado in the Masons?    He can't hear with that rig on-- Mikey!  Mikey comes up with something, holds it before them. An encrusted piece of metal--   What've we got here?  Sam takes the thing, lays it back down where Mikey found it.   The scene of the crime.   There's not that much down here, Colonel. Big O's is the only place in the county that our African American soldiers are uhm--that they feel comfortable in.   We had a kid pass out in the men's room. The town isn't much.   You know how it is, Colonel--first time away from home, dealing with new people--I remember my first hitch--   Well, yeah, but I went through the Program. I haven't had a drink since--   Appreciate it, sir.  Del accelerates and we HOLD with the sergeants, slowing to a near-walk.   Guy cracks walnuts with his asshole.    We start on a two-foot-high statue of a cowboy made from old bullets and shell casings. We PAN past a few others, the poses lifted from Frederic Remington paintings, till we see Mikey, gluing together a work in progress, a Remington book propped open in front of him. Cliff sits at the worktable playing absently with the old bullets spilled out from MIKEY'S bag   Never thought I'd see the day a buddy of mine was dating a woman with three up and three down on her shoulder.   You going to get married?   You met her family? They gonna be cool about you being a white guy?   Always heartwarming to see a prejudice defeated by a deeper prejudice.  But marriage, man--I did two tours in Southeast Asia and I was married for five years--I couldn't tell you which experience was worse.  Cliff picks up a slug--   I knew she was Japanese going into it, but she didn't tell me the ninja assassin part--   Her parents acted like I was gonna blow my nose on their curtains--   If I stayed out past ten with the guys she'd go into her Madame Butterfly routine--   What--it's a bullet. I'm lousy with bullets here.   Yeah?   They were using M-1's, yeah--   We better call that Sheriff.",
        "Mercedes": "Off the phone, by we've got people waiting. Andale!  We FOLLOW Mercedes back into the kitchen, where she moves through, kibbitzing the operation--   Donde estan sus guantes? Tonta! Quiere matar a mis clientes? [Where are your gloves? Stupid! You want to kill my customers?]  She continues past, shaking her bead, bringing us to Pilar, who is trying to stay out of the way--   These ones coming up are getting stupider every year.   If they're going to survive here, they have to know how to work, Elalco! Adelante! Los clientes esperan!    Nobody is illegal in my cafe! They've got green cards, they've got relatives who were born here--if they only had a little common sense I'd be very happy.   Did you come here to tell me how to run my business?   Why would I want to go there?   You want to see Mexicans, open your eyes and look around you. We're up to our ears in them.  Pilar gives up on the trip. She watches her mother poking at the plates of chips and salsa ready to go out--   He was killed.   A little older than Paloma is now.    I was too busy.   Maybe now. It was different back then. I had this place, I was doing all the shopping, all the cooking. What do I need some chulo with grease under his nails to drink up the profit?   I don't mean Fernando.   I never said that.   I felt that you could do better for yourself--   I never said that. It was just that boy--   You people are stealing my money-- Entiende? Robandome?  Mercedes is gone. The young girl, pulling plastic gloves on, looks to Pilar.   En ingles Enrique. This is the United States. We speak English.   Good night, Enrique. She slides into the car--    Slowly working the blades of the scissors, she looks coldly at Sam--    She freezes, smiling, till the still photographers have gotten their shots, then snips the cord to a pulley system that lets the cloth drop--    We hear old MEXICAN MUSIC. Ice cubes plunk into a glass.    Mercedes, exhausted from a day at the cafe, pours herself a Scotch and soda--   Otra vez los mojados--[Wetbacks again--]  Mercedes searches to find a portable phone on the patio table, punches a number in--   Hello? Border Patrol?    Quien es? [Who is it?]   What are you doing out there? Are you crazy?   In English, Enrique. We're in the United States--   You have somebody else out there?   Don't tell me lies, Enrique. Que paso?   Enrique! Quienes son estos? How could you bring them here?   I'll call the Border Patrol, they'll get her to the hospital.   You think you're doing these people a favor? What are they going to do? Either they get on welfare or they become criminals--   Sientase. [Sit.]   This girl is a friend of yours?   I thought you were married!   This girl has a child?    Tipico.   Donde esta? Estoy perdido--[Where are you? I'm lost--]   No puedo ver la orilla! [I can't see the bank!]   Vi a Rosaria arastrado para el corriente--[I saw Rosaria taken away by the current--]   Mercedes Gonzales Ruiz.    Mercedes is lost in thought as she recalls. She steps into the light by the carport. Enrique and Nestor are propping Anselma's leg up on pillows in the back of Mercedes' old station wagon--   Rapidamente! Everybody in the world is going to see!   A casa de Porfirio Zayas. He used to be a doctor on the other side. Gunshot wounds, fixing babies--if you can pay he can handle it.   Don't worry about it. He owes me some favors.  Enrique turns to ANSELMA still frightened in the rear of the station wagon--   In English, Enrique. In English--",
        "Cruz": "",
        "Fenton": "Buddy Deeds. He had a way.   Won't be another like him. That boy of his doesn't come near it. You ask me, he's all hat and no cattle   He was a unique individual.   Better late than never. Korean War hero, Sheriff for near thirty years-- Buddy Deeds Memorial P--   Every other damn thing in the country is called after Martin Luther King, they can't let our side have one measly park?   Bad enough all the street names are in Spanish--   Then name it after Big Chief Shitinabucket! Whoever that Tonkawa fella was. He had the Mexes beat by centuries.   They just wanted it to be one of theirs--   Tell that one, Hollis--   Go ahead, Hollis.   '57, 1 believe--   That Buddy was a cool breeze.  We PULL BACK to see Hollis and his buddies at the table, eating their lunches as they listen.   Charley Wade were known to have put a good number of people in the ground, and your daddy gets eyeball to eyeball with him.   Buddy Deeds said a thing, he damn well backed it up. Won't be another like him.   Your mother was a saint.",
        "Amado": "Luis! Give me that Phillips-head back--   Somebody hand me the CD player-- damelo pendejos--  He looks up and we TILT to see Travis leaning in the window, examining the new radio   Something wrong?   I didn't steal anything.   I don't know what the big deal is.   If you had your way I wouldn't have any friends.   Just 'cause I'm not like Little Miss Honor Roll here--   You and all of the teachers in this dump--your story's over, so you don't want anybody else to have fun.  We see on PILAR's face that he has scored--   I'm not talking to you. You don't have any friends.  PILAR eases the car down San Jacinto street, seeing something on the street and she's tuning her kids' conversation out--   I don't pretend I came over on the Mayflower--   Just shut up.   So?   I can't take any more school.   So?   They're not going to jail.   Just some rich Anglo out on the lake. Don't even live here all year.   They stole our land--   I can fix cars.   You think I can't learn that?   I'm not settling for anything. I like cars, it's just not a move up the ladder to you, so you think it's a waste.   Oh, come on--you and Grandma think anybody who works with their hands is a peasant. When Dad--   It's my life. If I want to fuck it up, that's my business.   And what did she do?   Catholic school, nasty.  Pilar is nearly in tears.",
        "Enrique": "Sweat beads the forehead of a thin, tired-looking recent immigrant, ENRIQUE, as he delivers platters of chile rellenos to a booth. MEXICAN MUSIC plays on a jukebox in the b.g. We HOLD on the booth, where HOLLIS POGUE, in his 60s entertains two GOOD OLD BOYS--    We start on Enrique, talking surreptitiously on the pay phone on the way to the kitchen.   Sabado por la noche--Is, es el  mas seguero--a cruzar por la  manana y pues tendremos que esperar--[Friday night--Yes, that's the safest--I'll cross in the morning and then we'll have to wait--]  Mercedes bustles by, snapping her fingers--   Es muy lindo, su coche--   Is very beautiful, your car.   Buenas noches, Senora Cruz. Enrique walks in the opposite direction--    Eyes glued to his notepad--   You wan' something to drink?   Todos estamos? [Everybody here?]  Anselma reaches up from the floor to take his hand--   Nadie nos veran. Seramos invisibles. Nobody's going to see us. We'll be invisible.]   Que Paso? [What happened?]   Conozco solamente una persona con casa--[I only know one person with a house--]   Senora Cruz?   Soy yo, Enrique! No tiene miedo-- [It's me, Enrique. Don't be afraid]  Enrique steps out into the light. His pants are wet and he's scared--   Hay pasado un accidente muy grave-- [There's been a bad accident--]   I have some friends who have had a accident--   We was by the river? And I hear my friend callin' for help, and I look and she has falling in the water--   We was crossin' the river--  Nestor appears in the light now, supporting Anselma, who hops awkwardly to move forward--   They need help. Jaime, Anselma-- esta es mi jefa--   No! No puede hacer esto--[You can't do that--]   No es la verdad--[That isn't true--]   Es mi novia. [She's my girlfriend.]   I am marry to the cousin of a friend-- but only to be able to live here. This is the mother of my child--   We have a daughter.   Donde vamos? [Where are we going?]   Senora, anything it costs, I can work--   Seas tranquila, mija.  Estamos en las manos de Senora Cruz. [Just relax, honey. We're in the hands of Senora Cruz.]  Mercedes starts the car--",
        "Buddy": "What's that for?   So?   I'm not doing it.  Hollis stops a few feet away, shocked. Wade just stares down at Buddy.   It's your deal. You sweated it out of him, you pick it up.   That's not the point.   I'm not picking it up.   How 'bout this--how 'bout you put that shield on this table and  vanish before you end up dead or in jail?  Wade rests his hand on his pistol.  It is dead silent but for the MUSIC on the box.   You ever shoot anybody was looking you in the eye?   Whole different story; isn't it?   There's not a soul in this county isn't sick to death of your bullshit, Charley. You made yourself scarce, you could make a lot of people happy.   Now or later, Charley. You won't have any trouble finding me.  Wade feels the people around him waiting for a reaction.  He leans close to Buddy to croak in a hoarse whisper.    He watches till the screen door shuts behind them, then holsters his gun and begins to saw at the steak as if nothing had happened. He calls softly--   Muchacho--mas cerveza por favor.  He looks up at somebody and we PAN till we see Sam, still standing over the booth, listening. We are back in 1995--    We are looking through a magnifying glass at an old photo. Buddy's face is slightly distorted by the glass.   Let's go.  We FOLLOW Buddy up to the driver's side of the car as the Deputy goes to the passenger side. We PAN with Buddy's hand down to the door handle--he grabs it, flings it open--the overhead LIGHT flicks ON and there lie YOUNG SAM and PILAR, teenagers, half their clothes off and just about to close the deal. PILAR SCREAMS and the Deputy throws the door open by their heads--   Goddammit!  Buddy grabs Sam's ankles and yanks him out of the car onto the ground as the Deputy awkwardly pulls PILAR, out the other side--   How old is that girl? Goddammit, where's your goddam sense?   Gimme the keys--gimme the goddamn car keys, son--   You drive her home and tell her mother where we found her--   You just shut that filthy mouth, son. I'll deal with you when we get home--    MUSIC CONTINUES. Stepping in the door, seeing, CALLS OUT--    Calm and hard-eyed. MUSIC CONTINUES. As he steps forward, we see his pistol is still in its holster. He reaches out and takes the .45 from Young Hollis's shaking hand, looks him in the eye till Hollis looks back, then looks toward Young Otis--  We PAN with his gaze to a CLOSE-UP of Otis, back in the PRESENT. The MUSIC FADES--",
        "Deeds": "",
        "Cliff": "We got ocotillo, devil's walking stick--what's this stuff--it's that whattayoucallit--horse-crippler.  Mikey bends to scoop something out of the sand, putting it in a canvas bag slung on his hip.   Lead mine.  MIKEY sees that Cliff is talking, pulls his headset off.   It's a lead mine.   I don't know why I'm talking to you, you've got that thing on your head.   It's not just cactus.  There's the nopals, the yuccas--    Man knows a hundred-fifty varieties of beer, he can't tell a poinsettia from a prickly pear.   You live in a place, you should know something about it. Explore--   Don't tell me--Spanish treasure, right?  Pieces of eight from the Coronado expedition--  He stops by Mikey and looks down, his expression changing   Jesus--   This was a rifle range way back when. But we figured it isn't Army land anymore, it's your jurisdiction.   That ring--    Old bullets.  He uhm-- makes art with them.  Sam just nods. Mikey frowns, goes down on one knee and scratches something out of the dirt at their feet--   The Sheriff says we shouldn't touch anything,   Since I've been stationed here? A fistfight now and then--   Yes sir.   We throw a urine test at them once a month. Random numbers, maybe a hundred people at a time   No problem, sir.  Del notices bow hard they are breathing--    You get the feeling he doesn't want to be here?   So you knew this young man before?   It's not our job to get involved in your personal life, but when it interferes with the training here--   He'll live.   He'll probably be getting a medical discharge--   He's going to lose a lung. This is not good news for Athena--   If the incident happened the way you say it did, there hasn't been an infraction.   You're dismissed.   Hey--she's in a tough situation. I cut her some slack--   She's pulled herself out of a pretty rough neighborhood.  Crossing to the door--    Things are obviously more than professional between these two--   Well--I don't see what's changed. No - PDA's, no necking on the obstacle course.   Seriously, I think we should get married.   We should just do it.   You could take it--   I'd quit the Army for you, if it came to that.   Sheriff--hi--this is Sergeant--this is Priscilla Worth.   Sheriff Deeds was in on our archeological find yesterday.   They stopped training infantry there in the late '50s. It was just a playground for the jackrabbits till they gave it to the county last year.   I think it's beyond what you'd call dating.    Maybe.   Priscilla says they think any woman over 30 who isn't married must be a lesbian. She figures they'll be so relieved I'm a man--   Hey, Mikey--   Mikey--   Mikey--   Mikey look at this--   It's a .45.   This is the stuff we picked up the other day, right? The rest of this is all .30 caliber--   What's it doing on a rifle range?  MIKEY holds the slug in front of his face--",
        "Molly": "Pilar, is uhm--is Amado okay?   No. Is he sick?   I'd like to see them spend a day pulling 14-year-olds off of each other--I should get combat pay--",
        "Deputy": "",
        "Travis": "They come a long way from those old 8-track jobs, haven't they?    This is stolen property. Alla you fellas are coming down to the station.   Yeah. I pulled the bunch that hangs at Pico Bernal's place. We finally caught them with something.   Yeah--let's see--the other ones say he wasn't in on the theft, he just knows how to hook things up. We've been trying to contact a parent.",
        "Pilar": "We do the best we can here--  A teacher in her late 30s, PILAR CRUZ, steps in front of the map and we FOLLOW her across the room, carrying a poster   --but hey, public education these days is a bit of a battleground.  Posters hung on the walls beyond her show luminaries from Texas history-- Sam Houston, Stephen Austin, Juan Seguin. A new parent, CELIE PAYNE, stands in the middle of the otherwise empty classroom.   His record shows that he's a good student.   We haven't had any serious violence, if that's what you mean. We've got a pretty lively mix though--you walk into the cafeteria and the Anglo kids are in one section, the Mexican kids in another and the Black kids have a table in the back--thanks--   They're the smallest group except for a couple Kickapoo kids. Look, you're obviously a concerned parent. Chet has no history of getting into trouble--I'm happy to have him in my class.  She steps back to see if the poster, an old photo of Geronimo, looks straight. Another teacher, MOLLY sticks her head in the door--   Okay? He's not here?    He's going to wish he was dead.   I think that's a bit of an oversimplification--   There's no reason to be so threatened by this--  Pilar is trying to stay calm despite her anger.   I've only been trying to get across some of the complexity of our situation down here--cultures coming together in both negative and positive ways.    She stands by an unoccupied reception desk, very upset, unable to attract anyone's attention because of the activity around the shooting.  She looks tired and a bit scared under the harsh overhead light.    Pilar looks around. Sam is standing by her. We can tell there is some history between these two.   They've got my Amado.   Somebody called--something about an electronics store.   We haven't talked since high school.   Are you okay?   You'll find out when I get you home. Thanks, Sam.   Okay, we have the fight against the Spanish with bloody conflict for dozens of years till they're finally defeated in 1821 and Mexican independence is declared. Anglo settlers are invited--   --to colonize the area and by the time they begin the movement against Santa Anna they outnumber the Mexicans here by four to one. The war between Mexico--   and the Anglo forces ends in 1836 with the formation of the Texas Republic. Texas joins the United States as a state where slavery is legal in 1845--   after the so-called Mexican war and then secedes to join the Confederacy in 1861. The Confederacy is beaten, and the Reformation period here is marked by range wars and race wars--    Looking out at the class--   --and all this paralleled by constant battles between both the Mexican and Anglo settlers and the various Indian nations in the area. What are we seeing here? Chet?   Oh, come on, Amado--   Leave your sister out of it.    Sam walks on the sidewalk parallel to them, talking with three other MEN--    Pilar is still looking fixedly out the window--   Of course you can.   It doesn't have anything to do with being smart.   Maybe you're just getting less patient.   Well, you hire illegals--   If you spent a little more time training them--   No. I was wondering if you'd like to take a trip down south with us. Maybe see where you grew up--   Oh, come on--you must be curious how it's changed. Amado is into this big Tejano roots thing and I've never been further than Ciudad Leon--   Mami, how old were you when my father--   Right. When he was killed.   How come you never got married again?  Mercedes just glares at her--   There must have been somebody.   Nobody's too busy.    Thank you.   Mami, the first time I brought him home, those were your exact words-- \"some chulo with grease under his nails.\"   You made it pretty damn clear you thought he was nobody.   What? Become a nun? You didn't want me going out with Anglos--   \"That boy\"--Mami, say his name for chrissakes!  The employees are staring. Mercedes won't look at her daughter as she steps out of the kitchen, banging into Enrique on his way back in--   Si.  The girl puts her hand on her heart in sympathy--    Watching--   Lunch hour. My next class isn't till nine-thirty.   I can't name anybody she does like these days.   A real palace. She rattles around alone in that thing--   So she tells me three times a week.  She looks at him--   I thought you got through that pretty well.   People liked him.   I remember him watching me once. When I was little--before you and I--  She shrugs.   I was on the playground with all the other kids, but I thought he was only looking at me. I was afraid he was going to arrest me--he had those eyes, you know--   Weird what you remember.  They walk in silence a moment--   Amado.   He hates me.   With Paloma, it's more like she pities and tolerates me- totally age- appropriate. But Amado--he's--he's never been book-smart. Had a hard time learning to read. Me being a teacher and caring about those things is like an embarrassment--like a betrayal.   Fernando wasn't pissed off at everybody. He just wanted to fix their cars.   So why did you come back here, Sam?   You don't want to be Sheriff.   It can happen so sudden, can't it? Being left out on your own.   They've got me. Different thing.  They stop at a spot where you can climb down the bank--   I should get back.   Looks real bad if the teacher's late for class. It's really nice to talk with you, Sam.  She waves and walks away, feeling awkward. Sam watches for a minute, then turns and steps down to the bank, He looks at the water.   You going to tell him?   He's gonna find out.   It's supposed to be some big sin, even if you love each other.    She turns to look at him--   No.  We PAN with her gaze to see Sam, PRESENT DAY, sitting on the bank, lost in thought--    Pilar sits on her front Porch, listening to the MUSIC in the distance. A woman singing a MEXICAN LOVE BALLAD. After a while we hear Paloma open the screen door behind her--   Yeah?   For a while.  A silence. They listen to the RECORD--    What do you think?   I'm only going to have you for two more years. If you decide not to go on to college--   --you're going to be on your own.   So I'm worried about you. I don't want you to end up in jail like your friends.   Don't try to con me, Amado. You knew how they got all those things.   That makes it okay?   Save your breath. That line doesn't cut it with me.  A silence. Amado sulks.   How do you think you're going to make a living?   You can fix old cars. Mr. Washburn told me that the cars they're making now are all computerized--   I think you can learn whatever you want to. I just don't see you doing it. If you want to settle for--   That isn't true.   If you grew up to he anywhere near as good a man as your father was, I would be happy! I would be thrilled.  They look, at each other for a long moment.    I said pretty much the same thing to my mother when I was your age.   Two years at hard labor, Our Lady of Perpetual Help.   Honey, I think you're smart and you're good and I love you. So don't act like an idiot, all right?   I don't think you can take it personally--   I have new respect for some of my kids, meeting the parents they've been dealt--  Molly keeps going as Pilar ducks into the office--   See you, Molly.   Steve?   Spanish, please. My mother would have a heart attack.   Sure, they go back to Cortez. When he rode by, they were squatting in a hut cooking hamsters for dinner.   All my mother does is work. That's how you get to be Spanish.   The Sheriff.   I'm unmarried. I'm not available.    Nobody stays in love for twenty-three years.   Let me go!  Pendejo!   Sam!  The kids are dragged forward into the HEADLIGHTS that are being turned on to see what the ruckus is. Both are crying, struggling--   Please, don't tell my mother! She's gonna kill me!  They step closer into the glaring HEADLIGHTS which WHITE OUT the scene, then FADE.    MUSIC CONTINUES as Sam cruises past Pilar's house. The car is not in the driveway: Paloma hangs out with a couple FRIENDS under the porch light, laughing--    MUSIC CONTINUES. We can see PILAR, through the lighted window of her classroom, preparing something on the blackboard--    Follow me.   We thought we were something, didn't we?   I look at my kids in school--tenth, eleventh graders. That's who we were. Children.   I mean what did we know about anything?   When Nando died--it was so sudden--I was kind of in shock for awhile. Then I woke up and there was the whole rest of my life and I didn't have any idea what to do with it.   Yeah?   My mother hasn't changed the songs since I was 10.  She puts in a quarter, punches some numbers. A Mexican BALLAD comes on. She crosses back to Sam, holds her hand out. He stands to greet her. They slow-dance in the empty cafe--   Wow.   How come it feels the same?   So what are we gonna do about this?   How long have you lived here?   There's nothing on the walls. No pictures--   Like your story is over.   It isn't. Not by a long shot. He holds her and they lie silently for a moment--   Yeah?   Eladio. Eladio. Cruz.    Paloma sits on the top step of the porch, reading teen magazines. PILAR steps out behind her, dressed casually, and squints at the day--   It's Saturday.   Yeah. I had uhm--school business.  Paloma gives her a look, then holds a fashion page up for her to see--   Nobody really wears that stuff, Paloma.   Enough with the clothes--   I only went for my last two years.   Oh, my mother wanted to keep me away from away from boys.  PILAR steps out into the sun--   When's the picture start?  Sam looks at her for a moment--   She'll figure it out sooner or later. I don't have to ask permission anymore, if that's what you mean.    Couple months before I was born--    Pilar hands the photo back to him, tries to be calm--   I've never seen my mother in a bathing suit before.  Didn't know she owned one.   They can't pull this on me. It isn't fair--I don't believe this--   From the first time I saw you at school--all those years we were married to other people I always felt like we were connected.   So that's it? You're not going to want to be with me anymore?  Sam knows what he feels but doesn't have the words--   I'm not having any more children. After Amado, I had some complications-- I can't get pregnant again, if that's what the rule is about--   We start from scratch--   Everything that went before, all that stuff, that history--the hell with it, right?  PILAR takes Sam's hand, kisses him--   Forget the Alamo.",
        "Sam": "I was driving back from Apache Wells when they got me on the radio.    I've got the forensics fella coming down from the Rangers. No way to know how old the body is without some lab work.   Masons been around a long while.  Mikey has come up to them, still sweeping with the metal detector.   Treasure hunter?   S'posed to leave everything right where we found it. They're real particular about that.   No telling yet if there's been a crime.  Sam frowns down at the piece of metal as he rubs the face of it.   But this country's seen a good number of disagreements over the years.   Fellas--  We WIDEN to see Sam standing by their booth. No telling how long he's been listening, Fenton is embarrassed.   Yeah, he was that.  We sense a little strain when Sam has to talk about his father--   I heard there was a bit of a fuss.   They were here first.   --Santiago.   That so?   I'd like to hear it. Your version of it.  Something about the way Sam says it puts Hollis on guard.   Never heard from him again?   So he arrested all of Jimmy Herrera's people and sent 'em back to the other side?  Hollis sees what Sam is getting at, grins--   Right.   Won't be another like him.   Tell him I'll catch him later.   Tell him to try me tomorrow.    Looking at the photo, troubled--    He's right.    The shooter local?   Okay--we'll take a statement from all the GIs before they go back to post. You can get the story from Otis over at the club.   Nothin' much. The Rangers put Ben Wetzel on it. Catch you later.  As Ray steps out, Pilar looking distraught, walks into the station, passing right by Sam without seeing him.    Wonders what she's doing there--    She stands by an unoccupied reception desk, very upset, unable to attract anyone's attention because of the activity around the shooting.  She looks tired and a bit scared under the harsh overhead light.   Pilar.    Pilar looks around. Sam is standing by her. We can tell there is some history between these two.   Something wrong?   Got him here?   I'll see what's going on.  He starts away, stops, comes back--   I was--I was real sorry about Nando. He was a good fella. We haven't talked since.   Yeah. I'll go check on your boy.  Pilar watches Sam go--   Excuse me--  We WIDEN to see Sam standing over the desk--   We got some boys you run in earlier today?   You got a juvenile with 'ern--Amado Cruz?  Travis looks at his booking sheets--   They tell me you're good at fixing things.  Nothin--   Your father was a hell of a mechanic.  Still nothing--   You know, if you figure minimum wage on the time most thieves spend in jail, they could have bought most everything they stole.   I didn't say you did. My name is Sam, by the way.  Amado just gives him a look--   He's all yours.   No problem.  Pilar yanks AMADO outside by his arm. She turns to shoot a look back at Sam, then steps out through the glass door.    Watching her go--   Any time.   Hey, Ben. Thanks for coming down.  They shake, Sam sits.   Business is booming. Got your drugs, got your illegals--had a shooting the other night at Big O's--Soldier got ventilated.   September '97, that's all she wrote.   Yeah, we'll have folks swimming over to Mexico to work in the sweatshops.  Sam looks at the folder of reports.   That the word on our boy?   Skinny?   Nice job.   Charley Wade.   --it didn't come out of a cereal box.   You know the popular version of how he left town.   You got a cause of death?   So he could have gone out to the base, hopped the fence, dug down into the dirt on the old rifle range and had a heart attack.  Ben smiles, closes the folder--   Colt Peacemaker.   He swore by it.  What?   So is Buddy on your short list?   You got to investigate. No question about it.   Yeah, it's a pretty cold trail.  They sit in awkward silence for a moment. Ben feels bad about it.   I always wondered what you Mayors do when you're not cutting ribbons.    Floating around out here, playin' hell with them bass--play a little cards, play a little golf, drink some beer--   I haven't been out here for a while.   No.   We found a body out by the Army base yesterday. Been there for a long time.  Hollis squints at a rubber lure, rejects it--    You recall if Charley Wade was a Mason?   All it was wearing was a big old Masonic ring and a Rio County Sheriffs badge.  Hollis reacts. Sam puts a foot on the gunwale of the boat.   You don't remember anything else from that last night you saw him, do you?   Bledso   He still living?   Forensics people are sure of it. You have any idea who might have put him there?  Hollis makes a great show of considering--   Besides my father, I mean.   And Buddy was one of them.   People have worked this whole big thing up around my father. If it's built on a crime, they deserve to know. Now I understand why you might want to believe he couldn't do it.   Thanks for your time, Hollis.  Hollis holds up a double handful of lures--dozens of rubber and plastic worms and shiners and frogs and spinners--   Mrs. Bledsoe?   I'm Sheriff Deeds--    Yeah, that's the story of my life.   I've seen 'em.   You mind if I ask a few questions about your husband? Roderick?   He had the club out on the old trail road--   So you must remember Sheriff Wade.   You had to deal with him in running the club.   He squeezed money out of you?   And my father?   People didn't complain?   Do you remember the last time you saw him?  Minnie thinks, puts down the Gameboy--   And that was the last time you saw him?  We SHIFT to see Sam sitting where Wade was headed--   That was the night he disappeared?   And when my father was Sheriff?   What was your deal with him?  Otis smiles, chooses his words carefully--   He ever accept cash for a favor?  Otis smiles, looks away to ponder his response--    Sam walks on the sidewalk parallel to them, talking with three other MEN--   You finished?    That makes two of us.  Sam steps into his office, leaving H.L. shaking his head--   If the next guy's a redneck.   Good deal you were born down here, then.   You mixed drinks bad as you mix metaphors, you be out of a job.    Cliff and Priscilla talk across a table--     Yeah. I bet he would.   Excuse me--  They look up to see Sam standing over them--   Pleased to meet you.   If certain people have their way, it's going to be a new jail.   Do either of you have any idea when they stopped using that site as a rifle range?   Not for sure yet. But I kind of wish they hadn't.   Seems like we have another one every week.   People come here to catch bass and to get laid at the Boy's Town in Cuidad Leon--   You ought to put up a banner-- \"Frontera, Texas: Gateway to Cut- Rate Pussy\"--   Rather have that than the ten-foot- high catfish statue--   The Perdido thing?   Danny's gonna be out for blood the next time.   We don't need a new jail.   We're already renting cells to the Feds for their overflow--   It wouldn't happen to be your construction company gonna get the bid on building this thing, would it, H.L. And Jorge, you wouldn't be thinking about a couple dozen new jobs to dangle in front of the voters--   We need a drug rehab program, we need a new elementary school--   Look, I'm not gonna campaign against your deal here, but if anybody asks me, I got to tell them the truth. We-- don't--need--a new jail.   When you backed me you needed somebody named Deeds to bump the other fella out of office.  Hey, folks--  Sam and the others smile as they reach the CROWD of townspeople, mostly small business owners and retired people. Photographers from the paper and a local TV news crew wait by a veiled Statue roped off in a little traffic island. Mercedes, dressed to kill, stands waiting next to Hollis with a huge pair of scissors in her hand.    He nods to her as the crowd opens a path for him.   Let's get this thing over with.    Watching the crowd--    We PAN with his gaze across smiling faces, till he comes to Danny and a couple of Chicano friends, looking grim. We RACK FOCUS beyond them to see Pilar, watching the ceremony from a few yards back--    Not thrilled to be called on. He steps forward reluctantly to APPLAUSE--   You folks who remember my father knew him as Sheriff. But at home he was also judge, jury  He looks to Hollis--   --and executioner.  LAUGHTER. Sam holds Hollis's eyes for a moment before continuing--   This is a real honor you're doing him today, and if Buddy was around I'm sure his hat size would be gettin' bigger every minute.   I used to come to this park to hide from him. Now that you're putting his name on it--     I'll have to find someplace new to duck out.  More LAUGHTER--   I do appreciate it, and wherever he is, Buddy's puttin' the beer on ice for the bunch of you. Thank you.    Watching, a bit removed, as Mercedes shakes hands with Jorge and H.L. and Hollis for the cameras. He overhears a pair of BYSTANDERS who are checking out the statue--   Nice to see you, Mrs. Cruz.  Mercedes just looks at him, keeps going. His gaze brings him to Pilar, standing on the sidewalk, watching.    Steps over from the dispersing crowd--   Field trip?   Want to take a walk?   Your mother still doesn't like me.   I see she built a place up here by the river.   She's done well for herself--on her own and all--   They cooked the whole thing up without asking me.   Most people did, yeah.   Yeah.   Your boy, there--   Nice-looking kid.   No--   Fernando did okay, and he dropped out--   It might just be the age. I spent my first fifteen years trying to be just like Buddy and the next fifteen trying to give him a heart attack.  She looks at him--   Got divorced, I wasn't gonna work for my father-in-law anymore. The fellas down here said they'd back me--   I got to admit it's not what I thought it'd be. Back When Buddy had it-- hell, I'm just a jailer. Run a 60- room hotel with bars on the windows.   You've got your mother, your kids--   Remember this?  Pilar looks at the spot. She isn't ready to deal with whatever memory it brings back--   Pilar--   You going to tell her?   He doesn't need to know all my business.   So? What's he gonna do, arrest us?  Young Pilar frowns, tosses more bark--   You believe that?   Me neither.   Lupe? Get me the rangers up in Austin--    Sam, out of uniform, stands behind his little house chucking fallen pecans out into the dark, thinking, listening to the night sounds.    Working something out in his head. He looks off into the dark and we PAN with his gaze--A MAN steps toward us, barely visible in the darkness. It is Charley Wade--We're in Sam's REVERIE, in 1957--    We are back in 1995. Sam is blasted in the face with a  Zack?  The FLASHLIGHT BEAM PANS AWAY and ZACK POLLARD, a Border Patrol agent, steps out of the dark to Sam--   What's up?   I haven't seen anybody come by.   Yeah. It's quiet--   Sure.   'Night--  Zack steps away.  Sam shakes the pecans still in his band, goes back to chucking them--   First bullet entered beneath the left eye, severing the optical nerve and exiting from top rear of skull causing tissue damage   --and severe cerebral hemorrhaging. Second bullet entered left cheek driving fragment of upper and lower molars into base of skull. Third bullet--  Real estate transfers. A map of the Proposed Lake Pescadero. Another autopsy report. A FAX COPY of the forensics dental report on Charley Wade. Another autopsy report--    Intent as he pores over the paperwork--    Trying to put it all together.  PETE ZAYAS, a skinny, older man in trustee's coveralls, wanders in, emptying the trash baskets in the front office--   Hey, Pete. How's it going?   How much you got left?   You stop growing that loco weed at your place, you'd see a lot more daylight.   You're going to smoke an acre and a half of marijuana?   I thought he busted you a couple times.    I'm surprised he bothered with it.   So I've heard--   Well, you were working there--   You built our patio while you  were on the county?   I've heard Wade was a bit tough on the Mexicans--   Murdered him?   Yeah.   I been working on a few things.   I'm going over to the other side.   No--to Mexico. I've got to talk to somebody.   Gotta be in person.   They want you to stand for Sheriff next election.   You'd do a good job.   Don't know if I'll still want it.   I appreciate you telling me.  Sam looks at his Chief Deputy--   You think we need a new jail?   Yeah, Ray, you'd be a hell of a Sheriff.    CHUCHO MONTOYA, in his mid-50s, stands by Sam drinking a Coke as they watch the kid work.   You own this place?    You lived in the States for a while?   Made some money, came back here--   You ever know a fella named Eladio Cruz?  CHUCHO smiles, draws a line in the dirt with his heel--   Your government always been pretty happy to have that line. The question's just been where to draw it   You sell much out here?   Hell of a spot to put a business.   So when did Buddy leave?   You think he killed anybody in Korea?   No--   Another woman?   You know who it was?   What the hell are you doing? You fucking asshole!   You got no fuckin' right! You stay out of my fuckin' life!   You leave her the fuck alone!    Remembering. MUSIC BEGINS as he gets back into the car, pulls away.    MUSIC CONTINUES. We can see PILAR, through the lighted window of her classroom, preparing something on the blackboard--   Yeah.   Yeah.   Nothing.  Pilar looks at him--   You know the other day, you asked why I came back?   I came back 'cause you were here.  PILAR nods. She gets up and we FOLLOW her across the dark room to the jukebox. She looks at the selections--    Sam and Pilar finish making love. They lie beside each other, shaking a little--   Yeah.   I don't know. It just feels good. Always did.   More, I hope.  PILAR smiles, looks around the room--   Two years.   Don't have kids. Other pictures--I don't know--it's nothing I want to look back on.   I've felt that way, yeah.  Sbe puts her head on his cbest--   Pilar--   What was your father's name?   Morning, Hollis.   You thought any more about our murder?   Charley Wade.   I got an idea what happened.   I think somewhere between Roderick Bledsoe's club and his house, Wade ran into Buddy Deeds. I think Buddy put a bullet in him, waited for him to die, threw him in the trunk of the Sheriff's car and drove him out by the Army post, I think he buried him under four feet of sand and never looked back.  Hollis sits back to look Sam in the eye--   I got to go see somebody in San Antonio today. Your memory gets any better, I'll be back tonight.  Sam stands and walks away. We HOLD on Hollis, his appetite gone--   That's in Maverick County.  She brings us to Sam, sitting uncomfortably, beneath a full- sized blowup of Tony Dorsett hurdling a tackler--   Rio. BUNNY Right. This kid, Hosea Brown? Does tire 40 in 3.4, soft hands, lateral movement--the whole package. Only a sophomore--   You still going to all the home games?   Bunny, you--uhm--you on that same medication?   No, you look good. I was just wondering.   You look good--   Yeah, well--   You were in a fight--   Same weight I always was.   Best part of the job.   Bunny, is that stuff I left in the garage still there?   No. You?   You didn't--uhm--you didn't have one of your fires, did you? The stuff I left in the garage--some of it was my father's--   Suppose not.   It wasn't just you, Bunny.   What?   I think they have another fella there to keep it off your chest. A spotter.    You look good, Bunny. It's nice to see you.   \"Dearest Buddy--\"  He puts the letter down for a moment, thinks. He needs to know. He picks the letter up again, reads.   Hollis? You in there? Hollis?   Fellas.   Open late.   Hollis probably told you we found Charley Wade.   You two saw it, didn't you? You two saw it when Buddy killed him.  Hollis and 0tis look at each other--   Imonna find out one way or the other.   Yeah, and my mother was a saint. For fifteen years the whole damn town knew he had another woman on the side. Stole ten thousand dollars to set her up in business. But hell, what's that? You got a problem? Buddy'll fix it. Facing some time in jail? Buddy'll knock half of it off-- if you do what he says, when he says. You got some business that's not exactly legal? Talk to Buddy--   Buddy Deeds was a murderer.  He looks at the two older men for a long moment--   That night in the cafe--he didn't stay long after you left, did he, Hollis? Maybe he decided he'd gone too far with Wade, maybe he figured he better not wait for the Sheriff to get behind him. So he stepped out to see if he could catch up--and you were here at the club that night, weren't you, O?  Otis sighs, begins to speak softly--   And the ten thousand?   Don't think the Rangers are likely to find out any more than they already have.   Buddy's a goddamn legend. He can handle it.  He heads for the door--   'Night, fellas.  Hollis and Otis watch him go--   You gonna tell your mother we been seeing each other?   You have any idea when your father died? Eladio?   Try a year and a half. He bands her an old snapshot. PILAR looks at it--    Pilar hands the photo back to him, tries to be calm--   Buddy bought the cafe for her with money he took from the county. Pilar looks away, struggling not to cry--   He paid the hospital bill when you were born. Your mom always calls you \"our beautiful daughter\" in the letters she wrote to him.   I remember thinking you were the one part of my life Buddy didn't have a piece of--  A silence, both of them wondering what the next move should be--   If I met you for the first time today, I'd still want to be with you.  It is what Pilar needed to hear--   Yeah--",
        "Celie": "He went to school on base when we were in Okinawa. It's all--you know-- kids in the same boat--Army brats.   I'm more worried about the social thing. Are therelike--gangs, or...?  PILAR starts to put the poster up. CELIE moves to hold it in place for her.   So Blacks are--   I don't see what the big deal is. Go back over, talk to the man, and bury the hatchet, Del--  CELIE passes us and Del crosses back in the other direction from behind the camera, carrying boxes of their belongings. We continue our SLOW TRACK forward--   You were 8 years old when he left--   People change.   We're going to have to see him."
    },
    "imdb_rating": "7.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BN2ViYzQ3YTAtZmQ5OS00ZWNkLWFkZWQtYTJiNTI1OWVlMzc0XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_QL75_UX380_CR0,5,380,562_.jpg",
    "description": "John Sayles' murder-mystery explores interpersonal and interracial tensions in Rio County, Texas. Sam Deeds is the local sheriff who is called to investigate a 40-year-old skeleton found in the desert....As Sam delves deeper into the town's dark secrets, he begins to learn more about his father, the legendary former sheriff Buddy Deeds, who replaced the corrupt Charlie Wade. While Sam puzzles out the long-ago events surrounding the mystery corpse, he also longs to rekindle a romance with his old high-school flame. Sayles' complex characters are brought together as the tightly-woven plot finally draws to its dramatic close.Tad Dibbern <DIBBERN_D@a1.mscf.upenn.edu>",
    "name": "Lone Star",
    "genres": [
        "Drama",
        "Mystery",
        "Western"
    ]
}