{
    "filename": "Lost-in-Translation_script.txt",
    "imdb_id": "tt0335266",
    "imdb_url": "https://www.imdb.com/title/tt0335266",
    "characters": [
        "Jazz Singer",
        "American Businessman #1",
        "Bob Harris",
        "Ms. Kawasaki",
        "Concierge",
        "American Businessman #2",
        "John",
        "Press Agent",
        "Sausalito Piano (as Francois du Bois)",
        "Charlotte",
        "Sausalito Guitar",
        "Commercial Director (as Yutaka Tadokoro)",
        "Bellboy"
    ],
    "dialogues": {
        "Jazz": "Thank you. We're glad to be here, we're Sausalito.",
        "Singer": "Thank you. We're glad to be here, we're Sausalito.  Good Evening. I'm Carl West, and we're thrilled to be joining you this week, here at the NY bar in Shinjuku.  Jt seems we stood and talked like this before,   we looked at  each other in  the same way thenr   but I cant remember where or when...  Somethings  that happen for the first time,   seem to be happening again and so it  seems we have met before, and laughed before,   and loved before,   but who knows where or when...",
        "Bob": "That's all he said?  Turn left or right?  Is that everything? It seemed like he was saying a lot more.  For relaxing times, make it Suntory Time.  Okay.  For relaxing times, make it Suntory Time.     Yes?  Oh?  Yes?  I don't think so.  Yes?  Huh?  Oh, you want me to rip them?  I think you should leave.  I'll have to see about that.  Can you get me on a flight Thursday night?  Yeah, they told me.  Just get me out of here as soon as you can.  Oh, great. I'll talk to you later, bye.  Urn, I don't think so. How bout I just hold the bottle.             My wife needs space, I don't know my kids ' birthdays.  Everyone wants Tiger Woods, but they could get me, so I'm here doing a whiskey commercial.  What about you? Why are you here?  How long have you been married?  Try twenty-five.  I'm thinking about it.  Yes... I don't know, I don't know her anymore. I don't know if you can be in love with one person the whole time. I was... actually I was in love with her sister first, when I was twenty-one. And one day her sister said to me she wanted to move to Paris, so I said okay, and she said no, she wanted to move to Paris with Francois,   and she's still married to him. And I moved in with Lydia... but I always really liked Lydia.  What do you do?  What did you study?  Oh, what do you do with that?  It takes a while to figure it out. I'm sure you will, though.  Thanks.  Who do I have to fuck to get off this planet?      (awkward, but glad to run into her  No, how about you?  I'm here for the week.  Ok.         A Soul's Search: Finding Your True Calling - are you reading this?  I read it, too.  Hi, Charlie.  No way.  Ok.  I will.  Are you ok?  I know. I don't either.      Lydia?  Lydia, I went to this great house tonight, this guy designed and built, you would have loved it.  He was this fashion guy, and there were all these Japanese fashion people- it's a whole other world, and I was talking to these Japanese surfers... He was playing all this great music- I have to find out what it was...  Yeah, its really different here.  It's four in the morning... I'm going to go to sleep.  I love you, too, good-night, or good- morning .       Charlotte, who?  Of course.  Yeah, I'm going to take a shower and I'll meet you downstairs.  I see them every morning.        Hans was very attentive to you.  No, its easy.  I don't know.  But the first time I saw you was in the elevator.  Yeah, you don't remember?  No, you smiled.  I know, I kind of blend in here.  I don't know. My fax said \"have a good fright\".  Ok, whatever you want.  No, I was looking at you.  I got a fax today from your friend Hiromix.  No, for a candlelight dinner, yes, for her show.  You're possessive.  No, yes, it does...  Thanks. It does, the more you know who you are... you don't care about things the same way...  You'll figure it out. I'm not worried about you. Keep writing.  That's ok.  It's hard. We started going to a marriage counselor.  We established that we have no communication.  We used to have fun, she used to like to go to places with me for my movies and we would laugh at all the weirdos, but now she's tired of it all. She never wants to leave the kids, she doesn't need me, and they don't need me, I feel like I'm in the way. It gets complicated when you have kids... that changes everything.  When they're born its like Vietnam. It's terrifying.  But, it's great being with them, after they can talk, and can do things with you.  Where'd you grow up?  I know.  You are.  Because that would be too easy.      Hello?  Ok.    Miss Kawasaki? It's Bob Harris... I'm not going to be able to do that interview today.., yeah... ok.... Yes, I'd love to stay to be on his talk show... sure.. ok... bye.  They really have to work on that street name thing.  It's for my daughter.  Four.  Nice one.  What happened to your toe?  That doesn't look good.  We should get you to the doctor.  Yeah, look at that thing.  How do you say \"hospital\" in Japanese?  Hospital?  Yes, can you tell me how to say \"hospital\" in Japanese?  Hosupitari?  Hello?  Oh, hi, Elaine.  Ok.  Yeah, I'll stay.  Hello?  Hi, Lydia.  Uh, no.  Ok, whatever you think... I'm lost.  That's not what I'm talking about.  I don't know.  I don't know... I want to be more healthy. I want to eat better.  You know, eat healthier.  Not all that pasta.  Like Japanese food.  Oh, come on.  Yeah, I'll be fine. Bye.  Where's your husband?  Do you ever see him?  Do you know where we are?          Yes, but no, I can't right now.  I don't want to be.  Hello?    I couldn't hear you. How are you?  It's ok.  What?  Yeah.  That's ok.  Tomorrow.  Ok.  Bye.  No, we'll find something around here.  You're a brat, wasn't there anyone else around to lavish you with attention?  We'll have two of these.  What do you want to drink?  So, where'd you go today.  I'm sorry.  Tomorrow.  That's what you said the other night.  I don't want to go back tomorrow.  Why can't it last?  Hello, can I have room 5601.  Uh...Hi, Charlotte... it's me, Bob... ok, I guess you're not there... wanted to say good-bye...  Charlotte?  I'm just leaving.... do you have my jacket?  That'd be great.  0hr hi.  Yeah, yeah, I'm going.  I have to go, thanks, bye.  Yes, no.  Thanks.  Yes.  Thanks.  Can you pull over a second?   Why are you crying?  I know, I'm going to miss you, too.",
        "Harris": "",
        "Ms.": "",
        "Kawasaki": "Mr. Harris  Can you stay until Friday?",
        "Concierge": "Concierge desk, may I help you?  \"Hospital\" in Japanese? Hosupitari.",
        "John": "Go to sleep.  I'm just here shooting this band, what about you?  We're here for the week. I'm shooting in Osaka for a few days.  Have you met Charlotte? My wife.  Uh..thanks.  Oh no...  Ok, see you later.  What?  Oh, c'mon, she's nice.  Not everyone went to Yale.  Its just a pseudonym, it doesn't matter.  I'm not, but do you have to point out how stupid everyone is.  OK, I'll see you later.  Good...I'm tired.  I gotta go meet Kelly for a drink downstairs. She wants to talk about some photo thing.  You wanna come?  (doesn't really want her to    No, what are you talking about.  That's ok.  That's ok, you'll figure it out.  What?  I got some hair stuff.  I gotta go to work.  I'll be right down...I'm just leaving...ok.  See you later.  At the fitting, they had all these rock n roll clothes, the label guys kept saying lock n loll, though, but the band doesn't look tough at all...they look better just skinny and nerdy, like how when they came in...they looked so uncomfortable in these Keith Richards clothes, they should just be like they are, don't you think?  Yeah, I think you're probably right... because when you try to...  I don't know.  Will you please stop smoking?  Its bad for you.  A Soul's Search: Finding Your True Character and calling? Is this yours?  You don't have to be embarrassed.  It's ok if you are.  Oh, the record company sent these...  I gotta go... and I don't really like champagne.  Are you sure you want to stay?  Ok, definitely call them, I'll be back Friday. I love you.  It'll just be a few days.",
        "Press": "(as they are on their way",
        "Agent": "(as they are on their way",
        "Charlotte": "Are you awake?  John?            I'm not sure.  What are you doing here?  Oh.  I'll just have a beer.  My husband's here for work-he's a photographer- and I just came along...I'm not really doing anything right now, and we have some friends who live here.  Two years.  You're probably just having a mid- life crisis. Did you buy a Porche?  25 years... that's a long time... Are you still in love with your wife?  (amused with too much info  I'm not sure, yet... I graduated last spring.  Philosophy.  I don't know, but I can think about it, a lot.  Thanks. I'm sure your mid-life crisis will work out,too.  I wish I could sleep BOB Me, too.  Hi, nice to meet you.  Evelyn Waugh?  Evelyn Waugh was a man.  Why do you have to defend her?  No, I thought it was funny. Forget it.                    How'd it go today?  Ok. Maybe I'll walk down with you.  Sure.   Really?  Yeah, it is.  Hi again, how's it going?        I went to a temple today and I didn't feel anything.  I don't know what to do.  You smell weird.  Like popcorn?  Hair stuff?  Bye.  Lauren?  It's cool... but,I don't know... I went to a shrine today and all these little monk's were chanting... and, I didn't feel anything... I even tried ikebana, ...   and John's using hair products... I don't know who  Sure.  Oh, it's nothing... I better go, I'll talk to you later.  Ok, bye.     Ouch.  Yeah.  Do you think it's done?  But I like to... and I don't smoke that much.  Ok, I will... later.  Oh... that's nothing, someone gave it to me.  I'm not. It's just corny, but I'm not into it.  Mmm, I love Cristal, let's have some.  Are you sure you have to go?  Yeah, I know you have to work the whole time, I'll probably have more fun here. I'll call Charlie and those guys.  I love you.  I miss you.  Oh, hi.  Yeah. Did you get some sleep?  Not really. How long are you here for?  Oh, good. Do you want to go to a party tonight with me and some friends who live here?  See you later.      You really are having a mid-life crisis.  No.  Charlie, this is Bob. Bob  Charlie Brown.  His real name's Hayashi, but someone started calling him Charlie because they thought he looked like Charlie Brown. They've all got American nicknames because its easier for me to remember... they were just out in L.A. last month doing a shoot with John... that guy's Mr.Valentine, he's the art director of their magazine, I don't even know his real name, or why I call him that.  Hi.    Thanks, you guys should come back sometime.  What do you feel like singing, Bob?  You bite your nails?  I could cut the ones that are left for you.  Hans?  Nice to meet you.  I don't want to go home.          It's Charlotte.  Thanks for getting me back in one piece.  Do you want to have some breakfast?  OK, see you downstairs.  (trying to make it light          I think he kind of liked me...Is that so hard to imagine?  How'd a Japanese guy get a name like Hans?  Do you remember when we met at the bar? ...You were wearing a tuxedo.  Really?  Did I scowl at you?  I don't remember.  Why do they switch the r's and l's here?  Let's never come here again, because it would never be as much fun.  Did you see Hiromix last night dancing with Bambi?  Oh.  Well... they were dancing on the couch with that weird English guy who kept talking about hanging out with the Sex Pistols on Kings Road...  Oh, for her show?  Oh.  I know.  I'm stuck. Does it get easier.  Yeah? But look at you.  I just don't know what I'm supposed to be. I thought maybe I wanted to be a writer... but I hate what I write, and I tried taking pictures, but John's so good at that, and mine are so mediocre... and every girl goes through a photography phase, like horses, you know dumb pictures of your feet...  But, I'm mean.  And marriage, does that get easier?  Did that help? Did you learn anything?  Oh.  That's too scary.    That's nice. My parents were always traveling, they weren't around so much.  In D.C., my dad was the Ambassador to France in the eighties, so we went to school in Paris for a few years... but we mostly lived in D.C., and they were never around... and then I moved to Los Angeles when John and I got married... it's so different there.  John thinks I'm so snotty.  I know, but that's what you like about me.  Why do you have to be with your opposite, why cant similar people be together?  You made it.  What's that?  How old is she?  Oh, she'll love it.    I don't know, I think maybe I broke it? I knocked into something the other day...  It's bad isn't it?  You think so?  Is that for me?    How long have you been here?  C'mon, let's go.  (like she's said it a million times    No.  Isn't it weird there are no street names in Tokyo... you'd think a city like this would have street names... you need a map to get anywhere... look, there are no signs...      Um..Hi, John, if this is your phone? I'm not sure...I'm going to go to Kyoto for the day...I'11 try you when I get back. Hope it's going good... I love you, bye.  Rough night?  I'm going to Daikanyama, do you want to come walk around?  Oh, I guess you're busy, huh.  You can't get sushi anywhere in Japan after 2 o'clock. Did you know that?  The Jazz singer? The red-head?  Well, I guess she's more around your age...  You guys could talk about things in common, like growing up in the fifties.  I can't tell the difference?  A coke.  Around.  They're not going to play the whole album, are they?     That lunch was the worst, huh.  When are you leaving?    Well, I mean it more now.  I know. But, it doesn't last, you have to go back sometime.  I don't know, it just doesn't, reality changes things....we can't stay here forever, unless maybe we started a Jazz band.  54?     Hi, Bob.  Uh, yeah... I'll bring it down.  Just saying good-bye to everyone before you leave?  That's it?  You're leaving right now?  Well... have a good flight.",
        "Sausalito": "",
        "Guitar": "",
        "Bellboy": ""
    },
    "imdb_rating": "7.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTUxMzk0NDg1MV5BMl5BanBnXkFtZTgwNDg0NjkxMDI@._V1_QL75_UX380_CR0,12,380,562_.jpg",
    "description": "Middle-aged American movie star Bob Harris is in Tokyo to film a personal endorsement Suntory whiskey ad solely for the Japanese market. He is past his movie star prime, but his name and image still have enough cachet for him to have gotten this lucrative $2 million job. He has an unsatisfying home life where his wife Lydia follows him wherever he goes - in the form of messages and faxes - for him to deal with the minutiae of their everyday lives, while she stays at home to look after their kids. Staying at the same upscale hotel is fellow American, twenty-something recent Yale Philosophy graduate Charlotte, her husband John, an entertainment still photographer, who is on assignment in Japan. As such, she is largely left to her own devices in the city, especially when his job takes him out of Tokyo. Both Bob and Charlotte are feeling lost by their current situations, which are not helped by the cultural barriers they feel in Tokyo, those cultural barriers extending far beyond just not knowing the language. After a few chance encounters in the hotel, they end up spending much of their time hanging out together, each helping the other deal with their feelings of loss in their current lives. The friendship that develops between the two, which is not always a bumpy-free one, may be just for this specific place and time, but it may also have long lasting implications.—Huggo",
    "name": "Lost in Translation",
    "genres": [
        "Comedy",
        "Drama"
    ]
}