{
    "filename": "Machete_script.txt",
    "imdb_id": "tt0985694",
    "imdb_url": "https://www.imdb.com/title/tt0985694",
    "characters": [
        "Julio",
        "Sniper",
        "Osiris Amanpour",
        "Machete",
        "Torrez",
        "Senator McLaughlin",
        "Booth",
        "Jorge",
        "Luz",
        "Von",
        "Padre",
        "Von's Henchman",
        "April",
        "Sartana",
        "Reporter"
    ],
    "dialogues": {
        "Julio": "",
        "Sniper": "He's off the grid. Sonofabitch disappeared.  I'm no cop. You seen this guy?  Call me when he shows or I'll carve that pretty face of yours into a seven layer burrito got that puta!?  This guy.  You're sharp. You're liable to get cut.  Safety first.  Lead's ran cold. He's underground. Probably back in the homeland by now.  Ho-ly shit. Who knew that your Mexican day laborer was a goddamn Federale?! RNewman / Endeavor Draft 50.     Oh shit.     Yeah.  Yeah.  Where's your boyfriend?  Where is he keeping them?  You're not gonna think it's funny when I cut you a new twat. RNewman / Endeavor Draft 63.  Wait...  Moron. RNewman / Endeavor Draft 64.  She wasn't very cooperative.  They're in a church. I know where.  Where is he?  Machete you can come quietly and we won't hurt the girl.  You can trust me. I've brought one of your old friends to vouch for me.  You punk kids! That's it!  You, I got you, what...  No! No!  Oh my God... Please... No. Please!",
        "Osiris": "",
        "Amanpour": "",
        "Machete": "This is the boss.  Get dressed. RNewman / Endeavor Draft 3.  We need to go. Now.  My machete.  Torrez?  $70 a day for yardwork. Hundred for roofing. One-twenty-five for septic. Sewage.  I cost the most, because I'm the best there is.  Like the car.  What are you looking for, Mr. Benz?  That doesn't sound like your problem.  What do you want me to do?  Collateral.  This is Cisco's floor. I'm on 11.  Find Cisco.  Another way out?  Thanks.  Did you open it?  I don't know about that.  Why are you helping me?  You know me?  The myth might be better.  Bless me, Padre, for I have sinned. It's been a long fucking time since my last confession.  Sorry, bro. I mean, Padre.  Few weeks.  Didn't need you before.  I'm not sorry.  They used me.  They need to pay. RNewman / Endeavor Draft 46.  Either. Both.  Yes, bro. I mean, Padre.  When I get the money, I'll give some to the church.  A hundred-fifty thousand.  Stop it.  That one. He's the one who hired me. Benz.  Where does he live?  I'll leave some for you.    Or else.  He called in sick.    Drive.  You're a cop.  How did you find me?  Turn here.  It was just a job.  Michael Booth.  Maybe. Turn here.  Give me ten dollars.  Ten bucks.  Stop the car.  Wait.  For the tacos and coffee.  Drive.  No hospital.  Onions.  Onions!  Come here.  Yes. RNewman / Endeavor Draft 57.  Do it.  Luck.             The guards told me that before they beat me.  You came to arrest me?  Out? RNewman / Endeavor Draft 68.    Help me find Booth.  Give it here.  Si.  You're borracha. RNewman / Endeavor Draft 70.  Come on!  Not long enough.  Looking for someone?  Follow him.  I was born in the fire. It wasn't luck. RNewman / Endeavor Draft 83.  What good is it...  I'm still standing...Puta.  What's the problem officer?  Let me give you my ID.  Machete.  Why do I want to be a real person... when I'm already a myth?  Torrez was just an errand boy. I'm going to find the man who sent the message.  Light a candle... Say a prayer...",
        "Torrez": "Bueno... pero no tanto. (Sub: Good... but not that good. RNewman / Endeavor Draft 5.  You had to stick your neck where it didn't belong, amigo.  He's alive.  Texas.  She was just a warmup. Now I'm ready for dessert.  Machete!  You never learned to stay down, pendejo. I killed you once. I can do it again.  All roads lead to Hell, eh, Machete?  Most people die in the fire, but you survived, you unlucky bastard.  Faith? Yeah, faith got you a good job picking melons. While I bought the world.  .. for a man to gain the whole world yet forfeit his soul? Mark 8:36. I know it better than you Machete. Your father taught it to me, too!",
        "Senator": "",
        "McLaughlin": "Not at all. Those voters are here legally. RNewman / Endeavor Draft 17.  It cheapens their experience, their hard work, to have people jumping the border, taking advantage of loopholes in our system. It makes a mockery of everything they've worked for and turns it into a big steaming pile of--  It's Mario. He's my goddamn hairdresser.  I've got to look good for my constituency.  Mario's the best.  Who died up your ass, Benz? I'm elected, you sonofabitch. The people have spoken, by a slim margin maybe, but they picked me. RNewman / Endeavor Draft 18.  Von... that fat sonofabitch. What does he say?  Make no mistake, my friends: We are at WAR. Every time an illegal sneaks across the border by dark of night it is an act of aggression against the United States. And I submit to you, it is an overt act of TERRORISM. These people are  The fuck was that?  What are you talking about?  Fix me a goddamn drink.         will not end my struggle, to keep our country safe from those who would destroy it. God bless everyone who stood with me today, I will return to the fight. And God Bless America.  I don't know what I can do to help you in here, Agent Rivers. You want to find the bastard did this, go look for him.  You can't assure dick. Just ask what you want and then you can be on your way. RNewman / Endeavor Draft 33.  No.          Where the fuck have you been?  My business is here. Did you see those crews out there? They expect a statement. (noticing Booth's ragged  Well, what am I going to tell `em?  I do. All right. Once this is done, you need to take a vacation. You need some air.  No doubt about it. You're losing your marbles, Booth. RNewman / Endeavor Draft 75.  It's showtime.   I'd just like to thank the all of you for your support during this difficult time.  My will to fight has only just begun. We must not let the terrorists win this battle for our land, our America! Thank you.  Do what now?  No further comment. Thank you.  Could somebody fucking help me? I think I'm having a heart attack.  What did you do, Booth? You jeopardized my career with that wetback! He could have fucking killed me!  You stupid sonofabitch. You pull something like this, without consulting me?! You fucked me. You are a stupid sonofabitch. The press is going to demand answers! You got another brilliant solution for that?",
        "Booth": "",
        "Jorge": "",
        "Luz": "Cafe! Taquitos! Tarjetas de llamada! (Sub: Coffee! Tacos! Long- distance calling cards!  Pancho vamanos! Leave him alone.  He's a fat fuck, don't do nothing and eats all day, like my last husband.  Thank god. Why buy the pig when I can get the chorizo for free?   Be careful mi amor,and don't leave no scraps.  Via con dios.  Looking for something?  Mañana me pages. (Sub: You can pay me tomorrow. RNewman / Endeavor Draft 11.  I do the carving around here pendejos.  Come to mami. RNewman / Endeavor Draft 13.    Hijo de la chingada. What happened to you?         You'll be safe here.  No. RNewman / Endeavor Draft 35.  Nothing worth nothing here, unless you were going to make a pinata. Now lie back.  You know what this is, right?  Works every time. When the sun rises, you'll be good.  Cuidado, chico. You might burn yourself.  You know why Machete.  No, but I know the myth of the last honest cop in Mexico.  Cada uno lleva su cruz (sub. We each have our cross to bear RNewman / Endeavor Draft 36.      Hey Culero, leave them alone. They don't like pork.  Have you seen him?  Cono,this won't end pretty. RNewman / Endeavor Draft 47.  You get around. RNewman / Endeavor Draft 55.  Yeah, they came looking for you. I told them nothing, as far as I know you're a myth.               Who's that? Your mother?  Hijo de Puta!  You're coming with me Maricons!  Cabron, I told you it wouldn't end pretty.  Bring him inside. RNewman / Endeavor Draft 73.  It pays to have friends, Pendejo. They got your ass when you need it.",
        "Von": "Welcome to America.  \"Congress shall make no law abridging the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.\" Do you know what that's from?  The First Fuckin Amendment \"Congress shall make no law abridging the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.\" I would like to assemble peaceably as I have some grievances to redress. Now is that all right with you? RNewman / Endeavor Draft 19.  It's a great day in America, Amen.  Well, well, Look what's come asking for Papa Von's help.  You needed me from the get go, but let's not piss on what's past.  Sweet Jesus. I bet he's got a big imagination what to do with a couple cutie pies like that. Makes me ill just thinking about it. You must have broken off a dick in his ass. First he comes after your boss, then he comes after your family. Who's next?  Ain't you worried about staining the Senator bringing us into this? RNewman / Endeavor Draft 53.  What do you think he meant by that?  Boys! We're goin hunting.  The day is upon us, my friends. We'll take down the interloper, and anyone who gets in our way.  Do you believe in freedom?!  Will you die for freedom!  If that's what it takes to make you free, I will kill you with my own bare hands, Amen. RNewman / Endeavor Draft 61.  Heal up, brothers. Heal up good. The day is upon us.  Let him stew awhile.  Von here.  Up? Up where?  Fine. Bring him here. Papa Von's got a big surprise a-waiting.  And you led him right to Papa Von. That's some kind of thank you.  The senator, maybe. But what exactly do I owe you, turncoat?  You held the hand that held the gun, Booth. Just as good as you killed him.  Put the traitor in the brig.",
        "Padre": "I was wondering when you were going to show yourself. They're combing the city for you. How long before they get your file and track down your stepbrother, the priest?  You were wrong to come here. How long have you been here anyway?  Why didn't you come to me before?  What do you think I can do for you? Give you absolution? You have to be sorry for your sins, first.  I'm not surprised.  They use all of us. Welcome to the real world.  In money or blood?  I am a man of faith. I took a vow of peace. You want me to help you kill all these men?  I'll see what I can do.  You think Jesus wants your blood money, Judas?  How much blood money are we talking about?    I had them installed last year. Too many things were walking away from the altar, the collection plate. Check this out. RNewman / Endeavor Draft 48.  No time for that now. You need to see this. I Tivo'd it earlier.  That's Michael Booth. McLaughlin's aide or something. Cabrones, los dos. Why would he hire you to kill his boss?  Machete, you can't just kill everyone! RNewman / Endeavor Draft 49.  That's not what I meant.          Holy...         What do you want me to do with this? We can't keep them locked up forever.  God has mercy. I don't. RNewman / Endeavor Draft 65.  In your nightmares.    Like McLaughlin? RNewman / Endeavor Draft 66.  You're so drunk with power, you ordered the hit on your own boss.  Like McLaughlin?  You're so drunk with power, you ordered the hit on your own boss.",
        "Von's": "",
        "Henchman": "Booth isn't going to like this. What are we going to tell him?  Fuck that, you wait.  Man...what happened?  Please, Father. Have mercy.",
        "April": "I think Cole is going to ask me to marry him.  But I don't want to marry him.  I mean, look at me. I'm not ready for that kind of commission.  That either. I have priorities.  I'm talking about my modeling.  No it isn't. Do you know how many hits I've gotten on my website?  I know what the online public wants, and they want me. All of me. Cole's just going to have to wait.    Hey, you're not the usual boy!  Don't be shy. RNewman / Endeavor Draft 51.  Why don't you come in? The water's fine.  Oh, momma! He's got the good stuff!  Mom? Where are we? I'm scared.  What is this place?",
        "Sartana": "",
        "Reporter": "But isn't this anti-immigration platform a hard sell in this part of the country, where so many voters have strong ethnic backgrounds?    Holy fuck!  Congressman, there are reports implicating your advisors as having orchestrated the shooting. Would you care to comment? RNewman / Endeavor Draft 76."
    },
    "imdb_rating": "6.6",
    "description": "The highly skilled Federale Machete is hired by some unsavory types to assassinate a senator. But just as he's about to take the shot, he notices someone aiming at him and realizes he's been set up. He barely survives the sniper's bullet, and is soon out for revenge on his former employers, with the reluctant assistance of his brother Cheech Marin, who has become a priest and taken a vow of nonviolence. If you hire him to take out the bad guys, make sure the bad guys aren't you!—rmlohner",
    "name": "Machete",
    "genres": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZWUxODc2NmItNThkNS00Mzc4LThlYTQtOTYwZjVhYjRiNmMwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}