{
    "filename": "Magnolia_script.txt",
    "imdb_id": "tt0175880",
    "imdb_url": "https://www.imdb.com/title/tt0175880",
    "characters": [
        "Firefighter",
        "Delmer Darion",
        "Craig Hansen",
        "Young Boy",
        "Sydney Barringer",
        "Daniel Hill",
        "Arthur Barringer",
        "1958 Policeman",
        "Stanley Berry",
        "Reno Security Guard",
        "Sir Edmund William Godfrey /Young Pharmacy Kid",
        "Forensic Scientist",
        "Joseph Green (as Mark Flannagan)",
        "Mrs. Godfrey",
        "1958 Detective"
    ],
    "dialogues": {
        "Firefighter": "CAMERA dollies in and TILTS up towards the top of the tree to reveal:  There is a MAN IN SCUBA GEAR hanging high in the tree. He is wearing his goggles and his tanks and his wet suit.",
        "Delmer": "He still has his mask and mouthpiece.",
        "Darion": "He still has his mask and mouthpiece.",
        "Craig": "...oh God...fuck...I'm sorry...I'm sorry...  ...forgive me...",
        "Hansen": "...oh God...fuck...I'm sorry...I'm sorry...  ...forgive me...",
        "Young": "He said he wanted them to kill each other, that all they wanted to do was kill each other and he would help them if that's what they wanted to do --  Hello.  Wow.  Lot-o-stuff here, huh?  Cats and Dogs out there, huh?  Must have alot goin' on for all that stuff you got back there, eh?  You could have quite a party all that stuff....  You been on Prozac long?  Dexadrine?  Interesting drugs.  Dexadrine's basically speed in a pill.  Y'know?  But I guess a lot of doctors are balancing out the prozac with the dexadrine, eh? That Liquid Morphine'll knock you down, out, around, up and down someone's not careful.....can't mix those up, y'know... ...Must have a lot goin' on in your life for all that stuff there.  Strong, strong stuff here, boy...wow.... What exactly you have wrong, you need this stuff?  -- what-what-what, ma'am -- I --",
        "Boy": "He said he wanted them to kill each other, that all they wanted to do was kill each other and he would help them if that's what they wanted to do --",
        "Sydney": "",
        "Barringer": "I didn't know -- I didn't know --  She always threatens me with the gun, but I don't keep it loaded --  Why would I load the gun?",
        "Daniel": "",
        "Hill": "",
        "Arthur": "She always threatens me with the gun, but I don't keep it loaded --  Why would I load the gun?",
        "1958": "",
        "Policeman": "",
        "Stanley": "...Donald W. Winnicott....1911...North America.... ...South America....the answer is four.... ...the answer is 22...the answer is gravity.... the answer is \"The Life of Samuel Johnson.\"  We need more dog food --  I need this one.  I can't carry all of them. I need them. I need my books. I need them to go to school.  Should be one-thirty.  Love you too.  You're late, not me.  -- I didn't see you from the window.  Sure.  I'm fine. Yes. I'm fine.  Where's Richard and Julia?  See you.  Where's the news department at this studio?  Have you ever been there?  I'm wondering about the weather department. I'm wonderin' wether or not the weather people use outside meteorlogical services or if they have in-house instruments?  Ok.  I don't have regular classes anymore.  They just let me have my own study-time, my own reading time in the library.  No.  Like what?  What's MOW?  Cynthia?  How much time do we have?  I should maybe go to the bathroom.  I don't know.  They look pretty smart, I think.  Maybe.  I gotta go to the bathroom.  Willa Cather.  Thomas Kyd.  Moliere.  Jean Baptiste Poquelin Moliere.  I have to go to the bathroom, Cynthia.  I'm, I need to go, I'm gonna --  I'm fine. Yes.  Ohh, it's all fine. It's all. Nice. I'd just like to keep going....keep getting on....  I was saying...thinking maybe I'd get my own quiz show someday, Jimmy. Just like you!  ...I don't know the answer...  Shut up -- shut up --   I'm fine. nothing.  I didn't know the answer --  I don't know.  I didn't I'm fine, I'm fine.  I said I'm fine.  I'm fine. I'm fine, I just wanna keep playing --  Yes.  Alright.  CAMERA pushes in on him and lands in CU. He takes his shirt out of his pants and tries to pull it down enough to cover the large wet stain in his pants.  I don't wanna go, I can't do it this time.  I don't wanna do it.  Why can't one of you do it --  I'm sick of being the one, the one who always has to do everything, I don't want to be the one always --  I'm going to pass, Jimmy.  I don't want to go.  I don't want to play.  I always play, I always answer the questions and I don't wanna do it anymore --  This isn't funny.  This isn't \"cute.\" Jimmy -- Jimmy -- we're not a toy -- we're not dolls, here.  This isn't funny you see, the way we're looked at if you think that we're cute Because What? What?  I'm made to feel like a freak if I answer questions and I'm smart or I have to go to the bathroom.  What Is That? And what is that, Jimmy, I'm asking? I'm asking what is that, Jimmy? I'm asking you that -- ?  We are not on display.  I am not a doll.  I'm sorry, I'm sorry, I didn't mean to do this.  I don't mean to cry, I'm sorry.  \"..till you wise up, no it's not going to stop, so just....give up.\"  Worm sits into FRAME, near to Stanley.  Stanley glances up, they make a quick moment of eye contact, then look away.  BEAT. HOLD.  Hi.  It's ok.  Are you alright?  Hi.  It's ok.  Are you alright?  Yes.  ....Why does he do it...?  It's not right.  I have money.  I have money to give you.  I can take you to get money.  I don't need it...I don't <u>need</u> it -- listen to me: I can let you have money so your father won't hit you ever again -- you'll have the money because I don't need it.  It's frogs.  It's raining frogs.  It's raining frogs from the sky.  This happens....this is something that happens.  Dad...Dad.  You have to be nicer to me, Dad.  I think that you have to be nicer to me.",
        "Berry": "",
        "Forensic": "",
        "Scientist": "",
        "Mrs.": "",
        "Godfrey": "",
        "Detective": "-- and you didn't load the gun?  C'mere a minute --  -- he's doesn't live here, but he comes around, raises shit, screaming, yelling, something or other --  <u>Her</u> son?  And Where Are They?  -- they are not to be found.  Ok.  And what is she saying?  <u>Did</u> you kill him?  How long's he <u>been</u> in there?  You're hurting yourself, Marcie.  You hit him with the ashtray, you strangled him --  -- tell us he fell and hit his head, but tell us something, Marcie.  -- Marcie: Where's your son?  Marcie? Marcie?  Marcie tell us where your Son is now. Marcie tell us where your son is.  We want to know where your Son is, Marcie.  Jerome Samuel Hall. Did he have a fight with your husband? Where they fighting?  Maybe they had a fight, maybe it was an accident. Maybe it was an accident?  Help him out, and help us get there before something else --  Help us help your son, Marcie."
    },
    "imdb_rating": "8.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZjk3YThkNDktNjZjMS00MTBiLTllNTAtYzkzMTU0N2QwYjJjXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_QL75_UX380_CR0,19,380,562_.jpg",
    "description": "24 hours in L.A.; it's raining cats and dogs. Two parallel and intercut stories dramatize men about to die: both are estranged from a grown child, both want to make contact, and neither child wants anything to do with dad. Earl Partridge's son is a charismatic misogynist; Jimmy Gator's daughter is a cokehead and waif. A mild and caring nurse intercedes for Earl, reaching the son; a prayerful and upright beat cop meets the daughter, is attracted to her, and leads her toward a new calm. Meanwhile, guilt consumes Earl's young wife, while two whiz kids, one grown and a loser and the other young and pressured, face their situations. The weather, too, is quirky.—<jhailey@hotmail.com>",
    "name": "Magnolia",
    "genres": [
        "Drama"
    ]
}