{
    "filename": "Major-League_script.txt",
    "imdb_id": "tt0097815",
    "imdb_url": "https://www.imdb.com/title/tt0097815",
    "characters": [
        "Lynn Wells",
        "Ricky Vaughn",
        "Pepper Leach",
        "Jake Taylor",
        "Rachel Phelps",
        "Roger Dorn",
        "Willie Mays Hayes",
        "Eddie Harris",
        "Duke Temple",
        "Charlie Donovan",
        "Harry Doyle",
        "Pedro Cerrano",
        "Haywood",
        "Suzanne Dorn",
        "Lou Brown"
    ],
    "dialogues": {
        "Lynn": "Hello.  Jake? How did you know I was here?  How did you know that? I didn't have this dress when we were...  Thanks. What are you doin' here? Aren't you supposed to be in Mexico somewhere?  That's great. I'm happy for you, Jake.    My life is different from when you knew me.  Couldn't we talk about this some other time? I really gotta...  I don't think that's a good idea.  Lawyer. Please, Jake, he's watching us.        Let's talk in my office, okay?  I told you I don't think it's a good idea for us to see each other.  We don't have anything in common. Sometimes I wonder if we ever did.  I stopped bein' an athlete three years ago. Books are my life now.  Don't you dare laugh, Jake. In two years I've put together one of the best special collections departments in the country.  You never read anything I asked you to.  His name is Tom, and keep your voice down.  He's stable. He's intelligent... and I've never found him in bed with a stewardess.  Just like always, you don't take anything seriously. Everything's a joke to you.  Tom and I are getting married in the fall.          (whirling on him and exploding            Yeh, he's gotta be goin'...  He was one of the best in baseball until he had problems with his knees.  (not wanting to pursue it             You follow me here too?  What do you mean?  (getting out of the pool  You looked good, but you oughta open your stance a little. They're pitching you inside.  Sorry, I already ate.  (getting out of the pool              I just wanted to see you play.  You looked good, but you oughta open your stance a little. They're pitchin' you inside.  I think I oughta tell you that I'm moving in with Tom.  I'm not goin' uptown, I just want to lead a regular life. You know, like an adult maybe. With a house and a garden and normal hours.  You like the life you've had, Jake. You like hangin' out with the boys, livin' in hotels, eatin' dinner at midnight, having girls send you their underwear in the mail. Remember the surprise party I threw for you when you made the All-Star team? You never showed up, but the doorbell rang once and we all got quiet and hid behind the furniture. It was a guy to serve you with a paternity suit.  Yes, but you had obviously been with her. And it happened in front of all our friends.  I've come back to you too many times, Jake. I can't afford to believe you anymore.  I guess so. Did you really read \"Moby Dick?\"  October third.  You're still their favorite.  Tom doesn't like big weddings. You coulda read Plot Outlines of 101 Great Novels.  At any library.  All Saints on Euclid.  Yeh. Who saved Ishmael at the end?  Where?  If you want. Maybe you really did read it.  This doesn't change anything, you know. We were always good at this.  What?  Use your imagination.        Excuse me. I was in town for a conference and thought I'd drop by, but I can see you're busy...  Thank you. I didn't think you'd come.  Good luck today, Jake.  No, I came to see you.  Even for last night?  Then you weren't defending my honor again?",
        "Wells": "",
        "Ricky": "",
        "Vaughn": "I'm, ah, not with them anymore...     Yeh, well, I'm not sure I can make it by then.  Yeh. Where's Cleveland?  Vaughn. Rick Vaughn.  California Penal.  I stole a car.  What is that stuff?             This is final cut down day, right?  I don't wanna go in there.        I got news for you, Mr. Brown. You haven't heard the last of me. You think I'm shit now, but someday you'll be sorry you cut me. I'm gonna catch on somewhere else, and every time I pitch against you, I'm gonna stick it up your ass.  What do you mean?  Like what?  What was it? A slider?  What is it? The chick?  You want me to beat the shit out of him?  A librarian? Shit, I gotta start readin' again.  Oh, shit...     God, I was horse shit tonight.  What?  Oh yeh, name one.  Shit...  There aren't any stewardesses.    Ah... yeh... sure. My first autograph. I couldn't give these away a couple weeks ago.    I thought you had to do somethin' good to be a celebrity.     What about Koufax?  You gonna send me to the minors?  These things make me look ridiculous.  What's that for?  Fuckin' Dorn. Game shoulda been over by now. Dorn coulda had that ball. He tanked it on purpose.  Yeh, but I don't know if there'll be much on it. My arm feels like jello.  The last time I did that, the guy hit one that hasn't landed yet.  I was bored.  It's hotter than shit in here. What happened to the air conditioning?     Naw, I'm all right.        That's why we carry the American Express card. No matter how far out of first we are, it keeps us from getting shut out at our favorite hotels and restaurants.  You wanted to see me?  Yeh, sure. Whatever's best for the team.  Yeh, okay.  I don't think I'd be very good company tonight.  Nothin'. Job problem.  I'm, ah, a ball player.  Why did you come over then?     Where you goin'?  I didn't even get your name.  (having heard that name someplace before     I swear to God I didn't know who she was.",
        "Pepper": "Wish we had him two years ago.  Four years ago then.      Look at this fuckin' guy.         Sounded like it.    Don't worry if you're off the plate on a few pitches. Doesn't hurt to put the fear of God in a hitter.  Okay kid. I think we got 'em scared enough now. Time to get a few of 'em out.  Just relax, and keep the arm up on top. Gotta throw strikes. No place at the inn for this guy.    At least he hit what he was aimin' at.  C'mon, kid. As soon as Coleman gets up, he's gonna be lookin' for you.  Lou wants to see you down at the office, Rick.  You want me to go get him?  Not quite yet.     What's he doing?",
        "Leach": "In the land of burning waters, waters Lurks the Injun nine, oh so fine, we Love those mighty Redmen, Turn their foes to dead men, Ummmmm.",
        "Jake": "",
        "Taylor": "Yeh.    Who is this?  Is that you, Tolbert? This isn't very funny, ya know. I'm hung over. My knees are killin' me. If you were gonna pull this shit, you could've at least said you were from the Yankees.    Tolbert? Tolbert? Screw it.  Tolbert.     Hello.  Oh yeh, Charlie, look, I'm sorry about this morning...  Sure.  Oh hell, yeh, I work out every day.     Luis, I'm not gonna be playin' anymore. I got a tryout in the States.  But I changed at the motel.        What happened to the private rooms?    So, you just gonna settle for toilet brush, or you got another name?  Forget about Dorn. He's always a little tough on rookies. You'll get a lot worse from other teams.  Jake Taylor. Rick Vaughn.      Great. Never been better.  No problem.  Around the league they're wrong.  Yeh. Would I bullshit about somethin' like that?  Sorry, Lou, I wasn't quite expectin' that much octane.  Shit, the way I played today, I wouldn't be surprised if they red- tagged me already.  Red tag in your locker means the manager wants to see you, 'cause you just died and went to the minors.  Don't worry, they don't cut anybody the first day.      What are you doin' there, Pedro?  So are mine. Is somethin' goin' around?  Maybe he's the pagan saint of baseball.           Yeh, better get your snake ready, Hayes.  If you're gonna use that head first slide, you better get yourself some gloves or you're not gonna have any skin left on your hands.  Whatever happens, keep it to yourself until you're outta the locker room. Don't celebrate in front of guys who just died.  Forget about Dorn. You got other things to do.  Packing for Cleveland.    What are you gonna have?  French.  Forget it. I'll order. Let's have a toast.  Here's to baseball, here's to the start of two great careers, and for me, here's to at least one more good year in the sun.  That's my wife.  I mean she woulda been if I hadn't screwed it up. Who's that guy she's with?  No.  She's a librarian.  Just a hunch. I took you there when you got your masters. I figure you're probably wearing the black velvet dress with the red sash.  You look great.  I'm playin' with the Indians again. Back in the Bigs.  Wait a minute. What's your number. I tried calling you at home, but you're not listed...  Meaning what? That I don't know you anymore?  Okay, just gimme your number.  Why not? Because of the guy you're with? What is he, a banker?  I'm not leavin' without your number. You still wear those great little tortoise-shell glasses? I always loved it when you took them off.  The number, Lynn...  Thank you. I'm back, Lynn, and I'm gonna be around.  (looking at a piece of paper  Furnished apartment building owned by the Indians. We get special rates. With what we're makin' we'll need it.  Welcome to the Big Leagues.  You got anybody workin' there named Lynn Wells?  Didn't think so.  Take it easy. We got 162 of these to go.  Guy's goin'. Gotta be goin'... get the throw up. Don't bounce the damn ball.  Nice throw, dickhead.  Easy does it, Ricky. We're only four down. We're still in this thing.  I figure you got a 30% chance to survive this at bat.  Couldn't cut it in the Mexican League.  Only thing you got to be sorry about was hittin' Coleman.  If you wanted to send a message, it shoulda been to Haywood. He hit the damn homer. Coleman was just picking his nose in the on-deck circle.  Forget the other stuff. It coulda happened to anybody. Besides, Haywood didn't hit it that good. That ball wouldn't have been out of a lotta parks.    I was wonderin' why you'd give an old friend a bum phone number.  I don't wanna talk in your office.  Why not?  What are you talkin' about? We were both athletes, world class, hot for each other. What more can you have in common?  So what is it? You're still sore I never read Moby Dick?  Not like what's-his-name at the restaurant?  What do ya see in this guy?  That's 'cause no stewardess would have him. Wouldn't you rather be with somebody who's in demand?  C'mon, Lynn, for Christ sake, I'm just tryin' to loosen things up a little. I'm gettin' frostbite here.  What? That's crazy, Lynn. I got plans for us.  I was gonna play another a year or two, then we go to Hawaii, and have a couple kids who grow up to be Olympic champions.  I'm sorry, Lynn, but I wasn't exactly proud of my situation. C'mon, you didn't think about me at all since I been gone?  Remember the three nights we spent on the beach in Vera Cruz? You have nights like that with Mr. Briefcase?  What was I supposed to do? She bet me fifty bucks she had a better body than you. I had to defend your honor.  (addressing the library patrons  How many think Lynn oughta give me another shot?  The ayes have it.  I'm afraid I have or I wouldn't be here. C'mon, Lynn, I don't wanna do time for things that happened years ago.  Lynn, wait...  Maybe the other one's jammed up.  What is this, Lou?  Well, they certainly have spared every expense.    I'm about ready to turn in. I've anesthetized my knees enough.  You're a celebrity now, Vaughn.  Not if you do it colorfully.  Guess we're over with, eh, Dorn?  It's one of the masterpieces of American literature, that's all.  Long time ago.  No, I got some more reading to do.  I might if I knew where she lives.  You mean sit in a car and wait for her to come out? That's kinda juvenile, don't you think?      Look, Lynn, I'm sorry I followed you home but I wanna...  Whose place is it?  Nah, that's o.k., I got some things to do...  I, ah, just had a couple books I wanted to discuss with Lynn. I thought this was her place.  Yeh, I heard you guys were engaged. Congratulations.  Beer'll be fine.  The Indians.  Yeh, we have uniforms and everything. It's really great.  That depends on how good they are, I guess.  I make the League minimum.  Somethin'll come up.  I don't know, I was thinkin' of goin' to Hawaii, and having a couple of kids who grow up to be Olympic champions.  Swimming. Maybe the two hundred meter Individual Medley. I figure it oughta be big by then.  I did, but I wasn't smart enough to hold on to her.  Alternate on the '80 Olympic Team.  Well, I gotta be goin'. Nice to have met you all.  Thanks for the beer.  I'll let you know if I land a good job. I know you're concerned about it.    Drop in the bucket, Vaughn.  Sacrifice? You mean like something living?  Forget the runners, Ricky, get this guy at the plate.  Okay, let's get nasty here, Rick. You know he's lookin' for this pitch. Gotta come up with somethin' studly.  This isn't the California Penal League, Vaughn. We're professionals here. We don't tank a play for personal reasons, so cut the crybaby shit. You've pitched a helluva game. You wanna finish it, don't ya?  Can you give me a strike on this pitch?  Just make sure it's over the plate. I want him to swing.  Don't worry, I'll take care of it.  By the way, I been meaning to ask you. Why'd you steal that car?  Next time you might think about takin' in a movie or somethin'.     Helluva situation we got goin' here, huh, Rexman? Two on, two out, you're down by a run in the ninth. You got a chance to be a hero on national television, so whatever you do, don't blow it. They'll be callin' you a gutless choke artist all over America.  You're a free agent at the end of the year. Not much demand for gutless choke artists. What are you hittin' now? .230? .240?  Hey, nice average. Uh oh, on second thought, that still means you got a seven outta ten chance of goin' in the dumper.  Hey, I can understand not wantin' to talk about baseball when your nuts are in a vice like this.  By the way, I saw your wife at the Capri Lounge last night. Hell of a dancer. You must be very proud.  But that guy she was with... I mean I'm sure he's a close personal friend of yours and all, but tell me...  ...Why was he wearing her panties on his head?  Uh oh, Rexie, I don't think that one's got the distance. Maybe if the wind comes up.  Fine, Suzanne, can I have a quick word with Rodger?  I just wanta tell ya somethin', but I didn't want to do it in front of the whole team.   (bending close to Dorn  I heard the Big Lady upstairs ordered it.  Ah shit, here comes Lou. Gimme a break, Mel. I gotta get outta here.  Right. Good idea.  (struggling as if he wanted to get at Wingo  Yeh.  You still got that great kick. Just like the first time I ever saw you.  Yeh, what did you want to see me about?  You wouldn't have been at the game if you didn't want to see me about something.  How was I?  I'll try that. You wanna have some dinner?  Right. I forgot your life is different now.    Whose place are we at this time?  Yeh. When I saw you at the game, I figured you wanted to see me about something.  How was I?  I'll try that.  Goin' uptown, huh?  You think I can't lead a regular life?  That was a hoax. The girl was just trying to get some publicity.  I was drownin', Lynn. The endorsements were dryin' up, my knees were goin', they were talkin' about sendin' me down. I was just trying to hold on to somethin', prove to myself I was still an All-Star. I don't care about that anymore. I know I don't have much time left in baseball. I'm just a guy trying to put his life back together. Thinkin' about you was the only thing that kept me goin' in Mexico.  I guess this is our last hurrah then.  Cover to cover.  When's the wedding?  Your mom and dad like this guy?  Gonna be a big wedding?  Where?  I mean the wedding.  Nice church.  Nobody. It was Queequeg's coffin. Am I invited?  To the wedding.  Lynn?  The zipper on your skirt is stuck.     Sure, go ahead. I think my reading days are over.  (pointing to his stack of Classics  (throwing the ball back  What's the problem, Rick? You're throwin' basketballs up there. That guy in the dugout botherin' you?  Forget him. Worry about the guys carryin' bats. C'mon, Ricky, let's get nasty.  I don't know about the rest of you, but I've been playin' baseball since I was five years old. I've had some good years and some years to forget. I've burned out my knees... I don't think I have three fingers that work right... I've lost most of the money I made and baseball has messed up my personal life from time to time. But I know one thing... I can still play this game a little. And I'd like to know who in this room thinks they're the kinda bum Mrs. Phelps is lookin' for?  Well, then, I guess there's only one thing to do.  Win the whole fuckin' thing.        We're a Major League baseball team, but since we haven't won a pennant in thirty years, nobody recognizes us, not even in our own hometown.  Look what it's done for us. People still don't recognize us, but... ...we're in the first division now.          We haven't won anything yet. We still got one more to go.  Darla.  (without much enthusiasm     No, I had to sell it.  Not after your knees go bad.  Darla, I don't think I can do this.  I guess I'm just not that guy anymore.     Lynn, wait...     Hello, Suzanne.  Vaughn?  You look beautiful.  I can't stay. We gotta get to the park.  Yeh, you too. Tell me one thing. The night you came up to my hotel -- was there really a library conference?  Too bad it didn't work out better. I just wanna say I'm sorry for all the things I've put you through over the years.  Can't be sorry for that. Nothing happened.  I didn't have to. She knew she was outclassed.  I don't know what Dorn's wife is up to, but I think it'd be best if you dressed early and got out to the bullpen before Dorn comes in.  Tell him not to worry, I'll take care of it.  Nope. Haven't seen him.  It's comin' in now.  One whole chicken, like you said.  Believe me, Jo-Buu will like this. He's gotta be gettin' tired of raw chicken.          C'mon Ricky, this guy is the out you been waitin' your whole life for.    All right, Ricky, let's get nasty.      Nice swing, Haywood. Good follow- through. Keep it up, I'll show you the ball sometime.  Well, shit, all these pitches to choose from. Maybe we'll try somethin' different this time.  And if I don't see you again, Haywood, have a nice winter. Okay, buddy?  Yeh.",
        "Rachel": "Good morning, gentlemen. Welcome to another season of Indians' baseball.  I know that it may not seem the same without Donald here this year, but I promise you by the end of the season this team will have made history.   (reading from the page  Obviously, Donald didn't feel that way or he wouldn't have left the team to me. And I was more than showgirl. I was a dancer. Now, I know some of you have doubts about my ability to run this franchise. God help you if I ever find out about it.  Spring training begins in two weeks. Here's the list of people we'll be inviting to camp this year.  I could sit here and tell you what a great year we're gonna have, but the facts are we lost the two best players we had to free agency. We haven't won a pennant in 30 years. We haven't even finished in the first division for 15. Obviously it's time to make some changes. What do ya think?  Cross him off then.  It's time to shake things up, Charlie. Clear the board and start over.  I know you will, Charlie. That's why I'm movin' you up to General Manager. Congratulations.  Well, that should do it for today. Thank you, gentlemen. Let's get to work.       Come on in, Charlie. Have a seat.  Oh, really? Like what?  I was thinking of Lou Brown.  He's managed the Toledo Mud Hens of the International League for the last 30 years.  I think he'll fit right in with our team concept.  That's what I wanted to talk to you about. I want to put together a team that will help us relocate to Miami.  I'm serious about this, Charlie. It's no secret I've never liked Cleveland much. The weather's lousy, downtown is a pit, the stadium's falling apart, and we can't draw dick. Another couple of years of this and I'm gonna have to start feeding Cha-Cha dog food.  It's hardly a whim. Miami's offered to build us a new stadium -- 62,000 capacity, 45 V.I.P. boxes, and no rent for the first million at the gate. Plus a 12 million dollar media guarantee; 45 percent of the concession gross, all of the parking and they pick up the stadium operations costs. No other franchise in baseball can match that deal.  The lease says we have the right to move if our attendance falls below 800,000 for the year. Paragraph 40, line 17.  If we play bad enough, we should be able to come in under that.  No, we've been losing. What I want us to do is finish dead last.  He knew it had to be done. He just didn't have the courage to do it. Hopefully, you will come to see the wisdom of it. If this team lives up to its potential, we could have the worst record in all baseball.          A quarter of the season's gone, we're 15 and 24, seven games out of first. Our attendance is just below 180,000. That's bad, but not bad enough.  We finished 24 out last year and still drew 890,000. When school's out for the summer, attendance is liable to rise. Plus, this team is showing signs of improvement. I didn't think we'd win 15 games all year. Any ideas?  This is no laughing matter, Donovan. I think maybe the problem is we're coddling these guys too much.  You wanted to see the Bitch?  Don't you think you oughta cover yourself with a towel first, Mr. Brown?  Well, I can take it if you can.  Revenue problems have forced us to cut back on equipment. We'll simply have to fix the old one.  The pipes in this building are old and rusted. We're replacing them, but it's a long, expensive process.  Your players will just have to get a little tougher. What are they, a bunch of pansies?  It's only temporary. Besides, these guys weren't playing that good when the equipment was workin'. If I could get anybody to come and watch this team, none of this would be necessary. You oughta be grateful I can still pay your salaries.     Well, my worst fears have been confirmed. We're 60 and 60, nine games out of first, and only two out of the first division. Who do those guys think they are?  I don't have to accept anything. Our attendance is only beginning to rise. If we can force a losing streak for a week or two, we can still turn this thing around. The fans are used to losers here. At the first sign of a slump they'll give up on this team.  Not everything.        Come in.  Hello, Lou, what can I do for ya?  What do you mean?  Well, I knew I could count on Charlie to tell somebody. I was just afraid he might take too long.  So you'd tell the team, hopefully getting them mad enough to knock themselves out trying to prove they belonged in this league. I think it worked.  We were broke. We couldn't afford anything better. Donald left the team nearly bankrupt. If we'd had another losing season, I would have had to sell the team. I knew we couldn't win with the team we had, so I decided to bring in new players and see how they'd do with the proper motivation. There was never any offer from Miami. I made it all up.  If I'd really wanted you to lose, all I had to do was send the best players back to the minors. But I didn't, did I?  You think this was all an accident? I personally scouted every member of this team, except Hayes, of course. He was a surprise. They all had flaws which concealed their real talent, or I wouldn't have been able to get them. But I knew if anyone could straighten them out, you could. And if you tell them any of this, I will fire you.  I love this team, Lou. Go get 'em tonight.    Shit.",
        "Phelps": "",
        "Roger": "",
        "Dorn": "Hey, what do we have here? Guy looks like a fuckin' toilet brush. Hey, T.B., I love your pony tail. And the earring's cute too. Where's the matching bracelet?         I took one of these in the eye last year. Nearly lost my sight.  What! That's Little League shit.  Lou, I wanna have a word with you here.  (whipping out his contract          Where are we? Kansas City, right? Gotta be Arlene  Don't have to. She knows when I'm in town.      Hi, doll. This is Steve Harris.      What are you talkin' about? He couldn't find the plate if it was magnetized. He won't last the year.    Since when do I have to make a date? Who's been showin' you this town the last three years?     Speak for yourself, Taylor. I got a couple good years left.     Hey, Jake, old boy, what brings you out here?  Sure, go ahead.  Forget it. It's not workin' again.  Naw, I'm not into Song of Hiawatha.  Yeh, that sounds pretty good. That's a detective story, right?  Even me?  What's that?        Hey, Taylor, there's a coupla drop- dead Annies outside. One of 'em says she used to know you pretty good. Brunette, great rack...  Yeh. What doya say we chat 'em up?  C'mon, you're not gonna keep moonin' over that library chick, are you? Forget her, she's gone.        Bye bye, honey, wish me luck.  You know where Vaughn is?  Let me know if you do. I wanna have a little talk with him.     Let's cut through the crap. I only got one thing to say to you. Just rear back and strike this motherfucker out.",
        "Eddie": "",
        "Harris": "C'mon, Hayes, let's do 'em right.  (pointing to them in order  Course if it's cold and I got a shirt on under my jersey, I just rub a little jalapeno inside my nose and get it runnin'. I need to load up the ball a little, I just wipe my nose.  At my age, you put anything you can find on it. I haven't got an arm like yours.  I wouldn't leave this gin sittin' around out here with this group.  Aren't we gonna have a prayer? I mean we're not all savages like Cerrano.  All right, let's bow our heads.  Dear Lord, we ask...  Oh, so now you come around. He's not fooled.  Who you got lined up tonight?  You call her?    Not while I'm here you're not. That's murder.  Here's looking at ya, Jo-Buu.        Hey, there's no hot water in here.  What if we don't finish last?",
        "Duke": "",
        "Temple": "We're on an austerity program. This is what happens when you finish 24 games out.      Maybe he's the mascot.  (referring to some stats  (to the batting practice pitcher  Memo says we'll only be usin' this for short trips.",
        "Charlie": "",
        "Donovan": "She didn't last week. She was having a guava facial.  Most of these guys never had a prime.  Well, it's not the best material I've ever had to work with, but I'll do my best to see we move up a notch this year.     I'm glad you called me in. I'm still unclear on a couple things  Well, if I'm the G.M., who's gonna be the Manager?  Lou Brown?  What exactly is our team concept?  What do you mean? Some of these guys are furniture movers?  Mrs. Phelps, you can't just up and move a team on a whim...  Even so, the League'll never let us leave Cleveland. We got a lease with the city.  What are you saying? You want us to lose?  Mister Phelps would never have approved of this.  Hello, Jake? This is Charlie Donovan, new G.M. of the Cleveland Indians.  I wanted to call and say the organization remembers you fondly from the years you played here and we'd love to have you come to spring training for a shot at this year's club.  What?  Lou? This is Charlie Donovan, the new G.M. of the Cleveland Indians. Listen, Lou, I hope you're sittin' down 'cause I got an offer you probably been dreamin' about your whole life. We been watchin' your progress down there at Toledo with a lotta interest and well... How would you like to manage the Indians this year?       Rick, we heard about your pitching out at Portland last year...  We'd still like to take a look at ya at our spring camp in Arizona, March first.  Don't worry, we're gettin' you out on a sort of work furlough deal. Any questions?     Look, Lou, you been in baseball thirty years. Don't you wanna advance some?  Well, what are you really worried about? The money?  I don't think that's gonna be a problem.  We don't have any millionaires.  Don't have any bonus babies either.    What?    Jake, Charlie Donovan again.  No problem. Look, Jake, camp starts on the first. Can you make it?  You been stayin' in shape down there?  I thought so. See ya in Arizona.  This looks like Jake Taylor.  Yeh.  We did.      I think it's Cerrano. Defected from Cuba. Wanted religious freedom.  Voodoo.    Yeh, he just can't field it.  Don't recognize this guy.  I don't remember a Hayes on the list.  Projected over the whole season, we stand to wind up 36 games under .500 and 28 out of first. That should be bad enough for anybody.  On how we can get worse? How about a series of fines for good play? Maybe a $30,000 bonus to the guy chosen Least Valuable Player.  Maybe you just have to accept the fact that they're not as bad as you'd hoped.  What's left to do? You've taken away everything you can.  Mind if I join you?  Just wanted to get out on the road. You damn near pulled one out today.  Ya know, you've done a helluva job this year.  With this club it is.  You really believe that, don't you?  Rachel Phelps would never allow that.  She doesn't want you in the first division. She doesn't even want you in Cleveland.",
        "Harry": "",
        "Doyle": "(pouring some Jack Daniels in his Coke  Yes, sir, they love this club here in Cleveland.  High fly ball, centerfield. Hayes under it now... Oh, makes a basket catch, Willie Mays style, and the side is retired.    Bottom of the first, Willie Mays Hayes to lead it off for the tribe.  A lotta people say you can tell how a season's gonna go by the first hitter of the year. In the last fifteen years, the Indians have never had the season lead-off hitter reach base.  Hot shot toward the hole. Rudia knocks it down, gets up, fires to first. Too late! Hayes beats it!  And so the string is broken. Maybe things will turn around a little for the Indians this year.  And now Hayes is putting on a pair of black gloves, sending a little message to the Yankees.  Brewster, quick move to first...  He got him. Hayes is picked off.  Well, so much for that.     Top of the sixth. Rookie sensation, Ricky Vaughn, on to pitch now. You can close the book on Winters...  First pitch is a little high...  Ball four.  Ball eight.  Low, and Vaughn has walked the bases loaded on twelve straight pitches. By the laws of probability, you'd think one of those coulda drifted over the plate.     So, a tough start for the Erie warriors, as they drop a heartbreaker to the Yankees, nine to nothing. The Post Game Show was brought to you by... Christ. I can't find it. The hell with it. This is Harry Doyle saying good night, everybody, and Happy Hunting.  Two down, top of the ninth. Last chance for the red and blue.  Bouncing ball to second. This should be it. Collins up with it, on to first, and the game is over.     So, the Sons of Geronimo, still suffering a bit from propeller lag, are nipped by the Tigers tonight, 7 to 0. The only excitement for the tribe provided by Rick Vaughn who set an American League record by throwing four wild pitches in one inning. Congratulations, Rick. For the Tigers, 5 runs, 9 hits, and no errors. For the Indians, one run, and let's see, one hit. Is that all we got, one fucking hit?  Don't worry about it. Nobody's listening anyway.  We're in the ninth, two down, man on first and the Indians clinging to a one run lead. VAUGHAN, one out away from his first major league victory...  Bouncing ball, Dorn can't get to it, into left field, base hit. Clarke digging around second, he'll make it to third, and the A's have runners at the corners.  Vaughn in a little trouble here, but I'll tell ya, these Cleveland fans are great. Listen to them get behind Vaughn.  Runner goes, high, Taylor has no play. The go-ahead and potential winning run is in scoring position.  High ball two, and the crowd doesn't like that call one bit.  So, Ricky Vaughn, roughed up in his only other appearance against the Yankees, will see what he can do with the Bronx Bombers this time. Vaughn, after a slow start, has come on lately and now leads the American League in strikeouts with 221.  So, Vaughn pitches in some tough luck here as the Yankees put together as few squib hits and take a 6-0 lead.     Well, the Indians made a gallant comeback today, but fell one run short as the Yankees held on for a 6- 5 victory, although they didn't do squat after the first inning. Anyway, if the bus makes it here from the hotel we'll be on at 7:30 tomorrow night. Till then, this is Harry Doyle, saying so long, everybody, and Happy Hunting.     Won't need it tonight.  Hello, everybody, Harry Doyle bidding you a Wahoo welcome from beautiful Municipal Stadium, where tonight before a capacity crowd of 75,000 screaming featherheads, the braves of the Cuyahoga will leave their teepees in search of Cleveland's first League Championship in over 30 years. Standing in the way, their long time nemesis, the New York Yankees, the Big Boys of Broadway, who have beaten the Indians like a tom-tom all year long.     Still nothing -- nothing, top of the seventh, two down. Harris has been in trouble all night, but has battled his way out with the help of some great defensive plays.  Uh oh, this one's tagged. Deep center field. Way back. Way back.  It's off the reservation, home run. And the Yankees lead it 2-0.  Dorn up now, two down, bottom of the seventh. The Indians running out of chances.  That'll bring on Cerrano, hitless tonight. As a matter of fact, he hasn't touched the ball yet.    Long drive, deep centerfield. Way back. It might be. It could be. The ball is... Downtown, welcome to the Happy Hunting Ground. The game is tied.    Two down in the top of the ninth, still tied at 2, Harris working on an eight-hitter.  Activity continues in the pen, as Harris is really digging himself a hole now. He got the first two hitters, and then gave up a single and a double and has now gone 3-0 to Cheevers.  High, ball four and they're loaded for Haywood, the biggest Indian killer of them all.    O.K. Vaughn has finished his warmup and we're ready to...  Haywood steps in, the American League triple crown winner. .341 average, 48 homers, 121 R.B.I.'s. He's homered the only two times he's faced Vaughn.  Oh, Lordy, three straight heaters and the Yankees are blown down. No runs, two hits, three left on, and, are you ready, Cleveland? We go to the bottom of the ninth, still tied at two.    Two down in the ninth, Hayes steps in hitting .291, trying to get something going for the Tribe.  And Horton is wasting no time. He's goin' to the Duke.  Duke leads the league in saves, strikeouts per inning and nose hairs.  What's this? Taylor is pointing to the bleachers, calling his shot.    Hayes is gonna try to score! Here comes the throw. He slides. He is...  ...Safe. The Indians win it. The Indians win. Oh my God, the Indians win it!!",
        "Pedro": "",
        "Cerrano": "Bats. They are sick.  No hit curve ball. Straight ball, hit it very much. Curve ball, bats are afraid. I ask Jo-Buu to come. Take fear from bats.  I offer him cigars and gin. He will come.          Have to wake up bats.  Gin and cigarettes not enough for Jo- Buu. I still can no hit curva ball for sheet. I hafta make a sacrifice to him.  Si. I kill unborn children.     So if you're looking for some big league clout, apply for the little green home run hitter.     Where's my chicken?  But it no alive.        I pissed off now, Jo-Buu. I good to you, I stand up for you. If you no help me now, I say fuck you, Jo-Buu. I do it myself.",
        "Haywood": "Hey, Taylor, what you doin' back up here?",
        "Suzanne": "Oh hi, Jake, how are you?  Sure, c'mon in, he's in the den. I'll get some coffee.  Coffee anybody?  Why not?  I know, but that's not why I came over. I don't chase ball players.  Because you're the sexiest man I've ever laid eyes on, and you look like you could use a... friend.  I've gotta get home.  Suzanne. Suzanne Dorn  Mrs. Suzanne Dorn. So long. You're a great kid.    Before you go, there's something I wanta tell you.",
        "Lou": "",
        "Brown": "I don't know...  Lemme think it over, will ya, Charlie. I got a guy on the other line about some whitewalls. I'll talk to ya later.    Naw, I'm just not sure I'd be happy in a big organization like that. Owners are always on your back, tryin' to \"help you out.\"  Down here baseball's a game, not a business. I don't wanta be a babysitter for a buncha millionaires who think they know it all already.  Well then, bonus babies or whatever you got...  Don't you have any proven major league talent?  Well, then... I'll be up in a couple days.  Sounds like my kinda team. Have my contracts ready.  He was an Allstar in Boston, wasn't he?      Who's that?  What's his religion?  Thought you didn't have any high- priced talent.  Still hits the ball pretty well, doesn't he?  We'll shape him up.  Lou Brown. Nice to meet ya, Hayes.  Welcome to Spring Training, gentlemen. Most managers tell you at this time that all the jobs are open, that nobody's a lock at any position, and that talent isn't everything. They'd rather see desire and discipline in a player. Then they tell you that most of all they want you to have fun out there, even though they're gonna work your ass off on fundamentals and condition you till you drop. The difference between me and those other managers is... I mean it.  Get him a uniform.  How the knees holdin' up, Jake?  Mobility's good? No problem gettin' off the throw to second?  I need a catcher, Jake. Somebody who can keep this team together on the field. You were a helluva player when you were sound, but around the league they think you can't take the pounding anymore.  I'm gonna have to put you to the test, ya know. So, I want the absolute truth here. Are you 100 percent?    C'mon, Hayes, this isn't the All Star Game. Get up to the damn plate.  Well, you may run like Mays, but you hit like shit.  I think Mr. Hayes shows some promise. His speed could be a big asset.  You gotta stop swingin' for the fences though, Hayes. All you're gonna do is give yourself a hernia. With your speed you should be hittin' the ball on the ground, leggin' 'em out. Every time I see you hit one in the air, you owe me twenty pushups.  Sometimes you can teach a guy to hit. You can't teach him to run.     All right, Vaughn, they tell us you're a pitcher. Let's see what you got.  Nice velocity.  How much?    C'mon, Dorn, get in front of the damn ball. Don't give me this ole' bullshit.  I'm deeply moved. Every time you play it off your hip, you give me forty sit-ups.  So is this.  Jesus, this guy hits a ton. How come nobody else picked up on him?  Oh.  Sure.           Good, I like that kinda spirit in a player. The only problem is, I didn't cut you.  I think somebody's been havin' fun with you.  Can I have your attention, please? I counted up your ballots for team captain and I think you chose the right guy. If you hadn't, I woulda told you he won anyway. Mr. C for the year -- Jake Taylor.  All right, let's gather 'round.  I'm not much for inspirational addresses. I just wanta point out that every newspaper in the country has picked us to finish last. The local press thinks we'd save everybody a lot of time and trouble if we just went out and shot ourselves. Me, I like to waste sportswriters' time so I'm for hangin' around and seein' if we can give all these guys a nice big shitburger to eat.  You guys go ahead. I belong to the church of three-run homers.  All right, way to look, way to look. Nice catch, Hayes. Don't ever fuckin' do it again. Okay, let's get it goin'!  No, let's see how he reacts.  Interesting.  I think you can go get him now.  Front office says it's an economy measure, 'cause we're not drawin' good.     C'mon in, Rick.  Rick, I'm not gonna beat around the bush here. You got a great arm, one of the best I've ever seen, but your control hasn't come around like we hoped it would.  Now, there are a lotta pitchers that started out wild and, after workin' it out in the minors, for a while, went on to great careers. Take Sandy Koufax there...  Never mind Koufax.  Read these letters, starting at the top.  Can't read it, can you?  Nope.  All right, let's hit the field.  No, he's come this far. Let's see if he can finish it.  It's startin' to come together, Pepper. It's startin' to come together.    Damn it, I thought they were gonna replace this thing.  She's at it again. I've had it with this nickel and dime stuff. I'm gonna get the Bitch on the phone.  Yeh.  There aren't any towels, and I'm too old to be diving under benches.  What happened to the new whirlpool we were supposed to get?  You fixed it six times already. And now there's no hot water in the showers.  How am I supposed to keep my players healthy with cold water and no therapy equipment?  Over 162 games even tough guys get sprains, sore arms, muscle pulls...      You mean the one that was a foot outside?  Good thing we don't play anybody in Europe.  I don't know if we can survive any more of these economy measures.  I thought now that Vaughn had some control, he was ready for the Yankees.    Someday we'll figure out how to beat those guys.  Sixty and sixty-one is hardly a helluva job.  Ya know, when I first got to camp I figured this team had no chance. I was just hopin' we'd win enough that I could stay on and really start to build something here. But there's a lotta talent on this club, Charlie. The veterans are starting to play back to form and the rookies are developing faster than I thought. There's two or three potential all- stars in there. I think we're a first division team right now.  I know it. All we need is something to bring it all together.  What do you mean?    She put this team together because she thought we'd be bad enough to finish dead last, knockin' attendance down to the point where she could move the team to Miami. And get rid of all of us for better personnel.  Even you, Dorn.  That's about it.  She'll replace you with somebody who will. After this season, you'll all be sent back to the minors or given your outright release. So, all we're gonna get is this one year.     I figure it's gonna take 32 more victories to win this thing. Every time we win, we peel a square.  Yeh, Rick. I just wanted to tell you that I'm startin' Harris tomorrow against the Yankees, even though it's your turn in the rotation.  He's got more experience and a little better record against the Yankees.  Don't read anything into it, Rick. You're one of the guys that got us here.  I wanted to hand in my resignation before you had a chance to fire me.  I know what you been tryin' to do with this team. After the season, I want no part of it.  Why would you want him to tell somebody?  You tryin' to make me believe you wanted us to win all along?  Bullshit. What about the plane, the bus, the bad hotels...  Why should I believe any of this? Now that we're winnin' it's easy for you to jump on the bandwagon.  All right, guys, let's take it to 'em.  Damn, havin' trouble with the curve ball again.  (taking the ball from Harris  Give me Vaughn.  I know he hasn't done real well against this guy, but I got a hunch he's due.  Okay, Ricky, Haywood likes the hard stuff in. Curve him on the hands, bust him away, and don't get up with anything. You listenin' to me Rick?  (Patting him on the butt  Forget the curveball. Go with the heater.  Ya know I'd be an ass not to pinch- hit for you here. You're 0 for 18 against Duke. Plus you're beat to shit you can hardly walk, there's no way you can get around on this guy's fast ball. So I want the absolute truth here. Can you beat this guy?  Okay.    Flashing some signals. That's a hell of an idea."
    },
    "imdb_rating": "7.2",
    "description": "Rachel Phelps is the new owner of the Cleveland Indians baseball team. However, her plans for the team are rather nefarious. She wants to move the team to Miami for the warmer climate and a new stadium. To justify the move, the team has to lose, and lose badly. So she assembles the worst possible team she can. Among these are a past-his-prime catcher with bad knees, a shrewd but past-his-prime pitcher, a young tearaway pitcher (and felon) with a 100 mph fastball but absolutely no control, a third baseman who is too wealthy and precious to dive, a voodoo-loving slugger who can't hit a curve ball and an energetic-but-naive lead off hitter and base-stealer who can't keep the ball on the ground. Against the odds, and after the inevitable initial failures, they iron out some of their faults and start to win, much to Ms Phelps' consternation.—grantss",
    "name": "Major League",
    "genres": [
        "Comedy",
        "Sport"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMGUxZGQwNzMtMjNkMi00MGQ5LTk4NjktZmRlZDExNzNhMTI1XkEyXkFqcGdeQXVyMjI0NTA4NzA@._V1_QL75_UY281_CR6,0,190,281_.jpg"
}