{
    "filename": "Malcolm-X_script.txt",
    "imdb_id": "tt0104797",
    "imdb_url": "https://www.imdb.com/title/tt0104797",
    "characters": [
        "Sidney",
        "Sammy",
        "Benjamin 2X (as Jean LaMarre)",
        "Brother Earl",
        "Louise Little",
        "Baines",
        "Shorty",
        "Sophia",
        "Earl Little",
        "Elijah Muhammad",
        "Dr. Betty Shabazz",
        "West Indian Archie",
        "Laura",
        "Malcolm X",
        "Pete"
    ],
    "dialogues": {
        "Sidney": "500.  Brother Malcolm, I want you to meet Brother Earl. He just joined the Nation. Earl moves toward Malcolm and extends his hands. Malcolm shakes it warmly.      They are alarmed at Brother Minister's behavior.   Brother Malcolm. Betty sees him first.  Brother Johnson was attacked by the cops.  Brother Minister, we need to strike back.     You will be good.  Please make way, please-- ANGLE. A WELL-KNOWN PERSONALITY  is at the door. He and Malcolm know each other well. Malcolm extends a palm, but Gregory doesn't slap it.  Another one?   All day since you and Betty left. Brother Minister, I have to level with you. They gave me a mission. But I couldn't do it. I love y'all.   To wire your car so it would explode when you turned the ignition. The Ministers say you are spreading untruths about the Messenger. The Ministers say you are a great hypocrite, Judas, Benedict Arnold. The Ministers say your tongue should be cut out and delivered to the Messenger's doorstep.  I'm with you, Brother Minister.  Let me die then.  You're my father.",
        "Sammy": "Man live by his rep.  Only where'd you get them goddam vines.  You putting a hurtin' on my vision. Sammy covers his eyes. Malcolm plays off the insults.  Be right there. Archie goes.   Twenty-two years he didn't never forget no number.  He gonna, check the collector he turn into. His rep is on the line, boy, and so's yours. If you lying, one of you is dead.  Don't push it. You way ahead. You back on top. That boy loves you, man.  He gave it to you, Archie. He did.",
        "Brother": "They are alarmed at Brother Minister's behavior.   Put fear into those devils.  I'm tired of praying.  Tell it.  We called your house, operator said you had requested that your phone be turned off.  Let's get out of this cold. Brothers Earl and Benjamin take off their coats and put it over Malcolm and lead him to a police car.  Malcolm, where are you? We've been calling all over the city. INTERCUT between Malcolm and Brother Earl.  Let some of us come down there.  I wish you'd listen to us. What about the meeting tomorrow? We need to frisk people.    No sign of the minister yet.  He'll be here like clockwork.  Reverend Chickenwing called last night and said he wouldn't be able to attend.  I called Sister Betty, she didn't tell you?  I assumed...  Brother Minister, what is wrong?  Let's cancel.  Down front as always.",
        "Earl": "He looks directly into the camera, wearing a Baptist Minister's robe.           Earl Little's face is in the same exact position as Malcolm's from the previous scene. His mouth opens in terror as the moving trolley comes closer and closer to the black man lying on the tracks.   Earl is sitting up in bed, he wakes his sleeping wife Louise, next to her is a baby in a crib, another child. Malcolm sleeps between Earl and her.  Somebody out there. Wake the children.  Earl starts to put on his overalls and reaches for his gun which sits on a nearby chair when an explosion of flames greets the house.  Everybody out. OUT! OUT! Get the kids.       This here is 'pose to be a free country.    I ain't a boy. I'm a man, and a real man don't hide behind no bedsheets. Earl takes his pistol out from behind his back and fires above their heads.  Take these here bullets for dem sheets.    Just wanted to scare 'em, they won't be bothering us no more.  They won't be here no time soon. I'm a MAN!    He has been beaten to a bloody pulp.   He opens his one good eye.   I'm a willing servant for Allah.   They are alarmed at Brother Minister's behavior.   Put fear into those devils.  I'm tired of praying.     Allah Akbar.  Everybody out. OUT! OUT! Get the kids.  We called your house, operator said you had requested that your phone be turned off.  Let's get out of this cold. Brothers Earl and Benjamin take off their coats and put it over Malcolm and lead him to a police car.  Malcolm, where are you? We've been calling all over the city. INTERCUT between Malcolm and Brother Earl.  Let some of us come down there.  I wish you'd listen to us. What about the meeting tomorrow? We need to frisk people.    He'll be here like clockwork.  Reverend Chickenwing called last night and said he wouldn't be able to attend.  I called Sister Betty, she didn't tell you?  I assumed...    Brother Minister, what is wrong?  Let's cancel.  Down front as always.",
        "Louise": "She is a pretty, mature woman and white-looking.     What you mean took his own life?!  Do you pay or don't you?  Did you hear me say come in? WIDEN TO SHOW Louise with a WHITE SOCIAL WORKER, MISS DUNNE complete with pad, pencil and goodwill. Huddled out of sight, but nonetheless visible, are five small BLACK CHILDREN.  As you nice enough to ask, we'll git you one.  One of the children brings over a chair. Miss Dunne sets out her papers.  Murder.  These  are  my  children. Mine. And they ain't no question. None.  Get out.  Did you hear me?!  If you don't move out through that door, you're going to be past all regretting. The terror-stricken children huddle together. FREEZE FRAME. It becomes a still.   As she rocks.  I said it just as plain, I said, don't let them feed that boy no pig, because he got enough of the devil in him already. I told her she ain't got no reason talk to me that way cuz' my hair blow in the wind. You want my skin. All right, I'll give it to you. I'll scrape it off. See how you like it. ANGLE - Louise starts to sing a Negro spiritual.     Earl, I know you a better shot than that. You shoulda killed 'em all, shot 'em dead.",
        "Little": "He looks directly into the camera, wearing a Baptist Minister's robe.        She is a pretty, mature woman and white-looking.   Earl Little's face is in the same exact position as Malcolm's from the previous scene. His mouth opens in terror as the moving trolley comes closer and closer to the black man lying on the tracks.",
        "Baines": "",
        "Shorty": "Where's Homeboy?  He is all ready; one of his hands is filled with a huge glob of Vaseline. His manner is indignant as if he were asking the whereabouts of an exasperating child.  I know what I'm doing. Shorty applies the Vaseline to that area.  Now he brings over the steaming jar and places it nearby.   Listen. You pull my coat if it's still stinging   Don't fight me, man. Let me git it out. Malcolm is a little relieved, he tentatively opens his eyes, then he feels the congolene again and there is another outburst. Shorty forces his head under the spray, spurts the water all over his head, wetting Malcolm and the shop in the process.  Well, Homeboy, you almost there. Turn around. Shorty is supervising as Malcolm tries on a zoot suit. He slips into the jacket... Shoes-off, Malcolm steps into the tight-fltting peg-legged pants ...... outfitted, he leans forward toward his new image in the full-length mirror, twirling a long, dangling key chain.  Well, all right, then.   dancing is frantic, the clothes are OUT, and the crowd is predominately And Malcolm is a little bug-eyed as he nudges Shorty, watching mixed            Hey, man, gimme some skin.  That's a fine chick.  Except she live on the hill and got a grandma.    Eat lead, coppers.  Bang, bang. You're dead.  I forgot to tell you I'm wearing a bulletproof vest.  I'm tired of always playing the cops. I wanna be Bogart sometimes.  I'm not too short to be Cagney. Shorty shoots Malcolm from behind.  Pow. Take that. Malcolm acts as if he's been hit.  He use to be a big shot.  Man, I'm glad we got you out of there. With West Indian Archie on your ass, your name on the wire -- Boston the best goddam place in the world for you -- things are too hot and it's not even summer. Malcolm has withdrawn within himself. He takes out a packet of cocaine and sniffs it.  Yeah. Cool it and lay dead for a while, Homeboy. And don't worry none. The drug takes hold. Malcolm is out of it.  I'll stake you, baby. I got my band. I'm blowing great sax. Hell, you ain't even heard us-- He and Sophia keep talking it up, trying to bolster Malcolm.   You got to eat somethin', Red.  I ain't doing bad.  Jesus, Red, she's just a kid.  Yeah, Rudy.   Rudy does catering. Rich joints on Beacon Hill.  Tell him about Baldy.  Christ, Red, no--   You the man! Nodding accord from Rudy and Shorty. Sophia can hardly stand.  What did you do, Homey, palm it?  Jesus Christ, Homey, you are nuts.  Malcolm starts laughing: a silent, hysterical laugh.   Look like Homey got himself a brand new hype.  I got to hand it to you, Homey. That's the best preacher hype I ever did hear.  Come on, baby. I don't pay that shit no mind.  Baby, I love you. Take it easy, greasy. How about a snort?  You is something, Homeboy. My trouble is -- I ain't had enough stuff yet, I ain't et all the ribs I want and I sure ain't had enough white tail yet.  Well, Sammy's dead. Yeah, fell over in the bed with a chick twenty years younger than him. Had twenty-five grand in his pocket. 133A INSERT FLASH - Sammy, he's dead on top of TEENAGE WHORE who is screaming, trying to push that dead weight off her.  Hooked on horse. Been in and out of Lexington Ave times.  I ain't seen Archie, but the vine tells it he's living somewhere's in the Bronx. If you can call it living.",
        "Sophia": "Clapping enthusiastically -- in open admiration.   Why don't you take your little girl home, Red, and come on back? He stops in his tracks. He can't believe it.  Just walk. Don't run. It'll be here when you get back.  He can only grin.        Malcolm, look at them. Have you ever seen white breasts like these?  Put your black hands on them. He is paralyzed.   Please do as I say. Malcolm mumbles something. He then kisses Sophia as if his black life depended on it and he commences to kill it.  Hey, baby.  Am I the first white woman you've been with?  She already knows the answer. He laughs.  ...That isn't a whore?  Knowing she's right, Sophia becomes the aggressor.  A beat -- both panting -- then Malcolm stops abruptly. He raises his hand to his face, then to Sophia's hand which is still caressing him.  That's alright. Baby, take your time. Sophia's not going anywhere. I told you to walk, don't run.   She shrugs, then moves to embrace him.  Who wants to talk?  The couple starts at it again.      You like 'em scrambled soft or hard, sweetie?  Sweetie, they're almost ready.  You the man.   You evil this morning.    As Sophia bends to do so.  Me?  Lemme feed you, sweetie, while they hot.  Malcolm lays back on the pillow and she holds out the eggs to him.  Malcolm, you're so funny. She continues to laugh.   Baby, I was gonna give it to you.  August 2nd. I think. Yeah. She laughs at her achievement.  You had the number.  We'll take it easy. I got a place fixed up on Harvard Square. How's that sound?  You want eggs, baby?  Red, for God's sake--  He pulls the trigger a second time. Click. Now he twirls it again.  We're doing a survey for the Athenaeum Society -- We wondered if you'd permit us to include your collection in the catalog of Great New England Antiques--?  May we see it?",
        "Elijah": "I have come to give you something which can never be taken from you: I bring you a sense of your own worth, the worth of one human being. The knowledge of self. The room becomes transformed. It is suddenly suffused with light. And standing in the cell with Malcolm is ELIJAH MUHAMMAD. He has materialized, but he can be seen through. He is MALCOLM'S  I tell you that the most dangerous creation of any society in the world is the man with nothing to lose. You do not need ten such men to change the world. One will do. The Earth belongs to us, the Black man and whatever is around it, and on it and in it. Praises are due to him forever for bringing to us again, our self and our property, the UNIVERSE OF SUN,   stands reading Malcolm's letter.   Wa-Alaikum Salaam.        My son, you've been a thief, drug dealer and a pimp and the world is still full of temptation. When God bragged how faithful Job was, the devil argued that only God's protective hedge around him kept him pure, the devil said remove the hedge and he will curse his maker. Malcolm, your hedge has been removed and I believe you will remain faithful.     Women are deceitful. They are untrustworthy flesh. I've seen too many men ruined or tied down or messed up by women.     No. We are not Catholic priests. We do not practice celibacy. If a woman is the right height for a man, the right complexion, if her age is half the man's plus seven, if she understands that man's essential nature is strong and woman's weak, if she loves children, can cook, sew and stay out of trouble--      If I surprise you, let me explain. Menial work teaches us humility.  No, each of us must relearn that work is the only worthwhile thing. Allah has given you a great gift. Use it wisely, never forgetting that we are nothing, while He is all.  Tonight I shall introduce you as my National Representative. It will be a difficult task. Your assignment is to build temples all over this nation. More work than you have ever done in your life and you will be in the public eye. My son, beware of those cameras, they are just as bad as a narcotic.  ANGLE - AIDES and OTHERS come into the room now. They are listening.   Yes, the white devil will watch your every step. Even your own Brothers will become jealous, and hostile, go slowly. So I offer you a parable -- regarding your work. Elijah picks up a glass and sets it before Malcolm.  Here is a glass, dirty and its water foul. If you offer it to the people and they have no choice, they must drink out of it. But if you present them with this glass-- He is holding a clean glass, with clear water in it.  --and let them make their decision, they will choose the pure vessel. Islam is the only religion which addresses the needs and problems of the so-called Negro, especially in the ghettos -- Islam is the only way out from drugs, crime, unemployment, prostitution, alcohol, gambling, fornication and adultery. Elijah holds up the clear glass.       He is enjoying this display by his prize student, the CAMERA PANS to a CLOSE SHOT of BEMBRY and the same cannot be said.   Bembry turns off the TV set and he commences to plant the seeds of \"betrayal.\"    Go and tell the brothers what Brother Minister is doing, has done, has been of great benefit to the Nation.   On his desk is the black headlines: MALCOLM X CALLS ASSASSINATION \"CHICKENS COMING HOME TO ROOST.\" Elijah's health is getting worse, his coughing is frequent.  Did you see the papers today?  That was a very bad statement. The country loved this man, and you have made it hard in general for Muslims.    We must dissociate ourselves from your terrible blunder. I'll have to silence you for the next ninety days. You are not allowed to make any statements to the press nor are you to speak at any temples.",
        "Muhammad": "He is enjoying this display by his prize student, the CAMERA PANS to a CLOSE SHOT of BEMBRY and the same cannot be said.",
        "Laura": "She is a fine chick, cool and beautiful. She smiles as she sees Malcolm approaching.  TWO-SHOT. Laura and Malcolm stand together, delighted to be with one another, starting to move to the music, as they watch the dancers.  'Lo. I've got to freshen up.   The porch of a respectable house. Malcolm with Laura; he anxious to get away.  I ain't stupid.  I know where you're going.  What for? I ain't white and I don't put out.  The front door opens, it's Laura's grandmother, MRS. JOHNSON.  Malcolm, you can be anything you want. You got class and you're smart.  I do know I love you.  Laura stops him and moves to him. Her kiss is a tender one, exploratory. Then Malcolm responds, embracing her fully. Her arms go around him as they both drop into the sand.     Oh, Malcolm, I love you. Please, there's no one around. Now? Malcolm turns his head from her, he gets up.  Why? Is it because of your white gal? Folks say you're running around town with her.  She raised me, my mother died when I was six. Is your mother alive?    It's not the end of the world, Malcolm.      Daniel motions to her pocketbook and she takes out a five-dollar bill. He grabs it, and bolts for the door.    Walking toward the door, looking for Daniel. She leaves the bar.",
        "Malcolm": "Malcolm gulps, his eyes on the fuming mason jar.  Shorty starts massaging a great quantity of Vaseline into Malcolm's scalp, covering his neck and ears as well. All the men have gathered kind of execution.    I thought you said it was gonna sting... this ain't nothin'. For a moment nothing happens, then the heat hits him. He yells, tries to catch his breath: his head is on fire.  You motherfucker.  You're killing me. I'm burning up. My damn head is on fire.  He nearly leaps out of the chair, but the barber restrains him.  Shorty, utterly unmoved by the outburst, continues working the congolene into his hair.  Malcolm breaks out of the chair wildly. But the three men drag him to a basin where Shorty has attached the shower spray. His cries filling the room, Malcolm is ducked under the spray. Shorty starts rinsing out his hair.  Well, all reet, then. The transformation is complete. The two laugh and slap hands.      When my mother was pregnant with me, she told me later, a party of Klansmen on horseback surrounded our house in Omaha.  10A ANGLE. KLAN on horses in front of house.  They brandished guns and shouted for my father to come out. My mother went to the door where they could see her pregnant condition...  ANGLE. A pregnant Louise Little on porch.  ...and told them my father was in Milwaukee, preaching.  ANGLE. The Klan breaks all the windows in the house then rides off into the glorious D.W. Griffith _Birth of a Nation_ moonlit night.   The hooded Klansman said the good, white Christians would not stand for his troublemaking, and to get out of town. ANGLE. The terrified Little children look out a broken window at their mother.  They broke every window with their rifle butts before riding off into the night, their torches flaming.   My father was not a frightened Negro as most   ...and had a glass eye. He believed, as did Marcus Garvey, that freedom, independence and self-respect could never be achieved by the Negro in America . . .  ...that, therefore, black men should leave America and return to the land of their origin. 10D ANGLE. Earl Little, in a wagon with little Malcolm.  My father dedicated his life to his beliefs because he had seen four of his six brothers die violently... 10E WIDER ANGLE. WE SEE Earl in front of a podium in church. He is preaching.  ...three killed by white men and one lynched. There are nine children in our family. ANGLE. The nine Little children.   My mother was an attractive woman, an educated woman, a strong woman.  She was very light, her mama was raped by a white man. One of the reasons she married my father was because he was so black, she disliked her complexion and wanted her children to have some color.   dancing is frantic, the clothes are OUT, and the crowd is predominately And Malcolm is a little bug-eyed as he nudges Shorty, watching mixed    He is looking for his partner, the girl he brought and now he sees her. He makes his way through the watching audience.   Come on, baby, let's show 'em how. Laura smiles shyly; she's willing.  You better get out of them shoes, girl. Laura laughs, goes quickly to a bench and changes into a pair of sneakers.  Shorty, this is Laura. Laura is flushed and out of breath and joyous.  Now you come back. Laura laughs as she goes. She surely will be back.  Fine as May wine.  Make it too easy and it ain't no fun. Then his vision catches Sophia, who is approaching him. She makes a simple, direct gesture, \"Want to dance?\" Malcolm eyes Shorty and wordlessly glides into Sophia's arms.   Trying to play it cool -- but he is beginning to pant. Not from the dancing, but from the situation: a gorgeous white chick asking for  I better not come in.  I mean it's late, baby.  I'm going to bed. I gotta work tomorrow, need my rest. Laura walks to the door.  Baby, I'll call you tomorrow.  'Night, Mrs. Johnson. He runs down the porch steps.     Sheeet, you ain't. I had aplenty.  Shhhh! I don't like women that talk.    Don't you know, you can't hump the Bogart.  Naw, you missed me, copper. Try this on for size.  Malcolm fires an imaginary tommy machine gun at Shorty.  The hell you are.  You're too small to be Bogart.  Ahhh! You got me, you dirty, filthy, rotten, stinking copper, only a low-down yellow rat bastard would shoot a man in the back. Malcolm starts to stagger, this is a long drawn out Hollywood drawn-out death a la Cagney death in _Public Enemy_.      C'mere. WIDEN TO SHOW SOPHIA at the stove fixing eggs. She wears an apron and nothing else. It's a nicely furnished middle-class apartment.  You hear me, girl?  She shrugs, shuts off the burner, smiles and ambles toward him.   You better believe it.  She starts to sit down on the bed next to him.   Sit over there.  He points to a nearby chair. Sophia makes an amiable hand-shrug and complacently goes.   What's your story, baby? He doesn't want to hear her; he wants to talk. He goes right on:   You one of them white bitches can't get enough black dick. Is that what you are?  Sophia smiles. She aims to please. Malcolm smacks the bed next to him. She gets up and comes over.  Take it off. She takes off the apron.  Now kiss my feet. Kiss 'em!  Feed me. ANGLE. Sophia now has the scrambled eggs on a plate at Malcolm's side. She spoons some into his mouth. He chews and swallows slowly, then grabs her head and brings it to his. A long, brutal kiss. Then he pulls her head away by the hair. She looks at him: anything he wants.  Yeah, girl; that's your story. When you gonna holler \"rape,\" sister?  You will, baby -- if the time come.  Sure wish your mama and papa could see you now. And that ofay you gonna marry.   All them books you read and you still don't know nuthin.    Let's go.  Save it, baby. Save it for Mr. Right, 'cause your grandma's smarter than ya think. She looks at him.  Yeah, she's alive.  You know how dumb I was? I used to think that \"Not For Sale\" was a brand name. Laura looks over. She doesn't understand.  We were parceled out, all five of us. I went to this reform school and lived at this woman's house. She was in charge.  I was special. The only colored kid in class. I became a sort of mascot. Like a pink poodle.  I didn't know then that I was a nigger.        They talked about me like  Good grades. I wasn't there. Like I was some Fine athlete.kind of pedigreed dog or a horse. President of his class.Like I was invisible.  But why, Mr. Ostrowski? I get the best grades. I'm the class president. I want to be a lawyer.   He has been standing there in deep pain all along.   C'mon, Joe.  On my way, Mr. Charlie. Cooper eyes him narrowly.  Get your good haaaam and cheeeeese sandwiches. I got coffee, I got cake and I got ice cream too. Right chere.  Yes, sir. Best in the house.  Yes, sir. I aims to please.   He runs after them.     The word is excuse me.  Don't ever again in life step on my Florsheims again, and never talk-bout my mother.    Gimme a whiskey. BARTENDER pours him a double.  I ordered a single, Jack.       Who is he, man?  Whut's he do? The bartender would not normally answer this, but Malcolm is the man of the moment, so the bartender speaks:  He had it coming. Malcolm sits. There are no introductions. He just nods at SAMMY and  Red, and I ain't no punk.  I'm working trains. Selling.  Keeps me out of the army.  Not this boy... I ain't fighting their war. I got my own. Right chere. Heard tell you're a good man to know.  Where I come from. Boston. Sammy and Cadillac are watching a little skeptically. Archie is flattered.  Man's rep travels.  My papa taught me one thing: don't never bullshit a West Indian bullshit artist.  Archie laughs. Even Sammy smiles. Cadillac still holds his judgment.  No, my mama. She's from Grenada.  Where can I get a hold of you?  Lemme write it down for you. Malcolm reaches for a pencil.  Yes, sir. Archie looks at him sharply.  Yes, sir.  'Cause I want in. And it don't take a lot to know you there, daddy.  Archie and Sammy laugh at his directness. Cadillac smiles. Archie pushes back his chair, about to get up.   Can I run with you, Mr. Archie? Archie eyes him, weighing him seriously.  I done told the man what he could do with his train.  Just now. The three established hustlers smile at the newcomer in their midst.  What?     Solid, daddy.  Let 'em come. I'm ready.   I'm working on it.       Nnnnnnn!  Malcolm with gun in hand does his Bogart gangster imitation.  I'm there, daddy. Wheww. I'm cool enough to kill.    You got any money.  Before Sophia can answer he grabs her pocketbook, dumping all the contents on the floor but the dough.  Well, bitch you move too slow.  Yeah, and I'm putting my money where my ugly mouth is. I'm putting you back in the numbers right now.  Baby, what's today? Sophia is not sure of this, or anything else.  Daddy, put me down for a combination. Combinate me, daddy: 8, 2, 1. You got me? 8, 1, 2; 1, 8, 2... With each number he throws a bill at Archie.  1, 2, 8; 2, 8, 1.  I git 'em all?  I say a lot of things.  Do your job, Get me a bourbon on the rocks and a pack of Lucky's. Honey stares at him.  I said now. She leaves. He leans his head back against the booth --          She has been watching Malcolm.  Mind your own goddamn business ... She comes in a lot?  With him?  Honey nods.  She know?    Is she hooking?  Shut up, bitch.  He raises his arm to hit her and it is held back before it can find its mark.  Daddy, where's my money?  You owe me six big ones. Archie looks at him, non-comprehending.  1, 2, 8 hit, didn't it?  Was you that high? Old man, I threw the slats at you. I said to combinate me.  The bitch was there. Archie doesn't even look at Sophia.  Then skip it, man. But you slipping, baby. You done slipped. Archie is controlling himself. Everyone in Small's is all ears, a ANGLE. Archie looks at Sammy. Sammy is neutral. Archie digs in his pockets, comes up with a roll. He peels off six $100 bills and throws them on the table in front of himself, as he gets up.  Oh, sit down, man. What you tasting? I'm buying.  Got to be a first time, daddy-o.  Ain't gonna be this mother. Sammy goes.  Come on, sweetlips, I got us some g-i-r-l, girl. Let's you and me fly.  It's me or you, ain't it, Pops?  I'll give you back the 600.  I'm wearing, Archie.   Sammy at the nearby bar: his hand in his coat pocket.   And every cat's watching, ain't they? It's a toe-down.  Let Billie finish.  Baby, I got to let this old man win. Keep the faith, and tell Billie I'll see her later.     My father's skull, on one side was crushed in, and then laid across some tracks, for a streetcar to run him over. His body was cut almost in half. My father, Earl Little lived two and a half hours in that condition. Negroes were stronger than they are now.     Like every hustler I was trapped. Cats that hung together trying to find a little security, to find an answer -- found nothing. Cats that might have probed space or cured cancer -- (Hell, Archie might have been a mathematical genius) -- all victims of whitey's social order. Music of a dance combo heard in BG.  Three things I was always scared of: a job, a bust and jail. I realized then I wasn't afraid of anything. I didn't care.  Yeah and get a slave, too, huh, baby?  Man, the name musicians ain't got shit. How you gonna have something? I need a stake, a bundle, a grand. My woman can't afford it; my homey ain't got it. How about you baby? What you got? Peg smiles, afraid of Malcolm.  Jesus ain't got nothin' to do with this.  Shorty eyes him with amazement. The degree of Malcolm's depravity surprises even him.  Surprise you, baby? Well, that's the way it is. What kind of scratch you got on you? Turn out. Let me have it. All of you-- Glances exchanged among Shorty, Sophia and Peg. Shorty reaches into his pocket.  We gone rob this town blind. Anybody want out say so.  Nobody answers; they'll go with Malcolm.  Okay. I got the stake and I got a fence. I need a driver.  Who's Rudy?   What can you do? They are in the process of appraising each other, seeing which one has the bigger penis.  That ain't bad.  So what about him?  Might be all right.  You want to be the head man?  Head nigger in charge?  Okay, baby. Let's flip for it. Flip this. He takes out his gun, a .38 revolver. He dumps the shells on the table, then reinserts one shell and twirls the barrel.  I'll flip first. He puts the revolver to his own head.  Your flip, baby.  Rudy is staring at him; so are they all. Malcolm puts the gun to his temple again.  Your turn, Rudy. You want me to flip for you?  Don't never try to cross someone who ain't afraid to die.  All right. We'll start with Old Talcum Powder. You draw the house, where everything is. You and Peg go out and buy them tools like I told you. We hit tonight on account of in the daytime some of us got that high visibility. Ya dig? Rudy is at a table drawing a diagram; the girls have left. Shorty and Malcolm alone at a window.  Yeah.  He breaks open the gun -- the bullet is in the next slot to be fired.   Palmed it right in the goddam chamber.   The average first offender gets two years for burglary. We were all first offenders. That's what Sophia and Peg drew--  But our crime wasn't burglary. It was balling white girls. They gave us the book.  Fourteen counts of 8 to 10 years.  Shorty thought he hit us with 114 years till I explained what concurrently meant. It meant a minimum sentence of 10 years hard labor at the Charlestown State Prison. The date was February 1946. I wasn't quite 21. I had not yet begun to shave. CAMERA HAS GONE IN for a TIGHT CLOSE SHOT of Malcolm's face: a hardened hustler, pimp, dope peddler and now jailbird at the ripe old age of 20.   Each time a gate is locked his tension increases. His face is a mask hiding his fury, violence and the hunger of an advanced junkie who has not had a fix in over a week.   The guards are now in front of him.    I forgot it.  I'm Malcolm Little, not no goddam number.    Preacher, take your tin Jesus and the Virgin Mary, both, and shove 'em. Door slam.   Who the hell are you?  Man, what do you want?  Man, get outa my face. I ain't nobody's punk. But he steps out of the shower, fills a tin cup with water and empties the contents of the matchbox into it. And drinks it down quickly.  If you ain't trying to punk me, what's your hype?  Talk, daddy, I'm listening. Hey that ain't bad. You got some more?  What did you give it to me for then?  What in the hell are you talking about? He begins to conk his hair, but is paying attention to what Bembry is saying.  You ain't lying.   Man, you been locked up too long, everybody conks. All the cats.  Cause I don't want to walk around with my head all nappy, looking like--  I ain't said I'm ashamed. He turns the water on to wash out the conk -- which has begun to burn. Bembry restrains him, holding his arm.  Leggo. I got to wash it out.  Man, you better get off me. He wrenches away from Bembry and puts his head in the water.  Man, I don't want to hear all that.  Who are you? Malcolm is completely humiliated. Bembry sees this and stops the barrage.  Elijah who?  Me too.  He goes.  I ain't never seen a cat like you. Ain't you scared talking like that in front of an ofay?  You the only cat don't come on with that \"Whatcha know, daddy\" jive; and you don't cuss none.  Tell you this: you ain't no fool.  Okay, okay.   What do you do with your time?  That's what Mama used to say.  Come on, daddy, pull my coat. What happens if you give all that up? You get sick or somethin'? I pulled a hustle once and got out of the draft.  What? Everybody knows God is White.  What for?  What the hell for, man?  Okay, okay. Show me, man.  You understand them words?  I can't make out that shit.  Hey, they's some shit, all right.  White , adj. Of the color of pure snow; reflecting all the rays of the spectrum. The opposite of black, hence free from spot or blemish; innocent, pure, without evil intent, harmless. Honest, square-dealing, honorable. Malcolm stumbles through the definition as well as he can. Bembry takes over the reading, giving it ironic emphasis.  That's bullshit. That's a white man's book. Ain't all these white man's books?  Then what you telling me to study in them for?  Man, how'm I gonna know the ones worth looking at? Bembry smiles at Malcolm. He is a remarkable man who always takes careful measure of his listener. He never talks down to his audience; he talks to them.  Bembry can talk Bible. Right now he goes into street talk.  Man, I'm studying in the man's book. I don't dig half the words.  Where am I gonna start?  Aardvark, noun. An earth pig; an ant-eating African mammal. Man, that sounds like the dozens.   He is reading on his bunk as Barnes walks by. The lights in the cell go out. Malcolm looks up, annoyed at being interrupted. He shifts his position to the floor of the cell so that he can catch the dim light coming from the corridor and goes on with his reading.   I'm staying.  Take 'em. I don't smoke no more. He takes the pack happily and goes. Malcolm reaches into his jacket again, takes out a book. WE SEE its title: Mahatma Gandhi's _My Struggle_. He sits next to the license press to read.   They are out along the right field wall. They walk throughout the scene.  ANGLE - The ball is hit over the fence for a home run. There is a big cheer from the black prisoners. Pete, the batter, trots proudly around the bases.  Ole Pete ain't much in the head, but he can lay in there with the wood.  You pitch, baby; I'll ketch.  This a helluva game. Somethin's going on. He sees a black convict, CHUCK, nearby and calls over:  Hey, whatsa score?  What?  How bout that?  A black man playing big league ball is something.  Little.   Wrapped in thought.     I'm not Malcolm Little and I'm not Satan.   Malcolm cannot answer because he truly does not know. A ball is hit. Malcolm watches its flight but his face is fixed somewhere between understanding and anger: it is the face of the future leader.  Then the devil is white.  I sure met some.     I will not touch the white man's poison: his drugs, his liquor, his carrion, his women.  I will do it.  I can't.  I want to, Bembry, but I can't.  I can't.  I want to, Bembry, but I can't.  I don't know what to say to Allah.  Yeah. When I was picking a lock to rob somebody's house.  I don't know how.  I want to. God knows I want to.   Malcolm holds a letter in his hand. He reads it carefully. He has read it several times before.  I received a letter that day from the Honorable Elijah Muhammad. The Messenger of Allah wrote me, a nobody, a junkie, a pimp and a convict.  It was like a blinding light and I became aware that he was in the room with me. He wore a dark suit and on his face I saw a pain so old and deep and black I could scarcely look at him. I knew I was not dreaming. He was there.  And suddenly as he came, he was gone. The hallucination disappears.  And then I could do it. Malcolm goes down on his knees. There are tears in his eyes as he begins praying:    Allah Akbar: all praise to Him who is all-seeing, all-understanding. He continues to pray.  We are told that Saul, on the road to Damascus, heard the words of truth, he fell from his horse. I do not liken myself to Paul, but I understand. It happened to me.  Dear Bembry. Please thank the Honorable Elijah Muhammad for the money and tell him I have not written him because I have not yet proven myself.  But I have written everyone else.  Tell the Messenger of Allah that I have dedicated my life to telling the white devil the truth to his face. I greet you with the ancient words: \"As Salaam Alikum.\"  P.S. I finally worked my way through the \"Z's\"...  Yes it is, Chaplain Gill. But I wouldn't want to say which one of us is what. Laughter, especially from the black convicts.  You've been talking about the disciples. What color were they?  They were Hebrew, weren't they?  As Jesus was. Jesus was also a Hebrew.  What color were the original Hebrews?  Then we don't know that God was white. There is a strong reaction to this.  But we do know that the people of that region of Asia Minor, from the Tigris-Euphrates valley to the Mediterranean, are dark-skinned people. I've studied drawings and photographs and seen newsreels. I have never seen a native of that area who was not black.  I'm not saying anything, preacher. I'm proving to you that God is black.  God is black.     How many you turning out?  Make it 1000. We got a lot of fishing to do.  We can always use another good brother.  You think you are Christians, and yet you see your so-called white Christian brother hanging black Christians on trees. You say that white man loves you and yet he has done every evil act against you. He has everything while he is living and tells you to be a good slave and when you die you will have more than he has in Beulah's land. We so-called Negroes are in pitiful shape. Get off your knees praying to a picture of a white, pale blond, and blue-eyed Jesus. Come out of the sky. Build heaven on earth. Islam is the black man's true religion.  And that the white man is the devil. Yes, God is black and you are made in His image and don't know it. That's how brainwashed you are.   My brothers and sisters, they tell you you will sprout wings when you die and fly to heaven. The Honorable Elijah Muhammad tells you that's pie in the sky.  Have you ever seen a black man who wasn't down on his knees begging the Lord to give him in heaven what the white devil enjoys right here on earth?    Come to our Temple and hear the truth. Because, brother and sister, you are dead. Yes you are, mentally dead, spiritually dead, morally dead. And we are here to resurrect the black man back from the dead.  My beautiful sister, for you are beautiful. Beautiful because you are black. Because black is beautiful. You work in the white folks' kitchen so I don't have to tell you that they're devils.    And you are putting yourselves on the auction block, letting them examine you like a horse, like a slave. The Honorable Elijah Muhammad teaches that you are black and should be proud... FACE OF ONE BLACK WOMAN, beginning to shake her head in accord.  We're not American, we're Africans who happen to be in America. We were kidnapped and brought here against our will from Africa. We didn't land on Plymouth Rock, brothers and sister. Plymouth Rock landed on us. Reactions: laughter, interest. Ad lib \"That's the truth.\"  Put an end to your begging. No more \"Please, Mr. White Man, Lawdy boss, brush me another crumb from off your table, kindly, sir.\"  We are a nation, a great nation and don't need a thing from them. Malcolm scanning the faces of his audience as they react. He sees someone he knows and blurts out boyishly :  Shorty! The crowd turns to Shorty, sitting embarrassedly in the audience.  Come on up here, man, and give us some skin. Here's a man, brothers and sisters, who shot up with me, who robbed with me, and did time in the white devil's jailhouse. Stand up, Shorty, and be counted-- But Shorty is trying to hide from the spotlight. Malcolm comes down from the platform and walks to him.  Folks, the brother is shy and needs special attention. So would you excuse us, while Brothers Sidney and Earl take up the collection.  He embraces Shorty as the crowd laughs appreciatively and Brothers Sidney and Earl have a chuckle themselves.  It isn't a hype, Shorty. And I meant what I said: join us.  The Honorable Elijah Muhammad says you should pay it all your mind. If you got a mind.  I've been clean for twelve years, Shorty.  How's the rest of the gang? You seen anyone?  How about Old Cadillac? 133B INSERT FLASH - Cadillac is an old junkie, past reclaiming, sitting staring in a MENTAL WARD, twitching, nose running.  You seen Sophia? 133C INSERT FLASH - Sophia is a bored housewife, she's in the kitchen cooking while her husband hides behind the Wall Street Journal.  Hello, Archie.  his old juice, tries to stand up.  Take it easy, baby.  You saved my life, Archie. Running me out of Harlem. When I think how close we came to gunning each other down, I have to thank Allah.   I don't know. It doesn't matter. The thing is we got to get you back on your feet.  Can you use a few bucks? I ain't got much, but--  Take it easy. Lay down and don't think about it.  You could of been something, Archie, but the devil got to you. The old man is asleep.  You know all the angles except how to live.   Women who could be mothers, teachers, scientists...   Who is going to raise our children?; men who might have been astronauts, composers, engineers; Who is going to be the head of the households?--  --and what has the white devil made of them: dead souls. Oh, my he has no conscience. He should fall on his knees and say, \"My kind commits history's greatest crime against your kind every day of your life.\" But does he? No. He scorns you, splits your head with his nightstick and calls you nigger. If you've had it, then stand up and come forward. If not us, then who? If not now, then when?   Brother Bembry, can we fix it so our loudspeaker is heard on the street?  What?    Sure I'll speak to your class. But I'm a hard man on women. You want to know why?  If you want to tell me.       Women talk too much. To tell a woman not to talk is like telling Jesse James not to carry a gun or a hen not to cackle. And Samson, the strongest man that ever lived, was destroyed by the woman who slept in his arms.  What points?    Let me explain. No. I'll do better than that. I'll show it to you. Scientifically. But it's demonstration purely in the interest of science, you understand?  Notice especially the claw, the jaw and the skull formation. This is the rat. This the mole. Here you have the aardvark and the boar...  ...All members of the pig-rodent family.  So it is not a matter of the breeding conditions or preparation of the meat. The meat itself is foul. ANGLE. As they saunter out, passing the huge skeletons of prehistoric animals now.  I'm sorry. I've had you on your feet for hours.  That's something I haven't done in fifteen years.  Sat down with a pretty girl and had an ice cream soda.  Delicious. She laughs. He blushes.  Let's talk about you for a change.  0h, yes, there is. I know a lot about you. Brother Bembry briefed me.   You're from Detroit, near where I come from. You majored in education at Tuskegee. You're studying nursing and having trouble with your family.  They want you to quit the Muslims or they won't pay your tuition, isn't that it?  No, good Sisters are rare. We need every one. Tell me something: how tall are you?  Just an idle question.  How old are you, Betty?  Are you?  What have you set your mind to?    I demand to see Brother Johnson.  I'm from Muslim Temple 7.  Where is he? The police respond with a squeeze play intended to intimidate Malcolm:  I'm Minister Malcolm X. Two witnesses saw him brought in. He was not brought out.  Take a look out that window. I intend to see Brother Johnson. The cops eye each other. Plainclothes walks to the window.   Brothers of Brother Johnson.     Until I'm satisfied Brother Johnson is receiving proper medical attention, no one will move. Cops eye each other. Plainclothes nods slightly, he has to give in, Malcolm is not playing.   Only a pig could do a thing like that.  Don't you call me boy, you pig. Letting a man bleed like that. Sergeant puts a restraining hand on Plainclothes.  That man belongs in a hospital. Get an ambulance. Now!   I'm not satisfied. Malcolm starts walking down the center of the street, after the ambulance.  To the hospital. The Fruit of Islam fall in behind him, marching slowly. It takes on the start of a march as the neighborhood people fall in behind them. People  race with them on the street and on the sidewalk.  They're all disciplined men. They're doing nothing except waiting.  That's your headache, Captain. And if he dies, I pity you.  Thank you, Doctor.   You bastards.   It's clear the decision is in one man's hands, Malcolm's.    He makes a gesture with his hand, the Fruit of Islam disperse. ANGLE. People moving away, going home. Only one person remains from the Fruit of Islam and the crowd, it's Benjamin.  I want to also, but until we are instructed by the Messenger to do so, we will just wait and pray.  That's enough, Brother Earl.  Sit down, son. Malcolm pours some cream into his cup of black coffee, then also some white sugar.  There is only one thing I like integrated. My coffee. Benjamin laughs.   What can I do for you?  Do you know what it means to be a true Muslim? Benjamin hesitates.  Do you?  I admire your enthusiasm but you should never join any organization without first checking it out thoroughly. Benjamin is crushed and he starts to get up.  We need more young warriors like yourself, stick around and we shall see if your heart is true.   An AIDE of Elijah puts down the newspaper and shakes Malcolm's hand.  Let me do it then.  Allah Akbar. The sweeping done, they stand together near a table at a window.  This sweet, gentle man gave me the truth from his own mouth. And I adored him, in the sense of the Latin root of the word. Adorare, to worship and to fear. He was the first man I ever feared -- not fear such as the one has of a gun but the fear one has of the power of the sun, I pledged myself to him, even if it cost me my life.  Sister Betty?  I'm in Detroit.  At a gas station.  Will you marry me?  Did you hear what I said?  I think so. Can you catch a plane?  I love you.  It won't be easy.  It will be rough.  I'll be away a lot.  What do you think?  I must emphasize at the outstart, that the Honorable Elijah Muhammad is not a politician, so I'm not here this afternoon as a Republican, nor a Democrat, not as a Mason nor an Elk, not as a Christian nor a Jew, not as a Catholic nor a Protestant, not as a Baptist nor a Methodist, not even as an American. For if I was an American the problem that confronts our people today would not exist. So I stand here as what I was when I was born: A BLACK MAN!  Before there were any such things as Democrats or Republicans, we were black. Before there were any such things as Masons or Elks, we were black. Before there were any such things as Jews or Christians, we were black people. In fact long before there was ever any such place as America, we were black people... And after America has long passed from the scene there will still be BLACK PEOPLE.  What kind of black people does the Honorable Elijah Muhammad speak for? Black people who are jobless... the black masses who are poor, hungry, and angry, the black masses who are dissatisfied with the slums and ghettos in which we have been forced to live... the black masses who are tired of listening to the promises of white politicians to correct the miserable living conditions that exist in our community... the black masses that are sick of the inhuman acts of bestial brutality practiced by these semi-savage white policemen that patrol our community, like the occupation forces of a conquering enemy army... the black masses who are fed up with the anemic, Uncle Tom leadership set up by the white man to act as a spokesman for our people and to KEEP US    If the black man cannot go back to his own people and his own land, Elijah Muhammad is asking that a part of the United States be separated and given to the Muslims so they can live separately.  The Honorable Elijah Muhammad is the only man the white people can deal with in the solving of problems of the so-called Negro...    ...as Elijah Muhammad knows his problems.   The white people who are guilty of white supremacy try and hide their own guilt by accusing the Honorable Elijah Muhammad of teaching black supremacy when he tries to uplift the mentality, the social, and economic condition of black people in this country. And the Jews, who have been guilty of exploiting the black people economically, civilly, and otherwise, hide their guilt by accusing the Honorable Elijah Muhammad of being anti-Semitic simply because he teaches our people to go into business for ourselves and trying to take over the economic leadership in our own community. The black people in this country have been the victims of violence at the hands of the white man for 400 years, and following the ignorant Negro preachers, we have thought that it was God-like to turn the other cheek to the brute that was brutalizing us. 100 years ago they use to put on a white sheet and use a bloodhound against Negroes. Today they've taken off sheets and put on police uniforms, they've traded in the bloodhounds for police dogs. And just as Uncle Tom back during slavery used to keep the Negroes from resisting the bloodhounds or resisting the Ku Klux Klan by telling them to love their enemy or pray for those who use them as spitefully today. The Honorable Elijah Muhammad is showing black people that just as the white man and every other person on this earth has God given rights, natural rights, civil rights, and any other kind of rights that you can think of when it comes to defending himself. 159    With a studio mike around his neck, he's on a panel show.     Yes sir. As you know, during slavery time, the slavemasters named most of the so-called Negroes in America after themselves. Mr. Elijah Muhammad teaches us once you come into the knowledge of Islam, you replace your slave name with an X. Since we've been disconnected, cut off from our Eastern culture for so long that we don't know the names we originally had, we will use X until we get back to the East.  Please, go ahead.    For the white man to ask the black man if he hates him is just like the rapist asking the raped, or the wolf asking the sheep, \"Do you hate me!\" The white man is in no moral position to accuse anyone of hate.  I'll talk about \"progress\" in a minute, but let me finish with my brother.  Malcolm gestures to the Negro panelist.  The BLACK MEMBERS of the TV audience are lapping it up. Betty and Earl also sit in the TV studio audience.  Stop me if I'm wrong. I \"polarize the community.\" I \"erroneously appraise the racial picture.\"  You left one phrase out. Another educated Kneegrew said to me and I quote: \"Brother Malcolm oversimplifies the dynamic interstices of the Negro subculture.\" Would you agree?    Well, I have this to say. Do you know what a Negro with a B.A., an M.A. and a Ph.D. is called -- by the white man? I'll tell you. He's called a nigger. There is some blanching and guffawing from the audience. The moderator is totally embarrassed, Betty roars.  And I'm not finished. To understand this man-- He points a sharp finger at the Negro Panelist.  --you must know that historically there are two kinds of slaves. House Negroes and Field Negroes. The house Negro lived in the big house; he dressed pretty good; he ate pretty good and he loved the master. Yeah, he loved him more than the master loved himself. If the master's house caught fire, he'd be the first to put the blaze out. If the master got sick, he'd say: \"What's a matter, boss; we sick?\" WE sick! If someone said to him, \"Let's run away and escape. Let's separate.\" He'd say, \"Man, are you crazy? What's better than what I got here?\" That was the House Negro. In those days he was called the House Nigger. Well, that's what we call them today because we still got a lot of House Niggers running around. There is applause from the blacks in the audience. Moderator tries to regain control.  Don't you want to hear about the Field Nigger?  Thank you. Now the Negro in the field caught hell all day long. He was beaten by the master; he lived in a shack, wore castoff clothes and hated his master. If the house caught fire, he'd pray for a wind. If the master got sick, he'd pray that he'd die. And if you said to him, \"Let's go, let's separate\", he'd yell, \"Yeah, man, any place is better than this.\" You've got a lot of Field Negroes in America today. I'm one.  --there's another one. The majority of black Americans today are Field Negroes. They don't talk about OUR progress, about OUR government, OUR navy, OUR astronauts. Hell, they won't even let you near the plant.    Brother Man, put that bottle down, take that poison away from your lips. That's what the devil wants you to do, stay high, out of your natural mind. I know, I've been there. The wino looks at Malcolm and continues to drink his wine. 159H--Malcolm emerges from a doorway to be met by an army of TV REPORTERS armed with microphones. He walks; they follow. 159I--Malcolm walking in Harlem, urging people to lift themselves up, come to the meetings, etc.  It's time you received your X. But first you must copy this letter, exactly as I give it to you; down to the dotted \"i's,\" crossed \"t's,\" everything. And you must go on a fast, just water and juices, that's it.  Brother Benjamin, do not rush, it has to be exact. --Benjamin goes off in a corner and very quickly copies the letter, he's so anxious. --Benjamin hands Malcolm his letter, Malcolm shakes his head and hands it back, it's not exact.  When you live in a poor neighborhood, you're living in an area where you have poor schools.     When you have poor schools you have poor teachers. When you have poor teachers, you get a poor education.  Poor education, you only work on poor paying jobs and that enables you to live again in a poor neighborhood.  So it's a very vicious cycle. We've got to break it.   Malcolm is inspecting it.     You are now Benjamin 2X.  Come, sit with us.  We are now sitting with Brother Benjamin 2X.  Let's get this man some food.   He stares at her.  Nothing!  ...My high school was the black ghetto of Roxbury. My college was the streets of Harlem, and I took my masters in prison. If you look out the window--     --you can see my burglary hangout. I lived like an animal. Had it not been for the Honorable Elijah Muhammad I would surely be in an insane asylum or dead. ANGLE - The audience carefully listening.  Mr. Muhammad is trying to get us on God's side, so God will be on our side to help us fight our battles. When Negroes stop getting drunk, stop being addicted to drugs, stop fornicating and committing adultery. When we get off the welfare, then we'll be MEN. Earn what you need for your family, then your family respects you. They'll be proud to say \"That's my father.\" She's proud to say \"That's my husband...\" Father means you're taking care of those children. Just 'cause you made them that don't mean you're a father. Anybody can make a baby, but anybody can't take care of them. Anyone can go and get a woman but anybody can't take care of a woman. This is the type of teaching that the honorable Elijah Muhammad teaches us so we can build the moral fiber of our people.  I can see the gentlemen of the press, also the FBI and CIA. are with us. Get it straight 'cuz if I said, \"Mary had a little lamb,\" they'd write Malcolm X lampoons poor Mary. Loud laughter from the audience. But this response is overwhelmed by the response of ANOTHER, LARGER AUDIENCE.  We have built temples in Boston, in Detroit, in Atlanta, Philadelphia, Washington -- 100 temples in fifty states. From a handful we have grown to scores of thousands.  The Honorable Elijah Muhammad teaches us that God is now about to establish a kingdom on this earth based on brotherhood and  [...]  against peace, his history on this earth has proved that. Nowhere in history has he been brotherly toward anyone. The only time he has been brotherly toward you is when he can use you, when he can exploit you, when he can oppress you, when you will submit to him. And since his own history makes him unqualified to be an inhabitant or a citizen in a kingdom of brotherhood, the Honorable Elijah Muhammad teaches us that God is about to eliminate that particular race from this earth. So since they are due for elimination, we don't want to be with them.    If the so-called Negro were American citizens we wouldn't have a race problem. If the Emancipation Proclamation was authentic, you wouldn't have a race problem. If the 13th, 14th, and 15th amendments to the Constitution was authentic, you wouldn't have a race problem. If the Supreme Court desegregation decision was authentic, you wouldn't have a race problem. All of this is hypocrisy. These Negro leaders have been telling the white man everything is all right, everything is under control. And they've been telling the white man that Mr. Muhammad is wrong, don't listen to him. But everything Mr. Muhammad has been saying is going to come to pass is now coming to pass and now the Negro leaders are standing up saying that we are about to have a racial explosion. We're going to have a racial explosion and that's more dangerous than an atomic explosion.    It's going to explode because black people are dissatisfied. They're dissatisfied now not only with the white man, but with these Negroes who have been sitting around here posing as leaders and spokesmen for black people. Anytime you put too many sparks around a powder keg, the thing is going to explode and if the thing that explodes is still inside the house, then the house will be destroyed. So the Honorable Elijah Muhammad is telling the white man get this powder keg out of your house, let the black people in this country separate from him while there's still time. And if the black man is allowed to separate and go on onto some land of his own, where he can solve his problems, then there won't be any explosion. COMPLETE  Thank you, Brother; Sister, how are you?  Sure, man.  What?  Say what you're saying.     Okay, last hug. As he enters, a smile on his face, but the concern of the evening clearly imprinted. He sits down heavily. Betty watches him carefully.  Long day. Long night. Long year. Long ten years. He smiles. She doesn't.  Why are you looking at me like that?  How do you know? She smiles.   I don't want to bring my troubles home. You know that.  I just want to sit here and be still.   Talk about what?  There's always talk, always been talk, and always will be talk. Don't they say how I'm trying to take over the Nation, how I'm getting rich off the Nation?  There are always slanders, always lies. You're reading the devil's lies. Can't you see they're trying to bring us down, bring down the Messenger.  I was going to talk to Bembry about it tonight.  Woman, have you lost your mind? What's the matter with you? Betty gets up, goes to him gently.   I'm not interested in personal publicity. Our people know what I'm doing.  Bembry saved my Life. The Honorable Elijah Muhammad saved my life.  Is that what this is about? Material wealth?  The Nation will provide for you and the children if anything happens to me.  What do you want me to do? Our people need me.  What do you want me to do?   He cannot believe what he is hearing, but he must. The truth is before his eyes.  Sister Evelyn, believe in Allah.       He told you that?  Are you sure?  Allah will provide.   He has said everything on his mind and waits for Bembry's answer.   \"I'm telling you God's words, not to hustle.\"  We tell the world we're moral leaders because we follow the personal example of the Honorable Elijah Muhammad. It's hard to make a rooster stop crowing once the sun has risen. The sun is up. We hear rifle shots.   And what do I say of this so-called national mourning! I say... the white man's acts are condemned, not only by our beliefs but by his own.  Both his Bible and the Holy Koran say: \"As you sow, so shall you reap.\" Both say: \"Sow the wind, reap the whirl wind.\"  In the soil of America the white man planted the seeds of hate. He allowed the weeds that sprang up to choke the life out of thousands of black men.  Now they have strangled one of the gardeners. This is the justice of Allah. Wa-Salaam Alaikum.      Assassination might be too good a word, and might I add an Arabic word at that. This was a prime example of the devil's chickens coming home to roost. Being an old farm boy myself, chickens coming home to roost never did make me sad. It always made me glad.  Yes, sir, I did.   He knows what is coming.      I agree with you, sir. I submit 100 percent.   Sidney is playing on the floor with the kids. Betty scoops them up.  How long has this been going on?  What mission?   What does Sidney say?  No. You'll be marked for death.  I won't let myself come between you and your father. Go home.  And don't come back. Sidney reluctantly leaves, walks out the door, past Betty. She looks at him, then Malcolm.  Because 1964 threatens to be a very explosive year on the racial front, and because I myself intend to be very active in every phase of the American Negro struggle for HUMAN RIGHTS, I have called this press conference, this morning in order to clarify my own position in the struggle -- especially in regards to politics and nonviolence. In the past I thought the thoughts, spoke the words of the Honorable Elijah Muhammad, that day is over. From now on I speak my own words, and think my own thoughts. Internal differences within the Nation of Islam forced me out of it. I did not leave of my own free will. But now that it has happened, I intend to make the most of it. Now that I have more independence of action, I intend to use a more flexible approach toward working with others to get a solution to this problem. I do not pretend to be a divine man, but I do believe in divine guidance, divine power, and in the fulfillment of divine prophecy. I am not educated, nor am I an expert in any particular field, but I am sincere, and my sincerity is my credentials. I'm not out to fight other Negro leaders or organizations. We must find a common solution, to a common problem. I am going to organize and head a new mosque in New York City, known as the Muslim Mosque, Inc. This gives us a religious base, and the spiritual force necessary to rid our people of the vices that destroy the moral fiber of our community. Our political philosophy will be black nationalism. Our economic and social philosophy will be black nationalism. The Muslim Mosque, Inc. will remain wide open for ideas and financial aid from all quarters. Whites can help us, but they can't join us. There can be no black-white unity until there is first some black unity.  A host of questions fired all at once: How many of Elijah's followers will join you? etc, etc, etc. Malcolm calms them:  There is one further preparation I need. It is a return to the source of our great religion. I will make a pilgrimage to Mecca.    My darling Betty. Everywhere I go I am welcomed as the representative of our people.  Our fight is known and respected worldwide. Incidentally, there's a little white man who follows me wherever I go.     I wonder who he's working for? If I was a betting man, I'd say CIA. What's your guess?  Today, with thousands of others, I proclaimed God's greatness in the Holy City of Mecca. Wearing the Ihram garb I made my seven circuits around the Kaaba; I drank from the well of Zem Zem; I prayed to Allah from Mt. Ararat where the Ark landed. It was the only time in my life that I stood before the Creator of all and felt like a complete human being.  You may be shocked by these words, but I have eaten from the same plate, drunk from the same glass and prayed to the same God with fellow Muslims whose eyes were blue, whose hair was blond and whose skin was the whitest of whites. And we are brothers, truly; people of all colors and races believing in One God and one humanity. Once before, in prison, the truth came and blinded me. It has happened again...     In the past, I have permitted myself to be used to make sweeping indictments of all white people, and these generalizations have caused injuries to some white folks who did not deserve them. Because of the spiritual rebirth which I was blessed to undergo as a result of my pilgrimage to the Holy City of Mecca, I no longer subscribe to sweeping indictments of one race. I intend to be careful not to sentence anyone who has not been proven guilty. I'm not a racist and do not subscribe to any of the tenets of racism. In all honesty and sincerity it can be stated that I wish nothing but freedom, justice and equality: life, liberty, and the pursuit of happiness for all people. 179A SHOT. Malcolm is bent over in prayer, lone figure in a huge mosque.  My first concern, of course, is with the group to which I belong, the Afro-Americans, for we, more than any other, are deprived of these inalienable rights. 179B SHOT. Malcolm on a plane headed home.  I believe the true practice of Islam can remove the cancer of racism from the hearts and souls of white Americans.  Let's begin.  As I recall, I pointed out that while I was in Mecca making the pilgrimage, I spoke about the brotherhood that existed at all levels among all people, all colors who had accepted the religion of Islam. I pointed out that what it had done, Islam, for those people despite their complexion differences, that it would probably do America well to study the religion of Islam and perhaps it could drive some of the racism from this society. Muslims look upon themselves as human beings, as part of the human family and therefore look upon all other segments of the human family as part of that same family. Today my friends are black, brown, red, yellow and white.  Oh yes.  The AUDIENCE applauds.  The audience will have to be quiet. Yes, as I pointed out that during my trip that nations, African nations, Asian, Latin nations look very hypocritical when they stand up in the UN condemning South Africa and saying nothing about the racist practices that are manifested everyday against Negroes in this society. I would be not a man if I didn't do so. I wouldn't be a man.  Certainly, we will work with any groups, organizations or leaders in any way, as long as it's genuinely designed to get results.  No, not particularly. But I do think that you will And black people in America, as they strive to throw off the shackles of mental colonialism, will also probably reflect an effort to throw off the shackles of cultural colonialism. And then they'll begin to reflect desires of their own with standards of their own.  I don't see why that should be controversial. I think that if white people found themselves victim of the same kind of brutality that black people in this country face, and they saw that the government was either unwilling or unable to protect them, that the intelligence on the part of the whites would make them get some rifles and protect themselves.  Has the white man changed since I went away? Have you put up your guns? The day you stop being violent against my people will be the day I tell folks to put away their guns.   Malcolm looks out the living room window, he has a rifle in hand.  He doesn't see anyone and closes the curtain. The phone rings.    You have to sleep for three. Malcolm pulls Betty closer to him.  I'm sorry. I haven't been the best husband or father.  Families shouldn't be separated. I'll never make another long trip without you and the kids. We'll all be together.  We had the best organization that black people ever had and niggers ruined it.       Walk out the back, dear. Hurry. Betty goes. Malcolm runs back for the children. ANGLE. He reassuringly leads the four children, in their pajamas, through the smoke-filled house.  There's nothing to be afraid of. It might be a little cold. Hang on. We'll be fine.  Call the Fire Department.  And the fire hit the window and it woke up my second oldest baby, but the fire burned on the outside of the house. It could have fallen on six-, four-, or two-year-old girls. And I'm going to tell you, if it had done it, I'd've taken my rifle and gone after anybody in sight.  It was bombed by the Black Muslim movement upon the orders of Elijah Muhammad.   I can imagine. I did it myself. For the publicity.    I don't care about myself, my wife and four children were sleeping in their beds, they have nothing to do with this.     Let sincere white individuals find other white people who feel as they do and teach non-violence to those whites who think and act so racist.    Let's all pray without ceasing. May Allah bless you.   Malcolm dials the phone.  Brother Earl.   I'm gonna try and get some work done tonight.  No, that won't be necessary. I'll be all right.  I don't want folks to be searched, it makes people uncomfortable. If I can't be safe among my own kind, where can I be? Allah will protect me. There is silence on the other end.    Betty it's me. It's me. INTERCUT between between Malcolm and Betty.  Don't answer the phone. It's all right. It's all right. Nothing is gonna happen to anybody.  At the Hilton. The girls asleep?  I don't think that's such a good idea.      It's as if he's frozen in his car.    Malcolm has stopped in his tracks, like some unseen force has overcome him which prevents him from moving. Malcolm is paralyzed.    His eyes are closed, and the street noise begins to build to a deafening _roar_. Then all of a sudden it stops.   Ma'am, I'm fine.  May Allah bless you.  Is the program ready?  Why not? You've had ample time, you and the   Folks are sitting out there _today_, not next week, expecting to hear our program.  Has the Reverend called? Is he going to show?  So now we have no opening speaker? Why wasn't I informed last night?  Since when do you start telling Sister Betty my business? Since when? She has nothing to do with this. You tell me, not her, not anybody else.  What did I tell you about assuming? Malcolm starts pacing the room, nobody has ever seen him like this before.  Benjamin, you better go out there and explain why the program isn't ready today. Benjamin 2X gets up to leave.  Sister, please go with the brother. They both exit.     The way I feel, I ought not to go out there today. In fact, I'm going to ease some of this tension by telling the black man not to fight himself -- that's all a part of the white man's big maneuver, to keep us fighting amongst ourselves, against each other. I'm not fighting anyone, that's not what we're here for.  Is my family here yet?  You'll have to forgive me for raising my voice to you.   I wonder if anybody understands.  Make it plain.       Brothers and Sisters, Wa-Salaam Alaikum.    Hold it, brothers. Don't get excited. Let's cool it--   Throws up his hands, grabs his chest and is knocked backward.    His eyes are glazed over.",
        "X": "It is a bright sunny day on a crowded street on the black side of Boston. PEOPLE and KIDS are busy with their own things.  SHORTY bops his way down the street. He is a runty, very dark young man of 21 with a mission and a smile on his face. He wears the flamboyant style of the time: the whole zoot-suit, pegged legs and a wide brim hat with a white feather stuck in the hat band.   FOLLOW SHOT. Shorty dodges through the crowd with his packages. His smile is one of anticipation. He nods to a PAL without stopping; eyes a COUPLE OF CHICKS dancing on the street, but is not dissuaded.     When my mother was pregnant with me, she told me later, a party of Klansmen on horseback surrounded our house in Omaha.  10A ANGLE. KLAN on horses in front of house.  They brandished guns and shouted for my father to come out. My mother went to the door where they could see her pregnant condition...  ANGLE. A pregnant Louise Little on porch.  ...and told them my father was in Milwaukee, preaching.  ANGLE. The Klan breaks all the windows in the house then rides off into the glorious D.W. Griffith _Birth of a Nation_ moonlit night.   The hooded Klansman said the good, white Christians would not stand for his troublemaking, and to get out of town. ANGLE. The terrified Little children look out a broken window at their mother.  They broke every window with their rifle butts before riding off into the night, their torches flaming.   My father was not a frightened Negro as most   ...and had a glass eye. He believed, as did Marcus Garvey, that freedom, independence and self-respect could never be achieved by the Negro in America . . .  ...that, therefore, black men should leave America and return to the land of their origin. 10D ANGLE. Earl Little, in a wagon with little Malcolm.  My father dedicated his life to his beliefs because he had seen four of his six brothers die violently... 10E WIDER ANGLE. WE SEE Earl in front of a podium in church. He is preaching.  ...three killed by white men and one lynched. There are nine children in our family. ANGLE. The nine Little children.   My mother was an attractive woman, an educated woman, a strong woman.  She was very light, her mama was raped by a white man. One of the reasons she married my father was because he was so black, she disliked her complexion and wanted her children to have some color.   The porch of a respectable house. Malcolm with Laura; he anxious to get away.                   As the Clipper surfaces in Harlem, pulls up to the 125th Street station.              Look, country boy, you shouldn't have been in my way. Everyone becomes quiet in the bar.  So what are you gonna do? Go run home to your Mama. Malcolm grabs a bottle off the bar counter and with lightning speed brings it crashing down on Fox's head. As he lays on the floor with head bleeding, Malcolm kicks him in the stomach _two times_. It's done,   A FIVE DOLLAR BILL. CAMERA GOES IN for the last three digits.  64ASTOCK MARKET BOARD at the end of a day's trading. GO IN for the last three numbers. 64BPREACHER in a pulpit, reading from the Bible.   A miserable night, raining and cold. Malcolm turns into the bar.   The well-known 52nd Street nightspot features Billie Holiday. A stand-up cutout of her is outside.   of the hustlers from Small's are in evidence.          My father's skull, on one side was crushed in, and then laid across some tracks, for a streetcar to run him over. His body was cut almost in half. My father, Earl Little lived two and a half hours in that condition. Negroes were stronger than they are now.  Like every hustler I was trapped. Cats that hung together trying to find a little security, to find an answer -- found nothing. Cats that might have probed space or cured cancer -- (Hell, Archie might have been a mathematical genius) -- all victims of whitey's social order. Music of a dance combo heard in BG.  Three things I was always scared of: a job, a bust and jail. I realized then I wasn't afraid of anything. I didn't care.      The average first offender gets two years for burglary. We were all first offenders. That's what Sophia and Peg drew--  But our crime wasn't burglary. It was balling white girls. They gave us the book.  Fourteen counts of 8 to 10 years.  Shorty thought he hit us with 114 years till I explained what concurrently meant. It meant a minimum sentence of 10 years hard labor at the Charlestown State Prison. The date was February 1946. I wasn't quite 21. I had not yet begun to shave. CAMERA HAS GONE IN for a TIGHT CLOSE SHOT of Malcolm's face: a hardened hustler, pimp, dope peddler and now jailbird at the ripe old age of 20.   A baseball game is in progress. A BLACK TEAM is playing a WHITE ONE. Most of the CONVICTS are watching the game; partisanship at every pitch. A base hit gets a big reaction.   I received a letter that day from the Honorable Elijah Muhammad. The Messenger of Allah wrote me, a nobody, a junkie, a pimp and a convict.  It was like a blinding light and I became aware that he was in the room with me. He wore a dark suit and on his face I saw a pain so old and deep and black I could scarcely look at him. I knew I was not dreaming. He was there.  And suddenly as he came, he was gone. The hallucination disappears.  And then I could do it. Malcolm goes down on his knees. There are tears in his eyes as he begins praying:  We are told that Saul, on the road to Damascus, heard the words of truth, he fell from his horse. I do not liken myself to Paul, but I understand. It happened to me.      Malcolm is talking to a CROWD from a ladder.           Malcolm listening as SEVERAL WITNESSES simultaneously describe the attack. A small angry CROWD has gathered. The most animated one is BENJAMIN, a very dark young black teenager, we will soon meet him later.         Now the march has taken over the broad avenue. COPS are forced to      Malcolm is standing in front of the Fruit of Islam men, as HIGHRANKING POLICE OFFICER GREEN comes over.     An AIDE of Elijah puts down the newspaper and shakes Malcolm's hand.  This sweet, gentle man gave me the truth from his own mouth. And I adored him, in the sense of the Latin root of the word. Adorare, to worship and to fear. He was the first man I ever feared -- not fear such as the one has of a gun but the fear one has of the power of the sun, I pledged myself to him, even if it cost me my life.     Malcolm is speaking to a GOOD SIZED AUDIENCE:  Take your time.     Malcolm is walking the streets of Harlem like he is campaigning for office. He has Brothers Sidney, Earl, and Benjamin at his side, a CROWD follows him. Malcolm sees a WINO.     All praises are due to Allah. Thank you, Brother Minister.  Brother Minister, can I have something to eat? Everyone laughs.                       \"Bring those children in here.\"           Give us the command, Malcolm.     A blue 1968 Cadillac passes a sign that says Patterson, New Jersey.    Betty is driving to the Audubon Ballroom, her four daughters are in the backseat making a racket.       The assassins are driving over the George Washington Bridge.      No sign of the minister yet.     No, Brother Minister.  Next week, Brother Minister.  And now, without further remarks, I present to you one who is willing to put himself on the line for you--        --a man who would give his life for you. I want you to hear, to listen, to understand one who is a Trojan for the black man.",
        "Pete": "Looka Satan.  He bout to bust.  Watch out, baby, this cat is heavy on religion."
    },
    "imdb_rating": "7.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BOTRiNzY4MWItNjU2Ni00ZDdlLWE4YTItMDdkYTQ3NDFjY2FiXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_QL75_UX380_CR0,2,380,562_.jpg",
    "description": "Biograpical epic of Malcolm X, the legendary African American leader. Born Malcolm Little, his father (a Garveyite Baptist minister) was killed by the Ku Klux Klan. Malcolm became a gangster, and while in jail discovered the Nation of Islam writings of Elijah Muhammad. He preaches the teachings when let out of jail, but later on goes on a pilgrimage to the city of Mecca, there he converts to the original Islamic religion and becomes a Sunni Muslim and changes his name to El-Hajj Malik Al-Shabazz. He is assassinated on February 21, 1965.",
    "name": "Malcolm X",
    "genres": [
        "Biography",
        "Drama",
        "History"
    ]
}