{
    "filename": "Man-on-the-Moon_script.txt",
    "imdb_id": "tt0125664",
    "imdb_url": "https://www.imdb.com/title/tt0125664",
    "characters": [
        "Andy Kaufman (as Tony Clifton)",
        "Little Michael Kaufman (as Greyson Pendry)",
        "Little Andy Kaufman",
        "Budd Friedman",
        "Janice Kaufman - Andy's Mother",
        "Mr. Besserman",
        "Wiseass Comic",
        "Improv Piano Player",
        "Diane Barnett",
        "George Shapiro",
        "Stanley Kaufman - Andy's Father",
        "Little Wendy",
        "Meditation Student",
        "Baby Carol Kaufman",
        "Yogi"
    ],
    "dialogues": {
        "Budd": "I think he's Lithuanian.  None of us can understand him.  George nods admiringly.   And now we have a treat for you late- night diehards.  The star of Taxi -- here in person, Andy Kaufman!  The sparse crowd APPLAUDS.  Budd leaves, and Andy shuffles up.   This is a comedy club -- not a medical sideshow.  If you wanna perform here, take a shower, get some sleep, and pull yourself together.  Come back and do the material that people love: Do the Mighty Mouse, the Foreign guy! Andy, you gotta snap out of this funk!  If you can -- I'll give you the headline spot tomorrow.  Andy thinks.  The wheels are spinning.   George, you won't believe it... I got Andy to do all the old material!  And he's killin' them!  Inside, there's HUGE LAUGHTER.  George's eyes widen. Piqued, he goes in...",
        "Friedman": "",
        "Besserman": "",
        "Wiseass": "So I'm getting my mother-in-law a special Christmas present: A pre- paid funeral!  The mortician asked me if I wanted her buried, embalmed or cremated.  I said, \"Make it all three!  I'm not takin' any chances!\"  Thank you.  Good night! The comic waves and exits.  APPLAUSE.  George politely claps.  A PIANO PLAYER jumps in with an upbeat show tune.  We think there's a break... when Andy suddenly, awkwardly steps on stage.  He is in character as Foreign Man.  Pink jacket, tie, hair slicked back, frightened like a deer in headlights.  He puts down his big case, pulls out various junk, and arranges it on chairs.  The room hushes, uncertain as to who the hell this guy is. Andy tentatively grabs the mike.  The stagefright is agony.",
        "Comic": "So I'm getting my mother-in-law a special Christmas present: A pre- paid funeral!  The mortician asked me if I wanted her buried, embalmed or cremated.  I said, \"Make it all three!  I'm not takin' any chances!\"  Thank you.  Good night! The comic waves and exits.  APPLAUSE.  George politely claps.  A PIANO PLAYER jumps in with an upbeat show tune.  We think there's a break... when Andy suddenly, awkwardly steps on stage.  He is in character as Foreign Man.  Pink jacket, tie, hair slicked back, frightened like a deer in headlights.  He puts down his big case, pulls out various junk, and arranges it on chairs.  The room hushes, uncertain as to who the hell this guy is. Andy tentatively grabs the mike.  The stagefright is agony.   Hi.  Um, we were supposed to have Andy Kaufman on our show this week - - but now our producers aren't sure if it's such a good idea.  Some of us at Saturday Night Live think Kaufman's a comic genius.  But others disagree... they say he's just not funny anymore.  So we're putting the decision up to you.  Please call up and vote.  To keep Andy, call 1-900-244-7618.  To DUMP him, call...",
        "Diane": "",
        "Barnett": "",
        "George": "He is astonished.  George cannot quite figure out what's going on... but he wants in.  He waves Budd over.  Budd leans down, and George WHISPERS.   Pst.  What's the story with this guy?   He does a hell of an Elvis.   Hey, I really enjoyed your set.   So I understand you're from Lithuania?   Caspiar?  I haven't heard of that.   Oh.  Hm.  I'm uh, sorry.  Well, look, I'm probably out of my mind -- but I think you're very interesting.  If you ever need representation... we should talk.  George hands him a BUSINESS CARD.  Andy reads it -- then his eyes pop.  He DROPS the accent.   Caspiar, huh?!   People love... comedians.   You show a lot of promise... but... my concern is I don't know where to book you.  You're not a stand-up... your act doesn't exactly translate to films... help me... where do you see yourself?   Yeah, ha-ha.  That's funny.  Andy dips his silverware in the water glass.  Two dunks, then he dries it with his napkin.  George stares, perplexed.  He looks back up -- and Andy's booger has suddenly switched nostrils.  Huh?   You're insane.  But -- you might also be brilliant. Alright, Andy... let's do it.  George warmly extends his hand.  Andy slowly smiles, then takes George's hand.  The men shake.  A moment of supreme importance.  Sammy, opening for David Brenner is a fine gig.  You'll be on the road... get some exposure...  O.S., a SECRETARY shouts out.   Who?   Oh.  Sammy, think about it.  I gotta go.  Hello?  George Shapiro here.  On the phone, a STACCATO, ABRASIVE NASAL VOICE blares.    Er, yes.  Speaking.   Can I help you with something?    Who is this?  Look... I don't know what your problem is...   Andy, c'mon IN!  Thanks for flyin' out here!!   That's... terrific!  But I got something better.  This is BIG... (giddy; milking the moment You are getting a once-in-a- lifetime, unbelievably lucrative opportunity to star on... a  And this is a CLASS ACT!  It's the guys who did the Mary Tyler Moore and Bob Newhart shows!  It takes place in a taxi stand!  And you're gonna be the Fonzie!   NO!  The Fonzie!  The crazy breakout character!  The guy that all the kids impersonate and put on their lunchboxes!   HANG ON, you ain't heard the best part!  ABC has seen your foreign man character, and they want to turn him into -- (he checks his notes \"Latka,\" a lovable, goofy mechanic!!!  Long pause.  Then -- Andy responds.   \"No\"?  \"No\" to which part??   Andy... this is every comedian's dream.    B-but, this is classy... they did Bob Newha--   You have to do it.    LISTEN, you arrogant putz!  I've been in this business for twenty years!  I know!  If you walk away from this opportunity, you will never, NEVER see another one like it again!!!!  Long pause.  Andy stares at George, amazed at this passion.  Then Andy gets up and looks around the office.  He stares at the awards... the gold records... emblems of success and experience.  Andy thinks -- then nods.    Of course!  That's what negotiations are for.  Andy starts to write on a piece of paper.   What are you doing?   Are you makin' fun of me --?  This is RIDICULOUS!   They're IMPOSSIBLE!!  Jesus! (he points at one item I mean -- \"two guaranteed guest shots for Tony Clifton\"??!  Who is this TONY CLIFTON?!   This Clifton called me up.  He's a loon!  He HATES you!  Mr. Kaufman will only appear in half the episodes.  Mr. Kaufman requires an undisturbed 90 minutes of meditation prior to filming.  Mr. Kaufman won't rehearse.  Mr. Kaufman gets his own network Special.  The execs are stupefied.  Finally -- George delivers the clincher.   And Taxi must guarantee two guest appearances to... Tony Clifton.   Tony Clifton.    I don't know.  Long pause.  The execs stare at George like he's lost his mind.   But Andy says he's fabulous.  He also says, these are the terms.  The execs' leader, MAYNARD SMITH, shudders hopelessly.   Andy?   Eh, hi, Andy.  Look, this Tony Clifton... is he performing anywhere?   That's alright.  Where...?   Alright, I'm here.  What do you want?  Tony puts down his fork.  He pauses... slowly turns around... and is Andy.  George GASPS.  His eyes bulge.  Andy smiles innocently.  He gestures to an empty seat.   I... I-I don't understand this act.  Yeah?  Well tell that to the poor schlub who you humiliated!  Beat -- then Bob strolls over.  His real name is BOB ZMUDA.   So your name's not Gorsky.   This has to stay in the room... but here's the thing: Andy is Tony.  And Tony is Andy!  They'll deny it up and down, but I swear to God, they're the same person!  It's smart business!  You'll get two Andy Kaufmans for the price of one!  Maynard thinks about this, quite methodically.  A beat, and then he cracks a smile...   Andy!   Andy... THEY SAID YES!  They agreed to it all!  They thought your terms were a shining example of your \"irreverent wit\" -- and precisely why they want you!  You're getting EVERYTHING!  Whoa.  Andy looks up, astonished.  His space station EXPLODES, but he doesn't notice.  He turns to George... and slowly smiles sweetly.  Genuinely.   (worried at this response  No... eh, the Special  isn't all like this...  just wait... it will be  hysterical.  At that moment, the picture turns to FUZZY SNOW.  Maynard scowls.   No, um... it's part of the snow.  An awful beat.  Maynard is embarrassed.  Finally -- he explodes.   Hey!  Could you clear this table and bring me a piece of poundcake?  Andy turns.  They stare down each other.   Andy, this is ridiculous.  Take off that apron.   Look, I'm sorry.  They're assholes! But we work in a creative business. You can't predict what people are gonna like --    Tell you what.  I'll book you on some concerts, and meanwhile, we'll show the Special around... see if somebody wants to buy it --   You signed for five years --  So four years, seven months.   What kind of show was this??! (angrily reading off a LIST There were three-hundred walkouts! The promoter wants a refund!  Andy mumbles in a pipsqueak whimper.   You're DAMN RIGHT you're sorry!  And you -- you're the road manager! You should be watchin' out for him!   When you play the Midwest and South, you DON'T MINDFUCK THESE PEOPLE! It's not postmodern -- it's rude.  If you wanna perform in Texas, you give 'em Mighty Mouse!  You give 'em Elvis!!   And that's great.  But do it in LA and New York!  There you experiment! Show up with a sleeping bag and take a nap on stage!  I don't care!  Hmm.  Andy thinks.   I don't know! (he composes himself and lowers his voice to a hush Andy... you need to look inside: Who are you trying to entertain?  The audience... or yourself?   I'm worried about Andy.  His stress level is affecting his work.   Bob, Andy needs to RELAX.  See if you can get him away from all this. Take him to Hawaii, or Bali... Find something special.  Something nice...  Zmuda mulls this over.    I'm not sure how Andy's gonna take this...   But that's Tony down there.  That's not Andy.  Trust me, it's like \"Sybil\" -- Andy's nowhere on the premises!  Ed glares.    Okay.  But we'll have to warn Andy first.  I think he's up in San Francisco, doing a concert.  Heh?  Ed raises his eyebrows.   Hi, Diane, this is George.  I'm trying to reach Andy up in San Francisco.  Yeah, I'll wait.  Ed glances down at the stage... and suddenly Tony is no longer there.  He's magically vanished.  Beat.  George turns on the SPEAKERPHONE, then CLICK!  Andy's happy voice pops on the line.   Hi, Andy.  How's the weather up there?   I'm here with Ed over at Taxi. There's been some trouble with Tony.   There'll be other shots.   Ehh -- Andy doesn't really like playing casinos.  The audiences don't work well for him.    Really?!  You want Tony Clifton to headline Harrah's Tahoe??   Look -- I gotta be clear with you. Tony Clifton is NOT Andy Kaufman.    No, I'm serious.  If you book Tony, do NOT EXPECT TO GET ANDY.   Fine, be my guest!  Book him.   Gene, you misunderstood!!  You're not getting BOTH of them!  It's physically impossible!   Yeah, I KNOW what I said!  But -- trust me, it's not gonna happen!   You're so proud.  You're like some retarded kid comin' home from school: \"Look, Dad, I got an F!\"   \"Funny\"?  I dunno.  But \"intriguing\"... \"mindboggling\"... perhaps \"headache-inducing\"... sure.  Like, that moment, when you both came onstage...  Andy excitedly jumps up and down.   So you've got this big elaborate joke, which is really only funny to two people in the universe.  You... and you.    But what's the POINT?  How will any of this make you the biggest star in the world?  Hmm.  Andy contemplates this.   But I feel you're extending this philosophy to real life.  It's obsessive.  Nothing's ever on the level anymore.  A perplexed beat.   Merv Griffin has received 2000 pieces of hate mail.  Andy, Merv Griffin doesn't GET hate mail.    No, I'm not gonna take it.  If I take it I'll break my back.  He crosses his arms.  Andy frowns and lowers the weight.   Buddyboy, they detest you!  Next time you make an appearance, women are gonna picket.   WRONG!  You haven't given them any clues that it's a parody!   Andy, do you realize you don't do comedy anymore?  Where's that sweet guy who used to do (he SINGS Mighty Mouse \"Here I come to save the day!\"?  Please, enough with the wrestling! You've lost touch with reality!   He is the Southern Heavyweight Champion.  He'll kill you.  First, you piss-off women.  Then you piss-off the South.  Then you get killed!  And I did the bookings.  Andy shrugs, lacking a response.  He eats more cake.   Andy, look... there's a job I want you to take -- guest-hosting the TV show \"Fridays.\"  It's not so hot... but this is a great opportunity for you.  The show's live, they'll give you carte blanche, and you can get back to the business of making people laugh.  Andy gets a strange gleam.  He only heard one thing.    Yeah, he's just laying low, waitin' for his comeback. (he sees an article and winces God, listen to this!  \"It was morally wrong to take advantage of such an unstable individual...\"   Thanks for seeing me on such short notice. (he takes a careful beat I... I wanted to talk to you about booking Andy on \"Saturday Night Live.\"  Lorne Michaels squirms uncomfortably.  He chooses his words.   We agree completely.  Andy has to reconnect with his core audience.  So I got him on Letterman tonight.  He's gonna apologize to Jerry Lawler, then repent for all his bad guy shenanigans.  Lorne Michaels mulls this over.   He's very sincere.  And he needs your show...  Beat.  Lorne Michaels nods.   And this wasn't \"Merv.\"  This was the hippest audience on television.  They've turned on you.  At that... we reveal that SOMEONE ELSE is sitting next to Andy.  But only the back of his head is visible.   It's like you two guys wanted to destroy Andy's career!  Upsetting all those people... putting out that toxic venom...  What did you THINK would happen?!   You're BLIND!  There is no envelope anymore!!  It hurts me to say this... but there's only one solution --  I don't want you two to ever work together again.  We WIDEN...  And the other person is JERRY LAWLER.  He feels bad.   Andy!  You don't get it!  They don't want you back.  Andy's face drops.   Andy... it's me.  I've got some crummy news.  Taxi's been canceled.  Silence.  Andy has no response.  GEORGE  (cont'd) Do you want me to come over?  Talk about it?   Hey, what's going on here?    Why...?  Andy, why...?    Andy, they don't think you suck. They've just... lost a reason to love you.  The guys stop walking.  George gently speaks.   You've gotta make the public embrace you again.  You have to win back their sympathy...    Excuse me -- but could Andy tell us why we're here???  All heads turn.  A long pause.  Then -- Andy stiffly speaks.   FORGET IT.  It's in terrible taste! I want nothing to do with this.  Pause.  Lynne is puzzled.   That's ridiculous.  You don't even smoke.   Andy... you look me in the eye, and tell me this is true.  Andy gulps.   If I find out you're behind this, I'll kill you.   Exactly.  That's the sort of thing you guys would work out to fuck me up.   What was that all about?   He's an actor.  I remember him in \"The In-Laws.\"  Ah.  Andy's eyes widen.  His wheels are spinning fast.   You must take a little pleasure in it.   Andy, you're surrounded by what you create.  You are the KING of negative energy.   So how can I help you...?   Do you wanna tour the clubs?   That's great... but this show's gonna cost a fortune.  Even if it sells out, you'll still lose eighty grand.  Andy smiles.   So who's gonna pay for it?    You know Tony doesn't have that kind of money.   Okay, Andy.  Will do.    You've got good days and bad days.  Andy softly sighs.    Yeah...  George silently pats Andy.  Andy's energy is sapped, but he forces himself to be upbeat.    I think we can sell that.  Silence.  George struggles not to shatter Andy's enthusiasm.  Andy smiles gratefully.   Did your -- doctor say it's okay for you to go back to work?    Really?   The Philippines?  I dunno... Andy... he sounds like one of your characters.   It's a perfect Kaufman audience.",
        "Shapiro": "Real working showbiz offices.  No glamour at all.  It looks more like an insurance agency.  George sits in his office, reassuring someone on the phone.    George jumps from his desk.  Andy is walking in.    GEORGE throws his attachй case on the desk, then slumps into his chair.  He picks up the phone and dials.    George is yelling at Andy and Zmuda.  They are seated on his couch, heads bowed in shame.    Andy is manically washing his hands.  Using liquid soap from the dispenser, then rubbing his hands under the water.  Then more liquid soap.  More rubbing.  Then more liquid soap...    George sighs at Zmuda.    George on the phone.    George stares glumly at Andy.  Andy is quite cheerful -- eating a big piece of chocolate cake.    Tight on Andy, staring at the LA Times.  A small headline says \"JOKESTER ANDY KAUFMAN VOTED OFF 'SATURDAY NIGHT LIVE'\"  He is bothered.",
        "Little": "Now, while continuing your deep breathing, slowly open your eyes. You should feel rested, relaxed, and alert.  The students all open their eyes.   Okay.  Anyone else --?   What is this stuff?   Andy!!  Shocked, they run over.  Tony lies huddled on the ground.  He mutters sadly, defeatedly.",
        "Wendy": "Now, while continuing your deep breathing, slowly open your eyes. You should feel rested, relaxed, and alert.  The students all open their eyes.   Okay.  Anyone else --?   What is this stuff?   Andy!!  Shocked, they run over.  Tony lies huddled on the ground.  He mutters sadly, defeatedly.",
        "Meditation": "The light is magical.  Soothing SITAR music plays.  Andy and fifteen other BAREFOOT STUDENTS sit on mats in a semi- circle.  Eyes shut, bodies in different yoga positions, they are all meditating.  Facing them on a throne-like chair sits a reverent, Indian YOGI.  At his feet is the class teacher, LITTLE WENDY, a teeny lady with an absurdly high-pitched voice.    The Yogi slowly walks down the corridor, deep in thought.  A few DISCIPLES IN TURBANS mill around.    NINE STUDENTS, sitting in the Lotus position, are listening to a teacher.  The teacher is Andy.    Andy steps out.",
        "Student": "My mind is clear.  I feel great.   All the tension is gone from my body.  The Yogi's eyes go to Andy.  Andy smiles sweetly.",
        "Yogi": "Do any thoughts come...?   Good...   You always had a good heart.  But I'm proud of the progress you've made in your discipline.  Are you at peace with your family?   Goals are important.   We are all impressed.  Andy smiles beatifically.  This means a lot.   Yes.  Silence.   Excuse me, Andy...   This is very difficult for me to say... but -- perhaps it would be best if you didn't attend the retreat.   Yes -- we do not doubt your devotion to TM.  But we feel that perhaps... you and the program have grown apart philosophically.  Andy is stunned.    The wrestling... the sexist remarks... the foul language... these things are not becoming of an enlightened individual.  It seems you have no respect for anything.  Andy is stupefied.  He doesn't know how to respond.   It is apparently not working.    Andy, don't raise your voice.  We don't wish your presence here.  Andy is broken.  He fights to bottle his rage -- then notices Little Wendy down the corridor, peering helplessly.  Beaten, Andy waves goodbye to her.  Little Wendy gulps, then waves goodbye too."
    },
    "imdb_rating": "7.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNDI1Mjc3MzAtZDk0OS00OTZlLTlhZjktNzA3ODgwZGY2NWIwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "A biographical film on the late comedianAndy Kaufman. Kaufman, along with his role onTaxi (1978), was famous for being the self-declared Intergender Wrestling Champion of the world. After beating women time and time again,Jerry Lawler(who plays himself in the movie), a professional wrestler, got tired of seeing all of this and decided to challenge Kaufman to a match. In most of the matches the two had, Lawler prevailed with the piledriver, which is a move by spiking an opponent head-first into the mat. One of the most famous moments in this feud was in the early 80s when Kaufman threw coffee on Lawler on [error], got into fisticuffs with Lawler, and proceeded to sue NBC.—Eli Boorstein <uahp@rocketmail.com>",
    "name": "Man on the Moon",
    "genres": [
        "Biography",
        "Comedy",
        "Drama"
    ]
}