{
    "filename": "Miami-Vice_script.txt",
    "imdb_id": "tt0430357",
    "imdb_url": "https://www.imdb.com/title/tt0430357",
    "characters": [
        "Castillo",
        "Coleman",
        "Ricardo Tubbs",
        "Jose Yero",
        "Gina Calabrese",
        "FBI Agent Fujima",
        "Nicholas",
        "Isabella (as Gong Li)",
        "Detective Stan Switek",
        "Montoya",
        "Neptune (as Isaach De Bankole)",
        "Detective Larry Zito",
        "Sonny Crockett",
        "Alonzo Stevens",
        "Trudy Joplin"
    ],
    "dialogues": {
        "Castillo": "What's your twenty?  Turn around.  Grieve elsewhere.  You said Nazi Low-riders...?    ...I didn't want you around the crime scene because it's crawling with federal law enforcement.  We don't know who's straight up, who's not...     I mean full disclosure.      I got to know.  There is never any room for \"personal\"...  Good.  Okay. What'd you spot...?  He any good?  So what's gonna persuade Montoya to change off Sal Maguda running his deliveries...?      Then that's it. Change the mission statement. Crockett stays in.  He keeps working up the ladder.  The local importers get a pass for the time being.  Yes you do...  No, you don't, Jim. 'Cause if I close this down, you got nothing to make a phone call about.  And my guys don't have a week for a Feeb bureaucratic process.  Every hour longer they're in there, they risk exposure.  So, right here, right now, they're back in or I pull them out and close you down.  What's it going to be?      Where's the new drop point...?  What do you think?     They may have already, so we protect the living.  Proof she's alive?  Safe house is empty... Air Support's set to jump when we know your drop point.  Gina?  There's three between Miami International and the glades.  I'm gonna try for her, but this is triage.  Protect the maximum number of lives.  You need to know that...    ...eliminated one.  SWAT's on the next two...",
        "Coleman": "So...?    I got the item.        Deal.",
        "Ricardo": "",
        "Tubbs": "Maxin' and relaxin'.     Backup in case the Russians get physical.  Skin has to touch skin.  That's the requirement for the warrant.  Then he makes a credible excuse and he stops.... Her crew blackmailed and asset- stripped the last mark down to his social security...  So?  Damn, girl...     This is exciting...  Cooool...        If a coupla new exhaust manifolds show up...  He did volunteer one time...    Why?  And there's Dmitri...  Hello, Miss Ukraine...       What is it?  Stevens?                (incensed, over traffic     Alonzo...    They lied.      Yeah.  Quarter mile away.  We see the lights...    C'mon, man!  White gangs is tweakers and a crystal meth lab in a trailer park. Bounce around the old lady Saturday night and get your recidivist ass busted back...  Break your encryption?  Hack your e- mail?  Employee databases? Somebody on the inside?  As in, your ass is dead in the water.  Reverse undercover?  WE supply to them?  Aryan brothers are not going to change-up suppliers.  So...  Track with me, here... They knew the \"Russians\" were undercover Feeb?  They should have no-showed.  But, no, these guys show anyway, and commit murder upon federal officers.  And steal all your money... What does that say to you?    I was the kids' godfather.  \"And\" what?  And the answer is \"yes.\" Before she met Alonzo, once upon a time, a long time ago. You bet it was personal.  Sal Maguda.  Oh, yeah...     Yeah?  Okay.  Only Jean-Louis and I do the talking...  Comme on dit...   Que faisons-nous?  De qu'a-t-il l'air, fou!  Nous voulons tous votre drugs. (What are we doing?  What's it look like we're doing, fool?  We are stealing all your dope.                So lay it out, my brother...  And we didn't come down here to audition.  Business auditions for us... ...and know who we are and know they want their load run by us before Nicholas calls.  You wearing a wire?  People gonna walk into this place and say, \"Ola, hijo!  That some crazy wallpaper.  Whew...it wild! Is that a Jackson Pollack?\"  So we can close each other's eyes right now.  Real easy.  Real fast. But, then, nobody makes any money...  Slow and low, Adam A-500s... ...carbon composite, stealthy, 1400 nautical-mile range, thousand ki payload...all the way to Caravels and 727's from a source country to a transshipment point.  Small freighters.  We've done containers...  What kind of weight?  What you get from us is a date.  A place.  \"In the parking lot of a Jack-in-the-Box in north Miami.\"  At such-and-such time, an eighteen- wheeler will be there.  Keys in the ignition.  Ready to roll.  You pick it up.  And you drive it... ...away.  And violence is extra.  And expensive.  So how much weight you looking to move?  What happened to the last transporter you had?    Then what were we talking to you for?  What do I care what you think about how he looks?  You wanna fuck my partner or do business?     ...Sonny can wait.  Anything?    Reality TV and stay by the phone. That's what all wives-in-crime do...     Where we meeting 'em...?  Five minutes...  ...show time.      They watching us watching them watching us waiting for them?  Or what?  That's it.         We'll have room service wipe up the furniture...and bring drinks.  Define small.                             Thank you.          You okay?  You sure?  Nothing.  Calling to say hi... What's up with you?  Okay...see you soon.    What flowers?  There a note?  What's it say?  We're on our way...    Good idea. We'll grab a bite.          To the limit.  Like...?  No. You gonna give me phony reassurances?  Good.  So let's go...  Heads up...  That's slick:  Neptune's Escalade's worth more than the real estate. But no one's supposed to notice his drive-by?      This the load you lost a while back?    You don't like us finding your load?  We can go and lose it all over again...    And as an investment in the future...  It's yours cause what's yours, is yours.  And what's ours is ours... ...like the second ten-percent, which is now due, Yero, my ace.  What's up next?  Or is this a one- time deal?  Conveyance?    Can I talk to you for a second, partner...?    ...secure satellite comms. encrypted e-mail, the longs and lats for the transshipment point...all that?  It's all cool. But I need a vector, not a location.  'Cause ships move. That's why they call them ships. Ship stops?  It's trying to be an apartment building.  At sea that attracts attention.  That's bad...  Where the hell are you, man?       Where'd you go?  Where?  Verdado where?  Havana, Cuba...?  ...where you're makin' a move on the wife of Archangel de Jesus Montoya?  You're not makin' a move on her...?  Oh, that makes it okay, then.  His operations are kingpin size and first-class.  His security is ex- Eastern bloc, ex-SAS and Israelis. Their comms are satellite uplink with mainframe encryption, significant Sig Int and in their zones of activity, they have signal- jamming capability...  And what does that level of spending on first-class, private- sector infrastructure signify to you?  Their loads are poly-drug.  \"E\" from Holland, methamphetamine precursors from Jordan, Afghan \"H.\" Mid-ocean transshipments.  His real business is:  he's a network.  So we want to change-up the mission statement.  He's talking to you, bro. What he means to say is he is reluctant to abandon the penetration of a major narcotrafficking organization...  Chill out Sonny.  With Sonny.  110%.       There is \"undercover.\"  And there is \"Which way is up?\"  I am asking.  You to me.  I would never doubt you.  And do you doubt I will slot anyone complicit in the death of Maria, Alonzo and those children? Anyone...whoever they are...         Uh-uh.  No predetermined places and times to meet.  Give me their heading and radio codes and I will talk to them directly with the longs and lats and time which will be a last minute deal...  At ten to three on the 27th, I will satellite page him with a website and encryption code.  He will have ten minutes to log on and receive his new heading.  Ten minutes and thirty seconds, website disappears and he can drive his fucking boat up to Iceland...  Importation value?  At twenty-two thousand a ki...  And José, my ace, lots of transshipment.  Lots of action. Skies are crowded.  And the JIT has assets on land, air, and sea. So any intel you got that can come our way and contribute to the good and welfare...?   What's the point?  It's going down.    Yeah.  Whatever...    Meaning...?  They'll kill Gina.       They're proving it's right now. And that she's alive right now...     Smell.  Bad smell.  Trailer... She's allergic to diethylene...she in a meth lab?       Trudy and I are goin' for Gina...      Asian Star...                     He's dead!",
        "Jose": "",
        "Yero": "Sit.  Nicholas said you okay.  That's nice.  But how I know if you any good?  Who you run loads for?  Cause other than Nicholas, you knows you?    We don't talk weight.  We talk logistics.  You get longs and lats for the pickup.  Open ocean.  You run it in.  On shore, our people receive the loads.  You afraid of violence?  Nothing.  'Cause how you do delivery on the beach, I don't like.  Maybe this does not work.  What do you care?  (doesn't answer, leans   I had to lay eyes on you.     Wait by the phone. You get a call.  Or maybe you don't.  Until then, piss off back to where you come from...  Client got delivery.  But there were...\"extras\" in the back of the truck.  I do.  We don't do business with him...  I'll be there.         It is.  He try to take tonight's load?  And what do I do with him?       What'd Neptune tell you?  (whispers in Spanish to            Transshipment point is here at 17:00 hours on the 23rd.  You give yours to me.  We position all the assets hauling our loads...  Malaysian registry.  Small containership. Give them their codes and heading.  Fifty-gallon drums.  Thirty-two.  A hundred kilos in each.  You transship that to the Malaysian boat.  You work that out with La Senora. You will get sixteen fuel bladders of crystal meth precursors from the Malaysian ship.  For collection in North Miami.  You warehouse it. Release it when we say. I'm sure you have friends with fast boats...  Sure.  Check your e-mail.              He didn't like pilots.        And put eyes on her.  Put eyes on her twenty-four hours a day...    I confess I have succumbed to my weaknesses.  An inability to see another's point of view. I've discussed it with professionals.  Even with one of your friends.  She's here now...    Mrs. Rico.  But don't worry.  She is safe.  To insure that, I am keeping her close to me.  It's always good to keep people your friends care about close to you.  So, I will tell you when you're 10 minutes out where to drop the load into the hands of my people.  You have 35 minutes to enter Government Channel.  Head up the River...  We will watch you.  Then I will call you. And you can reach out for La Senora in Barranquilla or wherever 'cause I don't give a shit...  'Cause she will tell you.               Go!",
        "Gina": "This I gotta see... ...the \"make up an excuse and stop\" part.  I have faith.  In horoscopes and fortune cookies...  Switek pulling this off...?  That's not faith; that's delusional...  Only African he ever \"relocated\" was a $2,000-an-hour Nigerian model for Gucci, and he got wounded when she took an NBA draft choice to the Super Bowl instead of him...  Oh, bullshit.  She cops his joint. He pushes the button.       You're so not the PD, if you got busted on a DUI, you're in serious trouble...you're bad men back to grammar school. San Quentin.  Pelican Bay. Marine Corps.  Statesville. Pelican Bay, where you guys hooked up.  Now you're too smart and too fast to get jacked again...  If they ran the rental car or lease on this place...even if it's EPIC database in El Paso...they'd have to work through the layers of bullshit three weeks deep.  Then they'd find your deeper, hidden criminal selves...         Be...careful...  You hear me?  Hello...?  Yeah.  Yes.  What's up?    Bored.  ...and thanks for the flowers.  The bouquet, here.  Five-hundred dollars worth of roses...yellow.  You mean with the flowers...?  \"Salutations from the south...\"  I...I thought it was from you.            ...the lease, the phones, the cars...layers of false ident. Would take the FBI weeks.  How long did it take them?  Three hours? Four? This means, \"We can reach out and touch somebody.\"  Like Bad Teleflora.  (leans in; holds his hand     What's up, Sonny...?                           ...nice friends you got.  Trailer trash with a bad smell...          Motherfucker!",
        "Calabrese": "",
        "Nicholas": "You know.  Same old...     It is fortuitous that you called...",
        "Montoya": "Please take that seat on the side...        More than I, in finance and business, she is very dangerous.  I look forward to our doing work together.  Whether we do or not, it is unlikely we will meet again.  So I extend my best wishes to your families... Particularly to your beautiful wife. Thank you for making this long trip to see me...    Precursor shipments from Ras Tanura and Ju'aymah?  Not French registry?  José doesn't like the deal in South Florida...  But what does your intuition tell you...?  And...?  Why?  That's my girl...  On the next load, José wants to front them silver.  But they them in lead... He thinks they are wrong.  What do you think?    Let's try a few runs with these partners, I think.  I will tell José...        José, about the Americans...",
        "Sonny": "",
        "Crockett": "Nothing.  What's our deal?  How lucky's Miss Universe gotta be?  Have faith.     No shit...?           Gin and Tonic.  Plymouth or Boodles.  Lemon doesn't go in Gin and Tonics, darlin'.  Where ya' from?  You in Miami workin' on your complexion...?  Doing...?  Really?  I did refugee relocation in Somalia.  But they transferred me out after I was wounded...  The honey trap.  And there's the honey.    Yeah...?  Yeah.  On the phone.      Who is this?     I don't understand...  Alonzo, what's goin' on?!  Where are you?  Alonzo...!  Alonzo...      I said, \"emergency.\"  If he's not reachable, who's running the weekend?  The ASAC?  Listen carefully.    (waits, then hears a click  Detective Crockett.  4-4-7 Charlie 12-92.  A C.I. we cut loose to your Joint Interagency Task Force.  Name of Alonzo Stevens.  Now, he's YOUR informant.  Stevens, called us.  I haven't spoken to him for six months. I do not know what case you have him on.  I do not know what he is talking about.  But whatever he is doing for you, it sounds like it is going bad.  Right now...  How do I know? I got the call from Alonzo on an open line.  That is the hand we have been dealt at this moment, at eleven-forty-seven o'clock Friday night.  Okay?  I am trying to alert you, here. You know whether or not...you have a thing goin' down.  I do not. But we know this guy.  I think you know this guy.  Normally, he is cool.  Tonight he is distraught. That is atypical.  That engenders foreboding.  Do you understand the meaning of the word \"foreboding\"? As in badness is happening to your deal right fucking now?  \"Buy and walk\"?  \"Buy and bust\"? \"Reverse undercover\"?  What?  And the deal goes down at another place at another time.  ...so there's no industrial- strength HRT weapons team out there tonight?  OMGs, Mongols, Nazi Low-Riders, prison gangs?  He is saying they had him from the gate.  He is saying to my partner and I and to his family \"goodbye.\" What does that tell you?           How'd they get onto you?  They been known to do that...      White gangs...?  It doesn't track.  How?  So what do you want?  Recruit us to do what?  How do we do that?  Make a buy? That went well...  From whom...?  Never heard of him.  Transpo?  How they bringing the loads in...?     Blow that up...  We could try to run loads into these guys. Run a few loads for Montoya into South Florida.  Into this group.     Three wakes off the back of those boats.  Who runs three Sterling engines off a deep-V hull?                    We're from Nicholas to meet José...     Sonny Burnett...this is my partner, Rico.    What...?    That way we do not waste AvGas or our motherfucking time.  (goes right up in Yero's  Or DEA?  The Feeb?  \"No, viejo.  That was José Yero, splattered all over his motherfucking wall.\"  And specialize in very fast go-fast boats for coastal runs.    Money thing is done in advance in places where there are no guns. Because when money and guns get together, there is violence...  I am not John Wayne.  There is no \"S\" on his chest.  We get down if the play calls for it.  But we are into business and making money.  Then it don't work.    And...?        Nothing.  Hi, Gina. This is from Frick and Frack. Trudy?  Satellite.  New encryption. Supposedly sharper than the G... How good's our background?  How will it stand up?  Port-Au-Prince.  What do we got?            Who knows...         Really?  So, what is this, a party?  Glad we came.  This place is a lot of fun if you're Doctors Without Borders.  So...?  I thought we had to meet the Man.  When?                                                      We set.  You worried about the tree line, US Customs AWACS, or something else on your mind?  Gina in the Miami pad. You gonna give me phony denials?  No.           Neptune gonna show?    Here's another incognito genius...     \"Extras\" tried to relieve us of your weight... And by the by, you know of a player in Overtown who goes by the name of \"Things Aquatic\"?  He tried to...\"do business\"...with you.  Around ten.  His place.  Be there.  Look familiar?   Yeah.  How 'bout this?  How'd Neptune know where to hit us?  Huh?  Whose Op sec's got a leak?  Yours?  He didn't.  Interrogation's not in our skill set. So c'mon, what suspicions have you master-minded off these associations?  Okay.  Nothing.  Nothing.  As in \"free, gratis.\"  A fine...business...relationship...    Let me buy you a drink.    It goes very fast.            Where's that?  The Keys?  Havana?  Cubans don't like us or my business...        Light touch.  Everything comes to you through the wheel.     How do we get into Cuba?!  You do business in Cuba with your husband?  Were you born in Havana?  Where's she now?  Your father?  How's he not your husband?           I dance...                         No.        Died in childbirth, having me...  You know how improbable this is...?  ...'cause we have no future...are of today and not tomorrow.  ...and therafore there is no consequence?       ...and a different kind of deal.  Like \"three thousand a ki?\"  That's nice. And I can supply the transportation into South Florida and the Gulf, more reliable and on-time than FedEx.  But, three per ki was OK for openers.  Cost less.  That's the point.  What do you mean?  Better than that. We become partners.  Only in this territory and only on loads we run. And you don't pay us three thousand a ki.  You pay us zero.  Why we get is thirty percent of the load. Product or cash.  \"And why,\" you're thinking, \"would I be crazy enough to out in these gringos like that? Is he chipping?  Crazy for my love? Too many mojitas?\"  And the answer is, \"of course\" but also \"no.  It is because Sonny can deliver what no one else can.\"  Zero risk.  'Cause we guarantee every load. Anywhere, for any reason, it comes up short, we make good.  Your operations will, from now on, run risk-free.  Then I would say to you, this has been fun...  I need thirty.  Calculate in, also, the cash you don't have to front...  Twenty-eight-point-five.  I would say you're... ...four percentage points away from a deal...  We'll do it at twenty-two...  ...and now what?             Hit a couple of jazz clubs.  Fell back to her place.  Verdado.  It's in the suburbs outside Havana.  No.  Havana, Louisiana. Don't we have a meet?  No.  We're makin' moves on each other.    Montoya.  We went to meet the village priest.  It turns into Alice in the fucking Vatican and here's the Pope...of the North Valle Colombia dope trade.  Yeah.  CIA-level stuff...  Mega-tonnage and mega-cash flow...  Haiti and Puerto Rico.  Money through Dubai and Geneva maybe.  And we can illuminate part of it from the inside out.  Keys to the boat.  Go do this motherfucker yourself.    We're the ones doing the death- defying shit?  And he wants us to give that up?  For what? A chump-change bust so he can get his picture in The Miami Herald to impress the slug farm in DC...  I'm my own man.  And anytime you want to see how much man I am?     As in...?  You think I am in so deep I forgot?  Do you believe...I have forgotten I am a cop?  No, I do not.     Hola, chica.     Now how we do it, blood.  It risks signal interception and other bad things like people who don't need to know where we're at knowing.  Packaging?  If you see a few new faces, don't get jumpy...   And the chopsticks and fortune cookies?  They're all the same.  \"Financial security is around the corner.\" \"Your friends love you.\"  Do you have assets somewhere else? Bank accounts?  ...to fall back on.  You know, a fail-safe.  Insurance.    Something like that.  The odds catch up with you.  The odds are like gravity.  You can't negotiate with them. So...at some point, you should cash out, take your money and run...  Sure.  As far away and as fast as you can.  Whenever.  Maybe later, maybe sooner.  Of course.  Zanzibar.  The Comoros Islands. Somewhere in the Indian Ocean. There's twelve-hundred islands there...    A few more moments, still in this business.  Then I'd find you.  ...in the morning.      Go ahead.  Switek?  What's your take?  Call the US Coast Guard:  \"Come and arrest our ass.\" And Switek resumes romancing Miss Ukraine...  Then you should.     Yeah?    What friend?  Proof of life.  How do I know Mrs. Rico's alive?  Yero doesn't know she's here!  Yero, by himself?  Dump the rest.  Let's get the boats up that river.     José Yero changed-up the drop plan on us.  He's grabbed Gina.  They'll have surveillance on us. We'll know only at the last moment...  It's a rip and a hit.  You can't.  Supposedly it's coming.     Just came in.  She's still alive.                    Isabella!!                                Touch the windshield with your hands.  Let 'em see your hands are empty.  Steady.  Yeah.  Hey, Robert.  Yeah.  Going to Miami General. Check out Gina.  Everybody's okay. Everybody's fine...     Isabella...?  No.     No part of it wasn't real.  It still is.  I'm so in this, I don't know which way is up... All I know is I won't let anything bad happen to you. Just like I said. And I know we can't ever see each other again.  And we never will.  Luck ran out. This was too good to last.",
        "Alonzo": "",
        "Stevens": "Sonny...?  Where's Riccardo?  I'm sorry.  I'm sorry, Sonny...       They had me from the gate.  I gave up nothing on you guys. Don't worry.  I kept you and Rico out of it.  Only the Feds.  They're on their own...it's all their deal, anyway, so fuck 'em.  After I check on Francine and the boys, then I'm gone.  Sonny, tell Rico I'm so sorry.  I wanted you to know...  ...look after her.  Ask Rico to. Okay?  Do that for me.  I had to do it.  They had me from the gate. Do that.  Whatever you can do for them.  Okay? Look what I did to them, Sonny...!  Goodbye.      The Feeb gig was I front a coupla undercover, Russian-speakers to them.  One's ATF.  And broker the deal.  Set up the meet with the NLR types...    How do I know?  But it was from the get-go.  Knew the FBI had run me into them. Sonny, I gotta go...!          What...?  They said they wouldn't hurt them, wouldn't hurt them if...",
        "Trudy": "That's impossible.  Because you cannot kill him.    You're giving away your money, fool...  What's so fucking difficult?       April Fool, motherfucker.            Too fast.  Too many moving parts.  If we were for real, and knew our shit, we'd fade this one...       They grabbed Gina...  Gina.  Like Alonzo's wife...  Cochi Loco's got her.                  (as she's aiming her Car-",
        "Joplin": ""
    },
    "imdb_rating": "6.1",
    "description": "Ricardo Tubbs is urbane and dead smart. He lives with Bronx-born Intel analyst Trudy, as they work undercover transporting drug loads into South Florida to identify a group responsible for three murders. Sonny Crockett [to the untrained eye, his presentation may seem unorthodox, but procedurally, he is sound] is charismatic and flirtatious until - while undercover working with the supplier of the South Florida group - he gets romantically entangled with Isabella, the Chinese-Cuban wife of an arms and drugs trafficker. The best undercover identity is oneself with the volume turned up and restraint unplugged. The intensity of the case pushes Crockett and Tubbs out onto the edge where identity and fabrication become blurred, where cop and player become one - especially for Crockett in his romance with Isabella and for Tubbs in the provocation of an assault on those he loves.—achinn",
    "name": "Miami Vice",
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjczZTMyNGMtMWYyMi00YjRlLThlMzAtOTJmY2ZkOWJmNzlmXkEyXkFqcGdeQXVyMTcwOTQzOTYy._V1_QL75_UY281_CR0,0,190,281_.jpg"
}