{
    "filename": "Midnight-Cowboy_script.txt",
    "imdb_id": "tt0064665",
    "imdb_url": "https://www.imdb.com/title/tt0064665",
    "characters": [
        "Towny",
        "Sally Buck - Texas",
        "Woodsy Niles - Texas (as Gil Rankin)",
        "Little Joe - Texas",
        "Annie - Texas",
        "Old Cow-Hand - Texas",
        "Ralph - Texas",
        "Mother on the Bus - Texas",
        "Joe Buck",
        "Mr. O'Daniel",
        "Shirley",
        "Ratso",
        "Cafeteria Manager - Texas",
        "Cass"
    ],
    "dialogues": {
        "Towny": "Bravo...  ... TOWNY -- a stout, round-faced man -- clasps Joe's hand between both of his own, like an old friend.   How are you?  Townsend P. Locke, from Chicago. Call me Towny. I'm here to attend a paper manufacturers' convention and, frankly, to have a little fun, dammit...  Towny grips Joe's elbow, almost forcibly leading him away.   This is my first night in town and I'll consider it a ghastly omen clouding my entire ten days, if you don't consent to have dinner with me. Anywhere you like...  Towny's mouth continues speaking at an incredible rate, but his words are drowned out momentarily by the grinder of a sanitation truck, chewing up a discarded Christmas tree with tinsel clinging to it. Towny is still talking when they've passed the truck.   ... never mind how you're dressed. They know me. I'll say you're with the rodeo. There's always a rodeo in New York, dammit. Besides, you look very elegant...   But, dammit all, I just remembered, we'll have to eat in my room because I have this phone call coming at nine-thirty...    An ancient open cage lift.   What I like about you, you're such a wonderful conversationalist. So won't that be nice to have dinner sent up?    A threadbare, carpeted but spacious hallway.   Fifty years ago this was the only hotel in Manhattan. My mother always calls me at her bedtime, so I've got to be there.    The room has little to recommend it except its size and large French window, through which -- ignored by Joe -- the Mutual tower flashes MONY. Towny waves Joe toward the couch, quickly slipping several physical culture magazines from the coffee table onto a shelf beneath.   A drink? I've got some nice gin. If you'd prefer something else, they'll send it up...   It's so exciting. New York. The mad forward thrust of everything. My sense of time here is completely altered.    The coffee table is littered with empty cartons of Chinese food, soaked through with brown sauce. Joe finds the last egg roll and eats it as Towny's voice drones on.   Sometimes it seems to me time stopped twenty years ago. There was this war, there was this handsome young man with quite black hair and he was supposed to die. But he didn't. Isn't that amusing?   Enough about me. I'm through talking for the evening. Now I want to hear about conditions in the West. The romance of the West holds a tremendous power over me. Mother was actually a pioneer woman, can you believe it? When she calls, I'll introduce you and she'll be so thrilled.    Towny's voice is only a shrill monotone from here, Joe searches with increasing desperation for something of value. An old electric razor is too bulky for Joe's pocket, probably worthless anyhow. Towny's array of medicines merely recalls Joe's purpose.   Mama, a coincidence. Guess who was being discussed. Discussed. Not disgusted. Discussed! Do you have that thing turned up? Why aren't you wearing it! This is impossible!    Joe is rehearsing the speech in the bathroom mirror.    Towny is stretched out on the couch, staring morosely.   I was so childish with her.  Joe moves into frame past camera, standing in front of him, so that we can see the scene from behind Joe's waist.   What?   Oh, difficult, it's so difficult. You're a nice person, Joe -- I should never have asked you up -- a lovely person. Oh, how I loathe life. I loathe it. Please go. Please.   No, yes. No, I mean yes please go. Help me to be good. Come back tomorrow. Promise.   This is terrible. I meet someone who -- then -- wait, I want to give you a present. For your trip. You'll let me please...    Joe's face is puzzled then angry as Towny takes a Saint Christopher medal from his sack and hands it to Joe. His eyes are looking past Joe, his speech out of sync.   Please take it. You don't have to be Catholic. Saint Christopher is the patron saint of all travelers. I want you to have it. For helping me be good.    Joe's voice is angry.   Oh. Yes. Of course. I should have thought. You shouldn't have to ask. That was thoughtless of me. Yes. Wait here...  Towny hurries across the room to the bedside table. Beside the telephone is a picture of a prosperous pioneer woman wearing a hearing-aid. Towny tries to conceal his movements as he takes a wallet from the drawer, lifts out a bill and tucks the wallet back and turns -- terrified to see Joe close behind him -- almost knocking the lamp off the table in his fright. Pressed against the table, protecting but calling attention to his wallet, Towny holds out the bill.   Here. Don't even thank me.   I simply don't have it, Joe.   You're wasting your time. There's nothing in there.  Towny clutches the table, staring at Joe, shaking his head like a bad little boy. Joe backhands him angrily. Trying to duck the blow, Towny stumbles and slips to the floor, but grabs the table in his arms, watching Joe out of the corner of his eyes, whimpering. Joe grabs his hair, turning his face up.   I deserved that, I know I did.  But he clutches the table wildly. His mother's picture falls unnoticed. Joe stands in panic, sickened, unable to fulfill the role Towny has assigned him.   I brought this on myself. I'm bleeding, my nose is bleeding, isn't it?  Towny's eyes shine, teeth clenched in a crazy smile, blood trickling from his nose. Suddenly Joe jerks the lamp free of its socket.    Towny's shrill little whisper says...   Thank you, Joe.  ... provoking Joe to glance back. Towny is reaching for the telephone, his eyes on Joe with wild brightness, holding his hand on the receiver. Joe knocks the phone from his hand, hits Towny in the mouth, jerks the cord from the wall as Towny falls -- gagging -- finally dislodging his dentures on the carpet. Joe stands sick and confused, holding the useless phone in two hands...    ... Joe is about to hang the dead receiver on its hook when on sudden impulse -- he shoves the small end of the receiver into the toothless mouth of the man on the floor.",
        "Joe": "Y'all,line up and take your turn...   Yeah, where's that Joe Buck?  ... continuing his song as he pulls up and zips his tight thighed black slacks, freezing song and image for CREDITS.   Yeah, where's that Joe Buck?   Know what you can do with those dishes? And if you ain't man enough to do it yourself, I'd be happy to oblige...  Joe picks up his suitcase, a portable transistor radio, walks away from the mirror, then pauses to run a comb through his hair, hook a cigarette at the corner of his mouth and strike a match on his thumbnail before he turns back for one admiring glance at himself in the mirror -- proud, exultant, ready -- freezing the image as CREDITS END.   Say, look, uh, I gotta have a word with you, if you got a second.   Don't guess. Just come for my day's pay owing and to tell you I'm heading East.  Joe tilts his Stetson as the Waitress appears at the door...   Lotta rich women back there...   Men, they mostly faggots.   Well, ain't no use hanging around here.   I got me two hundred twenty-four bucks of flat folding money...  He know what he can do with that chicken-shit day's pay. And if he ain't man enough to do it for himself, I be happy to oblige!   Tough tiddy, ladies, you had your chance.  From a high angle -- Joe starts his long walk toward the bus depot along the street of a small Western town struggling to urbanize itself. The click-clack-click of his boots is loud but somehow lonely The radio at his ear drones grain prices on the Commodity change. Joe's pace slows as he passes...   Care to get out your yardstick, gentlemen?  At the same moment, a recognizable variant of the \"Big Country\" theme blares loud.   This is a powerful mothah, ain't it?  Ignored by the driver, Joe rises and walks back to his empty double seat, glancing around to see what impression he's made on his immediate fellow travelers -- an OLD LADY in front of him -- a hostile young sailor with acne behind him -- two teeny-boppers flirting with Joe hysterically -- a PALE BLONDE directly across the aisle, smiling at Joe weakly.   Plenty more where that came from.   I only get carsick on boats.  But seems to me that's more the fish smell than the bouncing...  Joe realizes that her eyes are closed. Mildly depressed, he stretches himself across both seats and turns on his radio, finds only static and snaps it off. Further depressed, he examines his reflection in the bus window, squeezes a black head and runs the comb through his hair, picks a piece of tobacco off his tooth and lights a cigarette, watching the flame die in reflection, forgetting to discard the burnt-out match as he stares out at a vast lonely prairie, a solitary cowboy in the distance, a row of sharecropper shacks apparently deserted, a barefoot little girl motionless at the roadside, watching the bus pass. Through this, leading into the next scene, Sally Buck sings softly \"... if that mocking bird don't sing, Grammaw gonna buy you a golden ring...\"   Yeah, hell, yeah.   Light?  The Old Cowhand's \"thanks\" is lost in a fit of coughing as he inhales his first drag. He settles back, wiping his watery eyes on a faded bandana.   You throw in Sister Rosella and you got a deal, right, old timer?  Joe glances across the aisle. The Old Cowhand manages a faint, humorless smile.   Going far?   I'm bound for New York City.  The Old Cowhand reappraises Joe's wardrobe even more curiously.   Ever happen to come across a cowman name of Woodsy Niles? Friend of my grammaw Sally Buck...  The Old Cowhand considers, shakes his head. Joe leans back, laughing to himself.   Smoke?  The old Cowhand shakes his head, showing the rolled cigarette Joe lit for him. Joe nods, still bemused.   Nice talking to you, old timer.  Joe stuffs a stick of gum in his mouth, turns to wave at the Old Cowhand through the window as the bus pulls away.   Jesus goddam Christ, I ain't laughed so hard since I was out at Fort Benning, Georgia.   What? Oh, hell no. Motor pool mostly...  Kee-rist...   Gonna swing my lasso and rope that whole goddam island, yeah!   Up yours, lady.  ... but Joe leaves the lady on, savoring the expensive sound of her voice reading the stock quotations. Joe seats himself at the desk, pleased to find a postcard photograph of the hotel. He picks up a ballpoint pen, counts ten floors up from the street and marks a huge X -- THIS IS ME, then turns the card over, pen poised over the address blank.   After all them dishes are washed, what?   Then they bring some more dishes and I wash them and then I, uh, sleep some and then wash some more dishes and then I...   Say it, lover boy!   Die.   Well, you better just shake your tail, lover boy, and root, hog or die.  Joe rises abruptly, rips up the postcard and tosses it out the window.   Goddam if I came to this town to write postcards.   Beg pardon, ma'am, I'm new here in town, just in from Houston, Texas, and looking for the Statue of Liberty.  The delicate profile gives no signs of hearing. Joe follows her to the parkway in the middle of the avenue. There she stops and turns, neither friendly nor hostile.   Joking? No, ma'am. Oh no! I mean business!   You sure are a pretty lady.  The Rich Lady tries to frown, taken aback, blushing.   No, ma'am, I'm not.   Beg pardon, ma'am. I'm brand spanking new to this town, come from Houston, Texas, and hoping to get a look at the Statue of Liberty...   The Statue of Liberty.   Holy shee-it, this is a goddam penthouse you got here, Cass, a real goddam penthouse.   Say, Cass, I, uh, sure have enjoyed being here. Believe it's as fine a time as I've had in my life!   That's good, it is, cause, well I guess I didn't tell you why I came to New York, did I?  A tower of black bugle beads emerges from the closet door.   Don't know what line Morey's in, but myself now, fact is -- I'm a hustler.   Beg pardon, ma'am?   You sure you heard what I said?   Funny thing, you mentioning money. I was just about to ask your for some...  Joe tries to laugh but it sticks in his throat as Cass speaks -- an impassioned whisper -- still holding Joe's chin.   Hey. Hey, Cass. Did you think I meant that? Christ, would I be asking you for money with a wad like that riding on my hip?  Joe waves his wallet at her, but she only cries louder. He hands her a kleenex. She clutches it to her face, wailing. Joe leans over the bed, whispering in her ear:   Hey. You are a gorgeous-looking piece, Cass. Guy gets horny, just looking at you. It's a fact. How much you need for that taxi? Ten? Twenty? There you go.  Joe tucks a twenty-dollar bill into her bosom, tilts his Stetson and starts out. Cass blows her nose, looking after him. O.S. chorus sings, \"From this valley they say you are going -- we will miss your bright eyes and sweet smile...\"   Oh, it ain't cheap. I mean, yeah, I'd say this was an all right shirt. Don't like to, uh, you know, have a lot of cheap stuff on my back.  Ratso spits as JACKIE leans on the bar next to Joe -- a feminine young person, heavily made-up, hair teased, wearing earrings and a lace-trimmed blouse over shocking pink  levis.   Shee-it...  Kee-rist, you really know the ropes. Wish to hell I bumped into you before. I'm Joe Buck from Texas and I'm gonna buy you a drink, what do you say to that?    Same all around! For my friend, too!  The TV screen over the bar features a mating game program as Jackie cruises down to join a tall farm boy with plucked eyebrows. The TV HOST points to three young men, visible only from the shoulders up, from whom a pretty DATE GIRL in blindfold must choose an escort.   ... you see what I'm getting at here? She got a penthouse up there with color TV and more goddam diamonds than an archbishop and she busts out bawling when I ask for money!   For money.   I'm a hustler, hell, didn't you know that?   I think you just put your finger on it, I do.    Hey now, you heard him.  On the TV screen -- the Date Girl announces:   Hey, listen, how about you take me to mee this Mister O'Diddle bird right now?   Hold it, just hold it. You think I'm that kinda sombitch? Just name your cut, whatever you want, you got it right now. Five? Ten, how's that?  Joe peels a ten from his wallet and offers it to Ratso.    Ten, ten -- I got a twenty -- take that...   Now take it. Go on.  Listen, where can I reach you? Cause I'm gonna make this right with you soon's I get me set up...   I mean, dammit, where you live?  Ratso leans on the DOWN as the cage grinds slowly down into view and stops.   No sir, I'm no cowboy really, but I'm a first class stud.   You bet I do, sir.   Well, not too, I mean, a little.  O'Daniel rises suddenly in a fury of self-righteousness, pacing, his voice simpering, whining sarcastically.   Yessir, I can see that.   Well, uh, I'm raring to go.   Uh, yessir.   Ready for anything.   Gonna be like money from home.   Get down -- where?   Say, you know that runty little bastard I was with?   Shee-it.   Well, now, ma'am, next time you got that feeling coming on, you dial Joe Buck. I'll show you what to do...   Key to 1014...  Action continues as the DESK CLERK hands Joe a folded paper instead of a key. Joe opens it, deeply perplexed.   Uh, what about my things'n all?   Listen, tell you what, you can keep all the rest of the goddam junk if you let me have just the suitcase. That suitcase means a lot to me.   Screw off.   Any objection, gentlemen?   Shee-it.  ... glancing around with an embarrassed laugh, but the only one looking is a cop, scratching his calf with a night stick. Joe keeps his back to the customers as he moves to the water dispenser, wets a paper napkin and tries to wipe away the stain. But the water has only spread the stain across his pants and down his leg. He blushes as a blonde young streetwalker giggles.   Shuttle. Follow the green light.  Automatically,checking the trough of a gum vending machine, Joe unexpectedly faces himself in the mirror, the eyes staring at him tired and hopeless. His hand reaches unconsciously for a cigarette, The package is empty. He crumples it in his fist but holds it.   Alright, cowboy. Enough of this shee-it. You know what you got to do?  Then go do it.   Twenty-three bucks, I got to have twenty-three bucks...   I'm awful damn sorry you're sick, kid, but you gonna have to gimme that money like you said.    What you got in your pockets?  Eagerly, the boy produces a family photograph, a subway token, a dirty handkerchief. Joe grabs his wrist, revealing a watch.   How much's that worth?   Oh, I ain't gonna hit you, I'm gonna strangle you to death...  The cigarette in Ratso's mouth burns into his lip. He jerks spasmodically, choking on smoke as he rips skin away with the butt and drops it in his coffee cup.   ... only first I'm gonna turn you upside down and shake you out right here and now.  Coughing, eyes tearing, Ratso empties his pockets on the counter, finally producing: sixty-four cents, a few sticks of gum, an almost empty cigarette package, a book of matches and two pawn tickets. He raises his eyes, somehow ashamed. Joe kicks the toe of Ratso's loafer.   What's in your socks?   It's sticky. What you do, slobber on 'em? I wouldn't touch 'em.  Joe should leave -- Ratso obviously has nothing tangible to offer -- but Joe hesitates, lighting a cigarette as Ratso pulls on his loafers.   You want some free medical advice, shut your goddam mouth about that night.   Shee-it. I got better things to do than talk to you.   Listen, keep away from me, hear? You come near me again, I snatch you bald-headed!   You inviting shee-it.   Comfortable, kee-rist, I slept on subways softer than this.  Joe stretches himself, yawning, his eyelids drooping heavily. The sounds of the city recede. Joe's love theme plays softly on a distant radio. Joe's eyes close momentarily in spite of him elf.   Smart thing for me to do is haul ass outta here.   You don't seem like no fag...    Want me to stay here, y'after something. What y'after?    Okay. I love you.  Anastasia purrs as her lips find Joe's breast, trying to nurse. A flashlight flares suddenly through the car window.   Where's my boots -- ?   What for?   Well now, Ratso, I'm gonna tell you something for your own good, only first gimme a cigarette.  Ratso offers a cigarette from his crushed package, Joe strikes a match on his thumbnail and lights up, staring at Ratso.   You want me to stay here tonight, is that the idea?   Oh. Guess I got the wrong impression.  Joe makes a slow move to pull on one boot.   Well, I hope you know what you're in for. I'm a very dangerous person. Someone does me bad like you. If I caught up with you that night, there'd be one dead Ratso long about now. Hear?   So if you want me to hang around for a few days, I thought you should know.  Joe yawns, picks up a few blankets and spreads them on the cot. He puzzles out the faded printing on one blanket.   Property of the YMCA. You make me wanna puke sometimes, Ratso.  Ratso blows out the candle and wraps himself in blankets.   Shee-it, man, I can't say all that.   Rico! Rico! Rico! Is that enough?  And keep your meat hooks off my radio.   Hey, looka here, that ain't nice, picking on a cripple...  Joe intervenes just long enough for Ratso to escape, then ambles on, leaving the Greengrocer in frustrated fury. Camera holds on a tray of coconuts.   This is an okay setup you got here, but I'd say you ain't just exactly, uh, flush, is that right or not?   I think finding you's the smartest thing I ever did, for both of us. You just the crooked kinda sneaky little sidewinder I need to get me hustling in this town. Hey!  Joe jerks his hand away just in time to avoid the ice-pick. The coconut bounces on the floor. Ratso picks it up, holds it, while Joe tries to crack it, swinging his boot like a hammer.   What's all this sweet talk about Florida? Your friend O'Daniel got a stable down there now?  Joe swings violently. Ratso yelps, hopping on his one good leg, sucking his thumb.   Well, I am dumb, that's for sure. I don't talk right. I can't think too good. Just only one thing I ever been good for's loving. Women go crazy for me. Fact. Crazy Annie. Had to send her away. So I don't cash in on that, what am I? I'm shee-it. May's well flush me down that hole with the dishwater.  Joe sets the coconut on the floor, holding it with both hands while he tries to smash it with the heel of his boot.   That's why you gonna stop crapping about Florida and get your skinny butt moving to earn twenty bucks worth of management you owe me...   Make that twenty-three bucks.   You talk like a man with a tin twat.  Ratso sets the coconut on the window sill, balancing it as he raises the X window.   Well, uh, my manager's gonna manage all that crap, or else he gonna get a coconut up his flue.  Joe slams, the window down. The coconut flies down to crash O.S. on the sidewalk below.   It ain't right, stealing from a pregnant lady.   Hey, you're good! I bet you could pick up a living at this if you tried.   Kee-rist, you pretty damn clever for a skimpy little gimp.   Don't rush me. How I do it, see, I get myself primed, like I was turning on the charm for some pretty little blonde lady, then kinda mosey away slow and easy and - swing around! -- and there you are, you handsome devil.  Joe performs his ritual as he speaks, but more relaxed, faintly laughing at himself with Ratso. The wall mirror has been added since we last saw the flat, along with a legless overstuffed chair with burnt-out cushions, a tasselled table cover, pinups, calendar girls and several new Florida tourist posters, Ratso moves to Joe's side, arranging the neckerchief, nodding.   What I'm gonna do, I'm gonna make a cowboy outta you, kid. How about that? Build you up a little, teach you couple little tricks'n turn y'out to stud, Rat-stuff.  Joe slaps his hat on Ratso's head, tilts it, hooks Ratso's thumbs in his jeans and shoves a cigarette into the corner of Ratso's mouth. Ratso laughs till he chokes -- for one instant, self-consciously, mimicking Joe -- then removes the hat and reaches for his threadbare black raincoat.   Okay, you got yourself one handsome, sweet-smelling cowboy, strut your stuff...   I want my money, goddamit, you owe me my money whether you get laid or not, lady, shee-it!   Shee-it. Cough yourself inside out, then light a fag, a goddam fag. You make me puke. Where'd you steal it? In the movies?   Who'd you ever do a favor for? You just let some poor bastard freeze to death, wouldn't you?  Joe slams ten dollars on the table. Ratso glances at Joe with curious concern.   Forty-second Street. Where'n hell you think it come from?   Wear it yourself. I wouldn't put it on my back.  Joe throws it back at Ratso.   Go get your medicine. Before you die on my goddam, hands...   Shee-it. I hate boneyards.   Kee-rist, you sure are one twisty little bastard, Ratso.   Respect shee-it! You even steal flowers for his grave.   Well, uh, he dam well know he ain't 'be-loved Aunt Winifred'.   My Grammaw Sally Buck, she died without letting me know.   Just ain't right, cheating someone dead and can't cheat back.  In the background, as Ratso speaks, HANSEL and GRETEL MACALBERTSON enter the lunch counter, inspecting the customers one by one. Both wear black turtlenecks and jeans, dressed as twins, both blond and pretty.   You wanna read something, read this. I been invited somewhere.  Shocking pink letters on the black card read YOU ARE INVITED  They picked me. The only one in the whole goddam place. You see how they looked me over, up and down before they give me that?   Well, this thought just struck me. It wasn't too long ago I was washing dishes way the hell somewhere in Texas.   Now I'm here. I'm in New York City. Getting picked for things. Don't you see what I'm driving at?   Did I say that? Did I?  It don't say nothing about you...   But they picked me, right? So what I'll do, I'll just say, now look, you want me? Well, I don't go nowhere without my buddy here.   Better dry your hair some. You sweating all over the goddam place.  Joe pulls out his shirttail, grabs Ratso by the neck and rubs his head dry.   You got a comb?   Few dozen cooties won't kill me, don't guess.  Joe hands Ratso his own comb. Ratso swipes at his tangled hair angrily until two teeth break in the comb. He hands the comb back, tugs at his hair with his fingers, pats it in place, then looks back into Joe's eyes.   Better get a hold of someone and tell them I'm here.  Ratso points to his ear -- he can't hear -- following Joe across the room. The huge loft is crowded with a random selection, gathered to serve as dress extras in an underground film. The party is the scene. The MacAlbertsons merely supply the ingredients and allow it to happen, with cameras strategically placed to record the happening...  ... Hansel with tape recorder, Gretel with hand-held camera drifting through the crowd -- catching words and images in a detached, whimsical fashion. Gretel turns her camera on Joe and Ratso as they approach.   Well, I made it. This here is Ratso Rizzo and I...   Shee-it, this is one helluva party!  ... glancing around at the others, imitating their techniques -- the quick inhaler, who follows with sharp gulps of air - the deep inhalers who draw air as they inhale -- the stylist who lets the smoke drift out and inhales through the nostrils -- Joe puffing himself slightly dizzy, starting to laugh at the silent flick effect of the strobe light -- the action around him slowing almost imperceptibly, overcranked -- a veil of smoke hanging over the fat woman's face, transforming her into a laughing witch -- a similar veil around Joe's head, relaxing the self-conscious tension of his face, spontaneously curious about the play of light on his hand, grinning at...  ... a serious young technician handling the light show, scattering psychedelic stars across a sky of magenta flesh...  ... Joe reaching for the stars as he rises and wanders back to the crowded loft, fascinated to see...  ... a crew with cameras and lights, on the balcony at one end of the loft, photographing the scene below...  ... a dark-haired lady by the name of SHIRLEY -- chic in the style of a gangster's moll -- drinking beer from the bottle, predatory eyes searching the crowd...  ... Ratso surreptitiously stuffing his pockets from the buffet table, glancing nervously over his shoulder, unaware of Gretel and her hand-held camera, photographing Ratso as he steals, turning away casually, disinterested...  ... Joe laughing as he dances for a moment with a tall black girl -- the lights swinging around them -- faces swimming...  ... Shirley in fleeting close-up, gone in an instant, reappearing...   Yeah, oh yeah.   Well, I ain't a f'real cowboy, but I'm one hell of a stud!  Shirley glances at Ratso, who nods, whispering in her ear.   Tell her, Ratso.   Well, if you're awright, why you hanging on the bannister. Can you walk or not?   Sure you're all right?   Whoopee ti yi yo...!   Well, that's something never happened to me before, you can bet your bottom dollar. Uh, where's the matches, ma'am?   First goddam, time it ever quit on me. Fact.  The repressed laugh finally breaks through. Shirley stifles it quickly as Joe sits up, looking at her.   You think I'm lying!   I ain't sleepy.   Shee-it...  ... camera pulling back to show Joe concentrating on a game, spread out on the sheet, consisting of nine dice lettered on all sides, the object being to build as many words as possible, Scrabble fashion, while a sand timer counts the seconds. Shirley watches Joe's efforts to think with sympathetic amusement. The only word Joe has composed so far is MAN.   What? It's a perfectly good word, ain't it. How much time I got?  Goddam sand thing drive you crazy. Kee-rist. Spelling never was a very strong point with me. Even in school.   Talking helps. Don't talk, you get muddled in your head. Hey! Now you just look at this here!  Joe spells out MONY, down from the M in MAN.   M-O-N-Y -- I'm right! That's just exactly how they spell it up there on that big building, bet you could see it from here. M-O-N-Y.   Y -- what in hell starts with Y?  Shirley slyly trails the tips of her fingernails across Joe's chest as she leans over to study the game, breathing softly into his ear as she speaks.   Cut it out. That's cheating, teasing me so I can't think. Just one bitsy Y word and I gonna beat you!   Beat your butt, you don't lemme think!   I show you what problem --  But the end of his sentence is swallowed by Shirley, taking his kiss in her open mouth, crushed by its impact, an animal noise snarling deep in her throat -- the agonized alley cat wail of pleasure -- Joe's problem is solved. Joe's love theme swells triumphant. At the same time, Shirley half-rises, trying to force Joe's head down, her own on top. The issue is joined. Shirley has named the game. Her objective is to force Joe onto his back. Joe's objective is to retain his initiative. Camera ignores the classic action on the central front, concentrating exclusively on peripheral tactical maneuvers...  ... Joe's elbows pinning her shoulders...  ... her eyes bright, accepting the challenge...  ... his tight smile revealing clenched teeth...  ... her fingers searching out then tickling his underarm...  ... Joe laughing as he falls lopsidedly...  ... Shirley laughing triumphantly...  ... his hand closing on her wrist...  ... her talon-nails clawing the air...  ... her toes walking up his calf...  ... her legs suddenly locking around his knees...  ... her free hand grabbing his hair...  ... her shoulder rising as she forces his head back...  ... her lips pressing down on his...  ... his hand swatting an unidentified mass of flesh...  ... her eyes popping, teeth clamping his ear lobe...  ... his hand catching her ankle...  ... her teeth losing the ear lobe as she screams...  ... her foot appearing upside down beside her face...  ... her talon-nails furrowing flesh, drawing blood...  ... his head rearing back, roaring...  ... both rolling to the floor, out of view...  ... her feet suddenly flying up into view...  ... her hand tugging rhythmically at the blanket...  ... her other hand wildly exploring Joe's back...  ... her ankles locking spasmodically...  ... her eyes and mouth wide, gaping...  ... the blanket suddenly ripping free, flying into the air as her arm flings itself around Joe...  ... the bedclothes spilling down around them, muffling her ascending shrieks.   Whoopee ti yi yo...   Well, lemme think now, Thursday, eight-thirty, yeah, I guess I could be available. Hell, yeah.   Well, ma'am -- Shirley -- I sure hate to trouble you, but...  Shirley opens her purse, savoring the moment. As she places the money in Joe's hand...   See what you think of that crap. I'll pour your soup. Got some of that junk you like to swill, too. Mentholatum. Aspirin. All that shee it...  Ratso opens the paper bag, trying to control his shivering, pulling out the socks and a suit of long underwear. He sees Joe watching him for a reaction. The best Ratso can do is a slight shake of his head.   They wrong?   You couldn't lift fly specks from a sugar bowl. Can you hold this?  Joe hands Ratso the soup. Ratso seems steadied by the warmth in his hands. He nods, sipping the soup.   Yeah.   And what?   What of?   Who?   Okay. Here it is. You gonna go see the doctor. I got nine bucks and twenty more Thursday and I gonna be riding high before you know it. So you gonna get you the best goddam doctor in this town and get yourself straightened out, that's what.   Well, just exactly what the hell you think you're gonna do? Die on me?   You know what's wrong with you? You got fevers. You kinky as a bedbug. How you gonna get to Florida?   Just when everything's going my way, you gotta pull a stunt like this.   When I put you on that bus down to Florida tonight, that'll be the happiest day of my life!   Hey, Shirley... Miss who? Oh, yeah, well, when will Missus Gardner be home? ... I'm a friend of hers, a goddam good friend... Shee-it, I can't wait till then...  Joe hangs up while the answering service's voice is still talking. The match has burned out. Joe flips it away.   Gin's okay.   What?  Towny's dialogue moves out of sync. Towny's eyes seem to look into camera -- from Joe's viewpoint -- but slightly past it. The quality of the scene grows increasingly disjointed as Joe glances around the room, looking for something to steal, losing personal contact with Towny, viewing him as an object to be used for a specific purpose.   Listen, Towny, did I mention I got a sick kid?   Well, he is, he's sicker'n shee-it. And I've gotta get him South quick as I can...   What d'you want?   What you got me up here for?   You want me to leave?   I'm going to Florida.   Listen, I gotta have money.    I gotta have more'n ten. I gotta have fifty-seven dollars.   Get outta my way.   Let go. Let go of the table.  Joe slaps him, but Towny clings more fiercely to the table as Joe tries to jerk it free. Joe strikes him with his fist.   You wanna gimme fifty-seven dollars or you wanna busted skull?  Towny simply stares at the lamp.   Please let go of that table.  Joe threatens, swings the lamp down, but stops short of hitting Towny. Towny shrieks -- eyes rolling back as he falls limp -- loosing his grip on the table, leaning on the bed, laughing and crying hysterically. Joe has to step over him to reach the wallet in the drawer. He takes all the money -- probably twice what he needs -- desperate to get out of the room.   These guys're good drivers.   Yeah.   How'n hell a dumb Bronx kid like you know that?   Shee-it. You believe all you read?   If you have to shiver, why don't you pull the blanket up more?   Keep the goddam blanket on.   Sounds like they knew you.   Hey -- whatsa matter?   You're what?   Hell, don't cry about it!    You just -- just -- what happened, you just had a little rest stop wasn't on the schedule.  Ratso begins to laugh with Joe as if it were the funniest thing they'd ever heard. Then Ratso's face pales as he starts to choke and cough. Joe pats him on the back.   Hey, what size pants you wear?   Couple crullers'n coffee to go.  The Waitress draws coffee, wraps crullers.   New York.  Joe pays. She smiles, gives him change. Joe smiles, starts on toward the bus, hardly aware that he has accomplished something rare and remarkable for Joe -- a simple human contact without fear or threat, a pleasant everyday happening.   I'm zipping your fly, what the hell you think I'm doing?  They both smile. It isn't funny enough to laugh at. Joe arranges the blanket, takes out a package of cigarettes, glances at Ratso and puts it away.   Shee-it, you know, I got this thing all figured out, Ratso. I mean Rico. When we get to Miami, what I'll do, I'll go to work. I gotta do that, 'cause see, I ain't no kind of a hustler. I ain't even any goddam good as a bum. I'm a nothing, that's what I am. So reckon I'd better go to work and get me a goddam job. Okay?  Joe glances at Ratso, but there is no response. Surreptitiously, Joe takes out a cigarette, turns his face away from Ratso and lights it, hiding it cupped in his hand as he smokes.   Yeah, guess that's what I'm gonna do.  They ride for a moment in semi-darkness, Joe smoking, looking at the other people on the bus, brighter without the shades down. Joe turns, checking the blanket around Ratso, noticing that Ratso is sitting in a peculiarly stiff, awkward position. Joe leans over to straighten Ratso's head, blocking our view for a moment. Then Joe leans back, frowning, thoughtful. We still do not see Ratso's face. Joe rises slowly, starting forward in the bus...  ... passing an older couple, a schoolgirl, two ladies with straw hats, a young man trying to read, pausing when he reaches...  ... the DRIVER, staring out at the Sunshine Parkway with the Driver, leaning over so he won't have to speak too loudly.   My friend's dead in the back seat.   Dead. Dead as a doornail.   Close them?   No, sir. Not till Miami. I'll see to burying then.  The Driver moves to the front and turns to the passengers.",
        "Buck": "You look real nice, Joe baby...    ... a gilt-lettered sign in the window, glittering in the sun, momentarily hiding the fact that the shop is deserted. Joe grins as he hears remembered sounds and voices incomplete flashes, more significant in tone than content a girl giggling sexily -- \"Keep your meat hooks off my beauty operators, sugar\" -- tinkling noises of a busy beauty parlor - Sally Buck singing \"Hush, little baby, don't say a word, Grammaw gonna buy you a mockingbird...\"  ... a shift of light revealing a row of tarnished driers, a broken mirror, a FOR RENT sign in the window. Joe turns toward the bus depot, radio pressed to his ear.   No, a little lower, sugar, yeah, yeah, that's good. Grammaw's beat.   You get him to the church, honey. He ain't gonna find out you ain't a real blonde till after you're married, then's too late.  Sally Buck turns, pretending to be stern as Toe laughs.   You getting too big for your britches, sugar.   Don't forget to say your prayers, honey...  Joe leans forward to help the old Lady, irritably struggling with the release button on her seat. She scowls as Joe leans over to release her seat, then pulls her blanket around her and turns away from him. Joe switches off her reading light.   Like it, honey? Does it fit?   Woodsy Niles! The boy!   Keep your meat hooks off my operators, sugar, hear?   There's a TV dinner in the fridge, lover boy...   You be okay, won't you? Maybe I bring you a treat if you're a good boy...   I'm so beat, no point you waiting round, toots, think I'll stop in for a beer or two...   Expect me when you see me. Looks like I got me a new beau, lover boy, how's that for an old grammaw? I'll leave you movie money...  Sally Buck tucks a dollar bill under a framed picture of Jesus, who has replaced Woodsy Niles on the mantle.    As we saw it last, deserted, a FOR RENT sign in the window. Joe's reflection appears, staring at himself, dressed in his dishwasher's clothes.    The FOR RENT sign flapping in the wind.   Wet your britches, lover boy?    Through the window, past the FOR RENT sign, the tarnishing driers are lined up like tombstones.",
        "O'Daniel": "You must be Joe Buck. Come in.  O'Daniel, fat in a worn-out bathrobe, examines Joe like a prodigal son as he leads him into the room -- as anonymous as Joe's own room.   Am I tickled to find you, boy! Come on in and let's get a look at you. Turn around. Good strong back. You'll need it. So you want help -- take a seat, relax, tell me about yourself. Cowboy, huh?   Take it,easy, boy...  Seems to me you're different than a lotta boys that come to me. Most of 'em seem troubled, confused, but I'd say you knew exactly what you want.   But I'll bet you got one thing in common with them other boys. I'll bet you're lonesome.   I'm lonesome. I'm lonesome so I'm a drunk. I'm lonesome so I'm a dope fiend. I'm lonesome so I'm a thief, a fornicator, a whore-monger. Poop, I say, poop! I've heard it all and I'm sick of it, sick to death.   Lonesomeness is something you take. You bear? Dammit, you take it and go about your business, that's all.   Yes, I believe you are. Cowboy, huh?   Ready for hard work, son?   I got a hunch, Joe Buck, it's gonna be easier for you than most.   Money from home, see, there's your strength, you put things in earthy terms any man can understand, son. I warn you I'm gonna use you, I'm gonna run you ragged!  Joe laughs, driving an obscene uppercut into the air. O'Daniel laughs with him.   You're a wonderful boy. You'n me gonna have fun, dammit, it don't have to be joyless. Say, why don't we get right down on our knees now?   Right here, why not? I prayed in saloons, I prayed in the street, I prayed an the toilet. He don't care where, what He wants is that prayer.  O'Daniel drops on all fours, crawling to find the plug of an electric cord. He shoves it into a wall socket, switches off the overhead light and suddenly a hollow, tinted plastic Jesus glows on the dresser. O.S. a revivalist congregation sings. And now we notice, with Joe, placards and flags, horns and tracts, all the paraphernalia of a street corner evangelist.   That's the ticket, just open your heart and let it flow. It ain't the words, it's the love beyond 'em!   Don't fight it, boy!   Pray and you shall be heard!   Don't be frightened, son!   Don't run from Jesus!  Joe stops short as he sees the front page of a tabloid on a newsstand. There is a picture of Joe being led away by two deputies, under a headline ALABAMA MURDERER SHOTGUNS ELEVEN.",
        "Shirley": "I can tell, can't you?   What'll we do? Leave now or what? Your place or mine? Oh God, the second I looked at you I knew. Did you?  Joe grins, watching Shirley's lips move, unable to keep her in sync, startled to hear Ratso's voice.   Did you know? We were going to make it?  Joe glances down to see himself flanked by Ratso and Shirley.   Who's he? Oh God! Don't tell me you two are a couple -- ?  The flower girl, hypnotically dazed, accepts a broom dipped in black paint and smears a huge X across LOVE. Joe laughs.   It's too much -- to come face to face with a walking talking sex fantasy -- to buy a man's -- God!  ... the tall black girl dancing in stroble light, starting to remove her clothes -- Gretel following her with a camera...   I can't wait to tell my man Monday. I should be taking notes. Look at my arm!  ... Shirley's talon-like fingernails caressing the gooseflesh on her tanned arm...   Eat it -- a man in your line of work has to keep his strength up...  ... Shirley bringing Joe a massive sandwich on a paper plate, watching him bite into it...   It's fantastic, now I know, everything you do has sexual implications. If I you know, bought it -- could I take pictures of you naked? That's part of it, isn't it, kinky kinda things?  ... the tall black girl and a few others are trying to promote an orgy. A scrofulous old wino dances spastically, working his toothless gums, preparing to expose himself to two girls dancing together...   I had a thing for him. Before I knew. Why should knowing make it more of a thing?  ... Shirley talks to Gretel as she photographs the funeral.   Naturally I'll have to ask myself why a cowboy? And why a cowboy whore? But not tonight.   Incidentally, how much is this going to cost me anyway?  Joe turns to Ratso, whose attention is fixed on the coats.   Sold. Let's go.   Get lost.   Your name's Joe. Which is fabulous. Joe could be anyone. Kiss me, Joe, move over, Joe, go away, Joe. It's just perfect.  They glance up as Ratso appears, swinging down too rapidly on the bannister. He misses a step and falls -- a clown's fall, unable to stop but apparently not hurting himself. Shirley and Joe are laughing when Ratso lands at the foot of the stairs.   He fell. Hey, fella, you fell. Is he all right?   He's got taxi fare.    Joe lies on his back, staring fixedly at a fragile mobile hanging from the ceiling, stirring listlessly.   That happens. Don't worry about it...  Shirley leans on one elbow, looking at Joe sympathetically, fighting an almost irrepressible desire to laugh. Still avoiding Shirley's eyes, Joe finds a cigarette on the side table, searches for matches.   Top drawer. Maybe if you didn't call me ma'am, things would work out better.  Joe finds the matches, lights up and lies back, staring at the mobile as he smokes, still not looking at Shirley.    No. Of course not. Just something struck me funny...  Close on Joe -- watching Shirley closely, reacting.   I just put myself in your shoes. I had this image of a bugler without a horn, a policeman without a stick, etcetera, etcetera and I...  I think I'd better shut up, I'm making it worse.  Shirley composes her face, reaching out to touch Joe. But that doesn't help either. He reacts sharply.   Maybe we should take a little nap, see what happens?   I know. Scribbage!  Extreme close-up of Joe -- frowning, puzzled...   That's pretty Freudian, Joe.   If you didn't talk so much, maybe you could think more.   There's an E in MONEY. If that's your word.    Okay. Never argue with a man.   It can end in Y day, pay, lay -- hey, pay lay!  One predatory hand rests on his knee -- as if by accident - disarranging the sheet, talon nails lightly brushing his thigh.   You gonna beat me, Joe?   Gay ends in Y. Fey. You like that -- gay fey -- is that your problem?    Shirley has difficulty reverting to her nine-to-five role as a Madison Avenue career girl. Half-dressed for work, she is talking on the telephone, her eyes on the open door to the bathroom, through which Joe's voice continues singing.   Well, I really can't talk now, if you know what I mean, but believe me when I say, Myra, it's an experience every emancipated woman owes herself. I'm not. I'm not exaggerating. Well, what's Phil's poker night?  Joe -- are you available next Thursday, eight-thirty?    Thoroughly shaved, bathed and groomed, Joe is sprinkling an expensive cologne into his boots. He yells back enthusiastically.    Shirley turns back to the phone. Joe appears, grinning.   Why don't you just come here? I'll be working every night this week. I'll leave a key with the super...",
        "Ratso": "Excuse me, I'm just admiring that colossal shirt...  RATSO studies Joe across the corner of the bar -- a sickly, child-size old man of twenty-one -- hopefully nursing an empty beer glass, contemplating the money on the bar in front of Joe.   That is one hell of a shirt. I bet you paid a pretty price for it, am I right?    More goddam faggots in this town.  Reaching for a cigarette, Joe glances at Jackie, startled as Jackie twitches his pink levis angrily and turns away.   Enrico Rizzo from the Bronx. Don't mind if I do.   For what?   For money for what?   How would I know? You gotta tell a person these things  A hustler? Picking up trade on the street like that -- baby, believe me -- you need management.   My friend O'Daniel. That's who you need. Operates the biggest stable in town. In the whole goddam metropolitan area. A stud like you - paying! -- not that I blame you -- a dame starts crying, I cut my heart for her...   The name is Rizzo.   That's okay, Joe. I'm used to these types that like to pick on cripples. Sewers're full of 'em.   Look, with these chicks that want to buy it, most of 'em are older, dignified, right? Social register types. They can't be trotting down to Times Square to pick out the merchandise. They need a middleman, right? That's O'Daniel.  Joe hesitates as Ratso darts into traffic against a red light, yelling unheard obscenities at a cab driver who blasts his horn. Joe runs recklessly forward as Ratso slams the taxi fender with his fist, pretending to be hit, falling into Joe's arms. The taxi stops, halting traffic. Ratso, recovers, strolls casually in front of the cab, biting his thumb at the driver.   It is a crime, a stud like you passing out double sawbucks to a chick like that. With proper management you should be taking home fifty, a hundred bucks a day. More if you wanta moonlight...   Him I placed with O'Daniel just two weeks ago. And look. Not much of a stud either, what I hear...   Well, Joe, you're a nice guy, and I'd be doing you both a favor, but why? What'm I dragging my bum leg all over town for? It's no picnic and what for, for me myself, what?  Ratso stops opposite the Plaza hotel, pointing across at an aristocratic blonde stepping out of a Rolls Royce.   Tomorrow when some piece like that's scratching your back in a Fifth Avenue townhouse, where'll your pal Rizzo be? Nedicks.   Joe, please. You know what I'd ask anyone else? Oh hell, tell you what I'll do, I'll take the ten...  ... but when I hand you over to Mr. O'Daniel, I'll have to have another ten, Joe; just to like cover expenses...   This boy is just your meat, Mr. O'Daniel, believe it, I'm telling you -- what? -- Enrico Rizzo from the Bronx. The point is he needs you. Right now. Tonight...  I got his tongue hanging out...   Name's Joe Buck. Cowboy. Just in from Texas, don't know the ropes, new to the city, but very promising material, sir, and ready, if you get what I mean. Fabulous. Right away. What's that room number there again?   Hold it a second...  ... but the operator slams the door and starts on up. Ratso leans heavily on the down button, glancing at Joe.   Nine-oh-one, got it?  Ratso glances up the elevator shaft nervously, rings again and turns back to Joe.   Let's see how you look. Fine. You look fine. Now I'm gonna have to have that other ten...   Oh hell, forget it.   Forget it.   Sherry-Netherlands Hotel. Now get your ass in there. He's waiting!  Ratso steps into the elevator as the door opens then closes, leaving Joe alone, repeating \"Cherry Neverlin\" as he starts along the corridor looking for 901.   Don't hit me, I'm a cripple.  Joe's hand falls on Ratso's shoulder.   Not a cent, I swear to God, I swear on my mother's eyes.  Ratso removes his loafers and shakes them, glancing at the counter man. His socks don't even conceal his toes. Disgusted, Joe shoves Ratso's small pile back at him.   You keep the sixty-four cents. I want you to have it.   How do you like that O'Daniel, flipping out like that? I wanted to get in touch with you when I heard, but I been laid up with this cold...  Ratso touches his chest, forcing a cough which continues itself beyond his intention.   Okay, right, right, okay. Another subject. Where you living? Still at the hotel?   Hey, wait up, for crissake!  ... Ratso hop-skipping to overtake Joe at the traffic light.   I'm inviting you. I mean if you're not located, I got a place. I'm inviting you, goddamit.   The X on the window means the landlord can't collect rent -- which is a convenience, hey? -- on account of it's condemned.   The electric's off. Another convenience. I don't mess with Con Edison, hey? What the hell, I got candles, right?   I got no heat, but by that time, you know, cold weather, hey, I'll be in Florida. Stretch out. Make yourself comfortable. You hungry? I'll put up some water for coffee.  Ratso fills a saucepan from the tub-sink, sets it on a Sterno stove. Joe sits himself on the mattress-bed, pretending to test it, weeks of exhaustion and tension overwhelming him suddenly, his only immediate problem being the effort to restrain a large, comfortable yawn.   Whatsa matter now?  Joe shivers, pulls a blanket around him, resisting sleep, but the noises of demolition fade, the love theme lures Joe back.   What's that supposed to mean?  Joe's eyes close, his voice continuing out of half-sleep.   For crissake!  Still wild-eyed, Joe suddenly points at his stocking feet.   I took 'em off.   So you could sleep! I mean Christ!  Joe inspects the boots, seats himself on a battered Army cot - which has been added while he slept -- swinging a boot by its strap, considering whether to stay or go.   I drug in a cot, if you want to stay.   I ain't forcing you, like, I mean, who's forcing you?   I want you to stay, okay? I goddam invited you, didn't I?   I'm impressed. You're a killer.   Joe -- do me one favor -- this is my place, am I wrong? You know, in my own place my name ain't Ratso. I mean it so happens my name is Enrico Salvatore Rizzo.   Rico then, at least call me Rico in my own goddam place.   The two basic items necessary to sustain life are sunshine and coconut milk. That's a known fact. If I can find the goddam hole the milk squirts out.   I been sick. Hold this, will ya?  Joe takes his time rising to hold the coconut while Ratso tries to poke a hole with a bent ice-pick.   In Florida, they come smooth, ready to eat. Down there, your only problem is, diet-wise, you gotta lift an arm to wipe warm milk off your chin. Tough, hey?   Miami Beach is the only place for a real hustler. Florida has more rich chicks per square yard than any resort spot in the world. They lie out in their pagodas and pergolas waiting to grab the first jockstrap that passes.   Cowboy killers! Break my finger, Christ! I got news for you, baby, no chick with any class buys that big dumb cowboy crap...  Ratso holds his thumb under the tub-sink faucet.   ... the cowboy bit's out, except among fags of a certain type, which take a certain, type hustler to exploit. Like I could handle it -- being a stealing operation basically -- but take your average fag, very few of them want a cripple.  Joe holds the coconut like Yorick's skull, thinking hard.*   Look at yourself, Joe, no offense, but frankly, you're beginning to smell. For a stud in this town that's a handicap.   You ain't got a chance in hell. You need threads and glitter, baby. A front, hey?   A woman in your condition shouldn't do that. Let me help...  ... adroitly slipping Joe's cleaning in with her load as she turns to seat herself beside Joe.   What did it cost her? The laundromat syndicate lost a couple coins. I'm crying.  The owner brings Joe's clean and blocked Stetson from the rear of the shop. Joe sets it on his head and examines himself in a mirror as the owner hands Ratso, the bill.   Where's mine? The black homburg? I brought it in the same time.  The owner glances at the slip, puzzled, returns to the rear of the shop to search for the nonexistent homburg. Ratso quickly drags Joe away from the mirror and out of the shop.   And end up a hunchback like my old man? You think I'm crippled? You shoulda caught him the end of a day.  Ratso demonstrates a chimpanzee walk. Joe laughs. Ratso turns back in panic as another man takes a chair next to Joe. Ratso is about to retuse when a cop takes the third chair, swinging his handcuffs around to the front, tapping his shoe with his night stick. Ratso quickly drops a rag over the broken padlock, cursing under his breath as he starts working on all three customers at the same time.   You think it's funny?   Stupid bastard coughed his lungs out breathing that resin all day. They buried him with gloves on. Even the fag undertaker couldn't get his nails clean.  As if by conditioned reflex, Ratso chokes on the cigarette in his mouth, coughing painfully. He crushes it out, opens the window to spit, shivering, then slam it and turns back to remove the towel from Joe's neck.   You like it? Take a look.   Not bad -- for a cowboy -- you're okay, you're okay.   How do you like that? Cheap bastard...  I think we struck gold. This is one high-class chick. The Barbizon for Women!   Mr. McNeill, I'm calling for Miss Beecham at the Barbizon Hotel for Women. She won't need you tonight...   Would you believe a whole goddam hotel with nothing but lonely chicks?  Joe and Ratso watch from across the street.   Score once in that setup, the way chicks talk, Christ...  Joe cracks his gum, tilts his hat, starts across the street.   Get the money! Remember Cass Trehune? Cash! These rich bitches write a check at night, call the bank and stop payment in the morning. Get the cash!  In Ratso's eyes -- as Joe enters the hotel -- its facade suddenly wipes away to reveal rich ladies in negligee waiting in every room.   The coat? A guy I did a favor once gave it to me. Christ.   Where'd that come from?   You wanna know the truth? You dumb bastard, I got it for you. Look at it. Goddam thing's ten sizes too big for me.  Ratso pulls off the coat and throws it at Joe.   Goddamned if I'll wear it!  Ratso hurls it in a corner. Joe shoves the ten at Ratso.   So split. He ain't your goddam, father.   The name's Rico, at my own father's grave, a man deserves some respect.   Can he smell the difference, eh?  Joe reads from the ribbon on the floral display.   He can't read. Even dumber than you. Couldn't write his own name. X -- that's what it ought to say there on that goddam headstone. One big lousy X like our flat. Condemned. By order of City Hall.  Joe is frowning, standing at the,headstone, momentarily depressed with an undefined sorrow.   Just keep your hat on and cry a little. They tip you when it's over.  Joe and Ratso join the mourners as the funeral moves to the grave, Ratso mouthing an authentic double-talk...  ... Joe standing self-consciously, aware of the covert glances of the other mourners, automatically reaching up to remove his hat, remembering when Ratso elbows him in the ribs...  ... Joe scowling, tight-lipped, embarrassed by the tip that is thrust in his hand.   You and my old man. Same kinda mind. Putting me down till the day he died...  ... why can't you be like your brothers? Sons a father could be proud of. Yeah, sure. My brothers. Too goddam busy making something of themselves to show up when the old man's dying!  Conditioned reflex, Ratso starts to cough. Joe sees the MacAlbertsons in the mirror, standing behind him, studying him. Gretel nods, Hansel hands Joe a large black card, smiling vaguely, then moves on.   What was that all about?  Joe studies the black card, frowning at first, suddenly smiling, turning as if to call after the MacAlbertsons, but they are disappearing around the corner. Joe hands the card to Ratso.   So?  Joe sees a young man washing cups behind the counter. Joe shakes his head, wonderingly, turning to study himself in the mirror.   Yeah, well, so?   What you're driving at, you want me to get lost so you can go to your fancy-ass party.   Don't say nothing about you either.    Well, what the hell, I got nothing better to do.   Don't need a comb.   Okay? I look okay?  In a moment of silence, distant sounds can be heard -- a siren, the grinding teeth of a garbage truck, the twang of an electric guitar upstairs at the party -- then Ratso makes a quick gesture of impatience and starts up the stairs, pulling himself on the bannister.   Rico. Rico Rizzo.  Gretel smiles without recognition. Hansel gestures vaguely.   If you want the word on that brother and sister act, I'll give you the word. That Hansel's a fag and Gretel's got the hots for herself. So who cares, right? Load up on the salami...  Ratso heads for the refreshment table. Joe starts after him but pauses, intrigued by an alcove under the balcony where a light show is in progress -- surreal images of naked bodies projected against abstract currents of color and strobe light...  ... a bored fat lady in a muu-muu, squatted like a Buddha at a low table, rolling joints for the guests. She lights a joint and offers it to Joe as he wanders in to watch the show. Joe laughs delightedly when he realizes what it is...   She's hooked...   ... I'd say she was good for ten bucks, but I'll ask for twenty...  But Joe is watching with terrible fascination as Hansel and Gretel lift the flower girl from her sarcophagus.   You really want to do business?   A very expensive stud. And I happen to be his manager.  The scene -- from Joe's viewpoint -- becomes increasingly confusing and fragmented, dialogue and image moving in and out of focus, cameras and lights surrounding him, keeping the center of attention in his own blown mind...  ... Shirley's eyes unnaturally bright, inspecting his body, lingering on his thighs, moistening her lips...   I gotta sit down. I feel crummy.  Ratso stretched out on a Victorian love seat -- the flower girl walking unsteadily, passing out dead daffodils, placing one in Ratso's hand Gretel photographing his reaction...   Twenty bucks...   ... and taxi fare for me.   I agree. And for that service I charge one dollar taxi fare.  She takes a dollar from her purse and hands it to Ratso, takes Joe's arm and starts down the stairs. Ratso lingers, starting quickly through the coats, frisking them for loose change.    Is he all right!   Walk? Naturally I can walk.    I said yeah! Yeah, yeah, yeah!   No. But while you was buying the underwear, I could have lifted the socks.   But thanks.  Hey, Joe, don't get sore about this or anything. You promise?   Well, I don't think I can walk.  I mean, I been falling down a lot and, uh...   I'm scared.   What'll happen. I mean what they do to, you know, do with you -- if you can't -- ah, Christ!   I don't know. Cops. Or the -- how should I know?  Ratso is trembling so violently that the sou, starts to slop over. Joe takes it and sets it on the table.   No doctors. No, sir. Not me. Doctors are like goddam auto mechanics. Fix one-thing, unplug another. Operate for piles and while they're there, they unscrew your liver. My old man, for God's sake, wasn't any sicker'n I am when he went to the doctor.   I'm going to Florida, that's my only chance.   I'll find the money. If you just get me on the bus, that's all I ask.   I don't even want you to go. Whaddya think of that? I got other plans for my life than dragging around some dumb cowboy that thinks he's God's gift to women. One twenty-buck trick and he's already the biggest stud in New York City. It's laughable.  Joe sets his Stetson on his head.   Thirty-one hours.  They ride a few moments in silence.   The trip is. Nine-thirty in the morning we get there. Not this morning but the next one at nine thirty.  Both nod for a moment in silence.   They gotta be.   You get your first palm tree in South Carolina.   I read it.   I been thinking. I hope we're not gonna have a lotta trouble about my name down there. Because like what's the whole point of this trip anyway?   I mean New York's one thing, but can you see this guy, imagine it, running around the goddam beach all suntan and he's going in swimming, like, and then somebody yells 'Hey, Ratso' -- how does that sound to you?   Sounds like crap, admit it. And I'm not gonna have it. I'm Rico all the time, okay, do you blame me? That's agreed, okay? We're gonna tell all these new people my name's Rico?  Joe nods. Ratso closes his eyes, momentarily at peace.    I'm wet.   I wet my pants! My seat's all wet.   Here I am going to Florida and my leg hurts, my butt hurts, my chest hurts, my face hurts, and like that ain't enough, I gotta pee all over myself.  Joe laughs suddenly, uncontrollably.   I'm falling apart, that's funny?   Hey, what the hell you doing?   Thanks, Joe.",
        "Cass": "Hurry up, Baby. Do um goody-goods for Mama.  Joe grins, holding his hat over his heart as he approaches CASS TREHUNE, a blonde lady in a tight black dress, with the look of a movie star who wrecked her career with food.   You're hoping to get a look at what?   It's up in Central Park, taking a leak. If you hurry, you'll make the supper show. Now get lost.  But as she turns, Cass winks, dimpling the corners of her mouth, signaling Joe to follow her.   Hi.  ... her lips closing on Joe's as the poodle yaps shrilly at their feet. Superimposed, almost subliminally, a golden dollar sign appears, halating like a star, and the bell of a pinball machine rings O.S.    A princess telephone is ringing on a gold and white desk. Cass runs to grab it...   Hello?  ... as Joe steps from the elevator, which opens directly onto Cass's penthouse. Cass beckons him toward her, hooks a finger into his neckerchief and pulls his mouth toward hers while she talks on the phone.   Morey? Hi-ee, honey...  Cass gurgles happily as her free hand unbuckles Joe's garrison belt.   I'm just out of breath, honey, running to catch the phone.  As her fingers reach for Joe's zipper, cut to...  ... Joe's hand unzipping her dress.   I was walking Baby. Him got to do him goody-goods, right?  The poodle tugs at Joe's slacks until they fall. Cass steers her ear to Joe's mouth, shuddering deliciously.   Oh God, oh stop. I can't stand that. I just die...  It's Baby, Morey. Him trying to say hello. Say hello to Morey, Baby.  Cass holds the phone toward the yapping poodle, twisting herself against Joe as she wriggles out of her dress, passing the phone from one hand to the other.   Okay, old goosie? Now lookie, when do you want me to meet you? Whatever you say. I'll take a nap, watch TV, you know, kill time. Okay, but just one, a big wet one.  Cass hangs up. The poodle yaps hysterically, disentangling himself from her tumbling dress -- hops onto the couch glances off and flees again as an overturned lamp crashes   The poodle bounces onto the bed -- remaining long enough to establish a TV REMOTE CONTROL TUNER lying on the satin coverlet -- then leaps down in panic as he hears Joe and Cass explode into the bedroom, laughing lustily...  ... the remote control tuner buried suddenly under the full flesh of Cass's hip, activating...  ... a twenty-five-inch television screen, blasting at full volume...  ... Cass's eyes widening, profoundly impressed...   Ye gods...  ... the images and sound of the television set flicking joyfully from channel to channel...  ... Joe laughing, engulfed by Cass's abundance...  ... Cass wild-eyed, overflowing the frame...  ... a gleaming slot machine -- three Sahara cowgirls clicking into line for jackpot -- silver dollars overflowing the frame...    Joe turns away from a small terrace, buckling his belt, glancing off toward the sound of Cass in the shower. He flicks the TV remote control, enjoying his power, ignoring the silent images on the screen -- battle casualties, a pretty girl recommending aspirin, a man's stomach flashing animated pain, starving war refugees, a dog eating pzazz -- flicking it off to concentrate on the costume jewelry and perfume bottles on Cass's dressing table.   Don't look, baby...  Joe turns to look as Cass comes from the bathroom, holding a towel around her as she runs behind the closet door.   Me, too, lover.   Zip this thing, will you, Tex?  Joe zips her dress, follows her to the dressing table, where she sprays her hair with lacquer.   Oh, poor you. Morey's got terrible ulcers.  Cass stretches her upper lip across her teeth and she smears it with, orange lipstick.    Hers'n zodda meg a livig.   Said, a person's gotta make a living.   Scuse me, hon, fraid I'm only half here. Maybe you oughta run on along. But why don't you take this phone number?  Joe grins, relieved as she takes out a gold lame purse and opens it. He frowns as she folds; it upside down, empty.   Darn! I didn't get to the bank -- Tex -- could you let me have a little coin for the taxi-waxi?  Joe stands mute as she cups his chin in her hand, seductively.   You're such a doll. I hate money, don't you? God, it's been fun.   You bastard! You son of a bitch! You think you're dealing with some old slut? Look at me! You think just cause you're a longhorn bull you can get away with this crap? Well, you're out of your mind. I am a gorgeous chick, thirty-one, that's right, you said it!  Sobbing suddenly, she throws herself on the bed. Joe stands bewildered by the vastness of her grief."
    },
    "imdb_rating": "7.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZmFlZDZmMTYtZjczOS00M2M0LWIxYzItYmRjM2IxYTg4NDg2XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_QL75_UX380_CR0,14,380,562_.jpg",
    "description": "Texas greenhorn Joe Buck arrives in New York City for the first time. Preening himself as a real \"hustler\", he finds that he is the one getting \"hustled\" until he teams up with down-and-out but resilient outcast Ratso Rizzo. The initial \"country cousin meets city cousin\" relationship deepens. In their efforts to bilk a hostile world rebuffing them at every turn, this unlikely pair progress from partners in shady business to comrades. Each has found his first real friend.alfiehitchie",
    "name": "Midnight Cowboy",
    "genres": [
        "Drama"
    ]
}