{
    "filename": "Midnight-in-Paris_script.txt",
    "imdb_id": "tt1605783",
    "imdb_url": "https://www.imdb.com/title/tt1605783",
    "characters": [
        "Paul",
        "1920's Partygoer (as Marie-Sohne Condé)",
        "Helen",
        "Inez",
        "Carol",
        "John",
        "Cole Porter",
        "F. Scott Fitzgerald",
        "Gil",
        "Man at Wine Tasting",
        "Zelda Fitzgerald",
        "1920's Partygoer",
        "Museum Guide"
    ],
    "dialogues": {
        "Paul": "Inez.  It's great.   We can spend some time together.  It's such a lovely treat running into you here. A demain.  I believe Louis moved his court here in about 1682 - originally this was all swamp land - in fact, if I'm not mistaken, in old French the word Versailles means something like \"terrain where the weeds have been pulled\". The main structure is French classical style at its height - the work, I believe of Louis Le Vau, I think Mansart and Charles LeBrun I believe ···  Me too except, remember, in those days they only had baths and I'm definitely a shower man.  All that's missing is tuberculosis.  Not one of those stores that sells Shirley Temple dolls and old radios? I never know who buys that stuff - who'd want it.  And just what era would you have preferred to live in, Miniver Cheevy?  I see. And no global warming, no TV or suicide bombing, nuclear weapons, drug cartels.  Nostalgia is denial.   Denial of the painful present.  The name for this fallacy is called, Golden Age thinking.  The erroneous notion that a different time period was better than the one, one's living in. It's a flaw in the romantic imagination of those who find coping with the present too difficult.  That would be in Meudon. He died of the flu if I'm not mistaken - 1917 I believe.    So much of Rodin's work was influenced by his wife, Camille.  Camille?      No.  He never married Rose.  I think you're mistaken.  am.  You read that? Where did you read that?  Ah yes - sex and alcohol - It fuels the desire but kills the performance - according to the Bard.  Slightly more tannic than the '59. I prefer a smoky feeling to a fruity feeling, don't you agree?  This I have known for many years. You're a very lucky man.  May you make the transition from movies to literature and may your book glorify all the Shirley Temple dolls and Charlie Chaplin wristwatches that make us nostalgic for an allegedly once simpler, more charming world.  Carol and I are going to go dancing - we heard of a great place. Interested?  I'll take good care of her.  Is he a good writer?     Have you read his prose?  If he wants I'd be glad to go over his novel and critique it for him.  The juxtaposition of color is amazing. This man was the real father of abstract expressionism. I take that back, maybe Turner.  If I'm not mistaken it took him two years to complete this. And he worked out at Giverny - where he frequently -  He was frequently visited by Caillebotte - an artist I personally feel was underrated.  (coming to Picasso's  If I'm not mistaken he painted this marvelous portrait of his French mistress Madeline Brissou in the twenties.  Really?",
        "Helen": "To visit.  In this traffic nothing moves.    John hates their politics.  Can we discuss the wedding plans? Your father's used his good offices with the opera to get some of the singers to attend and sing. I thought Puccini would be nice.  It's definitely the nicest ring we've seen.  This is going to be such an event, Inez. I only wish -  Look, he's your choice.   What can I say?  And yet he talks of g1.v1.ng it up and moving here. That frightens me.  You're father thinks you're comfortable with Gil because you can control him.  You should talk, John - especially for someone who once advocated the boycott of french wines.  Come look at this Inez - wouldn't this be charming for a Malibu beach house?    Oh wait, that's Euros so it's more -  Yes but it's very hard to find anything like this at home.  You get what you pay for.     Cheap is cheap.  And don't forget - we're taking you to dinner tonight at .  Look at these marvelous Blackamoors. I see them in your living room.  It's a shame you two didn't come to the movies last night. We saw a wonderfully funny American film. I forget the name.  I know it was moronic and infantile and lacking any wit or believability but John and I laughed in spite of ourselves.  Oh look at these wonderful glass figures.  Where did Gil run off to?  Where's Carol?  You heard her. He walks and gets ideas.  You sound skeptical.  Nevertheless I hardly think your idea of having him followed is practical.  Well we know one thing - he doesn't go dancing.  Tell Gil to bring a suit because tomorrow night we'll be dining formal. Where's Gil.  Well he's going to miss a great weekend.  Well we can't take a chance.     Cheap is cheap is what I always say.  I agree.  I told you to keep everything in the hotel safe.  It's always the maid.  I would report the theft right away.  Come in - he's right there ···  He's had an angioplasty.  I was in the bathroom, I didn't see them.  Yes - my god, is it midnight already?  What's going on?       We can hear every word.  What happened?",
        "Inez": "It's become so touristy.  Well you like cities.  You act like you've never been here before.  I admit it's pretty but so are so many other places I've visited.  Starving.  Why does every city have to be in the rain? What's wonderful about getting wet?  It's annoying.  Oh god, no. I could never live out of the United States. And if I could it would be someplace totally different.  I don't know, Hawaii.  Yes but it's - Hawaiian.  Right, and becoming rich and successful. Tell me the sad story.  That was ninety years ago.  You're in love with a fantasy.  If I never see another charming boulevard or bistro -  Please let's not get into that discussion yet again?  Isn't that great Gil?  Gil.  Paul! Carol- Paul and Carol Bates - Mom, Dad, you know Gil - you didn't mention you'd be here.  Oh - how terrific. Dad's here on business and we free-loaded along.  What?  I'm dying to see Versailles.  Is that the end of the story?  We'd love to go with you guys. Versailles is beautiful - I have to see it Gil - it's perfect for you with your obsession with \"les temps perdus\" ·  (as they do their  It was so clear you didn't want to go.  He's brilliant. I used to have such a crush on him at college. And Carol's very bright.  I hardly think the Sorbo nne would have him lecturing if he's a pseudo- intellectual. You should give him your novel to read. I'm sure he'd be able to critique your writing and show you why you're having so much trouble.  (said with her usual  The studios adore you - you're in demand - I don't think you want to trade everything just to struggle.  I think I could get used to a summer home like this.  We're looking in Malibu.   We love where you live.  He doesn't even know if he can write a novel. So far your track record's - you know - whereas, everyone likes your movies -  Tell them about the lead character in the book you're working on.  Not the plot, just the lead character. He works in a nostalgia shop.      He's a romantic. Gil would be just fine living in a perpetual state of denial.  Touche.  I love a diamond wedding band. The way it sparkled they'll see it in the last row when he puts it on my finger.    Gil's smart and successful.  The world is full of people who dream of writing the great American novel. Let me handle him.  He likes to please me - is that so terrible? Oh gosh - I have to go - Paul arranged a private tour of the Rodin Museum.    Don't forget, Dad invited you to join us at a wine tasting tonight.        I don't think I've ever seen your cheeks so red.  Sure.  Oh come on - although if you're just going to sit there and obsess over where the fire exits are.  Well I can go, right?  I'm not tired and I'm dying to dance. I'll just meet you back at the hotel.  Isn't it great we're all on holiday at the same time.  I can't introduce him to tennis - Daddy's having the damndest time pressuring him to learn golf.  He won't let anybody -  That's what he needs, to have it read by someone who really knows and wouldn't pull any punches. The problem is - when it comes to his writing he has no respect for anyone's opinion.  Lucky you didn't go last night. You'd have hated the music and the crowd - but I had fun.  What are you thinking?   You seem in a daze.  Is that what you were dreaming about? Your literary idols.  What does that mean?  I'd be thinking brain tumor.  Right, right - er where's my cold cream - we should knock off the idle chatter because we're going to be late.  You can work on it later. And we can use Mom's decorator's discount.  That's over twenty thousand dollars, Mom.  She's right, Gil.    Great.  What?   I'm not big on surprises.  Where are you taking me?   You made me rush through dinner. Dad wasn't finished with his profiteroles.  Where? And why are you carrying around your manuscript.  I don't know what it is you're carrying on about but this is not my idea of an amazing adventure. I'm exhausted from the gym and the massage.  Look - you want to walk the streets and \"drink in Paris by night\" - go ahead. I'm in the middle of a great book Carol lent me and if I'm asleep when you get in, don't wake me.  What time did you get in?     I was dead asleep.  We'll see.     Oh how about this?  Gil - Gil - Gil?  We should go. We're meeting Paul and Carol for a private showing at the museum.  It's a different museum and we don't need a guide. Paul's an expert on Monet.  We can see all those beautiful water lilies at his home.  I prefer Monet. I mean I love Turner but this is overwhelming.  Shhh. I want to hear what Paul's saying.  Gil pay attention and you'll learn something.  What have you been smoking?  Work - he likes to walk around Paris - the way the city is all lit up at night allegedly inspires him - It's okay. Paul and I are going dancing.  In bed with a bad oyster. See you later. Thanks for dinner Dad.  Did you get much work done last night?  Shouldn't we be getting dressed?    Paul says we have to see the countryside. He's taking us for lunch at this beautiful little inn. I know you like making love in the morning but I find it much sexier late afternoon - just before we go out to dinner. Except I always have to explain to my parents why your cheeks look radiant. Hey- I'm not going to force you. I know you're hot on your writing. I'll be happy when you finish this book and move on.  I forgot to tell you. Gil is not going with us to Mont St. Michel.  He writes, he rewrites, he rewrites his rewrites. He says Picasso never left his studio.  I said, Gil, you have absolutely nothing in common with Picasso ··· He just looks at me.  Daddy got chest pains.  Daddy had an angioplasty three years ago.  Why are you so dressed up?  You dress and put on cologne to write?  We were halfway to Mont. St. Michele and Daddy started to look pale.  We turned right around.  What's this.  What is that?     It's a present.  You got me something?  Let me open it.  Now I'm dying of curiosity. If it's jewelry I hope it's my taste - not like the moonstone necklace.  You never saw the necklace he got me. I've never actually worn it. You'll see why immediately.  That's just it, they're too simple.  Hey - where are my art nouveau earrings?  I've worn them here.  Both of them?     My ears are pierced.  You think it was the maid?  I remember seeing them there this morning.  I'll bet it was that maid. She was so snotty yesterday about turning out the beds.      (opening door, doctor is  Where did you find them?  The bathroom?  Why the hell would they be in the bathroom?  I didn't drop them or leave them out ...  You're crazy - Paul and me? Where did you get such an insane notion?  Gil, your brain tumor's acting up again.  Nothing except they've all been dead for years.  You're a raving lunatic.  Gil -  Jesus Christ I'm dealing with a madman - okay - Paul and I had a few nights alone. We danced, we drank - you were always working - he's very attractive, he spoke to me in French - the whole mystique of this corny city got to me - it's over. We can put this all in perspective at home.  What?  What?  Have you met someone else?      All those late night walks.  Honey, you better listen to yourself. You're a psycho. You don't know what you're doing. You see everything here through magical colored glasses. You're a California film writer with a house in Beverly Hills with two Mercedes'. You're not some kind of twenties expatriate novelist.  With who? All your crazy hallucinatory friends? Mother was right about you - there's a part missing.  Anyone who's protagonist makes a living selling old cap pistols and Joan Crawford cut out books.  Go ahead. Walk the streets - gush over the Parisian light and the rooftops.  Daddy you didn't.",
        "Carol": "It was sudden. Paul got invited to lecture at the Sorbonne.  What are you doing tomorrow?    We're driving to Versailles.  Where are you two planning to live after the wedding?  La Boheme.  What's a nostalgia shop?  The usual menu of cliched horror stories.  Are you arguing with the guide?  It'll be so fun. Paul's an expert on French wines.  Have you tasted the '61? It's divine - though Paul found it - what?  If Gil doesn't want to go, I'll share Paul with you. I'm very democratic. And he's a marvelous dancer.  Back home we just joined a marvelous tennis club and Paul says you play. Does Gil?  I find Monet almost too pretty - like Renoir - sometimes it's cloying.",
        "John": "There are our sight-seers.  Can we continue this talk of moveable feasts at Grand Vefour because I'm starved.  And I'm proud of it.  Well I'll be perfectly frank - I'm excited over this corporate merger between our people and the French company but otherwise I'm not a big Francophile.  They've certainly been no friend to the united States.  Take it easy Inez.     Those little sips add up.  I'll always take a California wine but the Napa Valley is six thousand miles away.  Too rich for me.  Where does Gil go every night?  Uh-huh.  I don't know. I see what he earns but sometimes I think he's got a part missing. And I didn't like his remark about tea party Republicans. They're decent people who want to take back the country - they're not crypto-fascist, airhead zombies. Did you hear him say that?  No? I'd like to know where he goes every night.  Here's his photo. I want to know where he goes each night.  He's engaged to my daughter - to marry and I want to be certain she's making a wise decision. Naturally discretion is paramount.  Why not?   I don't understand it.  I'm sure it's indigestion.  They put a balloon in me.    Big deal.  I'm fine. I'm sure it's the beef bourguignon.  I'm fine.  See. Incidentally, it was very nice of you to come over so late.  said that first.  I had a private detective follow him - I knew he was up to no good.  I did. He saw him get into a car at midnight each night and he followed close behind.  I don't know. The detective agency says the detective is missing.",
        "Cole": "",
        "Porter": "",
        "Gil": "This is unbelievable - look at this. There's no city like this in the world. There never was.  Well that's just the awful era we live in but can you just imagine what this was like before - but even with all the fast food joints and the traffic - god, you just can't imagine what it was like years ago.  I really do - I love cities - I love big cities with all the crowds and all the action.  Look at these places - the streets - the boulevards.  I don't get here often enough is the problem. Every once in a while for a few days is nothing - my biggest regret is that I didn't settle here the first time I came. I should have gone with my instincts.  If I'd have stayed the first time I came by now I'd be a Parisian.  I'm thinking of a painting by Pisarro I've seen of Paris in the rain. Can you picture how drop dead gorgeous this city is in the rain? Imagine this town in the twenties - Paris in the twenties - in the rain - the artists and writers - I was born too late. Why did God deliver me into the world in the 1970's and in Pasadena yet.  It's romantic.  Or Paris when it's just getting dark - the lights go on - or at night - it's great at night - or no, sunset on the Champs Elysees -  Could you ever think of us moving here after we're married?  Like?  Hawaii is America.  If I had stayed here and written novels and not gotten into grinding out movie scripts.  But this is where all the artists came to live, to work - the writers, the painters.  Boy, I'd drop the house in Beverly Hills, the pool, everything - in a heartbeat. Look - this is where Monet lived and painted - we're thirty minutes from town. Imagine the two of us settling here. If my book turns out we could do it - you could just as easily make jewelry here.  I'm in love with you.  What a town.  I could easily see myself as a Parisien - strolling the Left Bank - a baguette under my arm - finishing my novel - at a table at the Cafe Flore. A Moveable Feast - Hemingway called it.  Well yes it was different then.  Americans eat dinner so early.    There's nothing wrong with your father and I disagreeing. That's what democracy is. Your father defends the right wing of the Republican party and I happen to think they represent sub-mental Neanderthals. But we respect each other's views - am I right?  Just no Wagner. When she walks down the aisle not The Ride of the Valkyries. Hey look, I just want to say that I am politically bipartisan in that, in my view, to be a politician of any party one must of necessity be a whore.  Don't we have a lot of commitments?  Don't we have something tomorrow? We were going to have lunch at the Brasserie Lipp. My old professor once actually saw James Joyce there. He said Joyce was eating sauerkraut and frankfurters.  It is actually -  Yes - but -  How was I anti-social?  Well they're your friends and I can't say I'm as taken with him as you are.  I find him a pseudo-intellectual.  I'm having trouble because I'm a Hollywood hack who never gave actual literature a real shot.  I keep trying to talk her into a little attic with a skylight in Paris -  Yes movie scripts are easier.  I don't like to discuss my work.  I'm afraid she's right. I just read the recent two volume biography of Rodin - Rose was definitely the wife, Camille the mistress.  I did - no question.    Camille- Rose.  Me? Why would I read a biography of Rodin?  To me they're all great.   What the hell do I know?  Pheromones, it's your pheromones.  You will admit she's a sexy woman.    I don't want to be a party pooper but I just want fresh air.  If it's okay with you, I'd really just like a little walk and go to bed. We can do it another night.  You go?  I - I - guess so ···  Huh?  You have the wrong person.  Look, I'm a little drunk -  This is a great old peugeot. I have a friend in Beverly Hills who has the same one - he collects -  What parties?  Where are we going?  It's not fair - my head is swimming from wine.  I do like champagne.  I'm drinking up.  You're American.  Oh I - I'm a writer.  Right now I'm working on a novel.  California.  I'm Gil Pen - oh you two have the same names as -  Scott Fitzgerald and -  Yes - its a coincidence.   I mean it is a funny coincidence.  I - I - I keep thinking that man at the piano - believe it or not I recognize his face from some old sheet music - what am I talking about here?  Yes but - he didn't write that song - did he? That's not possible -  I - I - I - I'm - I'm working on a - exactly where am I?  (looks around, drinks it  Gil Pender.  Hemingway?     Hey, is this some kind of a -  Liked - I loved - everything you wrote -  Ernest Hemingway - this is - I -  I'm sure - good bulls, true bulls ···  Me?   I just met -  Actually I don't know the Fitzgeralds that well -  I do - very much.  No.  A novel.  A man who works in a nostalgia shop.  Where they sell old things - memorabilia. Does that sound terrible to you?  Would you do me the biggest favor in the world - I can't even ask ···  Would you read it?  It's only about four hundred pages - if you could just give me your opinion.  You do?  But there's no one I really trust to evaluate it -  I could never compete with you -  No - no - that's okay -  Yes?  You could have Gertrude Stein read my novel?  I have to get it.   It's at the hotel.    Calm yourself - get a grip, Gil - deep breaths - been quite a night - Fitzgerald - Hemingway - the Hemingway - Papa - where do I meet him - he never said.  Uh-huh.  If I told you I was with Ernest Hemingway and Scott Fitzgerald last night, what would you say?  But if I wasn't dreaming -  If I told you I spent time with Hemingway and Fitzgerald and Cole Porter -  Can I tell you Zelda Fitzgerald is exactly as we've come to know her from articles and books - she's mercurial and moody and she does not get along with Hemingway - and Scott knows Hemingway's right about it but you can see how conflicted he is because he loves her -  Actually I wanted to stay and work on my novel - it needs a little polishing.  Eighteen thousand dollars?  Yes but we haven't even found a house yet and I'm trying to keep expenses down so I can turn down jobs.  I know you love Malibu but -  Er - of course when you think of it that way it does help amortize the eighteen grand.    You will be. Believe me.  You're going on one of the most amazing adventures of your life.  You'll see - you'll see - and your jaw will drop.  Inez.    I remember the river - the clock struck midnight - I - the clock struck midnight! Yes - On the dot of midnight I  Weren't you scared?  Getting killed.  It's my biggest fear.  Yes but -  My fiance is very sexy.  I don't know about that -  Pender.    Did my opening lines really get to you that strongly?  Me too.     I was born too late.  You speak very good English.  Yes - and how long have you been dating Picasso? My god, did I say that?  Oh - I - no, I didn't mean anything - you know - to pry ··· born in Paris?  No, I do.  Not Modigliani? Was it Modigliani? You lived with Modigliani?  My god you are a whole different level of art groupie.  Nothing - I'm -  Actually I'm visiting.  Believe me, I want to but it's not that simple.  Oh that's okay - I'll drop by - it'll be easier for you - if that's okay.      Wonderful but forgettable.     I've seen that picture.  Not late. I find these midnight strolls are very good for me creatively - without the distractions of the day - I'll probably take another long walk tonight.  Yes - very beautiful.  Love his music - we're very close - Cole, Linda and I.  (coming out if, realizing  With the same sharp guide?  They say Monet used to -  Er - I have to differ with you on this one.  If I'm not mistaken this was a failed attempt to capture a young French girl named Adriana - from Bordeaux - if my art history serves me - came to Paris to study costume design for the theatre. Believe she had a brief affair with Modigliani - then Braque - that's where Pablo met her - er Picasso. You'd never know it from this portrait but she's quite subtly beautiful.  And I'd hardly call the picture superb. It's more of a petit bourgeoise statement of how Pablo er Picasso sees her, saw her - he's distracted by the fact she was a volcano in the sack.  I was at Gertrude Stein's - she's almost finished with my novel. And the Fitzgeralds invited me over and said you'd be here - you and Pablo.  That was Djuna Barnes?   No wonder she wanted to lead.  Only for bargains.    I hope it was nothing serious with you and Pablo?  I understand why they all want to paint you - you're so damn interesting to look at in a lovely way.  I don't want to talk about my book. I want to enjoy Paris by night.  That's putting it mildly.  There's no book or painting, or symphony or sculpture that can rival a great city. All these streets and boulevards as a special art form.  When you think in the cold, violent, meaningless universe Paris exists - these lights - I mean nothing's happening on Jupiter or Neptune or out beyond - but from way out in space you can see these lights in the whole dark void - the cafes, people drinking and dancing - I mean for all we know this town is the hottest spot in the entire universe -  You're very kind. I would not call my babbling poetic.  I'm ashamed to admit I'm attracted to all of them. I like cheap-sexy. I know it's shallow.  Well, that's the most interesting thing I've ever heard in my life - I'd like to think about that for awhile.  Because he believes in his soul that progress is not automatically for the better.  Say - is that who I think it is?  Scott loves only you. I can tell you with absolute certainty.  No you're wrong. I know.  Trust me.      I know.  Take this.  A Valium - it'll calm you down.  Only since Inez and I became engaged. I've had these anxiety attacks - I'm sure after the wedding they'll subside.  Er - it's the pill of the future.  I'll try and score some more for you. And I have some Xanax at the hotel - it's another one you'll like.  Yes - I - I mean it's in the future.  You'd like Inez - she has a sharp sense of humor - and she's sexy - not that we agree on everything.  Actually the small things - the important things we don't - she'd like to live in Malibu and that I'd work in Hollywood - but I will say we both like - er - er Indian food - not all Indian food - pita bread - we both like pita bread -  I'll walk you home -  No, I wouldn't think -  Yes - I remember -  A rhinoceros?    I never thought about it.  I'm sure I look sad. I'm in a very perplexing situation.  My god, I own a surrealist print - only a print by Magritte.  It sounds so crazy when I say it and you'll think I'm drunk but I've got to tell someone I'm from a different time - a whole other era - the future - and I pass from the two thousandth millennium to here - a car picks me up - I slide through time -  Look, you're sur-realists - but I'm a normal guy - See, in one life I'm engaged to marry a woman I love - at least I think I love her. Christ, I'm supposed to love her if I'm marrying her.  In a dream - which is fine for you because you guys dabble in dreams.  Adriana is her name. And I felt drawn to her - but it wouldn't matter - men much greater than me, profound artists - she's drawn to geniuses - and they to her.  Of course my biggest problem is reality. Reality is nothing more than a dream - we all exist in the dream of a dog.  I was born in the wrong time.  I see an insurmountable problem.  Er - some - yes - I'm beginning to think my book may be too realistic - that I've missed some chances to let my imagination run wild and not be so damn logical ···  C'mere - you always look great in the morning.  I have to work. I'm working like a demon but I can't resist you half dressed like that.  Hello - Bonjour - I'd like to ask you a question about Rodin.  He loved his wife, he also loved his mistress - is it really possible to be in love with two women?  God it's so French. Er - you remember me?  Yeah, pedantic - perfect word. You're very observant. I need some advice. I'd like a woman's take. A French woman - an observant French woman. I met some woman that I very quickly became smitten with. Smitten?  I'm engaged to be married. I know Rodin had a wife and a mistress but I'm American - we can't handle that - we're monogamous.  Yes. Her name's Adriana. Right now she's living with Picas-- with a Spaniard - er he paints - fairly well. ··  Love him or me? Well I hardly think, me. But we've just met. See, another very gifted man flirts with her, a writer. All these geniuses fall in love with her. And what am I? And then of course there's another big problem. I can't exactly explain.  I don't know whether to call it an age difference - or a problem of geography - I'm so messed up. I'm not Hemingway, I'm not Picasso, I'm not Rodin. I'm just a guy who was born too late.    Tom Eliot? Tom - Stearns - T.S. Eliot? T.S. Eliot?  I'm stunned, stunned - Prufrock - my mantra -  May I tell you where I come from they measure out their lives in coke spoons.  I didn't mean to intrude.  What?  They're on Mt. Kilimanjaro?  Still, those sculptures -  Any Cole Porter?  I was kidding you realize.  I'm surprised you're so familiar with his work.  Yes - he was in love with your hometown. You're a Parisiene?  How much.    It's a little complicated to explain. Thanks for translating -  She finds him no genius - naive and unassuming - that's not exactly dazzling.     Ohmigodl   What are you doing back?  Really?  Me?   No - I was just writing.  I took a break and showered. I think better in the shower. All those positive ions.  That's terrible.  No - sure - is there anything I can get you, John?    Yes - yes ··· it is. Because it's gift wrapped ··· but er - you're not supposed to see that - it's a surprise.  It's nothing great - from the flea market.  No! No - not now ··· I got it for - I mean to give it to you at a special dinner - just leave it ···  You didn't like the moonstones? They're understated yet elegant - Don't you always say that, ha, ha .·.  I thought you'd like their simplicity.  You probably didn't pack them.  I guess you lost them.     They probably dropped off.  Gee I wouldn't jump to any conclusions. I mean an accusation of theft.  Oh god -  The maid was very sweet.  Look! Look! Are these what you're missing?  They were in the bathroom.  Right out on the sink.  Well you're under stress ···  Maybe you thought you put them away and left them out or dropped them, and the maid found them and left them out where you could see them easily.  The main thing is they're not stolen.  Five hundred francs? For a Matisse?  Gee, why don't I pick up half a dozen? I could clean up - but how's all this possible - I should have paid more attention in my physics class ···  Oh er - I brought a rewrite of the first few chapters of my book and was hoping you would tell me if you thought I was on the right track.  Er - have you heard from Hemingway?  By herself?  I came to find you.  Let's just say as a writer I see into women's souls and I sense that you have very complicated feelings towards me.  I'm not so sure about anything anymore - can we just go where it's quiet?  Oh, Mr. Bufiuel, I had a nice idea for a movie for you. Yes?  A group of people are at a formal dinner party and after dinner when they try to leave the room, they can't. Why not?  They just can't seem to exit the door. But why?  And because they're all forced to stay together the veneer of civilization quickly comes off them and they behave as who they really are - animals. But I don't get it - why don't they just walk out of the room?  Just think about it - that's all I'm saying - maybe one day you'll be shaving and it'll tickle your fancy. I don't understand - what's holding them in the room?  I don't know but I do know that for a brief moment, when I was doing it, I felt - immortal.  Because life is too mysterious for me.  I've always been a logical person. I never took chances - did anything crazy - like move here when I first came or take a shot at being a real writer, not a Hollywood hired hand - but I feel like letting everything go.  Here.  What's going on?  I don't know what it is about this city but I must write a thank you note to the chamber of commerce.  The present - Yes, the present always seems worse than the past but it can't be - to always think this generation is stupider and coarser than the last - and yet - here we are at Maxims tonight and yes, it's fabulous.  We shouldn't bother him.  This much French I know.  I'm American. Oui -  Yes, I love your pictures too.  Parlez Anglais?  Er - yes - Monsieur Lauren - Ralph. Shouldn't you be in Tahiti?  I wouldn't get into too many details with them. Let's just leave it that we're temporarily passing through.  What are you talking about?  But I love the Jazz Age.  But what happened to the twenties and the Charleston and Cole Porter?  It's not the present for me - I'm from 2010.  I dropped in on you just the way we dropped in on the 1890's.  I wanted to escape my present just like you wanted to escape yours. To a golden age.  To me they are.  Yes but don't you see - to these guys the golden age was the Renaissance. They'd all trade the Belle Epoque to paint alongside Michelangelo or Titian. And those guys probably imagine life was better when Kubla Khan was around. I'm having an insight. A minor one but that accounts for the anxiety of my dream.  Last night I dreamed I ran out of zithromax - and then I went to the dentist and there was no novacaine - these people have no antibiotics -  And even in the twenties - no dishwashers - no 911 if your appendix bursts - no \"movies on demand\" ·  Because if you stay here and this becomes your present, sooner or later you'll imagine another time was really the golden time. And so will I - I'm beginning to see why it can't work, Adriana. The present has a hold on you because it's your present and while there's never any progress in the most important things, you get to appreciate - what little progress is made - the internet - Pepto- Bismol. The present is always going to seem unsatisfying because life itself is unsatisfying - that's why Gauguin goes back and forth between Paris and Tahiti, searching - it's my job as a writer to try and come up with reasons why despite life being tragic and unsatisfying, it's still worth it.  Yes, that one I regretted but it was a real choice and I made the wrong one. This is a choice between accepting reality or surreal insanity.  No - I love you - but this way lies madness - and if I'm ever going to write anything worthwhile I've got to get rid of my illusions and that I'd be happier in the past is one of them.  Goodbye Adriana.     Good luck.    Hemingway read it?    What was his suggestion?  with -  It's called denial. Thanks again. You're Ezra Pound right? T.S. Eliot says you owe him forty francs.  From Ernest Hemingway. He thought it out and it makes perfect sense.  There's nothing crazy about Ernest Hemingway or Gertrude Stein or Fitzgerald or Salvador Dali -  It was William Faulkner who said, the past is not dead.  In fact, it's not even past. Actually I ran into Bill Faulkner at a party.  I guess I'm too trusting. I'm jealous and also trusting - cognitive dissonance, Scott Fitzgerald speaks of it.  I know it Inez - you can fool me but not Hemingway.  I'm not going back.  I'm staying here. It's not the romantic fling. Paris is Paris. It's that I'm not in love with you.  A lot has happened    to me since we got here. I won't     begin to bore you - but - I know    what that feeling of love is    and it's not us.  I was attracted to another woman but it was the whole deal - meeting Gertrude Stein and Hemingway and Dali and Scott and Zelda -  If I'm not happy I'll move back. But right now I'm going to stay.  You're better off without me.  Goodbye Inez.  Hey, I know you - the girl at the flea market.  What are you doing here?  What's your name?  Gabrielle, - I'm Gil - I just moved to Paris this week.  Can I walk along with you or can I buy you a coffee? Oh god, it's starting to rain.  Oh what a thing to say.     I couldn't agree more.  Hey what are those bells?  Midnight - right - right - pretty name.",
        "Zelda": "If you count Alabama as America which I do. I miss the bathtub gin. What do you do?  What do you write?  Oh yes? I'm Zelda by the way. Oh Scott - Scott come over here. Here's a writer from, where?  You have a glazed look in your eye. Stunned, stupefied, anesthetized, lobotomized -  I know if I put my mind to it I could be one of the great writers of musical lyrics not that I can write melodies - and I try - and then I hear the songs he writes and I realize I'll never write a great lyric and that my talent really lies in drinking.  I know what you're thinking - this is boring - I agree - I'm ready to move on - let's do Bricktop's, Scott, I'm bored, he's bored, we're all bored.  Une bouteille de bourbon.    I might've known you'd hate it.  You liked the story but he hates me.  I'm jumpy - suddenly I don't like the atmosphere here anymore. Where are you going?  He's going to St. Germain.   I'm going with him.  If you're going to stay and drink with him I'm going with the toreador.  Please leave me alone.   I don't want to live.  It all became clear to me tonight. Scott and that beautiful Countess - it was so obvious they were whispering about me and the more they drank the more he fell in love with her.  No, he's tired of me.  How?   How?  But you just met us. How can you know anything. My skin hurts. I hate the way I look.  What is this?  I never heard of Valium.   What is this?  But pills wear off - and then it all comes back. No, I won't kill myself. I'll write and I'll write more passionately than Scott. I'll work harder.",
        "Fitzgerald": "37                                                                  37",
        "1920's": "",
        "Partygoer": "",
        "Museum": "13                                                                13   35                                                                      35    45                                                                   45",
        "Guide": "This is, of course, Rodin's most famous statue. A cast of this work was placed next to his tomb. Rodin wished for it to serve as his headstone and epitaph.  Exactly correct. You know your art history, monsieur. The design -  Yes, she was an influence - though Camille was not the wife but his mistress.  Yes.      Rose was the wife.  Yes, in the last year of their lives.  Ah, non, non, je suis certaine.  Yes?  He loved both in different ways.  I do. Qui - you were with the group, the pedantic gentleman.  Uh-huh.  You're engaged and you met a new woman -  Yes - and does she love him?   Or you?  Yes?                The writer clearly has feelings for this man Gil. That's your name, no?  To some women naivete is   endearing. And she's romantic. She    dreams of Belle Epoque Paris and a   gift of earrings and making love   with this man."
    },
    "imdb_rating": "7.6",
    "description": "Gil and Inez travel to Paris as a tag-along vacation on her parents' business trip. Gil is a successful Hollywood writer but is struggling on his first novel. He falls in love with the city and thinks he and Inez should move there after they get married, but Inez does not share his romantic notions of the city or the idea that the 1920s were the golden age. When Inez goes off dancing with her friends, Gil takes a walk at midnight and discovers what could be the ultimate source of inspiration for writing. Gil's daily walks at midnight in Paris could take him closer to the heart of the city but further from the woman he's about to marry.—napierslogs",
    "name": "Midnight in Paris",
    "genres": [
        "Comedy",
        "Fantasy",
        "Romance"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTM4NjY1MDQwMl5BMl5BanBnXkFtZTcwNTI3Njg3NA@@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}