{
    "filename": "Mission-Impossible_script.txt",
    "imdb_id": "tt0117060",
    "imdb_url": "https://www.imdb.com/title/tt0117060",
    "characters": [
        "Ethan Hunt",
        "Hannah",
        "Matthias",
        "Drunken Male IMF Agent",
        "CIA Analyst William Donloe",
        "Kittridge",
        "Luther",
        "Sarah Davies (as Kristin Scott-Thomas)",
        "Max",
        "Drunken Female IMF Agent",
        "Jim Phelps",
        "Krieger",
        "Kittridge Technician",
        "Claire (as Emmanuelle Beart)",
        "TV Interviewer"
    ],
    "dialogues": {
        "Ethan": "We got it.  On your feet.  Walk, just walk.  Start walking.  Talking's good, walking's better.  If you're gonna do this again Claire, It's not gonna be on my watch.  Jack.   Yeah, well, Jim, fact is I've got more than ninety days leave coming.  I thought I'd take some now.  Oh?  What's the problem?  Tell you what?  What problem?  I guess.  Why not?  How was Chicago?  You're going to use Walter?  Isn't he chairing the Armed Services hearing?  He won't be back in a hurry?  Sure.  If the main character does.  Always.    <u>Jack</u>?  I believe we did have a young man named <u>Jack</u>.  Not a reliable man, as I recall.  Constantly late or behind in his work.      Right, right.  Good.  Jack we're in position.  Jack.  Jack.  OK.  Taking Golitsyn's exit.  Jack, open the doors.  He's got it.  Saved your ass again Jack.  Sarah's reconsidering.  Claire, transport in five minutes.  In position.  Jack open the door, let the package roll.  Stairway, youíre wrapped, go to transport.  Cut the power.  Cut the power Jack.  Do you hear me.  Come on, Jack, come on.  Jack.  Jack.  Jim.  Jim.  Heís in the open.  Can you lose him?    <u>Negative</u>, Golitsynís on the move.  Sarah eye on the package.  Jim, Iím coming to you.  No, weíre going to recover the disk, understand?!  Now move!  About two hundred yards from the bridge.       Central Europe.  Unsecured.  Bravo Echo one one.  Go secure.  Theyíre dead.  My team.  Claire, Jack, even Jim - - Hannah, maybe, I -- donít know  They knew we were coming.  Golitsynís dead too.  The disk is gone.  Do you read me?  <u>The list is in the open</u>!  I donít think so.  Yes.  Youíre in Prague?  No sir.     Yeah.  Yeah.  I follow you.  You mean <u>I've</u> lost enough agents for one night.  Who else is left?  Why was there another team?  Of IMF agents.  At the Embassy.  Tonight.  Let's see if you can follow me around this room. The drunk Russians on the embankment at 7 and 8 o'clock...The couple waltzing around me at the Embassy at 9 and 11. The waiter behind Hannah at the top of the staircase - Bowtie, 12 o'clock. The other IMF team.  You're worried about me. <u>Why</u>?  The arms dealer.  But the list Golitsyn stole was a decoy.  This whole operation was a molehunt.  How about if we just go quietly into the bathroom and I wash your mouth out with soap - you pathetic button down bureaucratic asshole.  Kitteridge, you've never seen me very upset.     Job.  Job 3:14.  March fourteen.  Job 31 March.  Job three fourteen.  Job -- It's <u>Job</u>!    Max -- Goods tainted.  Consider extremely hazardous.  DO NOT USE.  Fate will be that of kings and counsellors who built for themselves palaces now lying in ruins.  Must meet to discuss a.s.a.p.  What are you doing here?!  Don't move.  You were in the car!  Shut up!  I saw you.  You were in the car.  Don't give me that!  I was on the bridge.  There was nobody on the bridge.  Dead.  Dead.  Dead!  Wake up, Claire! Jim's dead, they're dead.  They're all dead!  Take off your coat.  Take off your God damn coat!  Where were you?  That was four hours ago!  Who sent you? Did they send you here?  Did they send you...Did they send you?  Who sent you?!  Who sent you?  I've been disavowed.  They think I killed Jim and everyone else.  Somehow a hundred thousand dollars found its way into my parents' bank account.  Kittridge assumes I'm a mole they've been tracing and I've been in the employ of an arms dealer, Max, for the last two years, to get him our NOC list.  I'm going to get it for him.  Whoever the mole is, I think goes by the name of Job, at least part of the time. 1 can't find him, but if he knows 1 have the NOC list, he'll find me.   Claire, Claire, Claire, if you're not dead, he's going to assume you're with me.  I'm going to answer it.    Excuse me, could I trouble you for a match?  Why?  I thought I was going to see Max.  Then what am I doing here?  I don't communicate very well through a shroud.  I'm willing to take the chance.  I need one hundred thousand dollars.  Why not?  You gave Job a hundred and twenty five thousand.  That depends.  Whether you like a paradox.  I want a hundred and fifty thousand dollars.  The disk Job sold you is worthless.  It's bait, part of an internal molehunt.  Like Job?  I'm NOC.  Was.  <u>Now</u> disavowed.  That's the question I want to ask Job.  Even so, I'm sure you could arrange an introduction.  Because I can deliver the actual NOC list.  The one you have is not only worthless, it's certain to be equipped with a homing device to pinpoint your exact location.  Okay, boot it up and in anywhere from thirty seconds to ten minutes you're gonna have Virginia farm boys hopping around you like jackrabbits.  Tell you what.  How good's the RF scanner you used in the car?  Okay, use it.  But I suggest pack up first.  I'd say you've got about two minutes.    Thanks, Max.  Or is it Maxine?  What was your deal with Job?  <u>Ten</u> million.  Ten million in negotiable U.S. Treasury certificates, in bearer form, coupons attached.  And one more thing -- your personal assurance that Job will be at the exchange.  How will you make sure Job will be there?  I'm not being dropped anywhere without my money.  I wouldn't dream of it.  I deliver the NOC list, Max delivers Job.  You're sure about this?  We need help, and we don't have time. They have to be local.  Simple game.  Four players. Exfil opens the pocket -- -- cyber ops lifts the wallet.  IMF mainframe.  In Langley.  Information.  Profitable.  This doesn't sound like the Luther Stickell I've heard of.  What'd they used to call you?  The Net Ranger?  Phineas Phreak?  The only man alive who actually hacked NATO Ghostcom.  You don't know what you're missing. This is the Mt. Everest of hacks.  May take a little time. That's not what Claire tells me about you.  Luther, I guess you're all out of excuses.  Luther, relax, it's worse than you think. The terminal's in black vault lock-down.  They missed nothing in that room.  Even the vents have laser nets over them.  Inside, there are three countermeasure systems that can only be deactivated by authorized entry.  Which we won't have.  The first system is sound-sensitive, anything above a whisper sets it off. The second system is on the floor and pressure-sensitive --  --and the third detects any increase in temperature.  Even the body heat of an unauthorized person in the room will trigger it.  All three systems are state of the art.       May I come in?  It's cash. And a second passport. If anything goes wrong when we're inside, if you sense even the slightest deviation don't look over your shoulder, you walk away - you hear me? Just walk away.  I didn't say that.  I just need you to be safe.  What about me - Jim called an abort - I didn't comply.  I lost the team. I just need you to be safe.  Sorry.      I gotta go in there and shut it down!  Do you <u>want</u> to blow the fire through the whole building?  Let's move!  Zero body count.  Time up.  1 - 2 - 3 - Toast, toast.  Luther, I'm going in.  Don't disappoint me...Krieger, from here on in, absolute silence.  We're not outta here yet.  My contact is extremely shy.  Don't you mean this?  What's the matter, you don't know this trick?    But not <u>too</u> far!  I know what you're thinking, Krieger. You're thinking, back in the computer room -- I was up here -- he was down there -- .  He was carrying two discs.  <u>So</u> hard to keep track of these things.  I thought you had it!  Do you actually think I'd let you have the NOC list?  We did what we had to do.  Now I want you to hold onto it.  Because if you knew what you were getting into, you never would have done it.  Exactly, that's your job.  Tomorrow on the train, you can't let this list get out into the open.  What's the range of this thing?  I'll get you close.    Kittridge...  Don't...don't touch me...      I see you've been out visiting the folks.  Hauling Mom off to jail in shackles was an especially nice touch.  Can I ask you something, Kittridge?   If you're dealing with someone who's crushed, stabbed, shot and detonated five members of his own IMF team, how devastated do you think you're going to make him by marching Ma and Uncle Donald down to the county courthouse?  - and picked us up in the States -  Yeah, smaller countries don't computerize customs records -  You knew I liked the rentals at Liverpool Street.  I remember..  Jim, who do you think you're kidding?  A doctor's gotta look at that.  You can't sit up straight.  Kitteridge.  Oh my god!  Kittridge is the mole?  How did Kittridge do it?..  - first he took care of Jack in the elevator -  - he shot you on the bridge -  - he must have had back up take out Golitsyn and Sarah at the fence..  How did he do Hannah?  No.  No.  He could've taken out Hannah himself.  Why, Jim?  <i>Why?</i>  We donít have to, Jim.  Heíll come after us.  What he didnít get in Prague.  The NOC list.  A meeting tomorrow on the TGV, enroute to Paris.  If I supposedly deliver the NOC list to Max, Max has agreed to deliver Job to me. Iíll have Claire and Luther Stickell with me on the train.  Marcel Krieger will have helicopter transport waiting in Paris.  Jim...?  Youíre probably right.  Once we leave the safehouse, get in there and crash.  Iíll call you from Paris.  And get a doctor.        It doesnít, dear girl.  as long as you tell me where the money is.  What about Job?  Kittridge is Job.  Max delivered.  How far is he from Luther?  You are my eyes.  Stay with him.  Iíve got the money.  Meet me in the baggage car.  Of course - Iím sorry to hear you say that Claire.  Before London.  But after you took the Bible out of the Drake Hotel in Chicago.  I knew about Jim.  Youíve earned it.  Tell me something Claire, that night in Prague, was it you or Jim that blew up the car and scattered Hannah all over town?  Arenít you going to thank me Jim.  Ten million is better than six.  Youíre wrong about one thing.  Iím not the only one whoís seen you alive.  Jim, itís over.  Claire...Hey...  Claire.  I always have, Claire..  Red light, green light.  Asta Lasagna mother fucker.  About what?  Well my Mother was a little confused about how the DEA could mistake her and Uncle Donald for a couple of dope smugglers in the Florida keys.  Here's to  you, Luther.   To being off the disavowed list.  You're more than that, Luther.  They were mistaken about you and they're trying to show you they know it.  They want you back in.  You didn't tell 'em at the debriefing?    Just don't know why I'd be doing it.  He was a good guy for a long, long time. Just - not long enough.  Gotta catch my flight.. So.  How's it feel being a solid citizen again?  Well, Luther - if it makes you feel any better I'll always think of you that way.  No, thank you.",
        "Hunt": "",
        "Hannah": "En route.  He's heading to the denied area.  En route.",
        "Matthias": "Would you remove your hat please?  You wish to meet Max?  This is the price of admission.  You misunderstood.  No one sees Max.  Allowing Max to see you and hear what you've got to say.  If Max doesn't like what you have to say, you'll be wearing that shroud indefinitely.  Very well.  Twenty-six, twenty-seven.  So far so good.  Thirty-two and change.  Forty-four.  Forty-five.  Fifty-seven. Fifty-nine.  Twenty minutes.  Yes... Itís him.  Connection denied.  Itís not working.  I always check the batteries.  Itís working.",
        "Kittridge": "-- a former KGB Line X officer now working the international black market selling intelligence.  This morning, we learned that Golitsyn has stolen one half of a CIA NOC list, the list of our non- official cover agents working in Eastern Europe.  For security reasons, the NOC list is divided into two encoded halves. Golitsyn already has the cryptonym portion, which contains agent code names and targeting areas.  This portion is useless unless combined with the second half -- the true name list that is kept in the CIA station in our Embassy in Prague.  We believe Golitsyn plans to steal the true name list at an Embassy function tomorrow night.  Your mission, should you decide to accept it, is to obtain photographic proof of the theft, apprehend those involved, and return the stolen list.  I don't have to stress the importance of this matter, Jim.  We're keeping it internally black. Because of its urgency, I've already sent to Prague a team selected from your usual group.  Ethan Hunt will of course be your point man, as usual.  He's in Kiev; we're getting word to him now.  As always, should you or any member of your IM force be caught or killed, the Secretary will disavow all knowledge of your actions.  This tape will self- destruct in five seconds.  Good luck, Jim!  This is Kittridge.  Go ahead.  Whoís dead?  Are you damaged?  <u>Are you intact</u>?  Let's just bring you in safely, and then we'll worry about that, okay?  Were you followed?  Donít <u>think</u>, be <u>sure</u>.  Are you clean?  Location green.  One hour.  Iíll be there myself.  Heard a lot about you, Hunt.  Donít disappoint me.  One hour.  I can't tell you how sorry I am.  I know how much Jim in particular meant to you, Ethan.  Personally as well as professionally.  Passport, visas - you know the drill. We'll work the exfiltration thru Canada, debrief you at Langley.  Throw the Prague police a bone, you know toss them a few suspects.  Follow me?  We've lost enough agents for one night.  You seem hell bent on blaming yourself, Ethan.  Yes.  I see your point.  What?  I don't quite follow you.    For a little over two years now we've been spotting serious blowback in IMF operations.  We have a penetration.  The other day we decoded a message on the Internet from a Czech we know as \"Max.\"  That's right.  Max, it seems, has two unique gifts -- a capacity for anonymity and for corrupting susceptible agents. This time he's gotten to someone on the inside - he's put himself in a position to buy our NOC list. An operation he referred to as \"Job 314\".  The job he thought Golitsyn was doing tonight.  Correct the actual list is safe at Langley.  \"Golitsyn\" was a lightning rod, one of ours.  Yes, the mole's deep inside. And -- like you said.  You survived.  I want to show you something, Ethan.  Since your father's death, your family's farm has been in sub-chapter S and now, suddenly, they're flush with over a hundred and twenty grand in the bank. Dad's illness was supposed to have wiped out the bank account -- dying slowly in America after all, can be a very expensive proposition Ethan.  So, why don't we go quietly out of here onto the plane...  Ethan, I can understand you're very upset.  All right, enough is  enough Hunt. You've bribed, cajoled, killed - and relied on intimate loyalties to get away with it. You're determined to shake hands with the devil and I'm going to make sure you do it in hell.   The man's gone black, Barnes.  He's under until he decides to surface.  What can we do, Barnes?  Put a guy at the airport?  How many identities do you think Hunt has?  How many times has he slipped past custom, in how many countries?  These guys are trained to be ghosts.  <u>We</u> taught them how to do it, for Christ's sake!  Let's not waste time chasing him.  Make him come to us.  Everybodyís got pressure points.  Find out something that's important to him personally and you squeeze.  I can't believe what I'm listening to. Hunt just kicked us in the ass, <u>you</u> guys are standing here trying to figure out what kind of shoes he had on!  <u>I don't</u> <u>care</u> how he did it, I want to know <u>why</u> he did it!  Is he recruiting?  For what purpose?  Too short sighted.  This guy's proactive, he <u>initiates</u>.  The question is <u>what</u> does he want now and <u>where</u> does he need to get it and Barnes what the <u>hell</u> is that noise?!  Oh, for -- do we have to evacuate?   <u>Think</u>, for Christ's sake, you guys are mired in detail, open your minds, it's gotta be staring us in the face!  What does Ethan Hunt <u>want</u>?!  Okay!  And where is the list vulnerable?    Kittridge, yup?    I want him manning a radar tower in Alaska by the end of the day.  Just mail him his clothes.         Ethan, I want to reassure you that my first order of business after you come in is to get these ridiculous charges against your family dropped and eliminated completely from their files. Come in now, we can plea down the charges against you as well.  Certainly Ethan.  I don't know, Ethan. Suppose you tell me?  He wanted us to know he was in London.    Youíve got ten.  <u>Move</u>!  And if we donít find him - weíll search the whole train again.  High speed train.  No-one gets on.  No- one gets off.  High security.  Good place for a pass off to Max.  Heís putting on a show, Barnes.  I donít know. It didnít say on the tickets.  This is bullshit - we donít even know what Max looks like.  Good idea.  Get this door open.  Hello, Luther.  Whereís Hunt?  Where?  Good morning, Mr Phelps.  Maybe we'll just keep the courts out of this one.  You know, I would <u>love</u> to try.",
        "Luther": "In Langley?  The one in Virginia, Langley?  What are we downloading?  What kind?  I don't know.  This I don't know.  There was never any physical evidence that I had anything to do with that.. that.. With that exceptional piece of work.  You're all kidding yourselves. Even with top of the line crypto.  Cray access. STU 3's --  Thinking Machine laptops, I'm talking about the 686 prototypes -- <u>with</u> the artificial intelligence Risk chip --  And I get to keep the equipment when we're done.  I can't just hack my way inside.  There's no modem access to the mainframe, it's in a stand-alone.  I'd have to be physically at the terminal.  And you really think we can do this.    Hi there.  Type this password: AW96B6.  Return.  Go to the files menu, find the NOC list file.  Open \"NOC List.\"  Put your diskette in.  Double click on the NOC list.  Ok, good!  It's scrolling.  0K, now we're going to download.  Edit menu.  Select \"copy to disc\".  You're downloading. When it's all green it's done.  Holy mother of God.  You've done it.  Eject it.  He's rolling.  Get moving!  Get out of there -- get out of there --  He's at the vault - get moving!  1 yellow, 2 yellows...Toast!  You're not <u>moving</u>!  Phew!  NOC list.  Krieger <u>did</u> have the NOC list.  What makes you trust me?  I'm not letting this list get out in the open.  It's hard to tell.  I'm gonna have to be close.  Mr. Kittridge, the NOC list is being modemed off the train.  I think this is what you're looking for.    Reach your folks? How they feeling?  The official apology from the Justice Department, the VIP treatment, you know, the whole nine yards.    Hey, I'm the flavour of the month!  Sure.  They want me back in so I won't break in!  They <i>still</i> can't figure out how we did it.  I figured I'd let 'em reinstate my back pay, give me a promotion, check out my office at Langley and <i>then</i>, maybe, talk about it.  Why don't you come back with me?  You really liked Phelps, didn't you?  Oh man...I don't know.  I'm gonna miss being disreputable.",
        "Max": "Who are you and what are you doing here?  Really?  And you thought if you simply showed up I might give it to you?  The penny drops.  <u>You</u> are <u>not</u> Job.  Yes, Job is not given to quoting Scripture in his communications. And there was its tone -- aggressive but playful.  Job is not playful.  So you're something of a paradox.  On what?  It's quite out of the question.  And how might you know that?  Are you another Company man?  Ah, but, we're asking about you.  Why, may I ask?  I don't know Job any more than he knows me.  Why should I?  It's easy to say the disk is worthless when you say I can't look at the information and <u>see</u> if it's worthless. Not a tenable position, sir.    Very good.  That's not so good for you, my friend.                         Oh dear, Gunther will never let me use one of his apartments again. Phew, sorry I doubted you, dear boy. You're a good sport.  Do accept the compliment.  I don't have to tell you what a comfort anonymity can be in my profession -- like a warm blanket. My deal with Job was subject to a successful boot scan.  Obviously it didn't pass muster.  Deal's off.  Six million dollars.  I'll give you the same.  But I want the complete list now, not just Eastern Europe.  I won't do this piecemeal, it's too dangerous.  I want the <u>entire</u> list, the true name of every non-official cover agent throughout the world.  Done.  Bring it to me in London.  I want it by the end of the week.  How will you make sure I'll have the list in three days?  It's been a delight.  Now where can I drop you dear boy?  I'm going to have to front you personally.  Don't lose that money without losing your life.     How long until we reach the Chunnel?      The possibility alone is worth ten million.  Baggage car, rack 3.  Silver briefcase.  Combination 314.  I wouldnít worry about him.  Once youíve got the money -- heíll find you.    Whatís the problem.  Try it again.  Is something wrong with the phone? Well is something wrong with the batteries?  Run it through from the top.  Phew!  Weíve got five minutes...  Damn!  My lawyers will have a field day with this.  Entrapment, jurisdictional conflicts --  I'm sure we can find something I have that you need.",
        "Jim": "",
        "Phelps": "No, I prefer the theatre.  Perhaps you'd choose one for me.       A hundred and sixty-seven, I think it is. Take it all, if you want.  <u>After</u> this one.    I don't know, I had to go to Chicago again.  You were in Kiev.  You tell me.  When you started noticing your short term memory loss.  What <u>the problem was</u> you and Claire had in Kiev?    Ethan, you <u>can't</u> burn out.  Because I can't afford it. And because you'd burn up before you'd burn out.  Wonderful.  Ran into a convention of auto dealers at the Drake Hotel.  You hear the one about the astronaut who comes back from the first manned flight to Mars after two years?  His wife's got a year old kid.  So he says \"All right.  Who was it?  My friend Harry?\"  She says no. \"Oh, it was my friend Sammy.\"  She says it wasn't Sammy.  \"Oh, I suppose it was my friend Lou.\"  \"No, what's the matter, don't you think I have any friends of my own?!\"  Boy, you really are grim. Come here, take a look.  Beyond Charles Bridge there is our Embassy.  See it?  Tomorrow night, if anything goes wrong, this guy will steal the names of our agents in every country all over Eastern Europe.  Up for grabs to the highest bidders -- third world terrorists, arms dealers, drug lords -- any and everybody who'd love to get rid of long term coverts like us, and some very dear friends among them.  If they're exposed, they'll be executed.  Come over here.  Take a lock at this.  He's our guy.  Not this week. This week he's flyfishing at the Oughterard Slough in County Kildare, with one of our best Irish guides.  No, not in a hurry.  What do you think? You think the plot'll work?  If you were me, Ethan, who would <u>you</u> trust to make him believable?  Are you gonna take it?  Thank you.  Ethan.  Jack's inside.  Window's open by twenty-three hundred.  Sarah, mark the package and go to two.  Hannah.  He's marked.  Lets go.  Hannah, pull the shade (or - Hannah go to night vision).  Jack's pinned down Sarah.  Should be a second.  Keep dancing.    Get moving, Ethan.  He's rolling to you.    Opening the doors.  Go under.  Jack, what are you doing?!  I donít have it -- <u>I donít have</u> <u>control</u>!  Man down.  Stay where you are.  Iím on my way.  En route.  Iíve got a shadow.  No.  Abort.  Abort.  Thatís an order.  No, damn it, no, I said ABORT!  Where are you?  Theyíre covering this frequency, Ethan. Cut all radio communications.  Repeat. Cut all radio communications.  Ethan, what are you doing?  I needed you, Ethan. 1 needed you on the bridge, and -- you weren't there.  Ethan? Ethan?  You're a hard man to catch up with.   ..the next day I managed to drag myself to the safe house, must've just missed you..anyway, I checked our aliases.  - but you left before I could get there and I could check just so many places..  - so I watched Europe. Once you showed up in England..it was easy.  Hey, I showed 'em to you!  I can sit up straight.  I just can't..sit up straight very well.  It's not important!  I saw who shot me.  Ethan, I saw the mole.  It was Kittridge. <i>Kittridge!</i>  Yeah.     ..when you think about it, Ethan, it was inevitable..no more Cold War.  No more secrets you keep from everyone but yourself, operations you answer to no one but yourself.  Then one morning you wake up and find out the President of the United States is running the country - <i>without your permission</i>.  The son-of-a- bitch!  How <i>dare</i> he?  You realize itís over, youíre an obsolete piece of hardware not worth upgrading, youíve got a lousy marriage and sixty-two grand a year.  Kittridge, weíll go after that no good son-of-a-bitch, big time!  Whatís going to make him do that?  Jesus, Ethan.  Good for you.  Tight security.  No guns.  Real plus.  I was sitting in a cafe waiting for you and suddenly there she was, standing in the rain just outside the safe house..alive and beautiful..and thinking Iím dead and gone.  God knows what sheís had to do forget about me to keep going and get the job done, I..  - no.  She canít know about me.  No one can.  Not til this is over.  Thereís too much at stake, Ethan.  I usually am.  You got it.  Good luck.  (assembling gun in sleeping compartment  Yes.  Ethan Hunt, darling.  Remember him?  Course he did.  Just exactly when he knew is something of a question.  Before or after I showed in London, mind telling me, Ethan?  They stamped it, didnít they?  Those damn Gideons.  Two minutes til Krieger shows.  Thisíll have to be quicker than Iíd like. Certainly quicker than youíd like.  Why the masquerade?  Why take the risk? Well, Claire, youíve asked the question and you are the answer.  But, he didnít know about you.  In all fairness, Ethan, Claire was never convinced her charms would work with you. But I was supremely confident - having tastes the goods.  \"Thou shall not covet thy Neighbourís wife\", Ethan.  Oh, Ethan is in love with you, Claire, make no mistake about it.  And like all the worldís lovers, heís tortured by the same, one pathetic question - \"does she feel the same way I do?\"  Well Claire do you?  Have you been exploiting his feelings or returning them?  Count it.  Keep counting Claire.  Satisfied?  Fold it.  Fold it tight.  Donít flatter yourself - six was for <u>Eastern Europe</u>.  You made a lousy deal - ten for the world?  What is that?  But I needed you for the transfer with Max.  I got a little extra change;  and you got a little extra too.  Sorry Ethan.  Times up.  Say goodbye.  You son of a bitch.  Now we donít have to eliminate him?  You like that, donít you Claire?  Donít you?  Ethan - Iíve always taught you, nothing can be more dangerous than the truth.  It can kill you.",
        "Krieger": "Bank?    <u>Inside</u> CIA headquarters at Langley.  Is he serious?  If we're going to Virginia, why don't we drop by Fort Knox?  I can fly a helicopter right in through the lobby and set it down inside the vault and it will be a hell of a lot easier than breaking into the God damn CIA.  May take a little time.  Twenty-four hours.    Merci.  You contacting your buyer? Ethan?  Ethan?  Oh, 'scuse me Mr. Hunt? MAX -- Now might be an excellent time to interpret Scripture face to face. Meet on TGV, noon tomorrow.  Take seat 27.  Bring our mutual friend Job.  You're not going to any meeting without me.  I don't think you're in any position to give orders, do you?  Not while I'm holding this.  Stay out of this.  That's not it.  That's not the list.    Try any sleight-of-hand with my money and Iíll cut your throat.",
        "Technician": "Oh, God.  He's in England.",
        "TV": "",
        "Interviewer": ""
    },
    "imdb_rating": "7.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BOTFhMWY3ZTctNTJlOC00Y2UwLThmOGUtMWU4NDI1Yzg4ODRkXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "Based on the hit television series. Jim Phelps (Jon Voight) was sent to Prague for a mission to prevent the theft of classified material. His wife Claire (Emmanuelle Béart) and his trusted partner Ethan Hunt (Tom Cruise) were members of Phelps' team. Unfortunately, something went horribly wrong and the mission failed, leaving Ethan Hunt the seemingly lone survivor. After he reported the failed mission, Kittridge (Henry Czerny), the head of the agency, suspects Ethan of being the culprit for the failed mission. Now, Ethan uses unorthodox methods (which includes the aid of an arms dealer going by the name \"Max\" (Vanessa Redgrave)) to try to find who set him up and to clear his name.—John Wiggins",
    "name": "Mission: Impossible",
    "genres": [
        "Action",
        "Adventure",
        "Thriller"
    ]
}