{
    "filename": "Monte-Carlo_script.txt",
    "imdb_id": "tt1067774",
    "imdb_url": "https://www.imdb.com/title/tt1067774",
    "characters": [
        "Concierge at Grand Belle",
        "Security at Grand Belle (as Attila Árpa)",
        "Emma",
        "Grace /Cordelia Winthrop Scott",
        "Pam",
        "Amanda",
        "Madame Valerie",
        "Doorman at Grand Belle",
        "Owen",
        "Robert",
        "Riley",
        "Carl at Diner",
        "Meg",
        "Manager at Grand Belle",
        "Manager at Le Petite Sommeil"
    ],
    "dialogues": {
        "Emma": "So, the definition of the derivative of the function \"f\" at point \"x\" is..? Monte Carlo Draft 3 - November 4, 2007 2.  Okay! Kyle? KYLE snaps his eyes up to Emma's face, tries to cover.  Try to follow along. I really want you guys to get this! David? DAVID gazes back dumbly, stuck in an erotic fog.  Cindy?  Well, that was a close call! They turn to see Emma. crossing the parking lot holding a quality knock-off designer handbag over her head.     Second floor girl's bathroom. Right where I left it. This  You guys were so nice to ask me to come with--  I'd just be sitting around the condo, trolling e-Harmony...  I'm telling you, it's this town!  You know what we should do, Meg? When we're over there? we should all treat ourselves. Find a real salon. Total spa treatment. And I'm gonna get my hair done. Just like this! She holds up a European tabloid she's pulled from her purse, stabbing a finger at a photograph: CORDELIA WINTHROP SCOTT , a blonde heiress deflecting paparazzi in couture. NOTE: EMMA and CORDELIA are Played by the same actress.           Hello. You've reached the home of Emma Lindgard. I'm afraid I won't be able to return your call right away, as I'm currently traveling. In Europe. But, please, do leave a message.  Ooh! She hangs up the phone and sits herself down at the coffee table where a game of solitaire is laid next to a microwaved Lean Cuisine dinner. She turns up the volume with the remote and gathers the cards, shuffling. Eyes glued to Princess Diana on television, Emma suddenly shoots her hands three feet wide, rifling the cards in perfect vertical formation like a seasoned cardsharp.  Are we there?! Monte Carlo Draft 3 - November 4, 2007 12.  There it is! Esprit de Corps! Alice looks to where Emma points, seeing a small sky-blue flag at the end of a long staff held by MADAME VALERY (40s, pinched) their harried tour guide in a suit of the same blue.  Well, that's great!  Hey, Alice! Meg! thumb at CARL and DEEDEE  beside her.  Can you believe? They're from St. Paul! On their honeymoon!  Alice, that's like you!  We're here celebrating my friend Meg's divorce! Monte Carlo Draft 3 - November 4, 2007 14.   I got it! I got it!  Alice, I'll e-mail it to you. Meg looks up, catching Alice eyeing their surroundings.   Hey! I'll bet you have jet lag! We'll probably all get it! Meg raises a glass of wine.  To Alice! They clink glasses and Alice is suddenly jostled, just as she's about to sip, by Carl as he turns from the table behind her, spilling her wine.  Toujour le suck-ez vous.  Five nights? Here?!  Here's your outhouse, Meg. Go nuts. Alice joins Emma at the bathroom door. Monte Carlo Draft 3 - November 4, 2007 18.  Me? I'm going to try to hold it.  Just the stuff you put on my list--  And a couple options. The bag slips from Meg's grasp, crashing onto the foot of the bed which collapses, catapulting Alice onto the cot which flips up over her, knocking Emma into the tiny bathroom.  Hey! Come on, guys!  I want a picture! Of all of us! Alice looks up as Emma breaks away, to see Madam Valery leading her dwindling group from the great church. Madame Valery sends her charges to the bus, then heads straight for Alice as Emma tries to enlist a JAPANESE COUPLE to take a group photo with her camera. Monte Carlo Draft 3 - November 4, 2007 20.  Ill bet she knows more about it than you! The Japanese wife frames the action with Emma's camera.  What'd she say? Alice's eyes narrow in regarding Madame Valery and all fall silent a beat; a crowd anticipating fireworks. CLICK! The Japanese wife snaps a picture of the standoff,  That was fantastic!  I think it's starting to rain--  What're they saying? Alice looks about in equal confusion, but stops short when she sees the opulent restaurant behind the window's glass.  You think they'd let me use the bathroom?  Wow. Monte Carlo Draft 3 - November 4, 2007 24.  Meet you in there. Emma heads for the ladies room, gaping at the lobby.  Wow...  These are cloth! She takes the towel into one of the stalls, closing the door behind her just as Cordelia strides in, stops at the counter.  Hello?  Yeah. I'm here.  Did you see those are cloth?  Well, she sounded awful. And kind of mean. Alice, Meg and Emma, punchy and a little drunk, enjoy wine from enormous glasses as they finish their meals.      And her trip to Monte Carlo! That's still France, right?            Our misunder--?  Excuse me, Monsieur?     Scheize. Alice sees but one the thing: The Eiffel tower illuminated on the other side of a bank of French doors.  Now this is more like it! Monte Carlo Draft 3 - November 4, 2007 30.  This is the room we were supposed to have!  Alice, take a break, would you? We  I'm glad I got pictures!  Really loved that flag, didn't she?  Do you think that if you sleep in a bed like this every night your dreams are different? Alice rolls to her side and the view of the Eiffel tower.  Like, are they bigger? You know? Do you dream a more amazing life? Meg kicks off her shoes, lets them drop.  What time is it? Alice's eyes fly open as she snaps awake.     We were only joking! We didn't mean to--!  Alice?      What?  What? I want to know where we're going.  No. We're going to Monte Carlo!  Alice, what's \"prive?\" Is that like an airline?  See? Meg wants to go. Don't you, Meg? Monte Carlo Draft 3 - November 4, 2007 35.  What's the worst that could happen?     Now, I like that idea, because it's true! They fall silent as the steward appears with glasses of Champagne, wait for him to retreat.  Beach! Palace?!  Well, bon jour me.  Oh, I'm sorry! This is Alice Perry and Meg Kelly. Two of my dearest friends. Visiting from America!  I'll say. Emma sneakily indicates Jean-Pierre's empty ring finger to Alice and Meg as he consults his wristwatch.     Invitations for the week--?  His Highness?  What's he saying? Which prince? Jean-Pierre looks imploringly between the three.  \"With your help The Michand Foundation is able to sow the seeds of education, transforming lives, families, and villages, one child at a time...\" She didn't say anything about a school!  Reykjavik! That takes some nerve! They're counting on her for a charity auction and she doesn't even show up!  She did?  Well, I can't go to that thing tonight. I don't have anything to wear. The phone RINGS! and Emma snatches it up before Alice can.              My luggage is here.  Lucky guess? A necklace of diamonds and enormous yellow stones sparkles like a constellation from within the case's velvet lining.  Don't you feel like we've won something already? Jean-Pierre comes to greet them with PRINCE DOMENICO DA SILVANO , both in tuxedos, offering a hand to escort Emma down the few steps.  Enchante. Jean-Pierre assists Meg and Alice, Meg clutching the top of her dress, Alice anxiously keeping the skirt of hers in place with a hand as she steps down.  Please, call me \"Cordelia.\"  I shall certainly try. Domenico escorts Emma out onto the casino floor as Jean- Pierre touches Alice's elbow.  Oh, but, I really wasn't planning on playing this evening. I so much prefer to watch-- Emma looks to Alice and Meg for help as Jean-Pierre leads them to the far side of a low railing to view the game.  Oh. Um. Okay... She takes her handbag into her lap, opens it, looks.          That is if anyone is able to make change. A beat. Jean-Pierre, Domenico and all the other players burst out laughing and Emma smiles, laughing too, but shoots a desperate look to Alice and Meg.     Well... She moves her hands to the stacks and stacks of chips beside her, and pushes them to the center of the table.        Relax. I've got it under control--  Jean-Pierre, would you be a dear and get Alice some water? You're the one that got us into this--!   Now, go sit down and try to be cool, would you? Jeeze! Let me handle this. Alice moves back to her stool, tries to smile as she takes the water Jean-Pierre offers.  After you. Please. Domenico can hardly contain his gloating as he reveals his three aces.  Well. It is just a game after all. She turns her cards over and fans them on the table felt: A royal flush in the suit of hearts, ace high.  I do hope there are no hard feelings. The other players cheer as Domenico's smile crashes. Emma shrieks with delight, turning to Alice and Meg who grab each other, barely keeping themselves from pitching over, glasses spilling, as the other players applaud. Emma rakes in the Everest of multi-colored chips with both arms, laughing as she's congratulated.  Oh, a little, online. But, this is so much more fun!  It's been such a splendid evening, I am reluctant to press my luck any further.  Oh, Delmonico--  I would not miss it for the world. Meg collects the buckets from Domenico and steps on.  Wait! Before Alice can respond to Jean-Pierre, Emma takes one of the buckets from Alice and hands it back to him.  You must keep this one. For your foundation.  But, it would be darling if you could have them sent round our hotel.  But, they looked amazing on you!  You wear them here! Anywhere! Alice, you tell her-- Alice opens her mouth, but stops herself as the three wander the crowded market stalls heaped with fountains of flowers in every color, breads, fresh produce, trinkets and souvenirs.  Oh, Meg! Look! For Finn!  How perfect is this?!  Ooh! Thank you! I'm so thirsty! Nikolai remains planted, holding his tray with a smile, watching with bright eyes as Emma drinks. She lowers her glass and her full attention snags on Nikolai, really registering his presence now as she searches his warm, gentle eyes.  It's a wonderful party, isn't it? Nikolai nods and offers her another glass of Champagne. Alice, dancing with Jean-Pierre, subtly repositions herself in order to keep an eye on Emma.  Don't you need to, like, circulate?  Really?  Yes?  Um. 'Course I do... Hi.  Hospital? What happened?!  She did that to you?  Alice, no--. Wait a minute--  Now, you listen to me, Penelope Penrose. You have no idea how long I've waited for this moment. Penelope flinches, preparing for a beating.  But, I had no way of finding you after you left us, and...Oh, Penny. Don't you see? Don't you know that I was just jealous? Alice and Meg exchange looks.  You were so smart. So clever and  No, Penny. I was ugly. I was a monster.  Because, I knew I could never compete! Not with anyone as special as you.  You want to know what I've waited for all these years, Penelope Penrose? Penelope shakes her head almost imperceptibly.  To do this. Emma opens her arms wide and pulls Penelope into a hug. She looks at Alice and Meg over Penelope's shoulder, and then closes her eyes with genuine emotion for a beat, pulling back to smile into Penelope's grateful, tear-streaked face.  Now... Friends?  \"Make new friends and keep the old, one is silver and the other's gold!\" Alice and Jean-Pierre lean toward each other intimately' across the packed, lively table of PARTY-GOERS.  And you're my friend...and you're my friend. . .and you're my-- She turns with the bottle to find Nikolai who has materialized beside her on the long banquette.  Oh, hey! You were at the party! Do you work here, too? Nikolai cheerfully shakes his head, holds up her purse.  Oh! Did I forget that? Wow, what a lifesaver! Thanks!  You're not from here, are you? I'm Emm--. My name is Cordelia.  Where's Meg? Alice looks around and sees Giorgio walking alone among the strolling party guests.  Meg! What are you doing? Come on! Monte Carlo Draft 3 - November 4, 2007 68.  He is so cute! And a cook--!  And you're single now! Meg slows to a stop, stands a beat.  But, we're not.  Oh, good! I want a picture! Of the three of us! All of us! The paparazzi swarm from the steps towards Emma.  By the fountain! She runs for the sprays of water, pulling Alice and Meg, and the paparazzi meet them, flashing away. Leaning against the fountain's balustrade, Emma gestures for everyone to join them.  Penelope! Come on. I want one with everybody! Penelope, Domenico and Jean-Pierre join with other members of the group and Emma lines them all up.  Okay! Ready? One, two-- Monte Carlo Draft 3 - November 4, 2007 70.  Wait! Wait! Niki! He shakes his head, bashful, but Emma gestures him over, swinging her arms wildly.  Nikolai, you, too! I need all my friends--Whoops! Her feet zip out from beneath her and she sails backwards over the balustrade, reaching for Alice and Meg, pulling them with her as the camera's flash.  Alice, have you seen my sandals?  Train? Where are you going? Alice looks up and takes in Emma's costume. Monte Carlo Draft 3 - November 4, 2007 71.  I'm going to the beach. With Penelope. Meg enters through the suite's door carrying a bakery bag.  I don't know. She's talking about train schedules... Emma trails off as she and Meg and Alice look between each other in confusion, each processing for a beat.  Back to Paris?  We're not staying for the auction?  In Africa.  We're rich!  You're the one who said we had to go to the casino--  I've got friends. The doorbell rings and they turn their heads in unison, then look to each other with sudden alarm. A beat. Emma goes to the door, finding Penelope, also dressed for the beach, who holds up the newspaper with it's fountain photo.  Oh, my god! We look great!  Alice, look! Alice takes the paper, Meg reading over her shoulder.  Doesn't it mean we have to stay?  Okay, you know what? Let's just pack. It's not fun anymore. Alice, if you think we should go, then that's what we're gonna do. You're in charge. Meg scoffs, an exasperated exhale.  What does that mean? Alice snatches up her purse and heads for the door.  Alice, wait! Where are you--? You're not going back to Paris--?  No. I... I don't think she's  Niki. He bows slightly, offering the cake.  You work here too? You never get a night off... He smiles, shaking his head, hands her the cake.  Oh, Niki... I'm so glad you found me. Monte Carlo Draft 3 - November 4, 2007 81.  It doesn't seem fair. Leaving you to clean up all alone. I'll help. But, you've really got to talk to your boss. Nikolai laughs, shaking his head.  It must get kind of lonely sometimes... Not being understood. I know how that can feel. Nikolai holds up the napkin he's transformed into a crown adorned with flowers and the wire cages from Champagne corks. Emma looks at him, her face soft and vulnerable, open, as Nikolai places the makeshift crown on her head with care. Monte Carlo Draft 3 - November 4, 2007 85.     You get me.   Thanks. I couldn't find--. I musta left my key someplace...  But, what does it matter, really? When I already have everything I'll ever need... Alice exchanges a look with Meg as Emma swans across the suite to tear open on the fruit basket, pluck out an apple, and drape herself across a chaise. Monte Carlo Draft 3 - November 4, 2007 93.  I'm in love! I am! Oh, you guys, I'm in love with Niki... Nikolai... Nikolai. And, I don't care if he is just a busboy. Or waiter. Whatever he is... Alice unfolds the paper, taking in the image of Emma wearing Cordelia's necklace.  It's funny if you think about it. I could have had a prince. A real one. But, I wanted my Niki--  Hey. Why are you guys crying? This is good news!  No--? What jewelry?  Ooh, that's a good one!  The yacht! There! I left it on--!  Oh, hey. What's she doing here?  The roof?!  I said I was sorry! You think I would have worn it if I knew how much it cost? Busy fighting, none of them notice as Nikolai's boat passes fifty feet off their side.  None of us knew that, Alice--  In Africa. I know!  Well, sit down then! Nikolai's wake hits the dinghy, rocking them hard.  It was right here!  Definite \"yes.\"  0 You know, I'm getting a little tired of this. Just because I  Alright. Fine. Which way is aft?  He just works here. I don't--  You don't think he could have taken it, do you?     He works like fifteen jobs already! You don't know what it's like being around rich people all the time--   Yeah, we'll just explain.    You never know. She might understand.  Wow! Richard! Richard drops down to help Alice as she struggles up, dizzily finding her feet to stand.  Hey, Francois! How are you--?  Super fine.   It'll just take a minute! We'll have her right back!  Boy! Does he love you.  Niki!  Oh, Niki! I knew it! I knew it! I believed in you the whole time!  Wait for me in the lobby, sweetie. Down in half a second--  I know. Me, too. The doors close and Emma sprints back down the hall to Alice and Meg at the door.  Okay! Do it! Alice rings the bell.  The police--? Monte Carlo Draft 3 - November 4, 2007 109.    And, we dry-cleaned the dresses-- Meg and Alice wince, look daggers at Emma.  Well... For the children.  But, that's not fair! It's not the  Well, look at you!    You mean miserable? Cordelia blinks.  Or a petty, spoiled, selfish--  Bitch! Cordelia slaps Emma across the face. Alice and Meg gasp and they all stand a beat in shock.   The police? Monte Carlo Draft 3 - November 4, 2007 112.  Oh, no! This is going to be so embarrassing. Please tell me you didn't run all the way over here just for me.  Yes, but, Jean-Pierre, would you be a dear and help me? I can't seem to manage the clasp. Jean-Pierre senses something amiss, but steps to assist Emma.    Relieved! I screamed with delight.     The necklace!  Extremely! Think of all the schools we'll build!  Do you like it?   Oh, but, yes! Would you? What an entrance I'll make! So dramatic! Alice, are you coming, dear? Jean-Pierre takes Alice's elbow as Emma leads the captain and the rest of the group from the suite.  Niki, I'm sorry. It's just going to another minute.  Perfect! That sounds good. Emma is led to the ballroom by the captain as Richard meets Alice and Jean-Pierre in the center of the lobby.     Niki. What are you doing?  Well, don't. Just stop, okay?  No! No. Ladies and gentlemen, I'm terribly sorry, but, there's.. Honey, you can't bid on this, okay?  Put your hand down, and I'll be done in a second. Then we can go.  Alice, he doesn't understand. It's like a foreign language to him--  But, he'll get in trouble--  Nikolai! You cannot bid against yourself!  No! Stop! Stop! I'm sorry. I can't... I cannot allow this sweet, wonderful man to buy this necklace, because...  It is not mine to sell.  Merde. Richard, Jean-Pierre, Penelope, and Domenico all swing between the two \"Cordelias,\" as Meg makes her way forward with Bernard.     Not for anything in the world. Richard takes the pulse of the frighteningly still crowd, the, hesitating police, the charged air in the room.  Penny, you don't have to...  Nikolai! No...  How? How can it be okay?   Niki? What's going on?  I'll call you both as soon as I know. They may have to get a sub at school for a couple of weeks, but, oh, you guys, I swear it sounded like a proposal! Alice and Meg turn to Nikolai who grins and nods away.",
        "Pam": "",
        "Amanda": "",
        "Madame": "On your right... Alice, squashed beside Meg on the over-crowded bus, whips her head up from her guidebook.  Was the Arc de Triomphe.  There were stragglers at the. museum. Now, I am behind schedule.  The Pont des Arts has it's name for the vast number of art students that come here to paint this famous city view... Meg and Emma, the worse for wear, trail Madame Valery at a distance with Alice who now leads her own handful of tour members, Carl and Deedee among them.  People! We must keep together!  My head count was short in the cathedral.  This flag? I do not carry it for my pleasure.  Well, now you may head to the bus.  Which is why you must follow my flag!  There are many churches on the tour.  I assure you, they will see everything they need to see--  You seem quite the Paris expert, for someone who has never been.  Perhaps, if Madame is not satisfied with my tour she could conduct her own.  She refused to follow my instructions. She sabotaged my tour. Ruined it for everyone!  She took my flag!  The police? Monsieur. Nothing could keep her from seeing Paris her way. Believe me. She was very determined.  You are the husband, yes? Richard hesitates, looks to Glenn.",
        "Valerie": "",
        "Owen": "",
        "Robert": "",
        "Riley": "",
        "Meg": "Do me a favor, and let's just try to get to vacation. The class bell RINGS! Monte Carlo Draft 3 - November 4, 2007 3.  You can burn the school down as soon as we're back.  Remind me again why we're taking phonebooks to France? Alice gives her a look.  I love my binder. I do.  Forgot her purse.  Monte Carlo Draft 3 - November 4, 2007 4.  You know, for the first time in a long time, I feel just as lucky as any of these kids. They may have their whole lives ahead of them but we've got a week in Paris.  Funny.  Look at her. The only teacher in Racine County that wears four inch heels in six feet of snow.  Where'd you find it?  The fact that you have trouble finding a date--  Gives me less than no hope.     Finn, if Edith goes to Paris with me, she can't go to Daddy's with you. Finn's brows come together as she considers this, then reaches for the dog.  That's what I thought. Seamus! SEAMUS, Meg's ten year old son, pounds down the stairs carrying an enormous backpack as Meg zips her bag closed.  Toothbrush? Seamus makes a face, drops his bag and heads back up the stairs as the doorbell rings.        No. No. just as KARYN  emerges on the passenger side to meet them.  You and me?  Or...   At least she's smiling.  To jet lag. Emma and Alice raise their glasses to toast as WAITERS plunk down identical plates of steak frites before them.  To Alice. Best organizer. Best guide. Best friend.  Are you apologizing?  Well. This is the one we could afford. A beat as they consider the room and their lot in life.  It's only five nights--  And, Alice, you said yourself, we'll hardly ever be in our room. It'll be like camping. At Eagle River. It'll be fun! Emma opens what is essentially a closet with a toilet.  Okay, Emma. Let's just unpack-- she turns for the luggage, nearly falling over at the weight of Emma's suitcase as she reaches to lift it.  Holy--! Alice, help-- Alice climbs onto one of the beds to help Meg lift.  Oh, I'm in! Come on. Everyone! Together, they all step forward, arms entwined, laughing.  You tell her, Carl.  \"A\" plus! Alice, cheeks flushed, watches Carl waving goodbye from the bus's rear window.  Alice, you okay? Alice brings the staff down across her knee, snapping it in two, casting the broken ends into the gutter as she raises herself to her full height.  Let's kick this town's ass! Alice marches forward as a few drops of rain fall.  Get us a table? Alice, we can't afford to eat here--  No, Emma, I mean, exactly like you.  We should just take it. Her room.  Alice, how fast can you get a binder going on a trip like that?  What's so funny about that? We got in here. Monte Carlo Draft 3 - November 4, 2007 28.  Emma, you could be her!  There's whole other room in here!  So, we're looking.  And we like what we see.   Alice, how many do chances do we get? For something like this? Alice considers, looks out the window at the streaming rain.   Agreed. Alice climbs up and together, the three pass the bottle of Champagne as they study the ceiling's ornate plasterwork.     Surprised me!  Well... We'll never know. Seen from the bed, the light atop the Eiffel tower breaks through the dissipating clouds to swing a searching arc through the night sky...     We'll tell them it was a mistake!  Take it. Just take it.  They really do think she's her... RIP! Alice and Meg spin to Emma as she spills the envelope 's contents.     Hold on... I'm reading...  Trip's paid for, whether that girl takes it or not.  You're in charge. You want to go back to that hotel, okay by me. A beat while Alice looks between Meg and Emma, trapped.     Anything goes wrong, we say it was a language thing, that we didn't  Beach! Palace?!  We won't keep you--  No, I can't. I can't stand it. Emma reads to Alice and Meg from the brochure in the seating area of their luxurious suite, enjoying none of it, nor the incredible balcony view of Monte Carlo's marina and bay.  Schools, with an \"s.\" More than one. Monte Carlo Draft 3 - November 4, 2007 40  That horrible, irresponsible girl! I've never stolen a thing in my life, now I've taken a trip from school children.  Do not touch that!  Dry-cleaned.   I may as well be topless.  A riot. Domenico casts a glossy chip into the pot.   I should probably keep this.  What'd she say? What'd she say?  Yeah. Good call, Cordelia. DING! The elevator arrives and the doors open as Domenico leans in towards Emma.  Great meeting you, your Highness. Good times. Really. Jean-Pierre places his buckets in Alice's hands, a certain frisson to the simple exchange.  Wait. You know what, on second thought, I'm not getting these-- She pulls the pair of jeans from her pile of clothes.  Where was I ever going to wear them? Seriously?  Thank you. It's silly, anyway. They're just jeans. I want to find something for the kids--  Oh, no. No. I'm sorry. I'd like to. But... The woman is confused, vaguely insulted.  I don't have a kitchen. No place to cook.  Well, thank you... She smiles at the woman and starts to walk away, only to find Bernard falling into step with her.  From Wisconsin. Yes. Bernard reaches a handkerchief from his jacket for Meg.  I try. But... We don't have even half of this at home. She points to a tray of miniature lobsters.  Like those. I've only seen them in magazines.  I'd go for a saute, being a Midwestern gal.     So, you cook. Bernard dips his head modestly.  Meg. Kelly. Thank you again for  I need to find my--. . My friends are around here somewhere...     Yeah. But, I'm gonna walk myself. Thanks, though. She slips into the moving crowd, leaving Bernard to watch as she meets Alice and Emma further up the street. He holds a beat, then turns when called to by a vendor.  Alice, she's fine... Look where we are! Can you even remember the last time we danced like this? It's gotta be-Martha Lapland's wedding-- Monte Carlo Draft 3 - November 4, 2007 59.   The gay bar?  I am so butting in on that. Alice laughs and spins, crashing directly into Jean-Pierre.  No, thanks. She moves off only to be met by GIORGIO (40's, sexy, Euro- suave) who smoothly steps in.    What? That's awful!  Okay, wait. You're a man, right?  Yeah, I know: I'm funny. But, see if you can answer something for me. Ten years you're married, to the girl you dated in high school. I'm talking the girl you lost your virginity to, the one who gave you two great kids that you're just crazy about. Then one morning, what? You wake up, and out of the blue, it's like, \"Oh, hey, honey, I think I'm in love with this other woman...\" His patrol partner. A beat as Giorgio shakes his head sadly.  I thought I was his partner. Giorgio takes Meg hand, more in comfort than come on.   I feel like I failed.     Oh, I'm sorry, 'I didn't order-- She looks up to find Bernard standing in chef's whites.     Adding the fresh orange; nice. Bernards nods, accepting the compliment.  But, a little fennel would've been \"wow.\"  Chef .        We'd be getting up now.  Breakfast is here! There's this fantastic bakery around the corner. I've already had three brioche. And I saw the greatest little shop for the kids, but they weren't open  What plan?  That was before we knew it was for a charity. Remember the kids?  Alice, what's with you? We'll pay for the room--  Lying? To who? Jean-Pierre?  She's in Iceland.  What friends?     Oh, this is so typical. Just because it's not on your map, 'cause you didn't plan it--. We all agree to take this adventure and then you won't jump.  Now I know how Richard must feel. Alice comes to a full stop and gapes at Meg, stung.     Exactly.   Don't look at me like that. The door opens, and Alice re-enters, striding across the room for the desk, not looking at either Emma or Meg.  Just one. He leads her to a table along the wall and holds out a chair. Seated, Meg follows him with her eyes to the kitchen where Bernard works furiously at the stove, tossing the contents of a sauce pan with an expert flick of his wrist. Bernard glances out to the dining room, seeming to sense Meg before knowing he'll find her there.  Seamus. He's ten. Built a website for his fourth grade class. Now he's got actual clients. And that's Finn, the prima ballerina. She'll be six in June-- Emile examines photographs of Seamus and Charlotte from Meg's wallet while she refills their glasses at the kitchen table and Bernard works at the stove.  Oh, she's no chicken. She's not scared of anything--     But, that's a nice word for it.  Yeah. No. No way. Bernard straddles a beat up moped, motor running, as Meg shakes her head emphatically.  What do you want me to tell you? I'm not getting on that thing. Bernard fixes her with a level look, which Meg mimics.  Hold on.  How do you say \"faster?\"  Thank your father for me?  Thank you. Meg hugs him briefly, awkwardly, then turns for the steps.      Alice, I am so sorry! For what I said. About you. And Richard. I didn't mean any of it! I love you. I don't know how I would've gotten through the past six months if it weren't for you--  Wha--?  Wait. What? When?  No. You didn't--  Alice...  But, Alice. You were going. We were on our way.  Honey, Richard knows you... It might feel like it's over. But, it's not.  I'm trying to follow you--  What? Alice holds up the newspaper.  Are you kidding me?!  They're locked! Monte Carlo Draft 3 - November 4, 2007 97.  No. Forget it. Alice laces her fingers together, turning to Emma.    Why'd they have to park so far out, anyway?!  What am I going to tell my kids?! How am I'm going to explain to Glenn that we're in a French jail?  My kids'll be in college when we get out! They won't even know me.  Trespassing. Burglary. Oh, god. Grand larceny, by trick and  I'm standing in a stolen boat!  Oh, I can't believe this... Meg doubles over, hands on her knees as Emma stands over the empty spot on the landing.  Do not even say it!  We don't have time for this! Let's just split up! Alice you go fore, Emma take the aft, and I'll check the cabin. Emma glares at Alice with steely, narrowed eyes.  Nice boat. No necklace.  Who knows?! I mean, is there anyone who understands a word he says?!  Actually, we do.  Oh, yeah, that was the first thing that struck me about her. How reasonable she seemed--  We should have sailed that yacht right back to Wisconsin--  You think she'd fit in one of those trunks of hers--?  Just thinking out loud.  Richard! Richard--?  Longer in France.     Don't worry about a thing!  Don't touch that bell! They race down the hall towards Nikolai, who gapes, perplexed by the sight of Emma.   Security, Madame.  We haven't taken anything--  In Africa.   Every one of them.  I don't. Cordelia scoffs and Alice leans over her, menacing.  We're great. But, now you can add  Believe me, nothing would make me happier than having a little talk with your father-- Both their heads swing toward the door when the bell RINGS! Meg jumps to Cordelia, stuffing the apple in her mouth just as she opens it to scream.  Bernard...?  Oh, I... She glances back into the room behind her, carefully obscuring Bernard's view through the half open door.  No. No, Bernard, that's not it.  I'd invite you in, but-- Monte Carlo Draft 3 - November 4, 2007 118.  No. Bernard, wait-- CLICK! Meg and Bernard both turn their heads to look down the corridor when Cordelia sticks her head out the bedroom door into the hall. A beat as Cordelia and Meg lock eyes. DING! The elevator doors open at the end of the hall, closer to Cordelia. She looks back at Meg for an instant then bolts as Meg leaps past Bernard into the hall.  Hey! Stop!  Bernard, you should stop. You really don't need this. I may be going away for a long time--  Something like that. Look, this is where we should say \"au revoir.\" Bernard smiles and pulls Meg to him, kisses her.  Oh, shhhh--     And it was an excellent one.  Oh, good. I could use a drink.  The rest is for the schools. Jean-Pierre hesitates in accepting the envelope, but Alice presses it on him.  You come to Wisconsin, we'll drink this in my kitchen."
    },
    "imdb_rating": "5.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjE4NjM3NjI1Nl5BMl5BanBnXkFtZTcwNjA5MzY1NQ@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "A young woman, her uptight step sister and her best friend use their savings for a long anticipated dream trip to Paris, which turns out to be a big disappointment. When they decide to take a break from their lousy tour and duck into the lobby of a luxury hotel, one of them is mistaken for a spoiled British heiress. Before they get the chance to reveal their true identities they are wrapped up in misadventures during a vacation to Monte Carlo instead.—Fox 2000 Pictures",
    "name": "Monte Carlo",
    "genres": [
        "Adventure",
        "Comedy",
        "Family"
    ]
}