{
    "filename": "Moonrise-Kingdom_script.txt",
    "imdb_id": "tt1748122",
    "imdb_url": "https://www.imdb.com/title/tt1748122",
    "characters": [
        "Suzy",
        "Cousin Ben",
        "Deluca (as Rob Campbell)",
        "Panagle",
        "Izod",
        "Mrs. Bishop",
        "Scout Master Ward",
        "Social Services",
        "Mr. Bishop",
        "Redford",
        "Lazy-Eye",
        "The Narrator",
        "Captain Sharp",
        "Sam",
        "Gadge"
    ],
    "dialogues": {
        "Suzy": "I'm a raven. 20.      What's your name?  I'm Suzy.    Uh-huh.   Fine.   No.  That's a good idea. It might help also if you didn't wear fur.  Which way?    He knows someone's watching him.    It's my mother's.      Pretty good. I broke our school record for the back-stroke.   The stick's moving!  Sit down!  Very good. You know a lot about camping, don't you?  That's OK. He only eats cat food.   This is my record player. It works with batteries. Actually, it belongs to my little brother Lionel. I left him a note. Do you like music?  This is my favorite record album. My godmother gave it to me for my birthday. She lives in France.  These are my books. I like stories with magic powers in them. Either in kingdoms on earth or on foreign planets. Also, time-travel, if they make it realistic. Usually, I prefer a girl hero, but not always. I couldn't bring all of them because it got too heavy. You can borrow any you want.  I also brought my lefty scissors because I'm left-handed, my toothbrush, some rubber bands, extra batteries, and my binoculars, as you know. I forgot my comb.    I might turn some of them back in one day. I haven't decided yet. I know it's bad. I think I just took them to have a secret to keep. Anyway, for some reason, it makes me feel in a better mood sometimes.  Well, I can show you an example, if you want -- but it doesn't make me feel very good. I found this on top of our refrigerator.  It's not funny.  You really know how to make friends.  That's OK.  I know.  His eyes downcast, his kingdom in ruins, Mynar pressed his heavy paw through the rippling surface of the cool shallows and down to its stone floor. \"My people once were lead by a great and noble beast -- and I no longer see his face in this reflection.\"  Meanwhile, on the Plains of Tabitha, Francine rested. There would be another time for war.  Dear Sam, Thank you very much. I got replaced as the raven because I yelled at Mrs. Lynn. After that I was only a blue jay, but --  Dear Sam, You are an excellent painter, especially trees and telephone poles. Is the girl in the water supposed to be me? My favorite color is --  Dear Sam, I am in trouble again because I threw a rock through the window. My mother still has glass in her hair. Also --  Dear Sam, Now I am getting suspended because I got in a fight with Molly. She says I go berserk. Our principal is against me. Why do --  Dear Sam, I do think you should think of their faces every day, even if it makes you sad. It is too bad they did not leave you more pictures of themselves. Can you -- 38.  Dear Sam, My answer is yes.  Dear Sam, Where?  They found the canoe.      Oh, no.  He needs a doctor.   He's losing blood. Hurry. Where do we go?   Don't say that.   He's dying! We can't just leave him!    Don't ever do that again. No one's allowed to slap me.  You're right. He's dead. 45.  Was he a good dog?  This is weird.  I like it here, but I don't like the name.  Mile 3.25 Tidal Inlet. It's got no ring to it.  Let me think for a minute.  It's pretty. Do the other one.  It feels hard. 52.  I like it.  You can touch my chest.  They're going to grow more.  It helps me see things closer. Even if they're not very far away. I pretend it's my magic power.  I don't know. I want to go on adventures, I think. Not get stuck in one place. How about you?  That's true.      What's that one for?  Are your foster parents still mad at you? For getting in trouble so much.  I always wished I was an orphan. Most of my favorite characters are. I think your lives are more special.  I love you, too.  The flashlight's beam drew a moon through the black across the attic and settled on a gap in the base-board. A mouse-hole, no bigger than a pocket-watch. Eric crouched on his flat feet and placed his hand in front of the tiny opening. \"It's windy,\" he said. \"Like someone in there's blowing on my fingers.\" Christy rolled her eyes and sighed a sigh. He's right again, she thought. Little brothers drive people crazy.  Part Two.  That was a lie.  Good. I want to be.  What does it say? 57.    Let me read it.  That's child abuse.      I wish I knew what makes you tick.     I hate you.  Why not? I mean it.  Exactly. I know what you do with that sad, dumb police man. You go to bed with him.  We're in love. We just want to be together. What's wrong with that?  They snuck me down the laundry chute and left a paper-maché dummy in my bed.  Not this time. He can't keep his trap shut. Besides, I'll probably never see him again. 71.  \"-- but I'm not going,\" said Barnaby Jack. \"I'm running away tonight for good, and this time I won't get caught.\" Annabelle whispered: \"I'm coming with you.\" Her yellow hair, now brown at the roots, caught up in the wind and danced. Barnaby Jack took Annabelle's hand and pressed something into it the size of a jellybean. \"Hide this in your socks, and be ready at midnight.\"  He leapt out the window and landed in the fresh-fallen snow.  But we're not married yet.    Maybe he's right. It could be a mistake.  Being married. Sometimes it seems sad to me. It might be better to just go steady permanently.  We're sure.  We might have to swim for it.  I don't know, but if it's too shallow, we'll break our necks, anyway. Hang onto me.  On three again.  I think you've still got lightning in you.",
        "Cousin": "I don't care how they do it where you come from. You want pop? You want candy? You want a snake-bite kit? Get some money.  Come back in five minutes.  Is this him?  He's hot. Almost too hot. What's in the can?  Give it to me. 77.  You badge in seamanship?  Good. There's cold-water crabber moored off Broken Rock. The skipper owes me an I.O.U. We'll see if he can take you on as a claw cracker. It won't be an easy life, but it's better than shock therapy.  Back there, but the padre's home with the mumps. Why do you ask?  You his girl?  Technically, I'm a civil-law scrivener. I'm authorized to declare births, deaths, and marriages. You're kind of young. You got a license? 78.  I can't offer you a legally binding union. It won't hold up in the state, the county, or, frankly, any courtroom in the world due to your age, lack of a license, and failure to get parental consent -- but the ritual does carry a very important moral weight within yourselves. You can't enter into this lightly. Do you love each other?  Are you sure you're ready for this?  Let me rephrase it.    I don't like the snappy attitude. This is the most important decision you've made in your lives. Now go over by that trampoline and talk it through before you give me another quick answer.  I guess they're probably just trying to pretend they're struggling over their decision, but at least --  OK. Let's do a blood test.  -- which we hereby consecrate on this day, the fifth of September, 1965. That's the end of the short-form. Do any of the witnesses have objections or remarks? Usually, they don't.  Skotak.      You're just like your brothers. OK, give them the tennis ball can. 81.  Sign here -- and initial here and here.  Take the carbon. Leave the Bible. Let's go.  Be quick, sailor!  Affirmative, sir!",
        "Ben": "I don't care how they do it where you come from. You want pop? You want candy? You want a snake-bite kit? Get some money.  Come back in five minutes.  Is this him?  He's hot. Almost too hot. What's in the can?  Give it to me. 77.  You badge in seamanship?  Good. There's cold-water crabber moored off Broken Rock. The skipper owes me an I.O.U. We'll see if he can take you on as a claw cracker. It won't be an easy life, but it's better than shock therapy.  Back there, but the padre's home with the mumps. Why do you ask?  You his girl?  Technically, I'm a civil-law scrivener. I'm authorized to declare births, deaths, and marriages. You're kind of young. You got a license? 78.  I can't offer you a legally binding union. It won't hold up in the state, the county, or, frankly, any courtroom in the world due to your age, lack of a license, and failure to get parental consent -- but the ritual does carry a very important moral weight within yourselves. You can't enter into this lightly. Do you love each other?  Are you sure you're ready for this?  Let me rephrase it.    I don't like the snappy attitude. This is the most important decision you've made in your lives. Now go over by that trampoline and talk it through before you give me another quick answer.  I guess they're probably just trying to pretend they're struggling over their decision, but at least --  OK. Let's do a blood test.  -- which we hereby consecrate on this day, the fifth of September, 1965. That's the end of the short-form. Do any of the witnesses have objections or remarks? Usually, they don't.  Skotak.      You're just like your brothers. OK, give them the tennis ball can. 81.  Sign here -- and initial here and here.  Take the carbon. Leave the Bible. Let's go.  Be quick, sailor!   Affirmative, sir!",
        "Panagle": "Sixteen and a half.  Who else got hit? 46.  She's too scruffy for me.",
        "Izod": "Not me. I ran away when the girl went berserk.",
        "Mrs.": "It's possible, Counsellor.  I don't think so. Two days, maximum.  Birds! Ready? 21.  Who are you? Where'd you come from? Go back to your seat.  Suzy! Dinner! I'm not going to say it again! 32.  Where's your sister?    Walt! Where the hell are you?  Does it concern you that your daughter's just run away from home?  Come down and read this.  Suzy's missing, too! Go find her.  She has a pen pal! It's very intimate! They planned this together!  He does watercolors! Mostly landscapes, but a few nudes!    Of course, he is.  I am.  No. He fell in a ditch. 40.  I don't know.  Is Suzy with you?  Stop it, Walt! 48.    I don't get it. Were there witnesses?  I beg your pardon. Are you a lawyer?    Dammit! Christ! Shit! Jesus! At this moment, a voice interjects from the shore:  Put your clothes on. Both of you. 56.  Please, terminate this conversation.  I do know what you're feeling, Suzy-bean. I've had moments myself where I say: what am I doing here? Who made this decision? How could I allow myself to do something so stupid -- -- and why is it still happening? We women are more emotional. You have to    You think you mean it. In this moment. You're trying to hurt me. 63.  He's not dumb, but I guess he is kind of sad. Anyway, we shouldn't discuss that. It's not appropriate for me to even acknowledge what I already just said.  Poor Suzy. Why is everything so hard for you?  Oh, my God. How are we going to get these fish-hooks out?  I guess so. For the moment.  That's right.  I've got to do better. For everybody.  Except you.  Who know what's going to happen, Duffy? I'll probably see you tomorrow.    Did you file the motion for continuance? Peabody vs. Henderson.  Good. 72.  He granted it.  I'm sorry, Walt.  Specifically? Whichever ones still hurt.    We're all they've got, Walt.  Let's go! Right now!    I object to that description. She was attacked.  We don't have time for this!        Suzy? Lionel, Murray, Rudy! Dinner!",
        "Bishop": "Camp Ivanhoe? That's all the way across the other side of the island. You really think a twelve-year-old boy could row this far in a canoe?   It's possible, Counsellor.    I don't think so. Two days, maximum.  Well, I'm not going to argue about it.    Suzy! Dinner! I'm not going to say it again! 32.  Where's your sister?    Walt! Where the hell are you?  Right here! Why are you cursing at me?  Does it concern you that your daughter's just run away from home?    Come down and read this.  Who's there?    Suzy's missing, too! Go find her.  Wait for me.  How can we help her? She's got so many problems. It's getting worse.  Whose fault is it?  She doesn't have any friends.    I don't understand.     She has a pen pal! It's very intimate! They planned this together!  Holy Christ. What am I looking at?  He does watercolors! Mostly landscapes, but a few nudes!  She sit for this?  She stole the batteries out of my flashlight.    Of course, he is.  I am.  No. He fell in a ditch. 40.  That's her.  I don't know.  What happened? Who's that? Why's he bleeding?  Is Suzy with you?  Hold it right there. You're not leaving this island. Our daughter's been abducted by one these beige lunatics.  Why can't you control your scouts?  Stop it, Walt! 48.    I don't get it. Were there witnesses?  I beg your pardon. Are you a lawyer?    Stay away from my wife.  Dammit! Christ! Shit! Jesus! At this moment, a voice interjects from the shore:  Suzy! Get out here!  Put your clothes on. Both of you. 56.  Be advised: the two of you will never see each other again. Those were your last words. Do you understand?      Please, terminate this conversation.          I'll be out back.  I'm going to find a tree to chop down.  I do know what you're feeling, Suzy-bean. I've had moments myself where I say: what am I doing here? Who made this decision? How could I allow myself to do something so stupid -- -- and why is it still happening? We women are more emotional. You have to    You think you mean it. In this moment. You're trying to hurt me. 63.  He's not dumb, but I guess he is kind of sad. Anyway, we shouldn't discuss that. It's not appropriate for me to even acknowledge what I already just said.  Poor Suzy. Why is everything so hard for you?  Oh, my God. How are we going to get these fish-hooks out?        I guess so. For the moment.  That's right.  I've got to do better. For everybody.  Except you.  Who know what's going to happen, Duffy? I'll probably see you tomorrow.        Did you file the motion for continuance? Peabody vs. Henderson.  It was sustained.  Good. 72.    He granted it.  Great.  I'm sorry, Walt.  It's not your fault. Which injuries are you apologizing for? Specifically.  Specifically? Whichever ones still hurt.    I hope the roof flies off, and I get sucked up into space. You'll be better off without me.      We're all they've got, Walt.  It's not enough.     Oh, dear God.  Get the boys. 86.  Let's go! Right now!  Suzy? Sam?    Can we get back to the rescue now?    I object to that description. She was attacked.  We don't have time for this!      In this state? I would litigate with extreme confidence.            Suzy? Lionel, Murray, Rudy! Dinner!  Don't make us ask twice!",
        "Social": "Hello, Captain Sharp. This is Social Services. I'm calling in reference to Sam Shakusky, Ward of the State. I understand he's in your custody.  What's his condition? Has he suffered any injury or trauma of any kind?  Very good. How do I get to you?  I'll come tomorrow morning, if that's acceptable to you. Is someone able to 60.  provide reasonable care and nourishment for the boy until that time?  Is that a yes?  Very good. I'll contact you again before the end of the day.      Well, normally, we'd try to place him in another foster home, but that option is no longer available to us, in my opinion, with his case history -- which means he'll go to Juvenile Refuge.  Who's speaking?  Right. An orphanage -- but the first step is the admissions panel requires a psychological evaluation to determine whether or not the boy's a candidate for institutional treatment or electroshock therapy. Beyond that --  The report describes an assault with scissors.    Where's the boy?  That's not acceptable.  You're Captain Sharp?  I'm Social Services. I remanded the boy to your personal custody. You're responsible for his safety. I'm told he was just struck by lightning.  Scout Master Ward, I presume?    You two are the most appallingly incompetent custodial guardians Social Services has ever had the misfortune to  What do you have to say for yourselves? 94.    Just find the boy -- and deliver him --  -- to Social Services. Nothing else is in your power.    The parents of the stabber? 95.  Let's go!  That's it! I'm citing you for gross misconduct! You are hereby summoned to appear before the board of --      Application denied! I'm sorry! Over!  Captain Sharp is offering to assume the responsibility of foster parenthood!  Is this acceptable to you, Mr. Shakusky?",
        "Services": "Hello, Captain Sharp. This is Social Services. I'm calling in reference to Sam Shakusky, Ward of the State. I understand he's in your custody.  What's his condition? Has he suffered any injury or trauma of any kind?  Very good. How do I get to you?  I'll come tomorrow morning, if that's acceptable to you. Is someone able to 60.  provide reasonable care and nourishment for the boy until that time?  Is that a yes?  Very good. I'll contact you again before the end of the day.      Well, normally, we'd try to place him in another foster home, but that option is no longer available to us, in my opinion, with his case history -- which means he'll go to Juvenile Refuge.  Who's speaking?  Right. An orphanage -- but the first step is the admissions panel requires a psychological evaluation to determine whether or not the boy's a candidate for institutional treatment or electroshock therapy. Beyond that --  The report describes an assault with scissors.    Where's the boy?  That's not acceptable.  You're Captain Sharp?  I'm Social Services. I remanded the boy to your personal custody. You're responsible for his safety. I'm told he was just struck by lightning.  Scout Master Ward, I presume?    You two are the most appallingly incompetent custodial guardians Social Services has ever had the misfortune to  What do you have to say for yourselves? 94.    Just find the boy -- and deliver him --  -- to Social Services. Nothing else is in your power.    The parents of the stabber? 95.  Let's go!  That's it! I'm citing you for gross misconduct! You are hereby summoned to appear before the board of --      Application denied! I'm sorry! Over!  Captain Sharp is offering to assume the responsibility of foster parenthood!  Is this acceptable to you, Mr. Shakusky?",
        "Redford": "Safety-test, sir.  The vehicle appears to be in good working order. I'm just checking if -- 6.  What if he resists?  Shakusky. Are we allowed to use force on him?  I'll tell you one thing: if we find him, I'm not going to be the one who forgot to bring a weapon.  We're looking for you.  Because you're a fugitive.  You're still in uniform.  Well, it doesn't matter, anyway. You don't have that authority. We've been deputized. Now are you going to come along peacefully or not?    We know him a lot better than you. He's emotionally disturbed because his family died. Nickleby, tie him up.  You're doomed, Shakusky.     Because your girlfriend stabbed me in the back with lefty scissors.  Congratulations.    He's here! The fugitive! Stop him! 84.  Field Mate Redford, sir.",
        "The": "Once again: storm waters have just breached the dam at Black Beacon 87. WEATHER MAN  (cont'd) Reservoir. A flash flood alert is in effect. Take immediate precautions.",
        "Narrator": "This is the island of New Penzance. Sixteen miles long. Forested with old- growth pine and maple. Criss-crossed by shallow tidal creeks. An important seabird habitat. There are no paved roads but instead many miles of intersecting foot paths and dirt trails and a ferry that runs twice daily from Stone Cove. The year is 1965. We are on the far edge of Black Beacon Sound, famous for the ferocious and well-documented storm which will strike from the east on the fifth of September -- in three day's time. 3.  Excuse me! Excuse me! Excuse me, Captain Sharp?  As some of you know, I taught Sam for the cartography Accomplishment Patch. He's a smart boy, and he expressed a keen interest in the history of the island's indigenous peoples. In particular, I recall his fascination with the idea of retracing the original path of the old Chickchaw harvest migration.  What I'm getting at is this: I think I know where they're going.  This is the island of St. Jack Wood, extending far north from Land's End along the deep-water channel that leads to Broken Rock. A low flood-plain separates the beach from the town-ship above. A small but prosperous community.  The barometer reads twenty-seven inches and dropping. Strong winds, as you can see, already at twenty-two knots.  The time is now four thirty-five A.M.  The Black Beacon storm was considered by the U.S. Department of Inclement Weather to be the region's most destructive 102.  meteorological event of the second half of the twentieth century.  It lingered through six high-tides and inundated the islands with punishing winds and extreme high waters.  On St. Jack Wood, powerful surges broke the arcade boardwalk and demolished the village bandstand and casino.  The coastal areas of New Penzance were battered and changed forever.  Mile 3.25 Tidal Inlet was erased from the map.  But harvest yields the following autumn far exceeded any previously recorded, and the quality of the crops was said to be extraordinary.",
        "Captain": "Watch my line, Edgar.  Hello? This is Captain Sharp. Over.  Morning, Randy. What can I do for you? Over.  What does that mean? Over.  Any idea why? Over.  I guess we better notify his folks. Over.  Hello, sir. This is Captain Sharp.  There's no cause for alarm, sir. We'll find him. We're just notifying you as a matter of protocol and so on.  I'm confused by that statement. You can't invite him back? 11.  Am I speaking to Sam's father?  Mr. Billingsley, I've got an escaped Khaki Scout. We're notifying you as a matter of protocol. You say you can't invite him back? You say he's an orphan? Well, I don't understand how that works. What am I supposed to do with him?  Most likely not.  Be that as it may, will you let me know if you see anything unusual?  Good evening. Sorry to startle you. I was  I know, that's what I'm saying. The search party's not over yet. In other        Mrs. Bishop, I mean.  Is she upset?  I got to get this spot-light fixed. 35.  Sam Shakusky. That's my escaped Khaki Scout. His family died.  What does he say?  I think he's onto us.  Of course, he is?      All right. We know they're together. We know they're within a certain radius of this spot. I'm declaring the case with the county right now. Until help arrives:  I'm deputizing the little guy, the skinny one, and the kid with the curly hair to come with me in the station wagon. Randy, you drop-in and head up-river with the rest of your troop, then split-up on foot. Becky, call Jed and tell him to circle over this end of the island and fly low.  Puncture wound. Lower lumbar. Make room for a stretcher in the cockpit!  Clear the dock, Edgar!  The infirmary at Fort Lebanon. We'll be right behind you. 47.  Warm up the motor. I'll be right back.  Walt, it's very clear: the two of them conspired in this together.  Stop.  I do blame him --  -- but I also blame myself and both of you. With all due respect: you can't let your children stab people.  Easy does it. Calm down, Laura.  Dammit! Christ! Shit! Jesus! At this moment, a voice interjects from the shore:  Give him his mail.  Hello? This is Captain Sharp.  That's correct.  He's OK.  The fastest way is by seaplane. Jed can bring you in with the mail.  Uh-huh.  Uh-huh.  Wait a second.  Social Services?          I agree with you. That's eloquent. I can't argue against anything you're saying -- but I don't have to, because you're twelve years old.  Look, let's face it, you're probably a much more intelligent person than I am. In fact, I guarantee it -- but even smart kids sometimes stick their fingers in electrical sockets, if you see what I mean. It takes time to figure things out. It's been proven by history: all mankind makes mistakes. It's our job to try to protect you from the dangerous ones. If we can.  You want a slug?  What's the rush? You've got your whole life in front of yourself. Ahead of you, I mean.      She didn't love me back.  I'm sorry for your loss. Anyway, that's what people say.  What happened?    In other words, it's over.  Until further notice.  I understand.  Except me.      I admire them, you know? There's a purity to it. I only feel bad because they both seem like such unhappy, lonely, miserable people -- but maybe that's romantic.  Stand by, Commander Pierce.  Jed, re-route to St. Jack Wood. Tell Social Services the boy's been spotted at Fort Lebanon.  Becky, notify the Bishops: Suzy's there.  Randy? You monitoring?  No, sir.  Who's in charge here?  Randy! What happened?  We don't know yet.   What do you want me to say, lady?  Somebody get Jed a cup of coffee. 93.  That's right.  That's the first I heard of it.  You can't do this. They'll eat him alive in there.   What's the name of the place again?    Nobody's going anywhere.  He's not getting shock therapy. 96.  I'm writing you up back! Be notified that you stand accused of the mistreatment and    They're gone.    Where'd they go? Answer me!  Halt! Stop!  Stay there!  Where you going? What are you doing? Come down!  Social Services? Do you read me? Over!    No!  Goddammit!  Tell him! Over!  What do you think, pal?  We're coming down! Over and out.  Don't let go.",
        "Sharp": "Watch my line, Edgar.  Hello? This is Captain Sharp. Over.  Morning, Randy. What can I do for you? Over.  What does that mean? Over.  Any idea why? Over.  I guess we better notify his folks. Over.  Hello, sir. This is Captain Sharp.  There's no cause for alarm, sir. We'll find him. We're just notifying you as a matter of protocol and so on.  I'm confused by that statement. You can't invite him back? 11.  Am I speaking to Sam's father?  Mr. Billingsley, I've got an escaped Khaki Scout. We're notifying you as a matter of protocol. You say you can't invite him back? You say he's an orphan? Well, I don't understand how that works. What am I supposed to do with him?  Most likely not.  Be that as it may, will you let me know if you see anything unusual?  Good evening. Sorry to startle you. I was  I know, that's what I'm saying. The search party's not over yet. In other        Mrs. Bishop, I mean.  Is she upset?  I got to get this spot-light fixed. 35.  Sam Shakusky. That's my escaped Khaki Scout. His family died.  What does he say?  I think he's onto us.  Of course, he is?      All right. We know they're together. We know they're within a certain radius of this spot. I'm declaring the case with the county right now. Until help arrives:  I'm deputizing the little guy, the skinny one, and the kid with the curly hair to come with me in the station wagon. Randy, you drop-in and head up-river with the rest of your troop, then split-up on foot. Becky, call Jed and tell him to circle over this end of the island and fly low.  Puncture wound. Lower lumbar. Make room for a stretcher in the cockpit!  Clear the dock, Edgar!  The infirmary at Fort Lebanon. We'll be right behind you. 47.  Warm up the motor. I'll be right back.  Walt, it's very clear: the two of them conspired in this together.  Stop.  I do blame him --  -- but I also blame myself and both of you. With all due respect: you can't let your children stab people.  Easy does it. Calm down, Laura.  Dammit! Christ! Shit! Jesus! At this moment, a voice interjects from the shore:  Give him his mail.  Hello? This is Captain Sharp.  That's correct.  He's OK.  The fastest way is by seaplane. Jed can bring you in with the mail.  Uh-huh.  Uh-huh.  Wait a second.  Social Services?          I agree with you. That's eloquent. I can't argue against anything you're saying -- but I don't have to, because you're twelve years old.  Look, let's face it, you're probably a much more intelligent person than I am. In fact, I guarantee it -- but even smart kids sometimes stick their fingers in electrical sockets, if you see what I mean. It takes time to figure things out. It's been proven by history: all mankind makes mistakes. It's our job to try to protect you from the dangerous ones. If we can.  You want a slug?  What's the rush? You've got your whole life in front of yourself. Ahead of you, I mean.      She didn't love me back.  I'm sorry for your loss. Anyway, that's what people say.  What happened?    In other words, it's over.  Until further notice.  I understand.  Except me.      I admire them, you know? There's a purity to it. I only feel bad because they both seem like such unhappy, lonely, miserable people -- but maybe that's romantic.    Stand by, Commander Pierce.  Jed, re-route to St. Jack Wood. Tell Social Services the boy's been spotted at Fort Lebanon.  Becky, notify the Bishops: Suzy's there.  Randy? You monitoring?  Who's in charge here?  Randy! What happened?  We don't know yet.   What do you want me to say, lady?  Somebody get Jed a cup of coffee. 93.  That's right.  That's the first I heard of it.  You can't do this. They'll eat him alive in there.   What's the name of the place again?    Nobody's going anywhere.  He's not getting shock therapy. 96.  I'm writing you up back! Be notified that you stand accused of the mistreatment and    They're gone.    Where'd they go? Answer me!  Halt! Stop!  Stay there!  Where you going? What are you doing? Come down!  Social Services? Do you read me? Over!    No!  Goddammit!  Tell him! Over!  What do you think, pal?  We're coming down! Over and out.  Don't let go.",
        "Sam": "What kind of bird are you?  No, I said, \"What kind of bird are you?\"  I'll be leaving soon.  What happened to your hand?    Sam. What's yours?  Were you followed? 22.  Good.  Did you bring a cat?  Can you read a map?  I do cartography.  I feel we should go halfway today and halfway tomorrow, since you're a less experienced hiker, and you're wearing Sunday-school shoes.   Here's where we are right now. I'd like to pitch camp here by sixteen-hundred . How does that sound?  You want some beef jerky?  Let's go.  Are you thirsty?  Well, if your throat gets parched, stick a pebble in your mouth and suck on it. You can quench your thirst with the spit, supposedly.  Sometimes I stick leaves under my hat. It cools your head down.    Here's a trick. Throw grass in the air, and you can see which direction the wind's blowing.  Unknown. I guess it doesn't really matter, as long as we cover our tracks. 24.  These might be poisonous.  Not bad. Anyway, they're good for survival.  I agree. Why do you say that?  You smell like perfume.  I brought water, too. 25.  Should we catch him?  Trout bait. We need worms.  You're right. We'll let him live. Maybe I've got a licorice whip.  How strong of a swimmer are you?    Watch out for turtles. They'll bite you, if you put your fingers in their mouths. Let me see if I can catch this one.  Somebody wrote on him.    Fish on hook! Reel him in! Slowly.  You're doing good.  This is for fishing. 27.    Anyway, I used to be.  We can feed your cat the guts and eyeballs.  What else did you bring? We should make an inventory.  Go ahead. 28.  That's it? No mess-kit? No flashlight? No canteen? No waterproof matches? Didn't you get the packing list I sent you in my last letter? 29.  That's OK. We can share.  These are all library books. In my school you're only allowed to check-out one at a time. Some of these are going to be overdue.  Do you steal?  Why? You're not poor.  Are you depressed?  How come? 30.  Does that mean you?  To me, it is.  I'm sorry.  I'm on your side. 31.  Which one's the best?  Dear Suzy, You have a superb voice. You were my favorite animal in the program, by far. Please, find enclosed --  Dear Suzy, I am sorry your brothers are so selfish. Maybe they will grow out of it. Sometimes people do things without knowing the reasons for --  Dear Suzy, I accidentally built a fire while I was sleep-walking. I have no memory of this, but my foster parents think I am lying. Unfortunately, it is -- 37.  Dear Suzy, I have been trying very hard to make friends, but I feel people do not like my personality. In fact, I can understand why they might --  Dear Suzy, I know your parents hurt your feelings, but they still love you. That is more important. If they --  Dear Suzy, Here is my plan.  Dear Suzy, When?  Dear Suzy, Walk four hundred yards due north from your house to the dirt path which has not got any name on it. Turn right and follow to the end.  I will meet you in the meadow.   Rats! I should've put more pine needles on it. Let's go. We're almost there.  What do you creeps want?  Why?  No, I'm not. Didn't you get my letter of resignation? I quit the Khaki Scouts. 42.  Listen to some reason: I don't like you. You don't like me. Why don't you stupid idiots just let us disappear?  Do not cross this stick. 43.  It was him or us.  They got Snoopy through the neck.  No, he doesn't. He needs a morgue. 44.  Suzy. Look at me. Snoopy's not going to make it.  They're after us. We got to move.    I'm sorry I had to do that, but you're panicking. The first rule in any emergency is you never --  Who's to say -- but he didn't deserve to die.  I know!  On three!  Me, neither. 51.  Let's change it. What should it be?  I made you some jewelry.  Are your ears pierced?      Why do you always use binoculars?    What do you want to be? When you grow up. 53.    It's possible I may wet the bed, by the way. Later, I mean.    Some people frown on these problems.  It's not an accomplishment. I inherited it from my mother. It's actually not meant for a male to wear -- but I don't give a damn. 54.  I don't think so. We're getting to know each other better. I feel like I'm in a family now. Not like yours, but similar to one.  I love you, but you don't know what you're talking about.  I don't know.  Not to my recollection.      I admit we knew we'd get in trouble. That part's true. We knew people would be worried, and we still ran away, anyway -- but something also happened which we didn't do on purpose. When we first met each other. Something happened to us. 64.      What happened?  Ah.  Thanks.  A drunk truck driver smashed into them.  Get out of my chimney.    It's worthless to me. There's no point. Not without Suzy. 70.  How'd you get here?    Where we going?  Can we trust him?  Did you leave another note for Lionel?  That's true.  Field Mate Sam Shakusky, Troop 55, resigned.  Yes, sir.  Thank you, sir. By the way, where's the chapel tent?  I want to bring my wife.  I guess we better try to pretend we're struggling over our decision for a minute before we go back over there and tell him --  What? Why? How?  I don't know what to say.    We can't. It's her magic power!  You killed your dog, by the way.  Why do you consider me your enemy?  She's my wife now.  I'm saying before that. Six weeks ago. From day one. What'd I do wrong? I'm trying to understand. Why don't you like me?  I'm OK.    Follow me!  How deep is it? I didn't bring my life jacket.      they capture us, and we never see each other again anymore -- thank you for marrying me. I'm glad I got to know you, Suzy.  Let's jump.  See you tomorrow.",
        "Gadge": "Morning, sir.  I heard he never had any family in the first place.  Where's Snoopy?  No, she's in the woods with Shakusky.  Didn't you ever think about what would happen next?  I heard he's going to reform school.  Nobody knows.  He's going to work on a shrimper, if I understand correctly."
    },
    "imdb_rating": "7.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTEwMTc3NDkzOTJeQTJeQWpwZ15BbWU3MDI4NTAwNzc@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Set on an island off the coast of New England in the 1960s, as a young boy and girl fall in love they are moved to run away together. Various factions of the town mobilize to search for them and the town is turned upside down - which might not be such a bad thing.—Production",
    "name": "Moonrise Kingdom",
    "genres": [
        "Adventure",
        "Comedy",
        "Drama"
    ]
}