{
    "filename": "My-Girl_script.txt",
    "imdb_id": "tt0102492",
    "imdb_url": "https://www.imdb.com/title/tt0102492",
    "characters": [
        "Phil Sultenfuss",
        "Mrs. Hunsaker",
        "Nurse Randall",
        "Justin",
        "Harry Sultenfuss",
        "Thomas J. Sennett",
        "Ronda",
        "Arthur",
        "Ray",
        "Charles",
        "Gramoo Sultenfuss",
        "Vada Sultenfuss",
        "Shelly DeVoto",
        "Dr. Welty",
        "Mr. Bixler"
    ],
    "dialogues": {
        "Phil": "Well well well, what's going on in here?  Oh, you're dressing, uh huh, Harry Harry Harry Harry, don't you know it's not nice to lie to your big brother?  Oh yes, oh that's great.  Why?  That's true. Harry Harry sit down, let me fill you in on today's women, since the last time you dated, something happened, \"The Sexual Revolution\", now before that, you used to have to hold a door open for a woman, pull her chair out, pick up the check, no more no more, you wanna know what else is missing?  Harry, I'm serious, trust me Harry this woman's lifting us in, you gotta treat her like every Tom Dick and Harry.  Did you not tell Vada I'm a womanizer huh?  Oh she's picking you up, good you're on the right track.  Like a Sultenfuss. Go get 'em.    Harry Harry Harry Harry Harry, I told you to use fewer briquettes and now look what you've done. You've cremated them.  No, no no....   These two people do not have a good relationship.           He likes her.  Probably.  Yes I do, and I think she's very good for your father.  After your mother died, he was sad all the time, but before that, he was pretty funny.  Now when I see him with Shelly, sometimes he seems like the old Harry.  Well he wasn't one of the Marx brothers, but he made me laugh.",
        "Sultenfuss": "",
        "Mrs.": "Hi Vada.  Sure, come in.  Ohh, did you make your bed?  You're sure?  Come here, you've got a milk mustache.  Have fun kids.   Some days I think i'll be okay, others, well I have to force myself even to get out of bed, I know it's crazy, but sometimes I think he's just away at summer camp. How's Vada?  Vada. I've been wanting to come over to see you, Thomas J had this on him, I thought you might like to have it. You were such a good friend to him, I hope you'll still come by and visit me.  Thank you Vada.",
        "Hunsaker": "",
        "Nurse": "Hi Vada, what's wrong today?  Okay, take a seat, i'll check if the doctor can see you.  Okay, he'll see you, why don't you go in?   So you fill it with water like this, and what have you got? A water gun.  Oh yes, yes. Thomas, let me ask you a question. Does Vada ever tell you why she comes down here so much?  Do you think she is?  Why do you think she says that?  You know what I think? I think Vada's very lucky to have a friend like you.  Miss Vada, how are you feeling?",
        "Randall": "Hi Vada, what's wrong today?  Okay, take a seat, i'll check if the doctor can see you.  Okay, he'll see you, why don't you go in?   So you fill it with water like this, and what have you got? A water gun.  Oh yes, yes. Thomas, let me ask you a question. Does Vada ever tell you why she comes down here so much?  Do you think she is?  Why do you think she says that?  You know what I think? I think Vada's very lucky to have a friend like you.  Miss Vada, how are you feeling?",
        "Justin": "Hey, I think it's real beautiful. She want's to be a writer.  I hear that Vada, Flesh all a Mush or Rocky Road, it's about desire.  Okay what we're gonna do is, send our vibes out into the group.  Now, try to feel what the other person is feeling, without speaking any words, send out your vibe, and receive the vibes around you at the same time. Can you feel it?  No Vada, that's not what we're looking for, a hangnail is insignificant. What's in my soul, feel my aura.  I tell you what, let's try it again, hold hands.  What exactly do you mean by that?  Hey, we missed you man! Gimme a hug!",
        "Harry": "(in distance, from downstairs  Did I tell you, he was my woodshop teacher.  Yeah, I made a tie rack.  Vada, just put 'em on the stool.  (completely ignoring Vada's comment  Vada, we're trying to work here.      I'm embalming my high school teacher, don't sing. All right Arthur, just a slide of the needle.....    How may I... Help you?  Oh yes.  I think it's still available.  Uhh, Miss devoto...  Uhh, Miss devoto, these people are already at ease. This is not a Beauty Parlor, it's a Funeral Parlor.  Yes they are.    Ahh, excuse me a second will you? Hi George, this is a twelve-fifty-eight, I didn't want the burnished handles.  Just put it back in the display room fellers.  They come in all sizes honey, just like shoes.  Of course not.  Short people, very short people.  Pardon?  Oh, You still want it? Even though uhh...  You'd be doing hair and makeup and answering the phone.  Great, you can start right away. Call me Harry. Now, umm, is this what you'd normally wear for work? Don't get me wrong, I like it, very much, but the....   Oh, she's just pretending. Vada, get up here and eat your broccoli!   That's a lot of money for a little girl.    Last month you wanted to play the violin. Then you wanted to be a ventriloquist.     What?  Ahh, maybe next summer.  Uh huh?  Yeah. Didn't I give you a picture of what she looked like?  This was the Reverend Porter's wife, you have her looking like a two dollar hooker.  She did. This photo was taken a month ago at the church food drive.  That wasn't an image. She WAS an old school Marm. Fix it.  What do you mean??  Oh that, she just likes to play.  She was raised in a funeral home, she knows a thing or two about it.      Thanks, listen I wanna apologize for the other day downstairs, about Vada, I was a little harsh.  After my wife died, Grammoo moved in here to help take care of Vada. They were very close, but lately as her mind's been wandering more and more, Vada's been acting kinda crazy. I'm sure she'll snap out of it though.   Oh Hi, what can I do for you?  Oh, I'm just typing up a funeral notice, you know when someone dies people want it in the paper usually, it's a service we provide for the family.  I wrote that.  I prefer it to \"instead\", it has more dignity.  It's no big deal.  I haven't been to the movies in AGES.  I do enjoy playing bingo, if you'd like to join me for a game tomorrow night at church you're welcome to.   Nothing, I'm dressing.   I'm very nervous.  The last date I had was twenty years ago.  Oh come on.  Are you sure about all this?  Oh, I'm running late. Shelly'll be here any minute.  No, she's just driving over here, then we're taking my car. How do I look?  Goodnight Vada.  Ahh, I just wanna look nice.  Well Shelly's coming over, we're gonna go together.  She likes to play bingo.  Naah, I think you'd better stay here and keep Grammoo company.  Don't worry, there's a strategy to bingo. For instance, on a given night anybody can win, but I play the odds, when choosing bingo cards, I use a range of theories from the laws of probability to avoiding duplicate number systems. This way you get much more activity.  No. Just, more activity.  (as he sits down, to the person next to him     What's that?  Why d'you think these seats were empty.  Look, it's not always luck, I mean, depending upon the placement of the numbers, a guy with 10 cards could win just as easily as a guy with 100.  Oh, how do you mean?  Hey fellers fellers, it's just a bingo game.  I haven't had a bingo partner in ages.  Okay, sure.    It's nice.  Well it certainly looks bigger that it seems.  Yeah.  No, why?  Oh, that was Phil, trying to give me advice on dating 70's women. Look I'm so out of touch, I haven't dated women in ages, not since my wife died.  Ahh, complications during child birth, she died two days after Vada was born.  I brought the baby into the room a couple of times, she opened her eyes, yeah, yeah I think she saw Vada. It was..... Did I ruin this?  Here?  Is there enough room?  I haven't danced in.....  Rock?  At Widdman High I was considered a pretty hot date, I did a killer frugue.  Old Spice, Phil says it's a timeless classic.  Want to what?  Yes.  I ahh, better go.  Goodnight Shelly.   I'm tired of bingo, maybe we should try that drive in of yours.    Lettuce, watch out for the rust when you get lettuce.  I'm just picking some things up for the barbecue.  Not at all. Lot of potatoes!  I'm looking forward to that.  HEY, OUCH, damn it!! Vada, watch what you're doing.  Really?  Ahh, Vada, just put anything you want in the cart, anything at all. I don't know what's gotten into her today.  SHELLY, PHIL &amp; VADA SINGING \"STAR SPANGLED BANNER\" AND   That's what I do. Do you wanna do it??  Look if you think you know how, why don't you pre-measure the briquettes in little packages, put out a product, support me for a while!  Okay.  No, sweetie, not yet.  Soon honey, soon.  In a minute, look it's hot, sweetie you'll burn your nose, look out.   I'll second that.  Uhh, it's nice to meet ya. Uhh, we got burgers and hot dogs here if you'd care to join us?  Shelly?  Danny?  Okay, I know you've suffered a terrible loss, and there's really nothing anyone can do to comfort you, but I urge you to focus on the times you had with the camper, the trips you took, the sights you saw, those days are gone now, but they'll live on in your heart forever.    It's her home! It's where she lives!!  Danny.....  Who are you?  Oh then you'll probably be visiting us here quite often.  Because if he ever tries to take Shelly's camper again, I'm gonna bury him in my front yard.  Is it really your camper?  You can get the general idea...  Yep, there they are... They always look the same every year...  Did you ahh, love him?  (in the distance, from upstairs  Hey guess what? We're going to the carnival tonight, be ready to go in 10 minutes.  Shelly's coming with us.   I know, I know, let's go on the \"sit on the bench and rest\" ride.   Watch you don't knock out a fish.  I don't know which ball's mine.  Vada we have some good news, Shelly and I are getting married.  We're having the wedding sometime near the end of the summer.  I fall asleep at the wheel.  Vada, keep your hands on the wheel!!  Careful Vada, careful.  Shelly LOOK OUT!  I'm so sorry, it's all right ma, I'm very very sorry.   Grabs Vada by the shoulders Vada breaks free from Harry's grip, and walks briskly out of the room. Shelly looks back at Harry expectantly       Hi Vada.  What are you doing.  Is that the fish you won at the carnival?  He's getting big. Vada, come here and sit down for a minute.  Vada, something happened to Thomas J last night, he stepped on a beehive.  No sweetheart, you can't.  He was allergic to bees.     Ahh, Reverand Miles.   The funeral's starting.  I know that, but what do you want from me?  Yeah, and when those suppers are disrupted because there's a car crash, or there's a fire, or a little boy steps on a beehive.  Thank you Arthur.  He's gone sweetheart. He's gone!    Vada wait! Vada! Vada!!    What??  No, no.  No sweetie that wasn't your fault, things like that aren't anybody's fault, it just happened.  I forgot about that picture, where did you find it?  Ahh, that little Chevy was your mothers favorite car.  She was pretty, and kind, she had your eyes. Oh boy did she love to laugh. Sometimes when you laugh, you sound just like her.  Uh huh. You know what your mother did when she found out she was gonna have you? She came home and painted this whole room pink. She was so sure she was gonna have a little girl.  Yes, I did, very much for a long time, and even now, I get a little sad when I think of a pretty flower or a sunset that your mother would have liked.  That's good, memories are good sweetheart. Vada, I'm sorry; I was trying to keep it from you, I just couldn't. You're a good girl, and I want you to be happy; don't be an old grump like me. Seeya in the morning.   Mrs. Sennett, how are you doing?  Oh she's doing much better. Ahh she's just inside.",
        "Ronda": "I experienced something with my boyfriend the other day, and I wrote a few words down.  He covers me like a blanket, from the cold, dark night, As I look into his eyes, I know it's right, To touch, To feel, I know he's real, Flesh all a mush, Flesh ALL a mush, I can't fight it, There's no point, I wake up in Lighter joint.  Everybody hold hands, and close your eyes. Relax your muscles and take deep breaths.  Okay, open your eyes. What did everybody feel?  So right on, that's exactly what I sent out, and I felt like, you were full of inner peace and harmony.",
        "Arthur": "You took woodshop?  I made a tie rack.  I still have mine.  Vada!!  Good for you baby.  I like to buy off all the railroads.    No, I gotta go to the cemetery, keep your head up. Don't look at the ball, look at me. See. You were looking at the ball. All right? Keep your head up. Gimme some skin,   Excuse me Harry, Shelly, the minister's about to begin.",
        "Ray": "",
        "Charles": "",
        "Gramoo": "",
        "Vada": "All right, who's in raise your hand.  I knew he wouldn't come.  Leave him alone! Come on, let's go.    You're such a baby.  All right, follow me and don't say a word. You ready? You sure you wanna see it, or is someone gonna go yellow belly?  Okay. Lean forward.  I was afraid of this.  Well, sometimes when we get 'em, they're not completely dead, you know, like when they cut a chickens head off and it still runs around crazy.  I bet she's roaming around this house somewhere. There she is, in the rocking chair.  Hi Grammoo.  Seeya later.  Ahem.  Daddy guess what I beat Thomas J in monopoly yesterday.  Arthur!!  I beat Thomas J in monopoly yesterday.  Once you put the hotels on board walk and Park Place he puts a shoe in your way.  Cruella deville stole all the puppies, she was gonna make a fur out of 'em!    Dad?    Sure, come on in. So, have you had the unfortunate experience of recently losing a loved one?   Is that your camper?  That's really cool.  She's shy.  Daddy, how come that coffin's so small?  Is it for a child?  Then who's it for?  Oh wow, a real evil canieval.  I'm very sick.   Well, what is it? I can handle it.  That can't be, I have all the classic symptoms.  Yes.  I'll just have to get a second opinion.  The whole medical profession is a crack.  Hey look!  That's Mr. Bixler, let's go talk to him.  Hi Mr. Bixler!  It's okay. Mr. Bixler, I finished all the books for summer reading.  Yes, and now I'm reading War &amp; Peace for fun.  Mr. Bixler, how come you're painting this old house?  This is one big house for one single person.  How are you gonna get the money for this old house if you're not working?  How much does it cost?  What do you get for that?  No. Well, guess i'll go home and finish off War &amp; Peace.   No, I'm going home.  Dinner time?? You're like a dog! You just go home to eat. Don't pee on the hydrant!!         I am.  He is not my boyfriend!  Do you think I kissed that ugly old thing?  I'm not upset. I will never play with those girls. I only surround myself with people who I find intellectually stimulating.  He's allergic to everything.  It's a mood ring, it tells what mood I'm in.  It's only black when you're around 'cause you put me in a bad mood.  I don't think so. Shelly, how can I get thirty five dollars?  It's not a real school, it's a writing class, I wanna be a writer.  Shut your big fat mouth!  He won't give it to me.     Daddy, can I have thirty five dollars?  It's for school, for summer writing class.  Shelly thinks I'd be a good writer.  Dad?  Dad??  The money?  He forgot about the time I wanted to be a magician, I was really great at making myself disappear.   Wanna play?  (extremely frightened and timid  SKIPPING ROPE AND PHIL IS JUMPING IN IT PUFFING AWAY, VADA &amp;  There's Shelly!  Can we look around in your camper?  Big Ringo fan.  I would.  Did you read ALL these books?  What are they about?  Are you married?  Daddy said it's bad when people get divorced.  Can I use your bathroom first?  You don't have to wait, daddy'll be mad if you're late.    Uh huh, I wanna be a writer.  I wrote a poem too.  Loads of ice-cream by Vada Sultenfuss I like ice-cream a whole lot, It tastes good when days are hot, On a cone or in a dish, This would be my only wish, Vanilla, chocolate or rocky road, Even with pie a la mode. That's all I got so far.  My fears and secrets. I'm afraid I killed my mother.    Maybe they had a big breakfast.  Big deal, I can do that too. Thomas J, you got something!  Hurry!  Reel it in. He's only tiny, throw him back.  You're hurting him, don't kill him!!  Ouch! Darn hook!  I'm bleeding, did he get away? Go look.  Hey, we can become blood brothers.  You could pick that scab on your arm.  It'll bleed.  Uh huh.  Okay, rub them together.  Now we're blood brothers for life.   Are you going out somewhere?  So how come you're putting lipstick on?  I think lipstick looks fake, no-ones lips are that color.  No.  Shelly, do you think I'm pretty?  The boys at school don't think I am.  Do you like putting makeup on people?  Shelly, I would definitely hold off on that Hollywood thing.   No.  A girl can never wear enough eye shadow.  Oh, in the garage. Walk me over.  It's only a garage, come on.  Hey, one of my streamers is gone! It probably fell off in here.  That was Grammoo's. It's a phrenology chart, they used to study the bumps in your head to see if you had a good personality or not. Come here, i'll diagnose your head.  Come on, it's fun.  Hmmmm, interesting.  You have no personality.  Never mind.  Yes.  It's my mother.  No. Grammoo said she's in heaven.  What?  I think, everybody gets their own white horse, and all they do is ride and eat marshmallows all day, and everybody's best friends with everybody else, when you play sports, there's no teams, so nobody gets picked last.  It doesn't matter, 'cause they're not regular horses, they got wings, and it's no big deal if you fall, you just land in cloud.  Dad, why are you dressed up to go to bingo?  You never cared before.  Why?  Can I go too?     Here.  Sorry.  Let's go to the church, they're playing bingo tonight.  Pacifist!  Bed wetter!  We're not gonna bet, we're just gonna watch.  Duck!  Ssshhhhh, I don't want them to see me.  Go???    We can go now.        I felt Justin's hangnail.  I don't think I'm allowed to.  Grammoo once had a hangnail on her big toe. It got infected and traveled to her vocal chords, it ruined her singing voice, I don't think Grammoo thought it was insignificant.       Hi.  Sorry.  (picking up large can of prunes  I used to like to play with my Ken and Barbie dolls, Ken was my favorite. Then one Christmas I got them a camper, and all they wanted to do was hang out in it by themselves. So I wasn't too upset when they took that wrong turn and went over a cliff.  Are they ready yet?  When?  When??   Hey Shelly, like seafood?  See food!             He must like Shelly, I never saw him hit anyone in his life.  Does he love her?  Do you like her?  Why?  Really?  My Dad was funny?  My Uncle fought in the Korean war, he had a steel plate put in his head, Daddy said he didn't come back the same, one night, he picked up a radio station from Oklahoma in his teeth, it was really neat.   Aaaaaaaaaahhhhh.    Can't you see it?  It's there.  Dr. Welty, are you sure those are yours?  As good as can be expected.  What?    What?  So?  Are you crazy, you'll get stung!!  What do you want it for anyway?  My mood ring! It fell off! I gotta find it!  I am running faster!!  Jump in the water!!  Do it!   Yes..    I like the freak show.  Nephritis? It's a kidney disease, you don't get it from hot dogs.   I won, I won!!!  Where'd you get that ring?    Oh my fish!!!  Not acknowledging Harry's comment You'll be okay little fish.         Hi, can Thomas J come out?  Hi, wanna ride bikes?  Bye Mrs. Sennett.   I'm running away.  California, I'm going to Hollywood to live with the Brady Bunch.  No, you can't, they have enough kids, you'll have to live with the Partridge Family.   Get up!?  My Dad gave Shelly a ring.  You're such a retard, it was an engagement ring.  I don't like her.  He likes her better than me.    Then go home, baby.  Leave then, some friend you are.  No, I'm hiding out.       In social studies we learned some people stole the Limburg baby right out of his house, I think i'll sleep with my window OPEN tonight.   DADDY!! Daddy daddy!!!! Daddy!!??!?!  Daddy??!?!?!  Where's Daddy?  I'm hemorrhaging.    I'm eleven and a half.    My Mommy and Daddy did THAT?  I think it should be outlawed.  Oh, that's probably Thomas J, I don't wanna see him. It's not fair. Nothing happens to boys.    I dunno..     Grammoo, I'm going to the bathroom, i'll be right back.   Why do you think people want to get married?  I'm gonna marry Mr. Bixler.  It is not.  Not true.    Uh huh.  Maybe we should, just to see what's the big deal.  Here, practice on your arm like this.  Uh huh. Okay, enough practice.  Close your eyes.  Just do it.  Okay on the count of three.  One.  Two.  Two and a half.  Three.  Say something it's too quiet.     You better not tell anyone.  Well, let's spit on it.  Seeya tomorrow.  What?  For what?  I guess.     Hi.  Feeding my fish.  Yes.    Maybe I should go over and yell at him.        Dr. Welty!!!? Dr. Welty??  I can't breathe, I'm suffocating.  It hurts, it hurts so bad, make it stop.  The bee stings! I can't breathe!         Wanna go tree climbing Thomas J?   His face hurts, and where is his glasses? He can't see without his glasses! Put his glasses on! Put on his glasses! He was gonna be an acrobat.  Get away, get away!!     Mr. Bixler, I love you.  I love you like my Dad loves Shelly. I wanna live here.  No he wouldn't, I can't go home.  Who's that?  No....  Get away from me!   Why do you think people wanna get married?  It's my mother.  Now we're blood brothers for life.     I should have told Thomas J that he was my best friend.  Shelly, I stole some money from your cookie jar, to pay for the writing class.  I'll pay it back, besides, I don't think i'll ever go to class again.  I will I promise.  Goodnight.     Did I kill my mother?  The bees killed Thomas J, and I killed my mother.  I found this.  In the garage.  What was my mama like?  Really?  Do you miss her?  I think every time I see a climbing tree i'll think of Thomas J.  Daddy, it's not so bad to be like you.     Mrs. Sennett.  I will, I promise.  Mrs. Sennett. Thomas J will be all right, my mother will take care of him.  I can't stay, I just came to read my poem.  Weeping willow with your tears running down, Why do you always weep and frown, Is it because he left you one day, Is it because he could not stay, On your branches he would swing, Do you long for the happiness that they would bring, He found shelter in your shade, He thought his laughter would never fade, Weeping willow stop your tears, There is something to calm your fears, You think death as if you forever part, But I know he'll always be in your heart.   Hi Judy.  Things are a little better these days; I finally swallowed that chicken bone, Judy and I are gonna be in the same home room and the republican party just re-nominated Mr. Nixon.",
        "Shelly": "It's still available I hope?  I'm a licensed cosmetologist, I worked for two years, at the \"Dino Raphael\" Salon, all my customers cried when I told them I was leaving.  I have a wonderful disposition, I put people right at ease.  They're dead?  Stiffs??  The add just said \"Makeup Artist\"  Yes it is.    Oh.  Excuse me, what about the job?  I need the job.  Ohh, oh sure it's no big deal, you see all my former clients will eventually die, and all your clients used to be alive, so they have something in common.  Okay Mr. Sultenfuss, you got a deal.  I promise i'll take good care of these people, they deserve it, they're dead, all they've got left is their looks.    Excuse me Harry, I finished Mr. Layton's hair. He kinda looked...... Harry, what's wrong with her??  Who's winning?  You know Vada, you shouldn't let those girls upset you.    Thomas J?  To chocolate?  Chocolate?  Ooh, that's a pretty ring you're wearing.  Maybe black means you're happy?  I think you'd make a fine writer, did you ask your Dad?  Well you don't know that. Ask him.  Vada? VADA?? What happened??  (picking Vada up onto her feet   Excuse me Harry?  Could you take a look at Mrs. Porter?  Yeah,  You don't like it?    I just wanted to get past this \"old school Marm\" image.  Harry? I was just wondering, if there is anything wrong with Vada.  Well the other night at dinner...  I don't think so, I think she's confused about death.  Harry, I really think she.....    Hi.  Sure. I'll give you the royal tour. Woah! Gosh!  Uh huh.  Liverpool?  Ohh, right. Would you like a soda?  Thomas?  Oh! You shouldn't be looking at that, it's a little too old for you.  Uh huh.  Mostly love, and romance.  They're just fun to read. Here, cheers.  No, I'm divorced.  Well, sometimes married people just find out they can't live with each other.  With bottle of soda in mouth Thomas pulls out a few bank notes of largish denomination  Well, I guess you found my secret hiding place.  Nothing in particular, just putting it away for a rainy day.  Bye. Well Miss Vada, what d'you say we head back?  Sure.  Okay.   Excuse me Harry, I'm sorry, I just wanna let you know that the flowers were delivered. And the room's all set up.  I shouldn't stick my nose in other people's business. It's just that I like Vada, very much.  I'm sure she will.   Hi.  Nothing, I was just wondering what you were doing.  Oh right, right, Bader Lorenzo Died June 22 1972 Devoted husband to Nicolette. Cherished father of Babritzio and Heidi, In lieu of flowers, please send donations to the holy names society.  No kidding?  Oh it's good, \"In lieu of\" I love that word lieu.  In lieu... \"instead\".... No contest.  You have to learn how to take a complement. Movies, movies, ahhhh, \"Love Story\" at the drive in, I cried my eyes out, did you see it?  I love going to movies, especially at the drive in. I don't think there's anything more romantic than going to the drive in. I'll let you get back to work.      Hi Vada.  No.  A girl's always gotta look her best.  Have you ever tried any?  Come here, sit down.  Now, first we blot.  Take a look. I think it looks real nice on you.  Yes, Vada I think you're very pretty. You've got these great big sparkling eyes, the cutest little nose, an amazing mouth.  They'll come around. Close your eyes, I wanna bring out the gorgeous color in them. The first rule in applying eye makeup, is you can never wear enough blue eye shadow.  Uh huh, i've been trying to get out to Hollywood for years to do makeup for all the stars, I haven't gotten there yet. All right, open your eyes.       (in the distance, as a number is announced  (in the distance again, as another number is announced     I just had a terrible thought Harry.  I'm gonna be putting makeup on some of these people very soon.  Oh, I'm just not lucky Harry.  Kinda like men.  You can be in a room with 100 men, and not like any of them, or you can be in a room with just one man, and he's exactly the one you want.  I had a good time tonight.  Would you like to come in and see my house? Just for a minute.    Home sweet home.  I did it myself. I read a magazine article about how to maximize small spaces.  You can look in the bathroom if you want. People are always curious about that, like what happens when you flush.  Are you mad at me?  I don't know, tonight you just seemed a little cool, not opening car doors and...  What happened to her?  Did she ever see Vada?  Dance with me?  This is where we are.  In ages, I know, me neither.  See, you're not that out of touch. You're good.  What are you wearing?  Do you want to?  Kiss me.  Good.  Good at kissing, and dancing, I'm very optimistic.  It's only eight o'clock.  Goodnight.   Well, I guess it's official we had a date, maybe we can play bingo again sometime.  Goodnight.  Hey, I thought I recognized you two, hi Vada.  Yeah, me too, mind if I tag along?  It's for Shelly's famous potato salad.  You know this is gonna be my first 4th of July picnic in a long time.   How's it going chef?     Rub a dub dub, thanks for the grub, yay God.  Uh huh, why?      Danny, what are you doing here?      I've been living in it for over a year, the camper is mine.  Keep your voice down!  The boss is watching us...  God I guess i'll have to introduce you now.  (Talking to Danny, pointing at the people respectively     Ex...ex, ex...  Honestly Harry, he got the mustang, I promise.....    Stop it! That hurts!!     Bye Ralph.    Can we see it from the back yard?  Pointing upwards Look...  I would never marry anybody I didn't love.    So Vada, what's your favorite ride?  I don't think that that roller coaster agreed with your bad stomach. You know Vada you have to watch what you eat here, I remember one time I went to a carnival with my cousins David and Frank, and they both ate hot dogs, and the next day they came down with nephritis.  Well, I'm no doctor. All I know is, the next day they had really high fevers, and their faces got very fat. They baffled medical science, they were in a magazine.  They were!! \"Popular Mechanics\", no \"Popular Science\". I don't know, popular.   Oh look they're trying to hit that poor thing.  Perfect.  Oh great!!  Oh Vada, that's a gorgeous goldfish.  Vada we have something to tell you. Harry?  Vada? Would you like us to get you another goldfish?  Oh bumper cars, oh you can't go to a carnival and not ride the bumper cars.  Oh great Vada, come on...     Yes!!    Vada, Vada, what's the matter?  Well he just left, what's wrong?  What do you mean you're hemorrhaging?  Vada, did this happen in the bathroom?  How old are you?  It's okay, come on upstairs, we have to have a little talk.    It's actually a very beautiful thing, and look there wouldn't have been a Vada.  Believe me, some day, you'll feel differently.   Knocks Vada? View shifts to inside Vada's bedroom, where she is curled up in a little ball on her bed Vada remains where she is, the doorbell rings    Hi.  Yes she is, but she's very upset, so she's not seeing anyone.  Well maybe she'll feel better in a couple of days.  Sure.  Bye.       She won't come out. It's been a whole day. You have to do something Harry.  Open your eyes, she's eleven years old! Her only friend in the world is dead.  Stop hiding Harry, you run Harry. When I first came here, the idea of working with dead people, didn't exactly thrill me, but when I saw a family lived here, I thought, \"if I'm living without a family, at least I can work with one, and maybe once in a while i'll be invited in for supper.\"  I'm not asking you to stop feeling for those people. But life isn't just death Harry, don't ignore the living, especially your daughter.    It's dark, she can't be alone in the dark.  We, no, we've been looking since this morning, her teacher called, and he said that she went there first.....  But I....  Vada. Are you okay? Oh God.     I'm sure he knew.  It's okay sweetheart.  I'll tell you what, you dedicate your first book to me, and we'll forget about the whole thing.  Okay, get in to bed.  Goodnight.",
        "DeVoto": "",
        "Dr.": "",
        "Welty": "You are perfectly healthy.  Sweetheart, did they bring Mr. Layton to your house today?  Vada you've gotta stop this, there's absolutely nothing wrong with you!   No.  Vada there is no chicken bone stuck in your throat.  Vada, what's wrong sweetheart?  Oh, wait relax now, let me look, let me look, come up here and we'll have a look.  What Hurts Vada?",
        "Bixler": "Mademoiselle Sultenfuss and the amazing Dr. J! How's the summer treating you?  Really? Already? The summer's just begun.  No wonder you're my prize pupil. What about you Thomas J?  Better get on his case Vada.  Well I just bought it, now I'm fixing it up.  Well, you never can tell... I might get a pet.  Well I'm gonna teach creative writing this summer, so, I'm doing some work.  Thirty five dollars.  Me, two hours a week, talking about poetry. This an interrogation Vada?  It's summer! You're kids! Go play!    The great way, is not difficult for those with no preferences, with the absence of both love and hate, everything becomes clear and undisguised. That was written by a Chinese Philosopher in the year 600. Now why would I choose to bring that up in a creative writing class? Because, the absence of judgment helps us to appreciate reality. In other words, I want you to listen to your classmates writing, with a clear and open heart, okay? So who's gonna go first?  Now, I hear judgment, let's not forget the part about the open heart... Vada, is there, something I can do for you?  For this class?  Vada, this is an adult writing class.  Vada, you sure you wanna do this?  Welcome to the class, go find a seat. Okay ahh, who's next?  The floor's yours Ronda.  Uhhh, va, uhh, Vada.  Please.  Vada that's... It's very sweet, and it rhymes and that's also good  but, you're not expressing to me what's in your soul. I want you to show me how you see the world, your fears, your desires, your innermost secrets.  Before the class started, Ronda and Justin wanted to lead the class in a group meditation.  Vada, what did you feel.  Vada! I was just on my way to your house. Are you all right? I'm so sorry about Thomas J.  Okay, okay we don't have to talk about him, Vada, Vada we don't have to talk about him, it's okay. We won't talk about him all right?    Oh, Vada...  Pause as he takes all this in I think your Dad would miss you.  Suzanne, this is Vada.  Could you just give us a minute?  That's Suzanne. She and I are gonna be married this Fall.  I...I was gonna bring her to class next week. I wanted to hear your poem. Oh Vada, please honey I cared for him too, Vada please! Vada, Vada sweetheart don't.....      I mean, be dangerous And unpredictable. And make a lot of noise.  Vada.  I was hoping you'd stop by today.  We'd love to hear it."
    },
    "imdb_rating": "6.9",
    "description": "Vada Sultenfuss is an intelligent, bubbly, hypochondriacal 11-year-old girl. Her father, Harry (Dan Aykroyd), is a mortician and widower. Her best friend is Thomas J. Sennett. Then Harry hires a new receptionist named Shelly DeVoto, and life will never be the same again.—grantss",
    "name": "My Girl",
    "genres": [
        "Comedy",
        "Drama",
        "Family"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYWM2ZDliNjItZTcxOC00NTY2LWE1ODctNzRhNGM3YWIyYjBiXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_QL75_UY281_CR1,0,190,281_.jpg"
}