{
    "filename": "Next-Friday_script.txt",
    "imdb_id": "tt0195945",
    "imdb_url": "https://www.imdb.com/title/tt0195945",
    "characters": [
        "Karla (as Lisa Rodriguez)",
        "Lil Joker",
        "Deebo (as Tommy 'Tiny' Lister Jr.)",
        "Day-Day",
        "Uncle Elroy",
        "Mrs. Ho-Kym",
        "Craig Jones",
        "Girl #1",
        "D'wana",
        "Baby Joker",
        "Suga (as Kym E. Whitley)",
        "Roach",
        "Joker",
        "Mr. Jones",
        "Baby D' (as Robin Allen)"
    ],
    "dialogues": {
        "Lil": "",
        "Joker": "Get yo dumb ass in the back.  What the fuck you looking at?  So what?  It shouldn't have been in the street.  Get down.      I'll take you later.  Hey!  I said I'll take your fuckin' ass later.  Now get out of here.  You're scaring our company.  Get up.  Take it in the room.  What was what?  I didn't see no silver thing, and neither did you.          Want me to take a look?  No, keep working.  Yo, man fuck that shit.  Do it later. It's Friday, time to party, SA.  Close the door.  Not until you come party with us, man.  Alright, put it in that drawer.           Fuck that.  Who locked this door?  Who locked this fuckin' door?!     I don't want no doors locked around here. You hear me?       Karla!  Who you talking to?  I heard a voice.     You shut the window.     You fuckin' lover boys hear that?  Hear what?  Don't fuckin' move.  What the fuck you want?  What?!  This look like a 7-11 or something?  Get the fuck outta here!     Shut up!  Both of you right now!  I don't believe this sugar shit. Something ain't right.    Here comes Karla, put the guns away.  Keep your mouth shut.  Nothing.  What you want?  Take your car.  Yeah, and hurry up.  If everything's alright.  We might let you leave, too.         It means you Miyateas are staying with us. Get the duct tape. You know what to do.  Put your clothes back on.     Sorry you gotta walk, but I'll call you tomorrow.      Shut the fuck up!  If you don't tell me where my money is, I'mma show you how close we can get.  I'm hearing a lot of talking, but I'm not hearing the right words.  Maybe the other guy took it.          Tape his mouth shut.  I'm sick and tired of bullshitting with you guys. Baby brother, go get the chainsaw.     Cheeco!  Cheeco!  Here, boy!     My little brother went out to get my chainsaw.  I'mma show you what happens to fools who don't tell me what I wanna hear.  You ever see Scarface, mothafucka?  Go see what's taking him so long.     Junior?!  Junior?!  What the...     Where are these fucking guys?     What you doing here?  Looks like a dead man.",
        "Uncle": "Hey, Debo, heard you running from a ass- whippin'?  If you see that boy again, bite off his ear off like Mike Tyson.  You know me?  I would've shot his big ass. Hey, Willie, how's it going?  Still steppin' in dog shit every day?  Don't worry 'bout nothin', big bro.  He in the best fuckin' hands in Rancho Chocomunga, baby!  This my world, you just a nigga late paying rent.  Ain't that right, nephew?  Send Betty my love. Boy you looking good. I'mma take these in the house for you, man... and when you finish with this cat, come inside.  I got something to show you.     Craig, I want you to meet my old lady, Suga.  Suga, this is Craig.  Okay, okay, that's enough.  Go put on some damn clothes.  Suga.  Go ahead and get us something to smoke on.  Man, that girl's gonna kill me one day. Viagra ain't working.  My back keep going out... she don't never get enough.  But check this out.  I got to lay some ground rules. Your my family and I love you.  You're welcome to anything you want in my home. But I don't wanna catch you in the refrigerator or in my Suga bowl... you feel me knocking?  Well, let me in.  Oh, that's D'Wana.  His ex. Day-Day, the crazy bitch is back!  Boy, you got you a little fatal attraction, huh?  I had two or three of them in my day.  Craig, I hope you know how to deal with women better than this fool.  Help him to his feet.  Let's get him to the bathroom.  Wet your eyes, boy.  Stay in there for about 20 minutes.  Yeah, 20 minutes.  Trust me.  I've been pepper sprayed nine times.  20 minutes.  Let me show you my back yard.  You know it's bigger than y'all back yard.  Yeah, you gotta have a little money to live out here, Craig.  I never thought I'd be the kinda nigga to move to the suburbs.  But as soon as I got my check, I was gone.  Paid 230 thousand dollars cash on this house.  Cash money.  They wasn't gonna stick me with no 30-year payment plan.  That's for suckas.  They got my daddy like that for a Cadillac years ago.  I got the only house on the block that's paid for. That's why I'm the king around here.  You like that pool?  Don't need water.  We didn't have no pool in the projects...so none of us swim.  Never... But me and Suga can get real nasty in that Jacuzzi, though.  (shaking the water off the  Good.        Nephew, you got perfect timing...  We about to start a little puff, puff give in this mothafucka.  Are you down?  I know you smoke weed, right?  'Cause your lips is getting black.  All I smoke is blunts.  Them fuckin' Zigzags don't do nothing for me.  Boy, I can roll a blunt better than them bitches in Havana.  I know Willie don't let'cha smoke in the house, but I'm ya uncle.  I don't care how high you get in my house.  Long as you let me hit it...  Look at that.  Now I'mma show you the real \"Puff Daddy.\"       Negro, what the hell you doing to my woman?  Suga!  What you doing to my nephew?  Passed out?  Can't hang, huh?  Boy, I knew you was a lightweight.  Passed out on one funky ass blunt.  They don't make 'em like they used to, baby.  Come on, woman.  I'm faded and feeling X- rated.  It's Mr. Nasty time.  Mr. Nasty time. But take it easy on me, girl.  Make yourself at home.  Oh, baby, right there.  Right there...bite the nipple, baby.  Bite it! Bite it!  Yeah, mothafucka -- yeah, come on, baby, get busy...       I like it rough now.        Ah damn.  Damn.  What?!              I don't know, I didn't leave you no damn message!  Hell naw, Willie. Them fleas and tics must be sucking on yo' brain!  I don't know.  Suga, go ask Miss Ho Kym if she seen them.     Craig, where the hell you been?  No.  Thought he was with you.     Me, too.  You think they're in there?  Willie, shut up.  Yo' old ass need to get in a little bit o' trouble sometimes.  Wait a minute.  I gotta go get my shit.  Thank you.  I only got two bullets in the mothafucka, but it's better than nothing.  What about that ugly dog?     Shut yo' ass up.  Damn.  Damn, big bro.  You swung that like Sammy Sosa.    I slip my disc, again... Oh got damn.  Don't move me.  I lost something, nigga.  What it look like?  Boy, Day-Day, I'mma kick yo' ass for getting me into this mess and hurting my back!  I moved out here to get away from this kinda shit!  What 'em!  Watch 'em!  Get off yo' back, Craig!  Wait a minute!  I live across the street!  Yeah.  Paid cash.      When my back gets better I'mma beat the black off you, Day-Day.  Sorry, my ass.  I threw my back, again.  Naw, baby, no lovin' tonight.  For what?  We ain't gonna have no house after the auction tomorrow!  Thanks, Roach, but I can't accept that. We're moving back to Watts where it's safe.  I don't know.     Don't listen to him.  How much we got?  It's gonna feel good to pay my taxes.  You didn't do nothing.  Hey, that George Jefferson shit works. Thanks, Miss Kym.  You better take this money.  Well, Craig, you're welcome anytime.",
        "Elroy": "Hey, Debo, heard you running from a ass- whippin'?  If you see that boy again, bite off his ear off like Mike Tyson.  You know me?  I would've shot his big ass. Hey, Willie, how's it going?  Still steppin' in dog shit every day?  Don't worry 'bout nothin', big bro.  He in the best fuckin' hands in Rancho Chocomunga, baby!  This my world, you just a nigga late paying rent.  Ain't that right, nephew?  Send Betty my love. Boy you looking good. I'mma take these in the house for you, man... and when you finish with this cat, come inside.  I got something to show you.     Craig, I want you to meet my old lady, Suga.  Suga, this is Craig.  Okay, okay, that's enough.  Go put on some damn clothes.  Suga.  Go ahead and get us something to smoke on.  Man, that girl's gonna kill me one day. Viagra ain't working.  My back keep going out... she don't never get enough.  But check this out.  I got to lay some ground rules. Your my family and I love you.  You're welcome to anything you want in my home. But I don't wanna catch you in the refrigerator or in my Suga bowl... you feel me knocking?  Well, let me in.  Oh, that's D'Wana.  His ex. Day-Day, the crazy bitch is back!  Boy, you got you a little fatal attraction, huh?  I had two or three of them in my day.  Craig, I hope you know how to deal with women better than this fool.  Help him to his feet.  Let's get him to the bathroom.  Wet your eyes, boy.  Stay in there for about 20 minutes.  Yeah, 20 minutes.  Trust me.  I've been pepper sprayed nine times.  20 minutes.  Let me show you my back yard.  You know it's bigger than y'all back yard.     Yeah, you gotta have a little money to live out here, Craig.  I never thought I'd be the kinda nigga to move to the suburbs.  But as soon as I got my check, I was gone.  Paid 230 thousand dollars cash on this house.  Cash money.  They wasn't gonna stick me with no 30-year payment plan.  That's for suckas.  They got my daddy like that for a Cadillac years ago.  I got the only house on the block that's paid for. That's why I'm the king around here.  You like that pool?  Don't need water.  We didn't have no pool in the projects...so none of us swim.  Never... But me and Suga can get real nasty in that Jacuzzi, though.  (shaking the water off the  Good.        Nephew, you got perfect timing...  We about to start a little puff, puff give in this mothafucka.  Are you down?  I know you smoke weed, right?  'Cause your lips is getting black.  All I smoke is blunts.  Them fuckin' Zigzags don't do nothing for me.  Boy, I can roll a blunt better than them bitches in Havana.  I know Willie don't let'cha smoke in the house, but I'm ya uncle.  I don't care how high you get in my house.  Long as you let me hit it...  Look at that.  Now I'mma show you the real \"Puff Daddy.\"       Negro, what the hell you doing to my woman?  Suga!  What you doing to my nephew?  Passed out?  Can't hang, huh?  Boy, I knew you was a lightweight.  Passed out on one funky ass blunt.  They don't make 'em like they used to, baby.  Come on, woman.  I'm faded and feeling X- rated.  It's Mr. Nasty time.  Mr. Nasty time. But take it easy on me, girl.  Make yourself at home.  Oh, baby, right there.  Right there...bite the nipple, baby.  Bite it! Bite it!  Yeah, mothafucka -- yeah, come on, baby, get busy...       I like it rough now.        Ah damn.  Damn.  What?!              I don't know, I didn't leave you no damn message!  Hell naw, Willie. Them fleas and tics must be sucking on yo' brain!  I don't know.  Suga, go ask Miss Ho Kym if she seen them.     Craig, where the hell you been?  No.  Thought he was with you.     Me, too.  You think they're in there?  Willie, shut up.  Yo' old ass need to get in a little bit o' trouble sometimes.  Wait a minute.  I gotta go get my shit.  Thank you.  I only got two bullets in the mothafucka, but it's better than nothing.  What about that ugly dog?     Shut yo' ass up.  Damn.  Damn, big bro.  You swung that like Sammy Sosa.    I slip my disc, again... Oh got damn.  Don't move me.  I lost something, nigga.  What it look like?  Boy, Day-Day, I'mma kick yo' ass for getting me into this mess and hurting my back!  I moved out here to get away from this kinda shit!  What 'em!  Watch 'em!  Get off yo' back, Craig!  Wait a minute!  I live across the street!  Yeah.  Paid cash.      When my back gets better I'mma beat the black off you, Day-Day.  Sorry, my ass.  I threw my back, again.  Naw, baby, no lovin' tonight.  For what?  We ain't gonna have no house after the auction tomorrow!  Thanks, Roach, but I can't accept that. We're moving back to Watts where it's safe.  I don't know.     Don't listen to him.  How much we got?  It's gonna feel good to pay my taxes.  You didn't do nothing.  Hey, that George Jefferson shit works. Thanks, Miss Kym.  You better take this money.  Well, Craig, you're welcome anytime.",
        "Mrs.": "",
        "Craig": "In the movies, when you beat up the neighborhood bully; you suppose to live happily ever after.  But around here; that's when all the drama begins...  Last Friday; I got fired for the first time.  I got high for the first time.  I got shot at for the first time and I kicked Debo's ass for the first time...  I was the man that night; and Debo ended up going to jail for a couple of years. But he told Ezal he was getting out next Friday.  He said, when he see me, he was gonna smoke me on the spot...  And today is next Friday...  I'll be out in about 35-40 minutes!     Soon as my pops found out what Debo said to Ezal, he wanted me to move with my uncle and little cousin in Rancho Cucamonga.  Til' things calm down, or Debo went back to prison.  Whichever comes first.  I feel like the biggest punk around here. I wiped Debo's ass.  He should be the one moving.    What's the matter?     I didn't wanna leave my neighborhood at all.  Especially my homeboy Smokey.  But he went to rehab last week.  I know I'mma miss him...  Daddy, punch it!  You fake ass Suge Knight!    What's that smell?    Smells like you didn't fall in no mud.  What's wrong with the window?  All damn.  It's alright.  Why they got to have the loudest house on the block!  You coming in?  Hey, Pops, I'm grown.  Can't nobody get me in trouble no more.  What's crackin'?  Naw, it ain't like that.  Alright, I'll remember that.  I'll remember.  Thanks, Unc.  I know, that's when Uncle Elroy cussed out everybody, and threw up in Aunt Faye's backseat.  I know, we had a good time.  But ever since you guys moved out here, it seems like we've lost touch.  Who is that?  They ever let you hit the switches on that Cadillac?  This you?  Must be nice.  I wish we won the lottery. Come up on a million dollars like ya'll.  This my baby.  I feel like a new nigga in this car.  I get mo' phone numbers rollin' this, than I ever did on the bus.  Excuse me?  Yeah, I'm 'bout it.  What kind of activity?  Nice to meet you?  Man, this a cool house.  Yeah.  Oh, yeah, where you work at?  Thanks for reminding me.  Thank you.  Nice to meet you.  Yeah.  Uncle Elroy, who's that girl by Day-Day's car?  Lay down, Day-Day.  Stop moving.  I know, be still.  That's too much water.  You paid cash?  It's cool, but where's the water?  Y'all never use it?  That's okay, Unc.  I can't swim, either.  You straight?  Just a little.  What's the matter with your girlfriend?  What?  Restraining order?  Where the hell you meet this girl?  Damn, you got a stalker.  You got a restraining order on a little girl named Baby D?  Who is that?  Yo know what?  I'm starting to like Rancho Cucamonga.  Why?  Yeah, it's bad.  And that scratch make it ugly.  It's long and crooked...make you not wanna even drive it.  Hold up, Day-Day.  Hey!  Hey!  I'm Day-Day's cousin, Craig.  What's your name?  Craig and Karla, damn that sound pretty good together.  Where you going?  Oh yeah, why you walking?  You want us to give you a ride?  What you mean, you don't know?  Just wait here.  What are you worried about?  Why not?  She was cool with it.  What you mean, so?  Why you say that?  No thank you. It's too early.  Suga.    I don't know, I think I passed out or something.  I don't remember.  Hold on.  I said hold on!  Can I help you?  I don't play for no team.    What is it?  Oh damn.  Uncle Elroy?  Uncle Elroy, you got a tax notice.    Uncle Elroy, wake up.  You got a letter today.  Unc.  Naw, naw!  Unc, wake up!  It's me!  Wake up!  I walked.  Yeah, ya'll got a notice today.  It came certified mail.  I tried to wake up Uncle Elroy but he thought I was Suga.  Yeah, that's why I walked down here.  I don't know.  Did ya'll forget to pay it or something?  See how much it is?  Damn...how much money ya'll got left from the lottery?  Okay, plan B.  What's the matter?  I ain't trying to get in it.  No I'm not.  Day-Day ain't here.  I'm his cousin.  Yeah, I work here now.  Yes you did.  I don't know... I think he went out the back.  I thought ya'll wanted to buy a CD?  Right this way.  You know damn well you don't listen to no jazz.  Where you going?  You better stop running from that girl.  Hell yeah, I remember you.  It's cool.  You ain't got to apologize for your brothers.  They're big boys.  Most definitely.  What happen?  What you mean talk to her?  I'm gone.  I know we cousins and all, but don't try an' hook me up with the big little sisters.  Not me.  Day-Day?  Yeah it is...the best day before the weekend.  What's the green stuff poking out?  Naw, I already ate.  It ain't a bong but, wa-la!  Hey.  Black magic.  I didn't think you smoked bud that much.  You better open up a window or something before the smell gets out.  That ain't gonna work.  Still gonna smell it.    I ain't trying to rob you...  Man, Day-Day is my people!  Nobody!  Shut up.  I been trying to tell yo' ass that... Day-Day is my cousin.  They're right there in the back.  Nothing.  In a strange way, I feel responsible for Day-Day getting fired.  If I wouldn't have fought Pinky, and gave Day-Day the joint, he'd still have a job.  I don't know yet.  Sorry about today, man.  Wait.  Check'em out.  You see that?  It's something in that hydraulic pump.  Naw.  I bet'cha it's something better than air.  I don't know, and it could be anything. But I just say we go take a look.  Could be.  Rather be crazy than homeless. Now all we need is a big pack of baloney.  It's about to work, just come on.  That's what the baloney's for!  What's the B-G's?  Look, Day-Day.  If we don't go over there and take a look, this might be the last night you got a home.  Now trust me.  Now all we gotta do is find out where the little one put that pump.  Take it and see what's in it.  It is easy. You know why?  'Cause they're not expecting it. Now, Roach, you gotta occupy Cheeco. Long enough for me and Day-Day to take a good look.  Well get along with this one. Go ahead of us.  Don't get seen and don't let that mutt out of your sight.  Cheeco.  Come on, he should have'em by now.  You go first.  You go first.  Day-Day, if you don't hop that fence I'mma throw you over.  What?  Me too.     Wait.  He's still over by Roach.  That pump was full of money.  I saw where they put it.  Stay right here, I'mma climb in and go get it.  No, man, just wait.  Huh?  I hope you don't think I'm crazy, but I just had to come in here and show you I ain't scared of yo' punk ass brothers...and you wouldn't have be scared of 'em neither if you had a man like me in yo' life.  Yes I did.  Excuse me.  Most of it.  I just hate to see you in this situation.  Why didn't she put'em out?  I'm sorry to hear that.  Can I get out this way?  I did.  Is that door locked?  Make sure.  I got my cousin Day-Day waiting for me.  I be damn.  Okay.  Yeah, I'm cool.  See you later.  What is he doing here?  Have you seen Day-Day?  Daddy, Uncle Elroy, I need your help.  You see that?  Yup.  It's a long story.  Right now we gotta do somethin'.  That's a nice piece of heat right there.  Come on.  He's on the other side, sleep.     Need some help?  I'm not sure, but I think they're in this room.  Yeah, pops!  Stretch it out.  Ya'll mothafuckas help me!  I love Fridays.  You're welcome, Unc.  You too.  Nothing.  Naw, I'm got live ghetto fabulous.  make sure you get that car fixed.  I don't know.  Probably next Friday.  Well, all's well that ends well.  Another Friday gone.  Another problem solved. It's a trip to know that things can get crazy in the suburbs, too.  I can't wait to get back home...to the peace and quiet streets of South Central.",
        "Jones": "Craig!  Craig!  Off yo' ass and on yo' feet; this ain't the time to beat your meat!  Hurry up; today is Fri-day!  And we gotta hit the high-way!        Craig!  Let's go!  I don't wanna hit that traffic.  I be got damn.  Craig!  Craig!    I fell in some mud.  Now hurry up!  That nigga worst than them damn pit bulldogs or something!  That's why moving wit'cha Uncle Elroy and Cousin Day-Day is the best thing for you right now.  It ain't about being a punk, son.  It's about this...  My great, great grand daddy on my Momma side; had a saying... 'See a fool -- leave a fool.'  Somebody else a get him. Plus, I don't want that fool shooting at my house trying to hit yo' ass.  Must be your upper lip, 'cause I don't smell nothing.  What it smell like?  I gotta get'em fixed.  They don't roll down.  Just hold your breath.  Nice neighborhood, huh?  18-years of chasing dogs; and my lazy ass brother hits the lotto his first time playing.  I still can't figure that one out.  Ah, son, don't be no hater.  You know your uncle ain't got no taste.  Just don't let him rub off on you.  No, I'mma go on to work.  I don't wanna hear Elroy's mouth.  Now listen to me, Craig.  It's gonna be different living over here.  Don't let your uncle and your cousin get you into no shit.  Understand?  Hey, Day-Day.  Where's yo' big head father?  Make sure you look after my son out here. Don't get him involved with none of your bullshit, Roy.  Craig, remember what I told you.  Oh my God!  Just hold on, Craig.  I'm on my way.  Damn.  Say, man, hurry up.  We got an emergency out here.  I knew I shouldn't have ordered that extra hot sauce.  Say, man, what the hell you doing in there?  Open the door.  Hey, you that boy?    Oh, Michael, that boy better check his drawls.  I got your message.  Where's Craig?  You didn't call the Sandwich Joint with a urgent message?  Somebody left me a message.  Well where's Craig and Day-Day?  Hold up, Elroy, that's my boy.  Craig, what the hell wrong with you?  Where you been?  I saw it.  You come way out here to get into more trouble.  You could've stayed at home.    Two bullets?  Yo' ass ain't changed. Back in the day, all I had was a stick.  I got my mase.  Need to lose some weight.     Nigga, you got knock the fuck out.  The skills are still intact.  Now tie his ass up, Elroy.  What's the matter?  Go to the body, Craig!  Go to the body!  That boy just don't never learn.  What the hell is he carrying?  Jump up and down on him.  Good Lord.  Smokin' what?  Well, we better hit the road, too. Craig, get your stuff.",
        "Girl": "What was that?  That silver thing.  No.  Oh, poppy, I like it rough.  Shut the window.  Fine.",
        "#1": "I can't get jiggy with this shit. Where is the damn manager?  No, give me my damn money back.  Right now, and I don't have no damn receipt neither.  I don't have no damn cover.  Bullshit!  I'll go postal in this mothafucka!  I'm sorry!  Don't hit me!  Don't hit me.  What was that?  That silver thing.",
        "D'wana": "What it look like I'm doing?  You can't quit me, I'm pregnant!  I got your bitch right here.  I expect you to return all phone calls and take me to lunch today.  I'll be back out here on my break.  Nobody quits me.  That white boy said he was in there.  Who are you?  We didn't come here for Day-Day.  No we didn't.  We came to buy a CD.  Where's that boy that told me Day-Day was here?  Can I look for myself?  Where's Day-Day?  If Day-Day comes back, tell him I came by and need to see him.  Lamaze classes are Wednesday.  Come on, 'D, let's go.  Ain't the rest room this way?  I gotta pee.  Thank you.  He's in there!  He ran out the door.  I told you.",
        "Baby": "Day-Day, don't make me break this window!  You suppose to work here now or something?  Now move.  I do... can you help me find the jazz section?  Where is he?  Okay, I know what I want this time.  Yo' cousin, Craig.  Hook us up.  Just tell him to come over here and talk to me.  Go, fo' I change my mind.  I'mma get you, Day-Day!  You gotta come out sometimes!  Get down.  Want me to take a look?  Hear what?    Maybe the other guy took it.  Cheeco!  Cheeco!  Here, boy!",
        "Roach": "Yo, Day-Day!  Check me out.  I feel you.  I've just been practicing that one move all week. I thought that was it.  Did you see that?  That was a W.W.F. hit right there, huh, Day-Day?  What up, bro?  What it say?  What it say?  What is it?  Pinky's.  That was a girl on a cell phone.  She said she's outside in the parking lot waiting for you to take her to lunch.  That the big one, huh?  I'll do it.  Hey, ladies.  I don't know, he must've left.  Will do.  Yeah.  Haul ass, dude.  Don't stop.    Great moves, Day-Day.      For sure.  That's how I like 'em.  Negative...they vamped.  Shouldn't we straighten up out here before Pinky gets back?  Bummer, huh?  And Friday is suppose to be a kick-ass day.  That's fuckin' poetic, Craig.  I know how you feeling.  And if I had my bong right now, I'd let you 'toke 'til you choke.'  Dude, right here.  All out. No lungs.  All I got is this.  That's cron-don, sir.  My mom hates for me to smoke, so she made me bud-brownies. Wanna bite?  Come on, Day, try it.  For moms.  Wo!  Sorry, bro, reflexes.  How did you do that?  Weed doesn't solve problems.  It eases the mind, and the soul.  Enjoy.      I got an idea.  This is a little theory of mine... it should work.  Fuck yeah.  No way.  Watch this.     R-U-S-H Intensely.  My spleen.  I thought the vacuum would work.  You could sell your Beamer.  My bad.  Maybe you can ask him to loan you the money.  I know.  Why me?  I know what I'mma do.  Go home and face the music.  My dad is gonna kick my ass for getting fired again.  Yeah, me too.  Later.  My board!  You ran over my board!  Who the fuck is that, Day-Day?  I'm not letting nothing go.  They killed my board.  Me neither.  I say we go over there and kick their asses.  I can take the little one.    Try an' hold it, man.  Squeeze your ass cheeks together.  Dude, dogs hate me.  I don't know why. Me and K-9's just don't get along.  Fuck, what's his name?       My baloney has a first name.  It's C-h-e- e-c-o.  My baloney has a second name it just like the first Cheeco.  Ooooohhhh I love to eat it everyday if you ask me what I'll say.  Cheeco's got to be the dumbest fuckin' mutt in the whole wide U.S.A.        Good boy.  Nice dog.  No lungs, baby.  No lungs.  ...like I was saying.  A guy like me, and a dog like you, don't need this bullshit. We need to be in Maui renting jet ski to fat funks in flower shirts.  You feel me,  Where's Craig?  Why did he go in the house?  Go for it.  No one's gonna hear that.  The music's playing.  This is a knock.  Hold on.  A man, you broke my fuckin' board and I don't appreciate it.  And some rolling papers.    I don't know.  Hey, mister Joker, have a heart, bro. It's Friday.  Yeah, brown and white relations, too.  Bite his ear!  He's a boy, dude.  Don't worry, bro, you, Suga, Day-Day and Craig can live with me and my parents. 'Til you get back on yo' feet.  There he go.  Hey, guys, I'm outta here.  Hey, man, the pleasure's all mine. Thanks for the dog, and the money.  Maybe my dad won't kick my ass tonight.  Okay, later, bro.  Hey, Craig, nice smokin' wit'cha.  Later, Mr. Jones.  Bye, Suga."
    },
    "imdb_rating": "6.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZTg4NTkzMDEtM2MzOS00MDE1LWJmYWItYzdiMGRiNTdmZmFkXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_QL75_UX380_CR0,3,380,562_.jpg",
    "description": "Debo has escaped from prison and is looking to get revenge on Craig. So Craig's dad takes him to Rancho Cucamonga to hide out with his Uncle Elroy and cousin Day-Day, who moved to the suburbs after winning the lottery. But once he gets there, Craig and Day-Day have a set of suburban misadventures that make his South Central experiences look tame.—<jgp3553@excite.com>",
    "name": "Next Friday",
    "genres": [
        "Comedy"
    ]
}