{
    "filename": "Next_script.txt",
    "imdb_id": "tt0435705",
    "imdb_url": "https://www.imdb.com/title/tt0435705",
    "characters": [
        "Callie Ferris",
        "Cavanaugh",
        "Security Chief Roybal (as Jose Zuniga)",
        "Showgirl",
        "Mr. Jones",
        "NSA Director Wisdom",
        "Liz Cooper",
        "Mr. Green",
        "Mr. White",
        "Cris Johnson",
        "Miss Brown",
        "Davis (as Charles Chun)",
        "Mr. Smith",
        "Jeff Baines",
        "Kendall"
    ],
    "dialogues": {
        "Callie": "",
        "Ferris": "If we can verify your ability, we may be able to help you avoid a criminal trial.  Call me, like they did. And try to hold him till I get here. Yes, ma'am. Nice looking guy. I guess. Maybe she's in cahoots. He's beaten six dealers in a row. You're sure he's not counting? We've got five decks in the shoe. And he wins more off the top than the bottom. Moves a lot from table to table. Keeps his stacks short.      You! I just need to talk to you!  Homeland Security! You were right. This guy is a lot more than lucky. At least now I know he exists. Jeannie, I have to see him right away. He's on with Washington. We just went on Code Orange. What's the threat?  I need six men to bring him in.  Come on, Eric, you saw it. We're flying blind and he's got radar.  You bastard.    I went screening for it in a highly scientific way. And now I've identified someone who matches all the indicators. So the next obvious step is to... Let me do my job! - Christ! Don't you ever quit?  No. I've got a country to protect.  Terry? Terry! - I know you've got your hands full but I was wondering if you might be able to spare a few warm bodies for an outside operation.  That's why I need your people. Everybody else is assigned.  He suggested it.  Depends how helpful you are. Oh, I know everything about him.  I need to speak to him alone.  Why'd he come back to Vegas?  One step ahead of the game. Always. Is there some place we can speak privately?  You're wasting your life, Cris. You have the most amazing talent, and you're running from it.  Now if you say that man in the liquor store was going to shoot five people, I believe you. Why else would you kill a stranger?  But no good deed goes unpunished, eh?  And that's how it's going to be in this world. People will either hate you or want to exploit you.  I can fix your legal problems. More importantly, I can give you a chance to use your gift.  I'll be honest with you, Cris. That's not an option. Your country needs you. And if we don't grab you, somebody else will.  I'd like you to come with me for some testing. Would you be willing to do that?  Where are you going?    I need him alive, Cavanaugh. Even if he resists.  Tell them. You'll never catch him. He knows what you're gonna do to him.  That's very helpful information. Medium coffee, black, and a glazed.  Long enough to know we're not gonna catch him by surprise.  Interesting idea. It'd explain a whole lot.  In this case, it does.  Look, from your own experience, this guy can't be punched, shot, surprised, captured, or confined. So either he's got something special, or you're an idiot.  And I'm not saying you are.  We've got to think like he does. We've got to think ahead.  You know you're very sexy when you're ruthless.  My guy's got a flashlight. We just need to bring him in.  This one first.  A trap for somebody who can see the future.  And then these.  Stay in the car. If he sees your shadow, he won't take the bait. We hear you. I'm serious. This guy can smell your farts before you even eat the beans. Miss, I won't even think about beans. Sounds like a crock to me.  Agent Ferris.  That's why I came to you.  Even his best friend says he'll never turn himself in. - At this stage, there's only one way to keep him from self-destructing.  But silently, right?  Gentlemen, try to think like him. - If the plan is to go in right after he's trapped, he'll see it coming and he'll slip away before he's trapped... Like he's always done. How does your plan change anything? At least he won't hear it when the trap closes.  And if he doesn't know he's trapped, he can't foresee knowing he's trapped.  The eureka moment is when he realizes he's been trapped.  Voila.  Women hate good-looking men. Rejecting them makes us feel powerful. And that's more important than love?  No. But she doesn't really love him. Liz... Liz?  Surprise.  Okay. Wait for my signal.  What's she waiting for?   A hot human shape hurries over rough terrain with stealthy urgency.   I want him alive. Tell them. And the Feds want him alive. We need to get to him first.  You've made a very stupid mistake.  But I've profiled him for months. And I can tell you this: he doesn't love anybody. How could he? To him, we're not even human.  We're the characters in a videogame, and he's the player with the joystick. We say our lines, and he practices his moves until we do what he wants.    By a lot.    Try to kill him. Use everything you've got.  No, it's an order. Don't get emotional here.  There's only one way to beat this man. He's got to see his own death, and not just maybe. He's got to see himself die again and again and know it's inescapable. And then, maybe, he'll surrender. And if he doesn't?  That'll be his choice. And he was no use to us anyway.  Somehow we've got to bring him down to our level. Got any ideas?  I'm workin' on it.  Move in fast. Keep him moving. Don't let him rest.  Don't give him time to look ahead. That's the key.     You take command of the chase. Have cars block these intersection.  Get in the chopper.      I need your vehicle.  Playing chicken.  But so do I. And for once, that makes us even.   Total focus. No doubts or decisions.    Watches through binoculars as Cris snaps one cuff around his wrist -- and waits. She shouts into her radio.   Cuffs on both wrists. Leave him if he doesn't.  I don't want to find out. Both wrists!  I was wrong about one thing. He is capable of love.  I only ask one thing from you. Give me a chance to earn your trust. I did, and you failed.  Then give me another chance. You get `em all the time.  This game was different. He knew I wouldn't flinch. What's new with the Code Orange?  Electromagnets.  Not possible with him.  Cris, please step into the next room.  Cris, we'll be firing at you with live ammo. Are you ready? You're shooting your secret weapon?  Now we are going to use live ammo.  I promise you, he won't be hit.  He's almost impossible to shoot, hit, surprise, capture, or contain.  Be my guest. How do you know it's prevision? Maybe he's reading minds.  No minds to read. The guns are aimed automatically by infrared. What other tricks can he do? Please step into the next room.  We're still in a Code Red if I'm not mistaken.  He's almost never had to face consequences. Cris, are you ready to get in the chair?  We need information, right?  Leave him there. We'll start again when he recovers.  Simple. We make him watch the news and tell us about it.  I don't know. But I suspect we can increase his range with practice. Especially if we restrict his future to only watching news. Then he'll be like a timescope.  This is just for starters. You want to stage a pre-emptive strike, he can tell you if you'll hit the target and whether they hit back and what went wrong. And you can do this over and over until you get it perfect before you begin. And all he's ever done with it is a little gambling and securities fraud? I know, it's amazing; but he's not ambitious. Damn, how will we control this guy when he figures out what he's capable of? We control him now. We just have to keep it that way.  Can we deal with your sexual insecurities at another time?  I told you, he doesn't read minds. He sees the results.  Don't give him time. Send them in now.  If there's one soft heart, one slow shooter, he'll know it. Don't worry. I caught him once; I'll catch him again.  Get him a local. You asked for these as soon as they were ready.  Not now. You might want to check this result. How pregnant? A few days.  This is getting interesting. We have a mating pair.  We don't actually have to do anything. We just have to decide to do something...unthinkable.  Threats don't count. When he foresees that you actually did kill her, that she's dead... He won't let it happen. - He'll come to us. Surrender. And she'll live.  But it only works if we're not bluffing. Because he'll know.  He's getting away.  You understand what's at stake here? We're playing for the future. Not just what happens next, but what the future is. What the rules are.  If one man will know it and control it -- and have power over the rest of us. Or if we'll have power over him.  If you want, I'll pull the trigger.  I'll join you in a minute. I need to take care of some details.   She picks up the phone. Dials a number.   This is Ferris. I'll need a chopper tanked up and ready.  We'll find out, won't we?  God, you're remarkable.  I wish you had a little more sense of duty.  You know what our problem is?  It's really...  Exactly.  It sounds so insincere when you say it.  You know what I'm going to say next?  My door will be open. We can start from scratch.  The magic word is cooperate. That's all we've ever wanted to hear from you.  I see you got our message.  Where did you get this number? I want to cooperate.  That's music to my ears.  I'm sure we can work something out.  We don't have time to waste. Maybe you could start by telling me how your talent works.",
        "Cavanaugh": "You showed me yours. I'll show you mine.  He's just some gambler. Lives completely off the grid. No bank account. No credit cards. No previous record. So why'd he do it?  Must be a wacko. He'd never met the victim. No connection whatsoever. And in fifteen months, why haven't you caught him?  You saw. He's got eyes in the back of his head. He can see around corners. I even had him in custody once, and he disappeared. Must be very embarrassing.  And what is it you want him for? Questioning.  About? Stuff that hasn't happened yet.  Well, I guess Homeland Security trumps liquor store murder. How can I help?  Yes, ma'am.  What, you think he's got some kind of radar?  And Area 51 would explain my missing tennis shoes. But that doesn't mean they're on a flying saucer.  I'd call your proof a little iffy.  Let's say I'm not an idiot...  Then what?  I know.  I say we get the whole department up here and bust his ass. And by that time, his ass'll be long gone.  Then why won't he see through your trap? Let's try this one more time.  You haven't been chasing him for three years. Miss Cooper.  And that's when we go in. You still don't get it. This has to be clear to your whole army. And yours. -- After she comes out and we lock down the cabin...We don't do anything. We wait. But if he's already trapped...?  That kinda makes sense.  When is that? That's the point. We want to delay \"eureka\" for as long as possible. So by the time he sees trouble and decides to waltz away... He's already been in the trap for hours.  What's taking so long?       We tried it your way. Go for it. But I want him alive.  Boys, now it's our turn.  Is this a joke?  This is your last warning.",
        "Showgirl": "",
        "Jones": "",
        "Liz": "What business is it of yours?  Aw Christ! Look what you've done!  Yeah, you are.  It looked like you spilled it on purpose.  I don't know. To impress me?  How's that?  And what are you, a leprechaun?  Great, what do I have to do?  When does the luck kick in?  I don't feel anything.  Son, I haven't had a tingle in eight months. Since my worthless no-good dickhead of a husband ran out on me.  Thirty. I teach fifth grade.  No, that was the problem. - I couldn't get pregnant.  You didn't. I'm just running off at the mouth. - That's why I was in Vegas. To see another doctor.  No, he had to have a Randy Junior.  What, is there an accident?  When does the luck kick in?  I don't feel anything.  Why?  It's too late!  Let go! Are you out of your mind?!  Get out!   I don't give a flyin' goddamn! You don't grab the steering wheel!  Damn straight, cause you won't be in the car!  All right, I'm starting getting the picture. - Basically, you're a no- good, worthless ramblin' man who's never held a job in life.  This is where I turn into town.  Thanks for the card.  No, no, I've gotta teach tomorrow.  So long.  Well, maybe just a quick one.  Hey, George. Hey, Liz.  I'll take the usual and he'll have a...  He's not here now, is he?  Thanks.  We gotta split. My ex is here. I gotta talk to you, baby.  Sure, Randy. I'll call you tomorrow. Bullshit. I've left a dozen messages on your phone. Excuse me. We were just leaving. And who the hell are you? Don't mess with him, Cris. He used to play hockey.  I'm not yours anymore, asshole! Baby, I've made a terrible mistake, and I just want to undo all the... Let go!  Get out of here! Get out!  Stop it, Randy! Stop it!  Get out of here! Get out!  Oh God, I'll take you to the emergency room.  God, I hate that bastard...Will somebody get some ice!  Are you kidding? You stood up for me.  Sorry it's so cold in here. The heater's broken.  I really should've left him a long time ago. God knows he deserved it.  Cause I don't leave. I never have. My boyfriends always left me.  I get attached to people, and then I'll put up with anything.  Sit in the light.  I never minded that I was the more devoted one. Somebody's gotta be more this or more that.  But they never appreciate it, that you're there for them.  They just try and get away with more and more, and figure you'll just...  Salty.  Christ, I don't even know you. I have no idea who you are.  Sorry to get you caught up in my soap opera.  You ever been married?  What happened?  And you didn't? No, I did, too.  Why are you telling me this? These personal details.  That was...I've never... We sent the payload to Livermore, and by measuring the cesium degradation, they've identified the reactor in Smerlensk that it came from. Washington has our birds tracking for that radiation signature in key cities. What do we know about the explosive? Our lab downstairs is still studying the C-4 sample. It's Czech, but we haven't nailed down the batch.   She rushes in, looking for Cris. - He's not there.  She hears CLANKING from the laundry room.  On the floor, Cris sits next to the heater, which lies in pieces. He tries to adjust the remaining apparatus.   What the hell are you doing?  Well, you're not leaving till it's fixed, I'll tell you that. I'm afraid that could take a while.  As long as it's done right. Did Wisdom talk to you? What do you need?  And what was the main staple of their diet? Trout.  From the lake?  Right. And the Washo were so jealous of their fishing grounds that when other Native Americans came to trade for dried fish, they were only permitted to remain one night. I'll be right back.  What are you doing here? I brought ice cream sandwiches for everybody.  Ice cream sandwiches? Do you have any idea how much fat they have in them? Don't you see how overweight half of them are?  Well next time exercise a little forethought, okay?  No.  Put a few in the freezer. I love ice cream sandwiches.  You have been such a bad influence. I'm gonna be up all night grading papers.  Funny. We've only known each other a week.  I think you're serious.  And what'll we do for money?  This is ridiculous.  Well, first of all, it's the middle of the school year.  And I'm in charge of science fair.  It disturbs me, Cris, that you think it's okay just to duck your responsibilities.  I don't believe that. If it's meant to be between two people, somehow it'll happen.  What are you afraid of, Cris? Why are you running away from yourself?  Whatever it is you're looking for, I don't think you're going to find it on some island, cut off from the rest of the world.  Now I've got to grade papers. A religious fella, are you? Ready to turn the other jaw?  Cris.  So you throw rocks at them?  Cris...I think you should move on. Today.  It doesn't matter.  What are you saying, you're some sort of prophet?  Cris, it's sweet that you feel responsible for people. But I think you need help. And I'm...I'm not the one to help you, right now. I've got too much going on in my own life.  Why?  Yeah. And I don't want to have anything to do with you.  Don't follow me. Don't talk to me. Get out of my life!  Cris...I think you should move on. Today.  I swear, I can't figure you out.  Sometimes you seem mindlessly impulsive. But other times I feel like you're utterly calculating, saying exactly what you think'll push my buttons.  Don't you think it's kind of an amazing coincidence that neither of us can have kids?  Then open up. Talk to me. Where are you going with your life? Wherever it takes me. You never think about the future?  No goals? Dreams? Ambitions?  What's that?  That's all? Just a family?  You've got to be making this up.  You poor guy.  I'll meet you inside. I need to pick something up at the drug store.  Yes?  He's not a killer. He needs help. I agree. But he has a long history of resisting arrest, and the state wants to hunt him down with fifty trigger-happy cops.    Okay, I'll talk to him. I'll try to get him to...  I ran into a friend I hadn't seen in a while.  She said we could use her cabin up at the peak.  Nothing. Okay, when you press the remote, the cabin will lock down like a big jail cell.  Cris. Do you think we met for a reason?  Yeah.  That's not very romantic.  I shouldn't.  I'm late.  That's why I went to the drug store. To get a pregnancy test.  You know what this means?  How did it...?  It's like a miracle.  Cris, I know you don't mean to hurt people. But you need help or you're going to keep on hurting them.  How do you know this?  Like yesterday, with the car?  You were afraid something bad might happen so you...  What if you hadn't done anything? Have you ever waited to see what would happen?  Cris, you're a good man. And I will stand by you through this. But you have to...  I won't let it happen. I'll get you a lawyer.  Cris...Cris.  And then?  Will I see you again?   As predicted, the hem of her robe gets caught in the thorns. She tries to pull free, but she's stuck.  StakEOUT SITE  Ferris and Baines wade into the thicket to extricate her.  Among the thorns  Ferris and Baines reach Liz.   The predicted words hit her hard.   Then why do I feel like a traitor?  I trust him more than I trust you. I wouldn't swallow the \"I love you\" part.  You've never even met him.   fishtails down the twisting mountain road.   I'm getting used to miracles.  No idea. I was just trying to be unpredictable.  So what's the plan? Bonnie and Clyde? Remember that place in the South Pacific?  It's starting to sound really good.  Will we make it?  Christ, you live dangerously.  I grew up at Love Canal.  A neighborhood back East built over a chemical dump. A bunch of my friends had birth defects. I always figured I was lucky just to be sterile.  And somehow we did.  You make it look easy.  I promise.  Work with them Cris. So we can be together.  You're not going to kill me. That's what the bad guys do.    Can't you just leave us alone?  This is what they wanted you to prevent?  And you wouldn't help?   Where Cris lies in bed with Liz's head on his chest, the morning after their first night [p. 45]. Since that point, Cris has been up for hours - scanning the futures. Finding no path worth taking.  INT. Wisdom's HOUSE - dawn  Ferris sleeps next to Wisdom. She's hogged the covers. Her cell phone rings. Drowsily, she answers.    She sits up.       Don't overdo it. We just met last night.  While I was sleeping?  Then you really are an angel.  Then why are you running away from me?  I don't understand. We got off to such a great start.  See ya?",
        "Cooper": "",
        "Green": "",
        "White": "Thirty feet square. CRIS JOHNSON, wearing a jail uniform, sits in a HEAVY CHAIR that is bolted to the floor. Mid- twenties, jaded, rebellious, handsome as a statue, Cris radiates a serene, if somewhat scruffy, charisma.  He faces a PLASMA SCREEN MONITOR on a bare wall. To the left of the screen, an unframed MIRROR; to the right, a DIGITAL   Size of an elevator. Cris stands there, bound ankle and wrist. Click, the metal shackles open automatically and drop to the floor.  Cris reaches down for them. Possible weapon. Struggles to lift them. Can't.    Cris gives up on the chains and sullenly steps forward.    Size of a squash court. Cris enters gingerly and peers around. Twenty feet up, an OBSERVATION WINDOW, opaque. On the other walls, RIFLE BARRELS poke through NARROW SLITS. The door slides shut behind him.  Observation room  Ferris leans forward and speaks.    Cris balances, at the ready, as the three rifles take aim at him. He LUNGES at the very instant that one rifle FIRES. A bullet ZINGS by his ear.  As the second rifle fires, Cris contorts -- and a bullet parts his hair.  As the third rifles fires, he tumbles away, almost a blur.  More shots, in rapid sequence, erratic rhythm. Two at a time. Three at a time.  Like a pinball, Cris pivots, crouches, dodges every bullet. Then suddenly stops. Stands there. An easy target. Click, click, click, the guns are out of bullets.    which is familiar from the opening sequence, but not exactly the same. Because it's not exactly the same future. A HEAVY CHAIR, bolted to the floor, faces a PLASMA SCREEN MONITOR on the wall. To the left of the screen is a MIRROR; to the right, a DIGITAL CLOCK-CALENDAR.  Ferris' FACE appears on the monitor.   Cris eyes the chair with suspicion.      Cris looks into the mirror and sees his face reflected - as an old man. He turns away.        Cris rises from the floor into a crouched position, like an animal ready to pounce.  The door flies open and A DOZEN ARMED MP's charge in, rifles at the ready, and surround Cris. Cris checks the time on the digital clock. It's 5:12 PM.  Corridors  Ferris and Wisdom getting closer; he's on a cellphone.        Motionless, in a crouch...Cris suddenly dashes between two MP's, shoves them aside, makes for the door. He gets smashed by the RIFLE BUTTS of the nearest ones, then stomped by the full contingent. [Attempt #1]  AREA OUTSIDE THE White ROOM  Ferris and Wisdom arrive and look through the window.    Baines arrives with THE DOZEN ARMED MP's we saw in the previous scene.    Cris runs to the door and tries to bar it so they can't enter. He gets shoved aside by the force of the MP's as they charge in. [Attempt #4]  observation ROOM  Wisdom and Ferris watch as Cris still just crouches there, motionless, in the empty room. Wisdom flicks off the mike.         DR. FIELDING approaches Wisdom with a syringe.",
        "Cris": "And \"we\" is...? Homeland Security. Now if you would, please look at the monitor and tell us what you see, say, five minutes from now. Are you there yet? Surfers. Good. Now can you move ahead ten minutes. Ants crawling up a tree. Excellent. Can you get to 1900 hours?  Just the check. \"The future ain't what it used to be.\" Ever hear that expression?  It's a joke, but it's true. The future changes every time you look at it. Because you looked at it.  Cause once you see it, you're different.  Maybe just a little.  And that changes everything else.  It's got something to do with quantum physics. That's why I stay away from roulette and craps. It only takes a millionth of an ounce to change a roll. Just placing a different bet can throw things off.  I've got other rules, too. I don't play against people, like at poker. Only against the house.  And my goal isn't to win big. At least not any more. The idea is to go unnoticed so I can keep coming back to the trough.  So no jackpots. No longshots. No big bets except when I want `em to see me lose.  Try that one, man. I've got a feeling. Then you play it.  Against my religion.  Do it, quick, before somebody else gets there.  Mainly I stick to blackjack. Boring but controllable.  And safe unless they think you're counting.  Grand Dad, rocks. What's his name? Not staying here. Pays in cash. We're running him through face check. Invite him for a drink. If you don't mind.  Scuse me, sorry. What's wrong with you guys? He's right next to you! Aisle 63! There! There! He's right there in front of you! Walk toward each other! Maybe he's on our frequency.  Most of the time, I'm not paying attention. Just making sure I don't step in a mess.  Sometimes I get a blast from far away.  Or I can start with a glimpse of something close and keep pushing on.  Usually it's none of my business.  Guy around?  Tell him it's King Midas.  I need to cash some chips. - Got tagged.  I've been trying to lay low. That's him. I call him the Road Runner. You know? Beep beep. What's he running from?    That was the night Donna broke off our engagement.  I was so drunk I could barely see now.  Christ, Guy, did you have to?  Well, you can save your breath. Cause I know what you're gonna say.  I'm sorry to hear that. But I'm done playing the market.  Except last time, Neal didn't take \"finito\" for an answer.  I can stay ahead of `em forever.  Because I don't want to be used any more.  Cause what I want is freedom. And you don't get it by giving it up.  Enjoy it while it lasts.  Looking for this?  Don't mess with somebody who knows your moves before you even think 'em.  Don't wait for me. You know what I think? I think I know the future better than you do.  I came to fix you dinner.  Sometimes not knowing is better.  If I tell `em the truth, you know what happens? I end up with the Feds. - And you know what they do to me?  It's not funny, Irv. That's all I do, day after day, for the rest of my life. Watch the news until I lose my hair and croak. There's no way around it?  The best I can do is stay away from all of `em.  I know, I know, but there's something I gotta do first.  She's coming here. The Fed.  Let's play it out.  I've got the place all picked out. It's called Palau. Three hundred teeny islands in the South Pacific. Nothing ever happens there, so there's nothing to foresee.  Her.  I haven't met her yet.  It has to be her.  She's the mother of my child.  I guess the doctors were wrong.  He's got my thing.  My thing.  Agent Ferris, come in.  Let's go in the kitchen. I've got a roast in the oven. No, you two stay here. I'll watch the food.  Yeah, people say I could have been a chef. Don't be cute. There's too much at stake here.  Everyone but you, of course.  Trust me, it's better if I don't. It's better if I just mind my own business.  Nobody's grabbed me yet. You're up against more powerful forces now.  I know, I know, I've got the place picked out. But there's something I've gotta do first.  I have to go.  I know, but they're coming for me.  This is for nurses and stuff, to make things a little easier.  I looked, Irv, I really did. I went down every path, every treatment. Sometimes there's just no...  Mind if I join you?  Is that cruller any good?  Shopping for a car?  Rough day? I don't want to talk about it.  I'm so sorry. I'm a spaz.  Why would I do that?  Look, I'm sorry. If I could, I'd do it over.  Here. Divorce, bankruptcy, repossession. Yeah, I'd call that a bad year.  Well, Liz, your luck's about to change.  You met me.  An angel, actually. And we always reward the people who help us.  You don't have to do anything.  But I could use a ride.  It already has.  Not even a tingle?  Then you're way overdue. For a reversal of fortune.  Any kids?  I mean of your own.  I guess that's good. Considering.  I'm sorry. I didn't mean to pry.  He didn't want to adopt?  It already has.    Just take it!  No it's not!  Traffic was piling up. You didn't see it?  We could'a been stuck there for hours.  You're right. I'm sorry. I panicked. I get phobic sitting in traffic. It won't happen again, I promise.  How `bout at the next gas station? Please. I'll fill up your tank. You're wasting time here. How long have you been in law enforcement? About six months?  I am really really really really sorry.  But lately I've been traveling all around Oregon. It's really peaceful up there.    Well, thanks for the ride.  You're welcome. I don't suppose you'd have time for a drink.  I understand...Well, see ya.  Sierra Pale. Two Sierras. Randy's been hanging around.  Just a friend. Then don't get between me and my woman.  Easy, man.  Easy, man.  No ho'pital. I don' nee' ho'pital.  I'm sorry I'm causing you all this trouble.  Actually, I wasn't standing for that long.  Why didn't you?  What a terrible quality. You're too loyal.  Once you start watching, it's hard not to get involved.  Almost.  She wanted kids.  It's just that...I can't.  I don't know. You asked and...I guess I felt like you'd understand. I do. I can't either. Have kids.  That was incredible. What was?  This.  You said it was broken.    Do you want me to leave these somewhere?  All right then. I'll just go.  I've got a better idea. Run away with me to the South Pacific.  But we're going to be happy together for the rest of our lives. Really, I peeked.  Deadly.  Let's go pack your bags. We'll leave tonight.  Don't worry. That's always been easy for me.  Why?  They'll replace you.  They can pick up the slack.  I - I don't think it's okay. I'm not that kind of person. But I have this feeling, this very strong feeling, that it has to be now. We have to leave soon, or it's not gonna work out.  Yes, but sometimes you have to make it happen. You have to seize the opportunity before it's too late.  Your students are very lucky.  But then you have to sign the divorce papers. Randy, don't you dare. Paul, Janice. Have you met Cris?  I said I'll pay.  No need for that. I'll give you cash. Okay? Will you take cash? Two thousand? That should cover it.  Okay, three. I'll run him through the computer. People shouldn't drive that fast around kids. They shouldn't get away with it.  What do you want me to do? Wait for people to die?  Look, there's something I've been wanting to tell you.  It does. Cavanaugh...No, you were right to call...Ring Ferris and have her meet me there. They've located him near Tahoe. If you let him get away again, you may not have a job.  It's not religious. I just happen to see my life before it happens.  Flip it.  Just do it.  Heads.  Flip it again. Tails.  Tails. Heads. Tails.  Now you believe me?  Liz. Don't you see? I can get us all the money we need.  Why? Because I care so much about kids that sometimes I overreact?  Believe me, the feeling is mutual.  What do you mean?  You want to talk to my doctor? I'll get him on the phone. No, really, I mean it. I'll have him send you my records. Because I want you to trust me.  All the time. - But mainly how to stay out of trouble.  There's only one thing I've ever wanted.  A family.  Well, I was, as they say, left on a doorstep when I was two. Never found foster parents who could put up with me. - So to me, a family sounds like plenty.  I wish.  God, this is gorgeous.  What's wrong?  You mean, do I believe a higher power brought us together?  No. I think we're just the last in a long chain of accidents that started with the Big Bang.  Oh, but it is. Think of it: For us to meet, everything from the very beginning, every sub-atomic event, every galactic cataclysm, every step of evolution, every act, every accident, every decision in the history of the universe had to happen exactly the way it did just so you and I could be together, right here and now.  To whatever happens next.    Late?  I do now.  I have no idea. Unless...But that still doesn't explain...  Liz, I really did have this problem. I wasn't lying to you.  But this is good. This is amazing. I want this baby more than anything.  For both of us.  You lying bitch! You betrayed me!    Let me talk to you for one minute. I won't hurt you, I promise.  The man I killed was there to rob the store. He was going to panic and shoot five innocent people.  Because I saw them die.  Yes.  Not \"might\"! Those people died! - They just hadn't died yet.  Once.  That's why I don't go out much. So I won't be there to see.  If they catch me, they'll put me in a cell without a trial, and they'll never let me out. They do that, you know.  There's one decent path. But if we're gonna stay on it, I need you to do exactly what I say.  Will you give me one chance? One chance in exchange for a miracle?  A few steps on, your robe will get caught on a thornbush. You won't be able to get unstuck. Ferris and a tough guy will come help you. She'll say, \"You've done your country a great service.\"  Be unpredictable. Surprise works to my advantage. - And read this when you're safe.  Bet on it. She's coming now. We stay put. Tell them.   moves erratically, presciently, in bursts, dodging the streaking spots of glare.  StakEOUT SITE  Liz is drinking coffee next to Rick's police car. Ferris approaches, coldly knowing.   Believe me now?  Where were you going?  I'll check on our ride. Yeah... No, the jet's not sold...I'm here with him now...Of course, he's pissed...I can ask. He wants to know how soon the jet can be ready. I'll wait until eight o'clock. But if he's not there, I'm taking off without him. It's arranged. But we have to get to the North Vegas airport by eight.  Right now I'm just trying to stay alive.  Just the opposite. I never take chances.  Did the doctors ever say why you couldn't have kids?  What's that?  Except you're not. And neither am I. We're different, that's all. We just had to find the right match.  Oh shit. Oh no. What is it?  I blew it.    Squinting.    Fast forward to the HEAD ON COLLISION! Then a COLLAGE of ALTERNATE CHOICES AND OUTCOMES: Cris swerves; slams on the brakes; gets shot making a run for the rail; spins out on the roadbed; crashes over the side, over the side, over the side! But in every version, the Hummer is unchanging. Unrelenting. Dead on.    The falling car crashes onto the canyon wall, tumbles downhill, explodes; falls again, this time crashing directly onto boulders at the bottom...    He drives toward a specific segment of railing between two light posts.    Still on the rock. Looks up and sees a cable being lowered from the helicopter. He looks around? Is there another way out? Out of choices, he reaches for the cable. Misses! Loses his balance. Flails. At the last second, he steadies himself.  He wants to live.  The cable dangles back into range.  Cris grabs it.  The cable is hooked to A PAIR OF HANDCUFFS.      Why does everybody have amnesia but me?  Don't let them know you're pregnant. You don't have to raise him. But at least let him be born. Can you do that? It might be the only chance either of us gets.  I'll get us out of here. We can still make the plane. Are you out of your mind? Did you ever play chicken before?  \"From now on, Cris, the bullets are real.\"  I'm going. No need for a hotfoot. The floor is electrified. He must have tried resisting and foreseen the result.  Why? Why not?  I know what happens. Tell us.  You tie me down and never let me out. That's only because you won't cooperate.  Because you're trying to force me. Work with us, Cris, and you can be a hero. Fight us, and things will get worse and worse. Now sit in the chair. One. Two. Three.  I don't believe you.  Don't get too attached to your arms and legs. Don't.    I'd say you have way too much.  Give me your keys.    \"We got off on the wrong foot.\"  \"all been a big misunderstanding.\"  \"We've never meant you any harm.\"  I guess you're a better liar than I am.  It'll never happen.  When are they going to give up? After you're dead?  To a gang of murderers?  What's about to happen...you've brought it on yourselves.  I'm planning on it.  Get out!  I guess...  They didn't explain. They were trying to force me. They were gonna make me a slave.  Liz? Where are you going? To the doctor.      Tears escaping from his eyes. ROTATE FRAME and discover that the previous cut was actually a...   But I have conditions.  Liz... Come back to bed.  I can't. - I have to go.  There's something I have to do. Something you'd want me to do. And I can't put it off any longer.  Liz, it's not like that. I searched for you for a long time. I want to be with you forever.  But a lot has happened since then.  We're going to have a child.  I don't expect you to believe me. But when you do find out, remember that we came together for a reason. That this wasn't just...one night. It was a special chance for both of us.  I'm not...I'm taking the long way around.  And I looked for a happy ending... But this was the best I could do.  I wouldn't be surprised. Mr. Johnson, we meet at last.  I wasn't ready till now.  \"The future ain't what it used to be.\" Ever hear that expression?  It's a joke, but it's true. The future changes every time you look at it. Because you looked at it. Cause once you see it, you're different. And that changes everything else.",
        "Johnson": "",
        "Miss": "",
        "Brown": "",
        "Smith": "",
        "Jeff": "",
        "Baines": "We're strictly internal.  Does Wisdom know about this?  What is it?  If you say so.  Unnoticeably.  We could just do this the old- fashioned way.  Damn. Fifty men might not be enough.  He's crossed over into Maxwell Gorge.  He's heading this way. Cavanaugh! We've got a fox hunt going in Maxwell Gorge, right beneath the stakeout. Throw everybody into it! We need to overload him!  Why these?      Sometimes looking one step ahead isn't enough.  What's the plan?  Don't be stupid! He knows what you'll do!     I'm issuing infrared to all my men. We should have a fix in a few minutes.  And the dogs are useless.  We're moving her.  You won't believe this. He's got Ferris.  I don't know, but he's on his way to the front door. They want instructions.  Then how are we going to stop him?  You're sure about this?",
        "Kendall": ""
    },
    "imdb_rating": "6.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTg3MjgyNjE1Nl5BMl5BanBnXkFtZTcwNTY1NDU0MQ@@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "Possessing the extraordinary ability to see precisely two minutes into the future, the low-profile Las Vegas stage magician Cris Johnson has managed to keep his unusual skill under the radar. However, Johnson's rare talent has caught the attention of the tough counter-terrorism FBI agent Callie Ferris, who intends to use the illusionist's unfailing charisma to thwart the murderous plans of a ruthless group of Russian terrorists. Now, a stolen nuclear device threatens to level California, as Cris' beautiful girlfriend Liz is being used by the criminals to gain added leverage. Can Cris save both the hostage and the city of Los Angeles with his peculiar gift?—Nick Riganas",
    "name": "Next",
    "genres": [
        "Action",
        "Sci-Fi",
        "Thriller"
    ]
}