{
    "filename": "No-Country-for-Old-Men_script.txt",
    "imdb_id": "tt0477348",
    "imdb_url": "https://www.imdb.com/title/tt0477348",
    "characters": [
        "Wendell",
        "Carson Wells",
        "El Paso Sheriff",
        "Anton Chigurh",
        "Ellis",
        "Carla Jean Moss",
        "Poolside Woman",
        "Strangled Deputy",
        "Llewelyn Moss",
        "Carla Jean's Mother",
        "Sheriff Bell's Secretary",
        "Loretta Bell",
        "Man who hires Wells",
        "Man in Ford",
        "Ed Tom Bell"
    ],
    "dialogues": {
        "Wendell": "Yessir. We should a brought wieners.  It could be.  The old boy shot by the highway?  That's very linear Sheriff.  Yessir. But then there's this other. He nods up the ridge away from the highway.  You sure?  Truck's just yonder. Somebodies pried the inspection plate off the door.  Llewelyn Moss?  You figure him for a dope runner?  Hell's bells, they even shot the dog.  ...Well this is just a deal gone wrong.  What calibers you got there, Sheriff?  Mm.  ...How come do you reckon the coyotes ain't been at 'em?  These boys appear to be managerial.  ...I think we're lookin' at more'n one fracas.  ...Wild West over there...  ...Execution here.  These boys is all swole up. So this was earlier: gettin set to trade. Then, whoa, differences... You know: might not of even been no money.  But you don't believe it.  It's a mess, ain't it Sheriff?  Sheriff's Department!  We goin' in?  What about yours?  Sheriff's Department!  ...Nobody here.  No sir.  ...I believe they've done lit a shuck.  That from the lock?  So when was he here?  Sheriff?  Whoa! Sheriff!  ...Sheriff, we just missed him! We gotta circulate this! On the radio!  Sheriff, that's aggravating.  You think this boy Moss has got any notion of the sorts of sons of bitches that are huntin' him?  He labs from Austin on the man by the highway.  Wasn't no bullet.  Yessir. Wasn't none.  No sir.  Yes sir.  Sir, I don't want to picture that.  The Rangers and DEA are heading out to the desert this morning. You gonna join 'em?  No sir.  Yessir. None of the three had ID on 'em but they're tellin' me all three is Mexicans. Was Mexicans.  Yessir.  Yessir. It was punched out.  You gonna drive out there?  How's that, Sheriff?  Yessir.",
        "Carson": "",
        "Wells": "Yessir, that's correct. I know 'em when I see 'em.  November the 28th, last year.  No sir but you struck me as a man who wouldn't want to waste a chair. I remember dates. Names. Numbers. I saw him on November 28th.  Yessir. I understand that.  Yessir.  Okay.  Well enough.  What do you want to know?  Compared to what? The bubonic plague? He's bad enough that you called me. He's a psychopathic killer but so what? There's plenty of them around.  Okay. We can stop that.  In all honesty I can't say that charm has had a whole lot to do with it.  ...I'm wondering...  Can I get my parking ticket validated?  I'm sorry.  ...Don't worry. I'm not the man that's after you.  You've seen him. And you're not dead.  ...But that won't last.  I don't think that's how I would describe him.  I guess I'd say... that he doesn't have a sense of humor. His name is Chigurh.  Chigurh. Anton Chigurh. You know how he found you?  It's called a transponder.  Not that way.  Took me about three hours.  No. You don't understand.  ...What do you do?  What did you do?  Acetylene? Mig? Tig?  Cast iron?  I don't mean braze.  Pot metal?  Were you in Nam?  So was I.  Look. You need to give me the money. I've got no other reason to protect you.  How do you know he's not on his way to Odessa?  To kill your wife.  He isn't. You're not cut out for this. You're just a guy that happened to find those vehicles.  ...You didn't take the product, did you?  The heroin. You don't have it.  No. You don't.  ...I'm across the river. At the Hotel Eagle. Carson Wells. Call me when you've had enough. I can even let you keep a little of the money.  No no. No. You don't understand. You can't make a deal with him. Even if you gave him the money he'd still kill you. He's a peculiar man. You could even say that he has principles. Principles that transcend money or drugs or anything like that. He's not like you. He's not even like me.  We don't have to do this. I'm a daytrader. I could just go home.  I know where the money is.  I need dark. To get it. I know where it is.  What's that.  And where is that.  You don't know to a certainty. Twenty minutes it could be here.  You go to hell.  Do you have any idea how goddamn crazy you are?  I mean the nature of you.  ...You can have the money. Anton.",
        "Anton": "",
        "Chigurh": "Step out of the car please, sir.  I need you to step out of the car, sir.  Would you hold still please, sir.  How much?  This. And the gas.  What way would that be?  What business is it of yours where I'm from, friendo?  Didn't mean nothin'.  I guess that passes for manners in your cracker view of things.  I don't know. Will there?  With what?  Is that what you're asking me? Is there something wrong with anything?  You already asked me that.  See about closing.  What time do you close?  Now is not a time. What time do you close.  You don't know what you're talking about, do you?  I said you don't know what you're talking about.  ...What time do you go to bed.  You're a bit deaf, aren't you? I said what time do you go to bed.  I could come back then.  You said that.  You live in that house behind the store?  You've lived here all your life?  You married into it.  You married into it.  I don't have some way to put it. That's the way it is.  ...What's the most you've ever lost on a coin toss?  The most. You ever lost. On a coin toss.  Call it.  Yes.  Just call it.  You need to call it. I can't call it for you. It wouldn't be fair. It wouldn't even be right.  Yes you did. You been putting it up your whole life. You just didn't know it. You know what date is on this coin?  Nineteen fifty-eight. It's been traveling twenty-two years to get here. And now it's here. And it's either heads or tails, and you have to say. Call it.  Everything.  You stand to win everything. Call it.  Well done.  ...Don't put it in your pocket.  Don't put it in your pocket. It's your lucky quarter.  Anywhere not in your pocket. Or it'll get mixed in with the others and become just a coin. Which it is.  This his truck?  Screwgie.  ...Who slashed his tires?  Thank you.  ...Where's the transponder?  Hold this please.  ...You getting anything on this?  All right...  I'm looking for Llewelyn Moss.  Yes I did.  Where does he work?  Where does he work?  Where does he work?  Is Llewelyn there?  You expect him?     Driving slowly down the street with frequent glances down at the receiver on the seat next to him. The receiver lights ups and bleeps one time. Chigurh slows and looks around at the buildings that line the two-lane highway.  The receiver is bleeping slowly as the car creeps along. Up at a distant intersection is Charlie Goodnight's Del Rio Motel.  He is slowly driving the parking lot, the receiver now in his lap. The beeping frequency peaks and then starts to fall off. Chigurh puts the truck in reverse and eases back to the peak. His point-of-view: window with parted curtains.     He walks over to the bathroom. He turns on its light, looks. He leaves the door open. He goes to a closet, opens it, looks. He goes to the door of the room but doesn't open it. He stands with his back against it and looks at the room. The bathroom door. The closet door. Chigurh goes to the bed and sits to take off his boots.  From a bag he withdraws a twelve-gauge automatic shotgun fitted with a silencer big around as a beer can. He checks the loads. He picks up the regularly beeping receiver, turns it off, and slips it into his pocket. He hoists the air tank.  He stands at the door of Moss's first room. He eases an ear against it. He steps back. He punches out the lock cylinder with the airgun and kicks in the door, raising the shotgun. A Mexican in a guyabera reclines on one of the two double beds. He is scrabbling for a machine pistol on the nightstand. Chigurh fires three times quickly. The damped blasts have the low resonance of chugs into a bottle.  Also frozen, back against the wall outside the room, to one side of the open door. After a beat he steps back into the open doorway leveling the gun. Inside the room: no movement. Much of the man on the bed is spattered against the chewed-up headboard. The bathroom door is ajar, its light on. A long beat. Movement in the wedge of light. Immediately, chugs from the shotgun chew up bathroom door and nearby wallboard. A cry from inside. A brief chatter of machine pistol.  Gun leveled, at the open door. Again, no movement. He advances into the room, gun pointing at the bathroom door. As he advances he swings the gun briefly over at the closet door and fires. The splintered-in door reveals no occupant. Chigurh angles around the double bed to get a view of that wedge of bathroom floor visible through its door. Blood is pooling out from the right. Chigurh fires at the baseboard to the right of the door.  He uses the shotgun barrel to push open what's left of the bathroom door. The mirror over the facing sink gives a view of most of the hidden side of the bedroom/ bathroom party wall. Partial view of a man pressed against the wall, standing in the tub in the corner. From his posture and the one visible hand he seems unarmed. Chigurh enters the bathroom. The cornered man is unhurt but terrified. He holds up his hands.  How'd you find it?  Hello Carson. Let's go to your room.  Why would I let you do that?  If you knew, you would have it with you.  I know something better.  I know where it's going to be.  It will be brought to me and placed at my feet.  I do know to a certainty. And you know what's going to happen now. You should admit your situation. There would be more dignity in it.  Let me ask you something. If the rule you followed brought you to this, of what use was the rule?  You mean the nature of this conversation?  Yes?  Not in the sense that you mean.  ...You need to come see me.  You know who it is.  ...You need to talk to me.  I think that you do. Do you know where I'm going?  Do you know where I'm going?  ...I know where you are.  You're in the hospital across the river. But that's not where I'm going. Do you know where I'm going?  All right.  It doesn't make any difference where she is.  You know how this is going to turn out, don't you?  Yes, I do. I think you do too. So this is what I'll offer. You bring me the money and I'll let her go. Otherwise she's accountable. The same as you. That's the best deal you're going to get. I won't tell you you can save yourself because you can't.  Who are you?  Yes.  He gave Acosta's people a receiver.  That's foolish. You pick the one right tool.  ...For instance. I used birshot. So as not to blow the window.  That depends. Do you see me?  A driving point-of-view approaching Chigurh, who leans against his Ramcharger, its hood up, stopped on the shoulder on the opposite side of the road. Reverse shows a man in an El Camino. Chickens in stacked cages squawk and flutter in the bed. The man slows and rolls his window down to lean out.  You from around here?  What airport would you use.  Airport.  I don't know.  Can you get those chicken crates out of the bed.  No.  No.  I wouldn't worry about it.  No. But I gave my word.  To your husband.  Your husband had the opportunity to remove you from harm's way. Instead, he used you to try to save himself.  I don't say anything. Except it was foreseen.  Yes. Things fall into place.  I'm all right. Let me just sit here a minute.  All right.  What will you take for that shirt?  Any damn shirt. I need something to wrap around my head and I need a sling for this arm.  Tie this for me.  ...Just tie it.  Take it. Take it and you didn't see me. I was already gone.",
        "Ellis": "Min back!  Who else'd be in your truck.  How's that?  What give you that idea. I seen one of the cats heard it.  I deduced it. Once you walked in.  Cats? Several. Wal. Depends what you mean by got. Some are half-wild, and some are just outlaws.  You lookin' at it. I got to say you look older.  Got a letter from your wife. She writes pretty regular, tells me the family news.  She just told me you was quittin'. Sit down.  'Predate it.  I generally make a fresh pot ever week even if there's some left over.  In Angola. Yeah.  I don't know. Nothin'. Wouldn't be no point to it.  All the time you spend tryin' to get back what's been took from you there's more goin' out the door. After a while you just try and get a tourniquet on it.  ...Your granddad never asked me to sign on as deputy. I done that my own self. Loretta says you're quittin'.  How come're you doin that?  You don't know what he thinks.  I sent Uncle Mac's badge and his old thumbbuster to the Rangers. For their museum there. Your daddy ever tell you how Uncle Mac come to his reward?  ...Shot down on his own porch there in Hudspeth County. There was seven or eight of 'em come to the house. Wantin' this and wantin' that. Mac went back in and got his shotgun but they was way ahead of him. Shot him down in his own doorway. Aunt Ella run out and tried to stop the bleedin'. Him tryin to get hold of the shotgun again. They just set there on their horses watchin' him die. Finally one of 'em says somethin' in Injun and they all turned and left out. Well Mac knew the score even if Aunt Ella didn't. Shot through the left lung and that was that. As they say.  Nineteen zero and nine.  Believe it was that night. She buried him the next mornin'. Diggin' in that hard caliche.  ...What you got ain't nothin' new. This country is hard on people. Hard and crazy. Got the devil in it yet folks never seem to hold it to account.  You're discouraged.  You can't stop what's comin. Ain't all waitin' on you.  ...That's vanity.",
        "Poolside": "",
        "Woman": "Yessir?  Did you go up to his trailer?  Well I'd say he's at work. Do you want to leave a message?  I can't say.  Sir I ain't at liberty to give out no information about our residents.  Did you not hear me? We can't give out no information.  You tell me the option.  The option.  ...You pick the option with the applicable rate.  Hello?  Llewelyn?! No he ain't.  Now why would I expect him? Who is this?  You want to change rooms?  Another additional.  Yeah we had a sorta one.  You can have the one next to yours if you want. One twenty. It ain't took.  That's got two double beds.  Hey Mr. Sporting Goods.  You a sport?  I got beers in my room.  Oh. That's who you keep lookin' out the window for?  What else then?  Yeah but no one ever sees that. I like a man that'll tell you he's married.  I do like you.  ...Beer. That's what's comin', I'll bring the ice chest out here. You can stay married.  Beer leads to more beer.",
        "Strangled": "",
        "Deputy": "Seated in the sheriff's office, on the phone. The prisoner stands in the background. Focus is too soft for us to see his features but his posture shows that his arms are still behind his back.  Yessir, just walked in the door. Sheriff he had some sort of a thing on him like one of them oxygen tanks for emphysema or somethin'. And a hose from it run down his sleeve...  ...Well you got me, sir. You can see it when you get in...  ...Yessir I got it covered.",
        "Llewelyn": "",
        "Moss": "Hold still.  Shit.  Ain't got no water.  I told you I ain't got no agua. You speak English?  ...Where's the last guy?  Ultimo hombre. Last man standing, must've been one. Where'd he go?         If you stopped... to watch your backtrack... you're gonna shoot my dumb ass.  ...But. If you stopped... you stopped in shade.  It's full a money.  At the gettin' place.  No. I found it.  What? Quit hollerin'.  You don't need to know everthing, Carla Jean.  You keep running that mouth I'm gonna take you in the back and screw you.  Just keep it up.  That'll work.  All right.  Yeah.  Goin' out.  Somethin' I forgot to do. I'll be back.  I'm fixin' to do somethin' dumbern hell but I'm goin' anyways.  ...If I don't come back tell Mother I love her.  Well then I'll tell her myself.  Hello?...  Goddamnit.     Odessa.  Not we, you. Stay with your mother.  Right now it's midnight Sunday. When the courthouse opens nine hours from now someone's gonna be callin in the vehicle number off the inspection plate on my truck. And around nine- thirty they'll show up here.  Baby, at what point would you quit botherin' to look for your two million dollars?  Try standin' in the door and hollerin: Mama I'm home.  C'mon, pack your things. Anything you leave you ain't gonna see again.  Things happened. I can't take 'em back.     I'm gonna borrow a car. From Eldon.  Don't wanna register it. I'll call you in a couple days.  Yes I do.  Well I got a good one. So they ought to even out. Quit worrying about everthing.  Uh-huh.  You should be used to that.  Not any more, Carla Jean. You're retired.  Yes ma'am?  I shall return.            Take me to a motel.  Just someplace cheap.  The what?  I'm just one person. Don't matter the size of the bed.  I need the Larry Mahan's in black, size 11.  You sell socks?  White is all I wear. You got a bathroom?  Don't stop. Just ride me up past the rooms.  Just drive me around. I want to see if someone's here.  ...Keep going.  ...Keep going. Don't stop.  It's all right.  I want you to take me to another motel.  You're already in a jackpot. I'm trying to get you out of it. Now take me to a motel.  Uh-huh. Double ought.  You have camping supplies?  Uh-huh.  Somethin' like that.  Never mind. I want a tent.  The kind with the most poles.  Let me have that one. Where's the nearest hardware store?     Could I get another room.  No, I want to keep my room, and get another one.  Uh-huh.You got a map of the rooms?  What about one forty-two.  No, one forty-two.  Moss pulls three wire hangers off the closet rack. He takes them to the bureau and picks up a sidecutter.  Moss snips the last of the wire hangers' hooks off with the sidecutter. He wraps the three hooks with duct tape to make a sturdier one. He wraps more tape to attach this hook to the end of the three-link pole.  He is standing on the chair below the airduct, stooping to pick up the jury-rigged pole leaning nearby. He straightens and feeds the length of the pole into the duct, using the joints to angle it in.  Peering along the airduct, both hands up next to one ear awkwardly maneuvering the pole. He lays the far, hooked end over the protruding corner of the document case. He pulls. The pole slides off the case.       Along the air vent. The machine-pistol chatter crosses the cut. We hear bullets snap through metal. The sound brings on indirect light as holes are punched in the duct somewhere around the bend. Moss holds still as the galvanized metal faintly thunders. The flashlight resting on it wobbles.       Doin' what. The old man gazes at the road.  One room, one night.  You on all night?  For you. I ain't asking you to do anything illegal.  There's somebody lookin' for me. Not police. Just call me if anyone else checks in tonight.  There just ain't no way.  I'm not going to hurt you. I need you to --  I'll give you five hundred bucks for your shirt and your coat.  Yeah.  It's right here. Give me the coat.  Gimme the clothes.  ...And let me have your beer.  Doctor.  ...Medico. Por favor.  I know, I've seen him. Sort of.  What is he supposed to be, the ultimate bad-ass?  How would you describe him?  Sugar?  I know how he found me.  I know what it is. He won't find me again.  Not any way.  I been immobile.  I'm retired.  I'm a welder.  Any of it. If it can be welded I can weld it.  Yes.  I didn't say braze.  What did I say?  Yeah. I was in Nam.  So what does that make me? Your buddy?  Too late. I spent it -- about a million and a half on whores and whiskey and the rest of it I just sort of blew it in.  Why would he go to Odessa?  Maybe he should be worried. About me.  What product.  No I don't have it.  If I was cuttin' deals, why wouldn't I go deal with this guy Chigurh?  He don't talk as much as you, I give him points for that.  ...Hello?  Is Carson Wells there.  Who is this.  I don't need to talk to you.  Why would I care where you're going.  Yeah? Where am I?  Yeah. I know where you're going.  You know she won't be there.  So what're you goin' up there for.  No. Do you?  Yeah I'm goin' to bring you somethin' all right. I've decided to make you a special project of mine. You ain't goin' to have to look for me at all.  I don't know. American citizens.  You do, I reckon.  I don't know.  No sir.  I got an overcoat on.  No sir.  Yes sir.  No sir. I'm a veteran.  Yes sir. Two tours.  Twelfth Infantry Batallion. August seventh nineteen and sixty-six to July second nineteen and sixty-eight.  Good. I need everything else.  You get a lot of people come in here with no clothes on?  Yes she does. Put her on.  I don't care what time it is. Don't you hang up this phone.  Hey.  You know what's goin' on?  What did you tell him?  What makes you say that?  Meet me at the Heart of Texas motel in El Paso. I'm gonna give you the money and put you on a plane.  No. This works better. With you gone and I don't have the money, he can't touch me. But I can sure touch him. After I find him I'll come and join you.  She'll be all right.  I don't think anybody'll bother her.  Hey yourself.  That's me.  Waitin' for my wife.  Half.  Lookin' for what's comin'.  Then you'll like me.  Ma'am I know what beer leads to.",
        "Loretta": "I thought it was a car afire.  When is the county gonna start payin' a rental on my horse.      ...Be careful.  Don't get hurt.  Don't hurt no one.  Okay.  I can't plan your day.  Lord no. I'm not retired.  Better not.  ...How'd you sleep?  Well you got time for 'em now. Anything interesting?  Ed Tom, I'll be polite.",
        "Bell": "It is a car afire. But Wendell said there was something back country too.  Hyah!  ...I love you more'n more, ever day.  I always am.  I never do.  Well. If you say so.  You wouldn't think a car would burn like that.  Does that look to you like about a '77 Ford, Wendell?  I'd say it is. Not a doubt in my mind.  Yessir, his vehicle. Man killed Lamar's deputy, took his car, killed someone on the highway, swapped for his car, and now here it is and he's swapped again for god knows what.  Well. Old age flattens a man.  Uh-huh.  ...You ride Winston.  Oh, I'm more than sure. Anything happens to Loretta's horse I can tell you right now you don't wanna be the party that was aboard.  It's the same tire tread comin back as goin'. Made about the same time. You can see the sipes real clear.  I know this truck. Belongs to a feller named Moss.  That's the boy.  I don't know but I kindly doubt it.  Yes, appears to have been a glitch or two.  Nine millimeter. Couple of .45 ACP's.  ...Somebody unloaded on this thing with a shotgun.  I don't know...  ...Supposedly they won't eat a Mexican.  That Mexican brown dope.  That's possible.  No. Probably I don't.  If it ain't it'll do til a mess gets here.  Look at the lock.  Gun out and up.  I'm hidin' behind you.  No reason not to stay safe.  Believe you're right.  Probably must be.  I don't know. Oh.  ...Now that's aggravating.  Still sweating.  Well, okay...  ...What do we circulate?  ...Lookin' for a man who has recently drunk milk?  I'm ahead of you there.  I don't know. He ought to...  ...He seen the same things I seen and it made an impression on me.  What was the bullet?  Wasn't no bullet?  Well, Wendell, with all due respect, that don't make a whole lot of sense.  You said entrance wound in the forehead, no exit wound.  Are you telling me he shot this boy in the head and then went fishin' around in there with a pocket knife?  Well I don't either!  Yes Noreen you better had. Thank you.  I don't know. Any new bodies accumulated out there?  Well then I guess I can skip it. Heavens to Betsy, Wendell, you already put me off my breakfast.  Anything on those vehicles yet?  No. Lord no.  ...This month's checks.  I'm goin' to try and keep from it as much as I can.  Well that's cordial of him. I guess he can go wherever he wants. He's a certified agent of the United States Government.  ...Could I get you to call Loretta and tell her I've gone to Odessa? goin' to visit with Carla Jean Moss.  I'll call Loretta when I get there. I'd call now but she'll want me to come home and I just might.  Yes I do. You don't want to lie without what it's absolutely necessary.  ...What is it that Torbert says? About truth and justice?  I think I'm goin' to commence dedicatin' myself twice daily. It may come to three times before it's over...  ...What the hell?  Have you looked at your load lately?  That's a damned outrage.  How many did you leave with?  Couldn't you all of took a van out there?  You get your ass out of here.  Carla Jean, I thank you for comin'.  You ain't heard from him?  Nothin'?  Would you tell me if you had?  It's not me he's in trouble with.  Some pretty bad people.  These people will kill him, Carla Jean. They won't quit.  I wish I could say that was in his favor. But I have to say I don't think it is.  You know Charlie Walser? Has the place east of Sanderson?  ...Well you know how they used to slaughter beeves, hit 'em with a maul right here to stun 'em...  ...and then truss 'em up and slit their throats? Well here Charlie has one trussed up and all set to drain him and the beef comes to. It starts thrashing around, six hundred pounds of very pissed-off livestock if you'll pardon my... Charlie grabs his gun there to shoot the damn thing in the head but what with the swingin' and twistin' it's a glance-shot and ricochets around and comes back hits Charlie in the shoulder. You go see Charlie, he still can't reach up with his right hand for his hat... Point bein', even in the contest between man and cow the issue is not certain.  ...When Llewelyn calls, just tell him I can make him safe.  ...Course, they slaughter beeves different now. Use a air gun. Shoots out a rod, about this far into the brain...  ...Sucks back in. Animal never knows what hit him.  I don't know. My mind wanders.  The motel in Del Rio?  There's a question. Whether they stopped bein'. And when.  Now, Wendell, did you inquire about the cylinder lock?  Okay.  No, that's the only thing I would've looked for. And it sounds like these boys died of natural causes.  Natural to the line of work they was in.  My lord, Wendell, it's just all-out war. I don't know any other word for it. Who are these folks? I don't know...  ...Here last week they found this couple out in California they would rent out rooms to old people and then kill em and bury em in the yard and cash their social security checks. They'd torture em first, I don't know why. Maybe their television set was broke. And this went on until, and here I quote...  ...\"Neighbors were alerted when a man ran from the premises wearing only a dog collar.\" You can't make up such a thing as that. I dare you to even try.  ...But that's what it took, you'll notice. Get someone's attention. Diggin graves in the back yard didn't bring any.  ...That's all right. I laugh myself sometimes.  ...There ain't a whole lot else you can do.  Carla Jean, how are you.  Who's Charlie Walser. Oh! Well, I, uh... True story? I couldn't swear to ever detail but... it's certainly true that it is a story.  We intercut Sheriff Bell in his office.  Yes ma'am?  Yes ma'am, I do.  Carla Jean, I will not harm your man. And he needs help, whether he knows it or not.     Driving. As he drives he refers to one side of the road, a commercial strip, looking for something. We hear the fading roar of a large airplane. The tock tock of distant gunfire brings his look around. A beat. Another tock. The chatter of machine-gun fire. Another single shot. Sheriff Bell stamps the accelerator and hits his siren.  Call police.  ...Call your local law enforcement. I'm not on their radio.  Carla Jean...  I don't know who she is.  No ID in her room?  No money in his room there?  I suppose. Though they was leavin' in a hurry.  Yes.  Signs and wonders. But I think once you stop hearin' sir and madam the rest is soon to follow.  Not the one thing. I used to think I could at least some way put things right. I don't feel that way no more.  ...I don't know what I do feel like.  Yessir. It may be that. In a nutshell.  Uh-huh.  I'm not sure he's a lunatic.  I don't know. Sometimes I think he's pretty much a ghost.  Oh yes.  Yes, he has some hard bark on him.  Hard to believe.  How'd you know I was here.  You heard it?  You heard my -- you havin' fun with me?  But -- how'd you know it was mine?  How many a those things you got now?  How you been, Ellis?  I am older.  Didn't know there was any.  Want a cup?  How fresh is this coffee?  That man that shot you died in prison.  What would you a done if he'd been released?  I'm kindly surprised to hear you say that.  Yes, you've circled round.  I don't know. I feel overmatched.  ...I always thought when I got older God would sort of come into my life in some way. He didn't. I don't blame him. If I was him I'd have the same opinion about me that he does.  Yes I do.  When did he die?  No, I mean was it right away or in the night or when was it.  Most don't.  I'm... discouraged.     Maybe I'll go ridin.  What do you think.  I mean, would you care to join me.  Maybe I'll help here then.  I don't know. Had dreams.  Well they always is to the party concerned.  Okay. Two of 'em. Both had my father. It's peculiar. I'm older now'n he ever was by twenty years. So in a sense he's the younger man. Anyway, first one I don't remember so well but it was about meetin' him in town somewheres and he give me some money and I think I lost it. The second one, it was like we was both back in older times and I was on horseback goin' through the mountains of a night."
    },
    "imdb_rating": "8.2",
    "description": "In rural Texas, welder and hunter Llewelyn Moss (Josh Brolin) discovers the remains of several drug runners who have all killed each other in an exchange gone violently wrong. Rather than report the discovery to the police, Moss decides to simply take the two million dollars present for himself. This puts the psychopathic killer, Anton Chigurh (Javier Bardem), on his trail as he dispassionately murders nearly every rival, bystander and even employer in his pursuit of his quarry and the money. As Moss desperately attempts to keep one step ahead, the blood from this hunt begins to flow behind him with relentlessly growing intensity as Chigurh closes in. Meanwhile, the laconic Sheriff Ed Tom Bell (Tommy Lee Jones) blithely oversees the investigation even as he struggles to face the sheer enormity of the crimes he is attempting to thwart.—Kenneth Chisholm (kchishol@rogers.com)",
    "name": "No Country for Old Men",
    "genres": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjA5Njk3MjM4OV5BMl5BanBnXkFtZTcwMTc5MTE1MQ@@._V1_QL75_UY281_CR1,0,190,281_.jpg"
}