{
    "filename": "No-Strings-Attached_script.txt",
    "imdb_id": "tt1411238",
    "imdb_url": "https://www.imdb.com/title/tt1411238",
    "characters": [
        "Megan",
        "Sandra Kurtzman",
        "Patrice",
        "Adam",
        "Emma",
        "Lucy",
        "Sam",
        "Guy",
        "Dr. Metzner",
        "Vanessa",
        "Wallace (as Chris 'Ludacris' Bridges)",
        "Shira",
        "Katie Kurtzman",
        "Alvin",
        "Eli"
    ],
    "dialogues": {
        "Megan": "",
        "Sandra": "I should've got him to move this pool out of here before-he went back to the hospital. Sandra hands-the bottle to Emma, who takes a swig.  Emma, I should have called you, I. thought he was in remission, and then he. just went so quick-     I loved hint. Why?  The Tigers are gonna come back.  You don't believe in anything hopeless, Emma?  Yes. I think I will go back in. -You know what I'm gonna do? I'm gonna get-so drunk I can't walk and then I.'m gonna watch \"Bambi\" and cry for a couple hours.     He just left, he didn't even say good-bye.  Oh I don't know.  I'ma not!     Oh., he 'was 'a good ' hunter. ; He was really good at... hunting.  I'm in Hollywood! Emma smiles and looks over her- mom's shoulder to see a man. coming towards them, big, built-r vacant expression.,  That's Tuck.   \"Hollywood baby!\"     It - doesn't matter, wecan still  See? I love Harrison. Ford.   No, of course not-   Oh! Do they live-together? 102.  I don't think this is fun as Universal\" Studios.- - '  Hey, let-'.s get. h.im to draw. your picture,  Come on. How much?  Is that a discount?-  What do you.mean? I like him. He takes care of me.  I canrt, Emma, it's not who Iam. I did a lot of drugs and I went to a lot,. of protests so you could 'have - everything the boys have. Good for, YOU. But this is my. life, and this is how it turned out. I never thought I'd be alone' like this,, I thought your father was going to be there.  Don't say that3  I wanted to be there for your father. and I was. I wanted to raise you and I\"did. Don't tell me that wasn't important. Now,.I want to be loved. That's what I want-.  Why don't you.take some tine 'out of your schedule-to love someone and :then come talk to me- Tuck comes up.  Yes. I do. Sandra takes Tuck's arm. 104.  We're, going back to\"the hotel. Why don't you call-me when you want to apologize?  I thought you might call. 110.  No, I understand, you're busy. I'm so proud of you, it's such.a great big hospital-.  Oh! I forgot to tell you! We were, getting a bagelaind he was getting. a bagel too. And that,' s the. whole story.  Why do you keep looking atyour I .phone? Dr. Metzner walks up.  Oh. Yes, I am. Hello.  'Just, till, tomorrow:   Who's he? Emma's.looking at her phone again,-distracted.  Okay Tuck! Emma-  Wait. I wanted to say something-  Listen to me. I could never stand to see you in pain- you're xiiy child. And I think you -knew thatr and-I think you got good at- -being -strong for me. But, Emma, I'm. telling; you: Be hurt. I can take it. The world can take it. Don't. be so strong, you miss the fun.-  We'll make it, Tuck. Sandra rushes into the car.-Ea grabs her  Are you okay? Honey? We just-got home.  Yeah. It does. They 'don't-say anything- Sandra sits on the front steps of the house and just listens on the other end as. Emma cries.",
        "Kurtzman": "",
        "Patrice": "",
        "Adam": "What about \"Comrades-in-Fuck\"?.  What if we say we're in the Axis of Fuck? we formed a Fuck Alliance. We're neighbors 'on.. Fuck Street.  Who says \"buddies\"?  Hey. -  Do you want to, freak?  You freak, good.  - 3.  Urn. She doesn't want a -scrub; Because he's hanging out of his. best friend's ride, trying to -holler at her. Katie, in another part of the dance floor, is in the middle of a big freak-sandwich.     I've enjoyed camp. There's all kinds of fun activities. For example, I learned how to-archer.  You're funny. It's weird. 4. 'FR+fAï¿½1A My life's pretty.fucked ug'.  My parents are gettinga divorce..' That's why I had-to go--to carp. SO. The couple making out next to them rolls over.really close. ..Emma pushes them back over.  Yeah. it sucks it. It sucks it. all 'ni-ight.  I just want to find a girl Who's really nice. And she likes to eat hummus. Suddenly, another CAPPER  comes up.'  I like frenching with you.  Pretty much.'  Can I finger you?  Okay.   iï¿½lhat?  Okay. I want to get'y\"ou.wasted\" tonight.  And that'.s totally -fine with me.  - 1 don  t know.,She\"s from :Canada. They don't have guns.. Their computers are run 'by tiny mice. 7.-  Why? That's not even hot.  You think it's hot to just sit there with your penis.on her face?  What do you mean?  Oh yeah. That nipple is definitely more gay.= You can tell by the way it wants to get legally married to' the other nipple.  Whoa . I know that, girl.  What?  Hi, T-  Emma. Whoa. Yeah. Whoa. I was totally in love with you.  No. Hi. ,You:'re here. This is crazy. Do you go here?  Wow. So grew up-to-be a lot smarter than nip. 9.  My neck gets sore. when I-eat string, cheese. Sometimes.. so what are you' doing Here? -At a party of Frat.  I'll rufee.you. I was gonna save it for a Freshman but whatever- I'll take you out to.the alley,. I'll light some candles- Some girls near by give Adam a dirty look and walk away.  NO. Yes. Over there. Vanessa. Is her name. ANGLE ON- Vanessa, by the beer, talking to a bunch of other girls. She sees Adam and makes a kissy-mouth.  What?  She''s not fat.  What? We. sleep together. All night. 10.  Whoa.     Oh yeah. I guess everyone hapsex at - MIT.  What's'up with your.face?  It's like, beautiful.  My girlfriend's not fat-  She is great- He rips open her shirt.  And I feel really'bad about this. He puts starts kissing her chest. Then starts coughing.  Oh. I got too much boob izi .my mouth.  You didn't have boobs at Camp. Weehawken. Your boobs were still little stars in the sky. I had such a.big crush-on.you, Jesus. Emma starts taking off his pants.  Hey. Hey. Actually. I can't do. this. 12.  No. I just-I can't cheat on my girlfriend..  Because then I turn into.my dad. And then.my worst fears have been realized. And then that sucks. Where do. you go from there? -Once your worst :fears have been realized. You become Bob. Sagat.. I want to. A lot. 'A lot,-alot. But I can't. , Is that okay?  Really? '  Yeah.-That's him.  So do you do this stuff all the . time? It.'s okay if you 'do, I might. call you a ho but it's okay- 13..  What?  You make a c ompelling  argument .  What?  Um, I think I... . Yeah. Ii11 go with you. ' What is it?  What the fuck, what the fuck, what the fuck?'  You said \"some stupid thing.\" I thought you were getting your hair cut.  You were burying your father.  No. .\"11.m just-  I'm.her.baby--daddy. Adam. puts his hand on her stomach. Emma looks up at him, getting the joke. Glad to be'saved.  I shot one past the goalie. So. , Score!'  But the truth is, I don't even know- if it's mine.  You should try the Chex Mix.It',s. theBold Party Flavor.     No- I' get it.  is it weird if during most of-your father's funeral,, i. was thinking about' you naked? Ewa smiles and starts the car.  So should 1.1Â±k6 call you or- Adam, you're wonderful, I hope I never see you 'again. 19.  Yes. I may.  Oh wow, thank ..you. Yeah. ,That means a lot.. Let's-be best friends forever. 20..  Dad? is  Wow, I,. should come over and wash my clothes-on your wasbboarcl. abs .  Really? You want me to punch you in the stomach so'you can-show me how ripped you' are but it's going to fucking.hurt my hand?  Yeah, sounds great. Adam punches him in the stomach.    Oh,she's clinically depressed. But it looks like she might start' knitting.So. Alvin lights up the-joint.  In my mind?  Since Vanessa. 8 months. Alvin offers him the joint.. Adam takes it:  But I've been masturbating like my hands-axe made of Vasoline and someone just took my paints. So. Things'are looking up. It's.good to- see you Dad. Adam sucks on the joint. 22.  owl-owl OW! OW!  Four years.  8 months.     Yeah I'm fine.  I.'m totally. ,fine. '24.  I threw your toothbrush in the toilet.  8 months.  I'm going to get wasted..:  And then I'm going to puke in that trash--can. outside.  And then I'm going. to call every girl in my phone and tell them,.all. the things-I remember about Vanessa.     ' You smell so good, Gretchen. I'm gonna make you a sandwich. Of my body. Okay. Put your. mom on the phone. Scottie tries -to take away his phone. Adam fights'back.     . 1 came to.Scotland to raise cropsi and God willing, a family- out of nowhere., Scottie jumps on Adam, he's -taken down-1  I don!t'know who you are. Are you pretty? It doesn'tmatter if you're pretty. You can be ugly, I'm still gonna call you tomorrow,' don't worry about it. I'm gonna take you out.. I'm gonna pay for everything- Emma comes out of the bathroom in a'towel and shoes,.drying her hair. -  You don't live . in LA'.  You're not wearing clothes.  Did you take advantage of'me? -I hope you took advantage.of me. Will you take advantage of me? Emma just looks at him, it's not clear what she's thinking.  Oh god, I'm sorry, I'm, like, in my underwear.and I'm hitting on you, that's so gross, who am I? I don't even know you that well-.1-mean I went to your dad's funeral, but other than that- Emma's lips are on his.  My dad's dating my.ex-girlfriend-  I did? Did I tell you in a funny way? Was X kind 'of charming and funny?    Condoms, condoms, condoms-  It's like an Easter Egg hunt. But ' we're ,not celebrating Christ !  If some guy had a dick,like this, you would be like: Why does your dick have rabbit ears?,  00, \"Snow Falling on Cedars \"- what did you think of that?  Those are for, me! You don't get to wear one of those!  Wow.  It feels like your vagina- is shaking hands with my, penis, 29.  Yes. Yes -it is. JUMP CUB-. In a .different position.  .What's my sex face?  Flip it?  Um. Whee! Ow. Do you want to take your shoes off?  The shoes aren't gonna help.  I'm gonna cum.  Fine. But you have about-45 seconds to get your shit together.  Fine.  No.  it was a .mistake. . Should we-cuddle or something?  I just like to-cuddle otherwise I feel cheap. Emma starts getting dressed- all business.  Like a peanut - allergy. -  What's an \"emotional peanut\"? Ha, ha.  Oh my god, is that going, to. happen?  And I of you. To you.  I hate breakfast. And lying. And also war.  Uh- don't sleep with-my dad.  Stealing? I dated.'a guy who pathologically stole stuff out of my apartment and then' brought it .back the ' nest d ay and apologized.  Okay,'so the bar is really-high here.  II don't care about your hopes and -dreams.  I'm scared of flowers..  Don't do that passive aggressive shit. Like \"Oh I'm:-not upset.â 33.  Don't ask me what I think about your body.  I think-it's great.  Don't ever saypee-pee again. Don't talk' about how hard it is to be a woman. Because it's'not.  Yeah. Don't say my penis is \"cute\". Even if- my penis is ' dressed up like a Care Bear and it's giving.you a care--stare .  Yeah, that makes sense.  Well it won't be me.   So you want to come in? (THE FOLLOWING SECTION- Short scenes maybe with music underneath, kind of like a montage.'.. I don't know  Adam and Emma are happily going at :it.  Sex is so great.  You're blowing me! That's great! Emma looks up at him.  Really? I should call my mom.'  What else does,it.taste like?  That's fascinating.     You taste like candy canes and      Bye Eli.     Uh-oh, Bra-ears. Bra-ears,.. Emma screams and laughs and runs away from him.     Oh. god, I love you!' j ï¿½ Just kidding!     I've never really done role'-play before. What do I do?  okay. He does something with his hands.     Some mime work.  You don't- think so?  Okay. -Re-do. Um, sans mime. Adani puts his -hands on his hips. 37.     What Doc? Emma climbs on the bed.  What is that?  Yes. I think I will. He does.     Yeah.  I hate you. 38.  Seriously. You're a terrible person.  Coffee. I get coffee for 'a I0 'year old girl. Cool.  I want to do stand-up.  I'm too scared.  I can't-feel my legs. JUMP CUT- Adam-doing some stretches:  My cholesterol levels have really' been going down.  Am I just a body to yoa? 39.  You have the worst- taste in music I have ever seen. Seriously.- You're like a teenage girl. You're like a tween.  I don't know if you know, this, but one day, I'm gonna beta big Star. He starts. to dance around.4nd mime a mike. -                   Did we invent-being \"fuckbuddies\"?  Who invented it?  Like.one caveman texted the other, caveman: \"Where are you?\". And . she- was like: \"In the cave. Smiley face.\"  Probablq;doggy-style.  That's beautiful.  Hey. Emma makes a little sleep sound.     Yeah. I figured that out.:  Noi You look. Fantastic. Maybe it's just the way you're eating Advil like it's a bag of M&amp;Ms.  Baby, you're a'-woman, and:I think that's a beautiful thing.' (putting his hand on her  Shedding-the ew of the-e', ew. But - hurry up and finish soonl     .You just left.   Is this against the rules'? Is'there. breakfast anywhere on you? Are you a breakfast smuggler?.-  (into the mike,. too                 My wife, she likes to-shop. Oy.  - I tell her: Hey, I wish you would diet as much. as you-shop. .No one laughs. A fat woman looks, rea=lly offended.-.          Hey, I'd like a beer. Some people: actually chuckle. Adam is' surprised, but it feels good. Then a beer comes out of nowhere and hits him in the head.  1-don't know. Because people make jokes about their.wives. -  Because I suck.  No. We don't have.time toï¿½go out, we're too busy having Sex. '  What?  Look at you, you could hasre sex with any girl in this bar, and-look at me- It's like you're taking food out of the hands of a starving child. Shit. Come on Scottie.-  Do you sleep with other guys? I know I'm not allowed, to ask -or  Scottie wants to_ask you Out.  What do you meat? I told. him No.  Why?  Emma, you're killing me--  Awesome, you want his number?     I think I'll goout onsome dates.  Maybe I will.  Maybe I'll have. a lot of sex, with a lot\"of women that aren't you.  And maybe that sex .will continue on and on-until the break Of dawn.  Oh' yeah. Sex on the couch.: Sex on the floor. Sex on' a boat. In a box. With a fox. in a house.' Ona mouse. . I do not-like Green Eggs and Ham. I do not like them. . -Emma.  Oh great.' That's a great reason. What is. it about me  then? Is it because I have hair on my neck?.  Hi. I, deed a., guitar case.  T don't have a guitar.  It needs to fit a: small body. Like a child's body.  Should I just,. like, ask her -out? I don't know how to 'do it. I sort of work with her-  That's a good.idea.  Girls don't sleep with guys who use the verb \"to bitch\".           No f' wait, give me a second, think. about something else: pasta sauce, pasta sauce, old men eating pas.ta  The president of Iran eating. pasta s auce- the president of Iran eating pasta sauce off an old man's body-  So do you always kiss ass?   I like your face.  Yeah. Who wants coffee? - Most of the group raise their hands: And at the edge -of the group, ALVIN STANDS THERE, also with his hand up. -  what are you doing here, bad?  Buddy?  Oh that's nice, but I 'don't really want to eat in a place where you're also eating.  Oh -hey,. Emma. I'an freaking out about my neck-hair.  Do you think it's possible that I unknowingly got bit. by adog and somehow, through a series of genetic mutations, I'm starting.to become. a dog? And now I'm :going to. have dog-powers-. Like smell And the power of bark.  And if I shave it,.:am I zapping my body of some sort of strength? Is it secretly \"strength hair\"? 57.  No, Emma, I .don't need to: go to \"psych,\" I'm just a-normal guy who's looking for answers: about his -neck--hair . . Oh my god, -oh my god, it's killing me,- I'm dying, this is dizziness,- check, this is heart-rate= increase, check-' - '  T know that!  Please give me drugs. Sumaire and Emma-just look at him.  Look. My hand is a hammer.-  made you.a hat.  Put on the hat.    Give me my hat back. Now. -Now.  I'm all over this. I am 200 percent on my game. Am I flying right,now?  Not at all? I'm not airborne? Emma looks very. annoyed.  We're sex friends.  It might be. Yes.  I. love it. Thank you.  INSIDE THE HAG! Wow! Adam takes out a set 'of - expensive looking- sheets.  I -loved you.  You know what the word 'is'? I've been thinking and 'I figured it out. 61.  The word is Twat. Dad, you're a twat.  want to swordfight you.  (imitating her voice,  When'did you try? You don't try. You just take. You take and take    You're too fast for me'. 62..  M'lady. Is't thou chamber:hath -thou.  -Let's get the fuck out of'here. napkin,- he runs back to Enuaa.  Ha; ha. II win. I win.  I. always loved Venice as a kid. Because I thought: Atleast I'm not as crazy as these. people.  Not him. There's a guy coverred'in silver body paint., yelling at'.the top of his lungs, and skating by on :a -skateboard.  who's got' the crazier-family?     Home.  Sometimes. Here. Adam gives the sheets Vanessa gave-him to a.guy'dressed as a cat.  For the kitty litter.  Emma and Adam, looking at each other.     Emma. .  What rule? 64.  That's a bad rule. He kisses her- .it's passionate, a grown:-up, kiss. it takes her off guard. He looks at her, serious,, inches from her face. She's uncomfortable, laughs nervously.  .Wait--     Am I running fast? I can't. tell. She turns around and sees him, laughs..     I can't do this.  Nothing.  I love you.  love you. Be my-girlfriend.  I'll operate your motor vehicle.  Be my girlfriend. ' Be my. girlfriend forever.  S have a date. So.  Yeah.-. I )list asked' her and she said' yes'. - - She must be-drunk or something. ANGLE ON--Hot Assistant holding up a finger to Adam, :'One minute.\" - -  I'm trying- to remember what people do on dates.        -Flipsies?  Do you' want to get on top?  Yeah, cool. That sounds like fun. Adam continues on,. he's not having the greatest time'..     Well. You are really,close to me:        You're not a jerk, you're just- deeply flawed.  No.  I got laid tonight too. And she'.s sleeping on all the-pillows. Why does she need all the pillows? Is her head made of paper?  It's just- It's the first time since Vanessa, not counting you,  What's wrong?  You're jealous.  Your voice gets really high when _ you're- lying. -You sound like a munchkin. -     Oh you know, I've been busy.  Going to gang-bangs. I've been getting. involved in the gang--bang community.  (pretending to, talk to  I'm sorry, I have to go play her pussy like it'sa'harmonica.  Shabbat Shalom. 75..   \"Big pimpin\", spending G's, I be big 'pimpin' on b-l-a-g' s\" .  . Sorry. Those are for.- A. female producer walksby, grabs the tampons.  Oh man,. i can't, I.'m doing so much- crazy sex .stuff, I am. exhausted. Emma, is there a word for when you've . been pimped ' rain?  Yeah?     Mustard or mayo?    It was funny whenyou were Hillary' Clinton and.you _got eaten by. that bear. I didn't know Hillary Clinton could scream like that-  Wow. Yeah. 'You're so talented. 77. Adam's phone rings..     Oh, I'm sorry, can't talk, I'm groping--someone against my car. Joy gives him a funny. look.  Fuck you. Adam hangs up the phone, smiling.  Hey, you want to get out of here?        Oh Joy, this- is my-  I should'have told you.  I'm sorry, Joy. You're sort of a pawn in a larger game.-It's my  This is amazing.     Oh my god, you were crazed, I felt like Flava Flav-     Wow.  I noticed you'didn't.say I had a. donkey cock,     Yes.'i am that guy.  Nothing. Nothing is funnier than a rubber chicken.  Throw it in the shower when someone is showering.  And -they're like:.Aaali, .why are you hitting me with a rubber chicken? They kiss, it's- .tender.  I love it, I love my -chicken. What are we doing? I have to take you out.-I have to go on a date with you.  Like -a.date. Like - I pick you up. We talk about our favorite books and TV shows and I pay for everything and then you reward me with an over- the-jeans cock rub.  Come on, I'll take you to a museum.     So much,-so much it's freaking me out.     You look great.  .(hariding her the flowers  - T don't know, because you're my flower.  I know- I'm good at this. They get into'the car. Adam opens the car 'door-for her.  We're going to the Getty.  Jesus Christ.  On the.way to the Getty. Adam is driving. Emma sits next to him; uncomfortably holding the big bouquet of - flowers. Neil Diamond-'s \"Cracklin\" Rosie\"_is playing.     What did y ou do today?  \"rind us a dream that don't ask no questions-- bah, bah.'bah--\"  So we're gonna hit up Decorative Objects and Vases. and then we're going to check out Antiquities and Manuscripts- and then.snake back - around and see the Dutch masterpieces,.holla!  We don't have-.time for the bathroom. You're gonna have to man up. He takes her arm and they run-off..  This one is called The, Tri=ph of Chastity. The swan represents chastity. Emma puts her arm around him. and starts to, kiss his neck.  No- no, kissing on the date She keeps kissing him, ..he's enjoying it.  No- not in front of \"The Triumph of Chastity.\" JUMP CUT-. Adam and Emma in ,front of another painnting..  I bet you can.'t guess what this one's called.  You're right! The painting is literally: A man with a pink flower. JUMP CUTS-- A series of paintings with the Madonna, Jesus, Angels.  So I guess there are no paintings of enormous dreidels'. Oh, I think I saw one called \"Jew Eating Baby.\" JUMP CUT- Van Gogh's Irises.  This was.Vaness.a's favorite. 85. Emma looks at him. Adam's lost in thought.  No, come on, you've got to see the' garden, it's like a gay Japanese monk had a nervous breakdown with a pocketful of'seeds.    I told you.  Do what? Spend time with each other' that doesn't involve ripping our clothes off, time that does't involve you texting me at 1 in'the morning and me running over like your little sexbunny- A nearby kid covers his mouth and starts giggling.     This is what a relationship is! 86.  I want -to be nice to you and do  Because T-can't do it-doing anymore if you're not my girlfriend!  Because .I'ia tired of pretending' that I don't feel anything, I'm tired of pretending like it doesn't -kill me to think that you're with anyone else- This is what people do, Emma-- they buy each other flowers, they go to museums, they don't sleep with other people-  Because I want to get hurt by you. If I'm gonna get- hurt, 'I want you to hurt me.. Be my girlfriend. 87.  Goddamn .it. You drive me crazy--  I wish there was some way I could legally cage fight you.    what? She slaps his hand. He slaps her hand back. They start \"slapping each other's hands.  Why are you afraid of being loved?  This is our way of meditating.  I want to lock you in.atiny, windowless room with just.-my butt.  1 ,wish I was a hamster, so I could play dead, and then when you put your hand .in the cage, I would jutp up and kill you.  Fine,, I'd jump on your face, and I wouldn't let:go, and your whole' life people would be-like: \"Why do you have'a hamster on your face?\" Why won't you be my girlfriend?  'You think anyone does all- the things. they want to do, Emma?  -Then the kids will start a rock- band together like Oasis.,'. 89.  Then-you should hire a hit man to kill me- '  We'd take a cruise'to spice up our love life!  We'd go to. couples therapy-  We'll go to a couples therapist with female facial hair.  You'd, be proud of me ! -You're right, I would--  And I'd just have sex with the model a couple times and then I'd buy you a diamond necklace and apologize.,  .I'11 never give you a diamond necklace! Emma' jumps in the flowers frith him.  I'll give-you one every day l They grab each other and start making out. They pull aWay from each other and keep pushing-each other::  I want to tit-fight, that means I want to punch you in the tits a lot. They start Making' out again.. A guard comes over and grabs them one'on each of his arms. A' father, holding his Toddler. daughter, watches then.           Because I can't keep doing this.  You do?  I'm really not going to see-you again.  Yeah. Bye. See ya! Not! Not gonna see ya.. Emma leaves, shuts the car door. She walks into the hospital, upset, trying to keep it together.  I'm really not going to see you again. Emma looks- up- Adam is standing' across the room, by the doors. The nurses look at her, confused.  Seriously. No more. Not going to happen. 92.  Good-bye. They, look at each other- waiting for something. to happen.. . The elevator dings. She gets on. He watches her get on-    Fine, great. Adam walks'through.the hospital doors, back to his car.;  Give these to the sick people-. They take the flowers, Adam gets back-in his car, slams his door shut, drives-off, as we hear \"Your Body is a Wonderland\" blasting from the date mix.  Yeah, yeah, we're bumping and we're grindih'- we're in. da club-  Let's get out of here.  Me neither!' That's so funny, neither one of us wants to mean. anything t o other one- we just want to hook up! Like fish! Like a fish -hook! (puts his finger 'in his mouth like a fish, hook Oo, sex doesn't mean-.anything, aaagh, I.'m a fish! Look at me, I like sex and I'm a fish.  No, where are you going? Let's hook up and not give a fuck about each other! I want that tool.I'don't care about you at all! Where are you going? She's gone. He'puts-his head against his. car. Another girl walks by.  Hey, hey, buy me a shot.  I don't want a relationship right  1\"'m just not very good with  I. won't be able to call you,, I'm getting sent to Guantanamo tomorrow-  I just farted right when I threw up. The girl is running away.  1. think guys should\"make an effort to be- more polite. Like if you know you're never  going to call her again, at ' least. send a' Thank You ' Caxd.  I like'to go the extra mile. If I'm drunk and pass out-before you cum, I'll-send you a gift certificate to Berl, Bath, and Beyond. People seem to be digging it, Adam is enjoying it. He seems more comfortable in'his skin.  Great, I'll do anything that makes any kind of money. Just maybe not something where I.have to ride a. horse-and then underneath it says: Herpes.  You know my Dad?  Oh. He did? This comes as a 'surprise- it's not-clear what Adam thinks..       Dad.  Thank you. Dad. For 'a. lot; of . things. Alvin smiles, relieved.  Are you buying drugs.right now?   Hey it's Adam, 'l don't know if you're free tonight-but I have a show and you're probably-working, but I just thought 1\"d- Emma hangs. up and starts sprinting to her car.-     Sorry- I'm nervous, it's my first. line on a TV show.  I say; \"Put down the guns The .make--up artist attaches small chunks of brain down his face.  No,-it looks like he'.doesn't. 105.          I'm there. Adam starts running.  I'm- sorry-- Can 'you tell them I have     Emma Franklin. They kiss some more. People walk by, surprised or confused to .see someone with a massive head wound kissing someone. A big scoop of his'brains fall on the sidewalk.  why?  You hurt me. A lot. A Lot.  No, you're just high.     What is it about you?'Why can't I get enough' of you?  You're gonna kill me-- 109.  Yeah.  Yeah. That sounds good. Emma looks happy, closes her eyes. Adam keeps his eyes open, scared out of his mind.   Hello Los :Angeles. Emma, with a hoodie over her scrubs, comes in the back.  Someone told me recently that I look like Richard Nixon when I Gum. Adam does a little- imitation of what that looks. like. Emma smiles, -kind of embarrassed. She looks over and sees Alv n and Vanessa there too, laughing.-She's surprised'.  And it suddenly became clear why none of my girlfriends ever wanted to have sex with me. I thought it was just because my dick was too big and it scared them-But apparently-that's not the problem. At all. Actually, I've heard it's like acupuncture- you're- on your back the whole time and you don't even feel it go in. That's what my ex-girlfriend told me before she started dating my father. Vanessa and Alvin laugh, Vanessa covers her head with-her hand.  Actually they're getting married. So Mother's Day just keeps getting better and better. (MORE JOKES    Come. on.  I know-I didn't stay,'and I'm sorry=  I don't care if you need It., just stop for a second. so I can' explain--  Emma, you can't just call me and tell me that now everything's different, now, you love me, now you, want to be.my girlfriend- after I spent-months trying to get over you somehow, trying to tell myselfto forget-you- you can't just .call me and, expect me to just come running- which I did, I know, but I can't just jump back in, I can't just start over, all of a sudden.  Maybe-we just-'I don't know, maybe we blew it. Maybe ' our.'timing was  I don't know.       But we should still, you know, see  Wait, Emma, I have to go on again-. A guy comes. out of the club and calls.  Don't go anywhere, okay Emma watches h:im - go. She gets in her car, closes the door. . Are.youstill working? I'll meet you outside.  Is everyone gone?  I'm completely in -love with someone, and I'm brainstorming ways that I can never see her again without ruining my life.',  I'm just like you- I'm going to fuck it all up. Like you. -Like you gave up on Mom.  So why'd-you start dicking around?'. Why'd you leave her?    Don't tell me what to do. . I'm going to. call her.  Emma Franklin--do you know where she is?  whatif I start running through the hospital and taking everyone off -  Where are. you? Are'you at:home?  okay, hold an.             I know.  I- know.  I know, he's a little baby deer. He just holds her. He starts crying too. They are both crying.  Yeah.  I don't know. They hold each other.in the doorway, crying. He hands her the rubber chicken., she takes it, still crying.  ,Are you good?- 122.  That's okay, that's.okay.. She holds' onto him. He starts crying again too.  Oh crap. They hold onto each other, crying ridiculously hard.  What's after Bambi?: I brought. Schindler's List.  You can do it.  -Yes. The only ones not in jail. .She laughs.-He kisses her some more. 123..  You know what I want to doh I want to buy light bulbs with different wattage so I.can see you in.every kind of light.  I'm gonna- I'm gonna build you a log cabin.  We're gonna break all those rules.  Not that one. But the one about peeing, in front of you. I.'m gonna do that whenever I can. Emma laughs and cries.  Are you glad I'm making this face? Adam makes a funny face. Emma laughs.  I'm totally, completely, - ridiculously in love with you- Adam kisses-down.-her stomach, she laughs, happy, it feels good... then she turns and sees the'TV screen where'Thumper thumping his leg.  Hey.'",
        "Emma": "I don't know.  No.  What's wrong with \"buddies'?  Yeah, you're right.  Hey. A 'long' pause'. -They're not looking at each other. Then  Okay.  I don't get it.'  Let's go to the dumpster-     That's good. That'll be useful if you ever make a time machine and go back'to the medieval ages:-and then your-time machine breaks, and you get attacked by knights.  Marriage sucks my ' butt .  We just got here.  Okay. 5. Adam starts crying, trying to hide it.  Are you crying?  Why are-you crying?  Jesus.. Exwaa pats him a'couple times on the shoulder.  Look. I'm not really an affectionate person. Emu a, very uncomfortable, puts her-arm around him. He lets her. They.don't look at. each other.  Na.  Hello Adam Kurtzman,. of Camp Weehawken: I'm Emma. I held you while you cried.,  No, I grew,up 20 minutes away. Ypsilanti,.Midhigan. The land of my birth. 'l go to MIT.  Uh-huh. 'It's scary actually, how smart I am. Sometimes my neck gets sore because my:brain is so.big.  I'm trying,to get someone to rufee me'. I keep holding out my cup..  So. Times have changed. We've grown up. Do you have -a girlfriend?  Oh. The-fat one?  Look at that McDonald's face.  Why won't she sleep, with .you?  Come on. it's obvious. Look how tense your shoulders are. I'd need a flashlight to find: your-balls.  I'm Pre MEd, I'm really comfortable., with talking about the human body, and male genitalia in piarticular. S could fill, a book with' a.11 the dicks -and balls' I've seen.'I'd call that book.. \"Disks -and Balls\".. Or \"Dicks, Balls, and .Dogs\" and'i'd ptit -pictures of dogs in it too.  I- don't know, I'm weird, deal with it. So why won't she sleep with you?  What do you need to be ready for? The rest of your life? It's just' sex, Adam. It's not a marathon.'You don't have-to train.  MIT can get crazy Kids are pretty much ready to fuck anything-. They know that based on attractiveness, they're on - the bottom of -the ' - biological food chain, so if the' opportunity comes along for procreation, they better fucking. ridethat shit. What's' up with those boxers?  I don't get it., 11.     Oh- yeah-. she seems great-  Aren't they cool? They move around and stuff.     Was the trumpet sound weird?  -Oh. Why not?  Yeah, but I'm keeping your pants.  No. Here. She gives his pants back.  Your dad-was on that show?  I always hated that TV show. T think it first came out when I was. teething, and I've just always associated it' with. pain in my gums.  No. I don't. But I don't have a problem with it.  The affairs of the. heart. The fleeting passions of a drunken night.-The wayI .see it we're all just these big dumb.. animals. who, for the most .part; just want  to have sex with each other.: So maybe we should stop beating ourselves up for what-we feel and just make sweet bone.  And also, it's somewhat improbable, but I like you. Adam beams.  Don't smile. Jesus.  You want 'to come with me tomorrow? I have to go to-this-'stupid thing.  Some stupid thing.  You have cookie on your face.  Oh. No.  Yes. NEIGHBOR DARIA comes up to-the food table.  Yes. That was-probably because he' was wasted.    Yeah, thank you for being sorry for me. Have a nice day. Neighbor Dana walks away. Emma looks at Adam, smiles.  I wish:I'could take you to a funeral'every day.  E3ow-do they make it so bold?  What? Yod were going to stop  him from dying so he could come home, first and lift all the heavy stuff? That would'vejustmade him-want-to die faster. 17.  It's okay.  Yeah. He was not the greatest.-  You should have left.-  Because you're crazy. Because you thought he'd change. Because you still root for the Tigers.  -Yes..And maybe leprechauns are real.  The Toothfairy. And paying off my student loans.-Are you gonna come back inside-,-Mom? Because it's kind of depressing in there.- It's like. somebody died.  In front of Adam's dorm. Adam stands on the 'street, looking in the car- window.  Id say- we should hook up or something, but I've gotta get back' before Mom watches \"Terms of Endearment.\"  I'm glad you came.   Have fun with McDonald's Face. As.she drives away:-  I'm gorgeous. Adamlooks at her,.amazed.  You called me last night :and asked if I would fight to get the English out of Scotland..'  I've been living here 'fot ' 4 8 . hours . You were throwing up for three of them. I've never seen anyone puke like you puked. You  puked .with passion.. It was like watdhiiig Faulkner write \"As.I Lay Dying.\"  Neither axe you.     You told me last night-  No you were crying and covered in          They're in,the box, down by the-  Inside the box there's ..a box- Adam takes out a large vibrator, the \"rabbit\",.  Jesus.       Is that a..good thing?.  You have a weird sex face.  I don't know- it's like Richard. Nixon and Dan Rather and someone having an asthma attack.. ANGLE ON- His sex face, it does look. like that.  Affirmative. They flip so 'she's on top.  Look, I'm riding you like a sled.  I never take my-shoes oft. What if there's a nuclear attack?  What if-someone breaks into my apartment, holds me at gunpoint and says: You must run hurdles.  That's bullshit. 30.  Fine.        Let's.not do the Richard Nixon thing again.  It feels wrong.  I don't think so.  I don't really do relationships. I've tried and I'm not. good at it. After a couple months ,  my throat - starts to constrict and the walls start throbbing. 31.  You're on the rebound, you. should be having meaningless yet sate .sex at every free moment of the day. You need another relationship like you need someone to jump :out of that closet'and throw-a brick-at your head.  Look, I'm attracted to you---  I'm going to be working 14 hour days and I just need someone who's going to be there at'2am, in.my ' bed, and who.I don't have to lie to or eat breakfast with-  We need.to-make some ground rules.     Don't call me in the middle-of the - day to tell me you were \"just thinking about me.\" No buying me things. No crying. No jealousy. 32.  Nolong silences where we're looking into each other's' eyes.. No fighting.- No telling m e that I have problems with communicating my feelings. Because I know t do. I -don't need you to tell me that I do.  No stealing.  Don't ask me about my past- relatioziships or my hopes and dreams for the future.  I don't care about yours. No' flowers.  Try to avoid being weak or vulnerable in front of me. Don't tell me about all'the weird things you think about when'you''re alone. Don't talk about your childhood. Don't forward me things..  what do you think about my body?  Thanks. Don't go pee--pee in  front of me.  Don't-list me as your Emergency Contact, because I .Won't\".come. This one? She pulls in front of a house. Stops the car.  Please don't dress up you$ penis. Ever.  And wedo this until one of us starts feeling something more and then we say good-bye.  Okay. 34.  Sex is so great! Emma goes down on him.  Your dick tastes like ma tzo.  Yeah, let-'s call your mom. Oh wait, I'have your dick in my mouth.-  I don't know-; 'let me see.; Siie'.goes back down to check' it out. -Then comes back up.  A hint of oakiness Some.earth tones.  I go on dick tasting touts of Nappa: Valley. 35. She goes back down, Adam starts clapping in rhythm-like'he's at a. sports game.  (still kissing Adam Hey Eli.  I don't know. I think we :just start.  What are you doing?  You don't have to -do that'..  No. I don't think it'-s necessary to the scene..  Hey McFly.  There's only one thing to-do.  I think you better get in the De Lorean.  Is that your dad?  He's so-attractive.  I'd like to put him in a !bucket and have sex with the bucket-.-     So what do you do for, a 1ivin4?  So do it.  Why?     Yeah. You're my renewable; source of dick. -Your dick is,powering 5 of my lightbulbs.     What's wrong, with ,it? He presses a button pn her i-pod and \"Since U Been Gone\" by Kelly Clarkson comes on.  No.  Stop. Stop. This is like my- worst nightmare. He- gets more and more into it, dancing arouund.     No.  I don't know. The cavemen?  Yeah and then they did it.  Definitely. And.-then he was like: I'm gonna go spear some pre- ' historic hog. And she was-'like: Cool, I'm-gonna have a kid and pick- a lot of berries.  Yeah, it's really sweet.'                I'm on the rag.  .' Why- do I look bad?  You don't'have to be here.  Sheddirig the lining of the uterine walls. 42. -  Oh my god.  I know.                I don't know. I don't ask.  Hm. No.  Uh-uh.'.   You've got some-brain on you. Connie flicks. it on Sumaire.  I have brain on my hair, don't I?. Connie nods. DR. HENRY METZNER, still good-looking\", ixi his fifties, walks by.     Yeah.  Adam? I don't really know'.    Jim and Harold wave back. on stage, Adam adjusts the mike-' he has huge pit stains.  Wow. I never really see him in clothes. Everyone looks.,at her.  what?  Why did'you say you had a wife?  Why don't you just talk about your real life? -  You don't suck. Just.keep doing it.               So.why are you asking?  What did you say?  Why?  Yeah, why?  I'm not yours. She'meets his eyes for a minute.  Sure. Emma gets out her phone, makes a big show of putting in the number.  Okay,-I'm ready. 50., -  Great. Thanks.  You should.  You should.  Go for it'.  That sounds fun.  I don't want to go out with Scottie anyway. He's too good looking.  It's just so soft-- 51.  Mom, he's a jerk., you keep going out with these jerks- Did you fill out that form.I sent you with the information about the co--payment?     Mom.  I don't know,. there must. be some biological reasoning, like assholes -used to be the better hunters or. something.  : Mom! Dr. -Metzner walks by, looks at Emma. -52.     Say: \"Hey; I'Yre 'always wanted to know what you look like when you're not kissing ass.\"  No it's a terrible idea, Jesus.     What-about \"Let's-go get some coffee and bitch about work\"?  Flipsies?  Just ask her outl You're sort of  Just try not to seem like ;a.serial killer. Are .:you ready to cuzit? I'm ready.   It's not working--'  Just hurry up ! I  No Adam, this is because you're having dinner with your father..     I just' worked 14 hours. i -   Oh Dr. Metzner- he's Um,:he's not  You don.'t have to put anything on.  No.    Yes. Yes we are. Awkward.  It's your birthday?  Adam's-had a long day: I think he .should probably go home and rest.  He 'actually- he had an allergic reaction to his own hair. If he hadn't come in when he did,-we might have lost him. You can die from hair.'It turns out.  Sudden outbursts of emotidn are common. The. patient sometimes shouts out-things like-  For example. - Adam stands up holding out his napkin as-a sword. Some people around the rdstaurant-look over.  I think-we're going to call it a    Let's get the fuckout of-here.  (turns back around,  -But you are as crazy as-these. people.  I don't know, we'd have to develop an elaborate point'system.  I knoww. I've-never been in love. What does it feel like?.  Is that good?  So. Sleep.  Oh. I thought we were having fun,  You're breaking a rule.  You're not allotaed to say '''Emmaâ and look longingly in my. face.  Hey, go to sleep. Emma heads down the hallway.  Go back to bed! Emma runs down the stairs, outside.  What? What am I asking you to do?  So what's so hard about that? - .65.  '  Don't operate a motor vehicle. Adam, too tired to chase her, watches her walk to her car.  Good night..     I got em. . '   Sounds great. Emma does a routine check and the man groans, starts to shake a-little. The heart rate monitor picks up.speed. EMkA _ Sir?-Sir? Do you have pain? No orie answers her. The woman won't=break eye contact dith the.man. Some nurses rush in.  I don't. I just- I .asked someone if I could borrow it. I mean- you can't borrow a cigarette-. I don't know- I don't smoke.  I'll just. Hold it. Which is weird. So. I hope you're okay-with that.  Yeah, I know that. I'm not, an idiot, Dr. Metzner. Respectfully. With a lot of respect.  Well. I guess I'm like everyone..  My dad smoked cigarettes.,  Be died.   Hey, can I come-over later? Adam, on the sound stage, is watching some crew guys pack up some lights. - ;  Oh. That's great!  I don't known don't do that shit. I guess just smile a lot.:Are you. smiling?  Good.  You don't.have to face thiss alone-.  Yeah. I like that about you.. So. How is-this done? Should we have a tryst? ' Should we. Have a parking lot tryst? 70.  Oh, I'm sorry, I sh.ouldn.'t-- .He touches her face. Kisses her lightly.     You're near-sighted. Put on your reading glasses.  You should be. talking about your mother..  What did your therapist telL.you to do about me?  That? 71.  You're the Old Testament God. - Because you just, like, made me out' of clay.  Okay, An awkward moment.  'Yeah of course. 72. He starts putting his clothes back on.' eta is left starÂ±xig at the ceiling.  Emma comes-home to her apartment. It's dark and empty.:     I know. I'm a'jerk.  Are you jealous?  Okay. 73.  There's an extra. pillow in your closet.  Yeah.  Nothing..      No' it doesn't!  . .I'm not jealous!  Hey, where have you been?  Doing what?,  Are you trying to make me jealous?  This isn't going to work-  Adam! Adam hangs up.. WIDEN TO REVEAL- He's in front of a synagogue, wearing a kippah.A middle-aged woman. stands looking at him.  Those aren't even the words- The Child Actor holds up a box of.tampons- pissed.  Just come over later-  That's too bad you can't come over. Because I'm naked right now. Adam freezes. Emma tries to quietly.. clew her sandwich.  Oh yeah, I'm so naked, Adam,- and I'm just lying on.a big bed with lots of... turkey...  Totally.  Both.  This is bullshit.  Fuck you.  Stop. Stop singing that. Joy walks up to the 'door'.  Hello.  'I'm his doctor. I did his testicle transplant.  Yeah, we had to do an-emergency, ball. removal. We actually replaced them with the-balls of a small. donkey..  I just have to do a quick check on them.  Yes, that's right.    Pumpkin.  You look.like'a pumpkin, bitch.  Ring, ring, it's-the pumpkin patch, they want their pumpkin back.  Just shut up and fuck me.  -I got you a birthday present. Close your eyes..  open them. Emma is holding-a -rubber chicken with a ribbon tied around its neck in a bow.  I just-.1 figured you were the kind of guy who'd like a rubber chicken.  It's like: What's funnier than a rubber chicken?  You can put it in a pot.  Hit people with it.  What do you mean? 81.  That sounds terrible.  Why would I.want to go'to a museum?  Is this what you want?  .Okay.  I look like shit on a biscuit. What are those flowers for?  Why?     How long does it take to'go to a museum? An hour?  2 hours?  I can't believe you made fun of my, music-when all you do is listen to Neil Diamond.   Oh god.. 83.  I chocked 5 ,prostates and I drained a genital wart. Adamturns the music up.  Okay- where'.s the bathroom?  . Oh yeah? That's so : interesting-  Um. \"Man with a pink flower.\"  T h is one's good. Is it for sale?.  Ley, I think T'.ve got' to get back.    It's beautiful.     No it's not! Maybe that's what You did with Vanessa or whoev er, but ' that's not who I am, Adam. This  You already do nice things for me!. You make me laugh and you fuck my brains out. Some people- ipok over.  (lowers her voice a  Why does it matter if I'm your girlfriend or not, Adam? Why do I have to be yours?  Oh you mean like your parents? Like my-parents? Why would we let ourselves' get hurt when we don't have to?.  No.  You drive Me crazy-  Buildit! Build the cage..  I'll take you down. I'll take you 'down to Chinatown. I'll serve you dumplings filled with me kicking your ass.  Why are you messing everything up?  Why did you get c6ckblocked by your father? A guard comes over.  Impossible.  What if-we get-sick of each other and you get angry because I work all the time ,and then. I stop working and then I never do all-the things I want to do- and-  What if.we have kids and then we hate each otherand-we.have a 'horrible. divorce just like.your parents?  What if I get cancer and you don't want to take care of'me?  What if I'm never around and. sometimes. I'm mean to you and we only have'sex on our anniversary?  I don't want to take.a cruise to spice up our  love-' life !  What if you have-an.-affair with our couples therapist?  What if you have an of fair with a model?  I don't want a-diamond necklace because you slept with a model! Emma pushes him, he falls into some'flowers. ' 90.  I want to microwave your dick-     I know.  I know,. I get it.  Yeah. So. Good-bye. Emma gets out of the car.'  I I know .  I know.  Shit.     Oh. I- um.  T have a lot of-  I'm sorry. I don't what it feels  I don't'.  Your wife? Emma smiles and keeps walking, checking:her voicemail.  A doctor. That`s how I know your grandma. She made 'me sit with her till I could talk to her. like a human being. And then she'gave me your number.  Mike.  Do you think we could take it slow?  Mom! Hi! Sandra takes out ridiculously larger cheesy sunglasses.  Mom! Who is Tuck? Tuck has reached them'by now.  Don't' do that voice in here, Mom.  I'm sorry, Mike, I can''.t hear you- I'm on a Celebrities Homes Tour. - Mazri, this is in Spanish.     I'm sorry, I only have one day off, T .Wanted-to take you to the places. .1' love . Mom.,.can. we talk about- An artist sits on a stool. surrounded by caricatures'.  No!  Mom, it's okay, I got it-- Emma sits down. The artist starts to draw:  What are-you doing with Tuck?  Why do you need to be taken care - of, Mom? why can't you take care of yourself? ' 103.  Thank god he wasn't-.  What, Mom? You never, did any of the things 'you wanted to- do---  By Tuck? '  why don't'you stop telling her what to do, Tuck? Okay? She can do-what she wants !.- She doesn.'t need, you.  Yeah, Mom.. Sounds great. Sandra and Tack-head back to the car, with their arms 'around each other. 'The artist hands her the drawing; She looks like a monster, with.fangs and claws. People are running away from her,, screaming and scared. -   Okay.. Would you possibly.be aware of some way that I could get unbelievably high in the next. 5. minutes?''      I poofed in my pant's .  'Adam. Adam. I'm stoned and .everyone's talking about weddings.:  Adam Kurtzman.-  My mom's. in town,. she's wearing big' sunglasses and randomly yelling-out \"Hollywood Baby!l\"She has -a new boyfriend. I was meaxi to him.-  -I don't know. 108.  After my dad got sick, my mom-would try to feed, him dinner and he'd spit up-the food--he'd yell at her. Herd blame her because he couldn't swallow.' And she just kept feeding him. She.told me I don't understand,' because I've never been in love. But that's-not true. Because I have been. T am.  I know. Am I high or. is the sun setting?  It's beautiful. Come home with me tonight. Adam?.  Emma and Adam are kissing, taking off their clothes. It's still urgent, desperate.  I missed you so much-  I love you.-And I can't see how I could'ever love anyone else. Emma slips her shoes off.-Adam sees her do it, this'is everything hers always wanted. He kisses her. back. - This -is a different kind of sex- it's intense, intimate.-I don't'know how much'of it we see, but they're looking into each other's eyes, not speaking. it takes them by surprise'.     That was.        Yeah.  I just, I had to. 90 into work,. Emma looks down the hallway. ANGLE ON- Dr. Metzner discretely brushing some hair off the - face-of Connie, the other female resident.. Dr. Metzner sees her looking  at him, Emma has no reaction.  (looking at her phone  What? Sandra looks at Emma, worried- she can tell something's. not right. -  You should go-  Come on Mom, you don't have to-   Okay. Tuck honks the horn again.     Hi,. Scottie? It's Emma. I.know this is weird, but do you know where I can find him? .  Do you know where he is?        it's fine, I just wanted to tell you Good Job.  What?  I don't need the apology shit.  Explain what?  I know.. It doesn't- work that way.. I . get i.t . They look at each other, at a loss.  .Maybe, but maybe that's just the way. it. happened. Maybe we were just growing up. But I'm in love with you. 115.  I want to write it on myforehead, t want to buy a t-shirt that's says: \"I love.Adam Kurtzman\" and wear it around all day long. What do you want me to do?.  I want that time back. I want to break all those rules. I want to try this. Let's try.  Yeah. Okay.  Come on. We don't 'have to break up, we never even started. You're going to be so great.  So. Great. Let's do this.  What. do you have- an hour? A half an hour?  I know. i So this isn't part of our arrangement, but do you think you could hold me?  How does this work--'head on your shoulder, head on- your .chest?          I think I get it, Mom. Emma starts to cry, hard.  It hurts.  Channel 27.  Channel 27.' Adam goes. to the TV in the waiting room, reaches up and- changes the channel away from \"The Price is Right.\"     My dad.  Bambi.   if you come in here, you're never .leaving. Adam steps inside, takes her-in his arms, she really starts to sob.     Are you crying?  why. are you crying?  i think so. Emma starts crying again.  I thought I-was done.  I don't know if I can do it.  'oh god- I can't do it-. Emma starts kissing him. He kisses her back,     'Do you think we'.re the only people, .who've' ever fucked 'while watching Bambi?  I'm gonna: Make you do push-ups when yourre old so your-heart stays healthy.     Not the one about calling-me ia the middle of the day.  I'm so - glad you're alive.  Turn Bambi off- turn Bambi off- 124..     (still with her eyes  Bacon.",
        "Lucy": "",
        "Sam": "",
        "Guy": "What's going on?  Dude, you can't go out there like that!. Adam's running and can't heat.",
        "Dr.": "Need you guys back out' there They immediately straighten up, he's the boss. He and Emma make eye contact. She squints.     You're a good girlfriend.  I hope you're not going to use those car.keys'to drive.  I'll take care of it. 67.  I didn't know you smoked.'      People are going to die, Doctor Franklin, that's part of the job.  Everyone else flinches. I:'ve never seen you flinch.  No you're not. - Dr. Metzner tosses his cigarette, turns around to leave.  He -quit? 68.  Ah. That's the fun. part- for everyone who ' dies, there's always someone else you can fix.: And. then - - you go home and ti-y to. sleep. Welcome, to  the world.,- Emma. -Henry leaves. FEMALE INTERN, smoking-a little further down, has been listening to the whole thing. she raises her .eyebrows.     No, I don'.t.think so.  Let's get an enormous bed.  You're beautiful.    I do talk  abort my.mother.  Not this. He kisses'her. Kisses her again.'.  No. Not that. More kissing.  Well that sounds good.  I have to go.  Hey, I have an hour- !.  Okay, so what am'I supposed to do?  You must be Dr. Franklin's Mom.  How long are you here?  Well, I can't compete râºrith that, but I can tell.you that we're lucky to have her here. Now get back to work, Emmal Sandra and- Tuck laugh. ' as . Dr.' Metzner walks . away.  Emma.     Yeah. I think so. -He walks up and puts his arm around -her.  Whatever you feel like. She puts her head on his shoulder. it's uncomfortable, but it feels good.  I've got to go soon.  Hi . Emma didn't come in today.. Adam' s-phone rings. He looks down, picks it up-",
        "Metzner": "Need you guys back out' there They immediately straighten up, he's the boss. He and Emma make eye contact. She squints.     You're a good girlfriend.  I hope you're not going to use those car.keys'to drive.  Dr. Netzner'nods, walks into the room. -  I'll take care of it. 67.  I didn't know you smoked.'      People are going to die, Doctor Franklin, that's part of the job.  Everyone else flinches. I:'ve never seen you flinch.  No you're not. - Dr. Metzner tosses his cigarette, turns around to leave.  He -quit? 68.  Ah. That's the fun. part- for everyone who ' dies, there's always someone else you can fix.: And. then - - you go home and ti-y to. sleep. Welcome, to  the world.,- Emma. -Henry leaves. FEMALE INTERN, smoking-a little further down, has been listening to the whole thing. she raises her .eyebrows.     No, I don'.t.think so.  Let's get an enormous bed.  You're beautiful.    I do talk  abort my.mother.  Not this. He kisses'her. Kisses her again.'.  No. Not that. More kissing.  Well that sounds good.  I have to go.  Hey, I have an hour- !.  Okay, so what am'I supposed to do?  You must be Dr. Franklin's Mom.  How long are you here?  Well, I can't compete râºrith that, but I can tell.you that we're lucky to have her here. Now get back to work, Emmal Sandra and- Tuck laugh. ' as . Dr.' Metzner walks . away.  Emma.     Yeah. I think so. -He walks up and puts his arm around -her.  Whatever you feel like. She puts her head on his shoulder. it's uncomfortable, but it feels good.  I've got to go soon.  Hi . Emma didn't come in today.. Adam' s-phone rings. He looks down, picks it up-",
        "Vanessa": "Uggh. I'm gonna go get more beer. -  I'm just getting a beer. Vanessa walks away.  Happy Birthday, Adam.  I got you a gift-. 60. .Vanessa takes out a gift bag with 'Â±ou're 26!\" it has tissue paper. and ribbons.  No it's- the gift is inside the bag.  I remember you only had one pair so. A tense ' moment .  .Alvin is everything I loved about you, but he's just.a little bit more mature. Adam starts banging his head against the table.  What happened?  Adam, we're happy- it's agood thing for everyone---",
        "Shira": "",
        "Katie": "",
        "Alvin": "O.ut  here l Adam walk's 'out to the pool area. It's gorgeous-. A\"massive' blue swinmiing pool, against the backdrop of the.-Hills. It's perfectly decorated= the pool chairs, the swim-iup bar, -the fancy grill. But it's too clean. It's like no.one.'s ever-,.-used, the furniture. -     Hit me in the stomach.  Yeah.  Let's get some ice on that. 21.     Hey, it's not what you want to be doing after college, but,you have to start somewhere. I spent the first yearI was out here buying horse tranquilizers for Judy' Garland.'  How's your mom?  Good, good. Are you having sex with anyone?  How long has it been?  Okay. Here's the deal. I'm dating Vanessa. Adam stares., shocked, holding the pot 'smoke''ixi: his 'lungs.        I ran into her again at a'party. We just started talking. About you actually. Hey.kiddo. Kiddo? Adam says nothing, does. nothing.,  I know you guys went out  for a  Four years. Okay. Yes. A'couple years. But you've been broken up for a year now.  Okay, but she said for the last year, you were barely. having sex. ' Adam's, in agony, but he's trying not to'-let it show. 23.  She said you weren't that attentive to her needs? You told her you'd only go down on her if it was her. birthday? Kiddo, ' just ''ask 'ine if you've got questions. I hav.e.years of experience. Tf there's one thing you-learn after two failed marriages, -it's how to eat kitty. Look. I know I'm .not the best. Dad. But I care about her: And I've always believed that the worst thing you can do. in this .life is say no to love. Right kiddo?  Thank you, Father. The Priest laughs.  I wanted to see you, buddy.  I want'to take you out to-dinner. With Vanessa.'We want to take you out to dinner. 56.  Come on. We've got to talk about. this. It would mean alot. Come on. I'm going to stay and take pictures with the priests until you say yes.  Good. I'm glad that's settled.  ., So. How long have you two been. dating?  Oh yeah?  Hey, I know it wasn't-the right thing to do,but I!m,not good at doing the right thing. I've tried and I'm not .good at it.  What? You really want to-fight? Alvin stands up. A tense moment. Adam pokes at\"the air a couple times with his napkin, but he's moving incredibly slow. -       .Hey, I wanted to call.to'- . I know you're probably mad at me,, but--  Yeah kiddo, I can do some-things right. is this. an eighth?.  .Vanessa went home to walk the dog.. We- have: a dog now. She named it Freckle. I don't know what to do about that. I might kill it. I don't know yet., Only time will tell. , Hey;-let's pretend I'm a good dad. and you tell me what the hell's wrong with you and then I take you. fishing.  How'd.you get so screwed up? Oh yeah.-I did it.  ' When ' we -first , had you, we hadn't slept in days, we were just shoving' food in our mouths over the sink whenever we could. And finally, I got it together enough to get. some take-out from one of the -restaurants we used to like.  117.  And I set it all out on,the table, and the second we sat down, I think it was the first bite I took, you started crying. And your Horn and I looked at each-other-and just  I don't know. I-think the. simplest answer is: I'm a jerk. And--the. other answer is: Because - at -some point, we forgot how to make each other laugh.. And if that-sounds like a bullshit answer, you're probably right. But if it 'sounds really deep, then - that-'s, good too. Alto.-just FYI- the first time I cheated .oft.' your mom, I. was on a lot of blow. So. if you're married and you. do blow, try to avoid-being -around women who wantto_fuck.you. Even fat women. Blow is-blind, Adam, blow is blind.  But you're not. Call her.",
        "Eli": "I'd like to give her a Roman Face Mask.  It's where your balls are hanging over her eyes and your-dick is hanging over her nose. In-the manner 'of- a mask. .  She's not gonna let-you put it in.  okay, well I'm from the United States, and I want to give that girl a penis mask.  Um. Yeah it is.     Look. Scottie's got a gay nipple.  Look at it.  .,My dads are gay. I'm not ashamed of  She's got bat.eyes.  She's got angry bat eyes. Like staring at you from the dark. Its. pretty hot . I'd fuck.a bat. A bat in a cave. A hot bat in a cave. Adam starts to walk -over to her.  You know who else-is hot? Your girlfriend.     At-least I know my gay dads aren't going to eat out my ex--girlfriend.  Because you've got'a weird look in your eyes. I'm gonna-be honest, you look like Christian Slater.\" Adam dbwns\"another shot.,  No, no, stop. being so nice. Seriously. Remember when:I.-.stole your inhaler as a joke, arid. you , almost died and you didn't yell at'- me. What did you do?.  You should've just yelled at me. You've got to let some of this stuff out,. Scottie-puts another shot in front of Adam; Adam dawns it.  You. broke' up a year ago.  -You broke up 8 months\" ago. and now she's-dating' your father: What, are . you going to-do about it?  Perfect.-  That's a fantastic idea.  That's the: worst idea, I've .ever heard, and we're behind you 100 percent.  He`s at G.  It might, be his cousin.     Oh. Hey guys. That's actually a sink used for washing things. Adam doesn't stop kissing her; just: picks' her up and walks her out of the room. -  I can't focus on my porn when there's so much real sex going on around me.   These are my two gay Dads  Look at that sweat.  This is not going to be good.  Yeah, we could pretend to'be bandits.  That's fresh-territory. That's really edgy.  You sucked. Tell me the next time you do stand-up and I'11see if I can get myself arrested first.  Dad? Jim and Harold both turn around. 48.  Nothing. I just like when you do that. should be drunk when that'woman comes back and sits on you.- Emma leaves with them.  I think what we. have here is an important life lesson: When you hate, everyone and you don't give a shit, a lot of girls want to have sex with you."
    },
    "imdb_rating": "6.2",
    "description": "Occasionally in the 15 years since summer camp, Adam and Emma cross paths. When he discovers that an ex-girlfriend is living with his dad, he gets drunk, calls every woman in his cell phone contact list, and ends up passed out naked in her living room. By this time, she's a medical resident in L.A. and he's a gopher on a \"Glee\"-like TV series, hoping to be a writer. She guards her emotions (calling her father's funeral \"a thing\"), so after a quick shag in the moments she has before leaving for the hospital, she asks if he wants a no-strings-attached, sex-only relationship, without romance or complications. A prescription for fun or for disaster?—<jhailey@hotmail.com>",
    "name": "No Strings Attached",
    "genres": [
        "Comedy",
        "Romance"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNjc2Y2MxMzYtMmYzYi00ODhjLTlmMzQtZDg2NzZmNTMxMDUwXkEyXkFqcGdeQXVyMTEwNDU1MzEy._V1_QL75_UY281_CR3,0,190,281_.jpg"
}