{
    "filename": "One-Flew-Over-the-Cuckoo's-Nest_script.txt",
    "imdb_id": "tt0073486",
    "imdb_url": "https://www.imdb.com/title/tt0073486",
    "characters": [
        "Washington",
        "Chief Bromden",
        "Nurse Itsu",
        "Beans Garfield",
        "Bancini",
        "R.P. McMurphy",
        "Miller",
        "Turkle",
        "Sefelt",
        "Martini",
        "Col. Matterson",
        "Warren",
        "Dr. Spivey",
        "Nurse Ratched",
        "Ellis"
    ],
    "dialogues": {
        "Washington": "He goin' t'see the Big White Muthuh...  They cackle, legs jiving, as the ammonia stings Bromden's eyes and burns his nose. He tries to twist his head, but Washington jams the mop harder. Bromden freezes, panic spreading across his face.   Haw, look at 'im, big 'nough to eat apples off my head an' he mine me like a baby...  A KEY is HEARD hitting the lock in the main door. Washington very adroitly releases Bromden, hands him the mop, and turns, along with Warren and Miller, to their duties, as BIG NURSE enters the ward.   Yes, Miss Ratched?   (taking Bromden by the hand Yes, Miss Ratched...    Warren!  He sits Bromden down and straps his bands and legs in, then plugs the electric shaver in and turns it on and brings the BUZZING instrument towards Bromden's face. Bromden turns away.    Get your black ass in here!  Warren props the vegetable up against the sink.   (simultaneously as Spivey passes into the ward Mornin', Doctor Spivey.    Yes, sir!  The door closes. CAMERA HOLDS on sign that READS:   You a good boy, Mistah Bancini...  Nurse Pilbow returns, hypodermic needle in hand.  Pete turns to his fellow inmates.   Martini, there ain't nobody there, ya dumb goon! Go get the ball!   Pass the ball, McMurphy.  McMurphy crosses to the court, bouncing the ball as he goes. When he reaches the court he holds the ball out to Washington, who reaches for it, but McMurphy snaps it back over his shoulder to Martini.   Le's go, Chief. Le's go get ourselves all nice and clean...  You too, Mistah Mack-Murphy!  Washington goes off with Bromden.  CAMERA HOLDS on McMurphy as he slowly pulls it together and sits on the edge of the bed. He's naked as he opens the drawer to his nightstand and fishes around for a cigarette.   Yes, Miss Ratched?   (taking Bromden by the hand Yes, Miss Ratched...  Washington leads Bromden off. Big Nurse turns to Cheswick and several other Acutes, who have crowded around.   Nobody leaves here till seven thirty.  McMurphy turns Washington over in his mind, then he looks up at the clock above the door.  The time is 7:28. The second hand sweeping its way toward 7:29.   Tha's your problem.   Huh?   Way down the hall, the Group Meeting is SEEN in progress.   Warren! Miller!  The Acutes have stopped fighting and are watching.  McMurphy tags Washington, then is grabbed from behind by Warren, who pulls him back.  Washington moves in and goes to work on McMurphy, when Bromden grabs Washington, from behind, in a bear hug.  Miller jumps on Bromden's back. Bromden, still holding Washington, backs up into the wall, squashing Miller, who screams out.   Shit, man, tha' ain't even worth considerin'.   Now you talkin'.   Bet you ass...    Gimme tha' ball!  Billy panics and hands the ball to Washington, who turns around and makes another basket. Score: AIDES 6 PATIENTS 0.  McMurphy and Harding run down court, McMurphy taking the ball away from Martini, who would like to bring it in.   Jus' playin' the game, sucker...  Washington chuckles and trots on down court.    Take you han's offa me!  Spivey comes running, blowing his whistle.   No way...  Bromden takes the ball at the foul line. Sets himself up and lobs the ball underhand. It goes in.  The crowd goes wild.   (very far away; getting closer Bibbit? Where's Bill Bibbit, ya damn goons?   Come on, get over there!  McMurphy allows himself to be led to the heavy security partition, by the men's dorm, where all the patients are lined up.  It is morning and the day room is a mess:  A few chairs turned over. Paper cups and empty bottles. Puddles of cough syrup, orange juice and apple juice worked into sticky masses.  Rose sits by herself on the couch.  Bromden is the last one led to the lineup, where Big Nurse waits.   Yes, Miss Ratched!   Yes, Miss Ratched...  Washington nods to Warren and the two of them scoop Billy off the floor and carry him screaming to Doctor Spivey's office as Big Nurse crosses into the nurses' station and picks up the phone as Candy eases her way into the day room and joins McMurphy.  A beat, then Miller starts herding the patients toward the washroom, staying clear of McMurphy and Bromden, who don't move.  McMurphy pulls the keys out of his pocket.    'Kay, let's have the keys an' nobody get hurt!  Washington's words are cut off as, O.S., Nurse Pilbow SCREAMS... a bloodcurdling scream. They turn to see Nurse Pilbow enter the nurses' station, her uniform splattered with blood, hysterically talking to Big Nurse .  Big Nurse and Nurse Pilbow rush out of the nurses' station and head down the hallway.  McMurphy is glued to the spot.",
        "Chief": "",
        "Bromden": "as Warren enters and takes a firm grip on Bromden's head and Washington goes to work on Bromden's face. CAMERA PUSHES INTO EXTREME CLOSEUP of Bromden's fearfully distorted face as the BUZZING SOUND of the electric razor INTENSIFIES until it is   looking out of the window. His face washed by the sunlight. His eyes have a vague look, almost vacuous, as...    looking at the machine. A long beat.   Thank you.  McMurphy looks up. A long beat.   Thank you.  Another beat.   God Bless America.   No.   Ca-na-da...   Yeah...   Ca-na-da...    as Sefelt and Miller enter the visitors' room, cross to the security gate and pass into the hallway. Bromden goes back to his mopping.    The patients are all asleep. The new night attendant is fast asleep in the nurses' station.  Bromden quietly takes his pillow and goes to McMurphy's bed, where he kneels and puts his head very close to McMurphy's. A long beat as Bromden studies McMurphy's face.   (whispering in McMurphy's ear When I first came here I was so scared of being lost I had to holler so they could track me... I figured anything was better than being lost...  On the last word, Bromden places his pillow over McMurphy's face and begins to suffocate him. McMurphy starts thrashing and Bromden lies full length on McMurphy. A long beat, then the thrashing ends. Bromden gets off McMurphy, replaces his pillow, and crosses down the aisle toward the day room.",
        "Nurse": "Good morning, boys.  She sweeps by and disappears into the nurses' station. The three attendants put their mops and rags aside and start towards the men's dorm, leaving Bromden pressed against the wall, mop in hand.    as Big Nurse enters to be greeted by Miss Pilbow, who wears an enormous cross between her breasts.   Mean old Monday, Miss Pilbow, mean old Monday... (she flips on the intercom Good morning, boys. Rise and shine. Rise and shine.    Time to get up! Come on now, it's a beautiful day! Let's not straggle! Everybody up, up, up!  The Chronics are physically helped out of bed as the Acutes, who can handle themselves, cross out into the Day Room, rubbing the sleep out of their eyes. Big Nurse steps out of the Nurses' Station. Washington and Warren are hustling the patients toward the washroom.  Miller stays behind, stripping Blastic's bed and rolling up his mattress.   Good morning, Mister Sefelt... Good morning, Mister Fredrickson. Good morning, Billy, I spoke to your mother last night and she sends her love... Good morning, Mister Harding... Good morning, Mister Cheswick. Mister Scanlon...  Bromden comes drifting by, going in the opposite direction. Big Nurse takes his hand and reaches up and pats his face.   Oh, Mister Bromden...  Mister Washington!  Washington comes running.   Mister Washington, why don't we get a good head start on the day by shaving Mister Bromden and see if we can't avoid a disturbance.    as Miss Pilbow picks up the phone.   Okay. How you doing?   Mister McMurphy is a new admission.   This way, Mister McMurphy.  As McMurphy follows Nurse Pilbow down the hall, Spivey's voice trails after him.   Mister McMurphy!  McMurphy turns to see Big Nurse approaching, Washington casually bringing up the rear.    Will you come with me, please.   My name is Miss Ratched. I'm the head nurse here. You've already met Miss Pilbow and Aides Washington and Warren.   Mister Miller, this is Mister McMurphy, who'll be staying with us.  Greetings are exchanged as they pass through.   We do appreciate the way you have taken it upon yourself to meet the other patients.   This is your bed. You may leave your things in that cabinet.   Please use your time to familiarize yourself with your new home and if there is anything you need to know, don't hesitate to ask us.   All in good time, Mister McMurphy. All in good time.   Good. Now if you'll just go along with Mister Washington, he'll see that you're properly oriented.  McMurphy doesn't move.   Is there anything else?   Good. I'm sure we'll be friends.  They smile, sizing up each other.   Yes. Now go along, Mister McMurphy. Go along.    Somebody please see to Mister Bancini, so we can start the meeting.  Billy does... gently laying a hand on Bancini.   At the close of Friday's meeting, we were discussing Mister Harding's problem, concerning his wife...  Mister Harding stated that his wife made him uneasy because she drew stares from men on the street. Is that correct, Mister Harding?    He also thinks he may have given her reason to seek sexual attention elsewhere, but he didn't say how. He has been heard to say to his wife, 'I hate you, I don't ever want to see you again. You've betrayed me.'  So. Does anyone care to touch upon this further?  Big Nurse waits. A long beat.  Harding sits, chewing his nails, tensely waiting, almost wanting someone to begin.  The patients shift uncomfortably, looking in all directions.  McMurphy looks around to see what will follow, when he sees Ellis, nailed to the wall; his pants leg darkens and a puddle of piss forms at his feet. McMurphy looks to see if Big Nurse or the Aides have noticed.  If they have, no one pays any attention.  McMurphy fidgets in his seat, then gets up, crosses to Ellis, unhooks him from the wall, and moves him over a few feet.  The other patients are aghast at this move, look at each other quizzically.  Big Nurse merely watches.  McMurphy crosses back to his chair and sits.   Mister McMurphy, this ward is a democratic community run by the patients and their votes, so you should feel at ease in your new surroundings to the extent you can freely discuss emotional problems in front of the patients and staff. However, the cardinal rule, and I must emphasize this: Everyone keeps their seat during the meeting!   Yes... We were discussing Mister Harding's problem with his wife. Now, who will start?  Billy.   Would you like to start?   Mister Sefelt?  Sefelt shrugs and sinks into his seat.   Mister Fredrickson?  Fredrickson passes.   Mister Taber?  Taber passes.   Mister Martini?   Mister Scanlon?  Scanlon looks at the floor.   Mister Cheswick?  Cheswick wags his head 'no.'   Am I to take it that there isn't a man among you who has an opinion concerning this matter? (no response; she focuses in on Harding Mister Harding, you've stated on more than one occasion that you suspected your wife of seeing other men.   But you have no proof.   And yet you suspect her.   Why?   Have you ever speculated, Mister Harding, that you are impatient with your wife because she does not meet your mental requirements?  One of the Chronics laughs like a child.   Yes, Billy?   No secrets, Mister Harding. Let's get it all out in the open...   Somebody see to Mister Bancini.  Two or three Acutes get up and try to soothe Bancini, but he isn't to be hushed.   Yes, yes, Mister Bancini, now if you'll just be calm...   (working her way around Bancini Yes, I know, I know...  She gets him in the ass, with the needle, and springs back.    as McMurphy enters. Nurse Pilbow is the only one there.    Stay back! Patients aren't allowed to enter the... Oh, stay back!   Oh, stay back, I'm a Catholic!  Big Nurse enters from the nurses' lounge.   Mister McMurphy. Patients aren't allowed in here.    Yes, Mister McMurphy?    That music is for everyone, Mister McMurphy.  McMurphy leans in, placing his hand on the window.   (aware of his physical proximity Mister McMurphy, there are old men here who couldn't hear the music at all if it were lower. That music is all they have, and I wish you wouldn't lean against the glass there, your hands are staining the window.  McMurphy jerks his hand away.   Not at all, Mister McMurphy...  McMurphy turns to walk away.   Your medicine, Mister McMurphy.   It's just medication, Mister McMurphy, good for you. Now down it goes...    Don't get upset, Mister McMurphy...   That's all right, Miss Pilbow, if Mister McMurphy does not wish to take his medication orally, he may...    The patients looking at her. They turn back to their card game.    Good morning, boys. Rise and shine. Rise and shine.    Time to got up! Come on now, it's a beautiful day! Let's not straggle! Everybody up, up, up!  McMurphy is in bed, not ready for the world, when Washington crosses to Bromden, who is looking out the window, and leads him off.   Good morning, Mister Sefelt, are your teeth any better?... Good morning, Mister Fredrickson... Good morning, Mister Harding; my, my, you've been biting your fingernails again...  She sees McMurphy approaching, wearing a towel around his waist and a scowl on his face.   Mister McMurphy, patients are not permitted to run around in towels.   On this ward?   Oh, I had them removed.   Patients are rationed to one pack of cigarettes a day.  Bromden comes drifting by, going in the opposite direction. Big Nurse takes his hand.    Mister Washington!  Washington comes running.   Please see to Mister Bromden.   Now you boys hurry along and wash up for breakfast...  You too, Mister McMurphy.   After breakfast, Mister McMurphy, after breakfast.   Yes. Now run along like a good boy and see that you wash up properly.    watching McMurphy who removes his towel as he enters the washroom.   Sit down, Mister Cheswick.   Sit down, Mister Cheswick!  Cheswick sits -- stunned. A beat; then:    You should have thought about that before you gambled all your cigarettes away. Is that clear?  Cheswick sulks in his seat.   Mister Cheswick, is that clear!   Good...  Now, as I recall, we were making quite a bit of headway, last time, with Mister Harding's problem. So, does anyone care to begin?  McMurphy's hand goes up. No one else's does.   Yes, Mister McMurphy.   Certainly, Mister McMurphy.   The point is well taken, Doctor, but do we have the necessary personnel to cover a second day room?   Good. Good. Yes, yes, I think we should give it a trial period. So! May we get back to Mister Harding's problem... (she sees McMurphy's hand up Yes, Mister McMurphy?   Go on...   Just a minute, Mister McMurphy!   Please understand, the schedule has been set up for a delicately balanced reason that would be thrown into turmoil by a switch of routines.   Very well! All those in favor, please raise your hands.  Big Nurse casts a watchful eye over the patients.    I count only two, including you, Mister McMurphy. Certainly not enough to change ward policy.  McMurphy's hand goes down.   Yes. Now was there anything else you wanted to discuss, Mister McMurphy?    Then I suggest we turn our attention back to Mister Harding's problem. Would anybody care to begin?  She looks around.  McMurphy is slouched in his chair.  Harding puts his hands up. No one else does.   Yes, Mister Harding?   Try, Billy, try...  Billy tries, but can't talk.  The other Acutes are bored, restive, waiting.  McMurphy has ants in his pants as Big Nurse speaks to Billy.   Was it your idea to visit her on Sunday?   Tell us about it...   What was it about her that disturbed you so, Billy?   Billy, were you afraid of her, or of her love?  No response from Billy.   That was the first time you attempted to commit suicide, wasn't it?  You must try to talk about it, Billy.   Mister McMurphy, the purpose of this meeting is therapy. Group therapy.   Let me pose a question to the group: do any of you feel that Mister McMurphy is perhaps imposing his personal desires on you too much?   Will one more vote satisfy you?   Very well. What is it you're proposing, Mister McMurphy?    A vote is before the group.   Everyone in favor of changing the schedule raise his hand.  The first hand to come up is Cheswick's. Then McMurphy's. Then Martini, Scanlon, Sefelt, Fredrickson, Billy and Taber.  Harding doesn't vote.  Big Nurse starts counting the hands.  McMurphy, his face beaming, counts the hands.   I'm sorry, Mister McMurphy, I count only eight.   But there are eighteen patients on the ward, Mister McMurphy.   I'm sorry, Mister McMurphy, but you must have a majority to change ward policy.    You mean you don't want their votes to count, Billy!   Sit down, Mister McMurphy!  McMurphy turns the TV on, flips the channel, then sits and waits for a picture.   I want you to turn the television off and return to your place!  A picture swirls onto the TV screen. The ballgame is in progress .  Martini rushes over and joins McMurphy. Scanlon follows hot on his heels as --   Sit down, Mister Cheswick.  Cheswick stops and stands there, helpless to move.    I want you men to return to your proper places. The group meeting is not over!  McMurphy continues looking at the blank TV screen as the Acutes look from McMurphy to Big Nurse, not knowing what to do next when --    Mister McMurphy, you are deliberately violating the rules!...    You men remain seated!    You boys, stop this and go to your assignments! Mister McMurphy, I want you to set an example...    You men stop this! Mister Washington! Miller! Warren!  Big Nurse's last words overload the intercom and the system peaks out. Big Nurse's mouth continues to work in frantic circles as Washington, Miller and Warren rush to quell the uproar.   Good. Well, boys, did you enjoy yourselves?  A burst of exuberance as the inmates hold up their fish.   My, my...  No one can find superlatives or gestures big enough to describe his catching of the big fish, \"brought it in himself\" AD LIB.   Mr. McMurphy, you had no right to take these men out with you!   No, it was irresponsible!  Big Nurse turns to the others, leaving McMurphy dangling.    That's quite a catch, Jim. Whaat are you going to do with it?   That's an excellent idea. Now, why don't you boys place your fish on the gurney and we'll see to it that everyone enjoys a fresh fish dinner.  The men toss their fish on the gurney as Martini joins the group and starts hitting the others up for a cigarette. All he gets for his troubles are a series of \"No,\" \"Get lost,\" \"I don't have any.\"   Thank you, boys. Now if you'll just go along with Mister Washington to the showers, supper is in half an hour.  The inmates start AD LIBBING and laughing, \"We're not hungry,\" as Martini sees Harding light up a cigarette and crosses to him.    as McMurphy reaches the Nurses' Station and puts his hand through the plate glass window, his fist stopping inches from Miss Pilbow's startled face. Miss Pilbow's scream is added to the SOUND OF THE SHATTERED WINDOW.   Mister McMurphy.  McMurphy turns to see Nurse Itsu. The two aides are standing behind her.   Fine, thank you.  Here, please take these.   To help you relax... please...  McMurphy takes the pills and downs them. Bromden takes his pills.   Please take off your shoes.  McMurphy takes off his shoes.   Please follow me.    Miss Itsu.  In here, please.   No...   Conductant.    It's been brought to my attention that you're giving Mister Fredrickson your medication, aren't you, Mister Sefelt?   Now, Jim, you must be honest with yourself.  At the end of the hall, the door opens and McMurphy and Bromden enter the visitors' room, accompanied by Washington and Warren. They cross to the security gate, open it and pass into the hallway.  Washington and Warren disappear into a room, leaving McMurphy and Bromden, who walk slowly towards the day room.  The Group Meeting continues over as Fredrickson raises his hand.   Yes, Mister Fredrickson?   Sit down, Mister Cheswick, and wait your turn!  He sits.   If the dorms were left open, you would just return to bed after breakfast...   With few exceptions, time spent in the company of others is therapeutic, while every minute spent brooding alone only increases separation.   Mister McMurphy.   Welcome back.   I hope everything is settled.   Good. Why don't you join us?   Certainly, Mister McMurphy, with pleasure.   Yes. Good luck, Mister McMurphy.   No.   No, miss, it's the other way around.   Who?   Miss, it's a complicated case. It would take too long to explain.    Billy, it's not polite to stare!  Billy sinks back, thinks it over, then presses forward.    as McMurphy enters the nurses' station and looks around.    as Turkle shoves his way to the intercom system and switches off the lights and music.    as Turkle, shushing the crowd, makes his way to the nurses' lounge and opens the door.    as Turkle enters, crosses to the nurses' lounge and opens the door to see the patients, silhouetted against the open refrigerator light, moving around, pulling the room apart. It smacks of Dante's Inferno as Turkle snaps on the light and steps into the room.    as Turkle steps into the room and sees the extent of the plundering. The filing cabinet is open. So is the medicine cabinet. Rolls of medical gauze are strewn around, cough syrup and orange juice are flowing.  The patients start piling out of the room, carrying their plunder.  Fredrickson and Sefelt are SEEN sitting on the floor, in front of the open refrigerator, looking through their dossiers.    as McMurphy enters and goes to Turkle, who is dead asleep. McMurphy lifts Turkle's keys and leaves.   Thank you, Mister Washington! Mister McMurphy, do you know where Billy is?  McMurphy shrugs \"no.\"   Mister Harding, have you seen Billy?  Harding shrugs \"no.\"   Mister Sefelt...  Big Nurse's question is cut off as all the patients and attendants turn their heads toward the hallway and start laughing. Big Nurse turns to see Turkle, without his shirt on, walk into the seclusion room and close the door behind him.  Big Nurse turns and starts down the hallway, the laughter trailing after her when, suddenly, the laughter breaks off as Big Nurse stops and in the silence, she opens the door.   You should have thought about that before you brought that woman in here!   I don't want your mother to believe something like this but what am I to think?   Billy, that girl couldn't have pulled you in there forcibly...   Who? Tell me!   Get up, Billy.    Mister Washington.    Put him in Doctor Spivey's office!    as Big Nurse, still on the phone, sees Miller go sprawling across the floor. She grabs the intercom.    Washington! Warren! To the day room, immediately!   Get away from him! Don't you dare touch him!  McMurphy turns and leaps at Big Nurse, grabbing her throat; he drives her into the Acutes and Nurse Pilbow.    Did everything go well, Mister Sefelt?  Sefelt turns to the nurses' station where, inside, Big Nurse sits very erect, wearing a back brace that reaches up around her neck. Sefelt shows his teeth and gums to Big Nurse.    That's very nice. Now, doesn't that make you feel better, Mister Sefelt?   Good...  She turns back to her work.  Sefelt crosses to the card game, where he sits and catches Fredrickson's attention; showing him his teeth. Fredrickson smiles at Sefelt and blows him a kiss.   Yes, Mister Harding?   No. Mister Harding, that is not true.   Thank you...    Now, let's find you a place to sit, shall we, Mister McMurphy?  Big Nurse gently guides McMurphy to a seat on the Chronics' side of the room.  Bromden can hardly contain himself as he waits for McMurphy to go into his act.  The Acutes have already absorbed the reality of McMurphy's condition as they exchange looks with each other.    Here now, you sit here... That's it...  Big Nurse pats McMurphy's face and crosses back to the nurses' station.  McMurphy just sits there, his head lolling to one side.  Bromden waits for McMurphy to go into his routine.  McMurphy just sits there.  Bromden snaps his fingers and slaps his thigh, then waits for McMurphy to follow suit.  McMurphy just sits there slobbering.  Bromden slaps his thigh again.  No response from McMurphy.  The MUSIC PLAYS ON.",
        "Itsu": "Okay. How you doing?   Mister McMurphy.  McMurphy turns to see Nurse Itsu. The two aides are standing behind her.   Fine, thank you.  Here, please take these.   To help you relax... please...  McMurphy takes the pills and downs them. Bromden takes his pills.   Please take off your shoes.  McMurphy takes off his shoes.   Please follow me.    Miss Itsu.  In here, please.   No...",
        "Beans": "",
        "Garfield": "",
        "Bancini": "I'm tired. Whew. O Lord. Oh, I'm awful tired...   Awful tired...  Billy gently eases Bancini into his chair and sits beside him, patting his skinny knee.    Tired... Awful tired...    I'm tired!  Everyone hushes.   Tired. Tired. Oh God, I'm tired...  Big Nurse nods to Washington, who goes to Pete, and gives his arm a jerk toward the door. Bancini is unmovable.  Big Nurse signals Nurse Pilbow, who heads for the nurses' station.  Washington senses danger, lets go of Pete's arm, backs away.   You see... it's a lotta baloney... It's all a lotta baloney...   That's all it is, just a lotta baloney. Ya see, I can't help it, can't...   ... don't ya see. I was born dead. Not you. You wasn't born dead. Ahhh, it's been so hard... (starts going over, slowly; sighing and crying Tired... I'm tired... aw-ful tired...  McMurphy looks around at the others.  Each patient is locked in his own world -- oblivious to Bancini's state.",
        "R.P.": "",
        "McMurphy": "Yeah, ain't that the truth.   So long, fellas...  The two Deputies merely shrug their backs at McMurphy who takes a deep breath of fresh air.   Yes, sir, it's a mighty nice fall day...   Yes, ma'am...  McMurphy follows Nurse Pilbow into the hallway as the door closes behind them.   (as he peels the Band-Aid off, revealing a scar I tell ya, these goons showered me at the courthouse this morning, last night at the jail, and I swear they'd have swabbed my ears out on the way over if they could've found the facilities...  A young Japanese nurse, named ITSU, passes by.    Hey, how ya doin', cutie?   Just great!  See ya around!  Nurse Itsu laughs and disappears around the corner.    Yes, sir, I sure am gonna enjoy my stay here.    Ya know, I ain't never been in an institution of psychology before.   Yeah, I'm here on a ninety-day observation period. Short-timer, like they say...  Soft nostalgic MUSIC is HEARD OVER.   After you, ma'am.   (to Washington and Warren as they step into ward Man, there sure is an awful lot of poontang around here.   Yeah, I was just thinking the same thing, Doc...   Why, I'll betcha there must be a million albacore and tuna running of the coast right this minute.   Fish! Hell, Doc, I'd like to have a nickel for every fish I landed between Point Conception and the Alaska coast...  Washington and Warren continue down the hallway, passing SEFELT, who shyly approaches and waits at a respectful distance.   Yup! Worked right outta Depoe Bay for just about every season since I was able to haul my own weight.   McMurphy, Doc. R.P. McMurphy.  They shake hands.   You bet, Doc.  Spivey turns to Sefelt.   Thank you, ma'am,  Nurse Pilbow enters the nurses' station, closing the door behind her. Next to the door is a bulletin board which, among other bits of information, READS:   Hi.   How ya doin', buddy?   Oh, yeah? What's ailing ya?   Well, that's too bad...  Taber, pencil and paper in hand, crosses to McMurphy and taps him on the shoulder.   Yeah, buddy?   No, 'fraid not...  Taber walks away.  Martini tugs at McMurphy's sleeve.   Yeah, buddy?   Sorry, buddy, I'm clean outta change...  Scanlon moves in.   Sure...   Hey, how's it look up there, big boy?   That right?    Your buddy is callin' ya.  Martini crosses back to the card game as Taber returns.   What's troubling ya, buddy?   You look pretty healthy to me.   How do ya know that?   You're breathin' right now.  Taber walks away.  McMurphy watches him go.  Nearby, an OLD VEGETABLE squeaks.    What's that, Pop?  The old man squeaks again.    Can't hear ya, old-timer.   Hell, compared to where I just come from, this is a country club.  McMurphy crosses to the card game and stands watching the game.   Whatcha boys playin'?   Shoot! No wonder you don't care nothin' 'bout showin' your hand.  Billy holds his hand close to his chest.   What's your name, buddy?   Well, put 'er there, Billy boy, my name's McMurphy.  They shake hands.   What I wanna know is who's the top loony around here?   Yeah, that'll do for openers!   What for?   I can wait...  McMurphy picks up a chair and sits down right next to Harding and looks at him. Another beat; then:   I'm seeing what a busy man does.  Harding, very nervous at McMurphy's proximity, turns back to the game.   Yessir, that's why I came to this establishment for, to bring you birds fun and entertainment 'round the gamin' table...  McMurphy fans the deck out and lays it on the table. Everyone's eyes pop as he scoops the cards up in one movement -- he's a card shark, a magician -- leaving the Acutes with their mouths hanging open.   Easy now, don't smudge 'em, we got lots of games ahead of us...   Yes, ma'am...    Hold the fort down, will ya, fellas!   Yes, ma'am.  Big Nurse and McMurphy stop at the security gate to the men's dorm where Miller opens the gate.   Thank you, ma'am...  Big Nurse stops at an empty bed where Warren is turning the mattress down.   Yes, ma'am...   Now that you mention it, I sure would like to call my aunt up in Portland and tell 'er where I am so she can come visit me.   Yes, ma'am.   Just that I'm glad to be here, Miss Ratched. I really am.   Yeah, you ain't half so bad looking for a head nurse.   Yes, ma'am.  Lead the way, Sam.  They cross out of the men's dorm.  Big Nurse watches them go.   Hell, Doc, I've been everything from a hoopla man with a two-bit carny show to a top mechanic and bull goose catskinner for every gypo loggin' operation in the Northwest till the Army taught me what my natural bent was.   Poker!   Yeah, but you know how society persecutes a dedicated man.   They say I'm a habitual hassler. Like I fight some. Sheeut. They didn't mind so much when I was a dumb logger and got into a hassle. That's a hardworkin' feller blowing off steam, they say. But if you're a gambler, all you have to do is spit slantwise and you're a goddamned criminal.   To tell the truth, ever since I found my natural callin' I done time in so many small-time jails I could write a brochure...   Well, ya know, Doc...  Doesn't it say so there?   I don't, Doc...   That's correct, Doc ...   Doc, what can I tell ya?   No, this is my first trip, Doc.   You bet, Doc!   Yeah, well, it just pains me somethin' awful to see a full growed man sloshing around in his own water...   Well, say, buddy, is that the usual pro-cedure for those Group Ther'py shindigs? Bunch of chickens at a peckin' party?   That's right, buddy. And you want to know who pecks the first peck?   Ah, come off it! It's that Big Nurse, that's who...  The other Acutes have gathered around McMurphy and Harding.   I'm not talking about Fred Yoong or Maxwell Jones, buddy, what I'm talkin' about is that crummy meeting and what that nurse did to you!   Did to you and all the rest of you guys.   What did I see 'cept a grown man gettin' whipped so bad he can't laugh anymore.   Tell 'er to go straight to hell!    She ain't peckin' at your eyes, buddy.  McMurphy grabs Harding by his balls and Harding goes up on his toes.   She's peckin' at your balls, buddy, at your ever-lovin' balls.  Harding is doubled over.   P.A. What the hell is that?   Huh?   Tell 'er to go to hell anyway!   What for?   Lobotomy?    Is that your sense of humor or are you tryin' to say somethin'?    Pass it to me, Martini.  Martini holds back.   C'mon, I'll give it back!  Martini passes to McMurphy.   Atta boy, Martini.  He passes it back to Martini, who laughs and passes it back to McMurphy, who passes it to Scanlon, who passes to McMurphy, who passes to Billy, etc. Bromden just stands watching.    Back and forth, that's it. Shoot, man, we'll be takin' on the New York Knicks before we're through...  McMurphy looks to see Big Nurse looking out a window at them. He catches her eye. She turns away.   Hey-ya, hey-ya, come on, come on, I'm waitin' on you suckers, you hit or you sit...   Hit, you say? Well well well and with a king up, the boy wants a hit. Whadaya know. So comin' at you and too bad, a little lady for the lad and he's over the wall and down the road, up the hill and dropped his load.   'Kay, place your bets.   That's a dime, Martini.  Martini breaks a cigarette in half.    Whadaya bet, Cheswick?   That okay. I'll take your marker. How many ya want?    'Kay, all bets are down, let's wheel 'em an' deal 'em.  He deals the cards out, the first one face down, then the next one face up.   Big king... little deuce... another king... a lovely lady... big ten... and a trey... hey, hey, whadaya say? Ya hit or sit, Martini?    That's twenty up, Martini. (turning to TV, he shouts across room Hey, Taber, who's pitching the opening game?  Taber calls back something but it's lost in the other sounds.   Wait a minute, Martini, I can't hear a thing.  What?   Pardon me miss, but would you mind turning...   All I'm askin' is...  Nurse Pilbow grabs at her cross, screams and shuts her eyes, holding the cross in front of her.   Sorry, ma'am.  McMurphy steps out of the station, closing the door behind him.    Pardon me, ma'am, can I ask you somethin'?   How 'bout turning off that music for a while so a man can hear himself think?    Well, say, how 'bout easin' it down a bit so a man don't have to shout!   Sorry, ma'am... Sorry 'bout that...  McMurphy breathes on the glass and wipes it clean with his sleeve.   Sorry to have bothered you.   (turning back, he examines the contents of the cup What's the horse pill for, honey?   Look, miss, I don't like swallowing something without knowing what it is!   I'm not upset. All I wanna know, for the lovva Jesus...   No, that's okay, ma'am. Down it goes.  McMurphy makes a big show of popping the pill in his mouth, holding his paper cup upside down, for all to see, then moving on to Washington, who fills it with orange juice.  McMurphy gulps it down, not without some difficulty, then he smiles at all the concerned faces and crosses the room to the card table, where he sits to see the Acutes looking at him.   You boys seem to think you've got a champ in there, huh?   Hell, I couldn't get it up over old hatchet-face if ya paid me!    Yeah, an' I'm tellin' ya, she's just an icy-hearted over-the-hump gal who never got enough of the old wham-bam to straighten 'er out... Okay, who wants a card?    Chief? I wanna ask ya somethin'.  Oh, does the spearmint lose its flavor on the bedpost overnight? When you chew it in the morning, will it be too hard to bite? This question's got me goin', won't somebody set me right; does the spearmint lose its flavor on the bedpost overnight?  McMurphy holds the last note, reaches over and rustles through his nightstand.   Here ya go, Chief...  A small object lands on Bromden's bed. It is a fresh package of gum. Bromden picks it up. Examines it. Unwraps it. Deposits his old piece of gum under the bed frame, then inserts the fresh gum in his mouth and starts chewing.    What the...  Who the fuck stole my cigarettes!   I wanna report a robbery!   Yeah, some creep stole my cigarettes!   What for?   Well, say. How 'bout springing a pack of cigarettes loose?   You sure run a tight-assed ship 'round here, don't ya!   'Kay, let's go brush our teeth, fellas...  McMurphy turns and crosses toward the washroom, singing at the top of his lungs.   Oh, Lulu had a baby, His name was Sunny Jim, She put 'im in a piss pot, To teach 'im how to swim. Oh, he swam to the bottom, He swam to the top, Lulu got excited, An' pulled 'im by his... Cock-tail ginger-ale, Five cents a glass, An' if ya don't like it Ya can shove it up your... Ask me no more questions, I'll tell ya no more lies.   What's wrong with you guys?  We SEE McMurphy seated with the Acutes, shoveling food down his guillet. The others are barely touching their food.   Why, if I'd have known how soft this place was gonna be, I'd have arranged for my transfer sooner... (holding up his orange juice Look at this here, real orange juice!  Hooee, that's good. Why, you couldn't pay me to leave this place!  All this place lacks is a couple of sweet gals to liven things up...  He gets up and carries his tray to the proper place, where he notices Miller loading several other trays onto a dumbwaiter. Miller pushes a button and the dumbwaiter goes down. McMurphy crosses to the door to find it blocked by Washington.   Stand aside, Sam, Nature's callin'.   Don't know if I can hold it that long, Sam.    Who do you like in the opening game, Sam?    Asshole.  McMurphy turns and walks away.  Washington watches him go.   Right... I've been givin' some serious consideration to what you told me about the democratic something of this therapeutic community of ours, an' I got a few things I wanna get off my chest, before we get back to Harding's problem.   Right!  McMurphy takes a folded sheet of paper out of his pocket, unfolds it, studies it and begins.   'Kay... Item one... I've been thinkin' 'bout the age problem we got on this ward. You know, the young an' old livin' together, an' I was thinkin' what a great thing it would be if the music was turned up louder. Louder so the old fellas could hear better...  Doctor Spivey nods with approval.  Big Nurse doesn't.  The Acutes are bewildered.   But then I got to thinkin', the music is so loud already, it makes it difficult for the young fellas to hold a decent conversation...  Nods and murmurs of approval from the Acutes.  Big Nurse can only wait for McMurphy's next move.   Well, I was turnin' this dilemma over in my head, when I happened to hit on that old tub room out there, an' I said to myself, McMurphy, I said, that place would make a great second day room. A sort of game room for the young fellas. Whadaya think, Doc?   I'm not finished yet.    'Kay, item two. Tomorrow, and listen carefully to me, you ding-a lings. Tomorrow is the opening game of the World Series an' what I want is to take a vote on switchin' the group meetin' to later on in the day, so we can watch the ballgame.   Yeah?   The hell with the schedule, you can get back to the schedule next week when the series is over. What I want is a vote on it right now!   Atta boy, Cheswick!    Okay, raise your hands.  Only Cheswick's goes up.   Come on', what is this crap? Who wants to watch the World Series?  Martini and Scanlon's hands go up.  Several Acutes look at them.  Scanlon and Martini's hands go down.  McMurphy can't believe his eyes.   No way.   You need four houses on every lot of the same color, Martini. Now let's go, for Christsakes.   It's your dirty roll, Cheswick.  Cheswick rolls the dice.   Snake eyes! Hoooeee, that puts you on my Marvin Gardens, which means you owe me three hundred and fifty dollars.  Cheswick starts counting out the money.   You just come on with that three fifty and Martini will take care of himself... Your dice, Scanlon.   Break it up, God dammit! Ain't I got enough troubles without you guys messin' around... can't depend on nobody.   What's the use! Hooee! It'd do you birds some good just to get a little exercise lifting your arms to vote!   It is to me! An' if I hafta bust way outta this place to see it, I will!   Yeah!   Yeah, how much you wanna bet?   That me an' my buddy, Cheswick, we'll be downtown tomorrow watchin' the ballgame while you suckers are sittin' around this goddamn nursery!   That's between me an' myself. So why don't you boys just shove off. I got some planning to do.  McMurphy sits and resumes his game of solitaire. Martini and Scanlon are putting the monopoly game back together again.  Bromden spots  one of the attendants listening at the door. He wants to warn the others, but doesn't know how.   Maybe I'll just use that thick skull of yours as a batterin' ram, Sefelt.   You think it's funny, huh?   Put your money where your mouth is, Taber.   (rising and turning on the others, who back off You want me to show ya! You want me to show ya how!   All right!  He looks wildly around the room, spots the machine, crosses to it and smacks it with his hand.   With this thing! I'm gonna put this thing right through the window, that's how!   You're fuckin' A-right, I am!   You heard me the first time!   You're on!   Stand aside, son. Any more takers?   Right!   Okay. Who else?   (knows he's taking a bad bet Okay, Harding, you're on.   Yeah... Okay, stand aside, you guys! You're usin' up my oxygen!  The Acutes stand aside and McMurphy steps up to the machine.  He shifts his feet to get a good stance, wipes his hands on his thighs, leans down and gets hold of the levers on each side, and strains.  Bromden watches, in awe of McMurphy.  McMurphy turns loose, straightens up and shifts his feet for a better position.   Just warmin' up.  He grabs the levers again. His whole body shakes with the strain. For just a second we HEAR the cement GRIND. Then his breath explodes and he falls back limp against the wall. There's blood on his hands. No sound but his rasping breath. He opens his eyes and looks around. Then pulls out a pocketful of IOU's and tries to sort them out, but his hands are frozen into red claws. He throws the whole bundle on the floor and walks out. At the door, he turns back.   But I tried. Goddammit, I sure as hell did that much. Didn't I?  McMurphy exits.   That's okay, kid...   No, kid, it was my own stupidity, that's what pissed me off.   What we're gonna have to do is pull this ballclub together for our next play. 'Kay!   Jesus Christ, the man doesn't want to talk, so get off his back an' let's get on to some new business.   Yeah, yeah, the hell with that crap! The World Series is goin' on right' now an' that's therapy also!   What the hell does that have to do with it? This is an important event and I want a vote on it!   Yeah, it'll satisfy me.   I'm proposing a re-vote on watchin' the ballgame!   Okay, I wanna see the hands. I wanna see which of you birds has any guts.   That's it! We made it!   So do I!    You mean to tell me you're gonna count those old birds over there?   Well, I'll be a son-of-a-bitch...   Well, screw that noise!  McMurphy rises and, taking his chair, he crosses toward the television set.   Hoo-wee! Man, all I need me now is a can of beer and a red-hot.  Cheswick gets up and starts across when --   (jumping up and shouting at the blank TV screen A hit! It's a hit! He's rounding first, heading for second. Here comes the throw. He's sliding... and... he's safe! He's safe! (McMurphy whistles and claps his hands Hoo-wee! Whatta game! Whatta game! Come on, Koufax! Strike 'em out!  The Acutes are stunned at McMurphy's outburst.   He's into his wind-up. Here comes the pitch. Strike on the inside corner!  Sefelt, Fredrickson, Billy and Taber get up and cross toward the TV. Harding is the only one who doesn't join them.    He's into his wind-up. Here's the next pitch... and it's a hit! It's a hit!    Ya-hoo, let's'play ball!  The other Acutes pick up on McMurphy and start shouting at the blank TV screen.   'Kay, it's two outs, bases loaded as Koufax steps up to the mound... Checks the runners... goes into his wind-up... Here comes the three-two pitch... And it's a fly ball into deep center. Mantle is going back. He's going back! Back! His back is up against the wall... and... he catches it! He catches it!  The Acutes are shouting, cheering, stomping and dancing in each other's arms.   Just fine, Doc... In fact, I think I might've put on a couple of pounds since I got here.   Come on, Doc, you know as well as I do what's been comin' down in that loony bin.   Shoot, Doc, the only one I'm disturbing is that old nurse and her fixed ways. That's all.   Come on, Doc, you must be kiddin'.   Jesus, that old nurse sure wants my ass in a sling, don't she!   Guidance and assistance! That's insane! Doc, ya gotta help me.   When?   (with great physical and vocal emphasis throughout entire scene Okay, Chief. This is your spot! I don't want you to move from this spot! Never!... 'Kay, now, take the ball! Raise your hands, like this...  McMurphy raises his hands above his head. Bromden follows suit.   That's good! That's a good boy, Chief! Now jump and put it in!  McMurphy jumps. Bromden doesn't. McMurphy does this a couple of times. Each time Bromden remains motionless.   I know, goddammit! You don't have ta tell me that!   I'm not talkin' to him! I'm talkin' to myself! It helps me think!   Well, it doesn't hurt him either!  Does it, Chief!  See, it doesn't hurt him.  Jump! An' put it in!  McMurphy jumps. Bromden doesn't move.   Ha! Did ya see that! (calling to Cheswick on the sidelines Hey, Cheswick!   Come here!  Cheswick runs over.   Let me get on your shoulders.   'Kay, wheel me around to the basket... 'Kay, easy, easy. Hold it! 'Kay, now. (he sees Bromden has walked away Hey, Chief, come back!  Bromden doesn't hear.   Cheswick, go get 'im!  Cheswick goes after Bromden, catches him, and McMurphy latches onto him.   Now, wheel me to the basket.  Cheswick, straining under the weight of McMurphy, turns toward the basket.    Wait here, Chief. (more to himself as he starts down hall Heh, heh, I'll show 'em who's crazy.   Hey, Cheswick! Wake up!   I'm leaving. Goodbye!   Shhh...  McMurphy turns and crosses to Billy.    Hey, Billy. Billy boy, wake up and say goodbye to your ol' buddy.   So long, kid.   Shhh...  McMurphy turns from the bewildered Billy and crosses to Martini.    Psst! Hey, Martini, wake up!   Bye-bye.  McMurphy turns to Scanlon.   Scanlon! Hey, Scanlon, wake up!   Shhhh. See ya around the ball park.  McMurphy crosses to Fredrickson and wakes him.   So long, Freddy. Don't take any wooden nickles.   Shhh...  The other patients are sitting up, some of them getting out of bed as McMurphy turns to Sefelt who is snoring. McMurphy pinches his nose and Sefelt wakes up.   Bye-bye, pussy cat.  McMurphy crosses to Taber.    Up an' at 'em, Taber.   Shhhh. Time to say goodbye.  McMurphy turns and crosses to Harding.   Hey, Hard-on. Wake up, Dumbo.  Harding opens his eyes and looks at McMurphy.   Ya owe me twenty-five bucks.   I'm busting outta this place.   (turning to the others who have gathered around So long suckers.   Shhh... That's for me to know an' you to find out.   Oh, yeah?   How much ya wanna bet?   You're on.  Let's go! An' keep it quiet.  McMurphy starts down the aisle. The others follow.   Out. It's the way out. So just keep it in your minds if ya ever wanna make use of it.   Shhh. Wait a minute. You guys are gonna screw up my plans. So just gone on back to bed like nothin' happened.   Shhh. Hold it down! I'll take you guys down, but ya gotta come right back up! 'Kay?   Shhh... Remember this is a privilege, so I don't want none of you goons fuckin' up. Kay?   'Kay, let's see...  Cheswick first ... then Billy... Martini... Scanlon... Sefelt... Fredrickson... Taber an' the Chief... 'Kay   Shhh!    Where's Martini and Scanlon?   Charlie, ya can't ever let those goons outta ya sight! Understand!   Hey, Martini! Psst! Scanlon! Ya dumb goons, come back here!  Come on, let's get 'em!  McMurphy starts down the tunnel. The others don't move.    Come on, you guys, let's stick together.  The Acutes follow McMurphy. They run down to the intersection and turn the corner.  No sign of Martini or Scanlon.  Somewhere a DOOR is HEARD SLAMMING CLOSED and FOOTSTEPS are HEARD coming their way.   Shhh!  This way!  McMurphy hustles the men round the corner as two aides pushing a gurney come wheeling by.   We'll go back just as soon as we find those guys! 'Kay?   They must be up there!   Come on, don't crap out on me now. We got two buddies out there!   Fuck Miss Ratched!  McMurphy crosses out and up the stairs.  The Acutes look at each other. A beat, then:   Wow! Look at this!  The Acutes don't move.   Hey, you guys, come on up here and take a gander at this!  The Acutes inch their way out the door and up the steps.    Hey, what's that?    Over there!   A bus?   Well, shoot, man! Whadaya say we take ourselves a little spin around the place.    Go ahead! Go back!  The Acutes cast frightened looks at each other then go after McMurphy. Martini and Scanlon join them.   I'm not going back in there. I told ya this was a one way trip. Now stand aside.  McMurphy lifts the hood to the bus and begins jumping the wire. The Acutes stand helplessly by as the engine turns over and catches. McMurphy closes the hood and gets on the bus to a chorus of, \"Please, Mac, take us back... Please...\" McMurphy puts the bus in gear and the bus starts moving. The Acutes start running alongside of the bus calling out for McMurphy to take them back.    Get on assholes!  They leap on.   (waving Bromden onto the bus Come on, Chief! Let's go!  Bromden boards the bus. McMurphy lets out a war whoop as he closes the door and starts the bus moving.    Your horses are hungry, That's what she did say, Come sit down beside me, An' feed them some hay. My horses ain't hungry, They wontt eat your hay-ay-aeee...   Yeah, kid?   I dunno. Where do ya wanna go?   Breakfast! Hell, I know just the place where we can chow down an' thaw out before we shoot back on home. 'Kay?    Soo, fare-the-weel, darlin'. I'm gone on my way, My wagons are loaded, My whip's in my hand...   (as he steps out of the bus This is it!  as McMurphy walks directly to the wall, alongside the door, lifts the edge of the siding, comes up with a key, opens the door and enters.  A beat, then the lights go on inside the building.   Come on in an' warm up. You can put some of that gear on to keep warm. An' there's beer an' Coke in the cooler an' some food over here...  They hesitate.   Come on, don't be shy now, you're among friends.  The Acutes come in, Bromden bringing up the rear.  Martini goes for the candy. Scanlon goes for the Coke. Sefelt and Fredrickson go for the wet weather gear and boots. The others go to the heater. Bromden stands in the middle of the room.   Why don't one of you boys help ol' Chief there get warmed up?  Billy goes to Bromden's aid as McMurphy crosses to a window and looks out.  McMurphy turns and looks out the window. A long beat.    Come here a minute, Cheswick. You, too, Sefelt. Hey, all you guys, come over here, I wanna show you somethin'.  The Acutes cross to the window and look out, saying, \"What? What is it? Whadaya lookin' at? I don't see a thing.\"   Yeah, did you ever see a boat like that? Why, I'll bet you could go all the way to Hawaii in that boat! Tahiti... the Philippines... Tibet...  CAMERA HOLDS on FULL SHOT of the boat.   Ease up on the star drag, keep the tie up, up and work hell outta that fella.  Martini gets a strike and loses it. Scanlon comes up and starts to take the pole from him.   Up, I told you! Keep that tip up... up! You had you one big silver there.  Fredrickson lands his salmon in a spray of scales and blood.  The fish is flopping all over the deck. Billy grabs the fish and wrestles it down.  Bromden lands a fish when --   What is it, kid?   He's a big flounder. Could weigh two, three hundred. You got to lift him in with a winch.   Like hell we will! We got the muscle standing right here. All we need is a couple gaffin' hooks and some rope.   Steady does it, Sefelt!   Yeah, ya should've come along with us, Miss Ratched, an' gotten a little sun on your cheeks and maybe caught a fish or two.    Yeah, that's kind of crazy, ain't it!   (reaches in his pocket; he has none I don't have any.  AD LIBS: \"They could use it.\" \"Take a picture first.\"   I'm sure sorry, ma'am. Gawd, but I am. That window glass was so clean I didn't even see it...  McMurphy turns and crosses back to the day room, opening the carton of cigarettes as he goes.   You guys want cigarettes! Here's the goddamn cigarettes!  McMurphy starts tossing packages of cigarettes into the mass of struggling bodies as Washington grabs McMurphy by the arm and tries to wheel him away.  McMurphy shakes him off and throws a pack of cigarettes in Washington's face.  Washington goes after McMurphy, grabs him, and drives him against the wall, right next to Bromden, who watches as McMurphy shoves Washington away, goes into a crouch and starts circling Washington. Washington dances in and out, chipping away at McMurphy's face until McMurphy drives his fist square into Washington's white, starched chest, drawing him against the wall.  McMurphy moves in for the kill.   Say it again.   Say... God Bless America!    Goddammit, you sly son-of-a-bitch! Does anybody else know?   Shit! This is too much! (his mind going a mile a minute Chief, I tell you we're gonna bust outta this place an' make it all the way to Canada before they know what bit 'em.   Ya like that, Chief, huh?   Yeah, well, well, well. 'Bout time the rest of the world got a gander at Big Chief Bromden cuttin' down the boulevard, stopping just long enough for virgins... Oh, man, I tell you, I tell you, you'll have women trippin' you and beating you to the floor...   Shhh, Chief, don't talk. Never talk! Remember, this is just between you an' me. Do ya understand?  Bromden nods.   (recognizing a long-lost friend Hey, how ya doin'?   What are they?    You an' me, Chief.  McMurphy, flanked by the two aides, follows Nurse Itsu to the EST room.    You know, I never got your name.   You comin' in to hold my hand?   Yeah... Well, see ya around, Itsu.  Itsu smiles at McMurphy.   Yeah...  McMurphy gives Bromden one last wave and goes in.  Bromden watches the door close behind McMurphy.    Hi...  McMurphy looks around at the six aides.   You boys can take a cigarette break now...  The Nurse smiles at him.   Whatever you say, Doc...  McMurphy climbs on the bed and lies down.  The Doctor moves around to the side of the bed and takes McMurphy's pulse, while the Nurse dips her fingers into a jar of salve.   Uh, uh...  The Nurse starts applying salve to McMurphy's temples.   What's that for?    Surely, goodness and mercy will follow this, eh, honey?   I got ten thousand watts and hot to trot. First woman takes me on is gonna light up like a pinball machine an' pay off in silver dollars...  McMurphy does a full circle of the room, greeting the Chronics. But it's an effort for him. His voice is slower, his footwork slightly out of sync.   Just fine, Billy boy, just fine. Full of piss an' vinegar! They checked my plugs and cleaned my points...    Yes, ma'am?   Thank you, ma'am.   Ma'am, I'm as gentle as a puppy dog. Why, I haven't licked the tar out of an aide for two weeks! Hi ya, Doc!  Spivey greets McMurphy.   Why, thank you, ma'am... (he gets a seat and sits heavily Whew. Man, I tell you, that place up there is somethin' else!  Well, ya boys been practicin' up for the big game?  I figured as much...   Yeah, well, let me tell ya somethin'... While I was up there gettin' in-lightened, I came up with one hellava plan...  A great sadness suddenly sweeps over McMurphy's face and he breaks off.    Plan?... Oh, yeah, the plan... Yeah...  McMurphy gets up and crosses to the window, where he joins Bromden who is looking out the window.  REACTION SHOT of the others as they look at McMurphy and each other with quizzical looks.   Miss Ratched, would you please save a space for my aunt? She's comin' down from Portland.   Thank you, ma'am...  O.S. the WHISTLE BLOWS.   Gotta go now, ma'am...   Thank you, ma'am.  McMurphy crosses onto the court. Big Nurse watches him go.    Hey, Sam, bet ya two bucks ya lose.   How 'bout twenty?   Bet!    You're a witness, Doc!    Come on, wake up, you ding-a-lings. The game is on.  The Acutes snap to and McMurphy passes the ball into Harding, who fiercely dribbles down court, McMurphy running alongside him.   Pass the ball, Harding...  Don't hang onto it...  Pass it, goddammit!  Harding dribbles into the corner and finds himself bottled in by two Aides.   Harding, here, over here!  The ball is snagged from Harding's hands by an Aide, who passes it down court to another Aide, who turns and makes another basket.  Scoreboard: AIDES 4 PATIENTS 0    Ya deaf! I said pass the ball!   I was open! Come on, let's play ball!  McMurphy and Harding turn to see Martini, down court, passing the ball into Billy.    What kind of crap is that???    Get down there where ya belong, Martini. You, too, Scanlon.  You take it out, Harding!  Harding takes the ball and passes it in to McMurphy, who turns and dribbles down court exactly like Harding did.   Harding, get back here!  Harding turns to see the other team go by. They score another basket. Score: AIDES 8 PATIENTS 0.  Billy takes the ball and passes into McMurphy, who turns to see CANDY enter the gym, with her friend, ROSE.    Candy. Candy, over here.  Hey, Doc, time out.   (swinging her around in his arms Terrific, baby, terrific!  Hi ya doin', Rose?    How's your ass been holdin' up, honey?  Candy pokes her ass at McMurphy. He gives it a squeeze. O.S. a WHISTLE BLOWS.   Come on, girls, we're holding up the game!  McMurphy leads the two ladies across the court.  The entire gymnasium is riveted on the three of them. As they reach Big Nurse:   Miss Ratched, this is my Aunt Candy and her friend Rose...  Greetings are exchanged.   Miss Ratched was kind enough to save you ladies a seat...  The two ladies wedge themselves in next to Big Nurse. O.S. the WHISTLE BLOWS.   Talk to ya at half time!  McMurphy turns and crosses onto the court.   Whadaya doin', there's no one there!    Okay, Martini. That's okay. Now you watch me.  McMurphy dribbles the ball down the sideline. Stops.  Goes into his routine of ball tricks: faking one way, then the other, over his head, under his legs, finally ending on a pass behind his back which goes straight into Washington's hands. Washington dribbles down court for an easy layup.  Score: AIDES 10 PATIENTS 0    Time out!    Replacement coming in! Harding out!  McMurphy crosses to Bromden, takes his hand, and leads him onto the court and under the Acutes' basket, where he maneuvers him into the proper position. Then McMurphy raises his hands above his head and Bromden follows suit.    Time in! (sees Harding still on court Hold it! Time out!  I said Harding out!   I said out!   I'm the coach!   You can come back later!    Scanlon out!   Martini out!   Good boy, thank you, Billy.  Billy goes off and sits by Big Nurse. Now, the lineup on the bench is Billy, Big Nurse, Candy and Rose.  Spivey blows the whistle.  Under the Aides' basket, Harding passes the ball into McMurphy, who dribbles to half court, takes his mark, and lobs the ball over the outstretched arms of the Aides right into Bromden's waiting hands. Bromden turns and slams the ball into the basket.  The crowd goes bananas. Score: AIDES 10 PATIENTS 2  Bromden walks in majestic dignity the full length of the court and takes up his position under the Aides' basket, while McMurphy and his teammates have been putting tremendous pressure on the Aides, not allowing them to pass the ball in.  As soon as McMurphy sees that Bromden is firmly set, hands held up, under the Aides' basket, McMurphy turns and runs down court, followed by the other Acutes, where they take up their defensive position.  Washington and the Aides easily bring the ball down court, work themselves into position, and take a shot at the basket, which Bromden swats aside.  Each Aide gets a shot at the basket, and each time Bromden swats it aside; sending the last swat into McMurphy's waiting hands.  McMurphy dribbles the ball up court, where he runs into heavy pressure from Washington.    Harding, pass the ball!  Harding ignores McMurphy, as he runs by, and throws the ball to Bromden, who turns and slams the ball into the basket.  The crowd goes bananas.  Score: AIDES 10 PATIENTS 4    Run, Chief, run!  Bromden gets the idea and starts loping down court abreast of Washington, who is making another fast break towards his own basket.  Washington and Bromden go up together and Bromden swats the ball to Scanlon.    Run, Chief, run!  Bromden starts running towards his own basket, Washington hot on his heels, when the ball is passed to him and he goes up, makes the point, but takes a bad spill, crashing head over heels to the floor.  The crowd gasps. The WHISTLE BLOWS.   (breathing in Washington's face Ya fuckin' coon, you're not on the ward now!   (to Washington as they line up at the foul line We got your black ass now, Washington, wanna bet another twenty?   Prayin', brother. Prayin'.   'Kay...  The men slide into their beds and Turkle goes off, clucking to himself.  A beat, then McMurphy rushes back to the window and looks out.  McMURPHY'S POV  Outside, in the dark, Candy and Rose are seen wandering around.  REVERSE ANGLE - BROMDEN AND McMURPHY   There they are, Chief!  McMurphy tries to get the girl's attention and fails.   Where are they goin'?  McMurphy takes off, towards the day room, followed by Bromden.    Our prayers have been answered, Turkle! Our prayers have been answered!  McMURPHY'S POV  as we SEE the girls coming.   I tell ya, there's an angel of mercy standing out there, Turkle.   Come an' see.  Turkle comes out of the nurses' station, leaving the side window open.   You's better believe it, brother!  Turkle reaches the window and sees the girls outside.  CANDY and ROSE'S POV - THE MEN looking out.   (taking Turkle aside; holds up $20 bill Now, wouldn't you pray for twenty bucks, a bottle booze an' a piece of that angel cake?   Hiya, girls...    Man, you look good 'nough to eat!    Come here, sugar...  Candy moves into McMurphy's arms as Rose, straightening her dress, turns to see Bromden looming. Rose SCREAMS.   He's a patient, Rose...   Yeah...   He can't hear you, Rose. He's just a big deaf an' dumb indian...   (passing the bottle to Turkle He's in charge.   Sure, I know Chuck. I know him.   Sure, she understands what you mean. She's not dumb. Why do you think Rose came to visit us? Rose is very interested in hospitals and hospital facilities. Aren't you, Rose?   Yeah, that's a good idea, Turkle. Why don't ya take Rose on a little tour of our facilities...   'Kay, lets get under way.  McMurphy crosses to package of booze, selects another bottle, unscrews the top and takes a long pull, then hands the bottle to Bromden.   Down the ol' hatch, Chief.  Bromden takes a long pull on the bottle, gags and passes the bottle to McMurphy who crosses to the nurses' station and peeks around the corner.  McMURPHY  as he peeks around the corner.  McMURPHY'S POV - TURKLE AND ROSE  far down the hallway, as Turkle shows Rose one room, then another, and then the seclusion room, into which Turkle playfully lures Rose, who playfully resists, but finally enters. A beat passes and they don't come out.  BACK TO McMURPHY  Satisfied, he crosses to the nurses' station, reaches in the open side-door window, opens the door and enters.   (through loudspeaker; very low, ominous, drawn out Who knows what evil lurks in the hearts of men...  Ominous LAUGHTER, then the lights go flashing on and off.    Medication time! Medication time! Rise and shine! Rise and shine! Time to say goodbye... Everybody up, up, up!  Some of the patients immediately pop awake as Candy comes in and starts hustling the patients out of bed.    Don't scream, honey...  He gently guides Ellis to the wall, with Rose still clinging to his back.   Ellis ain't gonna hurt you... Ellis is nice... Nice Ellis... see the nice lady...  He pins Ellis to the wall.   There, see, nice lady touch Ellis...  Rose reaches out and touches Ellis.  The others stand agog, looking at this Holy Trinity.    Don't worry 'bout the road! We'll hit the road! It'll be there when we're ready!  Ain't that right, fellas?  He gets up and crosses to his friends.   I jus' want you guys to have a good time... Are ya havin' a good time? You... you... good... good... Lez have some fun...  He turns to see Billy, who isn't having fun.   Whatsa matter with ya...  Billy turns away and McMurphy crosses to him.   Ain'tcha havin' a good time...  Whadaya want? Ya wanna drink? A cigarette...  Billy looks up at McMurphy, his eyes are flooded with tears.   Whatsamatter, kid, what's botherin' you...?   Marry who?   Candy? Hell no, Billy, she's just a good friend, that's all...    Why don't ya go tell 'er...  Billy doesn't move.   Go on, son, now's your chance...  Billy slowly crosses toward Candy, stopping halfway to look back at McMurphy, who gives him an affirmative gesture. He crosses to Candy, who just looks at him.   Come on, you lovers, it's gettin' late...  They move toward the hallway.  Bromden and Harding are the only two who watch them go.    In ya go...   It's okay, kid. Everything it going to be okay... I'll come back an' getcha in a while... 'Kay...  Candy and Billy, hand in hand, enter the small room, which has a bed in it.  McMurphy closes the door, looks at the keys, and pockets them. CAMERA TRACKS with McMurphy, who is a very weary man, back into the day room.   Hey, Harding, wake me in an hour.   Ahhh, Billy...    Hey, Billy, stop cryin'. You don't have to cry... You ain't got nothin' to be ashamed of. She ain't gonna tell you mother... stop crying...    Let's go!  McMurphy checks the nurses' station, sees Big Nurse is busy on the telephone.    Let's go, Chief...  McMurphy crosses to the window, followed by Bromden, Candy and Rose, where he begins fumbling with the lock.   Billy, oh, Billy boy...  McMurphy crosses into the room and kneels alongside Billy's body. He gently lays his hand on Billy's face.",
        "Miller": "Where you goin', Chief?    as he herds the patients out of the day room. He turns to see McMurphy trying to open the screen. Miller crosses to McMurphy.   Hey, what's gone here?  McMurphy turns around and punches Miller.",
        "Turkle": "Le's get back to bed, Mistah Bromden...  Bromden allows himself to be led back to bed. Turkle fumbles around for the security belt, finds it, straps Bromden loosely in bed, then goes off clucking to himself.  Bromden reaches under his bed and plucks a stale piece of gum from under the bed frame. He starts chewing it when he sees McMurphy looking at him.  Bromden goes right on chewing and looking McMurphy right in the eye.    What you boys doin' up at this ungodly time o' the night?   Well, you boys finish it up an' climb back into your beds. 'Kay?   I thought I told you boys to go to bed!   Oh yeah...   Hallelujah, brother, now get back in bed!    That angel of mercy, he ain't a she, is he?   Ah believe ya, brother. Ah believe ya!   (taking the $20 and reaching for his keys Ah'm on my knees, brother, ah'm on my knees.  Turkle unlocks the security screen and raises the window.  McMurphy sticks his head out the window.   Shhh...  Candy passes a heavy bag of bottles in. Then McMurphy and Turkle help her in. Her dress is above her thighs, her ass visible as she swings over the windowsill and into McMurphy's arms.   Hey, Mac! Gimme a hand, will ya!  McMurphy disengages himself from Candy and lends Turkle a hand. Rose is finally hauled into the room.   Shhh... let's move it away from the window...  The group shifts a few feet as Turkle closes the window and locks the screen. McMurphy turns back to Candy.   What happened?    What?   Oh, that. That ain't nothin' to be afraid of, ma'am. Just ol Chief Bromden. That's all...   They're sleeping, Miss. They're sleeping. An' we gotta keep it down so we don't disturb their sleep.   Oh, no, Miss. Not these loonies. These are nice guys. Nice guys.   What smell?   Ammonia, Miss...   Shhh, please, Miss. Keep it down...  Rose turns to McMurphy who has opened a bottle of booze and is taking a long pull.   (passing the bottle to Rose Not exactly, Miss. Not exactly.   Well, Miss... I would say... I would say, yes. Yes, he's crazy.   Is he in an asylum?   Oh, I see. He was a very sick man. Very sick.   I don't know anything about that, Miss. I would have to examine you first...   Well, I'm running a risk by letting you in, Miss. You know I'm runnin' a risk of gettin' my black ass fired. If you understand what I mean...   I'll be very glad to show you around, Miss...   Now, Miss. What do you want with twenty zombies when you got a twenty gun salute looking you right in the face.   You better believe it, you sweet little thing. You better believe it...   Oh, I'm all through talkin'. Now, let's just you an' me trip on down that hall.   That's all I'm going to show you.  McMURPHY'S POV - TURKLE AND ROSE  as the two of them cross out of the day room toward the hallway, Turkle suddenly turns and hurries back to McMurphy, takes the bottle of booze and hurries off clucking to himself.  BACK TO McMURPHY and CANDY.    sticks his head out the door to check the scene out. Sees what's happening and comes rushing down the hallway, without his shirt, and zipping up his pants.   (furiously pushing them out You crazy goons... shut up an' get outta here... Out! Out! Out!   Shit, it's the soo-per-visor come to fire my black ass.  A KEY is HEARD hitting the lock at the end of the hallway. Without losing a beat, Turkle reverses his movement and starts pushing everybody back into the nurses' station.    Get back in there! In! In! In!  As Turkle pushes the last man into the nurses' station, he sees Rose stick her head out of the seclusion room.    Stay in there! Stay in there!  Rose ducks back into the seclusion room as, simultaneously, Turkle closes the door behind him to the nurses' station as the door to the ward opens and the NIGHT SUPERVISOR, a middle aged woman, enters the ward.    Alla ya goons, get in here!  The patients pile into the nurses' lounge, Turkle cramming the last one through the door and closing it. He turns and crosses to the side door and steps out.   Evenin', ma'am.   (blocking her way to the day room Why, sure, ma'am...   Jus' cleanin' up, ma'am.   Cleanliness is a twenty-four-hour job, ma'am...  Harding passes by and enters the latrine.    Ah guess the natives are restless, ma'am...   Ah, no, ma'am... well, yes, ma'am...  A man get awful lonely at night, if ya know what Ah mean, ma'am...  Down the hall, Rose sticks her head out the door, sees what's happening, and ducks back in as the Night Supervisor turns on her heel and starts back down the hallway, Turkle at her heels.   Yes, ma'am...   Yes, ma'am...  She opens the gate, slams it behind her, crosses to the main door, opers it and exits to:    Night, night.  Turkle turns and the smile leaves his face as he hurries down the hallway.  O.S. the TOILET FLUSHES as Turkle stops at the seclusion room and sticks his head in.   Be right back, honey...  Turkle closes the door, crosses down to the nurses' station, and enters as Harding comes out of the latrine.    Morning, Miss Ratched...  He slides out of the room as Billy opens his eyes. A long beat as they look at each other.",
        "Sefelt": "(approaching and pointing to his mouth Doc, my gungs hurt me.  Spivey starts checking out Sefelt's mouth.   Uh-huh...   Okay, Doc!  McMurphy and Nurse Pilbow reach the day room.   Hi.  Sefelt crosses into the day room where he joins Fredrickson, who is putting a jigsaw puzzle together.   What's he talkin' about?   Yeah, Harding, where do you breathe anyway?   Why?   Yeah, turn her loose!   That kind of behavior will get you a P.A. rating, my friend.   Potential assaultive.   Hit me!   Boogered!  McMurphy rakes in Sefelt's cigarettes, adding them to a pile of loose cigarettes, packs of cigarettes, several cartons of cigarettes.  As Cheswick sits down, depressed:   Big man!   On what?   Maybe he'll just show Miss Ratched his big thing an' she'll open the door for him.  Sefelt and Frederickson smile at each other.  Bromden slides along the wall toward the door.   Why, my head would just squash like an eggplant, McMurphy.  Fredrickson and Sefelt snicker in their hands.   I'll bet a dollar.   Yes, I see it! I see it!   Me too...   There they are!   Yeah, my feet are gettin' cold.    I don't know...   My feet hurt...   Oh, my God! I see something!  Everyone rushes over to Sefelt and looks down into the water.    The massive fish is closer to the surface.   I thought I might donate it to the mess hall.   It's the Dilantin that makes my gums soft!   Lemme see...  Sefelt leans in, unintentionally tipping a bottle of cough syrup in his hand which goes \"glug, glug, glug...\" all over the papers.   Jesus, they're terrible grades, Fred...  Turkle stoically takes in the shattered remains of his job, unscrews the top to his bottle of whiskey, and takes the biggest swig of his life as, O.S., Rose is HEARD SCREAMING.   Yes, ma'am...    Ya know what, Fred?   Just wait till you hear...   McMurphy killed two attendants and escaped...   Yesterday...   Gary Blinker...",
        "Martini": "Can you borrow me a dime?   Me too! Me too!  As McMurphy hands out his cigarettes Bromden drifts by, mop in hand.   No!   No!   No!    Catch it! Catch it!  The ball rolls to the corner.   No!  Martini turns away, his feelings hurt. Washington goes after the ball, when Martini goes running after it.   I get it! I get it!  But Washington gives Martini a body check and beats him to the ball.  Martini tries to get the ball from Washington, who is quite agile and teases him as he returns to the court where he and Warren start shooting baskets, freezing Martini and Scanlon out.  The other patients just hang around or walk, as if in a prison yard.  Cheswick stands in close proximity to McMurphy and Harding, who stand watching the action. McMurphy finally offers a cigarette to Harding, who accepts. They both light up.   No. Me! Me!    What's this?   Bet a nickel!   Hit me.   Hit me!   (simultaneously with Pilbow Hit me!  McMurphy slams his cards down, stands up, crosses the day room, heading for the nurses' station. He passes Washington, who stands there waiting to dispense orange juice.    Me. Hit me!  Big Nurse looks up and studies the men gathered round the table.   Hold it a minute. What's a man need to buy thum hotels?   Hold it a minute.  There's a flurry of money from Martini, red, green and yellow bills blowing in every direction.   What's thum other things? Hold it a minute. What's thum other things all over the board?   A nickel.    I saw thum! I saw thum!    Yeah, Mac?   I wanna see it...   No! I wanna go!   I wanna go home!   I'm hungry.   Oh, look at the pretty boat.    No.  They start a tug of war. Fredrickson tries to break it up, when he gets a strike and his line spins out.  Billy's fish breaks into the sun in a shower of silver scales, and he gets so excited he lets the end of the pole go down and the line snaps.   What is it?   Me, too.    Gimme a cigarette!    Gimme a cigarette!   Why not?   (holding his hands up; empty All gone! All gone! Don't hit! Don't hit!  Harding starts pounding Martini's head on the floor when Billy and Scanlon jump Harding and start pounding him.  Fredrickson picks up the cigarette and stands there watching the fight as he smokes the cigarette as Washington, Warren and Miller move in and start separating the men.  McMurphy, watching the fight, sighs, then deliberately crosses toward the Nurses' Station.   I saw 'em! I saw 'em.   Gimme the ball!   No!  McMurphy looks at Billy.   Great shot, Chief! Ya okay? You're doin' great!  They lead Bromden to the foul line.   He's not!",
        "Col.": "",
        "Matterson": "",
        "Warren": "You goin' t'see the Big White Fathuh?   Tha's it... be right back!  Warren leaves; the old man starts sliding.   (simultaneously as Spivey passes into the ward Mornin', Doctor Spivey.    Yes, sir!  The door closes. CAMERA HOLDS on sign that READS:",
        "Dr.": "",
        "Spivey": "Hold it!  McMurphy turns to see DOCTOR SPIVEY approaching.   Good morning, boys.   Great day for fishing.    Oh, what's that?   Oh, do you do much fishing?  As they pass through the security gate:    Is that so?   My, my... Ah, who are you?   Ah, yes. Well, we must talk soon, Mister McMurphy.   Good morning, Jim. How are you feeling?   Have you been taking your Dilantin, Jim?   Well, we'll send you over to the dentist and see what he can do. Okay?   What other work have you done?    Doctor Spivey is seated behind his desk, on which are several glass-framed photos of Spivey's family, plus a nameplate: JOHN M. SPIVEY, M.D., and McMurphy's papers.  McMurphy, freshly showered and wearing hospital-issue clothes, sits facing him.   Oh, what was that?   I see.   In what way?   I see...   Yes... Ah, do you know why you're here?    Well, according to the Warden at Pendleton, you were a disturbing influence on others. 'It appears that there is a potential in him for instigating a revolt among the other inmates.'  What do you think of that report?    Arrested on an assault charge five times...    The doctor at the prison states: 'Don't overlook the possibility that this man may be faking psychosis to escape the drudgery of the work farm...' What do you say to that?   Ah, it seems you have no other psychiatric history, Mister Murphy?   (closes folder and sits back Well, you're here for a ninety-day observation period, Mister McMurphy. I'd like you to understand you are here on a court order and we are responsible to the state. So, I'd like your cooperation!   Good. Good.   It is worth considering... Miss Ratched?   Well, since it will be largely the Chronics who remain here, one aide and one nurse should easily be able to handle any situation that might occur.  What do you think, men, is it workable?   Fine!    Doctor Spivey is seated behind his desk, looking over McMurphy's papers.  McMurphy sits facing him.   How are you feeling?   Good, good, and how are you getting along on the ward?   Yes, well, Miss Ratched feels that you're a disturbing influence on the other patients.   Yes, that may be so, but in making a careful study of your past record, along with your behavior since you arrived here, my feeling is that you are not mentally ill and it is going to be my recommendation that you be returned to Pendleton where they are better equipped to handle your case.  This is the kiss of death to McMurphy.   I'm afraid not.   No, Mister McMurphy, it's just that we cannot offer you the guidance and assistance that you would receive at Pendleton.   I'm sorry, but I can't keep you here.   We'll let you know.  REACTION SHOT of McMurphy.    Here they are, Miss Ratched. Safe and sound!   Me? I didn't hear a thing! Let's play ball!  Spivey checks the court, then blows the whistle as he tosses the ball into the air.  Washington taps the ball to Warren, who passes to Miller, who hands off to Washington, who goes up for a layup. Two points. The Acutes haven't even moved from their spots. The scoreboard reads: AIDES 2 PATIENTS 0.    Time out!  McMurphy tosses the ball to Spivey, then crosses the court to Candy and Rose, who have had a couple of drinks on the way down.    Time out!    Foul!  As McMurphy charges across court and grabs Washington by his shirt...   Break it up, boys!  Point counts. One free throw!  McMurphy pushes Washington away and turns to Bromden, who is being helped off the floor by Harding, as...    CAMERA SHOOTING TOWARD the door, crammed full of patients, who stare at the scene with curious detached looks, as Big Nurse and Nurse Pilbow force their way through the patients. The crowd parts and Big Nurse stops in the doorway, horrified at what she sees. CAMERA HOLDS on Big Nurse's reaction. A beat, then McMurphy appears alongside Big Nurse and is stricken by what he sees.  McMURPHY AND BIG NURSE'S POV - REVERSE SHOT - DOCTOR SPIVEY'S",
        "Ratched": "",
        "Ellis": ""
    },
    "imdb_rating": "8.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZjA0OWVhOTAtYWQxNi00YzNhLWI4ZjYtNjFjZTEyYjJlNDVlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "McMurphy has a criminal past and has once again gotten himself into trouble and is sentenced by the court. To escape labor duties in prison, McMurphy pleads insanity and is sent to a ward for the mentally unstable. Once here, McMurphy both endures and stands witness to the abuse and degradation of the oppressive Nurse Ratched, who gains superiority and power through the flaws of the other inmates. McMurphy and the other inmates band together to make a rebellious stance against the atrocious Nurse.Jacob Oberfrank",
    "name": "One Flew Over the Cuckoo's Nest",
    "genres": [
        "Drama"
    ]
}