{
    "filename": "Only-God-Forgives_script.txt",
    "imdb_id": "tt1602613",
    "imdb_url": "https://www.imdb.com/title/tt1602613",
    "characters": [
        "Chang",
        "Charlie Ling",
        "Julian",
        "Gordon",
        "Phaiban",
        "Kim",
        "Waiter /Li Po",
        "Mai",
        "Billy",
        "Kanita",
        "Daeng",
        "Ma Fong",
        "Choi Yan Lee (as Kovit Wattanakul)",
        "Papa San",
        "Crystal"
    ],
    "dialogues": {
        "Chang": "The sheriff he asked me Why I had run And then it came to me Just what I had done And all for no reason Just one piece of lead I hung my head I hung my head.                                      I fell into a burning ring of fire I went down, down, down And the flames went higher And it burns, burns, burns The Ring of Fire / The Ring of Fire  I fell into a burning ring of fire I went down, down, down And the flames went higher And it burns, burns, burns The Ring of Fire / The Ring of Fire  The taste of love is sweet When hearts like ours meet I fell for you like a child Oh, but the fire went wild.  I fell into a burning ring of fire I went down, down, down And the flames went higher And it burns, burns, burns The Ring of Fire / The Ring of Fire     Why are you here?  Who?  I love all living things.  I restore karma. Is that why you came?  What's stopping you?  Would you like me to tell you?  You want the Angel of Vengeance.  Why?  Yes you do.  And what do you want?  You want to fight me?     View.  Table.  Yes. I like the table.  I need to speak to you in Thai.                                                                       I need information.  And you're going to help me.  Whether you like it or not.  Why?  Who was she?  How did she know me?  And what's my name?  Chang starts to circle him. Dimitri's terrified. Doesn't know what the fuck he's on about. Suddenly he's grabbed from behind by Phaiban. Chang smashes a beer bottle and walks up behind Dimitri...           And I will always love you. I will always love you. You, my darling you. Hmm.  We both know that I'm not what you, you need.  And I will always love you. I will always love you.  But above all this, I wish you love. And I will always love you.  I will always love you.  I will always love you. I will always love you... I, I will always love you.  You, darling, I love you. Ooh, I'll always, I'll always love you.  It wasn't you, was it?  You're innocent.  It's not your fault.                                Chang is eating breakfast as he watches a western on TV.                       What floor?                                               Let's go.                                         Almost heaven, West Virginia Blue ridge mountains Shenandoah river - Life is old there Older than the trees Younger than the mountains Growin' like the breeze.  Country roads, take me home To the place I belong West Virginia, mountain momma Take me home, country roads  All my memories gathered round her Miners lady, stranger to blue water Dark and dusty, painted on the sky Misty taste of moonshine Teardrops in my eye.  Country roads, take me home to the place I belong West Virginia, mountain momma Take me home, country roads..  I hear my voice In the mornin' hour she calls me The radio reminds me of my home far away And drivin' down the road I get a feelin' That I should have been home yesterday,  Country roads, take me home To the place I belong  West Virginia, mountain momma Take me home, country roads  Country roads, take me home to the place I belong West Virginia, mountain momma Take me home, country roads Take me home, country roads Take me home, country roads",
        "Charlie": "He says he killed his daughter.  He says... He says he's paid for what he's done. That he's been punished already.     He's lying...  It's a story old women tell their grand children... 'The Angel of Vengeance' is supposed to come down from the heavens and judge the living... restore karma to the world..  Leads people to their destiny... That's the myth anyway.     He says it was The Angel of Vengeance...     He said you don't find The Angel of Vengeance. He finds you...  \"Boxing Cop Hero Back From Grave\". One of Bangkok's finest, blah blah blah, came out of a coma that lasted for an entire year, waking up as if nothing had happened... Wife was really happy, blah blah blah... \"It's hard to describe\" Chang said, \"but I do feel different.\"  \"I experienced something metaphysical, impossible to explain... I travelled to many places and saw many things... And when I woke up I was no longer the man I once was...\"  Wait...  The kid.    If you've got a problem, talk to her.  You don't have to. I will.",
        "Ling": "He says he killed his daughter.  He says... He says he's paid for what he's done. That he's been punished already.     He's lying...  It's a story old women tell their grand children... 'The Angel of Vengeance' is supposed to come down from the heavens and judge the living... restore karma to the world..  Leads people to their destiny... That's the myth anyway.     He says it was The Angel of Vengeance...     He said you don't find The Angel of Vengeance. He finds you...  \"Boxing Cop Hero Back From Grave\". One of Bangkok's finest, blah blah blah, came out of a coma that lasted for an entire year, waking up as if nothing had happened... Wife was really happy, blah blah blah... \"It's hard to describe\" Chang said, \"but I do feel different.\"  \"I experienced something metaphysical, impossible to explain... I travelled to many places and saw many things... And when I woke up I was no longer the man I once was...\"  Wait...  The kid.    If you've got a problem, talk to her.  You don't have to. I will.",
        "Julian": "Two fifty, three hundred...  You did well out there. You've got something, Liang. Potential, yeah?  Don't spend it all in once place.           He still in there?  You told him I was coming...  Well maybe you didn't try hard enough.  When was the last time you slept?  No.  You know where he is now?  You go. I'm gonna look around. See if I can find him.  Go on.  Which way'd he go?  You seen Billy?  Well if he comes in, tell him I'm looking for him, yeah?  Yeah, well... if you see him, tell him I'm looking for him...  Julian's not here mate. Fuck off...  What is it?  I can't deal with my brother right now...  What?  What happened?  Someone killed Billy...  For now... We wait.  Hello Mum.  It's me... Julian... Something's happened.                 Maybe. Take your pick. Billy wasn't popular.  You know Billy... He was eccentric.  I'll make sure it gets done.  Yeah, okay, I'll do it.  Ask him if he's Choi Yan Lee.  Ask him why he killed my brother.  What's he saying?  Who did that to him?  What's he saying?  Tell me.  How does he do that?  Ask him who cut his hand off.  Do it.  What's he saying?  What did he say?  Nothing... We're not going to do anything... Just leave him. Leave them all.  It's a little bit more complicated than that Mum.  Mum, calm down...  I know, you always say that - but this is different...  Maybe... Maybe Billy had it coming...  ...because of what he did.  Why?  What if... What if it was The Angel of Vengeance?  ...it - or he - restores karma and order in the world.  He loves all humans...  I'm not, I'm just...  ... I've got to go.  It's alright...  Nothing.  Nothing...  I want you to meet my Mum.  To show her... To show that I've got something here...  When did you last see him?  Did he have any enemies?  Who?  This his phone?  What is it?  No, I'll talk to them.  Good morning officers. How can I help you?  Never heard of him.  I run a boxing club. Not much call for one armed men.  What's this got to do with me?  Then I guess you boys have got a lot of work to do - so have I, so if you'll excuse me...  Sure, sorry. What do you want to know?  With my mum...  You want to speak to her?  Am I suspect?  I want you to find out who that guy is. Okay?  Now.  You're him... Aren't you?  The one who killed my brother.  I came here to kill you.  I don't know...  Yes.  Cause, all my life... I don't know.  My mother wants me to kill you.  ... I love violence.  Thai style.  You can't wear that.  My mother's... Very particular about colours.  She hates red. Come on, we'll get you something else.  Come on.  Look, I'm telling you. It's easier this way. Trust me.  It's Mai, Mum.  A year and a half isn't it?  Mum, please...  I saw her walking down the street.  And I thought - this is the most beautiful girl I've ever seen - so I just walked up to her and started talking.  Mum, stop it, for fuck's sake.  Leave her alone Mum. You've got her wrong. She's a good girl.  Mum!  The cops came by my club today.  They're investigating a murder. The guy that killed Billy turned up dead this morning.  I know it was you, Mum.  He was there. He was with them.  The Angel of Vengeance.  No.  I'm not going to kill him...  This isn't about Billy. This is about me. All my life I've been running...  - his name is Chang-  Mum, don't talk to her like that.  Me.  Billy was a fuck up... He deserved everything he got. You know it and I know it.  Yeah we were brothers, but we were never close... And he was only in Bangkok cause you couldn't control him. So you sent him to me--  -- So you sent him to me and what could I do?  I did what I could. And that's more than you ever did.  And what did that get him? I'll tell you what, a one way ticket to this fucking place, just like me.  I'm only here 'cause of you. If you didn't exist, I wouldn't be here.  I could've been someone, Mum. I was on my way...  Don't you think I know that? And look at me now. I'm a front for a drugs smuggling.  It's true... The whole thing's a front. Every day I see kids coming in with great potential. And every day I see kilos of heroin going out. And it's all because of you, Ma. You and the money and the drugs.  That's right Mum. That's what's more important to you. But what about me? Sometimes I think you only got me out of there so the cops couldn't trace it back to you...  ...that's right Mum. Think about it. With me gone you were safe. And it turned out to be good for business as well. All very convenient.  Is that what happened with Billy? Did Billy become a problem like I did? Wouldn't surprise me, he was a big fucking problem when he was here... Still, at least you didn't have him killed.  I'm not going to kill him for you, Mum. Doesn't matter what you say. And do you want to know why?  'Cause I'm going to fight him. In the ring. Me versus him.  I don't expect you to understand. Cause you don't understand anything that isn't about you.  I don't know... But maybe this time I'll win. Like you say, only God forgives. Maybe this time he'll forgive me...  You never did, Mum.  I'm fine.  I'll be fine. In a minute.  Sorry about that.  Seeing when it hurts.  Didn't you like what I got you?  What do you mean?  Don't to be so hard on her. Her life hasn't been easy.  Don't say that, okay? You don't know what you're talking about. She'd do anything for me.  Don't go there.  You don't get to judge her. You think she's bad? You should've met my dad. But he's not around anymore, and do you know why? Cause she loved me too much.  How much do I owe you?  Come on.  What are you talking about?  Give it a break mum. Just... give it as rest.  Yeah, well I lost.  ... No... it didn't make a difference... No difference at all.  Nothing. I don't feel anything at all.  What do you want, Mum?  What's wrong Mum?  What's wrong?  Who does?  Chang?  What did you do, Mum? What did you do?  We'll be okay - I'll do it, I'll take him out...  We're outside.  I need you here. Right now.  Okay.  Let's make a move.  What's it say?  The Angel Of Vengeance.  No way.  Who said?  My mother?  What kind of a mother says that?  No. We're not doing it.  Only God forgives. And now mother - you will die...  Where's is she?  I'm so fucked...  ... Yeah.  What did she say? What did she promise you?  I've got to get out of Bangkok. Didn't want to leave...  ... without saying goodbye.  My mother... She made me what I am. And now I've got nothing. And they're after me.  I got about twelve grand at the club... Should be enough to get us there. Set ourselves up. Disappear...  Right now.  Stay here. If I'm not out in five minutes... Go.  I'm sorry...  Don't hurt her.  I'm sorry...  I don't know... I'm sorry.  Dark... Darkness.  No... Never.",
        "Gordon": "Like I always said. One day he's going to meet the devil.  Sure--?  So? That's his problem.  I'm with you mate. Billy's fucked--  How much...?  Julian?  Julian...? I need to talk with you...  It's about Billy...  He's dead...  They found his body in a hotel room...  Look, get dressed and I'll see you downstairs.  What do we do?  Are we going to kill him or what?  What are you doing?  It's alright, yeah. Well, what with Billy not being around, it's tricky to be honest...  Well, we're supposed to be moving five keys out the end of this week. But Billy's not here, is he?  I don't know. Earlier today - we had the guy... The guy that killed Billy. Had a gun against his face. But then - nothing...  Julian let him go. Now there's all this stuff about angels... I don't know what the fuck's wrong with him.  I know how to do what needs to be done. That's all.  There's this other guy... Might have been involved...  We don't know who the other guy is yet...  Never come back - you understand me?  Good...  You're a fighter, kid. No doubt about it. Good luck with that.  Sure. No problem.  Nice evening?  Well, I don't know about that. Just been out here a while... Know how to get things done.  But things are going to shit. Since Billy died, Julian's all over the place...  Who?  He's just a retired cop...  It's not that simple... Is there somewhere we can go that's a little more private?  You can't just going round killing cops here anymore. It's not that easy.  I looked into it. Chang's a hard man to get to. None of the Thais'll go near him...  There might be a way... But Julian can't find out...  Sorry mate, something's come up.  I know but... I'm busy. What I'm doing, it's important. I'm sorry mate.  Easy...  She's gone... Picked up Billy's body... She's gone home.  Didn't she tell you?  You alright mate? D'you want something?  We're good mates aren't we?  I'm sorry about this Julian. I wish there was another way...  Don't make this harder--  You've become a liability. You can see that, can't you?  And now she wants me to take over. She wants me to be the favoured son. What am I supposed to say?  I didn't want it to end like this. First I fuck your mother. Then I--",
        "Phaiban": "",
        "Kim": "We're investigating the murder of Choi Yan Lee.  His arm was cut off. Here.  He was the father of the girl that was found dead with your brother.  That's why we're here Mr Hopkins. If you could just answer our questions.  Where were you last night?  That wont be necessary at the moment.     He has to do it. Since he came out of the coma, that's what he's done. Whatever's been asked of him, he's done it. He can't help it. It's all a mystery...     They wont disturb us.  Top.  When are you leaving?  And your other son - is he going with you?  You watched him fight.",
        "Mai": "What happened?  Sorry I'm late.  What's wrong?  See anyone you want us to take home tonight?  What?  What's with you? You want to get high?  Is she here?  D'you want me to?  Why d'you want me to meet her?  What, like we're a couple?  What is it?  Why not?  You're kidding?  This is insane.  ...that sounds about right.  I work in the service industry.  He's good to me...  I should be going now.  Are you alright?  What are you doing?  I'm going to go.  It's fine, but you know... It's not my style.  Maybe you should give it to your mother.  Come on Julian. She's a fucking bitch.  The way she talks to you --  What? 'Don't talk about my mother'? Come on Julian.  Why don't you fuck her instead of me?  You're fucked.  Fuck you.  ...tell him I came?     What happened to you?  Who did this to you?  Come with me...  ...to Cambodia - we can hide there... You'll be safe there.  Now?  Wait outside...  Let's go.  Five minutes.",
        "Billy": "... I love violence!",
        "Kanita": "",
        "Daeng": "And if he loses?",
        "Ma": "Not this evening.  He's not coming in. I tell him to stay away. He hurt one of my girls Julian. Not good...     What happened?  Good afternoon madam, what seems to be the problem?  I'm sorry madam...  ... it simply isn't possible.  Well I might be able to arrange something...  There's really no need--  Room 300.        Sorry I'm late.  What's wrong?  See anyone you want us to take home tonight?  What?  What's with you? You want to get high?  Is she here?  D'you want me to?  Why d'you want me to meet her?  What, like we're a couple?  There's some cops here to see you.  Probably just money. You want me to find out how much?  What is it?  Why not?  You're kidding?  This is insane.  ...that sounds about right.  I work in the service industry.  He's good to me...  I should be going now.  Are you alright?  What are you doing?  I'm going to go.  It's fine, but you know... It's not my style.  Maybe you should give it to your mother.  Come on Julian. She's a fucking bitch.  The way she talks to you --  What? 'Don't talk about my mother'? Come on Julian.  Why don't you fuck her instead of me?  You're fucked.  Fuck you.                                   ...tell him I came?     What happened to you?  Who did this to you?  Come with me...  ...to Cambodia - we can hide there... You'll be safe there.  Now?  Wait outside...  Let's go.  Five minutes.",
        "Fong": "",
        "Papa": "",
        "San": "",
        "Crystal": ""
    },
    "imdb_rating": "5.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMzE5NzcxMTk5NF5BMl5BanBnXkFtZTcwNjE2MDg2OQ@@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "Bangkok. Ten years ago Julian (Ryan Gosling) killed a man and went on the run. Now he manages a Thai boxing club as a front for a drugs operation. Respected in the criminal underworld, deep inside, he feels empty. When Julian's brother murders an underage prostitute, the Police call on retired cop Chang (Vithaya Pansringarm) - the Angel of Vengeance. Chang allows the father to kill his daughter's murderer, then \"restores order\" by chopping off the man's right hand. Julian's mother Crystal (Dame Kristin Scott Thomas) - the head of a powerful criminal organization - arrives in Bangkok to collect her son's body. She dispatches Julian to find his killers and \"raise Hell\".",
    "name": "Only God Forgives",
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ]
}