{
    "filename": "Ordinary-People_script.txt",
    "imdb_id": "tt0081283",
    "imdb_url": "https://www.imdb.com/title/tt0081283",
    "characters": [
        "Swim Coach",
        "Beth",
        "Audrey",
        "Grandmother",
        "Karen",
        "Berger",
        "Sloan",
        "Calvin",
        "Ray (as James B. Sikking)",
        "Stillman",
        "Ward (as Quinn Redeker)",
        "Jeannine",
        "Conrad",
        "Joe",
        "Ruth"
    ],
    "dialogues": {
        "Swim": "",
        "Coach": "Go! OK, Come on, now! Move it, you guys! Move it! Keep it going! Keep it going! Keep it going! Come on! Keep plugging! Plugging! Use those legs! Use those legs! Lazenby, get with it! Jarrett, keep your head down! Work it out there! Work it! Come on, now! Come on! Push off! Get your head down. Jarrett! Come on! Keep it up! Keep it going! Dig! Dig! Dig in there! Come on! Get at it! Push on. Jarrett! Push on!      Well, are you having fun out there?  There's no point if you're not having fun. Right?  You guess so...? Are you on medication, Jarrett? Tranquilizers? Anything?  Did I ask you if they gave you shock out there?  Yeah what?  Don't look at us, Lazenby! Get your ass in the water! Look at the bottom of the pool! You know, I'm no doctor, Jarrett. I would never have let them put electricity in my head.     What it is you want? I don't know what else to do for you.  You gotta be kidding me. I don't get it. I excuse you from practice twice a week so you can see some shrink. I work with you every damn night at your convenience. What the hell more am I supposed to do for you?  Bright kid like you, everything going for you. See, I don't get it. Why do you wanna keep messing up your life?  Okay. Okay. Now, this is it.  You're a big kid now.  Actions have consequences.  I'm not taking you back again. You'll remember that?",
        "Beth": "Bev Walsh was wonderful.  Yes.  What was it you were you thinking about?    Yes. She'll talk to John. Where's Conrad? This'll get cold.  They won't be back by Saturday.  Morning.  It's French toast. It's your favorite.  You're not hungry, you're not hungry!  There's fresh fruit for you when you get home from school later.  You can't save French toast.  Listen, I've got to run. I'm playing at nine. Will you please call Mr. Herman about the shutters? I can't get anywhere with that man.  Was he actually a client of yours?  It's too bad.  Fish too dry?  They have a new mechanic at C&amp;S.  I don't know. I think he took a job in Skokie. Anyway, this new mechanic is so ...awkward. Is that shirt ripped? Leave it on the table in the hallway.  Conrad, do you want me to sign you up for round robin at the club?  Well, don't you think it's time to start?  Also, Calvin, we have to go to the Murrays on saturday, I couldn't get out of it, it's Clark's birthday. I bought him that book on wine.  The one from Idaho?  Did she die in Idaho?  You said she was always traveling. I just... wondered if she died in Idaho.  I didn't know you made an appointment.  Where's his office?  You're the scariest ghost I've ever seen! And the tiger and the witch... You all look just wonderful. Take an apple.  There you go. Be careful.  Good-bye.  The Cabbots. Little Julie's first time. God, she's so cute!  Know what I've been thinking?  That Christmas in London would be like something out of Dickens. We've never done that before, right? Christmas in London?  Yes, we talked about that.   We decided on that.    I think...  I think it would be good for him too. Isn't it time we got back to normal?  Alright, so he'll miss three weeks. Why interrupt it?  Because I want to get away! I think we all should. It's important.  Alright then if he changes his mind, maybe it's not something that was right for him to do.  I don't think he knows what he wants to do.   Don't do that!  Ha. I didn't think you were here  I didn't play golf, today. It's too cold.  I didn't play.  No, I mean, ...for the year it's colder.  Weren't you swimming today?  How'd it go?  Good.  Off.  Well, you have to work at that.  Seventy four? Gee, I was awful at trig.  Wait a minute... Did I take trig? That's... - uh...? I bought you two shirts. They're on your bed.  Well. The Murrays of course, and the Gunthers, and the Caines, and... the good old us.  Don't be negative.  Okay.  Okay. Yeah. Come on. Let's go. What's our excuse?  Good. Very good.  All right now, smile.  Hello Gladyce. Will you put that with the rest of them?  Oh, look, we're in time for the grand entrance!  Clark! Happy birthday! You look wonderful for a 75-year-old!  Is that new?  You did the mousse? It turned out well?  Hi there.  Good to see you, and where were you at the lunch last week?  Your hair looks wonderful. It's shorter, isn't it? I like that.  Good to see you! You look beautiful. As ever.  What are these hushed tones all about?  No. You didn't. You're so mean. Isn't he the meanest man you've met?  How are you. Darling? Is he falling asleep on you, yet?  You drink too much at parties, Calvin.  Why did you tell Annie Marshall that Conrad is seeing a psychiatrist?  Well for one thing, I don't think people hear that kind of thing very easily.  Well, I thought your blurting it out like that was in very bad taste...  Not to mention a violation of privacy!  Our privacy! The family's privacy! I think it is a very private matter.  It's cold out here. You should put that on, or do you want a sweater?  What are you doing?  About what?  Your hair is starting to grow out. It's looking... looking better.  Oh. Yeah, I remember. I remember how scared I used to get... That whosssshhhhh! Flap, flap, flap, flap!... Every time I started the car.  You know. Uh... That animal next door, that Pepper or Pippin, whatever its name is...  He's not a very friendly dog...    I... I don't care what Mr. McGreary says.  - What he really wanted was a      - Everytime time that dog retriever. It was down the         comes into this backyard, I street for sale. That's what       try to get him out... he wanted. A retriever.  Put that on if you're gonna stay out here, okay?  Help what? Oh, you mean with this? No.    Okay? Because it really is a mess.  Hello. /.../ Oh, hi! /.../ Yeah, , no, I didn't get there. I was swamped with work. How did it go? /.../ No, no, I'm not doing anything, just getting ready for dinner. Uh-huh.  Did she really?  Oh, Bucky!  No. Stop!  What is it?  No, I tell you what. Let's get the three men in there, and I'll take a picture of you.  Do it.  Calvin...  Calvin!  Calvin, give me the camera.  Come on, give me the camera.  No but I really want a shot of the three of you men. Give me the camera, Calvin. Please...  Cal?  Smile.  Who's hungry? I'll make the sandwiches.  I think it can be saved.  That was dumb. It was just so dumb. I don't think he's happy in school.  I don't think people want to be with him. He provokes people.  Thank you.  Yes, Mother, of course.  I think maybe he should go away to school. I just don't know how to deal with him any more.  I don't know. I suppose this doctor he's seeing.  A psychiatrist.  No...  Berger.  I dunno, I suppose he's Jewish. Maybe just German.  You know, I think this can be saved. It's a nice clean break.        Carol thought I knew. Cos why wouldn't I? It happened over a month ago.    It's really important to try to hurt me. Isn't it?  Oh? And how do I hurt you? By embarrassing you in front of a friend? Poor Beth! She has no idea what her son is up to! He lies and she believes every word of it.  You did! You lied everytime you came into this house at 6:30 ! If it's starting all over again, the lying, the covering up, the disappearing for hours, I will not stand for it! I can't stand it! I really can't!  Maybe this is how they sit around and talk at the hospital, but we're not at the hospital now.  Buck never would've been in the hospital!  I won't do it again. I really won't do it.  Ah! Oh, god, that's the pattern, isn't it? He walks all over us and then you go up and apologize to him.  Yes of course you are! You always do! You've been apologizing to him ever since he got home from the hospital, only you don't see it!  Don't talk to me that way. Don't you talk to me the way he talks to you!        Hi!  Calvin?  What's the matter?  What happened?  What?  Why?  Calvin, what's the matter with you?  What could getting dressed for Buck's funeral possibly have to do with anything right now?  Ha, ha.  I won't listen to that! No one in their right mind would listen to that.  Why do you want to remind me of it?  It's all right.  Caroll! I'm fine. How are you?  I know. I'm so busy. I promise I'll call you soon and we'll have lunch.  How's Brad? Give him my love.  Isn't this madness?   It gets worse every year!  What?  Oh... No, no. No. Thanks.  We've got Bennett's, and Grant's and Foley's. Ha, Conrad should get something for my mother and father. He's not supposed to get something for his doctor, is he?  What?  Why?  Ho... He thinks it's a good idea? What does he know about me, about this family? I've never even met him.  About what? What are we gonna talk about? Don't try to change me, Calvin. I don't want anymore changes in my life. For God's sake, hasn't enough happened? Let's just hold on to what we've got!  I don't want any surprises. I know I'm not perfect. And if I can't go around hugging everybody all the time the way you do, then I'm sorry.  I don't want to see any doctors or counselors. I am me. This is my family. And if we have problems, then we will solve those problems in the privacy of our own home, not by running to some kind of specialist everytime something goes wrong...  ...running to experts every time something goes wrong.  I know you mean well. I want this to be a nice Christmas.  We need time together, Calvin. You and I. We have to get away. New Years'. We can spend some time in Houston with my brother and Audrey. You know, play a little golf. Relax.  I have already talked to Mother about it, and Conrad can stay with them. Please don't worry about it. Please, for his sake, don't indulge him. We need time together. Okay?  I love you.  Let's just give things time. Okay?  Yes... It's not even plugged in.  Really?  Would you tell me why it is I am still hungry?  With baked potatoe and sour cream, too, uh? How long has he had that drawl?  All right. How about that?  Oh, I do love that.  We should spend more time playing golf together, you know that? Maybe our next vacation, strictly golf. Pinehurst, Myrtle Beach...  Do you do that deliberately or is it just a reflex?  I'm surprised you haven't felt the need to call him since we've been here.    What?  What I started?  Ha! There's no point discussing it.  He controls you even when you are two thousand miles away.  Isn't he?  No, no. Let's talk about what's bothering you. Cos' that's what you want, isn't it?  It's not what you've done, it's what you think I've done. You blame me for the whole thing.  No! I can't! And neither can you, and neither can anybody else! Only maybe I'm just a little more honest about it!  I don't know what he expects from me. I never have known.  What? He wants me to throw my arms around him everytime he passes an exam? Well, I can't do it! I cannot respond when someone says: \"Here, I just did this great thing. Love me.\". I can't!  Hate him? My God! How could I hate him? Mothers don't hate their sons! Is that what he told you? Do you see how you accept what he says with no questions, and you can't do the same thing to me, can you?    Happy?  Ward, you tell me the definition of happy, uh? But first, you better make sure that your kids are good and safe, that no one's fallen off a horse, or been hit by a car, or drowned in that swimming pool you're so proud of! And then you come to me and tell me how to be happy!  Calvin?  Why are you crying?  Can I, uh... Can I get you something?  What did you say?  Calvin. What did you say?  Tell me.  I feel the way I've always felt about you.",
        "Audrey": "He is trying to get everybody to move down here.  Gosh, you guys, it's so good to see you. You look tired. Cal.  Ever since we joined the country club.  Beth, nobody wants anything from you.",
        "Grandmother": "Ha! Ha! Mother do you know            Be quiet. I have to how to aim that thing?                concentrate. Be quiet.  Is it in focus?                       Smile. Smile. Okay. Good.  And be quiet. Be quiet. Be quiet. Conrad. Where are you?  Connie.  That's great. All right, smile everybody.  You're taller than your                  Quiet! Will you be quiet? mother is! Really!                       All right, smile!  This is beautiful. Hold it               Shut up! Wonderful. OK, now I level, would you?                        want to take Cal and Beth.  Great! Sure. Oh, come on. You            Oh, hoooold it! can do better than that.  Ain't it mother?                         Yes. It's marvellous. I love Calvin clicks but it doesn't work, the camera wasn't cocked.  Beth?!  Have you talked to his teachers?  Well. / Why don't you do this? / It's an awkward age.  Maybe he needs a change. Are you sure he's eating enough?  I think he'll be all right - if you're firm with him, mmm?  Who would make that decision?  What sort of doctor... would make that decision for you?  I thought we were all finished with that.  What's his name?  Jewish doctor?  What does Cal say about all this?",
        "Karen": "Hi!  Good. Real good.  Thank you.  When did you get back?  God...  Oh, you too. Listen. I am not gonna be able to stay a real long time. I've got a meeting over at school. Drama Club meeting. We're doing \"A Thousand Clowns\" this year. You know it? Anyway. We're going so crazy trying to get it together. I am secretary this year too.  No. Oh, no, you're not hanging me up! No, I really wanted to see you. I didn't know quite what to expect, though... I mean, you sounded...uh, you sounded sort of funny on the phone.  Oh. You're swimming? Terrific, Conrad! That's... That's really wonderful.  Come on, you'll do great. I'll bet your folks are real proud of you.  Uh... I just want a coke.  You think we offended him?  So. Uh...  - Are you...                         - What did...  I can't believe how beautiful        You know what I really wanted you look.                            to...  So do you.  Miss what?  No.  Thank you.  No.  Are you seeing a doctor?  Uh... Uh, well, Dr. Crawford gave me a name, and I went for a while. But uh... I dunno.It just didn't work for me, I guess. He just kept telling me all the things I already knew, and , uh... finally, I decided... the only one who can help me is myself. At least, that's what my dad says. I don't mean it's not right for you, Conrad. I mean I think that if it's something you want to do, that's what you should be doing.  Your hair grew in.  I like it.  Yeah!  Things have to change. You know?  But that was a hospital. This is the real world.  I really have to go. I'm sorry. I have a meeting over at the school. Drama Club meeting. We're doing \"A Thousand Clowns\".  Did I?  I better hurry. Don't wanna be late.  Conrad? Let's have a great Christmas! Okay? Let's have... a great year. Let's have the best year of our whole lives, OK? We can, you know. This could be the best year ever.  Yeah!  Mmm...   Will you call me?  You mean it?  You. Uh... You look good. Conrad.  Bye.  Hey!  Would you cheer up?  Hello?  Who's calling, please?  Oh... Well, she's ...not home from school yet.  Yes. I will.  Good bye.  Hello?  She...uh... Ah!... Bill?  Hello.  Karen's...                        I called...  Karen's dead.  She killed herself.    We can. You know.",
        "Berger": "Hello?    Who?  Oh, yes! I'm with a patient now. Can you call back at two fifteen?  Then give me your number. I'll call you tonite. Hello? Hello?           Ha! Hi! Come in. It's OK,     they all do that.  Hmm.... Jarrett. How long since you've been out of the hospital?  Feeling depressed?  On stage?  People nervous... treating you like you're ...a dangerous character?  Are you?  How long were you in the hospital?  What did you do?  It doesn't say what your method was.  Oh. So how does it feel being home? Everybody's glad to see you?  Friends?   Everything...  You're back in school? Everything okay at school? Teachers?  No problems?  So why are you here?  Why?  Who's worried about you?  What about your mother? Isn't she worried about you, too?  Well, as long as you're straight.  Yes. He   called me on the phone. He told me   your name and... he told me to look   for you. And, uh... he said you had   a brother who died. A... boating   accident, wasn't it? Want to tell   me about it? Well I suppose you talked this over with Crawford at the hospital. Right?  How did that go?  Why do you want to change?  Why?  Well. I'll tell you something. I'll be straight with you, okay? I'm not big on control. But it's your money.  So to speak. Okay...  Well. Control's a tough nut.  Well. That's a problem. How do we solve that?  Well. It's up to you.  Mm-mmm.  I don't hold much stock in dreams.  Really? What's happening? What's going on?  What?  Look. Kiddo... I lied. I do believe in dreams. Only sometimes I want to know what's happening when you're awake. Come on, something's bugging you, making you nervous. You're making me nervous.  Tranquilizer?  I think you came in here looking like something out of The Body Snatchers. It's not my impression that you need a tranquilizer.  Clock.  Mmm, mmm.  Right.  Ha, ha.  Ha, ha.  Ah, ah?... Have you ever thought about quitting?  No.  Forget about how it looks! How does it feel?  Yes!  Yes! How does it feel?  Are you the same person you were last year?  That's why you need a tranquilizer?  No. It's up to you!  Not necessarily. How is it with your friends? Is it getting any easier?  Is anyplace easy?  It was? Why?  Was there anyone there you could talk to?  I mean, besides Dr. Crawford?  What do you expect from her?  Why not?  What are you thinking?  So what else is new? Does it help?  What now?  Who?  Yeah. What about him?  So much as what?  What would John Boy have said?  Come on. Come on.  Don't hold back.     So, what did your dad say about it?  How come?  Can you tell your mother?  No. Sorry's out. Come on, something's on your mind.  No, no, never mind the time. There's time. Look. Remember the contract? Control? Maybe there's some connection between control and uh... ­ what do we call it? - lack of feeling? Mmm?  When?  When?  Come on, come on, Jarrett, I thought you didn't like to fool around.  Like to play games, do you?  So?  I'll tell you what I want. I want you to leave \"I don't know\" out there on the table with the magazines. Okay?  Yeah. That would be nice. Make one up. Right now. About how there's no feelings in there.  Oh! Now you have, now you don't! Get it together, Jarrett.  Are you mad?  Oh, cut the shit! You're mad! You're mad as hell! You don't like being pushed. So why don't you do something about it!  Tell me to fuck off! I don't know.  Why not?  Why not?  Do you know how much energy it takes to hold it back?  Oh! I beg your pardon! I never promised you a rose garden...  What?  Yeah?  That's it!  What do you think?  Sounds good to me.  A little advice about feeling, kiddo... Don't expect it always to tickle.  Tuesday you felt great. You bought a Christmas tree, it was all hunky- dory. Okay?  Don't take refuge in one-liners like \"You're the doctor\". Okay? Because that pisses me off.  So everything was fine till you had the fight with your mother, then everything was lousy.  What shit have you pulled? Hey! Remember! I'm talking proportion here. Now, what shit?  Come on. You must be able to come up with at least one example. And don't give me \"I tried to kill myself\", that's old turkey. What have you done lately?  Uh, uh.  What?  What?  Well a real problem... a real problem has a real solution.  Doesn't make it any less true.  Yeah, well... that's a hell of a secret you've been keeping on yourself.  Recognize her limitations.  Oh, kiddo, no. Like she can't love you enough. Like don't blame her for not loving you more than she's able.  Ha! Now we're back to the rotten kid routine! She can't love you because you're unlovable. Where does that leave your dad? How come he loves you? You're a rottenkid, doesn't he know that?  Ho, I get it! The guy's got no taste! He loves you, but he's wrong. Look... maybe she just can't express it the way you'd like her to. Maybe she's just afraid to show you what she feels.  I mean there's someone besides your mother you've got to forgive.  Why don't you give yourself a break? Let yourself off the hook?  We'll talk about it on Thursday.  Time's up.  Come on, Con. You know the rules.  You think about it. Just think about it.    Okay.  Neither do I.  Well, you said you... thought you could shed some light on some things. What did you mean by that?  But you still feel responsible?  You think of yourself as a lucky man, then?  That sounds more like the philosophy of a drifter than a tax attorney.  What would you want to do about that?  And you see them as on ...opposite sides of this fence?  For what?  Did she give Buck much affection to ...Buck?  And you?  What I mean is, your wife's affection.  Yes.  Mm-hmm.   Very private.  Okay. Why don't we?    What's going on?  What time is it?  Where are you?  All right. Listen to me. Get to the office somehow, and I'll meet you there.  Oh, good. You're here.  Just wait, just hold on...  Just wait till we get inside...  There...     Shit. You'd think they'd assume there'd be an emergency now and then?!  Don't take it off. Just sit down.  What?  It's what?  What do you need? Tell me!  Don't try.  For what?  What did you do?  What did you do?  Point? What point? It happened!      I know that, it wasn't your fault.        And that wasn't fair, was it?      Because I got tired!  It hurts to be mad at him, doesn't it?  Bad things happen even when people are careful.  OK, so you made a mistake.  Maybe you were stronger. Did it ever occur to you that you might have been stronger?  How long you gonna punish yourself? When you gonna quit?  Why don't you?  I know.  What happened? You said something happened. What started all this?  Jesus.  No. She wasn't.  What?  And what?  What?  You saw her once and now you' want to take her on too?  No?  What?  Okay. Listen. I feel bad about it too.  You're right. It isn't fair.  Um-hmm. And what was the one wrong thing you did?    You know.     You know.     Exactly.    Now. You can live with that. Can't you?     Feelings are scary. And sometimes they're painful. And if you can't feel pain, then you're not gonna feel anything else either. You know what I'm saying?  You're here and you're alive. And don't tell me you don't feel that.  It is good. Believe me.  Because I'm your friend.  I am. Count on it.",
        "Sloan": "",
        "Calvin": "Well, did we like it?  It was funny.  Most of us shouldn't turn profile.  When?  You okay?  Mmmh. Trouble sleeping?  You're sure?  Burning the midnight oil?  Okay.  You thought about calling that doctor?  Well, the month's up. I think we should stick to the plan.  Yeah. Okay. Don't worry about it. Get some sleep. By the way, I am working on those Michigan State tickets.    \"Joey Georgella. New football coach for Trinity.\"    Con!     That's okay. Connie!  Conrad!  Here he is!  Did you sleep?  Hungry?  Yeah.  Breakfast, pal, remember? Main meal. Energy!  Wait a minute, Beth, Hang on. He's gonna eat it. Come on. It's French toast.  What are you doing? What are you doing?  You have to charm Mr. Herman. Did you charm him? You have to eat, Con. We just want you keep on getting stronger.  Are you okay?  Oh. Is he? Great!  Well. I don't see the old gang much anymore. I miss them. Bring them around... Phil, Don, and Dick Van Buren. We'll play some touch football on the lawn.  Con!  Well. Regionally.  I mean.. it's tragic. Really. Look at him now. He's lost everything.  It's not too dry.  What happened to little Harry?  That girl from the hospital, the one you painted with, she was from Skokie, wasn't she?  What was her name?  Sharon?  Karen.    I saw Mort Swain. His sister died.  The one with the restaurant.  I guess so. Why?  I don't know. Maybe she died in Idaho. Maybe Kansas City.  Berger?  Did you?  Good! You didn't say anything. Good!  When?  How did it go?    Ah, it's okay. And it is necessary. What did you talk about?  What about your schedule? Will that be all right?  Mmm?  Maybe we shouldn't plan to go away right now.  Yeah. I know we talked about it, but the more I talk about it, the more the timing doesn't seem right.  I know.  He's just started with this doctor.  No. If he doesn't go through with this now, he might change his mind.  You talked to him about it? Does he want to go to London?  Who's gonna be there?  Why don't we just go to the movies instead?  That's not negative. That's unpredictable. Come on. Let's really go to the movies.  Really?  Beth wanted to go to the movies?  Hey. Partner. How are you?  Why?  Where is he going?  Jesus.  Hi. Annie. What's your boy up to these days?  He's great. Just great.  Oh!  No, no. No. No. He's...  There's a doctor in Highland Park... that he sees a couple of times a week. That kinda cuts into his social life.  He's great. Just great.  Oh, no, no. Nothing like that. No, no, just somebody to talk to... that's all. Kind of polish off the rough edges, that's all.  (Mimicking \"Mr.  Hey?  I'm not drunk.  I dunno. Why not?  Come on, for most people, it's a status symbol, right up there with going to Europe.  I did not think it was that...  Whose privacy?  Oh, I'm sorry. That's my fault. I just can never seem to tell anybody that they're not making it.  What?  Oh, I'm sorry.  Huh?  Connie's all right. He is. He's okay.  I'm not on the rack about him.  I can't argue with \"Who knows.\"  Thanks.  Hang on!  Wait, hang on! Whose sweater is it?  That's fair!  Conrad! Conrad!  That's good.  Connie. I want one of Connie and his mother.  Connie, move in a little closer to your mother. Okay... prize winner...  Portrait...  Page one, Lake Forrester...  Shoot, I didn't cock it.  Hold it. Connie, smile!  Just a second, smile!  No, I didn't get it yet , Beth.  I want a really good picture of the two of you, OK?  Not until I get a picture of the two of you.  I didn't see you there. What do you think?  Rawlins used to have such great Scotch pines. And they all look like skeletons this year.  What's wrong?  Hear what?  What?  Quit? When? Where have you been every night?  Why didn't you tell us, Connie?  What do you mean? Why wouldn't it matter? Of course it matters. And...  What was meant for you?  Connie! Now, Connie! Connie!...  Connie!...  Just stop it, Connie! ...  How   do you know she never came? You   know she came but she had the flu   and couldn't come inside, but she   came.  That's enough! That is enough!  What in hell has happened?  Somebody better go up there.  I am not going to apologize...  I am not apologizing. I'm trying to goddamn understand him!  Beth. Let's not fight. Okay? No fighting. Okay? Please. Let's go upstairs.  I want to talk to you.  In a minute...  I'm not mad ! I'm just trying to figure out what happened down there.  Why don't you tell her?  Why not?  She was upset, Conrad. Your mother was hurt because you quit the swim team. I don't understand it myself.  What then? Explain it to me.  What things?  What things? Please, I want you to tell me.  Your mother doesn't hate you, Conrad?  What about this Dr. Berger? Do you think he's helping you?  I'll be downstairs if you need me.   See you later.    In the car, I was thinking: \"be clear.\". I suppose that's what psychiatry's about. Being precise and clear. And honest, of course. I'll level with you. I'm not a great believer in psychiatry.  I know what happens here is only between you and him, and...I like that, I respect that. And...he's better, I can see that. I am not trying to put you down, I just don't believe in psychiatry as a panacea for everybody.  I wish I knew what the hell I was doing here.  I don't know actually, I'm not sure, I think I meant in terms of Conrad. You see, I knew something was wrong even before he tried to... to kill himself. But I thought that... It's clear that he's very smart. He's been an \"A\" student ever since he started school, and naturally I thought that ...intelligent people could work out their own problems.  Yeah, sure I do. It's hard not to. It was luck. It was just luck that I happened to be there when he tried it. I could have been at a meeting. We both could've been away. It was luck!  No! No. No. I used to. I used to think... that I was a lucky person... before... the \"accident\". Mmm, I guess the whole of life is nothing but an accident, is it? What happens to you. I should do with it.  Yeah. Maybe, maybe I am drifting a little. I can see myself, ...and I can see the two of them drifting away from me, and I just stand there watching.  Something. I gotta do something about it. I don't know what.  I feel like I'm sitting on a fence, and I don't like it.  Yeah... No. I don't know. I see her not being able to forgive him.  Oh, I don't know exactly. Being too much like her. People always think that she and Buck are... were ...were alike. But it's really she and Conrad. They were the only two that didn't cry at the funeral, you know? It's not easy for me to admit this but, uh... she didn't... His mother doesn't show him a great deal of affection. I'm not trying to put her down in any way at all. She is a wonderful woman, huh...  Oh, god, yes, she loved Buck! Bucky got so much... I think what she felt for him was special. You know, he was her first-born. That's not unusual, is it?  Me?    I   loved Buck.  For me you mean?  Mmm. She's very... No. There's no problem with her for me. We've been... We've been married nearly twenty one years. Everybody loves Beth. But, huh... for Conrad, - it's been difficult. He didn't talk about that? We don't know what happens here. It doesn't come up. I guess that's what it is. It's private here. Isn't it?  I think I know why I came here. I think I came here to talk about myself.  This will sound strange.  Could we talk about Buck's funeral?  I know it'll seem trivial, but it's on my mind, or has been, and I'd just like to talk about it.  When I was getting dressed for Buck's funeral, I was...  Just let me get it off my chest,OK?  I was wearing a blue shirt. And you said: - Wear a white shirt and the other shoes! It was nothing at the time. But it's always seemed to stay with me. And I, for some reason, been thinking about it and it suddenly occured to me what difference did it make what I wore at Buck's funeral?  Just hear me out, Beth! It won't hurt you to listen!  I just want to talk about something I always remembered.  Because I've always wondered, in some needling way, what it mattered what I wore. I was crazy that day. We were going to our son's funeral. And you were worried about what I wore on my feet. I'm sure it sounds like nothing to you, but it sticks with me and I just wanted to ...tell you about it.  I don't think so. I think we should go see him, Beth. - Dr. Berger.  I think we could all go and see him together.  He thinks it's a good idea.  Exactly. That's the point. Wouldn't it be easier if we all talked about it? In the open.  Darling, that is what this is for. Maybe you'll get a surprise.  I am not asking you to be perfect, you're missing the point.  Huh, no... Could you give me a couple of minutes, please?  I do too. I want all of them to be nice Christmases  Okay.   Okay.  I love you, too.  Seven.  I'll never get over how flat it is here. I'll never get over...  Airplane scotch.  Boy, oh, boy.  Oh, these holes sure do love you. Oh boy, oh boy.  Pinehurst would be nice. I think Connie would like Pinehurst.  Well, you said \"vacation\", so I just assumed you meant him too.  I was gonna call him tonight.    What you started.  What you started.  I think there is a point.  He isn't the problem.  No, he isn't. Let's talk about what's really bothering you.  Jesus, what have I done to make you so angry with me?  Can't you see anything except in terms of how it affects you?  Well, stop being so godamn honest, and start being a little generous! And start thinking about him for a while!  Well, I'll tell you what he expects!  All he wants... All he wants is to know you don't hate him. That's it.  I just try to keep this family together...  It's pretty early. You tired?  I hope your grandmother wasn't too tough on you?  I don't...  You are beautiful. And you are unpredictable. But you're so cautious. You're determined, Beth. But you know something? You're not strong. And I don't know if you're really giving. Beth is looking at him not knowing what this is about.  Tell me something. Do you love me? Do you really love me?  We would've been all right, if there hadn't been any ...mess. But you can't handle mess. You need everything neat and ...easy. I don't know. Maybe you can't love anybody. It was so much Buck. And Buck died, it was as if you buried all your love with him, and I don't understand that. I just don't know.  Maybe it wasn't even Buck. Maybe it was just you. Maybe, finally, it was the best of you that you buried.  But whatever it was, I don't know who you are. I don't know what we've been playing at. So I was crying.  't know if I love you anymore. And I don't know what I am going to do without that.  The yard looks smaller without leaves.  Your mother's going away for a while.  Back to Houston. Then I... I don't know.  No.  Don't do that! Don't do that to yourself! It's nobody's fault! Things happen in this world, people don't always have answers for them, you know.  I don't know why I'm yelling at you for...  Oh, yeah?  Oh, he needed it. You didn't. You were always so hard on yourself, I never had the heart.  No, it's the truth. I... I never worried about you. I just wasn't listening.  No, no, no, I should ...I should've got a handle on it somehow.  Well, don't admire people too much. They'll disappoint you sometimes.  I love you too.",
        "Stillman": "Uh, we're late `cause little Dickie's mom had to pack his lunch.  That guy wants a goddamn personal analysis of it all. How do you make sense of that crap, anyway?  Yeah. Right! We swim our ass everyday, when are we supposed to study, uh?.  Get a sense of reality, Lazenby. What you reading?  Meditation?    Hey, hey, hey! Hey, there's Pratt.  Let me out, I need a jump.  Hey. Interested in something. Jarrett?  Everybody drives you nuts.  Don and Fenetch look good, don't you think, Jarrett?  Yeah, Van Buren wants a clarinet.  You need a new personality.  Ooh! Ohh!  I told you. The guy's a flake.  Let's face it, we stunk. I don't know how you can listen to that lecture on Buck Jarrett one more time. I know he is the world's greatest swimmer, but it bugs the hell outa me when he does that.  Think he's ever gonna stop kissing the guy's picture?  How's it going, Jarrett? I hear you got eyes for Pratt these days. You in her pants yet?  You're the prick. Guys like you walk around like you're king shit. You give me a goddamn pain in the ass, you think we owe you...  Let go! Let go!  You're crazy! You're crazy! You know that?  Send him back where he came from!  All right!     Shit!",
        "Jeannine": "You guys don't want a clarinet, do you?  My brother. He needs a motorcycle.    You have a lot of energy.  Yeah. I mean, That's good. My name's Jeannine Pratt.  You're Conrad Jarrett, remember?  Bye-bye.  Mmm mm mmm, Mmm mm mmm, Mmm mmm Mmm mm mmm.  You are really a terrific tenor.  In fact. You should be doing the solo in that Russian thing.  No. I'm serious. You really sing well. I'm getting to know your voice.  Yeah!  Well... I don't always sing. Sometimes I just listen.  For instance, Marcia Blair can't sing a note.  Janet Fox only mouths the words and never sings.  Yeah...  Do you like Vivaldi?  Telemann?  What kind of music do you like?  Spoon on a ...glass?  Oh, you mean like ...tablespoon? Oh, dear! Why do I ask dumb questions? I'm just showing off. Why is it so hard... the first time you talk to somebody?  Really?  Oh, that's my bus, I got to go!  I'll see you later! And you're really a terrific tenor!  Hello?  Oh... Oh. Hi!  You mean, with you? Like on a date?  That was dumb. Forget it. Just forget it. Now start over.  )        Conrad?  I don't bowl. I mean, I'm a horrible bowler.  Yeah. Well...  I got it. That's OK. Thing is, I'm a funny bowler.  On a scale from one to ten?   ... About a ten.  Guarantee it?  Can you ever break the ball?  Hmm? What?  Catchy!  Mmm, mmm.  Do you think people are punished for the things they do?  Yeah.  Not at all?  I believe in God.  I've done a lot of things I'm ashamed of.  Did it hurt?  You don't want to talk about it?  Why did you do it?  What are you doing?  Energetic. Those guys.  No...  No. I...  I'm sorry, I...  Anyway...  Do you want to talk?  Are you okay?  Will you? I want you to.  Well...   Guess I'll see you in choir.  Okay.  Good night.     Might have been easier...  Conrad. I was stupid. That was dumb of me to laugh and it was my fault. I just didn't know what to do. I was embarrassed.  Yes. When those boys came in, it was awful and awkward. That's what I do when I get embarrassed. I laugh.  Yes.  Yes.  No, not on Sunday.  Have you eaten?  Do you want some breakfast?  Mom!",
        "Conrad": "Yeah?  Mmm, mm. Yeah. How was the show?  No.  Mm-hmm.  Yeah.  No.  The plan was if I needed to call him.  Okay.             I'll be right there!  Morning.  Morning.  Yeah.    Uh... I'm not really hungry.  Dad, I'm not hungry.  Yeah. I got to go. Lazenby's picking me up.  Why is it great?  See you later.  Hardy.  Uh...  I don't... Uh...Powerless? I guess he thought he was, yeah.  Hello.  Uh, Dr. Berger?  Hi. This is Conrad Jarrett calling.  Conrad Jarrett! Dr. Crawford at Hillsboro Hospital gave me your number... and...  I don't think I'll be free.  Uh, that's OK, I'll try to call you back. Thanks.  Uh, uh.  Karen.  Karen!  I haven't played in a year.  Lift the rope off Bucky!    Bucky!  Fuck! Fuck! Ha...  Oh, hi. How are you? /.../ Oh. I'm fine /.../ Couldn't be better, really. Oh, terrific, yeah.  Not yet.  A month and a half.  No.  Pardon me?  Yeah. I guess a little.  I don't know.  Four months.  I tried to off myself. Isn't it down there?  Double-edged Super Blue.  Yeah.  Yeah.  Yeah.  Yeah.  Yeah.  Uh-uh.  Uh... I'd like to be more in control, I guess.  So people can quit worrying about me.  My father, mostly. This is his idea.  I don't know, listen. You... You're a friend of Dr Crawford, so you're probably all right, but I'll be straight with you, I don't like this already.  What do you know about me?   Have you talked to Crawford?  Right.  It didn't change anything.  I told you, I'd like to be more in control.  I told you, so people can quit worrying about me.  So to speak.  Twice...   a week?  I've got swim practice every night.  Guess I'll have to skip practice twice a week, and come here.  I don't like being here. I got to tell you I don't like being here at all.  I went to see Dr. Berger.  Yeah.  Yeah.  I went.  Today.  If it's too much money, I don't have to go. It's not necessary...  Well it's 50 $ an hour. Twice a week.  Not much.  Well, it'll cut into swim practice.  Highland Park.  Yeah.  Fun?  Yeah. I guess so.  No. No, sir.  Yeah.  Yeah. You asked me. Yeah, they did.  They look very good.  Oh? I do? You do? Is that you?  I do?  Nice. Hi!  Right. Hum. Yeah. Um. Bye.  Oh, I'm sorry.  I'm sorry, I...  I'm sorry, I just got in. I didn't... I didn't know you were here.  How's your golf game?  Oh...   It did get colder today.  Yeah.  Uh-huh. Sorry I scared you.  Good. I swam well, today.  Yeah. Personaly I think I could swim the 50 if my timing got...  ...my timing got better. I'm a just a little...   a little off with my... my timing.  Yeah. Oh, I got seventy four on a trig quiz.  Oh? Did you...? You took Trig?  So what do I do... tell you my dreams?  What kind of a psychiatrist are you? They all believe in dreams.  I just feel... I feel so...  Jumpy. I don't know.  Maybe I need a tranquilizer.  Yeah.  What is this?  Oh, I see. So you get to tell the time, but I can't. Is that it?  So you know when the hour's up?  Fifty minutes, fifty five minutes? What is it?  Maybe... Maybe I don't want to swim anymore. You know, I mean my timing is for shit. You know, he's got two guys that swim the fifty, they're better than me, and...  They're a bunch of boring ass jocks.  And him... I can't stand him. He's a tight ass son of a bitch!  Are you telling me to?  It wouldn't look good.  How does it feel? How does it feel?  How does it feel?!  It's the same thing that happened last year... It's the same damn thing I did last year.  I don't know!  You tell me!  Fifty bucks an hour, can't you decide if I should have a pill or not? I mean, you're a doctor, I'm supposed to feel better! Right?  No. It's still hard.  The hospital was.  Because nobody hid anything there.  Uh-huh.  Uh-huh.  Whoa!  Hey, Karen! Hi! How are you?  Sit down. Please.  Wow.  Uh... The end of August.  It's great to see you.  Don't let me hang you up.    We haven't had any meets yet. I could end up on the bench all year, but...  Yeah, yeah.  You're hungry, at all?  Uh...   two cokes, please.  Something I said? Definitely a low self-image day.  - Are you...                         - What did...  I can't believe how beautiful        You know what I really wanted you look.                            to...  You really look beautiful.  Do you miss it?  The hospital.  You don't miss it? At all? Nothing? Nothing about it?  You don't miss Leo's corny jokes?  Yeah. I'm seeing a doctor. Are you?  Well, ya, I don't know how long I'll keep it up. I sorta got shoved into it.  Oh, yes. That was such a dumb thing to do.  You do?  I don't know, I just... Uh... I miss it sometimes, the hospital. Really do.  But that's where we had the laughs.  Yeah, yeah, I... you're sure right.  I know, you told me.  Yeah.  Thanks for seeing me.  Yeah... Yeah.  Yeah...  Yep!  Yeah.  Bye-bye.  Do I need one?  Nothing. Thinking.  Not about anything.  I was thinking about the pigeon... You know the one that used to hang around the garage. How it used to get on top of your car, and he take off when you pulled out of the driveway.  Yeah. That was the closest we ever came to having a pet. You remember Buck asked you, he tried to talk you into... getting a dog. Do you remember that? He said. \"How about it, if it's the size of a little football?\"  Pippin. Pippin. Pippin!  - What he really wanted was a      - Everytime time that dog retriever. It was down the         comes into this backyard, I street for sale. That's what       try to get him out... he wanted. A retriever.    Can I help?  I will.  Mom...  We just don't connect.  I don't know. We just don't.  That I jack off a lot.  For a minute.  John Boy.  You know, in \"The Waltons\". John Boy?  My father came into my room and he didn't know what to say. This is right after Buck died. And he came over and sat on the bed next to me, put his arm around my shoulder. We just sat there. I remember I was watching his shoe. And thinking... Cos his shoe was turned over on its side. I was thinking: \"He's so uptight, it's gonna crack off.\"  And I knew I should have felt something. But I didn't know what to feel. I kept thinking what they say on TV, you know, stuff like:  \"Oh, no, noo! Ooh, My god!\" But I didn't say that... because I didn't feel sad... so much as...  I dunno. I kept thinking that John Boy would've said something...about the way he felt, you know. Something.  I don't know.  Come on what?  Give me back my sweater! Come on, it's my sweater!  Give it to me!  It's my sweater!  All right.  I'm not asking you for anything.  Nothing.  I don't think that ...that quitting swimming will mess up my life. I... I really don't.  Yeah.  Uh, uh.  Okay!  I won't ask you to    ...sir.  Yeah.  Yeah.  I don't know. I felt like it was a bore.  Well, that's the way it is.  Nothing.  Nothing.  Nothing. Swimming's a bore. That's all.  Well, quit talking to people! Okay?  I haven't told him yet.  I don't know. The timing isn't right, you know. He sweats everything so much, he'll just get worried about it.  My mother? My mother and I don't connect. Don't you listen? I told you that.  What do people have in common with mothers anyway? It's all surface junk. You know: \"Clean your room, brush your teeth, get good grades, nah, nah, nah, veh...\" Hey, look, I'm just wasting money today. I am not gonna feel anything. I'm sorry.  What time is it?  I said I feel things.  Ah, God... Come on.  Sometimes. I don't know.  I don't? I'm not.  I don't!  What do you want?  Yeah, and if I don't have an answer you want me to make one up?  I said I have feelings.  Why you hassle me? Why are you trying to make me mad?  No!  What?  Well, fuck off! No. No, I can't, I can't do this.  I can't...  I can't do this. It takes too much energy to get mad!  When I let myself feel low, I feel as lousy.  Fuck you. Berger!  Fuck you.  Fuck you!  Jesus, you're really weird! What about you? What do you feel, huh? Do you jack off or jerk off? Whatever you call it?    Ah! Ha!   Ha...  Dad, give her the camera.    Oh...  Ha, no. I...  Yeah?  How can you hear me sing if you're singing?  Oh?  Uh, uh...  Ha, ha?   Ha, a detective?  Uh...  Telemann? Um...  Oh. Uh... Modern jazz. I like. Folk rock. Spoon on a glass.  Mmmm. You make it look easy.    Alleluia!    Alleluia!  Alleluia! Ah ha, ha, ha, ha, ha, ha, ha. Ha, ha, ha, ha, ha, ha, ha, ha, ha, alleluia! Alleluia! Alleluia, Alleluia! Alleluia! Alleluia! Alleluia! Alleluia!     Alleluia!  Hello. Is Karen there?  It's a friend of hers from Hillsboro?  Oh. Um...Hmm. Just tell her I called. This is Conrad. Calling. Just tell her I called and I'm feeling great, and I just wanted to talk to her.  OK. Thank you.  All right  Hello. Jeannine. This is Conrad. Hello. Jeannine, this is Conrad. Hello. Jeannine. This is Conrad. Conrad. Conrad? What a dumb name. Hello. Jeannine. This is Bill. Uuuuurgh!  Hello. This is... Hello, this is Conrad calling. Jarrett?  Hi. Listen. I was... I was wondering if maybe you'd like...to go out sometime?  Well, yeah, we wouldn't have to call it a real date. We could fake it sort of, to see how it goes..  Hi, this is Conrad Jarrett...  Hi. What do you think?  Dad, I quit the swim team.  Nowhere. Around. The library mostly.  I don't know, I didn't think it mattered.  Don't you have that backwards?  I didn't lie!  Well don't then! Go to Europe!  Cos the only reason she cares, the only reason she gives a fuck about it...  ...is because someone else knew about it first!  No! You tell her to stop it! You never tell her a godamn thing! And I know why she never came to the hospital, she's busy going to goddamn Spain and... goddamn Portugal! Why should she care if I'm hung up by the balls out there?  You never came to the hospital!  Yeah! She wouldn't have had any flu if Buck was in the hospital! She would have come if Buck was in the hospital!     I need to sleep.  I didn't mean it. I didn't mean any of it. I am sorry. Please don't be mad.  I don't know what happened! I am sorry about it all. I am sorry about the whole thing. What I said, I didn't mean it. Just please tell her. Tell her I'm sorry, will you?  Oh, God, no, I can't! Don't you see? I can't talk to her!  Ha! Because it doesn't change anything. It doesn't change the way she looks at me.  I don't mean just now. Don't you see? I don't mean just today.  Ha! I can't! Everything is German pudding with you , dad. You don't see things!  That she hates me! Can't you see that?  All right, all right. You're right. She doesn't. Please leave me alone, now.  Don't blame it on Burger, it's not his fault!  You're the doctor.  Okay. Okay.  Yeah, but I don't blame her. I mean, she's got... She's got her reasons. It's impossible after all the shit I've pulled!  Lately?  Hey, come on, if you... Listen, I'm never gonna be forgiven for that. Never! You know, you can't get it out, you know, all the blood in her towels, in her rug. Everything had to be pitched. Even the tiles in the bathroom had to be regrouted. Christ, she fired the godamn maid because she couldn't dust the living room right. If you think I'm gonna forgive... - that she's gonna forgive me...  I think I just figured something out.  Who it is who can't forgive who...  I've heard this all before.  I'm so tired.  So what do I do now?  You mean, like she can't love me?  But she loves my father. I know she loved my brother. It's me!  That's different. He feels responsible. Besides, he loves everybody.  What do you mean?  You mean me?  For trying to off myself? Don't you sit there and stare at me. What for?  What did I do?  What did I do?  Come on!  What do you mean? You're gonna pull the plug... Come on! What did I do?  Rules? What rules? Can't I have a few minutes?  Jesus!        Hmm?  Oh, that's all right.  Well, listen. We don't have to go bowling if you'd rather not, I'm not a bowling nut or anything. How funny are you?  Hoo, that's pretty funny. Hey, well, listen, I promise you won't look silly.  Guarantee it.  Can't break the ball, can't break the floor, can't break anything in a bowling alley. And that's what I like about bowling alleys. Can't even break the record.  Anyway...  Just \"anyway\", it's a conversation starter.  You like it?  I thought it'd get to you. I've been working on it all day.  You mean by God?  Mmm, I don't believe in God.  No. Well, it's not a question of degree. Either you do or you don't.  So you're afraid he'll punish you for something you did?  Yeah? So have I.  No, I dunno, I don't remember really.  Ah, I don't know... I've never really talked about it. To doctors, but not to anyone else. You're the first who's asked.  Uh... I don't know. It was like... falling into a hole. It was like falling into a hole, and it keeps getting bigger and bigger, .and you can't get out, and then, .all of a sudden, it's inside...and you're the hole, and you're trapped, and it's all over. Something like that. And it's not really scary, except it is when you think back on it. 'Cause you know what you were feeling stange and new...    What? You thought they were funny?  What for?  About what?  Yeah. Yeah, I'm fine. Uh... I'll give you a call.  Sure.  Okay. Yeah. Thanks.  I mean. Good night. Good night.  Oh. No. Thanks.  Oh, no, I don't think so.  Hey, do me a favor, Stillman, try not to be such a prick.  So?  So I look stupid, is that it?  I can't help it, it hurts too much to be around you. I gotta go.     Hello. Is Karen there?  Yes, hello. Is Karen there? This is Conrad Jarrett, calling. I'm a friend of hers.  Karen's...                        I called...  What? What?  Ha!  Get the sail down! Get it down!  Get the sail down! Get it down!  I am trying! I can't! Let it out!  Let it out!  I can't!  Ahh!  Aaah!  Bucky!  Here!  It ain't so goddamned funny!  I won't, honest to God!  Stay with me! Stay with me! Stay with me! Bucky! Where are you?  Bucky!  Bucky!  Buck!  Buck!  This is Conrad!  I need to see you!  I don't know!  I...    I   don't know!  Okay.  Something happened...  I need...     I need...  Something happened!  It's...  Oh. God! I need something.  It just keeps coming! I can't... I can't make it stop!  I gotta... I gotta... I gotta get off the hook for it. I gotta get off the hook!  For what I did!  What I did to him!  It's something... It's something... Don't you see? It's gotta be somebody's fault or there's no godamm point!  No, no... Oh, no. I don't mean that. It's that... It's just that... Buck, Bucky, I didn't mean it!  Bucky, I didn't mean it!  Bucky!  But it was: you said. \"Get the sail down!\" ...  ...and I couldn't!  I couldn't! It jammed! And then the halyard, the halyard jammed! I couldn't because the godamn halyard jammed! And then you're sittin' here, you're screwing around...  ...until it's too late to do anything! And I'm supposed to take care of it!  And I'm supposed to take care of it!  No! And then you say ...    ...\"Hang on!\", and then you let go!  Why'd you let go?  Yeah? Well. Screw you, you jerk!  Yeah. He just wasn't careful. He just wouldn't care. He didn't see how a bad thing might happen.  We were screwing around out there, we should've come in when it started to look bad.  Why did he let go? Why?  Oh, God, I'd like to quit.  It's not easy. It's not that easy. God... I loved him.  Ka-ren. She killed herself! I just found out she's dead.  And she was fine, she was OK.  She was! She was! She told me! She said she was...  She was busy, she was feeling good and she...  I just wish I'd known...I could've done something.  No!  No. I just...  That isn't it. I... I feel bad about this, I feel really bad about this. And just let me feel bad about this!  Why do things have to happen to people? It isn't fair.  You just do one wrong thing... and...      Haaa...    I hung on.     I stayed with the boat.      I'm scared! I'm scared.  I think so.  It doesn't feel good.  How do you know?  I don't know what I would've done...if you hadn't been here. You're really my friend?  Hi. I was gonna call but I didn't want to wake anyone.  Listen, I want to say something about the other night. I mean I liked being with you but I didn't like myself.  Really?   You were embarrassed?  But they were all right. They were just up and they were having a good time, and I let them get in the way of what was happening. It was dumb. It was dumb. I've been doing lots of dumb things lately. I just didn't know wether or not you were being straight with me.  Yeah?  Anyway, I'd like to try it again. I thought it worked out okay. Well, except for the bowling.  Yes?  Uh...   Are you going to school?  No. I haven't.  Okay.  I think I'm gonna turn in. Dinner was good. Really good.  Yeah. It was kind of a rough week.  No. She was fine. I'm glad you're back.  Good night.     Dad?  Dad? What happened?  Where?   Why?  Why? What... I know why.   It's me. Isn't it?  Yeah, it is. It's my fault.  No, that's right! You're right! You ought to do that more often.  Yeah, yeah, Haul my ass a little, you know. Get after me. The way you used to for him.  Oh, Dad. Don't.  Well, I wasn't putting out many signals then. I don't think you could have done anything.  You know, I used to figure you had a handle for everything. You knew it all.  I know that wasn't fair but you always made us feel like everything was gonna be all right. I thought about that a lot lately. I really admire you for it.  I'm not disappointed. I love you.",
        "Joe": "The guy was a real jerk. He was hung up on what was the moral thing to do. It didn't make any sense.",
        "Ruth": ""
    },
    "imdb_rating": "7.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNWU3MDFkYWQtMWQ5YS00YTcwLThmNDItODY4OWE2ZTdhZmIwXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_QL75_UX380_CR0,5,380,562_.jpg",
    "description": "Beth, Calvin, and their son Conrad are living in the aftermath of the death of the other son. Conrad is overcome by grief and misplaced guilt to the extent of a suicide attempt. He is in therapy. Beth had always preferred his brother and is having difficulty being supportive to Conrad. Calvin is trapped between the two trying to hold the family together.—John Vogel <jlvogel@comcast.net>",
    "name": "Ordinary People",
    "genres": [
        "Drama"
    ]
}