{
    "filename": "Pandorum_script.txt",
    "imdb_id": "tt1188729",
    "imdb_url": "https://www.imdb.com/title/tt1188729",
    "characters": [
        "Evalon",
        "Childhunter (as Luna Mohmand)",
        "Young Bower's Mother",
        "Nadia",
        "Payton",
        "Young Bower",
        "Wounded Officer 'Eden'",
        "Gallo",
        "Hunter Leader (as André M. Hennicke)",
        "Leland",
        "Insane Officer 'Eden' (as Niels Bruno Schmidt)",
        "Shepard",
        "Manh",
        "Bower",
        "Young Bower's Father"
    ],
    "dialogues": {
        "Evalon": "",
        "Nadia": "Keine Bewegung!     Don't you move MOTHER FUCKER! She quickly pats him down, stealing tools. All he can see is her bare feet, blackened from oil. He frowns to see her toe- nails painted with bright pink polish. NADIA, a torn jump suit, snarled hair hiding her face, skin smeared with oil. A beautiful woman underneath an apocalyptic smear of grunge. Her hair is pure white, high- lighted with smears of oil.    Take them off!  SHOES! I'll gut your ass-           You're... part of the flight crew?  I didn't think there was any flight crew left. What's happened to us?  Gee, you think? Where are you going?  You just wake up?  You'll never make it.  You're going the wrong direction. She grimaces and turns, heading back up the corridor. BOWER and TANAKA exchange a look. BOWER chases after her.  Nobody.  Team? Why would I want to join?  To the reactor? No thanks. Don't like going that fax down. No one ever comes back. She continues up the corridor and BOWER grabs her arm. She yanks away from his touch, squaring off, weapon in hand.  Do you know where this ship is headed?  Can you fly it?  Can you fly it... if you have to?  Don't know. There's no way to tell time in here. Two... maybe three months.  Quiet! You wanna get us killed!?  Longer. I wasn't the first one up. 59.  i Shush! We're waiting.  Quiet! At the far end of the corridor, a faint BLUISH GLOW grows stronger. Shadows are moving, growing closer.  Ssssht! The HISS and CACKLES of the HUNTERS grow closer and it seems they're shortly going to be cornered and done for until... A SHUDDER is felt, a FLICKER of LIGHTS approaching. She goes to a control panel, holds down a switch and presses her palm F across a scanner. As the power SURGE passes, the control panel activates, scanning her hand and the steel door activates with a MOAN of hydraulics. BOWER notices her ID tattoo; BIO-T&gt;&gt;218&gt;&gt;076. 60.   Never quite felt like sticking around to find out. Running... is always the best option. Believe me.  Ecological Development, Embryonic Charter. Livestock and wildlife re- population. The rows of glass tubes are labelled, ranging from mountain goats to octopi, everything a new world would need. 61.   You couldn't remember?  It comes only in pieces. Even after a few months. I know everything about this vault and its systems... but I still can't remember where I grew up. Or my brother's name. Only pieces... And the training comes back first. For good reason, I guess. BOWER eyes the darkened computer terminals, portions of the consoles coated in algae. 62.  Dehydrated meatloaf. House special. I save 'em for the weekends. BOWER sniffs it with a sneer and tries to break off a piece... hard as a rock.  Do you know how long it would take to turn dehydrated meatloaf into that?  I don't know, but it takes more then a couple years to turn coal into fucking diamonds.  This ship was built to outlast our children's children... and any engineer could tell ya the warranty is running out. I think we've been asleep longer then you may think. BOWER tosses the orange brick. to TANAKA and he sniffs it with a grin, breaking off a piece. NADIA finishes gathering tools and she slings the bag over her shoulder, \"ready to go\".   Who the hell is there to call? 63.  We can't get through this way.  It's the safest way to travel. And there's only one other way to get through that I know of.  Main corridor. Hyper-sleep chamber, Personnel. Keep your light down.  Keep quiet.  Keep moving.  What does she do? What's her specialty?  Then she's not in here. This is development settlers. Engineers. NADIA quickly continues as BOWER tries to keep up.     We have to keep moving. We don't want to stay out in the open for too long. Especially in here.  We can't stay herel NADIA heads across the main floor and BOWER tries to wave him on, but TANAKA is locked onto something, refusing to waver.  Then you wait... and find your own way. 56.  I told you I'm not going to wait. I'm not gonna get myself killed for-  What do you think he's doing in there!?  He's hunting! Bagging the next notch on his belt. You wait for him! Good luck. I NADIA quickly heads deeper into the room and down a darkened and narrowing tunnel. BOWER hesitates with frustration. Having to choose, he turns and chases after NADIA. I They crawl through a maze of machinery and NADIA'S pace is difficult for BOWER to keep up.                Run.  Run! 71.  Shut-up! They listen for a long moment... hearing nothing as BOWER looks at his hand, finger tips trembling.  You want to go back?  We should go back. Find a different path. I don't think we can get through to the reactor bay from-  I'm ready to explore other options-  You really want to discuss it here!? A RUMBLE is heard approaching and they all crouch in unison. It's a power surge that sends FLICKERING LIGHTS across the massive corridor and a BLINKING LIGHT is activated on a nearby sleep-chamber. And then... BANG! The hatch door is KICKED from the inside, white gas erupting from the seam. Our gang quickly crawls toward the shadows, crouching behind equipment to watch as... Another KICK bursts open the hatch and a BIG PASSENGER crawls out, slamming onto the floor with a shiver of agony, gasping for breath, muscles twitching.  What are you doing-!?  We gotta find a way out.  I was trying to get us out of there alive-  I was trying to save our asses-  I didn't need to help you at all! You and the Hong-Kong Express would still be playing ding-dong-ditch on level eight if it weren't for me! Their heightening confrontation is halted by...  I don't know. Gotta be somewhere below B- deck.  No. That's... not possible.  Or something that was already on board, with us in the hyper-bunks.  It's the only theory I can come up with. The synthetic enzyme in our feeding tubes. The accelerator that would help our bodies adjust and adapt to the environmental conditions on Tanis. From what I've seen... these things have adapted... to the ship instead.  I don't know. Like I said, it's the only theory I can think of- Unless... 85.  Could that be real? You think that could-  He was- He was gonna fucking eat me!  He gassed us! He was gonna- All of us! LELAND is appalled, spitting out the breathing tube.  What is that?  What does that mean?  Done!? What do you mean done? What do we do? Hey!?  What are you talking about? You said you could reset the reactor- That we could- That there's a chance to-  We weren't meant to go back! We were meant to go on. And now it's more important then ever! We're the last of-  What about your duty? What about... your wife!? There's still a chance she's-  You don't know that for sure!       stop it! STOP IT! Are you crazy? It's just a child!  My God. They're... breeding.  There's no where to turn back to. We can't give up-  You didn't tell us anything. You never said that. You said you'd love to come-  What are you doing? What is it?    You think she's... here?  How do you know for sure? She could be-  Well, then... she saved your life. BOWER frowns on the thought, slowly nodding in agreement. His eyes look to the label of the chamber he was led to, the label reads; M. PAYTON. He mumbles to himself, memory returning.  you... knew her?  Who's... Payton?  Hurry! Go! BOWER turns back to the panel, flipping more switches and continuing the process as the reactor begins to HUM as...  Bower...?     You snake bastard- OPEN IT!  Where's... your lieutenant?     NO!? Are you crazy-     I What are you doing!?  No! I can't- Not like this! I'm not going to wake up and drowned-",
        "Payton": "Who are you?     Corporal?  corporal... Bower.  Wanna get that fucking light out of my eyes, pal?  Where... are we?     Where's the... rest of the crew? It's our shift? Our rotation-  Aren't they suppose to be here... to wake us?  Hit the lights, will ya?  Who woke you up?  Cold in here. BOWER grabs him a towel and water container, turning back to see PAYTON doesn't waste any time, stretching his limbs.  Bower .  Until I have two coffees you're just gonna have to repeat all this shit, so let's just idle here for a bit.  Coffee?  Good man. BOWER helps him to the locker room as LIGHTS FLICKER past.  How do you know that?  Very reassuring. I guess when you gamma the brain into extended REM, sometimes it can take a while to get it back. PAYTON pulls on his flight uniform and squeezes his feet into his shoes. BOWER notices the identification tattoo on his forearm, partially obscured from view; FLT&gt;&gt;00... . Unlike his own, PAYTON'S tattoo is faded with age.  Listen, the last time I crawled out of a hyper bunk, it took me... quite a while to get it all back. BOWER holds his frown as PAYTON squeezes his finger into a wedding ring.     I've gone through this before. I just can't remember why I would agree to do it again. PAYTON goes to close his locker and BOWER motions with a serious tone.  I figured you'd tell me.  Trust me, it's not. if this is a simulation... PAYTON notices both of their reflections off the mirrored panel inside the locker... revealing their WHITE HAIR.  Someone is taking the joke a little far. He shuts the locker and they exit, the flashlight's beam panning away, taking us into darkness.  Figures. We can ride two hundred thousand tons of space freighter across the galaxy without a dent in the hood, but can't get one good cup of coffee. PAYTON flips a few switches with no result of power.  Payton on the con. Respond? This is Lt. Payton of flight Team...? Shit-  Five? How do you know that? BOWER pulls up his sleeve, exposing his tattoo ID. PAYTON nods, \"good thinking.\"  Lt. Payton of Flight Team Five. Does anyone copy? Anyone... respond? Anyone awake up there? Dead static.  Fucking teamsters. Maybe they couldn't get to us. BOWER eyes the third empty sleep-chamber.  The power systems must be free-floating off blown circuits or something. The over-ride grid won't even lock in.  I think we need to find a deck of cards and call the union. Distant THUMPS are heard overhead and they freeze... watching the ceiling with uncertainty. 13.  Hmm. Ventilation... maybe. Systems keep re-booting after each surge. That could be anything. THUMPS fade as the ship eerily MOANS and CREAKS.  I say we get out of here. I'd rather be up and out then stuck in the trunk. The room is blocked by the two heavy steel doors on either end, security doors ten feet wide. PAYTON leads the way towards one end, gesturing towards the doors.  We're not far from the bridge but without the circuits locked in... I don't know how we could ever get this thing open. As they approach, their flashlight beams pan across the door to see jagged chips and scratches all along the edges. Tools are scattered on the floor, the control panel ripped open.  Ironic. I think it was built to protect us.  What?  How the hell do you know that?  The training stuck.  Now if we only had a monkey and a rope. PAYTON climbs down as BOWER rotates his jaw with eagerness.  Must have.  I think we're better off... waiting here-  We're not going to be able to get to the bridge or even be able to open that door from the other side-  Do you remember just how big this ship is, kid? We don't know where that will come out, if at all-     Listen, I have to take a handful of Doxitol just to get in the hyper-bunk.  I can take a lot, that's not one of 'em.     Just in case...  .there's mail you need to open quickly. BOWER tucks it into a zipper pocket and his photograph falls out. PAYTON watches as he tucks it back in and zips up.  Wife...?  Must be newlyweds. How can you forget something like that?  Some pieces. Still a little fuzzy but you're the cocky little shit who wanted the window seat?  Give it some more time, pal.  How we doing?  Power surges keep coming across in longer increments, just like you said. 18.  I'm gonna keep trying to get inside and run a dyno. Or at least try to get a pizza delivered.  What are the choices? The light pans to endless shafts in each direction. He SNAPS a glow stick to life, letting it drop down the vertical shaft... silently into nothing.  If you're gonna take a turn let's keep track. That way you can get back if there's no way out.  If you haven't seen anything yet... maybe you should head back now. BOWER sets his jaw and suddenly spots a SPIDER, gently dropping down from a string of web. It lands and quickly scurries away.  Left it is. BOWER turns the corner to follow the spider's path, the glow of the lamp slowly fading.   I'm here. You alright? BOWER rubs the sweat from his eyes, anxiety increasing with his heavy breathing.  Easy, pal. Breath easy. Listen to me- BOWER squirms, pushing outward against the walls of the shaft with an increasing panic.  Calm down. Listen, you gave it a shot. Let's get you back here.  Take it easy- BOWER bangs the wall of the shaft with desperation.  Bower? BOWER!? Stop it. Stop it! Just listen to me. Put it out of your head. Stop moving and breath. Listen to  Put your mind somewhere else-  Well... this may not be the best time to tell you, but I got the door open.  Yeah. I'm kidding you. BOWER lowers his head with exhaustion and a chuckle.  There ya go. Now just breath. Easy, pal. Easy. We'll get you through this. We'll figure this out together. Hear me? I do remember something.  My dream. On the way out. Real doozy. There I was at the Rose Bowl game. Naked and everyone was drunk but me. Spent two years looking for clothes. Long fucking Rose Bowl game. BOWER chuckles, his breathing growing more steady. 22.  Or just... clothing issues.  Huh?  I do remember that being our duty rotation and... if we're team five that means we've been out for...  What can't be?  Well, you aren't here on default. This was a select pick. This flight was... different.  We're not just doing speed laps on the belt. This was something... special.     We were... heroes. We were-  What? He pushes himself closer, squeezing between pipes for a closer look..  What's wrong?    Bower!? What happened? Bower!? All he can hear is the muffled, panicked struggle. The RUMBLE of a power surge approaches.  Bower!? Answer me! BANG, BANG... BASH! He breaks the vent and kicks until he's able to push his legs through, into darkness, scrambling.  Bower...!? Through the static comes a HOWL of victory.  Jesus, don't scare me like that! Where are you?  A what!?  Bower...? You alright? BOWER!?  Bower? Do you hear me? Bower...? Nothing but STATIC.  Bower? You there? Com'on, man. You there? Bower:? The familiar sound slowly returns overhead...  Bower? Can you hear me? Bower? Answer me, God dammit.  Bower? You there-? BOWER lunges and they go into a violent spin, crashing over a table. Dishes clatter, gasps and grunts... only glimpses of the fight through the flicker of light. CRACK! BOWER'S hit, sent flying and he looks up to see her silhouette approaching, edged weapon in her hand.  Is that you!? Bower-- BOWER frantically flips it off as one of the HUNTERS suddenly turns back.   .with that marking, she's got to be part of the passenger manifest. Possibly a glitch in the LFS support system, a breakdown in the main grid must have woken passengers, instead of the flight crew.  Look like what?  Hunting!? 33.  Take it easy-  You're assuming there is someone on the bridge.  If they're in there... why haven't they thrown the security hammer into lock down? Seal and freeze it until the emergency units wake?  Either way we can't assume help will be coming. On-board or off. Out here, there is no rescue. There is no turning around. This thing wasn't even built... .to return. He pauses off the involuntary memory relapse, looking to the I computer screens, taking in the thought. 34.  This is no regular transport. We're not out collecting data off the belt or hauling cargo... we are the cargo. It was a single launch trajectory for... That's as far as his memory allows, his words trailing off.  What?  Hold it, hold it! Think about this for a  No, listen to me! LISTEN! You know how big this ship is and there's no way of knowing exactly where- If you go on some wild goose chase to try to find her-  And then we would be no closer to getting out of this situation with even less time to regain control of the ship. BOWER stews, wanting to retort, his mind is racing.  Our job is to obtain control of this ship. Once we've taken control of the systems, finding them would be easy. Are you hearing me? We save the ship... we can save them all.  I can guide you. Find out where you are. Hatch marker. Over the door. His flashlight finds one of the hatch doors and he climbs up the slanted wall to read the marker.  Take it. Climbing up the angled furnishings, he searches for any available weapon. He notices a mantel that displays several antique astrological and navigation devices. He spots an antique pistol. He breaks the glass, grabbing the gun, but it crumbles under his grip, falling to pieces. He sighs, but pauses to see... because the furniture is angled, his light spots a hiding spot underneath the desk. He pulls out a silver flask, bone dry. He reaches further, pulling out an unusually shaped weapon, much like a sawed-off shotgun with rounded edges. He snaps open the hand-crank I lever and gives a forceful whirl. A slow MOAN of magnetos causes the weapon's lights to dimly come to life. 37.  Alright. I'll lay out a path for you and see if we can by-pass the main security doors.  Back toward the flight decks. Back to me.  What chance have you got out there on your own? We'll figure out a way to breach the command bridge- A power surge sends a SHUDDER and FLICKERING LIGHTS past...  Bower...?  You know how to do that?  Okay. Hold up. I don't want you to go too far down that lane. Just catch your  I don't know vet. Hold on- BOWER backs to the wall, nervously scanning the corridor, struggling for breath. In the background a SHADOW moves at the end of the corridor.  What did you say?  Of all things to remember, why would you pick that?  No, no, no. You're talking about- Eden was lost because of a mechanical failure,  spook story, along with a million others. Eden was mechanical failure, not human error. A. glitch... that was remedied way before we ever-  They did that for obvious reasons, not because of Eden. BOWER pauses... within reach of the window only to realize it was an illusion. A glass compartment door left slightly ajar was reflecting a circular light panel, smeared with oil to give the illusion of craters. His shoulders drop in defeat.   Who says we didn't? BOWER climbs down, peering out into the corridor.  Left at the third marker. Two more levels down and we're there. 41.  Why do you say that?  Bower, you sure that's a good idea? He  Watch yourself! BOWER hesitates, the flashlight reveals SHEPARD'S identification tattoo through the ripped uniform and blood- soaked bandages. It reads; FLT//006//017  Bower, you tell this asshole the chain of command and a direct order to-  Get the hell out of there. 46.  Bower!? BOWER!? Answer me God Dammit! All that is heard is GARGLED STATIC and PANICKED BREATHING.  Don't look back! Hear me? Just go! GO! BOWER finds an open corridor and sprints as... Blades SCRAPE across metal, Blue.torches ROAR, HISSES echo. BOWER gasps heavily, hyper-ventilating as he catches glimpses of HUNTERS on his trail and running parallel in adjacent corridors, closing in with unnatural agility and speed.        Dower...? That can't be... you- The SOUNDS remain muffled, deeper within the wall, possibly from inside the ventilation shaft. PAYTON contemplates, eyes panicked. He climbs up the wall and wedges the panel cover over the shaft opening, jamming it closed with a screwdriver. He backs away, gripping the weapon, ready for anything. He tries to control his breathing as he sits... watches... and waits.  You want in? Come and get it you fu- The screwdriver SNAPS and the panel hits the floor. PAYTON raises the pipe, preparing to fight and... A desperate gasp is heard from inside the shaft.  Who the hell... are you!? GALLO is tightly wedged inside the shaft, squirming to crawl out, trembling with fear and exhaustion.  Easy... Easy. You're all right. PAYTON runs to grab a towel and water. As he turns back he notices GALLO'S hip and legs are sprayed with dried blood. PAYTON kneels over him and GALLO spasms from his touch.  EASY! I'm here to help you! PAYTON lifts the bottle to his lips, but the water runs down his face, GALLO is frozen in shock.  Com'on. Try to drink a little. Here. GALLO is unresponsive, wide eyes locked in a trance.  What's your name? Huh? Can you hear me?  What's that? Gallo...? PAYTON frowns, mumbling the name with a hint of recognition.  Corporal... Gallo?  Where did you come from, Gallo?  The bridge!? Where are we? What's happened? Can you tell me- 65.  Corporal?  Tell me... what happened? GALLO is hyper-ventilating, eyes wide with terror. A droplet of blood slowly builds in his nostril, refusing to drip. A low whine is heard in his throat as... LIGHTS FLICKER past.  Bower? Do you copy? You out there? Dead static. He sighs and glances toward GALLO, passed out on a nearby bunk. He hesitates, holding the pipe as a weapon, tucking it away and cautiously approached GALLO for a closer inspection. 74.   Team Four. Flight Team... Four? He glances up to see GALLO is now awake, staring at him.  Just... checking you. GALLO narrows his eyes, pulling the blanket tighter.  To make sure you're... alright. You... passed out. You-  Payton... Lieutenant Payton.  That's right. You're Team Four? You're suppose to be... my predecessor. GALLO deepens his frown, glancing around with disorientation.  You said... you came from the bridge? GALLO shifts his eyes back on him, a bad topic.  Where are we? I can't get guidance off this system and I have no idea where- 75.  Well, what did you see? How did--  Easy. I just want to make sure... GALLO'S hands are trembling, uncontrollably.  .you're okay- GALLO tucks his shaking hands under the blanket, defensively.  Is this your blood... Corporal?  Whose blood is it? GALLOholds his stare, jaw muscles tightening.  Who didn't?  i Something was wrong with who? ?6.  Your crew?  Pandorum. Both of them-?     It's just a sedative. Help you relax- GALLO lifts his fists with a threatening posture.  Take it easy. We're on the same team here. Alright?  What?  I've seen it before. But nothing that-  I didn't say that-  I wasn't about to question any of your   That's what they say. GALLO slowly rubs his temples, with hesitation.  The truth... about what?  What transmission? GALLO'S eyes are welling up, his lip begins to shiver.  Earth... is gone? GALLO puffs across his hand with twisted amusement.  In one day... it had to be nuclear or-?  Oh my God...  Easy...  How could they... how could they have let this happen? PAYTON slides his hands off the keyboard, his finger tips i nearly twitching, an uncontrolled tremble. He tries to hide his hands, sliding them under the console as... GALLO watches him blankly before wandering away to let him sit alone with the horrific realization. PAYTON shakes his head, refusing to accept it. 92.  BOWER! I'm here! Where are you?  How the hell did you get all the way to  I hear you. How do we get you in there?  I think the direct channels are fried. I'm gonna run a patch so we can get this door open as soon as we're back on-line.  The bridge. As soon as we're up we'll be able to take control of guidance. But only from on the bridge. GALLO continues pacing, throwing glances toward the empty sleep chambers.  He can do it.  He's the only shot we have. Gotta have a little faith.  What are you saying?  What are you suggesting, Corporal?  Launching ourselves... into deep space when we don't even know where we are? We wouldn't last more then a few days inside those things. That's suicide-  Stand down, Corporal. We're not going to abandon anything and we're not going to leave them behind-  I said stand down, Corporal! That's an order! GALLO steps up behind PAYTON, his face revealed with a thin stream of blood oozing from under his nose, dripping off his chin, eyes hollow and pale. PAYTON refuses to look at him, continuing to type.  He's in! That's the reactor's activator panel. We're going to make it out of  Gallo... you have to listen to me... Carefully. You don't haveâ¢to- GALLO steps closer behind him, his shadowed outline showing an imposing posture, his voice is forced and unsteady.  Don't... do what? PAYTON slides his hand further across the console, reaching for the pipe weapon, eyes on the screen.  Take it easy- GALLO'S presence is felt behind him, his voice seeming to grow raspier and uneven with breath, anger simmering.  Easy...  I'm giving you an order...  .to stand-down... Corporal.  Think about what you're doing... 107.  This won't work...  just think about what you're doing-  It wasn't the crew that was sick, was it?  What did you really do to them...? GALLO slides into the pod and...  For your own good-  You're not well, Corporal. You just need the proper treatment-  This isn't your fault-  Your mind... has turned against itself. GALLO EXPLODES with RAGE... POUNDING on the hatch with a jack- hammer of fists, bones shattering in his own hands. PAYTON ignores his screams, going back to the console and typing I into the keyboard.  I My God... he did it! He did it.  shut-up.                   I'll FUCKING CARVE YOU UP! Within the struggle, hands grab at weapons, a wrist is twisted... lining up both of their identification tattoos to be identical... FLT&gt;&gt;004&gt;&gt;012&gt;&gt;. The syringe is stabbed into skin. The trigger fires liquid, injecting the chemical into someone's arm as their voices converge, over-lapping at first and becoming one voice... It's for the best... Corporal.  Captain on the bridge. He heads toward the bridge, while flipping another switch that ignites the opposite doors just as...",
        "Young": "Well, if you're gonna be captain... what are we gonna do now? Off his look...",
        "Bower": "Where were you... when Eden was lost? Like every other kid on my block, I was in the middle of a dream, envious of those who were chosen to be part of mankind's greatest quest. Dreaming of the unknown and trying to imagine what only the lucky few would encounter.  As the entire world watched in wonder, there were only a few, skeptical of the journey's success. Only a few... who would be right. The further we move into the ship... signs of violence appear, smears of dark blood sharply standing out on the bright white paneling and several broken computer screens. The muffled SCREAMS grow louder and clearer... an argument between men, panicked rage over-lapping. 2.  Where was I... when I heard we'd lost Eden? Just like every other kid on my block... I was dreaming... of being one who would be chosen to follow. As we move closer to the asteroid field of sleep pods, it's obvious that time has passed, a single skeleton inside each of the pods, hands in a clawing position towards the glass. We PUSH IN towards one pod, moving towards the SKULL, still locked in a SCREAMING position, wide mouthed and...  Burns are red! Bruises... blue- His voice echoes into the dark, alone in a cavernous room as he pauses, struggling for orientation. He gets to his feet, muscles twitching. His short-cropped hair is... pure white.  Hey...? HEY!!? Someone? A constant low RUMBLE is present, joined by the occasional MOAN and CREAK of a large ship. A SHUDDER travels through the room with a random FLICKER of LIGHTS to reveal... A massive steel compartment, tangled with technology. It's cold and institutional. High-tech computer terminals slope out of the floor. The FLICKER passes, taking us into black. We hear him: fumbling through the room, switches are thrown with no result and compartments are pulled opened and... SNAP! A glow stick comes to life. He squints at his darkened surroundings with confusion. A drip of liquid catches his eye and he staggers back to his sleep pod. He grabs the dangling tubes that were ripped from his arm and he sucks on the tube, pulling as much liquid into his mouth as possible. After a few heavy gulps, he suddenly heaves towards the floor. He painfully forces himself to drink, gasping. He looks up to notice two sleep chambers next to his own. He leans closer with the glow stick to see the first one, the name plate reading; 2nd Lt. Cooper. It's EMPTY. The third pod's name plate reads; LT. PAYTON. Deep inside there is the figure of a man, asleep under a mask.  Payton? Lieutenant... Payton? He turns back to his own pod, seeing the name plate that reads; CORPORAL BOWER. Even this name doesn't seem familiar.  Bower? Bower...? The loss of memory heightens his fear even more as a shiver travels through his body while he staggers towards a nearby computer terminal. He taps the keys on a computer terminal. Nothing. He frowns, leaning closer. 5.  Bower. He opens the locker to see an assortment of personalized belongings, uniform and gear, none of it seeming familiar. He uses a towel to wipe off the layer of sweat and oily substance coating his body, pausing to see an identification tattoo on his forearm that reads: FLT&gt;&gt;005Â»015. He pulls on a black flight suit, emblems and military markings of rank on the chest. He pulls on shoes and a tool belt with a high powered pen-lamp. On the inside of the locker is a emergency manual card with block figures displaying breathing and stretching exercises, labelled; Hyper-Sleep Disorientation Recovery Procedures.   .in the event of mild memory loss... resulting from extended- He freezes on... A PHOTO tucked inside the door. EVALON, a beautiful young woman smiling towards camera. He stares at the-photo, his frown deepening with confusion. He checks the back for a name, but nothing. He tucks the photo into a pocket and exits.  Faa-uck! Distant THUMPS. He pans the pen-lamp across the ceiling and toward the sounds... PAYTON'S sleep chamber. THUMP, THUMP, THUMP: Muffled and desperate. CRACK! Bower jumps back as someone kicks their way out from inside, the hatch bursting open. Out climbs... PAYTON, a man in his forties, but the rugged physique of a man half his age, lean and agile. His military-style hair cut is also pure white. Gasping for breath, he hits the floor as BOWER tries to help him. PAYTON jerks with shock.  Whoa! Hey... easy! Lt. Payton? You're- Sir... whoa! PAYTON chokes and gasps, then glances up, giving Bower a once over with a frown and a sobering tone.  Bower. Corporal... Bower, sir. I'm the- 7.  That's right. You're waking from  Yes, sir. This is disorientation from-  Yes. That's right, I'm-  Sorry... sir. PAYTON rubs his face with a frown.  We're aboard the Elysium. From what I've  I don't... really know. There's no power in the com and I can't even-  I believe so.  Sir... I don't know where anyone is. PAYTON takes breaths, trying to regain his senses, glancing around at their darkened surroundings.  Ah... we're having some power problems-  Umm, not sure. It had to have been the flight computer. There's no one here...  .except us.  There's no power coming off the main grid. Can't fire any of the...  Dynos. Can't even open the doors. PAYTON glances to the other empty sleep-chamber with a frown.   Our 2nd Lieutenant? I don't know where he is. It was empty when I woke up. None of the systems are on-line. Mainframe is down, so I don't know how or why it engaged independently-  Yeah? 9.  Sorry. I just- Just glad to see you awake. i was... a little concerned. I didn't know what to do if- PAYTON gets to his feet, stumbling. BOWER catches him under the arm as they stagger into the wall.  Easy... Lieutenant. Easy.  I'm on it.  This is you, sir.  1 It's... the name on your sleep pod, sir. PAYTON opens the door to see his belongings inside, a photo of WIFE  inside the door. He stares at it with utter confusion. BOWER takes this in, looking to the memory recovery card inside the locker. 10.  it says that the memory loss is only suppose to be a momentary loss that's-  I've been awake for at least an hour and I still can't remember my... anything.  What was... your last flight, sir?  Sir? I know this is going to sound strange, but do you even know where we're going? I can remember the training, but... not the mission. Know the procedures, not the... destination. 11.  Didn't even know the ship's name until I saw it-on the console. For all I know this was another damn training exercise-  None of the activators are working.  Without the mainframe, we can't connect. I don't know how we'll ever be able to- PAYTON is in his element at the control desk, flipping open an emergency auxiliary-power panel. He snaps open a handle and he forcefully gives it several rotations with a MOAN of whirling magnetos. The hand-crank allows a dim glow of electricity to the light panels.  Oh, I- didn't even think of that. 12.  Five.  Team Four suppose to be here for the shift rotation. Where could they be?  Where could he have gone? PAYTON gazes off blankly. A RUMBLE of FLICKERING LIGHTS pass and the computer screens slowly fade, going black.  Whatta ya think?  Somebody... is up there.  Jesus. Somebody was trying to get out.   Well, he got out... some how. A RUMBLE approaches... another SHUDDER that FLICKERS the lights. They watch the ceiling as BOWER counts in his head as it fades.  Cycle is broken.  It's not circuitry. Reactor timing is off-set in the core. Seems sporadic, but it's not. Each revolution decreasing before starting over from the beginning. 14.  It's trying to reconnect, but it won't until it's reset.  I dunno. I can't remember my own- but I know everything there is to know about that damn reactor.  And I know that... Another SHUDDER approaches.  That's twelve revolutions, before recycling. And this one will only last- As they watch the ceiling, their flashlight beams stop on a small ventilation shaft that's been ripped open. They exchange a look and...  Our 2nd Lieutenant must have gone this way. Don't you think?  It's the only way out.  For what? If the mainframe is off-line- 15.  But we can at least find out what's  But, we can at least try to-  Can't do... Sir?  You're... claustrophobic?     You can guide me... over two-way. PAYTON eyes him over with reluctance.  You know there's something wrong. How long can we wait in here before we have to try something? 16.   How long did he wait? Silent stare as a SHUDDER passes, flickering the lights.  What if no one else is awake and there's no one at the wheel?  Yeah... I think so.  What do-you remember? Anything yet?  And you're the cranky old bastard who made me take the aisle.     Nothing yet. Christ, not a single vent opening or- Nothing. How about on your end?  Hey? BOWER quickly pushes himself forward reaching an intersection in the shaft.  Got an intersection here.  A whole lot of the same... nothing.  Don't say that. BOWER lowers his head, breathing heavily.   I'll be damned. BOWER collects himself, a tightened jaw of determination. 19.  I'm taking a left. Make a note.           Payton!? Do you copy!? HEY!? Finally...  I dunno. I dunno if I can- I can't tell if I'm going in circles or- There's nothing to- Can't breath-  I just want... to stand up for God's sakes! Can't breath-  Back!? Are you kidding- I can't turn around! I can't even- Do you know how far I've gone!?  I just want OUT of this FUCKING THING!  I can't... breath!  Like WHERE!?  WHAT!? Are you fucking kidding me!?  What's that?  Dream like that, sounds like you've got some... guilt issues.  Two years?  You said two years. You think we've been asleep for two years?      That can't be right.  Why would I-leave her? I can't even remember saying good-bye. Why would I?  Different... how? 23.  Someone's been through here.  Someone's been... BOWER notices the droplets of sweat dripping off his chin are rolling forward across the shaft floor with a frown.  Wait a second-  I'm... I'm at an angle! Shit! 24.  No, no... N00000! He slides head first into a vertical drop, the shaft tightening like a funnel, crushing his lungs and SLAM! He crashes into a steel grate where his flashlight lays. It's a nightmarish head stand, his neck twisted with all his weight on top of himself, squirming with no where to squirm.  The flashlight falls through the grate and he watches in horror as the light drops, fading from sight, taking him into darkness.  Aaaaeirrrgh!  I'm... out! I'm- PAYTON breathes a heavy sigh of relief.  I'm- I'm inside a boot locker!  I'm inside a God damn- He shoves outward and the door SNAPS open. He falls out, flips through the air and SLAMS to the floor, an IMPACT on the radio sends...  Make that an overhead compartment. You with me, Payton? I got out. Hear me? He checks the transmitter, crackling with static.  Payton? You there...? He cautiously ventures down the corridor as LIGHTS FLICKER past, getting a quick glimpse of just how incredibly far the corridors run. He steps up to an intersection of corridors, adjusting the frequency on his radio.  Payton? Can you hear me!? Dead static. He sighs, looking down each of the corridors, all appearing identical and endless.  Which way is which? I He examines the piping that runs along the ceiling, checking the direction of the valves and guesses, picking a direction. He walks to the edge of the next corridor and pauses with a frown. Glancing down the side corridor, fifty yards away, something is off. Within the symmetrical framing of steel, there is a rounded shape that is out of place. Be cautiously steps closer as the object takes the shape of... a MAN, standing at the edge of a doorway, head slightly cocked, peeking out.  Hey...!? BOWER freezes, caught in a silent stand-off, the MAN'S motionless stare is unsettling.  Hello...? A low RUMBLE approaches as LIGHTS FLICKER past to reveal... The MAN'S face, hauntingly contorted, swollen features. The MAN is dead, hanging from a cable around his neck, naked and gutted like an animal, his feet hanging an inch off the floor. His face is brutally beaten.  Jesus... Christ. Jesus- BOWER back pedals with fear and confusion as distant THUMPS make him quickly click off his light and he backs away, fading into the dark. His whisper fades. 28.     What-!? He tries to look up and... CRACK! Instant swelling over his eye from a hit. She kicks the envelope opener away.     Wait- I'm part of the crew! I'm- 30.  I won't! Please! Just listen- I'm not-  What!?  Alright, alright! Take it easy! He begins to remove his shoes and the radio on his belt suddenly CRACKLES with activity.  Stop! Stop it! Listen to me! Hold it! she attacks and he frantically throws dishes and chairs to fend her off. She throws the blade, the blunt end deflecting off his forearm.  You crazy fucking bitch- He wields the only weapon he can find... his shoe. And her attack abruptly halts, slowly back pedalling with fright. BOWER is confused, realizing her eyes are looking past him. A BLUISH GLOW seeps in from the doorway, approaching from the corridor. He looks back to see NADIA is running for the kitchen... gone. 31.     What the hell is- The FIGURE quickly spins his direction and SNAPS a lever on the spear-device, killing the blue flame and taking us instantly into darkness. BOWER holds his breath with fright, back pedalling on his knees as his eyes try to adjust to the dark. He takes an uneasy breath to realize... there is more then one. Slowly moving out of the shadows, four more HUNTERS slowly emerge, like a unified pack on the prowl. They carry an assortment of crudely made weapons, spears and blades of sharpened metal. The apparent leader of the pack is HEFLIN, the largest and strongest of the group and he directs the pack with an assortment of odd vocal sounds, deep HISSES from the throat and gargled CACKLES. On command, the one HUNTER flips a lever and the BLUE FLAME crackles back to life with a burst of flammable liquid. The hunt continues, the pack weaving through the debris, following NADIA'S path. As the BLUISH GLOW fades, BOWER is left bewildered and terrified. Suddenly, his radio sounds...  The only clear view is off an overturned bowl that shows WEASEL'S face, oddly contorted in the rounded reflection. WEASEL is headed directly for BOWER until.., a HISS from HEFLIN calls him back. WEASEL takes one last look before turning back, the torch fades from view, taking us into black. We hear... BOWER'S breath, heightened gasps of fear as he begins to crawl away.  But, why would she try to kill me!? She was going to slit my throat! And why would they look like that?  You should have seen these guys. They were... a very fucked up looking gang. Why the hell would they be-- Payton, they were hunting. BOWER gives himself a shiver as he fearfully checks over his shoulder, eyes shifting with fear.  They sure-as-shit weren't a welcoming party from the Promenade deck! These guys were... looking to do some damage.  We've got to try to contact the bridge.  You're not!? We're not the only ones awake. Team Four wouldn't go back to sleep without waking us for rotation. Maybe they're on the main deck?  Maybe they can't. With the systems kicking on and off- Maybe they're flying blind, with no control of the LFS? PAYTON eyes the scattered tools across the floor and the ripped open ventilation shaft.  What are you talking about? PAYTON glances across the control console, nodding with more memories returning.  .Tanis. Planetary processing and population. We're a settler's vessel. Elysium. This was a one-way ticket. BOWER'S gaze goes distant as...   How could I have... left her? Why would I have done that? I loved her... BOWER snaps out of his trance.  Payton!? Where is your wife?  We didn't leave them behind. No one did. They're on this flight! Remember the recruitment. 35.  The fucking breeding tests- The wives, the husbands- The- She's on this God damn flight!  They're here. Somewhere on board.  I've got to find her... before those fucking animals do! I've got to- BOWER ransacks the compartments, tossing aside items.  Try to think of where they would be? A sleeping compartment for non-service  What's there to think about!? I remember! There was thousands of passengers that weren't part of the development team. Families that-    But... how do we- I r PAYTON Where are you?   I dunno. Officer's quarters, somewhere above D-level, I think- I don't-    Guide me to where?  I'm not coming back to you. What good would that do? I can't open that door from the other side--  Listen... if you can get me to the reactor bay. I can... reset the reactor's cycle. 38.            Eden.  The Eden. PAYTON nods, memories returning as he mumbles the name.  I'm just thinking, maybe there's something we haven't considered. Eden failed... because of ODS syndrome. The one officer who was suffering from Pandorum. Cabin Fever. Maybe there was something similar with one of the earlier  That was the report... but don't you remember the story of the one flight officer... the real story? They say he went lunar, launched the entire ship, five thousand people killed with the flip of a switch. All from a bad case of cabin fever-?  And why did they switch the rotation shifts from three years to two? And they eliminated the manual over-ride-  Well, at least we didn't wake up... floating away in a coffin.  Something happened to the other team? Maybe there was... Pandorum. BOWER looks to his own hand, cradling the weapon... his FINGERS gently TREMBLING. He makes a fist and shakes his hand, firmly grabbing the weapon.  Which way?  This can't be right-  Have I done a circle or am I doubling back?  I've seen this before. This- We follow his flashlight to reveal... a BODY tangled in a wire snare. It appears to be the same dead body he witnessed before, but as he steps closer, it's different. This body has ripped clothing and isn't gutted. It's... SHEPARD, a thin-framed man in a torn crew uniform, tangled in a wire snare wrapped tightly under his arm and around his neck. 42.  a different one. There's booby-traps, rigged to the- SHEPARD'S eyes POP open wide with a terrified expression, completely silent until BOWER sees him. BOWER jumps with fright and SHEPARD wildly squirms, SCREAMING bloody-murder.  Stop it! Jesus, I'm not gonna- SHUT-UP!     He's... team six. The unit that's suppose to follow us. He's- 43.  Quiet! I'm not gonna hurt you! SHEPA.RD begins to moan, mumbling and weeping as he rubs circulation back into his limbs with nervous laughter.  Hey? You with me? You're gonna be alright. Hear me? Squinting past the glare of the flashlight, SHEPARD notices BOWER'S clean uniform and the radio boom on his chin. He begins to weep, tears of joy and agony.  Huh?  Squad? My Lieutenant and I were the-  Shuttle? What are you talking about? SHEPARD'S expression drops.  No, no. Hold on. I'm from this crew. I'm from Team Five. SHEPARD'S face goes pale, eyes going hollow. His demeanor slowly begins to shift.  six... maybe eight hours ago. I had to crawl all the way from the upper deck  That's what we're trying to figure out! Tell me- what happened!?  I don't know anything.  What are you doing?  What ! ? SHEPARD rubs oil across his neck and then goes to check the corner, wrapping a strap around his fist to secure a screwdriver into his hand.  Help.me? Wait a second-  They- Who the hell are they!?  God dammit, WAIT! You're still an officer of this ship and at present time, your CO is ordering you to-  Payton...?    They got him! They fucking ripped him apart! They're-     Aaaargh! Footsteps are heard approaching overhead. On the floor below him are his weapon and flashlight. He stretches for the gun... too far from his reach. The flashlight is \"on\", illuminating the area. He pushes off the wall and reaches for it... fingers touching, but unable to grab it. The GLOW of torches grows in the loading shaft and BOWER pushes off, reaching for the flashlight. Unable to retrieve it, instead he pushes it... into the open loading shaft. It drops all the way to the bottom as...  Please... don't- Please, listen- The FIGURE slashes BOWER'S sleeve, rips away the fabric and looks at his identification tattoo. BOWER quits squirming as the FIGURE leans closer into the light with a curious frown. TANAKA, a Japanese man in ripped and modified clothing. Unlike the awkward gauntness of the HUNTERS, he has a full- framed, hard-edged physique and soft brown eyes.  What...?  I don't understand. I- I don't speak- TANAKA jabs a finger into the emblems on BOWER'S uniform.  I'm sorry. I don't- Do you... speak English?  Thanks. Thanks for... that. TANAKA is dead pan. BOWER flinches as TANAKA picks up the energy gun and then... flips it over, handing it back to him. BOWER cautiously accepts as he climbs to his feet.  I'm sorry. I don't...  I don't know what you- TANAKA jabs the emblem on his uniform and presents his own  You're with... agriculture!? Jesus... Listen, I'm not- TANAKA jabs the emblem on BOWER'S chest, taps his tattoo.  Yes! I know! I'm with the flight crew! But, I don't know what's happened! I     Listen, I'm going to find out what went wrong... with the ship.  Yes, I'm going to the reactor to try to-  Right. It doesn't really matter- You should stay put. Or go back to your compartment sector- Wait for the security systems to engage. Okay? We're gonna take care of this problem. Dead pan.  Okay? BOWER slowly backs away and TANAKA follows. BOWER stops, I eyeing his numerous bladed weapons.  No. Listen, you should stay. Wait here... for the systems to- Alright? Stay! TANAKA frowns as BOWER backs away, gesturing. BOWER reaches the next intersection and looks back. TANAKA is gone. He continues down the corridor as LIGHTS FLICKER past.         Knock it off! Both of ya! TANAKA and NADIA slowly recover, both quickly try to find their weapons on the floor.  Listen... nobody needs to get hurt here. Both of you just... cool out. And stop throwing that shit. Her eyes dart with uneasiness as she finds her knife.  Let's all just... go easy here. I understand it's been every man for himself around here lately, but if we're going to get out of this- A little God damn solidarity wouldn't hurt. 55.  We can work together here. We all want the same thing... right? NADIA remains poised, ready to fight, knife raised. Sighing with defeat, BOWER gestures, hands raised as he motions for TANAKA and they slowly back towards the door.   Thanks... again. TANAKA motions toward the emblem on his uniform and gestures to himself.  Yeah, yeah. I get it. We can work together on this, right? TANAKA grins.  As long as we understand each other. They head out of the room as... NADIA watches from the shadows with a curious frown.  Yeah... well no sympathy here. She left me with a few sore spots too, pal. They both go to work, attempting to wedge the door open with pipes. BOWER looks back to see... NADIA. They back pedal with weapons in hand and NADIA is unaffected, watching them with a frown.  Listen, lady. We don't want any-  Huh?  Yeah. I'm... a corporal, I'm-  That's what I'm trying to figure out. Malfunction of some sort-  I'm heading for the reactor bay.  Just joining the program already in progress, yeah. She eyes him over and TANAKA keeps the pipe raised.  Oh yeah? And why is that?  Hey? Wait a second- HEY?  Hold on. Who are you? 57.  Wait- Can't join the team without a name.  Because I need you to show me the way.  Hold on. Please- There's not much time left before we lose everything onboard. You understand what I'm trying to-  I'm working on it.  Huh?     My thoughts exactly.       Where are we going? What are we doing-  Waiting for what-?      Who are they? What the hell are those things?  They're not- They can't be from this ship. They don't seem... human. Do you think something got on board or maybe I something... He turns to follow her and pauses to see... The BIO-VAULT. A large lab storage compartment that has been \"lived-in\" for a long time. A bed has been created from assorted chair cushions and there is a collection of scavenged items. NADIA adds to the items, dumping the belongings of her bag onto the floor. BOWER is in awe as he approaches an entire wall of glass test tubes, a maze of micro-biological containers, glimmering with condensation.  What is... all this?  You've been living in here? You're... protecting it?   Tanis.  No, I- I didn't remember just how far away it is... until now. This was a hundred and twenty-three year flight. NADIA begins to gather a few items shoving them into a bag. TANAKKA leans closer to the glass display with fascination, tapping the tubes to see movement inside.  How could I have forgotten that?  How could we have become like this... in only eight years? NADIA ponders the thought, rotating her jaw. She digs into her supplies and tosses him a small block of orange material.  What is this?  How long?  You think we've over slept?  Do you have a radio?  I'm not the only flight crew officer awake. We're not in this alone.  I'd prefer to stay on foot.  And what is that?  Where are we?  Jesus... As they venture deeper inside they see numerous sleep- chambers, open hatches and empty. The further they move along the wall, more and more empty pods, too many to count.  My God. They're... empty. They're all- Where the hell is everyone?  Wait a second. My wife-  No, wait. My wife could be in here. BOWER'S focus completely shifts, turning towards the pods, reading name plates.  She's not part of the crew, but spouses were brought with. I remember there were-  Do you know where the family members are- 67.  I don't see what he's looking at, do you?     Let's get out of here! Com'on- The THUMPS grow louder and TANAKA heads into the shadows. BOWER hesitates, turning to follow NADIA through a barricade of dishevelled equipment, leaving TANAKA behind.  We can't just leave him. We have to wait-  We can't split up the team, it's all  The guy saved my life twice already. I'm not gonna leave him-  How the hell should I know-  Wait! I'm coming- There's a CRUNCH under his foot. He lowers his light, picking up a small white object. He brings it closer to the light to realize it's... A HUMAN FINGER BONE.  Jesus! NADIA turns toward him to see...          What the... what the hell is it!? The HUNTER flinches and our gang back pedals with fright. NADIA continues back pedalling, looking towards the rafters to see... HEFLIN silhouetted, leering towards them.  What is he... doing? BOWER, NADIA and TANAKA quickly realize the effect as shadows begin to move.., the room is filling with HUNTERS, alerted by the tapping of metal.  They're... everywhere-  What the hell happened to them!? What the hell are those things!?  I second that. Let's get the fuck out of here. Which way did we come from?  No, I mean... let's just go!  You said there was no other path.  Which way did they go-?  They'll hear him- They'll- We've got to  Didn't we come through here already?  Out? Why did we come iii-?  I thought you knew where you were going.  Could've mentioned that after the first mile. If I would have known we'd be doing laps down here- She angrily turns towards him, pipe in her hand.  What the hell is that? They climb down the shaft, jumping from filter to filter. At one level they follow the sound into a shaft opening and towards the soft, warm GLOW of YELLOW LIGHT. They reach an open hatch, peering inside to see... Inside an empty storage tank, a comfortable living space has been created; numerous chairs surround a make-shift dinner table made from storage crates with hand-made candles and various food containers. The tank appears empty.  What is this!? BOWER and TANAKA begin to climb through and NADIA hesitates with uncertainty. They crawl through the hatch...  Get back! BACK! BOWER whirls the magneto lever on the weapon and he raises the barrel towards the hatch, nearly point blank. KA-CRAAAACK! The energy blast from the weapon hits the hatch like a lightening bolt sending a tremendous JOLT through the entire tank. A spark IGNITES the chemical gas and there's a BURST of flammable gas that rolls upward into the catwalks. LELAND is knocked off his feet and he GASPS with shock.  Shut off the gas!    You... live here?  Left? Have you seen any?  Captain? Where!?  Why don't you come on down so we can meet properly?  Where do you think we are?  The reactor bay. Know where it is?  How long have you been awake?  Those things out there. Could it have been something... that crawled out of your lab? Something that-  Then something got on board. Some kind of life form. Something that-  What does that mean?  What?  But, why would- You're saying we'll become like them? Why would they be affected like that and we're not-  What is that... saying? LELAND cranks a power lever, speeding up the play back with eagerness, whispering along. The recording slowly grows less distorted the more he cranks the lever. 88.    Play that transmission again. I want-  I dunno. It can't be- It just- 91.  What are you doing!? What the-  It's gone... into the final cycle.  it means we have less time then I thought. The last phase... before shutdown. It means we're... done. BOWER is oddly defeated, taking a seat, hanging his head.  What difference does it make?  For what? They're gone. Everything is gone. There's no Earth to go back to,  And what is left of us? What's left, worth saving? This flight's over. NADIA is angered by his defeat, shoving LELAND aside and squaring off in front of BOWER.  She's dead. 94.  I know... NADIA grabs him with rage, glaring him in the eye.  You got a radio?    Payton? Do you copy? Can you hear me!? He grabs the receiver.  Storage Tanks, just below B-level. Mid- ship Sector twelve... we think.  Payton, listen to me. Listen. The I reactor is in its final stage. Its last rotation. It's worse then we thought. PAYTON looks to GALLO, who is silently watching with a hollow glare from the corner.  The ship is dying and I think that's why it finally woke us up. The entire system is heading into permanent shutdown and there will be no return. This entire ship will float off into eternity with no way of stopping it. We need to reset it. Are you hearing me? PAYTON and GALLO share a silent stare.  I need you to give me a path. PAYTON and GALLO'S silent stare hangs in the air for a moment, the tension between them unclear. PAYTON turns to the console, quickly typing into the keyboard.  What? TANAKA motions toward the hatchway, shaking his head. He i gestures for them to follow and leads them over debris and through a hole, hidden in the paneling.  I dunno. But do what he says. They follow TANAKA, crawling through the hole and into...  Child! ? That's no child! What the hell is it!? TANAKA lunges, but NADIA blocks his attack. The CHILD HUNTER erupts with a horrific SCREECH, HISSING at them before turning and leaping back up and over the rafters, disappearing into the shadows. They are speechless.  What!? What do you mean they? How could they- That's impossible. It appears the CHILD has alerted his group as the BLUISH GLOW of flame can be seen growing stronger in the corridor, the sounds of CACKLES and HISSES approaching.  Why not? 99.     She's not here. She's dead. 101.  She's not on this flight. She wouldn't come with me. She wouldn't marry me.  That's why I came. There was nothing left for me there. She stayed on Earth. Gone... with everyone else. And I left because of her. His gaze begins to gloss over, taking it all in.  Marianne.  I remember her. Payton's wife.  I remember her. I remember- His eyes pull focus, coming out of his daze, memories returning with confusion.  Com'on. BOWER grips his weapon with a flexing jaw of determination, heading back to where TANAKA and LELAND are waiting as we... 102.  This is our chance. BOWER leads the way out of the hiding place, heading quickly towards the open hatch where an eerie glow and rumble is felt. They crawl through the hatch and enter into...  This is it. We've got to get down there before they come back. BOWER looks for a path downward along the tangled metal of catwalks, coated in algae. LELAND'S fear has instantly surfaced, unable to move.    Com'on... NADIA looks back to see there are still HUNTERS in the reactor bay, ones who didn't join the chase, slowly coming out of the shadows, crawling up the walls.  I'm going as fast as I can-      Go... GO! GO! Half way up, LELAND looks back to see them coming with HUNTERS close behind. He gives them a look before closing the hatch and latching it.  That's it! GO! Go for it! With HUNTERS hot on their trail... they run full sprint towards the sliding doors. HUNTERS lunge out of side corridors with SCREECHING HISSES as BOWER and NADIA dive through the sliding doors... One HUNTER is crushed by the doors., split nearly in half with a heavy THUD of steel and a MOAN of hydraulics. The HUNTER spasms wildly, kicking and clawing as BOWER and NADIA back pedal into the room. HUNTERS gather at the gap, stabbing weapons between the doors, trying to crawl through with SCREECHES and HISSES of rage. 117.  He's not my lieutenant. She frowns off his look and turns to see... LELAND on the floor in a pool of blood, throat slashed, dead. BOWER pulls the gun and heads into the open doorway leading towards the bridge as NADIA follows behind.  Flight log. It'll tell us how long we've I been out... and how far we've gone. BOWER types in a command and the computer begins to scroll through the flight computer's time-code. Starting with the launch date and time the numbers begin to roll faster and faster. BLIP... BLIP... BLIP. 118.  Seems my little memory lapse has finally worn off... \"Lieutenant\". BOWER slowly approaches, moving closer to his profile, the stream of blood from GALLO'S ear shown running down his neck.  Who the hell are you? GALLO keeps his gaze towards the windows, emotionless.  You're team four. Why would you... switch bunks? Pretend to be someone else? What would you be wanting to hide? Who the hell are you?  You were the one... who first received the final transmission. Who refused to go back to sleep. You stayed awake... for all those years. What were you doing... what crimes were you hiding from when you took Payton's bunk? The time-code display rolls faster, years rolling into decades... BLIP, BLIP, BLIP. 119.  Is it true? What have you done to us? Where are we now? GALLO lazily nods towards the windows.  And that makes it okay? To play God?  Judgement will come for you. You think you could cover it? Your victims survived. Evolved. That's your creation out there. Your crime. BOWER jabs the gun into his back with force.  And you thought you'd be able to hide it? Who would ever suspect that? Who would ever remember? I remember. NADIA rubs the glass with her hand, squinting into the darkness. The time-code display rolls faster, decades into centuries... BLIP, BLIP, BLIP. 120.  Shut-up. What's out there? NADIA shakes her head, rubbing away the sludge from the glass, squinting harder.    Shut-up!  There will be law... in whatever world we create. And you'll pay for what you've done. Believe me. GALLO chuckles with his face pressed to the floor.    What is it? GALLO looks up with a blood-soaked grin.  What do you see!?     We've been... down here... all this time!? All this... time- 122.    Hold on! Under the roar of the rushing water, hydraulics ignite. Micro-jets FIRE and WHOOSH! The pod launches, shooting down a tunnel until they're HIT with a tremendous JOLT. They are sent spinning into a wild tumble as bubbles and gas erupt across the outer surface. BOWER and NADIA slam into one another as the chamber turns end over end. Its roll seems to slow for a brief moment and BOWER squints toward the porthole to see... 124.  1 Put it on!    Hey...? Hey? She chokes on the air and struggles to orientate herself, looking up to see him gazing down at her, coated with bright sunlight.",
        "Gallo": "Help... me! PAYTON pauses, angling the light inside to see... GALLO, a young flight officer, boyish innocence, short-cropped hair, heavily coated in sweat, desperation in his eyes. His hair is dark brown, the only person without pure white hair.  Help me- I'm part- of the flight crew! I'm- Please- HELP ME! PAYTON oddly hesitates... before lowering the weapon. He digs into the shaft grabbing GALLO'S hand, pulling him out. GALLO collapses onto the floor, crumbling into a fetal position, naked. His hands are locked in claw-like grips, trembling uncontrollably. His gasps are rapid and unsteady. 64.          The... bridge. Saying the words seems to send him into a terrified trance.  What are you doing?  For what?  Who the hell are you?  Lieutenant? You're... a lieutenant?     I don't know.  Listen, I'm not a navigator. Stars all look alike. I don't know! How the hell would I know!? Sensing GALLO is about to break down again, PAYTON tries a calmer approach.  I'm fine. PAYTON lowers his stare, hesitating, glancing across the dried blood still splattered across his legs.  Some of it is... sir.  They didn't give me any choice.  There was something wrong with them.  It was... Pandorum.  Of the worst sort. They were- I couldn't even- I had to defend myself.  You don't believe me?  What are you doing? What is that?  Then you take it... and relax. PAYTON backs off, setting the syringe aside.     If you would have seen them... you would have done the same thing... sir. LIGHTS FLICKER past...  Do you know the symptoms of Pandorum?  Orbital Dysfunctional Syndrome. Pandorum. Ever witnessed the symptoms of first-hand?  It's not something you can easily detect. Starts with a shiver. An itch. A slow boil... and without being able to get off the ship... there's no shutting off the heat. It'll boil over, no matter what you do. GALLO is slowly pacing the room and PAYTON watches him with uneasiness out of the corner of his eye.  You don't believe me.  How could they both have had it? The odds are insurmountable.  But, we all know Pandorum is greatly affected by any substantial psychological It has an emotional trigger effect.  How do you think you would react... if you knew the truth?  we were only into our second term. All flight systems nominal. I'd picked up on symptoms with my CO and 2nd Lieutenant. Mild symptoms. Nothing I thought would... become a problem. Until we got the transmission.  The final transmission. The last message... from home.  You are that's left of us. Good luck, God bless... and God's speed.  Wiped away. We ran a full sweep off the grid and they were... gone. One day there, the next... nothing.  Whatever it was, they knew it was coming. Wished us well. We're all that's left. PAYTON sits back in shock, shaking his head in disbelief.  You can see why I was hesitant... to tell even you. My fellow crew members didn't take the news too well. I wanted to wake the primary crew... but my 2nd Lt was already over the edge. 89.  ODS came through with flying colors. No logic, no reasoning left. No future, no past, no hope. A dangerous mix when you're stuck inside a tin can like this. The blow was more then he could handle. My lieutenant wasn't far behind. Pandorum.  They were my commanding officers. Men who had guided me through FT. I looked up to these men. But... it wasn't them anymore. They... were gone. They... tried to... I had no choice. I- With his body beginning to tremble, PAYTON tries to console him, touching his arm. GALLO flinches.  What are you doing?  What's so important on the other side of the door?  This ship is not dying. PAYTON refuses to look to GALLO, continuing his work.  It's already dead. You really believe that kid will be able to save this ship?  Twelve hours ago, he didn't know his own name. Now, you think he's ready to re- configure a nuclear reactor? 100.  Faith? After what you know now, you can actually say that with a straight face? A little faith? THAP. A droplet of blood hits the floor at GALLO'S feet.  He's right about one thing. Once that thing shuts down, we're as good as dead. Nothing on this ship will ever turn on again. Ever. Not the air, not the lights, the heat... not even the pod's escape launch systems. PAYTON refuses to look up from the computer.  I'mï¿½saying... once it's done. We're done. But, we still have a way out of this... before it's too late.  We can still launch ourselves in the pods. Before the ignition systems are completely dead, sir.  A few days is better then what we have left here. I'll take my chances. How long do you think that reactor has been sitting? That thing could melt-down when he tries to fire the core. This ship could be ripped in half- 103.  We can't stay on this ship. You know that as well as I do-  Trust you? How can I trust someone who isn't even honest with himself. Tell me? PAYTON refuses to acknowledge him, continuing to monitor the control panel. He discreetly slides his hand closer to the pipe weapon as he senses GALLO'S presence behind him.  Don't do that. TRAP... TRAP... THAP. Blood drops hit the floor heavily.  Don't talk to me like some child that needs reassurance. Think I don't know the risks? Think I don't know this ship?  I know this ship and what she's capable of better then anyone. I know her... and I know what she can and can't do.  And this... she can't do! Why are we even arguing. You know it-  You wanna stay here to die, that's your choice, not mine!    Who's being irrational here, Lieutenant? Tell me? Who's being delusional!? Hmm? PAYTON raises his hands, calmly submitting.  I'm getting off this ship. My flight's over. OVER! Another panel on the console begins to gently blink as...  Shut-up. GALLO jabs the syringe gun towards the back of PAYTON'S head while putting one foot inside the pod.    Finish the code... 108.              Let me out. I can... help. PAYTON ignores him, typing rapidly into the keyboard.  I'll help you! Please- I can help! PAYTON runs over to the security door and hits a switch on the sensor. The door doesn't react.  What are you doing? You can't- You're trying to get on the bridge? PAYTON runs back to the console, typing into the terminal.  You don't want to go in there, Corporal. PAYTON throws him a glare, continuing to type in commands as the room erupts with activity.  What are you going to tell them? Huh? How are you going to explain that?     Where do you think you're going?  Think about what you're doing, sir-  You don't want to see what's in there-  We both know who needs this shot... 115.  Who's the one suffering... sir-  Corporal... PAYTON slams him against the wall, making him older.  Your mind... has turned against itself,     I was younger then you when I first came on board. Funny, I can't even remember what it was like... before this flight began. It's all I know.     Go ahead. Take a peek. You tell me. BOWER hesitates, looking toward the darkened windows. He stays with the weapon on GALLO as NADIA wanders toward the front control console, towards the glass. With the lights fading on the weapon, BOWER gives the lever a quick whirl, motioning the barrel closer.  What are. you gonna do, Bower? There's no one left to hand out merit badges. No one left at all.  You think God survived? He's gone... with the rest. There's no one left to judge you, Bower. NADIA approaches the glass, squinting towards the heavily smudged glass. She frowns, trying to wipe away the layer of sludge.  No world left. No law. No order. Only us. You the law now? You gonna be the one that brings order to what's left? Wanna take a shot at it? I did my best with what I was given. Wanna be King for a day? Give it a whirl, Corporal. I'd like to see how you fare. With the laser sights fading on the weapon, BOWER quickly cranks the power lever, keeping the gun raised- A slow grin spreads across GALLO'S face as he finally looks to him, revealing the thick streams of blood that have dripped from his nose, coating his chin and neck.  Try to imagine it. Imagine... yourself for five minutes without morality. I'll bet you'd surprise even yourself, kid-  Imagine... us both. What's left to stop you? I offer you the kingdom and you-  There's still quite a few sleeping beauties down there... a thousand flavors. You up for a little window shopping?   I wanna see it. I'll bet you'd be a  A real boy scout, is that it, kiddo?  You ready for the new world, corporal? BOWER keeps the gun on him as he goes to the windows. NADIA has a ghostly expression, unable to speak. BOWER leans toward the glass, squinting into the darkness and... SWISH! An object moves past the outside of the glass. He leans closer, squinting to see... a school of ALIEN FISH dart past. The shin is underwater. BOWER staggers in shock, back pedalling as GALLO continues to chuckle.  I guess this thing does land itself. Just doesn't float too well. BOWER lunges towards him and GALLO is ready for this one, quickly countering his move and SLAMMING BOWER into the console. He unleashes a vicious BLOW into BOWER'S throat. BOWER collapses, choking for air and GALLO kicks the gun away. He kneels over BOWER, slowly pulling out a blade.  My apologies. Ladies first... of course.          Well, if you're gonna be captain... what are we gonna do now? Off his look...  What is a King... without his Queen. He hits the control panel switch and...",
        "Leland": "No, no, no. Back in der' big boy! 79.  Whoa... WHOA! What the hell was that!? LELAND is exposed from his hiding place, waving the smoke from his face, bewildered. He's an older man who's lost all vanity over survival. A thin-framed, spidery little man with assorted clothing and a clutter of tools on his belt.  What did you do!? BOWER whirls the lever on the weapon and points it at him.  Where did you get that? BOWER angles the barrel towards a vent blowing out the chemical gas and LELAND jumps with fright.    Fancy looking piece. Looking to trade?  Com'in, com'in! Make yerselves at home. Just throw the coats on the bed and don't pet the rat, it's not mine. Just watching it for a friend. LELAND is excited to have guests as he runs along the catwalks, lighting candles and sealing valves. They watch him with leery suspicion, weapons still in hand.  Sublet. Got a roomier flat in the bow for the off season, but from here, ya just can't beat the commute. He grins, expecting a laugh, but doesn't get one. LELAND eyes BOWER over, admiring the uniform.  You really a flyer, or did ya grab that off the rack? i didn't think there was any crew left.  Well, only the captain. informally, mind you.  Umm, up on B-Deck. Some on C. A few pieces on the promenade and I think his nuts are in the foose-ball game in the rec room. 81.  Tough crowd. Com'in, com'in. Grab a bunk. Three singles or will a queen do? LELAND laughs to himself, digging through supplies. BOWER scans the walls, seeing no way up to the catwalks.  Oh, no-no. No-can-do. I'm real touchy to the dust bug and who knows where yawl have been. No offense. There's something funky going around. But don't let that spoil the party. Here... LELAND lowers down a bin filled with assorted food items, using a wire to drop it to them. TANAKA sniffs it with suspicion.  It's Kosher. BOWER peeks through one of the valves, turning to NADIA.  Why, where you gotta be?  Reactor? Now why would you want to go down there? You just woke up, didn't cha?  It's tough to properly season with a motor oil base. But if you use your imagination, kinda tastes like... Herb and garlic dog shit. Below the catwalks, TANAKA has found a spot to rest, NADIR is using water to clean a wound and BOWER is peering through a slit in a vent.  Mmmm. Lemme think. What's today, Tuesday? That would be about, mmm... He counts in his head and across his fingers, carefully calculating, then a grin.  No idea. He turns back to his make-shift stove, chuckling to himself.  I quit counting after the band broke up, ooooh twenty... thirty years ago. BOWER and NADIR exchange a look of uncertainty. The classical music begins to SKIP and without even looking LELAND kicks a piece of equipment, correcting the music.  Then again, an hour in this place feels more like... one-fifteen, one-twenty. Know whatta I mean? HA-HP_W! Not naming names but I'm writing a very strongly worded letter to the airline. LELAND chuckles, nodding to TANAKA. TANAKA glares. 83.  But I just treat each day like it's Christmas. Festive and violent. Let's eat; Shall we? Who needs a bib? LELAND sets several bowls of soup into the bin and lowers it to them with the cable. T_ANAKA is the only one interested, sniffing the soup with a glare. LELAND winks. BOWER takes a seat, showing exhaustion and defeat.  B0000OM! Oh, how the world cheered to the thunder of it's mightiest creation. Eylisium! The heaven for heroes, to venture further and farther then any of man's machine dared before it. BOWER and NADIA watch intently as TANAKA lazily sips the soup. The first image is off the ship's launch and LELAND hobbles across to the crudely sketched image of three figures, flight officers.  Three of our bravest... atop the watch tower as we slept. A slumber deeper then any have dared... with only three little Indians left to mind the store...  .until the last cry from home. All of God's creation... ending with mere words of encouragement. Mother Earth's last call. Boop! Leave a message, momma. LELAND presses a switch on a Jerry-rigged piece of equipment, a disc player... speakers crackling with static. A VOICE plays, heavily distorted.  Three little Indians, with the burden to bare... no more law and nothing left to care. Three poor souls, destiny undone. Chop, chop, chop... now there's only one. The sketches reveal violence between the three pilots, two of them killed, one remaining alive.  One little Indian left... all alone with his doom. 90.  Refused to go to bed, stayed up to play in his room. Oh, and what naughty little games he would play with the slumbering prey. Slayer, master, both God and the Devil, some would say. The boy would grow to manhood, a self-proclaimed King, ruler of his vessel, home to his own sin. The sketches show the lone pilot torturing and devouring passengers from their sleep chambers as he grows old.  And then one day the king cast out all those who had behaved, exiled into the barren cargo holds to fend for themselves... scavenging against the others within their own domain. The sketches show tortured victims forced out into the corridors of the ship, the King returns to his sleep chamber.  King Lonely no longer wanted to play... he yearned to see the morning Sun on a Tanis day. He returned to his bed of     Save yer questions til the end please. We'll have a review. LELAND continues his performance as NADIA leans toward BOWER with concern.  And now the newest chapter comes to us... three weary travelers, guided by the light. The new brave flyer, woken by the dying machine. He sketches Bower and his journey towards the reactor.  A gallant knight who will wake the fiery beast, light the rockets torch that will sail our mighty ship to port! A new king to deliver us to paradise! Hail to the new King... Hail! LELAND looks to see... everyone is asleep. He adjusts a nozzle that... is pumping a colorless gas out of the vents at the bottom of the tank. With a slow forming grin, he blows out a nearby candle, taking us into...   Whaw!? I waddn't-  Gas! What gas!? They see he's holding a fork and knife that he quickly tucks behind his back. NP.DIA jabs the weapon and he shrieks.    Who the hell are you gonna call-?     What did he say?  Not as cute when they're little, are they? TANAKA runs after it. It takes a moment for the rest to react, chasing after.  Little bastard rang the bell. They all quickly turn back, running down a side corridor and into...  This isn't going to work. Too many of them. Have to turn back.  Told you this wouldn't fly.     This is where they live. Reactor is the Keeper's temple. They watch and wait as the shadows move past the doorway with the GLOW of BLUISH TORCHES and vocal CACKLES.    You're crazy... You can't-  We made it! We- I'm with your boy. I was the one helping with- GALLO suddenly SLASHES his throat! LELAND reels back in shock, throttling his own neck in horror, blood gushing. GALLO casually turns back to the console, continuing to type as LELAND tries to cry out, his voice gargled with blood as he staggers, collapsing to the floor. GALLO hits a key and LIGHTS IGNITE, the last door finally engaging. GALLO sigh with relief as the doors slide open revealing a corridor of stairs leading to the bridge. A warm and gentle smile widens on his face.",
        "Shepard": "Shepard, Thomas L. Team Six. Sector Eight. I think I'm the only one, sir. I knew it. I knew you'd be coming.  Where's the rest of your squad?  Where's the shuttle?  Aren't you the... retraction team? The  You... just woke up? 44.  So... you don't have a fucking clue to what's happened? Is that it?   You know as much as I do.  You'll fit right in. i SHEPARD feels along the pipes until he finds one leaking oil. He vigorously begins to rub the oil onto his body.  Get the scent off.  I can't help you. I'm sorry.  They go off scent and sound as far as I can tell and they're a lot fucking stronger and faster they you'd think. 45.  When they come... run. Don't look back, no matter what.  I can't wait for you. BOWER is bewildered as SHEPARD poised like a sprinter, preparing to run.",
        "Manh": ""
    },
    "imdb_rating": "6.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNDQxNjc5NTMxNl5BMl5BanBnXkFtZTcwNjg2NDE4Mg@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Two crew members are stranded on a spacecraft and quickly - and horrifically - realize they are not alone. Two astronauts awaken in a hyper-sleep chamber aboard a seemingly abandoned spacecraft. It's pitch black, they are disoriented, and the only sound is a low rumble and creak from the belly of the ship. They can't remember anything: Who are they? What is their mission? With Lt. Payton staying behind to guide him via radio transmitter, Cpl. Bower ventures deep into the ship and begins to uncover a terrifying reality. Slowly the spacecraft's shocking, deadly secrets are revealed...and the astronauts find their own survival is more important than they could ever have imagined.—Overture Films",
    "name": "Pandorum",
    "genres": [
        "Action",
        "Horror",
        "Mystery"
    ]
}