{
    "filename": "Peggy-Sue-Got-Married_script.txt",
    "imdb_id": "tt0091738",
    "imdb_url": "https://www.imdb.com/title/tt0091738",
    "characters": [
        "Maddy Nagle",
        "Nancy Kelcher",
        "Elizabeth Alvorg",
        "Peggy Sue",
        "Richard Norvik",
        "Michael Fitzsimmons",
        "Carol Heath",
        "Arthur Nagle",
        "Barney Alvorg",
        "Evelyn Kelcher",
        "Charlie Bodell",
        "Rosalie Testa",
        "Walter Getz",
        "Jack Kelcher",
        "Delores Dodge"
    ],
    "dialogues": {
        "Maddy": "You two look like that soap commercial. Which one's the daughter and which one's the mother?   I wish I had the nerve. And the figure.   It must run in the family.   Peggy, would you find a table? We'll see you in a little while.    What kind of question is that? It has nothing to do with the reunion.    Peggy was a mess right after they separated, but I think she's coming out of it... It seems to be pretty friendly now..    Walter Getz.    Michael Fitzsimmons! Is he here?   Yes, ma' am.  They help Peggy up and lead her across the gym.   I was there. She told the creep off right to his face.   It's some stupid old movie thing they just started.   Therefore, the key to a successful children's party can be summed up in one word  planning.. With proper planning, a successful, inexpensive happy birthday party can be had by all. Including the mother.  She walks back to her seat.    Thirty kids are dancing, talking, snacking. One couple makes out. Walter, Leon, Terry and Doug Snell are crowded around a TV, watching an old western with Eugene Pallette or Edgar Buchanan. The boys laugh as Pallette or Buchanan growls a western cliche.    Charlie and Peggy are poised at the door.    Arthur and a few others stand by the bar, where bottles of Coke are lined up. Arthur carefully pours rum from a hip flask directly into the bottles. Peggy and Charlie enter.   Can you believe I want to marry that dork.   I was thinking of four ushers and four bridesmaids.   I'm thinking of pink and green.   Look at Dolores. What a tramp.   Maybe they'll be the next Dion and the Belmonts.   Come on, where's your enthusiasm?  Charlie SINGS directly to Peggy, grinning at her. In spite of herself, she smiles back at him. She's starting to realize why she fell in love with him. He's irresistible.    I don't know what you said to her, but I wish I'd said it.  Charlie and Walter walk over and accept \"BRAVOS\" from the girls. Walter does his James Dean imitation.    MUSIC FADES INTO the song \"PARTY DOLL\" by Buddy Knox.  Peggy is doing the Twist, showing Charlie and several others. Walter gets the hang of it, twisting on one leg.  Carol tries to keep up.  Maddy and Arthur are always a beat behind.   How come we're your best friends and we had to find out about you and Michael Fitzsimmons from Dolores?   That's disgusting!   Yeah. He's so cool and mysterious.   Peggy Sue!   But I always thought that you would marry Charlie, Carol would marry Walter, and I would marry Arthur. We'd all live on the same street and take our kids to the park together and have barbecues every Sunday. It'll spoil everything if you and Charlie break up. That Michael doesn't look like the barbecue type.   Yeah. I've gotta go. Arthur's picking me up soon.   Sometimes you're so immature.",
        "Nagle": "",
        "Nancy": "What are you doing?   Come on! Mom said you were sick. You're never happy to see me.   Teenagers are weird. And you're the weirdest.    Okay, what do you want? What dumb favor do you want me to do?   Look at Kenny Rossi. Isn't he dreamy? I wish he'd break up with Arlene. She thinks she's so great.   Why not? They're my favorite.   Peggy Sue! Hurry up. Fabian!  Peggy steadies herself as CAMERA TRACKS her back into the living room.   What's for dinner?   Yeech, not again.  Peggy leans forward in the recliner eating the candies. Bemused, she looks at Nancy watching TV and into the kitchen where her mother is slapping together meatloaf.   Like wow! Wait till I tell Diane. She's always bragging about her father's Cadillac.   Can I borrow this sweater?   Pass the toast, please.  Peggy passes Nancy the toast.   And the butter.    DADDYo.   Can I tell Diane that Peggy Sue got drunk or is that a deep family secret?  Well?   She's distorted.   She's almost a juvenile delinquent.  Mr. Kelcher gives Nancy a look and points to the door. Without her father noticing, Nancy creeps up behind him and makes rabbit ears behind his head. Charlie tries hard not to laugh. Nancy continues to clown.    Peggy is helping her sister Nancy with an art project.   You think this'll cheer Dad up?    Nancy is frightened.   Does this mean we're going to be poor?  Peggy leads her back into her room without letting her parents know they were there.   But Mom helped.",
        "Kelcher": "The car pulls up to the curb. Peggy gets out of the car. Maddy hands her the note and her books; she twirls her finger next to her head.    Peggy enters and looks down the hallway into the kitchen. EVELYN KELCHER is a lovely woman in her midforties. She turns around from the sink and approaches Peggy.   The nurse called and said you'd be coming home.  Peggy stares blankly at her for a beat, then holds up the note, as she moves towards her mother.   How do you feel?   Why don't you go lie down for a while.   Of course, dear. You're home now.    I put your laundry on your beds. Don't forget to put it away.   Meatloaf.   Girls? Evelyn? Who left this thing outside?  He turns and heads back outside.   What is it?  Mrs. Kelcher and Nancy follow him outside. Peggy staggers to the front door and leans against the door jamb looking out at the family.   What do you think?    Oh, Jack.   Peggy Sue, what do you think?   Young lady, you're drunk!   I don't see the humor in this. Go to your room immediately. You're grounded.   Jack, take it easy. She gave blood at school today. Maybe she's just a little lightheaded.   This is not giving blood. This is drunk.   Evelyn, put her to bed.   My little baby. Don't try to grow up so fast.   A new car. We can't afford a new car.   Don't worry, it's just a seasonal slump.   You have four seasons, you have four slumps.   What happened to your hair? You have such a pretty face. Why are you always trying to cover it up?   You're looking pretty chipper this morning.   Thank you.. I accept your apology with the hope that what went on yesterday will never happen again.   You're so young, this is not the time to start acquiring bad habits.   When did you start drinking coffee?   If all the kids jumped off a bridge, would you do that too?   Well, at least you stopped calling me DaddyO.   How does Diane like her braces?   What's the matter? Did you two have a fight?.   What about?    Peggy exits the house wincing at the sight of Charlie's car, the blue Impala she'd seen the day before. Charlie sits, one arm on the wheel, the other over the back of the seat.    Peggy comes home, enters hallway.   This necklace is sapphire, it was my Grandmother's.  Peggy Looks into the living room.    Peggy hears her mother let the man out. She enters the kitchen.   It was nobody. Ah... he's a poll, taker. I'm thinking of voting Democrat this year. But don't mention it to your father. How was school today?   Would you get that, dear?   Peggy! What's the matter? Who is it?   Peggy Sue! What is it?  Forcing herself to regain her composure, she sits down at the top of the landing as Mrs. Kelcher joins her.   What happened to you?   Well, she is getting on, but she's fine. I told her you weren't feeling well yesterday. She called to find out how you are.   Yes, he's fine, too. You saw them at Easter.   That's a good girl... I hate to see you so upset.  Tell me, sweetheart. Are you having problems with Charlie? You mentioned something this morning.   Is Charlie pressuring you to do things you don't think you should be doing?   Peggy, do you know what a penis is?  Stay away from it.    Charlie pulls up to the curb, opens the glove compartment, extracts a can of Old Spice aerosol, sprays the seat; and exits his car, throwing a kiss to it as he walks up to the door.    Mr. Kelcher opens the door, Charlie enters.   Hello, Charlie.   Fine, thanks. Come on in. I want to talk to you.  CAMERA TRACKS Charlie and Mr. Kelcher into the living room. Mr. Kelcher sits on his recliner, Charlie, nervous, on the couch. Nancy is on the rug, studying.   You may have noticed that Peggy Sue's been acting a little strange lately.   She seems confused, irresponsible, overemotional. My wife says that's the way girls act sometimes.   Charles, in spite of your adolescent infatuation with music, we've always regarded you a a fine young man. We've trusted you with our daughter.   Charlie's downstairs. Why aren't you ready?   Maddy's party.   You accepted an invitation, Maddy's one of your best friends, and I baked the Rice Krispie squares.  Peggy laughs.   Enjoy yourself! This is the best time of your life. And the sooner you learn to handle Charlie the better. Get dressed.  Mrs. Kelcher closes the door.   We think this party might cheer her up. Just make sure you know what's expected of you.   Show her a good time, but for God's sake restrain yourself.    Peggy and Charlie exit and walk towards his car. Peggy's holding a pan of Rice Krispie squares. Charlie slips Peggy's sweater back on her shoulder. He's trying hard to make up.    Charlie drops her off.    Peggy walks up the path as the MILKMAN approaches.    Peggy enters, trying to be quiet. Mr. Kelcher stands inthe kitchen doorway in his bathrobe waiting for her, steaming.  CAMERA TRACKS Peggy into kitchen. She grabs a cup ofcoffee before sitting down.   Where have you been?   Damn that Charlie I    Peggy, let me ask you something.  You're not... expecting are you?   Thank God for that.   Yes but I was a boy. And I still had hell to pay.   All right. But this better be good.   Do you know how ridiculous you sound? First of all, it's illegal for U.S. citizens to buy gold. And in the second place, the price of gold is regulated by the government.   That's your problems The more women think, the more trouble they get into.   I've heard just about enough of this lunacy! Go to your room!   Evelyn, take her to her room!  Peggy stalks out of the kitchen to the front door.   I'm not the maid!    Alone in the store, Mr. Kelcher is going through some receipts. Peggy enters carrying a shopping bag.   Doing some shopping?  Peggy reaches into the shopping bag and pulls out a small wrapped box.   For me?   Sweetheart, they're beautiful. But they must've been expensive.  Across the street an ice cream truck pulls up. Mothers, fathers and children crowd around the back as the driver exit the cab.   Good, you got your money out of that greedy bank.   It's hard to believe you're going to be eighteen.  Want an eskimo pie? Or a creamsicle? I'd come home from the store and there's little you running up to me. I'd give you a dime and you'd promise never to grow up.   This morning was good.   I, that what all that nonsense was about this morning? You're worried about my business?   That's very thoughtful, honey. It's just a slump. Things will pick up.   Kennedy's a Catholic. He'll never win.   Richard Nixon's going to be President. Nixon wears hats.   I don't need your charity. I don't need your grandmother's jewelry or your parents money -how could you do that?   Please don't shout.  Peggy opens the door, Nancy cautiously behind.   I'm not shouting. Have we ever starved? Have we ever missed a mea1?   Does everybody have to hear?   I want everybody to hear because I don't have anything to be ashamed of.  Mr. Kelcher collapses into his barcalounger, red as a beet.   Jack, I was just trying to help.   We'll make it, we'll be fine.    Peggy turns to face her parents, holding up her homemade pantyhose with a flourish.   This is your great invention?  Would you wear those things?   Would they go over my girdle or under?   Jack, I think she's got something there.   That's all well and good, but we don't have the money to manufacture them.   Isn't that awfully forward?   You mean to tell me that you invited this Mr. Fitzsimmons over to talk about investing his money in your cockamamie idea?    We HEAR distant CHURCH BELLS. Peggy sits down to scan the large Sunday newspaper. Seeing her mother's phone book, she finds the number she needs and picks up the phone. She dials slowly.    Mrs. Kelcher stands at the counter preparing a pot roast. Peggy's making a chocolate mousse.   You know, dear, I think the pantyhose is a wonderful idea, but the next time you come up with something, please don't stay out all night. Just tell us. We'll believe you.   What's pasta?    Peggy and Mrs. Kelcher are setting the table, taking the good china out of the cabinet. A dozen red roses grace the table.   These roses are beautiful. And so romantic'. Who is this Michael? Is he a friend of Charlie's?  She moves the Jell-O mold.   What does Charlie think about that?    What? When did it happen? Your dad and I always expected you two to get married.   Of course I loved your Lather. I remember once being offered a scholarship to art school. But I turned it down.   All the college girls I knew were so well, dressed. I was worried that I wouldn't fit in. I didn't have the right clothes. I was so silly. But, I don't have many regrets, and besides, r don't have time to worry about the past. But Charlie. I hope you know what you're doing.   Peggy Sue cooked the whole dinner.   Ah, Ed, why don't you and I adjourn to the den for a while?    Peggy~ and Michael stand by Michael's motorcycle, passing a cigarette.    Michael and Peggy pull up. Peggy gets off the bike and gives Michael a goodnight kiss.    Mrs. Kelcher finishes the dishes, with rubber gloves on. Mr. Kelcher sits, cleaning his pipe. Peggy enters.   It's the darndest thing. Ed knew what they were immediately. As a matter of fact, he said he's got a product like that in development right now.   Didn't call, them pantyhose, though. What was it, Evelyn?   Sheerotards. Catchy name, isn't it? Like leotards.   Peggy Sue, watch your mouth.   Mr. Fitzsimmons is a very prominent man.   Look young lady, I grew up through the depression. I fought in the second World War. Six days a week I get up and deal with the public, the bank and the bill collectors. And on the seventh day, when God rests, I don't have to listen to my daughter calling me a fool!   You have a point, dear.",
        "Elizabeth": "Peggy Sue!  Peggy slowly walks down the steps, moved to tears. She approaches her grandparents and drops her suitcases. She hugs them tightly. The bus door closes and the bus pulls away behind them.   I've already got some in. I was thinking of making a pie for dinner tonight.  How would you like that?   That's a day's work. But if that's what you want, maybe we can do it tomorrow for your birthday.   You know, Peggy Sue, your mother said you had a dream that I died.   I'm not afraid. I know exactly when I'm going to die.  Peggy is perplexed by her grandmother's apparent lack of fear.   I'm not telling.   If you believe it, darling, then I believe. Being young can be just as confusing as being old. The things that happened to me fifty years ago are more on my mind than what happened yesterday.   Right now you're just browsing through time. Choose the things you'll be proud of. The things that Last.   What's Peggy Sue going to do at your lodge meeting?   He won't tell me, but I've got my suspicions. And I don't want any of that. Don't keep her out late.   Have a good time.  Barney and Peggy open the door and exit.",
        "Alvorg": "",
        "Peggy": "Over BLACK, we HEAR the sounds of an old TAPE RECORDING. Young VOICES are filtered amid a noticeable hum, hiss and crackle. We HEAR giggling and then someone named Charlie making vows of love to someone named Peggy Sue.   Peggy Sue.   Don't say that...    A splitlevel house on a slight grade of lawn. A red Honda the driveway.   Charlie...   I can't. I'm too embarrassed.   Yeah. Come on Charlie, turn it off.    Janet is seated in Charlie's car.   There's something pathetic parked in front of my house.   I'm still waiting for the mortgage check.   Well, today's Saturday and it's still not here.   That stays.  The workman looks to Charlie for approval. Charlie nods. The workman shrugs, and heads back to the basement.   I don't buy them anymore. You were the only one who drank them.   I know. Put Scott through college.   Are you taking Janet to the reunion tonight?   Bye sweetheart.  Peggy and Charlie look at each other as Scott leaves.    Peggy and Beth carry the cake boxes into the car  A NEIGHBOR trimming the hedge watches them lasciviously.  Peggy and Beth drive off.   If the pastries aren't here by nine thirty, call Monica and threaten her life.  Peggy gets into the car, and blows a kiss to Beth.   I'll be back by noon.  Peggy drives off as MONICA drives up. She exits her car and begins to unpack cake boxes.    Peggy is driving. On her car radio, we HEAR a local PHONEIN  Oh, Dolores.  Peggy switches stations until she finds the news.   Carol!   1 just did it for the reunion. I thought it would be fun.   This is my old friend Carol.. I told you about her.  Beth and Carol exchange hellos.   How do you like my hair?   Turn that off.    CAMERA PULLS BACK from the TV into Peggy's bedroom. Beth gets up from the bed and turns off the TV. Peggy enters from the adjoining bathroom, wearing a robe, and bobby socks with saddle shoes. She picks up a gold Locket from the dresser, and puts it on.   I have a lot of unresolved feelings about him. I don't trust him. Besides, I hate those commercials.   But I want you and Scott to understand.  Do you think he loves Janet? Maybe he's smashed too many fortune cookies.   Then we'd both have a miserable time. What do you think?  She looks exactly like a sixties teenager.   Borrow?! This was my dress.  Maybe it's a mistake. What if I'm the only one? I don't even want to go. Everybody's just going to say...  Hi.. Where's Crazy Charlie?   Not from the guy with the lowest prices in town.   I feel ridiculous. Maybe I should go home and change.   I don't know. Reunions do funny things to people.  At that moment they're joined by MADDY. and ARTHUR NAGLE, coming up behind them. A typical polyester couple. Hellos all around and hugs. Arthur puts his arms around Beth and Peggy and leads them up the stairs.   It was Beth's idea.   Arthur, please don't call me Peg.   Beth's boyfriend is playing in the band.   Okay.  They walk away into the crowd, leaving Peggy alone.   I was once. Richard!? Richard Norvik? I didn't recognize you.   I just did it for tonight. I don't normally dress like this.   Hello. Nice to meet you. Please call me Peggy. I'm Peggy Bodell now.   He's not here. We're getting divorced.   I don't know how you do it. I've never even dated anybody but Charlie.   We did for a long time. We just got married too young, and ended up blaming each other for missing out on things.   It's not the place. I don't buy that.  Trapped in the same town forever. The price she would pay for her teenage lust.   Oh, it's not so bad. I have two wonderful kids, my own business.  Still, knowing what I know now, if I had the chance to do it all over again, I'd sure do things a lot differently.    Peggy sits with Richard, Sharon, and two other couples, TERRY and LISA and LEON and SANDY.  A hand gently touches Peggy on the shoulder. Peggy turns around and sees ROSALIE TESTA, a small woman with close cropped hair. She's in a wheelchair. She wears a plastic badge: REUNION COMMITTEE.   Rosalie Testa!  'HELLOS' all, around. Peggy helps Rosalie position her wheelchair at the table.   You have an incredible memory.   Yes. These are my children. But they're not babies anymore.     Michael Fitzsimmons. I had such a crush on him.  Carol and Maddy join them, still panting from dancing.   Your first boyfriend. What do you think? Any sparks left?    Walter Getz.   Sharon Norvik this is Carol Heath, and Maddy Nagle. My oldest and dearest friends. Sharon's married to Richard.   No. I asked Rosalie. She couldn't track him down.   He was the only one in high school I wished I'd gone to bed with.   Well, besides Charlie, of course.  We HOLD on the photo of Michael and...   Well, you showed them. You're rich and famous and successful. And you have a beautiful wife.   What was?   You're a sweet man, Richard.   You know, I never told anybody this, but I always had a feeling that when you die, before you go to heaven, you get a chance to fly around high school for a while.  CAMERA PULLS BACK SLOWLY as Peggy and Richard become part of the sea of dancers, all Lost in nostalgic reverie.    Looking at Charlie.    At opposite ends of the reunion, but aware of each other.    They all look to Richard, knowing he's the obvious choice.    I can't. It's all too much.    Thank you.. Thank you very much.  The lights dim, leaving Peggy in the spotlight. Continued APPLAUSE as the singer steps up to his mike and begins to SING the song PEGGY SUE.    People starting to clap and sing along. Carol and Carol's POV: a blowup on the wall of Carol in the senior play. Walter and. Walter's POV: a photo of Walter on the basketball team. People leaving their tables, surging towards the stage, drawn by the music. Maddy and Maddy's POV: a photo of Maddy and friends mugging for the camera in the cafeteria. Charlie talking to Carol.  Peggy begins to cry softly. The images begin to melt together, pulsing to the music. Peggy is the focus of everyone's nostalgia. A wave of time washes over them.  She remains onstage, looking past the crowd to the photo of her and Charlie.  Peggy onstage, eyes closed, swaying to the music. Walter and Carol join hands, walking towards the stage. Rosalie in her wheelchair, doing the hand jive, crying.  The entire crowd swaying to the music, looking to Peggy, repeating the chorus over and over.  Beth notices her mother's state of emotion. Peggy collapses onstage. We hear SHOUTS and SCREAMS. Richard, Arthur and several others crowd over Peggy. Beth rushes to the stage, reaching out to her mother. Charlie too.    CAMERA PULLS BACK to INCLUDE Peggy lying on a cot. She wears the same dress she had on at the reunion. She's terrified. We NEAR a smattering of background noises: NAMES are CALLED, NURSES helping, etc. Looking up she sees: The IV.  The NURSE taking the IV out of her arm, and placing a vial of blood on a tray with several others. Peggy sits up slowly, dazed and frightened. She looks at the nurse.   Charlie! Am I dead?   What's going on? Where am I?   How did I get here?  Maddy and Carol approach, carrying their books.   No thanks. I gave them up years ago.  Maddy and Carol react as Peggy takes a closer look at herself and the girls' reflections. She places a hand to her throat, noticing the locket is gone.   Where is it?   Maddy, what did you do to your hair?  Maddy looks in the mirror.   That's okay. I'm sure I'll remember the way.   Yes. Let's stay in touch.  Peggy walks up to the door, a sleepwalker in suspended animation. She waits a beat and knocks softly.   Peggy.  Peggy Sue.    Mom!   I have a note.   I'm excused.   Mom!  Peggy embraces her mother, holding on for dear life, inhaling her scent.   Chanel Number Five. That always reminds me of home.   I'm home now.    Peggy enters warily, looking around, a fifties museum of teenage artifacts. She walks around the room gently touching her old belongings including the record player from opening scene. She looks in the mirror to make sure she's still there. Suddenly, she turns around.   Okay, I'm alone now. Is anyone here?  She opens the closet door expectantly, then closes it shaking her head.   No. This is crazy. Is somebody going to tell me what's going on? Why me? What happened? You don't have to show up. I don't have to see you. Just send me a sign.  Thanks a lot. 1 guess I'm on my own.  NANCY, Peggy's twelveyearold sister, peeks in the room.   Nancy! Come here.  Nancy tentatively approaches. Peggy hugs her.   I'm just happy to see you.   I'm sorry about that. I really want us to be closer. I have enough unresolved relationships in my... life.   Let's do something together.. Do you want to play Monopoly? Or Careers... Clue... Snakes and Ladders?   It's unbelievable. The man never ages.   Don't eat the red ones.   They're bad for you. They cause...red lips.  Nancy react, as Peggy stands. CAMERA TRACKS HER to the den.   Can't hurt. I'm already dead.  She belts down several drinks.    The family admires a new red and white Edsel.   Oh, Daddy. You were always doing things like that.  That's funny! That's really funny.  She staggers over to the car and falls against it laughing. Mr. Kelcher crosses to her and catches a whiff of her breath.    Just a little. I've had a tough day.    Grounded? Ha! The story of my life. I don't wanna go to my room. I wanna import Japanese cars. I wanna go to Liverpool and discover the Beatles.   Dad, I never knew you had a sense of humor.    Peggy lies in bed, her mother tucking her in.   Oh Mom, I forgot you were ever so young.    She hears her mother walk down the stairs.    Peggy emerges from the bathroom wearing a towel.   Let's get physical!... Let's get metaphysical!  Nancy comes in dressed for school.   Good morning.  Nancy goes to Peggy's closet.   Yeah, but take good care of it.I'm saving it for my daughter.. She loves this stuff.   Oh. I forgot.  Mrs. Kelcher takes an elastic band from around the faucet and hands it to Peggy as she sits at the table. Peggy makes a ponytail.   I'm still here, aren't I? I may as well enjoy myself. I'm going to go to school today.  Dad, I want to apologize for yesterday. The car is a classic. Use it in the best of health.   That would be impossible.   Mom, is there any coffee left?  Mrs. Kelcher begins to pour the coffee, then pulls back, spilling some on Mr. Kelcher.   Oh.Ah...recently. All the kids drink it.   I think I'm way ahead of them.   You know, you two are wonderful parents. I'm really going to try to behave myself.   Mom, sit down for a minute. This is so nice, all of us being together again like this.   Oh yeah. Charlie. How am I going to handle him?   Sort of.   The house payments.   Pretty strange.  Peggy hesitates, unsure how to handle her accumulated ambivalence towards Charlie.   Not now, Charlie. I've got a headache. Get used to the word. Roll it around your tongue for a years.   You drive like a maniac!   Oh yeah?   Refresh my memory.   Maybe I blocked it out.   Why wait?   They'll learn to live with it.  Peggy exits the car and heads towards the school. Charlie sits, stunned.   Would you?   Where's Rosalie Testa?    Test?    Mr. Snelgrove, I happen to know that in the future, I will never have the slightest use for algebra. And I speak from experience.  The class gasps, a few students APPLAUD, and Mr. Snelgrove's jaw drops.   Mr. Gilfond, can I talk to you?   I just wanted to tell you how much I enjoy your class. You taught me a lot and... you're a very fine teacher.   Thank you. Um, I also think you're underpaid.    What do you mean?   Arthur, please don't call me Peg.   I don't get it.   I'll be right back.     Congratulations on the math contest, Richard.   Get lost you macho shmuck.  Doug and Richard react.   I have to talk to you. It's very important.   It's not that. Can we meet after school? Please?   All.... Okay. Sure.  Peggy walks to the front and faces the class, smiling primly.   Choosing a good nursery school can be one of the most important decisions you can make. It will often determine your child's attitude towards education and schooling.  Of course, the lessons learned are primarily social  sharing, being considerate of others.  And they're so cute when they're little. They bring you back their Little masterpieces every day and you put 'em on the refrigerator door. They're so proud, and their names are all misspelled. Scott would always print his S backwards, and Beth would make her sweet little flowers...  Peggy wipes away a tear. At the stunned reaction of the class and Miss Otto.   Thanks.   I thought it had a lot of merit.   Rejected, worthless, miserable.   Good.  Peggy turns, and walks away. Charlie looks miserable.   What a great kite.   I want to ask you a question.  Do you think...time travel is possible?   Sort of.   What's that?   Iknow what a burrito is.   What's inside?   So you think time travel is possible? For people?   Listen, you've gotta keep this a secret. You can't tell a soul. Promise?   This is serious. Nobody can know. Ah, I've returned from the future. I traveled back here 25 years.   No. Really. You're the smartest person I know. It sounds unbelievable. But I can prove it.   You have a blind grandfather. One day you're going to invent a machine that reads books for blind people. I read about it. You're going to be famous. You're going to invent a lot of things.   Because I'm telling you the truth. I know what's going to happen. There's going to be test tube babies and heart transplants. And an American named Neil Armstrong is going to walk on the moon. On July 20, 1969.   I don't know.  Oblivious, Peggy and Richard walk by Shower's Cafe. Inside, Dolores and Carol see them.   That's why I was getting a divorce..  What I really think is that I had a heart attack at the reunion and died.   Come on, Richard, I'm serious.   Am I dead or not?   What're you doing?   No! I don't want to die!   What if it's beyond science? What it it's God?   I don't know.   I told you, I've already lived my life. I don't know how or why I'm here, but you have to help me get back. I want to get back to my real life!   I'm trying. I'll see you tomorrow.     Her mother is sitting on the sofa with a strange MAN in a suit. She's served him tea. There are several, pieces of old jewelry spread on a cloth on the coffee table. The man is examining one of the pieces. Mrs. Kelcher seems surprised that Peggy's home from school.  Peggy moves on into the kitchen.   Who was that man?   It was great to see everybody again. But it's so boring and regimented. Most of what they teach is useless. The worst thing was lunch.  The TELEPHONE RINGS.   Sure, Mom.  Hello.  Peggy gasps. Mrs. Kelcher turns to her.    It's Grandma. I can't talk to her now.  I'm sorry, Grandma.  Peggy hands the receiver to her mother and runs out of the room sobbing. Her first confrontation with mortality.   I had a dream that Grandma died.   She did? I love her so much, and I haven't seen her in such a long time. And Grandpa Barney. Is he all, right?   I'm sorry, Mom. I'll call Grandma back and apologize.   I'm confused about a lot of things right now. Charlie's only one of them.  Two beats.   What do you mean?    Peggy is changing a record. She sees the dress she was wearing the day before  slung across a chair. As Peggy picks it up, a book of matches falls out. Peggy picks it up, excited.  INSERT: MATCHBOOK which reads: FINISH HIGH SCHOOL IN YOUR SPARE TIME. Peggy frantically searches the dress pockets and slowly draws out two joints. She stares at them for a beat.    Oh, Beth.  There's a knock at the door. Peggy quickly hides the joints. Mrs. Kelcher opens the door.   For what?   I don't feel very festive.    walking downstairs, surprised by Charlie and Dad talking.   Where did you get that sweater?   It's really Fifties. You sort of clash with the world.   Right. I promised my mother.    Charlie, how are you?   Seriously. What's it like to be eighteen?  Charlie looks thoughtful, then guns the engine.   Hi, guys.   Why I oughta!  The boys all crack up.   You know, I never could figure that one out.   Don't get your hopes up.   He is kind of cute, isn't he?   He does?  The group finishes the song. Charlie blows Peggy a kiss. The crowd APPLAUDS, including Peggy. Dolores joins Peggy, Carol and Maddy.   First of all, Richard is not a creep. He happens to be an exceptional person. If any of you gave him half a chance, you'd find that out.   Dolores, can't you be a little kinder to people? You don't even know the boy. If you weren't so neurotic and insecure, maybe you'd shut up for a while and show some compassion.   Touchy, touchy!  Dolores storms away.   Charlie, what do you think of Richard Norvik?   He's trying.    Come on, let's dance.   You're pretty charming when you want to be.   Mmm. This is nice.  I always loved the way you kiss.  I missed you.   You really love me, don't you?    Charlie, let's make love.   A lot's happened since last weekend.    I probably meant it when I said it.  Doesn't Lucky Chuckie want to come out?   You know. Your love machine... the throbbing thrill hammer... your thing!   This is a mistake. We better forget it.   I'm sorry Charlie.   Monica? Aren't you Monica Hines?   Ah... never mind. Can I have a coffee, please? And a cinnamon cruller.  How's Bobo?  Peggy notices Michael staring at her. Peggy smiles, Michael doesn't. Monica brings Peggy her coffee and donut.   You're kidding?  Picking up her donut and coffee, she walks over to Michael's table and sits opposite him.   I was impressed with what you said in English class today.   You don't?   Maybe you're confusing his life with his work.   The young man leaned back in his chair. No bulls would die today.   Coffee and a donut.   Hey, man, I'm a hip chick.   Yeah. I'm surprised. It's really old...  Travels well though.  You know, the world looks a lot better from up here.   What are you shooting for?   Don't you get along with your parents?   They care about you. They're just a different generation.   I already did that. I want to be a dancer, I want to dance.  Peggy takes off her sweater, kicks off her shoes and begins to dance. Her eyes are closed, her body silhouetted by the moon. Michael is transfixed. After a few beats, he walks over to her. He stretches out his arms and places them around her neck. They sway together for several beats, their bodies touching. Peggy opens her eyes and sees Michael gazing at her tenderly.   Is that one of your poems?   I'd love to.   Michael... you're as good as you looked.  His other hand reaches to undo her skirt.   I envy you. You have your whole life ahead of you and you know exactly what you want to do.  But forget the rat puke; write something beautiful.  Peggy lies back down on the ground. Michael takes her hand and kisses it.   You know, this isn't really happening.  CAMERA PULLS BACK to include the entire, perfect tableau: the starry night, the motorcycle, the clouds racing across the moon and the two lovers on the mountaintop.   Thanks, Ralph.   I went for a drive. Up in the hills.   It's not Charlie. It's me.   At my age? Don't be silly.   Dad.. it's not a big deal. Didn't you ever stay out all night when you were young?   Calm down. Just listen for a minute.. Please.   I want to help with the family finances. I want you to buy some stocks. And gold. By 1980 gold is going to be worth eight hundred dollars an ounce. Then you sell.   I think they're going to deregulate it.   Oh boy, that's another thing that's going to change. Who's going to think for us? Our husbands? You know, you treat Mom like a maid. It's not entirely your fault. Those were the attitudes in the fifties, and that's the way you raised me. But give Nancy a break, encourage her to go to art school.   Listen Dad, please. Buy IBM, buy Polaroid, buy Apple Computer. No, no. Not yet. Buy Xerox!   Way to go, Mom!  The Kelchers glare at each other~. We HEAR the DOOR SLAM.   I'm just not the type. Besides, I want to get out of here.   I tried to tell them, but they wouldn't listen to me.   Richard, take it easy.   How come you never ask me any important questions? Don't you wonder if there's going to be a nuclear war? Or a cure for cancer? What about your family? What about people?   Give me some credit, will you?   Wbat're you talking about?   Sixtyforty.   Okay, find yourself another vision.   When do we start?  A WAITRESS approaches their table.   Quiche Lorraine, spinach salad and a Perrier.   Dry cleaners. No real change. Just higher prices.  They move next door to a shoe store.   Ah. This is a biggie. Forget sneakers. Running shoes, jogging shoes, tennis shoes. Fifty to two hundred dollars a pair.   There are major fortunes to be made here. Leisure time and lifestyles.   Not for you. Okay, there's lots more.  They move along to the next window, an appliance store. The window is filled with old televisions, record players, large rotisseriebroilers, etc. The store sign reads: BODELL'S TV AND APPLIANCES. Another sign reads: COME IN AND LISTEN TO  Look at that stuff. It's like the dark ages. This is more your speed. And boy, do I know this business.  Peggy peers into the store again and catches a g1impse of Charlie serving a customer.   You don't have to use pig Latin! Nobody could possibly know what we're talking about.   Oh.And huge portable radios. Everything else gets small, but for some reason, portable radios get enormous.  Peggy looks up and sees a lingerie store across the street. She heads towards it, calling:   I'll be right back.  Peggy enters the Lingerie store. After a beat, Peggy emerges from the store, excited and empty handed. Dodging traffic, she hurries back to Richard.   Richard! They don't have any! They never heard of them! Isn't that wonderful?   The wave of the future! I've decided on our first fortune! I'll see you later. You just think high tech.   Woody! How ya doing?   Nice to see you.   What do you know about classical music?   Charlie. About last nights..   But I'm not. I'm a grown woman with a lifetime of emotional experiences you couldn't possibly understand.   Why?  Charlie cups her face in his hands, pouring out his heart.   What am I going to do with you?   Hi, Dad.   Open it.  He opens the present.  Inside are a pair of miniature golf ball cufflinks.   I closed my Christmas club.   I wanted to apologize for this morning.   Quiet today?   The hat business is in trouble.   Yes.   But when John F. Kennedy's elected President, men'1l stop wearing hats.   (gravely; closing her eyes He'll win.   Of course, he'll love it. You're a terrific artist.  We HEAR Mr. Kelcher arguing loudly from downstairs. The two girls freeze.    Mrs. Kelcher moves around the room, closing the windows.    We HEAR the song \"Stranger in Paradise\" from Kismet on the old black and white record player from opening scene. Peggy sits on the floor, surrounded by stockings, leotards and a sewing basket. She cuts the legs oft a pair of leotards. In one hand she holds up the top half of the leotards, in the other hand, a pair of nylon stockings.  We HEAR a KNOCK on the bedroom door. Peggy pushes everything under the bed as Maddy and Carol enter.   On what?   She's unbelievable. Who needs satellites when we've got Dolores's mouth?   Did you memorize the whole book or only the good parts?   You're kidding...? Carol, you have beautiful hair.   He's very interesting. For all his pretending to be a tough guy, he's really got the soul of a poet.   That loudmouthed little bitch~   Cool it kids. He's free to see other girls, if he wants.   I'm not going to marry him. I just went out with him once.  I know! Why don't we go to the movies tonight. Just us girls. It'll be fun.   Okay. But let's have a girls night soon. Maybe a pajama party.   Ta da! Pantyhose! The death of the garter belt! Of course, once they're manufactured they'll look better than this. What do you think?   Instead of a girdle. And light as a feather.   And we won't just sell them in department stores. We'll market them in drug stores and supermarkets.   You need a partner. There's a friend of mine at school whose father makes seat covers for cars, Mr. Fitzsimmons. I've invited him and his family over for dinner tomorrow night.   We've got to move fast. This is an idea whose time has come.   Wrong, Dad. Your idea.    A breeze blows through the open window Peggy sleeps fitfully, tossing off the covers. We HEAR NOISES from outside her window. A figure appears outside and silently climbs into the bedroom. Peggy mumbles Charlie's name. The man walks over to her bed as Peggy reaches out for him, tenderly, as if they were still married.   Charlie. I just had the strangest dream.   What are you doing here?   I bumped into him after you dropped me off Last night. I didn't feel like going home, so we went for a ride.   You know I never could stand your sarcasm.   And why do you always refer to yourself in the third person, like Napoleon? How come it always turns into an argument with you?   Charlie,. I've been trying to postpone this. But what's the point? It's over.  I don't want to hurt you. This is very hard for me. I'm doing this for both of us. I really want you to be happy.   That won't make any difference. We just can't live together. And you had the nerve to drive up with that bimbo Janet.   I just can't trust you anymore.   That's just it. You can always get to me. There's this window in my heart and every time I leave it open, you climb in. Unless I close it now, nothing's ever going to be different!   Everything. I have a good head for business, I should be franchising the bakery. And I want you to give me your word that whatever happens, you'll go to college. And finish.   I'm trying to save you years of frustration... waiting for a big break... no. Waiting for that big disappointment so you could blame it all on me.    Hello, Grandma. It's Peggy Sue. Much better. How are you? I'm very sorry about the other day.    Hi, Richard.   Jogging. I was running, now I'm jogging.   Yep. It's going to be a law.  I broke up with Charlie last night.   It was an unfair fight. He didn't have a chance. I'm taking a real gamble. I loved him for a long, long time.   For God's sake, forget the money! I'm going crazy! I'm a walking anachronism. I'm a puddle of deja I'm worried about my kids, Scott must be scared to death, I think my daughter's doing drugs again. I can't have any fun here, I don't have that innocence any more. I can't keep all this in anymore. I feel Like I'm going to explode.   Like what?   What do you know about hypnosis?   Look, I'm desperate. I'll try anything. But what if you can't snap me out of it?    Peggy Sue Kelcher.  Or, Peggy Bodell.  I'm not sure.   Ah..... they're very tiny... they look like a fingernail made out of an erector set...   I think it's called silicon. Charlie told me that.   We were lying in the sand. It was my eighteenth birthday... We were so awkward... I would have married him anyway...  Peggy starts to shift in the chair. Her shorts hike up, her legs spread slightly. This is not lost on Richard. Weird, guttural sounds begin to emanate from his throat.   No. The Pill will change all that. Then he wouldn't have blamed me. We were just too young.   No. The Pill will be for birth control. But girls do like sex. Maybe not the first time.   Yes, every day. (taking her blouse off  getting spaced) Maybe I shouldn't have worn that dress? I told Beth it was a bad idea. That's why they made me Queen.  Peggy's meandering makes Richard nervous.   I couldn't help it  I loved him.   Richard! You should be ashamed of yourself.   That's just perfect isn't it? Did it work? Did you find out why I came back?   God dammit! How'm I gonna got out of here?  Peggy grabs a glass beaker and hurls it against the wall.   Oh, go feel up your hamsters! I hear rodents put out.  Peggy storms out.   Mom, how about a machine that's like your blender, only it slices vegetables, kneads dough, chops meat and even make fresh pasta?   No, just a friend of mine. I don't think he Likes JellO.   You know Mom, it's okay to have male friends. Besides, it's over with me and Charlie.   Yeah, I know Peggy Sue gets married. Case closed. Period. Mom, if you could live your life over again, would you do the same thing? Get married and settle down after high school?   Why?   It's incredibly difficult to make money in the restaurant business. You have to get up at five in the morning to go to the market, you have problems with spoilage, employee pilferage, and just try and collect from the credit card companies. They take months to pay.  The whole table is astonished.   Oh, I just picked it up from my dad. He's a wonderful businessman.   I shouldn't have put you through that. It must have been agony. Let's do something.  Michael makes a move towards Peggy, with lust in his eyes.   No. Something else. I'm too full. Besides, it's a school night.   (looking around at the crowd  clinking glasses For everyone.   Utah? I thought you'd be going to New York or Paris. What's in Utah?    I can't do that.   I hate chickens.   Michael, you and I are light years apart. You should go, but not with me.   That's a terrific line. You're going to be a wonderful writer.   Yes. We had a glorious night together. One day you'll remember and write about it.     It's Charlie!   MICHAEL. Michael observes Peggy's intimate reaction to Charlie's singing.   Ssh. He's great.   I thought I knew everything about him.   What?   How did it go with the pantyhose?   Oh no!   He's a liar! He has no such thing! It's my own fault. I should have had it patented first. He's a crook, damnit.   Oh, you're both so naive.      Peggy lies in bed in the darkness, her eyes wide open. The bedside clock reads: 2:47. Peggy gets out of bed.  CAMERA TRACKS Peggy into Nancy's room. Peggy looks down at Nancy sleeping. Gently pulling back the blankets, Peggy gets into bed with her.   I wanted to talk to you, and I have one last thing to take care of at school. Then I'm going to...  Good dog, Rusty. Good dog.   Oh. I guess I always liked Rusty better.  Could you give me a ride to school?   Well, how about a walk, Charlie Bell..   I was at Lena's last night. You were terrific.   What were You doing there? You never told me you were singing with an R and B group.   I'd forgotten how much music meant to you.   Stop being defensive. I want to help you. I wrote a song for you.   Not exactly, but with your great voice, it'll be a huge hit. Honest.   Just take a look at it.    It means I care about you and what happens to you.   What's the matter?   What happened?   Welcome to the singles' scene.   Look, Carol, maybe Walter's done you a big favor. You always said you wanted to get out of town. Go for it. And be happy, goddamnit, I'm rooting for you.   You know Dolores, there's a lot of things I could say to you, but you're not worth the effort.  Peggy reaches down toup her books. On the top of the pile is an open fountain pen, which she picks up, pul1ing the release lever, squirting ink all over Dolores's dress. Dolores drops her books, looks down at her dress, horrified.   Sorry. These fountain pens are so tricky.   I beg your pardon?   Have a nice day.   Rosalie! Wait!  Rosalie turns at the door, smiling. They are alone.   I think you should give up diving. It's dangerous.   I know you are, but you have to stop. I couldn't tell you before, I didn't know if I should. But you have to stop before you hurt yourself.   But accidents can happen.   Rosalie, please, listen to me! You have to stop.   It's all, gone wrong, nothing's working out.   You were meant to. You're one of those fortunate people that good things happen to. I have to get out of here.  She starts to walk away.   I love you too, Richard. Thanks for trying.  She continues down the hallway.   Forget it, it'll never work.   Thank you.    Fine.  ) Grandma, would you teach me how to make strudel?   I wish she hadn't.   Do you believe in all of that?   I remember that book!  Grandpa, Grandma, I want to tell you something.   But I'm remembering the future.   My children make me happy. I miss them so much.  Beth. Scott and Beth.  I'm going to name my daughter after you.   That never changes.  You know, when you and Grandma are gone, the family's gone. I never see the cousins anymore.   Grandpa, if you had a chance to do it all again, what would you do?   It was my idea, Grandma. I always wondered what went on at those lodge meetings.    Goodbye, Grandma.   What does Grandma think you do at your meetings?   I hope so. At least I got to see you and Grandma.  Has it ever worked before?   Thank you.   Ah... thank you.    Do you have to wear that hat?   Yes, sir.  Leo steps back, closes his eyes and spreads his arms.   Fasten your seat belts. Here we go.    This is never going to work.  The old men form a circle in front of Peggy. They begin to circumambulate east to west, intoning together, their heads bowed. As Barney passes in front of Peggy, he winks at her. She smiles back.   What the hell did you do that for? What are you doing here?   Don't be ridiculous! They're just a bunch of harmless old men. My grandfather was in there.   I'm not getting in that blue monstrosity.  Charlie pushes her inside, Peggy climbs back out. Charlie takes her hand and drags her up a hill behind the lodge hall.   Let me got! Where are you taking me?   How could you possibly know what I've been going through?  Thunder and lightning. It starts to rain.   What do you mean you and my father decided? Who the hell are you to plan my life? Let's get married and live happily ever after. Bullshit. I got knocked up. I had to marry you. I never had a choice.   You betrayed me, Charlie. You were never there for me or the children. And now you come and tell me, \"Peggy, you're scared.\" Of course I'm scared. If you knew what I knew you'd be scared shitless.   I might be crazy, but I'm not crazy enough to marry you twice. There's a lot of things I can't change. I can't even think about them. I tried. But I couldn't even help Rosalie.  I don't want to be bitter. I'm a naturally optimistic person. But you took advantage of that.  Charlie bends down to comfort her, in tears. He hugs Peggy and strokes her hair.   Will you take me back to my grandparents?    Oh, Charlie.   Scott and Beth. Where did you get these?   So are Scott and Beth.  Peggy leans into Charlie, throwing her arms around him, holding on for dear life. She looks up at him, their foreheads touching.   I know.  Charlie kisses her, passionately. The locket drops to the ground. HOLD on the locket, and...    Do you think anybody in the Fifties ever made love on a bed?   I've got to go now.   I'll love you, too, Charlie. I'll love you for twenty years.   I'm trying.  As Charlie watches helplessly, a huge bolt of lightning strikes his car. Peggy smiles. The men from the lodge run outside. They look up and above the blazing car and see Peggy floating away. Peggy sees her grandfather in the crowd and blows him a kiss. Charlie begins to run, following the kite cord to its source. He finds Richard, struggling to restrain the runaway kite.   Charlie? Was I dead?    You look awful, like you haven't slept in days. And so old.   Charlie, I thought I knew everything about you.   What about Janet?   Who are all the flowers from?  Charlie pushes himself out of his chair and moves toward the dresser.   It couldn't be me.  I hardly knew him.   Charlie, I had a strange experience.  I went back to high school. And I spent a lot of time with you.  And you and Walter and Leon were singing \"I Wonder Why\".   You were terrific.  And I kept trying to push you away but you wouldn't give up.   Then hold me.  He holds her hand.   Don't try to charm me, Charlie Bodell.   Charlie, I would like to invite you to dinner at home, on Sunday, with your kids. I will make a strudel.  He hurries back to her, kisses her again.  They hang on to each other as Beth enters the room.    </div>  To be inserted after Dolores/Peggy scene and to replace the goodbye to Richard scene.   I came to say goodbye.   You were meant to  You're one of those fortunate people that good things happen to.    Vision? I'm a walking anachronism! I've upset my parents. I miss my kids. I could be trapped here forever! And poor Charlie...I got pregnant on my 18th birthday and we had to get married. Tomorrow's my birthday! I've got to get out of here now.   Yeah, yeah. I'm taking a big gamble. I've loved him for a long, long time.    No! No! No! Peggy Sue got married! Case closed. I don't want to marry anybody. Goodbye Richard.   You can't. You're going to be Valedictorian.    </html>",
        "Sue": "Over BLACK, we HEAR the sounds of an old TAPE RECORDING. Young VOICES are filtered amid a noticeable hum, hiss and crackle. We HEAR giggling and then someone named Charlie making vows of love to someone named Peggy Sue.",
        "Richard": "Are you Peggy Sue Kelcher?   You look exactly the same.   Oh, I'm sorry.. Peggy Sue Kelcher, my wife Sharon.   Where's Charlie? I was in town about a year ago and caught one of his commercials. Really made me laugh.   Gee. I'm sorry to hear that.  NEW VIEW  A large, beefy HAND is THRUST INTO FRAME.   Thank you, Doug.   ...fifth generation core capacities are going to cause another shakeout in the smaller companies.   Sure. I remember you.   Are we through Dolores? Good.    You'll be okay?   The only time people like Dolores used to pay any attention to me was to laugh at me or insult me. That guy, Doug Snell, who shook my hand when we walked in, he used to call me a foureyed worm.   You were always friendly to me. I appreciated that.  You know, this used to be a fantasy of mine.   Dancing with you.   I guess part of us never really leaves high school.   Sharon and I thank you all for making us feel so welcome. It's good to be back.  MORE APPLAUSE as Richard steps back.     It really wasn't that difficult.  Doug Snell  walks past.   I'm not doing any tutoring this year. I'm too busy.   All right. I'll be in the physics lab. Make it fourthirty. I have a rocket club meeting.   I'm writing a book on kite construction. What did you want to talk about?   Are you doing some kind of science project?   Well... in a Newtonian framework, the possibilities were limited, but with the advent of relativity theory, the idea of absolute time can no longer be reasonably affirmed.  Peggy hasn't understood a word.   And then, there's Richard's Burrito.   That's my own theory based on a Mexican food called the burrito. I had it once when my parents took me to Disneyland.   Well, I think time is like a burrito. Sometimes it just folds over on itself and one part touches the other.   You can till it with whatever you want. From illusions to memory, from experience to innocence, from happiness to the entire universes   Absolutely. People, dogs, elephants.   Okay. I promise.   You probably are crazy. Wait a minute. Is this some kind of joke? I know what you all, think of me.   Oh yeah?   How, did you know about my grandfather?   Holy Toledo! That's six years ahead of schedule!   But when did you leave? Are you here until then? Were you there until now? What direction are you going in? Are you a moving point on an infinite line extending into the past? Can anyone do it?     I'd be very careful if I were you. You don' t want to fall into the clutches of some madman with plans to manipulate your brain.     You look pretty good for a corpse.   You're giving me the creeps.   There's one way to find out.  Richard stops and throws down his books. He steps in front of Peggy, throwing down her books, dragging her to the curb.   Confucious says, The way out is through the door. There's a truck. There's your door.  A large truck speeds towards them.   Step in front of the truck! If you're dead, it won't matter. The truck'll go right through you. Go ahead! You're dead!  Peggy takes one step off the curb. The truck is getting closer. The truck BLOWS A LOUD SUSTAINED WAIL.    A completely outfitted laboratory, kites decorate the walls.   Okay, you're not dead, but according to every law of science what you say happened to you is impossible.   You're a molecule in chaos, a discontinuent aberration. Maybe you've just got powers of precognition. Well, maybe you're just out of whack.   All right, I'll work on it, I'll, do some research. But in the meantime, don't get crazy.   What if you're not here tomorrow?   The way I see it, you have an unparalleled opportunity to become the richest woman in the world.   But you have a vision. Don't you want to help your parents?   I'm talking about invention, no investment. I know what people think of me. Mr. Spasmatician. Dick the Square Root. I'll show them. You said I was going to be a millionaire. And you're gonna help!   No offense, but for a person who says she's lived an extra lifetime, you certainly are thick. Money is power.. Money makes people respect you...   I'm curious, but I don't want to know. Jeez, I hope you haven't been telling people what's going to happen to them.   Good. You're discreet. I like that in a partner.   Look it's very simple. You tell me everything that hasn't been invented yet, and I'll invent it. We'll be partners. Fiftyfifty.   You're taking advantage of a minor.   A Ton on a Bun, with fries.   Come on. You can't be serious.   Are you talking ~about exercise? Like gym?   Let's see...  icrowavemays, ocketpay alculatorcays...  The two ladies react.   All right. These are the choices: microwave ovens, pocket calculators, Walkmans, digital watches and miniature TV's.   What are you talking about?   High tech. I like the sound of that.    Peggy jogs towards Richard. He is watering the front lawn.   What are you doing?   That's what you were talking about yesterday? Everybody does that in the future?   That's terrific. You did it. You really changed the course of your destiny.   Cheer up. Now you can give some other guy a shot. Make it up to him later and buy him a yacht.   Look, the best scientific mind in this country is working on your case. May I make a suggestion?    Suggestion! Hypnotic suggestion! Why didn't I think o~ that before?   Everything. This is perfect. The subconscious mind remembers all. You can give me more information on microchips and then pinpoint what happened at the reunion. Maybe that'll give us a clue on how to get you back.   No offense, but you're pretty out of it now.    Peggy sits in an old recliner. Richard holds a small, batteryoperated revolving disc up in front of Peggy's closed eyes, then puts it down and picks up a notepad and pen.   You are completely relaxed. When I count to three, you will open your eyes. One... two... three. (Peggy's eyes flutter open We'll start with something easy. What is your name?   Oh boy. Peggy, what are microchips?   What will they be made of?   Silicon is from sand.   In the future, will you have to marry a girl before you have sex with her?   You mean you'll give a girl a pill and she'll want to have sex?   Will you take of f your blouse?    No! Yes! I'll be right out, Dad.  Oh shit! Peggy, I'm going to snap you out of it.   One... two... three.  You are now awake.  Richard kneels on top of Peggy as she wakes up, fumbling the buttons at her breasts. Peggy comes to, as Richard jumps off. She buttons her blouse, furious.   Me? You went crazy! You started taking your clothes off. I was putting them back on for you.   I think it has something to do with your birthday. You were rambling. I didn't understand the rest.   Hey! Do you have any idea how much those beakers cost? I usually charge for hypnosis.   What's the matter?   Not true.  I think I'm making real progress on the microchip.   Peggy, I believe you. I believe everything you told me. It's wonderful. You're the exception that proves the rule.  She kisses him on the forehead.   I can't! It's out of control!  Suddenly the cord breaks. Peggy floats away.    </div>  To be inserted after Dolores/Peggy scene and to replace the goodbye to Richard scene.   You know, Peggy, there's so many things to look forward to in the future.  Peggy leans over and kisses him, sadly, on the forehead.   Goodbye? Where're you going? What about our partnership? I'm making real progress with the microchip.   So are you. You've got a vision.   Did you break up with Charlie?   Okay. Why don't we do something visionary. Change your destiny, Peggy Sue. Change your destiny and marry me.   Wait! I'll go with you!",
        "Norvik": "",
        "Michael": "Santiago comes back, with nothing  there's no meat on the bone. It's Hemingway's ego defending itself again; he's trying to prove he can still perform.   Gilfond's okay, except he thinks Hemingway's great Literature.    He's a fisherman! The most overrated writer of the century. I mean, he's the perfect American author  fat, violent, drunk...   A writer's life is his work. Jack Kerouac doesn't have to kill a bull to have something to write about. He's out there feeling, burning... grooving on life!  Michael leans back in his chair. He's said his piece. Peggy studies him for a beat.   What're you doing here anyway?   I thought chicks like you traveled in packs.   This is great reefer.   The world is fantastic. It's the ultimate absurd circus. I am shot from a cannon into the energy.   Maximum intensity. Yeah. I can't wait to get out of here. I'm gonna write. I'm gonna check out of this bourgeois motel. Push myself away from the dinner table and say 'No more JellO for me, Mom.'   The only thing my father digs is cold, green money. All my mother cares about is her standing at the country club.   Hey what's with you? I thought you were cool. You rode my bike. You blew some pot.  What's your scene Miss Majorette? You gonna marry Mr. Blue Impala and graze around with all the other sheep for the rest of your life?   You know, I had you pegged all wrong.  Michael kisses Peggy. She responds passionately.   A ray of oneness piercing the solitude. Falling bodies in the ecstasy of flesh. You'll be a chapter in my memoirs of desire.   No, I just made that up. Do you want to hear one?    Okay. Here's a new one. It's called Tenderness.  I couldn't sleep so I thought I'd scream Betrayed by a kiss, sucking pods of bitterness. In the madhouse of Dr. Dread Razor shreds of rat puke fall On my bare arms (sees Peggy grimace; he calms down I'm sorry. I guess I was trying to impress you.   Peggy is falling for it. He fumbles with her bra straps.   I'll respect you for eternity.  'When you are old and gray, and full of sleep, And nodding by the fire, Take down this book, and slowly read, And dream of the soft look your eyes had once.\"  I didn't write that. That's Yeats.  Peggy is moved by the beauty of the poem. She sits up, leans over Michael, runs her hand through his hair, almost motherly.   That was quite an evening. Bourgeois, phony, decadent, stupid.   Five more weeks of school. And ten minutes past graduation I'm gone.  To freedom.   Now listen, this is the plan. As soon as school is finished we go to Utah and...   Rita. I met her last summer. She's cool. You'll really dig her. She's got this great little cabin in the hills, just outside of Provo where she raises chickens. I'll write and the two of you can take care of the chickens to support us.   Why not? Polygamy's legal in Utah.   But what about the other night? We were like two stars in the same constellation.   But we had heat baby. Passion! Fire! We owe it to ourselves to fuse together.  At least one more time.   You think so?   I can dig that. Bittersweet perfection. Dogs of lust on leashes of memory... yeah.  Suddenly distracted by the familiar voice, Peggy looks up to the stage and sees that the lead singer, Charlie Bell, is in fact, Charlie Bodell.   What a treat.   Now I get it.   Peggy Sue's still stuck on treble without a cause.  Charlie finishes the song as the audience goes wild. He beams.   Can we split now?  Peggy and Michael unobtrusively slip out of the club. Charlie leaves the stage. He's met by a greasy looking MAN. They sit down at a booth to talk.   I can dig you being uptight about Rita and Utah. That's cool. But I've got to warn you about something.   My father. He's not just the ultimate square. He's a total crook.",
        "Fitzsimmons": "Moose?  I never thought I'd have moose for desert.  The adults laugh. Michael looks bored.   You know, you should open a restaurant.   How does a young gal like you know so much about business?   Really?  Peggy gives her father a go get him look. Michael's writing in a pocket notebook.",
        "Carol": "Peggy Sue!  They pull over to the side of the road.   I haven't seen you in years. In all that time, haven't you at least tried another hair style?  Peggy tries to laugh off her embarrassment.   You're probably the only one who could carry it off.   Who's the mother around here?   Everyone's got a gold Rolex. I had this one specially made in platinum.  Richard is standing with three men. They hang on his every word. Beside them, a very DRUNK MAN overhears:    Welcome to the singles scene.   You just have to remember... men are like houses and trade upwards... I thought you had a pretty good marriage.   So he started having affairs, and you got depressed.  Peggy nods.   You should have left here years ago, like I did.   After you got knocked up, my mother didn't want me to talk to you. She thought it was contagious.   Wouldn't we all.   I never could keep up with you.   Curiosity mostly. I heard you finally found a man of your own. Too bad he's married.   Hi.   Sometimes it's easier when you hate them.   Hi, Peggy. God, that Walter Getzcan still dance.   Who knows. Remember...  Whatever Walter wants...    Walter Getz.   Lucky lady. Hi.   Too bad.   The only one?   They're waiting. Come on.   Go on. You can do it.  Charlie and Beth stand together: Beth is worried about Peggy. CAMERA TRACKS Peggy as she haltingly makes her way to the stage. As she does, she notices another blow-up on the wall:  Peggy and Charlie, as King and Queen of the 1960 prom. Arthur gives the crown to Richard who places it on Peggy's head. He kisses her cheek and stands back, beaming.    Wanna smoke?  That's the worst thing for her.   Were taking you back to the nurse.   We're going to take you home.   I'll call you Later.   Probably at the diving meet.   That's because you' re not a total moron like they are.   Why do guys do such stupid things?   What are your colors, going to be?   You'd be surprised at how many girls in school aren't virgins.   Charlie really has a great voice.   Yeah. You're so lucky. He really loves you, too. He's always telling Walter how wonderful you are.   All right. What's the scoop?   I hear she does more than talk with her mouth.    ) Oh, Maddy, grow up. It says in LOVE WITHOUT FEAR that \"the tongue kiss as a means of genital stimulation is widely practiced and has much to commend it\". Page eightysix.   Just what you underlined.   Come on. What's with you and Michael?   I bet Dolores told Charlie.   You better watch out for her. She's after Charlie.   Don't be silly. It's Saturday. Date night!   Aren't we a little old for that?   Peggy, I have to talk to you.  Peggy turns to Carol. They walk down the hallway together.   It's that jerk Walter.   After Charlie told Walter that he broke up with you because he wanted to play the field, Walter decided he should do the same thing.   What a I going to do for the rest of my life? I don't have a boyfriend anymore.",
        "Heath": "",
        "Arthur": "You took this seriously. You're a real blast from the past.   You always were a crazy little gal, Peg.   You and your mother both seem to fall for musicians.  Maddy and Arthur laugh. Peggy is not amused. The hostess hands them their name tags and turns to welcome new arrivals.  As they proceed down the hallway, Peggy SEES a distinguished man enter, RICHARD NORVIK. With him is his pregnant wife SHARON. Richard smiles at Peggy. She can't place him. Peggy turns back to her group and continues down the hall. The fifties MUSIC GETS LOUDER AND LOUDER.   Hey, there's Terry and Leon.    I'm glad you asked, Dolores. Four years ago Maddy and I found Jesus...    Hello. Can I have your attention, please.  The BUZZ in the room DIMS, Peggy and Richard head back to their table.   I know it's getting kind of late, and some of you have a long drive home, so the reunion committee decided it was time for the moment you've all been waiting for. You don't know what you've been waiting for because we didn't tell you, but the committee has selected a King and Queen. Now don't worry, I took care of it so the band's gonna keep playing for at least another hour, and my old pal Judge Crystal said that the bar can stay open as long as we want.  Everyone applauds.   And while you're at it, let's have a nice big hand for the Little Lady that did such a great job supervising all the decorations, Rosalie Testa.  More applause. VIEW on Rosalie in her wheelchair.   Now back to business. The members of the committee have given this a lot of thought and decided on the two people who best represent the spirit of Buchanan High's Class of '60. The king is someone who, in more ways than one, has come a long, long way since he left here.   We're proud to welcome him back, Richard Norvik! Come on up here, King Richard!  The band PLAYS a FANFARE and DRUM ROLL. Richard gets up, and walks to the stage as everyone APPLAUDS. The band PLAYS a chorus of \"Get a Job.\"   Every king deserves a queen. Now, we had a Lot at worthwhile candidates. And I don't want any of you ladies to feel left out, 'cause you're all beautiful. But when we sent out the invitations, we didn't mention anything about this being a costume party.  Peggy's embarrassed reaction, realizing everyone's looking at her.   Maybe we should have, 'cause just looking at her brings it all back for us. Ladies and gentlemen, I give you our queen, Peggy Sue Kelcher Bodell. Come on up here, Peggy Sue.  The band begins the song PEGGY SUE. Peggy looks pained. She doesn't move.   But you're not going into his business. When're you going to tell him?   Atta girl, Peg.   Why I oughta...  Charlie, Walter and Arthur crack up.   Why I oughta...  The boys crack up again. The girls think they're hopeless. Peggy SEES Michael Fitzsimmons, buried in a book. He looks at Peggy with a penetrating gaze, then back down.  Richard Norvik, also sitting alone, working with a slide ruler on a book of mathematical puzzles, dressed in early Nerd.  Peggy gets up from the table. She looks back to Charlie and the table.   Now that's a purty little heifer.    HiYo Silver! A cloud of dust, a galloping horse with the speed of light, a hearty Hi-Yo Silver! The Lone Ranger! With his faithful Indian companion Tonto, the daring and resourceful Masked Rider of the Plains came to Earth with powers- and abilities far beyond those of mortal men. Return with us now to those thrilling days of yesteryear - from out of the...  Arthur lets out a huge belch. Everybody cracks up.    I hate it when the beer comes out my nose.   I'l1 take Kubek and Richardson over Fox and Aparicio.    Like who?   And now, direct from three weeks of rehearsal in Walter's garage, four guys who have dedicated their lives to becoming the greatest singing group in the world... Charlie, Walter, Leon and Terry. The Definitions.  Applause as the group enters from the furnace room. They all wear black pants and iridescent sharkskin jackets. Charlie is in the center of the group as they position themselves.",
        "Barney": "Hello, Lilla!   Quite a bit more rain than usual this year. I hope it doesn't spoil the rhubarb.   What's the matter, Lilla? Somebody jump on your grave?  Peggy shivers again and shakes her head.   What's it going to be, Elizabeth? Seventyfive? Eighty?   I've been trying to drag it out of her for years.  You know, dreams are fascinating business. 'Specially where you see the future.   Well, I like to speculate. This book I'm reading right now, a woman in Colorado says she lived in Ireland a hundred and fifty years ago. Her name was Bridey Murphy- and she gives names and dates and where she lived. She was hypnotized. Big bestseller.   It's gonna rain again. Every time I wash the car, it rains.   It's your grandma's strudel that's kept this family together.    I'd take better care of my teeth.   It's her 18th birthday, I want to show her off.  Barney turns and winks at Peggy.   Let's go.   Stag movies. Smokers.  Peggy chuckles as they get into the car. The car proceeds along the driveway and turns onto the highway.   I may be an old fool, but I think we can help you.   The last one was six hundred years ago. It's about time for another one.   Let me take your jacket, Lilla. I've got, to get my robe.  Peggy hands him her jacket as he heads over to the cloak, room.   It wouldn't be a lodge without hats.  Barney takes her hand and squeezes it. They walk slowly through the doorway.   Don't you worry. I'll be watching after you.",
        "Evelyn": "",
        "Charlie": "Hi this is Charlie and... Come on, say your name.   And we're here on the couch...   We're here on the sofa bed...   ...to record how much we love each other. Sitting beside me is the cutest majorette in the history of the world. And she would Like to say something.  A real estate agent, a WOMAN, carries a \"For Sale\" sign to the center of the lawn and begins driving it in with a hammer.   Come on Peggy. Say what we rehearsed.   But you love me don't you?   And nothing will ever change that.  Charlie starts giggling. We HEAR fumbling and tickling.  CLOSE VIEW INTO THE KITCHEN - First we see a woman's hand, on the floor. It is partially covered with flour.  MOVING VIEW reveals PEGGY BODELL, in her early 40's, fainted from heartbreak while baking a cake. Flour is scattered on the floor. She recovers from her faint. Confused, she steadies herself and brushes the flour from her dress.   Oh, gotta go. Here's a little makeout music.  A record starts: \"You Belong to Me\" by the Duprees.    CHARLIE BODELL, early 40's, singing the same song. He can't hit a high note, turns off the water and steps out of the shower. JANET, his young, buxom girlfriend is in the bedroom.   Goddamnit, I just can't hit those high notes anymore.   Did I hear 70 dollars? What do you need 50 dollars for? How's your Mom?  Peggy comes out of the kitchen. Charlie has stopped conspicuously at the threshold. A workman comes from behind Peggy.   Frank, watch the clock.  Peggy looks outside.   Come off it, Peggy. And what do you mean your house? This is my house. I paid for it, I'm still paying for it.   I mailed it to you on Wednesday.   Jesus, Peggy. Take it easy. I'm not used to that stuff. You always did the bills. Blame the damn post office.  A workman approaches carrying an old mono record player: black and white, a real fifties artifact. For a moment their mutual resentment melts, as they look at each other.   You got a Tab?   You don't want them? They're going to make a big comeback any minute. Mark my words, these lamps are going to...   I'll think of a way to sell, them.  One day.  Peggy opens a box filled with records. She closes it and moves to another. Charlie checks the contents of another box on the other side of the room.   I'm not going.  Scott calls from the top of the stairs.   Be right there. I'll go through the rest of this stuff next weekend.    I never thought it would go this far.  Charlie exits. Peggy looks around. She slaps the flap of a box down, to close it, but it jumps back up.   Thanks.  Charlie grabs a cookie and puts it on the table in front of him, smashing it with his fist. He picks up and reads the fortune:    Next week you'll be selling Sanyo remote control VCRs for three hundred and ninetynine dollars? Oh no!  Crazy Charlie...  He grabs and smashes another fortune cookie.   You'll give away Mitsubishi giant screen TVs for twelve hundred and ninetyfive dollars! Oh no! I'll go broke!  Crazy Charlie...  He grabs and smashes another cookie.   You won't be undersold on stereos, videos, microwaves or blenders!  Crazy Charlie, Crazy Charlie, I'm not breaking cookies, I'm smashing prices. (rolling his eyes like Fabian Crazy Charlie, he insane.  The waiter hits a big gong.  Beth laughs.    At opposite ends of the reunion, but aware of each other.   I vant to suck your blood. I also vant to suck your Twinkie.   No. You are the undead. You will live forever if you give me your Twinkie.  Come on, let's have it. You hate them anyway.  Mechanically, Peggy hands over the Twinkie. Charlie bends over to nuzzle her neck. The nurse's hand COMES INTO FRAME and grabs Charlie by the scruff of the neck, pulling him up.   Hey! I just made a deposit in your blood bank. Now I want to make a withdrawal.   I'm changing banks!  Charlie walks away towards Walter and Arthur. Peggy gazes after him, his body blocking her view of a portion of a banner hung on the wall. It reads: \"Support the Buchanan High Blood Drive...\" As Charlie exits, the final words come into view:  \"Spring 1960.\" Peggy gasps. She begins to tremble.   How do you feel?   Come on. Get in. I can take care of that.  Peggy warily gets in. Charlie leans over to kiss her, but she pushes him away. No dice.   Hey, I can take a hint. You look great today.  Charlie starts the car, burns rubber and peels out.   I call this the staccato.       Not that I'm glad you were sick, but I had a chance to do some thinking last night.   You know. About what we said on Tuesday. It makes a lot of sense.   How could you forget? We talk about seeing other people and you forget?   I can understand that.. But please don't start crying again.   It's not going to be forever. I figure three years is long enough. I can see it the music pans out.  And right after graduation we should start seeing other people. Kind of comparison shop before we settle down and get married. Know what I mean?    Well, we got the prom coming up, all these parties. We shouldn't upset our parents?   You're more shook up than you want to admit. You'll get used to it, we'll still see each other 2, 3 times a week.  Charlie opens the locker. Peggy watches carefully, memorizing tho combination. He takes out a few books as Peggy notices her schedule on the locker door.   Want me to drive you home later?    Would I?!! Why I oughta...  Unaccountably, this cracks Charlie up. He walks away laughing. Peggy looks completely puzzled. She is surrounded by a sea of people, who say hello. She can't remember their names.   I've got to string him along for a while. It's for his own good.   Soon. I can't tall everybody everything all at once.  Peggy, Carol and Maddy walk over and sit down with trays. Peggy deliberately avoids the empty sear next to Charlie. They're uneasy with each other. Peggy looks with disgust at the slop on the tray.   I'll throw the book at you!   He's a nice guy. You know he's writing a book?   Looking good out there.   I noticed you were giving me the silent treatment at lunch. I guess I deserved it. I've been thinking about my three year plan and I think it's unworkable. I must have been delirious.   In the abstract maybe. Get a grip on yourself! But when I imagine you going out with other guys, I feel... ah...   Yeah. Like that.   Hello, sir. How are things at the hat store?   Yes, sir.   Yes, sir. But that's what I like about her. She's not like all the other girls at school.   Yes, sir. Trust is a twoway street. In the past two years I've been pleased to note that you and Mrs. Kelcher have, uh, fulfilled your sacred trust of being good parents to the, uh, woman I plan to take off your hands.  Mr. Kelcher looks as if he's witnessing the latest attack of teenage weirdness.   What would that be, sir?    Of course.   Great, isn't it?   Hey! What's the fun of being a teenager if you can't dress weird? And we're going to have fun tonight, right?     Is this slow enough for you?   I'm fine Peggy Sue. And how are you? Are we talking on the phone? Are we pen pals?   It's great. I cleaned the car, do you like it? Oh, I got tickets for Fabian on your birthday, you like him, right? He's cool. Eighteen is half of thirty six. It's \"Gentlemen start your engines\", vroom, like I'm gassed up ready for the race. I've got the girl, I've got the car, I've got the talent, but I don't know. Do I date, get married, join the army, cut a record, go to college? I got a million choices, but nobody teaches you how to choose. But it's different for a girl. You're Lucky. You just have to wait for me.   Here comes the life of the party.   Have no fear. Charlie's here.   Why Pete's the best darn cook on the Panhandle!   Ready. Set. Go -  Arthur rapidly chugalugs the entire beer and immediately recites from memory as the boys urge him on:   Too bad. Close to a record.   Pitching wins pennants. The Tigers got four potential twenty game winners.   Don Mossi, Frank Lary, Jim Sunning and Paul Foytack.   One, two, three-...  The group begins to SING an A CAPELLA version of RAMA LAMA DING DONG . Charlie sings lead, backed up by the other three. Walter dances insane, Temptationlike steps. The crowd huddles around them, clapping and grooving. Peggy is on the planet of lost innocence, removed and melancholy.   Is he gonna help you with that physics stuff?   Hey! Who needs physics when we've got chemistry?   There isn't a girl in school that can hold a candle to you..   Yeah I know.  But I don't have to flatter you.  It just feels right. You're the perfect girl for me.  As in is, was and always will be.  I'm glad dancing was invented.  You know the first dances were rituals. Like fertility rites.  As they dance Charlie gets embarrassed by an erection, and moves his hips away from Peggy.  She surprises him by grabbing his tush and pulling him into her.    The windows are fogged.  Peggy and Charlie kiss tenderly.   Your eyes look like silver pools of moonlight.  And the tide rushes in.   You know I do.  I even wrote you into my will.   What?! You mean sex?! Intercourse?  You want to have intercourse! Last weekend you said... What time is it?   But you're the one who wanted to wait till we got married. And you were right. We should wait.   Who?  Peggy starts to GIGGLE, realizing the absurdity of the situation. The more she GIGGLES, the more agitated Charlie gets. Peggy starts to unbutton Charlie's shirt.   You mean my wang? Listen, it's running real late.  Charlie pushes her away, angry..   What is this? What the hell is going on? One week you say, \"If you love me you won't\", now you say \"If you love me you will\".  Excuse me. That's a guy's line!  Peggy realizes she's blown it. Charlie isn't ready for this.   You're damn right! Jesus! Peggy! You sure know how to spoil a mood.  Charlie straightens himself up, starts the car and burns out.   Save it.  Peggy watches him go. Looking at her darkened house, she turns and walks down the street.   Take the Shostakovich home and listen to it. Let it grow on you. Everyone that's bought it has come back and said, \"This is definitive Shostakovich. Thank you for encouraging me to investigate it.\"   You'll like it. I kid you not.   Nothing.. Selling is selling.   Forget it. I've been thinking. Girls must go through that stuff too. Sometimes when I look at you I feel like an animal. Maybe my dad's right. Teenagers are nuts.   Yeah, I know. Girls mature faster than guys. But last night, I was the one who put on the brakes. And you know why?   Because nothing else matters. That's the great thing about love. Every time we argue, every time something goes wrong, and I know that I'm not perfect either, things just work out better in the end. Cause you're my baby and I love you.   Don't be cruel to a heart that's true.    I have to talk to you..  Through her sleepclouded eyes, Peggy begins to focus on the face of the younger Charlie. Suddenly, she remembers.    Let's go down to the basement.   I want to know what's going on. Dolores told me that you and that scuzzball Michael Fitzsimmons...    Then it's true, dammit! I had a miserable time tonight 'cause of you. When the Monotones did \"Book of Love  Chapter Four you break up, won't you give it just one more chance...\" I'm thinking Did we break up? 'Cause if we did, I don't even know about it!. I thought we cleared all that up yesterday. Did that Maynard G. Beatnik give you what you wanted?   You're going to blow it, Peggy Sue. Nobody treats Charlie Bodell like this.   Look, I've got the hair, got the eyes, got the teeth, I got the car. I'm the lead singer, I'm the man.   I will be happy if I have you. I love you.   What are you talking about? Who's Janet?   What about everything I said to you this afternoon...   But what has to be different?   What! What about the group and my singing career? What about me?   You don't know zip! You think I'm going to end up selling appliances like my father? Chasing women around the store. I've got to give it a shot. Why are you trying to kill the two things that mean the most to me? Until yesterday you loved me and you loved us.  ) What the hell has changed? For two years I've done nothing but love you. I'll show you, I'm going to be just like Fabian!  Charlie exits. Peggy slumps back, drained. Getting up, she crosses to the mounted swordfish. Standing on a chair she reaches into the mouth of the fish and pulls out a package of Pall Malls. She puts a cigarette in her mouth and picks up a table lighter and flicks it. As it lights, the tiny music box inside PLAYS SMOKE GETS IN YOUR EYES.     MICHAEL. Michael observes Peggy's intimate reaction to Charlie's singing.    Peggy walks down a residential street, much like her parents'. She stops when she sees Charlie's car parked in a driveway, and leans against a tree next to his car. Moments later, Charlie exits his house, a dog trailing behind him. The dog runs up to Peggy. Charlie is wary and distant.   What're you doing here?   Rusty's dead. That's Ajax  Charlie throws a stick. Ajax chases it, never comes back.   Sorry, the Blue Thunder's out of commission for a while.   How'd you know about that?   Not terrific enough. What were you doing in that part of town? Who were you with?   Hey. I guess there's a lot of things we don't know about each other.  Charlie and Peggy walking.   That's real big of you.   You're kidding. You wrote a song? Is it about a guilty girl and a trusting guy... she wants to hurt him, and he wonders why?  Peggy takes a piece of paper from her purse.   Fat chance. You know, Lee Wilkins came to hear me last night. He told me to forget it. You told me to forget it. My parents tell me to forget it.   If you took the trouble to write it, then sure, I'll take a look at it. But I'm beginning to think that maybe there's more to life than music. I wonder if people would still like me if I stopped being Mr. Excitement?   Does this mean you like me again?   That's all I wanted to hear. 'Cause I'm never going to give up on us. It's easy to fall apart in a crisis. It's easy to be selfish and say goodbye and good luck. But this is more than love. This is a mental decision. Just wait till tomorrow, when you see your birthday present. Then you'll understand.  Charlie walks away as Peggy reaches into the locker for her books.   Walter, maybe you should be a dentist.   Hey, Peggy. Wait a minute.  Peggy stops on the landing. Charlie joins her, so eager. He doesn't notice how distraught she is.   I cut shop and did some work on your song. You know, it's not half bad for your first try. Of course, I changed all the \"yeahs\" to \"oohs\". Listen to this.  Charlie begins to sing an R&amp;B version of SHE LOVES YOU.   Okay. Listen, I cancelled the tickets for Fabian. I thought it would be better for your birthday to eat at a nice restaurant, Chez Tres.  Walter, Arthur, Maddy and Carol watch as Peggy runs away.   I was trying to save you. They were going to vaporize you.   You're going to listen to me.  Charlie tries to Lead Peggy into the car.   Right here. Now sit down.  Charlie sits her down on the ground. She's impatient and hopping mad.   Look. I wanna tell you. I forgive you for everything. I know what you've been going through. You're just scared. I was scared, too, but I'm not anymore.   Because I love you, damnit! I had a long talk with your father yesterday and we decided that the best thing for us to do is get married and settle down. Right away.  Peggy jumps up, exploding to Charlie.   What?   You're crazy! You're really out of your mind!   Oh, Peggy. My poor Peggy. It's all my fault. I'm so sorry. I won't bother you anymore. I promise. Please stop crying. Please.  Peggy starts to compose herself.   Of course.  Charlie helps her up. Be reaches into his pocket and takes out a small box, handing it to Peggy.   It's almost your birthday. I wasn't sure when you were coming back, so I brought your present up here.  With a slow, growing remembrance, Peggy opens the box. Inside is the gold locket Peggy was wearing at the reunion.   It opens, too. Look inside.  Peggy opens the locket. She shivers with recognition.    I love you.   I think we should get out of here. It's going to rain.   What the hell is that?  Flying high above them is an enormous, glowing, liquid neon kite. The center of the kite inscribed in lights, flashing like a marquee: HAPPY BIRTHDAY PEGGY SUE.  The kite begins to descend towards them. Peggy jumps to her feet and races towards it. She grabs the tail and starts to sail away with the kite. Charlie chases after her.   Peggy! Where're you going? Come back!   But I love you. I'll love you forever.   Come back to me.   Richard, do something!   Peggy!  Charlie, Richard and the old men behold Peggy, bobbing and dipping playfully in the sky. We begin to HEAR Charlie's VOICE singing \"Peggy Sue\" O.S. Peggy looks down with wonder at the earth, and then like a comet, soars into the blackness. In an instant she becomes a star.   . Peggy Sue, I love you, and I need you Peggy Sue...   I thought you were...for a while.   But happy. Very happy, Peggy Sue.   I wanted to apologize. I can't live without you.   That's over. I got tired of translating everything. She thought the Big Hopper was a hamburger.  Charlie laughs uncomfortably and Peggy Sue looks around her hospital room.   Everyone.  Maddie and Arthur, Carol and Walter. Richard Norvick.  And here's a book, by that guy from high school, Michael Fitzsimmons. He dedicated it to you.  Charlie returns to Peggy's bedside and opens the front cover of the book.  ANGLE ON BOOK: the front page bears the title \"The Pilgrim Soul\" and the dedication reads \"to Peggy Sue and a Starry Night\".  Peggy smiles but shakes her head.   I'll just set it right here.  He places the book on her bedside table as he sits back down.   Oh, God, Dion.   I'll never give up.   I loved you since the day I met you, and I haven't stopped.   Listen, I don't expect all the troubles between us can just vanish away. But I would do what I can...   Well, I'll let you get some rest...so long.  The VIEW PULLS BACK past the flowers. Charlie starts to exit. Checks himself in the mirror.",
        "Bodell": "MOVING VIEW, revealing the empty house. We HEAR the RECORDING   \"Crazy Charlie's Discount Appliances\" truck has parked in front of the house. WORKMEN are loading boxes of records, tapes, etc. Charlie pulls up, waves to workmen.    Look at that freezer chest. What capacity.  Hello Peggy Sue.   Fine, just fine.  Peggy gives him a big hug and a kiss on the cheek.   Charlie's in the back.  Peggy walks towards the back as Mr. Bodell explains:   My future daughterinlaw. Very affectionate girl.",
        "Rosalie": "I remember that dress.   I remember when you got that locket, too. You were so excited I think you showed it to the whole school.    I think you got married when you were three.   I enjoyed it.   What's up?   Don't be silly, I'm the best in the county.   I spend three hours a day practicing. I have trainers, I know what I'm doing.   Not to me they don't. I'm going to win the State, then the. Nationals, and then I'm going to the Olympics.   You're sick. You should go to the nurse. I'm going to tell Miss Dennis.  Rosalie exits into the pool area. Peggy feels helpless.",
        "Testa": "",
        "Walter": "Just call me Walter the dancing dentist. Taps and caps. My specialty.    Whoa! Cat fight! Purse war!   The best thing about being a dentist. Pure pharmaceutical grade. A couple of lines of this, I can drill my own teeth... (looks at her for a moment Hi.      I demand a recount.    Why does your father take inventory on Sunday night? That's poker night. You always got out of it before.   Strange rumors are sweeping the school about you.   Prom what I hear, you really gave it to old Smellgrove.   That's enough out of you, little lady.   She's not wasting any time. Peggy Sue and Mr. Square Root?   Oh, a book... Excuse me for a second.    Oh, it's you is it.   The Yanks got the hitting but the Sox got the defense.    Like who?   Put on some makeout music, and kill the lights.  We HEAR a RECORD SCRATCH. A slow song begins. The lights are dimmed. Coupler begin to slow dance. Charlie holds Peggy close, barely moving. Peggy is mistyeyed, moved by being in Charlie's arms again.   Hey Charlie, what do you think of this?  Walter does a totally demented dance step, finishing by strumming his leg like a guitar. He stands there grinning.",
        "Getz": "",
        "Jack": "",
        "Delores": "",
        "Dodge": ""
    },
    "imdb_rating": "6.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYjg2MzE1MzQtZDY2My00YzU2LThjNmMtODY5YTU5ZDQ2MzAzXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_QL75_UX380_CR0,7,380,562_.jpg",
    "description": "Peggy Sue Bodell (Turner) attends her 25-year high school reunion after separating from her cheating husband, Charlie (Cage). She regrets the decisions she has made in her life, such as getting pregnant by Charlie in high school. When she faints at the reunion, she wakes up in 1960 - and is given the chance to relive her life.",
    "name": "Peggy Sue Got Married",
    "genres": [
        "Comedy",
        "Drama",
        "Fantasy"
    ]
}