{
    "filename": "Phone-Booth_script.txt",
    "imdb_id": "tt0183649",
    "imdb_url": "https://www.imdb.com/title/tt0183649",
    "characters": [
        "Adam",
        "Kelly Shepard",
        "Captain Ramey",
        "Pamela McFadden",
        "Stu Shepard",
        "Sergeant Cole",
        "Leon",
        "Felicia",
        "Mario",
        "Pizza Guy",
        "ESU Commander",
        "The Caller",
        "Corky",
        "Negotiator (as James Macdonald)",
        "Asia"
    ],
    "dialogues": {
        "Adam": "",
        "Kelly": "Shepard residence.   Hello?   What's taking you so long?  I thought we were having some lunch at Mario's?   How come?   That's disgusting.  Okay, I'll fix us a sandwich.  Where are you now?   How come?  The caller ID says you're on your cellular.   But you're also in some phone booth?   Well just hurry on back.   Are you sure you're alone?  I hear somebody in the background.   Do you?   Stu -- who was that man?   Some person who phoned fifteen minutes ago -- just after you went out.   This total stranger rang up and told me to wait by the phone -- because you'd be calling me in a few minutes -- from a booth.  And I said what would he be doing in any phone booth?   He said you'd be making phone calls.  What else?   To whom?   Women?   You know exactly what I mean.   I just feel something is wrong.   The way you sound.  You don't sound like yourself.   Someone who's scared.  There's fear in your voice like I've never heard before.   I want you to come back home.  Now!   No.  I want you here now.  In case he calls back, I don't want to answer again.   I feel like he's going to.   He's not a nobody.  He knows about us.   I can't discuss it on the phone. Just get over here!  CLICK!  She hangs up.    in the crowd.  Distant yet distinct amongst the curious onlookers.     What do you mean psychiatrist?  He doesn't see any psychiatrist.   There was some guy that called the house this morning and said weird stuff to me.   He hasn't got many friends -- I can tell you that.   You won't hurt him?    She screams, tries to break through but cops restrain her.   I was so afraid.  I thought...   Remember how you swore up and down you'd get me on TV?  Well, you did. I already got interviewed on Fox and Channel Eleven and they even want me on A.M. America tomorrow morning.",
        "Shepard": "",
        "Captain": "You have thirty seconds to comply.",
        "Ramey": "You have thirty seconds to comply.   You've been given an order.  The Sergeant slides up beside the Captain to confer.  PRODUCTION NOTE: We remain in LONG SHOT of the cops -- always from Stu's POV.  But we can hear their voices and all that is said as if they were in close up.  It has an odd, unreal and distancing effect.   Well he's not getting his wish.  In the center of the street, an ambulance pulls up and a team of medics jump out.  They rush to Leon's body.  (Again we hear their voices close, even though visually they are far off.   Maybe it's more than a coincidence. Cover me.  I need to talk to him.   What do you think?  The Captain steps out of cover and boldly approaches the phone booth.  He stops cautiously about fifteen feet away.   I'm not armed.   Yeah, sure.  I need to know what happened.   Sure you can.  My name's Ramey. Captain Ed Ramey.  What's yours?   You look like you need a friend.   Is that who you're talking to on the phone?   When somebody gets shot, it becomes my business.  Let's not have anybody else killed.  I want to hear your side of it.   Has this happened to you before? The need to hurt someone?  To put a bullet in them?   Try me.   You're right.  I don't believe you. What's that bulge in your pants pocket?   A cellular?  Then what are you doing in a phone booth making calls?   Don't reach for it, mister.   I don't need to see it.  I know what's there.  All these witnesses saw you use it on him.  From behind a parked car, a HOMELESS PERSON calls out.   A man is dead but it didn't happen.   You're walking through a bad dream and you can't wake up.  Do you want to wake up?   And in this dream, you killed that man.  He was bothering you so you iced him.   Then who did?   But you saw it happen?   You were the closest one to him. You must've seen who did it.   We're trying to be honest with each other, aren't we?   Who do you keep talking to on the phone?   What's this doctor's name?  It's important we know.   I respect your right to privacy. I've been to therapy myself.  The department provides it.  I know it's not good form for a cop to be admitting that, but...   If it makes you more comfortable.   Al least tell me your first name.   No gun and no name.  You're a highly underprivileged person.   It'll be hard to find a lawyer willing to risk his life.  But if you hand over the gun...   We'll take it out for you -- as soon as you exit the booth with your hands raised and...   We're not about to force you because there could be a miscalculation and then we'd never find out why this happened.   It's what makes the job interesting.  Finding out why. Something drove you to do this. You didn't go out today expecting this to happen.  It was a nice day. You were out for a walk.  And then suddenly it all changed.   You got some bad news on that call.   Something that pushed you over the edge?   Time to land.   I'm your safety net.   I'll go see about that lawyer.   Have you got the number of that booth?   Can you tap into that call?   Shit.  I don't want to blow this on a technicality.  Tracing the call isn't any violation, is it?    Okay, we've got to know who he's talking to and their current location.   I need the number and an address to go with it.  Helfand rushes off.  At the corner, we can glimpse him entering a phone company utility truck parked on Forty-Fifth Street.   Then who'd your husband be talking to?   Stu seems to be checking things out with this person.   Remain here, please.  We may need you later.   We'll do our best not to.  Kelly is left alone as the Captain returns to their command center.  Kelly is once again a solitary target.  She could be picked off without attracting undue attention.   Shit.  He hung up.    Hold your fire.  Let him answer it.  The SWAT team backs up but maintain their aim.   Let them talk.  He's not going anywhere.  He's going back inside the booth.  Indeed we see Stu re-enter the battered phone booth and pick up the receiver.   Hold all fire until you actually identify a weapon.  We're doing this on fucking TV!   They should've traced the fucking call by now.   Patch me through.  Hello, this is Captain Edward Ramey.  What about that call?   We're there!  Can you play me back your recording of the entire call?   Then switch to another machine and play back what you've got.   Have you got the room?    Move your SWAT units to the hotel. No... wait.  Any movement will alert the sniper.  If he sees any of us withdraw, he may panic.   Intercept them.  Divert them to the hotel.   Send them in from the Forty-third Street side.  I don't want any activity the sniper might catch sight of.  He's probably high up and facing that booth.  He's got to continue to believe our full attention is focused on the man inside -- whoever the hell that poor bastard is.  Hello 911 operator, I missed some of that.  Run it halfway back and repeat it.    Jesus... he's a dead man.   Hello?  This is Captain Ramey. Somebody talk to me.   What's his condition?   Get a statement from him.  I'll be right over.  He drops the receiver so that it dangles again.  CAMERA FOLLOWS RAMEY to where Stu lies surrounded by cops and medics.  He's stunned, but very much alive.    Rubber bullet.   Somebody was going to and we thought it may as well be us.   Sure as hell did.  Thanks to you.   Barely.   Relax.  The guy's dying.   We'll see.   This is Ramey.  Over.  This is Ramey.  Ten-Four.  There's nothing but static, mixed up feedback and multiple garbled voices on the other end of the line.   Shit.  Get everybody off this wavelength.  He crosses back to the phone booth -- picks up the dangling receiver.   Hello.  Hello!  Pick up!  Yeah, it's Ramey again.  Can you hold the phone close enough so the perp can listen?   He's not about to talk to us. Maybe to him.  Ramey looks back to where the medics are still trying to lift Stu onto the gurney.   Forget that.  Stand him up.  Can you stand?   Help him over here.  The medics support Stu and inch him back to the booth.  It's painful, but Stu ignores it.  Ramey holds the phone up so Stu can both listen and speak.   Here.  Speak up.   Don't worry.  We'll find out who he is.  And why he picked you.",
        "Pamela": "",
        "McFadden": "",
        "Stu": "Wish I could accommodate you, Mario, but this is my busy time of day.   Why don't I stop in later for some lunch?   I'm doing my level best for you people.   I got the food critic from the Village Voice all lined up to give you a review.   I was allowing you time to expand the menu.  Wallpaper the bathrooms, for God sakes.  You get only one shot with these fucking critics and I don't want you to blow a rare opportunity.   Hold on right there.  I've got a very excellent reputation around this town.   Hell, I'm not an agent.  I'm a publicist.   Believe me, Valerie's on the waiting list to audition.  Harry's got no complaints.  He just let me pick out this tie the other day.   Mario, please let me make this up to you.  How about I arrange for the opening night party for this new off-Broadway show I'm handling -- to be held at your place with local TV coverage on nine and eleven?  I mean I had it promised to another client -- who actually pays me money.  But it isn't firmed up yet.  And I could throw it your way.  Maybe.   You'd toss in the buffet for say seventy or eighty.  The producers would supply their own vino, of course.  I'd deliver you a truckload of celebrities.  And if they like the food, they'll all come back, naturally.   You want Liza Minelli?  An Oscar winner.  Or Douglas Fairbanks, Jr.?   I saw him last night going into the Four Seasons.  I'll bring you over a whole VIP list when we come by for dinner.   You can't think small like that. Hey, you still feature musicians Fridays and Saturdays?   What about Harry's daughter as an extra added attraction?  She'll belt out five or six showtunes -- two sets a night -- and it won't cost you a fucking nickel.   Star Showcase!  Let me handle setting that up.  And when she eventually goes on Letterman, she'll announce I'm currently appearing over at Mario's fine supper club.  Right over CBS she'll say that, Mario.   That's just a vulgar word for PR. (placing an arm around him Mario, you can't hurt my feelings. Even when I was a kid and they hurled certain invectives my way, it never bothered me.  Other kids would fall apart if anybody called them a fucking name.  Me, I just loved the attention!  'Shit-for- brains' -- that's what the bigger kids named me.  And I answered to it.  Hey, 'shit-for brains' reporting for duty.  Everybody loved me for that.  I could take abuse.  After a while, I kind of wore them down.  There was nothing more they could say to me.  So they stopped.  I kind of missed it.   I'll bet your loving wife put you up to this.  She saw me pass by and she sent you out in the street. But I don't hold it against you personally -- you still serve up superior veal chop.  Now I got urgent business to conduct, Mario.  He slides the booth closed in Mario's face.  The frustrated restaurateur glares at him through the glass before giving up and walking off -- talking to himself as he goes up the block.  INSIDE THE BOOTH, Stu inserts his thirty-five cents and dials.   Hello, Mavis, sweet creature.   I'm only a few minutes late, loveliest individual on earth.   Good news in that arena.  Kelly goes into rehearsal as of Monday. You know how dedicated she is.  By the time she gets back from dancing her ass off, she goes right to sleep.  We'll have both our days and certain nights.  Not to mention when they take the show on the road.   Four to five weeks -- minimum.   I wouldn't do that.   That's how you met me.   I'm much better groomed since you've been looking after me.   Even Kelly remarked on it when I first met her.   The marriage is not without its compensations.  Do you imagine I could afford that apartment on what I'm earning?  Not with everybody cutting back on the publicity.  Not to mention a million college graduates coming into the profession trying to cut me out. And one thing you can't expect from your clients is loyalty.  They get a couple of bad notices, they dump you.  Goodbye.   I wasn't saying goodbye to you.  I was saying how the clients try to give you the wave off without even a month's notice.  A conservative businessman now stands outside the booth waiting to use it.  He deliberately glances at his watch a few times to demonstrate his impatience.  This bothers Stu who slides the booth open a crack.    What?  Is your watch busted?  It's twenty after eleven and I'm gonna be occupied indefinitely with my transaction.  So get out of my face!  He closes the booth up again and turns his back to the gentleman who gives up and departs.   Sorry, honey.  There will be no further interruption.   On account of that phone records are regularly subpoenaed in divorce proceedings.  And I don't want some entry showing up on my cellular bill either.  She gets the mail. She looks these items over. Sometimes she even dials up a strange number to see who it is.   It's only because her last husband, the choreographer, ran around on her.  She can't get that out of her head.  That's how she caught onto him.  The phone bills.   You know what a self-fulfilling prophecy is?  She was so sure I was going to find me a woman that she finally drove me back to you.  I thought I'd feel all guilty about it -- but I guess it hasn't kicked in yet.  Still, I wouldn't do anything to hurt her.  Basically, Kelly's a decent individual.   Hurt?  You were glad to be rid of me.   That's about the nicest thing you ever said.   We've been up front with each other from the beginning.  Let's keep it that way.  How about a drink?  Say seven o'clock?  The Monkey Bar?   Yeah, you're great enough looking to be mistaken for one of those thousand dollar a night girls.   And wear that short black number I bought you from Bendel's.   Have a good day.  Make plenty of tips.  And leave the whole evening open.  She thinks I've got Knicks tickets.  He hangs up.  Then whips a tiny cellular phone out of his jacket pocket, flips it open and dials.  Someone answers on the first ring.    It's your boy Stuart.  When was the last time I called you for a favor?   I just need one line.  Anybody you wanna say was seen dining out at Mario's Stromboli restaurant.   Who's asking any favors?  I'm offering reciprocal information.   Check it out.  Tony award-winning producer Willie Beagle tossed his wife back into rehab again following her third attempt at diving off the terrace at their plush eighteen room residence at the San Remo.  I got it from the doorman.   Louis, my intentions were entirely honorable.   What?   I've got a heavy day, mister.   I don't know you at all.   Who is this?   Get lost!   Where?  Where are you?   I don't see you.   Okay, you had your little joke.   Do me a favor.  Call up somebody else.   Why don't you tell me?   Is that what you do?  Count them?   What are you -- a shut-in of some kind?   Somebody's looking for you?   The cops?   The ex-wife.  What'd you do -- run out on child support?   Frankly, I could care less.  You had your fun.  Now goodbye.   Isn't that just too bad?   There's ten million names in the phonebook.  Pester somebody else.   Alright, bullshit artist, what am I doing right now?   Okay, okay, you got me in your scrutiny.  So what?   Only I got nothing to say.   Is that a fact?  Well if you watch closely, you will see me hang up.   Why not?   Why should I be interested in some creep who gets his jollies spying on strangers in phone booths?   Who put you up to this?   Why me in particular?   Ha!  What've I got to be afraid of?   Just about everything.  You have so much to hide.   How do you figure that?   That's my business.   All of a sudden I'm required to give explanations to you?   What is this?  Some kind of candid camera gag?  Or like that thing on HBO where the cab driver is taping what goes on in the back seat?   Your reality.  Not mine, you lowlife fuck.   Now you're threatening me!  Fuck you.  Could that be any clearer?   Oh yeah.  Right.  Can you see how I'm trembling?   Shit, this is a new one.  Fucking threatening calls in a goddam phone booth.  When are you going to start with the heavy breathing.   You don't know anything about me.   Like what?   How would you know that?    PANNING up at thousands of windows.  The Voice could be coming from anywhere.     Don't.    Mavis!  Just hang up the goddam phone.   Mavis -- the guy is a fucking nutcase!  Hang the fuck up.    He doesn't know my wife!  Don't tell him anything else.  Outside the booth, a huge, heavy-set black woman in a too tight dress, now appears with the clear desire to use the phone.  Her name is FELICIA.  She taps on the glass.   Can you hear me, Mavis?  Keep your big mouth shut.   Don't believe a word of it.  It's all lies.   It's not true.  I do care.  From outside the booth, there's a louder rapping on the glass.  Felicia really wants in.   Go away.   You total asshole!  How could you do that?   Like hell I will.   There's no chance of that.   You don't know our phone number!   And I'm supposed to believe that?   What are you going to tell her?   What am I supposed to say?   Look, I don't want to hurt Kelly. She's always there for me.  It's just my nature to have a little 'strange' on the side.  It doesn't mean shit.   Kind of like having a beautiful home.  With everything you ever dreamed of.  But you still need that vacation now and then.  Some nice hotel room with a great view. Maybe a pool.  Only you wouldn't want to spend more than a few days in any hotel.  Eventually, you want to go back to your home and all your stuff.  You're real glad to check out.   You're ruining my fucking life, you sonofabitch.   What else can you do to me?   She's not home.  She went out.   There's another booth on the next block.   Well, I'm not through!  Go in a restaurant or someplace, but get away from me!   Let me hear from your lawyer!   I'm doing it.  He punches in the digits.  The phone rings -- and rings.   I told you she was out.   Honey, it's me.   Change of plan.  We're not eating in that dump any more.   The Health Department gave them a 'C' rating -- that's how come. Here I'm trying to put the place on the map and he fucks it all up with a major roach problem.   Just in a phone booth.   Oh yeah, I am.   I only stepped in because the traffic was so loud outside.   Not for a few minutes.   The guy in the next booth.  He's got a bad connection and he's hollering his fool head off.   I love you, baby.   You know that.   What man?   I don't understand...   And what did this guy say?   Making calls is part of my business.   Clients.  People.  Planting items like I do.   Once in a while one of them could be a woman.  I just called \"Elaine's\" and talked to her to see who was in there last night.   You're not going to start that shit again?   What could be wrong?   Yeah?  Who do I sound like?   I told you.  In a while.   Why should he call back?   You're the one that sounds frightened.  And of nobody.   You're not telling me all he said. What are you holding back?    Why did you do that to her?  She never did you any harm.   Maybe me -- but not her.  Whatever I've done, there's no reason to take it out on her.   Yeah, I do.   But Kelly... I would never hurt.   Listen, I've treated all my women decent.  I never laid a hand on any of them, even when provoked.  And I always let them down easy.  I'm not ready to let Kelly go. Maybe I never will be.   I'm not gonna let you mind-fuck me all day!  That's it.  This call is ended.   What happens if I hang up?   I'm dying to hear this!!!  What the fuck can you do about it -- up in your fucking high window with your goddam binoculars?   Oh -- while you're at it, have a look up my ass.   What?  You mean... like a rifle?   I'm supposed to believe that?   And you're just going to kill me for no reason?   I get hung up on all the time.  You get used to it.   Then why didn't you go after one of them?   Hey, I have worked in a boiler room myself peddling \"Term Life.\"  I Would never be rude to a fellow salesperson.   Shit -- I do feel it.   Across my forehead -- now back where it was before.   No, I'm not thinking that.   No.  You will.  I know you will. If I just cooperate.   Below the shoulder?   The right shoulder.   What others?  What do you mean?  You said 'others!'   I saw it on the news.   Oh, God.  Forty-fifth and Eighth.   I don't know.   He was gunned down.  And nobody was caught.  And they didn't even bother to take his wallet or his watch... or anything.   What did he do?   Please -- don't do it to me.  You got no reason to do it to me.   I'm not looking to.  Tell me what you want!   What's to tell?  I'm in Public Relations.  They used to call us \"flacks.\"  Now we're media consultants.   Plant items in the paper and on the tube.  More important sometimes, keep stuff out.   One of my people got nailed for indecent exposure.  I managed for the cops to use his real name instead of his stage name so nobody picked up on it.   He's in major therapy now.  I swear he is.   I'm real close with Larry King. And the \"Hard Copy\" people.   Why would he want to come here?   He comes from Atlanta.   I don't know.   Definitely no chance.   How many?   I gotta have the facts.  They might not believe me.  My record isn't too good when it comes to hard news.   On a divorce or separation, maybe. Or who's gay, or who isn't gay any more.  I kind of specialize in that kind of material.  I mean I could probably get you Joe Franklin.   I might have a shot.  Are you familiar with Liz Smith?   Want I should call her?  How much can I say?   She usually likes to have a celebrity involved.  If you had an actor or a sports figure held prisoner instead of me, there'd be better odds she's come.   Let's see.  Who does she like?  Who couldn't be reached to deny it?    Sometimes you only get her service.  Hi -- Stu Shepard.  Put me through. I've got hard news for her.  I can only talk to her directly.  But say it regards -- Liza.    No, I can't call back.  I'll have to lay in on somebody else. Alright, but I can't hang on long.  She's coming on.  Liz, hello.  Sure I'll make it brief.  Killing two weeks ago in the theatre district?  Turn out a sniper did the job.  Yeah, a sniper with a rifle.  Now he's got another victim lined up.  Not just your anonymous New Yorker, but Liza. Now you can't call anybody or Ms. Minelli's dead meat and so am I. She's hostage in a phone booth right in the sniper's sights.  But he says he'll talk to you and let her walk.  I know it'll take balls to do this, but you're a fine and courageous newspaper woman...  There's a click.  Silence.   Hello?  Hello?  Either she's on her way over or she doesn't believe me.   I didn't really believe in what I was saying.   I do.   At least ninety-five percent, easy.   No.  Don't shoot.   Oh, my God.  A dot.  A fucking red dot.  A tiny red dot now moves across Stu's chest.   The laser dot.  Just before some poor bastard always gets blown away.   Don't tighten.  Don't even tickle that fucking finger.   You're talking about the old Geraldo.  Look, I can try and reach cable NBC.  They're hungry.   They do a great job.  They'll haul a whole crew over to cover your surrender \"live.\"   That's entirely up to you.  Your choice.  I'm just trying to set you up with the proper communicator.  I suppose Liza wasn't strong enough.  I should've said Madonna.   I'm not through.   Fuck off or I'll call a cop.   I can't.   I can't explain it.   I'll make it worth your while to go away.  How much do you want?   Thirty dollars.  It's all I've got in cash.  Take it and go.   I don't know.  For as long as it takes.   Do you want the money?   Come on, man.  That's my good watch.   Then here.  Take the damn thing.   Take it all.  The pimp pockets the watch and the money.  But doesn't go away.   I apologize.   An accident.  I'm sorry about that, too.   It's long distance.  I can't lose the call -- I might not get them back.   That wouldn't be a good idea.  Would it?   I gave you everything I've got.   You want the ring, you've got the ring.  If I can get it off.   Let go of me!  It's coming loose. There.  Okay, Felicia, with my deepest apologies.  Goodbye now.   Nothing.  Talk.  That's all.   This has nothing to do with drugs.   I knew it smelled for some reason.   Because I am.   I'll take it up with the mayor.   No, you didn't.  It was a fair and equitable deal.  You had territorial rights to this booth and I paid a license fee.  Fair is fair.  Now leave me in peace.   Thanks for your interest but I'm in perfect health.   I'm terminal, okay?  Now can I close the booth and continue my conversation?   Fine.  Give it back.   Well go wash your hands.   I'm sick of you.  Now get out of my face.   Touch me and I'll throw up on you.  At the suggestion, Leon lets go quickly.  It looks like a stalemate.  Stu isn't vacating the booth and Leon and his lady are reluctant to touch him further.  He does indeed look sick.    You can see what I'm up against here.   What do you have in mind?   God -- no.  Don't.  It's not necessary.   I'll handle it myself.   No.  For your own safety, mister, just walk away.   You're making this happen.    This isn't my fault.  Stop that!  But Leon continues rocking the booth.  It won't come loose -- so in frustration, he punches in a side pane of glass.  The glass shatters all around Stu, who does his best to shield himself from the slivers.    The guy's insane!   I can't.    Hello?  Hello?   I can't help it!   No.  It can't.  That's not fair.   Yes.  Stu sees the red dot reappear on Leon's chest as he continues to barrage the booth with punches and kicks.  Then Leon recoils, staggers a step backward.  He doesn't realize he's been shot.  There's been no sound of gunfire.  Perhaps a silencer was used -- or the downtown traffic drowned out the solitary discharge.  Leon looks confused at first.  His ladyfriend has no idea he's wounded -- neither do the derelicts and street people who've assembled on the corner.  Even Stu isn't sure -- until the blood starts oozing from the wound on the pimp's chest -- staining his yellow vest.  He isn't assaulting the booth anymore.  He's trying to keep his balance.  He slumps forward, hanging onto the booth for support -- only a few inches from Stu's face.  The blood runs down the side of the booth.    You did it!   I said 'Yes, I can hear you.'  Not 'Yes -- kill the motherfucker!'   You're twisting it all around.  I didn't do this!  Meanwhile, Leon leans upright against the booth.  Then his legs cave in and he begins to slide to his knees.  Felicia runs up beside him.  She sees the blood.   I didn't.   How could I?  I don't even have a gun.  Look!   Come back.  You've got to see -- I'm not armed.  Only Felicia remains, leaning over the pimp's body, staring helplessly.   I can't hang up.  That's what this is all about.    I can use this.  Emergency.  Yes.  There's been a shooting at Forty-fifth and Eighth -- on the corner.  A man is down. What's the difference who I am?  I don't want to be involved.   That wasn't nice.   I'm not going anyplace.  I'm staying right here in this booth.  Unless you give me permission.   What do you expect me to say?   You mean...?   They can't blame me -- I'm not armed.   They can see with their own eyes.  Not far away, we hear the BLAST of POLICE SIRENS drawing closer.   How can I?   This isn't a story.  This is real. This is murder.   I gave him my money, my watch...   He was a fucking thief.   I don't feel a bit guilty.  This is all your doing!   Hey, I'm not taking any more criticism from some lunatic sniper who gets his kicks killing strangers.   You're a man.  I know you're a man. Women don't kill with telescopic rifles.  They stab you.   I've got no time to rehash my whole life.  Oh my God!  The cops are here.  Police cars are pulling up on all sides of Eighth Avenue.  Traffic has suddenly been shut down.  Prowl cars have now blocked the streets.  PRODUCTION NOTE: Everything is seen from Stu's perspective without intercuts.  Half a dozen cops now emerge and approach with drawn guns.    They're ordering me to come out.   What if they open fire?    A distant crowd gathering on the opposite west side corner behind the police cars.  Some tourist is capturing the event on video.     What about him?   You call this safe?  Six cops with guns pointed my way?   Absolutely no more shooting.  Now is that clear?    You won't, because there isn't any.   I can't.  I'm on a phone call.  Now a black POLICE CAPTAIN arrives and takes full command of the situation.   I told you.  I'm busy.  Come back later.   Neither am I.   Can't talk about it.   Look, I don't want to be friends.    I've got a friend, okay.   None of your business.   I've got no side of it.   You won't believe anything I say.   I couldn't shoot anybody.  I'm not armed.   That?  That's my cellular.   Do you want to see it?   Then how can I show it to you?   They're all lying.  Nobody saw it because it didn't happen.   Not on account of me!  This is like some bad dream.   I'm trying.   No.    I don't know.   Yes.   No.   Not necessarily.    I'm handling this.   Nobody.  My psychiatrist.   He says not to tell you.  It's privileged information.   Whatever you say.   Stop right there.  Back up a few steps.  Back where you were.   I want you to read me my rights and stop asking questions.   It's my right not to have any name.   And get me a lawyer, too.  I want a lawyer brought down here to negotiate my surrender.   How can I when you won't let me take it out?    Now we're back to that again.  It's always \"Get out of the booth.' 'You can't stay in the booth.' Well, I like it in the fucking booth.  It's my whole world now. It's my booth and I'm never coming out.   Why is it so important to know? The guy is dead.  Isn't that enough?  Knowing isn't going to make him alive again.  So who gives a fuck!   All I wanted was to make a phone call.  One lousy phone call for thirty-five fucking cents.   The worst.   And I've been falling ever since.   When you hit bottom, you die.   If I tell you what you want to know -- you'll die, too.  Something about the implied threat sends a chill through Captain Ramey.    the detective fifteen feet away.  Ramey decides to back off momentarily.   Now that's a good idea.  The Captain withdraws back across the street.   They're just hoping for coverage of me dying in the gutter.   Those cops are just looking for any excuse.   Kelly.  She was worried about me.  Stu is afraid to reach in his pocket lest the cops think he's going for a gun.   She doesn't watch daytime TV.   Why are you saying this?  You want me to reach in my pocket so you can see them open fire?   God -- how I'd love to hear her voice.   If she knows I'm in trouble, she won't give up.   You said I'm not allowed to leave the booth.  Finally the cell phone stops ringing.   No, thanks.  I'll stay where I am.   If you shoot me, you give yourself away.   You expected them to come.  You had this all worked out.   Poor Kelly.  What she must be going through.   I'd never get the words out.  Not with fifteen or twenty rounds in me.   They wouldn't wait to see.  The cellular ringing continues jangling Stu's nerves.   Why doesn't she hang up?  Then Stu notices something in the crowd gathering far across the street behind the police barricades.  Countless faces rubbernecking, probably hoping to see some display of violence that would end with him face down dead on the pavement.  And in the midst of them -- one face familiar to him.  A female, quite pretty... even in tears.  It's Kelly.  (We see her only in LONG SHOT -- a distant figure in bright green jacket that makes her stand out from the crowd.   It's her!  She's not calling me. She's over there.   The blonde girl in the green jacket.   She must've heard all the commotion and come downstairs.  The cellular is still ringing.   It's somebody else who knows my cell number.  It's you!   Why is it so important that they kill me?   This time you won't.  If you want me dead, you'll have to do it yourself.   It's all a game to you -- because you're incapable of feelings. You're not even human.   I quit.  I'm not answering back any more.  I won't hang up but I'm not playing.  There's silence now between them.   No!   Leave her out of it.   Don't.  Please don't.  I'm sorry. I'm talking to you again.  I'll talk all you want!   I've screwed up her life enough already.  Please don't hurt her.    in the crowd.  Distant yet distinct amongst the curious onlookers.    half leaning out of the booth, staring at his wife and the cops in the distance.   Take me instead.   No!  I'm hanging up.  That's it.  Stu hangs up the receiver.  He disconnects.    slowly stepping out of the booth.  His hands are raised.    I've giving myself up.  Take me!   Shit.  I can't.    He's just outside the booth -- expecting to feel the sniper's bullet go through him at any moment.  Then the pay phone starts ringing.  The sniper is calling back.      Yeah?  A strange voice begins chattering away in Spanish.  Totally unintelligible to Stu.    You got the wrong number.  Hang up.  The voice, probably a Puerto Rican gentleman, rattles on in Spanish.   Wrong number.  Wrong number.  Then the voice on the phone suddenly alters the Hispanic accent.  It is the now familiar tone of his tormentor.   Those cops won't wait much longer.   Will you look at that?  I must be going out over the network.  Bet they're pre-empting usual programming.   How are they gonna prove that I killed anybody when there's no gun?   No, sir.  No gun and I walk.   What do you mean?   Where?    It's not on the floor.   Up above.   If they see me reach for something, they could open fire.   I totally don't give a shit.   It doesn't matter.  I know about ballistics.  The slug in that dead guy came from your rifle, not any handgun.   There's no gun up there.  I don't see a damn thing.   I could never shoot anybody.   And I'd fucking love it!   I'm not getting my fingerprints on your fucking weapon.  What about powder residue?  How are they going to explain that to a jury?   No.   Get off her!   Look!  I'm reaching up with my left hand.  I'm pushing against the partition.  It's giving.  I'm feeling around with my fingertips. It's filthy up there.    feel about inside the shallow space.  The shriveled remains of dead flies -- a layer of dust -- and then a .30 handgun.   I'm -- touching something.   I'm not picking it up.   I wouldn't have a chance.   I'm not insane.   That won't happen.   Why would I do that?   Okay.  I know you can do it.  But don't talk about that.  Please.   Like that nerdy sonofabitch who blew those three wiseass kids away on the subway?   'I'm mad as hell and I'm not taking it anymore.'    'I'm not taking it anymore.'  'I'm not taking it anymore.'   Fighting back.  That's what it's about.   I'm on my knees begging you.    crouched forward.  The pay phone receiver dangles just above his head.  The cellular remains cupped in his hand.  Stu never lifts the cell phone.  He keeps the palm of his hand over the speaker of the phone to muffle any sound from the other end.  It rings and finally someone answers.    You've made your point.  Who's going to believe I've got a sniper with a telescopic sight holding me in a fucking phone booth at 45th and 8th?   If you'd put a bullet in that Captain Ramey, it would've been a different story -- but you were too wise to do that.    Why me?  You could pick off any of those cops from your window up there.  Like you did that pimp. And that tourist last week.  But this time you want me to do your killing for you.   This booth.  It's my whole world -- shrunk down to four feet by three feet.  Not much bigger than the size of a coffin.    When I saw you put that bullet into that black dude, I knew you'd never let me out of this phone booth alive.   (peering upward, squinting Let me see you first.  What harm can that do you?  You're in one of those windows.  I've got to know which one.   Being so far, I could never identify you.  I don't even want to.   Don't worry that I'd try to point you out.  You'd shut me up with one of your .30 calibre hollow points before I could even raise a finger.   I want to see that you exist.  Like God exists.  It's not enough to believe.  You want to see him -- just once -- even at a distance.   Show yourself to me and I'll take the gun down.  I swear.  There's a pause as the sniper mulls it over.   Stop!  I won't ask to see you anymore.   Who?   What are you talking about?   Mavis?  I don't see her.   You don't even know what she looks like.   I can't.    Stu looks down at the cellular.  He has no way of knowing if the police operator can hear any of his words.   I need time to think...   I do.   It wasn't Mavis' fault.  It was all my fault.   You'll leave them both alone?   I'll do it.   I need one minute.  One last minute, please.  Can you give me that?   Something like that.    'Who's going to believe I've got a sniper with a telescopic sight holding me in some fucking phone booth...'  The uniformed TELEPHONE TECHNICIAN now joins Ramey and the Sergeant.    '... Like you did that pimp.  And that tourist last week.  But this time you want me to do the killing for you...'   Are they?  I wasn't looking.   I'm too afraid.   I'm shaking all over.   As soon as the cops see a gun, they'll open fire.    as below he continues to hesitate -- it's agony --  The sweat pours down his forehead and his eyes are squeezed tightly shut.  He can already imagine the police bullets tearing into him.    His arm still raised.  He hasn't brought it down with the gun in it.  Not yet.  He holds the pay phone receiver jammed up against his mouth.   No.  You do it.  If you want me dead, then fucking murder me!   I am!  I'm doing it!  He pulls the handgun down into full view.  Curiously, the police do not open fire.   There!  You see it?  They all see it.  He waves the gun so nobody can miss it.   Where are you?  Damn you!!  He drops the receiver and steps halfway out of the booth.  Still the cops do not open fire.  Then Stu starts shooting.  Not at the police, but at the high rise buildings across the street.  At the thousands of windows that look down upon him.  He gets off two shots before a solitary rifle shot rings out in response.    The remaining glass on the south side of the booth shatters. Stu tumbles forward, sprawling out of the booth onto the pavement.   What was that?   It couldn't hurt much more if you really shot me.   Did you get him?   Still alive?   It's okay.  I'm not really shot.   I thought so, too.  But we're going to be alright.  Both of us.   Bet you didn't think I could deliver on that.   No.  No hypo.  I want to see him first.  The medics are now ready to lift Stu onto the gurney and cart him off.  But Stu struggles against them.   That's why I've gotta talk to him. Please!   I can try.    It's me.  Do you hear me?  Answer me.   I finally beat your ass.  Admit it, you fuck.   Now you're gonna die, you bastard.   Hang on.  I can't wait to see you at the hospital.  So I can yank your fucking air tube out.   What's your name?  At least tell me who you are.  There's more violent coughing, then silence.  Then a cop's voice is heard.   No.  You won't.  What do you want to bet you won't?  Stu reaches over and hangs up the receiver.  CLICK.   I'll spend my whole life trying to figure that out.  Then he sinks into the arms of the medics who lower him onto the waiting gurney.  The hypo is finally administered.  It kicks in immediately, relieving the pain.  He's wheeled away from the booth to the waiting ambulance. Kelly is already inside waiting to accompany Stu to the hospital.    pulling away in LOW ANGLE.  CAMERA SLIDES BACK inside the ambulance with Stu.  The doors shut, obliterating our view of the phone booth that was his entire world until moments ago.    Gotta sleep now.  No phone calls...  Kelly smiles down at him as the image blurs.  Stu passes out -- into a deep sleep he much deserves.",
        "Sergeant": "Throw down your weapon and come out with your hands raised.    You know the drill.  Hands clasped behind the back of your neck -- moving slowly -- step out of the booth.  If we see any sign of a weapon, we will respond.    I repeat.  Raise your hands.   We're dealing with a mental case. He's looking for us to kill him.   Same corner as two weeks ago.   You've got your vest on?   This here's Helfand, of New York Telephone.   But not without a warrant.  You could be violating this psycho's civil rights.  Especially if he's on the line with his fucking psychiatrist.   As long as we don't listen in.  We remain in LONG SHOT of the POLICE as they continue in heated conversation.   Maybe they already traced it. Anyhow, it doesn't matter.  Looks like he's coming out.   What is going on with these fucking phone calls?   Are you nuts?   (listening to transmission Officer on east side of the street reports subject removed a dark metallic object from his pocket. We better move.    There's something else coming in. A 911 operator says your name was mentioned by somebody that's still on the line.  Somebody talking about a phone booth.  And a sniper.   There's another SWAT unit on the way.   It's done.",
        "Cole": "",
        "Leon": "Drag your baggy butt out of that booth.  We got business to conduct out of there.   Hang up that receiver or I'll make you eat the fucking thing!   Do you see one around here?  What you think I'm gonna be doing while you're waiting for a prowl car to get assigned?  I'm about to cut you a second asshole if you don't vacate those premises.   I'm not interested in your explanations even if you had any.  He withdraws a switchblade knife from his pocket but doesn't open it -- yet.   If I flick this, I use it.   Make me an offer.   You're offering to rent my phone booth?  For how long?   What's so special in there?   Is that a genuine Rolex you've got on?   That's what it's gonna take.   And the thirty!   Now I'm satisfied.  But you still got to deal with Felicia here.  I believe you spoke harshly to her.   And did her some injury.   I agree.  Why don't you hang up a minute so we can discuss this matter at length.   Do I have to rip that fucking phone out of there?   That pinky ring looks attractive. Felicia might like that.   I can get it off you.  Leon reaches in and grabs Stu's ring hand.   What's really going on in that booth -- that escapes the naked eye?   That your connection on the end of the line?  Or are you dealing?   You gotta be high on something to willingly divest yourself of your valuables -- just to maintain occupancy of a fucking phone booth that the local bums piss in every night.   You look like you're ready to piss yourself.   Maybe if the city provided decent public toilets, folks wouldn't relieve themselves in the subway stations and phone booths!   Next thing you know you're gonna claim we mugged you -- took your billfold and watch.   You sure you're alright?  He don't look well.   Jaundice they calls it.  Probably advanced liver trouble.  If it's cirrhosis, you better find yourself a twelve step program and quick.   The man is cracking up.   Me?  You're the one that brought me over and exposed me to all his germs.   I'm worried now it might be catching.  All that money out of your sweaty pocket is probably crawling with some rare and incurable disease.   What good's that?  We done touched it.   Come on now.  Own up to what you're carrying.  Is it some of that sexually transmitted shit?  Cause in that case, we can relax.   Here we's being solicitous as to your health and you respond by heaping abuse!   Now the man is turning aggressive... issuing threats upon my person.   If you don't hang up and step out, I'm about to topple this booth into the gutter with you inside it.  Reluctant to touch Stu again, Leon assaults the booth itself. He begins shaking it violently -- trying to rip it from its foundation.  And the rickety booth is not too sturdy.  It starts rocking back and forth.  Stu is thrown around inside it, barely keeping his footing.",
        "Felicia": "Could you hurry it along?  Stu ignores her and Felicia glares at him through the glass with hostility.  Stu has no inclination to deal with anybody else.  He's too distracted by the madness happening over the telephone.   Get done in there, mister.  I got me an important call.   Shit I will!  Finish up!  She continues to rap on the glass as Stu tries to focus on the two-way phone call.   If you got you a cell phone, how come you taking up the whole fucking booth!  This here's an emergency!   It's busted.  Every damn phone on Eighth Avenue is busted but this one.   I'm gonna pull you out of that booth and snatch you ballheaded!  She tries to pull open the sliding door to the booth but Stu jams it shut, right on her hand.   You assaulted my person.   You're hear alright.  I'm coming back.  And your ass better not be around.  She stalks off obviously in search of assistance.   He been in there all day.   He's got him a fucking cellular. What's he need to be on our booth for?   The man don't sound like he means it.   It might fit.   Kind of pale.  Even for a white man.   So how come his hand is shaking?   Lookit the sweat pouring off the sonofabitch.  That's one sick mother you started up with, Leon!   Whip his arrogant ass.  Leon reaches into the booth and grabs Stu's jacket.   Don't cut yourself, honey.  A crowd of derelicts and street people are now gathering to watch the out of control pimp take out his wrath on the booth and its occupant.   I warned you not to cut yourself.  Look at all that blood.  He must've hit an artery.  She screams as Leon topples backwards onto the pavement.  Now his chest wound is evident.   Oh, Jesus.  What is that?  Talk to me!  What happened?  The crowd tightens around the fallen body.  Street people who are fascinated but not shocked.   Somebody call an ambulance.   You shut the fuck up!  Her focus turns to Stu in the battered phone booth.   Why did you do that to him?    You all saw it!  He shot my man without no provocation!   Hang up and dial 911.  Get a doctor!   You're gonna stand there and let him die?    That's bullshit.  He's the shooter. You're talking to the shooter.  Stu quickly disconnects the cellular.   Go ahead -- make a fucking run for it.  I hope they gun you down -- like you did him!    That's him -- in the booth.  He's got a gun!  As she hurls accusations, she's lugging Leon's lifeless body out into the gutter into the center of Eighth Avenue.  It's a bright afternoon.  In the distance, we hear the maddening HONKING of uptown traffic that is now being rerouted, creating a huge bottleneck and raising the anger of irate motorists and bus drivers whose horns provide their simplest form of protest.  It's a discordant concert that echoes the confusion and frustration which Stu now feels...  As the cops surround the booth -- at a distance.   Tell me he's gonna be alright.",
        "Mario": "Stu, we got to talk.   How come you cross the street every time you go past the restaurant?   There's no more drinks or free meals until the restaurant starts showing up in the columns like you said.   One lousy mention in the Post and you expect to eat for six months!   That's what you tell me last July. And he never shows.   You the one blowing it.  How long you think you can fuck everybody?   So how come you take two nice suits of clothes from Harry and never get his daughter on David Letterman?   Mister, you're nothing!   That Harry's a damn fool!   What is involved?   What celebrities?   Is he still alive?   How come everybody wants to eat but nobody wants to pay?   At least they work for their meals.   How come?   You're full of shit.  You know that?  All bullshit!   I'm sorry I even talked to you.",
        "Pizza": "",
        "Guy": "",
        "ESU": "",
        "Commander": "",
        "The": "the detective fifteen feet away.  Ramey decides to back off momentarily.    clustered behind an emergency vehicle.  The Sergeant brings a civilian to meet Captain Ramey of the SWAT unit.  The newcomer wears coveralls stenciled \"AT&amp;T.\"  (Although they are very far away, we hear their voices close up as they come into sharper focus.    and suddenly we can hear them clearly in spite of the distance.    with Stu still kneeling.    crouched forward.  The pay phone receiver dangles just above his head.  The cellular remains cupped in his hand.  Stu never lifts the cell phone.  He keeps the palm of his hand over the speaker of the phone to muffle any sound from the other end.  It rings and finally someone answers.    lying face up on the floor of the booth.  Is anybody listening?    assembled on the opposite side of the street.    His arm still raised.  He hasn't brought it down with the gun in it.  Not yet.  He holds the pay phone receiver jammed up against his mouth.    He has fired.       The police have broken in on Stu's tormentor and there has been a rapid exchange of shots.  A HAND reaches into the booth and grabs the receiver.  ANGLE WIDENS as Ramey places it to his ear.    pulling away in LOW ANGLE.  CAMERA SLIDES BACK inside the ambulance with Stu.  The doors shut, obliterating our view of the phone booth that was his entire world until moments ago.",
        "Caller": "",
        "Corky": "",
        "Asia": ""
    },
    "imdb_rating": "7.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BY2NkMjRhODMtYWRjYi00M2YwLTlmNGEtYzVkOWI4YmE4ZmEwXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_QL75_UX380_CR0,6,380,562_.jpg",
    "description": "Stu Shepard is a fast talking and wise cracking New York City publicist who gets out of trouble and lies with his clever charm, connections, and charisma. Stu's greatest lie is to his wife Kelly, who he is cheating on with his girlfriend, Pam. Upon answering a call in a phone booth in belief it is Pam, Stu is on the line with a dangerous yet intelligent psychopath with a sniper rifle. When realizing it is not a joke, Stu is placed in a powerful mind game of wits and corruption. The New York City Police eventually arrive thereafter and demand Stu comes out of the phone booth- but how can he when if he hangs up or leaves the booth he will die?commanderblue",
    "name": "Phone Booth",
    "genres": [
        "Crime",
        "Thriller"
    ]
}