{
    "filename": "Pi_script.txt",
    "imdb_id": "tt0138704",
    "imdb_url": "https://www.imdb.com/title/tt0138704",
    "characters": [
        "Jenna",
        "Maximillian Cohen",
        "Jenny Robeson",
        "Mrs. Ovadia",
        "Farrouhk",
        "Sol Robeson",
        "Jenna's Mom",
        "Devi",
        "Photographer",
        "Lenny Meyer",
        "Kaballah Scholar",
        "Ephraim",
        "Rabbi Cohen",
        "Marcy Dawson",
        "Moustacheless Man (as Stanley Herman)"
    ],
    "dialogues": {
        "Jenna": "Max, Max! Can we do one?   What's three hundred and twenty-two times four hundred and ninety-one.  Jenna types it into her calculator. Max finishes locking his door.    Right.  Max heads down the staircase.   Okay, seventy-three divided by twenty-two.   Max, Max, can we do one.   Please, Max.   Can we do one, Max, can we?  Max shrugs, not able to say no.   How about two hundred and fifty-five times a hundred and eighty-three.  Jenna types m the number.  Max is about to say \"no\" to Jenna, but then be decides to give it a shot.  Max thinks, he really thinks.  Jenna presses the EQUALS button.   I got it! I got it! What's the answer?   Forty-six thousand six hundred and sixty-five.",
        "Maximillian": "",
        "Cohen": "Max, Max. You're okay I'm Rabbi Cohen. Cohen like you. I'm sorry for what Lenny did, he's been reprimanded. It is not our way Are you okay?   Everything will be fine, Max. You need to give us the number. Do you have it?   Okay, okay! Lenny, easy! Max, I'll tell you what's going on. Just calm down.  The Talmud tells us it began two thousand years ago, when the Romans destroyed the second temple.   Just give me a chance. You'll understand everything if you listen.  Max takes out his pills and starts feeding himself some.   The Romans also murdered all of our priest- hoodthe Cohanimthe Cohens, and with their deaths they destroyed our greatest secret. In the center of the great temple was the holy of holies which was the heart of Jewish life. This was the earthly residence for our God. The one God. It contained the ark of the Tabernacle which stored the original Ten Commandments that God gave to Moses. Only one man could enter this space once a year on the holiest day of the year, Yom Kippur On the Day of Atonement, all of Israel would descend upon Jerusalem to witness the High Cohen's trip into the holy of holies. If the holy man was pure he would reemerge a few moments later and Israel was secured a prosperous year. It meant that we were one yea r closer to the messianic age. Closer to the return of the Garden of Eden. But if he was impure, he would die instantly and it meant that we were doomed. The High Cohen had a single ritual to perform in the holy of holies. He had to intone a single word.  Rav Cohen takes a dramatic pause. Max is anxious to hear the end of the story.   That word was the true name of God.   The true name, which only the Cohanim knew, was two hundred and sixteen letters long.  A long beat.    Yes...it's The key into the messianic age. As the Romans burned the temple, the Talmud says, the High Cohen walked into the flames. He took his secret to the top of the burning building. The heavens opened up and took the key from the priest's outstretched hand. We've been searching for the key ever since. And you may have found it. Now let us find out.   No, no, Max. You're not pure. You can't see God unless you're pure.   You saw nothing.   There's much more. We can unlock the door with the key. It will show God that we are pure again. He will return us to The Garden.   Who do you think you are? You are a vessel from our God. You are carrying a delivery that needs to be made to us.   It's killing you. Because you are impure.   We can use it. We can wield it.",
        "Jenny": "Can I help you?   Were you a friend?   He had a second stroke.",
        "Robeson": "Can I help you?   Were you a friend?   He had a second stroke.",
        "Mrs.": "Humph.   He's alive. His eyes are moving.   Who told you you can put extra locks on the door.   You're out, you hear me, you're out. I've had enough of you. Look at all this junk.  He starts reciting the numbers. Then Max suddenly realizes something. He continues reciting the numbers from memory.   What is this stuff? What does it do?  Max finally realizes that all these strangers are in his womb. He flips.   That's it, no way. You're the one out of here, mister.",
        "Ovadia": "Humph.   He's alive. His eyes are moving.   Who told you you can put extra locks on the door.   You're out, you hear me, you're out. I've had enough of you. Look at all this junk.  He starts reciting the numbers. Then Max suddenly realizes something. He continues reciting the numbers from memory.   What is this stuff? What does it do?  Max finally realizes that all these strangers are in his womb. He flips.   That's it, no way. You're the one out of here, mister.",
        "Farrouhk": "So I gotta make this drop off in Harlem and on the way down there's these three kids hailing me.  Max slaps himself in the face a few times.   I was tight, so...  Max watches his thumb twitch. And then pain shoots through him. He grabs the right side of his head, massages it, and pushes it in with his fingers.  In the mirror, he examines the right side of his scalp. He sees nothing   So I drop them off in the Village and they dart.   I get out, grab my bat and start running. One of the kids, maybe sixteen, I catch a block later he's cursing at me, calling me a Paki bastard. So I whacked him, right in the head.   I'm kicking the bastard in the ribs banging his ass, knocking his head against the curb, harder and harder, I fucking lost it. A hot dog guy starts screaming \"You're cracking his skull, you're cracking his skull.\" So they pulled me off of him and calmed me down. Cops said he had it coming to him.  Then something starts pounding the door. The doorknob quivers, the locks unbolt. The chains are the only thing keeping out the intruder. The door shakes and the chains are strained.  MAX is paralyzed with terror.   What neighbor?   Why are you talking to that dork!   Pounds on wall. Hey, dork, leave my girlfriend alone!   I don't give a shit.   I'll kill the dork.  You hear me! I'll kill you. I'll fucking kill you!  Then an idea comes to him. He takes out his brain book. He looks through it until he finds a picture of neurons. He compares the image to the view through the turret. They look different but there are similarities.   There you go, dork. Been thinking about my girlfriend. Haven't you?   You want to fuck her, don't you?   You calling my girlfriend ugly!? Why don't you want to fuck her? You think she's ugly?   So you do want to fuck her. You think about fucking her in the mouth, don't you?   Give the fucking genius a Mars bar. Stay away, or I'll slice off your balls.  Farrouhk tosses Max against the wall. Max whimpers off to his apartment. Farrouhk has enjoyed this and to end his game be gives Max a small slap on the butt.  INSIDE HIS APARTMENT Max bolts the front door.  At his desk he rips open the envelope Lenny Meyer gave him. He pulls out a BLACK DISK and eyes it expectantly.  Next door, he hears Farrouhk and Devi talking.   Damn dork.   Unique?! Unique?! He's a dork!  Then, Max carefully slips the DISK into Euclid's drive. Hebrew characters pop onto Euclid's screen. Max pounds in several strings of code lightning fast.  The Hebrew letters suddenly switch to their numerical counterparts. Max toggles between Hebrew and numbers a few timesimpressed.  Max nods. Then there's a knock at the door.    Shhh!    Let's go.  The phone starts ringing again.   He's sick! He's sick!  Max gets to his feet and runs behind Farrouhk. Just then a station wagon screeches up to the curb. Lenny Meyer, Ephraim, and a bunch of other his burly Jews jump out.",
        "Sol": "Bright stock quotes drift across the screen.   TIGHT ON the Japanese game of Go being played. Sol is white and Max is black. Sol's moves are secure and controlled while Max is hesitant.   Stop thinking, Max, just feel. Use your intuition. It's the only way to get into the flow.  What did you think of Hamlet?   It's been a month.  You haven't taken a single break.   Have you met the new fish my niece bought me? I named her Icarus. After you. My renegade pupil. You fly too high, you'll get burned.  Max looks up at Sol.   The more I see you, the more I see myself thirty years ago. My greatest pupil. Published at 16, Ph.D. at 20.   But life isn't just mathematics. I spent forty years looking for patterns in Pi, I found nothing.   I found things, but not a pattern.     Sol and Max play Go. Sol is peaceful while Max is distant.  Max plays a piece absently. Sol counters with a deafening atari. Max whispers:   Your mainframe?   What happened?   You have a printout?   The picks, the number?   What was the number it spit out?   How many?    What was it, a hundred and fifty, a thousand, two hundred sixteen!? How many?   ... I dealt with some bugs back in my Pi days. I was wondering if it was similar to one I ran into.  Sol begins to feed his fish. He points to one.   Have you met Archimedes. The one with the black spot. You see?   Remember Archimedes of Syracuse? The King asks Archimedes to determine if a present he's received was actually solid gold. Unsolved problem at the time. It tortures the great Greek mathematician for weeks. Insomnia haunts him and he twists and turns on his bed for nights on end. Finally, his equally exhausted wife, she's forced to share a bed with this genius, convinces him to take a bath, to relax. While stepping into the tub he observes the bathwater rise as he enters. Displacement. A way to determine volume. And thus, a way to determine density, weight over volume. And thus, Archimedes solves the problem. He screams \"Eureka!\"Greek for \"I found it!\"and is so overwhelmed he runs dripping naked through the streets to the King's castle to report his discovery. Now, what's the moral of the story.   Wrong. The point of the story is the wife. Listen to your wife, she will give you perspective. Meaning, you need a break, Max, you have to take a bath, otherwise you'll get nowhere. There will be no order, only chaos. Go home and take a bath.    Max firmly rings SOL's bell.  In a few moments, Sol answers the door in his pajamas.   Max?   Relax, it's early.   Max sits at the kitchen table while Sol heats up a pot of tea. Max is shaking.   Now, what's up?   Excuse me?   Oh, you mean the bug. I found it working on Pi.   What's this all about, Max?   Religious Jews?   Really? What's it mean to them?   It's just a coincidence.   Yesterday's stock picks?    Hmmm.   Max, it's a bug.   Come with me.   Sol and Max sit on either side of a half-played Go board.   Listen to me. The Ancient Japanese considered the Go board to be a microcosm of the universe. Although when it is empty it appears to be simple and ordered, in fact, the possibilities of game play are endless. They say that no two Go games have ever been alike. Just like snowflakes. So, the Go board actually represents an extremely complex and chaotic universe. That is the truth of our world, Max. It can't be easily summed up with math. There is no simple pattern.   So?   That is insanity, Max.   Hold on, you have to slow down. You're losing it, you have to take a breath. Listen to yourself. You're connecting a computer bug I had, a computer bug you might have had, and some religious hogwash. If you want to find the number two sixteen in the world, you'll be able to pull it out of anywhere. Two hundred and sixteen steps from your street comer to your front door. Two hundred and sixteen seconds you spend riding on the elevator. When your mind becomes obsessed with anything, it will filter everything else out and find examples of that thing everywhere. Three hundred and twenty, four hundred and fifty, twenty-three. Whatever! You've chosen two sixteen and you'll find it everywhere in nature. But Max, as soon as you discard scientific rigor, you are no longer a mathematician. You become a numerologist. What you need to do is take a break from your research. You need it. You deserve it Here's a hundred dollars, I want you to take it. If ,you won't take it, borrow it. Either way, take a break. Spend it however you like as long as it falls in the category of vacation. Real world stuff, okay. No math.  Max looks at his bands.   Just try it. In a week you'll laugh about this. C'mon, Max. Think about it!  Max gives a half nod.    Max rushes to the subway when a honking horn stops him. A limo pulls up next to him. Marcy Dawson jumps out of the car         Max charges into the room. Sot is looking at his Go board. Sol looks up when Max comes in.   You're early. I was just studying our...  What did you do to yourself?   I thought you were going to take a break.   You have it?    Okay, sit down.  Max does.   I gave up before I pinpointed it. But my guess is that certain problems cause computers to get stuck in a particular loop. The loop leads to meltdown, but right before they crash they... they become \"aware\" of their own structure. The computer has a sense of its own silicon nature and it prints out its ingredients.   In some ways...I guess...   No, Max, it's only a nasty bug.   A door in front of a cliff. You're driving yourself over the edge. You need to stop.   The bug doesn't only destroy computers.   Look what it did to your computer. Look what it's doing to you.  Max doesn't respond.  It's killing you. Leave it unknown.   Max, I got burnt.   It caused my stroke.   Max, there's more than math! There's a whole world...   Max, it's death!  Max stands up and screams down at Sol.   Get out! Max, get out!   Out!    A pumped and excited Max paces the hall as he rings the bell.  The door opens. But it isn't Sol. It's a young, beautiful woman wearing a simple black dress. Her name is JENNY ROBESON and she is Sol's niece.",
        "Jenna's": "",
        "Mom": "Jenna! Jenna!   Jenna...  Jenna screams after him.   TIGHT ON the Japanese game of Go being played. Sol is white and Max is black. Sol's moves are secure and controlled while Max is hesitant.   Max waits for his train on an empty platform.  Just then, he hears a DRIPPING sound. Max looks up and notices something across the tracks on the other platform. He can't quite make it out because his vision is blocked by columns.  He gets up and spots a Young Hasidic Man standing at him.  Blood drips from the Man's hand. Max doesn't know what to make of it   Max uses his pinky to drip a drop of iodine on the slide.  Through the wall he hears Farrouhk arriving home.   Max sits at the kitchen table while Sol heats up a pot of tea. Max is shaking.   Sol and Max sit on either side of a half-played Go board.",
        "Devi": "Max, good!   Your hair.  Devi hands the bags to Max. Then she goes to pat down his Hair. Max retreats.   Your hair, you can't go out like that. Don't worry.  You need a mom.  Max hands back the bags and heads quickly for the stairs.  Your somosas!  An embarrassed Max takes the bag.   You stopped?   Oh God...  Max gags and rubs his head.   Farrouhk!  The pain seems to disappear. Max looks at his hand that was rubbing his bead.  Then he looks at the front door. The doorknob seems to move. Something begins knocking on Max's door. The knocking gets louder and louder then the locks begin to unlock.  FARROUHK's words begin to overpower Max.   Farrouhk?   Max, is everything all right?    Iodine...did you cut yourself?   Ah, science, the pursuit of knowledge. One second.  She heads to her bathroom. Max waits impatiently.   Here we are. What are you examining  a potato!?  She hands Max a bottle of iodine.   The neighbor's up to his old science...   Next door.  Max listens to the conversation for a few moments.   Shh! I just helped ...   Farrouhk!  Max shakes his bead. Then he finishes preparing the slide and slips the glass under the turret. Max catches the low-hanging sun in the microscope's mirror and reflects it through the sample and up the turret into his eye.  MAX'S POV DOWN THE TURRET of some strange Substance.  Max pulls out the slide and looks at it.    Shh! C'mon, Farrouhk.   Shh! Baby! Come here, baby!  Max rushes out.   He's just a bit unique.   Yes, hello?  FADE BACK INTO THE MAIN ROOM Max's eyes slowly open.     He's busy right now I'm sorry. Max is sprawled out in front of Euclid. A large amount of blood, from his nose, is semi-dried on his chin and chest. Devi hangs up the phone.  The landlady, Mrs. Ovadia, and Farrouhk, brandishing a crowbar, stand over him.   You were screaming...   Are you okay?   Are you okay?   Max. Max! Are you okay!? Oh my God, Max!  Her voice reaches into the void.   Max! Breathe, Max. Breathe!  Max looks toward her voice.   Yes, Max. Listen to me...  We cut back to  Breathe, Max! Breathe. Focus.  Max turns away from Devi and we return to the  No, Max. No. Stay with me Max. Stay with me.  And then we cut back to  That's right Max. That's Right. Breathe. Breathe.   Yes, breathe, Max. Breathe...  Max sobs. He holds onto her for dear life  And then be realizes that Devi is not in his arms. He is holding onto himself.  Then Max notices Sol's note on the ground. He looks at the number. He collects himself and catches his breath.",
        "Photographer": "Here, here.  The photographer hands Max his wallet.   Wha...I'm sorry...   I'm...a...student I've got an assignment for class.  The Photographer pulls out his student ID. Max looks at it. Then he rips out the film-exposing it.",
        "Lenny": "I'll put it out.  The name's Lenny Meyer  Lenny sticks out his hand. Max responds with a small nod.  And you are?   Max?   Cohen!  Jewish? Max shrugs and turns back to his work.   It's okay.  I'm a Jew, too.  Do you practice?   Have you ever heard of Kabbalah?    Jewish mysticism.   I understand...it's just that it's a very exciting time in our history. Right now is a critical moment in time.   Yes, it's very exciting. Have you ever put on Tefillin?  Max has no idea what Lenny's talking about. Lenny pulls a leather box with black leather straps from his pocket.   Tefillin. You know Tefillin. I know it looks strange. But it's an amazing tradition that has a tremendous amount of power. It's a mitzvah for all Jewish men to do. Mitzvahs, good deeds, are spiritual food for our hearts and our heads.  And then Max notices that his thumb is twitching He grabs it self-consciously.   They purify us and bring us closer to God. You want to try it?  Just then, Max pays his bill and prepares to leave.   Are you okay? Max? Max?   Well, maybe some other time.   Hey, Max, how you doing?   Lenny Meyer.  I'll put it out.  So, what do you do?   Really? What type of math?   Number theory? No way, I work in theory, too. Not traditional, though...  I work with the Torah.  Amazing.   Yeah. You know Hebrew is all numbers. It's all math.   Here, look...the ancient Jews used Hebrew as their numerical system. Each letter is a number.  Lenny pulls out a pen and grabs Max's Journal. He writes on it as he talks.   You see...The Hebrew \"A,\" the number 1. The Hebrew \"B,\" Bet, is two. You can take any Hebrew text and turn them into a long string of numbers.  The waitress refills Max's coffee.   The Torah is just a long string of numbers. Some say that it's a long code sent to us from God.  Satisfied, Lenny lights up a cigarette and takes a drag.    Yeah, like take the Hebrew word for, say, the Garden of Eden, Kadem. Kuf, Dalei Mem...Kuf is a hundred. Daled, four Mem, forty. They equal one hundred and forty-four. Then take the tree of knowledge...in the garden, Aat Ha Haim, it equals two hundred and thirty-three. Now you can take that number and...   Huh?   Theta?   You're right, I never saw that before. That's the series you find in nature. Like the face of a sunflower.   You see, there's math everywhere.  Lenny's smoke drifts by Max's eyes.  SLOW MOTION: MAX'S POV of smoke spirals spinning in front of him.   Max! How you doing? Lenny Meyer.  Hey, where you going? You got a few moments to do Tefillin?  Max turns around and notices Marcy talking to Mrs. Ovadia. Mrs. Ovadia points up the street toward him.   I gotta car, we can cruise over to my...   Yeah, right there. That's Ephraim, my friend.  We swing around with Max and see a station wagon.  EPHRAIM sits in the passenger Seat. He's a big-boned, bearded, Orthodox Jew.   Great...  They head for the station wagon.   Do it for me? It means a lot, having someone of your stature performing a mitzvah in my presence.  When you told me your name was Max Cohen, I didn't realize you were the Max Cohen. Maximilian Cohen.   0f course, I've followed your research since your Columbia days. It's revolutionary. You've inspired the work we do.   Yes, very much so. The only difference is, we're not looking at stocks. We're searching for a pattern in Torah.  Lenny finishes wrapping Max's arm. He reaches for another box and strap.   We're not really sure. Our calculations have shown us that there is a number encoded in the text.   We don't know. All we know is that it's two hundred and sixteen digits long.  Max, stunned looks at Lenny.   Don't worry. This one just goes over your head.  Lenny places the other Teffilin over Max's head. Max collects himself.   Yes. Now we have to say a small prayer, repeat after me.  Bewildered, Max does. After the prayer...   That's it. Wasn't so bad, was it? You feel anything?  Lenny starts removing the Teffillin from Max.   It's a prayer about our dedication to our one and only God.   Oh. We don't know. We just know that it's the most common number encoded in the text. It might be some type of linguistic pattern. If we could figure out what the number is we could maybe answer that.   Hello, this is Lenny?   Max! How are you? You want to come down?  That's good...   Excellent.   The Torah.   In Hebrew characters and numbers.   I don't know.  If you get it, maybe we can figure it out.  Can you really find it?   Max!  Max looks at Farrouhk and then he looks at Lenny. Ephraim grabs Max and pulls him toward the station wagon.   Yisrael yanks the steering wheel to the left, the old station wagon skids around a corner.   Stay down!  Ephraim pushes Max's head down. Yisrael takes another corner sharp.   He's okay, he got in his cab. We've been looking for you.   Do you have the number?   Do you have the number?   You have it. Where is it? You have it written down?   We're not joking around, Max? Where's the number?   You memorized it? Did you give it to them?   Who!? Those Wall Street bastards.   Just answer me!    Hit him!  Yisrael screeches the car to a halt. He spins around in his seat and looks Max in the face.   You're dealing with something really big now, Max. I don't want to hurt you, so answer me. Did you give it to them?   Damn it! Damn it! They're using it.   Shut up!   No, don't!  But Lenny is late, and Max's world - as well as ours goes black.    I told you we don't know   Give us the number!   It will kill you!   We're pure. Give us the number!",
        "Meyer": "I'll put it out.  The name's Lenny Meyer  Lenny sticks out his hand. Max responds with a small nod.  And you are?   Max?   Cohen!  Jewish? Max shrugs and turns back to his work.   It's okay.  I'm a Jew, too.  Do you practice?   Have you ever heard of Kabbalah?    Jewish mysticism.   I understand...it's just that it's a very exciting time in our history. Right now is a critical moment in time.   Yes, it's very exciting. Have you ever put on Tefillin?  Max has no idea what Lenny's talking about. Lenny pulls a leather box with black leather straps from his pocket.   Tefillin. You know Tefillin. I know it looks strange. But it's an amazing tradition that has a tremendous amount of power. It's a mitzvah for all Jewish men to do. Mitzvahs, good deeds, are spiritual food for our hearts and our heads.  And then Max notices that his thumb is twitching He grabs it self-consciously.   They purify us and bring us closer to God. You want to try it?  Just then, Max pays his bill and prepares to leave.   Are you okay? Max? Max?   Well, maybe some other time.   Hey, Max, how you doing?   Lenny Meyer.  I'll put it out.  So, what do you do?   Really? What type of math?   Number theory? No way, I work in theory, too. Not traditional, though...  I work with the Torah.  Amazing.   Yeah. You know Hebrew is all numbers. It's all math.   Here, look...the ancient Jews used Hebrew as their numerical system. Each letter is a number.  Lenny pulls out a pen and grabs Max's Journal. He writes on it as he talks.   You see...The Hebrew \"A,\" the number 1. The Hebrew \"B,\" Bet, is two. You can take any Hebrew text and turn them into a long string of numbers.  The waitress refills Max's coffee.   The Torah is just a long string of numbers. Some say that it's a long code sent to us from God.  Satisfied, Lenny lights up a cigarette and takes a drag.    Yeah, like take the Hebrew word for, say, the Garden of Eden, Kadem. Kuf, Dalei Mem...Kuf is a hundred. Daled, four Mem, forty. They equal one hundred and forty-four. Then take the tree of knowledge...in the garden, Aat Ha Haim, it equals two hundred and thirty-three. Now you can take that number and...   Huh?   Theta?   You're right, I never saw that before. That's the series you find in nature. Like the face of a sunflower.   You see, there's math everywhere.  Lenny's smoke drifts by Max's eyes.  SLOW MOTION: MAX'S POV of smoke spirals spinning in front of him.   Max! How you doing? Lenny Meyer.  Hey, where you going? You got a few moments to do Tefillin?  Max turns around and notices Marcy talking to Mrs. Ovadia. Mrs. Ovadia points up the street toward him.   I gotta car, we can cruise over to my...   Yeah, right there. That's Ephraim, my friend.  We swing around with Max and see a station wagon.  EPHRAIM sits in the passenger Seat. He's a big-boned, bearded, Orthodox Jew.   Great...  They head for the station wagon.   Do it for me? It means a lot, having someone of your stature performing a mitzvah in my presence.  When you told me your name was Max Cohen, I didn't realize you were the Max Cohen. Maximilian Cohen.   0f course, I've followed your research since your Columbia days. It's revolutionary. You've inspired the work we do.   Yes, very much so. The only difference is, we're not looking at stocks. We're searching for a pattern in Torah.  Lenny finishes wrapping Max's arm. He reaches for another box and strap.   We're not really sure. Our calculations have shown us that there is a number encoded in the text.   We don't know. All we know is that it's two hundred and sixteen digits long.  Max, stunned looks at Lenny.   Don't worry. This one just goes over your head.  Lenny places the other Teffilin over Max's head. Max collects himself.   Yes. Now we have to say a small prayer, repeat after me.  Bewildered, Max does. After the prayer...   That's it. Wasn't so bad, was it? You feel anything?  Lenny starts removing the Teffillin from Max.   It's a prayer about our dedication to our one and only God.   Oh. We don't know. We just know that it's the most common number encoded in the text. It might be some type of linguistic pattern. If we could figure out what the number is we could maybe answer that.   Hello, this is Lenny?   Max! How are you? You want to come down?  That's good...   Excellent.   The Torah.   In Hebrew characters and numbers.   I don't know.  If you get it, maybe we can figure it out.  Can you really find it?   Max!  Max looks at Farrouhk and then he looks at Lenny. Ephraim grabs Max and pulls him toward the station wagon.   Yisrael yanks the steering wheel to the left, the old station wagon skids around a corner.   Stay down!  Ephraim pushes Max's head down. Yisrael takes another corner sharp.   He's okay, he got in his cab. We've been looking for you.   Do you have the number?   Do you have the number?   You have it. Where is it? You have it written down?   We're not joking around, Max? Where's the number?   You memorized it? Did you give it to them?   Who!? Those Wall Street bastards.   Just answer me!    Hit him!  Yisrael screeches the car to a halt. He spins around in his seat and looks Max in the face.   You're dealing with something really big now, Max. I don't want to hurt you, so answer me. Did you give it to them?   Damn it! Damn it! They're using it.   Shut up!   No, don't!  But Lenny is late, and Max's world - as well as ours goes black.    I told you we don't know   Give us the number!   It will kill you!   We're pure. Give us the number!",
        "Kaballah": "",
        "Scholar": "",
        "Ephraim": "",
        "Rabbi": "",
        "Marcy": "Mr. Cohen! How are you? It's been a long time. Sorry I haven't been in touch. But I was hoping you would allow me to take you to lunch tomorrow, say one o'clock?   We're very anxious to talk with you, sir   I'm prepared to make you a generous...  Max hurries to wrap up the conversation.   Mr. Cohen, give me a moment...  But before Marcy finishes, Max hangs up. He rips off the printout and heads to the front door.  He checks the peephole, His landlady. MRS. OVADIA, is sweeping the hallway stairs humming a turn-of-the century (the last one, not this one) tune.  Max waits a moment. He tousles his hair. Then he checks again. She's gone. He opens his locks and releases several bolts.   Mr. Cohen. Marcy Dawson here again I was just looking over my schedule and I realized I'll be in your neighborhood tomorrow around three.  Max heads to the  Marcy Dawson from Lancet-Percy I'm so anxious to meet you. It will be worth itfor both of us I promise. See you at your house at three, okay?   Oh, don't worry, I got your address from Columbia. So three it is. Looking forward to it.  Max tries to stop her but, before he can Marcy hangs up. A bewildered Max slowly hangs up.   Mr. Cohen! Perfect timing.  Marcy sticks out her hand. Max, not knowing what else to do, shakes it.   I was just waiting for you. I thought you stood me up, so I was going to head home.   Oh...Marcy Dawson. From Lancet Percy. We were supposed to meet at three.   I can't tell you what a pleasure it is to finally meet you. I've studied your papers for years.   I have something you won't be able to say no to. Why don't we take a spin in the limo?   We're excited by your work. We can't wait to discuss...  Max attempts to pull away but Marcy is firm on leading him to the car. Meanwhile, the Shinny man is heading right at them.  The CHAUFFEUR reaches out to him. Max yanks his arm free and runs away. He whips around a corner.   Mr. Cohen? Mr. Cohen? Please stop for a second Mr. Cohen?  Max stops and faces Marcy.   I'm sorry. I'm very sorry. I admit I've been a bit too aggressive. But all I ask is for five minutes of your time. Here...  Marcy hands Max a metal stopwatch.   ...a stopwatch. Already ticking. Allow me the four and a half minutes left Let me tell you what I want. Let me tell you what I can offer you. Afterwards, if you don't want to talk to me, then fine, we part as friends and I promise that you will never see me again. That's fair, isn't it?   Good. It's funny, even though we have different aims and different goals we're actually incredibly alike. We both seek the same thingperfection. I know... clearly we're seeking different types of perfection, but that is what makes us perfect candidates for a fruitful partnership. If you let me, I can be your greatest ally. Take the acacia tree...in East Africa. It is the most prevalent plant in all of Kenya because it has managed to secure its niche by defeating its major predator, the giraffe. To accomplish this, the tree has made a contract with a highly specialized red ant. The tree has evolved giant spores which act as housing for the ants In return for shelter, the ants supply defense. When a giraffe starts to eat the tree's leaves, the shaking branch acts like an alarm. The ants charge out and secrete an acid onto the giraffe's tongue. The giraffe learns its lesson and never returns. Without each other, the tree would be picked dry and the ants would have no shade from the brutal African sun Both would die. But with each other, they succeed, they survive, they surpass. They have different aims, different goals but they work together. Max, we would like to establish a mutually benefiting alliance with you.   Allow me to dose.  The chauffeur pulls a black suitcase out of the limo and brings it over.   As a sign of good faith we wish to offer you this.   The suitcase isn't filled with fifties or gold or diamonds. Just silicon. A Ming Mecca chip.   You're right. They're not. But Lancet-Percy has many friends. Come here, take a look.   Beautiful, isn't it? You know how rare...are you okay?   But what about...   What? Mr. Cohen!?   Mr. Cohen? I'm so Happy...   You tech guys. I think you know what we want.   C'mon, Mr. Cohen. We can work together We can both profit from this information. We both need each other to get it, so why not work with us?   We're willing to take the risk.    Done. Anything else?   How do I know you're home?   Fair enough.   Max, is that you? Max?  Max, just talk to me. Things are a bit out of hand down here. People are getting desperate.  We had a deal, Max. A deal. Talk to us, Max.  We hear the sound of a phone hanging up.  At the coffee counter, Max pops a handful of pills and crumples the paper.   Let's take a ride, Max.   We had a deal! NOW get in the limo!  Marcy releases a vicious slap that nearly knocks Max down. Max whimpers.   Enough, Max, c'mon out.   You're responsible for this.   But we did.  Marcy pulls out a folded, worn piece of paper. She opens it. It's Max's stock pick that he threw out. Part of THE number is on the page   You have to be careful where you throw out your trash.   You gave us faulty information. You gave us the carrot, the right picks, but then you only gave us part of the code.   C'mon, Max. This isn't a game anymore. We're playing on a global scale. We used your code. Foolish...I admit. But we can fix things if we make some careful picks. Give us the rest of the code so we can set things right.   Look, Max...  Marcy nods to Jake, who pulls out a gun and points it at Max's head.   Information is the private language of Capital. We tried to establish a symbiotic relationship but if you choose to compete and enter our niche we are forced to comply with the laws of nature.  Max thinks for a second. Max thinks hard. He realizes be can't give them the number.   C'mon, Max. You don't get it. I don't give a shit about you. I only care about what's in your fucking head. If you won't help us help yourself, then I'll have only one choice. Destroy the competition. I'll take you out of the game. Survival of the fittest, Max. And we've got the gun.  Jake cocks the gun. Max starts to cry.",
        "Dawson": "Mr. Cohen! How are you? It's been a long time. Sorry I haven't been in touch. But I was hoping you would allow me to take you to lunch tomorrow, say one o'clock?   We're very anxious to talk with you, sir   I'm prepared to make you a generous...  Max hurries to wrap up the conversation.   Mr. Cohen, give me a moment...  But before Marcy finishes, Max hangs up. He rips off the printout and heads to the front door.  He checks the peephole, His landlady. MRS. OVADIA, is sweeping the hallway stairs humming a turn-of-the century (the last one, not this one) tune.  Max waits a moment. He tousles his hair. Then he checks again. She's gone. He opens his locks and releases several bolts.   Mr. Cohen. Marcy Dawson here again I was just looking over my schedule and I realized I'll be in your neighborhood tomorrow around three.  Max heads to the  Marcy Dawson from Lancet-Percy I'm so anxious to meet you. It will be worth itfor both of us I promise. See you at your house at three, okay?   Oh, don't worry, I got your address from Columbia. So three it is. Looking forward to it.  Max tries to stop her but, before he can Marcy hangs up. A bewildered Max slowly hangs up.     Mr. Cohen! Perfect timing.  Marcy sticks out her hand. Max, not knowing what else to do, shakes it.   I was just waiting for you. I thought you stood me up, so I was going to head home.   Oh...Marcy Dawson. From Lancet Percy. We were supposed to meet at three.   I can't tell you what a pleasure it is to finally meet you. I've studied your papers for years.   I have something you won't be able to say no to. Why don't we take a spin in the limo?   We're excited by your work. We can't wait to discuss...  Max attempts to pull away but Marcy is firm on leading him to the car. Meanwhile, the Shinny man is heading right at them.  The CHAUFFEUR reaches out to him. Max yanks his arm free and runs away. He whips around a corner.   Mr. Cohen? Mr. Cohen? Please stop for a second Mr. Cohen?  Max stops and faces Marcy.   I'm sorry. I'm very sorry. I admit I've been a bit too aggressive. But all I ask is for five minutes of your time. Here...  Marcy hands Max a metal stopwatch.   ...a stopwatch. Already ticking. Allow me the four and a half minutes left Let me tell you what I want. Let me tell you what I can offer you. Afterwards, if you don't want to talk to me, then fine, we part as friends and I promise that you will never see me again. That's fair, isn't it?   Good. It's funny, even though we have different aims and different goals we're actually incredibly alike. We both seek the same thingperfection. I know... clearly we're seeking different types of perfection, but that is what makes us perfect candidates for a fruitful partnership. If you let me, I can be your greatest ally. Take the acacia tree...in East Africa. It is the most prevalent plant in all of Kenya because it has managed to secure its niche by defeating its major predator, the giraffe. To accomplish this, the tree has made a contract with a highly specialized red ant. The tree has evolved giant spores which act as housing for the ants In return for shelter, the ants supply defense. When a giraffe starts to eat the tree's leaves, the shaking branch acts like an alarm. The ants charge out and secrete an acid onto the giraffe's tongue. The giraffe learns its lesson and never returns. Without each other, the tree would be picked dry and the ants would have no shade from the brutal African sun Both would die. But with each other, they succeed, they survive, they surpass. They have different aims, different goals but they work together. Max, we would like to establish a mutually benefiting alliance with you.   Allow me to dose.  The chauffeur pulls a black suitcase out of the limo and brings it over.   As a sign of good faith we wish to offer you this.   The suitcase isn't filled with fifties or gold or diamonds. Just silicon. A Ming Mecca chip.   You're right. They're not. But Lancet-Percy has many friends. Come here, take a look.   Beautiful, isn't it? You know how rare...are you okay?   But what about...   What? Mr. Cohen!?   Mr. Cohen? I'm so Happy...   You tech guys. I think you know what we want.   C'mon, Mr. Cohen. We can work together We can both profit from this information. We both need each other to get it, so why not work with us?   We're willing to take the risk.    Done. Anything else?   How do I know you're home?   Fair enough.   Max, is that you? Max?  Max, just talk to me. Things are a bit out of hand down here. People are getting desperate.  We had a deal, Max. A deal. Talk to us, Max.  We hear the sound of a phone hanging up.  At the coffee counter, Max pops a handful of pills and crumples the paper.   Let's take a ride, Max.   We had a deal! NOW get in the limo!  Marcy releases a vicious slap that nearly knocks Max down. Max whimpers.   Enough, Max, c'mon out.   You're responsible for this.   But we did.  Marcy pulls out a folded, worn piece of paper. She opens it. It's Max's stock pick that he threw out. Part of THE number is on the page   You have to be careful where you throw out your trash.   You gave us faulty information. You gave us the carrot, the right picks, but then you only gave us part of the code.   C'mon, Max. This isn't a game anymore. We're playing on a global scale. We used your code. Foolish...I admit. But we can fix things if we make some careful picks. Give us the rest of the code so we can set things right.   Look, Max...  Marcy nods to Jake, who pulls out a gun and points it at Max's head.   Information is the private language of Capital. We tried to establish a symbiotic relationship but if you choose to compete and enter our niche we are forced to comply with the laws of nature.  Max thinks for a second. Max thinks hard. He realizes be can't give them the number.   C'mon, Max. You don't get it. I don't give a shit about you. I only care about what's in your fucking head. If you won't help us help yourself, then I'll have only one choice. Destroy the competition. I'll take you out of the game. Survival of the fittest, Max. And we've got the gun.  Jake cocks the gun. Max starts to cry."
    },
    "imdb_rating": "7.3",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTk3MThhNGEtY2E4NS00MWMwLTg4MzQtMTk4ZTcwYzRlNDNiXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "In NYC's Chinatown, recluse math genius Max (Sean Gullette) believes \"everything can be understood in terms of numbers,\" and he looks for a pattern in the system as he suffers headaches, plays Go with former teacher Sol Robeson (Mark Margolis), and fools around with an advanced computer system he's built in his apartment. Both a Wall Street company and a Hasidic sect take an interest in his work, but he's distracted by blackout attacks, hallucinations, and paranoid delusions..",
    "name": "Pi",
    "genres": [
        "Drama",
        "Horror",
        "Mystery"
    ]
}