{
    "filename": "Pirates-of-the-Caribbean-Dead-Man's-Chest_script.txt",
    "imdb_id": "tt0383574",
    "imdb_url": "https://www.imdb.com/title/tt0383574",
    "characters": [
        "Mercer",
        "Governor Weatherby Swann",
        "Elizabeth Swann",
        "Ragetti",
        "Bootstrap Bill",
        "Davy Jones",
        "Cutler Beckett",
        "Norrington",
        "Gibbs (as Kevin R. McNally)",
        "Tia Dalma",
        "Marty",
        "Jack Sparrow",
        "Cotton",
        "Pintel",
        "Will Turner"
    ],
    "dialogues": {
        "Mercer": "Evening, Governor.  Shame, huh? He was carryin' this. It's a letter to the King. It's from *you*.  Where is she?  Most recently seen on the island of Tortuga, then left, in the company of a known pirate, Jack Sparrow. *And* other fugitives from justice.  The last of our ships has returned.   None. But... one of the ships did pick up a man adrift at sea. He had these.",
        "Elizabeth": "Will...!  Why is this happening?  I think it's bad luck for the groom to see the bride before the wedding.   On what charges?  *What are the charges?*  We are under the jurisdiction of the King's governor of Port Royal, and you will tell us what we are charged with.   *Captain* Jack Sparrow.  Jack's Compass. What does Beckett want with that?  I have faith in you. Both of you. Where will you find him?  Properly?  If it weren't for these bars I'd have you already.  I'll wait for you.  Why don't you tell me what's happening?  No! Will has gone to find Jack!  He's a better man than you give him credit for.  A fair trial for Will ends in a hanging.   Then what is?  I expect then that we can come to some sort of understanding. I'm here to negotiate.   These Letters of Marque, they are signed by the King?  Or else I would not still be here. You sent Will to get you the Compass owned by Jack Sparrow. It will do you no good.   I have been to Isla de Muerta, I have seen the treasure myself. There is something you need to know.  Consider into your calculations that you robbed me of my wedding night.   These aren't going to Jack.  What's that over there?  I just wanted the pleasure of doing that myself!  James Norrington.  What has the world done to you?  Captain Sparrow!  I'm here to find the man I love.  Meaning William Turner, Captain Sparrow.   Jack. I know Will came to find you. Where is he?  Davy Jones?  Jack. All I want is to find Will.  'Course.  And you have a way of doing that?  How do we find it?  Where does it point?  Oh Jack! Are you telling the truth?   To save Will?  Yes, they're signed, Lord Cutler Beckett of the East India Trading Company.   Yes, he did say something about a chest.   Persuasion.  Decidedly not.  Jack, the Letters, give them back.   You do know Will taught me how handle a sword.  I don't know what you mean.  Oh, don't be absurd. I trust him, that's all.  I just thought I'd be married by now. I'm so ready to be married.  No, thank you.  Oh. Except for a sense of honor, and decency and-and a moral center. And personal hygiene.  You seem very certain.  Why doesn't your Compass work?  Because you and I *are* alike, and there will come a moment when you have a chance to show it. To do the right thing.   You'll have the chance to do something... something courageous. And when you do, you'll discover something: that you're a good man.  I have faith in you. Want to know why?   Curiosity. You're going to want it. A chance to be admired. And gain the rewards that follow. You won't be able to resist. You're going to want to know... what it tastes like.  But - seeing as you're a good man I know you will *never* put me in a position that would compromise my honor.  I'm proud of you, Jack.  This doesn't work. And it *certainly* doesn't show you what you want most.   Beg your pardon?  It's real!  Will! You're alright! Thank God! I came to find you!  What?  Everything you said to me... every  Stop it!  Jack!  *No*!  This is bar-*baric*! This is *no* way for grown men to settle - ! Oh! Fine! Let's just - *pull* out our swords and start *banging* away at each other! *This will solve everything!* I've had it! I've had enough! Wobbly-legged, rum-soaked... *pirates*!  Will! *Enough!*  Oh! Oh...! The heat!  Sword!  We're not getting out of this.  You're mad.  Norrington took it to draw them off.   *Hard to starboard!*  She's falling behind!  What is it?  Will?  Will?  *Will?*  There's no boats.  As soon as you're clear.  Step to!  Oh you coward!  He's right, we have to head for land.   Thank you, Jack.  You came back. I always knew you were a good man.  It's after you, not the ship. It's not us. This is the only way, don't you see? I'm not sorry.  He elected to stay behind to give us a chance.  Go!  He was a good man.  Yes.",
        "Swann": "Will...!  Why is this happening?  I think it's bad luck for the groom to see the bride before the wedding.   On what charges?  *What are the charges?*  We are under the jurisdiction of the King's governor of Port Royal, and you will tell us what we are charged with.   *Captain* Jack Sparrow.  Jack's Compass. What does Beckett want with that?  I have faith in you. Both of you. Where will you find him?  Properly?  If it weren't for these bars I'd have you already.  I'll wait for you.  Why don't you tell me what's happening?  No! Will has gone to find Jack!  He's a better man than you give him credit for.  A fair trial for Will ends in a hanging.   Then what is?  I expect then that we can come to some sort of understanding. I'm here to negotiate.   These Letters of Marque, they are signed by the King?  Or else I would not still be here. You sent Will to get you the Compass owned by Jack Sparrow. It will do you no good.   I have been to Isla de Muerta, I have seen the treasure myself. There is something you need to know.  Consider into your calculations that you robbed me of my wedding night.   These aren't going to Jack.  What's that over there?  I just wanted the pleasure of doing that myself!  James Norrington.  What has the world done to you?  Captain Sparrow!  I'm here to find the man I love.  Meaning William Turner, Captain Sparrow.   Jack. I know Will came to find you. Where is he?  Davy Jones?  Jack. All I want is to find Will.  'Course.  And you have a way of doing that?  How do we find it?  Where does it point?  Oh Jack! Are you telling the truth?   To save Will?  Yes, they're signed, Lord Cutler Beckett of the East India Trading Company.   Yes, he did say something about a chest.   Persuasion.  Decidedly not.  Jack, the Letters, give them back.   You do know Will taught me how handle a sword.  I don't know what you mean.  Oh, don't be absurd. I trust him, that's all.  I just thought I'd be married by now. I'm so ready to be married.  No, thank you.  Oh. Except for a sense of honor, and decency and-and a moral center. And personal hygiene.  You seem very certain.  Why doesn't your Compass work?  Because you and I *are* alike, and there will come a moment when you have a chance to show it. To do the right thing.   You'll have the chance to do something... something courageous. And when you do, you'll discover something: that you're a good man.  I have faith in you. Want to know why?   Curiosity. You're going to want it. A chance to be admired. And gain the rewards that follow. You won't be able to resist. You're going to want to know... what it tastes like.  But - seeing as you're a good man I know you will *never* put me in a position that would compromise my honor.  I'm proud of you, Jack.  This doesn't work. And it *certainly* doesn't show you what you want most.   Beg your pardon?  It's real!  Will! You're alright! Thank God! I came to find you!  What?  Everything you said to me... every  Stop it!  Jack!  *No*!  This is bar-*baric*! This is *no* way for grown men to settle - ! Oh! Fine! Let's just - *pull* out our swords and start *banging* away at each other! *This will solve everything!* I've had it! I've had enough! Wobbly-legged, rum-soaked... *pirates*!  Will! *Enough!*  Oh! Oh...! The heat!  Sword!  We're not getting out of this.  You're mad.  Norrington took it to draw them off.   *Hard to starboard!*  She's falling behind!  What is it?  Will?  Will?  *Will?*  There's no boats.  As soon as you're clear.  Step to!  Oh you coward!  He's right, we have to head for land.   Thank you, Jack.  You came back. I always knew you were a good man.  It's after you, not the ship. It's not us. This is the only way, don't you see? I'm not sorry.  He elected to stay behind to give us a chance.  Go!  He was a good man.  Yes.",
        "Ragetti": "Well I say it was divine providence what escaped us from jail.  ?: Well how'dya know it ?weren't/?wasn't divine providence what inspired you to *be* clever? Anyways, I ain't stealin' no ship.  Since we're not immortal no more. We gotta take care of our immortal souls.   It's the Bible. You get credit for trying.   What's got into *'im*?  Stupid mongrel!  Tide's comin', that should help. Well, salvagin' is saving, in a manner of speaking.  Suppose we be'er... save it as soon as we can. What with our souls in such a vulnerable state, and all.  ?Thief/?Thing! Little hairy ?thief/?thing! Give it back!  Don't bite it!  He's got me eye! He won't give it back!   Nothing... bad, I hope.  Dichotomy of good and evil.  Literally, or figuratively?  Your chariot awaits you, sire! Ha, ha-ha-ha, ha-ha!  Bon voyage! Ha-ha-ha!  Unh-unh... unh-unh... unh-unh...  You're pulling too slow. We don't want the Kraken to catch us.  What, with a long A?  No-no-no-no-no-no-no. Krock-en's how it's pronounced in the original Scandinavian, and Krack-en's closer to that.  It's a mythological creature, I can calls it what I wants.  I ?can/?may join the circus!  Well, each wants the chest for hisself, don't 'e? Mister Norrington, I think he's tryna regain a bit of honor. Old Jack's lookin' to trade it, save his own skin. And Turner there - I figure 'e's tryna... settle some unresolved business 'twixt him and his twice-cursed pirate father.  Oh! Tsk-tsk-tsk. Terrible temptation.   Sword!  You're not pulling hard enough!  That's a lot o' wa'er.  Never another like Captain Jack.  Aye.",
        "Bootstrap": "",
        "Bill": "",
        "Davy": "Do you fear death?  Do you fear that dark abyss? All your deeds laid bare. All your sins punished.  I can offer you... an escape-uh.  Do you not fear death?  To the depths.  Life is cruel.  Why should the afterlife be any *different*? I offer you a choice. Join my crew, and postpone the judgment. One hundred years before the mast. Will ye serve?  ?Grand.  *You* are neither dead nor dying. What  What is your purpose here?  Huh! Did he, now? I'm sorely tempted to accept that offer.  You have a debt to pay. You've been captain of the Black Pearl for thirteen years. *That* was our agreement.  Then you were a poor captain, but a *captain* nonetheless! Have you not introduced yourself all these years as *Captain* Jack Sparrow?  One soul is not equal to another.  Price? Pttt!  One hundred souls, three days-uh.  I keep the boy. A good-faith payment. That leaves you only ninety-nine more to go. Ha ha! Ha ha! Ha ha!  I keep the boy. Ninety-nine souls-uh. But I wonder, Sparrow, can you live with this? Can you condemn an innocent man - a friend-uh - to a lifetime of servitude, in your name while you roam free?  Three days.  Three days.  Will you now? And what would prompt such an act of charity?  Ha ha ha ha! Ha ha! What fortuitous circumstance be this! Five lashes be owed. I believe it is.  The cat's out of the bag, Mister Turner. Your issue will feel its sting be it the Bo'sun's hand, by your own.   Bo'sun!  I accept ?that-uh.  The stakes?  Against?  How do you know of the key?  What's this?  Four fours.  Seven fives-uh.  Huh huh huh. Welcome to the crew, liar.   And be called a liar myself for my trouble? Bootstrap Bill, you're a liar and you will spend an eternity on this ship! Master Turner, feel free to go ashore...   You will watch this.  Let no joyful voice be heard! Let no man look up at the sky with hope! And let this day be cursed by we who ready to wake... the *Kraken*!  *I* am the sea.  You need time alone with your thoughts.  There are no survivors.  The chest is no longer safe. Chart a course to Isla Cruces. Get me there first, or there'll be the devil to pay.   Who sent that thieving charlatan onto my ship? Who told them of the key? Jack Sparrow.  They're here. And I cannot step foot on land again for near of a decade.   I'll trust you know what awaits should you *fail*! Down, then!  Enough!  Send his beloved Pearl back to the depths!   Let them taste the triple guns.  They're out of range! ?Break ?out ?run ###  Jack Sparrow. Our debt is settled.   Open the chest. Open the chest, I need to see it!  Damn you, Jack Spar-*row*!",
        "Jones": "Do you fear death?  Do you fear that dark abyss? All your deeds laid bare. All your sins punished.  I can offer you... an escape-uh.  Do you not fear death?  To the depths.  Life is cruel.  Why should the afterlife be any *different*? I offer you a choice. Join my crew, and postpone the judgment. One hundred years before the mast. Will ye serve?  ?Grand.  *You* are neither dead nor dying. What  What is your purpose here?  Huh! Did he, now? I'm sorely tempted to accept that offer.  You have a debt to pay. You've been captain of the Black Pearl for thirteen years. *That* was our agreement.  Then you were a poor captain, but a *captain* nonetheless! Have you not introduced yourself all these years as *Captain* Jack Sparrow?  One soul is not equal to another.  Price? Pttt!  One hundred souls, three days-uh.  I keep the boy. A good-faith payment. That leaves you only ninety-nine more to go. Ha ha! Ha ha! Ha ha!  I keep the boy. Ninety-nine souls-uh. But I wonder, Sparrow, can you live with this? Can you condemn an innocent man - a friend-uh - to a lifetime of servitude, in your name while you roam free?  Three days.  Three days.  Will you now? And what would prompt such an act of charity?  Ha ha ha ha! Ha ha! What fortuitous circumstance be this! Five lashes be owed. I believe it is.  The cat's out of the bag, Mister Turner. Your issue will feel its sting be it the Bo'sun's hand, by your own.   Bo'sun!  I accept ?that-uh.  The stakes?  Against?  How do you know of the key?  What's this?  Four fours.  Seven fives-uh.  Huh huh huh. Welcome to the crew, liar.   And be called a liar myself for my trouble? Bootstrap Bill, you're a liar and you will spend an eternity on this ship! Master Turner, feel free to go ashore...   You will watch this.  Let no joyful voice be heard! Let no man look up at the sky with hope! And let this day be cursed by we who ready to wake... the *Kraken*!  *I* am the sea.  You need time alone with your thoughts.  There are no survivors.  The chest is no longer safe. Chart a course to Isla Cruces. Get me there first, or there'll be the devil to pay.   Who sent that thieving charlatan onto my ship? Who told them of the key? Jack Sparrow.  They're here. And I cannot step foot on land again for near of a decade.   I'll trust you know what awaits should you *fail*! Down, then!  Enough!  Send his beloved Pearl back to the depths!   Let them taste the triple guns.  They're out of range! ?Break ?out ?run ###  Jack Sparrow. Our debt is settled.   Open the chest. Open the chest, I need to see it!  Damn you, Jack Spar-*row*!",
        "Cutler": "Governor Weatherby Swann, it's been too long.  His Lord now... actually.  In fact, I *do*. Mister Mercer! The warrant for the arrest of one William Turner.  Oh, is it? That's annoying. My mistake. Arrest her.  Ah-ha! Here's the one for William Turner. And I have another one for a Mister James Norrington. Is he present?  I don't believe that's the answer to the question I asked.  For which the punishment, regrettably, is *also* death. Perhaps you remember a certain pirate named Jack Sparrow.   Captain Jack Sparrow. Yes, I thought you might.  Those won't be necessary.  The East India Trading Company has need of your services.  We wish for you to act as our agent in a business transaction with our mutual friend: Captain Sparrow.   We've had dealings in the past.  And we've each left our mark... on the other.   By your efforts Jack Sparrow was set free. I would like you to go to him, and recover a certain property in his possession.  *Bargain*!  Letters of Marque. You will offer what amounts to a full pardon. Jack will be free, a privateer in the employ of England.  Freedom.  Jack Sparrow is a dying breed. The world is shrinking, the blank pages  The Black Pearl?  A ship? Hardly. The item in question's considerably smaller and far more valuable. Something Sparrow keeps on his person at all times. A compass.  Ah, you know it. Bring back that Compass, or there's no deal.  No doubt you've discovered that loyalty  I'm afraid that *currency* is the currency of the realm.  I'm listening.  I'm listening *intently*.  Yes, and they're not valid until they bear my signature and my seal.  Do explain.  Ah, I see. *You* think the Compass leads only to the Isla de Muerta, and so you hope to *save* me from an evil fate. But you mustn't worry. I care not for cursed Aztec gold. My desires are not so provincial. There's more than one chest of value in these waters. So perhaps you may wish to enhance your offer.  So I did. A marriage interrupted.  Or fate intervenes. You make great efforts to ensure Jack Sparrow's freedom.   Oh really. To ensure Mister Turner's freedom, then? I'll still want that Compass. Consider that in your calculations.   There's something to knowing the exact shape of the world and one's place in it, don't you agree?  I had you brought here because I thought you'd be interested in the whereabouts of your daughter.  Including the previous owner of this sword...  I believe. Our ships are in pursuit. and justice will be dispensed by cannonade and cutlass,  and all manner of remorseless pieces of metal. I personally find it distasteful to even contemplate the horror facing all those on board.   Your authority as governor, your influence in London, and your loyalty to the East India Trading Company.  Shall I remove these shackles?  So you see, Mercer, every man has a price he will willingly accept. Even for what he hopes never to sell.  Is there any news on the chest?  If you intend to claim these, then you must have something to trade. D'you have the Compass?",
        "Beckett": "Governor Weatherby Swann, it's been too long.  His Lord now... actually.  In fact, I *do*. Mister Mercer! The warrant for the arrest of one William Turner.  Oh, is it? That's annoying. My mistake. Arrest her.  Ah-ha! Here's the one for William Turner. And I have another one for a Mister James Norrington. Is he present?  I don't believe that's the answer to the question I asked.  For which the punishment, regrettably, is *also* death. Perhaps you remember a certain pirate named Jack Sparrow.   Captain Jack Sparrow. Yes, I thought you might.  Those won't be necessary.  The East India Trading Company has need of your services.  We wish for you to act as our agent in a business transaction with our mutual friend: Captain Sparrow.   We've had dealings in the past.  And we've each left our mark... on the other.   By your efforts Jack Sparrow was set free. I would like you to go to him, and recover a certain property in his possession.  *Bargain*!  Letters of Marque. You will offer what amounts to a full pardon. Jack will be free, a privateer in the employ of England.  Freedom.  Jack Sparrow is a dying breed. The world is shrinking, the blank pages  The Black Pearl?  A ship? Hardly. The item in question's considerably smaller and far more valuable. Something Sparrow keeps on his person at all times. A compass.  Ah, you know it. Bring back that Compass, or there's no deal.  No doubt you've discovered that loyalty  I'm afraid that *currency* is the currency of the realm.  I'm listening.  I'm listening *intently*.  Yes, and they're not valid until they bear my signature and my seal.  Do explain.  Ah, I see. *You* think the Compass leads only to the Isla de Muerta, and so you hope to *save* me from an evil fate. But you mustn't worry. I care not for cursed Aztec gold. My desires are not so provincial. There's more than one chest of value in these waters. So perhaps you may wish to enhance your offer.  So I did. A marriage interrupted.  Or fate intervenes. You make great efforts to ensure Jack Sparrow's freedom.   Oh really. To ensure Mister Turner's freedom, then? I'll still want that Compass. Consider that in your calculations.   There's something to knowing the exact shape of the world and one's place in it, don't you agree?  I had you brought here because I thought you'd be interested in the whereabouts of your daughter.  Including the previous owner of this sword...  I believe. Our ships are in pursuit. and justice will be dispensed by cannonade and cutlass,  and all manner of remorseless pieces of metal. I personally find it distasteful to even contemplate the horror facing all those on board.   Your authority as governor, your influence in London, and your loyalty to the East India Trading Company.  Shall I remove these shackles?  So you see, Mercer, every man has a price he will willingly accept. Even for what he hopes never to sell.  Is there any news on the chest?  If you intend to claim these, then you must have something to trade. D'you have the Compass?",
        "Norrington": "My story... it's exactly the same as your story, just one chapter behind. I chased a man across the Seven Seas. The pursuit cost me my crew, my commission, and my life.  No, not anymore, weren't you *listening*? I nearly had you all, off Tripoli. I would have, if not for the... hurricane.   So do I make your crew, or not? You haven't said where you're going. Somewhere *nice*!  So am I *worthy* to serve under Captain Jack Sparrow?  Or should I just kill you now?  Sorry. Old habits and all that.  Come on, men! Who wants some? Form an orderly line, I'll have you all one by one. Come on, who's first?  Oh, please. The captain of the Flying Dutchman.  You *hired* me. I can't help it if your standards are lax.  Oh, dear.  You don't actually believe him, do you?   \"Unique\" here having the meaning of broken.  It's a curious thing. There was a time when I would've given anything for you to look like that while thinking about me.  Oh, I think you do.  So you never wondered how your *latest*  You actually *were* telling the truth.   I can't let you do that, either. So sorry.  Lord Beckett desires the contents of that chest. I deliver it, and get my life back.  Oh, I prefer to see it as the promise of redemption.  By your leave, Mister Turner.  Do excuse me while I kill the man who  Enough!  Unfortunately, Mister Turner... He's *right*!  Not with the chest. Into the boat.   Don't wait for me.  Here you go!  I took the liberty of filling in my name.  Better.  The heart of Davy Jones.",
        "Tia": "Jack Sparrow!  I always know de wind was goin' blow you back to me one day.  You. You have a touch of... destiny about *you*, William Turner.  You want to know *me*.  Not so well as I had hoped. Come.  What... service... may I do you? Hmmm?  The payment is fair.  The Compass you bartered from me. It cannot lead you to dis?  Ayeee... Jack Sparrow does not know what he wants! Or... do know, but are loathe to claim it as your own. Your key go to a chest, and it is what lay inside the chest you seek, don't it?   You know of... Davy Jones, yes? A man of de sea. A great sailor, until he ran afoul of dat which vex all men.   What, indeed.  A wo-*man*. He fell in love.  Same story, different versions, and all are true. See, it was a *woman*, as changing, and harsh, and untamable as the sea. Him never stopped loving her. But the pain it cause 'im was too much to live wid. But not enough to cause him to die.  Him heart.  It was not wort' feeling what... small fleeting joy life brings, and so... he carved out him heart, lock it away in a chest, and hide de chest from de world. De keys, he keep wid him at all times.  Let me see your hand.  I am justMy little ###, where  Davy Jones cannot make port. Cannot step on land but once every ten years. Land is where you are safe, Jack Sparrow. And so you will carry land wid you...   Yes?  If you don' want it, give it back.   Den it helps.  A touch... of destiny!  Against de cold... and de sorrow.  It's a shame. I know you're t'inking that wid the Pearl, you coulda captured the devil and set free your fadder's soul.  Would you do it? Hmmm?  What... would you? Hmmm? What would *any* of you be willing to do? Hmmm? Would you sail to the ends of the eart', and beyond, to fetch back ?witty Jack and 'im precious Pearl?  Alright. But if you're goin' brave de weird, and haunted shores, at world's end, den... you will need a captain who knows dose waters.",
        "Dalma": "Jack Sparrow!  I always know de wind was goin' blow you back to me one day.  You. You have a touch of... destiny about *you*, William Turner.  You want to know *me*.  Not so well as I had hoped. Come.  What... service... may I do you? Hmmm?  The payment is fair.  The Compass you bartered from me. It cannot lead you to dis?  Ayeee... Jack Sparrow does not know what he wants! Or... do know, but are loathe to claim it as your own. Your key go to a chest, and it is what lay inside the chest you seek, don't it?   You know of... Davy Jones, yes? A man of de sea. A great sailor, until he ran afoul of dat which vex all men.   What, indeed.  A wo-*man*. He fell in love.  Same story, different versions, and all are true. See, it was a *woman*, as changing, and harsh, and untamable as the sea. Him never stopped loving her. But the pain it cause 'im was too much to live wid. But not enough to cause him to die.  Him heart.  It was not wort' feeling what... small fleeting joy life brings, and so... he carved out him heart, lock it away in a chest, and hide de chest from de world. De keys, he keep wid him at all times.  Let me see your hand.  I am justMy little ###, where  Davy Jones cannot make port. Cannot step on land but once every ten years. Land is where you are safe, Jack Sparrow. And so you will carry land wid you...   Yes?  If you don' want it, give it back.   Den it helps.  A touch... of destiny!  Against de cold... and de sorrow.  It's a shame. I know you're t'inking that wid the Pearl, you coulda captured the devil and set free your fadder's soul.  Would you do it? Hmmm?  What... would you? Hmmm? What would *any* of you be willing to do? Hmmm? Would you sail to the ends of the eart', and beyond, to fetch back ?witty Jack and 'im precious Pearl?  Alright. But if you're goin' brave de weird, and haunted shores, at world's end, den... you will need a captain who knows dose waters.",
        "Marty": "And the hurricane!  It's a key!  So... Do we have a heading?  Have you noticed lately... The captain seems to be actin' a bit strange... -er.  Mind the boat.  They're giving up! Yay!  Not good.  Did we kill it?",
        "Jack": "Sorry, mate.  Mind if we make a little side trip?  Complications arose, ensued, were overcome.   Mm-hmm!  Shiny?  Is that how you're all feeling, then? Perhaps dear old Jack is not serving your best interests as captain?  What did the bird say?  Ohhh!  It does me.  No! Much more better. It is a *drawing* of a key.  Gentlemen, what do keys do?  No! If we don't have the key, we can't open whatever it is we don't have that it unlocks. So what purpose would be served in finding whatever need be unlocked, which we don't have, without first having found the key what unlocks it?  You're not making any sense at all. Any more questions?  Hah! A heading. Set sail in a... mmm...   Come on, snap to and make sail, you know how this works. Come on, ?oy/?quick, ?oy/?quick, hey!  Why is the rum always gone?  Oh! *That's* why.  As you were, gents.  Ah!  Bootstrap. Bill Turner.  Is this a dream?  I thought not. If it were, there'd be rum.  I had some help retrieving the Pearl, by the way.  Your son.  And to what do I owe the pleasure of your carbuncle?  Who?  Ah. So it's you, then.  He shanghaied you into service, eh?  It's funny what a man will do to forestall his final judgment -  Technic -  Yes, but the Flying Dutchman already *has* a captain, so there's re -  Any idea when Jones might release said terrible beastie?  On deck all hands! Make fast the bunt gasket! On deck! Scurry! ?Scurry-on/?Marty, I want movement!  *I want movement!*  All on deck! Run! And keep running! Run as if the devil himself and itself is upon us!  Ah! Ooh! Run! Land.  Oh! Euh!  Didn't say port. I said land. Any land.   Agh!  No no! Leave it! Run!  Shhh!  Nothing.  ?: Wa-say kohn. Een dah-lah. Eeseepi.  Kay-lay lam. Lam piki-piki. Lam eensy weensy. Lam say-say... eunuchy. Snip-snip.  Say-say lam shoop-shoop sha smalay-lama shoo-koo. Savvy? Ball licky-licky.   Save me!  Thank you.  ?No/?Oup! No no! ?Oy!/?Wait! No no! More wood! Big fire! *Big* fire! I am chief! Want big fire! Come on!  ?Oy!/?Boy! Maboogie snickel-snickel. Tout de suite! Come on! More wood!   Oh bugger.  Little seasoning. Eh?  Well done.  Well, go on! Go get them! Hay ala!   No! No no! Oy! No no!  Not good.  Bugger.  Hey!  Good doggie! ?Doggie.  *Alas*, my children! This is the day you shall always remember as the day that you almost -  ...Captain Jack... Sparrow.  Yes to the first, yes to the second, but only insofar as we keep to the shallows as much as possible.  I have every faith in your reconciliatory navigational skills, Master Gibbs, now where is that monkey? I want to shoot *something*.  Ah.  Have you considered keeping a more watchful eye on 'er? Maybe just lock her up somewhere.   There comes a time when one must take responsibility for one's mistakes.   Mister Gibbs!  We have a need to travel upriver.  No, a... resolute and unyielding need.   William... I shall trade you the Compass, if you will help me... to find *this*.   No. *You* want you to find this. Because the finding this finds you incapacitorially finding and/or locating and your discovering the detecting of a way to save your ?dolly/?dotty belle ol'... what's-her-face. Savvy?  How much do you know about Davy Jones?   Yeah, it's gonna save Elizabeth.  No worries, mates. Tia Dalma and I go way back. Thick as thieves. Nigh inseparable we are. Were. Have been. Before.   It's me front I'm worried about. Mind the boat.  Tia Dalma!  There'll be no knowing here. We've come for help and we're not leaving without it.  I thought *I* knew you.  Come.  I brought payment.  Look!  An undead monkey! Top that!  We're looking for this.  And what it goes to.  Maybe. Why?  A *woman*.  I did not. I didn't know where the key was. But now we do. So all that's left is to climb aboard the Flying Dutchman, grab the key, you go back to Port Royal and save your bonnie lass, hey!  My eyesight's as good as ever, just so you know.  Dirt. This is a jar of dirt.  Is the... jar of dirt going to help?   No.  Neither do you. Do *not* underestimate her.  So what's your plan, then?  And if there are crewmen?  I like it. Simple, easy to remember.   Hey! If you *do* happen to get captured, just say Jack Sparrow sent you to settle his debt! Might save your life!  Douse the lamps.  Oh.  Technically, I was only captain for two years, then I was viciously mutinied upon.  You have my payment. One soul to serve on your ship is already over there.   Aha! So we've established my proposal is sound in principle, now we're just haggling over price.  Just how many souls do you think my soul is worth?  You're a diamond, mate. Send me back the boy, I'll get started right off.   Have you not met Will Turner? He's noble, heroic, *terrific* soprano. Worth at least four... maybe three and a half. And did I happen to mention... he's in love. With a girl. Due to be married. Betrothed.  Dividing him from her and her from him... would only be half as cruel as actually allowing them be joined in holy matrimony. Aye?  Yep! I'm good with it. Should we seal  Uh!  Oh, Mr. Gibbs.  Uh, I feel sullied and unusual.  Fortunately, he was mum as the condition in which these souls need be.  Tortuga.  I know what I want.  How we going?  You're hired.  Time to go?  Thanks, mate.  Carry on.  Come to join me crew, lad? Welcome aboard.   I'm deeply flattered, son, but my first and only love is the sea.  Elizabeth.  Hide the rum.  You know, these clothes do not flatter you at all. It should be a dress or nothing. I happen to have no dress in my cabin.  Darling, I am truly unhappy to have to tell you this but... through an unfortunate and *entirely* unforeseeable series of circumstances that have nothing whatsoever to do with me, poor William has been press-ganged into Davy Jones' crew.   You look bloody awful. What are you  You *smell* funny.  Are you certain? Is that what you really want most?  Because I would think, you'd want to find a way to *save* Will the most.   Well, there is a chest...  A chest of unknown size and origin.   And whoever possesses that chest possesses the leverage to command Jones to do whatever it is he or she wants, including... saving brave William from his grim fate.   With this. My Compass... is unique.   True enough. This Compass does not point north.  It points to the thing you want most in this world.  Every word, love. And what you want most in this world is to find the chest of Davy Jones, is it not?  By finding the chest of Davy Jones.   Mister Gibbs!  We have our heading.  Miss Swann.  Agh.  Agh.  Of course. He wants the chest.  A truly discomforting notion, love.   Might I inquire how as to how you came by these?  Friendly?  Will strikes a deal for these and upholds it with honor. Yet you're the one standing here with the prize. Full pardon, commission as a privateer on behalf of England and the East India Trading Company. As if I could be bought for such a low price.  No. Persuade me.  As I said... Persuade me.  My tremendous intuitive sense of the female creature informs me that you are troubled.  You know...  Lizzy... I *am*... captain of a ship. And *being* captain of a ship, I could in fact perform a... marriage. Right here. Right on this deck. Right... *now*!  Why not? We *are* very much alike, you and I. I and you. Us.  Trifles. You *will* come over to my side, I know it.  One word love: curiosity. You long for freedom. You long to do what you want to do because you want it. To act on selfish impulse. You want to see what it's like. One day, you won't be able to resist.  Uh my Compass works fine.  I *love* those moments. I like to wave at them as they pass by.  All evidence to the contrary.  Do tell, dearie.  I *do* want to know what it tastes like.   I want my jar of dirt.  Guard the boat, mind the tide... Don't touch my dirt.  Yes it *does*. You're sitting on it!  Move.  I do that quite a lot. Yet people are always surprised.  How did you get here?  Not so easy, is it?  You do?  What?  Oh! Well... you're welcome, then.  Pretty much. Time and tide, love.   Oy! What're you doing?  Can't let you do that, William. 'Cause if Jones is dead, who's to call his terrible beastie off the hunt, eh? Now. If you please: The key.  I knew you'd warm up to me eventually.  Ah. The dark side of ambition.  Let us examine that claim for a moment, former Commodore, shall we? Who was it, who at the very moment you had a notorious pirate safely behind bars, saw fit to *free* said pirate, and take your dearly beloved all to hisself, hey? So who's fault is it, *really*, that you've ended up a rum-pot deckhand what takes orders from pirates?  Still rooting for you, mate!  Wup!  Oh.  Woah!  Oh, shut it.  Jar of dirt!  Leave him lie! Unless you plan on using  Uh, I say we respect his final wish.   He fell behind.  I'll handle this, mate.  Hey! Fishface! Lose something? Hey?  Got it!  Come to negotiate, eh, have you, you slimy git? Look what I got.  I got a jar of dirt! I got a jar of dirt! And guess what's inside it?  Hard to starboard.  Why fight when you can negotiate? All one needs... is the proper leverage.   Where is it? Where is the thump-thump?   Abandon ship. Into the longboat.  She's only a ship, mate.  We're not free yet, love.  Pirate.  Bugger, bugger, bugger, bugger, bugger, bugger...!  Come on... Come on...  Not so bad.  Oh!  Hello, beastie.",
        "Sparrow": "Sorry, mate.  Mind if we make a little side trip?  Complications arose, ensued, were overcome.   Mm-hmm!  Shiny?  Is that how you're all feeling, then? Perhaps dear old Jack is not serving your best interests as captain?  What did the bird say?  Ohhh!  It does me.  No! Much more better. It is a *drawing* of a key.  Gentlemen, what do keys do?  No! If we don't have the key, we can't open whatever it is we don't have that it unlocks. So what purpose would be served in finding whatever need be unlocked, which we don't have, without first having found the key what unlocks it?  You're not making any sense at all. Any more questions?  Hah! A heading. Set sail in a... mmm...   Come on, snap to and make sail, you know how this works. Come on, ?oy/?quick, ?oy/?quick, hey!  Why is the rum always gone?  Oh! *That's* why.  As you were, gents.  Ah!  Bootstrap. Bill Turner.  Is this a dream?  I thought not. If it were, there'd be rum.  I had some help retrieving the Pearl, by the way.  Your son.  And to what do I owe the pleasure of your carbuncle?  Who?  Ah. So it's you, then.  He shanghaied you into service, eh?  It's funny what a man will do to forestall his final judgment -  Technic -  Yes, but the Flying Dutchman already *has* a captain, so there's re -  Any idea when Jones might release said terrible beastie?  On deck all hands! Make fast the bunt gasket! On deck! Scurry! ?Scurry-on/?Marty, I want movement!  *I want movement!*  All on deck! Run! And keep running! Run as if the devil himself and itself is upon us!  Ah! Ooh! Run! Land.  Oh! Euh!  Didn't say port. I said land. Any land.   Agh!  No no! Leave it! Run!  Shhh!  Nothing.  ?: Wa-say kohn. Een dah-lah. Eeseepi.  Kay-lay lam. Lam piki-piki. Lam eensy weensy. Lam say-say... eunuchy. Snip-snip.  Say-say lam shoop-shoop sha smalay-lama shoo-koo. Savvy? Ball licky-licky.   Save me!  Thank you.  ?No/?Oup! No no! ?Oy!/?Wait! No no! More wood! Big fire! *Big* fire! I am chief! Want big fire! Come on!  ?Oy!/?Boy! Maboogie snickel-snickel. Tout de suite! Come on! More wood!   Oh bugger.  Little seasoning. Eh?  Well done.  Well, go on! Go get them! Hay ala!   No! No no! Oy! No no!  Not good.  Bugger.  Hey!  Good doggie! ?Doggie.  *Alas*, my children! This is the day you shall always remember as the day that you almost -  ...Captain Jack... Sparrow.  Yes to the first, yes to the second, but only insofar as we keep to the shallows as much as possible.  I have every faith in your reconciliatory navigational skills, Master Gibbs, now where is that monkey? I want to shoot *something*.  Ah.  Have you considered keeping a more watchful eye on 'er? Maybe just lock her up somewhere.   There comes a time when one must take responsibility for one's mistakes.   Mister Gibbs!  We have a need to travel upriver.  No, a... resolute and unyielding need.   William... I shall trade you the Compass, if you will help me... to find *this*.   No. *You* want you to find this. Because the finding this finds you incapacitorially finding and/or locating and your discovering the detecting of a way to save your ?dolly/?dotty belle ol'... what's-her-face. Savvy?  How much do you know about Davy Jones?   Yeah, it's gonna save Elizabeth.  No worries, mates. Tia Dalma and I go way back. Thick as thieves. Nigh inseparable we are. Were. Have been. Before.   It's me front I'm worried about. Mind the boat.  Tia Dalma!  There'll be no knowing here. We've come for help and we're not leaving without it.  I thought *I* knew you.  Come.  I brought payment.  Look!  An undead monkey! Top that!  We're looking for this.  And what it goes to.  Maybe. Why?  A *woman*.  I did not. I didn't know where the key was. But now we do. So all that's left is to climb aboard the Flying Dutchman, grab the key, you go back to Port Royal and save your bonnie lass, hey!  My eyesight's as good as ever, just so you know.  Dirt. This is a jar of dirt.  Is the... jar of dirt going to help?   No.  Neither do you. Do *not* underestimate her.  So what's your plan, then?  And if there are crewmen?  I like it. Simple, easy to remember.   Hey! If you *do* happen to get captured, just say Jack Sparrow sent you to settle his debt! Might save your life!  Douse the lamps.  Oh.  Technically, I was only captain for two years, then I was viciously mutinied upon.  You have my payment. One soul to serve on your ship is already over there.   Aha! So we've established my proposal is sound in principle, now we're just haggling over price.  Just how many souls do you think my soul is worth?  You're a diamond, mate. Send me back the boy, I'll get started right off.   Have you not met Will Turner? He's noble, heroic, *terrific* soprano. Worth at least four... maybe three and a half. And did I happen to mention... he's in love. With a girl. Due to be married. Betrothed.  Dividing him from her and her from him... would only be half as cruel as actually allowing them be joined in holy matrimony. Aye?  Yep! I'm good with it. Should we seal  Uh!  Oh, Mr. Gibbs.  Uh, I feel sullied and unusual.  Fortunately, he was mum as the condition in which these souls need be.  Tortuga.  I know what I want.  How we going?  You're hired.  Time to go?  Thanks, mate.  Carry on.  Come to join me crew, lad? Welcome aboard.   I'm deeply flattered, son, but my first and only love is the sea.  Elizabeth.  Hide the rum.  You know, these clothes do not flatter you at all. It should be a dress or nothing. I happen to have no dress in my cabin.  Darling, I am truly unhappy to have to tell you this but... through an unfortunate and *entirely* unforeseeable series of circumstances that have nothing whatsoever to do with me, poor William has been press-ganged into Davy Jones' crew.   You look bloody awful. What are you  You *smell* funny.  Are you certain? Is that what you really want most?  Because I would think, you'd want to find a way to *save* Will the most.   Well, there is a chest...  A chest of unknown size and origin.   And whoever possesses that chest possesses the leverage to command Jones to do whatever it is he or she wants, including... saving brave William from his grim fate.   With this. My Compass... is unique.   True enough. This Compass does not point north.  It points to the thing you want most in this world.  Every word, love. And what you want most in this world is to find the chest of Davy Jones, is it not?  By finding the chest of Davy Jones.   Mister Gibbs!  We have our heading.  Miss Swann.  Agh.  Agh.  Of course. He wants the chest.  A truly discomforting notion, love.   Might I inquire how as to how you came by these?  Friendly?  Will strikes a deal for these and upholds it with honor. Yet you're the one standing here with the prize. Full pardon, commission as a privateer on behalf of England and the East India Trading Company. As if I could be bought for such a low price.  No. Persuade me.  As I said... Persuade me.  My tremendous intuitive sense of the female creature informs me that you are troubled.  You know...  Lizzy... I *am*... captain of a ship. And *being* captain of a ship, I could in fact perform a... marriage. Right here. Right on this deck. Right... *now*!  Why not? We *are* very much alike, you and I. I and you. Us.  Trifles. You *will* come over to my side, I know it.  One word love: curiosity. You long for freedom. You long to do what you want to do because you want it. To act on selfish impulse. You want to see what it's like. One day, you won't be able to resist.  Uh my Compass works fine.  I *love* those moments. I like to wave at them as they pass by.  All evidence to the contrary.  Do tell, dearie.  I *do* want to know what it tastes like.   I want my jar of dirt.  Guard the boat, mind the tide... Don't touch my dirt.  Yes it *does*. You're sitting on it!  Move.  I do that quite a lot. Yet people are always surprised.  How did you get here?  Not so easy, is it?  You do?  What?  Oh! Well... you're welcome, then.  Pretty much. Time and tide, love.   Oy! What're you doing?  Can't let you do that, William. 'Cause if Jones is dead, who's to call his terrible beastie off the hunt, eh? Now. If you please: The key.  I knew you'd warm up to me eventually.  Ah. The dark side of ambition.  Let us examine that claim for a moment, former Commodore, shall we? Who was it, who at the very moment you had a notorious pirate safely behind bars, saw fit to *free* said pirate, and take your dearly beloved all to hisself, hey? So who's fault is it, *really*, that you've ended up a rum-pot deckhand what takes orders from pirates?  Still rooting for you, mate!  Wup!  Oh.  Woah!  Oh, shut it.  Jar of dirt!  Leave him lie! Unless you plan on using  Uh, I say we respect his final wish.   He fell behind.  I'll handle this, mate.  Hey! Fishface! Lose something? Hey?  Got it!  Come to negotiate, eh, have you, you slimy git? Look what I got.  I got a jar of dirt! I got a jar of dirt! And guess what's inside it?  Hard to starboard.  Why fight when you can negotiate? All one needs... is the proper leverage.   Where is it? Where is the thump-thump?   Abandon ship. Into the longboat.  She's only a ship, mate.  We're not free yet, love.  Pirate.  Bugger, bugger, bugger, bugger, bugger, bugger...!  Come on... Come on...  Not so bad.  Oh!  Hello, beastie.",
        "Cotton": "Awk! Walk the plank!  Awk!  Rawk! Don't eat me!  Don't eat me! No! Don't eat me! Akkk!   Awk! Mind the boat!  Awk! Aye.",
        "Pintel": "And I say... it was me bein' *clever*. Ain't that right, poochie?  It ain't stealin'. It's *salvagin'*! And since when did you care?  You know you can't read.  Pretendin' to read the Bible's a *lie*! *That's* a mark against ya!  Look! There it is!  Must've seen a catfish. Heh-heh-heh-heh-heh-heh.   Come on! Ha-ha-ha-ha-ha-ha. Ha-ha-ha-ha... ###  It's ours for the taking!  There's the truth of *it*! ###  Amen to that.  ?Pull-loose/?Unloose the mooring lines! The mooring lines!  ?Unloose the mooring lines!  Well, how'd you get it back last time?   We done it for you! Knowin' you'd be comin' back for us.  Mind the boat.  Gold! Jewels? Unclaimed properties of a valuable nature?  Sums!  He couldn't li'erally put his heart in a chest!  Could he?  What contains the still-beating heart o' Davy Jones.  Welcome to the crew, former Commodore!   You're pullin' too fast.  I'm savin' me strength for when it comes. And I don't think it's Krack-en, anyways. I always heard it said Kray-kin.   Aye.  Well we ain't original Scandinavians, are we? Kray-ken!  \"Mind the tide.\"  ?Don't ?mind ?if I shine your shoes, Sir?  How'd this go all screwy? Enough!  Sad. That chest must be worth more 'n a shiny penny.  If we was any kind of *decent*, we'd remove temptation from their path.   'Ello, Poppet.  Sword!  Come on, Turner!  Aye!  You're pulling too hard!  She's on us! She's on us!  I think we've held fire long enough.   'S a lot o' open wa'er.  He was a gentleman of fortune, he was.   Aye.",
        "Will": "I don't know. You look beautiful.  No!  Lord Beckett! In the category of questions *not* answered...  More acquaintance than friend. How do you know him?  What mark did he leave on you?  Recover. At the point of a sword?  Somehow I doubt Jack will consider employment the same as being free.  So you get both Jack *and* the Black Pearl.  The property you want that he possesses.   Does it matter? I'm to find Jack and convince him to return to Port Royal. In exchange the charges against us will be dropped.  Is that lack of faith in Jack, or in me?  Tortuga. I'll start there, and I won't stop searching 'til I find him. And then I intend to return here, to marry you.  Eagerly, if you'll still have me.  Keep a weather eye on the horizon.  What's wrong? The beach is right there.   What?  Jack! Jack Sparrow!  Marty! Cotton! Anybody?  Ah! A familiar face!  I'm not gonna eat you.  Gibbs.  Euh! Unh! Ya! Come on! Let's go! Euh! Ya! Come on! Who wants it? Unh! I could do this all day! Euh! Euh! Hah!  Jack? Jack Sparrow! I can honestly say I'm glad to see you!  Jack! It's me! Will Turner!  Tell 'em to let me down.  Jack! The Compass! That's all I need, Elizabeth is in danger. We were arrested for trying to help *you*. She faces the gallows!  Jack, what did you tell them? No! What about Elizabeth? *Jack...!*  Why would he do this to us? If Jack is their chief.  So he had no choice. He's a captive then as much as the rest of us.  Where's the rest of the crew?  Well, we can't just sit here and wait then, can we?  Come on men! It'll take all ?of-us/?the-rest to crew the Black Pearl!  Hurry!  Stop!  ?Move!  Cut it loose! Find a rock!  Roll the cage!  Lift the cage! Hurry!  What about Jack? I won't leave without him.  Time to go.  Jack.  Elizabeth is in danger.  She *is* locked up, in a prison, bound to hang for helping *you*!  I need that Compass of yours, Jack. I must trade it for her freedom.  What we need to do is make sail for Port Royal with all haste.  You want me to find this?  This... is going to save Elizabeth?  Not much.  Why is Jack afraid of the open ocean?   And the key will spare him that?  Her?  Mind the boat.  You know me?  What vexes all men?  What... exactly did he put into the chest?  You knew this.  It seems... we have a need to find the Flying Dutchman.  That's the Flying Dutchman? She doesn't look like much.  I row over, search the ship until I find your bloody key.  I cut down anyone in my path.  Sailor!  Sailor!  There's no use. You've run aground.   Hey! Hey!  Get back! Back!  Jack Sparrow sent me to settle his  Jack Sparrow. He sent me to settle his debt.  Step aside!  I don't need your help!  So I'm to understand what *you* did was an act of compassion?  I've sworn no oath.  Not until I find this. The key.  What do you know of this?  So the captain has the key.  Where *is* the key?  Where is the chest?  I understand. Liar!  It's a game of deception. Your bet includes all the dice, not just your own.  What are they wagering?  So any crewman can be challenged?  I challenge Davy Jones.  My soul. An eternity of servitude.   I want this.  That's not part of the game, is it? You can still walk away.  No! Don't do this.  Four fives.  Eight fives.  Fool. Why did you do that?  It was never about winning, or losing.   It's not a fate you had to choose for yourself, either.  They'll know you helped me.  I take this with a promise. I'll find a way to sever Jones' hold on you. And not rest until this blade pierces his heart. I will not abandon you. I promise.   Just put as many leagues behind us as you can. As fast as you can.  That dress. Where did you get it?  That's foolish.  I imagine... some of your crew may have jumped ship there.  Or worse.  I've doomed us all.  It's the Flying  With good reason!  Sea turtles, mate. A pair of them, strapped to my feet.  But I do owe you thanks, Jack.  After you tricked me onto that ship to square your debt with Jones.  I was reunited with my father.  I'm gonna kill Jones.  I keep the promises I make, Jack. I intend to free my father. I hope you're here to see it.  Guard the chest!  By *your* leave, Mister Norrington.   Be my guest.  Right!  What happened to the chest?  Brace up the foreyard!  We're the faster?  We rob her advantage.  My father is *on* that ship. If we  No. It's not a reef! Get away from the rail!  The Kraken. To arms!  ?It'll ?attack the starboard. I've seen it before. ?Break out the cannons and hold for my signal.  Easy, boys!  Steady! Steady.  Hold. Hold...  *Fire...*!  It'll be back. We have to get off the ship.  Pull the grates! Get all the gunpowder onto the net in the cargo hold.  Whatever you do, don't miss.  Then load the rum!  ?Pull ?away!  Euh! Come on!I'm over here! Come on!  Shoot! Elizabeth, shoot!  We have to try. We can get away as it takes down the Pearl.  Where's Jack?  Doesn't matter now. The Pearl's gone. Along with its captain.  If there was anything could be done to bring him back...  Elizabeth...   Aye.",
        "Turner": "I don't know. You look beautiful.  No!  Lord Beckett! In the category of questions *not* answered...  More acquaintance than friend. How do you know him?  What mark did he leave on you?  Recover. At the point of a sword?  Somehow I doubt Jack will consider employment the same as being free.  So you get both Jack *and* the Black Pearl.  The property you want that he possesses.   Does it matter? I'm to find Jack and convince him to return to Port Royal. In exchange the charges against us will be dropped.  Is that lack of faith in Jack, or in me?  Tortuga. I'll start there, and I won't stop searching 'til I find him. And then I intend to return here, to marry you.  Eagerly, if you'll still have me.  Keep a weather eye on the horizon.  What's wrong? The beach is right there.   What?  Jack! Jack Sparrow!  Marty! Cotton! Anybody?  Ah! A familiar face!  I'm not gonna eat you.  Gibbs.  Euh! Unh! Ya! Come on! Let's go! Euh! Ya! Come on! Who wants it? Unh! I could do this all day! Euh! Euh! Hah!  Jack? Jack Sparrow! I can honestly say I'm glad to see you!  Jack! It's me! Will Turner!  Tell 'em to let me down.  Jack! The Compass! That's all I need, Elizabeth is in danger. We were arrested for trying to help *you*. She faces the gallows!  Jack, what did you tell them? No! What about Elizabeth? *Jack...!*  Why would he do this to us? If Jack is their chief.  So he had no choice. He's a captive then as much as the rest of us.  Where's the rest of the crew?  Well, we can't just sit here and wait then, can we?  Come on men! It'll take all ?of-us/?the-rest to crew the Black Pearl!  Hurry!  Stop!  ?Move!  Cut it loose! Find a rock!  Roll the cage!  Lift the cage! Hurry!  What about Jack? I won't leave without him.  Time to go.  Jack.  Elizabeth is in danger.  She *is* locked up, in a prison, bound to hang for helping *you*!  I need that Compass of yours, Jack. I must trade it for her freedom.  What we need to do is make sail for Port Royal with all haste.  You want me to find this?  This... is going to save Elizabeth?  Not much.  Why is Jack afraid of the open ocean?   And the key will spare him that?  Her?  Mind the boat.  You know me?  What vexes all men?  What... exactly did he put into the chest?  You knew this.  It seems... we have a need to find the Flying Dutchman.  That's the Flying Dutchman? She doesn't look like much.  I row over, search the ship until I find your bloody key.  I cut down anyone in my path.  Sailor!  Sailor!  There's no use. You've run aground.   Hey! Hey!  Get back! Back!  Jack Sparrow sent me to settle his  Jack Sparrow. He sent me to settle his debt.  Step aside!  I don't need your help!  So I'm to understand what *you* did was an act of compassion?  I've sworn no oath.  Not until I find this. The key.  What do you know of this?  So the captain has the key.  Where *is* the key?  Where is the chest?  I understand. Liar!  It's a game of deception. Your bet includes all the dice, not just your own.  What are they wagering?  So any crewman can be challenged?  I challenge Davy Jones.  My soul. An eternity of servitude.   I want this.  That's not part of the game, is it? You can still walk away.  No! Don't do this.  Four fives.  Eight fives.  Fool. Why did you do that?  It was never about winning, or losing.   It's not a fate you had to choose for yourself, either.  They'll know you helped me.  I take this with a promise. I'll find a way to sever Jones' hold on you. And not rest until this blade pierces his heart. I will not abandon you. I promise.   Just put as many leagues behind us as you can. As fast as you can.  That dress. Where did you get it?  That's foolish.  I imagine... some of your crew may have jumped ship there.  Or worse.  I've doomed us all.  It's the Flying  With good reason!  Sea turtles, mate. A pair of them, strapped to my feet.  But I do owe you thanks, Jack.  After you tricked me onto that ship to square your debt with Jones.  I was reunited with my father.  I'm gonna kill Jones.  I keep the promises I make, Jack. I intend to free my father. I hope you're here to see it.  Guard the chest!  By *your* leave, Mister Norrington.   Be my guest.  Right!  What happened to the chest?  Brace up the foreyard!  We're the faster?  We rob her advantage.  My father is *on* that ship. If we  No. It's not a reef! Get away from the rail!  The Kraken. To arms!  ?It'll ?attack the starboard. I've seen it before. ?Break out the cannons and hold for my signal.  Easy, boys!  Steady! Steady.  Hold. Hold...  *Fire...*!  It'll be back. We have to get off the ship.  Pull the grates! Get all the gunpowder onto the net in the cargo hold.  Whatever you do, don't miss.  Then load the rum!  ?Pull ?away!  Euh! Come on!I'm over here! Come on!  Shoot! Elizabeth, shoot!  We have to try. We can get away as it takes down the Pearl.  Where's Jack?  Doesn't matter now. The Pearl's gone. Along with its captain.  If there was anything could be done to bring him back...  Elizabeth...   Aye."
    },
    "imdb_rating": "7.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTcwODc1MTMxM15BMl5BanBnXkFtZTYwMDg1NzY3._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Once again we're plunged into the world of sword fights and \"savvy\" pirates. Captain Jack Sparrow is reminded he owes a debt to Davy Jones, who captains the flying Dutchman, a ghostly ship, with a crew from hell. Facing the \"locker\" Jack must find the heart of Davy Jones but to save himself he must get the help of quick-witted Will Turner and Elizabeth Swann. If that's not complicated enough, Will and Elizabeth are sentenced to hang, unless Will can get Lord Cutler Beckett Jack's compass. Will is forced to join another crazy adventure with Jack.kate Archie",
    "name": "Pirates of the Caribbean: Dead Man's Chest",
    "genres": [
        "Action",
        "Adventure",
        "Fantasy"
    ]
}