{
    "filename": "Predator_script.txt",
    "imdb_id": "tt0093773",
    "imdb_url": "https://www.imdb.com/title/tt0093773",
    "characters": [
        "Complete credited cast:",
        "Dutch",
        "Dillon",
        "Poncho",
        "The Predator /Helicopter Pilot",
        "General Phillips",
        "Billy",
        "Hawkins",
        "Anna",
        "Blain",
        "Mac"
    ],
    "dialogues": {
        "Dutch": "",
        "Dillon": "Last time we danced, it was Lieutenant, Schaefer.      That piece of work you guys pulled off at the Berlin embassy last week was really something.  Blew the entry points on three floors and neutralized the opposition in eight seconds flat. Beautiful.  Also heard that you passed on that little job in Libya.  Those cabinet members are very important to our scope of operations in this part of the world.  They're about to get squeezed.  We can't let that happen.  I needed someone who could get the job done, quick and quiet...no screw-ups.  I needed the best. The best.  So, I pulled a few strings at the State Department...and here we are.  The set-up is simple, Dutch. One day job.  We pick up their trail at the chopper, run 'em down, grab the hostages and bounce back across the border before anyone knows we were there.  You've done it a hundred times.  Nothing out of the ordinary.  Not to worry, Dutch.  I haven't lost my edge.  They've got a head start on us in some real tough country, otherwise, believe me, it's a piece of cake.  (pointing to the map      (shouting to Schaefer  Have you picked up their trail yet?  They're getting better equipped every day.  Probably another rebel patrol. They operate in here all the time.          On your nine!!!  This is beautiful!  More than we ever thought.  We got the bastards!       Because I told you, you're the best.  I knew you could do it but I couldn't get you in here without a cover story.  We've been lookin' for this place for months.  The chopper must have gotten close when they got shot down.  Hopper                        * was sent in to get my men. He was just doing his job. When he disappeared I had to clean this up,  I had to stop there bastards.  We were so close, we couldn't quit.  We couldn't sleep through this one.  I needed you, Dutch, can't you see that?  To invade a foreign country, illegally?  You lied, Dillon. Stacked the odds against us.  Set us up.  You could have gotten us all killed. You used to be one of us, Dillon, someone I could trust with my life...  We've been through a lot together Dutch.  When we were together, no                  * one could stop us, the hottest                     * Goddamned team the army ever saw.                  * But things changed, I woke up. We're fighting them in a dozen Goddamned countries.  It's a fight we can't lose, Dutch.  We're all expendable assets, can't you see that?      She's too valuable.  She's got to know their whole network.  The whole set up. We take her with us.                               *  You're still under orders, Dutch.  You want to make the call, or should I?    Yeah, what is it, Sergeant?  Thanks.     ------------------------------------------------------------------------      Watch her.  That isn't what she said... she said... ...she doesn't make sense.    The wound all fused, cauterized...what the hell did this?    (to phone; angry  (angry; shocked  I can accept that, it comes with the job.  Mac.  Who hit us today?  (abruptly; pushing  Ask her again.  What did she see?  What happened to Hawkins?  He's losing his cool.  There's nothing out there but a couple of men that we're going to have to take down.  You're wastin' your time.    What the hell do you think you're doing?  What are you talking about? We'll be out of here in ten                        * minutes.                                           *  That rendezvous is ten maybe                       * twelve miles, at most!  We're                      * almost home.  But the chopper                      * won't wait.   *  Now what, Dutch.  You going to send your mystery guest an invitation?      What is God's name...?  No way, Dutch.  I'm going. You get these people and get the hell out of here.  Guess I've picked up some bad habits from you, Dutch.  Now don't argue with me, you know I'm right.  Get to that chopper and hold it for us. We'll be along.  You know me, Dutch, I never did know when to quit.  Right behind you.      ------------------------------------------------------------------------          Take a position over there. I'll work around towards you. When I flush him, you nail him...  We both got scores to settle.             ------------------------------------------------------------------------                       ------------------------------------------------------------------------",
        "Poncho": "",
        "General": "",
        "Phillips": "",
        "Billy": "Major, looks like there were ten, maybe twelve guerrillas.  Looks like they took some prisoners from the chopper. Then a different set of track, over there.  Six others, U.S. issue jungle boots.  They came in from the north, then followed the guerrillas.        ------------------------------------------------------------------------        Strange, Major.  There was a firefight.  Shooting in all directions.  I don't believe he did, Sir. I couldn't find a single track. Just doesn't make sense.          Looks bad, Major.  It's gonna be a real bitch. If we follow above the river and then down, here, at this canyon, we might find a way out.                 It's nothing...  I'm scared.  There's something out there, waiting for us...it ain't no man.    The body...it's gone.  Boar set off the trip flare, Major.  No other tracks.  Like a Hunter.                                     *  He's busted up, bad, Major.",
        "Hawkins": "Two.  One to eat it and one to watch for cars.     You got it, Major!  Major!      Half an hour, maybe less.                          *          ------------------------------------------------------------------------        Please...               ------------------------------------------------------------------------",
        "Anna": "------------------------------------------------------------------------           ------------------------------------------------------------------------                    ------------------------------------------------------------------------                 I don't know what it was. It...  It changes colors, like the chameleon.  It uses the jungle...  Anna.  There is something else.  When the big man was killed, you must have wounded it. It's blood was on the leaves.   (she struggles for the words       (o.s.; filtered; in Spanish  (o.s.; in Spanish",
        "Blain": "...bunch of slack-jawed faggots around here... ...this stuff will put hair guaranteed... ...make you a God-damned sexual ty-ran-toe-sore-ass... just like me.     Payback time.     Say, Bull.  What's goin' down? We got movement?  I know what you mean, Bull, but don't sweat it, me and 'ol 'painless' here are watchin' the front door.     ------------------------------------------------------------------------       Son of a bitch's dug in like a Alabama tick... ...jack us around all day.  Shit, Pancho!!!  I hear you bro, this is some shit.  Makes Cambodia look like Kansas.  Lose your way in here, man, you be in some kinda hurt.",
        "Mac": "(hissing; barely audible   No.  Shithead with his trenchcoat and dee-coda-da ring was makin' enough noise to get us all waxed.  I don't like that guy.  Don't like him at my back.  I ain't winding up like those bastards back there.  As always, bro...     ------------------------------------------------------------------------        ------------------------------------------------------------------------                 I've seen some badass bush before, but nothin' like this, man. Little taste 'o home?  Can't say, Major...been squirrely all mornin'... fuckin' weird...sometimes I think that nose of his is too good...smells things that ain't there.              ------------------------------------------------------------------------            I don't know.  Goddamn it, something...I saw something/.  Yessir.  I'll take him.  We've got most of the flares, frags. and two claymores just outside.  Nothin's comin' close to here without trippin' on somethin'.              Don't know, only saw one of 'em.  Camouflaged.  He was there... ...Those fucking eyes...  (returning; angry   I've got the first watch.     (distant; whispering   ...we walked out on top of 'em.  Not a scratch, not a fuckin' scratch. No fuckin' chili-choker got to you, Bro...you were just too good...  ...I promise you this, Bro... whoever he is, I hope he's plannin' to hit us again... ...'cause he's got my name on 'em.  Got the motherfucker...         (whispering; close"
    },
    "imdb_rating": "7.8",
    "description": "A team of special force ops, led by a tough but fair soldier, Major \"Dutch\" Schaefer, are ordered to assist CIA man, Colonel Al Dillon, on a rescue mission for potential survivors of a Helicopter downed over remote South American jungle. Not long after they land, Dutch and his team discover that they have been sent in under false pretenses. This deception turns out to be the least of their worries though, when they find themselves being methodically hunted by something not of this world.—Laygz",
    "name": "Predator",
    "genres": [
        "Action",
        "Adventure",
        "Horror"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BODBlOGE4ZWUtZjIyZi00ZTBmLWIwY2ItYmY2NjEwOWViM2Y3XkEyXkFqcGdeQXVyMjI0NTA4NzA@._V1_QL75_UY281_CR46,0,190,281_.jpg"
}