{
    "filename": "Pretty-Woman_script.txt",
    "imdb_id": "tt0100405",
    "imdb_url": "https://www.imdb.com/title/tt0100405",
    "characters": [
        "James Morse",
        "Barney Thompson",
        "Magician",
        "Kit De Luca",
        "Female Guest",
        "Carlos (as William Gallo)",
        "David Morse",
        "Elizabeth Stuckey",
        "Male Guest",
        "Susan",
        "Vivian Ward",
        "Bridget",
        "Howard",
        "Edward Lewis",
        "Philip Stuckey"
    ],
    "dialogues": {
        "James": "",
        "Morse": "",
        "Barney": "",
        "Thompson": "",
        "Magician": "",
        "Female": "",
        "Guest": "",
        "David": "Mr. Harris, we know you've purchased at least twenty percent of our stock.  We also know you plan to file a formal bid for a majority share.  We're on the verge of closing a large navy contract.  Double is ridiculous but we can assure you a healthy profit on your shares.  We would give you a promissory note...  There's no way you could know that.    I don't think so.  You should know we're going to fight you with every resource we have.  I do.  I take it all very personally. Very nice meeting you, Vivian.  Hi.    Let's not talk about it, it's too depressing.  Come on, I'll show you Thunder.  Thunder's a horse.  Come on.  Hey, big guy, you getting tired, yet?  I am.  This is Vivian. You two been together long?  You and Edward?  Hope to be?  I see.  Well.  Maybe that means you'd have lunch with me sometime then.  I'm sorry, am I being too forward?  I'd like to find out.  You don't know anything about me either. That's why people have lunch.  Hello, Vivian.  Dad, excuse me, but that's inappropriate.  You're under no obligation to answer any questions at all.  If he throws himself on your sword, you promise to take care of him and his family, huh?  You bed it is. You're everything he said you were. Do what you have to do, Dad. Just don't expect me to watch it.",
        "Elizabeth": "Bill?    Excuse me.  Edward, she's marvelous.  Warm and witty and down to earth.  So unlike your usuals.  Where on earth did you find her?",
        "Stuckey": "Hah!  Did you see the look on their faces?  NO way!  They'll come back.  They can't afford not to.  Edward, that bluff was beautiful.  Cynthia?  Is she coming out?    Lowell, right.  My wife, Elizabeth.  What's up, where you going?  At least stay for a drink.  This party's for you.  Listen, there're some major local talent inside just dying to meet you...  Cynthia's not coming?  Let your driver take you.  We'll move the cars...  Can you drive a stick?  Edward, give me a break!  Yes!  And you don't even know where you're going!  That's the wrong way!     Kross knows we're after his company.  He wants to talk with you.  I don't think you should.  Edward, if the three of us sit down together we might as well announce our plans in the Wall Street Journal.  You shouldn't go alone.  He might claim that you tried to black mail him.  Oh, god, what?     Edward, it's me.  Kross is all set for tonight.  Listen, I gotta say this again, I don't like you going alone.  Let me at least get you a date. Keep it social.  Edward, did you hear me?  I know a lot of nice girls.  Prime industrial property straddling the Port of Long Beach and Los Angeles.  It gives me a hard-on.  What kind of an idiot are you? You don't talk about this to anyone.    What!?  Jesus, yes.  It's a long shot but if the permits are still in effect, they're worth a fortune.  Eight o'clock.  Kross is bringing his son.  Very bright kid, watch yourself with him.  Who's this girl you're taking?        Goddamit!  Where is he getting the money to fight?  Our contract guys are working on the Kross pension funds. There's another forty million there.  We can bleed'm dry.    But, Edward...    It goes without saying that your business means a great deal more to them than our friend Kross's. All you have to do is make a call.  Excuse me for saying this but what is wrong with you this week? First, you go soft on the pension funds.  Now, you're giving him the chance to get away?  As of two minutes ago, you are committed to the tune of over fifty million dollars --  And some of it's mine.  Edward, his jugular's exposed.  Edward!  Come on!  Over here!    (holding out a hand;  Lots of fun people here.  Let me get you two some champagne.  Excuse me.  Edward, she's marvelous.  Warm and witty and down to earth.  So unlike your usuals.  Where on earth did you find her?  Fill me in on this.  How'd you and Vivian meet?    And you just happened to run into her.  Great.  What's she do?  She work?  Doing what?  Sales, really?  That's great. What does she sell?  Hear me out.  I've known you a long time.  I see a difference in you this week.  Like that tie. I'm suddenly wondering if this girl's not the difference. Especially when I see her talking with David Kross.    So now they're best friends? Edward, this girl appears out of nowhere and now I see her talking to a guy whose company we're trying to buy.  It's too convenient.  Industrial espionage is not ridiculous.  Edward, how do you know she hasn't attached herself to you so she can bring Kross back information?    I swear to God, you are the only millionaire I ever heard of who'd go looking for a goddam bargain streetwalker!  Having a good time, Vivian?  All this must be quite a change from Hollywood Boulevard.  It's okay.  Edward told me.  Your secret's safe with me.  What do you charge, Vivian? Maybe you and I could get together after Edward leaves.  I just might do that.  This is no time to disappear. We're in too far.  Promise me you'll read those contracts by then.  Shit... By tomorrow, Edward!     Did I wake you?  I had to call.  I jus got off the phone with James Kross.  Get this.  He wants to see you. Today.  He wouldn't say.  Edward... I think we got him.  His nuts are on the block and we got him. You there?  We'll be there.  Listen, if he's really caving in, we'll go from there down to the office.  I want him to commit his stock to us this morning.  Let's not waste time here, shall we?  Mr. Kross, you said this morning, you wished to speak with Mr. Harris.  Mr. Harris is now listening.    Today.  If we can get these letters of intent out of the way now... Mr. Harris and I would like to ask you some questions about your company.  Mr. Harris is preparing a bid based on our speculation of the corporation's net worth.  The price he ultimately pays for your father's stock will be based on that bid.  The more we know, the higher our bid can be.  That's unfair!    Oh, my god... Edward, no!  Have you lost your mind?  What!?      Well, well... Hello again.  I'm looking for Edward.  No, I'll just have to wait then, won't I?  Mind if I have a drink?  Do you want to know what he did? Do you want to know what the crazy son of a bitch did?  He handed the whole thing back to Kross! On a silver platter.  For no reason!  What was he thinking, I mean, what was going through his goddam head?  Why? What was all that benevolent crap?  What are we going to become, a philanthropic foundation?  I'll probably be the director of several worthwhile charities.  I bet.  A lousy whore and you're the gum in a hundred million dollar deal.  But what do I know, maybe you're worth it.  Come on, show me. Let's see your act.  Don't worry.  I'll pay for it. What a you charge?  Huh?  Twenty, thirty, fifty bucks, maybe?  Are you a fifty dollar whore?  You got a mean streak in you, don't you.  Is that what he likes about you? Huh?  Answer me!     You broke my nose.  Edward, we've been together ten years.  All this because of that whore!  Edward, think about what you're --",
        "Male": "",
        "Susan": "",
        "Vivian": "Yeah, what?  Don't give me that.  Kit gave it to you yesterday, cash.       Chan, you seen Kit tonight?  You do, tell her I'm looking for her.  Yeah, you too, D'Nai.  If Kit comes in here, tell her stay.  You spent it on drugs, didn't you?    I bet. That was our rent!  Beat it, scum bucket!    Get out of my face or I'll have those cops on your ass in two seconds.  We worked for that money.  We were gonna put together enough to get out of that dump we live in, get off this street.  I just saw somebody pulled out of a dumpster.  I wonder how much she made tonight?  I thought you were giving up that drug shit.  No, let's go to work.  Okay?    Forget it.  We work for it.  We keep it.    He's not gonna want us.  Okay.  Go home.  But take it easy on that shit.  Hey Sugar, you lookin' for a date?  You looking' for some company?  What? You gonna tell me you're lost?  Great.  What do I look like a tourguide?  Actually, I'm a movie star out for a walk.  Sure.  For five bucks.  The price just went up to ten.    For twenty, Ill show you personal.  Drive.  Make a \"U-ee\".  Beverly Hills is the other way.  Nice car.  Yours?  Stolen?  Mind if I turn on some heat?    What motel you staying at?  Okay, what hotel?    What do you want it to be? Vivian, my name's Vivian.  It pays.     Tell me about it.  L.A. is suffering from a wacko epidemic. And who knows where half the guys I pick up have been.  I mean, I use condoms.  Always.  And I get checked out once a month at the free clinic.  Not only am I better in the sack than an amateur, I'm probably safer.    You don't know habits, you think this is ugly.  Okay, pull over.  Let me out. I've got to get back to work.  Stay on this street and you'll hit Beverly Hills.  Company would cost you... a hundred dollars.  For an hour.  I never joke about money.  No, but it's getting there.  You couldn't afford it.  Three hundred.  What's your name, lover.  Edward... you got it!  What?  Better believe it.  Here we go Edward.  Why?  You mean they don't have hookers.  Off the boulevard.  Great.  Now I took like a hooker in a trenchcoat.  So let's go.  Penthouse.  My, my.  The penthouse.  And step on it.  Diet coke.  Can I have some chips?  You kidding?  I come here all the time.  As a matter of fact they do rent this room by the hour.  Well, now that you have me for the night, what are you going to do with me?  Do you plan everything?  Well, the meter's running, it's your money.  Speaking of which, cash'll do.  In advance.  Right. So!  In town on business?  Let me guess, you're a... lawyer.    I've known a lot of everybody.  Hey.  I might as well make myself useful.  Where would we like it?  What are you looking at?  Tsk.  Excuse me, I didn't think he had change for a hundred.  You have a wife?  Girlfriend?  Where are they?  Shopping together?  Oooh, thank god.  Why?  Jesus, you act like you're seducing some Valley girl you picked up in a dance club.    Me too.  Not on the lips.  If I want you to turn me on I'll pay you three hundred.  Just lay back and let me drive.  You didn't wake me.  I'll be out of here in a minute.  Only if you do.  Yeah.  Too good.  I forgot where I was.  Where'd you go?  Oooh, Baby, you were the best. I was beside myself.  I just hope it was worth three hundred bucks.  I like guys if that's what you're asking.  Not that I trust'm.  \"Occupational hazard\".  what do you do anyway?  No shit.  They expensive?  ... dollars?  You are major league, baby.  Your mother must be very proud.  So what a ya do with the companies once you buy'm?  What?  Why?  At ease, let me do that.  Part of the all night services.  What are assets?  C'mon, I might buy a company some day.  Sorta like stealing cars and selling'm for parts, huh?  There, see?  Now the emblem is right in the middle of the knot.    You could hold a pep rally in here!  What?  It'd cost you.  Five full nights... days too?  Four thousand.  But you want days too.  Three.  Holy shit.  Sugar, you got it.  I will treat you like a prince.  Anything, anyway you want.  Look butthead, I'll treat you so nice you'll never want to let me go, okay?  Yeah, you want me to dress like your high class girlfriend. You're wasting your money though. All I'm gonna do is hang around the hotel.  As a matter of fact, I may never get out of that bathtub.    Three thousand...  Three thousand!  Kit!  Where've you been?  Kit, listen, the guy last night, the one in the Ferrari, I'm at this hotel, the Regent Beverly Wilshire, it's this absolutely unbelievable place and he's hired me for a whole week and Kit, listen, he's paying me three thousand bucks!  We can get out of the apartment.  We can get out of this town.  We can do anything! Kit?  Hey, you there?  He... he just does.  Three hundred for last night and he gave me extra to buy some clothes.  Now listen, I'm gonna leave an envelope for you at the front desk. Give me two hundred to the scum bucket and the other hundred to that asshole landlord for part of the rent.  Spend it on drugs and I'll pull your hair out.  Hey Kit, where do I go for the clothes?  Good stuff on him.  Yeah.  I'm just looking, thanks.  Yes.  Something... conservative.  You have beautiful things. How much is this?  (beginning to get the  What is with you?  I'm going to spend money.  I'm just going to my room.  I'm -- I'm with a friend.  I... Edward...    Vivian.  Niece?  That's what I was trying to do.  I was trying to get some other clothes... but... they wouldn't... they made me feel like shit...  Barney.    Well... I might be going out to dinner.  I dunno.  Do thigh high, leather boots go with a cocktail dress?  He's not really my uncle.  I got a dress.  I didn't want to get it messed. I got shoes too.  Wanna see?  They were real nice to me there. They treated me, y'know... nice. Thanks, Barney.  Hello?  Hello?  What?  Hello?  Tsk, believe me, this will be the last time.  I got a dress, yeah.  It's very tasteful.  I think you'll especially like the zipper in the crotch. I'm -- joking.  No, I don't \"got it\".  Even the farmboys back in Georgia come to the door when they're taking you on a date.  Go by yourself then.  Where you taking me anyway?  Any good?  ... all right.  I'll meet you in the lobby.  But only cause you're paying me to.  Hello?  Oooh!  What?  Okay.  Is there a trick to it?  Is that all?  You just fold back the bedspread?  Oooh, I love those.  Thanks!  Consuelo, are all rich people so lazy they can't do this on their own?  Barney.  Edward is taking me to some fancy place for dinner.  The Rex.  Ever been there?  Yeah, mine too.  Is it like, y'know, normal?  Will I like it?  Okay.  Thanks, Barney.  You're the best.  Fork?     But I always eat like this.  Hmmm... I vonder vich.  What if they serve soup?  But what if they serve soup?    Steak spoon!  Maybe I'll just order a burger, Barney, that way I can eat with my hands.  Professionally?  I have a friend who has a friend who does Cher's wigs.  Yeah... what a ya say we chop it all off and bleach the tips.  You're late.  You're forgiven.    Slippery little suckers...  He seems like a nice man.  Some game.  Screwin' some poor slob out of his retirement.  Snails for dinner.  No wonder everybody is in such a bad mood.  You're upset, huh?  You liked the guy, though.   (realizing what she's  Let's not talks about this heavy stuff.  Come on, relax.  Know what we're gonna do in a little while then?  We're gonna call Domino's and have'm deliver a bigass pizza.  We're gonna eat it in bed.  We're gonna veg' out and watch television.  Yeah, it's this box, it has pictures, sound.  You don't have to use your brain at all.  Uh-uh.  No work.  See... what you haven't figured out yet...  Is that while you're the boss everyplace else... I'm the one in charge here.  You... just think you are.  I wasn't as much fun as I thought it was going to be.  Well, you know those cold bitches that work in those stores and try to intimidate you?  It works.  I had a little problem in one store.  I wasn't dressed right. I don't know what to say.  I don't belong there.  Maybe I'll just go back to Bridget.  She was cool.      Please.        Not me!    Where'd you get your tie?  'Scume me.  Do you remember me?  I was in here yesterday.  Yeah.  That's right.  It's me. I want you to know something. You made me feel terrible. I wasn't dressed right and you said I didn't belong here.  Well, I do.  You're the one that was wrong, not me.  And I want to tell you something else.  I'm never gonna shop here again as long as I live.  Wheee!!!  Hi.  I thought maybe you'd like dinner.  Wait till you see what I have on underneath.  What about dinner?  You always been rich?  Seems like it.  I guess it's easy to get used to, huh?  Keep talkin'.  I like hearin'.  You still mad at'm?     What do you wear to polo?  You're really pushing it, bringing me here.  What id we run into someone I know?  You did.  Hi.    You could freeze ice on his wife's ass.  She anything like your ex?  This old thing?  I lead a very physical life.  I'm into walking.  I walk a lot.  Well, I do often spa there.  Edward, these women here, I don't think any of'm like the guys they're with.  They're just into it for the money.  I thought I was the pro.  These women make me feel like an amateur.  Hi.  I never thought stomping in grass could be so much fun.  Huh?  Oh... yeah.  S'okay? Uhm... how're... business things going.  Please, we hardly know each other.  No.  It's... it's not like that.  You don't know anything about me.        Yeah.  Thanks.  What?    You asshole!  I can't believe what a --!  Clean the slut up, take her out, huh?!  What are you trying to prove!?  I'm not a piece of meat for you to offer to your friends!  I've been with stinking old men who've made me want to puke but I've never had anyone make me feel as dirty as you did tonight.  Stuckey!  He wants an \"appointment\" with me after you leave.  You my pimp now or did he think that up on his own?  I want my fucking money.  I'm getting out of here.  I don't want anything more to do with you.  Your goddamned friend, he thinks the only reason I'm with you is for the money.    Pay me!  Before I pick up this chair and smash your face in.  Fuck off.  I'm not hurt.  It doesn't hurt you when somebody pisses on you, it just pissed you off.  You hurt me.  C'mon, Kit...  Do I look okay?  What's that?  Edward, I can't.  What if I lose it?  What if someone tries to steal it?  Plane?  Where are you taking me!?  Huh?  I've never been on a plane before.  Being quiet.  You ever been in love with anyone?  Sorry.  You're not paying me to ask you question like that.  You mean, besides Elvis? I'm a human being.  Sure.  Once. First time I ever ran away from home, I got as far as Atlanta. I met this boy.  He'd been with his parents on their way to Chicago.  They stopped at a gas station.  He went to the john. When he came back they'd split. We sorta started looking out for each other.  Aw, he was sweet. And boy, was he good looking, y'know, dark hair and eyes. The chicken hawks were on him all the time.  He hated that. Sometimes we'd find a safe place to crash nights and we'd curl up together and we'd talk about all these crazy things.  The two of us getting married someday. Having kids.  Stupid stuff.  My father found me.  Dragged me home.  I don't know why, he never seemed to like me much when I was there. 'Cept when he was drunk, then he liked me a whole lot. I made it back to Atlanta a year later.  Andy was gone.  Aw, but things sure look fine when you're sitting way up high.  If it's in Italian, how will I know what they're saying?  But don't they have it in English?      I more than liked it.  Did you?  Love you...  Mmm. Hi.  Here.  Let me.  Yeah, you've been pretty tough to take.    I'm sorry.  That's very sweet, Edward, and I know you mean it...  (shakes her head \"no,\"        Hello. Hi.  Hello.  Is Kit DeLuca there? When she comes in will you have her call Vivian Wells at 560-30000. Yes.  Okay.  What did you do to him?  Last time I saw him he was this strong guy.  Now he's beaten. And you liked him.  Right.  Business.  It's all just business to you. Him.  Me.  Your life. Everything's business.  Lo?  Me?  Yes, I'm glad you're clean but I've been calling and calling.  Who did you think?  Kit, I left that money for you days ago.  Kit...  Yeah... I know what you mean.  You think I fit here where they just about chew your food for you?    I know.  I stopped pretending and started liking it with him for real.    He wants to set me up in a place, give me some money.    I don't care about bucks. I might love this guy.  Edward's not back.  I thought he was with you.  No.  I think it's great.    Get out!  Are you crazy?  Why do guys always know how to hit a woman?  Right across the cheek, wham, so it feels like your eye is gonna explode.  What do they do, take you all aside in high school and show you how? It pisses me off!  Right. You're quite the Sir Galahad today, aren't ya'? I heard what you did with Kross.       Aw, don't... no...  I do.  I do want to.  That's why I'm leaving. That's what you given me, see? I know what I want now.  I want a guy like you for real.  Not because you buy me things and give me money.  The nicest thing you ever done for me is hold my hand. You gonna give me that?  I didn't think so.  It's not your fault.  You're right.  Kit's right. But I want the fairy tale.  Thanks.  I'll be out front in a minute. I got a cab comin'.  Hi, Barney!  Look I just wanted to say goodbye.  Yeah, well, I check out today.     Yes. 1312.  It's a big apartment building.     I'll be okay.  I'm home.  Thank you.  Yeah, it's me.     Get a job and probably go back to school.  Figure out what I'm gonna be.  School, school.  Regular.  I used to get pretty good grades in school, you know.  Want a pair of boots?  You sure you won't come with me?  Couple a hours.  Cool your jets a second. Here's some money.  I want to.  For food, got it? Eat something before the wind blows you away.                You are really lost this time.",
        "Ward": "It's unacceptable.  Draymen Heux has offered me seventy-five in the pool at sixteen and a half.  I can secure the other half personally.  You have until tomorrow morning to make me a better offer.  The meeting is over, gentlemen.  Maybe I should have made it rhyme.    Gentlemen, enjoy the party.  The magician's wonderful.    We're about to find out.  Go on. Take care of your guests.          Wouldn't miss it. I want this done fast and easy. No slip-ups.  I want to be back in New York by Saturday.  Got it?  Give me your car keys, will you, I'm going back to my hotel.  Apologize to Elizabeth for me.     No.  Love this car!  Is it new?    What's that?  Uh, no.  How do I get to Beverly Hills?  Yes.    Good.  Can you tell me how to get to Beverly Hills?  That's ridiculous.  Why don't you just do it out of the kindness of your heart?  Sit-and-spin. Alright... why not?    (as he grinds the  Not exactly.  If you can figure it out, be my guest.  Very good.  You're obviously mechanical.  New York.  Hotel.  Regent Beverly Wilshire.  I bet you know it.  What's your name?  You like being a hooker, Vivian?  So do day jobs.  Must be dangerous.  Hooking.  Very good.  You ought to have that printed up on your business card.  Sorry.  If I did, I didn't mean to.  Ugly habit, biting your nails.  What do you charge for company, Vivian?  For the whole night?  You're joking.  Neither do I. A hundred bucks an hour though. That's pretty stiff.  Vivian, how much to put up with me for the entire night?  Try me.  Fine.  Edward.  My name is Edward.  Get in.  This side.  You know how to drive a stick?  Then let's go.  It's worth 300 just so I don't have to drive.  My raincoat's in the back.  Put it on.  You may feel more comfortable. This is not the kind of place that rents rooms by the hour.  Every place has hookers, but if this hotel has hookers, they don't look like they're...  Exactly.  Good evening.  Penthouse.           Want to know something?  I don't quite know.  I hadn't planned this.    Fair enough.  Let's talk some more first.      Sounds like you've known a lot of lawyers.  Champagne.  Where would we like it?  Here'll be fine.  I think he wanted you to tip him.  I have both.  They should be.  They're both good at it.  My ex-wife lives in London in what used to be my home. My girlfriend is in New York moving out of my apartment even as we speak.  Cheers.  It's a very good year.  Try a strawberry.  Because they bring out the flavor of the champagne.  Vivian... the meter's running... cooperate.    Yes...    It's open.    I want to.  I'll see him alone.  Everyone knows you're my muscle.  We'll make it social.  Tell Kross I'll meet him for dinner.  Tonight if you can arrange it.  Bill, we're businessmen, not the damn mafia.  I'll see you in the office.  By the way, about your car...    Good morning.  No hurry.  Would you like some breakfast?  Did you sleep well?  Occupational hazard?  I took the couch.  I had some work to do. About last night...  Mmm, I could tell.  I'd say you give a good dollar value.  Do you ever... enjoy it?  No?  Why's that?  I buy companies.  The one I'm buying this week will cost around 150 million.    By breaking up a company's assets --  Vivian --  Assets are anything of value a company owns.  Sometimes the pieces are worth more than the whole.  By selling them off, I make a profit.  Not... quite.  Where'd you learn to do this?  Don't drown.      I'm here.  I have one.  All right.  How much for the week?  I'm in town until Saturday.  Do-you-want-to-stay-here- for-the-week?  Of course.  How much?  Vivian, may I point out five more nights at three hundred a night is only 1,500.  All right, two thousand.  Done.  I'm not just talking about sex.  Three thousand for five days. And Vivian, I will let you go.  I'll be out most of the day.  I want you to go out and buy some decent clothes.  Nothing too flashy, not too sexy. Conservative.  Understand?  Think again.  I'm taking you out to an important dinner with me tonight.  Probably.  What's that long building over there?  Not with those smokestacks it's not.  You what?  Don't bother.  We don't have the time to bring someone new up to speed. Besides... You've already impressed everyone you need to, haven't you?  I want our lawyers to check into the toxic waste licences on them right away.  I want to know if the permits are still valid and what kind of limits are on them.  What time's diner tonight?  No one you know.  Never answer the phone.  Ever.  Did you buy some clothes?  Just one?  Christ... I hope it's appropriate.  Let's hope so.  You'll get some more clothes tomorrow.  I'll be pushed for time so meet me in the hotel lobby at seven forty-five sharp.  Got it?  This isn't a date.  The Rex.  I think you'll approve.  Thank you very much.  I thought I told you not to answer the phone.  Of course, yes.  If you'll excuse me just a moment --  My what?  I think we both know she's not my niece.  Does this hotel have any problem with that?  Thank you.  I'm sorry.  Please don't patronize me, Mr. Kross.  Our ages mean nothing here.  Twenty-five percent.  What do you suggest, Mr. Kross?  To get me in a mood to sell -- double what I paid.  But your company doesn't have enough capital right now to buy anything.  You're not getting any navy contracts.  But I do know.  I also know your lines of credit are over-extended. If I don't buy your company, someone else will... Ah, the escargot.  (leaning close to  Mr. Kross, I'm not here to sell you my stock.  On the contrary, I'm here to buy yours.  No.  What I have is a lot of money.      I would suggest that you and your board cooperate with me, rather than fight a battle you don't have the ammunition to win.  We can reach an understanding on this.  Do what you have to do.  I don't take it personally.    No.  Bring a check, please.  Thank you.  Upset.  No.  I never get upset about business.  Whether I liked him or not is irrelevant.  It's business. There's no emotion involved in business... if you want to survive.  That... is very good.  Television?  I have work to do.  Wake up, Vivian.  Time to shop.  I still don't understand why you only bought one dress.  Why not?  Was someone rude to you?  Vivian, you belong wherever you are.  I don't care how you were dressed, they were the ones who were wrong, not you.  People aren't going to respect you unless you respect yourself. The next time someone is rude to you, you stare at them right here.  It's an old trick I use, especially with bankers.  Works every time.  Will you try it?  Good.       Offer nine and a half.  Bring them back down to earth.  Someone's loaning it to him. Get on it right away.    I want the treatment plant licenses to be top priority right now.  Do it.    Come on, Bill, don't talk to me about how much money's involved. It's my money.  Get the bank on the phone for me.  Thank you.  I would. Nice.  Please.  Dinner can wait.  No.  Easier than learning how to be poor. My father's family was wealthy. When I was young there were cars and houses, private schools, nannies.  But then my father divorced my mother to marry another woman.  And he took his money with him.  Not much to tell.  I went to public school.  Went to university on scholarship.  Went to work for an investment firm. In eight years I owned it. My father was chairman of the board of the third company I ever went after.  I swallowed that company and shit out the pieces. One of the pieces was him.  He died a long time ago.  I think it's exciting.  I really doubt anyone here frequents Hollywood Boulevard.  Bill, I'd like you to meet Vivian.  He's good at what he does.      I'm sure that's true for some of them.    We just did.  The night I left your house, I was lost.  I was looking for directions.  Yes...  Vivian's in sales.  Why do you want to know?    She met him at dinner last night... I like this tie.  You're being ridiculous.  Christ, Bill, she's not a spy, she's a hooker.  I picked her up off Hollywood Boulevard.    Let's drop it, shall we?    You're awfully quiet.  You haven't said a word since the party.  Vivian, what the --  I don't know what you're talking about.  Would you please calm down.  Tell me what happened.  What was I supposed to do? I told the truth.  Why should the truth upset you?  It's not as if you're from a convent.  Can we talk about this?  Can you just try to calm down?  Vivian...  Fine.  I'm only here a couple of more days and I'm not going to spend them fighting with you.  I'll call you a cab.  If you want the clothes, pack them up.  Vivian... I'm sorry.  I wasn't prepared for questions about us. It was an idiotic and insensitive thing I did.  I should have known that it would hurt you.  I really am sorry.  I'll make it up to you.  Bill?  Stop panicking.  Kross isn't going anywhere and I don't need to spend the rest of the day watching his stock go down.  I'll be in the office tomorrow.  Goodbye, Bill.  Afternoon.    I don't want you to get too excited... these are on loan... however...  This is made for a princess. I think she'd approve of you wearing it tonight.  There. Come look.  Shush.  Of course you can.  You won't.  I'll guard them and you with my life.  Very good.  You don't want to go all the way to San Francisco in a limousine, do you?  I don't.  To meet some friends.  Rudolpho, a poet... Benoit, a landlord... Mimi, a flower maker...  The opera.  I'm glad you like it.  Now be quiet, I've really got to read these.  Vivian, what do you think you're doing?  Vivian.  I'm paying you to be you.  Be you. Have you?  Ever been in love with anyone?  What happened to him?  Some people say that opera is an acquired taste, but I don't believe it.  You can always tell when someone goes to the opera for the first time.  They either love it or hate it.  Those who love it will always love it; those who hate it might come to appreciate it, but they'll never truly love it.  Viv?  I really doubt if anyone here is going to try and grab it.  They all think you look very beautiful, Vivian.  I'll whisper some of the main parts of the story to you.  But you'll be surprised how much you understand.  The music conveys the story more powerfully than any words.  Vivian, don't be afraid of what you don't know.  That's the fun of it.  What am I?  I am a poet.  Not a man of wealth but one rich in dreams.  You have come to replace my vanished dreams.  I dwell now only in your eyes.  And now she asks Rudolpho if he still thinks her beautiful --  If you'd gone on about how much you liked it, I'm not sure I'd have believed you.  I know.  I'm glad.  Yes.  I've never enjoyed it more. Thank you.     Yes?  I'm up.  Why?  Give me twenty minutes.  Better get dressed.  We're having guests.    I have to go to New York tomorrow.  But I'll be back in Los Angeles. Soon.  I'd like to see you again. I thought we could work out something... An arrangement.  I'll get you an apartment, buy you a car --  What is it?  It wouldn't be like that.  I want to get you off the street.  You'll have a different kind of life. What's wrong with that?  Vivian, I've thought about this a lot.  This is the best solution.  Vivian, life's not a fairy tale.  I've never treated you like a whore.  How are you, Mr. Kross.  Expected... offer.    Excuse me, please?  What do you mean?  Vivian, I want you to listen to me.  The man realized that it would be better for his future and his son's future, if he cooperated.  It's not your concern.  It's... business, that's all.  Yes.  The man made a business decision.  It's what I do for a living. It's how I make money.  I'll be back in a few hours. We'll talk about this later.  We'll continue this down at the office.  What?  Who indeed...  Stop.  For just a moment. Mr. Kross, I'd like to ask you a few questions before you sign. You realize that you're a target. If you weren't mine, you'd be someone elses, correct?  If you had a... reprieve, what would do?  Let him answer.  How?  I suppose you'd find out soon enough that you have assets you presently don't seem aware of, wouldn't you?  The waste processing licenses at that abandoned shipyard of yours, you'd certainly find out about that.  I suppose you'd use them as collateral on new loans, wouldn't you?  This time I imagine you would, yes. Hmm... With all this in mind, Mr. Kross, I can't logically make a formal bid on your company, can I?  You're very right.  I think the best thing we could all do is go home.  Have a good day, gentlemen.  No... take the car back to the hotel.  I need to walk.  I think I broke my hand. You're fired.  And I don't like what we've become.  I'll cover any losses you have on this one.  Now get out, you asshole!  Yes.  (to himself, almost  Not all men hit.  And no one is going to hit you anymore.  It was a business decision.  I got tired of hating my father.  It felt good.  You're packing.  Stay with me tonight.  Not because you're being paid to. Stay with me because you want to.  Vivian...  (turning from the  Yes.  She go.  Yes.  I'm looking for a girl, Vivian, young, dark hair, big eyes...?  She's mouthy.  Sort of difficult...?",
        "Bridget": "You must be Vivian.  Let's look at you...  Where are you from, dear?  No wonder.  For starts, you should know that hot pants are horrid, even when you do have the legs to carry them off.  What are your plans while you're in town?  You'll want a cocktail dress then.  Turn.  You have a beautiful figure.  A little too out in the open but simply lovely.  Size six? Do you need shoes?    Your uncle will like this.  They never are, dear.",
        "Howard": "",
        "Edward": "It's unacceptable.  Draymen Heux has offered me seventy-five in the pool at sixteen and a half.  I can secure the other half personally.  You have until tomorrow morning to make me a better offer.  The meeting is over, gentlemen.  Maybe I should have made it rhyme.    Gentlemen, enjoy the party.  The magician's wonderful.    We're about to find out.  Go on. Take care of your guests.          Wouldn't miss it. I want this done fast and easy. No slip-ups.  I want to be back in New York by Saturday.  Got it?  Give me your car keys, will you, I'm going back to my hotel.  Apologize to Elizabeth for me.     No.  Love this car!  Is it new?    What's that?  Uh, no.  How do I get to Beverly Hills?  Yes.    Good.  Can you tell me how to get to Beverly Hills?  That's ridiculous.  Why don't you just do it out of the kindness of your heart?  Sit-and-spin. Alright... why not?    (as he grinds the  Not exactly.  If you can figure it out, be my guest.  Very good.  You're obviously mechanical.  New York.  Hotel.  Regent Beverly Wilshire.  I bet you know it.  What's your name?  You like being a hooker, Vivian?  So do day jobs.  Must be dangerous.  Hooking.  Very good.  You ought to have that printed up on your business card.  Sorry.  If I did, I didn't mean to.  Ugly habit, biting your nails.  What do you charge for company, Vivian?  For the whole night?  You're joking.  Neither do I. A hundred bucks an hour though. That's pretty stiff.  Vivian, how much to put up with me for the entire night?  Try me.  Fine.  Edward.  My name is Edward.  Get in.  This side.  You know how to drive a stick?  Then let's go.  It's worth 300 just so I don't have to drive.  My raincoat's in the back.  Put it on.  You may feel more comfortable. This is not the kind of place that rents rooms by the hour.  Every place has hookers, but if this hotel has hookers, they don't look like they're...  Exactly.  Good evening.  Penthouse.           Want to know something?  I don't quite know.  I hadn't planned this.    Fair enough.  Let's talk some more first.      Sounds like you've known a lot of lawyers.  Champagne.  Where would we like it?  Here'll be fine.  I think he wanted you to tip him.  I have both.  They should be.  They're both good at it.  My ex-wife lives in London in what used to be my home. My girlfriend is in New York moving out of my apartment even as we speak.  Cheers.  It's a very good year.  Try a strawberry.  Because they bring out the flavor of the champagne.  Vivian... the meter's running... cooperate.    Yes...    It's open.    I want to.  I'll see him alone.  Everyone knows you're my muscle.  We'll make it social.  Tell Kross I'll meet him for dinner.  Tonight if you can arrange it.  Bill, we're businessmen, not the damn mafia.  I'll see you in the office.  By the way, about your car...    Good morning.  No hurry.  Would you like some breakfast?  Did you sleep well?  Occupational hazard?  I took the couch.  I had some work to do. About last night...  Mmm, I could tell.  I'd say you give a good dollar value.  Do you ever... enjoy it?  No?  Why's that?  I buy companies.  The one I'm buying this week will cost around 150 million.    By breaking up a company's assets --  Vivian --  Assets are anything of value a company owns.  Sometimes the pieces are worth more than the whole.  By selling them off, I make a profit.  Not... quite.  Where'd you learn to do this?  Don't drown.      I'm here.  I have one.  All right.  How much for the week?  I'm in town until Saturday.  Do-you-want-to-stay-here- for-the-week?  Of course.  How much?  Vivian, may I point out five more nights at three hundred a night is only 1,500.  All right, two thousand.  Done.  I'm not just talking about sex.  Three thousand for five days. And Vivian, I will let you go.  I'll be out most of the day.  I want you to go out and buy some decent clothes.  Nothing too flashy, not too sexy. Conservative.  Understand?  Think again.  I'm taking you out to an important dinner with me tonight.  Probably.  What's that long building over there?  Not with those smokestacks it's not.  You what?  Don't bother.  We don't have the time to bring someone new up to speed. Besides... You've already impressed everyone you need to, haven't you?  I want our lawyers to check into the toxic waste licences on them right away.  I want to know if the permits are still valid and what kind of limits are on them.  What time's diner tonight?  No one you know.  Never answer the phone.  Ever.  Did you buy some clothes?  Just one?  Christ... I hope it's appropriate.  Let's hope so.  You'll get some more clothes tomorrow.  I'll be pushed for time so meet me in the hotel lobby at seven forty-five sharp.  Got it?  This isn't a date.  The Rex.  I think you'll approve.  Thank you very much.  I thought I told you not to answer the phone.  Of course, yes.  If you'll excuse me just a moment --  My what?  I think we both know she's not my niece.  Does this hotel have any problem with that?  Thank you.  I'm sorry.  Please don't patronize me, Mr. Kross.  Our ages mean nothing here.  Twenty-five percent.  What do you suggest, Mr. Kross?  To get me in a mood to sell -- double what I paid.  But your company doesn't have enough capital right now to buy anything.  You're not getting any navy contracts.  But I do know.  I also know your lines of credit are over-extended. If I don't buy your company, someone else will... Ah, the escargot.  (leaning close to  Mr. Kross, I'm not here to sell you my stock.  On the contrary, I'm here to buy yours.  No.  What I have is a lot of money.      I would suggest that you and your board cooperate with me, rather than fight a battle you don't have the ammunition to win.  We can reach an understanding on this.  Do what you have to do.  I don't take it personally.    No.  Bring a check, please.  Thank you.  Upset.  No.  I never get upset about business.  Whether I liked him or not is irrelevant.  It's business. There's no emotion involved in business... if you want to survive.  That... is very good.  Television?  I have work to do.  Wake up, Vivian.  Time to shop.  I still don't understand why you only bought one dress.  Why not?  Was someone rude to you?  Vivian, you belong wherever you are.  I don't care how you were dressed, they were the ones who were wrong, not you.  People aren't going to respect you unless you respect yourself. The next time someone is rude to you, you stare at them right here.  It's an old trick I use, especially with bankers.  Works every time.  Will you try it?  Good.       Offer nine and a half.  Bring them back down to earth.  Someone's loaning it to him. Get on it right away.    I want the treatment plant licenses to be top priority right now.  Do it.    Come on, Bill, don't talk to me about how much money's involved. It's my money.  Get the bank on the phone for me.  Thank you.  I would. Nice.  Please.  Dinner can wait.  No.  Easier than learning how to be poor. My father's family was wealthy. When I was young there were cars and houses, private schools, nannies.  But then my father divorced my mother to marry another woman.  And he took his money with him.  Not much to tell.  I went to public school.  Went to university on scholarship.  Went to work for an investment firm. In eight years I owned it. My father was chairman of the board of the third company I ever went after.  I swallowed that company and shit out the pieces. One of the pieces was him.  He died a long time ago.  I think it's exciting.  I really doubt anyone here frequents Hollywood Boulevard.  Bill, I'd like you to meet Vivian.  He's good at what he does.      I'm sure that's true for some of them.    We just did.  The night I left your house, I was lost.  I was looking for directions.  Yes...  Vivian's in sales.  Why do you want to know?    She met him at dinner last night... I like this tie.  You're being ridiculous.  Christ, Bill, she's not a spy, she's a hooker.  I picked her up off Hollywood Boulevard.    Let's drop it, shall we?    You're awfully quiet.  You haven't said a word since the party.  Vivian, what the --  I don't know what you're talking about.  Would you please calm down.  Tell me what happened.  What was I supposed to do? I told the truth.  Why should the truth upset you?  It's not as if you're from a convent.  Can we talk about this?  Can you just try to calm down?  Vivian...  Fine.  I'm only here a couple of more days and I'm not going to spend them fighting with you.  I'll call you a cab.  If you want the clothes, pack them up.  Vivian... I'm sorry.  I wasn't prepared for questions about us. It was an idiotic and insensitive thing I did.  I should have known that it would hurt you.  I really am sorry.  I'll make it up to you.  Bill?  Stop panicking.  Kross isn't going anywhere and I don't need to spend the rest of the day watching his stock go down.  I'll be in the office tomorrow.  Goodbye, Bill.  Afternoon.    I don't want you to get too excited... these are on loan... however...  This is made for a princess. I think she'd approve of you wearing it tonight.  There. Come look.  Shush.  Of course you can.  You won't.  I'll guard them and you with my life.  Very good.  You don't want to go all the way to San Francisco in a limousine, do you?  I don't.  To meet some friends.  Rudolpho, a poet... Benoit, a landlord... Mimi, a flower maker...  The opera.  I'm glad you like it.  Now be quiet, I've really got to read these.  Vivian, what do you think you're doing?  Vivian.  I'm paying you to be you.  Be you. Have you?  Ever been in love with anyone?  What happened to him?  Some people say that opera is an acquired taste, but I don't believe it.  You can always tell when someone goes to the opera for the first time.  They either love it or hate it.  Those who love it will always love it; those who hate it might come to appreciate it, but they'll never truly love it.  Viv?  I really doubt if anyone here is going to try and grab it.  They all think you look very beautiful, Vivian.  I'll whisper some of the main parts of the story to you.  But you'll be surprised how much you understand.  The music conveys the story more powerfully than any words.  Vivian, don't be afraid of what you don't know.  That's the fun of it.  What am I?  I am a poet.  Not a man of wealth but one rich in dreams.  You have come to replace my vanished dreams.  I dwell now only in your eyes.  And now she asks Rudolpho if he still thinks her beautiful --  If you'd gone on about how much you liked it, I'm not sure I'd have believed you.  I know.  I'm glad.  Yes.  I've never enjoyed it more. Thank you.     Yes?  I'm up.  Why?  Give me twenty minutes.  Better get dressed.  We're having guests.    I have to go to New York tomorrow.  But I'll be back in Los Angeles. Soon.  I'd like to see you again. I thought we could work out something... An arrangement.  I'll get you an apartment, buy you a car --  What is it?  It wouldn't be like that.  I want to get you off the street.  You'll have a different kind of life. What's wrong with that?  Vivian, I've thought about this a lot.  This is the best solution.  Vivian, life's not a fairy tale.  I've never treated you like a whore.  How are you, Mr. Kross.  Expected... offer.    Excuse me, please?  What do you mean?  Vivian, I want you to listen to me.  The man realized that it would be better for his future and his son's future, if he cooperated.  It's not your concern.  It's... business, that's all.  Yes.  The man made a business decision.  It's what I do for a living. It's how I make money.  I'll be back in a few hours. We'll talk about this later.  We'll continue this down at the office.  What?  Who indeed...  Stop.  For just a moment. Mr. Kross, I'd like to ask you a few questions before you sign. You realize that you're a target. If you weren't mine, you'd be someone elses, correct?  If you had a... reprieve, what would do?  Let him answer.  How?  I suppose you'd find out soon enough that you have assets you presently don't seem aware of, wouldn't you?  The waste processing licenses at that abandoned shipyard of yours, you'd certainly find out about that.  I suppose you'd use them as collateral on new loans, wouldn't you?  This time I imagine you would, yes. Hmm... With all this in mind, Mr. Kross, I can't logically make a formal bid on your company, can I?  You're very right.  I think the best thing we could all do is go home.  Have a good day, gentlemen.  No... take the car back to the hotel.  I need to walk.  I think I broke my hand. You're fired.  And I don't like what we've become.  I'll cover any losses you have on this one.  Now get out, you asshole!  Yes.  (to himself, almost  Not all men hit.  And no one is going to hit you anymore.  It was a business decision.  I got tired of hating my father.  It felt good.  You're packing.  Stay with me tonight.  Not because you're being paid to. Stay with me because you want to.  Vivian...  (turning from the  Yes.  She go.  Yes.  I'm looking for a girl, Vivian, young, dark hair, big eyes...?  She's mouthy.  Sort of difficult...?",
        "Lewis": "",
        "Philip": ""
    },
    "imdb_rating": "7.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNjk2ODQzNDYxNV5BMl5BanBnXkFtZTgwMTcyNDg4NjE@._V1_QL75_UX380_CR0,6,380,562_.jpg",
    "description": "Replete with extreme wealth and suave good looks, Edward Lewis could seemingly have any woman he wants, a committed significant other needed on his arm at social events to further how he makes his money as a corporate raider, but since he focuses more on his corporate-raiding pursuits with his lawyer of 10 years and partner-in-crime Philip Stuckey than any woman, every significant other he's had in his life has felt neglected and eventually left him, the fact of which he is just realizing. In Beverly Hills, still in need of a woman on his arm as he and Philip work toward taking over a company owned by the increasingly insolvent James Morse, he decides, from a chance encounter, to hire Hollywood Boulevard hooker Vivian Ward as his escort for the week. It makes sense: a professional who would be committed to the work without having any relationship issues after the week is done. Beyond their chance encounter, he also makes this decision because she surprises him about how unhookerish she is in certain respects. Vivian, relatively new to Los Angeles and the business, must still look and act the part, with Edward, beyond giving her money, leaving her largely to her own devices to do so. She finds a somewhat-unlikely Henry Higgins in Barney Thompson, manager of the Beverly Wilshire Hotel where Edward is staying. Barney draws that fine line of keeping the hotel's upscale clients happy while maintaining the posh decorum of the upper class, which does not include people to the hotel looking for rooms with hourly rates. As Barney and his associates are able to transform Vivian into a Cinderella, the questions become whether Vivian can go back to her Hollywood Boulevard life and whether she does have her Prince Charming beyond this week in the form of Edward (or anyone else) who truly does see her as Cinderella as opposed to a Hollywood Boulevard streetwalker.Huggo",
    "name": "Pretty Woman",
    "genres": [
        "Comedy",
        "Romance"
    ]
}