{
    "filename": "Psycho_script.txt",
    "imdb_id": "tt0054215",
    "imdb_url": "https://www.imdb.com/title/tt0054215",
    "characters": [
        "Complete credited cast:",
        "Highway Patrol Officer",
        "Dr. Fred Richman",
        "Mrs. Chambers",
        "Tom Cassidy",
        "George Lowery",
        "Sam Loomis",
        "Sheriff Al Chambers",
        "Lila Crane",
        "Caroline (as Pat Hitchcock)",
        "Marion Crane",
        "California Charlie",
        "Norman Bates",
        "Det. Milton Arbogast"
    ],
    "dialogues": {
        "Mrs.": "Oh?   You didn't! (a cross look up at the bell It's tinkerbell. (a quick smile at Lila Al wants to be sure he'll hear it if anyone rings it in the middle of the night.  Well come on in, at least!  As she opens the door wide,   Albert! (a tiny wait, a smile as Sam and Lila enter Al Chambers!  Sam is about to close the door behind him. Mrs. Chambers motions for him not to, scurries across the hall, leans outside, presses the doorbell. The RING within the house is even more shattering. She closes the door, starts to the stairway, pauses as the SOUNDS of movement above COME OVER  Customers!  SHERIFF CHAMBERS comes down the stairs, in a bathrobe which matches his wife's. He is a tall, narrow man with a face originally destined for Mount Rushmore. He nods at Sam, looks at him with wide-awake eyes and a no-nonsense concern.    Let's go out back and have some coca while the men are talking.   Mary is Lila's sister?    Bates' Motel.  He has a mind like a mechanical brain and the more information you feed it... Go on, Sam.    Norman took a wife?    Why don't you call Norman and let him say just what happened, if he give the man a hot lead and he did just scooted off... it'll make the girl feel better, Albert.   Recluse. Kinder word.    Florrie, the Sheriff wants you to connect him with the Bates Motel.  She hands the receiver to the Sheriff. He takes it, reluctantly, listens to the dim sound of RINGING on the other end. After a moment:   Arbogast.   Barefaced.   I helped Norman pick out the dress she was buried in. Periwinkle blue.   Norman found them dead together.  In bed.    Maybe you saw Mary!   He's already been.   Have you two had breakfast?   It's Sunday. Come over and do the reporting at the house, 'round dinner time. Make it nicer. You too, Sam.  She smiles brightly, as if having invited them over to discuss this year's charity fandango, takes the  Sheriff's arm, starts away. The Sheriff nods as he goes.  Sam and Lila are alone now, at the curb, before the deserted chapel. For a long moment they just stand there, their faces as gray and overcast as the sky.    A close of her face, She appears to be watching and enjoying the fight. Over the shot, the SOUNDS of the struggle, the screams of Norman.",
        "Chambers": "Oh?   You didn't! (a cross look up at the bell It's tinkerbell. (a quick smile at Lila Al wants to be sure he'll hear it if anyone rings it in the middle of the night.  Well come on in, at least!  As she opens the door wide,   Albert! (a tiny wait, a smile as Sam and Lila enter Al Chambers!  Sam is about to close the door behind him. Mrs. Chambers motions for him not to, scurries across the hall, leans outside, presses the doorbell. The RING within the house is even more shattering. She closes the door, starts to the stairway, pauses as the SOUNDS of movement above COME OVER  Customers!  SHERIFF CHAMBERS comes down the stairs, in a bathrobe which matches his wife's. He is a tall, narrow man with a face originally destined for Mount Rushmore. He nods at Sam, looks at him with wide-awake eyes and a no-nonsense concern.    Let's go out back and have some coca while the men are talking.   Mary is Lila's sister?    Bates' Motel.  He has a mind like a mechanical brain and the more information you feed it... Go on, Sam.    Norman took a wife?    Why don't you call Norman and let him say just what happened, if he give the man a hot lead and he did just scooted off... it'll make the girl feel better, Albert.   Recluse. Kinder word.    Florrie, the Sheriff wants you to connect him with the Bates Motel.  She hands the receiver to the Sheriff. He takes it, reluctantly, listens to the dim sound of RINGING on the other end. After a moment:   Arbogast.   Barefaced.   I helped Norman pick out the dress she was buried in. Periwinkle blue.   Norman found them dead together.  In bed.    Maybe you saw Mary!   He's already been.   Have you two had breakfast?   It's Sunday. Come over and do the reporting at the house, 'round dinner time. Make it nicer. You too, Sam.  She smiles brightly, as if having invited them over to discuss this year's charity fandango, takes the  Sheriff's arm, starts away. The Sheriff nods as he goes.  Sam and Lila are alone now, at the curb, before the deserted chapel. For a long moment they just stand there, their faces as gray and overcast as the sky.   You two can go on home if you like. (a sympathetic look at Lila Making that statement was enough for one night.   If anybody gets any answers, it'll be the fellow talking to him now... the Psychiatrist. Even I couldn't reach Norman... and he knows me.  You warm enough, Miss?  Lila is about to answer, when she sees someone come into the room and rises anxiously. Sam and Sheriff Chambers turn, follow her gaze.    And the forty thousand dollars?  Who got that?",
        "Tom": "...They tell you what its ingredients are and how it's guaranteed to exterminate any insect in the world, but they do not tell you whether or not it's painless. And I say insect or man, death should always be painless.  CAMERA, by this has reached the front door of the hardware store and we now see a girl standing just inside the door. She is an attractive girl with a rather definite manner, a look of purposefulness. She carries a handbag and a small overnight case. She is Mary's sister, LILA CRANE.  Bob Summerfield has noticed Lila, smiles brightly at her, gives her an I'll-be-with-you-in-a-moment nod.  Lila starts to walk toward the counter, never taking her eyes off Bob. As she approaches, she asks quietly:   All I can do is hope if it isn't painless, it's quick!  She speaks \"quick\" with a kind of delicious bite, nods happily, goes on out of the store. Sam is now staring apprehensively at Lila.",
        "Cassidy": "Wow! Hot as fresh milk! You girls should get your boss to air-condition you up. He can afford it today.  Lowery flashes an embarrassed smile at Mary, tries to lead Cassidy toward the private office.   Tomorrow's the day! My sweet little girl... (laughs as Mary looks up at him Not you, my daughter!  A baby, and tomorrow she stands up there and gets her sweet self married away from me!  I want you to look at my baby. Eighteen years old... and she's never had an unhappy day in any one of those years!   Mary glances, cannot bring herself to smile or make some remark, continues sorting out the deed copies, tries to ignore the man's hot-breath closeness.    You know what I do with unhappiness? I buy it off! You unhappy?   I'm buying this house for my baby's wedding present. Forty thousand dollars, cash! Now that ain't buying happiness, that's buying off unhappiness! That penniless punk she's marryin'...  Probably a good kid... it's just that I hate him.  Yup! Forty thousand, says here...  Casharoonie!  He takes out of his inside pocket, two separate bundles of new $100 bills and throws them onto the desk, under Mary's nose. Caroline's eyes go wide at the sight of the glorious green bundles of bills, and she comes close to the desk. Cassidy leans terribly close to Mary, flicks through the bills, laughs wickedly.   I never carry more than I can afford to lose!  Count 'em!   So what? It's my private money! (laughs, winks, elbows Lowery And now it's yours.    I don't! That's how I'm able to keep it!    Speakin' of feeling good, where's that bottle you said you had in your desk... (laughs, as if having given away Lowery's secret Oops! (to Mary, patting her arm Usually I can keep my mouth shut!  He rises, reels toward Lowery's office, pauses, turns, speaks to Mary, meaningfully.   Honest. I can keep any private transaction a secret... any pri.... (stopped by Mary's cold gaze Lowery! I'm dyin' of thirstaroonie!  Lowery starts after him, pauses, turns to Mary. Cassidy has gone into Lower's office.   You go right home!  Me and your boss are going out to get ourselves a little drinkin' done!  Right?   You need a week-end in Las Vegas... playground of the world!    Only playground that beats Las Vegas!  Mary goes back out into the outer office, closes door.   (undrunk, sharp with rage Well I ain't about to kiss off forty thousand dollars! I'll get it back and if any of it's missin' I'll replace it with her fine soft flesh! I'll track her, never you doubt it!   You checked with the bank, no?  They never laid eyes on her, no?  You still trustin'? Hot creepers, she sat there while I dumped it out... hardly even looked at it, plannin' and... and even flirtin' with me...!  A look of revulsion makes Mary close her eyes.",
        "George": "",
        "Lowery": "A small, moderately successful office off the main street. A cab pulls up at the curb. We see Mary get out of cab, pay driver, cross pavement to the office door.   Mary, will you get those copies of the deed ready for Mr. Cassidy.  Cassidy pauses beside Mary's desk, hooks a haunch onto the desktop, smiles a wet smile at Mary.   Come on, Tom, my office is air- conditioned.    Tom... cash transactions of this size! Most irregular...    Suppose we just put this in the safe and then Monday morning when you're feeling good...    I don't even want it in the office over the weekend. Put it in the safe deposit box, at the bank, Mary. And we'll get him to give us a check on Monday - instead.  He starts quickly away when it looks like Cassidy is going to come and pull him bodily into the office. When the men are gone and the door is closed, Caroline picks up a bundle, smiles at it.   Come in.    Mary opens door, looks in. Cassidy is drinking from a large tumbler, winks at her without pausing in his drinking. Mary remains on threshold a moment, then crosses to the desk, talking as she goes.    Of course. You feeling ill?    Caroline...? Mary still isn't in?   Buzz me the minute she comes in.  Again Mary shakes her head, forces herself to stop hearing these \"invented\" scenes of her imagination.   Call her sister! If no one's answering at the house....   You better run out to the house. She may be... unable to answer the phone...   No! I haven't the faintest idea.  As I said, I last saw your sister when she left this office on Friday... she said she didn't feel well and wanted to leave early and I said she could. And that was the last I saw...  ...wait a minute, I did see her, an hour or so later, driving... (a pause, then with solemn fear Ah, I think you'd better come over here to my office. Quick.  Caroline, get Mr. Cassidy for me.   After all, Cassidy, I told you... all that cash... I'm not taking the responsibility... Oh, for heaven's sake, a girl works for you for ten years, you trust her! All right, yes, you better come over.   Hold on, Cassidy... I still can't believe... it must be some kind of a mystery... I can't...",
        "Sam": "Never did eat your lunch, did you.  Mary looks at his smile, has to respond, pulls him to her, kisses him. Then, and without breaking the kiss, she swings her legs over the side of the bed, toe-searches around, finds her shoes, slips her feet into searches them. And finally pulls away and sits up.   Call your boss and tell him you're taking the rest of the afternoon off. It's Friday anyway... and hot.    We could laze around here a while longer.   I've heard of married couples who deliberately spend occasional nights in cheap hotels. They say it...   You sure talk like a girl who's been married.   I'm sorry, Mary.  My old Dad used to say 'when you can't change a situation, laugh at it.' Nothing ridicules a thing like laughing at it.    The only girlish thing you have lost.   For what?   Okay. What do we do instead, write each other lurid love letters?   And I'm a working man! We're a regular working-class tragedy!    (interrupting, seriously You can't laugh at it, huh?   Sure. It's like laughing through a broken jaw, but...  He breaks off, his cheeriness dissolved, goes to the window, tries to raise the shade. It sticks. He pulls at it.  It comes down entirely, and the hot sun glares into the room, revealing it in all its shabbiness and sordidness as if corroborating Mary's words and attitude. Sam kicks at the fallen shade, laughs in frustration, grabs on to his humor again.   And besides, when you say I make tax- deductible excuses you make me out a criminal.   I wish I were. Not an active criminal but... a nice guy with the conscience of a criminal. (goes close to mary, touches her Next best thing to no conscience at all.   I can come down next week.   Not even just to see you, to have lunch... in public?   And after the steak... do we send Sister to the movies and turn Mama's picture to the wall?    All right.  She stares at him, surprised at his willingness to continue the affair on her terms, as girls are so often surprised when they discover men will continue to want them even after the sexual bait has been pulled in. Sam smiles reassuringly, places his hands gently on her arms, speaks with gentle and simple sincerity.   Mary, whenever it's possible, tax- deductible or not, I want to see deductible you. And under any conditions.  Even respectability.    I'm all for it! It requires patience and temperance and a lot of sweating- out... otherwise, though, it's only hard work.  But if I can see you, touch you even as simply as this... I won't mind.  He moves away and again the weight of his pain and problems crushes away his good humor. There is a quiet moment.   I'm fed up with sweating for people who aren't there. I sweat to pay off my father's debts... and he's in his grave... I sweat to pay my ex-wife alimony, and she's living on the other side of the world somewhere.   A couple of years and the debts will be paid off. And if she ever re- marries, the alimony stops... and then...   Yeah, but when you do... you'll swing.   And live with me in a storeroom behind a hardware store in Fairvale. We'll have a lot of laughs. When I send my ex-wife her money, you can lick the stamps.   You know what I'd like? A clear, empty sky... and a plane, and us in it... and somewhere a private island for sale, where we can run around without our... shoes on.  And the wherewithal to buy what I'd like. (he moves away, suddenly serious Mary, you want to cut this off, go out and find yourself someone available.    How can you even think a thing like that!   Hey, we can leave together can't we?      Sam is seated at his desk, writing a letter. Sequence  begins with CAMERA IN CLOSE, over Sam's shoulder, and we can read as mush as he has written of the letter. The letterhead reads \"Sam Loomis - Hardware,\" and the letter reads: \"Dearest right-as-always Mary: I'm sitting in this tiny back room which isn't big enough for both of us, and suddenly it looks big enough for both of us. So what if we're poor and cramped and miserable, at least we'll be happy! If you haven't come to your senses, and still want to...  CAMERA begins PULLING AWAY as Sam turns the sheet of paper over, continues backing away out of the small back room and heads, backwards, down the corridor, we see a young clerk, BOB SUMMERFIELD, Sam's assistant, standing behind the counter, a look of handsome patience on his face. He is waiting on a meticulous, elderly woman customer, who is holding and examining a large can of insecticide. As CAMERA PASSES:   Yes?    Sure...  Lila glances at the customer and the clerk, turns, starts toward the front of the store. Sam holds a moment, then follows. As he reaches her, she turns, her eyes studying him intently as she says:   Lila.   Is something wrong?   Here?   Where?   What's the matter?   What should I know?   No. I take it you don't either? (As Lila shakes her head How long?   And you thought she'd come up here, to me? If she had, what reason would she have for not calling you?    Well what do you think, we eloped or something? Or we're living in sin and...   I was getting to that!   Nothing! You're putting me on the defensive.   Bob? Run out and get yourself some lunch.   Run out and eat it.  Bob gets the message, goes out through the back way.  Sam goes closer to Lila, speaks with soft seriousness.   What thing?   What thing could we be in together?   Is Mary... in trouble?   Well why didn't she come to me... call me...?    Never mind my ego. Let's talk about Mary.  Their attention is distracted by a man who has strolled quietly into the room. He ignores them, walks past them, goes behind the counter, takes down a sign reading \"CLOSED FOR LUNCH,\" walks back to the door, closes door, hangs the sign across the door window, locks the door, turns to Sam and Lila, folds his arms, smiles a particularly unfriendly smile.   Who are you, friend?   What's your interest?   Somebody better tell me what's going on and tell me fast! I can take so much and then...   Why?   What are you talking about?  What is this?   She isn't!  A real look of anguish comes into Lila's face. And Arbogast studies it, then speaks.   Did you check in Phoenix... hospitals... maybe she had an accident... a hold-up...    I don't believe it.  Do you?   You might have doubted for say five minutes or so, Sister.  Lila turns from Sam, a flush of guilt and regret in her face. Arbogast looks at her, quiet sympathetically.   It was her boss' idea not to report it to the police?   He must have had a darn good reason for wanting them kept out of it... All that cash...   No.   How could I go away? I'm in debt up to my... (Smiles at the incongruity of his reply, then goes serious If she did steal that money...  It's hard to believe she did because it's hard to see why she would. Unless she had some wild idea that it would help me... us...   I didn't see her... and I didn't hear from her! Believe that!   You've led a charmed life.   Maybe we can handle it together. (He smiles encouragingly    I think she'll contact me if she contacts anybody. Why don't you stay here. When she shows up... or calls... be here.   She'll need both of us.    First rate hotel, fifty yards up the street. Come on. (as he reaches for the closed-for-lunch sign After we check you in we'll go to the drugstore and get you a sandwich. Then we'll come back here... and wait.  He hangs the sign on the door, ushers Lila out, closes door behind him.    Sometimes Saturday night has a lonely sound. Ever notice, Lila?   It's been three.    He'll be back. Let's sit still and hang on, okay?   Hundreds! Which one is your pet?   I feel better when you feel better.   You want to run out there, bust in on Arbogast and the sick old lady, shake her up and maybe spoil everything Arbogast's been building for the last three hours.   That wouldn't be a wise thing to do.   Arbogast said...    Got the number of the motel out on the old highway? Bates, I think.    And maybe pass Arbogast on the road?  Thanks.  He presses down the receiver, releases it, dials Bates'  Motel. The faint other-end ringing tones can be heard, repeatedly, annoyingly. He waits.    Probably on his way back right now.   (hangs up and picks up his jacket You'll never find it.  He starts for the door. Lila follows after him into the store.   Stay here.    I don't know...  One of us has to be here in case Arbogast's on the way.    Contemplate your... panic button.  He hurries down to the street door and out. CAMERA HOLDS on Lila as she stares after Sam. As she stands alone in the darkened store, all the hardware seems to take on sinister shapes.   Arbogast?   He didn't come back here?   No Arbogast. No Bates. And only the old lady at home...  A sick old lady unable to answer the door... or unwilling.   Maybe he got some definite lead. Maybe he went right on...   In a hurry.    Yes. I think he would have.  Lila goes quiet. Sam starts toward the back room, pauses at the doorway, turns. Lila has remained by the door, looking out at the street. She feels his pause, turns, and for a moment they share at each other across the darkened room.   Let's go see Al Chambers.   He's the Deputy Sheriff around here.  As he starts forward.   Our Deputy sleeps.   Nothing.  Just... all the lights out... must be asleep.   No. I'm just procrastinating.  People hate when the doorbell rings in the middle of the night.  Come on.  He gets out of cab, goes around to help Lila. She is already out. CAMERA FOLLOWS them up the small path to the front door. Sam presses the bell button. Both he and Lila are almost knocked over by the shocking, clanging, ear-splitting BLAST OF THE BELL within the house, a ring which sounds more like a fire alarm than a doorbell.  He tries to smile, fails. Lila doesn't even try. The downstairs hall light goes on and a moment later the door is unhesitatingly opened by MRS. CHAMBERS, a small, lively stick of a woman wrapped in a thick flannel robe and a corona of hospitality.   Sorry, Mrs. Chambers. I hate bothering you...   We have a problem.   I don't know where to start...  Except at the beginning.    This is Lila Crane, from Phoenix. She's been here for a few days, looking for her sister. There's a private detective helping... and, well, we got a call tonight, from this detective, saying he'd traced Mary...   Yes. He traced her to that motel, out on the old highway...   He traced her there and called us to say he was going to question Mrs. Bates...   No. An old woman, his mother.  That was early this evening. And we haven't seen or heard from him since. I went out to the motel, just got back. No one was in the office, and...   They thought she'd be coming to me.   Yes.    Everyone concerned thought... if they could get her to give back the money... they could avoid involving her with the police.   He was out when I was there. If he's back he probably isn't even in bed yet.   I've only been here five. Right now it feels like ten, but...    Was that all?   You mean that old woman I saw sittin' in the window wasn't Norman Bates' mother?   I'd know the difference between Mary and an old woman.   Yes! In the house behind the motel. I pounded and called but she... just ignored me.   We thought, if you didn't mind, we'd go out to the motel with you.   (To Sheriff, not a question You didn't find anything.   No mother.   Maybe I am the seeing-illusions type.   Want me to drop you at the hotel? Or you want to come over to the store?  Lila does not answer. They reach the truck. Lila looks directly at Sam as he helps her into the cab.   Neither will I.  He slams the door, hurries around truck, gets into driver's seat, starts motor. As the truck drives off,    For a moment, both are silent; Sam watching the road as if there were other cars on it, Lila staring at nothing in particular, except perhaps her own inner fear.   Of course we will.   Where'd you go to college?    She was willing to lick the stamps.  Lila looks quizzically at him, is too concerned to pursue it.   We were going to get married. Are going to get married!   This is the old highway.   Watch your tenses.   She always tries to be proper.  Sam slows the truck to a stop, sighs, starts to light up a cigarette. Lila looks questioningly and impatiently at him.   I'm going with you. But we'd better decide what we're going to say and do when we walk in...   You won't believe it...  But this will be the first time I've ever pulled one of those man- and-wife-renting-cabin capers!     (Unconsciously whispering I wonder where Norman Bates does his hermiting?   Come on.  He starts with her toward the path which leads to the old house. CAMERA PANS with them, and as they turn around the office corner, they see Norman coming down the path toward them. They pause and Norman pauses. He does not smile, nor speak. His usual grin and soft friendliness are gone; containment and impassivity lie in their place.    Just coming up to ring for you.   We'd hoped to make it straight to San Francisco, but we don't like the look of that sky. Looks like a bad day coming... doesn't it.  Norman walks past Sam, giving him the sort of quick, disapproving glance one gives a man who is obviously lying, goes onto the porch and into the office. Sam and Lila follow Norman.   Better sign in first, hasn't we?  Sam eyes scan the counter, looking for a registration book.   (Interrupting with a friendly cheerfulness Uh, uh! My boss is paying for this trip... ninety percent business... and he wants practically notarized receipts. I better sign in and get a receipt.  Norman stares at Sam, as if he'd like to yell at him, call him \"liar.\" Instead he reaches under the desk counter, brings out the registration book. Lila moves closer, studies the book as Sam signs in. Sam signs \"Joe and Mrs. Johnson.\"  The signature and city of \"Marie Samuels\" and after it, the notation \"Cabin One,\" can be clearly seen three registrations above Sam's.  When Sam has finished he closes book, hands it back to Norman. Norman does not take it, starts out from behind counter.   Haven't any.   First time I've seen it happen.  Check in any place in this country without bags, and you have to pay in advance.  Sam smiles as if at a funny remark, takes a bill out of his pocket.   That receipt...?  Norman goes reluctantly behind counter, lays down the key to cabin twelve, takes a receipt book out of the drawer under counter, starts to write. Lila steps up to the desk, picks up the key, quickly, starts out.   (To Norman, who is following Don't bother yourself... we'll find it.  He goes on down the porch, doesn't even glance at cabin one, walks quickly and catches up to Lila just as she reaches cabin twelve. CAMERA REMAINS with Norman, who is standing by the office door, looking after Sam and Lila, his face alert and no longer impassive. He waits a moment, after they have closed their cabin door, then crosses to the pickup truck. CAMERA MOVES with him. He studies the truck, then leans in through the driver's window, twists the registration card around, reads it.  It gives the correct name and address of Sam Loomis.  Norman comes back out of the window, glances once more toward cabin twelve, then at the old house. His suspicions are confirmed, and now there is the relaxation of relief in his face. He takes on a purposeful air, turns, strides up the path, up onto the porch of the house, opens the door, goes in.   I'm glad we didn't.  He pulls his eyes from the bed, crosses to the desk, sits wearily, lights a cigarette. Lila watches him for a moment, feels a real compassion, goes to the bed, sits on its edge, turns again and looks at Sam's back.   I know.  Do you think if something happened, it happened there?   How could we prove... (An almost hopeless laugh Well, if he opens a new motel on the new highway... say, a year from now...   What makes you sound so certain?   We'll start with Cabin One.  He goes to the door, opens it slightly, looks out, then, back to Lila:   If he sees us... we're just taking the air.  Lila goes to the door. He holds it open and she goes out.   Bates?  He waits, there is no response. He goes in and in a moment comes back out, closes the door, goes to Lila.  She has already opened the door of Cabin One and has started to enter.   Sorry.   What?   What is it?    Bates never denied Mary was here.   Do we simply ask him where he's hidden it?   You can't go up there.   Bates.  CAMERA STARTS TO PAN AWAY from them, moves slowly over the room, very slowly.   You won't be able to hold him still if he doesn't want to be held. And I don't like you going into that house alone, Lila.  CAMERA HAS PANNED clear across to the opposite wall now, and is moving up closer and closer to the tiny-flowered wall paper, finally closing in on one small rosebud.   All right. I'll find Bates and keep him occupied.  The eye moves away and there is a brief flash of light before the hole is covered, on the other side, by the wall-hung painting.    They are about to start out. Sam stops her again.   Wait a minute. If you get anything out of the mother...  Can you find your way back to town?  If you do get anything, don't stop to tell me.  Lila nods quickly, hurries to the door. Sam gets to it first, opens it a slight crack, looks out, then opens it wide enough for Lila and Himself to pass through.    Yes, matter of fact.  The wife's taking a nap and... I can never keep quiet enough for her... so I thought I'd look you up and... talk.   Fine.  Sam starts into the office. Just before going in, he glances down the long porch, sees Lila standing outside the door of cabin twelve, waves her a tiny \"all clear\" signal.   (Cheerfully, as if after a self-conscious pause I've been doing all the talking so far, haven't I?   I always thought it was the people who are alone so much who do all the talking when they get the chance. Yet there you are, doing all the listening!  You are alone here, aren't you? (As Norman does not reply It would drive me crazy.    Just an expression...  What I meant was... I'd do just about anything... to get away.  Wouldn't you?   I'm not saying you shouldn't be contented here, I'm just doubting that you are. I think if you saw a chance to get out from under... you'd unload this place...   And now that your mother's dead?  Norman snaps a sharp, fast, ugly look at him.    I didn't think so.    You look frightened. Have I been saying something frightening?   I've been talking about your mother... about your motel. How are you going to do it?   Buy a new one! In a new town! Where you won't have to hide your mother!   Where will you get the money to do that, Bates... or do you already have it... socked away... a lot of it...   ...Forty thousand dollars!   I bet your mother knows where the money is. And what you did to get it. And I think she'll tell us.  Something self-assured and confident in Sam's tone gives Norman a new, more terrified alarm. He turns his head, glances out the window at the old house. He looks back at Sam and there is terror in his voice.      It's regular. Okay?    Want to?   Why was he... dressed like that?",
        "Loomis": "",
        "Lila": "Sam?   Sam Loomis.   May I talk to you?   I'm Mary's sister.    Is Mary here?  Sam is mystified, and is also aware of the worried, hostile expression on Lila's face. He studies her for a quiet moment. Behind them is a display of various size carving knives.   I want to know if my sister is here.   With you.   I don't know where. In your store, somewhere in your town... anywhere.   Don't you know?  As Sam is about to speak, the Woman Customer comes sailing past, speaking as she goes and wearing a satisfied smile.   To begin with, where Mary is. Do you?   Last Friday. She left work, and home... I was in Tucson over the weekend... I haven't heard from her, not even a phone call.   A good reason, I suppose.   Mr. Loomis, you're so busy being defensive that you haven't even reacted to the most serious fact of all. Mary is missing.   What do you know about it?   Look, if you two are in this thing together, I don't care, it's none of my business... But I want to see Mary. I want her to tell me she's all right and it's none of my business. Then I'll go back to Phoenix and...  She stops, the anxiety and fear building up in her, her eyes beginning to fill with worried tears. Sam studies her for a moment, then turns and calls:   Huh?    I hate tears.    Yes.   Not that kind...  You men and your egos.   I don't know.   She was supposed to bank it, on Friday, for her boss. She didn't.  And no one has seen her since.   Sam, they don't want to prosecute, they just want the money back. It was all in cash...   Sam, if she's here...    Not even a hunch. Just hope.    I don't care if you do or... I want to see Mary... before she gets in any deeper...    Yes... I just... did. The moment they told me...   I just listened... and believed everything they told me. 'She stole the money.' 'We don't want to get her in trouble.' 'No don't bring the police in'...   No. The man whose money she... he talked so loud and fast, and I... I should've called the police.   I ought to call the police right now!   Why not? Sam, is she hiding here? Are you two planning to go away with the money?   She haven't even called you?   I need to... I need to believe something. This is the first time I've ever come up against anything I couldn't... understand.   No. I just think... anything can be explained. But Mary, doing a thing like this... I don't know how to handle...    I came flying up here expecting to get some explanation... for all I know, she may be trying to get in touch with me, at home. I'd better go home.   (A long study, her suspicion of him evaporating You want me to stay here?    Where... can I stay?   (unable to keep up small talk Sam. He said an hour. Or less.   Are we just going to go on sitting here?   You have an awfully nice habit, Sam.   Whenever I start contemplating the panic button, your back straightens up and your eyes get that God-looks- out-for-everybody look and... I feel better.   (a pause - then she rises Where's the old highway?   Yes.   Patience doesn't run in our family. Sam, I'm going out there!   An hour! Or less!  Sam stares at her, frowns in concern over her very real anxiety, goes to the phone, dials operator.   Sam! Why call when we can go?   Sam, I'm going.   Why can't I go out there with you?    Just wait here?    Sam.   Where could he have gone?   Without calling me?   Sam, he called me when he had nothing definite, nothing but a dissatisfied feeling. Don't you think he'd have called if he had anything...   Who's he?   Well?    Does that mean we can't...   No, thank you. It's my problem, too.   Yes.   (interrupting, anxiously Will you help us? I think something's wrong out there!   She left Phoenix a week ago yesterday. And no trace until...   Yes.    She stole some money.   Forty thousand dollars.   Mary had been there, one night, and had left.   He didn't mention the money.  What he said on the phone isn't important, is it?  He was supposed to come back after he spoke to the mother, and he didn't! That's what I want you to do something about!   Go out there! Find somebody, ask some questions!  I'm sorry if I seem over-anxious to you. I keep thinking... something's wrong. I have to know what!   He said he was dissatisfied... and was going back.   All right! Then call! At least, call!  Mrs. Chambers goes to phone, dials operator.   Please!   And he didn't go back? Didn't see the mother?  The Sheriff looks long at Lila, shakes his head sympathetically.   What difference does that...   Yes.   It must've been. Arbogast said so, too... and he said the young man wouldn't let him see her because she was ill!  The Sheriff stares at both of them, and when he finally speaks there is an almost inaudible tone or irony in his voice.    Did he say anything about my sister?   I still feel...   I don't know.   You're not.  Sam takes her arm, starts walking her up the street toward the spot where his pick-up truck is parked.  CAMERA FOLLOWS them.   I won't feel satisfied unless I got out there, Sam.    For a moment, both are silent; Sam watching the road as if there were other cars on it, Lila staring at nothing in particular, except perhaps her own inner fear.   I wonder if we'll ever see Mary again.   Alive.  Sam looks as if he'd like to say something humorous, something to cheer her. He cannot. He remains silent.   We lived together all our lives.  When we woke up one morning and found ourselves orphans, Mary quit college and got a job, so I could go to college.   I didn't. I got a job, too.  I wonder if that hurt her, my not letting her sacrifice for me?  Some people are so willing to suffer for you that they suffer more if you don't let them.   I wonder so many things about her now.  Why she never told me about you...  Funny, when you think there's an answer to everything, you think you know all the answers.   Do you know how I found out about you? I found one of your letters... it was a nice letter, Sam.   I suppose... when you were able to marry her she'd have presented you, all shiny and proper... she always tried to be proper.   Huh?   You going to wait here for me?   We're going to register. As man and wife. And get shown to a cabin... and then search every inch of that place, inside and... outside.   (A tiny smile, first in hours I believe it.  As truck starts to drive on,     Someone was at that window. I saw the curtain move.  Sam takes Lila's arm.   I'll start ahead.  Norman looks up, gazes her as she goes out door.   We should have asked for Cabin One... The one Mary was in.   We have to go into that cabin and search it, Sam... no matter what we're afraid of finding and no matter how much it may hurt.    Sam, if you owned a useless business like this motel... one you probably couldn't even sell...  what would you need to get away, to start a new business, somewhere else?  Forty thousand dollars?   There must be some proof that exists right now! Something that proves he got that money away from Mary... Some way!   Arbogast! Sam, he liked me... or felt sorry for me... and he was starting to feel the same about you. I heard it when he called... in his voice, a caring. He wouldn't have gone anywhere or done anything without telling us.  Unless he was stopped. And he was stopped, so he must have found out something!  Sam considers a moment, nods agreement, rises.   Hospital clean.   The bathroom. Look at how clean it is. The one in our cabin is clean... but this is clean!  Sam goes in, glances around, nods. Lila goes through the medicine cabinet, finds nothing but a glass and two tiny tabs of soap. Sam leans against the door-jamb, looks at the tub, the shower pipe above it. He continues to stare, more interested suddenly, as if bothered by some off-key evidence he can't put his finger on. Then he looks at the shower curtain rod.  And realizes there is no shower curtain. He frowns, is about to say something when Lila, who has been momentarily out of shot, interrupts.  Sam turns, CAMERA TURNS, and we see Lila is standing above the toilet bowl, a tiny piece of wet paper stuck to the tip of her right index finger.   It didn't get washed down. It's figuring... the kind you tear up and get rid of. (Extending her finger toward Sam Some figure has been added to or subtracted from... forty thousand.  Sam lifts the piece of paper off her finger, studies it, takes out his wallet, presses the wet scrap to his driver's license shield, puts it back in the wallet and puts the wallet away.   That's proof Mary was here!  It would be too wild a coincidence for somebody else to...    Yes.  But maybe this proves that Bates found out about the money.   Sam, that old woman, whoever she is. I think she told Arbogast something! And I want her to tell us the same thing!  She starts out of the bathroom. Sam takes hold of her arm, stops her.   Why not?   Let's find him. One of us can keep him occupied while the other gets to the woman.   I can handle a sick old woman.  Now we see that the rosebud has been cut out, that this is the reverse side of the hole Norman peeped through to watch Mary. And we see the pupil of Norman's eye now.    They are about to start out. Sam stops her again.    CAMERA ANGLES to include Lila and her point of view.  She watches Sam disappear into the office, waits until she hears the door close, then looks about for another way to reach the house. She sees the small alley at the end of this L of cabins, starts toward it.    Behind the motel Lila hesitates. She looks ahead.   Mrs. Bates?  There is quiet for a moment, then the door begins to open, and we see Lila. She stands on the threshold, looking in at the room, instantly disturbed by it, almost chilled, her expression indicating an impulse to close the door and go away from this room forever.  After a moment, she enters, leaving the door open behind her. CAMERA PULLS BACK AND AWAY and we now see the room as Lila sees it.  It is ornate, damask-and-mahogany, thick and warm and ripe, an olla podrida of mismated furnishings and bric-a-brac of the last century. The bed is four poster, but uncanoped; the dressing table is fancy and flounced with satin; there is a great chiffonier, a big-doored wardrobe, a large, oval, full- length pier-glass (this against the wall directly opposite the door), a satin recamier, an upholstered armchair by the window, a white marble fireplace, its grate cold but piled with ashes.  And there is in the room an unmistakably live quality, as if even though it is presently unoccupied, it has not been long vacated by some musty presence.  Lila glances at the bed. The damask coverlet is thrown over it, but it is not neat, there is the imprint of a body on it, a body which obviously has slept in a curled-up, womb- like position. Lila stares at it for a moment, up, then goes to the dressing table. Its top is scattered with boxes and jars of cosmetics and creams, traces of fresh powder, an opened bottle or perfume, a comb, and a brush with traces of hair in its bristles. Lila moves on, catches a glimpse of herself in the pier-glass, is startled, turns away, goes to the chiffonier, is about to open a drawer, sees the high wardrobe out of the corner of her eyes, goes to it, hesitantly. She opens one door. Fresh, clean, well pressed dresses hang neatly. Lila opens the other door. The sweaters and dresses and robes hang freely, none in moth-proof, storage- type bags. There is even a well-brushed collar of foxes. Along the floor of the wardrobe is a line of clean, polished shoes. Lila stares, then closes the door, turns, looks once again over the whole room, starts out,    Norman coming.   Mrs. Bates...?  Lila goes into the room.    Close on her face. She is dumb-struck. Her eyes are screaming.      I could stand something regular.  Sam smiles encouragingly, hands her the coffee. Sheriff Chambers ENTERS SHOT, gives Sam a container of coffee he has brought for him. Sam takes it, nods a thank you.  For a moment no one speaks. Lila looks badly shaken, Sam disheveled, but contained.   No. I'm all right. I'll feel better when all this is explained... if it can be.  Sam looks a question at Sheriff Chambers. Chambers shrugs doubtfully.    Did he kill my sister?   But my sister is...",
        "Crane": "",
        "Marion": "",
        "California": "",
        "Charlie": "",
        "Norman": "Dirty night.   (simply, almost cheerfully We have twelve vacancies. Twelve cabins, twelve vacancies.  They moved away the highway.   I knew you must have. No one stops here anymore unless they do.  He is behind the counter now, pushing forward the registration book.   But it's no good dwelling on our losses, is it.  We go right ahead lighting signs and following the formalities...  Would you sign, please.  Mary has placed her handbag on the counter. She takes the registration book, picks up the pen, is suddenly struck with the realization that she'd better use an alias. She writes the name Marie Samuels.   Your home address. Oh, just the town will do.   Cabin One. It's closer in case you want anything... right next to the office.    He removes a key for Cabin One. We see that there is a remaining key on the board.     There's a big diner about ten miles on up... just outside Fairvale.   Fifteen miles. I'll get your bags.  He goes to door, opens it. The rain has slowed down considerably. He smiles at this fact, as if to communicate some pleasure he finds in it. Mary follows him to the door, goes out on the porch, waits and watches as Norman runs to her car, gets in, drives it to the parking space in front of Cabin One. Mary walks along the porch, waits before the door of Cabin One.  Norman gets out of car, with suitcase, runs to the door, opens it, pushes the door open, puts his hand in and switches on a light. Mary goes into the cabin. Norman follows her.   Stuffy in here.  Well... the mattress is soft and there're hangers in the closet and... stationary with \"Bates' Motel\" printed on it in case you want to make your friends back home envious... and... the... over there.... (he points to the bathroom, fairly blushes   (quickly, starting to leave I'll be in the office if you want anything... just tap on the wall.   Norman Bates.  He pauses at the door, gazes at her. She smiles.   You have something most girls never have.   There's no name for it... But it's something that, that puts a person at ease.    You're not going to go out again and drive up to that diner, are you?   Then will you do me a favor? (without waiting for her response Will you have supper here?  I was just about to, myself... nothing more than some sandwiches and a lot of milk, but I'd like it if you'd come up to the house and... I don't set a fancy table but... the kitchen's awful homey.   All right, you get your dresses hanging out and... change those wet shoes, and I'll come for you soon as it's ready...  ...with my trusty umbrella. (he laughs a small laugh, runs off  Mary closes the door, goes to suitcase, opens it, starts to take out a dress. Her handbag is next to the suitcase. She glances down into it, pauses, drops the dress, reaches into the handbag, takes out the money-filled envelope, stares at it, almost with regret, filled contemplates hiding it, decides to, starts looking for a reasonable hiding place. She looks about, at the closet, the drawers etc., realizes all such places are obvious. Catching sight of the newspaper in her bag, she hits on a solution. She opens the newspaper, places the envelope within it, lock-folds the paper again and then places it on the bedside table as if it were there for later reading. She considers this for a moment, accepts it, goes to her suitcase to start unpacking.  Suddenly the quiet is shattered by the shrill, ugly sound of a woman's voice, raised in anger.   Mother, please...   Mother, she's just a stranger... hungry, and the weather's bad...   (blurted cut fury and shame Shut up! Shut up!  There is the SOUND of a door closing in that room up there. Mary has stood by the window, listening with mounting distress and concern and sympathy. She turns her face away now, gazes sadly at the little empty room.  In a moment there is the SOUND of the house's front door slamming shut. Mary turns, looks out the window.   Mother... (a hollow little laugh, an attempt at sardonic humor ...what is the phrase... \"she isn't herself today\"... I think that's it.   I'm sorry. I wish... people could apologize for other people.   It might be nicer... warmer in the office.  Without waiting for approval or disapproval, he turns, hurries to the office. Mary looks after him, her face showing amused sympathy, then follows.   Eating in an office...  ...to officious, even for me. I have the parlor behind this... if you'd like.  Mary nods. Norman walks on, behind the counter and into the darkened parlor. Mary follows.    In the darkened room, lit only by the light from the office spilling in, we see Norman placing the tray on a table. Mary comes to the doorway, pauses. Norman straightens up, goes to lamp, turns on the light.  Mary is startled by the room. Even in the dimness of one lamp, the strange, extraordinary nature of the room rushes up at one. It is a room of birds. Stuffed birds, all over the room, on every available surface, one even clinging to the old fashioned fringed shade of the lamp. The birds are of many varieties, beautiful, grand, horrible, preying. Mary stares in awe and a certain fascinated horror.     Please sit down. On the sofa.  As Norman goes about spreading out the bread and ham and pouring the milk, we follow Mary across the room. She studies the birds as she walks, briefly examines a bookcase stacked with books on the subject of \"Taxidermy.\"   It's all for you. I'm not hungry. Please go ahead.  Mary begins to eat, her attitude a bit tense. She takes up a small slice of ham, bites off a tiny bite, nibbles at it in the manner of one disturbed and preoccupied.  Norman gazes at her, at the tiny bite she has taken, smiles and then laughs.   You eat like a bird.   Not really. I hear that expression, that one eats \"like a bird,\" is really a falsie, I mean a falsity, because birds eat a tremendous lot. (A pause, then explaining Oh, I don't know anything about birds. My hobby is stuffing things... taxidermy. And I guess I'd just rather stuff birds because...  well, I hate the look of beasts when they're stuffed, foxes and chimps and all... some people even stuff dogs and cats... but I can't... I think only birds look well stuffed because they're rather...  passive, to begin with... most of them...  He trails off, his exuberance failing in the rushing return of his natural hesitancy and discomfort. Mary looks at him, with some compression, smiles.   Uncommon, too.   It's not as expensive as you'd think. Cheap, really. Needles, thread, sawdust .. the chemicals are all that cost anything. (He goes quiet, looks disturbed   It's more than a hobby... sometimes... a hobby is supposed to pass the time, not fill it.   Oh, no! (forcing brightness again I run the office, tend the cabins and grounds, do little chores for mother... the ones she allows I might be capable of doing.   Friends? Who needs friends. (Laughs, then with gallows humor A boy's best friend is his mother.  You've never had an empty moment in your whole life. Have you?   Where are you going? I don't mean to pry...   What are you running away from?   No. People never run away from anything.  The rain didn't last very long.  You know what I think? I think we're all in our private traps, clamped in them, and none of us can ever climb out. We scratch and claw... but only at the air, only at each other, and for all of it, we never budge an inch.   I was born in mine. I don't mind it anymore.   Oh I do... but I say I don't.     Sometimes when she talks that way to me I'd like to... curse her out and leave her forever!  Or at least, defy her. (A pause, a hopeless shrug But I couldn't. She's ill.   I mean... ill.  She had to raise me all by herself after my dad died... I was only five... and it must have been a strain. Oh, she didn't have to go out to work or anything, Dad left us with a little something... anyway, a few years ago... Mother met a man. He talked her into building this motel... We could have talked her into anything... and when.  Well... It was just too much for her when he died, too... And the way he died... Oh, it's nothing to talk about when you're eating.  Anyway, it was too much of a loss for my mother... she had nothing left.   A son is a poor substitute for a lover. (Turns away as if in distaste of the word   To a private island, like you?   It's too late for me. And besides... who'd look after her? She'd be alone up there, the fire would go out... damp and cold, like a grave. When you love someone, you don't do that to them, even if you hate them. Oh, I don't hate her.  I hate... what she's become. I hate... the illness.   An Institution? A madhouse?  People always call a madhouse \"someplace.\"  Put her in Someplace!   (The coldness turning to tight fury What do you mean about caring?  Have you ever seen one of those places? Inside? Laughing and tears and cruel eyes studying you... and my mother there?  Why? has she harmed you? She's as harmless as... one of these stuffed birds.    Well? You meant well?  People always mean well, they cluck their thick tongues and shake their heads and suggest so very delicately that...  The fury suddenly dies, abruptly and completely, and he sinks back into his chair. There is a brief silence.  Mary watches the troubled man, is almost physically pained by his anguish.    I've suggested it myself. But I hate to even think such a thing.  She needs me... and it isn't... (Looks up with a childlike pleading in his eyes ...it isn't as if she were a maniac, a raving thing... it's just that... sometimes she goes a little mad. We all go a little mad sometimes. Haven't you?    Thank you, Norman.   You're not going to... to your room already?   Phoenix?    Why don't you stay a little while, just for talking.   Alright. I'll see you in the morning. I'll bring you breakfast.  What time will you...   Alright, Miss... (He has forgotten her name   That's it. (He frowns, as if bothered by not being able to match the name to the memory of the name in the registration book    He goes back into the parlor with a mystified expression. The sound of Mary moving about her room come over, soft SOUNDS, somehow intimate in the night quiet. Norman turns his ear from the direction of the SOUNDS, seems to be fighting an impulse to listen, or more than listen.  But slowly, he is forced to surrender to the impulse and, resisting himself, he goes to the wall, presses the side of his head against it. The SOUNDS come louder, as if we too had our ear pressed against the wall. Now Norman looks at a picture hanging on the far end of the wall he is leaning against. Slowly he starts toward it.  He reaches it, touches it, reluctantly lifts the small frame off the wall.  A tiny circle of light hits Norman's face, coming from the hole in the wall behind the picture. This end of the room is very dim and thus we are able to see clearly the light striking Norman's face.  We move close to Norman, extremely close, until his profile fills the screen. The tiny spot of light hits his eye. See the small hole through which the light comes. Norman peeps through.    Through the hole we look into Mary's cabin, see Mary undressing. She is in her bra and halfslip. She stoops over a bit, places her hands behind her upper back, begins to unhook her bra.    He watches as Mary removes her bra. We see his eye run up and down the unseen figure of Mary.    Mary, just slipping into a robe, covering her complete nudity.    He turns from the hole, faces us for a moment, continues turning until he can look out the small parlor window.  We see, as he sees...    He turns his face away, quickly, resentfully. In his face we see anger and anguish. And then resolve.  Quickly, precisely, he rehangs the picture over the hole in the wall, turns, starts out of the parlor. We see him go through the office and out onto the porch, not even bothering to close the door behind him.   Mother! Oh God, what... blood, blood... mother...!  We cannot entirely distinguish these exclamations.  After a moment or two of silence, Norman emerges from the front door, dashes down the path toward the motel.    Norman sitting on bed, the bathroom in b.g. of shot. We can see only the hand of the dead girl, lying along the tile floor. Norman presses his eyes, fights to find a way out of his dilemma. Slowly, a kind of settling comes upon him, the peace that comes with decision.  Norman rises, goes to the window, looks out, and then, with resolution, closes the window and draws the curtain across it. Then he crosses to the front window, facing the porch, and draws those curtains closed. Then he switches off the bedroom light, leaving the room lit only by the spill from the bathroom. He opens the front door, goes out.    We see Norman shake his hands free of the water, then turn to the job of cleaning the bathroom.  He places the pail in the tub, runs water into it, dips the mop in, swabs the tile floor. With a towel he wipes off the wall over the tub and the edges and sides of the tub and even the shower curtain rod. Then he takes a second towel and goes over the cleaned areas, carefully drying them. Finally he rinses and squeezes out the mop, empties the pail, cleans out the tub, and goes out into the bedroom.    We see no plane. The SOUND of the motor is beginning to diminish.    We see the relief in his face. He looks at the car.  More than two-thirds of it have already sunk into the swamp. The trunk alone seems to hold poised above the sand and slime, as if refusing to go the rest of the way. Norman begins to panic, he steps dangerously close, pushes with his foot. And slowly the car sinks, until finally it is gone and we hear only the gentle plop of the swamp's final gulp, and see only the small after-bubble, like a visual burp.  Norman waits a moment, then begins stamping out the tire marks, so obvious in the wet ground around the swamp.  He stamps and drags his feet over the markings as we:    standing on the porch of the motel, leaning against a post. He is staring out into the night, a look of guarded, casual innocence on his face, as if he were taking one last moment of peaceful night air before retiring. Then he glances down and CAMERA follows his gaze. A hose is lying on the ground outside Mary's cabin, its stream of water obliterating the tire marks.  After a moment, Norman's hand comes into shot, picks up hose, places it in a new position. As CAMERA PULLS BACK, we see that the water from the hose has erased and rearranged the road markings so that it would be impossible to tell that a car had been parked here.  After a short wait, Norman goes to the hose-faucet, turns it off, unscrews the hose. As he rolls the hose, he walks away from the spot, past the office, heading for the path that leads to the house. He goes up the path, pauses at the steps of the house, tosses the curled hose onto the lawn, goes up the steps and into the house. CAMERA FOLLOWS him in, PAUSES as he pauses at the foot of the stairs. Norman goes up the stairs.  On the landing he stops. The door to his mother's room is closed. Lying in a heap outside the door are a blood-stained dress and a pair of elderly-woman's shoes. From an EXTREMELY HIGH ANGLE, we look down on Norman as he bends to pick up the stained dress and shoes.  He rolls the shoes into the dress, tucks the small, neat bundle under his arm, and starts down the stairs, heading for the basement.   (shoving sock in his pocket I always forget to put the sign on, but we do have vacancy.  Twelve in fact. Twelve cabins, twelve vacancies.   I don't really forget the sign, it just doesn't seem... any use.  This used to be the main highway.  Want to register, please?   No trouble. Today's linen day. I change all the beds once a week, whether they've been used or not... dampness. I hate the smell of dampness.  It's such a dank smell.  Norman is holding the door open, so Arbogast walks in.  Norman follows.   You out to buy a motel?   Oh. I thought... you said you'd been to so many in two days...  What was it you wanted to ask?    I didn't think the police went searching for people who weren't in trouble.   Oh.  He waits a moment, then opens closet, starts counting out sheets and pillow cases, keeps his back to Arbogast.  Arbogast takes a photograph out of his pocket, talks as he crosses to Norman.   No. No one has stopped here in weeks...   Committing myself to what? You sure talk like a Policeman.   No. At least I don't recall.    I don't even bother with guests registering any more... I mean, little by little, you drop the formalities. (more relaxed, because Arbogast is listening with a pleasant smile I shouldn't even bother to change the linen. I guess habits die hard. Which reminds me...  He goes to the wall, flips a light switch.   The vacancy sign. Just in case.  We had a couple the other night, said if the sign hasn't been on they'd have thought this was an old deserted mining town or something.   What?   I didn't lie to you. I just have trouble keeping track of... time.  Arbogast has reached him, the picture extended. Norman looks dutifully at it.   It was raining and her hair didn't look like that... damped out, I guess.   She arrived kind of late, wet and hungry and she was very tired and went right to bed and left early.   Very early. Dawn.   The following morning. Sunday.   No.   No.   No.   No! Of all...   She was tired. She said she had a long drive ahead of her, in the morning... Yes, now I'm remembering very clearly because I'm picturing. When you make a picture of the moment in your mind, you can remember every detail. She was sitting back there, no she was standing up, with some sandwich still in her hand, and she said she had to drive a long way.   What do you mean?   Oh. My private parlor. She had an awful hunger... so I made her some supper. And then she went to bed and left in the morning. I didn't even see her leave.   What?   Cash.   Why should she? I'm sorry, I have work to do, Mr... if you don't mind...   I don't know what you expect me to know about... people come and go...   Not at all!   (as if pleasantly exasperated Look, if you won't believe me, go ahead. You can help me make beds if you like. (laughs, shakes his head Come on.  He starts out. Arbogast pauses, momentarily confused by the young man's openness.   Change your mind?  Arbogast does not reply. Norman becomes apprehensive, starts to Arbogast, forcing himself to remain calm and cheerful.   I guess I've got one of those faces you can't help believing.   I live there. Alone.   My mother.  Arbogast turns, gazes seriously at him.   She's... ill. Confined to her room. It's practically living alone.   Of course not.   Now, look...!   I'm not a fool! And I'm not capable of being fooled! Not even by women!    That's all right. maybe she could have fooled me.  But...  She didn't fool my mother.   No. I told you, she's confined...   No! Just no!  I have one of those breaking points like any other man, believe it or not, and I'm near it. There's just so much pushing I can take and I think...    Norman sits in the dim, one-lamp light, the phone next to him, his hand still near it as if he had not been able to move his hand after hanging up. He is staring at the shrike- like bird which is perched on the lamp shade. Decision and resolution are beginning to show in his face. Suddenly he rises, starts quickly out of the room, tries to switch off the lamp as he goes and in so doing succeeds only in knocking the bird off the shade.  He watches it fall, does not try to catch it. It hits the floor with a thud and sawdust spills out. He stares sadly at it, for a moment, then tends down, scoops up the sawdust, tries to press it into the split seam, picks up the bird, puts it in a drawer. Then he puts out the lamp, goes out, crosses the darkened office and goes outside.   Please, mother...    They'll come now, Mother. He came after the girl and now someone will come after him! How long do you think you can go on... Mother, please, just for a few days, just so they won't find you!   I'll carry you, mother.  Norman comes out of the room, his mother held in his arms, her head leaning against his shoulder. He carries her down the stairs, along the lower landing to the cellar stairs, and then down those stairs to the basement.    I suppose you want a cabin.   I'll take you to...   It isn't necessary.   I'll get your bags.    I'll show you the cabin.  As he starts for the door, Sam laughs. Norman stops, turns, looks at him.   Ten dollars...  Norman returns to Sam, takes the extended bill, is about to start out again.   Looking for me?   Satisfied with your cabin?   Yes.   That would be a rather extreme reaction, wouldn't it?    This place! This isn't 'a place.' It's my only world. I grew up in that house back there. I was a happy child. My mother and I... we were more than happy.   My mother is not dead!    Lila is standing in the doorway, staring at the room in sick dismay. The room is grotesque, a horrible, ludicrous fantasy of childhood held beyond the point of decency.  It is a small room. The walls are fancied with romping silhouettes of teddy-bears and sailboats and carousels and fat cows jumping over aghast moons. The bed is small, far too short for a man of Norman's height. And yet the rumpled covers indicate that it is in this bed that Norman sleeps. Next to the bed is an old-fashioned toy chest. On its top there are a bird-in-a-cage lamp, a plain-bound book, and an ash tray filled with ashes and cigarette stubs. A grown man's shirt hangs on a child's clothes tree.  Against one wall there is a narrow, high bookcase filled with thick, unchildish-looking books. On the small, white chest of drawers there is an old, child's victrola. The record on the turntable is discovered, on close inspection, to be Beethoven's Eroica Symphony.  Lila studies the room, fascinated and repelled. She glances at the bookcase, comes into the room, goes to the bookcase and pulls out a thick, large, plain-bound book. She opens it. Her eyes go wide in shock. And then there is disgust. She slams the book closed, drops it.   I don't know what you've been saying.   Do what?   Shut up!   Leave me alone!   Leave me alone!  He is close to panic now. He turns, swiftly, dashes back into his private parlor. Sam goes quickly around the counter, follows.    Norman hears Sam following, wants to run, to never be reached by this man. He crosses the small room, drawn to the rear window, as if he might fly through it. Sam enters, pauses. Norman turns, back against the window, as unable to fly away as are the many still, stuffed birds. Sam registers a brief flicker of reaction when he sees the birds, but continues to gaze at Norman, hard.   Where's that girl? The girl you came with! Where is she?  Sam does not respond, smiles a half-smile, turns to examine a stuffed owl. Norman looks back at the house.    Oh, God!    Sam is lying on the floor, face downward, unmoving. A candlestick is on the floor, close by his head, still rocking as if just dropped. OVER SHOT comes the SOUND of Norman's footsteps and CAMERA TURNS in time to catch a brief glimpse of him going out into the office, almost at a run.    Ayeeeeeeeeeeeeeeeeeeeeee Am Norma Bates!  Lila turns.    His face is contorted. He wears a wild wig, a mockery of a woman's hair. He is dressed in a high-neck dress which is similar to that worn by the corpse of his mother. His hand is raised high, poised to strike at Lila. There is a long breadknife in it.    As he is about to start forward, a man's hand reaches in from the doorway behind, grabs Norman's wrist. Sam comes through the door, still holding tight to the wrist, pulling back the arm and at the same time throwing himself at Norman, football tackle style.    The walls are white and plain. There is no window.  There is no furniture except the straight-back chair in which Norman sits, in the center of the room. The room has a quality of no-whereness, of calm separation from the world.  The Police Guard has placed the blanket on Norman's knees. Norman, as we come upon him, is lifting the blanket, unfolding it. His face, although without makeup and without the surrounding softness of the wig, has a certain femininity about it, a softness about the mouth and a kind of arch womanliness about the brows.  Calmly, Norman places the blanket about his shoulders, as if it were a cashmere shawl. CAMERA REMAINS in a position so that our view of Norman is a FULL ONE. When the shawl is in position, and Norman is settled, we HEAR, OVER SHOT, the voice of his mother, coming from the calm of his thoughts.",
        "Bates": "Mary pauses on the porch. The lights are on within the office. She tries door, finds it open, goes into office. CAMERA FOLLOWS her into office. There is no one present. Mary goes to the desk, rings a small pushbell. There is no response. Mary rubs her forehead in weariness and frustration, goes back out onto the porch. She looks off in another direction, slightly behind the office, and sees...    Mary, having seen the woman, expects now that she will get some attention. She stands a few moments, waiting.  No one comes. Impatience and anger rise in Mary. She dashes out into the rain, to her car, gets in, opens the side window, begins to honk the horn. After a moment, a YOUNG MAN open the front door of the house, pauses, starts down the path. After a few steps, he turns and runs back into the house. Mary leaves her car, starts a dash for the shelter of the porch. As she runs, we see that the Young Man has gone back only to get an umbrella. Seeing that Mary is on her way to the porch, he runs quickly, the umbrella unopened in his hand. He gets to the porch a moment after Mary has reached it.  He stops short, looks at her, then at the umbrella hanging useless in his hand, then back to her.  There is something sadly touching in his manner, in his look. Mary's impatience goes and she smiles and this makes him almost smile. He gestures her into the office, standing back to indicate that he will go after her. She goes into the office.    The Young Man follows Mary in, closes the door. He is NORMAN BATES, somewhere in his late twenties, thin and tall, soft- spoken and hesitant.    A high shot showing the freeway and Bates house and motel on the side old highway. A pause and then across the bottom of the picture a white car speeds by on the freeway.    The white car speeding along the freeway again going in the opposite direction to last time. Norman, a tiny figure, is seen going up the steps to his mother's house.    The white car goes by on the freeway again.    Heavy traffic on the freeway. A beat or two - again the white car. It slows up opposite the distant motel. It makes a turn and goes back out of scene. A pause and it reappears on the old road and slowly makes its way toward the Bates' Motel.    We now see Norman. He has brought out an old rocking chair and has placed it on the office porch and is sitting hunched in it. And he is darning one of his own socks. CAMERA HOLDS. Beyond the porch, and Norman, we see the old house and can barely make out, in the twilight dimness, the figure of his mother seated at the window. Here, too, there is that quality of quiet peace surrounded by a vague foreboding.  Now Norman looks up at the SOUND of the approaching car.  And continues looking as the car comes to a stop and Arbogast gets out. Arbogast gives the place a quick once-over, gazes at Norman, starts forward. In his steps and manner there is that bored, routine-logged quality of a man who has seen too many motels and asked question of too many hotel managers over too short a period of time.  Norman rises as Arbogast comes forward.    A distant view of the House and Motel. There is a light on in the house. There is also a light on in Norman's office. We see Norman emerge from his office and move along the porch toward the distant cabins. He carries sheets on his arm. He goes into the last cabin and switches the light on. Into the foreground the hood of the white Ford enters the scene and stops. Arbogast gets out. He goes over to the Motel office.    Arbogast gradually eases the door closed, stands against it, waiting. He looks up in the direction of the light, sees no one. The door at the head of the stairs is closed. Arbogast listens, holds his breath, hears what could be human sounds coming from upstairs but realizes these could also be the sounds of an old house after sunset. After a careful wait, he crosses to the stairs, starts up, slowly, guardedly, placing a foot squarely on each step to test it for squeaks or groans before placing his full weight on it. CAMERA FOLLOWS, remaining on floor level but TRAVELLING ALONG the stairway as Arbogast makes his way up.    The place is empty and silent and washed dirty by the deep gray of the cloudy sky. We see Sam's truck turning into the driveway and pulling to a stop. After a moment, Sam and Lila get out of the truck.    A close of her face, She appears to be watching and enjoying the fight. Over the shot, the SOUNDS of the struggle, the screams of Norman."
    },
    "imdb_rating": "8.5",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNTQwNDM1YzItNDAxZC00NWY2LTk0M2UtNDIwNWI5OGUyNWUxXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "Phoenix office worker Marion Crane is fed up with the way life has treated her. She has to meet her lover Sam in lunch breaks, and they cannot get married because Sam has to give most of his money away in alimony. One Friday, Marion is trusted to bank forty thousand dollars by her employer. Seeing the opportunity to take the money and start a new life, Marion leaves town and heads towards Sam's California store. Tired after the long drive and caught in a storm, she gets off the main highway and pulls into the Bates Motel. The motel is managed by a quiet young man called Norman who seems to be dominated by his mother.Col Needham <col@imdb.com>",
    "name": "Psycho",
    "genres": [
        "Horror",
        "Mystery",
        "Thriller"
    ]
}