{
    "filename": "Raging-Bull_script.txt",
    "imdb_id": "tt0081398",
    "imdb_url": "https://www.imdb.com/title/tt0081398",
    "characters": [
        "Joey",
        "Charlie - Man with Como",
        "Jake La Motta",
        "Vickie La Motta",
        "Guido",
        "Irma",
        "Emma - Miss 48's",
        "Eddie Eagan",
        "Tommy Como",
        "Salvy",
        "Mario",
        "Patsy",
        "Toppy",
        "Lenore",
        "Himself - Radio Announcer for Dauthuille Fight"
    ],
    "dialogues": {
        "Joey": "You didn't have to come to      Cleveland to get beat by a \"moulan      yan,\" Jake!        A grand apiece! We got a grand      apiece on this, Jake! A fucking      grand!  JAKE suddenly corners REEVES and unleashes a desperate, wild alley-fighting attack. One ferocious punch after another.  The SPECTATORS go wild; everyone's up for the kill.  REEVES staggers, then falls to the canvas.  The REFEREE counts:         Don't get out of the ring. You won      the fight -- let him go out first.        Salvy, would I steer you wrong?      Let's say that's the truck; it's      full of cigarettes, right? Now, two      o'clock this morning we move the      truck from here to there,           (he points; the CAMERA       What do you want from my life,      Salvy? He's my brother.         Hey, leave the kids alone.         Hey Jimmy, here's a dollar for your      trouble. There's some bums around      the corner -- they need your help.         Here's my new suit.       Right here.        Just kidding, take it easy.       No fuckin' sense of humor.  SALVY and JOEY continue to walk a little faster, giggling.        I can't convince him. He's got such      a thick head, I'd like to crack it      open myself. Believe me, my own      brother. It's very hard. You don't      have to convince me -- I know we      should be with Tommy. You talk to      him. He don't listen to nobody.        All right, I'll try. See you later.        Right, the gym.  SALVY leaves. JOEY goes into the building.         What's the matter?         What's the matter? You're drinking.      You're eating like an animal.  JOEY sits next to JAKE at the kitchen table. JAKE has a drink in his hand, and tears on his face.        What's wrong?        Hey, c'mon, what's the matter?        What're you talking about? He's a      heavyweight. You're a middleweight.  JAKE holds out his scarred hands.        That's what I'm sayin'. You      shouldn't even think like that.      It's crazy.        You know?        Sure. What is it?         You want me to do what?        C'mon, Jack. You had a few drinks.        Jack, I got no gloves.        Jack! Enough!        What was that for? I know you can      take punches. I can hit you from      now to doomsday. What the fuck does      that prove?        Yeah, yeah. They just wanted to      talk to you. So I...        What are you getting so hot about --      Tommy Como told him to come down      here...        I didn't tell them to come. Tommy      Como...  The bell sounds again. JAKE hits JOEY a few more solid body punches. JOEY gets angry and fights back with a flurry of punches which have no effect on JAKE. JAKE laughs.        You cocksucker.  JAKE laughs. The two continue to swing it out, as SALVY watches unseen from the doorway.        Whadda you care?        No, I'm not afraid. Why? You wanna      meet her?        Cause I'll go right over there and      bring her here.        You sure you wanna meet her? Don't      make me go over there, you change      your mind and you make me look bad,      cause she's really a knockout.      She's 15, this kid -- a great piece      of ass.        No, I see her around the pool. I      know her. I know her like that --      not like that.         I'm tellin' you, she'll be there, I      know she'll be there.        How you gonna catch anybody alone      at a dance?... I don't know if      she'll be there alone... She'll      probably be there with her      girlfriends or something.        Nah, she don't go with nobody.      She's only 15 years old.        Probably. You know she talks to      everybody, and not just him.        Ah, some piece of ass, I'm tellin'      you.        Huh?        With her? How?        Ah, no, no. I didn't bang her. I      know her from around here, that's      all. You want to meet her or what?         I'm tellin' you, she'll be there, I      know she'll be there. Dressed up      and everything.        C'mon, hurry up. We're never gonna      get outa here tonight.  JOEY sips a drink as JAKE knots his tie. IRMA enters from the bedroom.        What a mouth on her -- you shoulda      hit her -- no good fuckin' Jewish      cunt -- breakin' our balls. You      shoulda hit her with a chair.        No, but Jake... how much abuse can      you take.        Look, could you move a little.      Would you mind, darling?         All right, darling, I'll just stand      here and wait.  JOEY cups his hands and grabs VERA's breasts. VERA squeals, covers her breasts, and moves back. JOEY and JAKE walk past her. JOEY smiles.  JOEY and JAKE sit down at an empty table.        Give me a chance. Let me look.        THERE she is over there on the      other side. What did I tell you?      Oh, ain't she nice? Ain't she a      fuckin' doll?  As they watch, WE SEE, from JAKE's POV:  SALVY, FRANKIE, and JUNIOR show up at VICKIE's table. They are in overcoats and hats and don't sit down. They are obviously on their way to bigger things than a neighborhood dance -- and VICKIE and her GIRLFRIENDS are glad to go with them. They get up to leave.         Hey, Vickie, c'mere. Don't be      afraid. C'mere. Just say hello.      This is my brother.  VICKIE comes over to the fence.        Vickie, I want you to meet my      brother, Jake. He's gonna be the      next champ.  JAKE puts his fingers through the fence.        The fuckin' papers are full of      Robinson and nothing on Jake -- and      Jake knocked him clear outa the      ring in Detroit. He's the only guy      ever to beat Robinson. Whatsa      matter with you? I thought we had      an arrangement.        You holding me up for more cash or      what?  The bell sounds, ending the sparring round.        C'mon, Jake. You're makin' us look      stupid. I brought these guys up      here, now you don't wanna talk to      them? What are ya doin'? Open your      mouth, for Christsake.  JAKE nods his head, steps out of the ring, and goes directly over to the REPORTER, who is about to say: \"Hi, Jake.\"         Don't worry. Don't worry. It's      gonna be all right.       Ask him your questions.         He fights the toughest guys around      that everybody else is afraid to      fight...         They robbed us! Those fuckin'      judges -- What the fuck fight were      they watching? If I see them on the      street, I'll break their heads.      Decision Robinson, my fuckin' ass!      Those judges give him the decision      'cause he's goin in the army next      week! How else could this have      happened?... What do you think they      gave him the decision for, that's      why.        You won and was robbed! You didn't      do nothin' wrong.        You want us to wait for you?        Jake, you're the one who said you      could get down to 155! What did I      do, pull it out of the fuckin' hat?        You want the title shot?        You want the title shot or not?         This Janiro's an up-and-coming      fighter, this kid you gotta knock      out. Knockout this fuckin' kid! I'm      telling you, this is your step      towards getting a shot at the      title. Listen to me: I'm telling      you. You been killin' yourself for      three years. There's nobody left --      they're afraid to fight you.      This Janiro's up-and-coming. He      don't know. Fuckin' tear him apart,      wipe him out! What are you worried      about? Your weight? Look, even if      you lose they're gonna think you're      weak; they're gonna think you're      not the fighter you used to be.      They'll match you with guys they      were afraid to match you with      before, and then you'll kill them      and you'll get your title shot. And      if you beat this kid Janiro, they      gotta give you a shot at the title      because there's nobody else. Either      way you win and you do it on your      own -- just like you want it. All      right?        Nah, she would never...          C'mon, Jake. You know she's crazy       about you.  JAKE gives him a suspicious look. JOEY feels uneasy.          Excuse me for a minute. Be right       back.         Jake, come over for a few minutes.       Tommy wants to say hello to you.       C'mon, just come and say hello.  JAKE doesn't like the idea, but goes along with it anyway.  ANOTHER ANGLE: COMO's table. JAKE comes over.         I love you.  JAKE, weak from losing the weight and winning the fight, still manages to prance around the ring victoriously.  VICKIE, now near the ring, throws kisses to JAKE.          I dunno. We're working on it. He's       training at the camp now.         We're gonna get our shot.  The DETROIT PROMOTER introduces JOEY to JACKIE CURTIE.         Betcha more than he has.         Ain't he dead?         Yeah?          Just a minute. Excuse me. I'll be       right back.  The table area: JOEY arrives at SALVY's table. VICKIE is nervous. There is a cold exchange of'\"hellos.\"          C'mere, let me talk to you for a       minute.  There is an awkward silence as he grabs VICKIE by the arm and takes her over to the hat-check area.         What're you doin' with Salvy? You       shouldn't be here with him. Jake's       away killin' himself. Suppose he       found out.         No, you're his wife.         It don't look right.         I'm not gonna tell him nothing; but       if he finds out, he will kill you.       What's the matter with you? Aren't       you happy? You got everything you       want.         Try to understand, Vickie. Jake's       got a lotta aggravation. He's been       a top contender too long.         And you're drinking with them right       now.          You're wrong to be here. Let's go.  VICKIE pulls away from JOEY, and goes back to the table.  The table area: JOEY arrives at the table. He grabs VICKIE.         I said, let's go.         Excuse me, I'm talking to my sister       in-law.         What do you think, I'm blind? My       brother's breaking his ass in a       ring, and you're here with his       wife.         Get the fuck outa here. What did       you do, take your gangster pills       today? I'll tear your fuckin' head       off your shoulders!  JOEY goes for SALVY. PEOPLE react.  The GIRLS begin to scream. VICKIE exits. JOEY notices her leave, and calls after her.         Hey, wait --  PAUL comes over and stops the fight.              (as he turns and lashes            into Salvy and Patsy       I'll suck your eyes out! I'll       fuckin' take the two of you.  After a few moments, PAUL and the BOUNCERS from the Copa come out. The BOUNCERS pull PATSY away. They try to separate SALVY and JOEY, but can't.  JOEY savagely beats SALVY on the Copa steps and in the street against the parked cars.         Fuckin' low-life, cocksucker, etc.       ...  SALVY tries to fight back, but JOEY is too tough for him. SALVY hits the pavement. JOEY kicks him.  PAUL, PATSY, and the BOUNCERS finally pull JOEY away. PATSY tries to go after JOEY again, but PAUL stops him.         Yeah, I understand, Tommy.         Yeah, they're good. They're good,       Tommy.         Aw, Tommy, c'mon, it ain't that.         How can he embarrass you?         Tommy, Jake respects you. He won't       even say hello to anybody else --       you know that. But you know when       Jake gets set on somethin', Jesus       Christ Almighty could get off the       fuckin' cross and he ain't gonna       talk him out of it. I'm his kid       brother. I got no say with Jake on       this. He thinks he can buck       everybody and make it on his own.         Whatcha doin'?         Maybe she's afraid you're gonna hit       her so she can't talk to you the       way she wants to.         Try talkin' to her. She's your wife       -- ask her what's the matter.         Jack, if there was anything funny,       I would tell you.         Sure, I'll keep an eye on her.         I got good news, and I got bad       news. The good news is you got your       shot at the title. The bad news       is...         Sure.          It woulda been so easy, Jack. So       easy...  JOEY goes into a boxing stance.         Stick out your hands, Jake.         G'wan, do it.        Protect yourself, rummy.  JAKE, out of reflex, sticks out his hands. As he does, JOEY feigns a hit and falls onto the floor -- \"out cold.\" JAKE looks down at him.  JOEY pops to his feet.         See? That's all there was to it.         Except fall down like a normal       person.         All right, you don't wanna fall       down, so now you gotta take a rest.       So, you enjoy the suspension.       'Cause there's nothin' you can do       about it. Let the Commissioner and       the D.A. jerk you around. So you       wait.         We did what we had to do. Tommy       don't forget. Sooner or later       you'll get your shot -- if Tommy       don't die.         That's right. \"No comment.\"        You like that? Good, 'cause I got a       lot more \"No comments\" where that       one came from.  JOEY cuts the line off, then leaves the receiver off the hook.         I'm gonna order up some stuff. Have       a steak.         So eat just a little. You gotta eat       something.         How long did it take you?         No good. Try to get it down. It's       gotta be no more than 30 seconds to       be on the safe side if we gotta       stitch him up.         Jake, somebody wants to say hello       to you.  JOEY opens the door wider. TOMMY COMO is at the door with JOEY. JAKE goes over to the door.         Jake, Jake...  TONY and the DOCTOR watch from the doorway.  VICKIE's eyes close. JAKE releases his grip. JOEY helps VICKIE. JAKE watches this.         Look at him, Jackie! You got at!       The fuckin' championship! He's       yours! Finish him off.  JAKE doesn't have the chance. The REFEREE, standing in CERDAN's corner, waves his hands signaling the end of the fight.  The REFEREE holds up JAKE's hands as THE ANNOUNCER takes the mike:         Hi, Vickie.  JAKE watches JOEY kiss VICKIE. VICKIE notices JAKE'S reaction.         Screw you, Jack.         What? I just said hello. Since when       I can't kiss my sister-in-law?         Well, you're not supposed to kiss       your mother on the mouth.         I can't tell. You're stomach's in       the way.  JAKE stares at JOEY.         Don't give me those looks. I'm just       your manager. The minute you start       to be champ, you start eating like       there's no tomorrow. And you giving       me looks. All I know is that I       don't have to defend my title next       month.  JAKE looks up at JOEY.         When?              (being as vague as            possible       Nothin'. Salvy was out of line. He       was drunk or somethin', I dunno.       Anyway, the windup was I gave him a       beatin'. Tommy called me down, and       we straightened it out. It's all       forgotten about.         It didn't have nothin' to do with       you.         No, I just told you what happened.         Jack, no. I just explained the       whole thing to you. It was just       between me and Salvy, if it had       anything to do with you and Vickie,       I woulda told you about it.         \"You heard some things.\" Will you       stop worryin' about that shit?       Forget about it. You know you got a       title fight comin' up.          Whatever you touched, that's good       now.         What?          I did keep an eye...         Some things changed between us.       Now, he thinks who the fuck he is.       He's been passing certain remarks       that I don't like.         What bullshit? Hey, I'm your       brother. You wanna believe me - you       trust me?         Well, you're wrong Jack. I'm       tellin\" you what happened. He got       outta line, we had a fight, and       it's staightened out now.  There is a pause.          So, go ahead. Kill everybody. Kill       Salvy, kill Vickie, kill Tommy       Como, kill me while you're at it.       What do I care? You're killing       yourself the way you're eating, the       way you worry about things you       don't have to worry about.         What?          I meant, kill everybody. You or me       or anybody. You're a big shot.       Kill, kill... g'head.         So what?         You're worried about this girl,       you're gonna let this girl ruin       you're life for you... You wanna       worry, worry about your fuckin'       stomach that you can't bend over --       that you gotta step in the ring in       a month.         What?         Whadda ya mean?         Whatsa matter with you?              (fed up, he starts to            leave       I gotta go. I gotta get outta here.       I can't take this shit. Lenore is       waitin' for me. I gotta go. You're       a definite wacko. You're fuckin'       crazy, you know that, crazy.  JAKE'S P.O.V., MOVING SHOT as JOEY leaves. JAKE goes into the bedroom.    JOEY is at the kitchen table eating lunch with his family. His wife, LENORE, her hair done up in pin curls, sits next to him. JOEY's TWO KIDS sit across the table from them, bickering.          Don't hit your brother! Be nice.  Suddenly, JAKE comes through the front door, goes directly to the table, grabs JOEY, lifts him into the air, and starts hitting him.         Jake, stop it.  JAKE keeps hitting JOEY. The KIDS start to cry. LENORE wants to stop the fight, but is afraid to get too close.         Stop it. What're you, crazy?  JAKE drags JOEY into the living room, and pushes him onto the floor.    VICKIE gives JAKE a final push out the door and then slams it in his face.  JAKE is left alone on the front steps.         Hello... hello...  JAKE can't answer.         What's this, a joke? Hello... Hey!  JAKE can't answer.         Well, if there's somebody       listenin', their mother's a fuckin'       whore who takes it in the ass.  There is a click as JOEY hangs up.  JAKE stands there, and finally hangs up the phone.   14, 1951  LENORE, JOEY's wife, watches the 6th Robinson-LaMotta fight on JOEY's new television console.  JOEY walks by on his way to another room, but stops to watch.  LENORE is not a fight fan, but is caught up in the fight, anyway.         I can't believe he's getting that       jab in.  The bell sounds, and a Pabst commercial comes on:    ROBINSON makes his move. His arms are a blur, swinging rapidly but accurately.  JOEY and LENORE are suddenly silent.",
        "Guido": "",
        "Irma": "JAKE, bandaged from the REEVES fight the night before, sits at the kitchen table  while his wife, IRMA, 19, cooks at the stove.  JAKE gets up and pokes at the frying steak with a fork.        It's not done.        Here's your steak. You can't wait      for it to be done. Here.  She slams the steak onto his plate, and reaches back to the stove.        Here's your carrots. You're in such      a hurry. You can't wait.    SALVY and JOEY approach the building.    JOEY is knocking at the door. IRMA opens it.        He's doing it again.            Where you going at this hour?        You fuckin' worm, if you're going      out, I'm going out.        None of your fuckin' business.  JOEY lifts his eyes up.        That's right -- run out. I ain't      gonna be here when you get back.    JAKE and JOEY hurry down the stairs. IRMA shouts after them.        Bunch of guys. You all hang out      together. Yeah, you're all going      out on business. You're all gonna      suck each other off.      JOEY and JAKE come out of the building and start walking down the street.  IRMA opens the window on the second floor right above them, and shouts out to them:        Go ahead -- that's all you're good      for -- to go out and leave me here      like a dog. You and your brother!      You don't even look like brothers.      You look like faggots! That's what      you look like -- faggots!  JAKE and JOEY walk faster down the block, pretending that IRMA must be shouting at someone else.  She throws a bottle at them. It smashes in the street.",
        "Eddie": "",
        "Eagan": "Tony Janiro, 151 lbs. and one half.  JAKE steps on the scale. He looks weak and woozy. After the customary adjustments, EAGAN calls out:         Jake LaMotta, 155 lbs. and one       fourth.  There's a commotion in JAKE's camp. JANIRO smiles.         Ok. This is official.  LAMOTTA stares at JANIRO.         LaMotta, 155 lbs. on the nose.  JAKE throws JANIRO a kiss.         Billy Fox, 173 3/4 pounds.  JOEY removes JAKE's leopard-skin robe as he steps on the scale. The REPORTERS crowd around.         Jake LaMotta, 167 pounds.  JAKE'S HANDLERS urge him with words of encouragement as they walk toward his dressing room.         I'd like to talk to Jake a minute.         I suppose you heard what       everybody's been saying, Jake.         You were a big favorite in this       fight. Then two days ago the odds       start jumping all over the place       until you're a 12-5 underdog.         Now the fight's off the books       altogether.       Meyer Lansky couldn't get a bet       down on this fight. Some people are       saying you're going into the tank.         I want to believe you, LaMotta.         That's all I wanted to hear.  JAKE glares at EAGAN as the COMMISSIONER walks away.",
        "Tommy": "Jake, sit down for a minute.  JAKE sits. SALVY smiles and nods to JAKE. JAKE barely nods back.          Fuckin' kid! You're the best       fuckin' fighter around. Loved what       you did to Satterfield. Them       \"moulan yans\" -- forget about it.       They're all afraid to fight you.         How you feelin'? Ok? You feelin'       good?         Tony Janiro's gotta watch out, eh?          This Janiro's a good fiahter,       pretty good-lookin' kid.         How's the weight? Ok?         All right, lemme ask you something.       Let's say I was a good friend of       yours. And I was telling you I was       gonna bet a lot of money on you in       this Janiro fight. What would you       tell me?",
        "Como": "All rightg I don't have to hear any       more. I think I understand what       happened. I understand it was your       brother's wife and there was       probably a misunderstanding. I'm       not sayin' Salvy shouldn't have       acted the way he did. But, Joey,       you don't raise your hands. You       don't do that kind of thing. This       time we forget about it but no more       after this. You understand?         All right, you guys, shake hands.  SALVY, JOEY, and PATSY shake hands.         Go 'head. Be friends. That's it.        All right, lemme be alone with him       for a minute.  SALVY and PATSY exit.  There is a pause.         Aside from everything else, your       family all right?         What is it with you? Can't you       talk? You got like a funny       attitude. I can't figure you out,       Joey. What's with you and the quick       answers? You wanna get outa here       fast?         Look Joey, I wanna tell you       something.       Your brother ain't gonna get       nowhere without us -- nowhere. And       I'm tellin' you between the two of       us, it's gettin' to the point where       it's gettin' to be a real       embarrassment to me, a real       embarrassment.         He's an embarrassment because       Frankie and the other guys are       expectin' me to do something about       it, and I'm lookin' very bad. I       can't deliver a kid from my own       neighborhood. Why's he make it so       hard on himself? He comes to me, I       can make it easier for him.         Make it on his own? Does he know       the kind of money involved? I mean       the real money. He thinks he's       gonna become champ on his own?       We're gonna sit by and see some nut       come in there and hold one of the       most important titles in the world?       A nut who don't listen to nobody or       respect nobody? Is he really crazy?       Listen, Joey, you understand, you       tell him. I don't care how great he       is or how colorful. He could beat       all the Sugar Ray Robinsons and all       the Janiros he wants to. He ain't       gonna get a shot at the title       without us. I'm not askin' you to       do another thing except get that       message into that thick head!         Hey champ!         You just take it easy, now. You'll       do all right. Feelin' Ok?         Just come by to wish you luck.        Need anything?         Ok, champ.  COMO turns to go. He says goodbye to everyone in the living room. He goes over and kisses VICKIE. JAKE watches this from the bedroom doorway.          Look at her. As beautiful as       always. Take care of that guy, will       ya?",
        "Salvy": "Hey but Joey, you're thinking      nickels and dimes. The money's with      your brother.        He ain't doin' the right thing.      He's makin' beans compared to what      he should be makin'. Can't you make      him understand that?  A COP goes over and starts to break up the fight.        Get lost.       Hey kids, \"A cop is a rat.\"      Remember that, \"A rat.\"  The KIDS yell.        Look, I'm just tellin' you how      Tommy feels. Jake is makin' it hard      on himself. Tommy wants him with      us. It's as simple as that.  They stop at the doorway.        Talk some sense into him, will ya?      You're still his brother.      If he ain't gonna listen to you, he      ain't gonna listen to nobody!        Tomorrow, at the gym. Don't forget.         Hey Joey --  JOEY waves back.         Jake, how you doin'?  JAKE nods to SALVY very cold. SALVY notices and can feel that he's not exactly wanted there by JAKE. JOEY notices the same and becomes a bit nervous.  SALVY sits down near the ring but not as close as he'd like to. His two friends, FRANKIE and GUIDO, sit nearby also.  JAKE goes to JOEY's corner.         Hey Joey, we better go. See you      later.  JOEY, dazed, turns to wave.        Hi, Joey. Jake, how you doin'?      Vickie...  They respond. JAKE is cold towards SALVY.  SALVY goes on his way to COMO's table.  As SALVY walks away, JAKE turns to VICKIE.         Bet on him three times. Always come       through for me.  JAKE just stares, holding his anger in.  There is a pause.         Joey, relax. You're taking this the       wrong way. Why don't you sit down       and have a drink?         Excuse me for living.         Hey Joey, I'm here with Patsy and       Vera and Sandy. And Vickie just       happened to come along. We're just       trying to have a good time. What do       you want from me? So, why don't you       just take it easy before this gets       out of hand.  As the conversation gets louder, PEOPLE begin to notice. PAUL, the owner , and some BOUNCERS also become aware of the argument.         Hey Joey, whadda ya lookin' to die       young?",
        "Mario": "Vickie is here, Jake.",
        "Patsy": "Don't fuckin' put your hands on me!       You're gonna near about this, Paul.",
        "Toppy": "",
        "Lenore": "Look at that. The sonofabitch is       outboxing Robinson."
    },
    "imdb_rating": "8.1",
    "description": "WhenJake LaMottasteps into a boxing ring and obliterates his opponent, he's a prizefighter. But when he treats his family and friends the same way, he's a ticking time bomb, ready to go off at any moment. Though LaMotta wants his family's love, something always seems to come between them. Perhaps it's his violent bouts of paranoia and jealousy. This kind of rage helped make him a champ, but in real life, he winds up in the ring alone.—alfiehitchie",
    "name": "Raging Bull",
    "genres": [
        "Biography",
        "Drama",
        "Sport"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYjRmODkzNDItMTNhNi00YjJlLTg0ZjAtODlhZTM0YzgzYThlXkEyXkFqcGdeQXVyNzQ1ODk3MTQ@._V1_QL75_UY281_CR1,0,190,281_.jpg"
}