{
    "filename": "Rise-of-the-Guardians_script.txt",
    "imdb_id": "tt1446192",
    "imdb_url": "https://www.imdb.com/title/tt1446192",
    "characters": [
        "Bunny (voice)",
        "Cupcake (voice)",
        "Burgess Pedestrian #1 (voice)",
        "Claude (voice)",
        "Pitch (voice)",
        "Pippa /Jack's Sister (voice)",
        "Jack Frost (voice)",
        "Tooth (voice)",
        "Sophie Bennett (voice)",
        "Jamie's Mom /Jack's Mother (voice)",
        "North (voice)",
        "Jamie Bennett (voice)",
        "Burgess Dog Walker (voice)",
        "Monty (voice)",
        "Caleb (voice)"
    ],
    "dialogues": {
        "Bunny": "Ah, it's freezing.  I can't feel my feet! I can't feel my feet!  Oh, this better be good, North. Guardians Screening Script 9/6/12 Avid 9.    Hold on, hold on, I thought you said you saw Pitch.  Not exactly? Can you believe this guy?  Yeah, you said it, Sandy.   Hang on, hang on, you mean to say, you summoned me here THREE DAYS BEFORE EASTER - because of your belly? Mate, if I did this to you three days before Christmas--  Here we go...    Look, mate, I'm dealing with perishables. Right. You've got all year to prepare.  And why are you always such a blowhard!    Well, I've got a serious situation with some eggs.  It is Pitch.  What?! Why?    Please not the groundhog, please not the groundhog.  Ah, I take it back! The Groundhog's fine! Guardians Screening Script 9/6/12 Avid 14.  Jack Frost!? He doesn't care about children! All he does is freeze water pipes and mess with my egg hunts. Right? He's an irresponsible, selfish...  Jack Frost is many things, but he is not a Guardian.    Hello, mate. Guardians Screening Script 9/6/12 Avid 29.  Been a long time. Blizzard of 68, I believe? Easter Sunday, wasn't it?  Yes.  But this is about something else. Fellas...  Me? Not on your nelly. See you back at the pole. Guardians Screening Script 9/6/12 Avid 30.   Ah, good question.  Yeah, that's exactly what I said!  Maybe.  How is that not offensive? Guardians Screening Script 9/6/12 Avid 36.  You know what I think? I think we just dodged a bullet. I mean, what's this clown know about bringing joy to children anyway?  But none of 'em believe in you.  Do they? You see, you're invisible, mate. It's like you don't even exist.    I'm a bunny. The Easter Bunny. People believe in me.  We have a problem, mate! Trouble at the Tooth Palace.  I think my tunnels might be faster, mate. And um, and safer.  Whoa, whoa, whoa, where are the bloody seatbelts?!  Ohhhhhh no!      Ah, rack off you bloody show pony!  Oh strewth, I knew we should have taken the tunnels.  Whoa!  Huh?  They're stealing the teeth!  Maybe that's where you belong.  Pitch! You shadow sneaking rat- bag! Come here!  What fear? Of you!? No one's been afraid of you since the Dark Ages!  Okay, alright I admit it, you were right about Pitch.  Hey, I told you never to mention that!  And eggs I hide in one day?  Here we go, here we go...  Yeah right, look, I'd tell you to stay outta my way, but really what's the point -- because you won't be able to keep up anyway.  Oh, you don't wanna race a rabbit, mate.  Aaahhh!  Jackpot!  Looks like you're a bit of a brumby, hey mate.  Ow!  Huh? Guardians Screening Script 9/6/12 Avid 59.  Crikey!  Haha! Ho, ho, ho!  Oh I see how it is...  All working together to make sure the rabbit gets last place.  You call that a bag of choppers?  Now that's a bag of choppers.  Most of us.  Sandy! Knock him out!  With the Dreamsand, ya gumbies.  Alright, nobody panic.  I think it's a pretty safe bet he's never met a rabbit like me -  Six foot one, nerves of steel, master of tai-chi and the ancient  Crikey.  Ah, this thing's rabid! Get this dingo off me!  Oh no.  Get outta my warren!  Huh?   You might want to duck. Guardians Screening Script 9/6/12 Avid 73.   Hey, buck up ya sad-sacks. Come on! We can still turn this around! Guardians Screening Script 9/6/12 Avid 78.  Easter is tomorrow and I need your help. I say we pull out all the stops and we get those little lights flickering again!  Hey! Did everyone hear that?!  Ohh no, mate. My warren my rules. Buckle up.          Welcome to the warren--  Something's up.  Ahhhh!  What is SHE doing HERE!!?  Crikey! Somebody do something!     You wanna paint some eggs? Yeah?  Come on then!  Woooohoooo!  Alright troops, it's time to push back. That means eggs! Everywhere! Guardians Screening Script 9/6/12 Avid 82.  Heaps of you in every high-rise, farm house and trailer park!  In tennis shoes and cereal bowls!  Oh, there will be bathtubs filled with my beautiful googies!  Naw, mate -- Guardians Screening Script 9/6/12 Avid 83.  That's adorable.  There will be springtime! On every continent! And I'm bringing hope with me!  Too Christmas-y, mate, paint `em blue.  Oh, what's over there? Guardians Screening Script 9/6/12 Avid 84.  That's a beauty!  Now all we gotta do is get him and his little mates through the tunnels, to the top, and we'll have ourselves Easter.  Not bad yourself.  It's the accent, isn't it?  Ah, poor little ankle-biter. Look at her, all tuckered out.  Which is why we need you here, with us.  Kids! Oi!   Yes there is! There is! I mean these aren't my best lookin' googies, but they'll do in a pinch!  I know.  What?  No! Wrong! Not, not true! I'm right in front of ya, mate!  They don't see me. They don't see me.    We should never have trusted you! Easter is new beginnings, new life. Easter is about hope. And now it's gone.  Now somebody sees me! I mean, where were you about an hour ago, mate?  Oh, that's good. Guardians Screening Script 9/6/12 Avid 113.    He made you believe? In me?  Quick, this way this way!  Dead end. Other way other way!  If you want him, you're gonna have to go through me!  Don't you even think about it!  Happy Easter!  And we'll protect you, mate.     Oh yeah, come on, come on!  Oh, crikey!     I'm just a bunny! Guardians Screening Script 9/6/12 Avid 122.  G'day, mate!        Jack, look out!  Sandy, come here!  Mate, you are a sight for sore eyes!       Everyone loves the sleigh.  Happy Easter ya little anklebiter. I'm gonna miss yah.",
        "(voice)": "",
        "Cupcake": "Grrrrrrrrrrrr...  (walla; mocking her             I will.    Let's get `em!    Whoa...",
        "Claude": "Alright! Yeah! Waahoo! Snooow daaaay!!!  I hope we can find the eggs with all this snow!    Here we go again.  And the Easter Bunny.    Are we sledding or what?  Oh!  You hit Cupcake?  Oh!            Huh?!  Cupcake?    And Santa!  I will. Guardians Screening Script 9/6/12 Avid 120.  No way!    Ooohhh.",
        "Pitch": "Ohhhh, I thought I heard the clippity-clop of a unicorn. What an adorable dream!   And look. At. Her. Precious child. So sweet, so full of hope and wonder. Why, there's only one thing missing...a touch of fear.  Hahaha! That never gets old!  Feel your fear. Come on. Come on, that's right.  Yesss. What a pretty little Nightmare.  Now, I want you to go tell the others the wait is over. Guardians Screening Script 9/6/12 Avid 28.  Don't look at me like that, old friend. You must have known this day would come. My Nightmares are finally ready. Are your Guardians?  I have to say, this is very, very exciting.  The Big Four, all in one place. I'm a little star-struck. Did you like my show on the globe, North? Got you all together, didn't I?  Or what?  You'll stick a quarter under my pillow?  Maybe I want what you have. To be believed in. Guardians Screening Script 9/6/12 Avid 48.  Maybe I'm tired of hiding under beds.  Ah, go suck an egg, rabbit!  Hang on, is that...Jack Frost? Since when are you all so chummy?  Oh good.  A neutral party. Then I'm going to ignore you. But, you must be used to that by now.    Look familiar, Sandman? Took me a while to perfect this little trick. Turning dreams into Nightmares.  Don't be nervous, it only riles them up more. They smell fear you know.      But then the Man in the Moon chose you to replace my fear with your wonder and light!  Lifting their hearts! And giving them hope! Guardians Screening Script 9/6/12 Avid 50.  Meanwhile, everyone wrote me off as just a bad dream! \"Oh, there's nothing to be afraid of! There's no such thing as the Boogeyman!\"  Well that's all about to change.  Oh look, it's happening already.  Children are waking up and realizing the Tooth Fairy never came.  I mean such a little thing, but to a child...  Didn't they tell you, Jack? It's great being a Guardian -- but there's a catch. If enough kids stop believing, everything your friends protect - wonder, hopes and dreams - it all goes away. And little by little, so do they.  No Christmas, or Easter, or little fairies that come in the night. There will be nothing. But fear and darkness and me! It's your turn not to be believed in!      The lights...why aren't they going out?  They're collecting the teeth?  Oh pipe down, or I'll stuff a pillow with you!  Fine, have your last hurrah. For tomorrow, all you pathetic scrambling will be for nothing. Guardians Screening Script 9/6/12 Avid 62.  Frost?  You know, for a \"neutral party\" you spend an awful lot of time with those weirdos. This isn't your fight, Jack.  Teeth? Why do you care about the teeth? Guardians Screening Script 9/6/12 Avid 70.    Whoa--??   Okay, easy! You can't blame me for trying, Sandy. You don't know what it's like to be weak and hated. It was stupid of me to mess with your dreams. So I'll tell you what-  You can have `em back! Guardians Screening Script 9/6/12 Avid 71.  Boo!                  Hahahahaha!...Don't fight the fear, little man.     I'd say sweet dreams, but there aren't any left.            Finally! Someone who knows how to have a little FUN!            Looking for something?  Don't be afraid, Jack. I'm not going to hurt you.  Maybe not. But you are afraid of something.  I know so. It's the one thing I always know.  People's greatest fears. Yours is that no one will ever believe in you.  And worst of all, you're afraid you'll never know why. Why you? Why were you chosen...to be like this?  Well fear not, for the answer to that...  Is right here.  Do you want them, Jack? Your memories? Guardians Screening Script 9/6/12 Avid 90.  Everything you wanted to know...  ...in this little box.  Why did you end up like this? Unseen. Unable to reach out to anyone. You want the answers so badly. You want to grab them, and fly off with them. But you're afraid of what the Guardians will think.  You're afraid of disappointing them. Well let me ease your mind about one thing. They'll never accept you. Not really.  After all, you're not one of them.  Of course I do. You're Jack Frost. You make a mess wherever you go. Why, you're doing it right now.  More to the point Jack, what did you do?  Happy Easter, Jack.  I thought this might happen.  They never really believed in you. I was just trying to show you that. But I understand. Guardians Screening Script 9/6/12 Avid 97.    To not be believed in. To long for a family.  All those years in the shadows I thought, no one else knows what this feels like. But now I see I was wrong.  We don't have to be alone, Jack.  I believe in you. And I know children will too.  Yes! Look at what we can do! Guardians Screening Script 9/6/12 Avid 98.  What goes together better than cold and dark?  We can make them believe. We'll give them a world where everything, everything is...  And Jack Frost too. They'll believe in both of us.  Very well. You want to be left alone? Done. But first...  The staff, Jack.  You have a bad habit of interfering. Now hand it over. And I'll let her go.  No. You said you wanted to be alone. So be alone!     You're all free to go! We won't be needing any Christmas toys this year, thank you! Nor ever again!     Only six left! Six precious children who still believe in the Guardians with all their h--  Make that, five. Oo! Four! Three!          Jack Frost! Let's end this, shall we?  That little trick doesn't work on me anymore.  All this fuss over one little boy. And still he refuses to stop believing. Guardians Screening Script 9/6/12 Avid 115.  Very well. There are other ways to snuff out a light.   Look how fluffy you are! Would you like a scratch behind the ears?  I can't tell you how happy it makes me to see you all like this. You look awful.  So what do you think, Jamie? Do you believe in the Boogiema...  You think a few children can help you? Against this!  Aww, you'll protect them. But who will protect you?  Still think there's no such thing as the boogeyman?        No! Get them!  Do your jobs!        You dare have fun in my presence! I am the Boogeyman! AND YOU WILL  Noooo!   No. Guardians Screening Script 9/6/12 Avid 129.  A quarter?    Really? Then what are they doing here?  Ahhh, no....AAAAAHHHHHH!!  No, no, nooooooo!",
        "Tooth": "Chicago, Sector 6 -- 37 molars, 22 bicuspids, 18 central incisors. Moscow, Sector 9 -- 22 incisors, 18 premolars: Uh oh, heavy rain advisory! Des Moines, we've got a cuspid at 23 Maple. Head out!  Wait! Guardians Screening Script 9/6/12 Avid 7.  It's her first tooth. Have you ever seen a more adorable lateral incisor in all of your life?! Look how she flossed!   Montreal, sector six: ten premolars, eight incisors and twelve canines. Steer clear of the wild goose migration.     Argentina. Priority alert! A batch of bicuspids in Buenos Aires.   Pittsburg, boy eight, two molars. Saltwater taffy.   Ontario, sector nine: five canines, two molars, and fourteen incisors. Is that all in one house?  Sorry, not all of us get to work one night a year. Am I right, Sandy?   San Diego, sector two! Five incisors, a bicuspid and a really loose molar on stand-by. Guardians Screening Script 9/6/12 Avid 12.  Hey, I hate to interrupt the, \"We work so hard once a year club\" but could we concentrate on the matter--  Ah, guys, you know what this means?  I wonder who it's gonna be?  Maybe the Leprechaun?   Well, ah, as long he helps to ah...to protect the children, right?   Tangiers! Incivie du haut, 421 rue de Barat! Allez!   Walla Walla, Washington. We've got a trampoline mishap at 1340 Ginger Lane.  Hello, Jack. I've heard a lot about you. And your teeth.   Open up! Are they really as white as they say? Yes! Guardians Screening Script 9/6/12 Avid 32.  Oh, they really do sparkle like freshly fallen snow.  Girls, pull yourselves together... Let's not disgrace the uniform.  Jack...I don't think you understand what it is we do.  Each of those lights is a child.    Last night, Jack. He chose you.  Bunny! Enough!          They, they took my fairies! And the teeth! All of them! Everything is gone! Everything.  Oh thank goodness! One of you is alright!  Pitch, you have got thirty seconds to return my fairies!  Ahhhhhhhhhhhhhh!     They, they don't believe in me anymore. Guardians Screening Script 9/6/12 Avid 51.      You should've seen them. They put up such a fight.  It's not the teeth he wanted. It's the memories inside them.  That's why we collect the teeth, Jack. They hold the most important memories of childhood.  My fairies and I watch over them and when someone needs to remember what's important, we help them.  We had everyone's here. Yours too.  From when you were young. Before you became Jack Frost.  Of course you were. We were all someone before we were chosen.  You really don't remember?  I...I can't, Jack. Pitch has them.  Oh no! Guardians Screening Script 9/6/12 Avid 54.  The children. We're too late.  What?  We're talking seven continents! Millions of kids!    Four bicuspids over there! An incisor two blocks east! Is that a molar? They're EVERYWHERE!  Ow!  Fine...sorry, it's been a really long time since I've been out in the field.  Ah, four hundred forty years...give or take.  Whoa, whoa, whoa! Take it easy there, champ! He's one of us! Part of the European division.  Ca va?  Wow! You guys collect teeth and leave gifts as fast as my fairies.  You guys have been leaving gifts, right?  Left central incisor, knocked out in a freak sledding accident. I wonder how that could have happened, Jack?  This was always the part I liked most - seeing the kids. Why did I ever stop doing this?  Thanks for being here, Jack. I wish I had known about your memory, I could've helped you. Guardians Screening Script 9/6/12 Avid 63.   Believed in.  Surprise! We came!  Shhh! You guys, he's still awake.  Hey, this is not proper Tooth Fairy behavior!  Jack, how did you do that?  Look how fast they're going out.    Awww! You know what, I got something for you. Here it is.  Look at all the pretty teeth with little blood and gum on them.  I love her! Guardians Screening Script 9/6/12 Avid 85.  I think it's time to get her home.  Jack, no! Pitch is--  Jack!    Where's Baby Tooth? Oh Jack, what have you done?    North! Are you okay?  Look! Jack!   Jack--!  Don't forget to floss!  Oh, Sandy. You're alright!  You didn't even say goodbye.  And that's for my fairies.  Keep it together, girls.",
        "North": "Still waiting for cookies!  Yes! Guardians Screening Script 9/6/12 Avid 4.  Ah, finally!  Ach!  How many times have I told you to knock?  What...? The Globe?     Shoo with your pointy heads. Why are you always under boot? Guardians Screening Script 9/6/12 Avid 5.  What is this?    Can it be?  Dingle!  Make preparations! We are going to have company.    My fellow Guardians - It is our job to watch over the children of the world, and keep them safe - to bring wonder, hope and dreams. And so, I've called us all here for one reason, and one reason only - the children are in danger.  An enemy we have kept at bay for centuries has finally decided to strike back. We alone can stop him.     Cookies? Eggnog, anyone?  Sandy, thank you for coming.    The Boogie Man was here - at the Pole.  Yes! There was black sand covering the globe.  And then a shadow!  Well, ah, not exactly... Guardians Screening Script 9/6/12 Avid 10.  Look, he is up to something very bad. I feel it, in my belly.  Please. Bunny. Easter is not Christmas.  No matter how much you paint, is still egg! Guardians Screening Script 9/6/12 Avid 11.     Tooth! Can't you see we're trying to argue.  I know it was him. We have serious situation!  Aah! Man in Moon! Sandy, why didn't you say something?   It's been a long time old friend! What is big news?   Manny...what must we do? Guardians Screening Script 9/6/12 Avid 13.    Must be big deal! Manny thinks we need help!  Jack Frost.  Guardian.    He's here.  Quiet.  Hey, there he is! Jack Frost!  I hope the yetis treated you well?  Oh, good! That was my idea! You know Bunny, obviously.  And the Tooth Fairy?  And Sandman.  Sandy! Sandy! Wake up!    How come? I tell you how come! Because now...you are Guardian! Guardians Screening Script 9/6/12 Avid 33.  This is the best part!  Of course you do!  Music!  A child who believes. And good or bad, naughty or nice, we protect them. Tooth...fingers out of mouth.  Okay, no more wishy-washy! Pitch is out there doing who knows what!  Yes! When Pitch threatens us, he threatens them as well. Guardians Screening Script 9/6/12 Avid 35.  Pick? You think we pick? No, you were chosen like we were all chosen. By Man in Moon.  You see, you can not say no. It is destiny.         Man in Moon says it is your thing. We will see!   What do you mean, \"bust in?\"  Keep up, Jack! Keep up! Guardians Screening Script 9/6/12 Avid 38.    Very nice! Keep up good work!    Step it up, everybody.      Fruit cake?  Now we get down to tacks of brass!  Who are you, Jack Frost? What is your center?  If Man in Moon chose you to be a Guardian, you must have something very special inside.  Hmmmm?  Here. This is how you see me, no? Very big, intimidating. But if you get to know me a little--  Well, go on.  Ah, but not just jolly... Guardians Screening Script 9/6/12 Avid 40.  I am also mysterious.  And fearless.  And caring. And at my center...  Look closer. What do you see?  Yes! Big eyes. Very big. Because they are full! Of wonder! That is my center. It is what I was born with. Eyes that have always seen the wonder in everything!  Eyes that see lights in the trees, and magic in the air!  This wonder is what I put into the world, and what I protect in children. Guardians Screening Script 9/6/12 Avid 41.  It is what makes me a Guardian. It is my center. What is yours?      Everyone loves the sleigh.  Bunny, what are you waiting for?  Ah, get in.  Buckle up!    Are we ready?  Good! Let's go! Clear!  Hyah! Guardians Screening Script 9/6/12 Avid 43.  Out of the way!  Hyah!  I hope you like the loopty loops!  Here we go!  Klasno! Guardians Screening Script 9/6/12 Avid 44.  Hold on everyone, I know a shortcut.  I say, Tooth Palace.  Hyah! Guardians Screening Script 9/6/12 Avid 45.  What!?  What are they!?  Here, take over!  Yah!  Jack, look out!  Tooth! Are you alright? Guardians Screening Script 9/6/12 Avid 47.  Why are you doing this?  He's gone.  This is one time I wish I was wrong. But he will pay. Guardians Screening Script 9/6/12 Avid 52.    No! No! No such thing as too late! Wait, wait, wait, wait, wait, wait, wait. Idea!! HAHH!!  We will collect the teeth!  We get teeth! Children keep believing in you!  Give me break! You know how many toys I deliver in one night?  And Jack, if you help us, we will get you your memories.    A race? Is it a race??  This is going to be... Guardians Screening Script 9/6/12 Avid 56.        Ahh! Guardians Screening Script 9/6/12 Avid 60.  Here you are!  Oh, what gives slowpokes!?  How you feeling, Toothy?     Gentlemen! Gentlemen! This is about Tooth. It's not a competition! But if it was --  I win. YEEEEEHAAAHH!  Oh no...  Sandy, Sandy!  Ah!  Candy canes...  Whuh-huh...?     Ah!  Ha. Ha. Ha. Come on!  Hyah!  Jack!  Hurry, hurry!  Sandy...  Jack! Guardians Screening Script 9/6/12 Avid 76.            Are you alright?  Done something? Jack, you stood up to Pitch. You saved us.  (putting his hand on  I don't know who you were in your past life, but in this life you are Guardian.  You will. I feel it, in my belly.     Bunny is right. As much as it pains me to say old friend, this time Easter is more important than Christmas!  We must hurry to the Warren. Everyone, to the sleigh!  Shostakovich!      We are very busy bringing joy to children! We don't have time... ...for children.  Rimsky Korsakov! That's a lot of eggs.    Okay, that's little strange.  Jack, where were you?  The Nightmares attacked the tunnels. They smashed every egg, crushed every basket. Nothing made it to the surface.  That is why you weren't here?  You were with Pitch?              Whoa, whoa, whoa...  Ah, moi deti! Come back!  Is official. My powers are kaput.  What are you doing here?  The last light!  Jack! He sees you!  Losing Easter took its toll on all of us. Bunny most of all.  Be careful, Jack!  That was good try, Jack! A for effort!  Merry Christmas!     Hyah! Wrong roof.  Welcome back, old friend!  Your center?     Leaving the party so soon?  So what? As long as one child believes, we will be here to fight fear!  They can't be my Nightmares, I'm not afraid.  Are you ready now, Jack? To make it official.  Then is time you take Oath. Guardians Screening Script 9/6/12 Avid 131.    To guard them with your life - their hopes, their wishes, and their dreams? For they are all that we have, all that we are and all that we will ever be.\"  Then congratulations, Jack Frost - for you are now and forevermore...a Guardian.    Klasno!  Time to go.  Hyah!",
        "Monty": "Ow!  She hit Cupcake.  No.  Jack Frost!  They're all real!  Whoa, yeaaaaaaaah!!!  Ahhhhhhhhhhhh!",
        "Caleb": "Alright! Yeah! Waahoo! Snooow daaaay!!!  Yeah, free candy!    That's what you said about aliens.  Did you throw that?  Really?  Grow up, Jamie.  It was a dream. You should be happy you still get dreams like that and not... Guardians Screening Script 9/6/12 Avid 96.  I can't believe this.      The Easter Bunny's real!  I will. Guardians Screening Script 9/6/12 Avid 120.  No way!    Look at that!  Ooohhh."
    },
    "imdb_rating": "7.2",
    "description": "When an evil spirit known as Pitch lays down the gauntlet to take over the world, the immortal Guardians must join forces for the first time to protect the hopes, beliefs, and imaginations of children all over the world.—DreamWorks Animation",
    "name": "Rise of the Guardians",
    "genres": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYzk3NzMxZmYtZjZjYi00NDgyLWIyNDEtYTZiZWM3ZTY2YWNlXkEyXkFqcGdeQXVyOTU2NDAzNDE@._V1_QL75_UY281_CR3,0,190,281_.jpg"
}