{
    "filename": "Rocky_script.txt",
    "imdb_id": "tt0075148",
    "imdb_url": "https://www.imdb.com/title/tt0075148",
    "characters": [
        "Fight Announcer",
        "Adrian",
        "Mike",
        "Cut Man (as Al Salvani)",
        "Paulie",
        "Apollo",
        "Rocky",
        "TV Commentator",
        "Jergens",
        "Ice Rink Attendant",
        "Gazzo",
        "TV Interviewer",
        "Marie",
        "Mickey"
    ],
    "dialogues": {
        "Fight": "... I'm gonna bust his head wide open!  In Rocky's corner he is being assisted by a shriveled, balding CORNERMAN, who is an employee of the club... He works on Rocky without any enthusiasm.   ... Tomorrow me an' my woman are gonna tip on down to Atlantic City, man.   ... It's cold, Bro'.   ... That's right, I got the city to myself...  Another paces nervously... Two other fighters shadowbox and spit nervously on the floor.  A young pug combs his hair and listens to a portable RADIO that is BLASTING MUSIC.  The fighter that Rocky has just defeated is drinking a beer and joking with three other fighters... Some of the fighters are smoking.  The room is cloudy.  A short man of fifty enters.  He is dressed in a sweater buttoned over a t-shirt.   Hey, hear ya knocked Spider Rice out in the sixth?    Hey, Rock, touch my hand.   C'mon, it's important.  Rocky touches the Fighter's bare hand.    Can ya tell I just whacked-off?  Rocky smiles and moves away.   ...Hey, Peanut, gimme some soap, Man.   Peanut, gimme some soap.  The fighters laugh.  Inflamed, Mike removes a bar of soap from his pocket and hurls it at the insulting fighter.  It hits just above the man's head.  The fighters are shocked into silence.  Mike turns and exits with Rocky... The fighters curse them loudly in Spanish.  15.    Readin' fuckin' history books, man!  The gym explodes with laughter.",
        "Announcer": "Winner, Rocky Balboa -- Next a six rounder between local lightweights.  Without pomp Rocky climbs out of the ring and bums a cigarette from a spectator... The fighter on the stretcher passes behind him.  He watches for a moment and continues up the aisle... Before he even reaches the rear of the club the BELL RINGS and the next fight has already begun... Rocky fades into the darkness of the rear of the club.   Ladies and gentlemen -- Welcome to the Bicentennial Heavyweight Championship Fight... We are very proud to have with us four former Great Champions... Ladies an' gents, 'The one and only 'Manassa Mauler' -- Jack Dempsey!'  The CROWD ROARS and JACK DEMPSEY waves and goes to Creed's corner, then Rocky's.   Former Middleweight Champion -- 'The Bronx Bull' -- Jake LaMotta!  JAKE LA MOTTA raises his fist and gives best wishes to both contenders... Timekeeper RINGS the BELL.    The man with the big punch -- Everybody's favorite, 'The Brown Bomber ' -- Joe Louis!  104.   JOE LOUIS bows and steps to Creed's corner.  Creed strikes a boxing pose and Louis tosses a playful punch.  Now, last but certainly not least -- the former Heavyweight Champion, a son of Philly, Smoking Joe Frazier!  FRAZIER rumbles to the center of the ring.  The CROWD CHEERS. Apollo puts on a show... He grimaces and gestures like he's going to attack Frazier.  His cornermen hold him back.  They laugh.  Frazier goes to Rocky's corner.   ... Now for the evening's main event -- In the corner to my right, The Challenger, wearing white trunks -- At one hundred an' ninety-one pounds, one of Philly's own sons -- 'The Italian Stallion,' Rocky Balboa!  A good CROWD RESPONSE.   In the far corner, wearing red, white an' blue -- Weighing in at two hundred and ten pounds -- Undefeated in forty- six fights -- the Heavyweight Champion of the World -- 'The Master of Disaster' -- Apollo Creed!  The arena EXPLODES and Creed puts on a display of hand speed.   Attention, please!!  Attention!! Ladies and gentlemen, tonight we have had the rare privilege to have witnessed the greatest exhibitions of stamina and guts ever in the history of sports.  The CROWD ROARS.    Ladies and gentlemen -- We have a split decision!   Judge Walker scores it eight- seven Creed... Judge Roseman scores it eight-seven Balboa.  119.    Judge Conners scores it nine- six Creed... Winner and still Heavyweight Champion of the World, Apollo Creed!",
        "Adrian": "... Could you take the puppy out --   Please -   ... Fine.   ... I'm sorry.   ... I don't know.   ... Goodnight, Rocky.  Rocky exits.  Adrian watches his departure with mixed emotions.    Paulie, you're late.  She looks at Rocky again.   ... Paulie, why didn't you tell me you were bringing him home?!  Look at me, I'm not ready for this.   No... I can't!   Paulie, please --   ... Like you?   I can't go out.   Paulie, it's Thanksgiving. I've gotta turkey in the oven.  Paulie turns and leaves the bedroom... He enters the kitchen. Grabbing a large fork, he opens the oven and spears the turkey... With the turkey suspended on the end of the fork, Paulie heaves the dripping bird out the window.  41.   Adrian has seen this and is shattered.  She runs back into the bedroom and locks the door.   It's Thanksgiving.   I think it's closed.    We could go somewhere else an' --  Rocky approaches the Cleaner.   ... Aren't you skating?   And you never got the chance?  The Cleaner yells from the sideline.   But you never had a chance to prove yourself.   Ohh!   By accident?   My mother told me just the opposite.  She said, 'You weren't born with much of a body so you'd better develop your brain.'   ... I suppose.   ... I suppose.   It doesn't bother me either.   ... It is just hard for me to understand why anybody wants to be a fighter.   I don't think you're a bum.   Morning after?  48.    Why do you do it if it hurts so bad?    'Cause you can't sing or dance?  Rocky smiles.   ... No thanks.  Adrian looks at the mirror above Rocky's dresser.  She sees a high school photo of Rocky.  He once was handsome and smooth-faced... Rocky steps up behind her and his face is reflected in the mirror.  He turns on his cheap RECORD PLAYER... He reaches into the turtle bowl.   I sold them to you.  49.    Do you have a phone?   I wanna let my brother know where I am.   Yes, I do.   Yes.   I think he might be worried.   It's fine.   It's not that --   I don't think I belong here.   No, I don't belong here.   ... I've never been in a man's apartment before.   I'm not sure I know you well enough -- I don't think I'm comfortable.    I should leave.  51.     What?    ... T-thank you.   ... What?   Don't tease me.  The woman melts into the corner and begins lightly sobbing... Rocky steps forward and fences her with his arms and body.   Paul.  57.   Rocky's interview now fills the screen.  Rocky squints and looks nervous under the hot lights.   Oh, Rocky!   You didn't!   Einstein flunked out of school... twice.   Roosevelt finished last in his class -- Beethoven was deaf, an' Helen Keller was blind -- I think Rocky has a good chance.   I don't know -- I was shocked. Why did you do that?    Absolutely -- What time should I expect you?   I'll be waiting.  Rocky is now on the ground floor yelling up to Adrian on the top floor landing.   Yes.   Don't you open them anymore?   Like?   Really -- You don't think they're overly feminine?   Don't want weak legs.  82.    -- The legs.   I thought it might be cute.   ... And he called the reporters --   Don't be mad at him -- He just wants to help.   ... Are you going to say anything to him?   Paulie!   It's not your house --   Don't talk like that to him!   ... Paulie.  Stop now!   Only a pig would say that!  Paulie smashes a small table with the bat.   You gave me what?!  Knots! You gave me knots in here every day -- you made me scared of everything!   Don't do that again!   Owe you what?   Good?  Good, Paulie?!  I've been treatin' you like a baby. Since I can't remember it's so long -- I'm the only one who feeds you an' puts you in bed when ya can't stand up -- and it's you that made me feel like a loser -- That's what ya use to call me 'Loser' -- What kind of name is that?  So can ya blame me for not remembering to talk about you when I'm with Rocky -- I don't owe you, Paulie, you owe me.  The brother flares up and threatens Adrian with the bat.   What?!    ... Yes --   Rocky, do you realize everybody in this country knows your face, and after the fight everybody in the world is going to.   What was that you said about a pet shop?   What did you say about a pet shop?   Is everything all right?   ... What?   Apollo?   What're we going to do?   Oh, Rocky -- you worked so hard.   Don't say that.   ... I'll wait for you here.  Rocky nods and she kisses him.  The fighter leaves with his trainers... Adrian is on the verge of tears.   I love you -- I love you -- I love you...  The two are swept along into the greatest night anyone can remember...",
        "Mike": "It ain't your locker no more.   Listen, I'm with you -- But ya gotta talk to Mickey -- I put ya stuff in the bag over there.  Rocky looks at his belongings crammed in a wilted shopping bag and follows Mike across the room... Mike leans his head into the shower room.  Two Latin fighters are lathering up.    Hey, Nobody -- Yeah, you, Nobody -- You don't call me Peanut.   Yeah -- See the fight last night?  Apollo Creed beat that English guy bad.   Hey, Rock -- What happened?   You'll be a very dangerous person.  Two young boys in street clothes interrupt Mickey.   ... we got visitors.  Mickey strains his eyes to see a group of REPORTERS and NEWS CAMERAMEN entering his gym.   Don't chance it, man -- He's sick.   Why you tryin' to cut 'im, man! Back off, scumbag, or I'll bite your face!  Dipper cuts loose with a hook and knocks Mike flat.  The room reeks of fear... Apollo's eyes flick back and forth between Rocky and Dipper.  Apollo taps his bodyguards and they begin to ease away.   Ya sappin' his strength -- He's losin' steam.   No more, ya wanna lose an eye? No more.  114.    Ya gave it ya best shot!",
        "Paulie": "Yo, Rocky -- Look at this mirror.  I'd like to kill the friggin' moron who broke this mirror.   What?   Forget her.  You could do better than my sister.    Looks, huh?   My sister's a friggin' loser.   Sometimes she gets me so crazy, I'd like to split her head with a razor.   Ya caught me in a bad mood.   ... Adrian ain't sharp.  The restroom stench is overwhelming... Rocky covers his nose with the neckline of his t-shirt.    She's a loser -- She don't enjoy life -- She reads -- Brainy -- Pushin' thirty friggin' years old!  She's gonna die alone if she don't wise up.   An' you're dyin' alone, too.   (pointing at the wall I wanna kill the friggin' moron who broke the mirror.   The girl's dryin' up!  She's gotta live a little before her body dries up!!  You're a pal, Rock -- How 'bout yo' talk to her?  Y'know, it's Thanksgivin' tomorrow.   Tomorrow you come for some bird, right?   I hate the friggin' game... I'd like to talk some business.   Look at my hands -- See how the joints are swollen.  Paulie extends his thick hands and tries to make a fist.    Inflamed joints -- Walkin' in an' out of a freezer carryin' meat plays hell on the joints.   I don't need a doctor, I need a different job.   Do me a favor -- Talk to Gazzo. Tell him I'm a friend an' would do a good job... Tell him I ain't bothered by nothin' an' would be a great collector... Bustin' bones don't bother me -- Tell him I'm a good worker.   I'm askin' ya to go to him -- As a favor.   You know her?  Rocky shrugs and the two men move off... Filling the night air is the METALLIC SOUND of pitching QUARTERS.    The men arrive at Paulie's home.  It is at the top of a dimly-lit four story walk-up.  39.    Yeah, sure -- She's very excited.    Paulie unlocks the apartment door and enters... Rocky stiffly follows.  Paulie's sister steps out of the kitchen. A large serving spoon is in her hand... The TV is on.  She stops short and eyes Rocky... She is visibly unsettled by Rocky's unexpected presence.   Did you call the hospital?  If I'm ten minutes late, she calls the hospital.  Adrian enters the bedroom and slams the door... Paulie follows.  An argument ensues and Rocky overhears.  OVER the argument is HEARD a SPORTS BROADCAST rising from the TELEVISION.   Like it would make a difference if you were, right?  This guy's a friend and now he's takin' ya out.   Ya, ya goin' outta the bedroom an' I don't wanna know from nothin'.   Hey, I want ya out instamaticly. -- I'm sicka lookin' at ya hangin' around like a friggin' spider -- Go out -- Live!  Do, enjoy life.   Don't get wise with me.  I want ya to stop bein' a loser.   Why?   !! Ya want the bird, go out in the alley an' eat the bird -- I want ya outta the house -- Enjoy ya friggin' life... Ya hungry, Rock?   Forget nothin' -- Here, talk to my sister, tell 'er somethin' nice.  Rocky walks over to Adrian's bedroom door and begins speaking to the enclosed girl.   Try again, c'mon, try again.  Rocky goes over to the door and begins speaking again.   Ice skate.    Rocky and Adrian are at her home watching an old black and white television... Rocky smiles... The film now cuts to Apollo being interviewed.   Do me a favor -- His lungs, punch 'em out.    Christ.  58.     The guy's a friggin' moron.   Don't it matter none he's makin' ya out a fool? -- I'd break his lips.   He's takin' cheap shots.   Yo, Rock -- now ya'll be lookin' for people to help, right?  59.    Y'know, to help keep ya livin' clean.   Ya gotta have a guy help ya exercise, mebbe somebody to be standin' by with a towel or run errands, y'know.   Without havin' good people around, ya won't have such a good chance.  Adrian is not happy with her brother's overbearing attitude. She faces him.   That so.    Rocky stands in Adrian's doorway.  He kisses her.   How ya feelin'?   I got whiskey here.   This is the guy who's fightin' Apollo Creed.   (as though rehearsed badly Hip -- Hip -- Hooray!  C'mon -- Hip -- Hip --  71.    Rock'll be comin' by every mornin' to pick up some Prime -- can't train on that store crap.  Rocky smiles and Paulie leads him out of the office and to the large metal door of a walk-in refrigerator.    If ya don't pay Gazzo, ya end up hangin' on the hook, right?   How 'bout you talk to 'em about me?  Please do me that favor.   Y'know, d'ya think you an' my sister -- Ah, doin' good together?   Ain't sure, what's the story?   The story -- what's happenin'?  Paulie speaks like a man who has been mulling this over for quite a while.    Ya really like her?    What's the attraction?  I don't see it?   What gaps?    You ballin' her?    C'mon, ya screwin' her?  From across the room Rocky looks him hard in the eyes.   Hit the rump.  The rump! Ya'll break the ribs!  Rocky speeds up and continues pounding on the second row of beef.  Paulie's eyes widen and his face grimaces with every punch, like he were receiving it.  Rocky moves into the dark recess of the refrigerator.  Only the dull SOUNDS of his POUNDING FISTS can be HEARD.  Rocky works his way to Paulie again.  Every hanging beef swings and appears surrealistically alive.    We do that to Creed an' they'll take us to jail for murder.  Rocky looks at his hands.  They are drenched in red up to the elbows with beef blood.  Paulie hands him a package of beef.   Yo, Rock.  I made a few phone calls an' thanks to me ya goin' to be a big man -- Thatta dog?   To see ya train.   I thought I was doin' ya a favor -- C'mon inside -- Y'know, my sister really likes ya.  Rocky follows Paulie inside.    It is a moonless night and Paulie staggers across the street and enters his building... He staggers up the stairs.    Paulie removes his coat and tosses it listlessly in a chair... He rubs his red eyes and sways into the kitchen.  He takes a bottle of wine out of the icebox.  As he swills the wine he hears the SOUND of Rocky's and Adrian's VOICES traveling from his sister's room.  Paulie's face tightens and he staggers towards the bedroom.  He stands outside the bedroom door and peers through a crack... Rocky, Adrian, and the dog are watching TV in the otherwise darkened room.   Nothin'!  I want nothin' from you!!!   Shutup!  I want nothin' -- I ain't no charity case!  Get outta my house!   You ain't no friend no more -- Go home!  Outta my house I want ya!   Get outta my life both of ya's.  Paulie kicks the door out of frustration and appears to be bordering on a nervous breakdown.    Outta my house I want ya!!  87.    I don't want ya messin' up my sister no more -- He's scum from the corner, I don't raise ya to hang with no bum!  Adrian is speechless... Rocky moves towards Paulie.   (continuing; raising the bat ... Wanna hit on me?  C'mon -- C'mon, I'll break both ya arms so's they never work...  Rocky freezes...   I want 'im outta here --  Don't think I'm good enough to work for Gazzo?  That's what I think of bums like you an' Gazzo!  You're goin' up an' don't care enough to throw Paulie some crumbs!  I give ya meat, an' I give ya my sister, too!    You forget what I went through to give ya the best.  88.    I always seen ya had the best, but did ya ever think of puttin' in a good word for me with this scumbag!  Paulie smashes a large lamp with the bat.   Get away from me -- I could never even get married 'cause you couldn't live by yaself -- ya'd die by yaself!  So instead I put you two together -- Did ya think of puttin' in a good word for me? -- You owe me!   You owe me an' are supposed to treat me good!   You busted?!  89.    You a virgin? -- Ya let 'im in ya pants, didn't ya!  Ya pulled down ya pants an' let him have it, didn't ya!!  Mortified, Adrian runs to her room... Rocky steps to Paulie.    ... I can't haul meat no more.   Christ, I been beggin' ya for a break until I'm sick inside.   Yo, Rock, I think I found an angle to make some bread usin' ya name, ya mind?  Exhausted, Rocky studies Paulie's face a moment and nods 'yes.'... Rocky sways into the shower room and Paulie strides off.",
        "Apollo": "Very high an' very fast.  Apollo's crowd smiles almost automatically at everything he says.   He was big, an' very nasty so I destroyed him in a hurry -- Now I'm gettin' ready for Mac Lee Green next month.   That's right -- It's gonna be the greatest sportin' event in this country's history -- A gala occurrence!   The Bicentennial Heavyweight Championship of the World is gonna be held in the only place it can be held -- Philadelphia! -- the nation's cradle -- January First -- the first major event of our two hundredth year.   Me an' my wife are goin' home 'cause we miss our children an' can't go no more time without seein' them.   (looks straight into the camera ... Stay in school an' use your brains, dig -- Be a lawyer, be a doctor, carry a leather briefcase an' forget about sports!!  Sports can only make ya grunt an' smell -- Be a thinker not a stinker!!  Apollo's entourage laughs and they move on... The Commentator faces the camera.   Damn.   Solution, nothin' -- What about the Bicentennial fight.   You best find me another ranked contender an' I mean in a flash, man!   Then gimme Buddy Shaw -- He's ranked fifth.  32.    Shape, nothin' -- They're afraid.  They know everybody in the world's gonna see this fight an' none of them gotta prayer of beating me so they're makin' excuses so they don't have to be the chump that's gonna be whipped in front of the whole civilized world!!   I do -- Maybe what this fight needs is something new -- a novelty.   Give my main man a raise!!  Everyone laughs.    Now here's what's goin' down. Listen, 'cause I'm gonna say this but one time.  On January first, the first day of the Bicentennial I'm gonna fight me a local poor underdog, dig? A snow-white underdog.  An' I'm gonna put his face on this poster with me, hear?  An' I'll tell you why, 'cause I'm sentimental -- An' all the people in the country all sentimental, man, an' they'd like nothin' better than me, Apollo Creed, to let some unknown get a shot at the greatest title in the world on this country's biggest birthday. Now that's the way I see it an' that's the way I want it!!   No, man, it's very smart.  34.    How 'bout this Billy Snow?  36.    How 'bout this Big Chuck Smith?   ... I don't feel heat from the name.   ... Still don't feel no heat.   ... This man.  Everybody leans forward.   (continuing; much amused 'The Italian Stallion' -- He's my man.   Don't matter -- That name. 'The Italian Stallion,' it's right on.  Who discovered America?  An Italian, right?  So, man, what could be better than to get it on with one of his ancestors --   Listen, I gonna carry this boy three rounds, then drop 'im like a bad habit.   Southpaw, nuthin' -- I'll drop 'im in three -- 'Apollo Creed meets the Italian Stallion.' Shhiii -- Sounds like a damn monster movie!!  Everyone laughs.   I like my Philadelphia Brothers. An' I'm patriotic!  Apollo has to move to the side to avoid a thrusting microphone.  56.    (continuing; mock seriousness If yo' don't back up I'm gonna send yo' home with a microphone in yo' nose!  The Reporters laugh.   If history proves one thing, everybody gotta chance -- Didn't yo' all ever hear of David an' Goliath? -- 'Course I woulda knocked out Goliath.   The same coincidence that he's fightin' a black man.   He's Italian.   It means if he can't fight, I bet he can cook!  Rocky and Adrian laugh at the interview... Paulie, her brother, takes offense.    I am the Champion of the whole world!!!  The gym freezes... everyone turns and stares in wonderment... Mickey Goldmill shakes his head in disbelief.  He now realizes it is a publicity stunt.     Italian Stallion, I come over to tell you to be very smart an' after this fight donate what's gonna be left of your body to science, cause after this fight what's left won't fill a tuna fish can!... So beware, Mon Cher!!!  Apollo turns to the cameras... Rocky is speechless.    This classic fight -- Tha's right, this bicentennial fight's goin' down in the history books 'cause January first I'm gonna be the first man to bounce another man offa the planet Pluto!  Dipper stands in the far ring... the attention Rocky is receiving makes him a killer.    Now I gots a special announcement, y'hear.  For the first time in alotta years this championship fight is gonna be on your home T.V.! Free -- 'Course that's just for Philly -- My present to the city...   78.    Now some ya'll ain't much on likin' me, but ya gotta admit Apollo Creed is one DAMN generous, 100% pure, government inspected, Afro-American Folk Hero!!!  Everyone laughs... Dipper moves across the room like a large snake.  He brushes people aside and steps behind Rocky.  He nudges him... Rocky thinks it is an accident and ignores it.  Dipper pushes harder and Rocky looks questioningly at him.   How much is being channeled into West Coast closed-circuit advertising?   Make it four hundred an' fifty.  Send two hundred roses to the mayor's wife from me, get a picture an' make sure it gets all the papers.   Yeah, I'd like to get Canada -- see, if we can get a tax break -- Gimme the figures on the Program Concession.  Meanwhile, the trainer sits across the room in a darkened corner looking at a small television.  He is watching Rocky's bloody exhibition on the news...  He waves at Apollo.   I mean business, too --  The gross rental of the arena is gonna include the four hundred ushers, right? -- Gimme some coffee.    Apollo Creed sits in his dressing room... It is dead silent except for some NOISE that filters under the door from the arena.  99.   It is a CLOSE-UP of Apollo's hand being taped... The RASPING SOUND of the adhesive tape is very pronounced.    Apollo's other hand is being wrapped.  Dead silence except for the TAPE and APOLLO'S BREATHING.    CLOSE-UP of drops being placed in his nose to help increase his intake of oxygen.  The tremendously magnified SOUND of     A heavy coating of vaseline is applied around the Champion's eyes... In an EXTREME CLOSE-UP, the eyes shine brightly with the grease.    CLOSE-UP of Apollo's trainer digging his fingers deeply into the thick neck muscles of Apollo's upper back and neck.    Apollo's trainer slips a mouthpiece into Apollo's mouth. Apollo shakes his head and the trainer removes it and places another one in the champ's mouth... Creed nods yes.   I want you!  I want you!  The crowd loves the taunting.  Apollo Creed floats back to his corner.   ... Come at me, sucker!  Rocky charges and a terrific right crashes against Apollo's chin, followed by an uppercut to the liver that causes Creed to cringe...  107.   Apollo counters with jabs and Rocky whips brutal combinations to the body.  The BELL RINGS.    Apollo does not sit.  He stands and clowns with the spectators to prove he is not hurt.    ... That boy damn near broke my arm.   I'll carry him 'till the third.   Man, I rearranged his face with that right -- The people love what's happenin' tonight.    ... That man's takin' his job too serious.   He got lucky.   C'mon -- Lemme cut yo'!  Rocky wades in and Creed employs incredible footwork.  He sets himself and cuts loose with a thunderbolt right cross to Rocky's already broken nose.  Blood sprays from the wound and red droplets drip from his chin...  Rocky takes a merciless beating and is staggered by a torrent of combinations.  Rocky's eyes are closed.  But Creed cannot drop him... The BELL RINGS.   My side.   No doctor!   No doctor!... I'm feelin' good, bro!   ... Ribs broke --  Blood trickles from the corner of Apollo's mouth.  The Trainer feels the ribs.   One more round.   ... Stop jivin'!   ... Thanks.   ... Ain't gonna be no rematch.",
        "Rocky": "by      Sylvester Stallone                            Hey --   ... Just gimme the water.  2.   A FIGHT FAN rushes up to Rocky... He is sixty-five, with yellow teeth and wearing sunglasses.   Absolutely.   ... I just want the mouthpiece.  The BELL RINGS... Rocky makes the sign of the cross.  The fighters engage in battle.  The other fighter grabs Rocky in a clinch and purposely butts him... The butt opens a bleeding cut on the corner of Rocky's eye.  Rocky becomes furious over the foul and drives a flurry into the man's body... Rocky slams the man on the jaw and the fighter is out for the night.  The fans throw rubbish into the ring.  Rocky ignores it.  The fans loudly go about collecting bets.  The referee does not bother to even count the fighter out and drags him under the ropes where he is placed on a stretcher.  Two new fighters enter the ring.  Rocky slips on a tattered robe. Embroidered clumsily on the back is, \"The Italian Stallion.\"    I'm a fighter.  4.     A short while later, Rocky approaches his apartment located in the most deprived section of South Philly.  He kicks away the litter that has gathered against the apartment steps and enters.    The narrow hallway is painted olive brown.  A single light bulb illuminates the gloomy corridor.    Rocky enters.  The one-room apartment is drab, with a curling boxing poster of Rocky Marciano tacked on the wall... Nailed against the far wall is a mattress.  The mattress is used as a punching bag.  Stuffing spills out of the center.  Rocky drops his coat on the floor.  He puts on a pair of glasses.  He crosses to a small turtle bowl... He lifts the creatures.   ...Look who's home.  Rocky starts to boil a pan of water on his hot plate, then places an old 45 RPM record on a battered phonograph.  The record is a tune, \"ALL IN THE GAME.\"  ... As the CRACKLING MUSIC BEGINS, Rocky picks up his hairbrush.  Using it like a microphone, he mimes to the record.  He assumes the posture of a famous singer crooning to thousands of adoring fans... He then switches into a bullish fighting stance and throws several punches.  The water boils.  Rocky soaks his badly-swollen hands.  5.    Real good.   Yeah, here an' there.   Mr. Gazzo wants the two hundred now!  6.    Mr. Gazzo says I should get two hundred or break the thumb.   Goin' fishin'?  The man drops the hook.   What's ya name again?   Look, Bob, if ya wanna dance, ya gotta pay the band -- If ya borrow, ya gotta pay the man... Me, I ain't emotionally involved.  Rocky's determined expression strikes home.  The fat man quickly fumbles through his pockets and hands over a small wad of bills.    A hundred an' thirty.   That's it? -- Completely?   What about for food an' stuff?  7.    ... The juice is climbin' every week.   Ya still light seventy.   ...That's what coulda happened.   8.    ... How's the turtle food this week?  9.    Me, I'm kinda aggravated.   Ain't your fault - Here's the problem.  Adrian nods... Though charmed, she is slightly intimidated.   The last food I got here had more moths than flies -- An' the moths get caught in my turtle's throat -- That makes them cough --  The OWNER, a squat woman of forty, steps out of the back and waves at Rocky.    Yo, Gloria -- I was talkin' about the turtle food -- Like I was sayin', the moths get caught in the turtle's throat an' makes 'em cough...  A little cough an' I gotta smack 'em on the shell -- An' whatta think they get?  Adrian shrugs.    I smack 'em hard on the shell an' they get... What?   Shell-shocked!  Both the Owner and Adrian smile.  10.    Inventin' jokes ain't easy.  Rocky steps over to a large cage at the rear of the shop... Inside is a huge dog.    How's Butkus this mornin'?   Yo, Butkus -- Dead.  Play dead.  The dog plays dead.   ...What kinda dog is this again?   The owner was suppose to pick him up three weeks ago.   He only had a hundred an' thirty. -- I think he's good for the rest next week, Mr. Gazzo.   ... Fine.  Gazzo's Bodyguard looks at Rocky's bruised face in the mirror and smiles.   Of wa?   I figure if I break the thumb this guy gets thrown outta his job and can't pay nothin no more.  12.    The third -- Shoulda seen it.  Rocky passes another FIGHTER punching the heavy bag.   How come?    ... These ain't my clothes.  14.   He sees a picture of several black girls taped on the inside of the door.    ... These ain't my pictures.  A short powerful man of thirty-five enters.  His hair looks like it has been shaped with hedge clippers.  His name is  Yo, Mike -- What's happenin' here?   Whatta ya talkin' about it ain't my locker no more?   You were ready to bite that guy's face.   Creed's great.  Mike fakes a friendly punch at Rocky and hurries off to another chore...   Hey, how ya feelin', Mickey?   I said, how ya feelin'?    Yeah.  16.    I was talkin' with ya man, Mike. -- Hey, how come I been put outta my locker?   ... Tomato?   ...What?   Come July, twenty-five.  17.    Twenty-five, thirty -- What's the difference? -- It took me two months to learn the combination of that locker.   Yeah, they're goin', -- that's nature... That was my locker for six years.   Yeah --   Yeah, Kayo.   Spider Rice.   You think everybody I fight is a bum.   Listen, I'm gonna take a steam -- Did good last night -- Shoulda seen it.   ...No.   Yeah, sure.  Shrugging, Rocky moves away.    ...I think I'm gonna take a steam -- Shoulda seen me fight -- Did good, y'know.  Mickey leans over to Mike who approaches with a mop and pail.   ... Wow -- cold!  Good night to catch pneumonia.  Adrian smiles slightly and moves behind the counter.  Rocky fumbles idly among the pet toys.    Ah -- I came in here for somethin'... Oh, yeah, would ya like somebody to walk ya home?  The girl wants to say yes but a tremendous inferiority complex will not permit it... Rocky understands.    Hey, how's my buddy doin'? (looks into Butkus' cage -- Nice dog -- Well, I'll see ya later.   Catch pneumonia out there -- Seen Paulie?  Andy casually nods towards the men's room.  Rocky traverses the room and passes TWO DRUNKS leaning on the bar.   Yo, Paulie.   Yo, Paulie.   Your sister's givin' me the shoulder.   Every mornin', every night I pass by -- I smile.   21.    I say jokes.  Nothin'.  She looks at me.   Yeah, like I was a plate of leftovers -- Somethin' wrong with my face -- Whatta I need, a Caddy to connect with ya sister?   Hey --   Don't get mental, man.   Ya always in a bad mood --   I'm thirty myself.  22.    I don't see no crowd around you, neither.   Let's get outta this stink.   ... Sure.   Absolutely...  Paulie smiles and Rocky guides him to a booth... Rocky steps to the bar.  Andy leans over to him.   Clown.   He took his best shot an' became champ -- What shot did you ever take?   ... No wine -- Bad for ya' brain.   No wine.   Why?   No dollar.    ... That's an old one.   Is that Marie? -- Marie, ya brother know you're hangin' out so late?  The girl, MARIE, assumes an indifferent attitude, attempting to impress her friends.    What'd you say?   Did these guys teach you to talk dirty?  Huh?  27.    What?    Don't you never say that --  -- You guys talk like that in front of a little girl -- You guys are scum.   Don't ya never come round this girl -- Go home.   Pull heat on me? -- I'll dent ya face!  Rocky leads the girl away.   How come ya wanna hang out with those guys?  They teach ya bad things.   Hey!  When I was your age, there was only one girl who talked like that in the whole neighborhood.   Make your teeth yella --   Makes your breath like garbage.   Nobody likes garbage -- Anyway, this girl with the dirty mouth wasn't bad lookin', but the guys wouldn't take her out for any serious datin'.   'Cause that's the way guys are -- They laugh when ya talk dirty.  They think ya cute for a while, but then ya getta reputation an' watch out.   29.    Nobody's ever gonna take ya serious.  Ya get no respect... I gotta use a bad word -- Whore.  You'll end up maybe becomin' a whore.   That doesn't matter -- You don't really have to be a whore, just act like one an' that's it.   Yo, a bad reputation -- Twenty years from now people will say 'D'you remember Marie?' 'No, who was she?' 'She was that little whore who hung out at the Atomic Hoagie Shop.' 'Oh, now I remember!'... See, they don't remember you, they remember the rep.  Rocky and Marie exit the dark school yard... Standing in the shadows of the building are three young muggers.  The light from their cigarettes flares red in their faces.  The muggers pace Rocky across the street and follow them down the block... Rocky sees them and stops and faces the three.  The muggers pause and study Rocky from a distance of twenty yards.  Rocky gives a loud boxer's snort, wipes his nose with the side of his thumb and rolls his shoulders... The muggers are intimidated and slowly peel off the meander away.  Rocky turns to Marie who has been standing behind him.   (points down the block ... That's your house, ain't it?  Marie nods.    Listen, I hope ya don't --  30.    What was I gonna say?   Ya, somethin' like that.  They exchange smiles and Marie moves away.  Rocky has made an impact on her life.   'Night, Marie.  She takes a few more steps and pauses again.    ... Yeah, who're you to give advice, Creepo.   Next Wednesday I grab a grand from Snyder.  An' Thursday two yards from Cappoli, okay?   Ya sure?   How'd you know?   Paulie's sister.    She ain't retarded, she's shy.   Does that bum have to say that?  The Bodyguard reddens... Gazzo motions to his Bodyguard to relax.  35.    He's always in a bad mood.  Count ya blessin's.  Ya a healthy person -- ya legs work -- ya hands work --  The Bodyguard has been looking at Rocky with murderous eyes.   Don't like yours neither.   Move your shoulders down.  Mr. Gazzo is amused.  He steps out of the car, followed by Rocky.   Yeah.   Thanks, Mr. Gazzo.  Rocky enters his apartment and Gazzo drives off.    I usta be deadly at half-ball.   What kinda business?   Maybe ya should see a doctor.  38.    Maybe another job is the best thing.   Gazzo's gotta come to you.   Gazzo's gotta come to you -- Hey, Paulie, it's a bad job -- Do what you do now.   Ya sister knows I'm comin'?   Maybe ya better forget it.   ... Yo, Adrian, it's me, Rocky... Ah, ah -- Ah, it's kinda hard for me to think of somethin' to say, y'know -- 'Cause I never talked to a door before, I mean whatta ya say to a door.  Rocky turns away and begins to walk off.    ... Maybe I better forget it.   Ah, Adrian, I know ya ain't too happy at this moment, but would ya do me a favor -- I ain't got nobody to spend Thanksgivin' with -- How 'bout you an' me goin' out -- Get somethin' to eat, maybe laugh a little, who knows... Would ya like, I dunno, go out together?  Adrian opens the door... She already has her winter coat on.  42.     We'll have a good time.  Paulie opens the front door and gives Rocky an encouraging smile...    What's ya sister like to do?   I didn't want no turkey anyway.   To you, to me it's Thursday.   Looks quiet, y'know.   I think mebbe we're early or somethin' --  From across the rink a CLEANING MAN yells at them.    Are ya closed to the General Public or to just everybody.  43.    Wait here, gotta smooth this guy out.   Listen, I gotta problem.  This girl ain't feelin' well, y'know -- The doctor says she should exercise, y'know once in awhile an' ice skatin' is the best thing --   Look at her, ya can see she ain't feelin' good -- needs a few minutes exercise --   ... Ten minutes.   ... Yeah, give 'er the Blades.   Ain't skated since I was fifteen -- That's when I started fightin' -- gotta watch the ankles.  Yeah, fightin' use to be tops with me, but no more.  All I wanted to prove was I weren't no bum -- That I had the stuff to make a good pro.   Hey, I ain't cryin'... I still fight.  Kinda do it like a hobby.  See I'm a natural southpaw an' most pugs won't fight a southpaw 'cause we mess up their timin' an' look awkward -- Southpaw means lefthanded... But I guess in the long run things probably worked out for the best, right?   Absolutely.   I just dislocated my finger.   It ain't your fault -- I originally done it in the Baby Crenshaw fight.  That's me fightin' Big Baby Crenshaw -- Big Baby was the size of an airplane an' I broke my hands on his head -- I lost, but it's a nice picture, don't ya think?   How 'bout some Cokes?   This guy is beautiful -- get the Cokes.  Adrian does a slight turn and Rocky has to speed up and nearly falls.    See, I ain't graceful, y'know -- I don't move good -- Stink as a dancer too -- But I can really swat, I hit hard,real hard, but I'm a southpaw an' nobody wants to fight a southpaw! -- Havin' a good time?  Adrian nods and is very nervous... The Cleaner moves carefully across the ice.    Y'know how I got started in the fight racket?   Yeah -- My ol' man who was never the sharpest told me -- I weren't born with much brain so I better use my body.  For the first time, Adrian laughs.    What's funny?   I must be goin' deaf 'cause I thought ya said, 'ten cents.'  Rocky hands him a dime.   Charge it.  Rocky and Adrian start to leave.  Rocky pauses at the door and fishes into his pocket and hands over eleven dollars.    Had ya goin', didn't I, huh?  He grins and leaves.  47.    Some people are very shy by nature.   I would say you're very shy bu nature.   Some people think bein' shy is a disease, but it don't bother me.   Then why did I bother bringin' it up?  'Cause I'm dumb, that's why... Y'know, I think we make a real sharp coupla coconuts -- I'm dumb an' you're shy.   Ya gotta be a little soft to wanna be a pug... It's a racket where ya' almost guaranteed to end up a bum.   ... I'm at least half a bum. Yeah, fightin' is a crazy racket.  The roughest part is the mornin' after.   After a rough fight, ya' nothin' but a large wound. Sometimes I feel like callin' a taxi to drive me from my bed to the bathroom... Ya' eyes hurt, ya' ears hurt, ya' hair even hurts... But the thing I'm proud of is I been in over sixty fights an' never had a busted nose -- Bent an' twisted an' bitten but never broke... That's rare.   ... Guess.    Rocky and Adrian enter his one-room apartment... She is nervous and taken aback by the bleakness of the room... Rocky goes to the icebox.   Would ya like a glass of water?   Here's the guys I was tellin' ya about -- This is Cuff an' Link.    ... Oh, yeah, I bought the whole kit -- Yeah, ya sold me the turtles, the bowl, an' the mountain -- I had to get rid of the mountain 'cause they kept fallin' off.   I had it pulled.  People callin' all the time.  Who needs it -- Who'd you wanna call?   D'you really wanna call?   You sure?   Why?   I'll call your brother.  Rocky flings open the window and bellows like a foghorn.    !!Yo, Paulie -- Ya sister's with me!  I'll call ya later.  Rocky closes the window and faces the woman... She is not smiling.  She looks frightened.  50.     What's the matter?  Ya don't like the room?   It's only temporary.   What's the problem?  You don't like me -- Don't like the turtles -- What is it?   It's okay.   It's all right -- You're my guest.    They're all the same.   Yo, I'm not comfortable either.   But I'm willin' to make the best of this uncomfortable situation.  Adrian moves to the door... Rocky intercepts her.    Would ya take off your glasses?   The glasses... Please.  Rocky removes her glasses and looks deeply into her eyes.   Do me another favor?   Could ya take off that hat.  After a moment, Adrian removes the hat... She is becoming rather pretty.    I always knew you was pretty.   I wanna kiss ya -- Ya don't have to kiss me back if ya don't feel like it.  Rocky softly kisses the woman... Her arms hang limp.  He puts more passion into the kiss and she starts to respond. Her hand glides like smoke up his back.  52.   She embraces his neck.  The dam of passion erupts.  She gives herself freely for the first time in thirty years.   'Bout what?  Mickey Goldmill steps out of his office...   Message -- What message?  Mickey pulls out a card from his breast pocket... He hands it to Rocky.   Ya puttin' me on?   When was they here?  53.    Probably lookin' for sparrin' partners.   Balboa, Rocky Balboa.  The Secretary rises and enters Jergens' office... Rocky eyes the multitude of sporting pictures hanging on all four walls.  The Secretary returns.   ... Thanks.    Rocky.   No -- Just me.   Sparrin'?   I know ya need sparrin' partners -- I'm very available.   Absolutely -- Sparrin' with the Champ would be an honor -- y'know what?   I wouldn't take no cheap shots. I'd be a good sparrin' partner.  55.   Jergens seems very amused.  He lights a cigar.   ... Like I said, I'd make a boss sparrin' mate.   Sure, an' I'm smart enough to know that no sparrin' partner should take cheap shots at the Champ.  He's just there to help condition the man.   ... Ah... Absolutely.  The SCENE FADES and becomes a black and white television.   Feel?  I dunno... Happy.    Creed's great, ain't he... I'll do what I can.   I thought of it 'bout eight years ago, when I was eatin' dinner.   Four hundred -- But that was a long time ago.   Listen, I wanna say hi to my girlfriend -- Yo, Adrian!  Adrian blushes and laughs.   Sure I did.  You heard.  They continue to watch the remainder of the interview... The head COMMENTATOR is looking directly into the camera.   Why?   It don't matter.   It don't bother me none.   Help what?   I'll do okay.   Hey, who cared about me yesterday, huh?  Nobody -- I think I'm gonna train myself.   See ya tomorrow.  Rocky moves down the stairway and continues to do so as he converses with Adrian who remains upstairs.  His VOICE ECHOES up the stairwell.  60.     How'd ya like hearin' ya name on TV?   Ya puttin' me on, right?   'Bout seven.   Y'know how I said that stuff on television didn't bother me?   It did.  As Rocky completes the last word, he exits the building and slams the door which RESOUNDS throughout the apartment house.   Y'know I won't be able to work for ya no more.   I feel bad about walkin'.  61.    A few bucks.  Gazzo takes out a wad and peels off several bills.   Do I have to pay juice?  Gazzo looks at the Bodyguard and shakes his head as if to imply, \"Why's this guy asking such a foolish question?\"  Gazzo and the bodyguard step to the white Caddy parked at the curb.  They enter the cab.  Rocky watches.   Gonna try.   No action.   I'm gonna do somethin with it.   Black market?   Yo, you gonna show, Tony?    Rocky returns home and enters his apartment.  After turning on the light, he flips on his RECORD PLAYER.  He now feeds the turtles.   Look who's home!  Rocky notices two telegrams laying inside the threshold.  He approaches them with a sense of awe.  He opens and reads one. Settling on the bed, he reads the other.  A KNOCK is HEARD.  Rocky opens the door.  Mickey Goldmill, the gym owner, stands framed in the doorway.   Hey, Mickey -- Whatta ya doin' here?  Here, sit down.  Rocky tosses soiled clothing off a mangled armchair.    Best seat in the house -- Hey, Mick, this is too much.   I'm usta seein' ya at the gym, but seein' ya here, in my house, it's kinda outta joint.  By the manner in which Goldmill listens, it is obvious something important is preying on his mind.  Rocky is slightly uncomfortable, almost embarrassed at having outsiders see how he lives.   Yeah.  64.    Freak luck for sure.    Freak luck is a strange thing.  Mickey does not hear.  His attention is drawn to the turtles.   Turtles -- domestic turtles.    Fifty years, huh.  65.    How 'bout a glass of water?    ... What?    Ya got a good mind for dates.  Mickey deafly continues, becoming more engrossed every second.   Nobody ever said that -- There's his picture.   Really think so?   Heart, but I ain't got no Tocker.  Rocky shifts against the wall and lowers himself into a crouch.   ... Ya gave Dipper my locker.   The fight's set -- I don't need a manager.   I got pain an' experience too.    Whatever I got, I always got on the slide.  This shot's no different.  I didn't earn nothin' -- I got it on the slide... I needed ya help about ten years ago when I was startin', but ya never helped me none.  Mickey drops the ashtray and kneels to pick it up... He remains on one knee.   I asked, but ya never helped nothin'! -- Like the Bible sez, ya don't get no second chance.    Rocky races up the block toward the shadowy and hunched form of Mickey.  Way in the distance, we SEE Rocky stop the old man beneath a street lamp.  He places an arm around his shoulder.    The following morning, Rocky's ALARM CLOCK GOES OFF at exactly four A.M.  Not accustomed to rising this early, with great difficulty Rocky staggers to his feet and wavers to the bathroom.  He turns the light on and roaches scatter.  At the top of the mirror hang the telegrams.  Rocky fills the basin and submerges his face in cold water.  Rocky sways to the icebox and removes a dozen eggs.  He cracks five raw eggs into a glass and downs it in one swill... his body quivers.    Rocky steps outside.  He is dressed in a well-worn sweat suit with a hood, gloves and sneakers.  It is pitch dark and his steaming breath attests to the cold.  He begins running down the center of the deserted street. He can only be clearly SEEN as his form passes beneath the street lamps.  Two garbage men stop hoisting cans to watch him pass.    ... Tight.   ... No.  Rocky notices TWO PUERTO RICANS lounging alongside theshipping office.   Gazzo's a good man.   Keep this job, ya eat better.  Paulie opens a jackknife and idly jabs the hanging meat.  He swills whiskey from a pint bottle.   Whatta you think?   What?  72.    Sure I like her.   I dunno -- she fills gaps.   (shrugs and takes meat She got gaps.  I got gaps -- together we fill the gaps.    Don't talk dirty 'bout ya sister.   That's why I can't put ya together with Gazzo, cause ya talk too much -- big mouth.  Paulie reddens.  He steps forward and slams his fists in a hanging beef.  73.   The punching of the beef is a muted challenge and Rocky responds.  Rocky walks up to a beef and slams his fist into the ribs.  The grotesque object swings in a wide arc like a hanging corpse.  Rocky moves to the next one and hooks.  Rocky's face reveals a never before seen concentration, as though he were locked in total battle.   Don't talk dirty 'bout ya sister.  Rocky takes the package and runs out.  Paulie's bleary eyes reveal a fearful respect and slight resentment.   I never had good footwork.  Mike completes the task.   ... Sure.    Should I do this?  Mickey nods and Rocky faces the glaring lights.   ... People talk to me more.    Apollo's a great fighter.   Maybe --  He faces Mickey.  Mickey whispers in his ear.    I'll tear his head off.   Derogatory?  Yeah, he's great.  Apollo Creed and his entourage enter the gym.    Yo', Dipper, why're ya --    They enter the dismal apartment... On the floor are at least ten telegrams.  Rocky scoops them up and tosses them aside. Next to the door is a pile of over a hundred telegrams.  They either say, 'Kill the nigger' or 'Hope you die, Honky.' -- What ya got in the bag?  Adrian steps to the window.  She pulls a pair of short but lovely curtains from a shopping bag... The colorful curtains glare in the dark room.   Sharp -- Real nice.   No... Sharp -- You look great.  Adrian smiles and pulls out a small Christmas wreath... Rocky smiles.  His eyes show what he feels for this woman.   Adrian, you really look great, y'know -- But I can't fool around durin' trainin' -- makes the legs weak.   Can't fool around -- You look very great.   Yeah... But I think weak legs ain't bad sometimes, y'know.  Rocky approaches in a seductive manner.  Adrian uncharacteristically removes her sweater.  Underneath is a T-shirt that reads \"Win, Rocky, Win.\"   Ya right --  Mebbe we best just hold hands -- the shirt made me feel guilty, y'know.   Whatta these guys want?   Yo, what's with you? -- It was suppose to be private.   Ah -- My buddy Paulie let me in one day an' I hit the beef here an' liked it -- An' since I become a challenger, the owner don't mind neither.  84.    I think me and Paulie invented it.   Yeah... Threw my whole day off.  86.    Yo -- I ain't mad.  I'm just outta joint when reporters are around -- They take cheap shots an' Paulie knows it.   ... What's to say?  I dunno what he wants from me --  Filled with uncontrollable anger, Paulie smashes into the room.   ... It's cold outside, Paulie.  Paulie goes to the living room closet and removes a baseball bat... Rocky and Adrian quickly follow.    Hey --  Paulie cocks the bat back and tenses... Rocky remains still.   What can I do about it?   What break?  Huh?  What break! Who am I to give breaks!  I'm a fighter, you haul meat.  You do what you do an' I do what I do best -- that's it -- that's life, man!  Paulie looks ashamed... Rocky walks, then returns.    ... An' what ya said to my girlfriend ain't right -- Do it again, I'll kill ya.  Rocky goes into the bedroom... Adrian has buried her face in a pillow... She is rocking slightly.  Rocky cradles her and kisses her cheek.    Wanna hear a dirty joke?  90.    Yo, Benny.   ... I'll try.  The mayor presses a button and a photographer enters.    Any time.    ... Run for mayor.  The mayor is shocked at first but then breaks into a big, friendly laugh, and Rocky exits.    Adrian and Rocky are at his apartment.  They are looking at new scrapbooks.  Newsweek Magazine: Headline: \"The Italian Stallion or Donkey?\" -- Philadelphia Magazine -- Rocky stands with the mayor.   Yeah...  She flips through Sports Illustrated, The American Sportsman, Ring Magazine, World Boxing, True, and a multitude of other clippings.  The TELEPHONE RINGS... Rocky rises and walks to the new white object hanging on the wall.    My first call... Hello?  Yeah, speakin' -- Who is this? Bruce?  Bruce who? -- Yo, Bruce!  How ya been?  I ain't seen ya for nine or eight years -- Yeah, things is great, how's things with you upstate -- Ya sellin' real estate, hey, that's a good job... Yeah, I gotta advance, but I bought ringside seats for the guys at the gym.  I get the hundred an' fifty grand after the fight...  Adrian overhears the statement.  95.     ... Yeah, I know it's a lotta money -- Condominiums?  Nobody uses them anybody.  Listen, I think a pet shop is a good investment, y'know -- I don't care 'bout long hours -- there's no depreciation -- that don't matter none to me -- Yeah, I like animals. Why don't ya give me ya number an' I'll call ya back?  Lemme getta pencil --  Rocky makes no motion to get a pencil.    Okay, what is it -- four- twelve 659-2424.  Yeah, yeah, thanks for callin' -- Sure I'll get back to ya, Bruce -- see ya.  Rocky hangs up.    ... What?   I don't want ya cleanin' nobody else's cages no more.   I gotta go out for a while.  Rocky grabs his coat and moves to the front door.    ... Come.  96.     Rocky arrives at his apartment... Adrian is asleep on the couch.  He lowers himself beside her.  Her eyes open.   ... Can't do it.   ... I can't beat him.   Yeah, I can't beat him.  Adrian touches his face.   I been watchin' the movies -- studyin' -- He ain't weak nowhere.   ... I dunno.  98.    It ain't so bad, 'cause I was a nothin' before --   C'mon, it's true -- But that don't bother me -- I just wanna prove somethin' -- I ain't no bum... It don't matter if I lose... Don't matter if he opens my head... The only thing I wanna do is go the distance -- That's all. Nobody's ever gone fifteen rounds with Creed.  If I go them fifteen rounds, an' that bell rings an' I'm still standin', I'm gonna know then I weren't just another bum from the neighborhood...  Adrian touches Rocky's face... The fighter gently lowers himself beside his woman.    ... No foolin' around.    The atmosphere is identical to Apollo's dressing room. Adrian watches in silence as Mike wraps Rocky's hand.  Again, the most pronounced SOUND is the RASPING of the adhesive tape.    Rocky's other hand is being wrapped in a CLOSE-UP.  The only SOUND is the TAPE and ROCKY'S mounting BREATHING PATTERN.    CLOSE-UP of the drops being placed in Rocky's nose.    Grease is smeared around Rocky's eyes... In the EXTREME CLOSE-UP several deep scars are SEEN.    CLOSE-UP OF Mike's arms wrapped around Rocky's waist and lifting his diaphragm up... Magnified BREATHING ROARS from the screen.  100.     Everyone present is motionless as Rocky is in the bathroom. Alone, Rocky is on his knee praying.  Completing his silent prayer, he stands and looks at himself in the mirror. Suddenly a wave of emotion sweeps over him as he thinks that in a few moments he will face the most overwhelming challenge of his life.  Out in the dressing room, the door opens and a guard leans in and nods that it is time.  He leaves... Rocky steps out.   Yo, Mick, can I have my rob?  Rocky puts on the robe... Embroidered across the back in flaming letters is:   ... I'm doin' it for a friend.  101.    I get the robe an' Paulie gets three grand.   Whatta ya think that outfit cost?    Christ, Jack Dempsey.   They must be friends.   Thanks, Mick -- I'm gonna try.     How am I doin'?   See how fast he is -- damn!   Damn!  How's it look?   ... The guy's great.   Fine... That guy's great.    See what?   He ain't losin' nothin'.    Adrian is unable to remain alone... She is lured by the GROWING ROAR OF THE FANS... She exits the dressing room.   Would you keep goin'?   Open my eyes -- Please, open my eyes!  Mickey nods to Benny.  He secretly places a small ring knife between his index and middle finger.  In one smooth movement he drags the razor over the blood welts and quickly covers the draining wounds with gauze... It is done so quickly no one is ever aware of the operation.   How I look out there, Mick?   Fine -- Go away, I'm gonna make it -- I'm gonna make it!  Everyone is distraught over Rocky's dangerous condition.   (impassioned and quietly I'll kill ya all... Don't stop nothin' --   Gimme ya best!!!!  Mickey looks at the clock... TEN SECONDS TO GO.    Gimme ya best!!!  Blood sprays over the ropes and onto the ringside photographers... They are horrified and wipe away the blood.  The fighters stand toe to toe and drag every remaining bit of strength from their souls and beat each other without mercy.  They look hypnotized and have entered a dimension far beyond blood and pain.   ... Don't want one.  Mickey comes over and separates them and leads him back to his corner... Mickey embraces him.   Yo, can I have my locker back?  Mickey and Rocky look at each other and grin.  Mickey hugs Rocky like a son.  Mickey raises Rocky's hand again.  Rocky turns away from Mickey and pats Benny the cut-man's shoulder... Benny smiles wearily.  Rocky stares across the ring at Apollo Creed, who stands victorious, but his face and body are badly distorted... The two men lock stares that reflect admiration.",
        "TV": "",
        "Commentator": "How was the flight, Champ?   Apollo, how would you rate this last British challenger, Henry Wilcoxson?   You're referring to the much publicized bicentennial fight?   Still to be held in Philadelphia?   Where're you off to now?  Apollo draws his wife close.  24.    Any quick advice for young boxing hopefuls?   Jerry Simpson at Kennedy Airport with the Champion, Apollo Creed.  The sports show cuts away, but Rocky continues to look at the television with a pensive stare... Andy has been speaking the following dialogue over Apollo's broadcast.   ... Unfortunate luck for fifth-ranked heavyweight, Mac Lee Green.  The slugging fighter acquired a serious fracture in his left hand after an aggressive day of sparring -- Champion Apollo Creed says he'll be 'shopping for another victim,' to fill Green's vacancy for the Bicentennial Championship Fight to be held in Philly next month... By the way, rumor has it that this will be the most widely-viewed sporting event in the entire world -- and that includes the Super Bowl, folks... Today U.S. swimmers set a new...  40.   Meanwhile, the argument between brother and sister continues in the bedroom.   A Bicentennial Fight -- January first.  It will be the first sporting event on our two hundredth birthday and is already being called by many the greatest farce in sports history.  If this man lasts more than a minute I would say he's on borrowed time.  It's matches like this with their exorbitant prices that give sports a bad name -- Not only is this match bad, people, it's sad!  Why a Rocky Balboa?  At the State Athletic Commission, Larry Duggan reporting.   Just relax, Mr. Balboa --  Today we're here with heavyweight challenger, Rocky Balboa.  The reason we are standing in a refrigerated box is that Mr. Balboa has an unusual method of training and in a moment he is going to demonstrate it for our viewing audience -- But first, Rocky, how did you ever come to train in an icebox?   Is this a common training method -- I mean do other fighters pound raw meat?   Would you give us a demonstration?  Rocky steps over to a hanging beef and begins pounding with incredible intensity... Everyone present is taken aback. Rocky completes hitting the meat and stands there with his hands dripping beef blood.  The Commentator is unnerved and Rocky looks straight into the camera lens and holds up his bloody fists.   ... Diane Lewis in the meathouse with the Southpaw, Rocky Balboa.   We would like to welcome our viewing audience to the Grand World Championship Bicentennial Heavyweight Fight -- the first major event of the Bicentennial Year... A point of interest is that the fight is being beamed to more than seven hundred and fifty million fans in theatres in nearly every corner of the world.  I would like to welcome an old friend, and co- commentator for this evening's event -- Jimmy Michaels.   Thank you, Bob.  The electricity is everywhere tonight.  Rocky Balboa, a fifty-to-one underdog, is living a Cinderella story which has captured peoples' imaginations all over the world -- to quote a popular sports magazine, 'The fighting style should be 'The Caveman Against the Cavalier.' From the increase in sound it appears the challenger is now approaching the ring... His record is forty-four wins, twenty losses and thirty-eight knockouts.   I only wonder if this man has the skill to go past three rounds -- Vegas odds say, 'no.'  102.    You could go deaf with the noise -- it undoubtedly means Champion Apollo Creed is heading towards the ring --   Am I seeing right?  Creed is approaching the ring in a boat. Is he supposed to be George Washington?  Obviously so.   It's been confirmed that it is definitely an impersonation of George Washington -- a great way to start 1976 off.   I agree.  Immediately Creed begins gracefully dancing in a wide circle. He passes within inches of Rocky in his Uncle Sam outfit.   The former champ looks great -- Can we get Joe over here -- here he comes.  Joe Frazier stands in front of the Commentators.    Joe, what are your feelings about tonight's fight?   You look in great shape, Joe.   The Champ stings the slower challenger with jabs at will -- Balboa blocks eighty percent of the blows with his face -- Creed doesn't look the best he's ever been but is moving smoothly -- Creed snaps out a triple combination that backs Balboa into a corner -- oh, a solid hook by Creed, a master of fist-men.   The Champion is smiling and toying with the man -- trying to give the fans their money's worth and make a show of it with the badly out-classes challenger -- Another left to right combination.  I feel sorry for --   Creed is down!!!   If you had asked anyone who knows boxing, they never would've predicted a first round knockdown and the second round punishment to the body of the Champion... Most fighters will tell you, receiving a good body punch is the next worst thing to dying.   Round three ready to start and should be interesting to see if Creed can put the challenger away -- there goes the bell.   Apollo almost sprints out of his corner -- feints and throws a pair of left-right combinations.  Balboa drops beneath a left upper cut and lands a very solid shot on Creed's temple -- not much movement from Balboa, duck a left, a right, another left and explodes with a right hook to the temple -- I mean explodes.  The Champ backs off.   There's no way Apollo expected this kind of hitting power.   No way -- but the brilliant ability of the Champion to master situations like this is one of his most outstanding traits -- Creed tosses a perfect right hand that rocks Rocky.   110.    Creed on the offensive -- Balboa takes the punishment and counters with a left flush over the heart... that hurt.  The wallop knocks Apollo off balance... The CAMERA GOES TO A STEEP ANGLE SHOT from the floor, VERTICALLY UP Apollo's body. The SCENE GOES INTO SLOW MOTION... Rocky releases a terrifying uppercut that opens a gash under Creed's eye. Creed's face contorts with excruciation.   Without a doubt this is the most punishing brawl I have ever seen -- The ringside audience is spotted with blood.   113.    This fight should have been stopped rounds ago but Rocky Balboa refuses to fall --   Not only has he refused to fall, but he has beaten the Champion's body without mercy and the bout has become a vicious slugfest.   The fight has slowed down to a near stand-still -- Creed circles to Rocky's right... The spectrum is nearly silent -- Neither fighter has made a motion to throw... I've never seen anything like it in the last round of a championship fight... Apollo spits blood on the canvas.  It appears he is protecting his right side.  His ribs were probably injured at the end of round fourteen.   117.    It's confirmed, unofficially, Creed's ribs may be broken -- Apollo fakes a left and throws a big tired right -- Balboa's mouthpiece is out!  Creed attacks with one hand!",
        "Jergens": "APOLLO CREED and his LAWYER and TRAINER are seated in the offices of MILES JERGENS.  Jergens, a successful promoter looks unhappy as he looks into the scowling face of Apollo Creed.   Definitely --  -- It says here, Mac Lee Green has suffered a seriously cracked third metacarpal in his left hand.  31.    I suppose we could cancel the fight indefinitely if you are set on fighting Green.   I believe we can find a solution.   (holding up some notes I contacted Ernie Roman's manager, he's fighting in France the same week.   Shaw's fighting in South America -- Why not postpone the bout until July Fourth?   That may not be possible, Jimmy.   Went to California and gained fifty pounds -- and I called every worthwhile contender, but they say five weeks isn't enough time to get in shape.  Apollo stands beneath a new fight poster and points to it.   Apollo, I'm sure there's a way to salvage this.   All I can counter with is that I'm a goddamn good promoter -- I've promoted in every country in the world -- and I've tried to the best of my abilities. Perhaps you're right, and no one wants to be beat on the country's birthday... I don't know what else to say --   ... It's very American.    The SCENE REVERTS BACK TO Miles Jergens' office.  Apollo pores over a large record book.   Fouls.   Joe Zack is a good prospect -- Exciting boy.    Exactly what are you looking for, Apollo?   Rocky Balboa -- His record's poor --    The SECRETARY is slightly startled by Rocky's excited expression.    Miles Jergens warmly greets him.   Hello, Mr. Balboa -- I'm Miles Jergens -- Please, have a seat.   Mr. Balboa --   Rocky, do you have any representation?  A manager?   Rocky, would you be interested in --   Excuse me.   I'm sure you are.   What?   Rocky, would you be interested in fighting Apollo Creed for the Championship?   Did you hear what I said?   Not spar, I'm asking whether you would be interested in fighting Creed for the championship.  The weight of the statement comes crashing down in Rocky. For a long moment he becomes nothing more than a basket case as he ponders the statement... He half regains his senses.    Apollo sits behind Jergens' desk.  Jergens is not present. Four middle-aged and younger types and Creed's lawyer sit around the desk.  The desk is flowing with forms and charts.",
        "Gazzo": "MR. GAZZO and his YOUNG BODY GUARD sit in the front seat... Rocky is in the back seat.    Sure, Rocky, Bob's good for it...  Gazzo hands Rocky a twenty.   Tomorrow collect from Del Rio -- He's late three weeks. How'd you do last night?   Yo Rock.  Did I give you a job this mornin?  How come ya didn't break this guy's thumb like I asked ya?  When ya don't do what ya are told, it makes me look bad, kid.   It don't matter.  It's my reputation.  These guys think they can get off light.  It's bad for my reputation -- It's bad for business.  See ya killer.  Gazzo gets into his car.    ... The Rock's a good kid.   No, two yards from Snyder, an' a grand from Cappoli.   Hey, screw ya brain on right. Now, who's this girl you're going out with tonight?    You think I don't hear things?   Buddy's in a bad mood -- prostate problems.    Buddy's got a thing against ya, Rock.  Some people just hate for no reason, y'know.   Here's fifty bucks -- You an' the girl have a nice time.   Hey -- if a good man can make a better life, let him make it.   Take your shot, kid -- You got money for trainin' expenses?   Here's five hundred -- Put it in your glove.    Does Santa Claus charge juice? Merry Christmas -- Now, how's about my present, ya gonna win?   Listen, kid, I'm with ya.  Ya know, I'm with ya -- Italian, we're blood.  You kill this rug -- We Guinneas gotta show these Afro-Americans where it's at.  Give it your best shot cause I want ya to prove to these bums on the corner that my man can't be beat by this rug... Ya got any action on the side.   Ya gettin 150 grand killer. Ya got any plans for it? Whatta ya think?   62.    Ya like to put it on the street, make it work for ya?   Sure, you do what ya want. Stay away from the stock market.   Same thing.  Ya know, Rock, remember when we was kids, we fought together.  An' I wasn't well an' ya had to beat up that Irish kid -- what's his name? -- Gallager -- I bought a suit and became a businessman. You put on gloves.  An' I remember Mama almost cried, may she rest in peace -- an' our ol' man who said ya had no brains -- I'd like to lay hands on that bastard.  You ain't never had any luck. Even when I owned you in '66 you never had luck.  But now I think you might be gettin' some luck kid.  Whatta you think?  Rocky smiles and Gazzo gets into his car.  Rocky follows him across the street.   Where else am I gonna go.  Bet three grand on Rocky.    No!  I'm not kiddin!  Rocky walks away.  63.",
        "Interviewer": "",
        "Marie": "... Screw you.   ... Screw you, yoyo.  The gang laughs.  Angered and shocked, Rocky grabs her arm.   Hey --   Stuff it, man!   I like 'em.  If you don't you can f--    ... Yeah.  She attempts to light a cigarette... Rocky nonchalantly tosses it to the ground.   I like yella teeth.   Maybe I like garbage.  Rocky and Marie take a shortcut through a dark school yard.   Why?   C'mon, Rocky.  I'm twelve.   What?   I won't.   Ya hope I don't keep acting like a whore or I'll turn into one, right?   Goodnight, Rocky.   ... Fuck you, Creepo!!!  The girl runs to her house as Rocky looks on in dismay.",
        "Mickey": "I don't care what nobody says, this bum Creed woulda never made it in the Thirties --    ... What?    Do you see me talkin'?  Huh?    Then stand there an' wait till I'm done -- Creed's good, yeah, he's real fine but I gotta boy, y'know Big Dipper, who's got the stuff it takes to be a champ -- He's mean, quick, an' big -- What more d'ya need?  Okay, go to work...  Hey -- Yeah -- Whatta ya want?   Dipper needed it.  Rocky turns and looks at DIPPER sparring... Dipper is a young, muscular heavyweight with a mean expression.    Dipper's a climber -- You're a tomato.   Facts is facts.  I run a business here -- I'm cleanin' house --  Mickey pauses to watch a young middleweight time-skip as his trainer sings \"FASCINATIN' RHYTHM.\"    How old are ya?   How old?   More like thirty.   The legs must be goin'.   ... Did ya fight last night?   Did ya win?   ... Who'd ya fight?   Rice is a bum.   Ain't they?  Mickey shoots Rocky a quick, indifferent look and removes a rosary from his pocket and idly rolls it around his fingers.  18.     Ya want the truth -- Ya got heart, but ya fight like an ape -- The only thing special about you is ya never got ya nose broke -- keep ya nose pretty -- what's left of ya brain an' retire.   Hey, ever think about retirin'?   Think about it.   (gesturing towards Rocky Known him since he was fifteen -- A waste of life.  Dejected, Rocky travels to the locker room.  He passes Big Dipper sparring in a ring... Dipper spits a mouthful of water in a bucket and looks smugly at Rocky.   Did ya get the message, kid?   A Rep from Miles Jergens' Promotions was lookin' for ya -- They need sparrin' partners for Creed.   Here's the card?   'Bout an hour ago.   ... I said that before.  Rocky turns from Mickey and jogs out of the gym.  Mickey fumbles with his rosary beads.    ... Waste of life.    I seen the light.  I figure somebody was home.   How do you mean?   Listen, Rock, you're a very lucky guy.   What's happened is freak luck.   Look at all them other fighters. Real good boys.  Good records. Colorful.  Fight their hearts out for peanuts -- But who cared?  Nobody.  They got it shoved in their back door. Nobody ever give them a shot at the title...   Whatta' those?    I'm here tellin' ya to be very smart with this shot.  Like the Bible sez, ya don't get no second chance.  Mickey looks hard into Rocky's eyes.    Ya need a manager.  An advisor. I been in the racket fifty years.  I done it all, there ain't nothin' about the world of pugilism that ain't livin' up here.  He lights a half-smoked cigar.    Fifty years.  The rep is known around Philly, an' a good rep can't be bought, but I don't have to tell you that.   Rocky, d'ya know what I done?   (driving each word hard I done it all.  I've done an' seen everything'.  Believe what I'm tellin' ya -- Ya shoulda seen the night in Brooklyn, I smacked 'Ginny' Russo outta the ring, September 14, 1923 -- same night Firpo knocked Dempsey outta the ring. But who got the Press?  He did. He had a manager -- September 14, 1923.   Look at this face -- twenty- one stitches over the left eye, thirty-four over the right -- my nose was busted seventeen times, the last being the Sailor Mike fight New Year's Eve, 1940, in Camden, New Jersey -- What a professional pastin' I give him.  Here, read about it.   66.    (shows a tiny press clipping; points to cauliflower ear An' he give me the vegetable on the ear.  I got pain an' experience... an' you got heart -- kinda remind me of Marciano, ya do.  Rocky points to his most prized possession.   Yeah, ya kinda remind me of the Rock.  Ya move like 'im.  Mickey has rung the bell.  Nothing could please Rocky more than being compared to his idol.   Ya got heart.   Christ, I know this business. Rocky, when I was fightin' it was the dirtiest racket goin', see.  Pugs like me was treated like fightin' dogs -- throw ya in the pit an' for ten bucks ya try to kill each other.  We had no management...   67.    fought in boxcars, in whorehouse basements, any joint with a floor -- October 1931 I fought a bum who put a tack in the thumb of his glove an' punched so many holes in my face I had spit shootin' outta my cheeks -- I never had no manager watchin' out for me -- See that picture outside the gym -- 'Mighty Mick,' that's me in my prime.  I had all the tools.  I coulda starched any lightweight husky on the East Coast -- But I had no management.  Nobody ever got to know how slick I was, but I had a head for business an' stashed a few bucks an' opened the gym -- It's a dirt hole, I know it, but that an' a lotta scars is what I got to show for fifty years in the business, kid -- now you come along with this shot an' I feel like it's me gettin' the shot I never got... Yeah, we was treated like dogs -- like them Dago's, no offense, in the Colosseum in Rome there -- An' now I got all this knowledge, I wanna give it to ya so I can protect ya an' make sure ya get the best deal ya can!  Rocky rises and opens a window.    Respect, I always dished ya respect.    I'm sorry, I -- I made a mistake.  Kid, I'm askin' man to man.  I wanna be ya manager.  68.    Look, you can't buy what I know.  Ya can't.  I've seen it all!  I got pain an' I got experience.   Please, kid.   If ya was wantin' my help, why didn't ya ask?  Just ask.    Rocky, I'm seventy-six years old.  Maybe you can be the winner I never was -- your shot is my last shot!  Rocky is choked and goes into the bathroom and closes the door.  Mickey struggles to his feet and, like a beaten man, leaves.  Several moments later Rocky steps out and lowers himself into bed.  Springing up a second later, he runs outside.  69.     Stop!  Stop!  I can't stand it! It's clumsy.  You're off balance.  He motions to his bullish helper, Mike.  He hands him the string.    Tie it to both ankles -- Leave two feet slack.   Forget the footwork -- You're off balance.  The legs are sticking everywhere.  Marciano had the same problem, an' the string cured it.  When you can hit and move without breakin' the string you'll have balance.    Don't you boys ever interrupt when I'm conductin' business, or I'll kill you both -- Go away.  The boys depart.  75.     Autographs!  Ya wanna be a writer or a fighter?  Let's work.  Mike looks off across the gym.    Can I help you guys?   I own the place.  The Reporter has a hundred things on his mind... he turns from Mickey and nods to his crew... the other television crews rush to set up.   What's happenin' here?    You can forget about sparring, kid.   (almost apologetically to the crew Why let Rocky here take a chance on cuttin' or breakin' a hand? -- Take a shower, Dipper.   This is gettin' outta hand -- Rocky will fight in the ring January first, not here!   Not yellow, cautious.  See, it's very easy for a fighter to accidentally hurt --  Dipper suddenly steps forward and slaps Rocky very hard across the side of the head... The gym becomes stone cold. Dipper is in total command and enjoying every moment of it.  80.     Let's take a walk, Rock. Please, don't take a chance. He wants to hurt you so you can't fight.  Rocky swallows his pride.  He still has the string around his ankles.  He starts to shuffle away with Mickey... Dipper steps forward and viciously slaps Rocky again.  Mike jumps forward.   The kid's got cannons -- Print that.  The crowd disperses, leaving Dipper a pathetic and broken figure lying on a dirty gym floor.    Mickey is in his cluttered office above the gym... the room is dark.  Blankets are tacked over the windows.  Rocky is watching 8 mm movies of Apollo Creed in action... Rocky watches with intense concentration as the fighter moves like a huge dancer around the ring.   His defense is great, can't lie 'bout that -- You have a rollin' style.  Can't retreat as fast -- But your style ain't retreatin'.  They both watch the flickering images.    See how he plays sometimes -- Drives his cornermen nuts. Nobody knows his next move -- Him included.  They watch more action... Creed has a fighter helpless against the ropes.    Killer instinct -- Ya both got the killer touch.  Interestin'. See that! -- Right-cross combination.  Beautiful.  But you got the power to rip the body.  They watch more action.    Rocky, when ya climb into the square, an' know ya' meetin' the best fighter in the world, ya' gonna be ready, ya' gonna be ready 'cause I been waitin' for fifty years -- Fifty years. When I'm done with you, you'll gonna be able to spit nails.   91.    You'll gonna be able to eat lightin' and crap thunder -- You'll be a very, very dangerous person...  The SCENE FADES on Mickey's voice and Rocky staring transfixed at the images projecting on the wall...   What cha say, Benny -- Meet 'The Rock.' This is our cutman, Benny Stein.   Check the eyes, Ben.  92.   Benny checks the skin around Rocky's eyes.   Take a shower.  Heading towards the shower, Rocky is intercepted by Paulie who traverses the gym.  He stops Rocky at the shower room entrance.    After turning on the lights, he quickly cleans the cluttered desk and sets up the projector... He goes to the cabinet and removes a stack of 16 mm films.    The office clock indicates it is several hours later.  Rocky is engrossed in watching another Apollo Creed film.  He sits motionless.  Rocky sits upright.  Something catches his eyes... He springs at the projector.  He reruns the scene several times.    Several hours later Rocky is engrossed in watching another Apollo Creed film... He sits motionless.  Something catches his eye.  Rocky stops the projector as Apollo is delivering a knockout blow to an unfortunate opponent.  Rocky moves right up to freeze frame and inspects it like it was a priceless painting... He backs off and begins writing on a note pad.    The first light of dawn streams through Mickey's filthy windows... Rocky is slumped in a chair and it is apparent he has lost interest in watching the movies.  The film has completed its run through the projector and lazily flops around on the top reel... Listlessly Rocky rubs his reddened eyes.  97.   The door opens and Mickey flips on the light... The two men stare at each other for a long moment.  Mickey studies Rocky's despondent expression and knows what is on the fighter's mind.   ... I know what you're thinkin'm kid -- At least ya gotta shot -- All ya can do is try ya' best.  Rocky stands and, with his dog, inches past Mickey and exits the room.  Mickey walks over and turns off the projector. He idly pushes the machine with a lazy motion until it slides off the desk and crashes to the floor.   ... It's time, kid.  Rocky nods and moves toward Adrian.   Don't you care what the people will say?   Whatta you get outta this?   ... Shrewd.   Don't let 'im get you tight.  103.    God bless ya, Rock.   You can do it!  Goddamnit, you got the power!  The body, get the body!!!  Ya got him goin'!   Real good.   Breathe deep -- Keep ya chin down!!  Use the legs and drive through 'im.  Attack -- Attack -- Attack!   Ya nose is broke.   Can't hardly tell.  Don't swallow the blood -- Go for his ribs.  Don't let 'im breathe.   Why don't ya tell 'im you're a fan!   How you holdin' up, kid?   Gimme the water!  Ya getttin' tagged with his right.  I think you should feint left and high hook 'im -- Benny, check the eyes!  Can ya see?   Keep on him -- You're doin' great.   Wanna keep goin'?   ... Yeah.    Great, kid, great.  The ring Doctor leans over Rocky and checks the eyes.   We gotta stop it, kid.   Nobody's gonna say ya didn't give ya all.  I can't let ya go out.  Rocky stands and eyes them all.   I don't care what they say, you're a winner."
    },
    "imdb_rating": "8.1",
    "description": "Rocky Balboa is a struggling boxer trying to make the big time, working as a debt collector for a pittance. When heavyweight champion Apollo Creed visits Philadelphia, his managers want to set up an exhibition match between Creed and a struggling boxer, touting the fight as a chance for a \"nobody\" to become a \"somebody\". The match is supposed to be easily won by Creed, but someone forgot to tell Rocky, who sees this as his only shot at the big time.Murray Chapman <muzzle@cs.uq.oz.au>",
    "name": "Rocky",
    "genres": [
        "Drama",
        "Sport"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNjdjNzkxYzYtODM3OS00ODQ4LTg3MWEtZTE0MDdhMGU1NDU1XkEyXkFqcGdeQXVyMjI0NTA4NzA@._V1_QL75_UY281_CR46,0,190,281_.jpg"
}