{
    "filename": "Ronin_script.txt",
    "imdb_id": "tt0122690",
    "imdb_url": "https://www.imdb.com/title/tt0122690",
    "characters": [
        "Man with the Newspaper",
        "Vincent",
        "Seamus O'Rourke",
        "Jean-Pierre",
        "Sergi",
        "Clown Ice Skater",
        "Larry",
        "Dapper Gent",
        "Natacha Kirilova",
        "Spence",
        "Deirdre",
        "Mikhi",
        "Gregor",
        "Sam"
    ],
    "dialogues": {
        "Vincent": "Perhaps the police?  Cigarette?  Let's just say he knows who I am.    I'm Vincent.  And I coordinate.  Things.  This is my country, you know.  Of course.  And what is it you do?  Let's go for a ride.  To see a man about a thing.  Pretty much what you'd expect.    Something like that...  I didn't know that you spoke French.  If you think we should.  I asked if we could give him anything else.  That was a nice move you did on our young friend.  Judo?  Same thing, isn't it?  What's the difference?  Help yourself. Since when do you smoke?  A cigarette?  As in one? One cigarette a week, who smokes like that?  Christ, I smoke a pack-and-a-half a day, and I tell myself I could be worse. It's just so damned pleasurable.    Like Larry or Swede.  Let's just say I thought the conversational possibilities were limited.  Of course, I might have brought Gregor, but he didn't seem like the right candidate -- for this.  So is the woman.  I wonder if she truly left the IRA.  I wanted to see who you were.  You were once some kind of special forces.  Airborne Ranger, maybe a Navy SEAL.  After that you rode shotgun for the CIA in some place like El Salvador or Afghanistan, a real mercenary. Only now -- now you're like the rest of us, it's a very competitive market since the end of the cold war.  There's a lot of hired guns out here, and not nearly enough work to go around.  They certainly are.  Whatever it is we're going to steal, it must be quite something.  Lovely, isn't it?  Do you have it?  He's company.  What do you mean?  I just wanted to see something.  I needed to know.        Where's my information?  Then you better find it in your heart to tell me, Francois, because while your death is inevitable, it still isn't decided how painful it's going to be.  I needed to see if you were a cop. I'm a popular man with the police, Sam, and whenever they try to catch me they always do it with an inside guy -- some man on some job who seems more trustworthy than all the others put together.  And that's the guy you have to watch out for. I hate cops...  How did you know?  That there was a gun pointed at me.  But how did you know I would have the presence of mind to pull my weapon when I did?  You saved my life back there in the park. I know this doesn't begin to make it right between us...  I owe you a heavy debt.  We kept it...    And then Sam, you and I clean up whatever's left to be cleaned.  Finding this package is a thing easier said than done.  We don't even know what it is. What did we steal?  When this whole thing started you made it clear: you're running the show.  And I don't believe you'd be running this show if you didn't know what was going on.  And I don't believe you...    Who do you think, Larry?  The IRA.  The question still remains: what do we do now?  You weren't around when I woke up, I thought maybe something had happened. This has been one very fucked up job, Sam, and I'm not taking any more chances on anybody... Including you...  You were smoking?  (very sincere, offering the    That was a bad bit of business, today.  A lot of people died.  I haven't.  Not like that.  How do you get used to it?  I won't lie -- there have been times when I had to do it, times when the only way to get out alive was to see that the other man didn't.  I never really thought I was part of the world you move in, Sam, to tell you the truth. I'm a hood, a thief.  Big time in a small time king of way.  To the local police I'm a prize, to the local hoods I'm a legend.  But to a guy like you I'm just another two bit hired gun.  He's going north. That's Aix en Provence, where he used the phone.  Not necessarily.  He could go off road at any number of places.  He might not even be in the country anymore.  I hate to interrupt a conversation of such cultural depth...  ...but we've got to get back on the road.  We've got him.  I know those men.  Don't even think it.  You're a cop...you're a fucking cop...I should kill you.  Vienna.  That double-crossing bitch.  That makes twice now you've saved my life.  You see it your way, I'll see it mine. You need a doctor.  No...I thought I'd take you to the hospital.      You're with Interpol -- you're a cop.  And what job is that?  It looks to me like we're all that's left of our group.  I'm going with you.  It isn't about money for me, not anymore.    Hello, Jean-Pierre.    Alright, it's done.  Clearly.    Yes, Sam's tough alright.  Of course.  Don't you?  (beat, trying to find a way to  How did you know?  I'm alright.  And you?  A friend.  I was telling him about how you always have the latest tapes.  I was wondering if you had any movies that were particularly new.  Do you have the tape?  You said you might know where we can get a copy of this tape?      I get the picture.  Tony and I have to talk some business, first.  It's a matter of respect. Why don't you wait outside, this won't take long.  Yes.  The address of the Russian production company.  Just in case we need to find them.  If Tony says this is it, then it's it.  Tell me, Sam: why do you do this?  Continue when it would be so much easier to give it up.  Then quit. You don't work for Interpol, Sam.  It's a cover, then.  A cover within a cover, a feint within a feint. You work for the CIA, it's the only possible answer.  Dark ops?  Very ugly.  Not very zen of you, huh?  Not so much the modern Samurai after all.  I know.  Jean-Pierre did.  I was waiting to see what would happen. I didn't want to kill him if I didn't have to.  I would have tried not to.  But yes, if it would have kept him from shooting you, I would have.  Because I owe you. Look at that...    You think?  What the fuck happened?  You don't know?  Bullshit, you had her, there was no way out.  Why didn't you kill her?    (slamming the dashboard in  You put everything on the line because you...  Fuck...  Left left left!!!  Right now?     We don't have much time.       Something like that.  So I do it.  If our positions were reversed, would you leave me?  I think not.    If I'm going to die for the CIA, I'm going to go out smoking. Besides, there's half a forest between us and them, they can't see a goddamned thing.  Just like that?     Why?  You've got more force of will than anyone I've ever seen.  You handle a gun like it's a part of you, you perform surgery on yourself without anesthesia... And most amazing of all, you quit smoking, just like that.  Why then, Sam, don't you act like this is a job like any other?  Surely, if you are a hired gun, you realize that some times you just have to walk away without getting what you came for.  Why not?  Closest and oldest.  And when you finish?  What then?  This package, whatever it is, do you give it to the CIA?  Do you really think they deserve it?  Do you have a good answer?  That's one less I owe you...  You have to stop doing that!  Finish the job...    I'm really sick of you saving my life.  Go out and get the bastard.     You son-of-a-bitch...  You speak French.    (repeating the Doctor's words    Tell me something first. The package: what was it?  What happened to it?    Sam, when Gregor had Deirdre by the lake, you could have killed the two of them with one shot.  You could have had the package, finished the job.  But you didn't, you sacrificed the job to save her life.  Why?  Would you just smoke already...  Just to keep me company, Sam -- I hate smoking alone. How about you?  I thought all you IRA types smoked.  So where do you go from here?  I'm up for that...  She's got a point. Besides, I know of a job that's available.    (a little louder, bordering  (thrusting the cigarettes out to  Goodbye, Sam...",
        "Seamus": "(to Gregor, with an Irish  Now there's the Deirdre I know.  It means I was worried that all the time you spent away from the fold might have affected you.  You've been living the life of the hired gun -- the well paid hired gun, I might note.  There's no glory to it, but there are those that like it.  It's been known to happen.    Just testing, lass.  Forgive me, but I had to do it.      (he's almost foaming at the  Ease up, man...I'm just checking to make sure you're on the level.  And it seems to me I saw a sign in there that says they got a late afternoon delivery.  Why don't we come back later today and do this all over again, huh?  What in bloody hell is going on?  From Interpol?  Why didn't you kill him?  How is it these fellahs managed to get the drop on us?    (as if finishing Vincent's    You've told me a lot of things, boyo...  Lose them!  To the right!!!  About time!          Do I need to repeat myself?  The moment of truth, is it?  What am I doing here?  Why, I'm here to see my partners, Gregor, the boys in the Russian Mafia.  See, your bosses had hoped to screw me by hiring you to pull your thieving double cross.  But they only just found out that what's in the briefcase is completely useless without me.  I can't fight them, and they can't kill me -- that means we're gonna have to do business together.  What's a little hate between business partners?  Figured enough to know there's an odd man out and I'm looking at him.  It looks, Gentlemen, as if we're gonna have to sit down to table and work out an agreement.  I can't take it anymore. Watch him, man, I'm going out and finish what needs finishing!  Turn around real slow, and try hard not to breathe when you do it.  It's you... You're the one did this to my face, are you?  Have a nice afterlife.  Deirdre, do for him, woman, put a fucking bullet in his head!  Do it, for Christ's sake, do it so we can find that stinking Gregor, he's got the bloody package!  For God's sake, you're a soldier...  (sensing he's getting to",
        "O'Rourke": "",
        "Sergi": "",
        "Larry": "Anybody wanna tell me what we're waiting for?  And who the fuck is that?  What're you talking about, man?  I don't understand.  I got a surprise for you, blondie...  (patting the gun inside his  Who the fuck are you?  I drive -- and my name is Larry.  Larry from the States.  Who's they?  Gets the job done.  Not for long.  Is that right?    Yeah, well...  My way works too.  Who the fuck died and appointed you food czar?    So what's the deal?  What'd you guys do?  (a sigh, he's done this too    I blast the lead car into oblivion...  Then Swede and I split with the package and meet you back at the rendezvous.  Where is this broad?  Is that right?  Not in mine.  (sees something over Swede's    (still having trouble believing  What is this?  Fine with fucking me, we got work to do. I don't care what it takes, we are getting our property back and putting it into the hands of the people who are gonna pay us a great deal of money when we do.  I don't know about the rest of you guys, but I'm not the kind of guy to just sit back and take it in the ass. I don't mean that in, like, a literal way...  Your people?  Who the fuck is your people?  How do we know that?  I never did trust that blonde fuck...    I'm telling you...      What is?    Oh yeah?  Whatta you drink, then?  I'm driving.",
        "Dapper": "This is important.  You know it is.  What are you doing, have you lost your mind?!?  Why did you do that?      I can't believe you'd do that, Gregor.  I thought I trained you better than that.  I've never particularly liked you either, Gregor.",
        "Gent": "This is important.  You know it is.  What are you doing, have you lost your mind?!?  Why did you do that?      I can't believe you'd do that, Gregor.  I thought I trained you better than that.  I've never particularly liked you either, Gregor.",
        "Natacha": "",
        "Kirilova": "",
        "Spence": "",
        "Deirdre": "Can I help you?  I'm here... No, it was nothing.  It's good to see you've all got such faith in our little undertaking.      From here on in you want something you pay cash for it: no credit cards, no bank accounts are in place: ten percent up front, the rest when the job is done. You.  What do you do and what should we call you?  You were a soldier, were you?     (Vincent doesn't respond for a  Is it alright?  Good, because it cost enough.  There's cheaper phones by far than that one, man: you better fucking use it.  You sure about this?  But would you stake your life, that's the question...    What'd you do with the money?      (barely stopping, very  I feel as if I've wandered onto the set of Enter The Dragon.  Could you teach me to do that?  I still am.  That's right.    I probably do. But for the time being, I'm willing to forget about it...  Look, Sam, don't take it the wrong way when I tell you we won't be doing this again.       Exactly.  And last night I wanted to be with someone who was just like me.  I better be getting that.    Now then, let's run through it one more time, shall we? What's your job?      Leaving...    And then...  And then...  Very good.  Now all we have to do is live long enough to get paid.  Alright, Gregor, I'm...  Hello gentlemen, are we ready?  You want to take a left, then, so that you're going west.  Of course.    Well I don't!     (defensively, off Vincent's (quick beat, then reluctantly  And you believed me? But it wasn't my people who did it.  Exactly.  Gregor, he was the Russian's man.  It was my people came up with the idea for this run, but the Russians who had the capital to finance it.  Gregor, he was their insurance, and I was ours. Everybody else was supposed to be neutral.  Gregor must've got to Swede...  That's why you were riding with him.  I bought it for him -- all the stuff he was using, it was in his contract.  Cost a nice penny, too, especially that goddamned phone: Gregor had expensive tastes.    Christ, I was starting to think that the two of you had thrown it in and walked away. There's someone on the phone downstairs asking for you, and my somewhat limited French leads me to believe that he might have something to tell us about Gregor.    If somebody else doesn't find him first.        I drink what every civilized man, woman and child in the world drinks: Guinness.  Gregor's fine...  Cold cocking the poor son-of-a-bitch would have sufficed, Seamus, don't you think?  When we're done with this, I want to do for that one myself.  And what's that supposed to mean, Seamus Reilly?  So you thought that maybe I'd grown too attached to this charade I've been playing, is that it?  Not to me, you know that.  I guess you don't know me, then, if you think I won't kill you for an insult like that!  Remember what we agreed on, Seamus: when we get home, I don't play \"the girl\" again.  Where's the case?  Would somebody tell me what fucking well happened in there?  Well, if it isn't Mr. Interpol himself. I can't believe I misjudged you like I did.  I'm a patriate.  Where do you get off saying word one? All the time pretending to be one of us, it's the same thing we were doing, Seamus and myself.  And here you are so high and mighty, like you're so different from the rest of us.    They're part of the team.  One of them's the guy I told you about.  That's him.  I told you: they're good...  You lose them!      You better be careful, Seamus, before something happens a plastic surgeon can't fix.  You're thinking with your gun, Seamus, and not your head...  No, Seamus.  I heard you the first time.         Let it go, Sam, walk away.  God damn it!  Seamus!  I'm no girl, Seamus...  And you ain't nobody's people.    He's got the briefcase rigged to explode five seconds after anybody other than himself tries to open it.  Don't do it, Sam!  He'll kill me anway, Sam, shoot though me and kill this fucker.  Alright?  It's bloody fucking freezing in here!  Only the stupid ones.  Cigarettes kill more patriots than bullets. Besides, I'm not IRA no more.  I don't know.  I was thinking...Maybe the three of us might partner up -- guns for hire, that sort of thing.  Come off it, Sam -- if we weren't friends already we wouldn't be here now, would we?",
        "Mikhi": "I'm shocked, shocked to think that you'd believe him.  Ahh...  And more importantly --  What was that?",
        "Gregor": "Whoever hired us.  Now that is an interesting proposition.  Because if there's more than one party involved, if we really are working for different people, then perhaps some of us are on different sides. Your orders might be different from mine.  (sharply, as if he's used to   Who are you?  IRA?  These days they they call me Gregor -- and I'm a tech.  I do electronic work, surveillance, computer runs.  It's quite satifactory.    I'd stake my reputation.  In this business, your life and your reputation are more often than not one and the same.  I would imagine that the great satisfaction in all of this will be killing the American.  A means to an end, is that it?    What's that?  What are you doing?  Nobody's going to do that!    I do, I do...  I use my cell phone to get computer access to the telecommunications satellite used by our target.  I trace his cell phone signature and use it to pin point his location as he moves through Nice, relaying that information to you.      Always in a rush, you are.  All these years I've known you, you could never wait for anything.  Do you really think so?  Relax!  Look over there.  Do you see that one?  The girl in the light blue dress?  To make a point.  I don't know her, and I was ready to splatter her brains all over the sidewalk. I don't particularly like you, so imagine what I'll do if you try anything...  It's under your seat.  As my American friend Larry would say: are you fucking deaf?  It's under your seat.        What I do is none of your concern.  What you should do is wait for my next phone call.  I'm going to find a place where I can tilt the field in my favor.  When I'm ready, I'll call you and tell you what I want you to do.  Thank you, gentleman, that will do nicely.  Edvard, is that you?  I'm touched, really, that they'd send someone of your caliber.  It's nice to know that they didn't make the mistake of underestimating me twice.  I'm sure.  But I'm sorry to say that it's too late for trust: we have a serious problem.    You first, Edvard.       I swear...  I sent it to myself in Paris.  A post office box.        It is, I'm telling you it is!!   (letting that sink in for a  Edvard said the same thing about you before he died.    What is he doing here?  But you hate each other!    I think not. I have, of course, taken the precaution of wiring the briefcase to explode five seconds after it opens.  Unless, of course, I deactivate it before it goes off.  Should any of you decide to rush me, I'll kill myself and whoever happens to be near me at the time.  I'll destroy whatever's in the case.    You might have made a good field agent you arrogant American prick, but you're not smart enough to go up against me.  Go ahead, shoot... Shoot and kill the bitch, I don't care. And yet you don't shoot.  Interesting. Put down your weapon and walk away.  Shut up!",
        "Sam": "No...  Sorry I'm late...    I know cops -- and you're no cop.  No thanks.        He trusts you to lock up?  I got this gig through a contractor. And he most definitely didn't know who was doing the hiring, only that they were paying a lot of money...    Knock it off!  The point remains: we could be working for different people.  There's a chance for one of us... Maybe more than one of us -- has been paid to cross the others.  I don't know about you guys, but I like to know who I'm working for.  It can help prevent a great deal of... ...unpleasantness.  Sam.  I'm a weapons guy.  Once.      All in the stomach, though.  Your man might live.  Long enough to shoot back.  It's been known to happen.  My way is better.  Where to?  I can do that.      As in, they own it?  And I suppose he's saying that we oughta give them something for using it, huh?  I don't.  But the language he's speaking is universal.  I guess we oughta give them something...     What'd you say to him?    Jujitsu.  Not at all.  Similar, but not the same.  One's a lot more painful than the other.  Could I get one of those?       I do.  (blowing a smoke ring with   So, Vincent: why bring me along for the ride?  Job like this calls for a warm body, somebody who can stand around and look threatening.  A tough guy.  Exactly.  Why not bring them?  Watch that one, he's an ex-spook for sure, maybe Stasi, maybe KGB.  He's smart, Gregor is.  Deirdre?  Smart, yeah, and seriously goddamned dangerous.  I've wondered that myself.  None of this answers my question, though... Why bring me?  Who am I?  That's right: there's not hardly enough work these days, nothing that pays the big money, anyhow.  Then along comes this job, paying so much goddamned money I couldn't afford not to take it.  Somebody's paying through the nose for this.  Whatever it is it must be goddamned priceless.  They'd have to keep something like this under lock and key in New York, and it would still get fucked up.    (that edge creeping into his    (looking at Vincent, truly  You need to know a lot of shit, Vincent.  Now would be a good time to get the fuck out of here.  You know, what you pulled back there, that was bullshit.  (insulted that Vincent would  Know what?  I saw you look off when Francois nodded his head.  I figured he wasn't pointing out a particularly rare shrub, and the rest was easy.    What I did back in the park I did because we're working together -- we're on the same team. This is business -- this is work.  We did it together, we share the spoils, even split.  Whatever you say.  Hazard pay...  We weren't real thrilled about it either...     I didn't think to see you again tonight. You were pretty pissed.  Is that right?  Part of me says I should just look at this as a perk.  You know, a bonus.  But then I remember you're you -- Deirdre who used to belong to the IRA -- and it occurs to me that deceit and subterfuge come very naturally to you.  (returning the kiss, just as      No goodbye?  You don't have to explain yourself to me, Deirdre.  You're a hired gun, Deirdre -- just like me.  Duty calls?             (continuing without missing a  Like it or now, we're on the same side: we're here and the package isn't. You're not the boss any more, you're our partner.  So tell us what you know, so we can figure a way out of this mess.  Now, what did we steal?  Because if they had she'd be gone along with the package, instead of sitting here with us.      Check this out. Gregor's a spook, or he was one until recently.  When he was a spy he lived the life -- you know, a prince in some Eastern Bloc country where nobody had shit and Gregor had everything.  Then the wall goes down.  No more Cold War.  And Gregor is out of a job.  No apartment, no special stores with Western food and video tapes.  I would bet dollars against shit that Gregor liked that phone and he doesn't want to give it up.  And I wouldn't be surprised if he's arrogant enough to think...                    What's going on?  I came up here to sneak a smoke.  I hope you don't mind I took your pack. It was on the table.    I have a feeling I'm about to start buying my own.  It was at that.  I've seen a lot of people die before.  You don't.  You just learn to live with it.  We live in a singular world, my friend.  You might be a hired gun, Vincent, but I got a feeling you cost more than two bits.      It's Paris.  The route's too indirect for anything else.  A guy like Gregor, he doesn't waste time on this road unless he has to be on it in the first place. Otherwise, he'd be out of the country by now.  He's going to Paris. Now I just hope we can find him before he gets there.         Whatever you hear, whatever happens, when your partners come back out, you make sure you're here with the motor running.  After you, asshole.  You might have been one mean technical spook, Gregor, but you wouldn't have lasted a week in the field.  Don't talk to me unless you tell me what I want to hear, understand?!?  You have no choice in this, don't think about winning, think about staying alive.  I want the item, and if you don't give it to me, I'm gonna kill you.  Bullshit!  Then where is it?  Sent it where?  But you can't.     Hey...  I didn't save your life back there. Risked it, maybe -- but I didn't save shit.      Not exactly.  If I was a cop, a real cop, I'd have busted you a long time ago.  This isn't about you, it's about the job I have to do.  My job, Vincent, a job you don't need to know about.  I can't go to the local cops -- they'd never be able to get close enough at this point.  It's me or nobody, and I've been on this job too goddamned long not to finish.  We?  There is no we in my world now, Vincent, just me.  This doesn't involve you, don't you understand?  I can't even guarantee you any money out of all this.  You don't have to do this.  American.     Douse the wound with alcohol.      Peel back the skin and attach the clamp.  You see the bullet?  Good.  Now take the forceps, and remember, Vincent, what we're doing here is routine.  I've done stuff like this at least twenty times in the field.  There are no vital organs where you're working, no major muscles or arteries -- you can't kill me.  Just make sure you've got the bullet before you try to pull it out.    Then if you don't mind... I'm gonna pass out.    Soon.  Yeah.  It gets done now or not at all.  Another couple of days and the parties concerned are gone where I can't get them.  Vincent doesn't owe me a thing.  I didn't expect that he would.  Vincent told you that I'm a cop?  So this is what, a test?  If I was healthy, I could take that away from you.  So what is it you want to know?  Created?  Vincent's life is his own burden; he'll have to carry it for himself.  And I'm not any kind of Samurai.  A Samurai has honor, a Samurai live by the code of Bushido, the way of the warrior.  I'm just a killer for hire. The world isn't about honor, anymore. It's about survival.        What's the story?    I'm sure.  Why's that?  It's the Irish tape we want.  (repeating it, he knows this  I know of him.  The Irish representative?  What's this?  Thorough man.  You sure your friend got the right place?  Do what?  It's my job.  Sure I do.  You heard him, you heard the guy -- that's what he said, what Edvard said.  I'm a field agent -- last of an already extinct breed.  I do dark ops.  Dark operations.  Wet work.  Kidnaping. Assassination.  It is at that.  I never made that claim.  You were behind the door?  You would have done that?        You said it yourself: Gregor's not dead. If they had the package, they'd have killed him. They're going to get it.  Don't do it...  Oh please..you're on some sort of holy mission?  Don't even think that I'm buying that.  I didn't say I was.  Don't even think it.  I'd kill you before you had it halfway out.  Put your seatbelt on.  I don't know...  Give me a cigarette.  Gimme a goddamn cigarette!!!!  Nice place.  Business keeps you on the road?  I know I don't need to say this to you, but I need to say it to you. This is my job, I have to do it.  No you don't, and you know it.    Yeah.  We need out fucking heads examined.      Not here.  They might see it.  Time to quit.  Not just like that... Just before I turn around and it's six months from now and the first thing I do when I wake up in the morning is light a cigarette.       Because I don't walk away.  It's the one thing I've got left to hold onto. Jean-Pierre is one of your closest friends, is he not?  And yet you would have killed him to save my life. You have a sense of honor, Vincent, that I can't even remember anymore.  I don't know that I ever even had it to begin with.  All I know to do, Vincent, is to finish my job.  That's a good question.  (he's really just considering  I'm on point, Vincent.  Let's work our way through the building. I'll take one wing, you take the other.  Watch your back, Vincent.  Go on, them...  I'll work on it...  That's me.    And now...  Deirdre, wait up --  Are you alright?  I'm sorry, I can't allow that.  Call that number and ask them what you should do.  Thank you very much.  Here and there, I guess.  What?  What of it?  You don't owe me a goddamned thing, Vincent, and you know it.  You stepped in front of a bullet for me. I owe you a heavy debt.    I don't know.  Nobody knows, except a bunch of people who are too dead to tell us.  There's probably a couple of guys back at the Company who know, but I don't think they plan to tell me anytime soon.  Gone.  Destroyed.  It's what you would have done.  I told you, I quit.  Not me.  You work too often with the same people and you become friends -- clouds your judgement.  How much does it pay?"
    },
    "imdb_rating": "7.2",
    "description": "Ronin is the Japanese word used for Samurai without a master. In this case, the Ronin are outcast specialists of every kind, whose services are available to everyone - for money. Dierdre (undoubtedly from Ireland) hires several Ronin to form a team in order to retrieve an important suitcase from a man who is about to sell it to the Russians. After the mission has been completed successfully, the suitcase immediately gets switched by a member of the team who seems to work into his own pocket. The complex net of everyone tricking everyone begins to surface slowly, and deadly...—Julian Reischl <julianreischl@mac.com>",
    "name": "Ronin",
    "genres": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BOWVkYzliZGEtODIxMi00MDQwLThjMDAtNzI3M2NjYjg4NDE5XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}