{
    "filename": "Rush-Hour_script.txt",
    "imdb_id": "tt0120812",
    "imdb_url": "https://www.imdb.com/title/tt0120812",
    "characters": [
        "Lee",
        "First Caucasian",
        "Dinner Guest",
        "Soo Yung",
        "Soo Yung's Driver",
        "Sang",
        "Griffin /Juntao",
        "Clive",
        "Exposition Official",
        "Carter",
        "Cop at Diner",
        "Cop at Diner (as Larry Sullivan Jr.)",
        "Soo Yung's Bodyguard",
        "Consul Secretary (as Yan Ling)",
        "Consul Han"
    ],
    "dialogues": {
        "Lee": "[You must stay here.]  Ambassador Han nods. The FBI agents run up. To them:    Glaring, Colonel Lee looks over at the FBI cars as they pass.   You should not have interfered!  Carson shoves Colonel Lee out of his way, hard.    You are tapping our phones?!   I will bring the money to him.   The hostages are citizens of the People's Republic of Korea --   -- Then he can come with me.  Walther looks at Miranda. She nods her assent.   Turn around!  But Carson hugs the shoulder, moving through the heavy traffic, until he spots what he was looking for:  The Biker Club, riding in formation up ahead.  Carson cuts in front of them and slams on the brakes. He jumps out and grabs one of the Biker's machines by the handlebars, wrestling it to a stop. While pulling its BURLY OWNER off it:    gets in the driver's seat of the Mercedes and turns it around.   There is no surveillance equipment. This is a diplomatic facility --   Analog.   Stolen!? What is it with you people --    And our car was stolen.   Perhaps someone will decide it is foolish to incur the wrath of North Korea.    Why wait until five?  Ambassador Han and Walther keep Carson and Colonel Lee from going at each other.   Wait!  Colonel Lee walks over to Sabatini.   Inside.  Sabatini starts down the hall. Colonel Lee stays where he is.    Colonel Lee sees the Apache helicopter approach. He leans into the back seat, knocking the top off a long, plastic crate.      Colonel Lee depresses the trigger on the launcher and a rolling-pin-sized rocket is EXPELLED.    Colonel Lee screeches to a stop 500 feet from the bulldozers, angling the Mercedes so the driver's door is facing them.    Colonel Lee calmly aims the rocket launcher and FIRES.    Carson pushes the Mercedes across Bellevue Avenue, toward the park surrounding Echo Lake. Colonel Lee STRAFES the ambulance.    WATER pours in from the floorboards, the air vents...  Colonel Lee climbs out through the sunroof and FIRES at Carson with his AMD-74.   Victory!  Carson dives back onto him. But he twists his arm around and PULLS the trigger -- with the muzzle underneath his own chin.  Carson, Miranda and Ambassador Han are SPRAYED with his blood.",
        "First": "",
        "Caucasian": "",
        "Dinner": "",
        "Guest": "",
        "Soo": "",
        "Yung": "",
        "Sang": "",
        "Griffin": "",
        "/Juntao": "",
        "Clive": "",
        "Exposition": "",
        "Official": "",
        "Carter": "",
        "Consul": "A Colonial-style mansion, surrounded by an imposing, wrought- iron fence. There is a bronze plaque, in English and Korean, next to the entranceway: Consulate  of the Democratic People's Republic of Korea  The driveway gate opens and a long, black Mercedes with tinted windows and diplomatic license plates glides out.    An alert North Korean CORPORAL watches the perimeter MONITORS. He pushes a switch to close the gate behind the Mercedes.      Joy is standing on the toilet, blowing cigarette smoke into the exhaust fan. Someone KNOCKS on the door. She flicks the cigarette into the toilet, puts a ZIPPO LIGHTER in her pocket.    Joy opens the bathroom door. Sam is standing there, grinning.    Sam and Joy sit at the table. AMBASSADOR HAN and MRS. HAN are having breakfast: radish soup, kimchi and grilled fish.  Ambassador Han reads through the morning's faxed communiquÈs. He's 43, rarely smiles, and hates living in the U.S. He's dressed in an impeccably-tailored, Valentino two-piece suit.  Mrs. Han is slender, soft-spoken, but as iron-willed as her husband. She, however, is quick to smile. She's wearing a summery dress with a white sweater over her shoulders.  Ambassador Han pulls the front of Sam's shirt to reveal the \"Nirvana\" logo on his T-shirt.      The Driver backs the Mercedes out of the garage behind the Consulate. We notice there is ANOTHER MERCEDES parked inside.  Mrs. Han, Sam and Joy come outside. They hear some heartfelt   A dark-green government Dodge pulls up and parks behind one just like it on a paved area near the Consulate gate.  DAVE JUAREZ,  gets out of the Dodge and hangs an FBI shield over his top pocket.  He glances over at North Korean Security Chief COLONEL LEE, , who has paused inside the gate to regard Dave, and the outside world, with profound contempt.  Dave, attachÈ case in one hand and notebook computer in the other, walks to a 10-by-15 detached guardhouse on the far corner of the property, just outside the high fence.    Inside are two desks and four chairs, a console of communication equipment, a microwave and a Mr. Coffee.  Dave enters. Two FBI agents, finishing their shift, gather their belongings: ROBBINS  and   Colonel Lee and a North Korean Army OFFICER come running out. ANOTHER OFFICER starts up a car in the back of the house.    Robbins and Sabatini see the commotion and go to investigate. Dave follows.    Ambassador Han runs out. He has a stricken look on his face.    As the copter lands, Carson comes out to meet Walther.    Carson and Walther come into the house. We hear only the TICKING of the grandfather clock in the foyer.  Colonel Lee and his Officers stand by the stairs; Robbins, Sabatini and Dave stand together near the front door.      Dave and Robbins watch Sabatini work the comm console.    Ambassador Han turns on the TV to channel 4.    Everyone stares expectantly at the TV. They turn as the fax machine on the credenza RINGS. An IMAGE begins to emerge from the machine: the picture from Javal's digital camera.    Robbins, Sabatini and Dave look up as Carson and Walther enter.    Carson turns off the Beach Boys SONG on the TV behind him.  Holding Javal's faxes, he's facing Ambassador Han, Colonel Lee and the Hostage Negotiator    Still fuming, Carson walks ahead. Miranda pulls Walther aside.    Dave stares at his computer, looking through a DATABASE of kidnappers and their modus operandi. He rubs his eyes.    During this, Colonel Lee stands in a window on the top floor, pointing a LASER EAVESDROPPING UNIT at the FBI guardhouse.      Inside, the grandfather clock in the foyer CHIMES THREE TIMES.  Colonel Lee, carrying an AMD-74 machine gun, goes to get in the driver's side of the second armored Mercedes, but Carson is already there. Grumbling, he crosses to the passenger's side.  Carson drives off just a moment before Colonel Lee is completely in the car.      Miranda, Ambassador Han, and Lisa's father (the cussing Jag Owner) wait by the phone. Miranda smiles reassuringly at the two nervous fathers. The phone RINGS; she picks it up.    Miranda looks at Ambassador Han and Lisa's father while anxiously clutching her two-way radio.    Listening to the two-way, Miranda tries to follow the action.    The clock reads 3:50 PM. Carson, Miranda, Robbins, Sabatini, Ambassador Han and Colonel Lee are all TALKING at once.    In the converted attic, several North Korean ESPIONAGE AGENTS monitor military and police frequencies, downlinks from remote wiretaps and surveillance units; short-wave, cellular, etc. Their equipment, being of Chinese and Iranian manufacture, is hardly cutting-edge technology.  Colonel Lee and Ambassador Han enter. The Espionage Agents are surprised when Carson, Miranda, Walther and Sabatini follow. Walther looks around, amazed. Carson grabs a pair of headphones.    Carson clicks off the phone, then, as he dials another number:      Carson grabs his FBI blazer off the back of a chair.    The government helicopter touches down behind the Consulate.    Ambassador Han, Walther and Sabatini are looking at a series of high-definition faxes spread out on a table.  Carson, Miranda and Colonel Lee hurry back in. Disgusted, Carson throws his jacket on a chair.    Everyone is painfully on edge. Ambassador Han paces. The FBI agents are on a phone or a radio, working leads.  Colonel Lee mutters something to Ambassador Han in Korean.    Robbins is still working the phone.      Carson hangs up the phone.    The mood is glum. Carson looks at Robbins, Dave and Walther, then at the empty chair where Sabatini had been sitting.    The TV's are off -- so they see none of Bobbi's report.  Carson crosses to Dave. He's at his computer, looking at a long column of telephone numbers.    Carson bursts through the door just as the second armored Mercedes CRASHES through the wrought-iron entry gates. Carson fires several SHOTS, which ping harmlessly off the Mercedes.  Carson sprints for a car. Miranda's Volvo is the closest one.    In the back of the Consulate, Miranda, sore as hell, climbs into the government copter. It WHINES to life and TAKES OFF.    Sweating, Dave is watching the ACTION outside on a TV while hurriedly bandaging Robbins' shoulder with some torn cloth. He grabs for the two-way and we realize he's panicking.    Dave, calmer but still sweating, taps at his computer. A schematic of Colonel Lee's rocket launcher appears on it.      Dave sits in front of his computer, phone receiver resting on his shoulder, riveted by the ACTION on the TV.    Dave is looking at the TV, paying no attention to his computer.    Dave, re-energized, is juggling the phone and the radio.",
        "Han": "[Go change.]  Ambassador Han's X-ray stare turns to Joy.    [You smell like a fireplace.]  A BUTLER appears with a phone. He WHISPERS to Mrs. Han.   It's the Governess...  Hello, Hilda...    We will see you next week...  It appears I'll be taking you to school.   Someone took my family!  The agents look at each other -- holy shit! Colonel Lee's car SCREECHES to a stop. Sabatini stands in front of it.     My men are going!  Colonel Lee jumps into the car and it screeches away, almost running Sabatini over.    It's a white telephone van, driving west on Washington Boulevard.  The agents rush back to their guardhouse. Dave's government Dodge is blocking theirs.   I don't understand...  She looks at her sound meter, which jumped close to the red.    What happens if the circuit closes?   Mr. Walther?  Ambassador Han comes down the stairs, his face tight with repressed emotion.   -- I have no wish for condolences. Just answers.    Yoon..?!    We are not hurt. But this man is very serious --  He pulls the phone from her, takes a breath to compose himself.    I need to know my children are all right.   There is a television in my office.  As Carson, Ambassador Han, Colonel Lee and Walther hurry to the office in the back of the house, Carson's radio crackles:    Ambassador Han turns on the TV to channel 4.    Everyone stares expectantly at the TV. They turn as the fax machine on the credenza RINGS. An IMAGE begins to emerge from the machine: the picture from Javal's digital camera.    P'yÚngyang must approve the ransom...    Carson turns off the Beach Boys SONG on the TV behind him.  Holding Javal's faxes, he's facing Ambassador Han, Colonel Lee and the Hostage Negotiator   Perhaps that is better. Inspector Carson knows the terrain --    Miranda, Ambassador Han, and Lisa's father (the cussing Jag Owner) wait by the phone. Miranda smiles reassuringly at the two nervous fathers. The phone RINGS; she picks it up.    Miranda looks at Ambassador Han and Lisa's father while anxiously clutching her two-way radio.    Listening to the two-way, Miranda tries to follow the action.    The clock reads 3:50 PM. Carson, Miranda, Robbins, Sabatini, Ambassador Han and Colonel Lee are all TALKING at once.   This is impossible! How can you even begin to find them?  Good question. All eyes go to Miranda.   Take them upstairs.   You heard him -- for money.    It won't.     I felt safer when I was the Ambassador to Libya.   He asked you if you had to go...  The family becomes aware of a shrill SOUND, , distant at first, but growing increasingly louder... The sound-level meters all begin to creep upward...    On occasion, my wife has been known to kick my ankle under the table.  Miranda gives Carson a \"your turn to be gracious\" look.   There are men in my government whose power depends on North Korea staying as it is: Socialist, repressive, isolated from the world. They'll resort to anything, even war, to keep it that way. They have the Hitler Syndrome: if their country cannot exist the way they want it, they would rather see it destroyed.   There could be another riot...   Strela-2...   I don't think so -- they said it was solid as a rock.    I can't believe I'm still alive...   What are both of you doing?  Carson turns, surprised and annoyed to see Ambassador Han, his arm bandaged, lying in the cot in the back.   Let him up.  Carson's not so sure, but they're completely surrounded by military and law enforcement personnel. He releases his grasp. Miranda removes her heel.  Then, with lightning reflexes, Colonel Lee grabs Vreeland's Rock Island Arsenal Colt .45 Auto from its snap-holster.   Do it.  Joy drops the lighter to the floor, then swats it with her foot to Mrs. Han. She does the same, passing it to Sam, who's sitting closest to the window.  With one eye on the VU movement meter, Sam kicks the lighter, sliding it across the carpet toward the curtains.   Can't you disarm the bomb?     Sam covered them with chewing gum."
    },
    "imdb_rating": "7.0",
    "description": "Cultures clash and tempers flares as the two cops named Detective Inspector Lee a Hong Kong Detective and Detective James Carter LAPD, a big-mouthed work-alone Los Angeles cop who are from different worlds discovers one thing in common: they can't stand each other. With time running out, they must join forces to catch the criminals and save the eleven-year-old Chinese girl of the Chinese consul named Soo Yung.—Anthony Pereyra <hypersonic91@yahoo.com>",
    "name": "Rush Hour",
    "genres": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYWM2NDZmYmYtNzlmZC00M2MyLWJmOGUtMjhiYmQ2OGU1YTE1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UY281_CR1,0,190,281_.jpg"
}