{
    "filename": "Save-the-Last-Dance_script.txt",
    "imdb_id": "tt0206275",
    "imdb_url": "https://www.imdb.com/title/tt0206275",
    "characters": [
        "Glynn",
        "Arvel (as Artel Jarod Walker)",
        "Sara",
        "Momma Dean",
        "Lindsay",
        "Chenille",
        "Woman on Train",
        "Kenny",
        "Lip",
        "Diggy",
        "Roy",
        "Snookie",
        "Derek",
        "Nikki",
        "Malakai"
    ],
    "dialogues": {
        "Glynn": "What's the matter?   It was good.  I noticed that it was fine.  Sara.   You'll get in.  (giving up that  For luck tomorrow. Not that you'll need it. You dance like an angel.  Where'd you get those, traitor?  Roses from the principal, even droopy, out-of-season yellow ones, is beyond cool, kiddo. You're definitely movin' up in the world.  Ruin everyone's Valentine's Day and not have a shop when I get back. That's your definition of great? I can see the headline now: 'Starving Artist Kills Unfit Mother.' Sweetheart, we talked about this. I'll get there as soon as I can.  I won't miss your audition, Sara. I'll be there, okay? If I have to swim the Susquehanna, I'll be there.  I'll float then.  Hey... Happy Valentine's Day.",
        "Sara": "Used to.     (checks her (then, beginning  (escalating  And it just lays there, it doesn't do anything. I bet they notice that. That it doesn't do anything. That I don't do anything special enough to get in.  Don't lie because you love me.     My free form sucks.  I love the necklace but you're still the best luck I'll ever have.     Oh. It's a good luck charm. Doesn't always work.    Ellison -- Mr. Ellison. He actually told me to break a leg.  Know what would be great? If you didn't drop me off at the bus station. If we just kept going until we get to Philly.  Right. This is the hardest, most important day of my life and all you can do is get there as soon as you can. Thanks, Mom.  So I guess I'll see you later.  Swim?   You can't swim, Mom.      Well, it's um, pretty self- explanatory. The theme.  Thank you.  Hi.  Slept through most of it.  Two suitcases.     One big one.  I'm kinda tired.       Uh-huh.  Thought you were moving to Fells Point.  You bought a bed?  Do you have a phone?  You didn't at the last place.    The last place I saw anyway.  Over the summer. You blew me off for some gig on the road, remember? Can I call Lindsay? Let her know I got here alright.  I feel fine.     I feel like calling Lindsay.      I can take the school bus. Tomorrow.  Well, I know how to do both.  -- I don't think I'll have time. I have to study, I'll be busy.  Like you stay on top of yours?    You don't have to go in with me. Since I'm all set. I mean, I have done this before. Gone to school. I'll be fine. I am fine. Really.    About school?     No.   Not really.  I'm not gonna be here that long. Besides, it's just a city, right?              It's a non-fiction novel. The first of its kind. Capote mixed true events with things he couldn't know, so he made them up.  Yeah.   That is part of it.  Lots of people read them.          Sara.   It's Sara.  God!    Thank you!      What's it called? What she's doing?    Asshole.  (covertly indicates  So you know him?  He's embarrassing.  Fine.       What?  I had a big lunch.  It's a school night, Roy.             I know it's too big.          I don't know...  For what?  Look closer. And if I still look green, I think maybe you should wipe the crust from your eyes.  I don't even know where it is.  That's okay. I dance in circles. Probably around you.     Chemistry.  Right now it's taking me.  I'll be asleep.      Cool outfit.  ... I look okay?  Hi.  Is that... is he... yours?   Chenille.   She's ugly.   She's fat!  Wait. I have to ask you something. Do I really look alright?  It's from the GAP.  I'm not walking in there in my bra.       What are you, some kind of V.I.P.?  Sara. It's Sara. And I know you. We have a class together.    Rum and Coke, straight up. And a beer. I don't care. Anything.  It's just a beer.  Whatever.  Whatever you want it to mean. You're the whiz kid, right? You know everything.  I don't feel like dancing.  Would I be here if I didn't?           It's just a few blocks.   It's okay.       I have to look somewhere. The streets are deserted. Might as well look at you.  It's not a question. It's the way you were beating that kid up. You looked so mad.  Not like that. You were really kicking his ass.  Are you laughing at me?  Maybe he's my question. Your friend. Chenille doesn't like him.  It was great.  It wasn't the music I wasn't used to. I mean, it's not the first time I heard hip-hop, Patrick.  Not all the time. But a lot.  We passed it.  Thanks for walking me.  So.      I'll see ya.  I haven't said gee-whiz since I was six. But I really had a great time... okay?  Oh.  You're right. I should've said something. I'm sorry.  Nope.     Nothing special.  Just adding to my collection. I heard some stuff I didn't have last night.  Not as fly as you.    Okay.   Sure.             What happened?       How 'bout fuck it? Or should I say fuck her? It's a fuck-fest, Roy.  Sorry you got caught.  Really?   How often do you have it?         I don't think it's realistic, what you're asking. Things happen. Things change. And the changes change you. What's the point of plans?  You can't direct destiny.  That was a long time ago.  (hadn't thought about  Did you always want to be a doctor?  Chenille.   Everybody.  What kind of doctor do you want to be?  Do you have any? Kids.  I wasn't being smart, Patrick.  Screw you.      I'm brilliant.  I didn't get it. That thing you just did. Show me again?  A releve.    Over ice.     With a twist.  (succumbs to his  Uh-huh. Used to as in don't any more. And don't ask me why.  Because I don't want to talk about it.  Because it's not a big deal.       Can we just concentrate on this?      What are you doing?  Yeah I liked it. I was gonna go to Juilliard. That school fucked up my entire life. It's a long story.     Why'd you do that?  That's a good reason.  You and Malakai?  I don't get you guys.    You seem so... different.  Maybe you weren't then but you are now. You said you changed.  I think Malakai's scary.   And I know you're not.  Patrick.  That means you owe him something?  No matter how much he messes up?  I stole a hat once. When I was twelve. My mom found it under my mattress, made me take it back.  You gonna turn me in?    There's nothing to say.  I'm sorry she's dead. God! What do you want me to do? Run through the streets screaming?       Are you gonna tell me where we're going? Why is the surprise for me? You're the one with something to celebrate.  I wanted to get you something and I couldn't figure out what. It's not much but I hope you like it.  Wait.     There's more.     We have an audience.      Work with me.  (sotto voce,      I did.  I'm sorry.  I don't want you to think I didn't have a good time tonight, Patrick. I did. But ballet isn't a part of my life anymore.    Maybe I don't want it to be real.  What I want is to wake up and see my mom. For things to go back to the way they were. When they made sense. When my life made sense. And it's all my fault. She got scraped off the highway for me, for my fucking audition. She was rushing. It was raining. It was raining... ... But she promised to be there. I made her promise. And then I didn't wait for her. I should have but they called my name and I didn't say anything. I just went out and danced. I was mad. I needed her and she wasn't there.    That's what makes it so bad. She always did what was right for me. I wanted to be a prima ballerina -- had to be. Even if it took most of our money, all of her spare time. I didn't care. It was my stupid dream and it killed her. All she wanted was for it to come true.  I know... but she... I just don't think I can do it without her.  Yeah.   I do.  Yeah.   For my mom.  See you tomorrow?        Practice.  I don't get in shape like that. But it's still a good spot. I got my application for Juilliard. Just in time too. They're holding auditions in Baltimore next month.  I'll never be ready in a month.  (a smile in spite of  You don't understand. Ballet takes a lot of time, a lot of preparation. I used to practice two, three hours every day. I'm so far behind...  It's not as easy as that. My free form still sucks. It's still the weakest part of my routine. That hasn't changed.  You will?          Let's skip. Later.          What?  He's in D.C. Blues Alley.   He'll be gone all night.  Roy's demo. The only one he ever cut. Kinda grows on you.  Wanna see my room?  Sorry...      Excuse me?  Whose motto?  Don't forget, they all have big dicks and beat their wives. Everybody knows that too.  I don't have a favorite.  I dunno. Maybe cymbidiums -- orchids. They're sort of show- boaty but they're pretty.  Agua.  Mmm.    Mauve.  Nut.   What are you talking about?  Why does he have to leave?   We're all adults. Right?  I hate being your daughter.    You ruin everything.  You mean it because he's black.  Why's it bullshit? Because you hang with black guys and play jazz and have the hots for Angela Bassett?  Keep telling yourself that. Just don't expect me to believe it. I saw how you looked at him. But you didn't see him. Well, for your information, he's a straight- A student with more heart and guts than you'll ever have!    I have you figured out. You think you can make up all the time you missed, all the things you didn't do? You can't! I'm here because I have to be and it's a goddamned nightmare.  How the hell would you know? You've been asleep for the past thirty-seven years!     Over? I don't even know why it started... bitch. And don't say it's about Patrick because it's not. It's not about him.  I like him, he likes me. And if you don't like that, screw you.     I got suspended. Two days.    It's alright.    I'm okay.  Look.  It's not a good time. I'll see you later... I'm okay.  Want me to take him?  I'll get 'em.  No.   I explained about Nikki.  She started it, Chenille. She wanted to start it. I told you what she said.  So you agree with her? You think I don't belong with Patrick.    There's only one world, Chenille. I thought we were friends. Guess I was wrong.  I gotta get home. Ready?            We should keep going.  I know I messed up. I'll get it right the next time.  I can't work like this.      I can't dance like this.  Like this.     You dictating to me.  Nothing's wrong. I can't figure things out.  Things, Patrick. Things between us. Things between us and them.  Well, open your pretty brown eyes, look the hell around.    I'm just saying that we should think about this, that's all.  Why are you getting mad?  You're never gonna run your own life as long as you keep running back to Malakai every time he fucks up or fucks you over.  I know he's lost, Patrick! Everybody but you can see that. And if you keep reaching back for him, you're gonna wind up lost too.  They weren't rednecks!  The hell with you too!    Hi.  Toni, listen carefully. You're a simple bitch and you don't have any friends, black or white, because nobody likes a fucking asshole.       Uh-huh.   The big day.  You're not so bad. I didn't give you much to work with. It's not like I've been the perfect daughter.  I don't hate you. I miss her. I miss Mom... ... Patrick's pissed at me. I'm pissed at him. He's not coming tomorrow and I want him there and I don't know what to do.  I wanted somebody there who loves me.           Yes... sir... they have... my music.  Yes.  Emo... Emotion.      I'm sorry. I wasn't ready.       Can you start it over again?  I'm ready.      Thank you.   Very much.",
        "Momma": "Hello. Now don't get him all riled up, Chenille. I want to get some sleep tonight.  I know you're not puttin' those dirty hands inside my refrigerator.  This what you're lookin' for?",
        "Dean": "Hello. Now don't get him all riled up, Chenille. I want to get some sleep tonight.  I know you're not puttin' those dirty hands inside my refrigerator.  This what you're lookin' for?",
        "Lindsay": "Wanna pray? You're leaving for Philly after first period. I won't see you. We should pray.  'Awesome, Father, S.J. auditions today. She's ready for them. Please make them ready for her. Even if she screws up. Thanks. Amen.' God's gotten me outta all kinds of shit. He oughta be able to get you into Juilliard.    Jesus, Sara, you're in the freaking ghetto. Forget the riots. How are you supposed to meet anybody?",
        "Chenille": "That's how easy it is to give to charity around here. Don't put your shit on the floor.         Yeah. It's Sara. And you're boring her from the ears down.  You finished?    A dance.  Asshole beaucoup. In this crowd, you gotta be more specific.  I don't know about cute but he is smart. Real smart. Real trip, too.  Patrick Reynolds? Hell yeah, I know him. He's my brother.  That's your old man? Now he's cute.    Why?   Your hand busy?  You must be lookin' in your dreams.  It's in the mail, Patrick.       Okay?  That time? What? Fifth and sixth grade don't count?  Girl, how you get your legs to twist like that?  This is Diggy.     Thinks she's down.  So, Sara.   What's up with that?  You should hit Feetz with us tomorrow night. It's a club. Sorta members only.  Come on and hang out. Snook dee's sometime. He can get you in. Yo, Snook  She needs to get hooked up for Feetz. All the way up. Sara, give Snook twenty dollars.  You gonna pay the man or what?  So we'll hook up at my house. Go together. I will have your I.D.  Slammin'.   Slammin' outfit.  Yeah.  You look okay. Moma Dean. I'm leavin'.  (fussing over  He sure ain't Momma Dean's.   ... He'll be one in July. Best mistake I ever made. Kenny -- Christopher's father -- he's the worst. Triflin'. Okay?  She's twenty-one too. I ain't got all night. Let's hop.  Gimme that '89 Madonna shit.    Your jacket. Give it here.  It's country. You look country in it. Take it off.     Rope dopes.   C'mon.  Too fine to stand in line?  Let's get our table 'fore it gets crashed and I hafta hurt somebody.  Snook hooks me up whenever he dees.  Got what?  (as he can't think of  That's how I thought I had it. See ya.  Yeah.   And they started with you.  Quit it, Nikki.  Oh, no. Uh-uh, wench. You did not just call me a Negro.  I can say a lot more. Keep runnin' your mouth, Nikki. I'll lay all your shit bare.  'Cause I can't stand her ass and the way she played my brother. I need a drink, Sara. Let's walk.  That's him.        Comin' over.   Kenny? Don't look.  Where's my money, Kenny?  It's comin'?    No. You lyin'.  Rum and Coke.    No ice.   Hook me up.      ... Yeah, I'ma tell you. Tell you like I keep tellin' you, Patrick. You need to let Malakai alone. Let him handle his own shit before he drags you down in it.  I'll see you Monday. He'll walk you.  No, it's not okay. Would you tell the girl it ain't okay?    Beauty school.  I'm a year behind 'cause of my baby, but I'm gonna work during the day, go to school at night. That's my plan anyway...   He's a baby.   They cry.  He don't know you, Kenny.  Come around more often.  And I can't depend on you! Am I askin' you to do anything for him you ain't supposed to do?  -- I want you to pick up some of the slack. You always have an excuse.  You wanna talk about tied up? Try gettin' up in the middle of the night to change diapers and give him bottles or stayin' up with him when he's sick and havin' to drag your ass to school the next day.  It ain't good enough, Kenny!  How's Arvel?  You see Sara? She alright? You didn't hear? Nikki jumped off at her in gym. It was fierce...     What? I'm supposed to get excited because you decided to skate by and drop a dollar on the dresser?  Money ain't got nothin' to do with it, Kenny. You don't come around because you don't feel like comin' around. You don't want the responsibility of comin' around. As long as you out there and I'm in here, you know your son's being taken care of. You ain't got no worries when it comes to him.  Be sick of it. You ain't got to see me to see your son.  That wench. You gotta stand over her to make sure she puts your name on the damn list. Triflin' bitch.  So your old man flipped about the fight. Probably thinks it's all Patrick's fault.  Right. You put it all on her. None of it's on you.  Maybe she didn't have no business gettin' in your face. But she had a reason to say what she said.  What I think don't matter. But you and him act like it don't bother people that you're together. Like it don't hurt people to see.  Black people, Sara. Black women. Patrick's about somethin'. He's smart. He's motivated. He's for real. He ain't gonna make no babies and not take care of 'em or run the streets, fuck up his life. He's gonna do somethin' with himself. Here you come, white and right, and you take one of the few decent men left after jail, drugs and drive-bys. That's what Nikki meant about you up in our world.  Why you so quiet? Patrick Reynolds ain't got nothin' to say? That's a first. You know how I go off on folks sometimes. I mean it and then I don't mean it. Like what I said to Sara. Guess she told you.  Patrick. Your ass is on your back and your lips are on the ground. You care, baby brother. And not just about what I said. You seriously like Sara. She got a serious jones for you. Am I lyin'?  I'm sayin' you can't help who you love, Patrick. At least you found somebody who loves you back.  To where? To who? Malakai? You ain't through with that fool yet.  No. You know what? You're the fool, Patrick. You think you let Malakai down and all you did was try to pull yourself up. Ain't no blame or shame in that.       I know I come down on you hard about money, but I would rather you spend the time. Seriously.  I didn't say all that.  Yeah.   I always knew that.",
        "Kenny": "What's up?  I'm a little short this week. Don't jump off. It's comin'.  Lemme rap to you about the situation on the dance floor.  Why's he do that?  He was screaming, Chenille.  I'm his father. He knows me. ... What should I do?  See?    I can't talk to you.  You don't ask, Chenille. You make demands. You want money, you --  It's not like that.    I get tied up.  Look.    I'm doin' the best I can.  It's more than a dollar. And it's all I got. I got laid off rom B.W.I., Chenille. I been workin' part- time. Money's tight. You know how you are about money. That's way I haven't been coming around.  And you don't have no   feelings when it comes to me.    All you do is bitch and complain   about what I don't do. I get sick    of that.  I'll be sure to keep that in mind.     It cut me, what you said.  You always trip. I'm used to that. Besides, you were right. You were wrong, too. So was I. I need to do better. Ain't no doubt about that.    I love my son, Chenille.    You know that, don't you?",
        "Lip": "... And Christmas ain't even for 'nother six months.  Aww, man. You busted. That's why your jaws are gettin' so tight.  -- Or gives you some.  Awww, shit.      Here we go.  Let him out!   We don't need him.",
        "Diggy": "Egg-cuse me?     I am down.  Un-der-ground.  Alright, y'all. Chill.  Why you burn her like that?  It's about to get real out here. Cops and shit. I'm gone.    A Rock-n-Rap club in L.A. I'm gonna put a tattoo parlor on the roof. Soon as I find some investors...  Go, Sara!   Go, Sara!",
        "Roy": "Hi.  Have a good ride?  Guess you got stuff.    Baggage.  Looks like they're unloading. -- You hungry? We can stop somewhere if you want.       I didn't like leavin' you so soon after the funeral. I wouldn't have if you hadn't asked me to go. I mean, I could've hung around. Helped you say good-bye. That's what you were doin', wasn't it?  That's what I figured you were doin'.  Look. Sara. I feel bad too. I mean, we both got hit by the same bolt of lightning. You don't have to pretend this is easy. Everything's upside down right now but don't worry. We'll work this bachelor-father thing out. Hell, it ain't like we're movin' in with strangers. We got a pretty good idea about each other, right?  Fell through.     Not much of what you're used to. But the water's hot and the fridge is full. And I made room in the closets for you. Girl's gotta have closets, right? You even get your own bed. I'll crash on the couch.       Of course I have a phone.  Things change. You've changed. You grew up on me. Overnight.  Are you alright, Sara? I just wanna know how you feel.  Phone's in the kitchen.   Knock yourself out.   School bus? That's the other Oz, Dorothy. Patterson kids ride the city Metro. Or walk.  Not around here you don't. Not until you get the hang of things.  I called about your transcripts. You're all set. Patterson's got a pretty good Humanities program. No ballet, but we can find a studio someplace close for after school --  Good idea. Take a break. Not too long a break though. You're a dancer. You should dance. Stay on top of your art.  Maybe I ain't playin' no grand ballrooms or fancy jazz festivals, but I'm playing.  S'alright. Hell, I wish I had half the time I wasted gettin' wasted. But those days are over. You'll see. I got my life on track.  -- Pick you up. Three-thirty.     How'd it go?       Hey, Sara.   C'mere a minute.  Just come here.  Hungry and Healthys. I asked at the market. They're the best. So. What do you feel like? Lamb Chop Suey? Tropical Tuna? Primavera Paradise?  What do you wanna do? You wanna hang out with me? Go to my gig. You can if you want.  Right.   School night.    Got it.          I'm splittin'. Whatcha readin'?  You're takin' chemistry?  Give yourself some time. Well. See ya in the mornin'. Maybe I'll call between sets.     Figured I'd put a little marrow in your bones. Siddown, siddown. You gettin' along at school? Makin' friends...? ... See any of 'em last night?  I came home on my break.  ... Oh? Jesus! You're hard! Look. You're seventeen. If you wanna go out, go out. But don't lie to me. On top of everything else, don't make me worry like that about you.   (sits down; trying  What're you gonna do today? Anything special?             I don't know what to say.    I don't.  Don't talk to    me like that, Sara. I thought you    were goin' to your friend's house    after school. Obviously, you    changed your mind. So I'm sorry.     Alright?  Sorry I got... observed  It's nobody's 'fault.' It's over. Let it be over. We're all adults.  Rhonda.   Shut up.   Please.                   Let's 'skip'? Three months and she's skipping?          Patrick -- it is Patrick, isn't it? Well, I think you were just leavin'.  He either leaves or I throw his ass out. Your call, Sara.  Who the hell are you to tell me how to come off? You're in my house alone with my daughter.  Siddown. It's a free country, you can hate me. Ain't like that's exactly news. But disrespectin' me, that's where the road ends, Sara. I don't want him up here again. I mean it.  Don't start that bullshit!  Because he was in my house with his hands all over my daughter!  Yeah? Well, when are you gonna have the guts to say what you really want to say to me, Sara?  Sounds like you have it all figured out.  Well, you might as well wake up and get used to it, Sara, because that's the way things are sometimes, the way life is.     What the hell happened to you?  For what? Fighting? Why were you fighting, Sara?     I was wondering... how long you plan on hating me? Maybe I'm an optimist but I hope there's some kind of timetable. Well, I don't wanna bug you. I just came in to say good luck.  I saw the return address. Got curious. It was open. I read it. I know I shouldn't have but at least now I have an excuse to tell you how proud I am of you, Sara.  Tomorrow's the big day?  You bummed out about it? You're a worse liar than I am father.  Well, it ain't like I deserve a perfect daughter. I screwed up. Did everything in a hurry and still thought I had all the time in the world. To be in love with your mother. Be a father to you. But time flies. You look up one day and all you got to show for yourself is a pretty little girl who hates your guts and won't talk to you because too much time went by.  You want him there. I understand that. But whatever he brings to the table, Patrick can't dance for you, Sara. You're the bottom line out there. This is your chance to be the dancer Juilliard came to see.  I love you.",
        "Snookie": "Gay rights. That Compote dude who wrote it? Sweet tooth. Straight- up fag, Mr. J.  Mr. J.! Girl needs to bone up. Give her a pass to the lib'ary.  I'ma shut up... after I say it been real frigid 'round here since y'all broke up. 'Specially since she broke up with you. That was harsh, way she canceled your ass like a stamp for that Howard U dude. But their shit's over. Now might be the time to forget mistakes that was made. Shoot. You been with the girl since ninth grade.      I need a date --  -- For the prom. And if it wasn't for that kinda undue attitude, you could be the lucky girl, Chenille. My personal prom queen. I can see us now.  Help me, man.    Defend me.  What problems? You goin' to college. Doctor college after that. You large, man.    I.D. Eye-dee. How you think you gettin' in? On your looks? Chenille, your girl is weak. Shit. I got my rep to watch. I can't just be gettin' any green in.  She ain't got it. Look at her. Loud-talkin' me and broke as a damn promise.  ... How   you   know I can't do nothin'   for   you? I'm the hardest workin'   man   in showbizness, girl. C'mon.    Let   me be the bomb in your shell.  That was black magic, Patrick. It's gonna work one of these days.  Last one on the rack. I snatched it up for you. Rang it up on my discount.      Me? I wanna operate on cars. Some place fly like the Kentucky Derby. -- Ah-ha! Joke on you...  Go, Patrick!    Go, Patrick!  Lip. It's a so-to-speak thang, you ignorant fuck.    You the one need his jaws tightened with your pork-ass instigatin' self.  You see us, Patrick?  Me and Sara lit it up!      Y-e-o-w!    That was a reflex action, man. And you just plain rude and wrong to bring the shit up in mixed company.  Patrick, man, c'mon.",
        "Derek": "",
        "Nikki": "You comin' tonight?  You already skipped three meetings. Is it because of me? Everybody on the committee thinks it's because of me. Us. Look, Patrick. Regardless.  You're in charge of the music. I'm in charge of the prom. So show up. Don't make me fire your ass.  What is up with this place? Seems like they're lettin' anybody in.  I'm Nikki. Alyssa. Jasmin. Tiff'nee. You know Diggy, right, Marsha?  That don't mean you know me.  Quit what? I ain't walkin' on eggshells just 'cause you brought the Brady Bunch to the Negro Club.  I'm pretty sure you came with one.  Tell her to chill. She always got somethin' to say.  Let's dance.  Oh?   It's gonna be like that.  It ain't all that serious, Patrick.  It is if I want it to be. He is if I want him to be. That bitch ain't got shit on me.    I get into U.M.B.C., financial aid, everything...     Watch me squash their shit.    Hard.          Love shit. That bitch is tap- dancin' on my last nerve.  Stall what?   What you hear?  About me?  Fuck you, Malakai. Fuck her too.     (a hiss, under her  No. It's about you. White girls like you. Creepin' up, takin' our men. The whole world ain't enough. You gotta conquer ours too.  Diondre, what your butt doin' here?  Whatever it is, I don't wanna hear it.  You thought wrong.  You're the one tryin' to prove something. Stuck up in her shit like she's somethin' special.  That was different.  Because she's white and he ain't. And don't sit there like you don't know what I'm talkin' about, Patrick.  I don't?     Y'all black men, soon as you even    think about goin' someplace    good, first thing you do is find a    white girl to take with you.  Please. You're with her because she's white. That's what sets me off.  I don't think it, I know it. But you go ahead, deny it. That's what y'all always do.",
        "Malakai": "Medicine man...  Shut the fuck up and step your lame ass off, Snookie. You heard me. Space.  Business.  Not at this motherfucker. Out a week and where am I? Fucking home sweet high school. Jail away from jail. You can have it.  Judge says it's school or JuVee and I sure as hell ain't goin' back there. Shit. I never knew a year could be such a long time.  Up for it? Hell-the-fuck yeah, man. Let's do it.              They the ones tryin' shit. Comin' here. Squarin' off in my shit.  Let it slide tonight, they come back strong tomorrow. You know that.    We fucked those fools up for sure.  Medicine Man.     You know Tute.  You got a better one?  What other side?  I got sense enough to know who I am, what I can do and where I can do it. I ain't like you. People don't just up and hand me shit.    Plans? Yeah. I plan not to be poor. Next question...  You didn't see nothin', you don't say nothin'. Not unless you want a taste for yourself. And that can be arranged.  You ain't never gonna look as good as she does with him. That's oil. You're milk. Ain't no point in tryin' to mix.      You been scarce lately, man. Where you been?  (watching Patrick   We thinkin' about slidin' through that new rec center opened up on the Eastside. You ridin'?  I ain't pressed. I got my own shit.  What you think? I'ma keep walkin' around waitin' for some chump to cap me? I'ma protect myself.  Ain't nothin' unnecessary 'bout it. Shit. Mayhem and madness. That's a black man's life.  I think it's funny you think it ain't necessary. You act like you don't know where you are no more, Patrick, and whassup out there for anybody who ain't you. Maybe that's what happens when a white girl goes to your head.  The 'Love Boat.'  Looks like she's tap-dancing on your last boyfriend. She got it like that? Naw. Never mind. Stall it. I ain't heard shit.  Some trash she's talkin'.   About you.  Yeah. How you ain't all 'at since Patrick's takin' her to the prom. I am a little bit... chagrined though, Nikki. You lettin' some white ho' show you up like that.    Yo. Me and the boyz fixin' to shoot some hoops. Us against Druid Hill. If you interested.  Gotta skip last period.  So what you gonna do?  It's payback time. Either you down or you ain't. Either you m'boy or you not. Simple as that.  Eastside ain't got no firepower. I got some shit, man. AK-47. We go in, get out with one spray down.    I thought you liked it down there. That's your specialty, ain't it? Crawling?  No, he ain't ready. He's talkin'. To me. A-B conversation. Gotta go? C yourself the fuck home.  You take that bitch's back and won't even cover mine?  No! You wrong. You BEEN wrong. You ain't worth shit no more. Get out my face, and take that ho with you.  Why his mom's cryin' like that? Arvel's gonna make it, right? That what's his nurse said. She told me herself, 'Your friend's gonna make it.' Did that bitch lie to me! Talk to me, Patrick! Is he gone?  I got a good reason now, man?      Shut the fuck up."
    },
    "imdb_rating": "6.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNmM5MWJmOWQtMTBkZi00NDY5LTk3MjMtNjVhN2MzOWJkM2I5XkEyXkFqcGdeQXVyNDQ0MTYzMDA@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "Sara wants to be a dancer, but her dreams are cut short by the sudden death of her mother. She moves in with her father, who she has not seen for a long time. He lives on the other side of town, in a predominantly Black neighborhood. She gets transferred to a new school where she is one of the few White students there. She becomes friends with Chenille, and later, falls in love with Chenille's brother, Derek.—Kara",
    "name": "Save the Last Dance",
    "genres": [
        "Drama",
        "Music",
        "Romance"
    ]
}