{
    "filename": "Saving-Private-Ryan_script.txt",
    "imdb_id": "tt0120815",
    "imdb_url": "https://www.imdb.com/title/tt0120815",
    "characters": [
        "Corporal Upham",
        "Sergeant Hill",
        "Private Reiben",
        "Steamboat Willie",
        "T-4 Medic Wade",
        "Corporal Henderson (as Maximilian Martini)",
        "Private Caparzo",
        "Private Ryan",
        "Private Jackson",
        "Captain Miller",
        "Sergeant Horvath",
        "Private Mellish",
        "Toynbe",
        "Lieutenant Colonel Anderson",
        "Captain Hamill"
    ],
    "dialogues": {
        "Corporal": "",
        "Upham": "That's bracketing, right?  I know about bracketing.  I read about it.  The next one is going to land right on us.     Captain, I...  You can tell all that, just by the sound, sire?  So, where are you from?  So, where are you from?  As a matter of fact, I am.  Demolition, right?  In West Fork?  No kidding.  So they travel around from place to place and preach?  What about the Captain?  Where's he from?  But everybody's heard of him, he won the Congressional Medal of Honor, he saved a dozen men.  Somebody must know where he's from, what he did for a living.  Why don't you just ask him?  How do you do it?  You think he really believed it?  Well, as a matter of fact, I was just thinking...    On the other side of the street, crouches in a doorway with Jackson. Upham is a bit in shock, less from the nearness of the bullets than from what Miller just did for him.  Captain, I...  What is that?  The Army gave you that?  You must be a hell a shot.  That must be four thousand yards.  You take account of the wind?  Sir, I'm sorry about what happened,  But you could have gotten killed and  Did you see what he did, back there? He stepped right into the open, so I could get across.  Pass.  I wasn't made for this.  Yes.  Do you know Sibelius' Fourth Symphony, The Normandy?  I heard.  You know classical music?  Where are you from, Captain?  Over three-hundred.  If that's the way you feel, why don't we wait until it's up to a thousand.  Five hundred, then.  Five nights ago, he found this paratrooper caught in a tree with a broken leg.  The leg got infected. Last night he went to Ville Cholet to get a doctor.  The doctor refused to come and when he got back, this is what he found.  The Krauts must have shown up while he was gone.  No, but he heard firing, just east, less that a kilometer.  What is it?  Sir, I ran the 220 in high school.  Twenty-four-five.  Twenty-two flat?  Good luck, Captain.  The men said, nine.  That only leaves three.       Stop instantly.  Turn toward the perimeter of the field.  Freaked out.  Trying to keep his eyes on the perimeter.  Can't.  That was no twenty-two flat.  I wonder where they're going.  I sure hope so.    I'd like to stay, too, Captain.  Sits beside Jackson with a pair of binoculars, searching for another target.  The German sniper fire has subsided for now.  Ext. bridge - day Miller watches as Ryan and several other paratroopers dig a series of trenches across the street, leading to the bridge.  Eighty-eights, right?  I can tell what the gunners had for dinner.  What about our grenades?  Would they notice and eighty-eight?  The Germans do.  But, sir...  Goddamn it, sir...  Manning the forward machine gun nest.  Running out of ammo.  See that there's nothing else they can do.     I got him.  What'd you say, Captain?  Captain, what about our deal?  Forget it.  I don't know, I kind of like Wade's idea about the cruise ship.  I've never been to Tahiti.  Hears that.  Doesn't hesitate.  He grabs a pair of ammo boxes.  RUNS toward Reiben and Ryan.      TAKES HALF-A-DOZEN SLUGS.  Torn apart. Stumbles the final few steps to the machine gun nest.  Falls on the sandbags, giving Reiben and Ryan the ammo.  UPHAM'S DEAD.",
        "Sergeant": "Sorry, sir, fresh out of trucks, how 'bout a '38 Ford Roadster, hard-top, red with black interior.  No white-walls, sir, there's a war on.  Sorry, sir.  Division is using everything on wheels to get up to Caen. How come you guys aren't going?  That's General Gavin's.  His lap dog told me if anyone breathes on it, I'll get busted and if anyone so much as touches it with their little finger, I'll get court marshaled. If you were to take it, they'd shoot me.  What's at Ramelle beside a lot of Germans.  Senator's son?  Damn...I got a couple brothers...   Sees his Flank Squad lagging behind and CALLS to them.  Ryan?",
        "Hill": "",
        "Private": "Obey.  Hurry after the rest of the convoy.  Dashing from cover to cover, making his way toward them.  Ryan is an American classic, nineteen years old, earthy, handsome, sharp, cocky. Though he's exhausted, unshaven, and smeared with dirt and blood, he's very alive.  His eyes shine, his face has a spark.  You can't help but love this kid.",
        "Reiben": "I'll be Goddamned!  I'm not dead!  Shit, sir.  Out of the frying pan, into the fucking latrine.  Sir, what if they send some other company into Caen ahead of us while we're pinned down here?  I care.  Don't you know what Caen's famous for, Sarge?  Lingerie.  So, you ever heard of employee discounts?  My uncle sells shoes, gets twenty-five percent off everything in the line, got a closet filled with the best looking shoes you ever seen.  Just picture some French number been spending all day, every day, making cream-colored, shear-body negligees with gentle-lift silk cups and gathered empire waists, what the hell you think she wears at night?  Lingerie is my life, sir.  My mother's got a shop in Brooklyn, I grew up in it, from the time I could crawl, we carry Caen lingerie, it's the best there is, it's all I been thinking about since the invasion.  Oh, Captain, they'll always make lingerie, it's one of the three basic needs of man -- food, shelter, silk teddies.  Miller Dream on, private.  Happy to, sir.  I don't think so, Captain.  Please, sir, you can't take me to Ramelle, I gotta go to Caen, sir, please, I told you, they make Caen lingerie there, it's beautiful, it's the best there is, it's...oh, please, sir...      Captain, can I ask you a question?  Where are you planning on putting Private Ryan, sir?    I usually like surprises.      Captain, I gotta tell you, the irony of this mission is fucking killing me.  I should be on my way to Caen, sir. It's like Beethoven, the guy's one of the greatest composers ever lived and he goes deaf.  Go figure, I mean, who'd he piss off?  And here I am, the Beethoven of ladies foundation garments, one step away from Caen, the center of the known lingerie universe and instead, I'm going to Ramelle to save some fucking private who's probably already dead.  Sir, you know what Ramelle is famous for?  Cheese.  The rest of the company is going to Caen and we're going to the goddamned cheese capital of France.  There is no bright side.  I'm listening, sir.  Well, you're a happy idiot.  Hell, this is better than Coney Island!     General Gavin is going to be very irritated at you, Captain.  Get lost.  We know.  No one's gonna win the money for the simple reason that the Captain never was a civilian.  They assembled him at O.C.S. out of spare body parts from dead G.I.'s.  I know this for a fact.  Hell, no.  I think he's the best officer in the whole goddamned army, bar none.  If we find Ryan and he's still alive, that son-of-a-bitch is gonna carry this goddamned B.A.R. back to the beach for me.  You know what a B.A.R. weighs? Nineteen and a half pounds, not counting ammo. And you think these things are comfortable?  They may look good but they weigh twelve pounds each, that's thirty-six pounds, right there.  That's because, as I have pointed out on numerous occasions, you are a happy idiot.  Oh, Christ, now we gotta listen to that grandfather thing again.  Fine, you convince yourself you got a pack full of feathers and goddamned Private James Ryan can carry my fucking gear.  You want unpleasant?  Just wait, I can do much better than this.  Jesus Christ, he's a natural!  Hey, that guy can move.  Captain, he's fast!    They got squirrels there, too, right?  Wade's right, it's some kind of scientific, magnetic thing, I can't explain it, but I've seen it.  Captain, could you please explain the math of this mission to me?  Well, sir, in purely arithmetic terms, since when does six equal one?  What's the sense in risking six guys to save one?  Huh?  I'd much rather die in Caen than Ramelle, sir.  It's a personal thing.  Easy for you to say, sir. Fucking James Ryan, I'd like to wring his fucking neck.  Hey, I got a mother.  Jackson, you got a mother?  Wade, Sarge, Corporal Insect, all of us, hell, I'll bet even the Captain has a mother.  Well, maybe not the Captain, but the rest of us have mothers.  (finishing Wade's sentence  And what about you, Captain?  I'm sorry, sir, I apologize. But if you weren't a captain, or if I were a major, what would you say?  Sir, if you were not a captain, I would compliment you, now, for being an excellent liar.  Yes, sir, as a final note, I'd like to say, fuck our orders, fuck Ramelle, fuck the cheese capital of France and while we're at it, fuck Private James Ryan.    Sir, I've got an idea, let's go around.  He's fast, Captain, I saw him.       Stop instantly.  Turn toward the perimeter of the field.  On guard, glancing back.  Pissed off.  Goddamn it...Goddamn it...Goddamn it...    Goddamn it...Goddamn it...Goddamn it...  Fuck Private James Ryan, fuck him, just fuck the goddamned son-of-a- bitch.  You shut up, this is the most fucked up mission I ever heard of.  Goddamned Ryan, fuck the little bastard.  The hell he didn't.  I thought you said we had an hour, sir?  You know what the best possible thing that could happen is?  I've given this a lot of thought, sir.  The best thing that could happen is, we find Ryan and he's dead.  Well, sir, consider the possibilities. A:  Ryan is alive.  We have to take him back to the beach.  Knowing you, you don't let him carry my gear, even though he really should, and we all get killed, trying to keep him alive.  B:  Ryan is dead.  He's been blown up by the German equivalent of Wade, whose name I know you don't want me to mention.  There's nothing to find. The biggest piece is the size of a pea.  We wander around, looking for him until the Germans pick us off, one after another.  Neither do I, sir.  C:  And this is the worst one, we find Ryan and he's wounded.  Not only does he not carry my gear, we have to carry his gear. And him.  Maybe.  But what if he dies on the way back?  you see what I'm saying, sir?  The best possible situation is, he's dead, we find his body, more or less intact, we grab one of his dog-tags and high-tail it back to the beach, or better yet, we head over to Caen and catch up with division.  No, sir.  Looks like tea time, maybe they're Brits.  Looks like they've been having a hell of a party, here, Captain.  What if our guys open up, sir?  Have it your way, Captain.  Looks like a flaming asshole to me.  I'm Ryan, sir.  You wanted to see me?        See, Captain?  The vote's unanimous.  Yes, sir, of course, sir, I was merely speaking hypothetically.  IF this was a voting situation, then the vote would have been unanimous.  But of course, it's not a voting situation, you're the captain, and you give the orders, sir.  Of course, sir.  Sir, can I change my vote?  Maybe Caen.  Leave him to me, Captain, I'll have him pissing and moaning with the best of us.  Aren't they the same thing, sir?      Like hell, I did.  What do you think?  I mean, Ryan, what do you think of him?  I guess.  Nope, he ain't Wade.  Yes, sir.  Manning the forward machine gun nest.  OPENS UP with the MACHINE GUN.    Running out of ammo.  See that there's nothing else they can do.  Time to go.     Like hell you did, I got him.  Goddamn it...Goddamn it...Goddamn it...  Well, I'll be goddamned, I knew it.  What deal?  What deal?  That's not where I am.  Miller No? Where are you?  I'm in a dressing room with Mrs. Rachel Troubowitz, our super's wife. She's an easy forty-four, double E, but I've convinced her she's a thirty- eight D and I'm watching her try and squeeze herself into a side-stay, silk-ribboned, three-panel girdle with s Helf-lift brassiere. She's having a devil of a time, getting into that thing.  Jackson, how many times I got to tell you, you're from Tennessee.  What about you, Captain?  FIRES a burst.  Germans drops.  Sees Ryan.  Races over.  SHOOTS one German.  STABS the other.  Forward.  Reiben FIRING.  Ryan feeding the ammo belt.   Continues FIRING.  CUTTING DOWN the advancing Germans.  Immediately grab the machine gun and ammo and race back to the rear nest.  With the machine gun.  Covers Miller. Keeping most of the German infantry down.  More tanks...  Ryan Lot's of them The fear on their faces turns to resignation.  They know that they are dead men.  They settle into their positions, and prepare to fire and die.          Yeah, and he was fast, too, ran the 220 in twenty-four-five.",
        "Steamboat": "",
        "Willie": "",
        "Caparzo": "",
        "Ryan": "Steps out.  Around sixty.  Her face shows the lines of a life of hard work and mother hood.  A good woman.  Dashing from cover to cover, making his way toward them.  Ryan is an American classic, nineteen years old, earthy, handsome, sharp, cocky. Though he's exhausted, unshaven, and smeared with dirt and blood, he's very alive.  His eyes shine, his face has a spark.  You can't help but love this kid.  No, sir.  No, sir.  Sir, if the Krauts are holding this bridge when division shows up, our guys are going to be sitting ducks.  I'm not leaving, sir.  I hear you sir, but I'm not leaving.  What are you going to do, sir, shoot me?  Thank you, sir.  Yes, sir.  I'd like to go, sir.  Wade.  Huh, he died coming up here to keep me alive...I never met him...he didn't know me from Adam, strange.  What was he like?  My brothers would be mighty pissed off at me, if they knew I let some guy get killed trying to keep me alive.  Sure, I know, but... Goddamn it all...     Sorry, sir.  I won't need to sir, it's already here, behind the barricade so...  Yes, sir.  Yes, sir.  Manning rear machine gun.  With the rear MACHINE GUN.  Drops several Germans.     Is jumped on by one.  Upham FIRES. KILLS the German.  Leaps onto the final German attacking Miller.  That German raises his rifle on Ryan.  Looks at Miller, sees him growing weak, starting to sway.  He gently tries to move Miller aside.  I'll take care of Sarge...  I'm home, playing basketball with my brothers, it's evenin' time, we're trying' to get in a few more points before it's too dark to see the ball. That's where I am.  Forward.  Reiben FIRING.  Ryan feeding the ammo belt.     Immediately grab the machine gun and ammo and race back to the rear nest.  SEE JACKSON DIE.  A bare moment to react.  Then, they turn their attention back to the eighty-eight. Frantically turning the aiming cranks. Lowering the barrel to point blank.  Win the race.  Quickly reload the eighty-eight.           Captain?  Upham and Jackson, what were they like?  Yeah?  No kidding.  And Sarge?",
        "Jackson": "Cap'n, does that mean we got to walk all the way up to Ramelle?  Hell, no, last time I shot a corporal, Cap'n Miller near bit my head off.     Corporal, you have just seen one of Captain Miller's many God-given talents.  If, by some miracle, you survive, you will witness many more of them.  You writin' a book or somethin'?  Figured.  I'm Jackson.  I'm from West Fork, Tennessee.  My pappy's a preacher. Him and his two brothers got a ministry, The Blessed Church of the Wandering Gospel.  In the back of a nineteen and thirty- one stretch Hudson with a big ole' trailer.  I don't make jokes about things of, or related to, the preaching of the Holy Gospel, including the ministerial calling of my family.  We got us a tent, forty-two feet across, eighteen feet at center, hundred-and-ten foldin' chairs. Circuit's eleven towns, covers all 'a Hasset County and most 'a Weller County.  I expect that upon completion of my military service I will be joinin' said ministry.  You figure that out, you got yourself one nice prize.  The whole kit and caboodle.  The Captain prefers not to discuss certain aspects of his life, in particular, everything up to and including his enlistment in the United States Army.    You got that right.  Captain, my feet are most uncomfortable.  If I'd 'a known we was gonna have to walk all the way to Ramelle, I never would 'a volunteered for this here mission.  I most likely would have, sir, had I been given the opportunity.  Army life is too dang easy, my feet have gone soft.  Back home, we go out squirrel huntin', I walk forever and a day and then some, don't even raise a blister.  Cap'n, my feet are most uncomfortable.  Dang!  That was close!  Thirty-ought-six, Norton long-barrel with dual-groove, parallel rifling, elevated three-glass scope and a single-throw hammer.  Yep.  Not where I come from.  (without taking his eye from the scope  Reiben, how many time I got to tell you, I'm from Tennessee.  Shit, that was no big deal.  Last I knew.  Sir, I have an opinion on this matter.  Seems to me, Cap'n, this mission is a serious misallocation of valuable military resources.  Miller Go on.  Well, sir, by my way a thinkin' I am a finely made instrument of warfare. What I mean by that is, if you was to put me with this here sniper rifle anywhere up to and includin' one mile from Adolf Hitler, with a clear line of sight, war's over.  Yes, sir.  It seems to me, sir, that the entire resources of the United States Army oughta be dedicated to one thing and one thing only, and that is to put me and this here weapon on a rooftop, smack-dab in the middle of Berlin, Germany.  Now I ain't one to question decisions made up on high, sir, but it seems to me that saving one private, no matter how grievous the losses of his family, is a waste of my God-given talent.     In the shadow by those two trees.  We left them eighty-eights.     Watching.  Shut up, will you?  Just shut up, Ryan didn't kill Wade.  Sir, I ain't feeling so chipper on account of Wade.  Sir, I understand what you're doin', but I respectfully request permission to grieve in my own manner.  Sir, I understand.  I don't like it, but I understand.  Yep, you step on a rusty nail, get lockjaw, never say another word as long as you live.  Not yet.  So, that's Ryan.    Cap'n...?    Yes, sir.  You betcha, sir.  Reiben, are you makin' fun 'a the way I talk?  Join Forrest at the eighty-eight.  Covering them, OPENS UP.  Kills the advancing Germans.          I think I'm we got that eighty-eight.  He ain't half-bad, I guess.  He ain't Wade.  Behind the sandbags, on top of the bridgekeeper's hut.  Calmly picking off the attacking Germans.  FIRES.  Drops one of the Germans on Miller with a head shot.  Cuts open Miller's face with bits of skull.     He got him.  Like hell, you did.  No kiddin'?  Me?  I'm walking with my hound, Lucy, it's about an hour 'fore sunrise and we're out huntin' coon.  I got me a flask of pure Kentucky mash whiskey...  I am, but I like imported whiskey. So there I am and I hear the biggest ole' coon you ever did hear, 'a rustlin' right there in front of me. That ole' boy comes right out of the brush, I got a clear shot and he knows he's 'bout to meet his maker. I aim, I got my finger tight on the trigger and then I just smile and say to that ole' coon, go on, now, you get out 'a here.  Then I sit down on a hollow log and take me a right long pull a' that mash whiskey.  Say what, Cap'n?  Don't that get kind of expensive, Cap'n?  To each, his own.  On the bridgekeeper's hut.  Picking off German soldiers who follow the tank.    Knows what's coming but he holds his position, continuing to pick off German soldiers.",
        "Captain": "",
        "Miller": "Looks over the gunwale at THE HELL     Somehow survives.  Jumps into the breakers.   Ignores the EXPLOSIONS and BULLETS. Uses hand signals and curt orders.   Back-straps his Thompson sub-machine gun.  Starts climbing with the first group.     Joins half-a-dozen pinned down men. Others bottleneck behind them.  Miller scans the route and the defenders.  That's the route.  Go!     It's the only way.  Turns to the next half-dozen men.        Turns, looking for the next six. His eyes fall on Sarge and REIBEN who is a cynical, sharp, New Yorker. Reiben smiles.  Sure, meet me at the top, we'll start the paperwork.        Crosses the gap.  His men follow.  Okay, Wade, your turn.  Survey the field.  Worked, didn't it?  Don't need to, the Krauts go that covered.  Trailed by a RADIOMAN, dashes through the fire and dives into a sludge- filled crater.  He surfaces, sees Sarge and Reiben, and reels from a horrific smell.  Their conversation is repeatedly broken by FIRING And  Jesus Christ!  What the hell are we swimming in?  Look at the bright side, the Krauts sure as hell don't want to advance and hold this cesspool.  Get Fire Control, we need some artillery...  Don't worry, we're the only Rangers this side of the continent, we've got to be first into Caen.  Reiben, how the hell do you know so much about lingerie?  There's a war on, good chance they're not still making lingerie in Caen.  Maybe the war's over.     Runs over the broken ground and makes it to the sandbagged H.Q.  He stumbles down the make-shift stairs.  Miller, Company B, Second Rangers.  My what?  Find a chaplain.  Sector four is secured, we put out the last three German one-fifty-fives, found them about two miles in from Ponte du Hoc.  A company, Wehrmacht, no artillery, we took twenty-three prisoners, turned them over to intelligence.  Fourty-four, twenty one dead.  They didn't want to give up those one-fifty-fives, sir.  Yes, sir.  Pinned down, a mile east of here, waiting for some help from the navy guns.  Sir?  A private, sir?  But, sir...I...I...    Respectfully, sir, sending men all the way up to Ramelle to save one private doesn't make a fucking, goddamned bit of sense. Sir.  Yes, sir, more or less.  The numbers don't make sense, sir. His brothers are dead, that's too bad, but they're out of the equation. Sending men up there is bleeding heart crapola from three thousand miles away.  One private is simply not worth a squad.  Colonel anderson This one is.  He's worth a lot more than that.  Which is why I'm sending you, you're the best field officer there is.  Yes and no, sir, what about Morgan? Fine officer, regular church goer, writes poetry, he might like a mission like this. And he's taller than me.  Yes, sir.  Thank you, sir.  Crouch-runs and dives into a crater with Sarge.  Put on your traveling shoes, Sarge, we're heading out.  I wish.  You and I are taking a squad up to Ramelle on a public relations mission.  Some private up there lost three brothers, got a ticket home.  Simpson.  I want Reiben on B.A.R; Jackson with his sniper rifle; Beasley, demolition.  Okay, Wade.  Translators?  What about Talbot?  Strides through the chaos, avoiding the passing vehicles.  He sees his men and walks toward them.  Reiben hurries up to Miller, pleading.  Sorry, I need a B.A.R. man, you're the best.  Trust me, you're the best.  I've got a line on one.  Sergeant, I need a truck.  White-walls?  A half-track, anything.  How about that jeep?  A paratrooper named Ryan.  He's going home, if he's alive.  No, three brothers of his were killed in action.  Command wants him out of there.  We've got to make one stop.  Wait here.  I understand you speak French and German.  Do you have an accent?  Good, you've been re-assigned to me, we're going to Ramelle.  That's my understanding.  Do you have a problem with that, Corporal?  I need a translator, all mine have been killed.  It'll come back to you.  Get your gear.  A small one.  Go, go...  Sure, Reiben.  Left.  Now we've got a straight shot, due north, to Ramelle, twenty-six miles, two villages between here and there, St. Mere, then Bernay.  We'll take the jeep as far as we can, then go on on foot.  Somebody put the wrong crystals in every one of the Hundred-and-First's radios the night before the drop, not one of them works.  We're going in blind.  A fucking mess, two maybe three Kraut divisions, no fronts, no lines, the drops were completely fouled up, we've got little pockets of paratroopers all over the place, trying to hang on.  Command says we hold St. Mere, but north of that, it's all Krauts.  Even if Ryan's where he's supposed to be, he's more than likely dead.  Yep, hell of a mission.  I don't want anybody to shoot him, that's an order.  He speaks French and his German has a touch of the Bavarian.  Yeah, how so?  There's to be a bright side, look for it.  There's always a bright side.  Well, I, for one, like cheese.  How's the road up to St. Mere?  Anybody getting through?  Just trying to make room for Ryan.    Directs Sarge off the road.  They've got the road zeroed.     They've got a hell of a spotter somewhere.  S-curves, Sarge.  Hang on.  Stay in the jeep but are battered.  All stunned.  MILLER Is first to regain his bearings.  Jumps up.  Checks out the jeep.  Undamaged. Deep in the soft dirt.  Sarge!  Reverse!   He's the only one who does.        Is first up.  Sarge and the men struggle to their feet.  Hear MORE INCOMING.  Miller grabs Upham by the collar and pulls him up.   Stands on the edge of the woods, almost in a trance.  Sarge, maps.  Two eighty-eights, just under two- and-a-half miles, that way, vector from the jeep, through those two trees at the base of the hill.  The mortars came from behind that rise, there, four of them.  Wade, the radio.  That's not all.  There were nine gunners on the eighty-eights, one had a broken heel on his boot, two had bratwurst for supper last night, one of them is named Fritz, the other, Hans, maybe, I don't know, it's hard to tell.  That's not what we're here for.    Tell that to Private James Ryan. We've got our orders.  Let's go.  You didn't volunteer, Jackson.  Upham, are you sure you've never been in combat?  He's good.  Stay low.  Your turn.  Zig-zag, change your pace a couple times, you'll be alright.  Okay, I'm going to draw fire for you. But if I do, you goddamned well better go.  Looks to Upham  Ready?     Go.       (glances at Sarge, speaks to Reiben  DASHES across the street.  Bring 'em over.  One at a time.  Ducks out of the doorway and crouch- runs down the block.  He passes a:  Sees the dead and wounded, shows no reaction.  Runs to:  We had a jeep until a few hours ago, a nice one, it had a cute little flag with a couple of stars on it.  We called in a strike on the eighty- eights that took it out, but it's the Kraut spotter that counts, wherever the hell that bastard is.  Jackson.  Very far, they're not coming this way, they're going to take Caen first.  Five, but we not staying, we're on our way to Ramelle.  Yeah, you know about that?  Wonderful.  How do we get out of here?  Yeah?  Thanks.  Let's find someplace to hole up.       Sure, what do you want to know?  Ours is not to reason why.  Never mind, don't worry, we'll pick up this kid, high-tail it back to division, everything'll work out fine.  Reiben, there's a fairly good chance you're not going to die at all.  You have orders, too.  I'd love to hear it.  Reiben, I want you to listen closely to Jackson.  This is the way to gripe. Jackson, continue.  Wade?  Upham?  Sarge?  Reiben, what's the matter with you? I don't gripe to you.  I'm a captain. There's a chain of command.  Griping goes one way, up, only up, never down.  You gripe to me, I gripe to my superior officers.  Up, get it? I don't gripe to you, I don't gripe in front of you.  How long you been in the army?  In that case, I would say this is an excellent mission, with an extremely valuable objective, worthy of my best efforts.    But I am a captain.  If I were not a captain, I would thank you for the compliment and tell you that the ability to lie comes from being a top-notch poker player, which I am, having learned at the side of my mother who is, by popular acclaim, the best poker player in...    Any further thoughts on the subject?  I'll make a note of your suggestions but I'll leave that last one to you, especially if he's already dead.  We move out in two hours, try and get some sleep.  Maybe.  Since when have things been normal?  Nope.  They're fine.  As long as they can gripe, they'll be alright.  They guys here aren't going to be able to hold out until battalion shows up.  Command isn't going to let them withdraw and the Germans sure as hell aren't going to let them surrender.  If we stayed, we could make a difference.  You never know.  Now you're the one kidding yourself. Hell of  a mission.  Rise and shine, boys.  Let's go.  It doesn't take this.    Don't worry, Upham, God'll protect you, this shit's gonna keep him up all night, anyway.  Let's go, this ain't what they pay us for.  Thanks, but you may need these more than us, or Ryan.  Let's move out.  A couple of weeks.  It started in Portsmouth when they brought us down for loading.  No.  It comes and goes.  It stops when I look at it.  I'll be alright.  It'll be light, soon.  Let's pick it up.  It looks like a Renoir.  I've been humming it.  It seemed appropriate.  Some.  What's the pool up to?  I'll tell you what, if I'm still alive when it hits five-hundred, I'll let you know and we'll split the money.  I don't expect to live that long.  Let's go, private.  Did he see any sign of them?  Thank him and tell him we're sorry about his loss.     Where?  My guess, too.  A machine gun.  We can't leave it here.  They don't send planes to put out machine guns. Two flank runners with surpressing fire.  I'm going right, whoever goes left has to be fast.  Wade goes left.  Sarge, Upham, here.  Jackson, Reiben, ten yards, either side.  Yeah?  What rule of thumb is that?  How about you take your position?    Don't need it, I'm a cat, I've got five lives.  What do they know? I had nine, but I feel through the ice when I was seven, my brother pulled me out.  Then I used one when a grenade landed in my foxhole in Sicily, it was a dud.  I figure one on the beaches, one on the cliffs and two getting here.  Plenty.  Ready?     Takes the FIRST FIRE.  He HITS THE DIRT.  The BULLETS SCREAM just over him.          Makes it to the far side.  Scrambles up the roots.  Dives through the brush.  STRUGGLES through the hedgerow. Stumbles onto the path.  Rolls to his feet, running.  Swings his Thompson into firing position.  Racing toward the nest.  Tearing along the path.  Sees a German rifleman.  FIRES A BURST.  CUTS HIM DOWN.  Runs over the body without breaking stride.  TEARS THROUGH THE TREES.  BLASTS his Thompson.  CUTS DOWN two more German riflemen.  Grabs a grenade.  Pulls the pin.  THROWS the grenade, VEERS and DIVES.  Rolls to his feet.  FIRE another BURST.  KILLS the last of the German riflemen.  Doesn't pause.  RUNS onto the field.       About to pour his sulfa.  Sees the wound.  Stops.  Knows it's fatal.  Damn it!  SHOVES THE NEEDLE into Wade's neck. Thick vein.  Pumps the morphine straight to Wade's brain.  Motions impatiently to Sarge.  More morphine, hurry up, come on, come on...  Snatches the morphine from Sarge. Quickly and efficiently prepares a second shot.  He's done this before.  Gives Wade the second shot.  Is silent.  Motionless.  He gently closes Wade's eyes.  His hand quivers slightly as he unclips one of Wades dogtags.  He fumbles and drops it. Sarge notices.  He lied.  Let's move out.  Keep it down.  We've got to find someplace to hole up for a bit.  Let's just find someplace.  Rest.  One hour.  Jackson, Reiben, perimeter.  Keep your eyes open. I'm going to re-con.  What was the name of that kid at Anzio, the one who got his face burned off?  Yeah, Vecchio, I couldn't remember his name, he was a good kid, remember how he used to walk on his hands and sing that song about the man on flying trapeze?  You know why I'm such a good officer? Because of my mother.  Have I ever told you about her?  She's the best poker player you ever saw.  My father used to go to these Saturday night games and lose his shirt.  Finally, my mother gave him an ultimatum, either she gets a regular seat at the table or she locks him in every Saturday night. He squawked and so did his buddies but after a while they gave in and from the first night she sat down, she never lost.  She could read those cocky bastards like they were playing open hands.  And he bluffs?  He had sixteen levels of bullshit.  Her eyes, the tone of her voice, her bets, her jokes, the way she sipped her coffee, she was a master.  She won more money on shit hands than anyone in the history of the game. Every Saturday night, my father would lose two, three hundred bucks and she'd win it all back and then some. And I'd stand there, glued to her shoulder, from the time I was five years old, watching every hand, every move, studying how she did it. That's why I'm such a good officer, I can look at a man's face and tell you exactly what he's holding, and if it's a shit hand, I know just what cards to deal him.  No problem.  A pair of deuces?  Less? So what?  I bluff.  It used to tear me apart when I'd get one of my men killed, but what was I supposed to do?  Break down in front of the ones who were standing there waiting for me to tell them what to do?  Of course not, so I bluffed, and after a while, I started to fall for my own bluff. It was great, it made everything so much easier.  Sarge Is that why your hand's been shaking?  It could be worse.  You know the first thing they teach you at O.C.S.? Lie to your men.  Not in so many words, but they tell you you can have all the firepower in the world and if your men don't have good morale, it's not worth a damn.  So if you're scared or empty or half-a-step from a Section Eight, do you tell your men?  Of course not.  You bluff, you lie.  Simple, numbers.  Every time you kill one of your men, you tell yourself you just saved the lives of two, three, ten, a hundred others. We lost, what, thirty-one on the cliffs?  I'll bet we saved ten times that number by putting out those guns.  That's over three hundred men.  Maybe five hundred.  A thousand. Then thousand.  Any number you want. See?  It's simple.  It lets you always choose mission over men.  That's the rub.  I liked Wade.  Who's Ryan?  If they're both standing in front of me and I have to shoot one or the other, how do I choose?  Look at my hand, there it goes again.  I think you're right, Keith.  No, but if I get any worse, you'll have to relieve me.  You know Wade was the eleventh of the twelve, you're the last one still alive.  Don't let yourself get killed, if you do, they might make me give back the medal and then I won't be able to lip off to colonels anymore.  Thanks for drawing that machine gun off me.  But, that's my personal brand of stupidity, I feel kind of proprietary about it, if you do it again, you're busted.  Up.  We're moving out.  Well now I'm saying we're moving out.  Get off your ass.  What the hell's the matter with you, Jackson?  Who's Wade?  I said, who the hell is Wade?  You'll grieve the way I tell you to goddamned grieve.  There is no Wade, there was one, but he died a long time ago, he's been dead for so long you can hardly remember his name, you understand?  Good, now get your goddamned gear.  Why's that?  Except for the last part, that one's not bad.  I don't like that one.  But we accomplish the mission.  Has anyone ever told you, you're officer material?  That's a mystery to me.  I don't think so.  Is just about to open up on them.  Same place we are.  Scans the Germans with his binoculars.  Puts away the binoculars and jerks his head for his men to follow, low, along the wall.  The men are happy to do so, looking back nervously at the German tanks.        You're only allowed to shoot at Germans, that's one of the rules.  POUR FIRE at the German positions,  I'll keep it in mind.  Things are tough all over.  We're looking for a Private James Ryan.  Is he here? What do you want him for, sir?  Jackson, get a hold of command.  How many men do you have?  Keep trying.  All watch Ryan run toward them.  Yes.  Also look at Ryan, but then, one after another, they turn away, adverting their eyes, looking a their own boots, the debris on the bridge, the sky, anything other than Ryan.  We've been sent to get you out of here.  You're going home.  Sergeant, we're moving out and I'm taking you and your men with me.  I'm giving you new orders, Sergeant.  I'm not going to leave you and your men here to get killed.  Get them together, we're moving out.  Come on, Private, you're going home.  Private.  I'm sorry about your brothers but staying here and getting yourself killed isn't going to help.  This bridge cannot be held.  The Germans have two companies less than three miles from here.  They have tanks.  Private, if you want to commit suicide, that's your choice, but you're going to have to wait until after I get you back to the beach. And you're not going to take these men with you.  The hell you aren't, you're comin' with me if I have to drag you every inch of the way.  You hear me, Private?  Listen you little son-of-a-bitch you're coming with me or I'll...I'll...  You don't count.  You're goddamned right, I give the order.  Vote!  Jesus Christ!  Listen to me, you little pissant pieces of shit, I am the ranking officer here and what I say goes, is that clear?  In that case... I vote we stay.  Reiben, the B.A.R., there.  Jackson, get up on the bridgekeepers hut with your sniper rifle.  Sarge, you and Upham move that machine gun so it can cover the left flank, it's worthless where it is.  Forrest, I want a full inventory of all your weapons, ammo and ordnance.  Go.    Alright, come with me.  That's it?  Sarge, see what you can do to make those buildings inhospitable.  Those guns are close.  Let's hope they don't change their mind.  Well, if we had ten times the men and a lot more ammo, we might stand a chance, but not against those tanks.  We're going to hope like hell the tanks were on their way somewhere else.  Let's hope, because we're sure as hell not going to do any damage to them with what we have here.  Those are Tigers, they have six-inch armor, they don't even notice grenades.  Sure, you got one?  Upham, go find Jackson, he and I are going hunting.  Out of the mouth of babes.  Upham, you've got to learn the difference between whining and griping.  You can't just rely on natural ability, you've got to study and practice.  There you go again, that's whining, that's not okay.  That's better, but you've still got a long way to go.  Talk to Reiben, he's a natural and works at it, he'll give you some pointers.  See to it.  No, private, I want you to stay here, keep your head down, don't do anything brave or stupid.  Reiben, I don't know what I'd do without you.  Sarge, keep Ryan close to you and alive.  You ready?  Eyes the emplacement.  Looks for a weakness.  There is none.  He motions to Forrest and Jackson to wait.  The three of them settle into the darkness.  Join Forrest at the eighty-eight.        Don't do that again.  Crouch-runs through the shadows and stops at the bridgekeepers hut.  Reiben...  You set?  Sarge nods.  At the bridgehead, waiting.  Cocks his Thompson.  Settles down behind some sandbags.   Sees Reiben and Upham being cut off. Grabs the B.A.R., stands and fires.  FIRES A BURST into a German's belly. HITS another with the stock of his Thompson.  Struggling with a pair of Germans.   continue to fire, horrified.  Grabs Sarge and pulls him over the barricade.  Sees that he's dead.  Stunned, lays Sarge down, kneeling next to him.  Get back to your positions!  Go!  Doesn't move.  He just stares at Sarge's body.  Sarge?  Who's Sarge?  English teacher, Addley, Pennsylvania.  I teach English at Addley High School in Addley, Pennsylvania.  I changed my mind.  I coach the baseball team, too.  You know that cruise ship Wade's grandfather was on?    I'm in my backyard, lying in my hammock, with my arm around my wife, listening for the sound of breaking glass.  You see, I've got the best house in all of Addley.  It's not the biggest house, but it's got the best location, right next to the junior high baseball field.  The garage windows face left field.  The guy who owned the house before me had these heavy screen S put over them.  The first thing I did when I bought the place was take off those screens.  Two-hundred-twenty- two yards from home plate to my garage windows.  It takes a hell of a junior high kid to hit a ball that far.  I look at my garage windows as a Motivator and a way to scout the kids coming up, the ones who are going to give us a shot at the state championship.  I lay there in my hammock and every time I hear the sound of breaking glass, I know we're one step closer to winning it all.  It's worth it.  How about you, James?  Hears the FAINT DISTANT RUMBLE OF THE TANK.  Barely has time to react. Sees:  Here they come.  FIRES a burst.  More Germans drop.  Manning the forward machine gun. Way out front.  Sees that he's going to be cut off.  He grabs the hot gun.  The barrel burns into his flesh. He ignores the pain and RUNS BACK toward the bridge.  FIRES again.  More Germans drop.  Knows what that means.  He hears the    SEE JACKSON DIE.  A bare moment to react.  Then, they turn their attention back to the eighty-eight. Frantically turning the aiming cranks. Lowering the barrel to point blank.  Win the race.  Quickly reload the eighty-eight.  Shoves the FINAL SHELL into the breech of the eighty-eight.  Pats Ryan on the back.  Grabs a SATCHEL CHARGE.  Races through the debris.  Trailed by BULLETS.  Is almost there.  He arms the satchel charge.  Throws the satchel charge under the tank.  Rolls off the edge of the bridge.  Lands on the embankment below.   Goddamn it!      Miller, Company B, Second Rangers, that's Private Richard Reiben and that's Private James Ryan, Hundred- and-First Airborne.      Walks to the bodies.  He kneels down next to Sarge and looks at him for a long moment.  Then, with a steady hand, he takes one of Sarge's two dog-tags.  Then he does the same to Jackson and Upham.  Stands and walks back to Reiben and Ryan.  He hands the dog-tags to Ryan who grips them tightly and nods in thanks.  Yes, Private.  Upham?  Good kid, smart, he was writing a book.  Jackson was from West Fork, Tennessee, he was going to be a preacher, his father and uncles have a traveling ministry out of the back of a stretch Hudson.  Sarge? He was the best friend I ever had. Lemme tell you about Sarge...",
        "Horvath": "",
        "Mellish": "",
        "Toynbe": "",
        "Hamill": ""
    },
    "imdb_rating": "8.6",
    "description": "Opening with the Allied invasion of Normandy on 6 June 1944, members of the 2nd Ranger Battalion under Cpt. Miller fight ashore to secure a beachhead. Amidst the fighting, two brothers are killed in action. Earlier in New Guinea, a third brother is KIA. Their mother, Mrs. Ryan, is to receive all three of the grave telegrams on the same day. The United States Army Chief of Staff, George C. Marshall, is given an opportunity to alleviate some of her grief when he learns of a fourth brother, Private James Ryan, and decides to send out 8 men (Cpt. Miller and select members from 2nd Rangers) to find him and bring him back home to his mother...—J.Zelman",
    "name": "Saving Private Ryan",
    "genres": [
        "Drama",
        "War"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZjhkMDM4MWItZTVjOC00ZDRhLThmYTAtM2I5NzBmNmNlMzI1XkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_QL75_UY281_CR1,0,190,281_.jpg"
}