{
    "filename": "Saving-Mr.-Banks_script.txt",
    "imdb_id": "tt2140373",
    "imdb_url": "https://www.imdb.com/title/tt2140373",
    "characters": [
        "Richard Sherman",
        "Travers Goff",
        "Biddy",
        "Mr. Belhatchett",
        "Diarmuid Russell",
        "Ginty",
        "Robert Sherman",
        "Margaret Goff",
        "P.L. Travers",
        "Aunt Ellie",
        "Dolly",
        "Ralph",
        "Tommie",
        "Don DaGradi",
        "Walt Disney"
    ],
    "dialogues": {
        "Richard": "",
        "Sherman": "",
        "Travers": "--Like something is brewing, about to begin--  --Can't put me finger on what lies  --But I feel what's to happen, all  Diarmuid gets up.  Excuse me ma'am, have you seen my daughter? I was quite sure I had left her around here somewhere!  Her name is Helen, no, Shirley, erm- - goodness! I've quite forgotten! Could it be Prunella?  Pamela?  You're right still doesn't sound quite-- I'm sure I have a special name for her--  Why, thank you ma'am! Ginty it is of course! Now, have you seen her?  Gosh! So it is! Well, thank goodness for that! I was positive I was going to be beheaded for losing Her Highness The Royal Princess Ginty Mc Featherfluffy!  Never. I promise. I will never lose you!  Hurry now! We mustn't be late! The adventure is about to begin!  Who needs a carriage my love? A stroll is a gift!  Everybody ready? Yes. Yep!  Come along my team! We mustn't miss the train.  Walking bus!  Don't forget Andrew!  Ready? And off we go!  Left, right, left, right! Coming through!  A palace! Complete with mighty steed.  We'll build beautiful memories here my angel.   --in this house you get to share a bedroom!    Ginty.  I'll make us a good life. I promise. I'll make you proud again.  Ahhh, there's my girl.  That's it Albert. Give Ginty a smooch. There's a good boy, give her a little smooch.  Poor old Albert; he's your secret uncle you know? But a miserable, horrid witch turned him into a nag.  Because she hated the sound of his laugh.  We have to teach the witch how to be happy again.  I'm not quite sure darling. Your mother's been calling you for a good hour. I shouldn't go if I were you, she's after little slaves for housework! Ah, I must scrub and bake and sweep Till stars are beginning to blink  Do you want to know what it feels like to fly Ginty?  You trust me?  Gee up, Albert. Yah!  Yah!  For you my dear! (he flicks the blade in the air like a swordsman Swish! Which kind of kisses do you prefer Gintamina? Swoosh! Scratchy ones or silky ones?           And Mr Belhatchett has complained that I opened his stupid bank five minutes late has he? Hahaaa!  Time's Money, Goff, y'know! Time's money my man!  Bell Hatchett! Beautiful hatchet. That's what it means. And I suppose if the poor dumb lambs on his downs, are five minutes late with their calving, or they don't drop dead on schedule when he wants a roast, he takes to them with the business end of his beautiful hatchet.  There, whack! That'll teach you for not dropping your bairns on schedule. Whack! Whack! Whack!  Whack. Whoops!  Mr Belhatchett! Allow me to--  Ginty!  Sweet thing! What are you doing here?  Ice cream day! Yes! I did! What kind of father am I?  Ah, yes it does seem that--     Ice cream is so rare because it only comes from Siberian cows. Did you know that?! Brrrrrrrr!  We share a Celtic soul, you and I. This world is just an illusion, Ginty old girl. As long as we hold that thought dear, they can't break us. Money, money, money. Don't you buy into it Ginty! It'll bite you on the bot! How did we end up here eh? Look at it. Barren. Breathless. Get as far away from this place as possible my love. Find yourself a patch of green. It's a chimera you know? The world, the bank, you and I, Mr Randolph- whackety-whack-Belhatchett. All an illusion.     I couldn't stop thinking about my beautiful girls on this beautiful day in this beautiful place and I thought to hell with it!  And what do we say about beauty ladies?  A thing of beauty is a joy forever!  Buts are for goats my love! Urgh!   I'll put in extra hours tomorrow. What are we playing?  That's no hen! That's Aunt Ellie, your mother's horrendiferous sister!  East Wind!  I'll wash them again my love!  Go Sergeant Ginty! Fell the beast!  Oh she's a foul fowl!  --Meg sweet, I had a throat scratch-  God no! No. I can endure. I will endure. For the girl's sake-- Just, please-- not Ellie.  The world is an illusion Ginty.  Ahh the Countess Mary Sparklestick! Pray tell me, what are you concentrating so hard on?  Really!? Fabulous!  Indeed! I can see the feathers sprouting as we speak!     She's laying!  (urgent, his voice  Don't. Don't leave yourself always searching for-- something--   Mr Belhatchett.  Oh, for Gods' sake, Meg, stop whinnying like an old nag will you?  Meet you there in a blink of an eye!  Indeed, a published poet--  In a moment, my princess. I'm talking. Back in Ireland, I miss her green  Not now Biddy!  Ginty! Shoo!  Good afternoon, distinguished guests, our biggest supporter Mr Randolph Belhatchett and his lovely wife, ladies and gentlemen, boys and girls!  I'm honoured to be here on behalf of the Belhatchett Bank of Australia. Shortly, it will be my very pleasant duty to present the awards to our young performers. But before I begin, I'd like to say a very few words to our very youngest citizens about the role of the - er, the Bank in our community.  And you'll achieve that sense And you'll achieve that sense of stature of stature As your influence expands as your influence expands To the high financial strata To the high financial strata That established credit now That established credit now  Bankruptcies! Debtor sales! Opportunities! All manner of private enterprise! Shipyards! The Mercantile! Collieries! Tanneries! Incorporations! Amalgamations! Banks!  Uhmm. Thank you kindly. Thanking you. Now-- what, what am I doing next? Oh! It's a marvellous idea to encourage children to open accounts. My daughter, the Princess Ginty-- she's-- uh.  How old are you? Come up here.  Ginty has a bank account-- and that's good. Give her a drink!     I shall return in just a moment to present the awards. But right now I must-- relieve myself.  Give us your shoulder, Ginty, will you? I'm busting. There's a good girl.     I don't suppose there's any more you can give me for the pain?  Be a darling Ginty my old pal! Help father out won't you?  In my washroom-- there's a bottle of medicine that father needs--  Godammit!  It's hardly Yeats, is it?         The Aunt.     Look at you-- all ship shape.          Never. I promise. I will never lose you.     --Like something is brewing, about to begin--  Can't put me finger on what lies in  But I feel what's to happen, all",
        "Goff": "",
        "Biddy": "A thing of beauty is a joy forever!  Really?!  Mrs Brill said Father's presenting the medals.  Ginty!  Where's ma?  An elf?  Are you going to the sky?  Is it happy?",
        "Belhatchett": "",
        "Diarmuid": "Mrs Travers.  You're ready to--? Like pink clouds on sticks.  Excuse me?  The car should be here, may I use--  You--? What? Pamela!  Mrs Travers, please, why--  Why would you cancel the car?  We've been through this--  You can't.  You made an agreement. Do you understand? A verbal agreement.      I like to think of it, believe me I know it's not reciprocated. I would never suggest you do something that would cause you anguish but there's no more money Pamela-- Mrs Travers. Simply no more. Sales have dried up, no more royalties. You refuse to write further books so-- Do you understand? I'm frightened that you don't understand what that means.  --We've been trying to do this deal for twenty years! He's agreed to both your stipulations. No animation, script approval-- I--     Where is Polly?  Polly?  You have only to go there and work for two weeks. Collaborate. That's it. You haven't signed the rights over, yet.  You must make it work Mrs Travers--  You need the money. I don't want you to see you-- .  I am picking up the telephone Mrs  You do.  You don't sign the papers. He cannot make the film unless you grant the rights. It's an exploratory trip--  What do you say?  I am so pleased to hear that Mrs Travers.  So why do you keep her?  Do you have a title?  Wonderful. Should we start talking about the film rights?  Okay. Now, tell me, Have you got your tiara for the premiere?  Why not?  He hasn't invited you, has he?  Mary Poppins wouldn't stand for that.",
        "Russell": "",
        "Ginty": "No!  No.  Ginty!  It's me!  You can't lose me!       And chickens.  Good night father. `night mother.  Why did she do that?!  Poor Uncle Albert! How can we fix him?  How?  Why do you do that?      Thank you.  You said today was--     Father!  A thing of beauty is a joy forever!  The hen got out and we've been trying to catch her!     Not the aunt! Quick! Catch her before she flies away on the--  East Wind!  Aunt Ellie!      I am laying eggs!  Today I am a hen.  I'm not Helen!  I want to be like you.     Father, come and look. Biddy's dancing.  But she's-- she really wants you to watch, Dad. You'll miss it.  I'm Ginty.  You said don't give up.      I've brought you something father.  Mother took it away.  I wrote a poem for you. It - it won first prize, at school.  Would you like me to read it to you?  Mother?  What?  Mother!        Once upon a time there were three little girls alone in a house. They were frightened of the big wide world just outside the door.  They were so afraid.  But the stars were guarding them, they glittered as they spoke \"We shall send a guide to show them the way to the magical ladder which will bring them all the way up to  And who do you think those sparkling messengers sent? Who was it that came flying through the starry, starry sky to carry us up to see them?  Their old Uncle Albert of course!  Stay right here, be good--  I'm going to find the end of the story so I can bring it back for you!  It's time to go home, ma.  I re-wrote the poem father.  The aunt gave me tuppence.  Shall I buy you something father?  I want to see my father.  I want to see him!  I dropped the pears.  I'm sorry daddy.  You promised you would fix everything.",
        "Robert": "",
        "Margaret": "The carriage?   Thank you so much. For everything.    Yes.  It's rather late--  Biddy and Moya are already asleep.  Good night dear.  Look at the stars.  There there. Shush shush now--   If you could just--  What a lovely surprise! Did you finish early?    Oh!  --darling, it's just that um-- a  --the bank is getting you down again? Perhaps my sister--  Oh my dear--  Helen Goff, would you lay the table for supper please?  I need--  (her face contorts in   He is indeed! On behalf of the bank.  Travers, Biddy's stomach--      Come on Biddy.  He's using too many `verys'. He always says `very' too much when     I want you to take care of the children.  Watch over them.  I know you love your father more. But one day you'll understand.  Sometimes a person we love, through no fault of his own, can't see past the end of his nose.  Oh my!  They've been so worried-- I've--    No, you mustn't.",
        "P.L.": "",
        "Aunt": "Margaret, my poor child. I simply had to come. We must fix this.  Let her go Margaret.",
        "Ellie": "Margaret, my poor child. I simply had to come. We must fix this.  Now, I've brought every new fangled treatment available in Sydney.  Close your mouth please Biddy, we are not a codfish.  I spy a multitude of jobs to be done!  Do stop babbling nonsense! I'm here now and I shall fix everything. Girls! Feverfew and camomile to lower his body temperature. Garlic, sorrel, sage. Deadly nightshade. And if those don't work-- well I shouldn't like to say.  --tincture of horseradish--  I thought I had made it quite clear you were to begin helping.  Spit spot!  Well begun, is half done!  Let her go Margaret.",
        "Dolly": "She's here!  I'm sorry to interrupt.  Excuse me?  I'm sorry I don't understand.   Mrs Travers, it was a specific request, from Walt.  She has a lot of-- ideas.  About how she, uh, sees things.     She won't approve Dick Van Dyke.  The sketches of the Banks house make it look too opulent, there must be no hint of romance between Mary Poppins and Bert, she wants to know why Mr Banks has been given a moustache, the--  Yes. They did tell her but she wants to know why.  Right. Of course. Uh-- the tape measure Mary Poppins uses to record Jane and Micheal's height must be a roll tape, not a ruler, we must add gravi-- gravitas, she says.  She only wants green vegetables and broth, I don't know what that is but she wants it in the room from now on and oh! She doesn't want the colour red in the film-- at all.      \"A proper kite needs a proper tail don't you think?!\"  Let's go fly a kite Up to the highest height  Let's go fly a kite and send it  Up through the atmosphere Up where the air is clear Oh let's go fly a kite  Mr Disney! Walt!  I'm sorry to interrupt. It's just she-- she's dancing! Mrs Travers. She's dancing with Don!  Good afternoon Mrs Travers!  If you'd like to take a seat--  Mrs Travers, please!  Yes ma'am, when?  Yuh, didn't you know? She's all hoity toity. British this and British that and she's really an Aussie called Helen Goff. Stuck up--",
        "Ralph": "Travers? P.L. Travers?  Welcome, Mrs P.L. Travers! Welcome to the City of Angels.  Let me take those.  Sun came out to say hello just to you.  Jasmine.  You okay back there Mrs P.L. Travers?  No problemo! We got a brand new air conditioning system, Missus; cool you right down in no time. Just about make you feel like you're in good old Engerland again! Things they can put in cars these days-- (he shakes his head in   No problemo.  Good morning Mrs!  Hm?   Yes ma'am! I'm all yours. Sun came out again!  It certainly is!   Madame.  I would so much rather be accountable for the rain.  Oh, that's sad.  Okey dokey.  So does the sun.  Yes ma'am.      Beautiful ain't it?  I do.  Ya alright Mrs?  Mrs?  I, uh, brought you a tea.  Everything okay Ma'am? Would you like me to drive you home?  You got family back there Mrs?       I gotta kid.  Jane-- she's got all kinds of troubles.  Handicapped you know? Myelitis-- transverse. She's in a wheelchair see? That's why I concern myself with the weather-- sunny day she can sit out in the garden. Rainy day I have to leave her cooped up inside. Worry `bout the future, but then I stop cuz you can't do that. Only today.  A river!  Lake. Hey! I wish I could take her there!  Change of venue this morning apparently.  I was thinking about our-- tea party?       Oh! Isn't that nice? Holy mackerel! Wowzers. Never met him myself but there he is! Right there. Real. Living, breathing. Oh boy!  It's always new.  Woah! Mister Disney!  Hi! I'm such a huge fan. It's such an honour to--     You ready to go Mrs?  The lady's ready to go now sir.  It's been a pleasure driving you Mrs.     I was telling my daughter all about my day and how I was driving this nice writer lady, Mrs Travers for Mr Disney and--       Jane.  Uh huh. Like the girl in the book.  Ralph.  Pamela.  May I ask why?      Walt Disney!  Thank you Mrs.  Had a feeling a certain friend of mine might be needing me tonight.  You look like a million bucks! Let's get you to the ball.   This is your night. None of this would be possible without you.",
        "Tommie": "Hi there! It's so nice to--  Scotch Mist.  What do I think I-- what?  That's a canny observation Walt.  You think the female of the species has some kind of psychic insight when it comes to others of her kind?  We don't. You'll get yourself an ulcer with all that unriddling. Give it up.  Walt, I'm so sorry.  Flight left 10 minutes ago.  Her. That's her real name.  Walt.  Invitation list for the premiere.  Not everyone.  Okay.  Tommie sits, arms crossed and stares, half bemused at Walt.",
        "Don": "Pamela! Good morning!  I do apologize, Mrs Travers. I am Don DaGradi, the script writer.  Gradi. Wonderful! I welcome it.  Uh. Okay, so this is the rest of your team, Dick and Bob Sherman! Music and lyrics. Boys, this is the one and only Mrs P.L. Travers, creator of our beloved Mary.  Who else?  Uh-- erm. Ha! We had planned a little tour of the studio for you  --Wanted to show the place off.  Mrs Trav-- it's a long way to--     A word of advice Mrs Travers, if I may.  Wow. Uhm. It's just that he can't stand being called Mr Disney. We are all on a first name basis here. Dolly! Is he--?  We have a whole script to get through. It's gonna be a long day Mrs T.  --ravers.      Exterior. It means the scene is taking place outside.  No, No, Mrs Travers please go ahead.  Yes.   Thank you. Alright Ladies and gents, comical poem, suitable for the occasion--  --extemporized and thought up before your very eyes! Alright, here we go--  We do find it helps to have a visual. It's fun!  It's all wrong?  Um-- yeah?  It does seem strange that Mrs Banks allows her children to spend all of their time with the nanny when she has no job to speak of--  No! Of course not! We just felt that if she had a job it would go some way to explaining--  Sybil?  I could go with Winifred.  Ahm, yeah, that's him--  In the books he--  Bob, Bob, Bob--  What?!  Yeah, do nanny.  Yeah, I think--   Time and tide wait for--      Man is in the forest.     It's ironic.  Mrs Travers?  Mrs Travers?  We were just saying that we'd like to play you the song in the bank. Would that be good?   So you have tuppence? May I be permitted to see it? (changing voice to Michael  Fat birds!   Very well, my boy, give me the  You can purchase first and second   While stand the banks of England. England stands!  When fall the banks of England, England falls!  I love it!  Who are we talking about? I'm confused.  Yes.  Of course.  The boys are shocked at the level of upset.  Mrs Travers!  Good morning Mrs Travers!  Now, Mrs Travers you sit here.  We thought about what you said Mrs Travers and Mr Banks isn't cruel. He isn't. We've got a new ending for the film. Oh god, I hope you like it.     And then Mrs Banks goes to fetch her suffragettes ribbon.  Let's go fly a kite Up to the highest height  Let's go fly a kite and send it  Up through the atmosphere Up where the air is clear Oh let's go fly a kite  Oh Oh Oh Oh Let's go fly a kite Up to the highest height Let's go fly a kite and send it        Dick.  Dick.  Crap.",
        "DaGradi": "What is all this jollification?",
        "Walt": "Don't worry! There's nothing wrong with your television set. This is a pixie bell, the sound is much too high for human ears.  Oh there you are Tink!      Well, there ya are at last!  Oh my dear gal!  You can't imagine how excited I am to finally meet you!  Walt, you gotta call me Walt, ya know. `Mister Disney' was my old man.  Come here! Come here!  Tommie, say hi to the one and only P L Travers!  Have a seat, sit down.  Ya know, I can't believe it. P.L. Travers, right here, in my office, after all these years-- almost twenty of `em.  Twenty. Long. Years.  Wish ya coulda' seen me then Pam! As lean as a whippet I was! A race horse!  But now, here you are. Look at you! I could eat you up!  When Diane here was seven years old I-- can I get you a drink? Coffee? Soda?     My imagination was caught on fire! And I mean ON FIRE! And those embers have burned ever since-- as you know.  I do. Twenty years!  Yes. Twenty. So you keep I've been asking, asking,  I got old asking.  About my getting old?  Yeah I suppose it is.  They're both women now. Gosh! Can you believe it?  Now Pam, a man can't break a promise to his kids. No matter how long it takes to keep. No matter how long! You might've kept me dangling all this time but now we gotcha!    Pam, Pam, the last thing I want is to make you feel--  You see, I promised them. That's a fact. You got kids?     That's what being a daddy is all about right?  This movie isn't just going to make my kids happy. It's going to make ALL kids happy! You see my guys are gonna do things with it that are, well, are revolutionary.  REVOLUTIONARY,Pam!  Mary Poppins will literally fly off the pages of your books!  Now imagine! This magical woman who has only lived in your head, you'll be able to meet her, speak to her, hear her sing.     No?  Oh yes she does!  In your books!  Tell ya what. You just listen to what my Sherman boys have come up with and if they don't knock your socks off then I'm the King of England.  Bet you would.  Greensleeves huh?  Greensleeves.  Pam, I want you to know that the last thing I would do, the very last thing, is tarnish a story I have cherished.   The pages are worn down to tissue, dog eared and falling out. I have poured over them gripped, tormented. Because I love Mary Poppins, you got to share her with me.  A course nothing happens without your say so. Absolutely Nothing.  It's all in the rights agreement. As approved by your agent, Dermot.  Darmitt.  Live action.  Hm?  Tape you say.  I understand. I do.  Let's make something wonderful.       Okay that'll work.  I asked for that.  Because I asked for it.  Tommie!  What do you think?  You're a woman.  What am I missing?      May I walk with you?  Forget ironic, it's iconic.  I won't be able to stop singing that for weeks!  What's your point Pam?  No whimsy or sentiment says the woman who sends a flying nanny with a talking umbrella to save the children.  That'll work.  She's going to say no isn't she? Woman's a conundrum.  Inspired by someone we know?  She won't.  I do. I know it, I know it only too well. I've fought this battle from her side. Pat Powers, he wanted the mouse and I didn't have a bean back then.  He was this big terrifying New York producer and I was just a kid from Missouri with a sketch of Mickey but-- it woulda' killed me to give him up.  Honest to god killed me. That mouse, he's family. Go home.   Pam!  Callin' to check up on you.  Hm?  Pam, are you always so battle ready? P.L. Travers in her breast plate and chain mail, sword up in the air and off with your head!  Please, I beg of you, please please call me Walt.  I heard things didn't go so well today.  What's this all about Pam? Really?  I'm wondering what I have to do to make you happy.  Aren't you wondering that too?   You know, you've never been to Disneyland! It's the happiest place on Earth! (shouting away from the  Oh come on! When does anybody get to go to Disneyland with Walt Disney himself?!  I'm not a violent man Tommie but if Mrs P.L. Travers were to get hit by a large truck I-- (he doesn't allow himself  Okay boys. We gotta fix this.  Welcome to the Magic Kingdom!  Yup! Isn't it wonderful?  Pretty much!  War ain't over yet Pam!      In Adventureland there is a tree-- this is a fun fact. A titbit.     And they said only God could make a tree!  Where did she come from?  I think you know who.  Through the window huh?  It's just that easy isn't it Mrs Travers?  I know you don't wanna be here so I'm gonna take you to one ride-- my favourite amusement and then I'll set you free.  Mrs Travers, I would be honoured if you would ride Jingles. She's Mrs Disney's favourite horse.  No greater joy than that seen through the eyes of a child.  There's a child in us all.  Get on the horse Pamela!  When we first met, you said to me `they're family.'  Mary Poppins, the Banks's, they're family. The boys have had an idea for your Mister Banks. I think it'll make you happy.  No. I brought you all the way out here for monetary gain. Had a wager with the boys that I couldn't get you on a ride. I win!  Yah!     Don't worry Tommie, please close the door.  Never let anybody see me smoking. I'd hate to encourage bad habits. Please, sit down.    Mrs Travers, what in the world has upset you so?  It's a sequence--  And it isn't!  No they're animated.  Pam! Pamela! Mrs Travers! Wait!  Please Mrs Travers-- You must listen.  Pamela? I don't understand why this is so hard for you. Please, make me  The promise breakers? Mrs Travers I-  Mrs Travers?  Hi.    You must reconsider. You must.  He's?  She's gone?  (expecting to read her  Then who's Travers?   I've been talking to the wrong person.  It was one heck of a job getting a seat on the very next flight, let me tell you.  How about you show me how to make one of those nice English pots of tea?  I remember.      No, I've come because you misjudge me.  You look at me and you see some kind of Hollywood King Midas.  You think I've built an empire and that I want to use your Mary Poppins as just another brick in my kingdom. You think I see her with a carpetbag full of greenbacks.  If that was all it was would I have pursued an cranky, stubborn dame like you for twenty years? I'd've have saved myself an ulcer! No, you expected me to disappoint you and so you made sure I did. You see, I think life disappoints you, Mrs Travers. I think it's done that a lot. Maybe Mary Poppins is the only person in your life who hasn't.  Oh, no, that's not true. She's real as can be to my daughter's and to thousands of other children-- adults too. She's been there as a nighttime comfort to a heck of a lot of people.  Mrs Travers, I am so sorry. I hoped this would be a magical experience for you, for all of us. But I let you down-- and in doing so, I've broken a twenty year old promise to my girls. I've been wracking my brains, trying to figure out why this has been so hard for you and I-- You see, I have my own Mr Banks. Mine had a moustache.  But it is true that you created yourself in someone else's yes?  Ever been to Kansas City, Mrs Travers? Do you know Missouri at all?  It's mighty cold there in the winters. Bitter.   My dad, Elias Disney, he owned a newspaper delivery route there. Thousand papers. Twice daily. Morning and evening edition. Elias, he was a tough businessman. A save- a-penny anywhere you can type of fella so he wouldn't employ any delivery boys, he just used me and my big brother Roy. I was eight then-- eight years old. Like I said, those winters were harsh and old Elias didn't believe in new shoes until the old ones were worn right through so-- Honestly, Mrs Travers, the snow would be up to here--  You'd push through it like wading through molasses.  And the cold and the wet would be seeping through the shoes and the skin would be raw and peeling from our faces-- and sometimes I'd find myself sunk down in the snow, waking up, cuz I must've passed out for a moment-- I dunno. Then school, too cold to figure out an equation. And back into the snow so by the time we got home it'd be just getting dark, and every part of you would sting like crazy as it slowly came back to life in the warmth. My mother would feed us dinner and then it'd be time to go out again for the evening edition. Best be quick Walt, best be quick or poppa's gonna show you the buckle end again boy.  Now, I don't tell you all this to make you sad Mrs Travers, I don't. I love my life - it's a miracle. And I loved my daddy, boy I loved him. But, there isn't a day goes by where I don't think of that little boy in the snow and old Elias with his fist and strap and I'm just so tired-- I'm tired of remembering it that way. Aren't you tired Mrs Travers? We all have our tales but don't you want to find a way to finish the story? Let it all go and have a life that isn't dictated by a past? It's not the children she comes to save. It's their father. It's your father--? Travers Goff.  You must've loved and admired him a lot to take his name--  Mrs. Travers. It's all about him isn't it? All of this. Everything.  Forgiveness. It's what I learned from your books.  No, you need to forgive Helen Goff. Life is a harsh sentence to lay down for yourself.  Give her to me, Mrs Travers. Trust me with your precious Mary Poppins. I won't disappoint you. I swear that every time a person goes into a movie house - from Leicester to St Louis, they will see George Banks being saved. They will love him and his kids, they will weep for his cares, and wring their hands when he loses his job. And when he flies that kite, oh! They will rejoice, they will sing. In every movie house, all over the world, in the eyes and the hearts of my kids, and other kids and their mothers and fathers for generations to come, George Banks will be honoured. George Banks will be redeemed. George Banks and all he stands for will be saved. Maybe not in life, but in imagination. Because that's what we storytellers do. We restore order with imagination. We instill hope again and again and again. Trust me, Mrs Travers. Let me prove it to you. I give you my word.  Is that everyone?     There'll be cameras, press, interviews-- I have to protect the picture.  Morning Dolly.  What?  Mrs Travers! How wonderful to see you. What brings you to--  Great!  I'll have a-- uh, replacement sent to your hotel right away.  Pam, how could I?  It's all right, Mrs Travers. It's alright. Mr Banks is going to be all right. I promise.",
        "Disney": "Hit me with it.  Ya? What kind of ideas?  And just how does she `see' things?  Gahd! Anything else?  We can't make the film without the colour red! It's set in London for pete's sake.  There's buses and mail boxes and guards uniforms-- heck! The British flag! Pamela, I'm not sure why  Is this a test Pam? Are you requiring proof of how badly I wanna make you happy so that we can create this beautiful thing together?  Alright. No red in the film.         Pamela sits on a bench, her feet tucked together, her arms clasped around her body, her face to the sky. She sits perfectly still until the limo pulls up and Ralph gets out, patiently waiting beside the car so as not to disturb her. Pamela, opens her eyes and Ralph nods hello. He opens the back door for her and she climbs in.                                                          You do know why!  He's?"
    },
    "imdb_rating": "7.5",
    "description": "When Walt Disney's (Tom Hanks') daughters begged him to make a movie of their favorite book,P.L. Travers' (Emma Thompson's) \"Mary Poppins\", he made them a promise - one that he didn't realize would take twenty years to keep. In his quest to obtain the rights, Walt comes up against a curmudgeonly, uncompromising writer who has absolutely no intention of letting her beloved magical nanny get mauled by the Hollywood machine. But, as the books stop selling and money grows short, Travers reluctantly agrees to go to Los Angeles, California to hear Disney's plans for the adaptation. For those two short weeks in 1961, Walt Disney pulls out all of the stops. Armed with imaginative storyboards and chirpy songs from the talented Richard M. Sherman (Jason Schwartzman) and Robert B. Sherman (B.J. Novak), Walt launches an all-out onslaught on P.L. Travers, but the prickly author doesn't budge. He soon begins to watch helplessly as Travers becomes increasingly immovable and the rights begin to move further away from his grasp. It is only when he reaches into his own childhood that Walt discovers the truth about the ghosts that haunt her, and together they set Mary Poppins free to ultimately make one of the most endearing movies in cinematic history.—Walt Disney Pictures",
    "name": "Saving Mr. Banks",
    "genres": [
        "Biography",
        "Comedy",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BY2Q3MjcwNWQtOGM3Mi00MDM5LTg0MWItZDczYWVlZDU5YjNiXkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_QL75_UY281_CR4,0,190,281_.jpg"
}