{
    "filename": "Scream_script.txt",
    "imdb_id": "tt0117571",
    "imdb_url": "https://www.imdb.com/title/tt0117571",
    "characters": [
        "Steve Orth",
        "Sheriff Burke",
        "Kenny Jones",
        "Tatum Riley",
        "Casey's Mother",
        "Neil Prescott",
        "Deputy Dewey",
        "Stuart",
        "Casey Becker",
        "Sidney Prescott",
        "Gale Weathers",
        "Casey's Father",
        "Billy Loomis",
        "Mrs. Tate",
        "Phone Voice (voice)"
    ],
    "dialogues": {
        "Steve": "tied and gagged.  He's been roughed up, but he's alive. CLOSE ON his eyes..wide in fear..staring at his girlfriend, pleading with her.    eyes wide, sitting in the lawn chair...his belly gaping open...a mass of blood and ripped flesh...his insides lay on the ground between his feet...steam rising.  A SCREAM erupts from the bottom of her soul as Casey collapse on the floor...nearly passing out.  CLOSE ON her face...pale and ghostly white.  She SOBS.",
        "Orth": "",
        "Sheriff": "Who's up next?  How she doin'?  Hi Sidney.  How is everything?  And your Dad? How's he doing?  Hank Loomis' kid? Aw..Jesus...  What were you doing out here?  How is she?  Have to be. The shit she's gone through.  We're seeing a lot of you today.  The vultures are coming. Let's get you out of here.   Sidney sits at a desk drinking a cup of water.  She wears the Sheriff's jacket over her shoulders.  Dewey approaches.    Billy sits opposite Sheriff Burke.  Next to Billy, sits his father, HANK LOOMIS, an older version of Billy.   What are you doing with a cellular telephone, son?  You got some ideas of playing around, boy.  Thank you, Hank. We're on it. What were you doing out at Sidney's tonight?  You rode your bike out there?  And last night? Sidney said you crawled through her window last night too?  Did you ride past Casey Becker's house?  We're gonna have to keep you, Billy. The governor's got SBI, FBI, and god knows who else on their way down here.  What about the cellular phone bill?  Twenty years ago I woulda said not a chance. But these kids today...damn if I know.  She staying with you?  Use the back way. Avoid the circus.     Sheriff Burke's face heats up as Deputy Riley marches in, hurriedly.   Dewey! Where the hell you been, boy?  Listen up, Dewey, because it's bad. Real bad. Aircomp just faxed us. The calls were listed to Neil Prescott--Sidney's father. He made the calls with his cellular phone. It's confirmed.  There's more. Guess what tomorrow is? The anniversary of his wife's death. It all fits. He's our man.  They believe he's out of state by now. We'll keep roadblocks and curfew in effect through the night. If he's not picked up by morning--we'll do a house to house.  He'd have to be crazy. Where's Sidney?  Hold off for now. Just stay close to her.  Watch her. Don't let on--just keep your eyes out.",
        "Burke": "Who's up next?  How she doin'?  Hi Sidney.  How is everything?  And your Dad? How's he doing?  Hank Loomis' kid? Aw..Jesus...  What were you doing out here?  How is she?  Have to be. The shit she's gone through.  We're seeing a lot of you today.  The vultures are coming. Let's get you out of here.  What are you doing with a cellular telephone, son?  You got some ideas of playing around, boy.  Thank you, Hank. We're on it. What were you doing out at Sidney's tonight?  You rode your bike out there?  And last night? Sidney said you crawled through her window last night too?  Did you ride past Casey Becker's house?  We're gonna have to keep you, Billy. The governor's got SBI, FBI, and god knows who else on their way down here.  What about the cellular phone bill?  Twenty years ago I woulda said not a chance. But these kids today...damn if I know.  She staying with you?  Use the back way. Avoid the circus.    Dewey! Where the hell you been, boy?  Listen up, Dewey, because it's bad. Real bad. Aircomp just faxed us. The calls were listed to Neil Prescott--Sidney's father. He made the calls with his cellular phone. It's confirmed.  There's more. Guess what tomorrow is? The anniversary of his wife's death. It all fits. He's our man.  They believe he's out of state by now. We'll keep roadblocks and curfew in effect through the night. If he's not picked up by morning--we'll do a house to house.  He'd have to be crazy. Where's Sidney?  Hold off for now. Just stay close to her.  Watch her. Don't let on--just keep your eyes out.",
        "Kenny": "What? What?  Where'd she go?  You want to go live?  When did that ever stop you? You can't sit on this. This is huge.  But it's so much easier when we make it up.  What's the plan?  The control board's glitched. You know we can't carry a live picture.  About thirty seconds.  Got a picture. Perfect placement. We can see everything.",
        "Jones": "",
        "Tatum": "Do you believe this shit?  Oh God! You don't know? Casey Becker and Steve Forrest were killed last night.  And not just killed, Sid. We're talking splatter movie killed-split open end to end.  Not anymore. Her parents found her hanging from a tree. Her insides on the outside.  Fucking clueless-they're interrogating the entire school. Teachers, students, staff, janitors...  They don't know. Dewey said this is the worst crime they've ever seen. Even worse than... Well it's bad. They're bringing in the feds. This is big.  Hunt? Why would they ask if you like to hunt?  They didn't ask me if I like to hunt.  That is so sexist. The killer could easily be female-BASIC INSTINCT.  Or a man's mentality.  I thought you dumped her for me.  Stu was with me last night.  Fuck you, nut case. Where were you last night?  I thought Blockbuster fired you.      Yeah, yeah...are you okay?  I'll be there by seven. I promise  Later.    Don't worry. Casey and Steve didn't bite it til way after ten.  Good, 'cause I wanna swing by BLOCKBUSTER and get us a video. I was thinkin' Tom Cruise in ALL THE RIGHT MOVES. You know, if you pause it just right you can see his penis.  Bye.  What happened? Oh God...  Oh, God, Sid, I'm sorry I was late.  Her dad's out of town. She's staying with us.  Yes, you doofus.  I don't know.  I'm not talking to you.      I'm sorry, Deputy Dewey-boy but we're ready to go.  She's not answering any questions. Just leave us alone, okay?   A spacious bedroom.  Typical.  Tatum and Sidney lay on the bed. They both wear night shirts.   God, I loved it. \"I'll send you a copy.\" BAM! Bitch went down. \"I'll send you a copy.\" BAM! Sid--SuperBitch!  Yeah, yeah, yeah...  Just like old times, ain't it?  Do you really think Billy did it?  I knew this guy was too perfect. He was destined to have a flaw.  Who is it?  Take a message.  Hang up, Sid.  Your objection is duly noted.  Come on, Sid.    Yo--let's rock.  Just relax. You're at school now. No one can get you here.  Serial killers are smart by definition. They minimize their risk. They plan and pre-calculate everything. Showing up here would be the most lame-brain move he could make.  I wouldn't put too much stock in a psycho's promise.  I want you to meet me here right after class, okay?  Shit, what is he doing here?  Just ignore him. You had good reason to think what you did.  You know if I were accused of carving up two people, I'd take the opportunity to skip school.    It was just some sick fuck having a laugh.  You are not to be alone again. Is that clear? If you pee--I pee.  For once, Stu, drop it.  This could be good. What do you think, Sid?  Come on. Pathos has it's perks.   The late afternoon sun is quickly disappearing.  Tatum and Sidney rock on the front porch looking out into the small town neighborhood.  Dewey's patrol jeep is parked in the driveway.  Despite loud music, BLARING from an inside stereo, this is a quiet moment.   Maybe Cotton Weary is telling the truth. Maybe he was having an affair with your mom.  I didn't say that, Sid. But you know there were rumors. Your dad was always out of town on business. Maybe your mom was a very unhappy woman.  You can't prove a rumor. That's why it's a rumor.    Well...you can only hear that Richard Gere-gerbil story so many times before  Don't go there, Sid. You're starting to sound like some Wes Carpenter flick. Don't freak yourself out--we've got a long night ahead of us.  Come on, let's rock.  Don't be so self-righteous. It's just a little blow out--we'll be perfectly safe.  Hey, Sid. Just think if they make a movie about you. Who's gonna play you?  He better not be. I told Stu to keep his mouth shut. I think we can live without EVERYBODY'S ALL AMERICAN for one night.  Two minutes tops.  You have a few intimacy issues as a result of your mother's untimely death. It's no big deal. You'll thaw out.  Billy and his penis don't deserve you.  With Stu, there's little time to stop and reflect. But sometimes before, to relax and get in the mood, I think about Grant Goodeve.  Grant Goodeve--the oldest brother on EIGHT IS ENOUGH. Remember that show? He was the one who lived off alone. He would come around every now and then with his guitar and sing \"Eight is enough to fill our lives with love...\" He had all these brain dead sisters and that idiot brother from CHARLES IN CHARGE. God, I was in love with Grant, he was so hot. The show came on every day after school right during my puberty years. Grant Goodeve was very instrumental in my maturing as a woman.  During foreplay, I sing the theme song to myself. \"Eight is enough to fill our lives with love...\" It's a real turn on.  Grant wrote the song himself. I'm convinced the lyrics had a secret meaning, \"Eight is enough...\"  Watch the show, Sid. His basket is bigger than the one you're pushing.    Oh, Sidney. WHAT? A guy can talk tits til he's dead but the minute you mention an eight inch weenie. Watch out.  There's that sense of humor. I knew it still existed. Ohh, Sid, let's have some fun tonight.  No, Dewey. You'll ruin the whole night.  Shit.  Caterer's here.  That's mature.    What am I? The beer wench?  Shit, Dewey!  What is she doing here?  So you did--now leave...and take your media muff with you.   Hey, Shitheads!   What the...  Is that you, Randy? Cute.  And what movie is this from? I SPIT ON  Lose the mask. If Sidney sees it, she'll flip.  Oh, you wanna play psycho killer?  Can I be the helpless victim?  Okay, let's see. \"No, please don't kill me, Mr. Ghostface. I want to be in the sequel.\"  Cut, Casper. That's a wrap.  Randy--will you stop?  You little shit.  Who are you?",
        "Riley": "Telephone, dear.  It's for Sid    Dewey! Dewey!  I think you girls really should stay home today.",
        "Casey's": "A big country home with a huge sprawling lawn full of big oak trees.  It sits alone with no neighbors in sight.  The phone RINGS again.",
        "Mother": "I told you to send it back.  What is it? Where's Casey?  Where is she?  The phone's dead.  She's here, God, I can hear her. Where's my baby?  I can hear her. Oh Mother of God, I can hear her.  Not my daughter...not my...   Billy looks around the living room.",
        "Neil": "",
        "Prescott": "a young girl of 17, sits, her face glued to the computer monitor in front of her.  CLOSE ON her face.  Sharp and clever with deep, lonely eyes.  She's comfortable in a plain, flannel nightgown.  Her hands are at work, typing feverishly, when suddenly...   Are you okay?  I heard screaming.  No? Oh, well...I'm hitting the sack. My flight leaves first thing in the morning. Now the expo runs all weekend so I won't be back til Sunday. There's cash on the table and I'll be staying at the Raleigh Hilton...  ..so call if you need me.  I coulda swore I heard screaming.  Sleep tight, sweetie.",
        "Deputy": "",
        "Dewey": "Sidney Prescott.  We all know Sidney, Mr. Himbry.  It's Deputy Riley today, Sid.  We got him, Sheriff. Billy Loomis.  He's her boyfriend.  I was first to respond.  Drive by patrol.  She's tough.  You gonna be able to come down to the station and talk to us a bit?    You can't be here, Tatum. This is an official crime scene.  Does mom know?  You're sure it was the Hilton?  He's not registered. Could he have gone to another hotel?  We'll find him, Sid. Don't worry.  That ghost mask is sold at both Kroger's and WalMart. Neither of which keep purchase records.  They're pulling Loomis' account. But it'll be morning before we see something. You think he did it?  Hold up a sec...  We haven't located her Dad yet.  What did Mama tell you? When I wear this badge you treat me like a man of the law.  I'll get the car. Wait here.  I thought you might want some ice for that right hook.  I'll be right next door. Try to get some sleep.    What? What?  Billy was released. His cellular bill was clean. He didn't make those calls.  I know. We're checking every cellular account in the county. Any calls made to you or Casey Becker are being cross- referenced. It's gonna take time but we'll find him.  Hey, it's school. You'll be safe here.  Leave the girl alone, will ya? She wants to go to school.  Yes, sir, sheriff.  I know who you are, ma'am. How's the eye?  Well..uh...yes ma'am. For the time being.  You're not supposed to be here, ma'am.  I'm twenty-five years old, ma'am.  No, ma'am. Because of my boyish good looks, muscle mass has increased my acceptance as a serious police officer.  Serial killer is not really accurate, ma'am. The killer has yet to strike twice.  We're tracking the cellular phone bill.  No, not yet.  We haven't ruled out that possibil...  If you'll excuse me, ma'am.  That's quite alright. If I may say so, ma'am, you're much prettier in person.  I just turned 25. I was 24 for a whole year.  A party? Mom's gonna kill you. Then me.  Hey, I saw that movie. True story, 'bout some killer in Texas.  I see you as a young Meg Ryan myself.  I'll just be a few minutes. Don't go far.  Keeping my eye on Sidney.  Couldn't his cellular number have been cloned?  Have you contacted the bureau?  You think he could still be in town?  She's with my sister. Should I bring her in?  She'll be with her friends over at Stu Maker's tonight.  Yes, sir.  You girls ready.  Looks like I'm your personal bodyguard tonight, Sid.  Sorry, police orders. I'll stay out of the way, I promise.  Evening, ma'am.  What brings you out to these parts?  Not much story here. Just a bunch of kids cutting loose.  Keeping an eye on things. Checking the place out.  Not at all.  She's with me. I just wanted to check on things.  Afraid not.  Not yet.  Sheriff just radioed me. I'm gonna check out a possible lead. Thought you might like to join me.  A car was spotted in the bushes a little ways up the road.  Ma'am, I am the Deputy of this town.    Actually, I thought we could walk. It's not far.  Dwight. Dewey was something I got stuck with a long time ago.  Nah... it's just this town's way of not taking me serious.  I don't think you're so bad.  You okay?  Looks like a car.  Shit. It's Neil Prescott's car.  We gotta get back. Jesus. He's here. What the fuck is he doing here?  I'll call for backup.     Sidney opens the jeep door, moving to him, noticing his body, slumped, knees buckled...  And then his body falls forward, slowly, deliberately, hitting the porch hard.  Standing behind him is...    Thinking quickly, precisely, she reaches to Dewey's holster and grabs his gun when a VOICE ECHO'S behind her...",
        "Stuart": "",
        "Casey": "Hello.  Yes.  Who are you trying to reach?  What number are you trying to reach?  I think you have the wrong number.  It happens. Take it easy.  Hello.  So why did you dial it again?  You're forgiven. Bye now.  What?  They've got 900 numbers for that. Seeya.   A big country home with a huge sprawling lawn full of big oak trees.  It sits alone with no neighbors in sight.  The phone RINGS again.   Hello.  Who is this?    Popcorn.  Uh-huh.  I'm getting ready to watch a video.  Just some scary movie.  Uh-huh.  I don't know.  Uh...HALLOWEEN. You know, the one with the guy with the white mask who just sorta walks around and stalks the baby sitters. What's yours?  Uh...NIGHTMARE ON ELM STREET.  Yeah...Freddy Krueger.  The first one was, but the rest sucked.    No.  Why do you want to know my name?  What did you say?  That's not what you said.  I have to go now.  Nah, I don't think so...  Gotta go.  Yes?  What do you want?  Dial someone else, okay?  No-bored.  Listen, asshole...  Is this some kind of a joke?  I'm two seconds from calling the police.  What do you want?      Look, enough is enough. You had your fun now you better leave me alone or else.  My boyfriend will be here any second and he'll be pissed when I tell him...  I lied. I do have a boyfriend and he'll be here any second and your ass better be gone.  I swear it. And he's big and plays football and will beat the shit out of you.  I'm telling you the truth. I lied before...  So you better leave.  How do you know his name?  Oh Goddddd...  Where are you?    Why are you doing this?  No...   What kind of game?  Please don't do this...  No...please.    Don't do this. I can't..  No...  I don't know...  Please..stop...  I can't think.     Please go away! Leave us alone!  ..please..no...  Jason! Jason!...JASON!  No it's not. It was Jason.  It was Jason. I saw that godamned movie twenty times. It was Jason.  You tricked me...  ..leave me alone..please...  What?  Don't make me...I can't...I won't.   Somewhere in the house, back flat against a window, listening to FEET ON CRACKING GLASS.  She turns and unlocks the latch, quietly sliding it up. She can hear him move through the foyer...to the front door.  Casey lifts herself up and puts her legs through the window.  She holds the knife in one hand, the phone in the other.  Casey eases out the window, fumbling, dropping the knife back in the house.  She starts to reach for it.  Fuck it, she takes off...",
        "Becker": "",
        "Sidney": "a young girl of 17, sits, her face glued to the computer monitor in front of her.  CLOSE ON her face.  Sharp and clever with deep, lonely eyes.  She's comfortable in a plain, flannel nightgown.  Her hands are at work, typing feverishly, when suddenly...   Billy? What the...  What are you doing here?    Can you knock?  No you didn't.  ..out at the airport...  Got it.  Have a good trip.  What are you doing here?  Now that it's out of your system.  Oh it did?  So you thought you could sneak in my window and we would  have little bump- bump.  Time to go, stud bucket.  You know what my dad will do to you?  I appreciate the romantic gesture.  Would you settle for a PG-13 relationship?  Get outa here.   CLOSE on Sidney snuggling her pillow, sleeping peacefully when...  THE RADIO ALARM BLASTS from the night table loud enough to wake the dead.  Sidney bolts up.   What happened?  No way.  Casey Becker? She sits next to me in English.  Do they know who did it?  They think it's school-related?  Sheriff Burke. Dewey.  Good.  We're fine. Thanks.    Hey, Stu? Didn't you use to date Casey?   A huge two story country home with a spacious lawn.  A yellow school bus stops in front of the house and Sidney steps off.  The house looks big and lonely as Sidney moves up the walk to the front door.     Tell your mom I said thanks.  Uh-huh, it's just...you know, the police and reporters...it brings it all back.  Thanks, Tatum.   eyes frozen, mesmerized by the image.  Suddenly she CLICKS the TV off.  Her eyes go to the clock on the end table.  5:45 PM.  Her eyes then move to the framed photo next to it...the same black and white photo stares at her...a healthy, vibrant woman.  An older version of Sidney.  Sidney curls up on the sofa closing her eyes tight...     I'm not worried.  Whatever. Just hurry.    Hi. Who is this?  I have no idea.  Aha, Randy, you gave yourself away. Are you calling from work? Tatum's on her way over.  I like that thing you're doing with your voice, Randy. It's sexy.  Don't start. You know I don't watch that shit.    That is so unoriginal. You disappoint me, Randy.  So who are you?  So where are you?  Why would you call me from my front porch?  Oh yeah? Well I call your bluff.  So where are you?  Can you see me right now?  What am I doing?  Good try, Randy. Tell Tatum to hurry. Bye now.   Oh Billy...Please...God...  He's here. He's trying to kill me...  ..yeah...  It's okay. She was supposed to pick me up.  Did you reach my Dad?  At the airport.  I don't know. I guess.  It's okay, Tatum. She's just doing her job. Right, GALE?  How's the book?  I'll look for it.  Any word on my Dad?  Just another sleepover at the Riley's.  No, nothing's like it used to be.  He was there, Tatum.  My Dad?  It's alright. I'll get it.  Hello?    Who are you?  I'd rather be around a lot of people, Mama Riley.  It's never gonna stop. Is it?  Somebody called me, Dewey. I'm not making it up.  And my Dad? Any word on him?  Just a sec...I need to talk to someone.  I'm not here to fight.  I want to talk to you.  Off the record. No cameras.  Please. You owe me.  You owe my mother.  And it had to be you with all your lies and bullshit theories.  Do you still think he's innocent?  During the trial, you did all those stories about me. You called me a liar.  Have you talked to Cotton?  Has his story changed?  He's lying. She wouldn't have touched him. He raped her, then butchered her. Her blood was all over his coat.  I saw him leaving wearing it.  No, Cotton murdered my mother.  No, it was Cotton.  I'm sorry I mangled your face.  But if it wasn't Billy it could be anybody. He could be here at school right now.  He promised me he'd be back.  This is a mistake. I shouldn't be here.  I bet he's pissed.  Why are they doing this?  Jesus, SHIT!  No...I don't...it's just...Oh God, Billy, someone was there, someone tried to kill me.  I know. He called again last night at Tatum's house.  I'm so sorry...please understand.  You know that's not true.  No...  No, it's me, Billy. I need time. I'm still adjusting to my mom.      I'm glad to know you're coping so well with life, Billy. But some of us aren't so perfect. Some of us are just trying to hold on.  Pathetic.  Is someone there?    It was him, Tatum. I know it.  Are you serious?  I don't know...    So you think my mom was a slut too?  If they were having an affair how come that Cotton couldn't prove it in court?  Created by that little tabloid twit Gale Weathers.  And you believe it?  If I was wrong Cotton, then he's still out there.  You're right. I'm cracking up. Ignore me.  God, look at this place, it's THE TOWN  Oh, god...  Thanks, Dewey. But with my luck they'd cast Tori Spelling.  Is Billy going to be there tonight?  Billy's right. Whenever he touches me, I just can't relax.  But he's been so patient with me, Tatum. You know, with all the sex stuff. How many guys would put up with a girlfriend who's sexually anorexic?  What do you think about when you're having sex?  Who?  How does that get you in the mood with Stu?  No way.  What secret meaning? Like a Satanical thing?   Deal.  Yeah.   Have they found my father?  Should I be worried?  Billy? Jesus, you scared me.  If Tatum sees you--she'll draw blood.  It's okay. We need to talk.  So...  No, Billy. I'm the one who's been selfish and self-absorbed with all of my post traumatic stress.  But you're right--enough is enough. I can't wallow in the grief process forever and I can't keep lying to myself about who my mom was.  I think in some weird analytical, psychological bullshit way I'm scared I'm gonna turn out just like her, you know? Like the bad seed or something...  Everytime I get close to you I see my mom. I know it doesn't make sense.  But this is life. This isn't a movie.  I wanna let go. I do...  Why can't I be a Meg Ryan movie?  Or even a good porno.  You heard me.      Who did you call?  When you're arrested-you're allowed one phone call? Who did you call?  No, Sheriff Burke called your dad. I saw him.  Uh-huh.  No, but if it were you, that would have been a very clever way to throw me off track. Using your one phone call to call me so I wouldn't think it was you.    in the middle of the road, drenched in blood, very much resembling a young Sissy Spacek.  Gale swerves to miss her, but she turns too sharp and the van veers off the road at top speed...flipping over on its side, sliding off into the thick foliage.       Help! Please! I'm at Stu Maker's house on Turner Lane. Please, HE'S GONNA  Stop. Right there.  Don't come any closer.  Stay away.  Fuck you both.  Please! God! Help me!     Oh God. Billy!  I thought you were...  He's out there.  NO! Don't believe him.   Who stands only feet away, face aghast...  Fuck, no...this can't be happening.  Billy's eyes are on her, unmoving.  He sticks his tongue out and slowly licks the blood dried to his face...tasting it.    She continues to back up, moving right into the arms of...   Stu...please...help me...  Daddy!  Why are you doing this?  Fuck you.  You're crazy--both of you.  You'll never get away with this.  Why did you kill my mother?    What?  Stop it!  You sick fucks--you've seen one too many movies.  I like that ending.      Not so fast.  We're gonna play a little game. It's called GUESS WHO JUST    Gotta find me first, you pansy-assed Mama's boy.  Not this time.  This is for my Mom, asshole.  And this Billy stud-bucket is for having an incredibly small weenie.  Oh Daddy...  Only if it's a nice Meg Ryan movie.",
        "Gale": "Thirties.  He smart face is overshadowed by a flashy smile and a massive mane of chemically enhanced hair.     This is not the first time the small town of Bayboro has endured such tragedy. Only a year ago, Maureen Prescott, wife and mother, was found raped and murdered...  I'll be damned.  Jesus! The camera-hurry!  Excuse me?  Was that Sidney Prescott they took away?  What happened to her?  Look, Kenny, I know you're about fifty pounds overweight but when I say hurry please interpret that as...MOVE YOUR  Hello Sidney.  Some night. Are you alright?  What happened?  Yes, that's right.  It'll be out later this year.  I'll send you a copy.  Stop right there.  Just stay back.    Forget it.  I owe you shit.  Your mother's murder was last year's hottest court case. Somebody was gonna write a book about it.  What is your problem? You got what you wanted. Cotton Weary is in jail. They're gonna gas him. A book is not gonna change that.  He was convicted in a court of law. Your testimony put him away. It doesn't matter what I think.  I think you falsely identified him. Yes.  Many times.  Not one word. He admits to having sex with your mother but that's all.  He was drunk that night. He left his coat at your house, after your mother seduced him...  But couldn't it have been someone else you saw wearing that coat? The same person who planted it in Cotton's car, framing him? The same person who really killed your mother?  You're not so sure anymore, are you?  The killer is still on the loose, isn't he? These murders are related.  Wait, Sidney, don't go...  Jesus Christ! An innocent man on death row. A killer still on the loose. Kenny, tell me I'm dreaming.  No, not so fast. We have nothing concrete.  If I'm gonna blow this up-I need hard proof.  Not this time. I owe Cotton that much. Hell, even I thought that man was guilty.  Hi! Gale Weathers. Field Correspondent,  Productive. So they're closing down the school?  And why is that? Has something happened?  I know, I should be in New York covering the Sharon Stone stalker but who knew? Please, call me Gale. You look awfully young to be a police officer.  Twenty-five, huh? In a demographic study I proved to be most popular amongst males, 11-24. I just missed you. Of course, you don't look a day over twelve, except in the upper torso area. Does the force require that you work out?  Boy, you people sure do make fuss over a serial killer.  Well, we can hope, can't we? We certainly don't have any leads. A ghost mask, a cellular phone--not much there.  Really? You small town guys are good. And have you located Sidney's father?  He's not a suspect, is he?  Am I keeping you? I'm sorry.  So you do watch the show?  You are precious. Please, call me Gale.  Prep the compact, we'll hide it in a window and tape all of tonight's festivities.  What's the delay?  As long as it records I don't give a shit. We're not doing a remote.  Deputy...good evening.  You never know when or where a story will break.  Then what are you doing here?  Mind if I join you?  Huge.  Maybe later?  Can I trouble you for some water?  Tell me, Kenny, has a cheesy tabloid journalist ever won the Pulitzer?  What kind of lead?  I'd love to. If you're sure it's alright?  Can I bring Kenny?  I'll be back.  So is Dewey your real name?  I like it. It's... sexy.  What about Gale Weathers? I sound like a meteorologist...  People treat me like the Antichrist of television journalism.  Are all the local boys as sweet as you?  What's that?  Sidney's father?  I'll get my camera.  Kenny! Camera! Quick!  Kenny?    Dewey? Where are you?   standing in the front door way, gun in hand.  Her body tattered and bloody.  Her hair a mess.   I've got an ending for you. The reporter left for dead in the newsvan comes to, stumbles upon you two dipshits, finds the gun, fumbles your plan, and saves the day.  I wanna close-up.",
        "Weathers": "Thirties.  He smart face is overshadowed by a flashy smile and a massive mane of chemically enhanced hair.    standing in the front door way, gun in hand.  Her body tattered and bloody.  Her hair a mess.",
        "Father": "That fish smelled strong.  Jesus...    Call the police.    Where is she?  Casey! Casey!  Get in the car and drive down to the Mackenzie's.   bound and gagged.  His eyes wide in fear, very much alive.",
        "Billy": "A young, strapping boy of seventeen.  Handsome and alluring.  A star quarterback/ class president type of guy.  He sports a smile that could last for days.   I'm sorry. Don't hate me.  You sleep in THAT?  I'll only stay a sec.  Close call.  It just occurred to me that I've never snuck through your bedroom window.  And I was home, bored, watching television, THE EXORCIST was on and it got me thinking of you.  Yeah, it was edited for TV. All the good stuff was cut out and I started thinking about us and how two years ago, we started off kinda hot and heavy, a nice solid \"R\" rating on our way to an NC17. And how things have changed and, lately, we're just sot of...edited for television.  No, no. I wouldn't dream of breaking your underwear rule. I just thought we might do some on top of the clothes stuff.  See what you do to me.  I'm going...I'm going.    What's that?  Thanks Randy.  It's called tact, you fuckrag.  No one's saying you did.   her boyfriend, staring at her, surprised.   I heard screaming. The door was locked. Are you okay...  Hey...wait...what's goin..   as it SMASHES against the hood of a police car.  His hands are being cuffed, his rights being read.     Sheriff...I didn't do it...please, call my Dad..please...  I didn't call anyone with it. I just took it for fun.  I just wanted to see her, that's all.  Yes, sir.  I watched TV for awhile but the I felt like going for a bike ride.  No, I didn't. I didn't kill anyone, Sheriff.  This is crazy. I didn't do it.  Hi, Sid. Can we talk a sec?  Talk to me, Sid.  You open your mouth and stupidity pours out.   They collide hard catching Sidney off guard, scaring the life out of her.  She falls backwards, but Billy catches her fall.   Hey, hey, it's just me.  What? You don't still think it's me?  The police say I scared him off. It wasn't me, Sid.  See, it couldn't have been me. I was in jail, remember?  Understand what? That I got a girlfriend who would rather accuse me of being a psychopathic killer than touch me.  Then what is it? Is there somebody else?  Is it the sex thing? Am I being too pushy?  It's been a year since she died.  When are you gonna let that go, Sid? When my mom left my dad--I just accepted it. This is the way it is. She's not coming back.  You have to move on, Sid.  How'd you do?  Thanks, butt wart. You did good.  Duh...that's quick.  Because I'm trying to build your self- esteem. You're far too sensitive.  You ready to party hard tonight?    Maybe your movie-freaked mind lost it's reality button?  I was hoping Sid and I could talk.  Subtlety, Stu. Look it up.  So...I'm sorry. I've been a selfish shit and I'm sorry.  You lost your mom...  Oh Sidney...  Sure it does. It's like Jodie Foster in SILENCE OF THE LAMBS when she kept having flashbacks of her dead father.  Sure it is, Sid. It's all a movie. Life's one great big movie. Only you can't pick your genre.  Ssshh...everything's gonna be okay. I promise.  Sshh..it's okay.      What?  I called my dad.  Yeah...and when I called no one answered.  You don't still think it was me?  What do I have to do to prove to you I'm not a killer?   Billy barely turns as a long steely blade rises high in the air. It strikes down with force...hitting his chest as blood sprays the air.  ON SIDNEY as red crimson splatters across her face...as the knife is thrust in and out of Billy who tries hard to put up a fight..but it's useless...he never had a chance.  His body falls to the floor..lifeless.    emerging from the shadows, stumbling down the stairs.  Very much alive.   I'm alright. Gotta...get...help.  It's okay. Give me the gun.    \"We all go a little mad sometimes.\"  Anthony Perkins--PSYCHO   Who stands only feet away, face aghast...  Fuck, no...this can't be happening.  Billy's eyes are on her, unmoving.  He sticks his tongue out and slowly licks the blood dried to his face...tasting it.   Corn syrup. Same stuff they used for pig's blood in CARRIE.  Where ya going? It's not over yet. We've got one more surprise--Stu, I believe it's your turn.    Close enough.  It's called GUESS HOW I'M GOING TO DIE!  We already played that game. You lost, remember?  It's an easy game. We ask you a question. If you get it wrong--you die.  Tell that to Cotton Weary. You wouldn't believe how easy it was to frame him.  Why? WHY? Did you hear that, Stu? I think she wants a motive. Hmmm...I don't really believe in motives, Sid. I mean, did Norman Bates have a motive?  And did they really ever explain why Hannibal Lecter liked to eat people? Don't think so. You see, it's scarier when there's no motive, Sid.  We did your mom a favor, Sid. The woman was a slut bag whore who flashed her shit all over town like she was Sharon Stone or something.  Is that motive enough for you? Or how about this? Did you know your slut mother was sleeping with my dad and she's the reason my mom moved out and deserted me.  Think about it. On the off chance I get caught-a motive like that could divide a jury for years, don't you think?. You took my mother, so I took yours. Big sympathy factor. Maternal abandonment causes serious deviant behavior. It certainly fucked you up. It made you have sex with a psychopath.  Pretend this is all just a scary movie, Sid. How do you think it's going to end?  You know what time it is, Sid? It's after midnight. It's your mother's anniversary. We killed her exactly one year ago today.  Ready?  Don't forget-stay to the side and don't go too deep.  Jesus...fuck, that hurt.    What if your father snapped? Your mom's anniversary set him off and he went on a murder spree, killing everyone...  And then he killed you and then shoots himself in the head. It's a perfect ending.  Oh Sid, don't blame the movies...Movies don't create psychos. Movies just make psychos more creative.  Get the gun. I'll untie Pops.  It's on the table.  Where the fuck is it?  I thought she was dead.  She can't get both of us.  Where'd she go?  Where the fuck did she go?    You bitch--where the fuck are you?  Find her.",
        "Loomis": "A young, strapping boy of seventeen.  Handsome and alluring.  A star quarterback/ class president type of guy.  He sports a smile that could last for days.   It's my phone. He was just playing around with it.  Everybody's got one now. Why don't you check the phone bill for chrissakes. Call my carrier--AirFone Comp. They'll have records of every number dialed.",
        "Mrs.": "..a terrible tragedy. An unbearable loss. It's days like today we need prayer in school...  Sidney. It appears to be your turn.",
        "Tate": "..a terrible tragedy. An unbearable loss. It's days like today we need prayer in school...  Sidney. It appears to be your turn."
    },
    "imdb_rating": "7.4",
    "description": "A year after her mother's death, Sidney Prescott (Neve Campbell) and her friends started experiencing some strange phone calls. They later learned the calls were coming from a crazed serial killer, in a white faced mask and a large black robe, looking for revenge. His phone calls usually consist of many questions, the main one being: What's your favorite scary movie? Along with much scary movie trivia, ending with bloody pieces of innocent lives scattered around the small town of Woodsboro.—Joss Oran",
    "name": "Scream",
    "genres": [
        "Horror",
        "Mystery"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BOGViNDJmMjQtZjYwZS00MTJiLWJhNjktZjRhMjIzNjQ2MjdlXkEyXkFqcGdeQXVyMjI0NTA4NzA@._V1_QL75_UY281_CR46,0,190,281_.jpg"
}