{
    "filename": "Serial-Mom_script.txt",
    "imdb_id": "tt0111127",
    "imdb_url": "https://www.imdb.com/title/tt0111127",
    "characters": [
        "Rosemary Ackerman",
        "Dad",
        "Detective Pike (as Scott Wesley Morgan)",
        "Misty",
        "Chip",
        "Detective Gracey",
        "Carl",
        "Dottie Hinkle",
        "Mom",
        "Mr. Stubbins",
        "Carl's Date",
        "Betty Sterner",
        "Scotty",
        "Ralph Sterner",
        "Birdie"
    ],
    "dialogues": {
        "Rosemary": "(Crying out, rushing",
        "Ackerman": "Beverly, are you alright?  It's the least I could do. I heard shouting.  Yes, I did.  It's terrifying! The police were at my house this morning.  Beverly!  Beverly!  Turn on the news! A teacher at your school has been murdered!  A Mr. Stubber...or Stubbins.  It's on all of them!  That's like your car, Beverly,     Violence is everywhere these days              You could at least apologize, Dottie.  I <u>collect</u> Franklin Mint!  But...but...she...Rosemary, I heard her voice!  It's <u>her</u>, I tell you, IT'S HER!    I'll give you fifty cents.  Eight dollars?!  Franklin Mint or not, it's damaged goods!  I'll take this instead.  I saw one, but it was ridiculously overpriced!  If you wouldn't mind... It was on sale.    (Spotting a small hunk     ...Dottie Hinkle was right - IT <u>IS</u> BEVERLY SUTPHIN!  I tell you I saw blood right on the bottom of her shoes!  Not exactly blood - it was GORE!  Hanging right there like a runny nose!!  Yes!  Thirty minutes later it was covered with blood and gore and Carl Padgett was dead!  ...Browsing.  I didn't want that Faberge egg - it was chipped!  (Shocked at the suspicion  Yes, but I lent it...    (Horrified at the sudden",
        "Dad": "Leave her alone, Chip. I think it's great she has a new beau, Beverly.  Just a little, please.  Bad for the teeth.    Nice?!  He should have been executed!  I certainly did not.  And all that gore better hadn't be interfering with your schoolwork.  Well, your mother's going to PTA today.  We'll see what your teacher has to say.    Who on earth...?    She lives right down the street.  Sorry, son. This is a matter for adults.  No <u>woman</u> would!       Nothing like a home cooked meal, honey.  He certainly <u>drives</u> like a jerk.  Doesn't threaten me, honey. I'm happy.  What channel?    (Putting down his book (Turning out light on  Goodnight, honey.          Shhhh..  Don't wake the kids...    Ooh, honey, I'm ready! Now!  Now!    Hello...  Well, Mr. Sterner, if you call my office, I'm sure we can see you Monday.      Good morning, Detectives.    Surely you don't think Beverly was involved!  Misty, that's a terrible thing to say! Detectives, it's time for you to leave.  My wife knows nothing about this terrible ...accident.     Mr. Sterner, you've lost a tiny filling.  I have to drill deeply enough to remove all the decay.    Mrs. Sterner, please stay in the waiting room!       Bird books mostly...  I'm sure those are my son, Chip's books.  (Seeing their suspicions  Let's say grace and pray that we have the strength to understand the terrible tragedies of the last few days.          We hope so, son.  And no matter <u>what</u> your mother is, we'll love her anyway.  Home Sweet Home!  Everything's fine, kids!  Just ignore the police. It's all a terrible mistake.  Beverly!  Not the Sterners!      (Blocking his face from  ...we are truly sorry and we humbly repent...  NO COMMENT!  PLEASE!  My wife is missing!  I'm worried sick about her!  (Appalled, opening  Hold on, kids!      (Whispering to a shocked  (Realizing MOM is missing",
        "Misty": "I do, please.    Sorry, Mom.  Thanks. Hey, Chip, think I could get 50c for Vanilla Ice.    Just a boy.  He's picking me up this morning.  He's <u>really</u> cute!    He <u>killed</u> people, Mom.  You've been working in that video shop too long.  (Inappropriately making eyes Hi!        Yummy.  Carl says if I lose ten pounds, he'll take me to the University of Maryland Fall Mixer.      She's a pothead!  You <u>said</u> you hated him.        35.    Slow fade in to EXTERIOR SUTPHIN HOUSE.    I'm stoodup!  I'll kill that bastard!  It's him!  (Subtly unbuttoning her  I got somebody you could run over, Mother!  (Whispering to BIRDIE as     Thanks for not buying anything!          (Seeing cop cars and      Mother!  It's Carl! He's dead!       Chip!  Our mother is Charles Manson!  (Grabbing the remote and  Yes murdered!  You said you hated your teacher yesterday and he was murdered too.  I don't know...maybe Mom's nuts!  No!  Stop it!  It's not funny. Mom might do it! Someone else might die.  She's gone!    <u>I</u> DO!  Mom's gone crazy!        Oh God! Now I'll <u>never</u> get a boyfriend!  (Flirting boldly   Get your \"Serial Mom\" T-shirts while they last! $19.95 plus tax!  Master Card or Visa!  (Processing the charge on",
        "Chip": "I wouldn't give ya a nickle.  Here we go again.  She sure can pick 'em!  Always the dentist.  Thanks, Mom.     I do great in school, Dad.   (Giving a pleading look to MOM as Aw, Mom!  I hate Mr. Stubbins!      Let me see!       Rewind it!  Let's see it again!    Hi, Mom.  But Mom, the video's not over.  Mom, Mr. Stubbins is a nimrod!    Oh Mom...  Looks good, Mom!  Carl's a jerk!    Who?    Hello.  What happened?  It's on!  I'll call you back!  That's Lu-Ann Hodges!     Well...he <u>was</u> an asshole... but he didn't deserve to die!        35.    Slow fade in to EXTERIOR SUTPHIN HOUSE.         (Jumping up in fear  You scared me.   It's a cool idea, Misty! Let's make a gore movie about Mom!  Better yet, a TV series!           I'm disappointed she isn't! For a while there, it was like being in a movie!  Think we'll get on \"A  Tell me the truth, Mom! It's ok with me, really!  Are you a serial killer?    We'll show 'em, Mom,  We'll go on \"60 Minutes\"!    In here, Mom...  Get in, Mom!  I have to open.    (Rolling his eyes and  (Looking at cassette in  Because it's the rules!    It's the influence of all those family films. Right, Mom? Hey, Mom??...  Mother?  You don't think....    That's right up the street! Come on!  Just in case!      (Whispering to BIRDIE,       (Getting up, rubbing  I'm sorry he's dead, but... have you signed off yet?  TV, man!  Farrah Fawcett's interested in playing my mother!",
        "Detective": "",
        "Gracey": "",
        "Carl": "More of a friend really...",
        "Dottie": "(Rising to the bait    The police are tracing your call right this minute.          I can't say it out loud. don't use bad language.  Alright, I'll try... \"Cocksucker\".  That's what she calls me.                  Turn it off.  She scared me.  It's not fair!!    (Horrified to see MOM    (Stammering in fear to     Nice as pie she was to me and then I hear her say it!  \"Are those...\" I can't say the word out loud.    (Yelling loudly, startling  You rotten mother-fucker! You lousy cock-sucker!    Not at first, but then I heard the same inflection in a voice at a social gathering and I put two and two together.      I certainly was not!    Socially...I'll have a beer.        (To MOM, being dragged",
        "Hinkle": "",
        "Mom": "1.     Film opens with prologue title: \"This is a true    2.     Establishing shot of upper-middle class suburban home.    3.     Interior cheery, bright SUTPHIN kitchen.  CREDITS  Who wants fruit salad?        And <u>who</u> may I ask is Carl?  (Watching the cute little  Cereal anybody?  Chip, honey?   That's nice.    (Moving in for the kill, hissing Don't say the word \"hate\", honey. \"Hate\" is a very serious word!  There.  All better. Anybody for scrambled eggs?    This is my son, Chip...and my daughter, Misty.  Det. Bradford, I'm sorry but we don't allow gum chewing in this house.  I know Dottie!    Officers, I've never said the P-word out loud, much <u>less</u> written it down!  (Seeing cute little bird   Chip, your ride is here.    (Sarcastically to a sullen  Misty's date...  (Pointing to SCOTTY and    Isn't this 4215 Pussy Way?  Let me check the zip - 212 Fuck you?  Well, Dottie, how come they're not here then, Fuck-Face?     (Disguising her voice  Mrs. Wilson from the telephone company.  I understand you're having problems with obscene calls.     (Still the fake telephone          (Laughs hideously, begins       Rosemary, honey.  Good morning. I'm fine. Thanks for remembering.    Who on earth would want to harrass poor Dottie Hinkle?  Hi, Betty.  Oh, I love your outfit.         Bon Appetit!    What is it, Mr. Stubbins?        I don't know what it is about today, but I FEEL GREAT!    No \"but mom\" for you, young man. Mr. Stubbins seems to think these silly movies are interfering with your studies.  (Picking up SCOTTY's nudist  Yes you are.  Bye, Birdie. Chip, honey...I know it's hard being a teenager but I understand.. I'm your mother and I love you.       Misty, I made your favorite sesame broccoli...    I'm happy too and we want you to be happy.  CHIP!  You know how much I <u>hate</u> the brown word!  That's Rosemary.  Something's wrong!     (Picking up and leafing through  Don't I get a kiss?    We can be real quiet...    Oohhhh, Eugene!      Oooohhh!  Yeah!  Yeah!  Yeah!  Oohhhh!  Get it!    (Tracking a particularly  (Turning to face DAD,    (Back to normal,  Honey, what's the matter?  Don't say words unless you mean them, Misty.  No, honey, it's the police. Hello, officers.  A fine man.  A good teacher...    (Seeing MISTY's eyes light    (Quickly staring daggers at          (Singing and dancing  Don't forget me, boys! All rinsed and ready to recycle!  Morning, Gus.  Hello, Sloppy. Here you go.  You work hard for the environment.  A little drink never hurt anybody.        (Entering, back to normal,  (To MRS. ACKERMAN, noticing  (Evily baiting DOTTIE under PUSSY-willows, Dottie!  Dottie!  Watch what you're doing!    And we're going <u>right</u> to the flea market to get another one! Misty tells me there's a whole booth of Franklin Mint stuff. Dottie, you lock up. <u>I'll</u> take care of poor Rosemary!  Damn these yellow-jackets! I hate 'em!  Misty, lighten up.  It's not the customer's fault Carl stood you up!  (Seeing MRS. ACKERMAN1s Did you find your Franklin Mint egg, Rosemary darling?  (Seeing MRS. ACKERMAN's    (Caressing fire poker  Ewwww! Thank you, Rosemary.  That's one-hundred fifty-eight dollars.  Certainly.  0h, that's horrible, honey. I sold the Pee-Wee Herman doll!!       Dinner's served!  Amen to that. It's been a crazy day, hasn't it?!          \"...Ain't no time to grieve And it's Daybreak!!! Let it shine, shine, shine, All around the world!!\"          (Holding up bottle of \"SHOUT\"  You'll pay for that, Ralph Sterner!!      Oh, honey!  Chip, the only cereal I know about is Rice Krispies.  Who?  (Praying piously, but beginning  ...And walk in the ways to the glory... ...of Thy name...    But, Chip...  This is so silly.  \"Tomorrow!..Tomorrow!..Tomorrow! I love you...     Hi! I know your mom...  Excuse me. Age before beauty...      Thank you so much, you kind, kind creature.  Excuse me...coming through... Bill Flowers!  You're underage!  (Snatching joint out of              Oh shut up, Herbie! I have the <u>right</u> to defend myself, your honor.  I've read the lawbooks!  \"Ware vs. State, 1964\", and \"Schutte vs. State, 1962\".    Mrs. Hinkle...do you drink?  So you weren't drunk when you received those alleged obscene phonecalls?  You mean to tell me the day I came over to Mrs. Ackerman's...the day you claim you recognized my voice...you weren't drinking?  So you <u>do</u> drink?  So you admit you just lied?            Don't judge people by what they read, Detective. Your witness, Mr. Nazierod.    Did Carl Padgett buy something you wanted?  Carl Padgett <u>died</u> for the Franklin Mint, didn't he?!        (Giving MARVIN her version of  (Addressing the jury with  ...But I've been framed by the police...  ...and perjured against by the very people I thought were my friends...  ...All I ask is that you have the courage to find me innocent of these terribly untrue charges...  I'm coming home!!  (Graciously accepting    Oh yes it is! Didn't your mother ever tell you?!  Well, now you know!    Right here, honey.  Certainly.  (Trying to get on other  (Hissing to FARRAH in the",
        "Stubbins": "Some teenagers just aren't college material, Mrs, Taplotter.  It's nothing to cry over.  Now, there are other parents waiting. ...thank you for taking the time to come to PTA.   Mrs. Sutphin, I'm Paul Stubbins, Chip's math teacher.    Chip is off to a fine start this year. Focused...conscientious... participates actively in classroom discussion.        Divorce?  An alcoholic relative? Tell me, did Chip torture animals when he was young?  Well, you're doing something wrong, Mrs. Sutphin.  I'd recommend therapy for your son. Thank you for taking the time to come to PTA.",
        "Carl's": "",
        "Date": "",
        "Betty": "",
        "Sterner": "Hi, Beverly.  Thanks. It's a Liz Claiborne.  Mrs. Sutphin, where's that husband of yours? Feeling \"down in the mouth\"?! Hohohohohoho!  Eugene, it's Ralph Sterner. Got a dental emergency here! I mean this goddamn tooth is killing me!   Eugene, this is Betty Sterner, He'll die by Monday!  The roots are infected!  He might have a heart attack!     OWWWWW'! Goddamn you!  You're hurting me on purpose!    Help me, Betty!  He's worse than the dentist in \"The Marathon Man\"!  What was that?  I didn't hear anything. Got any dessert?  Dr. Sutphin said no sweets for you.  What's he know?  How to send a bill!!                (As chocolate oozes in his                 Betty?  Betty, answer me!               Help!  POLICE!!",
        "Scotty": "Man, I just ate.  Turn it off.  No!  That shit is sickening! Put on pussy!    Man, that one made me puke!    The Maryland Teacher Massacre!  (Hamming it up,  (Picking up a \"People\"                                    100.   Wipe to EXTERIOR SUTPHIN HOUSE.                  Oh shit!    (Straining to remember",
        "Ralph": "",
        "Birdie": "Hey Misty, look what I got! A Pee Wee Herman Doll.  Can you sell it for me at the flea market?  It's a sheep's tongue!       Hi, Mrs. Sutphin.     Bye, Mrs, Sutphin.    This is <u>so</u> cool! It's just like a horror movie.    Can I borrow your mother? My aunt is coming over to dinner tonight and she's <u>always</u> on my nerves.  Alright You're bigger than Jason or Freddie now! Only you're a real person!  Good morning, Mrs. Jenson.  What a bitch!    0h, shit!  She wouldn't...  ...Jenner...Jenson, Emy Lou Jenson.  3511 Clark Avenue!  I saw blood!  And it's brown! Not red like in horror movies, but brown!!  No! It wasn't like gore movies at all!  Oh God, I think I'm going to be sick..."
    },
    "imdb_rating": "6.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYjM0N2ViMzUtMTc1OS00YmEzLWE2NWYtNjU5NTY4NjRlOTI0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,2,380,562_.jpg",
    "description": "A picture perfect middle class family is shocked when they find out that one of their neighbors is receiving obscene phone calls. The mom takes slights against her family very personally, and it turns out she is indeed the one harassing the neighbor. As other slights befall her beloved family, the body count begins to increase, and the police get closer to the truth, threatening the family's picture perfect world.—Ed Sutton <esutton@mindspring.com>",
    "name": "Serial Mom",
    "genres": [
        "Comedy",
        "Crime",
        "Thriller"
    ]
}