{
    "filename": "Shakespeare-in-Love_script.txt",
    "imdb_id": "tt0138097",
    "imdb_url": "https://www.imdb.com/title/tt0138097",
    "characters": [
        "Will Shakespeare",
        "Frees (as Tim McMullen)",
        "Makepeace - the Preacher",
        "Lambert",
        "Will Kempe",
        "Lady in Waiting (as Bridget McConnel)",
        "Hugh Fennyman",
        "Richard Burbage",
        "Tilney - Master of the Revels",
        "Henry Condell",
        "Lady in Waiting",
        "Philip Henslowe",
        "Queen Elizabeth",
        "Dr. Moth",
        "Rosaline"
    ],
    "dialogues": {
        "Will": "(tapping his forehead and  As soon as I have found my muse     She is always Aphrodite.  Henslowe, you have no soul so how can you understand the emptiness that seeks a soulmate?  What piece? Richard Crookback?  Who wrote that?  Half what you owed me. I am still due for One Gentleman of Verona.  Mr. Henslowe, will you lend me fifty pounds?  Burbage offers me a partnership in the Chamberlain's Men. For fifty pounds my hired player days are over.    To my weekly confession.  Words, words, wordsonce, I had the giftI could make love out of words as a potter makes cups out of clay love that overthrows empires, love that binds two hearts together come hellfire and brimstonesfor sixpence a line, I could cause a riot in a nunnerybut now    I have lost my gift. It's as if my quill is broken. As if the organ of the imagination has dried up. As if the proud tower of my genius has collapsed.  Nothing comes.  It is like trying to a pick a lock with a wet herring.  A goodly length in times past, but lately  I was a lad of eighteen. Anne Hathaway was a woman, half as old again.    On my mother's side the Ardens  Four years and a hundred miles away in Stratford. A cold bed too, since the twins were born. Banishment was a blessing.  yet cannot love nor write it.  Will it restore my gift?  To the Palace at Whitehall.    No, they would laugh at Seneca if you played it.  I am still owed money for this play, Burbage.  When I have fifty pounds.    Romeo. Wit, swordsman, lover.  Romeo  It's for Henslowe. He paid me.  Ten pounds.  I swear it. He wants Romeo for Ned and the Admiral's Men.  Done.  I have lost my gift.  Are you to be my muse, ROSALINE?  You see? The consumptives plot against me. \"Will Shakespeare has a play, let us go and cough through it.\"  I feel a scene coming on.           Romeo and Rosaline. Scene One! God, I'm good!    Burbage?  Mr. Tilney  So this is the favour you find in the Chamberlain's Men.     You have opened the playhouses?  But the plague  Yes. Nearly. It's all locked safe in here. We need Ralph for the Pirate King. Good morning, Master Nol. You will have a nice little part.  Give me to drink mandragora.  Kit  Wonderful, wonderful.  I have. And chinks to show for it.  I insist--and a beaker for Mr. Marlowe. The BARMAN does the business.  I hear you have a new play for the Curtain.  I love your early work. \"Was this the face that launched a thousand ships and burnt the topless towers of Ilium?\"  Good title.  Romeo and Ethel the Pirate's Daughter. Yes, I know.  Well, there's a pirate In truth, I have not written a word.  Yes, that's good. Until he meets  Do you think?    Mercutiogood name.  I'm coming.  Good luck with yours, Kit.  This is a different one.  I did not.  Tomorrow    Your name?  Take off your hat.  Where did you learn how to do that?  Wait there.  Let me see you. Take off your hat.    Follow that boat!    Really?  Do you know that house?  The actor  William Shakespeare, actor, poet, and playwright of the Rose.    Master Plum! What business here?  I seek Master Thomas Kent.    (coming round form the        Will Shakespeare!  The same, alas.  A lowly player.  Oh--I am him too!    Oh my lady, my love!  You can bring them with a word.     We are at least six men short, and those we have will be overparted, ranters and stutterers who should be sent back to the stews. My Romeo has let me down. I see disaster.  Who are you, master?      We are about to embark on a great voyage.  You want to know what parts you are to receive. All will be settled as we go  We are in desperate want of a Mercutio, Ned, a young nobleman of Verona  Mercutio  Mr. Pope! Mr. Phillips! Welcome, George Bryan! James Armitage! Sam! My pretty one! Are you ready to fall in love again?   (he thrust a hand between  Master Henslowe, you have your actors.  Yes, I saw it.  Better fortune, boy.    Oh. What is your name?  I have to get back.  Cut round him for now.  Romeo.  What?  Good    Do you understand me?  He is speaking about a baggage we never even meet! What will be left in your purse when he meets his Juliet?     Of course you have not! I have not written it!  Go once more!      There you have his duel, a skirmish of words and swords such as I never wrote, nor anyone. He dies with such passion and poetry as your ever heard: \"a plague on both your houses!\"    Oh, Thomas! She has cut my strings! I am unmanned, unmended, and unmade, like a puppet in a box.  Row your boat.  She tells me to keep away. She is to marry Lord Wessex. What should I do?  And break her heart and mine?  She loves me, Thomas!  No. And yet she does where the ink has run with tears. Was she weeping when she gave you this?  Your aunt?  Like a sickness and its cure together.  Oh, if I could write the beauty of her eyes! I was born to look in them and know myself.  Oh, Thomas, her lips! The early morning rose would wither on the branch, if it could feel envy!  Deeper. Softer. None of your twittering larks! I would banish nightingales from her garden before they interrupt her song.  Constantly. Without doubt. And plays the lute, she has a natural ear. And her bosom--did I mention her bosom?  Oh Thomas, a pair of pippins! As round and rare as golden apples!    For one kiss, I would defy a thousand Wessexes!    Can you love a fool?    I am.  It is strange to me, too.  There is.    Well perhaps better than my first.  I must. Look-- how pale the window.  No, the morning rooster woke me.        It was the owl. Believe me, love, it was the owl.  Yesyesernot quite rightit is more let me \"Then have my lips the sin that they have took.\"    I must. I must  Yes, some of it is speakable.  (reading through VIOLA'S  \"What man art thou that thus bescreen'd in night So stumblest on my counsel?\"  \"The orchard walls are high and hard to climb, And the place death, considering who thou art, If any of my kinsmen find thee here. If they do see thee, they will murder thee.\"  \"Good night, good night. As sweet repose and rest Come to thy heart as that within my breast. O wilt thou leave me so unsatisfied?\"  Oh, but it is mine too!  \"My bounty is as boundless as the sea, My love as deep:  (continuing the speech with  \"Stay but a little, I will come again.\"    NedI knowI know  Oh  Ah  Thank you, Ned.  You are a gentleman.  Sundayit is Sunday.  I found something in my sleep. The Friar who married them will take up their destinies.  In heaven, perhaps. It is not a comedy I am writing now. A broad river divides my lovers--family, duty, fate--as unchangeable as nature.  You cannot! Not for the Queen herself!    Then I will go with you.  I know how to fight!  Here we come at last, my lord!  Her chaperone. My lady's country cousin. My, but you be a handsome gallant, just as she said! You may call me Miss Wilhelmina!  Oh, my lord, you will not shake me off, she never needed me more, I sear by your breeches!  A man, my lord?  A theatre poet?  Marlowe? Oh yes, he is the one, lovely waistcoat, shame about the poetry.  Fifty pounds!  What is this rabble?!  A literary feud. Quite normal.  Stay hid!  I dreamed last night of a shipwreck. You were cast ashore in a far country.  Is this a tavern?  It is also a tavern.  It is, Thomas, but of good reputation. Come, there is no harm in a drink.    By God, I wish I knew.  Ohwhat have I done?  It was I who killed him! God forgive me, God forgive me!  It is worse. I have killed a man.  Marlowe's touch was in my Titus Andronicus and my Henry VI was a house built on his foundations.  He was not dead before. I would exchange all my plays to come for all of his that will never come.  My love is no lie. I have a wife, yes, and I cannot marry the daughter of Sir Robert de Lesseps. It needed no wife come from Stratford to tell you that. And yet you let me come to your bed.  I was the more deceived.  Now?  Oh, my love You ran from me before.  You cannot marry Wessex!  Nono.    but the Friar who married Romeo and Juliet  You, Edward. The Friar who married them gives Juliet a potion to drink. It is a secret potion. It makes her seeming dead. She is placed in the tomb of the Capulets. She will awake to life and love when Romeo comes to her side again.  I have not said all. By malign fate, the message goes astray which would tell Romeo of the Friar's plan. He hears only that Juliet is dead. And thus he goes to the Apothecary.  And buys a deadly poison. He enters the tomb to say farewell to Juliet who lies there cold as death. He drinks the poison. He dies by her side. And then she wakes and sees him dead.  And so Juliet takes his dagger and kills herself.  The play. All written out for you. I had the clerk at Bridewell do it, he has a good fist for lettering.  There's a new scene    \"Yon light is not daylight, I know it, I. It is some meteor that the sun exhales To be to thee this night a torchbearer\"  \"thou need'st not to be gone.\"  You are on my ground.  I am more than enough.  Absent friends! This is the murderer of Kit Marlowe!      How will it?     (as the awful truth gets  Sam! Do me a speech, do me a line.  What do we do now?  Go on.  How will it?  Courage man. The hurt cannot be much.  \"I am fortune's fool!\"  I am fortune's fool.  You are married?  If you be married, my gave is like to be my wedding bed. The implication of her silence fills the air. WILL does not move.  \"Farewell\"  \"Trust me, love, in my eyes so do you. Dry sorrow drinks our blood. Adieu. Adieu\"  \"Come hither, man. I see that thou art poor. Hold, there is forty ducats. Let me have A dram of poison--\"  \"I pay thy poverty and not thy will.\"  \"Eyes, look your last! Arms, take your last embrace! and lips, Oh you The doors of breath, seal with a righteous kiss A dateless bargain to engrossing death! Come, bitter conduct; come, unsavory guide! Thou desparate pilot, now at once run on The dashing rocks thy seasick weary bark!\"  \"Here's to my love  O true Apothecary.\"  \"Thy drugs are quick. Thus with a kiss I die.\"  (heartbroken, testing her  I am done with theatre. The playhouse is for dreamers. Look where the dream has brought us.  I have hurt you and I am sorry for it.          How does it?  You will never age for me, nor fade, nor die.  Good bye, my love, a thousand times good bye.     My story starts at seaa perilous voyage to an unknown landa shipwreck  the wild waters roar and heavethe brave vessel is dashed all to pieces, and all the helpless souls within her drowned     all save one  a lady  whose soul is greater than the ocean  and her spirit stronger than the sea's embrace  not for her watery end, but a new life beginning on a stranger shore  It will be a love story  for she will be my heroine for all time     and her name will be  Viola.",
        "Shakespeare": "",
        "Lambert": "Bitten, Mr. Fennyman.  I think I've seen it. I didn't like it.",
        "Kempe": "Crab is nervous. He has never played the Palace. When will you write me a tragedy, Will? I could do it.",
        "Hugh": "",
        "Fennyman": "What am I, Mr. Lambert?  How badly bitten, Mr. Frees?  When?  Take his feet out. Where will you get  including interest in three weeks?  Put his feet in.  Cut his nose off.  And his ears.    What's the title?  Good title.  A play takes time. Find actors rehearsalslet's say open in three weeks. That's--what--five hundred groundlings at tuppence each, in addition four hundred groundlings tuppence each, in addition four hundred backsides at three pence--a penny extra for a cushion, call it two hundred cushions, say two performance for safety how much is that Mr. Frees?  Correct!  A share of the profits.  Of course not!  Sign here.  Romeo and Ethel The Pirate's DaughterAlmost finished?  This time we take your boots off!  The theatres are all closed by the plague!  by order of the Master of the Revels!  So what do we do?  How?  Yes I heard.  Where is the play?  Is it going well?  But nothing is happening.  Who is that?  Who is this?  A moment, sir!      I saw his Tamburlaine, you know. Wonderful.  Of course, it was mighty writing. There is no one like Marlowe  Cease your prattling! Get out! A thousand apologies!        Henslowe, you pound of tripe, in my business I would be out of business if I had your courage, so don't tell me about business   (and grabbing a RADDLED    Master Kent! You have not dipped your wick?    I am to be in your play.  Mr. Shakespeare has given me the part of the Apothecary!  That's me.  Sad and wonderful! I have a blue velvet cap which will do well, I have seen apothecary with a cap just so.  \"Such mortal drugs I have but Mantua's law Is death to any he that utters them.\" Then him. Then me.  \"Such mortal drugs I have\" What is it? What is it?  Everything all right?      Kill him!   Is this all right?  \"Such mortal drugs I have but Mantua's Law Is death to any he that utters them.\" Then him. Then me.  \"Such mortal drugs I have but Mantua's law is death to any he that utters them!\"  \"My poverty but not my will consents.\"",
        "Richard": "",
        "Burbage": "There is no dog in the first scene, Will Kempe, thank you. How goes it Will?  Not from me. I only stole it. When are you coming over to the Chamberlain's Men?  Are you writing?  What is the chief part?  The title?  I will play him. Bring it tomorrow.  How much?  You're a liar.  Ned is wrong for it.    The Queen has commanded, she loves a comedy and the Master of the Revels favours us.  Ask him.              Will!  And where are my pages . . .     Who's there?     Kit!     What do you want, Kit?  You have the last act?  Tomorrow.  Wait! Will you desist!  What is money to me like us? Besides, if I need a play, I have another waiting, a comedy by Shakespeare.  Never!  I gave Shakespeare two sovereigns for Romeo!  Treachery!  Traitor and thief!  Where is that thieving hack who can't keep his pen in his own ink pot!?    That can wait. The Master of the Revels despises us for vagrants, tinkers, and peddlers of bombast. But my father, James Burbage, had the first licence to make a company of players from Her Majesty, and he drew from poets the literature of the age. Their fame will be our fame. So let them all know, we are men of parts. We are a brotherhood, and we will be a profession. Will Shakespeare has a play. I have a theatre. The Curtain is yours.     We will all be put in the clink.  Arrest who, Mr. Tilney?  Contempt? You closed the Rose--I have not opened it.",
        "Henry": "",
        "Condell": "\"Cease to persuade, my loving Proteus; Home-keeping youth have ever homely wits\"      \"What light is light if Silvia be not seen? What joy is joy, if Silvia be not by? Unless it be to think that she is by And feed upon the shadow of perfection\"",
        "Philip": "\"Nurse, where is my daughter? Call her forth to me.\"",
        "Henslowe": "Aaagh! I can pay you!  Two weeks, three at the most, Aaaagh! For pity's sake.  I have a wonderful new play!  It's a comedy.  A new comedy. By Will Shakespeare!  And a share. We will be partners, Mr. Fennyman!  It's a crowd-tickler--mistaken identities, a shipwreck, a pirate king, a bit with a dog, and love triumphant.  This time it is by Shakespeare.  Romeo and Ethel the Pirate's Daughter.  But I have to pay the actors and the authors.  There's never any    Without doubt he is completing it at this very moment.  Will! Where is my play? Tell me you have it nearly done! Tell me you have it started. You have begun?  No, no, we haven't the time. Talk prose. Where is my play?  God be praised! Locked?    Aphrodite Baggot who does it behind the Dog and Trumpet?  Well, I am a dead man and buggered to boot. My theatre is close by the plague these twelve weeks, my company is playing the inn-yards of England, while Burbage and the Chamberlain's Men are invited to court and receive ten pounds to play your piece, written for my theatre, by my writer, at my risk when you were green and grateful -  No--it's comedy they want, Will! Comedy! Like Romeo and Ethel?  Nobody! You are writing it for me! I gave you three pounds a month since.  . . . Will! What is money to you and me? I, your patron, you my wordwright! When the plague lifts Burbage will have a new Christopher Marlowe for the Curtain and I have nothing for the Rose.    Cut out my heart! Throw my liver to the dogs!  Where are you going?  Now where? Will?    And what favour does Mr. Tilney receive from you?  Is it about a pirate's daughter?  You see? Comedy.  Love and a bit with a dog, that's what they like.  There's a lady knows your play by heart.  What have I done, Mr. Fennyman?  Oh, that.  Mr. Fennyman, let me explain about the theatre business. The natural condition is one of insurmountable obstacles on the road to imminent disaster. Believe me, to be close by the plague is a bagatelle in the ups and downs of owning a theatre.  Nothing. Strangely enough , it all turns out well.  I don't know. It's a mystery.    Oh, it's coming, it's coming.  Will! The theatres are  Rosaline? You mean Ethel.  Yes, I heard. The theatres are open. But where is my playwright?  Chalk it up, Nol. I'm hungry, too.  Will! Have you finished?  Ned Alleyn and the Admiral's Men are out on tour. I need actors. Those here who are unknown will have a chance to be known.  It won't cost you a penny! Auditions in half-an-hour!  Ralph Bashford! I'd have a part for you but, alas, I hear you are a drunkard's drunkard.  Thank you.  How refreshing.        Well, I to my work, you to yours. When can I see pages?  It starts well, and then it's all long- faced about some Rosaline. Where's the comedy, Will. Where's the dog? Do you think it is funny?  We are at least four acts short, Will, if you are looking for disaster.  Very well.  Yes, but very well.  Nobody. The author.  It is customary to make a little speech on the first day. It does no harm and authors like it.  Is it?    The one who came with your letter?  Juliet? You mean Ethel.  A sonnet? You mean a play.      Not with my props!  We need that for the balcony scene!    I want no more trouble, Mr. Fennyman. As I explained to you, the theatre business  The Apothecary? Will, what is the story? Where is the shipwreck? How does the comedy end?  By God, Will, if you do not, who does? Let us have pirates, clowns, and a happy ending, or we will send you back to Stratford to your wife!  Well, that will have them rolling in the aisles.  The bill! Oh, vanity, vanity!  Mr. Tilney, what is this?  What?!  Why so?  He's a woman!       Will!  We'll be needing a Romeo  No, it will turn out well.  I don't know, it's a mystery.  Another little problem.  The show must  you know  Juliet does not come on for twenty pages. It will be all right.  I don't know. It's a mystery.  Can we talk?    it will be all right, madam.  Who are you?  Do you know it?",
        "Queen": "Well played, Master Crab, I commend you.  Stand up straight, girl.  I have seen you. You are the one who comes to all the plays--at Whitehall, at Richmond.  What do you love so much?  Speak out! I know who I am. Do you love stories of kings and queens? Feats of arms? Or is it courtly love?    And--?  Above Lord Wessex?    But playwrights teach nothing about love, they make it pretty, they make it comical, or they make it lust. They cannot make it true.  I thought you were here because you had none.    Fifty pounds! A very worthy sum on a very worthy question. Can a play show us the very truth and nature of love? I bear witness to the wager, and will be the judge of it as occasion arises. I have not seen anything to settle it yet. So--the fireworks will be soothing after the excitements of Lady Viola's audience. Have her then, but you are a lordly fool. She has been plucked since I saw her last, and not by you. It takes a woman to know it.  Have a care with my name, you will wear it out.  The Queen of England does not attend exhibitions of public lewdness so something is out of joint. Come here, Master Kent. Let me look at you.  Yes, the illusion is remarkable and your error, Mr. Tilney, easily forgiven, but I know something of a woman in a man's profession, yes, by God, I do know about that. That is enough from you, Maser Kent. If only Lord Wessex were here.  There was a wager, I rememberas to whether a play can show the very truth and nature of love. I think you lost it today. You are an eager boy. Did you like the play?  Master Shakespeare. Next time to you come to Greenwich, Come as yourself and we will speak some more. WILL bows deeply. The QUEEN turns to leave. The waves part for her.  Why, Lord Wessex! Lost your wife so soon?  As stories must when love's denied--with tears and a journey. Those whom God has joined in marriage, not even I can put asunder.     Give it to Master Kent. He will see it rightfully home. WESSEX gives his purse to VIOLA.    Too late, too late.",
        "Elizabeth": "",
        "Dr.": "And yet you tell me you lie with women?  Black Sue, Fat Phoebe, Rosaline, Burbage's seamstress; Aphrodite, who does it behind the Dog and  I am here to help you. Tell me in your own words.  Interesting.  Most interesting.    How long has it been?  No, no. You have a wife, children  A woman of property?  And your relations?  No, your marriage bed.  So now you are free to love  Here is a bangle found in Psyche's temple on Olympus cheap at four pence. Write your name on a paper and feed it in the snake.  The woman who wears the snake will dream of you, and your gift will return. Words will flow like a river. I will see you in a week.",
        "Moth": "And yet you tell me you lie with women?  Black Sue, Fat Phoebe, Rosaline, Burbage's seamstress; Aphrodite, who does it behind the Dog and  I am here to help you. Tell me in your own words.  Interesting.  Most interesting.    How long has it been?  No, no. You have a wife, children  A woman of property?  And your relations?  No, your marriage bed.  So now you are free to love  Here is a bangle found in Psyche's temple on Olympus cheap at four pence. Write your name on a paper and feed it in the snake.  The woman who wears the snake will dream of you, and your gift will return. Words will flow like a river. I will see you in a week.",
        "Rosaline": "When will you write me a sonnet, Will?  You left it in my bed. Come to look for it again.  Burbage has my keeping but you have my heart.  Will!"
    },
    "imdb_rating": "7.1",
    "description": "William Shakespeare (Joseph Fiennes) is a known but struggling poet, playwright, and actor, who not only has sold his next play to both Philip Henslowe (Geoffrey Rush) and Richard Burbage (Martin Clunes), but now faces a far more difficult problem: he is bereft of ideas and has yet to begin writing. He is in search of his muse, the woman who will inspire him but all attempts fail him until he meets the beautiful Viola De Lesseps (Gwyneth Paltrow). She loves the theatre and would like nothing more than to take to the stage, but is forbidden from doing so as only men can be actors. She is also a great admirer of Shakespeare's works. Dressing as a man, and going by the name of \"Thomas Kent\", she auditions and is ideal for a part in his next play. Shakespeare soon sees through her disguise and they begin a love affair, one they know cannot end happily for them as he is already married and she has been promised to the dour Lord Wessex (Colin Firth). As the company rehearses his new play, William and Viola's love is transferred to the written page leading to the masterpiece that is Romeo and Juliet.—garykmcd",
    "name": "Shakespeare in Love",
    "genres": [
        "Comedy",
        "Drama",
        "History"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BM2ZkNjM5MjEtNTBlMC00OTI5LTgyYmEtZDljMzNmNzhiNzY0XkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_QL75_UY281_CR4,0,190,281_.jpg"
}