{
    "filename": "Shrek-the-Third_script.txt",
    "imdb_id": "tt0413267",
    "imdb_url": "https://www.imdb.com/title/tt0413267",
    "characters": [
        "Captain Hook (voice)",
        "Artie (voice)",
        "Pinocchio /Three Pigs (voice)",
        "King (voice)",
        "Shrek (voice)",
        "Princess Fiona (voice)",
        "Lancelot (voice)",
        "Evil Queen (voice)",
        "Prince Charming (voice)",
        "Merlin (voice)",
        "Queen (voice)",
        "Donkey (voice)",
        "Blind Mice /Heckler /Evil Tree #2 /Guard #2 (voice)",
        "Doris (voice)",
        "Puss in Boots (voice)"
    ],
    "dialogues": {
        "Artie": "Please don't eat me.  What? Shrek the Third - Final Screening Script 42.  Is this for real?  So wait, I'm really the only heir?  Give me just a second.  My good people, I think there's a lesson here for all of us. Maybe the next time you're about to dunk a kid's head in a chamber pot, you'll stop and think, hey, maybe this guy has feelings. Maybe I should cut him some slack. Because maybe, just maybe... this guy's gonna turn out to be, uh...I dunno...a King! And maybe his first royal decree will be to banish everyone who ever picked on him -- that's right, I'm looking at you, jousting team. Shrek the Third - Final Screening Script 43.  And Gwen... oh Gwen. I've always loved you.  Well good friends, it breaks my heart, but, enjoy your stay here in prison while I rule the free world baby!  I'm building my city people! On Rock and Roll!  Ow!  I can't believe it... me a King? I...I mean I knew I came from royalty and all, but I just figured everyone forgot about me.  Really? Wow! Look, I know it's not all gonna be fun and games.  Boat with the bottle? Any idiot can hit a boat with a bottle.  Whoa!! This is gonna be huge. Parties, princesses, castles... princesses.  )  Poisoned?  Body guards?  Really?  What does it look like?! Shrek the Third - Final Screening Script 58.  But I don't know anything about being King!  Sorry to disappoint you, but I'm going back!  Look what I did? Who's holding the wheel chief?  Oh, so now it's \"Your highness?\" What happened to \"loser?\" Huh?  What?    Far Far Away... from you!   C'mon! C'mon! Help! Help! Hello?  Mr. Merlin?  Yeah. He was the school's magic teacher until he had his nervous breakdown.  What's with the \"we\"? Who said I was going with you?  If it's such a great job, why don't you do it?  Oh, so that was your \"Mr. Nice Guy?\"  You know what? Why don't you go terrorize a village and leave me alone?  This is lame.  Ow!  Okay. There's a baby bird and a father bird sitting in a nest.  Wait, the dad just flew away. Why did he leave the little bird all alone?  It's trying to fly, but it doesn't know how to. It.. it's gonna fall!  Yeah, yeah, okay. I get it. The bird's me. My dad left. So what?  I know you want me to be king, but I can't. I'm not cut out for it and I never will be, alright?  Even my own dad knew I wasn't worth the trouble. He dumped me at that school the first chance he got and I never heard from him again. Shrek the Third - Final Screening Script 68.  Well, I doubt he was worse than mine.  Okay... I guess that's... pretty bad.  You know, you're okay, Shrek.  You just need to do a little less yelling and use a little more soap. Shrek the Third - Final Screening Script 69.  The soap's because you stink. Really bad.  Ow!  Help! Shrek the Third - Final Screening Script 75.  No, Shrek. Hold on a second. I've got an idea.  Mr. Merlin, they need a spell to get them...I mean, us, back to Far Far Away.  Mr. Merlin please. I know you can   It's just so hard. You know? They really need to get back `cause their kingdom's in trouble `cause there's a really bad man and it's just so hard...  No! I don't think you understand! There's a mean person doing mean things to good people-  And they really need your help to get them back! So why won't you help them?  Piece of cake. Shrek the Third - Final Screening Script 78.    Look, don't you know who he thinks he is? How dare you?  He's a star people! Hello?! I'm so sorry about this Mr. Shrek.  I assume you have everything ready for tonight! You did get the list for the dressing room? Shrek the Third - Final Screening Script 85.  Ow.  It's Artie, actually.  Then who's it about? I'm supposed to be King, right?  But you said the King asked for me personally.  What's that supposed to mean?  You were playing me the whole time.  You know, for a minute there, I actually thought you -  Oh please, don't act so innocent. You both knew what was going on the whole time and you kept it to yourself. Shrek the Third - Final Screening Script 101.  It's not? I think it seems pretty clear. He was using me. That's all there is to it.  Everybody stop!  Who really thinks we need to settle things this way?  You're telling me you just want to be Villains your whole lives? Shrek the Third - Final Screening Script 110.  Didn't you ever wish you could be something else?  Okay, fair enough. You're right. I'm not a talking tree. But, ya know, a good friend of mine once told me that just because people treat you like a villain, or an ogre...  ... or just some loser...  ...it doesn't mean you are one. Shrek the Third - Final Screening Script 111.  The thing that matters most is what you think of yourself.  If there's something you really want, or there's someone you really want to be, then the only person standing in your way ...is you.  No, no, no! What I mean is: each of you is standing in your own way!",
        "(voice)": "",
        "King": "I'm dying. Shrek the Third - Final Screening Script 15.  Don't forget to pay the gardener, Lillian.  Fiona...  I know I've made many mistakes with you.  But your love for Shrek has taught me so much.  My dear boy, I am proud to call you my son.  Now, there is a matter of business to attend tooo...  Shrek, please come hither.  This Kingdom needs a new king. You and Fiona are next in line for the throne.  Aside from you there is only one remaining heir.  His name is... is... is...  ...is ... Shrek the Third - Final Screening Script 17.   His name is Arthur.",
        "Shrek": "Good morning.    \"To you!\" \"And you!\" And you!  Not fast enough.  Great! Let's get started.  I knight thee...  He-he. Ooh.  I'm Shrek, you twit.  I don't know how much longer I can keep this up Fiona.  Yeah.  Ah. Come here, you.  Oh, my butt is itching up a storm and I can't reach it in this monkey suit!  Oh. Hey you. Come here!  What's your name? Shrek the Third - Final Screening Script 10.  Hoo hoo hooo. Perfect.  You've done it. Oh, a little over to the left, yeah. That's great.  Ahh! All right, you got it...Oh yeah, you're on it. Oh that's it! Oh that's good!  Oh yeah! Scratch that thing! You got it. You're on it. That's great!      Fiona!  Are you okay?     That's it! We're leaving!  Calm down? Who do you think we're kidding? I am an ogre! I'm not cut out for this, Fiona and I never will be.  Donkey!  Oh, you had me at \"vermin-filled.\"    Donkey?  Yeah?  Oh.  Honey? Let's try and be rational about this. Have you seen a baby lately? They just eat and poop and they cry and then they cry when they poop and they poop when they cry...Now, imagine an ogre baby. They extra cry and they extra poop.  Right now, you're my family.  Well, somebody better be dying.  And I'm proud to call you my Frog... King Dad in-law.  Yeah, Dad?  Ooo. Next in line. Now you see Dad, that's why people love you. Even on your deathbed you're still making jokes.  Oh, come on Dad...an Ogre as King? I don't think that's such a good idea. There's got to be somebody else. Anybody?  Really!? Who is he, Dad?  What's his name? What's his name?  Arthur?  Dad? Dad? Dad?  Oh, c'mon, there's no way I could ever run a kingdom. That's why your cousin Arthur's the perfect choice.  And if he gives me any trouble, I've always got persuasion and reason.  Here's persuasion,  and here's reason.  Fiona, soon it's just gonna be you and me and our swamp.  It will be. I promise. I love you.  Yeah?  What is it?    You're what?!  (doesn't want to believe    Yeah... Me too... you...  Ahhh. Home.  Woohoo!  Ahh.  Ooo.  Fiona!  Fiona? Shrek the Third - Final Screening Script 28.  Huh? Oh no.    No, no, no, no, no, no. Ha, ha. It's okay. It's gonna be alright.  Hey! Hey, hey, wait! Would ya? No, no. Stop! Hey, hey, hey. No. Shrek the Third - Final Screening Script 29.     Huh?  Ahhhh! Oh, Donkey! Donkey, wake- up! Shrek the Third - Final Screening Script 30.  Ahhhh!  Oh... I can't believe I'm going to be a father.  How did this happen?  I know how it happened. I just can't believe it.  Donkey, can you just cut to the part where you're supposed to make me feel better?  It's not my life I'm worried about ruining. It's the kid's.  I mean...when have you ever heard the phrase \"as sweet as an...ogre\" or \"as nurturing as...an ogre\" Or how `bout...\"you're gonna' love my dad...he's a real ogre.\" Shrek the Third - Final Screening Script 32.  That's true.  I'm doomed.  It's Worcestershire.  Well, my stomach aches and my palms just got sweaty. Must be a high school.  Pardon me...  Hi, we're looking for someone named-  I know you're busy \"not fitting in\" but can either of you tell me where I can find Arthur?  Strong, handsome, face of a leader. Does Arthur look like a King or what?  Oh. Sorry.  Greetings your majesty. This is your lucky day.  Oh, ho, ho, ho. Giant mutant leprechaun... You made a funny.  Stop squirming, Arthur.  Hey!  Uh, excuse me?  Oh Arthur! Come out, come out wherever you are...   We're here for the Mascot Contest too.       That's right. I'm the new mascot. So let's really try and beat the other guys... at whatever it is they're doing.  Now, where can I find Arthur Pendragon? Shrek the Third - Final Screening Script 41.  I'm not here to eat him.  It's time to pack up your toothbrush and jammies. You're the new King of Far Far Away.  Absolutely. Now clean out your locker, kid. You've got a kingdom to run.  The one and only.  Alright, let's not overdo it.  You just overdid it.  Oh no, in fact, the King asked for you personally.  It really is all fun and games, actually. Sure, you have to knight a few heroes, launch a ship or two. By the way, make sure you hit the boat just right with the bottle.  Well, I've heard it's harder than it looks.  Or too salty!  Oh! Festering sores! Hey, you are one funny kitty cat.  We don't want Artie here getting the wrong idea.  Uh, Artie?  Artie!  What are you doing?!  This really isn't up to you!  You'll learn on the job!  Back to what? Being a loser?!  Now look what you did!  Oh, nice going, Your Highness.  Hey, if you think this is getting you out of anything, well it isn't. We're heading back to Far Far Away one way or another, and you're gonna be a father!  You're... I said king. You're gonna be King!  Where do you think you're going?  You get back here young man and I mean it!  Oh c'mon, now why would I do that? Besides, he'll be ten times better at it than me.  You're right, Donkey.  What about this? Shrek the Third - Final Screening Script 61.  Oh c'mon. It's just a joke. Still...  Listen Artie...  If you think this whole mad scene ain't dope, I feel you dude. I mean, I'm not trying to get up in your grill or raise your roof or whatever, but what I am screaming is, yo, check out this kazing thazing bazaby.  I mean, if it doesn't groove or what I'm saying ain't straight trippin', just say, oh no you didn't, you know, you're gettin' on my last nerve. And then I'll know it's... then I'll know it's whack-- Shrek the Third - Final Screening Script 62.  Artie! Wait!  You know this guy?  Uh, no.  Oh, thanks, I just ate a boulder on the way in. What we need are directions back to Far Far Away.  Oh, I did. Cause there's a lot of people counting on you so don't try and weasel out of it.  Understand this kid, it's no more Mr. Nice Guy from here on out!  I know, and I'm gonna miss him.  Oh, is that some kind of crack about ogres? You get your royal highness to Far Far Away before I kick it there. Now which way am I kicking?  Self-destructive ra... Look, are you gonna help us or not? Shrek the Third - Final Screening Script 65.  Yeah, I don't think so.  Alright, alright... journey to the soul...  I see a rainbow pony. Shrek the Third - Final Screening Script 66.    I know what it's like to not feel ready for something.  Even ogres get scared...you know, once in a while.  My dad wasn't really the fatherly type either.  Oh yeah? My father was an ogre. He tried to eat me.  Now, I guess I should have seen it coming. He used to give me a bath in barbecue sauce and put me to bed with an apple in my mouth.  You know, it may be hard to believe what with my obvious charm and good looks, but people used to think that I was a monster. And for a long time, I believed them.  But after awhile, you learn to ignore the names that people call you and you just trust who you are.  Thanks Artie.  Yeah. I got that.  \"King Charming?\"  Artie, Duck! Shrek the Third - Final Screening Script 74.  What has Charming done with Fiona?  Get yourself back to Worcestershire, kid. Shrek the Third - Final Screening Script 76.  Oh, have a heart old man!  Well, well, well. You want some eggs with that ham?  Look, if Artie trusts him, that's good enough for me. Even if his robe doesn't quite cover his-  Donkey?  Don't be! You got us back kid.  Pinocchio? Shrek the Third - Final Screening Script 82.  Pinocchio!  What's happened?  She's what?! She's what!?  (turns to Puss in Donkey's  Quick, Pinocchio. Where is Fiona?  Wait, wait, wait! Pinocchio! What show?  Shrek's final performance.  Well I guess I've been so busy I forgot to mention it! Shrek the Third - Final Screening Script 84.  Donkey, we're dealing with amateurs.  I'm gonna lose it!  I just lost it!  Break a leg. Or, on second thought, let me break it for you.  Where's Fiona?  Charming, stop! I'm here now, you got what you wanted. This isn't about him. Shrek the Third - Final Screening Script 89.  You weren't really next in line for the throne, okay? I was.  Not exactly.  Look, I said whatever I had to say, alright! I wasn't right for the job, I just needed some fool to replace me, and you fit the bill. So just go!  You catch on real fast kid... Maybe you're not as big of a loser as I thought.  Oww, easy.  Huh?  Well... she's got your eye.  Oh boy.  Well it can't be anymore painful than the lousy performance you're giving.  Oooh, if you don't mind could you kill me, and then sing? Shrek the Third - Final Screening Script 106.  Oh, come on, I'm just havin' fun with ya. That's actually a very nice leotard.  Do they come in men's sizes?  Much better, now that you're here.  So Charming, you wanna let me out of these so we can settle this ogre to man?  Fiona! Shrek the Third - Final Screening Script 109.  Artie?  Ah-hem.  You need to work on your aim. Shrek the Third - Final Screening Script 113.  Well I guess you need to keep looking...  ...cause I'm not giving up mine.  It's yours if you want it, you know, but this time it's your choice.  What'd I tell ya? I think the kid's going to be a great King.  I have something much more important in mind.  Ah, finally.  Well, what shall we do now?",
        "Lancelot": "I am Lancelot.  That dork over there is Arthur!  Aaah. Shrek the Third - Final Screening Script 38.  Classic.  I didn't do it. They did.  Artie a King? More like the Mayor of Loserville.  Burn.",
        "Merlin": "I knew I should of gotten that warranty! Shrek the Third - Final Screening Script 63.  AHH! Ow, ow, ow, ow, ow.  Uh, technically I was merely a victim of a level three fatigue, and at the request of my therapist and the school authorities, I have retired to the tranquility of nature to discover my divine purpose.  Now, can I interest anyone in a snack or beverage?  Sure you don't wanna try my famous rock au-gratin?  It's organic!  Oh, I could tell you. But since you're in the midst of self- destructive rage spiral it would be karmic-ly irresponsible.  Most definitely, but only after you take the journey to your soul.  Look pal, it's either that or some primal scream therapy. Ahhhhhhhhhh!      Now all of you, look into the \"Fire of Truth\" and tell me what you see! Yah! Ha!  Woo-looo-looo-looo!  Okay. Monster, go for it.  Excellent work! Now! The boy!  You're lame! Now just go for it.  Yes! Stay with it! Stay with it!  Whew, proper head case you are, aren't you? Really messed up. Whoa. Shrek the Third - Final Screening Script 67.   Just thought I might help set the mood! Y'know for your big heart to heart chat!         I said, forget it!  Mumble, grumble, interrupt my healing. Mumble, mumble. Shrek the Third - Final Screening Script 77.  Oh. What, what's with you?  C'mon, take it easy.  Oh.  Uh, Okay... I'll go and get my things.  Now, I am a little rusty, so there could be some side effects.  Don't worry, whatever it is, no matter how excruciatingly painful it may be, it'll wear off eventually... I think.  Oops.  Alacraticious expeditious, a zoomy zoom zoom. Let's help our friends get back, um... soon!  Woah! It worked!  Uh, excuse me, that's my seat.  Uh... alright, alright...look..  You're gonna feel a little pinch, and possibly some lower intestinal discomfort, but this should do the trick.  Oops. Ah, never mind.",
        "Queen": "Harold.  Of course darling.  Harold!?  Oh, what's it to you?  Pretty unfair.  Quickly ladies!  Ladies, let go of your petty complaints and let's work together.  And you should all care too.  Hmmm. Excuse me. Old lady coming through.  Hiiiyyyiiiaaaah! Shrek the Third - Final Screening Script 94.  Well, you didn't actually think you got your fighting skills from your father, did you?  Hmmmm.  Hiiiiyah!  I`d like to open up a spa in France.  Bouncy, bouncy, bouncy boy.",
        "Donkey": "Oh, they grow up so fast.  C'mon, lazy bones, time to get movin'!  Aaahhh! You know you really need to get yourself a pair of jammies.  Well, since you're filling in for one, you might as well look like a real King. Can somebody come in here and work on Shrek please?  Oh!  Smiles everyone, smiles! Shrek the Third - Final Screening Script 9.  Ow!! My eye! My eye! Shrek the Third - Final Screening Script 11.  Oh! Shrimp! My favorite. Shrek the Third - Final Screening Script 12.  I think that went pretty well.  Aww, come on now Shrek! Shrek the Third - Final Screening Script 13.    Do your thing, man.  I know, I know... I don't want to leave you either baby, but you know how Shrek is. The dude's lost without me.  But don't worry. I'll send you airmail kisses everyday!  Alright, be strong babies! Be strong. Now, Coco, Peanut, you listen to Mama, alright? And Bananas, no more roastin' marshmallows on your sister's head. Shrek the Third - Final Screening Script 24.  Ah, that's my special boy. Oh, come over here, all of you. Give your Daddy a big hug!  Bye bye babies!  I'm gonna be an Uncle. I'm gonna be an Uncle! I'm gonna be an Uncle!   Da-da!  Shrek. Shrek, are you okay?  How does it happen?     Little boy blue and the man in the moon.  \"When you coming home, son?\" \"I don't know when, But we'll get together then, Dad-\"  Man, don't you listen to him. Having a baby is not going to ruin your life.  Okay, okay I get it! Nobody said it was going to be easy. But at least you got us to help you out.  You'll be fine.  Wor-ces-ter-shireee. Now that sounds fancy.  Like the sauce!? Mmmm... It's spicy!  Oohh! They must be expecting us. Shrek the Third - Final Screening Script 33.  What in the shista-shire kind of place is this?  High school?!  I'm already starting to feel nauseous from memories of wedgies and swirlies!  Let's just say some things are better left unsaid and leave it at that.  It's top secret, hushity hush.  Yeah, you better run, you little punk no good-niks, `cause the days of \"Little Donkey Dumpy Drawers\" are over!  Or this?  Now watch this.... Shrek the Third - Final Screening Script 40.  You should be ashamed of yourself.  It's gonna be great, Artie. You'll be living in the lap of luxury. They got the finest chefs around waiting for you to place your order.    Just make sure they don't die of famine.  Oh, plague is bad. Shrek the Third - Final Screening Script 57.  Whoaaa!    A-hem. You just said father...  When were you planning on telling him that you were really supposed to be King?  Hey, woah ho ho, Shrek. Then you're gonna have to change your tactics if you want to get anywhere with this kid.  Shrek!   Ooo! Charades! Okay, I see a dutch fudge torte with cinnamon swirls.  Ahhh!  Look out! They've got a piano!  Ahhh!  Shrek!  But she's so far far away!  Side effects!?  Ah!  Are you sure this is a good idea?     Oh man, I haven't been on a trip like that since college.   What? Is there something in my teeth?   Huh? What the? Oh no!   I've been abracadabra'd into a fancy feasting second rate sidekick.   Yeah, and you should think about getting yourself a pair of pants! I feel all exposed and nasty.   Oh, so you two think this is funny?   Ow, ow, ow, ow, ow. How in the Hans Christian Andersen am I supposed to parade around in these goofy boots?   Oh, you'll learn to control that.  Seriously man, you need some comfort inserts or arch supports or something.  Woah!  C'mon Puss, you heard the man, help a brother out.   Hold on a second. Shrek the Third - Final Screening Script 83.   Aha!   Whoa, Shrek! You didn't tell us you were in a play.   Yeah, the breakfast croissants stuffed with seared sashimi tuna. Oh, and please tell me you at least have the saffron corn with the jalapeno honey butter cause our client cannot get into his proper emotional state without his jalapeno honey butter.   Yeah, and I have your badge number,   Princess?!   And I'm me!   I know, I know. Everything's a little fruity in the loops right now. But what happened is, we went to high school, the boat crashed, and we got \"bippity-bopity-booped\" by the \"Magic Man.\"  Charming's got him, Princess. And he plans on killing Shrek tonight in front of the whole kingdom.  Whoa.   My babies!   Hey!   All right people, let's do this thing! Go Team Dy-No-Mite!!  Alright! Alright! Alright! From henceforth we are to be known as \"Team Alpha Super Awesome Cool Dynomite Wolf Squadron.\"   Artie!   Artie, it's not like it seems.   Using you? Man, you really don't get it!   Charming was going to kill you Artie. Shrek saved your life.   Pray for mercy from...   And Donkey!   Although I have been enjoying these \"cat baths.\"  I'm me again! Shrek the Third - Final Screening Script 115.  Alright!  Hey! I smell Shrek Jr. Shrek the Third - Final Screening Script 117.  Peek-a-boo. Peek-a-boo.  Hey.",
        "Doris": "Will you look at that!  She's right. A baby is only gonna strengthen the love that Shrek and Fiona have. How did Shrek react when you told him? Tell me!  I know he's a jerk and everything, but I gotta admit, that Charming makes me hotter than July.  You poor sweet things.  Hey. How's it going?"
    },
    "imdb_rating": "6.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BOTgyMjc3ODk2MV5BMl5BanBnXkFtZTcwMjY0MjEzMw@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "When King Harold (John Cleese) of Far, Far Away dies, the clumsy Shrek (Mike Myers) becomes the immediate successor of the throne. However, Shrek decides to find the legitimate heir Artie (Justin Timberlake) in a distant kingdom with his friends Donkey (Eddie Murphy) and Puss in Boots (Antonio Banderas) to be able return to his beloved house in the swamp with the pregnant Fiona (Cameron Diaz). Meanwhile, the envious and ambitious Prince Charming (Rupert Everett) joins the villains of the fairytales plotting a coup d'état to become the new King.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "name": "Shrek the Third",
    "genres": [
        "Animation",
        "Adventure",
        "Comedy"
    ]
}