{
    "filename": "Sicario_script.txt",
    "imdb_id": "tt3397884",
    "imdb_url": "https://www.imdb.com/title/tt3397884",
    "characters": [
        "Manuel Diaz",
        "Guillermo",
        "Phil Coopers",
        "Rafael (as Raoul Trujillo)",
        "Silvio (as Maximiliano Hernandez)",
        "Fausto Alarcon",
        "Matt Graver",
        "Burnett",
        "Ted",
        "Dave Jennings",
        "Steve Forsing",
        "Reggie Wayne",
        "Silvio's Wife",
        "Alejandro",
        "Kate Macer"
    ],
    "dialogues": {
        "Manuel": "What the fuck. Want to bribe me, eh.  This mother fucker...  You know who I am? HUH??  Who was he?  You know... who .. The.. I AM A  Soy Manuel Diaz.  What happens when we get to the house?  What will happen to me?  You think you are so different?",
        "Diaz": "",
        "Guillermo": "El Medellin.",
        "Phil": "Looks like Sinaloa...  Would you step in here, Kate?  Thank you Kate, if you could wait outside, please.  Will you come in, Kate?  You'll act as a liaison.  State Department is pulling an agent from the field that specializes in responding to escalated cartel activity. You'll meet up with them... at Luke, Tomorrow?  Advisors like Matt come in, stir the pot, cause these criminals to react and make mistakes. That's how we build cases against the individuals that actually make a difference in this fight. When they're nervous, when they stop trusting their crews, when they move their money... these are all opportunities to strike... that's the purpose of contractors like Matt.",
        "Coopers": "",
        "Fausto": "He'll kill you. Stay still.  No.  I take shame.  I love me more. I'm sorry.",
        "Alarcon": "",
        "Matt": "What do you know about his brother?  Guillermo... Mexican police are holding him in Juarez. What do you know about his cousin?  Number three in the Sinaloa Cartel.  Loose lips sink ships, Kate.  You married?  Husband?  Kids?  We're expanding the scope of the investigation.  Day after. Early.  Gonna go see Guillermo.  That's the one.  Our objective is to dramatically overreact.  He's a little green. You've been kicking doors longer.  Makes you feel better to have him around, he can tag along after we get back from El Paso.  The men who are REALLY responsible.  We'll get to that...  Don't want anything to happen to you on the way to the airport.  To keep my promise.  Doesn't matter. It leads to Fausto. And I'm going to turn you loose.  Kate.  This way.  No. We just landed.  This is my bird dog, his name's Alejandro.  Yeah, we'll talk about it on the plane.  Yeah.  You guys don't have one?  They got some bitchin peanuts in the back. Kind of a self-serve deal though.  Good. Trying to get DOD to let me look into this conspiracy to sink Figi.  I figure a month or two there, I could get it worked out.  Yeah, I'll keep you posted... who's going over today?  I get all warm and fuzzy when you say `team'.  Where's everybody linking up?  Thought you were in the big time in Phoenix... welcome to Baghdad.  Man, I love Texans.  Sure, we'll take the tour. Loan me a couple of pop guns?  I will be by the time we get there.  I miss your hospitality, Keith.  Guess we're going sightseeing.  See if this fits.  Try it on.  He's a DOD advisor, just like me.  Pay attention to Alejandro -- he says do something, do it.  Fine. Stay here.  But you don't want to, do you?  You asked to get on this train. Because you KNOW you're not stopping anything in Phoenix. You're just sweeping up the mess. In six months, every house you raid will be rigged with explosives... You want to find the men responsible? This is where we start.  Yeah. That got a little nutty, huh?  Hey. I told you to stay here...  Don't sell yourself short. Reason Reggie's home is I know he's not ready for this, but he's gonna have to get ready real quick, because this is the future. Juarez is what happens when they dig in...  On that note, I think you better stay out here.  Giving him a belly full of water... you devil.  Didn't think we'd get you here, did you?  I love it when they don't hablo. Brought an old buddy of yours. Bet you `hablo' to him.  Alejandro, he remembers you.  Can they get them all in one place? No... I'm on a clock now, I can't wait... No, contact Bob Fiske. Have him hold all of them at the staging center. How far is Tuscon?  We'll be there a little after 2.  You gotta learn how to sleep on a plane.  Has nothing to do with your race. I just don't believe you're good enough at your job yet to be of any use. Kate's sure fond of you, though.  We'll be quick.  You're so dramatic, Bob. This is Kate Macy with the FBI, and her partner `what's his name'... It was her call.  First I've heard it.  Two ways to find drug routes. You can play cat and mouse with those clowns, or ask these guys what trails they avoid.  All yours.  This feels very serious.  Then go. I didn't ask you to be a part of this. She did.  What would you like to know?  Guillermo told us about a tunnel east of Nogales, near Sasabe. So now, we're trying to find what areas near there migrants avoid. Because that's where the tunnel will be. Better?  I'm going back in.  Guillermo didn't have any other options. We send him back across the border and he's a dead man. Had to give us something.  We're going to make enough noise that Manuel Diaz is called back to Mexico to see HIS boss.  And then we know where his boss is.  It's been a humdinger of a day. Go home. Get some rest. We'll find a ride. See you tomorrow.  Come on in.  Guillermo was telling the truth.  How good is your Spanish?  Power of persuasion.  We're gonna have a good day.(Points to the migrants) Let's send these guys home.  Think they'd tell us all this and then go back to Mexico? You get one night's sleep and forget everything?  Have friends at Phoenix SWAT?  They any good?  Got a new frame of reference for practice now, don't you. Let's give Phoenix SWAT a call, shall we?  When he comes out of the bank. We need the deposit receipt to seize the account. Let him do the assault... we hit him when he comes out.  Endorsing over her paycheck.  When he walks out of the bank, we pull beside and you take him.  Now.   We knew where his accounts were, we just didn't know they were shaking people down in front of the fucking branch. It's a bogus bust, though. Can't prosecute it. No one controls who deposits money in an account. An attorney will have that money back in a few months... but a lot of heads will roll before then...  Don't you dare.  You can't arrest him.  You said that Ted.  The beauty of you being so beat to shit... No one's gonna notice a couple more scratches... this is a new game, Ted.  I'm the guy who will decide if your daughters get Federal protection or whether we post your ex wife's address on the internet. I decide whether you go to prison at a work camp in Missouri or a kill house like Corcoran. This is where you negotiate how to survive...  Good job.  You write it that way in the report.  Yes?  Real quick thinking, Kate.  Sure ... This is good news. They're going to call Manuel back. Soon.  Gotta have a little faith.  We may have the tunnel, right here.  We'll know soon enough.  Tasty beverage?  Going hunting.  We'll save that for later.  First thing, get that surveillance van operational.  Do it.  You aren't really dressed for it.  You went crying to daddy yesterday. We don't want daddy to know everything. Loose lips sink ships, haven't you learned that yet? Don't worry, we got extra--  Relax. You guys will hang back when we get there, k?  Hey. All the drugs we find, you guys get to confiscate. Gonna be a big day.  What. What. What's he saying?  Where.  We're gonna have to hit the tunnel the minute we get on the ground.  Pretty exciting, huh?  On foot from here.  Weapons free, my friend.  Where is the target?  We need to boogie. And we need to do it quiet till we find the center.  Good luck.  They don't get freer buddy.  Cross this and it's new rules.  Is he through?  This was a clean, clean fucking op my friend.  She's not with you?  Okay, let's go. We're missing one.  Our government doesn't have assassins. We farm that out.  Refers to a time when one group controlled every aspect of the drug trade. Providing a measure of order. That we can control.  And until someone figures out how to convince 20 percent of the US population to stop smoking and snorting this shit, order is the best we can hope for... Alejandro is working to return that order.  He works for whoever points him toward the people that made him, Kate. Us, them, anyone that will turn him loose.  Take a breath and --  Long walk back to Phoenix.",
        "Graver": "",
        "Burnett": "Quite a find today ... The loss of two officers not withstanding.  How familiar are you with Manuel Diaz's operation?  His cousin is Fausto Alarcon.  Manuel Diaz is likely their most senior member in the United States.  With good reason.",
        "Ted": "I rode tonight.  Yeah. Were you watching?  Tossed right out of the chute. Hi.  Let me grab you guys some beers, what is that?  You wrap this around and then- (he grabs Macy's arm) I'll demonstrate.  Don't give me any ideas.  I want to take you outside.  Scuse us. We're just gonna...  Watch my bag.  Reggie... pull up my pants for me?  You got it wrong... nothing was gonna happen... wasn't... Didn't even know she--  Okay. Okay. Okay...  Look... I. I. I was asked what her  I'm in really fucking deep here.  I don't know... How do I guarantee my family's safe?  Please.",
        "Dave": "",
        "Jennings": "You okay?  Yeah.  How many total?  Call DOJ in Washington, let em know what we have.  This one of the houses owned by Manuel Diaz?  PD found something.  Agent Macy doesn't work narcotics, she runs a kidnapping response team.  DOJ wants advisors that focus on cartels involved in pursuing Mr. Diaz. This is Matt Graves. He'll be  Kate. You must volunteer for an interagency task force... Think very hard before you respond ... You want to be a part of this?  US Attorney won't issue the warrant. I can't override--  Kate... what do you want? What would you like done here?  We prosecuted more felony drug cases in this region last year than in the two previous years combined. Are you feeling that on the street? You getting the `vibe' that we\"re winning?  Do you?  This isn't something I dreamed up myself, Kate. I don't have the authority to hire advisors or authorize joint agency missions. Or fly agents from air force bases, are you understanding me? These decisions are made far from here. By officials elected to office, not appointed to them... so if your fear is operating out of bounds I am telling you, you're not. The boundary has been moved. Got it?  See what I mean? They try to react and make mistakes... you want a  Then keep shaking the tree. Let's see what else falls.  Finding that photo and luring him out. That was smart.  Thank you. Unlike most of the perps we see, Phoenix PD officers facing thirty years in prison have plenty to lose. We'll know whatever he knows very soon.",
        "Steve": "How you been?  It's the damn terrorists. They're sinking all the tropical islands.  Hear there's a real drug problem at the Four Seasons there. You need any help looking into it...  Marshals, DEA. Pulled a team for you.  It's a crack bunch too. Just rotated back from Afghanistan.  Army Intelligence Center.  You wanna get cracking?",
        "Forsing": "",
        "Reggie": "Yeah... Sorry I wasn't on your six. Got wrapped up in the front room.  I didn't hear you, you say something?  What are the chances they'll put together a case.  Look.  Ever seen him at a crime scene?  Know what's going on?  We did this by the book, right?  What? Oh shit.  ... Well?  You're back tonight?  I don't understand why they don't want me there...  Well... you keep your eye on that doughy prick in the golf shirt...  This isn't what we do, Kate.  I know. What's she supposed to do?  They let me on the base when this peckerwood needs a ride, don't they?    Thanks, man. I feel much better now.  Who's that.  Now?  Hey... How was it?  What happened?  What happened in El Paso? Talk to me.  ... Where were you?  What are we doing here?(Looks her over) What were you doing in Mexico??  Well, let's get some then.  What are we looking for? There's in the dark and then there's the way you're treating us. I want to know the objective, or I walk. Period.  Everything.  Guillermo is...?  Look man, we have a boss, and you ain't him. Be straight. What are you doing?  And then?  Alright... We're good. Just don't keep us in the dark.  I just drove a hundred fucking miles...  Got you smoking again... it was that bad?  Not that I think you should, but if you want cigarettes --  You're phone's off.  We gotta go. Those spooks been calling me all morning.  We gotta go.  Gotta get you a new bra, woman.  Just saying. You gotta... some nice lacy something.  How was seeing Evan the other day?  Miss him?  Mmhmm. And what does that tell you?  What was it like? On the border.  Wish you hadn't volunteered for this.  Know what?  Well, you sure picked the mother fuckers to show us.  Yeah. I don't believe it, but I understand what they're saying.  Mine is. How did you get all this?  No... I don't.  Yeah?  Don't even know where it is...  Yeah?  Why? There an angle here?  At the Buffalo Chip? Yeah... I'll go to the Buffalo Chip. Get my two step on... Drive your drunk ass home later...  That fool's crazy.  This what you do? Come here trolling for rednecks...  Peckerwoods got some fine-ass women though.  I'll say this... these folks got it figured. Music's all..(He stamps his foot and claps) bout life just... beating em, but still happy. Can't take that away from em.  Lit's git in thar an' boot scoot.  I think some of these girl's are getting drunk enough to forget they're racist.  Yeah, baby.  I know him.  He's Phoenix PD.   What do you got there man?  A bull? No shit?  For a minute, how'd you do?  Sit down, man.  Anything, man.  All yours. In my basketball league.  He's great. Sergeant in vice. Divorced, couple kids I think...  I'ma cock block that little blonde for you... gonna be a sacrifice...  I know where this is going --  Mmhmm.  Yeah.  See you can also... let me show you...  Fuck it.( He pulls out his handcuffs) We'll just use these.  Let's see...  Got a cell phone?  Call 911. Right fucking now, call 911.  Tell them I said so. Read them the badge number.   He was sent here. There's surveillance photos of you IN HIS BAG!!! He works for the fucking cartel.   Thought all you white girls shaved.  Nah. Think he was meant to scare you, or test you, maybe...  Don't know. They're gonna take your vehicle, look for a transmitter. Which would mean there's someone in our house involved too.  Maybe someone tailed us from the bank... I don't know.  Backseat of your car. With our shadows.  You don't mean that.  Well ... she found the picture and led him outside.  You can come stay with me.  Yeah. Thought crossed my mind.  Those guys are Special Ops. (To Matt) Are we going on this?  Well, you didn't fucking tell us.  What the fuck is he dressed for?  Then why are we going?  Great.  We HAVE done this before.  Fuck are we doing in here? Let's go back.  We're in fucking Mexico!!     You see Kate?  We gotta go back.  Hey man, what the --  What just happened?  And?",
        "Wayne": "",
        "Silvio's": "",
        "Wife": "",
        "Alejandro": "I think about the price. The price of appetite. The cost of forgetting who we are. Pretending we are... who we will never be...  So easy to pretend we are not to blame. That a demon enters us. No... The demon is inside. We just make potions that release it.  There's no revenge for all they have taken. No justice. It simply is...  And still. They must be forced to look at all they have destroyed. By having the same done to them. Or they will forget... Forget they are human. Believe they are as different as they feel... Then they are the lion, and everything we loved and lost, simply its meal.  And you too...  Say it.  Sit down.  Can't walk back like this. We need to dry.  Nothing.  No.  Nothing. (Alejandro turns his face to the sun) I just wanted to know.  Don't give me a reason.  By telling me the truth without having to drown you.  If you are very lucky you never will.  It is the Colonel.  Why so many?  Where are we going?  What did they do?  Thank you.  Hello.  Have you been to Juarez before?  What is your experience with operations like these?  Sleep if you can. Juarez will demand all of your focus.  Yes.  I'm fine.  Hmm?  Yes.  You are asking how a watch works. For now, only focus on knowing the time.  Pay attention.  Memorize the faces of everyone here. Know who is with you.  I worked in Juarez.  No.  Mexico. As a federal prosecutor.  No.  I go where I'm sent.  Cartagena.  Want to see Juarez?  Hard to believe, yes?  He wears the state police shirt. The pig -- Not what you think it means. All state police work for the cartels. ALL of them. That man... He tried to work for two... he got greedy.  Nothing will happen here. If they try anything, it will be at the border. If no lane is cleared for us when we return... Be ready. Watch the cars. Look for old cars. Throw aways. Not gangster cars... Those are for the whores on Saturday night. Did you watch the cars we passed driving in?  Watch for state police. They are all bad. We will lose the escort at the loop. You will see. That is when you worry.  Lean back, Kate.  On the left.  You have a service weapon?  Get it out.  Silver LeSabre. Two lanes over my 3.  Gun. Buick LeSabre, 3 o'clock, gun.  watch the door handles.  All the women can go.  Watch these men close. Look for the ones like the men you saw in Juarez.  Do you see?  Yes. Keep looking.  They see it all, and must avoid the traps set everywhere for them. We look for one who is older... one who has had enough.  Break them into groups of four, Let them spread out, each group as far from the other as possible.  Fausto Alarcon, Manuel's cousin... Manuel's boss... He is an executioner...  When people die in my country, it is with his hand or his blessing. To find him would be like... discovering a vaccine. Manuel will lead us to him.  Certainly, you understand the value of that.  There is only dark, my friend.  We should watch here.  You know this land? A tunnel where cars can pass?  Can you mark the tunnel on here?  This is our way across. Right here. Where do you live?  Know a Wells Fargo on Baseline?  Guillermo told the truth about everything.  Thank you ... don't cross again. Not for a long time.  Better than good, my friend.  We are close.  Don't go in the bank, Kate.  We need him to get called back to Mexico. That's the objective, Kate.  How many officers do they have on the force?  You want the truth?  Give the names, give the houses, phone numbers ... Give me all of you.  He wasn't an assassin. He was just supposed to be your friend and hopefully find out who is showing you how to hurt them. They are looking for us, not you.  I've been doing this for a long time.  In Mexico, police do not investigate crimes for the government. Attorneys do. That's what I did. I was very close to arresting someone who ... someone I shouldn't have tried to arrest.  The brilliance of what they do when they mutilate a body is make people think -- Oh, that person must have done something to receive such a death. They must have been involved.  They must have deserved it ... And for the family ... It soils every memory you have of that person. They make it impossible to imagine the face you loved without seeing the initials carved into her forehead. Imagine her body without seeing her chest with -- remember her before...  Her breasts were cut off ... Remember your child without ...  They kill the body, the memory, everything.  You remind me of my wife. I find it very difficult to look at you.  Get some rest tonight. Tomorrow they will call Manuel back, and we will cut a leg from them.  I don't use those. Ask Matt.  Take the left shaft ... Make noise.  No. Draw them to you. The one I am looking for will try and run.  What you do now is for your family. Whether they see tomorrow rests with you.  You will drive me.  Put that down.  We are in Mexico now. You have no jurisdiction.  Don't ever point a weapon at me again. Get your breath and go back to the surface.  Stop it Kate. Just stop. This is what we were sent here to do.  I don't have time. Go to the surface. Now.  I am here to kill the man with the power to summon Manuel Diaz. I am here for Fausto. But I will kill Manuel too. It's what I do, Kate. Go. Or I will do it to you.  Get in.  Drive back to Mexico.  I am through, do you have my location?    Having family... does that save the lives of the men you are hired to kill? Hmm?  This is the target ahead? Confirm.  Put on your lights. Pull the car over.  Use the speaker. Tell him to get out of the car.  Tell him to raise his shirt and turn around.  Tell him to do it or you will shoot him where he stands.  Look how good you are at pretending to be a police officer. Out of the car. Now.  Walk back to your car.  A mule. Like you.  In the leg so you don't run. In the hand so you don't try to fight and make me have to kill you yet.  I know who you are, Manuel. You are no jefe, but you will drive me to one...  If you try anything, if you betray me, your daughters will burp the semen of twenty men with their last breath. Do you understand me?  Get in.  Drive.  You get out and walk toward them.  What you do now is for your family. There is no you.  No. Not anymore. Now I am the same. Turn the car a bit more to the left.   Your children speak English?  Then we will spare them. I interrupted dinner. Please... Continue.  Every night, you have families killed, and yet you dine. Tonight should be no different.  Eat.  Take the children away from here.  You. Whore. Sit over there.  You're not finished. Eat...  I will give you a choice, Fausto, one I was not given... You may choose to die tonight or live with the shame of having the mother of your children take your place...  Yes ... Choose.  See why you married her. Spunk.  Watch death come for you. Watch. The devil is near, Fausto. He is waiting for you.  This is what they think of you. You see?  Maybe you have enough pride that you don't marry another one of these. Maybe you take his money and go hide and raise your children far from here. Maybe your son grows up to be a doctor. And I don't have to come back and kill him some day.  I think maybe, it will be the thing that kills us all ... as a people, you know?  Stop it.  That will scar. I'm sorry.  Let me look ... Move your hand.  These ribs are bruised, but not broken, yes?  I would recommend not standing on balconies for a little while.  In Mexico, the killers are called Sicarios... The word comes from the zealots of Jerusalem. Killers who hunted the Romans that invaded their homeland... They don't deserve the term.  Policing them does nothing. They must be killed. Wherever they are found. They will make every place they touch Juarez. Now ... Now you understand how far we have fallen.  You look like a girl when you're scared. Such beauty in you when you let yourself be frail. Like the daughter they took from me ... This is not the work for you. Look at yourself, Kate. What it has done to you in just three days ... Find a little town far from the border. A place where the rule of law still exists. You will spot predators there very easy now... Make a difference you can see everyday. Because you will not survive here. You are not a wolf. This is the land of wolves now.  We like to think if we cut the head from the snake, the serpent will die...  But there is no snake. They are worms. When you cut the head, a new one grows. From both segments ... We cannot question if the end justifies the means because there is no end to consider...  This is the price of our self indulgence. Our weakness ... Our appetite. They are our demons, our creation.  There is a moment in each person's life. A choice. Do what feels good... Do what is good. Make the wrong choice enough, and it is not presented again... then all choices are bad. And the consequences worse. There is no war on drugs. Only war. The enemy we fight? Ourselves ...",
        "Kate": "",
        "Macer": ""
    },
    "imdb_rating": "7.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjA5NjM3NTk1M15BMl5BanBnXkFtZTgwMzg1MzU2NjE@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "Kate Macer leads a Phoenix based kidnap response unit for the FBI. Following Kate's team leading a raid on a known drug den in nearby Chandler, Kate is recruited to work on a special ops team led by Matt Graver of the CIA, he who is on special assignment for the Department of Defense. They recruited her because they wanted someone with tactical procedures knowledge. Outwardly, the team's mission, which works behind a Delta Force team as its primary gun power as required, is to decapitate a Mexican drug cartel by capturing or dismembering the workings of the main players, cartel head Manuel Díaz, his second in command Guillermo Díaz (Manuel's brother), and drug lord Fausto Alarcón. Kate agrees to the assignment as she feels the work of this team would be more effective in stopping the drug trade in the US than the piecemeal work of her current kidnap response unit. The third on the team is a mysterious Hispanic or Latino man Kate only knows as Alejandro, and who she does not fully trust as she can tell that he is suffering from a very traumatic past. When Kate and the team arrive in El Paso for their first mission, Kate learns that the team's workings are not all they appear on the surface - many of the proceedings which would not be considered above board or legal - despite the end goal being as she knows it to be. Still largely in the dark and only given information on a need to know basis, Kate decides to stick it out with the team if only to discover all that she is not told while still believing in the end goal. She may have changing or at least mixed emotions as she learns more and more about what is going on, including the specific reason why she was recruited.—Huggo",
    "name": "Sicario",
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ]
}