{
    "filename": "Signs_script.txt",
    "imdb_id": "tt0286106",
    "imdb_url": "https://www.imdb.com/title/tt0286106",
    "characters": [
        "Lionel Prichard",
        "SFC Cunningham",
        "Mr. Nathan",
        "Mrs. Nathan",
        "Brazilian Birthday Boy",
        "Sarah Hughes",
        "Rev. Graham Hess",
        "Colleen Hess",
        "Ray Reddy",
        "Morgan Hess",
        "Merrill Hess",
        "Columbia University Professor",
        "Bo Hess",
        "Officer Paski",
        "Tracey Abernathy, the Pharmacist"
    ],
    "dialogues": {
        "Lionel": "He'd just swing as hard as he could every time.  It didn't matter what the coach said, didn't matter who was on base, he'd whip that bat through the air as hard as he could... Looked like a lumber jack chopping down a tree. Merrill here, struck out more times than any two players.",
        "Prichard": "",
        "SFC": "",
        "Cunningham": "",
        "Nathan": "A mom and pop bookstore.  Three isles wide.  MR. AND MRS. NATHAN, a couple in their early seventies, sit behind their counter and watch a black and white TV.  The PICTURE ON THE  That's what they keep alluding to. It's just a bunch of crock. They're trying to sell sodas, plain and simple.  I've been watching these reports since morning.  I've seen twelve soda commercials so far.  Twelve!  Don't tell me you believe this horse manure?  As a matter of fact, I think we have one.  Came by mistake in a shipment.  Decided to keep it for city people.  Last row.  Third book from the left honey.   Bo sits at a tiny reading table and drinks a glass of water. There is another glass, half-full, on her table.  Mrs. Nathan watches as the little girl takes careful sips.  Beat.  Bo looks up with a grimace.     Carl, there's something wrong with our water!    Thirteen!",
        "Mrs.": "As a matter of fact, I think we have one.  Came by mistake in a shipment.  Decided to keep it for city people.  Last row.  Third book from the left honey.    Carl, there's something wrong with our water!",
        "Sarah": "",
        "Hughes": "",
        "Colleen": "I was just taking a walk before dinner.  I guess it was meant to be.  I don't feel much.",
        "Hess": "The two men walk down the driveway to Edgar's patrol car.    THE SKY IS GOLDEN RED.  The crops sway hypnotically in a gentle breeze.  The Hess station wagon pulls into their driveway.  It comes to a stop in front of the house.  The engine goes off.  No one gets out.    Graham enters his front hall.  He closes the door and locks it behind him.  He turns and looks into the family room.  Morgan and Bo and Merrill are seated together on the sofa. All three are wearing foil helmets.  Beat.    WE ARE WATCHING THE HOUSE FROM THE CROPS.  We see Graham inside the house, closing the window shutters in one room after another.  WE SEE a stack of wooden boards on the porch.  OUR VIEW MOVES to the barn where Isabelle is tied.  She is not pacing.  She is not barking.  She sits staring right at us.  She is shivering.  OUR VIEW MOVES to the garage building where we see Merrill carry a huge pile of his clothes and things down the stairs. He's moving into the main house.  Merrill walks across the yard.  His eyes look around carefully as he moves.  Part of the pile in his arms falls to the grass as he crosses the lawn.  He stops walking and starts to gather up the fallen things.  He picks up a couple shirts and two baseballs encased in glass cases.  The glass encasing one of the souvenir baseballs, has cracked.  He takes the ball out.  Stares at it.  We watch from the crops as Merrill puts down his pile of clothes and things on the grass.  He looks around and finds what he's looking for.  A rake.  Merrill unscrews the fork on the rake from the wooden handle. With the wooden stick in one hand and the souvenir baseball in the other, he turns to face the crops.",
        "Ray": "I wrote your number down to call you.  It's been sitting next to the phone for six months.  When I knew it was inside the house, I couldn't think of any other number to call. I panicked. Thank you for coming Father.  I worked so long that night.  I ain't never fallen asleep driving before.  And never since.  Most of the ride home, there wasn't a car insight in either direction.  If I'd fallen asleep then, I'd a ended up in a ditch with a head ache.  It had to happen at that right moment. That certain ten-fifteen seconds when I passed her walking.  It was like it was meant to be.  I guess if this is the end of the world, I'm screwed right?  People who kill Reverends' wives aren't exactly ushered to the front of the line in heaven.  To the lake.  The way I see it, all the places marked in the crops and such -- none of them are really near water.  I figure they don't like water. Can't be any worse than here.  I'm truly sorry for what I've done to you and yours.  And don't open my pantry Father.  I locked one of them in there.",
        "Reddy": "A mailbox reads \"R. Reddy.\"  There is a gray and white house at the end of the quarter mile driveway.  We saw the roof of this house from the Hess hallway window.  Graham stands at the front door and RINGS THE DOORBELL AGAIN.  Beat.  Graham tries to look inside.  Curtains block his view.  Graham walks around the porch.  Turns the corner of the house.  He looks in a side window.    The passenger side window of the truck is open.  Graham steps up to it and looks inside.  The thin man with the leather jacket, we saw in town, sits behind the wheel.  He stares out the windshield.  He is covered in sweat.",
        "Morgan": "I think God did it.  Houdini peed.  I think he's sick.  You don't even know what that word means.  It's not contaminated.  It's just tap water.  Pour it in his bowl.  He licks his butt everyday.  He's not going to mind.  Houdini?  Bo don't run.  What's wrong boy?  Stop it Houdini!      Can I use Bo's old baby monitor as a walkie-talkie?  It needs batteries.  These are D's; I need double A's.  It's still making the noises.  It's broken.    Book money.  Extraterrestrials?  Do you have book on extraterrestrials?  Your water is fine.  Bo has a thing about her drinking water.  She's had it her whole life.  Like a tick people have.  Except it's not a tick.  I'll take it.    He's the man who killed mom.  What if Bo's baby monitor is picking up signals from the extraterrestrials?   It's a code.  We might lose the signal.  Don't do it.  Nobody move!  Voices.  Did you hear that?  Not English though.  You heard the voices right Uncle Merrill?  Stop!  It doesn't sound like words.  Don't do it!  Don't let go.  It gets clearer, the higher you hold it.  Stop!      We have to tape this...     Dad!  Uncle Merrill, I'm using your tape.    So the aliens can't read our minds.  They tell you everything in this book.  It says they're probably very small -- like my height -- because, as their brains developed, there was no use for physical development. It says they're probably vegetarians, because they would have realized the benefits of such a diet.  Scientists who have been persecuted for their beliefs.  Dad, are you going to be serious?  There are pictures.  Dr. Bimboo, one of the authors of the book --  Dad.  He says there are two reasons why Extraterrestrials would visit us.  To make contact in the spirit of exploration and furthering the knowledge of the universe.  Or the other reason... They're hostile.  They've used up the resources on their planet and are looking to harvest our planet next.    Why, you got one of your feeling again?  Is it bad?  If it does, I won't let anything bad happen to you.  Who said I was going to die?  Who said I was going to die?  Come on Bo.  I need to keep a look out.  Yes.  They would invade us using only ground tactics.  Hand to hand combat.  They wouldn't use their technology or fight an airborne battle, because they would know we would eventually use nuclear weapons and the planet would be useless to them.  They said one of two things could happen.  One, they fight and are defeated and leave to return again with full forces hundreds or even thousands of years later.  They win.  Sounds made up.  Come quick!  They think these look like stages immediately proceeding an attack maneuver.  They think it might happen all at once.  Some guy had a sign that said it was the end of the world. Nothing really bad is going to happen, is it Uncle Merrill?  You sure right?  I once had a bad dream and I couldn't wake up.  I kicked at the table next to my bed and something fell on me and I woke up.  It was a picture of mom.  She was smiling. It made me feel safe... You mean like that?  Where are we going to sleep?  What about Isabelle?  Anything?  French toast... and mashed potatoes.  I'm scared.  Don't yell at her!  We forgot about Isabelle.    We forgot our foil helmets!  They'll read our minds!      I hope they're doing better than we are.  We don't even have helmets.  The book says they're probably very good problem solvers.  They'll find a way in.    What?                Dad.  Did someone save me?",
        "Merrill": "Where are they?  I used a little Tabasco in the potato salad.  Okay, this guy is trying to scare us.  He's messed with our property, he's coming around the house.  It's time for an ass whoopin'!                  Merrill is in a full sprint.  He hugs the side of the building as he runs.   We're gonna beat your ass bitch!   Merrill turns a corner full speed.  THE LARGE FIGURE HAS COME  I'm gonna tear your head off!  I heard.  It was very dark.  Probably.  It was very dark.  I don't know any girls can run like that.  This guy got on the roof in like a second.  That roof is over ten feet high.  Excluding the possibility that a female Scandinavian Olympian was running around outside our house last night, what else is a possibility?  No.  Listen, I was out of line with that whole female Scandinavian Olympian thing.  It's just that, I'm pretty strong and pretty fast.  And I was running as fast as I could.  And this guy... He was just toying with us.  You do?    Clear for what?  You have a pamphlet or something I can read?    Five.  The five longest.  Hello Lionel.  Felt wrong not to swing.  Pharmacy crowded?    All this crop stuff.  They did it twenty-five years ago.  It was a joke.  It's noise.  We'll look like mental patients.  That's right.  Let me see it.  You'll lose the signal!  I got him.  The crazies were right.          I was at this party once.  I'm on a couch with Sara Mckinney.  She was just sitting there, looking beautiful and staring at me.  I go to lean in and kiss her and I realize I have gum in my mouth.  I turn and take out the gum.  Stuff it in my paper cup next to the sofa and turn around.  Sara Mckinney throws up all over herself. I knew the second it happened.  It was a miracle.  I could have been kissing her when she threw up. That would have scarred me for life.  I may never have recovered.  I'm a miracle man.  Those lights are a miracle.      For the kids protection.  All they were doing was watching TV from five a.m.  I felt like they were getting obsessed like you said. They should be playing furry, furry rabbit or tea party or something right?      Eleven a.m.  They're gone.  But they're not really gone.  We just can't see them.  Early this morning a bird flew right at the area where the lights were hovering last night.  It stopped dead in the air and fell straight down.  They caught it on tape and they've been playing it all morning.  They found the bird.  His head crushed in.  When you see the footage it looks like the bird flew into a wall in the sky. They think they have some invisible shield thing going, like an optical illusion.  Already thought of.  Two other birds did the same thing an hour later.  Not as dramatic.  They lived.  But you could see they hit something.  They're still there hovering.  In fact, some people think there's more of them now.  All over the place.  Over us even. And there's a theory about the crop circles now.  They think it could be some kind of landmark, visual mapping system -- so they can navigate.  Coordinate.  Makes sense doesn't it?  You had a tone.  Where are you going?  Why?  Move children!  Vamonos!  They're skin changes color.  That's why we couldn't see him that night.  I'm sorry, what book is this?  How do we know boards will do anything?   Merrill looks around cautiously again, before getting into a batter's stance.  His left leg digs into the grass in front of him.  His weight is mostly on his back leg.  He looks out into the distance high over the crops.  He throws the baseball up in the air...  Merrill grabs the wooden handle.  Merrill's shoulders move with blinding speed.  The wooden rake handle slices the air. And misses the ball.  The ball drops at Merrill's feet.  WE WATCH as Merrill picks up the ball and tries again.  This time his shoulders move even faster.  The wooden stick actually makes A RESONANT SOUND as it cuts the air.  The ball drops at Merrill's feet.  WE WATCH THROUGH THE CROPS as Merrill snatches the ball up and tries a third time.  This time he YELLS as he swings.  He rips the air with the wooden stick so fast it blurs to the eye.  The baseball drops at his feet.  Strike three.  Merrill stands still in the yard.  He's breathing a little heavy as he stares down at the ball.  He gently picks it up.  He walks back to his pile of things and then suddenly turns.  He throws the ball in the air as he does.  His left leg goes out.  His weight goes to his right leg as he turns his shoulders with astonishing speed and power...    It's like War of the Worlds.    Don't worry.  You know about signs Morgan?  Not like the ones people write on. It's like if you poured a glass of milk and you dropped the glass by mistake and broke it before you could drink it.  Then you looked at the milk carton and saw that the milk was spoiled.  They're things that happen by chance or luck, but make you feel that someone's watching out for you.  Yeah, like that. I believe in signs Morgan.  I think there's someone watching out for us.  I got to believe he's going to make sure we're all right in the end.  Too many windows in the bedrooms. We don't have enough boards.  I'll make sandwiches.  We should eat fast Bo.    Graham hurry.    They're on the roof.  They're in the house.  The attic door.  This is a very temporary solution.  Twenty-two seconds.  This is going to do nothing.  There's no way out of there.  Should we make a run for it out the back?    They're coming.  We won't be able to get out of there.  I know.  I'm looking!  Got it!    What's happening out there?  They want our attention on the door?  From what?  What book!   Me too.  I'm close.    Hold the vent!     I should save the flashlights.    Merrill nods to her.  She reaches down and presses the button.   I found a pack of light bulbs.  It came on about two hours ago. Woke me up. We won Graham.  It went on all night.  Everywhere. It was completely a ground battle. Mostly hand to hand.  You can't see them unless you're up close.  A lot of people died.  Some from combat. But most from poison gas inhalation.  They secrete it.  They think over a hundred thousand. They're just estimates. But we held strong.  A mass evacuation by them started about eight o'clock this morning. It's eleven now. They're leaving.  You didn't think we'd make it.      He's been like that for awhile.  We need to get him some medicine.  Philadelphia and its outlying counties are cleared, but who knows for sure?     That's good enough for me.    Graham.",
        "Bo": "Are you in my dreams too?  Dad!  I think it's contaminated.  It tastes funny.    Houdini's sick.  I saw a monster.  Can I have a glass of water?  It tastes old.  Only for pee or poop.          Dad, where's the remote?  There's dust in it.  A hair.  Morgan took a sip.  It has his amoebas in it.  I can't find the remote.   A mom and pop bookstore.  Three isles wide.  MR. AND MRS. NATHAN, a couple in their early seventies, sit behind their counter and watch a black and white TV.  The PICTURE ON THE   Bo sits at a tiny reading table and drinks a glass of water. There is another glass, half-full, on her table.  Mrs. Nathan watches as the little girl takes careful sips.  Beat.  Bo looks up with a grimace.   It's contaminated.  Who is he?  I heard them Morgan.   No dad!     Fourteen.  My ballet recital.  My ballet recital.  Yeah, serious.  The same windows.  You don't think something bad will happen do you Morgan?       Esta atras da garagem!  Esta atras de ai!  Is behind!    I want spaghetti?  Me too.  SOUND FILLS THE CLOSET.  Beat.  Graham steps out into the hall.  Merrill and the two children are standing there waiting.  Graham looks at them.    All four look up.     I'm already scared.  Dad!    I'm okay.        He can't breathe.   Graham's eyes close.  He starts crying.  He speaks to no one.       People are dancing.    Daddy.",
        "Officer": "Mrs. Kindleman twisted her ankle as she put it, \"diving for her life\" when a bunch of school kids rode down the sidewalk on skateboards. She went down to Thorton's store this morning and started spitting on the new skateboards.  Spitting! By the time I got there, Mrs. Kindleman had sprayed the whole damn place... She must have had a cold or something.  It was enough to turn a grown man's stomach.  So what happened to your crops?              What kind of machine can bend a stalk of corn over without cracking it?  Doesn't sound much like Lionel Prichard and the Wolfington brothers.  They can't take a piss without wetting the front of their pants.  Second thing this week I can't explain.  Some animals around the county exhibiting uncharacteristic behavior.  Sometimes violent behavior.  Theo Henry had two of his fingers bit off by his cow.  No Father, they're edgy.  On alert. Like they act when they smell a predator around... Peeing on themselves and everything.  What's wrong?  You can't describe him at all? Don't you think that's find of odd?  I don't know whether to look for a midget or a --  Okay. So he was tall?  Over six feet?  We've established that. Just tell me about his clothing then.  Was he wearing a Scottish kilt or jeans?  Let me ask you two something. Don't be embarrassed by the answer. It is possible... Just possible now, you might have been chasing each other around?  You said you went in opposite directions.  I apologize.  How certain are you, that this was a male?  I don't know Merrill.  I've seen some of those women on the Olympics.  They could out run me easy.  They got women's high jumping in the Olympics.  They got these Scandinavian women who could jump clean over me.  Yesterday afternoon, an out of town woman stopped by the diner and started yelling and cussing cause they didn't have her favorite cigarettes at the vending machine. Scared a couple of customers.  No one's seen her since... My point is, we don't know anything about the person you saw.  We should just keep all possibilities available.  I'm not done asking questions and I don't appreciate the sarcasm.  Do you have anyone who might have a grudge or something against you? Maybe a church member, who might not have liked the fact, that you left the church?  Do you owe anybody money?  You can tell me off the record if you need too.  Is anything missing?  Could everyone just take a seat on the couch.  I have some preliminary thoughts.  There are three possibilities here. We'll call them one, two and three. The level one scenario is that there is a sane individual, who for real reasons wants to do you harm. I really don't believe that's what we're looking at here.  In my opinion, whoever this is, they don't want to do harm to you all. That's kind of clear. The level two scenario is, this is a mentally unstable person who's fixated on you and your family. This is a possibility, but a very slim one. I assure you I will treat all three possibilities carefully, but in all likely hood we are looking at what we'll call a level three scenario. He's a watcher.  Someone who this is a game for.  He's laying low. Doesn't want to be seen.  But he wants to watch you.  Study you folks.  Now I don't want you all to worry about this no more.  You're making more of this than it is. You guys have had a tough couple of days with the vandalism to the crops and the death of your shepherd. Maybe you guys should do something fun?  Let me worry about this person.  Let me find out who it is and then -- What the hell are you people looking at?  I'll be damned.  What in God's name is going on?  Don't ask me what I think.  Cause I can't think straight right now. I'm going back to the station. Have a cup of Marcia's coffee and try to think clear.  After that I might make some calls. Hoaxes... People got way too much time on their hands.  But I'll tell you something, what I said in their, still goes.  You and your family have been through a lot in the last two days... Not to mention what happened to you all seven months ago.  It's left its mark still.  The last thing these children need to do, is worry about some crazy things happening in the world.  Take them into town.  Get their minds -- your mind, on everyday things.  It's good medicine.  You take care of yourself... Graham.  What do you know?  He wasn't drinking.  Ray fell asleep at the wheel.  Yes... That's the first thing Colleen asked too.  She's not in an ambulance Father.  See Father, Ray's truck swerved off the road and ah... Hit Colleen and then a tree.  She was pinned between the two.  The truck... the truck has severed most of her lower half.  She won't be saved.  At this point she's alive, because the truck is holding her together.  She doesn't feel much, and she's talking almost like normal.  We didn't pull the truck out, cause we wanted you to come down here to be with her, as long as she's awake.  That won't be very long. Father, you understand what I've told you?  Yes it is.",
        "Paski": "Mrs. Kindleman twisted her ankle as she put it, \"diving for her life\" when a bunch of school kids rode down the sidewalk on skateboards. She went down to Thorton's store this morning and started spitting on the new skateboards.  Spitting! By the time I got there, Mrs. Kindleman had sprayed the whole damn place... She must have had a cold or something.  It was enough to turn a grown man's stomach.  So what happened to your crops?              What kind of machine can bend a stalk of corn over without cracking it?  Doesn't sound much like Lionel Prichard and the Wolfington brothers.  They can't take a piss without wetting the front of their pants.  Second thing this week I can't explain.  Some animals around the county exhibiting uncharacteristic behavior.  Sometimes violent behavior.  Theo Henry had two of his fingers bit off by his cow.  No Father, they're edgy.  On alert. Like they act when they smell a predator around... Peeing on themselves and everything.  What's wrong?  You can't describe him at all? Don't you think that's find of odd?  I don't know whether to look for a midget or a --  Okay. So he was tall?  Over six feet?  We've established that. Just tell me about his clothing then.  Was he wearing a Scottish kilt or jeans?  Let me ask you two something. Don't be embarrassed by the answer. It is possible... Just possible now, you might have been chasing each other around?  You said you went in opposite directions.  I apologize.  How certain are you, that this was a male?  I don't know Merrill.  I've seen some of those women on the Olympics.  They could out run me easy.  They got women's high jumping in the Olympics.  They got these Scandinavian women who could jump clean over me.  Yesterday afternoon, an out of town woman stopped by the diner and started yelling and cussing cause they didn't have her favorite cigarettes at the vending machine. Scared a couple of customers.  No one's seen her since... My point is, we don't know anything about the person you saw.  We should just keep all possibilities available.  I'm not done asking questions and I don't appreciate the sarcasm.  Do you have anyone who might have a grudge or something against you? Maybe a church member, who might not have liked the fact, that you left the church?  Do you owe anybody money?  You can tell me off the record if you need too.  Is anything missing?  Could everyone just take a seat on the couch.  I have some preliminary thoughts.  There are three possibilities here. We'll call them one, two and three. The level one scenario is that there is a sane individual, who for real reasons wants to do you harm. I really don't believe that's what we're looking at here.  In my opinion, whoever this is, they don't want to do harm to you all. That's kind of clear. The level two scenario is, this is a mentally unstable person who's fixated on you and your family. This is a possibility, but a very slim one. I assure you I will treat all three possibilities carefully, but in all likely hood we are looking at what we'll call a level three scenario. He's a watcher.  Someone who this is a game for.  He's laying low. Doesn't want to be seen.  But he wants to watch you.  Study you folks.  Now I don't want you all to worry about this no more.  You're making more of this than it is. You guys have had a tough couple of days with the vandalism to the crops and the death of your shepherd. Maybe you guys should do something fun?  Let me worry about this person.  Let me find out who it is and then -- What the hell are you people looking at?  I'll be damned.  What in God's name is going on?  Don't ask me what I think.  Cause I can't think straight right now. I'm going back to the station. Have a cup of Marcia's coffee and try to think clear.  After that I might make some calls. Hoaxes... People got way too much time on their hands.  But I'll tell you something, what I said in their, still goes.  You and your family have been through a lot in the last two days... Not to mention what happened to you all seven months ago.  It's left its mark still.  The last thing these children need to do, is worry about some crazy things happening in the world.  Take them into town.  Get their minds -- your mind, on everyday things.  It's good medicine.  You take care of yourself... Graham.  What do you know?  He wasn't drinking.  Ray fell asleep at the wheel.  Yes... That's the first thing Colleen asked too.  She's not in an ambulance Father.  See Father, Ray's truck swerved off the road and ah... Hit Colleen and then a tree.  She was pinned between the two.  The truck... the truck has severed most of her lower half.  She won't be saved.  At this point she's alive, because the truck is holding her together.  She doesn't feel much, and she's talking almost like normal.  We didn't pull the truck out, cause we wanted you to come down here to be with her, as long as she's awake.  That won't be very long. Father, you understand what I've told you?  Yes it is."
    },
    "imdb_rating": "6.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNDUwMDUyMDAyNF5BMl5BanBnXkFtZTYwMDQ3NzM3._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Preacher Graham Hess loses his faith in God after his wife dies in a brutal car accident. He lives with his children and brother in a farmhouse. Crop circles start to appear in their cornfields; Graham dismisses them as mischief by miscreants. After hearing strange noises and watching news coverage on crop circles appearing all over the world, the family grows suspicious of alien activities. Now they must stick together as a family and believe, to survive and escape the ordeal.—Radhakrishnan",
    "name": "Signs",
    "genres": [
        "Drama",
        "Mystery",
        "Sci-Fi"
    ]
}