{
    "filename": "Slumdog-Millionaire_script.txt",
    "imdb_id": "tt1010048",
    "imdb_url": "https://www.imdb.com/title/tt1010048",
    "characters": [
        "Jamal's Mother",
        "Sergeant Srinivas",
        "Mr Nanda",
        "Prem",
        "Older Jamal",
        "Airport Security Guard (as Hira Banjara)",
        "Javed",
        "Director",
        "Vision Mixer",
        "Police Inspector",
        "Prakash",
        "Youngest Salim",
        "Airport Security Guard",
        "Older Latika",
        "Youngest Jamal"
    ],
    "dialogues": {
        "Jamal's": "Don't you move a muscle.  Thank you, Mister Gupta. I will deal with these two.",
        "Mother": "Don't you move a muscle.  Thank you, Mister Gupta. I will deal with these two.  Here it comes!  It's going to come. Today. I can feel it.  Yes. We need rain.  Run! Jamal, Salim, run!  Go! Run!  Go!",
        "Sergeant": "",
        "Srinivas": "Your name, bhen chod.  Your name!  Apart from his name, I can't get a word out of the runt.  Tough guy.  Sorry, Sir.  Maybe he did know the answers.  I knew it was Amitabh.  The Inspector asked you a question.  (can't help  Platform Seventeen-  A statue of Frederick Stevens, architect and builder of Victoria Terminus in -  Sir, sir!  Accessory to murder, Sir.  Shooting at Pila Street, October 19th...Maman Hossani....Victim pronounced dead at scene. Suspects absconded: two males, early teens, one female, early teen.  Sir-?  You're back on the show.",
        "Mr": "",
        "Nanda": "",
        "Prem": "Are you ready?  I said are you ready?  Welcome to Who Wants To Be A Millionaire!  Please give a warm welcome to our first contestant of the night- a local from our very own Mumbai!  Smile, dammit.  So, Jamal, tell us a bit about yourself.  A Phone-basher! And what type of call centre would this be?  Aha! So, you're the man who rings me up every single day of my life with Special Offers, huh?  An Assistant Phone-basher?  And what does an Assistant Phone- basher do, exactly?  - a chi-wallah! Why didn't you say?  So, ladies and gentlemen, Jamal Malik from Mumbai, let's play Who Wants To Be A Millionaire...!  Not at all, not at all. I hope you will visit us, Commissioner.  Bring the family. It's a lot of fun.  Inspector. How good to meet you. Clearly the kid cheated.  So, it is just a question of how, no?  We are lucky to have a man of your obvious experience on the case. This kid might run rings around us filmi types, but he won't make fools out of the Mumbai Police Force, I can see that.  In front of sixty million people.  Which is what will happen if we don't get a result, Gentlemen. He goes back on the show to rob us all with the whole of India watching. But. I can rely on you.  Has he- has he made any allegations?  He's a cunning one. A convincing liar. Don't be taken in, Inspector, don't be taken in.  So, are you ready for your first question for one thousand rupees?  Not bad money to sit in a chair and answer a question. Better than making the tea, no?  No. Yes. No. Apka final answer?  Remember, you have three lifelines if you're not sure of your answer- Ask the Audience, 50/50 and Phone a Friend. So, the question:  Who was the star of the 1973 hit film Zanjeer. Was it A-  You chose A- Amitabh Bacchan. Guess what? You just won one thousand rupees!  For four thousand rupees....the national emblem of India is a picture of three lions. What is written underneath? Is it...  ...A) The truth alone triumphs. B) Lies alone triumph. C) Fashion alone triumphs. D) Money alone triumphs.  What do we think, Jamal? The most famous phrase in our country's history. Maybe you want to phone a friend?  Or Ask the Audience? I have a hunch they might just know the answer. What do we think?    Well, you're the contestant, Jamal.  Put the poor man out of his misery, Ladies and Gentlemen. Press your key-pad now.  The audience has chosen. And, whaddya know? Ninety-nine percent of them think the answer is A). The truth alone triumphs. What do we think, Jamal? A hundred percent would have made me a little more reassured, maybe....  Are you married, Jamal?  Well, don't despair, there's someone out there who thinks our national motto is \"Fashion alone triumphs\". You two could be very well matched.  ...won four thousand rupees!  One more question before the commercial break. What will our Call Centre Assistant do next?  Religion! Interesting. For sixteen thousand rupees, in depictions of the God Ram, he is famously holding what in his right hand? Is it A) a flower. B) a scimitar. C) a child or D) a bow and arrow?  Final answer?  Computer-ji, D lock kiya-jaye.  Jamal Malik, you answered D? Ram is depicted with a bow and arrow in his hand. And guess what? You've just won sixteen thousand rupees! Well done, my friend. Time for a commercial break- don't go away, now.  Got lucky, huh? I'd take the money. You'll never get the next one.  Hmm? Sure. Know where I live now, kid? Pali Hill. Twelve bedrooms, a/c in every room, two kitchens, a gym and a screening room. Steel balls is what it takes, my friend, steel balls.  We're having fun here. They love it...Where the hell do you get them from?  Stop wetting your pants. I'll be a good little boy with the next one. Promise.  Meet me after the show. Please.  Nita, I can explain.  Baby, it all happened before I met you. I swear to you.  You see? Amidst all this misery, only you can make me laugh.  Her and I- nothing. You have to believe me, baby...  No. I'm not going on.  I can't. Without you, it's all pointless.  You. Tell the Director.  Calypso Bar, private room, just you and me?  Steel balls.  Okay, Juhu boy, you've had a good run. Take your Mother to Khandala and eat some chiki.  Well, your girlfriend then. Even better.  Live wire like you? You surprise me.  Welcome back to Who Wants to be a Millionaire! Our contestant, Jamal Malik, Call Centre Assistant- from Mumbai, is on sixteen thousand rupees and has already used one lifeline: Ask the Audience. So, my friend: are you ready for the next question?  Then, let's play.  For sixty-four thousand rupees. The British architect Frederick Stevens designed which famous building in India? Is it: A) The Taj Mahal. B) Chhatrapati Shivaji Terminus. C) India Gate. D) Howrah Bridge. What do you think, Jamal? Are you one of those tea-boys with a penchant for architecture?  So, what's it to be? Walk away and this cheque for sixteen thousand rupees is yours. Look, it's even got your name on it.  Nope. Looks like the Producer's stolen my wallet again-  You'll play?  Well, well, well. We've got a wild one, here.  For sixty-four thousand rupees, Ladies and Gentlemen, the question once again....  Chhatrapati Shivaji Terminus. Sure?  You think so. A brave man, Ladies and Gentlemen, a brave man.  Is the right answer! Sixty-four thousand rupees to you, Sir!  Now we're into the serious money. For two hundred and fifty thousand rupees, ladies and gentlemen, a quarter of a million rupees...the song Chalo Ri Murali was written by which famous Indian poet. Was it A Surdas. B) Tulsidas. C) Mira Bai. D) Kabir. Remember you still have two lifelines- fifty- fifty and Phone A Friend. Tempted to use one?  No?  Oh. I see. An expert on the poets, huh?  The question was, for two hundred and fifty thousand rupees: who wrote the famous song Chalo Ri Murali. I should warn you, Jamal: from this question on, if you get the answer wrong you lose everything. So. Are you sure? The life-lines are there....  Surdas. Apka final jawab?  Computer-ji, A lock kiya-jaye.    So, my friend: ready for another question.  For a straight one million rupees, Ladies and Gentlemen...On an American One Hundred Dollar Bill there is a portrait of which American statesman? Is it A), George Washington, B) Franklin Roosevelt, C) Benjamin Franklin, D) Abraham Lincoln?  Pay or play, Jamal? All you have to do is stop now and you walk away with a cool quarter of a million rupees. Decide to play, get the answer wrong and you walk away with absolutely nothing. But, get the answer right and you win a million rupees. So. You decide. Pay or play?  Get a lot of hundred dollar bills in your line of work, Jamal?  Now I know why my cell phone bill is so high...they pay the chi-wallah in hundred dollar bills!  Woah! We haven't locked the computer, man. You're going to play?  You certainly have. C. Right?  Not confusing your Franklins? Benjamin for Roosevelt?  There's a million rupees at stake and he's never heard of Roosevelt Franklin...I can't bear to look.  No, no. Don't you worry, Jamal. You were asked which statesman is depicted on a hundred dollar bill. You said C. Benjamin Franklin. Ladies and Gentlemen...  Jamal Malik- you chose to play not pay. I'm afraid you no longer have two hundred and fifty thousand rupees....  ...you in fact have one million rupees!  Ready for another question.  For two and a half million rupees. Ladies and Gentlemen. Cambridge Circus is in which UK City. Is it A) Oxford, B) Leeds, C) Cambridge, D) London.  He's smiling. Why does that worry me?  ...if you want a chance to be a contestant on Who Wants To Be A Millionaire, dial the number now.  Ever been to Cambridge?  Ever been to the circus?  Can someone call me an ambulance?  So, Jamal....  You can't remember. Does that mean you did know? Once?  Based on your extensive travelling, right?  I thought you hadn't been to UK.    Cambridge Circus is not in Cambridge? Dare I ask why?  That's the logic that's got him this far, Ladies and Gentlemen. Who are we to argue? So. Jamal. D. Apka final jawab?  Computer-ji, D lock kiya-jaye.  It's been a rollercoaster ride all the way, a pleasure to have you on the show, my friend, but I'm sorry to say that you're....incredibly, absolutely right!  Ladies and Gentlemen, Jamal Malik, the man with two and a half million rupees!  A few hours ago, you were fetching tea for the phone- wallahs. Now you are richer than they ever will ever be. What a player, Ladies and Gentleman! What a player.  For five million rupees, my friend: who invented the revolver? Was it A) Samuel Colt, B) Bruce Browning, C Dan Wesson or D) James Revolver?  A). Samuel Colt. Are you sure?  Final answer?  You had two and a half million rupees. If I may-?  Ladies and Gentlemen, the chi- wallah has done it again! D. Is right! Incredible!  Getting hot in here, isn't it?  What? Am I nervous? You're the one who's in the hot seat, my friend.  What sports do you play?  None. Oh, dear, oh dear, oh dear. Not to worry, there's only ten million rupees at stake... Which cricketer has scored the most first class centuries in history. Was it A) Sachin Tendulkar, B) Ricky Ponting, C) Michael Slater, D) Jack Hobbs.  You've got a cheque for five million rupees in your hands. You've still got two life-lines, Phone A Friend and 50/50. For ten million rupees: pay, play, or bail out. It's still an option. Remember, if you get the answer wrong, you will lose everything like that.  Are you sure you want to do this?  The dreams of so many. On the floor.  Time for a commercial break, Ladies and Gentlemen. I know, I know, I can't stand the tension either. Don't even think about leaving your seat. We'll be back.  You've got the luck of the devil, yaar, I'll give you that.  Oh, the toilet. Sure. Naveed, Jamal wants the bog.  A guy from the slums becomes a millionaire overnight. You know the only other person who's done that? Me. I know what it's like. I know what you've been through.    What? You can't take the money and run now. You're on the edge of history, kid!  Maybe it is written, my friend. You're going to win this. Trust me, you're going to win.  Do the right thing and in approximately three minutes you will be as famous as me.  And as rich as me.  Almost.  From rags to Raja. It's your destiny.  Welcome back to Who Wants to Be A Millionaire? In the chair tonight is Jamal Malik- as if we don't know! In an amazing run, Jamal has already five million rupees but, not content with that, has chosen to gamble for one Crore- that's ten million million rupees. What a player! The question one more time: Which cricketer has scored the most first class centuries in history. Was it A) Sachin Tendulkar, B) Ricky Ponting, C) Michael Slater, D) Jack Hobbs.  That's a start. So, it could be Ricky Ponting, Jack Hobbs or Michael Slater.  Okay. Computer, take away two wrong answers.  Well, you were right about Sachin Tendulkar. The computer has taken away A) Sachin Tendulkar and C) Michael Slater. That leaves you a fifty-fifty choice, Jamal. B) Ricky Ponting or D) Jack Hobbs. What do you think? Decision time. For half a million rupees. Your answer: B Ricky Ponting or D) Jack Hobbs.  You sure? Not B) Ricky Ponting? The Australian? Great cricketer.  Do you know?  So it could be B, Ricky Ponting?  Final Answer?  Computer-ji D lock kiya-jaye.  With one hundred and ninety- seven first class centuries, the answer is...D. Jack Hobbs!  Jamal Malik, Crorepati!  I cannot believe what I am seeing here, tonight, Ladies and Gentlemen....So, are you ready for the final question for two Crore rupees- twenty million rupees?  Maybe, indeed. Okay, okay. For twenty million rupees, the final question on Who Wants to be a Millionaire?  Ohhhhh! Just when I thought I would need a pacemaker fitted, we're out of time! What a show, Ladies and Gentlemen, what a show. Join us tomorrow night to see if Jamal Malik has made the biggest mistake of his life or has just won the biggest prize in the history of Indian television....Same place, same time. You wouldn't dare miss it. Goodnight!  ...if you want a chance to play Who Wants to be a Millionaire, call now...!  This way, Jamal, this way. Great show, my friend. See you tomorrow, huh?  He's a cheat.  Oh, come on! Of course he is. He's a bloody village boy. Even when I fed him the wrong answer the little shit got it right.  Well, I didn't exactly-  Nita?  Hey. Sweetheart. What about me? I'm sweating, here.  So. Tonight. The Calypso Bar.    Welcome back to Who Wants to be a Millionaire? I can safely say that tonight is the biggest night of both of our lives, Ladies and Gentlemen. Jamal Malik, the Call Centre worker from Mumbai has already won one Crore rupees, a cool ten million. Tonight, he can walk away with that in his pocket or make the biggest gamble in television history and go for the final question and a staggering twenty million rupees! Jamal, are you ready for that question?  Big reader, are you Jamal? A lover of literature?  Lucky! In Alexandre Dumas' book, The Three Musketeers, two of the musketeers are called Athos and Porthos. What was the name of the third musketeer. Was it A Aramis, B) Cardinal Richelieu, C) D'Artagnan, D) Planchet.  The final question, for twenty million rupees: and he's smiling. I guess you know the answer.  You don't? So, you're going to take the ten million and walk?  No?  You just said you don't know the answer. I heard that, right? You do understand that if you get the answer wrong, you lose everything? Ten million rupees. A fortune, Jamal.  We're going to the wire, Ladies and Gentlemen, we are going to the wire. The final Life-line. Here we go....  It's ringing.  Doesn't look as if your friend is in, Jamal. Who is it?  - the sort of brother who'd go for a walk on the twenty million rupee question?  You're on your own, Jamal.  Wow! That's cutting it fine. I'm guessing this isn't your brother. This is-  Okay! So, Latika, you want to hear the question one more time? And let's be clear about this. Twenty million rupees ride on your answer. You have thirty seconds. Jamal, please read out the question to Latika.  The question, Jamal.  Fifteen seconds.  Ten seconds. So, Latika, what do you think?  Five, four, three, two, one. Time's up! Your answer.  Oh...  You really are on your own, now, Jamal. Your answer: for twenty million rupees.  A. Because?  Apka final jawab?  Computer-ji A lock kiya-jaye. Jamal Malik, Call Centre Assistant from Mumbai, for two Crore, twenty million rupees, you were asked who the Third Musketeer was in the novel by Alexandre Dumas. You used your final life-line to phone a friend. You answered A. Aramis.....which is...I have to tell you...the correct answer!  Ladies and Gentlemen, Jamal Malik, Crorepati! What a night! We have all been present at the making of history, Ladies and Gentlemen! Jamal Malik, millionaire!  Finally, huh?",
        "Older": "",
        "Jamal": "Yes.  Jamal Malik.  I work in a call centre. In Juhu.  XL 5. Mobile phones.  No, actually, I'm an assistant.  I- I get tea for people and-  The answers.  I know the answers.  Shit. Mummy-ji.  Don't you move a muscle.  Thank you, Mister Gupta. I will deal with these two.  Yes.  No. Yes. No.  Not finished.  It's a shy one. Since when was there a time limit on a crap?    Amitabh? Amitabh Bacchan?  No! Wait! Salim, sala! Salim!  Wait! Amitabh....  Amitabh-ji! Amitabh-ji!  Please. Amitabh-ji.  A thousand thanks, Amitabh-ji.    I have your autograph, oh, holy Amitabh!  Sala! Sala!  You don't have to be a genius.  Like I said.    Yes.  Ask the audience.  How much is bhelpuri at Jeevan's stall on Chowpatty Beach?  One bhelpuri. How much?  Wrong. Fifteen since Divali. Who stole Constable Varma's bicycle outside Dadar Station last Thursday?  Everyone in Juhu knows that. Even five year-olds.  Wouldn't you?  No.  It's going to come. Today. I can feel it.  Salim!  Mister Nandha.  Mister Nandha?  Let's go, bhai.  We should go back.  See if Ama-  What about Jeevan Chacha?  Maybe he-  But he wouldn't hurt-  But-  What shall we do?  Not if we let her in.  She could be the third musketeer.  Where's your Mother?  Father?  I'm Jamal. He's Salim.  I wake up every morning wishing I didn't know the answer to that question? If it wasn't for Ram and Allah, I would still have a Mother.  D) A bow and arrow.  Final answer.  You're from the Juhu slum, aren't you?  My Mother's dead.  I don't have a girl-friend.  Yes.  I don't have a bank account.  But I'll take cash.  - I'll play.  Why not?  Latika! Latika!  Latika!  Latika!  Chhatrapati Shivaji Terminus.  I think so.  Yes. Final answer. Chhatrapati Shivaji Terminus.  I wouldn't be here if she had.  The most beautiful woman in the world.  If I knew, I'd tell you.  No.  I know this one.  Four, nine, zero, nine- the one with the stick going down, Salim- six- stick going up-  Six, one, shit, let's go-  It's okay, Salim.  He must be a very good man to look after these people.  Hey, Salim!  She doesn't want it.  They taught me every song in the history of Indian music.  ...weddings, government things, big parties. If Maman says my voice is ready. Big money.  Easily. Maybe an apartment.  That's what Arvind said. On Harbour Road. You, me and Salim. The three musketeers.  Every day if we want.  It's my turn.  So, this is it, hey, bhai? The good life, here we come....  Porthos?  Really?  Fifty rupees.    Run!  Come on! Faster!  Take it! Take it! I can't reach...  Got to go back. We've got to go back.  Surdas.  Yes.      Where you going?  We criss-crossed the country from Rajasthan to Calcutta. Every time we were thrown off we got back on again. This was our home for years. A home with wheels and a whistle.  Salim? Is this heaven?  So what's that?  Some hotel, huh?  Err-  No, I-  But of course, Madam. Please follow me.  This is....the Taj Mahal.  The Taj Mahal was built by the Emperor Khurram for his wife Mumtaz who was maximum beautiful woman in the whole world. When she died, the Emperor decided to build this five star hotel for everyone who wanted to visit her tomb...but he died in- in fifteen eighty-seven, before any of the rooms were built. Or the lifts. The swimming pool, however, as you can see was completed on schedule in top class fashion.  With respect, Madam, the guide book is written by a bunch of lazy, good-for-nothing, Indian beggars.  And this, Lady and Gentleman, is burial place of Mumtaz.  A road traffic accident.  Maximum pile-up.    It was the best-paid job I've ever had.  This is the Princess Diana seat, Madam. Allow me.  Top-class fashion, bottom-class prices! Shoes for all! Shoes for all!  And life was good.  This is the biggest dhobi ghat in the whole of India, Mister David.  They say that every man in Uttar Pradesh is wearing a kurta that has been washed here at least one time.  I don't know! I didn't do it, did I...? Nothing to do with me...get off!  You wanted to see the `real India', Mister David. Here it is.  You can't do that. Can you?  Does he find her?  We have to go, Salim.  Bombay.  We should have gone a long time ago.  Latika was one of us. A musketeer.  I've got cash.  Dollars.  Enough. I'm getting my stuff.  Yes.  The minimum tip for my services.  It's C. Benjamin Franklin.  I think I just have. Haven't I?  Right. C.  I've never heard of Roosevelt Franklin.  I don't know.  I've heard of him.  They didn't ask me that question. I don't know why. Ask them.  Bombay had turned into Mumbai.  The orphanage had gone, the slum had gone, the people.... all gone. And everywhere was building, building, building.  But I knew she was here. Somewhere she was here.  Evenings, I searched. Days, I worked.  Room service, good afternoon?... Yes, sir. Two chicken burgers, two fries, one cocoa-cola and one mango lassi and a large bottle of mineral water...Bisleri or Himalayan Spring, Sir?...Certainly, Sir. That will be with you in fifteen minutes, Sir. Thank you. Have a nice day.  Two chicken burgers, coke, mango lassi and a bottle of Bisleri.  I'm going to Chowpatti again, okay? Want to come?  We came back to find her.  I'm going to Chowpatti.  But she wasn't.  How do you know?  Here.  One hundred.  No. I swear.  A building. With a clock on it. Trees behind it.  A man- it doesn't say his name. He is sort of bald, but has long hair on the sides.  I am so sorry, Arvind.  Arvind, I am looking for-  I don't know. I haven't sung since- since then. Arvind, I-    I owe Latika.  Please. Is she alive? Arvind, is she alive?  Thank you.  Just two minutes to talk to her.  Come. Quick.  Come with us.  You just killed somebody.  Where did you get the gun?  - shut up, can't you? Just shut up.  Happy?  Service!  We want a room, boy. Executive Class with smoking. Third floor with balcony.  Latika? Salim?  307 here. I want a bottle of Johnny Walker Red Label, beer, wine-  Ah! Chicken....  What kind of chicken?  Hold the line, chutiye. Pop Tarts?  Exactly! A bucket of Pop Tarts, chutiye.  Found some lunghi!  Atcha, atcha.  I'm not!  Where's Salim?  I don't care.  That dance you were doing. In Pila Street. Show me.  Of course.  Salim?  No. Salim....Bhai, you've had a lot to drink...  No.  Salim, no, no....!  Salim...  Salim...  When somebody asks me a question, I tell them the answer.  Where are they?  Where did they go?  Please, Sir. Which way?  Yes. I'm ready.  Oh. Well. She did come back, then she went away when Alfie split up with her and now she's back again.  But it looks as if Alfie still fancies Mo after all, so-  Rajneesh...  - `friends and family'. I know.  Two minutes.  You have to dial when Prem says \"if\". \"If you want the chance to be a contestant on Who Wants To Be A Millionaire...\" That's when they open the lines.  That's what Anjum in Technical says. He put the system in.  Hello, Mrs...  ...Mackintosh from King Gussie.  Kinoosie?  - just down the road from your house, Mrs Mackintosh. Next to the loch.  Loch Big- Loch Ben. Next door to Detective Taggart's flat.  Indeed yes, Mrs Mackintosh. I have to wade through a metre of water every morning.  Yes, yes, Mrs Mackintosh. In my kilt.  It's alright once I've had my porridge, my haggis and a few Scotch whiskies- and the monsoon's nearly over, so-  I don't think that's a good idea. He is a very important man, Mrs Mackintosh-  - and he doesn't like bloody time wasters.  Salim?  I am calling from XL 5 Communications Sir. As a valued customer, we are offering you a free upgrade with our `friends and-  Family.  Hello, Salim.  No.  No. And I've never been to UK before. But I'll still have a go.  Why not?  I can't remember.  I don't think it's Oxford.    Oh, I haven't. And it's not Leeds, because that's Elland Road, Kirkgate Market, Commercial Street, St Peter's-  Well, I don't think it's Cambridge.  Too obvious. There's definitely an Oxford Circus in London, and there's a rowing race between Oxford and Cambridge so there's probably a Cambridge Circus too. I'll go for D) London.      Final answer.  It was self-defence.    Oh. Yes. Sorry.  None.  I'll play.  Liar.  There was no message at reception.  I will never forgive you.  Javed Mehta? The Gangster from our slum? You work for him?  What do you do for him?  What for?  Salim, where's Latika?  Slum dogs never sleep, only nap. He would disappear for a couple of days and come back changed. Sometimes elated-  Sometimes the opposite.  But younger brothers don't interfere. Mostly.  Baba, I am the new cook from the agency. A thousand apologies, I am late for the Memsaab.  Baba, I am your dishwasher!  You've hurt your eye.  To see you.  Why does everyone love this programme?  You have another life. A rich one.  Are you happy?  You don't look so happy with a black eye.  Javed? You are with him?  Immediately, Sir.  Come away with me.  Love.  It won't buy you a new dishwasher, but it might make you happy.  You and me. That is the real world. Come away with me.  Salim will help us.  Where?  Anything.  I'll wait at VT station. Five o'clock every day until you come.  I love you.  You know what I want.  She is my destiny, Salim.  Me, I don't care. Latika? She's already half dead.  You sold her.  I- I need to-  I'm not going to become a milionaire. I don't know the answer.  No, I really don't.  I don't see what else I can do.  Latika! Latika!  Latika!  Latika! Latika!  Latika! Latika!  Salim!  I know it isn't Sachin Tendulkar.  I'll use a life-line. Fifty- fifty.   D. Jack Hobbs.  Or D. Jack Hobbs.  Final Answer. D.  Not really, but...maybe it is written, no?  Latika!  Where? Where is she?  Where?  Where are you? Where is she?  Salim...!  Because I am a slum dog, chi- wallah, I am a liar, right?  Who knows?  Yes.  I can read.  Would you believe it? I don't.  No.  I'll play.  I'd like to phone a friend.  My brother's number, but-  It's the only number I know.  Is that really you?  In Alexandre Dumas' book, The Three Musketeers, two of the musketeers are called Athos and Porthos. What was the name of the third musketeer. Was it A Aramis, B) Cardinal Richelieu, C) D'Artagnan, D) Planchet.  Where are you?   Just...because.  Yes. Final answer. A. Aramis.  Latika? Latika?  Truth alone triumphs? I should have known better.  Latika?  I knew you'd be watching.  This is our destiny.  This is our destiny.",
        "Javed": "Salim! Salim!     You killed him?  My enemy's enemy is my friend, no? So, come in, friend.         First you want a dishwasher, now a bloody cook-  - chup. The cricket's on.  Why do you always watch that shit? Huh? I'm already a millionaire.  Well, come on then, Cook. I'm hungry. Get me a sandwich.  Atcha...    Straight bat, straight bat, dammit.  No! A single!  No, no, no! stupid ben chod idiot...  And what is this shit supposed to be, mader chod? Get out. Get out!  Latika, where's my bloody shirt? The Armani.                What about my bloody whisky, woman?  Hey, Salim.        Salim!     What the bloody-?  Latika! Salim!     Salim! Teri ma ki chute! Salim!",
        "Director": "What the bloody hell is he playing at? He's way off script...  Which one?  Oh, God, that's all we need....  Prem? Tone it down, for goodness sake. You're making him a laughing stock.  It's supposed to be a quiz show, not a blood sport.  Okay, he hasn't got a clue. This is going to be a walk-away. Stand by.  Bloody hell. He's got Prem on the run...  What's going on?  This was you? You called them?  How d'you know he's cheating?  You gave him an answer?",
        "Vision": "Split up with his girl-friend.  All three, I heard. Nita as well. Back with the wife. She's pregnant again.  Oh, for Sharukh Khan...Stand by white out.  No, he's going to play with him, first.",
        "Mixer": "Split up with his girl-friend.  All three, I heard. Nita as well. Back with the wife. She's pregnant again.  Oh, for Sharukh Khan...Stand by white out.  No, he's going to play with him, first.",
        "Police": "He's unconscious, chutiya. What good is that? How many times have I told you-?     It is so kind of you to visit our station, Sir. A great honour.  Oh! A thousand thanks, Sir. Missus Janda will be overcome.      Nearly? Nearly? When Prem Kumar himself has-  Well, well. The slum dog barks. Money or women. The reason for most mistakes in life. Looks like you got mixed up with both. Srinivas, you need the exercise: a trip to VT Station to check on the statue. And lock your bloody bike up.  - yes, yes, Srinivas. The hundred dollar bill.        So? Have you charged him yet?  Progress? Have you charged him?  And if that isn't enough for you...  - yes, yes! The boy's a bloody hero with every beggar and thief in the city. We're in danger of looking very stupid, here, Inspector.  - Prem Kumar himself- a man of great standing and integrity- said the kid was a liar and a cheat. What more do you need?  He's in for fraud, so you charge him for fraud. Fast. Or you'll find yourself on traffic duty at the Gateway of India. Understand?     What happened? To the girl? Latika?         Get me the Inspector on the phone now!",
        "Inspector": "Has he confessed, yet?  You've been here all bloody night, Srinivas. What have you been doing?  A little electricity will loosen his tongue.  Every night I get home, \"why can't we have a/c like Bajan Chacha?  Why don't you care about your poor family, dying in this heat.\" Twenty-four years a policeman and I can't afford bloody a/c.  But you. You've got ten million rupees ek dum guaranteed, yaar? And who knows how much further? Fancy the twenty million, do you?  I think you probably do.  So. Were you wired up? A mobile or a pager, correct? Some little hidden gadget? No? A coughing accomplice in the audience? Microchip under the skin, huh?  Srinivas! Look, it's hot, my wife is giving me hell, I've got a desk full of murderers, rapists, extortionists, assorted bum-bandits...and you. Why don't you save us both a lot of time? Hmm?  He's unconscious, chutiya. What good is that? How many times have I told you-?  Aré wa, Srinivas, we'll have Amnesty International in here next, peeing their pants about human rights. Get him down, tidy him up, for God's sake.  Have you gone soft, Srinivas? Professors, lawyers, doctors, General Knowledge Wallahs never get beyond sixteen thousand rupees. And he's on ten million? What the hell can a slum dog possibly know?      Nearly, Sir.  Clearly, Sir.  Indeed, Sir. The proof. That is all we need.  Allegations?     So, Mister Malik, the man who knows the answers. Talk.        So, Jamal. My five-year-old daughter knows the answer to that, but you don't. Strange for a millionaire genius. What happened? Your accomplice nip out for a piss, did he? Or did he just not cough loud enough?  What?    I'll give you five hundred rupees if you just admit it. You go home, I go home. Everybody happy.  No, you want to go back on the programme and win twenty million rupees, don't you?        And did she come back?  Pretty was she?  Guess not.  Well, well. The slum dog barks. Money or women. The reason for most mistakes in life. Looks like you got mixed up with both. Srinivas, you need the exercise: a trip to VT Station to check on the statue. And lock your bloody bike up.  That's the chutiyé out the way. Now, man to man. How did you know all the answers?  And why would they do that, I wonder?     And what happened to the girl? They blinded her too?     Who's on the thousand rupee note?  It's Gandhi!  Don't get clever or I'll get the electricity out again.  Funny, you don't seem that interested in money.  - yes, yes, Srinivas. The hundred dollar bill.       Only the finest minds in the Mumbai Police Force.  Go check the files, Constable.  You puzzle me, Slumdog. Admitting murder to avoid a charge of fraud is not exactly clever thinking. Now, why would you do that?    Not that incredible. You'd just murdered somebody with a Colt 45, after all.  Let's call it manslaughter, then, shall we?    It is all bizarrely plausible. And yet...  Most of you are.  But you: you're not a liar, Mister Malik, that is for sure. You are too truthful.  Thank you, Constable. All that remains is to work out whether it was manslaughter or murder. Ten years, or life.  I- progress is being made sir.  No, Sir.  That's-?  Whilst I'm not convinced he actually cheated, I have got-  A liar.  Indeed, sir.  Yes, sir.  Not a word, Srinivas.     What happened? To the girl? Latika?      That's why he's on the show.  Just one more thing left, Sir.  If you'd like to come with me.  Thought you might need a lift, Sir.",
        "Prakash": "Stop your time-pass. This is urgent.  Look, kid, I got a bad stomach. It's borderline....  I'm off to Devi's bog. Give me that.",
        "Youngest": "",
        "Salim": "Jamal! Catch it! Catch it!  How could you drop that? It was a sitter.  Vinod! Musketeers coming through!  I know!  Immediately, sir.  Bhai, get out of there. Prakash wants a shit.  Since there was a customer waiting, that's when.  You just lost me good money, you stupid idiot-  It's going to come. Today. I can feel it.  Krishna, quick!  - I saw him. He was with them.  - he was with them!  - shut up, Jamal, can't you? Just shut up!  Ja!  Go away. Ja, ja!  She'll have the Security Guard onto us, standing there.  No.  I am the head of this family, now. And I say no. Piss off, you.  We don't even know what the third musketeer's called.  Useless bloody look-out. What good is she, huh?    Okay, let's go, let's go! It's not a bloody holiday!  Give me that.  What, choté bhai? You got a problem?  Here. For you.  You'll earn double. I'm doing you a favour, Latika.  Chup, Jamal.  I'll drop it.  Triple if it's crying.  Madher chod...!  You're dead, sala.  What?  Yes, Maman.    When I say.  Go!  He'll kill us if we go back. Jamal! He was going to take your eyes out- with a bloody spoon!  She'll be alright. She always is.  Aré, Jamal...  Come.  First class, bhai. Where else?  You're not dead, Jamal.  Wow.  Tourist police!  Aré, sala! Formula One, Formula One! Pit-stop ka speed, Schumacher ka ishtyle  Go, go!  Woah! What are you- Jamal?  Go? Go where?  Don't be stupid. We're making good money here.  Oh, God. Baby brother's in love. With a flat-chested hijra.  A musketeer...Grow up, Jamal. Look, how was I to know they'd beat you up. Here, you can have some of the cash. Come on...  How much?  Wait! Jamal! Ah, shit!  For God's sake. You got some disease? You force me back to this shit-hole, we leave our friends, a good life, loads of money- for this. Isn't that enough?  No, you did, Jamal, not me. Me, I don't give a shit about her. Plenty of pussy in Bombay for Salim. Oh, yes, sir! You should come down the Cages on Saturday night instead of searching for your lost love.    I'm looking for Cherry.  I'm Latika's brother.  Is it her or not?  Shit, she's sexy, man....  No.  Leave him. Get over there.  Money.  Maman never forgets. Isn't that right?  Can't take that risk, Maman. Sorry.  Safety catch.  Come on.  We should be celebrating.  He was going to kill us.  Bought it. Now, I'm going to have to throw this beauty in the sea.  What? Typical. I save your life and you're on at me. All you ever do is mess us up. Whenever you're around-  Why can't you just be happy, huh?  You got what you wanted, didn't you? So, let's celebrate.  Reception!  Have the bags brought up.  Naan, chutney, dal-  I'm looking for Javed-bhai.  I need to see him.  I killed Maman. I'll kill you too. Easy.  Hey.  Come.  I am the elder. And I am the boss. For once, you do as I say.  I saved your bloody life, didn't  - chup, sali.  I am Number One now!  Get yourself a room, bhai.  The man with the Colt 45 says chup.  Now go. Or Gunmaster G-9 will shoot you right between the eyes. Boom. Don't think he won't. You have five seconds. One, two, three, four-  Hello? Hello? Who is this?  Hey. Is someone screwing with me?  Who is this?  Jamal? Is that you? Brother? Where are you, man?...I thought you were dead or something...we had to go, Jamal. Maman's guys. They were searching the hotel...Jamal, say something. Please.  Jamal!  God is good, bhai. God is good.  Maman's boys were after us. Had to skip.  Left a message at reception. Waited weeks for you in Nagpur.  Bhai, I left a message.  I know.  Can you believe it? This was our slum. We lived just there, huh? Now it is business, apartments, call centres...Fuck USA, fuck China. India is at the centre of the world, now, bhai. And I am at the centre of the centre, Jamal. This is all Javed-bhai's.  Who else would protect us from Maman's gang, huh?  Anything he asks.  He is coming. You must go. My card.  You think I am going to let you out of my sight again, little brother? You stay with me now. Ab phut!  Still? She's gone, Jamal. Long gone. Now go. Quick.        Look at it, bhai, look at it!             Why can't you let it alone? You want money, I'll give you money. Girls? I can get you girls.  You're like some crazy man- you're obsessed.  Know what your destiny is, crazy boy? A bullet between the eyes. And after that, he'll kill her. Is that what you want? Huh?  Yes. About that, you are right.    She's doing alright. Get it into your thick head, Jamal. She's not yours and she never will be.     Where you'll never find her. Or me. You could have joined us, you bloody idiot, been one of us. You've lost everything now. Everything.     We're out. I'll just get- Syed.       That boy. He will never give up. Never.  Crazy chutiyé.  Ja. Go.  - just drive. There won't be another chance. Go.  It is not written.  You have to. It'll take you two hours if you drive fast. Here.  For God's sake, hold on to it.  For what I have done, please forgive me.  Go. Have a good life.  God is good.",
        "Latika": "Latika.      Why not?  Well, if there are seconds, Maman is definitely a Saint.  I tell you, Lord Siva is with us.  I don't want it.  Enough for a room?  Really?  Harbour Road! We can have ice cream from Babanji's.  Good luck, Jamal.  Jamal!  Jamal!  Jamal?  Shit, there's thousands here.  You didn't need to kill him.  Yeah. Let's celebrate.  While we can.  Sea-facing, yaar.  Room service!  - chicken.    - aloo gobi, rice-  Pop Tarts!  On the tv. The commercial. Everybody's happy when they have Pop Tarts.  Stay there. Look away.  I'll know if you're looking....  Dunno.  You're a sweet boy, Jamal.  Maman's gang will hunt us. You know that?  Me neither.  You came back for me.  I thought you'd forgotten.  Destiny. Yes.  Thank you.  Salim, please-  Haven't I told you, don't interrupt when I'm watching-  - come inside. I'll show you the kitchen.    Aré wa, Jamal....  Why are you here?  Well. You see me.  It's the chance to escape, isn't it? Walk into another life. Doesn't everyone want that?  Who'd have thought it possible? A slum dog, with all this.  I have five star food, five star clothes. I sleep in a bed, not on the street. From where we come from, Jamal, that is happiness.  You turn up here out of nowhere, telling me I'm not happy: how dare you?  God, Javed will kill you. Here.  -I just thought-  Chutiyé. Away where? And live on what? What can you provide? What have you got, Jamal?  Love. That will feed us, will it?  Where have you been? Get in the real world, Jamal.  You're crazy.  Salim? You still believe in Salim? Jamal...I'll be gone soon, anyway. Bombay's got too dangerous for-  You think he'd tell me?  Now go, before he kills us both.  Coming!    Then forget me.  So what, Jamal? So what?  Now, get out and tell your no- good agency not to send anybody else until they've learnt to cook. You hear?  But-  He'll kill you.  Salim, I....can't.  Come on, come on!  Hello?  Hello? Jamal?  My name is Latika.  Yes.  I'm- I'm safe.  I don't know.  I've never known.  Jamal?  I thought we would meet again only in death."
    },
    "imdb_rating": "8.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZmNjZWI3NzktYWI1Mi00OTAyLWJkNTYtMzUwYTFlZDA0Y2UwXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "The story of Jamal Malik, an 18 year-old orphan from the slums of Mumbai, who is about to experience the biggest day of his life. With the whole nation watching, he is just one question away from winning a staggering 20 million rupees on India'sKaun Banega Crorepati? (2000)(Who Wants To Be A Millionaire?) But when the show breaks for the night, police arrest him on suspicion of cheating; how could a street kid know so much? Desperate to prove his innocence, Jamal tells the story of his life in the slum where he and his brother grew up, of their adventures together on the road, of vicious encounters with local gangs, and of Latika, the girl he loved and lost. Each chapter of his story reveals the key to the answer to one of the game show's questions. Each chapter of Jamal's increasingly layered story reveals where he learned the answers to the show's seemingly impossible quizzes. But one question remains a mystery: what is this young man with no apparent desire for riches really doing on the game show? When the new day dawns and Jamal returns to answer the final question, the Inspector and sixty million viewers are about to find out. At the heart of its storytelling lies the question of how anyone comes to know the things they know about life and love.—Fox Searchlight Pictures",
    "name": "Slumdog Millionaire",
    "genres": [
        "Crime",
        "Drama",
        "Romance"
    ]
}