{
    "filename": "Spanglish_script.txt",
    "imdb_id": "tt0371246",
    "imdb_url": "https://www.imdb.com/title/tt0371246",
    "characters": [
        "Bernice",
        "Deborah Clasky",
        "Monica (as Cecilia Suarez)",
        "Businessman",
        "Georgie (as Ian Hyland)",
        "Evelyn",
        "Cristina (six years old)",
        "John Clasky",
        "Cristina",
        "Luz",
        "Fourteen-Year-Old Boy",
        "Hostess at Fancy Restaurant",
        "Flor",
        "Flor's Husband"
    ],
    "dialogues": {
        "Bernice": "Our gal smiles back in appreciation.             As she leaves.                  She demurs. Bernice holds out one slice on a spatula, indicating Flor should just tear a piece off which she does...One taste and she marvels -- her mouth dropping open at this kid's ability to make something mundane special..Bernice laughs.    Her mother enters on her way upstairs. She is thoughtful, tense and sweaty - her run having failed to exorcise her current demon. She greets Flor and then shakes her head, making a vain attempt to communicate her troubled mood to Flor in some sort of sisterhood based on life being a fucker.       She does..    Evelyn looks transparently vulnerable for a second. Flor reacts. Bernie squeezes her grandmother's hand..Flor smiles.                                              Flor clearly doesn't understand..    She steps behind a closet door to try the clothes on, muttering pessimistically before she does so. CAMERA STAYS ON    And then....silence...Bernie, open mouthed, steps out wearing the clothes which fit like a glove. Flor beams..then laughs at Bernie's reaction as she keeps checking the waist and looks into the mirror.                                             Evelyn shoves her granddaughter for the self- deprecation..Flor says something to her daughter in Spanish.                                                   Deborah has a backpack loaded with books which she hands to Cristina..    Deborah hands Cristina a locket..then, noting Flor's expression.                               Bernice hugs her. Evelyn hugs Cristina..",
        "Deborah": "Our heroine, seeing the blood flow from her aunt's nose, gestures that Monica needs help not conversation.                                          The two visitors exchange a wide-eyed look. Which Deborah sees and understands.    Monica says, in Spanish, \"this woman is very strange. The only thing I understand is she has two kids.\" Deborah leans into Monica. Face to face, tender but unblinking..       Monica squirms - unusual for her.    As Monica paraphrases what has happened, her translation is DIALED DOWN for the:       She pronounces it flat like the \"floor\" we walk on...throughout the following each of the women sticks to their pronunciation as indicated by the extra \"r's.                Flor says to Monica, in Spanish, a tip to pronounce her name. Monica warns Flor to leave it rest..since Deborah is becoming clearly and strangely pissed..       She smiles at Flor, who returns the smile.               She pours some for Flor and Monica. Then she closes her eyes and pauses in utter dedication to a final effort:    It is perfect..Flor grins at Deborah's victory...claps her hands together.    Bernice rises like a shot to take off..    Monica translates..Flor, embarrassed a bit by the directness, ducks the question..saying in Spanish -- \"whatever you say..\"                                                  She hits a switch at the door and the backyard area is now fully illuminated -- set up for a dinner party for 20 or so....all details thought about and done to a \"T\". This is the outdoor lighting nobody nails..the twinkling of a half acre..the path to the pool like a runway to heaven. As she looks at it all she has a wistful moment.       Somewhat crushed, she prepares to exit.                Bernice prepares a plate for her mom while, in the b.g., a GOLDEN RETRIEVER named CHUM approaches Flor from behind with a ball in its mouth. Flor is checking out the kitchen... what's in each drawer, etc .....Deborah is impressed by the self-starter display and indicates same to Bernice.                                                                       He signals her with his eyes and head and then takes a large but tentative step away from the spot where he was standing...then additional faster steps. He gestures with enormous energy for her to follow him to his new spot in the room. She eyes him suspiciously.             He hates that look of isolation on her face..He needs to make her feel better.                                                                                                                                                                                                                   The man translates.    The man says in Spanish to Flor..\"You work for her?\"--Flor answers, \"just tell her that I can't live here.\" Deborah doesn't like that the man has initiated more conversation.       The man tells Flor..she answers directly to Deborah..    The man asks Flor who speaks in Spanish..                              As she turns to gesture toward her mother and son, Evelyn has almost reached them ..                                                                                                                                                         Cristina taking it...    A school bus appears and heads toward them putting a certain deadline pressure on the transaction.    Flor's uncertain reaction is taken as a yes.                                                                                    John holds up a hand to stop her...he needs to gather himself to hear this..She waits...and waits...as he waits he grows flushed and stunned with dread. Finally a word..    He puts up his hand..                                                                                         Evelyn moves to her.    Evelyn shakes her head \"no.\"             The distinct sound of a door opening and closing from downstairs.",
        "Clasky": "",
        "Businessman": "",
        "Evelyn": "She eyes with disapproval her mother's empty glass.                                   but resonant good-natured, affectionate moment between the lush and the Latina.    Spoken to directly like this, Flor is confused..       Deborah enters, carrying a load of packages. With lightning speed, her eye picks out...the glass her mother is drinking from.                                                                                                                                                          Deborah nods in agreement -- then looks at her mother in a somewhat new way..as if Evelyn were an actual person instead of an upsetting extension of herself.",
        "John": "Not the answer she wanted..                                                         She walks to him...he puts an arm around her shoulder. And gestures back to where they were standing. He talks in an almost hushed, conspiratorial voice.                     He is looking at her with wit and conviction..trying to squirt lighter fluid at the flame of their love. Deborah looks up at him..intimacy of a different sort.    She makes a noise of frustration to stop him..It   works. John is rendered still and intimidated by her conduct   but he is \"man\" enough for his jaw to set...to pause for a   beat as he looks her straight in the eye..And walks back to   the spot they occupied previously.                                                The kid nods.. he picks up the fish.       He whispers in John's ear..             He starts to prepare for cooking.       As he works..Let's be clear here...this is that sequence that either kicks out or doesn't..no food channel..no simple knife stuff..something casually brilliant..meticulous...smart and gifted as he prepares the critic's meal.                                                                                     Flor is flabbergasted..she peeks to see if he is actually crying. At first her heart is touched by John but then there is distinct disapproval  that the macho meter can read that low. He looks at her and she faces front quickly.    Reluctantly she re-enters the car..It rolls another ten feet to her bus stop and she gets out again.                                                                                                                                                                                                                         background...He walks to her, sits near her and offers her the glass of water which she takes.    He pats her on the back..She looks at him..    She stops and turns to him.    He taps his heart as an indication of sincerity -- then a flash of worry that he has inadvertently come on to her.    He makes a gesture of ardent love..    Makes a person to person innocent gesture..She finds herself smiling.                                                     Her eyes locked on his.                Cristina nods...not comfortable breaking the rule of only speaking for her mother...She faces him, her back to Flor.    Cristina begins translating as her mother speaks in Spanish..    Flor waves the money..Cristina waves an empty hand as she speaks for her mother.       On hearing the translation of \"sea glass\" an exasperated Flor turns so that her back is to John as Cristina admonishes him.               As his eyes shift to Cristina fearing the word he will hear.          He has no idea where to take it from here -- the two females look as he searches for the right thing to say..    That fast Cristina translates.. Before Flor can react. John talks directly to Flor..quiet,compassionate, a bit beaten.               Flor lets it out...her daughter hard pressed to keep up.    Cristina turns back..confused..her mother asks her for a translation and she complies.. Flor then wearing the same confused expression.                  Flor is confused and getting pissed but he is moving now and pointing a finger at her.    Cristina waits for a comeback from her mother to translate..but doesn't get one..Instead her mother is a bit mortified and considerably humbled..the pie smack into the face.                Flor is worried as John looks right at her..Is he coming on?    Cristina doesn't have to check with her mother on this one.             She waves it off and hurries to get her tape and get out of his way. Chum complicates the task, proffering the ball. Flor wearily throws it.             He staggers out. Flor watches his lonely back for a beat and then urgently gestures Chum to join him. Chum is reluctant, but relenting, runs and accompanies his appreciative master. Flor, now alone, finds herself staring at a framed picture of John in the den. He is younger and smiling. She studies the picture and then blinks when she realizes her own emotion and purposefully goes back to her lessons.                                                              To know you're not just making something out of nothing. That when you think you're at some crossroads - you are.         A sustained gust of wind which celebrates her shape in a way which cannot be ignored.    She sits. It helps.                           I wasn't able to think it that clearly...But that's how I felt. So between odd and the same...you gotta root for odd, don't you?                                                  A shock victim..he holds up a hand to stop her..       She looks at him...a solid beat...    Briefly he does the noise...    She takes that as a cue to start..                        He stops... staggering on the threshold of a diminished future.                                                                                                                                                                             She considers the question totally..He is busy cooking..not realizing how weighty she considers his question...finally aware she has not answered and looks at her..    She regards him levelly..then makes her decision.    He starts to pour.                               Flor looks at him with enormous warmth. Her arms looped around his neck..aware of the music.",
        "Cristina": "As all acknowledge each other Deborah tugs at Bernie's top which is half tucked in.       John goes to a big toy box and opens it up..it is filled with beach paddles, Frisbees and boogie boards.                                                                     She takes them from her pocket.       He smiles broadly. The kid's a trip. He likes her.    He reacts..then..                                And so, for the remainder of the scene, Flor will speak in Spanish and Cristina will not only translate but render her mother's emotion, sometimes including body language. It is not only a translation but a reenactment.             Flor advances on him past her daughter so Cristina now translates from the background.          Reluctantly taking the emotional stance of her mother to deliver the word.    She takes half a beat..finds the word and now spits it out.    John gets up and takes a conciliatory step toward Flor so that now Cristina is in the middle looking up at them as she translates for John       Flor hands John the envelope under her daughter's wrenching gaze. They begin to exit..but Flor turns inadvertently bumping into her daughter. Her voice softens.    They turn to leave. John speaks with sudden volume and muscle.                                                                                   As she shoulders it and almost falls over..",
        "Luz": "",
        "Boy": "",
        "Flor": "Deborah is beginning to feel criticized...she takes a beat..eyes everyone with some hostility.    She feels the tension but, so far in her life, her own irrepressible personality has served her - so she moves forward with surprising and quiet confidence and assurance. She tells her aunt to repeat her words so that now, for the first time, she is, through Monica, talking directly to Deborah.    Deborah feels relief..free for a moment from the dark corridors of self-criticism..She is lighter, prettier, innocent..Wholly and completely attractive.          She notices the French Toast.                   She opens the door and starts to get out though the car is still rolling a bit...    He doesn't quite know what that means...indicates same in a little helpless gesture..                                      Bernie, though her back is to us, does a \"take\" then turns grinning.       Flor extends a blouse and skirt.                                                                                               Is he coming on?..    And when he seeks to add another pat, he misses, because she is out of her chair..(This is as intimate as John has been with another woman since he was married..) He calls out to stop her.                                              Flor advances on him past her daughter so Cristina now translates from the background.          As she spits out the word to her daughter.       John gets up and takes a conciliatory step toward Flor so that now Cristina is in the middle looking up at them as she translates for John       Flor hands John the envelope under her daughter's wrenching gaze. They begin to exit..but Flor turns inadvertently bumping into her daughter. Her voice softens.    They turn to leave. John speaks with sudden volume and muscle.                                       John gestures that there is nothing to be done. Flor nods.                                                                                                                                 He looks at her..Out of nowhere overwhelmed by someone echoing and affirming his deepest most private thoughts about his daughter..It is odd..being this deeply touched before he knows what hit him..He makes little adjustments until the moment passes..                                                                                                                                                            She points to a mall..He looks at her and pulls in.                                                   She gets up on one of the counters and sits there, her feet dangling...sings along a bit in Spanish. He is uncomfortable anew. The nervousness mounting.    He gets out a bottle of vodka.       He looks at her..a beat...he puts the vodka away. Flor beams..we have not seen her smile like this for quite some time.                                                                      She begins to translate the lyrics.    He starts to make a comic gesture of awkwardness to get past the event..she shakes her head at him..driving the words -- pointing emphatically..she will not have her poetry laughed at..    He laughs. She stops cold. Looks down..though just seconds long, this still constitutes the first depression of her life.    He looks at her...they kiss..It is a kiss without an author. God at the controls. They break. There is a beat then..                      He is looking at her...she is disconcerted.    She looks at him..they kiss...tenderness..heat...intimacy.    John considering and then the answer comes to him.                   She then talks Spanish to Cristina..admonishing her not to embarrass them..something about Flor being prepared to go nuts all over her daughter if she hurts their dignity...but it is said with total calm.",
        "Flor's": "",
        "Husband": ""
    },
    "imdb_rating": "6.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMzVkY2UzZTYtNzg1ZS00NDdkLWE3OTItNTFkM2FjODM0ZmUzXkEyXkFqcGdeQXVyMTUyOTc1NDYz._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "Flor Moreno, a penniless single mother of one, emigrates to Los Angeles from Mexico in high hopes of creating a better life for her 12-year-old daughter Cristina. However, after landing a job as a housekeeper for laid-back gourmet chef John Clasky and his well-to-do family, Flor finds herself up against a daunting language barrier--and Deborah, John's troubled wife. Little by little, as Flor struggles to start fresh, and of course, learn English, an inevitable cultural collision is at hand, and a burgeoning romantic affection starts to take over. Will John and Flor ever bridge the linguistic divide?—Nick Riganas",
    "name": "Spanglish",
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ]
}