{
    "filename": "Star-Trek-First-Contact_script.txt",
    "imdb_id": "tt0117731",
    "imdb_url": "https://www.imdb.com/title/tt0117731",
    "characters": [
        "Eiger",
        "Picard",
        "Data",
        "Holographic Doctor",
        "Beverly",
        "Lily",
        "Lt. Hawk",
        "Worf",
        "Troi",
        "Riker",
        "Zefram Cochran",
        "Lt. Barclay",
        "Security Officer",
        "Borg Queen",
        "Geordi (as Levar Burton)"
    ],
    "dialogues": {
        "Eiger": "",
        "Picard": "Signal the Endeavor to fall back. We'll cover them.  Bring us about. Target Borg ship alpha four, port side battery.  Fire.  Starboard battery -- fire.  Ready quantum torpedo.  Go ahead.  Understood. Keep me informed.  On screen.    We'll see about that... Fire.  On screen.  Absolutely.  Mister Data, set a pursuit course. Maximum warp.  Go to impulse. Where's the Borg ship?  What?  And chronometric particles... it's as though they're trying to create a temporal vortex...  Time travel... they're attempting time travel... Full power, Mister Data. Worf, quantum torpedoes at my command!  Worf... torpedo... now!  Where's the Sphere?  Contact Starfleet Command.  On screen.  Life signs?  They must've done it in the past... they went back and changed history...    We have to follow them back... repair whatever damage they've done to that time-line.  Steady as she goes.  Take us in!  Report.  On screen.  What year is it?     Go to manual.  (over above action, to      Fire!     Life signs?  Worf, have Doctor Crusher, Mister La Forge and a security team meet me in Transporter Room Three. Civilian clothes.  In twenty-four hours, Zephram Cochrane is supposed to conduct the very first warp test... from a missile silo in Montana. If I'm right, the Borg were trying to change the course of human history by killing him or destroying his ship.  Normally, I would agree. But in this case, the mission requires a certain knowledge of 21st century history. You're many things, Number One, but you're not much of an historian.  I'll keep in contact. You have the Bridge.  Montana. Energize.  Let's go.  We're here to find Zephram Cochrane. He may be injured or dead.  Yes...  I'm afraid so. If the Borg succeed in preventing First Contact with the Vulcans... Earth will remain in the Second Dark Age... an easy target when the Borg arrive in the 24th century.  How serious is the damage?  Probably from the nuclear warhead. Cochrane was planning to use it to ignite the warp drive.  There should be an access hatch nearby...  I have the password right here.       There should be some kind of manual release...    It's Cochrane.  Picard to Enterprise. Enterprise, please respond.  Mister La Forge, listen very carefully. If you remember your history... in less than twenty- four hours, a Vulcan ship will be passing through this system. When it does, this ship needs to be in space, flying at warp speed.  It's not the radiation... and there's nothing wrong with the combadges... the Enterprise just isn't responding.  As I recall, the town of Resurrection is about two kilometers East of here. They might have a hospital...  It may not be that simple. This is an extremely difficult and paranoid time in human history.  I'm saying they might shoot us on sight. You have to remember... these people have watched their entire way of life collapse around them.  Let's hope so. Because if Cochrane dies... the future may die with him.    Juice?  Beverly -- your tricorder.    Where?     Oh... just a little tinkering. How is he?  Yes. But until then, you'll have to make do with what you've got.  There was some kind of explosion out at the missile silo...  Yes, he is.  Excuse me. I have a... telephone call.  Picard here.  I'm on my way. Picard out.    Oh...  yes... ultraviolet protection. Thank you. Mister...?  Jean-Luc Picard.  Yes.  I was raised in England and here in the States. Thank you for the... no zone.  Oh... here and there. You know how it is.    There's a few of us left.  It wasn't a trick. I used to be an electrical engineer.  I'm an old friend of Cochrane's... I wanted to see how he was doing.  Yes.  I think he was running a test on an old rocket engine... and one of the fuel cells burst.  Something wrong with that?  Thank you. But I've never had much trouble protecting myself.  Can you reconstruct the throttle valve?  We need to launch this ship in under eighteen hours... There must be some design schematics... blueprints...  Wait a minute...  Could you reconstruct the throttle from a photograph like this... if that man wasn't blocking the view?    Ah... yes... but, I didn't realize that --    I'm very sorry.  Yes... I wanted to ask you about some photographs I saw out at the silo. There were three of them... printed on some kind of fabric.  Did you take any other pictures of the rocket?  Yes. I don't have any money right now, but I may be able to get some.  I can try.  No... but sometimes I feel that way. What I meant was, I'd be willing to trade for the photographs.  I'm an old friend... I met him when he was doing his undergraduate work at Cornell back in --  What?  What makes you say that?  Are you always sucha good judge of character?  Were the two of you... involved?    Ruby... I need to talk to you about those photographs. It's very important.  It can't wait until tomorrow...                    I'd say you already have.  We're trying to repair Doctor Cochrane's ship. It's been damaged and --  Myself... and a few other friends of Zephram's.  Some.  A key piece of the ship has been destroyed... and our only hope to reconstruct it is if one of your photographs shows us what it looked like.  We have to launch his ship by tomorrow afternoon.  Or the shielding around the plutonium core will begin to deteriorate. Within a day, the entire silo will become so radioactive that no one will be able to come near it for a hundred years.  Why are you being so difficult? All I'm asking for is to look at one of the photographs. It'll take five minutes.  I am not a thief...  No. He's a man with vision. He can see beyond the problems that surround us. He knows there's a better future out there for everyone... a future where crime, poverty and war are things of the past... a future where we reach out and seek our destiny in the stars. I believe in that future, too, Ruby. I believe in it in every fiber of my being. And I'm telling you... if we don't launch that warp ship tomorrow, there's a very good chance that future will never happen.  You won't regret this.  Where's you get the alloy for the throttle itself?  Mister Lange -- have you brought the computer systems back on-line yet?  Good.  Are we on schedule? The Vulcan ship will be here in less than two hours.  What about our warp signature? It has to be strong enough for them to detect.  Well, with any luck... the Vulcans will land outside Resurrection tomorrow morning... and Earth will never be the same again.  All right. I'd better start familiarizing myself with the flight controls.  Let her in.  That's right.  I assure you, Doctor, that after today... no one will ever call you that again.  That's a promise.       How did Doctor Almack react to that?  Not yet.    What's that supposed to mean?  Regardless of how I may feel about Ruby... our fates lie along different paths. Nothing can change that.  Beverly, there were many reasons why you and I...    Active.  Ready.  Ready to make a little history?  Phoenix to control. Initiating five minute countdown... mark.  We can't leave her out there. When the ship launches... she'll be killed.  She's a very... determined woman. Phoenix to control. Mister Lange... let her in.    It'll have to wait. Come on.  Geordi, can you see into the room?    Get a tricorder. You're going to have to track my exact position in that room...  What do you want?  Invasion.    All right. You want the truth... The Vulcans... are highly intelligent aliens.  From another planet. Oh, I almost forgot... they have green blood and pointed ears.  I'm afraid you've caught me. I am a space-man.  Now, Geordi!  Actually, <u>you're</u> full of shit.    Are you all --  Altitude fifty kilometers...  There's a red light on the second intake valve.  As they used to say... all systems are go.  Bring the warp core on-line. I'll lay in a heading.  <u>Engage.</u>    Passing one-half light speed. The starboard nacelle's running a little hot...  Speed -- two hundred, seventy-five thousand kilometers per second.  One minute to warp threshold...     Their com system must still be down.  Approaching light speed...  We're crossing the threshold!  Bring us about...  Let's begin the landing procedure.  Isn't anyone going to say welcome back?        Captain's log, March 3rd, 2063. The voyage of the Phoenix was a success... again.  And it appears the Vulcan ship has detected the warp signature and is now on its way to Earth.     Doctor Cochrane... this is your moment.  That's right. And they're going to want to meet the man who flew that warp ship.  Zephram, you had the vision to build that ship when no one else on this planet could see beyond their own problems. You flew that ship... all I did was push a few buttons.           I have to...  No. It's a lot further than that.    That's impossible.  This may be hard for you to understand... but I'm duty-bound not to interfere with you, or anyone else here... any more than is absolutely necessary.  Ruby... I'm sorry. But our fates lie along different paths.  Picard to Enterprise. One to...  To hell with fate.  Enterprise. Two to beam up.  How's Mister Data?  Return to our own time?  Then make it so. Have you determined how to recreate the temporal vortex?  Unless you'd like to stay.  Onscreen.  Admiral... what's the status of the Borg fleet?  We're fine, sir. It will take some... time to explain.     Welcome home.",
        "Data": "Dispersive armor is holding.  The Borg ship has modified its shields, Captain. Our phasers will no longer be effective.  Main power still on-line, Captain.  We are approaching the Terran System, Captain.  It has entered Earth orbit. Correction -- it is not in orbit. It is heading directly toward the surface.  Unknown, sir. Suicide tactics are not normally associated with the Borg.  Sensors show a temporal signature emanating from the Sphere. High concentrations of tachyons...  A temporal vortex is forming directly ahead of the Sphere.  Switching to emergency back-ups.  I have helm control.  The vortex is collapsing, sir.     We were caught in the temporal wake from the vortex. It must have protected us from any changes in the time-line.      We are within torpedo range.    Not very well. We met shortly after the Enterprise-E was commissioned. I found her to be a most... promising officer.  I am still having difficulty integrating certain emotions into my programming. Grief, loss, remorse...  No. Human beings do not have that luxury, and neither should I.    On my way, Commander.    It is a new subsystem of Nova Class ships. It regulates hydropressure and temperature variance. Remain here. The gas is highly corrosive to organic material. It would liquefy your flesh on contact.       Ensign Porter?  Ensign... are you all right?    Data to Security. This is Lieutenant Data to anyone who can hear my signal. I need assistance in the Environmental Control Room.                     I am unlike any lifeform you have encountered before. As an android, I am in complete control of my neural net. The information contained there cannot be forcibly removed.  Who are you?  That is a contradiction. The Borg act as a collective consciousness. There are no individuals.  You are the guiding intelligence behind the Borg...?  How do you define perfection?  An interesting definition. But it is not one that applies to me. I am completely artificial. I have no organic components.  It is impossible to imagine sensations for which I have no frame of reference.  I do not know what you are referring to.  It would appear that you are attempting to graft organic skin onto my endo-skeletal structure.    It was... interesting.  Do it again... please.     Different.  My internal sensors tell me the ambient temperature in the room is ten point two degrees Celsius... But my <u>skin</u> tells me it is cold.  My visual acuity has been reduced by seventy-eight percent... and I can no longer perceive light beyond the ultraviolet or the infrared... But I can <u>see</u>.  No. I will not betray my friends.  That is not true. They have tried to help me.  I... do not want this...  I wish to... go back to the way I was.  My creator did not intend for me to experience these things.    Yes...  No... I cannot.  No... no, please... you cannot...  Yes... but the Enterprise... my duty...  No... no, it's so... empty... please... give it back... I need it...  In order to access my neural net... you will need to create a positronic interface. I will tell you how.      No.  I have repaired the weapons array. Phasers are on-line.  I do not understand. The optical data network has been repaired, and all systems are functioning.    I believe so.  I believe I see the problem.  BORG DRONES. The drone is knocked off its feet. -- The second Borg rushes at Data, swings his arm at Data's head. This is the same Borg with the deadly stiletto-tipped DRILL SPIKES seen earlier. The spikes TEAR into the flesh of Data's neck, drawing BLOOD. -- Data reacts in pain. He GRABS the Borg's arm and with android strength KICKS HIM IN THE CHEST at the same time. The Borg FLIES BACKWARD, causing the cybernetic ARM to RIP from its socket in a shower of sparks. -- The Borg Queen SWOOPS down at Data for the kill. But Data's too quick for her. With one swift motion, he turns and THROWS the BORG ARM like a JAVELIN across the room.       You could say that I'm back to my old self.  Her remains... are they still here?  I never realized how powerful an emotion temptation could be.  She was... a unique lifeform. In her own way... nearly perfect.",
        "Holographic": "",
        "Doctor": "How long has he been unconscious?  It looks like he has a cranial fracture, but I'll need X-rays to be sure. Get Ruby in here.  \"APR cell count?\" What the hell are you talking about?  Is it Japanese?  We have two... but we don't have the juice to run them.  Power. There hasn't been a lot of wind through here for the last couple of weeks. Most of the batteries are depleted.  Maybe you'd like to take your patient to the hospital in Bozemen... it's only two hundred miles away.    I told you, there's no --  Outside, around back. Next to the water tank.  What did you do to the batteries?  Ruby, we're going to need a series of cranial X-rays tonight.  I'm a little worried about some of these bone fragments. If they move any closer to the brain, we could be looking at a hemorrhage.  Can you do it tonight? We may have to operate.",
        "Beverly": "Will somebody please tell me where we're going?  Montana? Well, that answers everything. Why the hell are we --    Go where? Hello? Is anyone going to tell me what we're doing here?  Cochrane... the inventor of warp drive?  But he's been dead for three hundred... Oh God... we've gone back in time again, haven't we?  Well, why didn't you just say so in the first place?  This will protect us from the radiation.  There's a life sign behind this door... about ten meters below.  There.  Severe radiation exposure...  I've stabilized him for now... but he's in a coma and he's going to need radiometric therapy. I want to take him to the ship.  Jean-Luc, this man needs medical attention, now.  What are we waiting for? Let's go.  Are you saying they won't help us?  There must be some good people... even in this time.  At least four hours.    It's a... new medical scanner. It's a little more precise than an X-ray machine.  Um... yeah. Now he's going to need a respirator. Do you have one?  Don't you have any generators, or other fuel sources?  His automatic reflexes are fluctuating. We've got to get him on a respirator.  His heartbeat's irregular...  Adrenaline -- ten CC's!    He's stable... for now. But it would be better if we could contact... our friends.  That'll be interesting.  I'll be fine. He's a different story.  The occipital fracture is widening... we're going to have to fuse the bones...     It was an experience. Metal scalpels... needle and thread...    He was so confused by what I was doing, I don't think he even noticed. Any word from the Enterprise?  You think they're still up there?    I saw the way you looker at her... and I know that look.  You want some advice? Don't do this again. You know exactly what I mean.  I'd call them excuses. And the first excuse on both our lists was our \"sense of duty.\" We convinced ourselves that it was more important than anything else. And you know what? It's not.  Did it work?",
        "Lily": "",
        "Lt.": "",
        "Hawk": "What the hell is going on?",
        "Worf": "Port battery, ready sir!  Aye, sir. Only three left.  Incoming message from the Starship Intrepid. Admiral Hayes.  Aye, sir.  Range -- fifty kilometers.  They have traveled into the vortex... through time.  No response. I'm not reading any Starfleet com traffic in this entire sector.  But if they changed history... then why are we still here?  Captain, there are five Borg ships closing in on our position.  Hull integrity down to thirty percent...  Borg vessels are closing to two thousand meters.  Captain, I've found the Borg Sphere. It's on the far side of the planet...firing at the surface.  Phasers are off-line... we have two quantum torpedoes left. But the computer targeting system has been destroyed.  Target...    Target locked!  Aye, sir.  I have assigned two damage control teams to locate the source of our communication problems. So far, they've had no success.  There were no planetary defense systems in this era. Their weapons were designed to fight each other... not extraterrestrials.  A ship-wide decompression has been initiated!    Understood.  Worf to Bridge. We're in position.    There's a dampening field in place on this deck. Our tricorders are useless.  Borg...  Worf to Bridge. We're about to enter the Environmental Control Room.    Stand by, Commander Where's Ensign Hawk?  Something is very wrong, Commander. We're falling back.  Fire at will!    Go, go, GO!  Worf to Bridge -- force fields!  Commander... we have a problem.  We saw at least thirty...and there are twenty-two Enterprise crewmembers reported missing... including Commander Data.  Data's positronic net contains classified information on the Enterprise. Command codes, security protocols...  To control the Enterprise, they'll have to gain access to one of two locations. Main Engineering... or the Bridge.    Mind your post, Lieutenant.  Understood. We're ready.    They appear to be modifying the deflector dish.  It doesn't make sense. The deflector is only used for shielding and long range sensors...  They're re-routing the deflector power conduits...    What kind of message?  We have to stop them from sending that message.  Destroy the deflector dish.  There is another way, Commander. Do you remember your zero-G combat training?           Try not to look at the stars... keep your eyes on the ship.  And Commander, whatever you do... do <u>not</u> vomit in your exo-suit. It would be... unpleasant.     Understood!       Commander, you're five minutes are up!  Strong heart. Weak stomach.  We've lost Bridge control!    Incoming transmission from Starfleet Command. Admiral Hayes.",
        "Troi": "Aye, sir.  Incoming transmission from the Borg.    Population... thirty-five billion... All Borg.  But how?  Captain...?    Captain, they're firing at a nuclear missile silo... in central Montana.  Lieutenant Sandra Farrel.  It appears death was caused by a plasma discharge. I'll note in her record that she never left her post.  Did you know her?  Data... are you sure you're all right?  We still have to make reports on ten more crewmen killed in action. Maybe you should deactivate your emotion chip until we're done.  I will admit... there are times when I wish I had an emotion chip I could turn on and off.  Are we in any danger of being detected by Earth defense systems?    We're venting our internal atmosphere directly into space!  Someone...?  Wil... Data was down there.  Do we have any idea how many Borg we're dealing with?  Even Data?  They're bypassing Engineering...  To do what? If they wanted a weapon, they could've taken over a phaser bank or torpedo bay...  They may be trying to send a message to the other Borg...the Borg in this time period...  Can we aim our dorsal phasers at it?    Good luck.  How long until they can send a message?  Computer -- this is Commander Deanna Troi. Initiate self- destruct in six minutes, thirty seconds. Authorization Troi, gamma six five. Enable.  Prismify the beam. Get rid of that Borg.  I have to admit there was a moment there when --",
        "Riker": "Casualties are light, Captain. Minor buckling on the port nacelle. Nothing serious.    Main power off-line!  We're caught in some kind of energy wake from the vortex...    We're still in Earth orbit.  They've seen us. They're taking evasive action.    Can't tell. Long-range bio- sensors are off-line.  Captain?     Good luck, sir.  Riker to Data.  We're reading some kind of gas leak in the Environmental Control Room. Take a repair team down and check it out.  Assign another team if you need to. I want to re-establish communication with the Captain as soon as possible.  We have to start thinking about a way to get home. Analyze our readings from the temporal vortex. We're going to have to recreate whatever the Borg did to --  Report.  What?  What the hell is happening, Worf?       This is the Bridge. I'm releasing the emergency force fields.  Riker here.  Any sign of Data, or the Borg themselves?  Worf? Is something wrong?  What the hell happened down there, Worf?  All right... we've lost control of eight decks... three Cargo Bays... one Shuttlebay.  We'll have to assume they've been assimilated into the Collective.  If they control Data, they control the ship.  We can't worry about that right now. Let's concentrate on what we can.  We have to cover both possibilities. We'll take care of the Bridge. Worf, take your men and seal off Main Engineering. Turn it into a fortress -- nothing gets in.    Where the hell are they going?  What are they doing?  Deflector dish... why the deflector dish...?  Computer -- magnify grid twenty- one alpha.  Computer -- thermal enhancement.  They're connecting the conduits to subspace communications...    Agreed. Options?  We've lost control of all weapons systems... Transporters are down... we can't get to a Shuttlecraft... and it would take us too long to fight our way down to deflector control...  I remember it made me sick.  I think Mister Worf is suggesting that we go outside for a little stroll...  I guess I'd better get it right the first time.  Ready?  Depressurize.  Just a little queasy...  Right.  I'll keep that in mind.       Worf! I'm going to need at least five minutes!                        Report!  Emergency override!  Riker to Enterprise. Five to beam up.  Riker here. Captain, we didn't get your whole transmission.  Say again, Captain?  He's in Sickbay. Doctor Crusher says he can be repaired... but we have to wait until we...  Yes, sir.  Yes, sir. But Captain... are we... all going back?  No, sir.  Bridge to Engineering. Mister La Forge... initiate the temporal vortex.",
        "Zefram": "",
        "Cochran": "Let me get this straight... you're from the future... I'm about to change history... and all I have to do is sit here and let you fly my ship?  And people say I'm crazy...  Just do me a favor... bring my ship back in one piece.  I wish I could go with you. Is there anything I can do to help?  Since time is short... why don't you pick the top ten and fire away?     Mister La Forge... now I'd like to shake your hand.  My God... they're really from another world?  And that's supposed to be me...  All right. And don't worry -- I'll keep your secret.  Um... thanks.",
        "Barclay": "",
        "Security": "Are you sure you don't want something a little more... sophisticated, sir?",
        "Officer": "Are you sure you don't want something a little more... sophisticated, sir?  The Borg are charging the subspace emitters.  About seven or eight minutes.",
        "Borg": "Restrict search parameters to 1-9- 9-8 through 2-0-8-4.     Your defense perimeter is useless. You will be assimilated.  Your opinion is irrelevant. We are the Borg. Resistance is futile.                             Intelligence... ambition... desire... I bring order to chaos...  It's unfortunate we will have to destroy you to obtain the information we need. You are a... unique lifeform. Synthetic... and yet far more than a simple automaton. You have no idea how close to perfection you are.  A blending of the organic and the synthetic. The highest form of life in the galaxy.  Have you ever wondered what it's like to have flesh?  That... can change.      Data...  You've taken your first step toward perfection. How does it feel?  That's because you haven't been properly... stimulated yet.    What a cold description... for such a beautiful gift.  Was that good for you?     How do you feel?  Until today... your emotions were trapped inside an artificial shell. You didn't know what it was to truly <u>feel</u>. And there's so much more for you to experience.  I will guide you into a world of sensation unlike anything you can imagine. All you have to do... is give us access to your neural net.  They're not your friends... they've held you back... kept you from your destiny...  Have they given you what I have given you? Did they even try?  You're becoming more human all the time, Data. Now you're learning how to lie.  More lies.  Have you ever know a woman? Do you know what it's like to feel her breath on your face... her skin against yours... flesh against flesh?  I'm your creator now.           A Borg in all but name.  A universe of sensation is waiting for you... don't you want to explore it... with me?  Then take the final step... give me the Enterprise... and we can be together... always.  I've deactivated the sensory inputs. That flesh on your body is just meat, now.  You must give me what I want... now. Without the deflector dish, we can no longer send for an early invasion. We must assimilate Earth ourselves. I need this ship.  Isn't it better like this...?  ... is to yourself. Don't make me hurt you again...  And I need to control this ship. Let me into your mind.     Eliminate their remaining defenses. I will send Borg to assimilate the rest of the crew.  Vulcan?       The targeting lock isn't working.  Your diagnostics are in error. I need weapons.  Can you configure it?  Do it.",
        "Queen": "Intelligence... ambition... desire... I bring order to chaos...  It's unfortunate we will have to destroy you to obtain the information we need. You are a... unique lifeform. Synthetic... and yet far more than a simple automaton. You have no idea how close to perfection you are.  A blending of the organic and the synthetic. The highest form of life in the galaxy.  Have you ever wondered what it's like to have flesh?  That... can change.  Data...  You've taken your first step toward perfection. How does it feel?  That's because you haven't been properly... stimulated yet.    What a cold description... for such a beautiful gift.  Was that good for you?  How do you feel?  Until today... your emotions were trapped inside an artificial shell. You didn't know what it was to truly <u>feel</u>. And there's so much more for you to experience.  I will guide you into a world of sensation unlike anything you can imagine. All you have to do... is give us access to your neural net.  They're not your friends... they've held you back... kept you from your destiny...  Have they given you what I have given you? Did they even try?  You're becoming more human all the time, Data. Now you're learning how to lie.  More lies.  Have you ever know a woman? Do you know what it's like to feel her breath on your face... her skin against yours... flesh against flesh?  I'm your creator now.     A Borg in all but name.  A universe of sensation is waiting for you... don't you want to explore it... with me?  Then take the final step... give me the Enterprise... and we can be together... always.  I've deactivated the sensory inputs. That flesh on your body is just meat, now.  You must give me what I want... now. Without the deflector dish, we can no longer send for an early invasion. We must assimilate Earth ourselves. I need this ship.  Isn't it better like this...?  ... is to yourself. Don't make me hurt you again...  And I need to control this ship. Let me into your mind.  Eliminate their remaining defenses. I will send Borg to assimilate the rest of the crew.  Vulcan?    The targeting lock isn't working.  Your diagnostics are in error. I need weapons.  Can you configure it?  Do it."
    },
    "imdb_rating": "7.6",
    "description": "In the twenty-fourth century, the crew of the U.S.S. Enterprise NCC-1701-E has been ordered to patrol the Romulan Neutral Zone by the Federation to avoid interference with their battle against the insidious Borg. Witnessing the loss of the battle, Captain Jean-Luc Picard ignores orders and takes command of the fleet engaging the Borg. But the Borg plan to travel back into the twenty-first century through a vortex with the intention to stop Earth's first contact with an alien race (the Vulcans). Following the Borg sphere, Picard and his crew realize that they have taken over the Enterprise in order to carry out their mission. Their only chance to do away with the Borg and their seductive Queen is to make sure that Zefram Cochrane makes his famous faster-than-light travel to the stars.—Blazer346",
    "name": "Star Trek: First Contact",
    "genres": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYzMzZmE3MTItODYzYy00YWI5LWFkNWMtZTY5NmU2MDkxYWI1XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}