{
    "filename": "Star-Trek-Nemesis_script.txt",
    "imdb_id": "tt0253754",
    "imdb_url": "https://www.imdb.com/title/tt0253754",
    "characters": [
        "Deanna Troi",
        "Commander Donatra",
        "Geordi La Forge",
        "Senator Tal'aura",
        "Senator",
        "Helm Officer Branson",
        "Jean-Luc Picard",
        "Commander Suran",
        "Data /B-4",
        "Viceroy",
        "William Riker",
        "Worf",
        "Beverly Crusher",
        "Praetor Hiren",
        "Shinzon"
    ],
    "dialogues": {
        "Deanna": "Really, Captain, it was a lovely toast.  And you needn't worry.  I'll brief your new counselor on everything she needs to know.    With pleasure, Captain.  It's tradition,Worf.  You of all people should appreciate that! Besides, I've already seen it.  Don't be too sure.  Mother will be there.  You better believe you're engaged!      Do you have a moment, sir?  It's about Data  I've watched him with the B-9 and I'm troubled. Data's desire for a \"family\" is very strong.  I'm afraid he may be investing too much in the B-9.  The B-9 is like a slow child, sir. And Data, in his own way, has assumed the position of a parent or guardian.  I'm afraid he has expectations based on his own experiences.  He'll be disappointed when the B-9 cannot meet those expectations.  I don't believe that, sir.  We've shared many disappointing journeys.  And I you.  Thank you, sir.  They're out there, sir.  I'm only half human.  I would say he's been trained to resist telepathy.  What I could sense of his emotions were erratic, very hard to follow.  I don't know. Sir, the strongest sense I had was that he's more than curious about you.  He very much wants to know you. The same way you want to know him.  Captain, don't assume he's anything like you are.  You should resist the urge to think you know him.   Riker is hard at work over a series of padds.  He has been working for hours.   Will, you need to rest. As ship's counselor, I'm recommending you get me sleep.  We have time. Come to bed.  No!  This isn't real.  You sick bastard!  You're not here.  No...  It was... a violation.    How can you be certain?  Captain -- I might have a way to find them.  The one thing he may have forgotten in the course of battle: me.  He's resisting me.  Remember me?   They're stopping...  But how can he?  He'll kill you.  Let him go.  Data.",
        "Troi": "",
        "Commander": "",
        "Donatra": "I don't blame them.  We can't keep them in the dark forever.  They support your intentions, sir. But they require evidence of your... sincerity.  How long before he has us in the dilithium mines?  Does anyone in this room harbor any illusions about what he means by \"showing proper respect\"?  Should he?  Are you prepared to have your hands drenched in blood?  He'll show them no mercy.  And his sins will mark us all for generations.  Is that what you truly want, Romulans?  I think you should consider that question now -- or else you may have a lifetime to think about it in the dilithium mines.  Captain Picard, Commander Donatra of the Warbird Valdore.  Might we be of assistance?  The Empire considers this a matter of internal security.  We regret you've become involved.  Romulan ale, Captain.  Let's get to work.  Valdore out.  She's losing her cloak!  Stand by all forward disruptor banks!  I'm afraid that drink will have to wait, Captain.  For the moment.  But we're dead in the water.  This is Commander Donatra of the Valdore.  We're dispatching shuttles with medical personnel and supplies.",
        "Senator": "... but if we hesitate we'll lose this important source of dilithium. A trade agreement is in the best interests of the Empire.  Praetor, I recommend we dispatch a diplomatic mission to Celes II to open negotiations.",
        "Tal'aura": "No, sir.  I would say \"negotiation\" is to be advised.  I support all \"diplomatic\" overtures.  But if you will excuse me, Praetor, I have an appointment with the Tholian ambassador.  What's happening to his face?",
        "Picard": "Duty...  A starship captain's life is filled with solemn duty.  I have commanded men in battle.  I have negotiated peace treaties between implacable enemies.  I have represented the Federation in first contact with twenty-seven alien species.  But none of this compares to my solemn duty as... Best man.  Now, I know that on an occasion such as this: it is expected that I be gracious and fulsome with praise on the wonders of this blessed union... But have you two considered what you're doing to? This is all a damned inconvenience... While you're happily settling in on the Titan, I'll have to train a new first officer; no doubt a stern martinet who'll quote the rule book at me and never... ever... allow me to go on away missions. ... Then there's the matter of my new counselor.  Undoubtedly some soft-spoken, willowy thing who'll be probing into my darkest psyche as she nods her head and coos sympathetically.  Isn't that right, Deanna?  I notice Dr. Crusher laughing along with the rest of you.  As most of you know, the doctor will also soon be leaving the Enterprise, to assume command of Starfleet Medical.  Again, I'm forced to ask, Beverly, have you considered what you're doing to little ole' me?! I'll probably get some old battle- axe of a doctor who'll tell me to eat my vegetables and put me on report if I don't show up for my physical on time!  Really, it's not too late to reconsider.  No?  Very well then...  Will Riker, you have been my trusted right arm for fourteen years; you have helped keep my course true and steady.  Deanna Troi, you have been my conscience and best guide, the touchstone to the better parts of myself.  You are my family.  And in proper maritime tradition I wish you full sails and a clear horizon... My friends, make it so.  Please, Beverly, this is hard enough.  The least I could do for you, Deanna.  Besides, you know me... I'm a talking head.  The hell you will.  You know too much about me as it is... Now you promised there are no speeches during the ceremony on Betazed.    I've been saving this.  Chateau Picard 2267.  Batten down the hatches...  They say a vintner's history is in every glass.  The soil he came from.  His past as well as his hopes for the future.  So... To happy endings.  I understand why it would seem confusing.  Certain human rituals -- like weddings, birthdays or funerals evoke strong and very complex emotions.  These rites carry great weight with us because they denote the passage of time.  Will and Deanna joining the Titan. Dr. Crusher going to Starfleet Medical...  Well.  I suppose it does a bit. I'm very happy for them, of course, but I'm going to miss them.  The ship will seem... incomplete without them.  Yes.  And, frankly, I envy them as well.  They've made important choices; they're going to have great challenges ahead of them. New worlds to conquer...  Seeing Will and Deanna today made me think about some of the choices I've made in my own life.  Devoting myself to Starfleet... Not marrying or having children... All the choices that led me here.  You never know what's over the horizon, Data.  Before too long you'll be offered a command of your own.  Data looks at him; he has never really considered this.    New worlds.  Yes Data, brave new worlds...  Won't do what, Mister Worf?  Come now, a big, strapping fellow like you?  What are you afraid of?  What sort of signature?  What do we know about the planet?      I think it's worth a look.  Don't worry, Number One, we'll get you to Betazed with time to spare.    What do we know about the population?  Understood.  Data, Worf, you're with me.  I appreciate your concern, Number One, but I've been itching to try out the Argo.  Captain's prerogative, Will. There's no foreseeable danger... and your wife would never forgive me if anything happened to you.  You have the bridge, Mister Troi!  Thank you, Data. Let's see what she can do.  Mister Worf, if you please.  Mister Worf, accompany Data please.    I can see that.    Data!  Mister Data.  Let's make like the wind.  Be-nign.  Dr. Soong's penchant for whimsical names seems to have no end.  (trying to ignore the  Earl Grey, hot.  Come. Counselor.  Of course, sit down.  You're speaking of emotional investment?  As much as we care for him, Deanna... we have to remember that Data isn't capable of disappointment.  I'm going to miss you.  Acknowledged... ... I'll talk to Data  Admiral Janeway.  Good to see you.    New Praetor?  Understood.  Not with the Romulans.  Just lucky, Admiral.    I'm afraid the Opal Sea will have to wait, Number One... Engage.    A coup d'etat?    Well... it seems we're truly sailing into the unknown.  Keep at it.  Anything you can give me would be appreciated.  Dismissed.  Captain's Log.  Stardate 47844.9. The Enterprise has arrived at Romulus and is waiting at the designated coordinates.  All our hails have gone unanswered.  We've been waiting for seventeen hours.  It's an old psychological strategy, Number One.  To put him in a position of dominance and make us uneasy.    Not yet, Mister Worf.  Patience.  Diplomacy is a very exacting occupation.  We can wait.  No!      On screen.  Praetor Shinzon, I'm pleased to --  Away team.  Transporter room four.  Praetor Shinzon?  And you're not as we imagined you.  Why have you asked for our presence here?  Praetor?    Praetor Shinzon.  We're not here to discuss your lack of a social life.  I would be interested to know what we are talking about.  And the Senate supports you?  Yes.  Yes.  You know I do.  We need to talk, just you and I.  You know I need to verify this.  Picard to Enterprise.  Five to beam out.  When was he... created?    Believe me, Number One; I'm going to find out.  Contact Starfleet Command and inform them of the situation.  I need to know where the hell he came from.  Deanna.  Is he sincere about wanting peace?  How could I not?  I not only know him, Deanna, I am him... and he is me!  What happened?    Not quite.  I envy the hairline.  Yes.  The eyes have it.  How did you end up on Remus?  You're doing this to liberate the Remans?  I have no reason to.  And if you had lived my life you would understand that there is a great responsibility in representing the Federation.  I can't let my personal feelings unduly influence my decisions.  There's so much, and so much of it is dull...  Yes.    After you, Praetor.  So I'm not as tall as you expected?  With a full head of hair.  Shinzon... I'm trying to believe you.  If there's one ideal the Federation holds most dear it's that all men, all races, can be united.  From the first time the Vulcans came to Earth we've sought a future of peace.  Nothing would make me more proud than to take your hand in friendship.  In time.  When trust has been earned.  In time.  Who was it?  What programs were accessed?    ... I thought Thalaron radiation was theoretical.  As I remember, Thalaron research was banned in the Federation because of its bioqenic properties.  Understood.  Keep on it.  I need to know what he has and how to neutralize any threat.  Give me options.   Picard is sitting at his desk, flipping through an old photo album.  He stops and stares at one of the pictures deeply troubled.  We finally see the photo: Young Jean Luc Picard. A serious, unsmiling cadet at Starfleet Academy.  The face before him bears a disturbing resemblance to Shinzon.  The door comm chirps.   Come... ... Beverly, come in.  Remember him?  He was a damn fool.  Selfish and ambitious.  Very much in need of seasoning.  I so wanted to believe Shinzon. But the Thalaron radiation can't be explained away.  Whatever he's after, it's not peace.  Yes.    I wish I could believe that, Doctor.    Permission denied.  If you can possibly endure any more of these assaults.  I need you at my side. Now more than ever I...  Why am I here?    All of this so you could capture me?  What's this all about?  You're not Reman.  I see a young man trying desperately to deny who he is.  I won't defend my life to you.    Think about what you're doing, Shinzon.  Are you ready to plunge the entire quadrant into war to satisfy your own personal demons?  I'm incapable of such an act, and so are you.  It's a mirror for you as well...  What are you doing to Counsellor Troi?  That will never happen.  There'll be another after me.  And another after that.  You'll find we're a resilient species.    Good work.  The download?  A bit less florid, Data.  A weapon.  It'll only work for one of us.  We'll find a way off together. Recommendations?  Alacrity would be appreciated, Commander.  While I find that fascinating, Data, we really need that Goddamned door open!  (trying to figure out the  Can you open the shuttlebay doors?  Well then... only one way to go.  We're about to find out... Power up disruptors and fire on my mark.  Fire!    But the Romulans abandoned the plan...  Dying?  Then he'll come for me as a donor.    His hatred of the Federation is apparent.  He would have built a weapon of that scope for one reason.  He is going after Earth.  And the Romulans invade.  I know how he thinks.  I'm counting on it... We've been ordered to head to sector 3274. Starfleet is diverting the fleet to meet us there.  We can only hope so.  He can't be allowed to use that weapon.  All other concerns are secondary.  Do you understand me?  All hands.  Battle stations.  Captain's Personal Log. Supplemental.  We're heading toward Federation space at maximum warp. The crew has responded with the dedication I've come to expect of them.  And like a thousand other commanders on a thousand other battlefields throughout history, I wait for the dawn.    How far we've come.  Let me know if you need anything.  What makes us who we are, Doctor? Can you tell me that?  Show me our current position.  How long until we reach the fleet?    Yes.  But so much is the same.  On a biological level he is... and I will not accept the idea that there is nothing I can do.  I have a responsibility to try to make a human connection with him.  He may have already rejected my humanity, but you also have a twin.  How can you be sure?  We'll never know what Shinzon might have been.  Had he stood where I did as a child?  And looked up at the stars.  It's interfering with our uplink from Starfleet cartography?    Report.  Worf, prepare a full phaser spread, zero elevation.  All banks on my mark.  Scan for shield impacts and stand by photon torpedoes.  Fire!  Full axis rotation to port!  Fire all ventral phasers!    On screen.  We are.  Why are you here?  And what of the Enterprise?  You know that's not possible.    I know you as well as I know myself, Shinzon.  There was a time you looked at the stars and dreamed of what might be.  Not so long.  I see more than what you are.  I see what you could be.  The man who is Jean Luc Picard and Shinzon of Remus won't exterminate the population of an entire planet! He is better than that!  And what will he do with that life?  If I were to beam to your ship... let you complete your medical procedure, give you a full life... what would you do with the time?  You once asked me about your past. Your history.  When I was your age, I burned with ambition.  I was very proud and my pride often hurt people.  I made every wrong choice a young man can... But one thing saved me... I had a father who believed in me.  Who took the time to teach me a better way.  You have the same father.  So if I gave you my life, what would you do with it?  Would you spend the years in a blaze of hatred as you are now?  Or could you change?  Could you try to remember a mother's touch you never felt?  A father's words you never heard?  Could you do that?  But you want to.  Let me tell you about our father.  Please.  You can still make a choice!  Make the right one now!  On screen.  Your timing is impeccable, Commander.  When this is over, I owe you a drink.      Do you have life support?  Understood --  Counselor?  Make it so.  Savage them!   The viceroy strides out as Shinzon spins to another officer.   Divert power and compensate --  What if we target all phasers in a concentrated attack?    He thinks he knows exactly what I'm going to do...  We've got him!  Deanna, stand by. Open a channel.  I am.  I never told you about my first Academy evaluation, did I?  I received very high marks for my studies.  But I was found lacking in certain other areas. Personality traits, you might say. In particular I was thought to be extremely... ... over-confident.    Deanna, on my mark.     Data, I need you.  Computer.  Auto-destruct sequence Omega.  Zero time delay.  Recognize voice pattern Jean Luc Picard. Authorization Alpha Alpha Three Zero Five --  How long until he can fire?  This isn't about me anymore.  Prepare for a site-to-site transport.  That's an order, Commander.  Negative.     On screen... ... Open a channel.  Thank you, Commander.    Number One. You have the bridge.  To absent friends... o family.   Picard sits at his desk, speaking quietly to someone we do not see.   I don't know if all this has made sense to you, but I wanted you to know what kind of man he was.  In his quest to be more like us, he helped show us what it means to be human.  No, he wasn't... But his wonder and his curiosity about every facet of human life helped all of us see the best parts of ourselves.  He embraced change... because he always wanted to be more than he was.  Well, I hope someday you will.  On my way.  Please notify Commander Riker... ... We'll talk later?  I'm sorry you won't be here for the re-fit, but I know the Titan needs you immediately.  The Titan's a fine ship, Will.  And she's getting a captain worthy of her.  I promise you in time, she'll become your home... If I could offer you one piece of advice?  When your first officer insists that you can't go on away missions... Ignore him --  The honor was mine.  Captain Riker.    Not tonight, I have work here.  Welcome aboard, Commander.  I hope, your transfer didn't come as too much of a surprise.  I needed you immediately to help oversee the re-fit... ... Your service record on the Talos is exemplary, but there are a few things I would like to discuss with you regarding my requirements for a First Officer.  Shall we say dinner in my quarters at 1900 hours?  Commander, I don't know how they did it on the Talos, but we have door chimes on the Enterprise.  We use them.  What's this?  Let's give it a try.  Feels good.  It's about time.  Commander, please sit down...  ... We've received our first assignment.  We're going to be exploring the Denab system.  It should be exciting.  It's a place... where no one has gone before.",
        "Suran": "The fleet commanders are nervous. They've agreed to remain at their given coordinates and await his orders.  But they're anxious to know what's going on here.  They're holding position.    How many Warbirds will you need?  Praetor.  You have the whole fleet at your disposal.  They supported the coup, they'll follow you.  But surely --  ... then I don't understand the reason for the delay!  And bringing the Enterprise here?! What possible purpose could that serve?!  Then perhaps you will enlighten us?      And mine is wearing thin, young man!  We supported you because you promised action.  And yet you delay and you waste your time playing games with Picard while --    I want opinions.  He is clearly out of his mind.  But can he complete his mission?",
        "Data": "Ladies and Gentlemen and invited Tran gendered species... In my study of Terran and Betazoid conjugal rites I have discovered it is traditional to present the \"happy couple\" with a gift.  Given Commander Riker's affection for archaic musical forms I have elected to present the following as my gift in honor of their conjugation.  If you please, Mister Band Leader, a-one and a-two and...    To happy endings.  Sir.  I noticed an interesting confluence of emotion at the wedding.  I am familiar with the human concept of tears through laughter and its inverse, laughter through tears, but I could not help wondering about the human capacity for expressing both pleasure and sadness simultaneously.  And you were particularly aware of this feeling because Commander Riker will be leaving to assume command of the Titan?  And this makes you \"sad\"?  That is because you have a familiarity with them.  You can predict specific reactions and behavior and are comfortable in that knowledge.  The choices I made have led me here as well.  This is the only home I have ever known.  I cannot foresee a reason for leaving.  If I were... I believe my memory engrams would sense the absence of your specific reactions and behavior.  I would \"miss you.\"  To new worlds...  Since positronic signatures have only been known to emanate from androids such as myself, it is logical to theorize that there is an android such as myself on Kolarus III.  I thought only me, myself and Lore.  Isolated pockets of humanoids.  It appears to be a pre-warp civilization at an early stage of industrial development.  The closest signature is two kilometers to the west... that direction, sir.  I will always be baffled by the human predilection for piloting vehicles at unsafe velocities.  (monitoring with  It appears to be... ... an arm.  Like me, it has been designed with modular power sources.  The next signature is one kilometer to the south.  The final signature is approximately 300 meters up that incline.  Ten meters...  I think it unlikely you will need your phaser to recover the cranial unit.  Of course, it could bite you.  The resemblance is... striking.  You are not looking at yourself. You are looking at me.    Fascinating...  Commander!  Thank you.  He is very observant.    Because the captain has to concentrate on piloting the vehicle.  Sorry, sir.  Our eyes are identical, Doctor.    Can you tell me how you came to be on the planet where we found you?  Yes, please continue.  Do you know who I am?  No.  My name is Data... I am your brother.  As you can see the habitable half of Remus is always in darkness because, like Mercury, one side always faces the sun.  Due to the extreme temperatures on that half of their world, the Remans live on the dark side of the planet.  Almost nothing is known about the Reman homeworld, although intelligence scans have proven the existence of dilithium mining and heavy weapons construction.  The Remans themselves are considered an undesirable caste in the hierarchy of the Empire.  Starfleet intelligence was only able to provide a partial account of his military record.  We can infer he is relatively young and a capable commander.  He fought seventeen major engagements in the war.  All successful.  Beyond that, we know nothing.  At present he serves no useful function.  Dr. Soong created us to become active and useful members of society.  I do not believe he would have wanted the B-9 to live out his life in his present state.  Captain Picard agrees that the B-9 was probably designed with the same self-actualization parameters as myself.  If my memory engrams are successfully integrated into his positronic matrix, he should have all my abilities.  I feel nothing, Geordi.  It is my belief that with my memory engrams he will be able to function as a more complete individual.  Yes.    Can you remember our father?  Do you know the name of the Captain of this vessel?  Is that your final answer?  What purpose does this serve?  Dr. Soong must have found it unnecessary in later versions.  No, I do not mind.  But I believe he will prove incapable of performing higher functions.    No, remain with Commander La Forge. He is going to try to make you well.  Captain...   The B-9 sits placidly in a chair, staring forward.  Then, as if a switch was thrown, he moves.  He quickly rises and goes to a computer console.  He efficiently starts punching in commands at an amazing velocity.   Doctor, will you excuse us for a moment?  Geordi, please come with me.  Data to Captain Picard.  Geordi and I have identified the source of the unauthorized computer access.  And, I believe, we have also discovered an opportunity to gain a tactical advantage.  Sorry, sir.  I thought it added a touch of reality to the performance.  My mission was a success, sir.  I have discovered the source of the Thalaron radiation.  He believes he has our communications protocols.  But they will give him inaccurate locations for all Starfleet vessels.  Move, puny human animal.  Aye, sir... This way.  This entire ship is, essentially, a flying Thalaron generator. All its power relays lead to that device.  It would appear so.  Geordi equipped me with the prototype for the Emergency Transport Unit.  I recommend you use it to return to the Enterprise.  Yes, sir.  There is a shuttlebay 948 meters from our current location.  This way, sir!  (looking at door security  They are trying to override the access codes.  Reman is really a most complex language with pictographs representing certain verb roots and --  According to the ship's manifest they are Scorpion-class attack fliers.  Port thrusters, sir.  Would you like me to drive?    Do you think this is a wise course of action?  Ready, Captain.   Data stands before the B-9.  The B-9 has been deactivated, he stands lifeless and immobile.  Data gazes deeply into his double's identical features.  Then he opens a panel in the B-9's neck and uses a small instrument to activate the android's head.  The B-9's eyes spring to life.  He looks at Data.   No, I have only activated your cognitive and communication subroutines.  Because you are dangerous.  You have been programmed to gather information that can be used against this ship.  I know.  Do you know anything about Shinzon's plans against the Federation?  Do you have any knowledge of the tactical abilities of his ship?  No.  I must deactivate you.  Indefinitely.  A long time, brother.  At our current velocity we will arrive at sector 3274 in approximately 40 minutes.  Of you?  I do not agree.  Although you share the same genetic structure, the events of your life have created unique individual.  He would deny a \"human\" connection is possible.  He considers himself entirely Reman.  No, sir, it is not possible.  The B-9 is physically identical to me, although his neural pathways are not as advanced.  But even if they were, he would not be me.  I aspire, sir.  To be better than I am.  The B-9 does not.  Nor does Shinzon.    Yes, sir.  The Rift effects all long-range communications --  We are losing dorsal shields --  Aft shields are down to forty percent.  Forward shields are down to ten percent.  We have lost structural integrity on decks twelve through seventeen, sections four through ten.  Captain, we have lost ventral shielding on deck twenty nine.  The Scimitar's shields are still at seventy percent.  It would make no difference, sir.  We are being hailed.  Sir, allow me to go.  You are needed here.  Sir...  Counsellor Troi, please assume command.  Geordi, if you will come with me.  What is our approximate distance?  Thank you.  Thank you, Geordi.  Deactivate the field.  Goodbye.",
        "Viceroy": "But in darkness, there is strength.  Don't you agree?  Yes, Praetor.  Enterprise.  We are the Reman Warbird Scimitar.  I am not Shinzon.  I am his Viceroy.  We are sending transport coordinates.  This is a mistake.     The Viceroy, in a kind of trace, kneels before a small flame. Shinzon kneels across from him.  The Viceroy raises his head.   The bond is broken.  No -- this is wasting time.  It's accelerating.  You have no more time for games.    So, human... you've met your better self!  I'm preparing her for Shinzon... To sooth him as she soothes you.  To stand at his side as she does at yours.  Listen to him, android.  Such a small and weak creature.  Yet he roars so valiantly... It would take me but an instant to tear that valiant heart from your chest.  I look forward to the sport. Take him.  Where's Picard?  A matter of hours now --  If you don't begin the procedure soon you'll never make it back to Romulus.  You shouldn't have delayed.  You should have killed Picard the moment --      She's almost on us.  Praetor...  No!  She is here.",
        "William": "",
        "Riker": "No, no speeches.  No clothes either.  I don't think we're going to see much combat on Betazed.    Thank you, sir...   (Deanna shoots him a  Engage.    Sir --  Geordi?  (quickly tapping his comm   We're going sailing on the Opal Sea.  We've booked an old-fashioned solar catamaran.  Just us and the sun and the waves.  Well, that sounds relaxing too.  So they've got him up and running.    Captain, you have an Alpha Priority communication from Starfleet Command.  Romulus?  But they also have the reputation of being formidable warriors.  In the Dominion War, Reman forces were used as assault troops in the most violent encounters.  We have to assume he had Romulan collaborators.  The Praetor's power has always been the Romulan fleet.  They must be behind him.  Why don't they answer our hails?  It's working.  Captain, with all due respect to diplomatic protocols -- the Federation Council's not sitting out here, we are.  (slowly rising from his  She's not out for a pleasure cruise.  Not very chatty.  You seem very familiar with our personnel.  Why?   Riker is hard at work over a series of padds.  He has been working for hours.   Some honeymoon.  Imzadi, what am I going to do with you?  Deanna?!  What's with the name calling?    Keep at it, Geordi.  Find a way in.  Worf!  Lock on transporters!  He wasn't designed to live a complete, human life span. Can anything be done for him?  That's why he went to all that trouble to capture you. How long does he have?  Sir?  Oh boy.  Destroy humanity and the Federation is crippled...      Strength in numbers?  Yes, sir.  He's firing through his cloak.  We can't get a lock.    Unless we can disable his cloak we're just going to be firing in the dark. Agreed.  Believe it or not, I think the cavalry has arrived.      Evacuate those decks and reroute field power to forward shields.  Let's go.  Worf.  Don't worry -- Hell is dark.  Sir?  She's the most beautiful ship I've ever seen. ... But she's not the Enterprise.  Anything.",
        "Worf": "Romulan ale should be illegal.  Then it should be more illegal.    I am not a swinger.  I am unwell.  I was not suited for the life of a... diplomat.    A warrior does not appear without his clothing.  It leaves him... vulnerable.  I won't do it.  Captain.  I think it is inappropriate for a Starfleet officer to appear... ... naked.  I'm picking up an unusual electromagnetic signature from the Kolarin system.  Positronic.      It's you.  No.  Thank you.   If you wouldn't mind.  Captain!    Worf to Commander Riker.  I have the tactical manifests ready, sir.  It seems a very... soft honeymoon.  A Klingon honeymoon begins with the Kholamar desert march where the couple bonds in endurance trials. If they survive the challenge they move on to the Fire Caves of Fek'lhr to face the demons of Gre'thor.  It is... invigorating.  He's a very unusual android  Sir,  I recommend we raise shields.    Captain -- !  (quickly analyzing  We're being hailed.  You are human.    Sir, we've had an unauthorized access into the main computer.  No response to our hails.  Long range communication is impossible as long as we're in the rift --  Aye, sir  Minimal damage to the Scimitar.  Sir, we're being hailed.  We're being hailed.  Aye, sir.  Intruder alert!    Captain, the Hemingway has arrived to tow us to spacedock.  You don't understand the Captain -- there should be no changes until we have discussed the modifications with him.    I told him you're comfortable with your old chair.",
        "Beverly": "It'll serve you right.    If you start tearing up I promise to beam you out.  Level one medical emergency.  There's no crying in Starfleet.  Commander Worf... Do Klingons swing?  Don't worry, I'm a doctor.  I'm so glad you made it back to the Enterprise before I left.    I think you have nicer eyes.  Excuse me.  I have some diagnostics to run on some medical scanner things.  There's no doubt, Captain.  Right down to your regressive strain of Shalaft's Syndrome.  He's a clone.  About twenty-five years ago.  They probably used a hair follicle or skin cell.  It has the ability to consume organic material at the subatomic level.  I can't overestimate the danger of Thalaron radiation, Jean Luc.  A microscopic amount could kill every living thing on this ship in a matter of seconds.  You're working late.  He was a bit proud as I recall.  He turned out all right.  Is he very much like you were?    Aside from slightly elevated adrenalin and serotonin levels, you're completely normal.  Will, I need to talk to you.  The more I studied his DNA the more confusing it got.  Finally I could only come to one conclusion... Shinzon was created with temporal RNA sequencing.  He was designed so that at a certain point his aging process could be accelerated to reach your age more quickly, so he could replace you.  As a result the temporal sequencing was never activated.  Remember, he was supposed to replace you at nearly your current age.  He was engineered to skip thirty years of life.  But since the RNA sequencing was never activated, his cellular structure has started to break down.  He's dying.  Not without a complete myelodysplastic infusion from the only donor with compatible DNA. But that would mean draining all your blood.  I can't be sure but the rate of decay seems to be accelerating.  But we do have one advantage. He needs your blood to live.  He might come after you first.    Jean Luc... ... He is not you.  You can't imagine them, Jean Luc. They're kids!  All with advance degrees in xenobiology and out to conquer every disease in the quadrant.  They're running me ragged.  Nothing but questions day and night... I love it!  Come to dinner and I'll tell you all about it.  There's a Bajoran band at the officer's mess.  Soon then.  I'll save the last dance for you.",
        "Crusher": "",
        "Praetor": "Senator Tal'Aura, you disagree with the motion.  Then I will call for a vote on the motion to open trade negotiations with Celes II...  Would someone please tell me what that was? Alert security --  -- and have them run a --",
        "Hiren": "",
        "Shinzon": "Consider it  The great symbol of the Empire... But the bird-of-prey holds planets.  Romulus, Remus. Their destinies conjoined...  Yet for generations one of those planets has been without a voice. We will be silent no longer.  Join us, Commanders.  Now what's the disposition of the fleet?  And?  It's imperative we retain their allegiance or our great mission will be strangled before it can truly draw breath.  And they'll have it. Tell the fleet that the days of negotiation and diplomacy are over. The Almighty Federation will fall before us.  As I promised you.  The time we have dreamed of is at hand.  The time... of conquest.  Cut off the dragon's head and it cannot strike back.  None.  The Scimitar will serve my needs.  I came this far alone... We came this far alone.  We require no assistance from the fleet.  Now leave me to my thoughts.  Are we prepared?  So many years for this moment. Bring him to me.  I hope you'll forgive the darkness... we're not comfortable in the light.  Captain Picard... Jean Luc Picard... I don't mean to stare, it's just -- well, you can't imagine how long I've been waiting for this moment.  I always imagined you taller, isn't that odd? You may scan me without subterfuge, Commander Data.  No?  Commander Worf. I greet you as a valiant warrior... and as my brother.    Deanna Troi of Betazed.  Empathic and telepathic abilities, ship's counselor.  All of this I knew... But I didn't know you were so beautiful.  I am, Commander Riker... ... May I touch your hair?       Unity, Captain!  Tearing down the walls between us to recognize we are one people.  Federation and Romulan.  Human and Vulcan and Klingon and Reman.  I'm speaking of the thing that makes us the same. We want peace.  I want to end the centuries of mistrust.  I want to be your ally, not your enemy.  As a first step I propose we eliminate the Neutral Zone and begin a free and open exchange of goods and ideas.    Right now, you're thinking this all sounds too good to be true?  And you're wondering why the Scimitar is so well armed.  Is this the ship of a peacemaker?  Or a predator? ... But you're also thinking the chance for peace is too promising to ignore.  Above all, you're trying to decide if you can trust me.  Then perhaps the time has come to add some illumination to our discussion.  Computer, raise lighting four levels.  Allow me to tell you a story that I hope will clarify my position. When I was very young I was stricken with an odd disease.  I developed a hyper-sensitivity to sound.  The slightest whisper caused me agony...  No one knew what to do.  Finally I was taken to a doctor who had some experience with Terran illnesses and I was finally diagnosed with Shalaft's syndrome.  Do you know of it, Captain?  Then you know it's a very rare syndrome.  Genetic.  All the male members of my family had it. Eventually I was treated.  Now I can hear as well as you can, Captain.  I can see as well as you can.  I can feel everything you feel. In fact, I feel exactly what you feel.  Don't I, Jean Luc?  Do you trust me now?  Come to dinner on Romulus tomorrow. Just the two of us.  Or just the one of us.  I know.  Tomorrow then, Captain.  We have so much to discuss.  Imzadi.  This is so good.  He can never know you as I know you... He can never touch you as I touch you.  Can you feel my hands... are they real?  Can you feel my lips, my loins?  I'm with you, Imzadi...  I'll always be with you now.  Now and forever...  You don't have to understand.  I have a purpose.    You must learn patience, Commander. Do you know where I learned it?  In the dilithium mines of Remus. Spend eighteen hours every day under the lash of a Romulan guard's whip and you'll soon understand patience.  Now go.  I have some personal business.  And when I was ready they were going to replace you with me, an exact biological duplicate.  Put a Romulan agent at the heart of Starfleet to influence your command structure.  It was a bold plan.  As happens so frequently here on Romulus, a new government came to power.  They decided to abandon the plan -- frankly, I think they were afraid I'd be discovered and it would lead to war.  They weren't ready for that.  Romulan ale -- I'm surprised.  I can't stand it.  It's not quite the face you remember.  A lifetime of violence will do that.  My nose was broken four times.  And my jaw... But so much is the same.  The eyes, you recognize the eyes.  Our eyes reflect our lives, don't they?  Yours are so confident.  They sent me there to die.  How could a mere human survive the dilithium mines?  It was... ... I was a slave.  And a monster. The only thing the Romulan guards hated more than the Remans was me. But one man took pity on me: the man who became my Viceroy.  He taught me how to survive.  And in that dark place, where there was nothing of myself, I found my Reman brothers.  They showed me the only kindness I ever knew.  For thousands of years the Romulan Senate has met in this chamber and dictated the fate of its sister- planet... But the time has come for us to live as equals.  No race should be a slave to another.  You don't trust me.  Of course you do.  If you had lived my life and experienced the suffering of my people... you'd be sitting where I am now.  At least I hope you would.  All I have is my personal feelings. I wasn't raised with the ideals of the Federation.  But I'm trying to understand them now.  To live up to them   To live up to you.  I want to know where I come from. The Remans gave me a future.  You can tell me about my past.  Were we always explorers? No.  I was the first Picard to leave Earth.  It caused quite a stir, In fact.  But I had spent my whole life...    And you dreamed about what was up there.  About...    I always hoped I would hit two meters.    I know.  I'm honored to think I might someday speak with such eloquence.  In time, Jean Luc.  He's gentler than I thought.  And he has a sense of humor.    We'll return to the Scimitar. Prepare yourself for the bonding.  Imzadi...      I can feel your desire, Deanna...  I can feel your hunger to know the Reman ways... the old ways.  Don't fear what you desire...  Find her again.  Do as I tell you!    Have the doctors prepare.  I'll be on the bridge.  Transport.  Welcome home. Begin the download.  Tea, hot.  Hello, Jean Luc.  I was lonely... Perhaps I'm not aging as well as you did.  I need a sample of your blood. What do your Borg friends say? Resistance is futile.  Yes.  The bait you couldn't refuse. I learned there might be an existing prototype from a Cardassian historian, then went to a great deal of trouble to find it and scatter it about on Kolarus III.  I knew it would pique your curiosity and conveniently make the Enterprise the closest ship to Romulus when I contacted Starfleet.  Don't be so vain.  After we found it, we made a few modifications. An extra memory port, a hidden transponder.  Perhaps your eyes will be a bit less confident when you learn I've gained access to Starfleet's communications protocols.  I now know the location of your entire fleet... ... You may go.  Out of my sight.  Maybe I'll train it to do little tricks for me like your robot does. Or maybe I'll snap its ugly head off.  It's about destiny, Picard.  About a Reman outcast who --  And I'm not quite human.  So what am I?  What do you see? Do you see a life you might have led?  Lost youth never to be recaptured?  I see an old man, set in his ways, afraid to live without a uniform to prop him up and a Starfleet regulation to tell him what to do. I see the man I will never be.  My life is meaningless as long as you're alive.  What am I while you exist?  A shadow?  An enigma?  Oh, but it does.  We will no longer bow like slaves before anyone.  Not the Romulans and not your mighty Federation.  We're a race bred for war.  For conquest.  It amazes me how little you know yourself.  I think the facts speak for themselves.  The same noble Picard blood runs in our veins.  Had you lived my life, you'd be doing exactly as I am.  Look in the mirror, and see yourself.  Consider that, Captain.  I can think of no greater torment for you.  Not for long, Captain. I'm afraid you won't survive to witness the victory of the echo over the voice.  Tractor beam!  Now!  The Enterprise is immaterial!  They won't make it back to Federation space.  I thought we discussed patience, Commander.  Commander Suran, the games are over.  In two days the Federation will be crippled beyond repair. Does that satisfy you?    How long?  How long until we reach the Rift?  Target weapons systems and shields. I don't want the Enterprise destroyed.  Can you learn to see in the dark, Captain?  You're too slow, old man. Attack pattern Shinzon Theta.  Captain Picard, will you join me in your Ready Room?  You can't trace my holographic emitters, Captain.  So don't bother.  And you can't contact Starfleet.  We're quite alone.  It's just the two of us now, Jean Luc, as it should be... Your ship and mine... You and me.  To accept your surrender.  I can clearly destroy you at any time. Lower your shields and allow me to transport you to my ship.  I have little interest in your quaint vessel, Captain.  If the Enterprise will withdraw to a distance of one hundred light years, it will not be harmed.  I know... you'll all gladly die to save your home world.    Childish dreams, Captain.  Lost in the dilithium mines of Remus.  I'm what you see now.    Yes.    That's your life... not mine.  It's too late.  I have no choices!  I can't fight what I am!  I'll show you my true nature.  Your nature.  And as Earth dies -- remember that I'm forever Shinzon of Remus!  And my voice will echo through time long after yours has faded to a dim memory.  Disable their weapons!  Report!  Target the flanking Warbird.  All forward disruptor banks on my mark.  Let her pursue -- drop cloak on the aft port quadrant and prepare for full emergency stop.  You heard me.  Not yet.   Restore the aft cloak.and bring us about.  Prepare a lateral run -- all starboard disruptors.  What is it?!  Focus on your job!!!    Get the cloak back!  And target shield coordinates beta three.  All disruptors.  Fire!  Open a channel.  I hope you're still alive, Jean Luc.  Don't you think it's time to surrender?  I'll have my cloak back in a matter of minutes and your poor ship is shot to pieces.  Why should the rest of your crew have to die?   Divert all power to engines.  Full reverse!  Target disruptors.  Destroy them.  Deploy the weapon.  Kill everything on that ship.  Then set a course for Earth.  Our greater goal is more important, brother.  Some ideals are worth dying for, aren't they, Jean Luc?  I'm glad we're together now -- our destiny is complete."
    },
    "imdb_rating": "6.4",
    "description": "After a joyous wedding between William Riker and Deanna Troi, Captain Picard and the Enterprise crew stumble upon a positronic signature which results in a prototype version of the android Data. Then the Enterprise is invited to Romulus to negotiate a peace treaty with the Romulans by their new leader, Praetor Shinzon. However, Shinzon is revealed to be a clone of Picard who was raised on Remus, a slave planet to the Romulans. Later on, Picard discovers that this peace treaty was nothing more than a set-up on account of the fact that Shinzon needs Picard in order to survive. But little do the Enterprise crew know that Shinzon also plans to do away with the Federation by unleashing a weapon that could destroy a whole planet.—Blazer346",
    "name": "Star Trek: Nemesis",
    "genres": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYTg5MGU2ODktODhmMC00NGIyLWJlYTAtMGEyMTFjYTVmZWVjXkEyXkFqcGdeQXVyMjI0NTA4NzA@._V1_QL75_UY281_CR3,0,190,281_.jpg"
}