{
    "filename": "Star-Trek_script.txt",
    "imdb_id": "tt0796366",
    "imdb_url": "https://www.imdb.com/title/tt0796366",
    "characters": [
        "Spock Prime",
        "Uhura (as Zoë Saldana)",
        "Chekov",
        "Gaila",
        "Scotty",
        "George Kirk",
        "Sarek",
        "Nero",
        "Kirk",
        "Amanda Grayson",
        "Sulu",
        "Bones",
        "Spock",
        "Winona Kirk",
        "Pike"
    ],
    "dialogues": {
        "Spock": "What is the square root of 2,396,304?                          -- one-thousand-five-hundered- -- Correct. What is the central assumption of Quantum       -- everything that can happen Cosmology?                          does happen, in equal and -- Correct. Identify the 20th century earth composers of the following musical progression:      -- Paul McCartney and John -- Correct And we find ANOTHER VULCAN CHILD -- then ANOTHER -- all in these odd spaces -- until we PULL BACK WIDE to reveal a large Vulcan LEARNING CENTER -- white \"bowls\", sunk into the dark ground, where PROFESSORS walk, hands behind their backs, surveying this mass \"mental martial arts\" test. We're on ANOTHER VULCAN CHILD as she gets an answer wrong -- AND THE LIGHT OVER HER BOWL GOES OUT. Then ANOTHER CHILD -- who gets an answer wrong -- and HIS LIGHT GOES OUT. An EXTREMELY WIDE OVERHEAD SHOT reveals BOWL AFTER BOWL as the LIGHTS GO OUT.  I presume you've prepared new insults for today.  I have no such information.    I did not mean to create conflict between you and mother.  ... constant?  ... between you and mother?  They called you a traitor. You suggest that I should be completely Vulcan... and yet you married a human... why?    I am hardly \"anxious\", mother. And \"fine\" has variable definitions. \"Fine\" is unacceptable.  May I ask a personal query?  Should I choose to complete the Vulcan discipline of Kolinahr... and purge all emotion... I trust you will not feel it reflects judgement upon you.  It was logical to cultivate multiple options.  If you would clarify, Minister-- what \"disadvantage\" are you referring to?  Council -- ministers.    I must decline.  Then as I am half-human, your record remains untarnished.  Spock. You have made a commitment to honor the Vulcan       At the moment, Father, I can way--                                think of no greater way to  I came with the intention of enrolling, as my father wished. However, your \"insight\" has convinced me otherwise. Therefore, the only emotion I wish to convey is gratitude. Thank you, Ministers, for your consideration. Live long and prosper.  ... I do not know.  Cadet Kirk. It is obvious you somehow managed to install and activate a sub- routine in the programming code, thereby changing the conditions of the test.  To deceive by trickery.  Your argument precludes the possibility of a no-win scenario --  Then not only have you violated the rules, you've failed to understand the principle lesson.  You, of all people should know, Cadet Kirk -- A captain cannot cheat death.  Your father, Lieutenant George Kirk, had assumed command of his vessel before killed in action, did he not?  How long did it take you to program the virus that allowed you to cheat?  I am Vulcan. \"Like\" is not a verb in our vernacular. I've simply made the logical deduction that you're a liar.  Agreed. Furthermore, you have failed to divine the purpose of the test.  The purpose is to experience fear. Fear in the face of certain death. To accept that fear and maintain command of one's self and one's crew. This is a quality expected in every Starfleet captain.  Fear is necessary, yes.  Spock. As a Vulcan, I require no additional training to control my narcissism when making command decisions.  Yes, Lieutenant?  Indeed you were --  An exceptional achievement, to be su--  Consistently, yes--  It was an attempt to avoid the appearance of favoritism.  Oh.     Yes, I believe you are.  Captain, engineering reports \"ready for launch\".  Have you disengaged the External Inertial Dampener?     As you know, Mr. Kirk is not cleared to be aboard this vessel. By Starfleet                  Yeah, I get it, you're a regulations, that makes him a        great arguer, I'd love to do stowaway...                          it again with you, too. I can remove the cadet from          -- Try it! This cadet is the bridge, Sir --                   trying to save the bridge! -- By recommending a full stop in trans-warp in the midst of a rescue mission?                    -- It's not a rescue mission-- -- Based on what facts? ON KIRK.   Enough.     And cadet or not, the bridge is HIS.  The cadet's logic is sound. And Lieutenant Uhura is unmatched in xenolinguistics, we would be wise to accept her conclusion.  Captain, they're locking torpedoes!  Captain, the Romulan ship has lowered some kind of high energy pulse device into the Vulcan atmosphere-- its signal appears to be blocking our communications and transporter abilities!    -- he'll kill you, you know that--                               Your survival is unlikely-- -- Captain, we gain nothing by diplomacy-- going over to that       -- I, too, suggest you rethink ship is a mistake.                   this strategy.  What!?!                           -- Captain?  Captain. Please. I apologize, but the complexities of human pranks escape me.  Dr. Puri, report --    Chekov, run gravitational sensors -- I want to know what they're doing to the planet.  STIRRING INSIDE HIM -- Uhura watches Spock, heartsick for him:  They're creating a black hole... at the center of Vulcan?  How long does the planet have?    To evacuate the Vulcan High Council-- they're tasked with protecting our cultural history. My parents will be among them--  It's not possible -- they'll be in the Katrik Arc, I must get them myself--  Step aside -- I'm going to the surface.  Energize --  The planet's not safe, it has only seconds left -- we must evacuate now --  Spock to Enterprise: take us back now!    as it lands -- Sarek too... a mother... a wife... has been lost. And Kirk stands nearby, having observed all of this, without anything to do or say... there's no cheating death.  Acting Captain's log. Stardate 2256.42: I have assumed command of the Enterprise.  We've heard no word from Captain Pike. I have therefore classified him a hostage of the war criminal known as Nero.  Nero, who has destroyed my home planet. And most of its six billion inhabitants. I estimate no more than ten thousand survived. While the essence of our culture has been saved, in the elders who now reside upon this ship... I am now a member of an endangered species.  ... I need...  I need for us all to continue performing admirably.  Lieutenant, have you confirmed that Nero is headed for Earth?  That's not it.     He said he wanted me to see something.     The destruction of my home planet.  The engineering comprehension necessary to artificially create a black hole may suggest the answer: such technology could theoretically be manipulated to create a tunnel through space time.  If you eliminate the impossible, whatever remains -- however improbable -- must be the truth.  Captain Pike left us with standing orders to rendezvous with the fleet on the other side of the quadrant.  We're technologically outmatched in every way. A rescue attempt would be illogical.  Remaining power and crew are being used to repair radiation leaks on the lower decks and damage to the main deflector shield-- without which we cannot communicate with          -- okay--okay, okayokayokay-- Starfleet.                       there's gotta be SOME WAY!  We must gather with the rest of Starfleet to balance the terms of our next engagement --  You're assuming Nero knows how events are predicted to unfold. The contrary: Nero's very presence has altered the flow of history, beginning with the attack on the U.S.S. Kelvin, culminating in the events of today -- thereby creating a new chain of incidents that cannot be anticipated by either party.  Precisely. Whatever lives we might have lived, if the time continuum was disrupted... our destinies have changed. Mr. Sulu, plot a course for the Laurentian system, Warp Factor Three--  -- wait-- don't do that -- Spock -- running back to the rest of the fleet for a confab is a massive waste of time--        -- These were the orders -- He also ordered us to go         Captain Pike issued when he back and get him! Spock,            left ship-- you're Captain now--!               -- I am aware of my -- Every second we waste,           responsibilities, Mr. Kirk! Nero's getting closer to his next target--!                      -- that is correct -- and why -- I will not allow us to go        that I alone am in command. backwards, away from the problem, instead of hunting         -- then I must remove you from Nero down!                          this ship. If I confine you For a beat, nobody moves -- an impossible choice for all of them. Torn, Chekov and Sulu close in on Kirk --  ... Jim?  How did you find me--? Does Starfleet know of my presence?  I have been... and always shall be... your friend.  You are James T. Kirk. Your father is George, as is your brother. Your mother's name is Winona -- you were born in 2233 --  ... I am Spock. One hundred and thirty years senior to the Vulcan you know.  It's remarkably pleasing to see you again. ... especially after the events of today.  Mutiny?   You are not the Captain?      troubled Romulan. ... Please. Allow me -- it will be easier--    A star in Beta Quadrant will go supernova -- and like a cancer left untreated... it will grow... and destroy everything.  I saw the beginning of it myself. Vulcan Science Academy devised a plan to stop it.  We built a ship containing a material capable of generating the only thing powerful enough to consume a supernova. A black hole.  I agreed to pilot the ship. Knowing I would not return.  My sacrifice, in service of all races, seemed only logical.  Unfortunately... before I could begin the mission... the supernova destroyed Romulus.  Yes. He of course blamed us. Believed Vulcan allowed his planet to die. Which was hardly the case. Let me continue.  This annoys me, I don't like      -- I know, I know, I'm not it-- do we have to do it like     surprised to hear you complain this--?                           -- allow me to finish. Spock Prime touches Kirk again and we go:  Nero came after me. Determined to thwart my mission. If Romulus was allowed to die, he said... all planets should share its fate.     I needed an exit. I knew if this mission failed... everyone, everywhere... would lose everything.  I realized: a large black hole could destroy the supernova. A smaller one... could be my escape. Could send me back in time, allowing me to complete my mission. So I created a black hole...  Nero must have understood what I was trying to do. Because he began racing for it.  Nero simply got to it first. How long I was travelling... I couldn't tell you. It was timeless. But when I arrived...  Nero was waiting for me.  Forgive me... emotional transference is an effect of the mind meld.  \"Cthia\" is the stricture that binds our emotions... but few of us are that perfectly Vulcan.  Yet remarkably, events within our timelines, characteristics, people... seem to overlap significantly. Tell me about the rest of the crew? Chekov-- Uhura --?  -- Sulu --  Dr. McCoy would assert our meeting here is not a matter of coincidence... but rather, indication of a higher purpose.  Yes he would. Perhaps the time stream's way of attempting to mend itself. In both our histories, the same crew found its way onto the same ship in a time of ultimate crisis -- therein lies our advantage. We must go-- there's a Starfleet outpost not far from here.  ... yes. You often spoke of him as your inspiration for joining starfleet.  You should know. He proudly lived to see you become captain of the Enterprise.  A ship we must return you to as soon as possible.    I'm simply acknowledging your difficulties.  I welcome it.  ... a curious metaphor, Doctor. As a stallion must first be broken before it can reach its potential.  I intended to assist in the effort to re- establish communication with Starfleet. However, if crew morale would be better served by my roaming the halls weeping, I'll gladly defer to your medical expertise.  Are you the station chief?    You're Montgomery Scott.  You are in fact the Mr. Scott who postulated the theory of trans-warp beaming.  What if I told you your trans-warp theory was correct? That it is indeed possible to beam onto a ship that is travelling at warp speed. And that you only required the correct field equation to recrystallize dilithium?  The reason you haven't heard of it, Mr. Scott... is because you haven't discovered it yet.  Allow us access to your shuttle... and I will show you what a genius you actually are.  Your equation for achieving trans-warp beaming.  Point of fact: it did occur to you. Extrapolating Enterprise's course --  Now's your chance, Mr. Scott.  I calculate no more than a four meter margin of error.  Agreed: the aft engineering bay is your best option: a large space and no unpredictable airlocks --  No, Jim. My destiny lies along a different path.  Your destiny can wait -- he won't believe me, only you can   Under no circumstances can he explain w--                      be made aware of my existence.  Trust me. Above all. Jim, this is the one rule you cannot break. To stop Nero, you alone must take command of your ship.  Preferably not. There is, however, Starfleet Regulation 619. Yes. I forget what little regard you had for such things. 619 states that any commanding officer who is emotionally compromised by the mission at hand... must resign said command.  Jim.  I just lost my planet. I can tell you.  I am emotionally compromised. What you must do... is get me to show it.  A trick I learned from an old friend.  Live long, and prosper.  Bring up video.  Security, this is the captain -- seal engineering deck and bring me the intruders in turbine station three -- set phasers to stun.    We're travelling at warp -- how did you manage to get aboard this ship?  As Captain of this vessel I order you to answer the question.  You are not a member of this ship's crew. Under penalty of court martial, I order you to explain to me how you beamed ab --  You will answer me.  Escort them to the Brig.  Your presumption that these experiences interfere with my abilities to command this ship is inaccurate--      Step away from me, Mr. Kirk.      Doctor. I am no longer fit for duty. I hereby relinquish my command on the grounds that I have been... emotionally compromised. Please note the time and date in the ship's log.  That would be unwise.  I feel as conflicted as I once was. As a child. Have I made so little progress?  I feel anger. For the one who took her life. An anger I cannot stop.  Doctor... Mr. Chekov is correct.  I have reviewed his telemetry. If Mr. Sulu can maneuver us into position, I can beam aboard Nero's ship.  Romulans and Vulcans share a common ancestry. Our cultural similarities will make it easier for me to access their ship's computer to locate the device.  Also, my mother was human. Which makes Earth the only home I have left.    Thank you, Nyota.  I have no comment on the matter.   I am trained in the Vulcan martial art of Suus Mahna.  I am unable to meld with these Romulans -- there are subtle differences in their physiology I did not anticipate --  -- punch him in the face -- make him talk! Suus Mahna his       -- Suss Mahna is only intended ass!                                for self-defense, he's no -- then pretend it's a threat - - I'm your captain, that's an order! Spock PUNCHES the Romulan HARD -- and via Uhura's comlink translator, speaks in SUBTITLED ROMULAN:  What is your computer access code?   What you refer to as the \"Red Matter Device\" is in the main hangar -- and I've located Captain Pike.  Unknown.  Which may be problematic, as I am unfamiliar with this ship's design.  Computer: what is your manufacturing origin?  It appears you've been keeping rather important information from me.      Under authority granted me by the Europa convention, I'm confiscating this illegally obtained ship and order you to surrender your vessel. No terms. No deals.  Last warning: unconditional surrender or you will be destroyed.  Computer, prepare self destruct sequence.       No, not really, not this time.  Father...?  I am not... our father.  ... Fascinating.  There are so few Vulcans left.    We cannot afford to ignore each other.  Then why did you send Kirk aboard when you alone could've explained the truth?    ... it was a test?    How did you persuade him to keep your secret?  I inferred universe-ending paradoxes would ensue should he break his promise.  You lied.  I implied.  A gamble...  An act of faith. One I hope you'll repeat in the future.  The future's not what it used to be... in the face of extinction, it's only logical I resign my Starfleet commission and help rebuild our race.  And yet, you are in a unique position... you can be in two places at once.    My future cannot be determined by your past. We are one, but not the same.  Then I ask that you do yourself a favor. Put away logic. Do what feels right. The world you've inherited lives in the shadow of incalculable devastation... but there's no reason you must face it alone.  As my customary farewell would appear oddly self serving, I will simply say... good luck.  Permission to come aboard, Captain.  As you have yet to select a first officer, respectfully, I would like to submit my candidacy. Should you desire, I can provide character references.  Space... the final frontier. These are the continuing voyages of the Starship Enterprise. Her ongoing mission... to explore strange new worlds... to seek out new life forms, and new civilizations... To boldly go, where no one has gone... before...  Then I ask that you do yourself a favor... put away logic, and do what feels right. The world you've inherited lives in the shadow of incalculable devastation... but there's no reason you must face it alone.  This was a gift to me.   Representing... a dream. One we were unable to fulfill. The way you can now.  As my customary farewell would appear oddly self serving, I will simply say... good luck.",
        "Prime": "... Jim?  How did you find me--? Does Starfleet know of my presence?  I have been... and always shall be... your friend.  You are James T. Kirk. Your father is George, as is your brother. Your mother's name is Winona -- you were born in 2233 --  ... I am Spock. One hundred and thirty years senior to the Vulcan you know.  It's remarkably pleasing to see you again. ... especially after the events of today.  Mutiny?   You are not the Captain?      troubled Romulan. ... Please. Allow me -- it will be easier--    A star in Beta Quadrant will go supernova -- and like a cancer left untreated... it will grow... and destroy everything.  I saw the beginning of it myself. Vulcan Science Academy devised a plan to stop it.  We built a ship containing a material capable of generating the only thing powerful enough to consume a supernova. A black hole.  I agreed to pilot the ship. Knowing I would not return.  My sacrifice, in service of all races, seemed only logical.  Unfortunately... before I could begin the mission... the supernova destroyed Romulus.    Yes. He of course blamed us. Believed Vulcan allowed his planet to die. Which was hardly the case. Let me continue.  This annoys me, I don't like      -- I know, I know, I'm not it-- do we have to do it like     surprised to hear you complain this--?                           -- allow me to finish. Spock Prime touches Kirk again and we go:  Nero came after me. Determined to thwart my mission. If Romulus was allowed to die, he said... all planets should share its fate.     I needed an exit. I knew if this mission failed... everyone, everywhere... would lose everything.  I realized: a large black hole could destroy the supernova. A smaller one... could be my escape. Could send me back in time, allowing me to complete my mission. So I created a black hole...  Nero must have understood what I was trying to do. Because he began racing for it.  Nero simply got to it first. How long I was travelling... I couldn't tell you. It was timeless. But when I arrived...  Nero was waiting for me.  Forgive me... emotional transference is an effect of the mind meld.  \"Cthia\" is the stricture that binds our emotions... but few of us are that perfectly Vulcan.  Yet remarkably, events within our timelines, characteristics, people... seem to overlap significantly. Tell me about the rest of the crew? Chekov-- Uhura --?  -- Sulu --  Dr. McCoy would assert our meeting here is not a matter of coincidence... but rather, indication of a higher purpose.  Yes he would. Perhaps the time stream's way of attempting to mend itself. In both our histories, the same crew found its way onto the same ship in a time of ultimate crisis -- therein lies our advantage. We must go-- there's a Starfleet outpost not far from here.  ... yes. You often spoke of him as your inspiration for joining starfleet.  You should know. He proudly lived to see you become captain of the Enterprise.  A ship we must return you to as soon as possible.  Are you the station chief?    You're Montgomery Scott.  You are in fact the Mr. Scott who postulated the theory of trans-warp beaming.  What if I told you your trans-warp theory was correct? That it is indeed possible to beam onto a ship that is travelling at warp speed. And that you only required the correct field equation to recrystallize dilithium?  The reason you haven't heard of it, Mr. Scott... is because you haven't discovered it yet.  Allow us access to your shuttle... and I will show you what a genius you actually are.  Your equation for achieving trans-warp beaming.  Point of fact: it did occur to you. Extrapolating Enterprise's course --  Now's your chance, Mr. Scott.  Agreed: the aft engineering bay is your best option: a large space and no unpredictable airlocks --  No, Jim. My destiny lies along a different path.  Your destiny can wait -- he won't believe me, only you can   Under no circumstances can he explain w--                      be made aware of my existence.  Trust me. Above all. Jim, this is the one rule you cannot break. To stop Nero, you alone must take command of your ship.  Preferably not. There is, however, Starfleet Regulation 619. Yes. I forget what little regard you had for such things. 619 states that any commanding officer who is emotionally compromised by the mission at hand... must resign said command.  Jim.  I just lost my planet. I can tell you.  I am emotionally compromised. What you must do... is get me to show it.  A trick I learned from an old friend.  Live long, and prosper.  I am not... our father.  There are so few Vulcans left.    We cannot afford to ignore each other.      I inferred universe-ending paradoxes would ensue should he break his promise.  I implied.  An act of faith. One I hope you'll repeat in the future.  And yet, you are in a unique position... you can be in two places at once.    Then I ask that you do yourself a favor. Put away logic. Do what feels right. The world you've inherited lives in the shadow of incalculable devastation... but there's no reason you must face it alone.  As my customary farewell would appear oddly self serving, I will simply say... good luck.  Then I ask that you do yourself a favor... put away logic, and do what feels right. The world you've inherited lives in the shadow of incalculable devastation... but there's no reason you must face it alone.  This was a gift to me.   Representing... a dream. One we were unable to fulfill. The way you can now.  As my customary farewell would appear oddly self serving, I will simply say... good luck.",
        "Chekov": "Ensign Chekov, Pavel H., Sir.  Yessir, happy to. Ensign authorization code: Nine-Five- Wictor Wictor-Two--  Aigh, thees is the 23rd Century -- what good is woice recognition that doesn't recognize your woice? Nine-Five-Victor-Victor-Two.  Your attention, plees: At twenty-two hundred hours, telemetry detected an anomaly in the Neutral Zone. What appeared to be a lightning storm in space.  Soon after, Starfleet received a distress signal from the Vulcan High Council that their planet was experiencing seismic activity. We then lost contact with Vulcan entirely.  Our mission is to assess the condition of Vulcan and assist in evacuations, if necessary.  We should be arriving at Vulcan within two minutes. Thank you for your time.  -- telemetry detected an anomaly in the Neutral Zone. What appeared to be a lightning storm in space.  Aye, Keptin.  Away team's entering the atmosphere --  Transporter control re-engaged --  Aye, Commander-- Keptin, sorry.    Keptin.  Keptin: gravitational sensors are off the scale -- if my calculations are correct, that pod they launched is creating a singularity... that will consume the planet.  ... yessir.  ... minutes, Sir. I'd say minutes.    -- holdonholdonholdonholdon!  Compensating gravitational pull and--  Locking volume, transport in 5-4-3--   Yes, agreed-- but why didn't they destroy us?  Not to mention we couldn't do it anyway: Nero's ship would have to drop out of warp for us to overtake them --  Keptin, we're detecting unauthorized access to a water turbine control board!  You vant us to trust you but you von't tell us the truth?  Keptin Kirk?    Excuse me, plees, could  Based on the Narada's course from Vulcan, I've projected that Nero will travel past Saturn. If we could drop out of warp behind one of Saturn's moons, say, Titan, the magnetic distortion from the planet's rings will make us invisible to Nero's sensors. We could follow him to Earth by staying in his blind spot.  Its exhaust wake. If we adjust our shield frequencies, they shouldn't detect us.  I am seventeen, Sir, how old are you?  Aye. I've projected the parabolic course you must follow. If you deviate by so much as a meter, we will be detected.    They've activated the drill --  Keptin! The enemy ship is losing power-- its shields are down!   Weapons systems and shields on standby.",
        "Gaila": "-- oh Jim... Jim... Jim, I love you.  I say \"I love you\", and you say \"I sent you a message?\"  -- but you can only open it tomorrow at three o'clock on the dot --                        -- what are you talking about? -- Gaila, promise me you're not going to open it 'till        -- what is it?    Tell me what three --                          it says! -- I'll erase it, I swear, if you don't promise me you'll       -- All right!!    Three o'clock! wait --                           I prom-- They're INTERRUPTED by a DOOR OPENING -- GASP!    Hey-- I thought you were going to be in the long-range sensor lab all night.  Yeah, been running simulations all week, just catching up on some rest. Tired. That's all.  I can't help it! I love him!      Gaila loves me--",
        "Scotty": "Yes, that's me -- Scotty-- you're in the right place-- are there any other hard- working and equally-starving Starfleet officers around?  You eat nothing. A bean and you're done for a week, I need food. And now you're here -- so. Thank you. Where is it.  Yes! That's exactly what I'm talking about! How d'ya think I ended up here? I got into a debate with my instructor on the issue of Relativistic Physics as they pertain to subspace travel... He seemed to think that the range of transporting say, a roast turkey, was limited to a few hundred miles -- so I told my instructor I could not only beam a bird from one planet to an adjacent planet in the same system -- which is no big deal anyway -- but if I were so inclined I could actually do it with a lifeform! So I tested it on Admiral Archer's prize beagle. Which... was a mistake.  I'll tell ya when it reappears.     Dunno. Feel guilty.  I haven't been stationed here that long. If such an equation had been discovered, I'da heard.  Y'from the future, are ya? Brilliant. D'they still have sandwiches where you're from? Piece and jam? Mince 'n tatties? Cockaleekie soup?     She's a wee bit dodgy: shield emitters are totally banjaxed, along wi' a few other things.  ... rapid.   That's impressive.  Imagine that! Never occurred to me to think of space as the part that's moving.  -- Enterprise? Had its maiden voyage already, has it? Well, you must've done something right to be assigned to that ship, Kiddo. She's a well endowed lady -- love to get my hands on her ample nacelles, if you'll pardon the engineering parlance.  Look, even if I believed you -- where you're from, what I've done-- which I don't -- we're still talkin' bout slingshotting aboard while she's going faster than light. Without a proper receiving pad, that's like tryin'a hit a bullet with a smaller bullet, wearing a blindfold. On a horse.  That's all well and good unless you rematerialize four meters outside the ship.  Aye, then. Live or die, Laddie, let's get this over with. he Enterprise has a decent cafeteria I'm guessing.  (recovering, looking  I'd rather not take sides.  I like this ship. It's exciting.  Well you can forget transwarp. No way to predict the Narada's position from here.    If there's any common sense to their ship design, I'll be puttin' ya in a cargo bay, shouldn't be a soul in sight.  Never beamed two targets from two places onto the same pad before! That was pretty good!  -- you bet yer ass, Captain --      Dilithium chamber at maximum efficiency, Captain.",
        "George": "Lieutenant Pitts. Transfer Robau's vital signs to the main view screen.    I want to see him -- floodlights please.  He's brave.    That's what he is.  They're launching again!           Evasive! Evasive! Delta-Five  I'm initiating General Order 13! Set self-destruct for maximum matter- antimatter yield! Two minute countdown!  I want auto-pilot targeted for their fuel cells!  Then just target the damn thing dead center!  -- then I'll do it myself -- get to the shuttles, now!  All decks, this is the Captain speaking -- evacuate the ship immediately, get to your designated shuttle crafts --  -- repeat: evacuate ship and get to designated shuttles           -- that's George's voice -- NOW!                                 what's happening?  I have medical shuttle 37 standing by, get to it now -- can you do that?  I'm on my way.  I'll see you in a minute, sweetheart.  Captain to shuttle 37 -- is my wife on board?  I need you to go now, d'you hear me?  No-- go, take off, immediately.  My love?   Listen carefully, okay?  Sweetheart... I'm not going to be able to be there.  I want you to hear me. Please.                           Are you still on the ship? No- -- There's no other way-- my      - no, you need to be here-- love-- you know all I want--      -- George, I can't do this all I want in the world is to     without you-- be with you-- -- but she's WINCING AGAIN --  Hey!   Hey, so what is it?  It's a boy?   Yeah?  Tell me... tell me about him-- please--  I know-- so what should we call him, huh?  Tiberius? Are you kidding me? No, that's the worst-- we'll name him after your dad-- let's call him Jim.  Sweetheart? Sweetheart? I love you. Can you hear me?          -- yes-- yes, I hear you... -- I love you. I love y-- -- his VOICE CUT OFF as --  Anywhere but here, far as I can get!  This isn't about toys, it's Uncle Frank. I can't take him anymore -- Mom has no idea what he's like when she's not here-- d'you hear him talking like he's our dad?! And that's not even his car you're washing! That was Dad's car! You know why you're washing it? Because he's gonna sell it!  She's gone for five more months, by then I'll be in a different system. You're gonna be okay. You always are. Always doing everything right -- good grades and obeying every stupid order... I can't be a Kirk in this house. Show me how to do that and I'll stay.  -- no... way.",
        "Kirk": "Lieutenant Pitts. Transfer Robau's vital signs to the main view screen.    I want to see him -- floodlights please.  He's brave.    That's what he is.  They're launching again!           Evasive! Evasive! Delta-Five  I'm initiating General Order 13! Set self-destruct for maximum matter- antimatter yield! Two minute countdown!  I want auto-pilot targeted for their fuel cells!  Then just target the damn thing dead center!  -- then I'll do it myself -- get to the shuttles, now!  All decks, this is the Captain speaking -- evacuate the ship immediately, get to your designated shuttle crafts --  -- repeat: evacuate ship and get to designated shuttles           -- that's George's voice -- NOW!                                 what's happening?  I have medical shuttle 37 standing by, get to it now -- can you do that?  I'm on my way.  I'll see you in a minute, sweetheart.  Captain to shuttle 37 -- is my wife on board?  I need you to go now, d'you hear me?  No-- go, take off, immediately.  My love?   Listen carefully, okay?  Sweetheart... I'm not going to be able to be there.  I want you to hear me. Please.                           Are you still on the ship? No- -- There's no other way-- my      - no, you need to be here-- love-- you know all I want--      -- George, I can't do this all I want in the world is to     without you-- be with you-- -- but she's WINCING AGAIN --  Hey!   Hey, so what is it?  It's a boy?   Yeah?  Tell me... tell me about him-- please--  I know-- so what should we call him, huh?  Tiberius? Are you kidding me? No, that's the worst-- we'll name him after your dad-- let's call him Jim.  Sweetheart? Sweetheart? I love you. Can you hear me?          -- yes-- yes, I hear you... -- I love you. I love y-- -- his VOICE CUT OFF as --  -- wait-- no!    Where are you going?  I-- I just don't want my brother to go.  Please stay-- you can have my Flo-Yo!    Don't you want my name before you completely reject me?  You are good without it. It's Jim. Jim Kirk. If you don't tell me your name, I'm gonna have to make one up.  Uhura? No way -- that's the name I was gonna make up for you. Uhura what?  They don't have last names in your world?  They don't have first names in your world? Wait, let me guess. Is it \"Jim\"?  Okay, so you're a cadet. Studying. What's your focus?  Let me guess: study of Alien languages: phonology, morphology, syntax-- it means you've got a talented tongue.  Well.    Not only.  Oh, baby, I'm the smartest.  You could handle me.    That's an invitation.  At ease, Cup Cake, it was a joke.     Like your hairline.  You heard me, Moon Beam.  Okay, so go get some more guys, come back and it'll be an even fight.  You can... whistle really loud, y'know that?  ... and who am I, Captain Pike?  He sure learned his lesson.  -- why are you talking to me?  Maybe I love it.  Come to think of it, I do want to feel special. You know what? I'm gonna go start a book club--  Enlist. You must be way down on your recruiting quota for the month--  We're even, right?   I can go.  Live it up.  Four years?   I'm gonna do it in three.  At ease, Gentlemen. Never did get that first name.  I think these things're pretty safe--  I hate to break this to you, but Starfleet operates in space.  Jim Kirk-- you really gonna throw up--?  So you'll do it for me, right?  I didn't ask if you have interest, I asked if you'd do it.  Because I've failed the test twice.  So Bones: why do they make us take it?  And you're the greatest -- thank you.  Oh, no-- Bones -- I gotta date.  You have no idea how prepared I'm gonna be-- no idea.    -- but you can only open it tomorrow at three o'clock on the dot --                        -- what are you talking about? -- Gaila, promise me you're not going to open it 'till        -- what is it?    Tell me what three --                          it says! -- I'll erase it, I swear, if you don't promise me you'll       -- All right!!    Three o'clock! wait --                           I prom-- They're INTERRUPTED by a DOOR OPENING -- GASP!  Your hearing is scary-- you sure both your parents are human?  (getting dressed, to  If I pass, will you tell me your first name?    \"Starfleet Command has ordered us to rescue them... Captain.\"  That's okay.  Yeah, don't worry about it.  Nah.  Alert medical bay to prepare to receive all crew members from the damaged ship.  Alert medical.  I understand.  Mmmm... no.  Arm photons. Prepare to fire on the Klingon warbirds.  Are they?  Fire on all enemy ships -- one photon each should do -- let's not waste ammunition.  Begin rescue of the stranded crew. So. We've eliminated all enemy ships, no one on board was injured and the successful rescue of the Kobayashi Maru crew is underway.  Anything else?    Your point being?  Respectfully.    Define \"cheating\".  Now let me ask you something I think we all know the answer to: the test is rigged, isn't it? You programmed it to be unwinnable.  Because if I'm right, Sir, then the test itself is a cheat.  I don't believe in no-win scenarios --  Please, enlighten me.  \"I of all people?\"  How long did it take you to look that up?  Maybe you just don't like that I beat your test.  What an idiot I am for taking that personally --  Enlighten me again.  So you're telling me the point.      Of the whole thing. Is to be afraid?  Have you taken the test, Commander Spork?  You keep reminding me that you're Vulcan. And I'm sure you're really proud of that, who wouldn't be-- but isn't it true you people don't experience fear at all?  And if that's the case -- What's that say about your ability to make command decisions?  Who was that pointy-eared bastard?  Excuse me, you didn't call my name. Kirk, James T..  ... yeah-- yeah, you go... I'm good.  Come with me --                    -- what're you doing --? TRACK with them as they hurry through the throng of cadets -- and suddenly we're moving in the OTHER DIRECTION as a pissed-off Uhura serpentines through the group to SPOCK --  What are you doing?  Ow-- what for?                      To give you symptoms. -- I don't understand--             -- you're gonna start to lose -- yeah, I already have --          -- don't stand up yet --  I might throw up on you.  Bones. Thanks for getting me on board. But I don't feel right. I feel like I'm leaking.  -- oh, this wasn't worth it -- I wish I didn't know you-- I'm itching in my mouth, this is         Here's a short-lasting horrible--                           sedative -- those symptoms And he SHOOTS KIRK with another hypospray --    -- what's this?!  -- Bones -- we have to stop the ship--  --- what? How the hell would I know?     Is Uhura on board?  Computer, locate crew member Uhura --  We're flying into a trap.  -- ow!   Stop it!  The transmission from the Klingon prison planet -- what exactly did you hear?  Who was it who escaped? What was the ship that was stolen--?! -- what's happening to my mouth?     Captain Pike-- Sir, we have to stop ship!  Vulcan isn't experiencing a natural disaster, it's being attacked -- by Romulans.  As you know, Mr. Kirk is not cleared to be aboard this vessel. By Starfleet                  Yeah, I get it, you're a regulations, that makes him a        great arguer, I'd love to do stowaway...                          it again with you, too. I can remove the cadet from          -- Try it! This cadet is the bridge, Sir --                   trying to save the bridge! -- By recommending a full stop in trans-warp in the midst of a rescue mission?                    -- It's not a rescue mission-- -- Based on what facts? ON KIRK.   Enough.     And cadet or not, the bridge is HIS.  Fact: the same anomaly -- a lighting storm in space -- that we saw today also occurred on the day of my birth, before a Romulan ship attacked the U.S.S. Kelvin. You know that, I read your dissertation. Which was good.  Fact: This ship -- which had formidable and advanced weaponry -- was never seen or heard from again -- fact: the Kelvin attack took place on the edge of Klingon space and at 11-hundred hours last night there was an escape from a Klingon prison planet -- Rura Penthe -- fact: the escaped prisoners were Romulans, Sir, and it was reported that they stole a ship from the prison dock.  We're warping into a trap-- there are Romulans waiting for us, I promise you that.  It's because they're being attacked. Captain. Please.  -- he'll kill you, you know that--                               Your survival is unlikely-- -- Captain, we gain nothing by diplomacy-- going over to that       -- I, too, suggest you rethink ship is a mistake.                   this strategy.  ... okay.  What!?!                           -- Captain?  Once we knock out that machine... Sir, what happens to you?  So what kinda combat training d'you have?     -- their chutes SNAP OPEN -- JERKING THEM HARD UPWARD AS THE RED      Step back--                       -- what, you have an idea? -- yeahyeah, I do-- Kirk FIRES his PHASER at the console, BLASTING IT --   Kirk to Enterprise -- they just launched something toward the planet!         ... yeah, not a problem.  The surface of what? YOU'RE GOING DOWN THERE? Are you nuts?!  Hey. Listen, about what happened at Starfleet. The test and everything-- I know it looks like I was... using you, or whatever. And I'm sorry. I really am. And... I just hope you'll forgive me.  ... you're not Gaila, are you?    Earth may be his next stop, but we have to assume every Federation planet's a target.  That is what he's suggesting and I don't buy it.  Then what would an angry future Romulan want with Captain Pike?  What we need to do is catch up to that ship. Disable it, take it over and get Pike back.  \"Illogical\"-- you're funny.  -- what about assigning Engineering crews to try and boost our warp yield?  Remaining power and crew are being used to repair radiation leaks on the lower decks and damage to the main deflector shield-- without which we cannot communicate with          -- okay--okay, okayokayokay-- Starfleet.                       there's gotta be SOME WAY!  There won't be a next engagement, Spock: by the time we've \"gathered\", it'll be too late -- how many planets are you willing to risk? You say he's from the future? Knows what's gonna happen? Then the logical thing is to be unpredictable.  -- wait-- don't do that -- Spock -- running back to the rest of the fleet for a confab is a massive waste of time--        -- These were the orders -- He also ordered us to go         Captain Pike issued when he back and get him! Spock,            left ship-- you're Captain now--!               -- I am aware of my -- Every second we waste,           responsibilities, Mr. Kirk! Nero's getting closer to his next target--!                      -- that is correct -- and why -- I will not allow us to go        that I alone am in command. backwards, away from the problem, instead of hunting         -- then I must remove you from Nero down!                          this ship. If I confine you For a beat, nobody moves -- an impossible choice for all of them. Torn, Chekov and Sulu close in on Kirk --  Yeah, don't worry ab --  Computer...    where am I?  Bite me, how's that.   Lieutenant's log, supplemental: I'm preparing a testimonial for my Starfleet court martial assuming there's still a Starfleet left.  Acting Captain Spock -- whose only form of expression's apparently limited to his left damn eyebrow -- has marooned me on Delta Vega in what I believe to be a violation of security protocol 49.09, governing the treatment of prisoners aboard a st--     FALLS -- DROPS -- and we see that Kirk is FALLING DOWN A MASSIVE SNOW MOUNTAIN! The huge red creature stops at the edge and ROARS LOUDLY -- until the ice shelf BREAKS AWAY! The creature starts to FALL AS WELL! Now Kirk is TUMBLING, the immense creature TUMBLING not far behind! And Kirk LANDS ON THE ICE, HARD -- sees a distant CAVE. Looks up at the FLAILING CREATURE that is about to CRUSH HIM -- Kirk tries to run, but the ice is TOO SLIPPERY -- FINALLY he gets footing and runs off toward the cave -- as the red creature LANDS HARD -- its sharp SPEAR LIMBS STAB into the ice as it pursues Kirk --  Hey... thank you...     -- no, I don't know you -- the only Vulcan I know isn't exactly a buddy.  Stop.   Please.     I don't understand.    Old friend. Sir, I don't have any idea how you know what you know. But I don't know you and if you are Spock we're not friends. You hate me. You marooned me here for mutiny...  You're the captain.   Pike was taken hostage.  What do you know about him?  What're you doing--?  Nero's planet was destroyed--  This annoys me, I don't like      -- I know, I know, I'm not it-- do we have to do it like     surprised to hear you complain this--?                           -- allow me to finish. Spock Prime touches Kirk again and we go:    Going back in time... you changed all our lives.  Tactical and Communications --  -- he's the helmsman, why?  ... he'd call it a damn miracle.  Where you came from... did I know my father?  ... Captain?   ... hello?!  Excuse me?  What?  You know him?  I know that dog. What happened to it?  What is he talking about?  -- you're coming with us, right?  Your destiny can wait -- he won't believe me, only you can   Under no circumstances can he explain w--                      be made aware of my existence.  You're telling me I can't tell you I'm following your own orders? Why not? What happens?  How, over your dead body?  So I need to emotionally compromise you?  Hm.  You know... coming back in time... changing history... that's cheating.  -- no-- shit!  -- no--nonono--  COMEONCOMEONCOMEON -- like the simulator: manual control enabled, pressure seal: enabled -- shutdown--   You all right?  -- let's get to the bridge--  Surprise.  He's with me.  You're the genius, you figure it out.  Well I'm not telling. Captain.  Does that frustrate you? My lack of cooperation... does it make you angry?    What is it about you, Spock? Your planet was just destroyed -- your mother murdered -- and you're not even upset?  HA! And yet you said fear was necessary for command. I mean -- did you see that bastard's ship? Did you see what he did?  So are you afraid or aren't you?!?  Then why don't you stop me.  What is it like? Not to feel? Anger. Or heartbreak. Or the need to stop at nothing to avenge the death of the woman who gave birth to you?!    Yeah we do.  Thanks for the support!  ... so do I. Attention crew of the Enterprise.   This is James Kirk...  Mr. Spock has resigned commission and advanced me to acting Captain. I know you were all expecting to regroup with the fleet, but I've ordered a pursuit course of the enemy ship to Earth.  I want all departments at battle stations and ready in ten minutes. Either we're going down, or they are. Kirk out.  -- yeah, you know that's complicated --  No. No, I won't-- hey, I'm the Captain now! I don't have to tell you anything! Now listen: we need to figure out a way to catch up and get to Nero's ship.  Then we find a way to get on that ship and steal the black hole device away from them.  Uhura: anything from Captain Pike?  Yes, Chekov-- you don't need to ask permission to--  What blind spot?  I won't order you to do that, Mr. Spock.  Then I'm coming with you.  See, we're getting to know each other.  Whatever happens Mr. Sulu, if you feel you have a tactical advantage fire on that ship. Even if we're still aboard. It's an order.  Her first name is...   Energize.    -- punch him in the face -- make him talk! Suus Mahna his       -- Suss Mahna is only intended ass!                                for self-defense, he's no -- then pretend it's a threat - - I'm your captain, that's an order! Spock PUNCHES the Romulan HARD -- and via Uhura's comlink translator, speaks in SUBTITLED ROMULAN:  Is he alive?  Let's move.  Spock, you'll be piloting the ship alone.    Just trust me.      Can ya do that?  I'll get Pike.  Came back, Sir. Just like you ordered.      Hail them -- now!  This is Captain James T. Kirk of the U.S.S. Enterprise -- your ship is compromised -- too close to the singularity to survive without assistance -- which we are willing to provide.    You got it. Lock phasers! Fire everything we've got!  Kirk to Engineering: get us out of here, Scotty!      I relieve you, Sir.  Thank you, Sir.  Scotty how are we?  Mr. Sulu, prepare to engage thrus--  ... Permission granted.  It would be my honor, Commander. Maneuvering thrusters, Mr. Sulu.     Take us out.  Happy birthday to you, happy birthday to you... I know I know, it's illogical to celebrate something you had nothing to do with, but I haven't had the chance to congratulate you on your appointment to the ambassadorship so I thought I'd seize the occasion... Bravo, Spock -- they tell me your first mission may take you away for awhile, so I'll be the first to wish you luck... and to say... I miss you, old friend.  I suppose I'd always imagined us... outgrowing Starfleet together. Watching life swing us into our Emeritus years...  I look around at the new cadets now and can't help thinking... has it really been so long? Wasn't it only yesterday we stepped onto the Enterprise as boys? That I had to prove to the crew I deserved command... and their respect?  I relieve you, Sir.  Thank you, Sir.  I know what you'd say -- `It's their turn now, Jim...' And of course you're right... but it got me thinking:  Who's to say we can't go one more round? By the last tally, only twenty five percent of the galaxy's been chartered... I'd call that negligent. Criminal even -- an invitation.  You once said being a starship captain was my first, best destiny... if that's true, then yours is to be by my side. If there's any true logic to the universe... we'll end up on that bridge again someday.  Admit it, Spock. For people like us, the journey itself... is home.",
        "Sarek": "Well done.  Your tone suggests disappointment. The Science Council required my presence for a session regarding--  As you are aware, the Vulcan male is traditionally not present at the moment of delivery.  You are correct. I should have been here. I am sorry.  I had a thought. That we might name the child after one of our respected early society-builders. His name was \"Spock\".  Your silence does not suggest enormous enthusiasm.  The child has your eyes.  -- where I'm from, when someone hits you, you hit back- - how is that not logical?         -- Spock had no reasonable -- They pick on him -- they        expectation of being tease him -- every day.            physically injured -- -- I want him to embrace           above all. Vulcan, you know that... but he has to be himself-- which means, occasionally, being         -- His \"humanity\" is very the human.                             source of his ostracism. -- When Vulcans get disgusted with each other, they never just walk away, do they?           -- No. -- Well humans do. And Amanda walks away, leaving Sarek standing there. He turns -- sees his son down the corridor. Approaches. And we're PUSHING IN on Spock, studying the fear in his eyes. His father stops in front of him, looming there, looking down stoically:  In marriage... conflict is...  Natural. Emotions run deep within our race. In many ways, more deeply than in humans. Long ago, they nearly destroyed us... that is why we followed the teachings of Surak. Now you must choose.  Never, my son. But you may choose the ethic of logic. Logic offers a serenity humans seldom experience. The control of feelings... so that they do not control you.  As Ambassador to Earth, my duty is to observe and understand human behavior. Marrying your mother... was logical. Spock. You are fully capable of choosing your own destiny. The question you are faced with... is which path you will take. This is something only you can decide.  Spock. You have made a commitment to honor the Vulcan       At the moment, Father, I can way--                                think of no greater way to       Spock!  You must not punish yourself. Speak your mind, Spock.  What is necessary is always wise.     I believe she would say... do not try to. You asked me once. Why I married your mother. I married her because I loved her.",
        "Nero": "The wait is over.  Standby.  Not yet -- not like this. Not how we left. This is our chance... to serve our people. We owe it to them -- to do what no other Romulan could ever do.  Welcome back.    Spock.  Prepare the Red Matter.    Tell me when we reach core depth.  Destroy it, too.   The hull -- magnify --  Hello.  I am called Nero.  I do not speak for the Empire. We stand apart. As does your Vulcan crew member... isn't that right? Spock?  ... no, we're not. Not yet. I would like you to see something. Spock. Captain Pike-- your transporter capability is disabled. You will man a shuttle and come aboard the Narada for negotiations. That is all.  Launch the red matter. Now.  Retract the drill, let's move out!  You are only the second human I have ever met, face to face. You must have so many questions for me.    Christopher. Answer my question.  I prevented genocide. Where I come from, Christopher... this ship is just a mining vessel. I chose a life of honest labor to provide for myself... and the wife who was carrying my child. I sit here now... knowing you as enemies. Not just of today. But of tomorrow. I watched as your Federation did nothing. They let us burn to death... as our planet broke in half.  It did happen. I remember it. I... felt it. When I lost her... I promised myself I would not speak another word until the day of my retribution. In twenty five years I forgot the sound of my own voice... but I didn't forget the pain. That feeling cannot be erased.    -- yes, which is a gift I won't waste on mercy. My purpose, Christopher, is not simply to avoid the destruction of the home I love... ... but to create a Romulus which exists, free of the Federation. Only then will she be saved.  It's not the fault of the human race that Starfleet chose Earth as its center. You're a more noble race than my fallen cousins. I'll take no pleasure in your extinction.  The frequencies, please.  As you wish.  There is no need, Ayel.   To threaten me. I understand.  I understand.    But you are wrong.  TO THE FLOOR, DEAD! Nero's hard face turns to the rest of his crew.  We will return to Romulus when the Federation lies in ruins and not a moment before. When those who watched our people burn at last understand our pain, our loss. I refuse to return as a slave! We will return as conquerors!  Deploy the drill.  Good.   Let's begin.     Restore power!     Engage auxiliary systems!     Spock -- I should've killed you when I had the chance.    You can't cheat me again, Spock. I know you better than you know yourself.    I want Spock dead!    Fire!  ... you should've fled, Spock. Sight target, standby torpedoes... FIRE!     I would rather suffer the death of Romulus a thousand times than accept assistance from you.  Forgive me... Romulus...",
        "Amanda": "... hello.  Thanks.  Don't do that.     You knew I wanted you here.  Well traditionally, I'm not the one giving birth.  I moved here -- to another planet -- to be with you. I needed you to be with me today. Holding my hand and telling me I'm doing great, even when I'm just... breathing the best I can.  No... Spock. ... Spock.  ... and your ears.  -- where I'm from, when someone hits you, you hit back- - how is that not logical?         -- Spock had no reasonable -- They pick on him -- they        expectation of being tease him -- every day.            physically injured -- -- I want him to embrace           above all. Vulcan, you know that... but he has to be himself-- which means, occasionally, being         -- His \"humanity\" is very the human.                             source of his ostracism. -- When Vulcans get disgusted with each other, they never just walk away, do they?           -- No. -- Well humans do. And Amanda walks away, leaving Sarek standing there. He turns -- sees his son down the corridor. Approaches. And we're PUSHING IN on Spock, studying the fear in his eyes. His father stops in front of him, looming there, looking down stoically:  Spock, come here, let me see you.  Spock.  There is no need to be so anxious. You'll do fine.  ... anything.  As always... whoever you choose to be... you will have a proud mother.        Spock--!  It's okay.   To be scared.",
        "Grayson": "",
        "Sulu": "Moorings retracted, Captain. Dock Control reports ready -- thrusters fired, separating from space dock --  The fleet's cleared space dock, Captain. All ships ready for warp.  Course laid in.  Uh, he has lungworms, Sir? He'll be fine but couldn't report to his post-- I'm Hikaru Sulu --  Very much so, Sir-- I'm not sure what's... wrong here...    Ready for warp, Sir.    Engines at Maximum Warp, Captain.  Arrival at Vulcan in five seconds! Four... three... two--   Shields at thirty-two percent! Their weapons are powerful, Sir, we can't take another hit like that!  I have training, Sir!     -- their chutes SNAP OPEN -- JERKING THEM HARD UPWARD AS THE RED     None of this is familiar-- the interface, the controls--  Step back--                       -- what, you have an idea? -- yeahyeah, I do-- Kirk FIRES his PHASER at the console, BLASTING IT --      ... thanks.  Why waste a weapon?      We weren't a threat.  As Admiral he knows details of Starfleet's defenses.  I'm sorry.  Warp three. Course one-five-one mark three, the Laurentian System.  I'm a PhD in astrophysics, I think I can handle it -- how'd you get back?  There's not a chance. They're gonna be in geosynchronous orbit around Earth in ten minutes. We'll never make it.  Mr. Chekov, transfer manual control to the Captain's chair.  Give me one quarter impulse burst for five seconds and I'll do the rest with thrusters. On my mark. Three... two... one... fire.  All stop in three... two... one...  Transporter Room. We're in stable geosynchronous orbit behind the Narada.  Yessir.   Good luck.  They're on their own now.  Maneuvering thrusters and impulse engines at your command, Sir.  Aye, Captain.",
        "Bones": "... Same ship, different day.",
        "Winona": "-- what was that-- what's happening?!  Medical bay-- I had a few close contractions-- I'm fine-- what was that?  -- repeat: evacuate ship and get to designated shuttles           -- that's George's voice -- NOW!                                 what's happening?  -- George!  Yes -- where are you?  Good-- and George, it's coming-- our baby, it's coming now.  -- Agh!   That was-- that was a big one!    Wait! We can't go, my husband isn't here yet! Please! STOP--!  The shuttle's leaving-- where are you?  -- we're about to have this baby --  -- no-- no, no-- wait--  I want you to hear me. Please.                           Are you still on the ship? No- -- There's no other way-- my      - no, you need to be here-- love-- you know all I want--      -- George, I can't do this all I want in the world is to     without you-- be with you-- -- but she's WINCING AGAIN --  -- it's a boy.  He's-- he's beautiful, he looks like you.  George, you should be here --  We could name him after your father.  ... Jim.   Jim it is.  Sweetheart? Sweetheart? I love you. Can you hear me?          -- yes-- yes, I hear you... -- I love you. I love y-- -- his VOICE CUT OFF as --",
        "Pike": "Outside, all of you!       NOW!  Y'alright, Son?  I couldn't believe when the bartender told me who you are.  Your father's son. For my dissertation, I was assigned the U.S.S. Kelvin. Something I admired about your dad... he didn't believe in no-win scenarios.  Depends on how you define winning. You're here, aren't you? That instinct to leap without looking-- that was his nature, too. And in my opinion it's something Starfleet has lost. We're admirable, respectable. But overly-disciplined. Those cadets you took on, they'll make competent officers -- but you can bet your ass they'll run home to momma the minute they're looking down the barrel of a Klingon phaser cannon.  I looked up your file while you were drooling on the floor. Your aptitude tests were off the charts-- what is it, d'you like being the only Genius Level repeat-offender in the midwest?  So your daddy dies... you can settle for a less-than-ordinary life. Or do you feel like you're meant for something better? Something special?  Enlist in Starfleet.  If you're half the man your father was, Jim, Starfleet could use you. You could be an officer in four years, have your own ship in eight.  Riverside shipyard. Shuttle for new recruits leaves tomorrow, 0800. Your father was Captain of a Starship. For twelve minutes. I dare you to do better.  ... No.   Guess not.  Hold her a second...  Cheating isn't winning.  The maiden voyage of our newest flagship deserves more pomp and circumstance than we can afford today, but her christening will have to be our reward for a safe return-- All decks, this is Captain Pike. Prepare for immediate departure. Helm, thrusters.  Set course for Vulcan.  Maximum warp.    Punch it.  Lieutenant, where's Helmsman McKenna?    Is the parking brake on?  The external inertial dampener. That's... the parking brake.    Russian whiz kid-- what's your name again? Chanko? Cherpov?  Fine, Chekov, Pavel H.: begin shipwide mission broadcast.  -- Mr. Kirk! How the hell did you get on board the                 This man is under the Enterprise?!                         influence of a severe reaction  Cadet Kirk, I think you've had enough attention for one day -- Dr. McCoy, return to medical, we'll have words later.  And you know of this prison escape how?      Uhura, relieve the Lieutenant -- Mr. Hannity, hail the U.S.S. Truman.     Full reverse, come about Starboard ninety degrees! Drop us down underneath them! Prepare to fire all weapons!  Get me Starfleet Command!  All power to forward shields -- prepare to fire all weapons!  Divert auxiliary power from port nacelle to the shields--!  I am Captain Christopher Pike, to whom am I speaking?  You've declared war against the Federation. Withdraw, and I'll agree to arrange a conference with Romulan leadership at a neutral loca--  I understand that -- I need officers who have been trained in advanced hand-to-hand combat!  Then come with me -- Kirk, you too-- you're not supposed to be here anyway. Radio the engine room, have Chief Engineer Olsen meet us at Shuttle Bay Five.  Let's go.  Without transporters, we can't beam off the ship, can't assist Vulcan, can't do our job. I'm creating an opportunity: Mr. Kirk, Mr. Sulu and Mr. Olson will space-jump from the shuttle. You'll have chutes -- you'll land on that machine they've lowered into the atmosphere that's scrambling our gear-- you'll get inside, disable that thing then beam back to the ship.  Mr. Spock, I'm leaving you in command of the ship. Once we have transport capability and communications back up, you'll contact Starfleet and report what the hell's happening here.  Something you've got only precious few minutes to figure out. If all else fails, fall back and rendezvous with the fleet in the Laurentian System. Kirk. I'm promoting you to First Officer.  While I'm gone we need to keep the chain of command. And you two make a swell team.  It's not a prank, Spock.   And I'm not the Captain. You are.  I guess you'll have to come get me. Careful with the ship. She's brand new.  Suit up, Gentlemen.  Pre-jump on one: Three, two, one.  Good luck.  I'm Captain Christopher Pi--  So much for diplomacy.  Christopher Pike -- Captain, U.S.S. Enterprise, registry NCC-1701.  No. You answer for the genocide you just committed on a peaceful planet--  Then Nero, you're confused. Romulus has not been destroyed. How can you blame the Federation for something that hasn't happened--?  If what you say is true... you can save Romulus. You have a second chance to --  Then we have nothing more to discuss.  How reassuring.  Christopher Pike -- Captain, U.S.S. Enterprise, registry NCC-1701.    ... Kirk?    I am relieved. Congratulations, Captain.  ... I am relieved.  And as Fleet Admiral, for your... unique solution to the Kobayashi Maru, it's my honor to award you with a commendation for original thinking."
    },
    "imdb_rating": "7.9",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjE5NDQ5OTE4Ml5BMl5BanBnXkFtZTcwOTE3NDIzMw@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "On the day of James T. Kirk's birth, his father dies on his damaged starship in a last stand against a Romulan mining vessel looking for Ambassador Spock, who in this time, has grown on Vulcan disdained by his neighbors for his half-human heritage. 25 years later, James T. Kirk has grown into a young rebellious troublemaker. Challenged by Captain Christopher Pike to realize his potential in Starfleet, he comes to annoy academy instructors like Commander Spock. Suddenly, there is an emergency on Vulcan and the newly-commissioned USS Enterprise is crewed with promising cadets like Nyota Uhura, Hikaru Sulu, Pavel Chekov and even Kirk himself, thanks to Leonard McCoy's medical trickery. Together, this crew will have an adventure in the final frontier where the old legend is altered forever as a new version of the legend begins.—Paramount Pictures",
    "name": "Star Trek",
    "genres": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ]
}