{
    "filename": "Strangers-on-a-Train_script.txt",
    "imdb_id": "tt0044079",
    "imdb_url": "https://www.imdb.com/title/tt0044079",
    "characters": [
        "Complete credited cast:",
        "Sen. Morton",
        "Barbara Morton",
        "Det. Leslie Hennessey",
        "Prof. Collins",
        "Police Capt. Turley",
        "Anne Morton",
        "Guy Haines",
        "Miriam Joyce Haines (as Laura Elliott)",
        "Bruno Antony",
        "Mr. Antony",
        "Mrs. Antony",
        "Mrs. Cunningham"
    ],
    "dialogues": {
        "Sen.": "",
        "Morton": "Guy and a secretary have set up office in the Morton study. As the scene opens the secretary is handing Guy a large envelope.",
        "Barbara": "Something awful has happened, Guy.  The police have been using everything but radar to locate you.        Who saw you? Did you speak to anyone? You'll need a Witness, you know.  Not quite. Detectives play a game called Motive, Motive, Who'd got the Motive.  He'll still have to answer questions.  Daddy doesn't mind a little scandal. He's a senator.      (ignoring this - to    I still think it would be wonderful to have a man love you so much he'd kill for you.    You mean the professor was boiled?  (somewhat subdued and (she's unsure of    Shouldn't we ask him in for Coffee -- or something?  (pointing out the  Are you getting in any practice today, Guy?  Mr. Hennessy. I think it is a shame Daddy won't let us have him in the house to sit down. Have you met him yet, Louise?  He is awfully cute.  Guy!      Guy turns back to Barbara.    Barbara looks with interest toward Bruno.   Who's the nice looking Frenchman with the Darvilles?  How do you do, Madame Darville. Monsieur.  How are you?    I hope you aren't forgetting our little party on Thursday, Madame.   She comes from the same direction that Guy came.   She stops short as she sees:     Bruno is now heartily joining in conversation with one of the elderly gentlemen.       She is watching this rather unorthodox demonstration. The CAMERA MOVES UP until her head fills the screen. Her glasses glint in the light.     We see the whirling merry-go-round spinning around her head.       She turns her head and looks up the stairs. Barbara has not quite recovered from her ordeal. She hurries forward to greet Anne who is hurrying down the stairs.        He was looking at her first. Then he looked over at me. He went into a sort of trance He looked horrible! He thought he was murdering me.  Anne, why me? Why me?   What did I have to do with it?  He went out with that man!   In the box.   She starts to whisper something to her.     Anne is speaking.      in their box.   They are extremely tense.     At an urgent signal from Anne, Barbara hurries out as if she knew what she had to do.      But Guy is your business.   You'll be with him, won't you?  Guy says you love steak -- rare, Medium, or well-done?",
        "Prof.": "",
        "Collins": "There was a man, now please take note. There was a man who had a goat. He loved that goat, Indeed he did. He loved that goat, just like a kid. What is your opinion?  (fuzzily -- pumping    I'm terribly sorry, but I really don't remember meeting this gentleman.  He turns from the captain to Guy.       I was? I'm sorry, Mr. Halnes. I certainly must have celebrated!   I can't remember you at all.",
        "Anne": "(after a pause then (she listens, then   Guy -- I wonder if you know how much I love you.   (forcing herself to   Watching Guy closely.      (who hasn't taken   Her face shows her relief that Guy can account for his time.   Then everything's's all right.  (near the breaking    Father, it's getting terribly late, and Guy looks so tired...   look at one another with a growing realization of what Miriam's death actually means to their happiness -- they are free.    I told myself over and over I was being silly, but there was one horrible moment tonight when the news came through. I kept remembering what you shouted telephone from Metcalf.  Don't even say it.   Forget you ever said it. Even more   terrifying than the murder itself,  Guy, was the awful thought that if you  had anything to do with it we'd be  separated, -perhaps forever. I'd never   see you again. I couldn't bear it.  Hello, darling. Have you had your dinner?  You weren't in Metcalf all this time? We expected you hours ago.  But, you knew he was on the train! Wasn't that enough to prove you were on it, too?  (growing indignant  He's right, Guy. You mustn't do anything that would look suspicious. You've got to carry on as though nothing has happened.  Well, we'd better be getting back.    So was I. When we build our house, darling, we won't even have glass windows. No doorbells, no newspapers, no telephone --    We'll be happier then, won't we?  Who was it, Guy?   Her face is troubled.   Guy, darling -- this is Mr. Antony -- a friend of Monsieur and Madame Darville... Guy Haines.   She is staring at Bruno with a new expression.     Bruno's coat has spread open a bit, and his tie pin bearing the name \"Bruno\" is resting on the edge of the table.     She becomes aware that this is the man she has seen call to Guy in the art museum, that they have met before. Her eyes turn a little in Guy's direction, though she does not look at him.    This is my sister Barbara.       Barbara, this is Mr. Antony.   She is looking at Bruno, wondering what mystery lies behind this strange individual and why he and Guy have disclaimed any previous acquaintance.    Her face is troubled. CAMERA BEGINS TO PULL BACK. We see now that the reception is in progress and that Anne stands beside her father to greet the arriving guests. CAMERA PULLS BACK FURTHER to show us a full view of a very crowded Washington gathering Many white ties and tails and decollete in evidence. Many accents. Even some foreign languages are being spoken. Music and chatter in the b.g.       THE CAMERA PASSES various groups   of guests in conversation including Guy and Barbara who are   together. From this distance we cannot hear what they   are saying. CAMERA CONTINUES TO the front door. It    opens to admit a new arrival. It is Bruno. He wears white tie    and tails, looking very elegant.     We see Guy excuse himself from Barbara, cross to Bruno and speak to him angrily, obviously asking, \"What are you doing here?\" Bruno, however, greets Guy with a smile then turns from him, unperturbed and bland. He sees Anne and moves toward her, smiling.     As Bruno comes in her direction, Anne's expression shows her mystification and concern about Bruno's presence and about Guy's attitude toward him.    This is Mr. Antony, father.  A friend of the Darvilles.   She looks off in Bruno's direction extremely disturbed at this new aspect of the mysterious stranger.      What's the matter, Barbara? Did you see it happen? Did you see it -- all?       She looks away, with growing consciousness of the situation    Do you know where Guy is?   There are cars lined up outside on the street. One limousine is pulling up in the center, two figures at the passenger door. One is climbing in. The other is Guy.    She calls out urgently:   Guy!   The limousine moves off and Guy comes toward her.    You didn't meet him for the first time the other day, did you, Guy?  Yes. Did you notice how he stared at Barbara that day?    What did Miriam look like, Guy.  Go on, I want you to tell me.  What else?  She wore glasses, didn't she?  She looked a lot like Barbara, didn't she?  How did you get him to do it, Guy.  He killed Miriam, didn't he?   Tell me, Guy!    You must have realized he was talking a lot of nonsense!    You mean you've known about Miriam all this time?  Why didn't you call the police?  Oh, Guy -- what can we do?  (With an anxious look       But don't you understand, Mrs. Antony -- your son is responsible for a woman's death.  Of course not, Mrs. Antony.  Guy doesn't know I'm here, Mr. Antony.   Bruno turns and waves to Anne from the landing, then goes on up the stairs.      ...And he said that if the police found your lighter there, that's all they'd need -- something to prove you were at the scene of the murder.   (she nods her head in  Then I'll go.  But, Guy, that'll be too late!  Yes.    That's just it. I don't know. It's Bruno. I talked to him, Guy --  He acted peculiar -- as if he could put the murder right in your lap, and not involve himself at all.  Guy, has he anything that the police could trace to you -- Any little thing.    No, -- I don't think so. Oh, why can't I remember -- he said such crazy things!  Something about the moon -- he said he had an appointment with the moon.  And have Hennessy and that other one right at your heels?   In the box.   She starts to whisper something to her.     Anne is speaking.   If he wins this next set -- you'd better have everything ready. Here -- give the driver this ten dollars.     looking very worried.       Again the call of the Umpire.   unable to bear the suspense.    She glances O.S.     in their box.   They are extremely tense.     At an urgent signal from Anne, Barbara hurries out as if she knew what she had to do.      (waits a moment, then  (a pause, then she  Guy'll be back tomorrow. He wants me to take him some things.  He says he looks silly in his tennis clothes.",
        "Guy": "(a faint        Not now, thanks.          I don't smoke much.    You're quite a reader, Mr. Anthony.    That's all right. Forget it.    I guess I'm pretty jumpy.  You'll have to drink both of them.  What?  It shouldn't have been. Unless they've legalized bigamy overnight.      It's my home town.    Thanks very much. But I think I'll go to the dining car. Do you know if there are any vacant seats in the dining car now?  Thanks just the same, but I really don't think --  Well, I'll Just have a hamburger and a cup of coffee.  Sure.   I'm your friend, Bruno.  You must be imagining things.      Not lately.          Miriam.  Let's not talk about it any more.  I don't think so.  Let's change subject, Bruno, can't we?  (indicating the  No. I may be old fashioned, but I thought murder was against the law.  You can't go around killing people just because you think they're useless.  Why?  I'm afraid I haven't time to listen.  Swap murders?        Nice meeting you, Bruno.  Sure, sure, Bruno. They're all okay.  Hi, Bill.  (indicating his  You're looking well, Miriam.    My hurry? That's funny, coming from you! You're the one who's in a hurry, aren't you?      Let's see your lawyer and get this over with.  (taking money from  What are you trying to say, Miriam? Come out with it.    And what do you mean by that?  Let's not talk about Anne Burton.  What for?  Why me?   It's not my baby.    What happened? Did he run out on you?  You're a liar and a  cheat,   Miriam. You've wanted to get  rid of   me long enough and now I'll  go you   one better -- I never want to see  or hear   of you again.  ...That's what should happen to people like you. And if I...    Long distance. I want Washington, D. C. The number is Republic 0800. Person to person. Miss Anne Burton.          (a pause, then raising (the connection is         He is reading an evening newspaper.     He lowers his paper and looks across.        He turns, and with a slightly bewildered and wary expression, goes out of the picture to cross the street.      (recognizes Bruno --  What do you mean?  What's this all about?   He looks down at the glasses, mystified.   He looks up again to Bruno.    He is horrified. He looks swiftly down at the glasses in his hand, then back to Bruno.   Are you trying to tell me you've -- Why, you maniac!  Where do you think I'm going? I'm going to call the police, of course.  We'd both be arrested for murder?    Let me go, Bruno. I had nothing to do with this and the police will believe me.  My telephone.   He looks across at the police, then down at himself with some surprise and disgust, then over at Bruno, suddenly conscious he is behaving like a criminal and that Bruno is responsible for his predicament.          Guy is standing at the telephone which is still ringing. He has Miriam's glasses in his hand. He looks down at them for a moment, then picks up the receiver. He hesitates, then speaks into the phone.     (forcing his voice to    His figure tense, he rings the   bell. After a moment's wait, the door is opened from inside   and Anne Burton stands in the lighted hallway. She looks at    Guy with an anxious, taut expression, searches his face   hastily, then as he takes a step inside she is suddenly in   his arms. They embrace with wordless fervor.        He looks apprehensively in direction of the living room, conscious of what the news is to be, but covering up.    SENATOR BURTON and BARBARA BURTON are seated near a desk on the farthest side of the room. Senator Burton is a distinguished fifty, a man with great pride in tradition, his family and his career. Barbara, Anne's younger sister, is a lively seventeen who loves excitement, says exactly what she thinks and rarely thinks before she says it. Superficially, in height and figure, she resembles Miriam. She also weirs glasses. By her gestures we gather she is speaking urgently, but softly, to her father, who lifts a weary hand to quiet her as she looks toward Guy in the hallway, Barbara keeps quiet and also looks toward Guy. They both wait for him to enter.     He steels himself for the long walk across the hall and the living room.      Miriam...murdered.        No. His name was Collins.   He is a professor.  University of Virginia.  I'm afraid there'll be a lot of reporters at your front door in the morning.  Someone might say it...I'd do anything to keep you all out of this mess.   look at one another with a growing realization of what Miriam's death actually means to their happiness -- they are free.    Yes sir.   Goodnight.  That I could strang...  Captain Turley's office?  Captain Turley is expecting me.   Guy Haines.   He now has time to take stock of the waiting people.    He catches his breath when he sees:     Guy nods in returns.    He looks about him uncomfortably, then turns suddenly as he sees:     Guy starts with a smile of recognition to say, \"How do you do?\" but at that moment he hears the door open and his name called:   Thank you, sir.     He looks up eagerly.     Surprised.    His confident expression fades.    But we were sitting opposite each other in the observation car! You were singing a song about a goat --     Momentarily Guy is frustrated, then he turns quietly to Turley.     On the train.    Completely.    He didn't remember me.  Apparently not at the right time. They suggested I could have caught the train at Baltimore after Miriam was murdered. They had it all worked out -- in their timetables.       (drops the curtain,    Very likely.    Hello --  Must be some mistake.   It wasn't for me.  Well, I suppose I was pretty lucky to be seeded fifth, really.    I won't have to do that. When I'm through with tennis. I'll be going into politics, I hope.   The tiny figure of a man is standing at the base of the tall white column. The figure lifts in arm and waves. Instinct tells us that this is Bruno. Hennessy is still mumbling his opinion of politics.    Guy turns his back on Bruno's figure and looks frantically toward to street, wanting to get away.     Pentagon Building, please.   As Guy comes in from outside, there is a note on   the floor that has been pushed under the door. Guy picks    it up, stares at it for a minute before he opens it. He takes    out a handwritten note and reads it with an expression   of disgust.    We've actually been alone for an hour. Seems almost indecent. You like?  I was beginning to feel like a goldfish.  No Hennessy.  I don't know. I suppose until they find out who did it.  I suppose so.      Stay away from me, I tell you!    (as he takes out a  Her voice breaks his reverie.   He answers her with a forced smile.   No, thank you, Louise.  He looks across at the watching crowd.     The heads of the people in the bleachers move from side to side, to follow the play on the court. One head is not moving. It is staring at Guy. It is Bruno.  At this moment, we hear the umpire calling, \"Game, set and match\" to the winning mixed doubles pair.     His expression becomes set.     Bruno is making his way out of the small stand.       Perplexed and apprehensive as to what Bruno may be up to. He hears his opponent's voice.    The group at the table comprising Bruno, Anne and the two French people. Bruno is preening himself as the others laugh uproariously, obviously at something Bruno has said. Anne catches sight of Guy and smiles at him.     CAMERA MOVES WITH HIM as he comes forward toward the table.     He gives a weak acknowledgment in Bruno's direction, realizing that Bruno has wormed his way into the group and that he must accept the introduction.       He gives another weak little smile.     He is still watching Bruno talk to the French couple. Guy is unaware of Anne's looks. Suddenly his attention is arrested by the sound of Barbara's voice calling him.      He pulls those yarns right out of his hat, Babs.   He gives a sharp look back toward Bruno. There is more laughter coming from the French couple at the table.     Bruno is occupied with his French joke, but Anne is looking at Guy strangely.     Guy turns back to Barbara.    Barbara looks with interest toward Bruno.   He's not French.    His name's Antony.     CAMERA PULLS BACK TO SHOW Guy staring down at it. He is partially dressed for an evening party, in black bow tie but without his jacket. He leans forward to take up a letter from among brown paper wrappings on the table.     He stares down at the note.   At this moment there is a knock at the door.    Hiya, Hennessy. Won't keep you out late tonight. With Forest Hills coming up tomorrow, I've got to get some sleep.  Doesn't that bloodhound over relax? He sticks so close he's beginning to grow on me -- like a fungus.  Come on. Don't forget your sleeping bag.     He is watching Bruno.    Bring him this way.  I hardly know him, sir.  Yes, sir.      Here -- let me.  Have you got a car here?  You mean when you introduced us at the club?        What else is there?  Yes.  I get him to do it?  Yes. He's a maniac. I met him on the train going to Metcalf. He had a crazy scheme about exchanging murders. I do his murder and he do mine.  Well, he'd read about me in the paper. He knew about Miriam -- and about you. He suggested that  if he got rid of Miriam for me, I should kill his father.  Of course! I didn't give it another thought. And now a lunatic wants me to kill his father.    Since the first night.   He gave me her glasses.    I don't know, Anne...I don't know.    No, that's no good, Anne. I mustn't drag anyone else into this mess. Come on. Let's go in.   Still in his dinner clothes, Guy is seated in deep thought near the telephone, wrestling with his problem. There is an open telephone directory in front of him. He comes to a decision, picks up the telephone and dials a number. He waits for the answer, then:   Bruno? Yes, yes, it's Guy...I've decided to do what you want. I'll make that little visit to father.... Tonight. Yes, I want to get this thing over with, can you leave the house again, Bruno? You'd better stay out till daylight.   Guy is sitting at the table. He is dressed differently, having changed from his dinner clothes to a sack suit. There is only one lamp lighted in the room. Guy presents a grim picture.     He is studying the plan of Bruno's house, and he picks up the key Bruno sent along with it.  Finally he looks at his watch, then folds the plan and puts it in his pocket with the key. He rises, crosses to the  chest of drawers, opens the top drawer.     Guy crosses to his door, which he opens surreptitiously.     The strolling figure of Hammond on the far side of the street.       He reacts to the sight of the dog, stops an instant, and turn on his flashlight. The heavy massive face of the dog looks straight down at him. Guy turns off the flashlight and after a moment of indecision starts slowly up the stairs once more, the dog watching every step he takes.     moving quietly along the hallway, approaches two doors. He takes out his flash and identifies the door with his plan.     He pauses at the first door, then passes it quietly, walking on to the next one. He turns the knob soundlessly and passes through into the room.    Mr. Antony!     His face is dead.      No intention whatsoever.      I never had.  Or this.          Darling, if that loudspeaker announces that I'm not going to play, Hennessy bound to be suspicious He'd keep me from ever getting near Metcalf.   (he puts his hand on    Well, that's what's in his mind now. He's not going to expose himself in broad daylight, If I can finish off this match in three sets, I'll still get there in time.  Okay, Tim.   Be right with you.  You got it straight? Just make sure Barbara has everything ready as soon as the third set starts.   (his face brightens  Be right there. I was afraid you wouldn't get here. Wish me luck, darling.  What about?   (noticing the stricken    My cigarette lighter. He said once he could have left it on the islands as evidence But he wouldn't do that. Not in broad day light.      That's no help. But I can't take any chances. I've got to get that lighter -- somehow.  I'll have to default.  The moon! You said he had an appointment --  Then he is going to Metcalf. But he has to wait until it gets dark -- Listen, Anne, as soon as the third set starts, tell Barbara --   volleying with Reynolds.     about to serve, looks anxiously across the court.     as he serves.       gives a furtive glance around while waiting for his change.    Coming along and looking for Bruno.    His eyes light up.       calls to Bruno.   Hey, Bruno.  Stop it, Bruno.   Give me my lighter, Bruno!   Bruno swings around till his back is to us. He pushes Guy toward the edge, but Guy manages to grab the rein of the nearest horse. The momentum of the machine swings Guy around against the horse, whose big head towers in the f.g. Bruno, on this side of the horse pushes forward and tries to grab the reins from Guy's hand. He tries to slash at Guy's face. The back of Bruno's head is toward us during this. Guy suddenly leans out across the horse and smashes his fist against Bruno's face. Bruno's head goes back until it is in the f.g. in a upside-down position.       Again they struggles between two horses. On each side of them are two young screaming girls. The two bounce from one horse to the other.      Yes, I think so.       This is Mr. Turley, Chief of Police.      Can you tell me where there's a telephone?  Bruno. Bruno Antony. A very clever fellow.",
        "Haines": "",
        "Bruno": "(smiling with sudden     (smiling and  (with an apologetic  It must be pretty exciting to be so important.  People who do things are important. I never seem to do anything.  (still insistent on  Wish I could see you play. But I've got to be back in Washington tomorrow. I live in Arlington, you know.  Cigarette?  I smoke too much.  Thanks. Elegant.    Anne Burton. Sometimes I turn the sport page and look at the society news. And the pictures. She's very beautiful, Senator Burton's daughter.  Yes, I am. Ask me anything, from today's stock reports to Li'l Abner, and I got the answer.  Even news about people I don't know. Like who'd like to marry whom when his wife gets her divorce.    There's a new cure for that. Scotch and plain water. A pair. Double. Only kind of doubles I play.     The wedding. You and Anne Burton. It was in the papers.  I have a theory about that. I'd like to tell you about it some time. But right now I suppose divorce Is still the simplest operation.    Metcalf? What would anybody want to go there for?  Oh, I get it! A little talk with your wife to about the divorce! I suppose she was the girl next door. Held her hand in high school and before you knew it -- hooked! Am I right?     (motions the waiter   Oh, go on and order.  (delighted, lifts his   Bruno and Guy are finishing lunch. Bruno has been drinking and his eyes are bright and feverish. An almost empty liquor bottle is near a couple of detective novels covered with gaudily Illustrated dust jackets. Bruno has in unlighted cigarette in his mouth. Guy's lighter is on the table. Bruno snaps it a couple of times, as though fascinated, lights his cigarette and puts the lighter on the table again.   Sure, I went to college. Three of them. Every time they kicked me out my father threw me back in. He finally gave up. He thinks I'm awfully small fry, not worth the bait. You my friend, Guy?   (empties the bottle  (hitting the bottom  You mean before or after I kill him?  (leaning forward  I did. I flew in a jet plans too. Zzzzzzzp! Man, that's a thrill! Almost blow the sawdust out of my head. I'm going to make a reservation on the first rocket to the moon...  I'm not like you, Guy. You're lucky. You're smart. Marrying the boss's daughter is a nice short cut to a career, isn't it?  Take it easy, boy. I'm your friend, remember? I'd do anything for you.  What'd you say her name was -- your wife's?  That's it. Miriam Joyce Haines. Played around a lot, I suppose?    You mean you got enough on her to get your divorce no matter what?  Okay, Guy. Want me to tell you one of my ideas for murdering my father?    But not against the law of nature. My theory is that everybody is a potential murderer. Didn't you ever want to kill somebody? Say one of those useless fellows Miriam was running around with?  Oh, what's a life or two? Some people are bitter off dead, Guy. Take your -- wife and my father, for instance. It reminds me of a wonderful idea had once. I used to put myself to sleep at night -- figuring it out. Now, let's say you want to get rid of your wife.  Let's say she refuses to give you a divorce -- Let's say. You'd be afraid to kill her because you'd get caught. And what would trip you up? Motive. Now here's the plan...    Each fellow does the other fellow's murder. Then there is nothing to connect them. The one who had the motive isn't there. Each fellow murders a total stranger. Like you do my murder and I do yours.  For example, your wife, my father. Criss-cross.      (detaining him at the    (almost dreamily as  No, Ma.   They look fine.   Thanks.  I'm all right, Ma.   Don't worry about me.  I bought a bottle of them yesterday. A whole fifth.      I'm sick and tired of bowing and scraping to the king.  You're wonderful, Ma! It's the old boy, all right. That's father!   as he approaches the telephone.   (calls back to his (he picks up the    I just wanted to ask how you made out with Miriam.        (into phone, with      With horse's head in foreground, as it is coming toward us.       Bruno on his horse, as though he is chasing Miriam.    He is a little more open now in his laughter.     He is starting to join in the singing.    Is your name Miriam?   Bruno glances back over his shoulder.   He looks down and goes back one or two steps.     Bruno's hands retrieve the lighter from the ground.     As Bruno calmly threads his way along the midway, we hear above the noise of the various concessions, a shrill police whistle in the distance. Presently a couple of policemen comes running from direction of the main entrance and past Bruno. He glances at them over his shoulder, then strolls on toward the main entrance to the park.    The time is 9.30.         Recognize them?    It was very quick, Guy. She wasn't hurt in any way. It was all over in no time.    I was very careful. Even when I dropped your lighter there, I went right back to it up. If It'd been found, it would have ruined our whole scheme, wouldn't it?  (looks at Guy with  Where are you going?  But you can't, Guy. We'd both be arrested for murder.  You're is much in it as I am. We planned it together. Criss-cross. I do your murder --      What is it?    Tell them you know about it already, Guy.  Don't you call me that.  You must be tired, Guy. I know I am. I've sure had a strenuous evening.  Now look, Guy, about my father. I have the plans made. Two plans. A plan of the grounds and a plan of the house. I have in old Luger I bought at a pawn shop in San Francisco. My father --  Wait a minute, Guy. To have to talk. We have to arrange things.       His face wears the most affable expression.  Hello, Guy. I tried your apartment, but -- Why, Guy, this is Bruno!    But Guy, you haven't called me. My father's leaving for Florida the end of this week --     I've been a fan of yours for a long time, Mr. Haines. In fact, I follow everything you do.   Bruno stops in the middle of some French to stare at Barbara. Her voice continues.      He does not acknowledge the introduction immediately.   He is still staring at Barbara. Then he nods abstractedly.      Good evening, Miss Burton.  I'd like to talk to you sometime, Senator, about my idea of harnessing the life force. It will make atomic power look like the horse and buggy. I'm already developing my faculty for seeing millions of miles. And, Senator, can you imagine being able to smell a flower on the planet of Mars? I'd like to lunch with you some day soon and tell you more about it.   Bruno talking to an elderly, dignified gentlemen.   But tell me, Judge, after you've sentenced a man to the chair, isn't it difficult to go and eat your dinner after that?  Quite impersonal, isn't it, sir?  So few murderers are caught.  No more than anyone else.   No more than you, for instance.     (shaking a finger    at  There you are, you see! There you are! All right, now you're going -- to do a murder. How are you going to do it? This is the fascinating part -- how are you going to do it...I didn't get your name?  Mrs. Cunningham, how are you going to do it?    Bang, bang, all over the place. Blood everywhere?  Ah! That's better, that's better. Mrs.....?  (he is thoroughly  (looks at her  No, I have the best way, and the best tools. Simple, silent, and quick. The silent part being the most important. Let me show you what I mean.  (he raises his hands  Oh!  no. Now, when I nod my head, just see if you can cry out, and I bet you can't. Now with my two thumbs...you see that's where I'll be able to prevent any sound coming from you. Now, just wait for the nod of my head.   As he starts to Press her neck, his eyes wander from the face of his \"victim\" to someone else off scene.     He is now transfixed. His breathing becomes heavy. A strange expression comes over his face. He still stares off at Barbara.     He now seem to have almost gone into a trance. Over the shot we begin to HEAR a strangled cry, and a broken exclamation, then Mrs. Anderson's voice.    His body is swaying slightly at the various efforts to drag him away from Mrs. Cunningham. His eyes begin to close, and slowly he falls away from the picture in a dead faint on the floor.    What happened? I was on a merry-go- round somewhere. It made me dizzy.  But, Guy --  You shouldn't have done that, Guy.     The low CAMERA throws a vast shadow up on the wall behind him, creating a grimace of his smile.  Yes, Mr. Haines?   (smiles grimly at  Then a I correct, Mr. Haines, in assuming that you have no intention of going ahead with our arrangement?  I see. You won't have any further use for the key, then, Mr. Haines. Thank you very such.  I don't like to be doublecrossed.  I have a murder on my conscience, but it's not my murder, Mr. Haines -- it's yours. And as you're the one to profit, I think you should be the one to pay for it.  Don't worry. I'm not going to shoot you, Mr. Haines. It might disturb mother. I'm a very clever follow. I'll think of something better than that. Much better.  Oh, Miss Burton!  I'm afraid mother wasn't very helpful, was she? You know she hasn't been well for a long time. She's a little -- how shall I say -- confused. Poor mother.  You know, I'm very upset with Guy. He shouldn't have sent you on an errand like this.  He's been leading you up the garden path, I'm afraid. He must be very desperate to try to involve me. I've been protecting him ever since we had that conversation on the train and he told me how he hated his wife.  Why, do you know, Miss Burton, he tried to get me to go back to the island one night after dark and pick up his lighter so the police wouldn't find it? He dropped it there, you know, when -- well, that night.  The whole thing's been worrying me so much. But of course I couldn't do it, Miss Burton. It would have been too risky. And besides, it would have made me an accessory.  Miss Burton, I know how you feel.  Miss Burton, you must excuse me. I have an urgent appointment. I must go up and change. Now, I really must go...if you'll excuse me...   looks down in dismay.    Down there -- my -- my cigarette -- case. It's very valuable.  You've got to get this grating up right away.         I don't want to relax.   straining and panicky.     joining the queue.    He glances ahead of him.     pulls his hat a little further over his, eyes.   Some new arrivals join the queue behind him.     in the queue of people. He is edging slowly along. He is about ten people away from the entrance. He suddenly looks ahead and sees.     begins to look a little uneasy.    We see him begin to mentally deliberate.     moving along the line. CAMERA MOVES IN until his head and shoulders fill the screen. He is now coming within range of the flood-lit pay-box. The light seems to creep up across his chest and slowly reveal his face. He lowers his head.    gives a quick glance back, sees Guy then he turns and looks off in another direction.     He turns and glances over his shoulder.    I want to get off of here! Let me off of here! It makes me dizzy.   Bruno swings around till his back is to us. He pushes Guy toward the edge, but Guy manages to grab the rein of the nearest horse. The momentum of the machine swings Guy around against the horse, whose big head towers in the f.g. Bruno, on this side of the horse pushes forward and tries to grab the reins from Guy's hand. He tries to slash at Guy's face. The back of Bruno's head is toward us during this. Guy suddenly leans out across the horse and smashes his fist against Bruno's face. Bruno's head goes back until it is in the f.g. in a upside-down position.       Again they struggles between two horses. On each side of them are two young screaming girls. The two bounce from one horse to the other.       kicking at Guy's knuckles.    Hello, Guy.  (weakly nodding at    (with a faint,   As Bruno is dying, his closed fist slowly starts to open.",
        "Antony": "As Guy moves in soundlessly and closes the door.   He looks toward the stairs which are in shadow.     The room is in darkness except for the dim outline of the recumbent figure in the bed. We hear Guy's voice, in a loud whisper:    Anne and Mrs. Antony are in the middle of a conversation. Anne's manner is tense and purposeful, Mrs. Antony's much less serious.   Oh, now, Miss Burton, really! I know Bruno's been in some very awkward scrapes, but nothing so ridiculous as a murder.     (drawing herself up    (she sighs and rises,    A taxi is at the front door. Bruno is descending the steps. He gets into the cab, which moves off.     A taxi is at the front door. Bruno is descending the steps. He gets into the cab, which moves off.",
        "Mrs.": "Since you insisted on a manicure, dear, I do wish you'd keep your hands quiet. You're so restless lately.  Did I file them too short?  Then what's the matter?  You look so Pale, dear. Are you out of vitamins?    I do hope you've forgotten about that silly little plan of yours?        (she leads him toward      I never permit it!  That it is.    Don't you stay out too late, Miriam.   Miriam's mother, dressed all in black, is seated in one of the chairs. She has been staring at the floor, but brings her eyes up slowly to glare at Guy with a look of burning hatred.        Well, Mr. Antony, you seem very interested in the subject of murder.  Me?   I'm not interested in murder.      Mrs. Cunningham.  (entering into the  What about a little poison?  Anderson.  I have a wonderful Idea! I can take him out in the car and when I get to a lonely spot, knock him on the head with a hammer, pour gasoline over him and over the car and start the whole thing ablaze.    Mr. Antony!     Mr. Antony!  Oh, now, Miss Burton, really! I know Bruno's been in some very awkward scrapes, but nothing so ridiculous as a murder.     (drawing herself up    (she sighs and rises,",
        "Cunningham": "Well, Mr. Antony, you seem very interested in the subject of murder.  Me?   I'm not interested in murder.      Mrs. Cunningham.  (entering into the  I have a wonderful Idea! I can take him out in the car and when I get to a lonely spot, knock him on the head with a hammer, pour gasoline over him and over the car and start the whole thing ablaze."
    },
    "imdb_rating": "7.9",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNWJjOGM4NmEtNDE2YS00OGEyLTkwZWItMGM4YzdhZDZhMzNhXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "Bruno Antony thinks he has the perfect plot to rid himself of his hated father, and when he meets tennis player Guy Haines on a train he thinks he's found the partner he needs to pull it off. His plan is relatively simple: Two strangers each agree to kill someone the other person wants gone. For example, Guy could kill his father and he could get rid of Guy's wife Miriam, freeing him to marry Anne Morton, the beautiful daughter of a U.S. Senator. Guy dismisses it all out of hand, but Bruno goes ahead with his half of the \"bargain\" and disposes of Miriam. When Guy balks, Bruno makes it clear that he will plant evidence to implicate Guy in her murder if he doesn't get rid of his father. Guy had also made some unfortunate statements about Miriam after she had refused to divorce him. It all leads the police to believe Guy is responsible for the murder, forcing him to deal with Bruno's mad ravings.—garykmcd",
    "name": "Strangers on a Train",
    "genres": [
        "Crime",
        "Drama",
        "Film-Noir"
    ]
}