{
    "filename": "Super-8_script.txt",
    "imdb_id": "tt1650062",
    "imdb_url": "https://www.imdb.com/title/tt1650062",
    "characters": [
        "Martin",
        "Mr. Kaznyk",
        "Cary",
        "Jen Kaznyk",
        "Mrs. Kaznyk",
        "Deputy Jackson Lamb",
        "Alice Dainard",
        "Kaznyk Twin",
        "Joe Lamb",
        "Charles Kaznyk",
        "Louis Dainard",
        "Peg Kaznyk",
        "Preston",
        "Benji Kaznyk"
    ],
    "dialogues": {
        "Martin": "Jesus, shut up.  I don't know how you guys can eat. 3.  Jesus -- guys--  I heard it crushed her completely. At least keep your voices  No please, if you're really asking.  So... people are turning into zombies because of the chemical factory, right?  I told you, I don't like it when you call me that.  Shut up.  New lines? Charles-- what, I have new lines?  So I don't have any new lines, right? Because I just learned these.  Hey, Charles, Charles, do I have more lines?  \"-- Sweetheart, this is my job, I have no choice.\" \"That's nothing you need to worry about...\" \"What am I suppose to go to Michigan with you...\"  No, no, no. Cary.  Bogus, Cary.  Yeah, I think so.   -- what? Guys, what is it? ... shit... Joe moves closer to the blood -- heartsick -- on the verge of DEEP, REAL TEARS -- everything stops -- but then:  Hey, don't touch it, what are you doing?  How can a pick-up truck derail a train? That's impossible.  -- who?  What? Who is that?  That's Dr. Woodward? The science guy?  Wow... I'm not in his class.  Shut up, Cary.  The dungeon?   I'm never taking a train again.  Am I the only one shaking?! I'm also crying --  I'll try, but I'm still crying about last night, I feel like I'm crazy.  Anyone else still shaking from the crash?  Am I the only one who doesn't understand what this all means?  Shut up, I don't like that--  Fall down stairs.  What was your teacher even talking about? Who are we supposed to be afraid of anyway?  That's like the third time Dude. Bitchen. that's happened.  She's dead, if it took her, she-- -- don't say that!  Well, so guys, if the Air Force has already searches Woodward's house, wouldn't they've already searched the classroom too?  Where's the dungeon?  Look at all this junk. He's got movies in here.  -- He's been tracking this thing since like 1958.  Arh! I can't watch that!  Did you hear that?  No. They'd never do that.  I can't see anything -- do you see anything?  -- here, use me, I'm strong!  Harder! Come on, you PUSSY!!! With all his might, Joe hits the window again -- the SLIGHTEST sound of glass adjusting -- meanwhile, SLAM!!! The creature BUSTING the bus door -- PRYING it wider like a sardine can -- NELEC SITS AGAINST THE GLASS AND OPENS FIRE, FUTILELY, ON THE CREATURE. He makes a CALL on his walkie:  They're coming, man! I think we should go!  Guys, that sounds like guns!  Drugs are so bad! 106.  -- whose house is this?  Kathy? Oh, Kathy's cool.  Charles-- that's not yours-- -- what?! I'm thirsty and I'm Another fucking LOUD BLAST -- sound of GLASS BREAKING -- and the creature ROARING -- And there it is, in silhouette, moving past the bay window -- Joe realizes: where the creature is, so are the blasts:  What happened to my leg? It hurts.  Oh, my leg hurts!",
        "Kaznyk": "",
        "Cary": "What do you think was in the coffin?  I mean cause of how she died.  ... you weren't wondering that?  Either nothing was in there, or like whatever they scraped up--  Why?  Those turkey rolls are pretty good. 4.  Martin booted all over his locker, it was the grossest one yet-- Let Joe focus, he's reading.  After he ate two boxes of Mike and Ikes-- never seen so many colors in my life. Will you shut up a minute?  What wife?  You're not supposed to talk at all in the silent reading section--  Shut up. It's for \"silent reading.\"   Can I see --?   Hathaway's married now? Really?  I do.  Well then I totally sharteezed in my pants. That's exactly what I'm  Another classic from Smartin.  I'm sorry, Smartin.  You know the first place I'm gonna drive when I get my license?  New Castle, Pennsylvania. Fireworks capital of America.  I took apart two packs of cherry bombs and made my own M-80.  Well you're a pussy. And your mom has one. 19.  Sorry man.  -- I didn't put it in--   Guys, did you see those explosions? That was awesome.  -- what? Guys, what is it? ... shit... Joe moves closer to the blood -- heartsick -- on the verge of DEEP, REAL TEARS -- everything stops -- but then:  Guys, get up here. You can see everything from up here.  Oh my God. ... Look at that...  ... holy shit...  Honors biology. 29.  We know.  Yeah, he put it in the \"dungeon,\" never gave it back...  I can't believe all that just happened here! Nothing ever My whole camera lends is like happens here!!! shattered now!  Joe: what was Woodward talking about? I don't know, I don't know--  No one cares about your CAMERA!  Did it really look good? My death?  Looks who's talking, Math Camp.  He is so sophisticated.  Shut up, I like coffee. No one likes coffee.  Probably, Smartin.  I say he was just sick of being old and wanted to kill himself.  Pussy, stop pulling the fries away. I ordered these for a reason. -- he gets all possessive with his fries, it's so annoying.  Excuse me, could we please get another order of fries because my friend here is fat?  Mint. Gnarly! Charles and Cary head off, planning the explosions. Alice looks at him knowingly.    That thing took her--?! -- are you shitting me?   I've got six tons of explosives in here, let's find that thing and blow it to shit.  Where the hell are we going anyway?  What research?  Hay Donny, this car is gnarly. 90.  Sorry.  Guys, it's Dr. Woodward. Look.  I rolled those M-80's myself, that's right.  I think we're gonna die.  I think they're gonna kill us.  Sako Bolt Action, 30-06 -- okay okay okay, I get it -- Leathwood Art Scope-- Hernandez makes a radio call, Overmyer straining to see out the windows as Nelec locks and loads the unique ammo and moves to a driver's side window, tries to see --  Charles, what are you doing?  -- oh God -- guys --  Harder! Come on, you PUSSY!!! With all his might, Joe hits the window again -- the SLIGHTEST sound of glass adjusting -- meanwhile, SLAM!!! The creature BUSTING the bus door -- PRYING it wider like a sardine can -- NELEC SITS AGAINST THE GLASS AND OPENS FIRE, FUTILELY, ON THE CREATURE. He makes a CALL on his walkie:  Go! Joe, move!!!  Got my fireworks back!  What's that? What are those sounds?   What the hell is that?!  He's too stoned!  You guys see those explosions? They were huge.   Kathy's. I got it off the fridge.  Where we going?  There's a hole in the house!  I'm not staying with the girls!  Calm down.  So what are we doing here?  I've been following you for the last five blocks. What are we doing here?  Help you with what?  For what? What's in these windows?  It's dirt. Why is there dirt in these windows?  One, two, three.... One, two, three.... One, two threee.  Whoa. This is scary.  Are you kidding me? 110.  Joe, I don't understand-- 111.  It's Sheriff Pruitt.  What is this?  It's eating a person.  I don't think it's going to hurt it, Joe.  So?   -- why-- what are you gonna do--?  Where are you going? 113.  -- come on-- damnit!  -- damnit!!!  Joe!  I thought this was the way out. I tried! Hey, Alice, welcome back--   Joe, what are you doing?  Joe, shut up, it's gonna kill you!    Okay, wait a minute, WHAT?!  -- what's he doing...?",
        "Jen": "Mom, it's not fair that I can't go to Wendy's. Every single person is going except me!   So...  Mom, why can't I switch with Charles?  Oh, really, guess what? We're switching. 11.  Mom, come on!  Compared to Debbie's these are long.  I can't wear these or go to Wendy's party? This is not fair.  Mom's racist.  As if I'm gonna help you.  ... does it have to be him?  This whole evacuation thing's freaking me out. Making me rethink my priorities. Saw you over here and thought maybe we could kick back.  I asked Charles about you, and he said you're a great guy--  Will you hate me if I start our relationship by asking a favor?",
        "Mrs.": "John. I don't like it. This case. These murders.  Mackinac Island's beautiful this time of year.  The dead, coming back to life...? I think you're in danger--  You do have a choice. We all do...  John, I've never asked you to stop. I've never asked you to give up or walk away.  But I'm asking you now-- please. For me. Don't go back. Don't leave me. 22.  I need to know this isn't the last time I'll see you. I just love you so much.  John. I don't like it. This case. These murders.  Mackinac Island's beautiful this time of year.    But I'm asking you now-- please. For me. Don't go back. Don't leave me. I need to know this isn't the last time I'll see you. I just love you so much.  I wanna know who took `em.  Twenty microwave ovens: gone from my inventory. Brook County's without power -- this feels to me like a Russian invasion.  Until you can tell me who's messing with us, I say it's the Soviets and we're at war. I like you, Jack, but we need Sheriff Pruitt back.  John. I don't like it. This case. These murders.",
        "Alice": "Joe Lamb?!  What the hell's he doing here?  He's the deputy's kid!  Charles, I don't have a license. I can't drive with him!  It's too late! He's seeing me in this car right now.  Get in.  What?  I'm sorta trying to drive--  ... no...?!  Stop.  My dad works at the mill.  I know, we read it, we get it.  Was that okay? Or... not really?  I love how calm he is.   -- what's all that blood?  What's the blood? -- did someone get hurt--?  ) -- yeah, it's him--  Dr. Woodward...?  ... Dr. Woodward?  -- dates and times. -- what's that line across?     It's hard enough to drive without everyone yelling! 32.  We can't tell anyone we were there - - we can't say a thing about it -- my dad cannot find out I took his car, do you guys hear me?!  Joe, this is yours.  I should never have done this.  We can use my dad's camera -- it's got sound and-- Hello?  Hi...  Oh-- no. No, I'm done with that.  I'm watching the crash on the news.  I should go.  -- wait, hold on -- lemme come over and show you the pages, okay? I'll be right there. No, d--     I don't care what Charles wants-- I said no on the phone. 40.  And now you're at my house.  It's too weird after last night-- I don't understand how you guys can keep working on your stupid movie, I really don't.   No.  You should go.  He was just inviting me to a party.  ... what do you think happened...?  I just got a horrible feeling.  -- what?  Keep going.  So, if it's Air Force, what would the Air Force have on a train?  Where'd you learn how to do this?  So how am I supposed to be a zombie?  For English? Yeah--  -- you made all these? 62.  ... it looks real.  It looks so old...  Euro Gray...  What was that necklace?  The one you were holding at the train crash. Was it your mom's?  It's okay.  Yeah.  Power's still out.  I was in bed, couldn't sleep. Thinking. I wanted to tell you something, before tomorrow -- Don't let Charles blow up your train.  I don't think it's right, do you? I know he's your friend, but he's so  He shouldn't always get what he wants. I mean, who always gets what they want? -- I know I don't know you at all. Even though... it sort of feels like I do. Do you not... feel like that?  -- no, keep it-- please --  ... is that her? 74.  He drank that morning. My dad. He missed his shift.  Your mom took it for him. The day of the accident.  ... I know he wishes it was him. Instead of her. ... and sometimes I wish it was, too.  -- has this--? -- no. Joe opens a drawer, grabs a paintbrush -- he touches the cube -- the thing SHUDDERS ON ITS OWN. They are amazed. They get LOW -- eyes at desk level -- the SHUDDERING INCREASES IN PITCH AND VOLUME -- he reaches out to touch it with his finger, but suddenly the cube BULLETS AWAY -     I should go to bed.  I don't want to sit down.                     What is this? What are you doing here?!  How did you know?  Really?  It's been experimented on for years. It's terrified and exhausted and hungry, it just wants to go home. When it touched me, I knew -- 116.     119.",
        "Dainard": "",
        "Twin": "",
        "Joe": "What's this?   You hear Martin barfed in the hall?  -- I am reading. -- Not carefully. Focus, this -- Detective Hathaway has a wife?  Who's gonna play the wife, Jen?  Oh yeah, that was bad.  You talked to Alice Dainard really?  -- driving where? 7.  To the train depot -- did you not read the scene I just gave you? Does Alice have a license? Is  -- was she nice? Why is she doing this? I don't understand, we don't even know her--  I don't think that's what it is--  What was she reading?  In the silent reading section, what was Alice reading?   I don't understand how the wife makes it a story--  I just can't believe you talked to Alice Dainard.  I won't forget.    Goodnight, Mrs. Kaznyk--  Oh no thanks, Ma'am, I'm okay.  \"See you tomorrow.\"  Oh, yessir. Thank you.         I thought I was going to have the summer for myself--  I gotta help Charles finish his movie.     I won't. Over.      Thanks.   DURING THE WAKE. But now, sitting in the driver's seat is 14- year-old ALICE DAINARD. She sees Joe.  -- yeah?  -- what?  You can trust me. My dad'll never know. I won't tell him anything.   Want one? 17.  Okay.  You mind?  Close you eyes. Please.  Yeah, he's a very relaxed guy. 23.  GUYS, WATCH OUT!!! Joe what the hell are y--?! -- just then BA-BA-BA-BAM!!! THE TRAIN ENGINE, HUNDREDS OF  Run!   Alice!  Guys?!  Martin, are you okay?! Preston, is that you?  Has anyone seen Alice?!  It's my fake blood. It's fake!  It wasn't an accident. (turns away, eyes on the  There. 28.  Map of the contiguous United States... -- what's the writing?  It's a schedule for the train.  -- guys, look --     Guys, keep it down!  Joe: what was Woodward talking about? I don't know, I don't know--  It's okay-- no one's saying anything. None of us.  Guys -- we're not gonna say anything -- are we?!  See? No one's gonna know.      -- oh, thanks,         Gotta head in early -- -- okay-- Make sure you let Lucy out. -- I will -- Pull back WIDE to see Joe's room -- while in the FOREGROUND is his desk, crowded with stuff. In focus, however, is the CUBED OBJECT he took from the crash site. As the shot progresses, you may notice that THE CUBE HAS CHANGED SHAPE;  You gonna -- what, you with Charles today? Yeah, I'll be with Charles-- Make sure you get the yard. -- okay, I will. Jack heads off.          Morning, Mr. Kaznyk--  Uh... no.  No.  ... Looks like a disaster movie, doesn't it...?  -- what?   -- you wanna go back?!  --okay--  Yeah, I thought she was good.  I think she will. 37.  But that was before the new pages, right?  Yes, she was, we all were.  Yeah, I saw her face.  Nothing. I think she's going to do it.  We can use my dad's camera -- it's got sound and-- Hello?  Alice-- hi, it's Joe. Lamb.  So we have some new scenes. For the movie. We were hoping you'd be in `em.  Really? `Cause these are really good scenes.  Yeah, I know, I saw it. Are you okay?  -- wait, hold on -- lemme come over and show you the pages, okay? I'll be right there. No, d--  You totally did, that's true, I know, but--  I am, which-- under normal conditions I would nev--  We have to-- while the crash is still there. (waits, anxious, then,  Yessir. 41.  -- what?   You mean why he crashed the train?  That whole thing's an Air Force train.  I make models-- plastic ones-- you know, glue `em, paint `em--  Air Force trains -- even models -- have these hooks...  Every car in that crash had hooks, every one...  Dr. Woodward had that map. He drove onto the tracks. Maybe there was something-- -- he wanted to destroy, he wanted to destroy? yeah.  He had a gun, why not use that?  Mostly the Dick Smith Monster Make- up Handbook.  ... sure.  I don't care, they can blow it up. I can show you the train, it's nothing, it's stupid. 51.  You wanna see it? Later? The... train? My train model? The train I made?  Oh. Just be a lifeless ghoul. Someone with no soul, dead eyes. Scary. D'you ever have Mrs. Mullin?  -- like her. But hungry, like hungry for human flesh. To make them turn into zombies, because that's what zombies do.  Oh my God. That's really good...  ... not bad.  Lucy. Lucy. Lucy!  Lucy! ... Lucy!    -- have you... seen Lucy?  That's... okay, I'll find a-- 56.     So the Air Force is looking for a car -- Alice's dad's car -- they're taking tire prints from the crash site. Over.    Okay... I'll do the make-up. Over.     Oh gawd, I didn't clean up.  Yeah, that's the Hunchback of Notre Dame. I watched that one on TV.  This is the train they wanna destroy.  That's dry brush technique.  After you've painted the base color, you take something like...  Euro Gray.  There are so many different grays, it's crazy. And you pour a little onto like a paper plate. Then you take a dry brush and you just dip it in, then you brush on the paper, so the paint's barely on the brush. Then you make small brush strokes on the model. Little ones, like where the wear and tear would be. Around the wheels. Or where the doors would slide. Then you do it again, like with Camouflage Gray-- or here, I used Insignia Red to make it look like there was another coat of paint on there before. Like they painted over it, but you could see it scratched off. 63.  My dad gave it to her the day I was born. She wears it all the time. Used to. It was bad, how she-- died and stuff, but they got the necklace back. So.  We're sitting right here.  I thought you were calling Evan.  Military police investigation. It was a suicide.  A former Air Force officer. He called me last night, said he had a secret that he couldn't keep any longer. 66.  He worked at Romero Chemical. He found out some things the company's been doing. After what you told me at the bar, I thought you should know.  We just made the discovery ourselves. You understand this is top secret.  I would never have given you this information if you and I hadn't served together in Vietnam.       We're not clear.  We're not clear. You and I aren't clear about anything. We couldn't be less clear.    She's NICE to me!     Before, earlier, b-- no, you okay?    Room's still messy.  He can be sorta li-- I've known him since Kindergarten, though--  -- no, I totally do, I'm just... sort of in shock at this whole  ... yeah...  ... it's so weird watching her like this, like she's still here...  ... she used to look at me, this way... like really look. And I just... knew I was there. That I existed.  Don't say that. He's your dad.  -- has this--? -- no. Joe opens a drawer, grabs a paintbrush -- he touches the cube -- the thing SHUDDERS ON ITS OWN. They are amazed. They get LOW -- eyes at desk level -- the SHUDDERING INCREASES IN PITCH AND VOLUME -- he reaches out to touch it with his finger, but suddenly the cube BULLETS AWAY -  Why are you not reacting?    What are you so angry about? That I'm not going to let you blow up my train?  What's your problem?  I know, my dad's being a turkey. 79.  We're still gonna finish your movie!  What are you talking about? Of course it is.  Why?  I'll get the camera back, I know where my dad put it -- We can still make the festival.  Then what is it about?  What's obvious?  -- what?  Your movie was over! That's what you said! You were upset. I gave you a camera! I helped you!  What's your problem?  Well, you're the one who wanted the wife in the movie! 81.  What do you even care what I think about Alice?!  -- wait, you like Alice Dainard?   Guys, look out!  We can make another train and blow that one up.  I do like her. Sorry about that.  ... Charles...  Mr. Harkin. What's going on?  You see your family anywhere? -- no, you see your dad? -- no...  Hi. I'm gonna find my dad.  Yeah.  Mr. Dainard, it's Joe Lamb. I know you don't like me sir, and I'm sorry about that-- but I'm looking for my dad--   ... what?  ... I believe you.  It took Alice.  Guys, WE HAVE TO GO BACK.  Back to town -- to find Alice -- we have to find her-- 86.  She's dead, if it took her, she-- -- don't say that!  I'm going whether you come or not-- which I really hope you do.  We're going to the school to open the trailer Woodward had in the parking lot. I bet that's where he keeps his research.  We're gonna learn everything we can about that thing so we can find it. And that's how we're gonna save Alice. 88.  Why else are there padlocks on the door? We're going to the school.  Maybe the classroom, but not the dungeon.  We shouldn't take River Road, they had a roadblock.  Yes. Thank you very much. Do you have a tire iron?   Dr. Woodward was dishonorably discharged from Nellis Air Base in 1963 because of \"subversive conduct,\" whatever that is. 92.   What is this?  Cary, we got to find this thing.  -- I told them this creature is more sophisticated than any of us. That his species -- that's him --  Woodward wasn't trying to kill it. 94.  -- hey, no-- 95.  -- guys-- I forced you to come with me... I'm... I'm so sorry.  I'm so sorry...  ... why--?  Charles! Maybe you should wait!  -- you guys okay?!  Up there, there's broken glass --  Lemme get on your shoulders!  No--!!! No, look!  We need to get back to town!  You want me to drive?  I saw something at the cemetery. Woodward said it's subterranean-- I think I know where it--  We gotta go by foot--!  Just follow me! ) Donny! Hey! Donny, wake up!  We have to get out of here!  Come on, guys, let's go. Come on!  To the cemetery--  I'm gonna go find Alice-- you have to stay with Martin.   ... yeah. 108.  Come on, Cary, we gotta go.  Just follow me.  Help me!  We need to get inside.  Cary, help me.  Help me, on three.  One, two, three.... One, two, three.... One, two threee.  You got any sparklers in there?  -- Alice is down there.  Shhh. This way.  I know. Cary look.  We're under the water tower. 112.  She's here. We're going to use your firecrackers.  There are other tunnels.  I need you to make noise. Lots of it, right here, in two minutes. Make it loud and make it last-- gimme some sparklers.  (takes SPARKLERS and a LIGHTER from Cary Make sure you're gone by the time it blows: you can't be here, you gotta run.    -- Cary, come on, come on-- 114.  -- Alice, please -- please --  Alice, wake up!  Alice! You're alive! Can you hear me? Are you okay?! 115.  I'm just-- doing the best I can to save you.  Your dad. He told me. He was worried. And flipping out.  -- we need to move--  Alice, help me get the sheriff down.  Sheriff, we came that way.  Sheriff, I really think we're going the wrong way.  I told you to get out!        OF THIS BEAST, WHICH COULD KILL HIM AT ANY TIME -- but in this moment of fear comes something else. Simple truth -- he  -- I know bad things happen-- bad things happen, but you can still live. You can still live, you can still live, you're gonna be okay-- 118.   ... he's making a model.  119.",
        "Lamb": "",
        "Charles": "I'm so worried for that boy.  Joe's gonna be okay. 2.  ...she was everything to him.  Jack's gonna step up. He's a good man.  But he was never really a father...I don't think he ever...understood Joe.  (maybe a little concerned  I was thinking that, about the coffin.  Try a Goddamn turkey roll and you'll discover how. They're delicious.  I heard it crushed her completely. At least keep your voices  A steel beam-- those things weigh a ton. Literally. If it had been open casket, I  Bet Joe's not gonna wanna do my movie anymore.  Why do you think why? The story. It's about the living dead.  But she's dead, shithead.  Told you.  That was the longest day ever-- here.  New scene, check it out. Let's hit the 7.  I know, does that guy ever not barf? Keep reading.  -- I am reading. -- Not carefully. Focus, this -- Detective Hathaway has a wife?  I think it might help make my movie better. I need two things: a better story and production value.  Martin booted all over his locker, it was the grossest one yet-- Let Joe focus, he's reading.  After he ate two boxes of Mike and Ikes-- never seen so many colors in my life. Will you shut up a minute?  No way -- did I tell you what she did with my top hat?  Alice Dainard.  I was returning that book on codes and ciphers-- she was in the silent reading section -- I thought, \"Screw it.\" So I asked her if she'd play Hathaway's wife.  Shut up. It's for \"silent reading.\"  She said yes, we're filming tonight and she's driving.  To the train depot -- did you not read the scene I just gave you? Does Alice have a license? Is  Jesus, Freak Show, she offered to drive and I accepted--  Maybe she just wants to be in a good movie, y'ever think of that?  I've been working on this movie for months. I'm just trying to make it good.  ... what?  Who gives a rat's ass what she was reading-- the festival deadline's in one week -- my movie's gotta be great! 8.  SLOWLY PUSH IN ON THE SCREEN: kids earnestly playing adults:     Yeah, but it's not a st-- thank you for that-- it's not a story yet. 9.  Older kids enter this film festival -- I'm competing with fifteen- and sixteen-year-olds, who have better stories and cars and production value, I've got nothing!  Charles! Dinner!  I'm coming! There's a whole article in there about stories, you should read it, it explains everything.  Jesus, that's what I've been explaining: in the scene we're filming tonight, the wife telling the detecting she's scared for him, that she loves him-- Charles!  You're impossible.      Read this.     Then every single person can tell you how it was --  Move the puzzle, get the napkins.  It's your turn to babysit.  Because you crushed Charles' top hat, you ever think of that?  Guess what, no we're not.  Charles take these to the table! Benji, it's time for dinner. Hey,  Grab a seat, we have lots of food.  Later days.  There's always a place for you here, you know that--      Okay, it's time -- don't get caught, over.  Wanna hear something gross?  I sneezed so hard yesterday I shit my pants. I debated telling you.  Well then I totally sharteezed in my pants. That's exactly what I'm  Twizzler me.  Martin? I don't see how the guy playing Detective Hathaway can ask where the zombies are coming from.  Make-up, sound and special effects.  -- what?  You want Joe to-- stay back? I--?  So I wrote a couple new lines, can I show you?  Shut up. There aren't a lot--  What would be great is: could you cry during the scene? Can you do that?  Shut up.  Guys, there's an electrical socket up here.  No. But you can pick up some stuff. 18.  Guys, this is going to be great. Get the lights and camera on that end, we'll shoot this direction first, like we talked about! Joe, get the mike plugged in-- make sure the new batteries are in the camera before you do the make-up!  Martin, I have a new line for you.  So this is very emotional.  Alice: Mrs. Hathaway really doesn't want her husband to keep investiga--  Okay, I'm just directing. Martin get on your mark. Martin, you're going to have to reassure her. Do you know what \"reassure her\" means?  Okay-- we're starting on Alice's side first-- Preston: a couple seconds after \"action\" walk to the pay phone, make it look like this place is busy--  Asshole, could you stop blowing shit up for two seconds and deal with the camera?  Let's rehearse this -- save your real performances for when we're filming, though.  Ready? Here we go... action! 21.  -- uh, that was... I'm... that-- yeah, good. Just like that.  PRODUCTION VALUE!!! Is there film in the camera?!  PUT IT IN!!! PUT IT IN!!! Joe, get the mike ready. Go, go, Preston, get in position. Costume, costume. Martin, get that tripod set up. Joe, help her with her costume. Hurry, hurry! Go! I hope we don't miss the train. Preston, get in position! Martin, you know you lines, right?! IS THE FILM IN THE  Everyone ready...?! Be extra loud when the train passes by! Oh God, I hope it stops! You ready?!  And... ACTION!  GUYS, WATCH OUT!!! Joe what the hell are y--?! -- just then BA-BA-BA-BAM!!! THE TRAIN ENGINE, HUNDREDS OF  PLATFORM, LANDING SIDEWAYS, STILL FILMING as the CRASH WAVE   Joe, we have to go. 25.   I'm alive! Is anyone dead?  -- oh God-- -- no -- nonono... Martin, still sick, calls out:  What is this stuff? 27.  They look like white Rubik's cubes or something. They're heavy like metal or something. There's like a billion of them.  Oh my God. ... Look at that...  What? Driving on the tracks?  -- is that him?  It is, yeah, for sure-- Holy shit.  Remember when Old Man Woodward took your Electronic Football?  -- dates and times. -- what's that line across?  Dr. Woodward! It's Charles Kaznyk! From fourth period! You've been in an accident!  My dad will de-ball me! Let's get out of here!!! Now they're SPRINTING -- FLASHLIGHT MEN getting closer. Charles arrives on the platform, grabs his camera. Alice hurries past, hunting for her keys in that big purse -- she eyes the FLASHLIGHT MEN getting closer:  Holy shit, that was insane! He had a gun! An actual  I can't believe all that just happened here! Nothing ever My whole camera lends is like happens here!!! shattered now!  Oh shit, all the glass just fell out!  Great, the focus ring just fell off!    No. You're not wearing that. No one in this house is wearing that.  Just listen to your mother.  Jennifer Anne, not fair is Africa.  I don't know, go check.  Peg, tell the twins to stop.  Hi, Joe.  Hi, Joe. Did you hear about the train accident?  It's on the news.  Can you believe this?  It's on the news. That means it's real.    We can use this -- we can film it --  --okay--  If any of the footage from last night is usable, that means we need Alice to play the wife again.  She was mint, but she's never gonna do it.  There's no way. You heard what she said.  You honestly think she cares about the scenes?  Man, did you hear what she said last night? \"I never should have done this!\" Dude, she was totally wigged!  Did you see her face?  Man, what's wrong with you?  Lens is cracked. Focus ring broke. Ya think it's fixable?    We need this developed as soon as possible -- can you do overnight? 39.  ... no, thank you.  Well, what's the fastest you can do?  I don't know.  CUT! That was mint! So good! And it looked huge with the train! Wow! Joe: go reload the cap gun!  We'll get the other direction next - - Alice, that was mint-- Martin, go a little faster next time. 42.  -- dude, what are you doing? 43.  Thanks, could I have a coffee, please? Cream on the side?  Shut up, I like coffee. No one likes coffee.  Joe: stop talking about it.  Please shut up, all of you.  Pussy, stop pulling the fries away. I ordered these for a reason. -- he gets all possessive with his fries, it's so annoying.    Funny, Chompers, at least I don't use a booster seat.  I don't wanna find out -- guys, we gotta forget we were there. Joe, seriously... you really wanna take a chance that something could happen to your dad, too?      Hey! So I'm gonna need more shots of the train crash, obviously-- you know that train model you made? Can we blow it up and film it?  Mint. Gnarly! Charles and Cary head off, planning the explosions. Alice looks at him knowingly.  That's like the third time Dude. Bitchen. that's happened.  I don't wanna hear about it. They could be monitoring us right now! Jesus, shut up. Over!  Joe -- YOU CAN NOT FLAKE OUT ON ME AND BE A DICK! Are you gonna come help me tomorrow or not? I need you to make Alice a zombie again.  Guys, what the hell?! No one knew where you were.  You gotta be the soldier.  Evan blew us off, he's a pussy. Excuse me.  You gotta do it. You're the only one.    Joe. Hey, Mr. Lamb!  Uh-- Mr. Lamb? That's your camera, but technically, that's my film-- 68.  I told you not to pick it up in the first place.  That's part of it! Juts a part!  My whole movie's a disaster `cause of you!  Whatever.  It's not about the movie.  Just forget it.  There's nothing wrong--     It's not about the movie.  Jesus, you don't even get it do you? It's obvious.  Gawd, you're a dumb ass. 80.     That night of the crash, you started getting all weird.  Like Mr. Attitude all of a sudden.  Don't pretend like you did it for me! You didn't do it for me and you know it!  It was never about me! It was always about Alice!  Not so you could fall in love with her!  Because I like her! That's why! That's why I asked her in the first place! So I could get to know her, not YOU!  You're such an idiot.  SHIT! Look at all that smoke! We can't use any of this. And you won't even let me blow up your train. Everything's bogus.  I know it's stupid. What would she ever like me? I haven't leaned out yet, which the doctor says is gonna  -- Joe, what the hell--?!  You see your family anywhere? -- no, you see your dad? -- no...  Charles, Charles -- sweetheart, are you okay? I went back to the house and you were gone.  They made us get on the bus.  Hi, Joe.  You gonna tell him about that thing?  Come back if you can't find him.  That thing took her--?! -- are you shitting me?  Back where? To do what?  Do this for me and I'll babysit the twins next week so you can go to Wendy's stupid party.  I am not shitting you. You can't ask me any questions though. You can't tell anyone. I'm serious. No one.  Yes or no, you ugly freak. I'm about to rescind the offer.  You think Woodward's got information about that thing in the dungeon?  I was thinking about that too.  Yeah, Woodward has all kinds of weird stuff in the dungeon.  I don't care. Disco I guess?  Joe, let me try -- let me try.  Joe, this is impossible, man.  --I loosened it for you.  Look at all this junk. He's got movies in here.  I cannot believe we're breaking into school, who does that? No one does that-- idiots do that--  Back when he was like Middle-Aged Man Woodward.  I don't know. It says April 8th, 1963 incident. I dunno.  Arh! I can't watch that!  He was trying to help it escape.   -- oh shit!  ... what... what's gonna happen?    Was that the thing from the train?!  Was that it?! Oh my God!!!  Oh my God, guys --  What's that gun --? 99.  Sako Bolt Action, 30-06 -- okay okay okay, I get it -- Leathwood Art Scope-- Hernandez makes a radio call, Overmyer straining to see out the windows as Nelec locks and loads the unique ammo and moves to a driver's side window, tries to see --  I don't feel good about this --   -- I wanna go home so bad --  I'm strong! 102.  You can do it!  I just sharteezed a little.   Congratulations!  Joe, where are we going?   Where?!  Charles-- that's not yours-- -- what?! I'm thirsty and I'm Another fucking LOUD BLAST -- sound of GLASS BREAKING -- and the creature ROARING -- And there it is, in silhouette, moving past the bay window -- Joe realizes: where the creature is, so are the blasts:  Oh shit, Martin, you gotta bone sticking out of your leg!  Joe, gimme that thing on the curtains!  ... you gonna be okay without me?  God, Cary. Shut up!  This is going to hurt.  I haven't even done it yet.",
        "Louis": "What's this?  She's not going to your party.  You know better than this.  You get outta her. You go home and don't come back, I don't wanna see you.  Hey -- he was at my house yesterday morning, are you aware of that?  I'd appreciate it if you would inform your son that my house if off-limits. And so it my daughter.  Morning.  You wanna tell me where you were? Or you want me to tell you.  Sit down.  I wanna talk to you. I said sit down.  Then go. Be just like your mother and leave.       It took her.  It took her. I saw it. It was... something... so... big, like nothing -- it was-- and no one... no one believes me... ... no one believes me-- they just keep giving me pills. It took her... Joe, it took Alice... no one believes me.  -- what, is she... Is she dead--?  Where're we going--?  I came to your house that day. To tell you that I never meant to hurt anyone. Swear to God.  I'm sorry, Jack. About what happened to your wife.",
        "Peg": "Get off that thing.  Are there anymore English muffins?  They don't listen to me. 35.",
        "Preston": "No, I'm eating macaroni salad.  A steel beam-- those things weigh a ton. Literally. If it had been open casket, I  His mother's not a zombie.  That's called a \"sharteeze\" by the way.    I have never been a passenger in a vehicle without an adult driving. I'm unresolved as to how I feel about it.  Your obsession with fireworks -- and I'm saying this as a friend -- concerns me. And my mother.  I know what that looks like.   I'm okay! Though I think I'm having a heart attack! And I have a scrape! 26.  -- oh God-- -- no -- nonono... Martin, still sick, calls out:  Guys, what are these things?  According to my Uncle Seth, an accident like this is exceptionally rare.  Obviously it isn't.  It is, yeah, for sure-- Holy shit.  Biology.  That trailer Woodward keeps in the school parking lot.  Map of the contiguous United States... -- what's the writing?  My dad will de-ball me! Let's get out of here!!! Now they're SPRINTING -- FLASHLIGHT MEN getting closer. Charles arrives on the platform, grabs his camera. Alice hurries past, hunting for her keys in that big purse -- she eyes the FLASHLIGHT MEN getting closer:  Holy shit, that was insane! He had a gun! An actual  My heart is pounding! That train could of killed us.  \"You'll die, your parents will die,\" guys, that is not good information.  I got in my parents' bed last night. Haven't done that since I was eleven.  ... did I just insult him?  And he's not embarrassed by that.  Ooo! Ooo ooo ooo! They do -- for when their train cars are put on transport ships. 44.  Dr. Woodward had that map. He drove onto the tracks. Maybe there was something-- -- he wanted to destroy, he wanted to destroy? yeah.  There are infinitely more effective ways to commit suicide: pills,  You could jump from a building.  Well, that's not really effective. 45.  Drowning, hari kari, also known as seppuku--?  And I think you need a break. Jack, I've been telling you this since Elizabeth. 48.  You're a good deputy. But you need to take a vacation. Go home. Take off your uniform. Go fishing. And give your son a hug.  Back where? To do what?  Wait a minute -- first of all, I want to live. Okay?  -- yessir --  But you should look at this first.",
        "Benji": ""
    },
    "imdb_rating": "7.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjIzNjEyMzcwOF5BMl5BanBnXkFtZTcwMTkyMjE0NQ@@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "SPOILER: In the summer of 1979, a group of friends in a small Ohio town witness a catastrophic train crash while making a super 8 movie and soon suspect that it was not an accident. Shortly after, unusual disappearances and inexplicable events begin to take place in town, and the local Deputy tries to uncover the truth - something more terrifying than any of them could have imagined.—Official site",
    "name": "Super 8",
    "genres": [
        "Action",
        "Mystery",
        "Sci-Fi"
    ]
}