{
    "filename": "Superbad_script.txt",
    "imdb_id": "tt0829482",
    "imdb_url": "https://www.imdb.com/title/tt0829482",
    "characters": [
        "Officer Michaels",
        "Nicola (as Aviva)",
        "Mark",
        "Jules",
        "Gaby",
        "Fogell",
        "Seth",
        "Liquor Store Clerk (as Joseph A. Nunez)",
        "Francis the Driver",
        "Officer Slater",
        "Greg the Soccer Player",
        "Liquor Store Cashier",
        "Homeless Guy (as Clement E. Blake)",
        "Evan",
        "Becca"
    ],
    "dialogues": {
        "Officer": "Apparently, she has an exam.    We'd like to ask you a couple questions.  Okay, first things first. What's your name?  MicMac what?  McLovin?  Cool name. And your first name?  Okay, your name is just McLovin, there's no need to get irrational.  A lot of people have strange names these days.  I once arrested a man-lady who was legally named \"Pearl Necklace.\"  Fine. That's not illegal.  And, how old are you McLovin?  Old enough for what?  Can I see your ID?  You're an organ donor?  I didn't want to be one but my wife insisted.  Just like a woman. Even after you're dead, they want to tear your heart out.  Are you in a hurry or something?  Where were you going?  We'll take you there, get your information on the way. Sit tight.    Could we have taken her in? Just to scare the shit out of her?  Hah. Probably could have found a way. But a good general rule is only take people in you want to ride with. And whiny bitches don't make that cut.  We get the gist of it. You were buying some beer, some guys came in and robbed the place. I don't think we're gonna find `em this time.  Only one guy? Well, fuck that. We could never catch one guy.  You see, McLovin, if it was two guys, we'd have twice the chance of catching one of them. But just one guy? I mean, how are we supposed to find one guy in this whole city?  Yeah, McLovin. You know how many people there are in this city? I have trouble finding people I know.  Yeah, that stuff can help, but if someone walks up to me on the street, and is like, \"Hey, find Bob.\" Well, how the hell am I supposed to do that?  Exactly. If I don't know who he is, then how am I supposed to know where he is?  When you're new to the force, like I am-  Only six months in. I got two and a half years under my belt.  You learn a lot of crazy stuff. For example-  Ten-four. Nice. Ya see, Michaels, when ever there's a call for a bar, you take it.  Good fucking call, sir.  Hey, McLovin. We got a situation at Bailey's. We have to see to that, but we'll drop you off right after. Okay?  Alright McLovin, this will only take a few minutes. Just grab a beer at the bar and we'll be done before you know it.  Alright, Michaels. I've got your back. Show this rummy how we roll.  Excuse me! Sir!  Resisting!    Fuck!     Stop him, McLovin!!!  McLovin! Nice!  I am buying you a beer, McLovin!  So anyways, we leave the bar, I'm charmin' her pants off telling her stories of shoot-outs and shit.  Nope.  McLovin, all we do is bonk homeless people on the head. You're practically a cop now.  So I pull up in front of her house and she asks me to come inside for some coffee. Of course, I say yes.  Oh shit.  Oh shit. So we go into the kitchen. I start taking off my clothes, she fucking flips, starts screaming at me, and I'm like \"Can't have coffee without cream.\" Oh!!! Right? I fucking said that. Then, she slaps me, throws me out. I'm telling you McLovin, stay out of bars.  So, yeah, you gotta look in different places. The gym, an art class, you know, shit like that.  I met the Missus at paint ball. Can you believe that? I shot her in the neck, and we just hit it off. And my first wife -- who is a whore -- where do you think we met? A bar.  I bet I know your trick, McLovin. You do the whole mysterious guy thing, right?  Yeah McLovin, how's it going with the ladies?  Oh! McLovin in the house!  Yeah. We got guns.  I haven't had one for long, but, man, let me tell you - it's like having two dicks.  I mean, if we took the bullets out?  Yeah. Why not?  Here.  If you're Michaels they are. He can't shoot worth dick.  Fuck you, old man. I could out-shoot you with my sack tucked between my legs.  Only one way to settle this.  You've been saying some bold words, my friend. Better not mess up.  Boo-yaka-sha!!! Suck it, Slater. Suck my nuts. Long, but gentle.  Yeah. Sure. Here. Go nuts.  Fuck. The cops!  Let's bail! Shotgun!  Hah, hah! Eat it. So, dudes, what do we do now?  Son-of-a-bitch. Car 98, ten-four. Ya dumb whore. Ha!  I wish. Probably some lame house party. We'll drop you off after. Cool?  How do they expect us to work these things while we're driving? I can't even work my iMac while I'm sitting at my desk.  Pretty much anything, if you're smart enough to figure it out. Like, who do you really hate? Gimme a name.  Can I do it?  Tomorrow, Mrs. Graham will have a boot on her car.  Okay. The place should be around here somewhere. McLovin, are the numbers on that side odd or even?  We got flashlights.  I wasn't even sure light came out of those things. I thought they were just cool looking clubs.  My eyes!  Oh shit. Shit, shit, SHIT!  I don't believe this is happening again.  Okay, okay, we're gonna get out of the car now. McLovin, you stay right there.  That guy better not be dead.  Is everyone alright?  Well, you should be careful boys. That's how accidents happen.    Pabst. You boys been doing a bit of drinking?    Detergent?  You boys stay right here.  Alright, Michaels. The car is completely fucked, and you're the one who fucked it up, so you've got to fix it.  What do I do?  We arrest these little crap stains and dump it on them, I'll take care of that. You go make sure McLovin is good to play ball. This is it, Michaels.  You wanna hang with the big boys, you gotta get your hands dirty. You cool?  Yeah, I'm cool.  Get on the ground. Now! Spread your shit!    What? Oh, yeah, the guy was fine.  Are you awake, sir?  I'm sorry, McLovin. But I really need this to be a private thing.  Listen McLovin, you... like... Officer Slater and myself, don't you?  Yeah, well, we're also on probation. You see, we've actually trashed two other cars. The first time wasn't our fault, and the second time a bee flew in and I freaked out. Point is, we trash another car, without a good reason, we're fucked. Know what I'm saying?  Now, we're going to arrest these guys, and if you don't mind, which you shouldn't, we'd like you to write a fake witness report saying they jumped out in front of our car. Cool, McLovin?  How tall are you?  And you said those were \"Pumas?\"  Shit!  Shit! Shit! McLovin bailed!  Fuck!  Stupid little bastards.  Maybe I should fire a shot? Scare `em out?  We had a complaint about the noise. It looks like you're having a nice little party here.  A nice little underage drinking party.  Okay, everyone out. Party's over. Get out of here.  I'll go upstairs. I told you this would release some anger.  I'll tell you what would release some anger, if one of these little fuckers touched me and I got to club his face in.  McLovin? What the fuck?  You ran away from us! Michaels! Get up here!  Shut the fuck up! Wait a minute. How old was that girl? 16, 17? You sick bastard, that's statutory rape, McLovin.  McLovin!  He was violating a sixteen year-old girl!  Sit your ass down and keep it down.  You're going to jail, fucko.    There you go.  That does feel better.    You are the funniest fuckin' kid I have ever met!  We've been fuckin' with you! Jesus! I love this kid!  We know you're not twenty five! What are we, morons? My god! What are you? Sixteen?  Seventeen! Ha! We had you going, McLovin!  Alright, boys. What I'm about to show you is pretty much the greatest move in donut- spinning history. Behold: the reverse figure-eight.  If you were in, you were in. You are no longer a virgin, end of story. Screw cumming.  Alright. I think that's all the fun we're gettin' out of this one.  ...and by signing this you are officially saying that as we stopped you from being mugged, a crack-head stole our cruiser and did God knows what with it.  Can we do this already?  Can we shoot at it?  I don't know, can you?  I'm throwin' down the gauntlet. 50 bucks. Whoever hits the gas tank.  You are so fucking on.",
        "Michaels": "Apparently, she has an exam.  We'd like to ask you a couple questions.  Okay, first things first. What's your name?  McLovin?  A lot of people have strange names these days.  Fine. That's not illegal.  Can I see your ID?  Just like a woman. Even after you're dead, they want to tear your heart out.  Are you in a hurry or something?  You see, McLovin, if it was two guys, we'd have twice the chance of catching one of them. But just one guy? I mean, how are we supposed to find one guy in this whole city?  When you're new to the force, like I am-  You learn a lot of crazy stuff. For example-  Good fucking call, sir.  Excuse me! Sir!  Resisting!    Stop him, McLovin!!!  McLovin! Nice!  So anyways, we leave the bar, I'm charmin' her pants off telling her stories of shoot-outs and shit.  Nope.  So I pull up in front of her house and she asks me to come inside for some coffee. Of course, I say yes.  Oh shit. So we go into the kitchen. I start taking off my clothes, she fucking flips, starts screaming at me, and I'm like \"Can't have coffee without cream.\" Oh!!! Right? I fucking said that. Then, she slaps me, throws me out. I'm telling you McLovin, stay out of bars.  So, yeah, you gotta look in different places. The gym, an art class, you know, shit like that.  Yeah McLovin, how's it going with the ladies?  I haven't had one for long, but, man, let me tell you - it's like having two dicks.  I mean, if we took the bullets out?  Fuck you, old man. I could out-shoot you with my sack tucked between my legs.  Boo-yaka-sha!!! Suck it, Slater. Suck my nuts. Long, but gentle.  Fuck. The cops!  Hah, hah! Eat it. So, dudes, what do we do now?  Son-of-a-bitch. Car 98, ten-four. Ya dumb whore. Ha!  How do they expect us to work these things while we're driving? I can't even work my iMac while I'm sitting at my desk.  Can I do it?  Tomorrow, Mrs. Graham will have a boot on her car.  Okay. The place should be around here somewhere. McLovin, are the numbers on that side odd or even?  I wasn't even sure light came out of those things. I thought they were just cool looking clubs.  My eyes!  Oh shit. Shit, shit, SHIT!  That guy better not be dead.  Is everyone alright?  Detergent?  You boys stay right here.  What do I do?  Yeah, I'm cool.  What? Oh, yeah, the guy was fine.  Are you awake, sir?  Yeah, well, we're also on probation. You see, we've actually trashed two other cars. The first time wasn't our fault, and the second time a bee flew in and I freaked out. Point is, we trash another car, without a good reason, we're fucked. Know what I'm saying?  Now, we're going to arrest these guys, and if you don't mind, which you shouldn't, we'd like you to write a fake witness report saying they jumped out in front of our car. Cool, McLovin?  Shit!  Maybe I should fire a shot? Scare `em out?  A nice little underage drinking party.  I'll tell you what would release some anger, if one of these little fuckers touched me and I got to club his face in.  Shut the fuck up! Wait a minute. How old was that girl? 16, 17? You sick bastard, that's statutory rape, McLovin.  He was violating a sixteen year-old girl!  Sit your ass down and keep it down.  That does feel better.  You are the funniest fuckin' kid I have ever met!  Seventeen! Ha! We had you going, McLovin!  If you were in, you were in. You are no longer a virgin, end of story. Screw cumming.  Can we do this already?  Can we shoot at it?  You are so fucking on.",
        "Mark": "What the fuck do you think you're doing?  You calling more of your stupid friends again? Ya prick.  Get the fuck out of my house.  Francis, you and your idiot friends stay the away from me and mine or I'll flipping shiv your ass!  Shut it, you little shitter! What the hell were you doing dancing with Jacinda?    And what the fuck is this?  Yeah. And what are you doing with it?",
        "Jules": "Hey Seth, your partner didn't come again?  What?  Well, uh, maybe I kidnapped her so you'd be forced to work with me. There's my attempt at humour.  All cheese tastes the same to me anyway.  Thank you! Yes! My older brother always eats blue cheese. You know that stuff is actually moldy. Like, they tell you it's moldy, then they tell you to eat it anyway.  What are you doing tonight?  My parents are out of town and I'm thinking of having a party. I don't know how big it'll be, but you should come anyways.  Really? I don't usually see you at them.  I'll write down my address and number.  Seth, dishes time. What's the hold up?  Well, you two have four more years to cuddle, so let's get to work.  Really? You're cutting the cord? What's going to happen?  Seth. There you are.  So you're coming to my party, right? It's fully on.  No, no, no. I really want you to come. But...uh, you did say you were getting a fake ID or something, is that right?    Well, this is actually, like, a big favor, but, well, my parents gave me like a hundred bucks to feed myself for the week, but the house if full of food, so I figure I should just spend all of it on extra drinks for the party.  Well, this is really nice of you. I mean, I really appreciate this.  Whatever shit you think people would like, I don't really know.  Okay. I'll see you tonight.  Yeah! My older brother always eats blue cheese. You know that stuff is actually moldy.  65                                                                  65    Seth! Where are you?  Awesome. I can't wait for you to get here.  Yeah. It looks like it could actually be a great party. I think, like, tons of people might show up. I hope they don't trash my house.  So I guess I don't have to worry then. I'll see you soon.  116                                                                 116    117                                                                 117    118                                                                    118    Seth! Everyone, he's here! He's got it!  This is awesome. Thank you so much.  Yeah. To be honest, people were starting to get seriously pissed off. Listen, I've got to go tell everyone the drinks are here. Don't go anywhere. Promise?  119                                                                  119    120                                                                    120    121                                                                    121    122                                                                    122      123                                                                 123    124                                                                 124    125                                                                 125    126                                                                 126      127                                                                 127    129                                                                 129    130                                                                 130    131                                                                 131    Hey, I'm back. I had to thank the peeps for comin' out.  No, thanks. I'm good. But, seriously, thanks for getting all the drinks. It really made the night.  Why not? I haven't conversed in ages. Let's do it.  132                                                                   132    133                                                                 133    134                                                                 134     Whoa! Whoa! Slow down.  I'd...uh...prefer if we did this at some other time.  Well, you're drunk. Like, really, really drunk.  I'm not drunk at all. I don't even drink.  Yeah, I'm...uh...throwin' a party, remember?  No. I don't drink.  Uh, no. Not right now, thank you very much.  Are you crying?  Last chance to do what?  What would me be drunk have anything to do with it?  135                                                                 135    136                                                                 136    137                                                                 137    Seth, you...uh...  You didn't blow it, you're a-   Seth! What the fuck!  138                                                                 138    139                                                                   139    140                                                                   140    142                                                                 142      I feel sorry that I'm making you buy me a new one.  Hi Evan, Seth.                       Hey guys.  It's okay.  Don't worry about it, Seth. It was an accident.    Thanks, smart guy. That's why I'm here. I have to go to Macy's to get a shitload of cover-up for the grad photo.    I've got my dad's car. I'll take you home, and Evan can give Helen a lift.  Come on, Seth. Let's go.",
        "Gaby": "",
        "Fogell": "Hey guys, I was walking here, and on the way, I saw Nicola, and she was wearing these tight white pants and a black g- string and you could see it right through the pants.  It's nine thirty.  I told her what time it was. It was awesome. She's got the nicest ass.  Ha ha. I'm really gonna miss your knee- slappers when me and Evan are at State.  What are you guys doing tonight?  Well, Seth always said I was too much of a pussy, but he was wrong. It's been arranged. At lunch, I'm going to the same place Mike Snider went to pick up my brand new false identification card.    Sounds cool. Cool.  Hey guys!  I got it. It's flawless! It's great, man, look.  Well, they let you pick any name you want when you get there.  It was between that or Muhammad.  Actually, Seth, Muhammad is the most commonly used name on earth.  Have you actually ever met a guy named McLovin?  I just thought McLovin sounded old, and the chicks would dig it.  She could ask. Or, I could just show it to her.  I knew you would ask that. Look, every day, dozens of kids roll into the liquor store with fake ID's trying to act like Joe Casual. Each and every one of these kids just so happens to be 21 years old. Just how many 21 year-olds do you think there are?  I am McLovin.  I still think it's going to work.  Why would you park in the staff-  `Cause you're not staff.    A vest.  Yeah. How many high schoolers you see in vests?  No way! I work there. They know I'm not twenty-five.  What?! No! Hell no! You can't do that!  Please. Don't do this! I promise. I'll get the liquor later.  Oh, and, uh, my Mom said we can have the TV from her basement and I've got, like, three lava-lamps and one strobe light, so like, we can have that in the room-  You still didn't tell him we're rooming-    Wait! I'm gonna put my vest back in my locker!  A list? Why?  Ouzo, Drambuie, Jager, Gold-shlay-ger-  -Alize, Captain Morgan Rum, Smirnoff Rasberry and a big ass bottle of Popov-  This is too much. I can't get away with this much!  I don't know, man. I'm getting, like, really nervous.  I don't know if I want to do this.  What if they turn me down?  It's fucking humiliating! Everyone in the store sees them kicking me out. What if they make me put all the liquor back on the shelf? I can't do that!  What if I don't feel like it anymore?  Killing me won't get you any alcohol, jerkoff! I'm the one with the ID!  You don't have the technology or the steady hands to pull off a procedure like that!    (weird voice, covering his     Fuck.  Umm, nope, no problem whatsoever.    I think I would know, thank you.  Hello... Mindy.  Oh, I love that stuff. Been drinking it for years. I heard they recently decided to start adding more hops.  Identification?  What the hell happened?!  My name, it's...it's.. Mc..mac..laddle...  No, no I said, \"McLovin\".  McLovin.  Oh...that's uh...a good one...it's a...an interesting...uh...event...  It's just... I changed my name. I was going to be a singer. R&amp;B.  Old enough.  Um...okay...  What?  Look. I'm really sorry, but I don't really have any information. I didn't really see him. His fist hit here.  Uh, yeah... kinda. I kinda had to catch a bus.  Umm... near thirteenth and Granville.    Um...hey...uh, officers. I could answer those, uh, questions now if you want.  It was only one guy.  Aren't you guys supposed to be trained or something? Don't you have a computer?  Who's Bob?  Um...okay...     Ow!!! Please! Stop, you fucking bum!!!  You've been in shoot-outs!  Hey, you don't need to tell me.  I don't know. I find they're always good for a little quick ass.  Well, officers, it's not the going with the ladies I care about, it's the coming.  So...you guys got guns, huh?  Can I...can I hold one? Your gun?  Wow. I've never held one. Are they hard to shoot?    You can do it, officer.  Yeah! And eat his ass!  Can I shoot one?  What does that mean? We gonna get to shoot anyone?  Yeah, man. Let's show these fuckers how we roll.  So, like, what does that computer do?  Um...my French teacher. Mrs. Graham. Susette Graham.  What did you do?  I hate my dad, too!  It's too dark out.    Was the guy alright?    Sure.  Seth! Wait up!  Holy shit! Little kids!!!  Help!  Aaaahhh!!!!  Ahh!                              Jesus!  What the hell is going on? Where did you come from?    Fuck yeah, guys. We made it. Together and safe.  I'm sure it'll be fine.  What's wrong with you guys?    Well we have to tell him now.  Well, he knows something's up.  I don't even get what the big deal is, to be honest.  We never should have had to hide our arrangement.  They call you Nicola, right?  Some do.  Yeah, I just thought it sounded old.  Why?  Well, you're about to learn a few things.  I've got a boner.  And lube.  It's...it's in. It's in.  What the hell?  Officer Slater?  No! I hit my head when we crashed. I was all disoriented and I just wandered off, confused. Seriously!  What? No! No!  I didn't break the law! I'm not really even-  So...am I going to jail?  What?  I don't understand!  Seventeen.  So, like, what's your official position?  Of course. That mugger had nothing but murder in his eyes. I owe you my life.  Can I get a shot?",
        "Seth": "Yo.  I was doing research last night, for next year, and I think I'm gonna go with Bang Bus.  The one where they bang the chicks on the bus. Thirteen bucks a month. Total access, live Web Cam feed. The works. It'll be like I'm on the bus, banging them myself.  It shows up under a different name. I hope. Bang Bus.  That wouldn't look good. Maybe I should just pick the one with the least dirty sounding name.  I could tell my parents I'm doing a project on Rome and I have to research orgies.  Don't touch that!  Yeah, you know. I got some other places. Good places. I think we'll be fine.  That's disgusting.  I am truly, truly jealous that you got to suck on those tits when you were a baby.  Fuck it. I'm a senior about to graduate. They should be suckin' my balls. It's the least they can do for stealing three years of my life.  Oh, yeah dude, I forgot to tell you. I knocked the fuckin' shit out of him in capture the flag last week.  They're like baby toes.  Sometimes I get boners so big I can't hide them. And then I get nervous and my heart starts pounding, and it all just, like, feeds my boner. It just becomes this...thing...that's attached to me. And it won't go away.  You know it's been, like, a year and a half since I've seen an actual human female nipple. Besides my mom's. I saw it last month, and it was sick.  Exactly. Too hot. That's what sucks.  And three quarters of a blowjob, But that was fuckin' it. It was the peak of my ass- gettin' career, and it happened way, way, way too early.  Exactly! If I'd built up to it, I'd probably at least be having steady sex with a mediocre-looking girl at this point. I honestly now see why Orson Welles ate his fat ass to death.  But the key is to be good at sex by the time you're in college. You don't want girls to think you suck dick at fucking.  Are you joking, man? Let's see here...she dated Dan Remick, Matt Muir, Josh Corber and what's-his-face. All of those were cool guys. She's been hot way longer than you think. Why would she end her high school career with me?  Yeah, and he was a complete fucking loser. You're a step up from that. Which is why you should stop being a pussy and do her! You could nailthe shit out of her for, like, two months before you leave. That bitch looks like a good fucker.  What, you can talk about that bitch all day every single day, but I can't say one thing about her?  I didn't insult her! I said she looks like a good fucker! She looks like she can take a dick. That's a good thing. Some women pride themselves on their dick- taking abilities.  No.  I bitched out? You bitched out! You were across the street before I even realized what was going on. That guy's such a douche bag.   This...is...bullshit.  10                                                                  10    11                                                                  11    Mrs. Grier, I joined this class because I thought I'd be cooking with a partner. It's not fair. She's never here. I don't get twice the marks for doing all the work.  Look at Evan.  While I'm over in my unit, isolated and alone, eating my terrible-tasting food because I can't even properly mix ingredients by myself, I gotta look over at that.  I wash and dry. And that is B.S. I'm like a single mother.  Jules?  That's kind of a personal question.    Well, I would call that a success. Marscampone... scamponee cheese? Is that some kind of new cheese or something?  Except blue cheese. That stuff is sick.  Well whoever \"they\" are, they can eat my dick.  I don't know, probably nothing. Why?  Yeah. Sure. That sounds fun. I love parties.  Oh, uh. It's more of, like, a love-hate thing. Right now I love them, though. Uh...how do I do this?      Like you'd know what to do with it.    Nothing. Sorry. You'll just have to fingerbang yourself.  Dude! That's perfect, `cause, Evan, didn't you just say that you heard about a party?  Shut up. Who cares? Just be happy he told. And hey! Now you can buy the booze.  Did you tell that nimrod you're not going to room with him?  You better, man. That guy is a poon-tang repellent.  We're getting a fake ID.  Nothing! Jesus.  We're not, like, dependent on each other.  I would do terrible things to get with Jules tonight. Terrible things.  Ah, Helen's a bitch.  Hell no! I hate her.  I was never going to tell you this story, because I knew that if you heard it you would never want to get with Helen, but over the last few weeks I've been having a hard time thinking of a reason not to. So, here it is. Helen and I went to elementary school together, right? Well, in the third grade, I had...like...an odd problem. For some reason, I don't know why, I used to have this thing...where I would...like, kinda...sit around all day and draw pictures of dicks.  I'd just sit there for hours on end drawing dicks. I don't know what it was. I couldn't touch the pen to paper without it drawing a penis.  No shit that's fucked up. Here I am this little kid who can't stop drawing dicks to save his life.  Just listen.  I was very secretive about this dick thing I had going, after all, even I thought I was a loon, lord knows what other people would have thought. So I would take all my dick drawings and stick them in this Muppet lunch-box I had.  So one day I was finishing up a picture of a real big and veiny bastard, when all of a sudden...  Well she fucking flipped. She started crying and shit. Ratted me out.  The principle finds my cock-Muppet lunch- box, and he fucking flips.  It turns out the principle was some crazy religious guy and he thought I was possessed by some dick devil or something.  So, he calls my parents and they make me go to a psychologist who kept asking me all these dick questions. My parents wouldn't even let me eat dick-shaped foods for, like, months! No carrots, no Pop-sicles, no hot-dogs. You know how many fucking foods are shaped like dick?  I can't even stand to look at her punk face. I'm going to go take a piss. Peace.  Hey. Here I am.  Yeah. Why? Should I not?  Very right. Right. I'm getting that.  Ummm... I don't know. I... think...maybe.  Well, funny thing about my back. It's located on my cock.  Ha! Alright, sure. I can do that. What do you guys want?  Wow. I would never even think of doing something that nice.  Should I just get, like, a shitload of different shit?  Yeah! I'll see you!    Of course I thought of that! LISTEN TO  She has an older brother! She could have asked him, but she asked me! She looked me straight in the face and asked me. She wants to fuck me, man. Do you understand that? Fucking! Today is the day that fucking has become possible.  She's going to be at the party, she's gonna be drunk, and she likes me at least a little, so I can get with her. Then, I make her my girlfriend, and then I fuck her all summer long! Then, by the time college rolls around, I'm the fuckin' fucking master, man!  Once I've gotten with her, I write her love letters, flowers, I'll do anything - I'll be the most pussy-whipped guy in the universe - what chick wouldn't go out with a guy like that?  Fuck off, Greg. Why don't you piss your pants again?    Helen!  You do the same thing, man! Buy Helen her alcohol. Then, tonight, when you guys are both drunk, get with her! This is the last party we're ever going to go to as high school people! I've fully ignored my hatred for Helen in coming up with this, which is a big ass deal. We need to stop being pussy and for once just goes balls out, man!  Of course! It'll be pimp, and then you know she'll be drunk.  You talk to Helen, I'll find that retard Fogell.  That douche bag isn't back yet, I've been standing here with my thumb up my ass.  Whoa. That is fucking pimp. Why didn't I do that? Shit.    I mean, what are we going to tell the girls? \"Sorry, we couldn't do what we promised because we're dickless incompetents!\" We'll never get laid because of that little ass-fuck. How did he get in to State?! He's got shit for brains! Shit! How else can we get liquor?  Yeah! You almost gave me a goddamn heart attack! You better fucking have it, where is it?  So you picked McLovin?  Why was it between that or Muhammad? Why didn't you just pick a common name?  No! That's why you picked a bad name.  Look at this shit man, you don't even have a first name. It just says \"NAME:  Holy shit! I don't believe this. This says you're fucking 25! Why didn't you just put 21?  Fool!  You're not McLovin. No one's McLovin and this is never going to work. We need a new way to get alcohol. Could we drive to Canada or something?  What the fuck? Where's my car?  Shut up, Fogell.  I am aware of that, Fagell.  Let's go to your house.  Now we wait for your Mom to piss off and steal your parents' booze like your brother always does. Take a bit from every bottle. Piece of cake. It's not exactly what Jules wanted, but it'll do, right?  I told you I can't do that. I can't let Jules see me in the same shit I wore at school. It's completely unbecoming.  You're stupid! I can't go home. Then my mom will know the car got towed and I'll be grounded tonight. I'll just stay here all weekend and pick it up on Monday.  Don't you have bigger clothes?  Not bad, eh?  Alright, here's what we'll do. I'll fuck your Mom in the basement while you steal the liquor.          Look at this mother. Smell it's glory.  Mmm. It's good. Barely a scent.  See that? I always said I had the highest alcohol tolerance. I'm like Superman.  Water? Fuck. Your brother beat us to the punch. We have to go back!  Well, fuck...fine. Text your brother he's a stupid piece of crap.  What the hell is that?  You're gonna look like a Pinocchio.    Nobody said anything about you, dick- mouth. You have one name on your ID. It's out of the equation!  And now I'm gonna have to take drastic measures. I'm gonna steal the booze.  That's right. And that way I give Jules back her money, like you did with Helen. That was good thinking, that's fucking pimp. That's how you seal a deal. It won't be hard. Remember Dan Vertlieb stole a keg from here and he's got, like, really bad scoliosis!  I'm stepping up. And once I'm up, I don't step back down. Maybe you \"State\" boys don't understand that.    Twenty two.  Thank you kindly.  Excuse me, ma'am. You dropped your purse. Would you like me to help you to your car?  That would be lovely!  Enjoy your remaining years!  I never had a choice.  Fuck you! I was gonna do it, but security was tight as shit. I was gonna do it though, don't think I wasn't. Let's go to the liquor store and try your stupid ID.  Here's the list.  We're getting girls their booze so they'll get with us. I put a lot of thought into that list. It's the perfect party bar, so don't mess it up and get Sambuca again.  Oh yeah, and Mike's Hard Lemonade.  What the hell are you doing?  What are you talking about? You just promised you would. What is this shit?  Then we're in the same place that we're in right now!  This whole thing is bigger than you, asshead! Just go in there and buy the damn alcohol!  Then I will kill you! How's that? If you don't buy the alcohol, I will kill you!  Then I will kill you, cut off your ugly face, put it over mine, and buy it my fucking self.  It's a good ID, right? Mike Snider never had a problem. It's fine. Right?  You brought a condom?  You asshole! You laughed in my face when I said we'd be having sex tonight.  No. That wasn't the plan! We had a plan! I can't believe you did that without even consulting me about it!  I'm gonna go down on her for, like, hours. She'll love that. She'll want to go out with that.  And one little bottle of spermicidal lube. That's nuts. You can't let her know you brought that! These girls are 18, not dried up old ladies. They're ready to go.  Holy Shit! It's Cary Hutchins!  She had the biggest tits in the universe.  I gotta see these bastards. Let's check `em out.  Man, I'm gonna pretend to trip and grab `em. I hope they've healed.  But she fully looked way better before. I thought when they reduced them, they just kind of reshaped them nicer. Made them more supple.  It's like me making my nuts saggier.  What?  I don't believe this bullshit! I can't...this isn't happening! I didn't even know you could get arrested for this shit! WE NEED THAT FUCKING LIQUOR!  Fuck Fogell! He got arrested! We're on our own.  We need a new way of getting liquor. AAAHHH!! The money! Fuck! Fuck! Fuck! How much money can you get?  That doesn't matter anymore. I just lost a hundred dollars of Jules' money!  Help him? What are we gonna do? Bust him out of jail? I don't even know where jail is! What we need is the alcohol, which is impossible because we don't have any fucking money!  Fuck thinking! We need to act!  Why wouldn't I report you?  You have any money?  What is this? This isn't enough.  Well, you just came from the liquor store, give us your liquor.  Well, they'll be arresting somebody else if you don't do something quick. Ow! My shoulder! It's killing me.  You better.  What? Jules' money is gone, Fogell's out, we've got no other option. Let's go.  He's an idiot. And he's our only hope. Come on, don't break your promise to Helen.  Aaah!  875-6611? Holy shit...  Jules! What's the haps?  Jules! I just got in a cab and I'm going to the liquor store as we speak.  Really?  Well, if they want to do that they're going to have to get through me.  She called, man! That's insane! She's practically begging for it. She said, \"I can't wait for you to get here.\"  Whatever. Just act casual. And old. All we gotta do is find the booze and haul ass out of here.  Holy shit! Let's grab one of these buckets and go.  Why? Come on, we're here. Let's just hurry up and do this.  We need this liquor!  Then why haven't you ever made a move, you pussy?  These aren't girls, they're women! They need our dicks as much as we need their poons - and we all love liquor, so where's the fucking beef?!  You're really gonna bail on me?!  Okay, okay...if that's how you're going to be, then I'll get the booze on my own. And you're not getting any. And neither is Helen!  Hey, wut up?  Uh...no. What? I don't know what you're talking about.    Oh shit.  What the hell is this?  Yeah, so?  Why would I get blood on my leg from---  Some girl perioded on my fucking leg!  That is disgusting.  Who's Bill? Don't show Bill! No! I can't believe this is happening!  This is un-fucking-believable. I have to look good tonight!  Who gives a shit? Fuck! These aren't even my pants!  Yeah. It's really funny, huh? Yuk it up, assholes.    Jesus's tits!  I did it man. Peace out-tro.  Hey! You got one, too! We're blood brothers.  I...I didn't dance with her! I don't even dance! Never even tried it!  I don't know. Maybe me and you rubbed up against each other at some point. How am I supposed to know?  I swear to God it wasn't me!  It's nothing. It's detergent.  I...uh, I got blood on my pants.  I brought them from home.   You're the one who used my leg as a tampon!    You...huff...bailed on me...huff...man.  Of course you did! We were supposed to do something and you left instead of doing it! That's the definition of bailing!  It is bailing, if you promised to burn your dick off!  The bottom line is   you're a bailer. You just bailed on me,   you bailed on me this morning when Terry   spat on me, and you're bailing on me next   year!  We were supposed to go to college together! Since elementary school! What ever happened to that!  I was not too stupid, I was too lazy!  Getting with a girl won't make you any less of a loser next year!  I didn't push you into fucking oncoming traffic!    What, when cops drive like maniacs and hop the fucking curb?  Umm, no sir, detergent.  My clothes are dirty.  Ow!   Ahh!                              Jesus!  Fucking run!  No! Fuck off! You already drank our detergent beer!  Back off, or we'll kick the shit out of you!  So? Who cares? Just because he doesn't have a home doesn't mean he can be a lunatic!    Shut up, Fogell. Never mind. Evan'll tell you next year.  Told me what?  Just say it!  Save that shit for later. We've got shit to do.  The bar is open!  Sorry it was late.  I'll be right here.  To Jules!    Hey! Let's do another one to me!      This party's blowin' my ass off! I want you to have a drink with me.  It's just how I roll, Jules. No problems, no problems.  Uh...you know...I love talking, and conversing with you, you're so good at it, but I can't hear you. Could we just go on the...uh...balcony or something?  What? What's wrong?    So? So are you.  You don't drink? But...but, you told me to get the liquor!  You don't drink!?!  And you, don't want to...uh, you know...  Ahhh....man...fuck....  No! Yeah, so what if I am? I'm a fucking idiot and it was my last chance! So I should be crying.  To make you my girlfriend for the summer, okay? There! You're, like, the coolest person that's ever talked to me, and I thought we'd both be drunk, but...  `Cause you'd never get with me in your right mind! Look at me! And now look at you!  ...help me...  ...sorry...  Oh no.  ...Evan...  No...I'm helping you, man! Just listen...  That's what I've been...! Here...  I totally did! I wanted to!  Yeah! Sleepover! Fuckin...you got pizza bagels still?  Nice!  I can't believe she said that shit.  I fucking love you, too, man! I'm not embarrassed, I just love you!  I missed you, too. Come here, man.  We'll always be friends. `Cause we love each other.  Like, three weeks ago I was in you room and, like, you were taking a dump and...I saw your residence placement thingy. I totally saw you're living with Fogell. So, like-  Don't be! Don't be! I'm sorry. I was being a bitch.  You know...I was pissed off I didn't get with Jules, but, like...we really got through a lot of our shit, you know?  Night, Evan. Love you, man.  Uh...morning.  Yeah. This is a really good pillow.  Maybe I should get going.  Oh...do you want to hang out? I was...gonna go to the mall, actually.  Yeah. That'd be nice. I'd really like that.  Well, I need someone's opinion.  Yeah, but when I was wearing your dad's pants last night I realized that if I buy pants that are too small it'll encourage me to lose weight. And in tight pants chicks'll kind of see my dick a little.  These pants suck. Let's the get the fuck out of here.  Is that them?    Hi Helen, Hi Jules.                  Jules. Helen. Hi. Everyone looks very embarrassed.  Oh my god. I'm so sorry, Jules.        You look good with a black eye.    Yes! Definitely. I'd love to. I had such bad acne last year, I became an expert on the stuff.  Yeah, but wait...you drove me here, Evan drove me here, how do we-  So, uh, I'll call you later.",
        "Slater": "MicMac what?  Cool name. And your first name?  Okay, your name is just McLovin, there's no need to get irrational.  I once arrested a man-lady who was legally named \"Pearl Necklace.\"  And, how old are you McLovin?  Old enough for what?  You're an organ donor?  I didn't want to be one but my wife insisted.  Where were you going?  We'll take you there, get your information on the way. Sit tight.    Hah. Probably could have found a way. But a good general rule is only take people in you want to ride with. And whiny bitches don't make that cut.  We get the gist of it. You were buying some beer, some guys came in and robbed the place. I don't think we're gonna find `em this time.  Only one guy? Well, fuck that. We could never catch one guy.  Yeah, McLovin. You know how many people there are in this city? I have trouble finding people I know.  Yeah, that stuff can help, but if someone walks up to me on the street, and is like, \"Hey, find Bob.\" Well, how the hell am I supposed to do that?  Exactly. If I don't know who he is, then how am I supposed to know where he is?  Only six months in. I got two and a half years under my belt.  Ten-four. Nice. Ya see, Michaels, when ever there's a call for a bar, you take it.  Hey, McLovin. We got a situation at Bailey's. We have to see to that, but we'll drop you off right after. Okay?  Alright McLovin, this will only take a few minutes. Just grab a beer at the bar and we'll be done before you know it.  Alright, Michaels. I've got your back. Show this rummy how we roll.    Fuck!   I am buying you a beer, McLovin!  McLovin, all we do is bonk homeless people on the head. You're practically a cop now.  Oh shit.  I met the Missus at paint ball. Can you believe that? I shot her in the neck, and we just hit it off. And my first wife -- who is a whore -- where do you think we met? A bar.  I bet I know your trick, McLovin. You do the whole mysterious guy thing, right?  Oh! McLovin in the house!  Yeah. We got guns.  Yeah. Why not?  Here.  If you're Michaels they are. He can't shoot worth dick.  Only one way to settle this.  You've been saying some bold words, my friend. Better not mess up.  Yeah. Sure. Here. Go nuts.  Let's bail! Shotgun!  I wish. Probably some lame house party. We'll drop you off after. Cool?  Pretty much anything, if you're smart enough to figure it out. Like, who do you really hate? Gimme a name.  We got flashlights.  I don't believe this is happening again.  Okay, okay, we're gonna get out of the car now. McLovin, you stay right there.  Well, you should be careful boys. That's how accidents happen.    Pabst. You boys been doing a bit of drinking?    Alright, Michaels. The car is completely fucked, and you're the one who fucked it up, so you've got to fix it.  We arrest these little crap stains and dump it on them, I'll take care of that. You go make sure McLovin is good to play ball. This is it, Michaels.  You wanna hang with the big boys, you gotta get your hands dirty. You cool?  Get on the ground. Now! Spread your shit!    How tall are you?  And you said those were \"Pumas?\"  Shit! Shit! McLovin bailed!  Fuck!  Stupid little bastards.  We had a complaint about the noise. It looks like you're having a nice little party here.  Okay, everyone out. Party's over. Get out of here.  I'll go upstairs. I told you this would release some anger.  McLovin? What the fuck?  You ran away from us! Michaels! Get up here!  McLovin!  You're going to jail, fucko.    There you go.    We've been fuckin' with you! Jesus! I love this kid!  We know you're not twenty five! What are we, morons? My god! What are you? Sixteen?  Alright, boys. What I'm about to show you is pretty much the greatest move in donut- spinning history. Behold: the reverse figure-eight.  Alright. I think that's all the fun we're gettin' out of this one.  ...and by signing this you are officially saying that as we stopped you from being mugged, a crack-head stole our cruiser and did God knows what with it.  I don't know, can you?  I'm throwin' down the gauntlet. 50 bucks. Whoever hits the gas tank.",
        "Evan": "2                                                                   2    What's up?  Which one's Bang Bus?  That stuff's bullshit, they're all faking it. And plus, your parents are gonna look at the bill.  Weapons of Ass Destruction's out then.  3                                                                         3      Thanks for taking him, Seth.  You two are so funny. I can't imagine what you'll do without each other next year. Evan told me you didn't get into State.  Are you going to miss each other?  Miss each other? No!  Fuck you, man.  You're being an idiot, man. You really shouldn't park there.  What the hell's wrong with Dimitri?  Good! 9th Grade Camp he gave me whiplash in \"King of the Ring.\" I fucking hate that guy.  Look at those nipples.  It's not fair. I have to hide every erection I get.  Just imagine if girls weren't weirded out by our boners and they actually wanted to see `em, like this shit.  Holy shit. Liat was two years ago? I guess so. She was insanely hot, though.  How can that possibly suck? I'd be fuckin' psyched if I'd gotten with a girl that hot. You got, like, two dozen handjobs!  You're like Orson Welles.  You'll have sex in college. Everyone does. And if not, you'll have the Bang Bus.  I still think you've got a chance with Jules. She got mad hot over last summer, and clearly hasn't realized it, `cause she still flirts with you.  Well, Helen got with Ariel Shafir.  Hey! I'm sick of you talking about her like that, man!  I don't constantly insult her.  Wow. You really bitched out on that one.  Oh, don't worry, no worries. Just keep it. Then you'll just have it, and you won't have to borrow another pen.  Yeah, it's a maybe. But, you know, I gotta, I got my...  there's so much other fun shit that is going to be going on that night...so, you know...  Because of all the other fun shit I'm off doing.  Dimitri's? I uh...didn't want to go, because, well, I did other stuff. Saturday... Oh yeah! Saturday night was awesome!  First my parents went out to a double feature, so a bunch of people came over...  9                                                                  9    ...and we had a couple drinks in my basement...  ...and Seth's parents were having this cocktail party, and we went over there to, like, mingle...  ...and there were actually some really interesting and, like, entertaining people there...  ...and, uh, then we saw some, uh, live music.  ...then we went to a club downtown...  ...and then we pretty much called it a night and went home...  ...you would've loved it.  Yeah...well, you know, me and Seth are always cooking up...uh...fun little...events.  Nah. We were going to but, uh, we got into different ones.  Same shit I've always been doing. It'll be fine. Don't worry about it. I'm not.  That's good shit. Huh, Miroki?    Well done, man. We'll see you after class.  Uh...no, not yet.  Actually, we're going to different schools.  Yeah? What do people think is gonna happen? That's what I don't get.  We met when we were 8, we were fine before then. It's not like we do everything together.  So it looks like we get a little graduation party after all.  No shit. I'd give my left foot to start dating Helen. She's killin' me.  I'm fuckin' sick of this shit, man! Seriously. Why do you hate her? Is there even an actual reason? Because seriously, I'm beginning you think you like her.  Why?  What?  That's fucked.  What does that have to do with Helen?  You hit Helen's foot with your dick?    Did you ever think maybe she's just using you to get her alcohol?  Are you stupid? You're not going to be able to sleep with her tonight.  Make her your girlfriend? Of course! That's good. So, hypnosis, love potion, or mind-control helmet?    I should get Helen alcohol?  Have you talked to Fogell?  Hey Helen! Hold up. Did you hear about the party tonight?  No, no, I am. That's why I came looking for you. Me and some guys are going to the liquor store after class, so I was thinking I could buy you yours, if you needed someone to.  You will absolutely not. It's my treat.    Yeah. I'll see you then. I'm so sorry about that.  I did it, dude. I even offered to pay for it. It was pimp.  Where have you been?    Have you ever actually met a guy named Muhammad?  You probably have federal agents tracking you for even considering the name Muhammad on a fake ID!  One name?  Under what circumstances would you ever have to show a chick your ID?  Calm down! It's not terrible! This might work, but it's up to you, Fogell. They'll either think, \"Oh, it's another punk kid with a fake ID.\" Or, \"Look, it's McLovin, the twenty five year-old organ donor\". What's it gonna be?  I told you, man! What did I say? I told you that was a dumb idea.  38                                                                 38       Come on! Just wear what you wore to school.  Why don't you just go to your house and get your own clothes? `Cause this is stupid.     See what my dad's got.  39                                                                     39    It's, like, 7:30 and my Mom's still here.  Fuck you, asshole. Let's just sneak down there and grab it.  40                                                                     40              Bye, Mom! Love you.  Love you, sweety.  41                                                                   41    It's fucking water!  We can't go back! She totally knew, she'll bust us for sure, and we have to meet Fogell.  What? It's just a vest.    You're not gonna steal it. Fogell, he's not going to steal it.  Shh. Seth's coming.  No. Shut up.  Well, here we are. Fogell, are you ready?  Goldschlager. That's for Helen, so do not forget it.  What's the difference?  Are you okay?  Seth, calm down! Fogell, stop being a baby and go buy the alcohol! You said you'd do it, so do it. It's why you bought the ID, so just go do it.  Calm down. Did you remember a condom?  Yeah, I figured, you know, might as well. I brought one of those little things of spermicidal lube too.  It doesn't mean you shouldn't be prepared. You didn't even bring one?  I don't really even understand what your plan is.  Yeah, but I figured there's no harm in bringing just one little condom.  Fine. I won't bring the lube.  Do you think I could get Helen to do some kind of long distance thing?  I haven't seen her since she switched schools.  I heard she had breast-reduction surgery. Her tits must be crazy perfect now.  That was a waste.  I can't even begin to imagine the justification for making breasts smaller.  Whoa. What's this?  Check it out! The cops!  Shit! They busted Fogell!  Oh my god. Are they gonna take him downtown?  What are you talking about? Money? What about Fogell?  We have to help him!  Fine. Just...calm down. We need to think. We need to think.    Whoa, whoa, whoa. Hold on. Come here.  What are you doing?  I don't....I don't like this idea at all. I'm just not feeling it. That guy's fucking creepy. Just look at him.  Hey, are you sure that it's cool we're here?  This is weird.  Dude, let's slip out the back.  You want to end up like that guy? Not me, I need my nuts.  You need it! I don't need it. I'm going to tell Helen I like her, and then maybe she'll get with me; not after I get her stinking drunk.  Because I respect her! I'm not going to put that kind of unfair pressure on her.  We're leaving, okay? These guys could kill us. You want to get killed for liquor?    Whaa! What the...oh..  Oh dude. Oh dude. Oh dude.  Okay. Okay. Here we go...  Helen? Helen?!?  Hey! Helen. Hi. I had bad reception. Are you at the party?  Yeah, definitely. Um, about your Goldschlager...  What's going on there?  Nope. I'm gonna be there.  I think it's going to be a real fun...event.  No. What splotch-  Oh no, that's not me either. Wrong guy, man. Sorry.  Trust me, man. That wasn't me. I don't even listen to rap.  ...cause, yo! Bitches and gats, bitches and gats, what do all of we's got?  When we steal all the money?  Yo! I kill the whores of Vice City with my magnum 9/Take out the punk pigs with my Glok design/ Drink a fifth of Hennessy and get benign/Fuck all the bitches with their asses fine  What?  What?  No I didn't!  If you said we should burn our dicks off and I didn't, that's not bailing!  What?!  Oh! Okay! There it is! It finally comes out!  What happened to that, is that you're too stupid to get into the schools I did!  You've wasted all my time, you selfish bastard!!! Instead of chasing girls and making friends, I threw away the last three years talking bullshit with you! And now, because of you, I'm going to college a fucking friendless virgin!  You talking to me or yourself? You fucking loser!  I'm sorry! You pushed me first.  Nothing.  No officer. Not at all.  Puh...please don't shoot.  Uh...I don't know, five-foot-ten, eleven?    Should I run!?!  We can't do that. He's homeless.    I can't believe Helen's bottle broke.  Yeah? Well, good luck getting Jule's drunk enough to have sex with you.  Fuck, Fogell! You're a god damn idiot.  Shit. Seth, me and Fogell are rooming together next year.  I didn't tell you because-  Becca! Hey.  What?  What? What did she say? Does she think I'm a good guy? What did she say?  What?!?  Oh man. This is too much. Oh god. What do I do? I lost the Goldschlager I was supposed to bring her!  What? Oh man... But...she's totally hammered. If I get with her, and I'm not drunk, isn't that, like, date rape?  I guess.    Down the hatch.    Hey, Helen. Sorry I was-  Uh...well...uh...  Oh man, it's a crazy story-  I'm already pretty wasted. But...uh...here's to you.    Are you okay?  Oh man. Helen...I want to tell you, I mean, I've wanted to tell you, for a long time-  Shit. Can you, like, slip out?  Whoa. Fuckin'...careful.    Um...thank you. I've thought you were a really incredible person for a really long time.  I'm...I'm..I'm about to. But first I just want to tell you exactly how I-  You don't have to do that, you know, we can start this relationship on something more than just that.  Jesus Christ.  You don't want to do this.  Look, you know I really like you, Helen, but this is...it's just too intense. And I'm so drunk I don't even know how to, like, process-  What? Did you just call me a...pussy?  Oh god! Oh...  I'll...uh...I'll go get her. Are you going to be okay?  Life's bullshit, huh, Miroki?  Fuckin' wax off, asshole!  Fuck off, jerk! You're hurting my shoulders!  Dude! Seth! It's the cops! The cops.  Dude. You saved me!  Wanna sleep at my house, man? You're my best friend!  Yeah!!!! Look what else I gots!  Is the bang bus anything like this?  147                                                                  147    Oh my lord. You have no idea!  And then you saved me, man! I fucking love you!  Why don't we say that more? It feels good! I love you more than my brother, man. Like, when you went away for Easter last year, I, like, missed you. You know?  I'm sorry, man.  I need you to know that it's not like I even want to live with Fogell; it's just that I'm really afraid of living with strangers.  Yeah, me too. Like, yeah...at least we kind of came together, again.  Good night, Seth. I love you.  148                                                                 148    Oh...uh...hey. Morning.  You sleep good?  Um...  You don't have to. I'm not, like, doing anything.  Oh. Cool, well, can I come? I need a comforter. For college.  Don't ask me. I don't give a shit if your pants look good.  Fine. They're way too small.  Yeah, the male camel toe look is really big this year.  Holy shit!  Should we hide?    Hi Helen, Hi Jules.                  Jules. Helen. Hi. Everyone looks very embarrassed.      No, I dodged it. Whizzed right by me.  Oh! I have to get a comforter too, for college.  You could get your college pants there.  Maybe we can go eat after?  Yeah man, have a good one.",
        "Becca": "Is it him?  Where have you been, you almost blew it.  Helen. She's been waiting for you. She's right over there. She's been yammering about you all night.  It was something like, \"I'll fully blow him tonight.\"  Well, Jordana stole a bottle of tequila from her parents and her and Helen have been going at it. I think she'll be fine in that department. I'd just go over there and invite her upstairs, pronto.  It's not date rape if you're drunk, too."
    },
    "imdb_rating": "7.6",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BY2VkMDg4ZTYtN2M3Yy00NWZiLWE2ODEtZjU5MjZkYWNkNGIzXkEyXkFqcGdeQXVyODY5Njk4Njc@._V1_QL75_UX380_CR0,2,380,562_.jpg",
    "description": "Seth and Evan are best friends, inseparable, navigating the last weeks of high school. Usually shunned by the popular kids, Seth and Evan luck into an invitation to a party, and spend a long day, with the help of their nerdy friend Fogell, trying to score enough alcohol to lubricate the party and inebriate two girls, Jules and Becca, so they can kick-start their sex lives and go off to college with a summer full of experience and new skills. Their quest is complicated by Fogell's falling in with two inept cops who both slow and assist the plan. If they do get the liquor to the party, what then? Is sex the only rite of passage at hand?<jhailey@hotmail.com>",
    "name": "Superbad",
    "genres": [
        "Comedy"
    ]
}