{
    "filename": "Syriana_script.txt",
    "imdb_id": "tt0365737",
    "imdb_url": "https://www.imdb.com/title/tt0365737",
    "characters": [
        "Dean Whiting",
        "Riley Woodman",
        "Sydney Hewitt",
        "Julie Woodman",
        "Rebecca",
        "Jimmy Pope",
        "Tommy Barton",
        "Bennett Holiday",
        "Bryan Woodman",
        "Max Woodman",
        "Bryan's Boss",
        "Bob Barnes",
        "Arash",
        "Leland Janus",
        "Mohammed Sheik Agiza"
    ],
    "dialogues": {
        "Dean": "",
        "Whiting": "Will they get approval? Helluva large company if they do. I mean, client.  Well, Bennett, as they say in the bible, there are many, many ways to light Europe.  You're certainly welcome. Ha, ha. Our pleasure, really. Bonhomie galore. But Meshal is either wary or stupid or both. Reza points to a glass case where a huge leather- bound book is displayed.  Prince, is there anything we can do for you? The Prince thinks about this for a beat.  I know your brother, the foreign minister. Very bright. I know your father, too. He threw the second creepiest party I've ever been to in Washington. And from what I can tell you could probably use a bit of a cat's paw yourself. Second born son so beaten down by his family he can't even tell me what he wants when he's asked straight out, a grown-up baby who hates his brother and maybe wants to be king, maybe.  Well, Prince, are you a king? Can you tell me what you want? The Prince is at first taken aback, but then takes a beat to consider the offer. Whiting and the Middle-man wait.     This is Mr. Whiting.  Yes. Whiting glances at the wall readout on his alarm -- DOWNSTAIRS STUDY flashing.  I'll walk around.           Send a car, you imbecile. He looks at the alcove and closet. Just then, the desk phone RINGS, startling him. The phone rings and rings. on the wall behind Whiting's head are beautifully framed photos with Kissinger, Clinton, King Fahd. Rack focus off Whiting and slowly ZOOM to...     I lost friends there as I'm sure you did. I got a peek at your file. You're a good man, one whose experience is narrow and deep. Your entire career you've been used and probably never even known what for.  In this town, you're innocent until you're investigated. Bob looks up and squints at the waitress' name-tag.  Beirut rules, Mr. Baer? Whiting loves the game. Bob looks tired, maybe a little sad.  You still do, Mr. Baer. You still do. Bob stares at him.",
        "Riley": "Hello, Daddy. I'm playing. That's my job. Playing. ON BRYAN'S DESK, mounds of research, books, reports, numbers. In the phone Bryan can hear Julie laughing.      I want to look out the window. He holds up his arms for his father who lifts him. They walk to the window. Riley stops crying instantly, as children will, and shimmies out of his dad's arms. At the window, they stand together, silhouetted against the dark night and distant street light.",
        "Woodman": "",
        "Sydney": "In a way I feel like Switzerland and I'd like to remind everyone in this room that they've signed confidentiality agreements. Polite LAUGHTER.  And allow me to introduce my associate, Bennett Holiday, who will be, how should I put it, building consensus day to day. Bennett, the only African-American in the room, takes in the faces now all staring at him. All the white faces.  You just visited what someday soon could be the most profitable corporation in America.  Provided we don't start running cars on water. Provided there's still chaos in the Middle-East.  This ain't the SEC anymore, son, and maybe you got a couple scalps on your belt from your time over there - Enron, World Com - but now the job is find the problem, fix the problem. And if you don't find a problem, then there is no problem. Bennett notices that Sydney wears a Mickey Mouse watch.  And WHEN the government approves this merger it's gonna buy a lot of houses out on the Vineyard, maybe even yours, so, of course, it's delicate all around. Who's this U.S. Attorney, Donald Farish the 3rd? What's his agenda? Who's behind him? Is it a political force? Another corporation? Is he a glory boy making a name?  Well, there you go, he taught a class of yours at Georgetown Law. Mr. .Whiting did say to me, I have a feeling about this young man. He said, he can position himself. Sydney stands.  Hold these guys in a circle. Ask the careful questions. I don't need to tell you this is a hell of an opportunity for you to catch those peers who have spent, how should I put it, less time on the government dole. And get rid of that fancy watch, it makes you look like a Jew. Sydney disappears back up into first class, carefully pulling the curtain in place behind him.  I took a bit of a temperature reading. The other associates seem to like you. That's not really a good sign.  Six apiece.  Inherited a ton of dough -- Point.  Seven.- Six. Already got his mind made up. Got his teeth in it like a little terrier. As Sydney is talking, he wins the point.  Eight - Six. Match point.  Like an informant?  Match! He turns and holds out his hand.  If people in oil deals talked to U.S. Attorneys, there'd be no oil business. DEAN WHITING, 60's, congenial, but powerful in build, an ex-marine, an insider for forty years, wanders over.  Dean, you know Bennett Holiday.  We've been discussing the Connex- Killeen merger situation.  How'd it go? Think you'll get invited on any more hunting trips?  He broke the law. Sydney holds out a golden envelope to Bennett.  Mr. Janus himself wanted me to extend an invitation to oilman of the Year. He's being honored so it should be a nice weekend. Relax. Get a massage. Congratulations. Perhaps the slightest flicker of distaste crosses Bennett's face. On the reverse the Capitol Building is so close you could reach out and touch it.  His wife'll be there. Pat. Butter wouldn't melt in her mouth. The elevator TONES on every floor.  This is good. You done good. The watch the floors light up.  What do you think you're doing?  Stop. Right. Now. Bennett and Mr. Janus look at Sydney.  In our line of work, the guy with the documents is usually the guy who stole the documents.  You aren't going to hurt me, Bennett. You'll wash out of the private sector. Fact, you're already gone. You'll end up working public defender cases. You'll make 1/50th the money. You could have been on the boards of Fortune Five Hundred companies. You could have been an advisor to Presidents. You could have helped us win like Romans instead of sitting on the sidelines hoping we don't turn into Visigoths. You jumped that turnstile, sir, but don't worry, we'll get you off at trial -- Sydney takes the documents out of Bennett's hands.     You ungrateful, pissant, nobody. FBI restrains Sydney. Pat looks up from her needlepoint.  Don. Not the perp walk, Don -- Farish nods as if to acknowledge they're barely out of round one. And they begin leading Sydney out. Across the room, silhouetted by the windows, Mrs. Janus helps Mr. Janus slip on his tux jacket. They see Bennett standing awkwardly in the middle of the room. Pat extends her hand for him to join them.",
        "Hewitt": "",
        "Julie": "Don't let him do that, please. His wife, JULIE WOODMAN, 28, sleepy American, very fit in sweats, cooks bacon at an older range. They have the worst house in the best neighborhood and have yet to properly furnish it.  You have bacon. Max sits at the table.  You have real bacon, only it's made from soy beans. Max looks at his plate.  Tell Daddy you love him. An abrupt three year-old HANG-UP. Bryan looks up and sees HIS BRITISH BOSS holding a FANCY INVITATION.  That's guilt not charity. He's Catholic and can't view himself as a shallow model f.u.c.k.e.r, which he is. And when war breaks out in some energy producing country, he's the first one into work. Bryan looks at her.  Honey... you're a man who supports his family, not a boy.  I do, honey. For you, I like him very much. She takes his hand as they walk.  Arabs are very family oriented, as a people. Is that racist? Max, a book-oriented, rather than water-oriented, child is afraid to jump in.  Don't. Let him work this out. It's important for his autonomy. Max finds his courage, jumps, and disappears beneath the surface, then bobs up happily. Julie smiles.  Make a game of it. Pretend they're six year-olds and you have to get them to eat carrots and all they want is dessert. Make it about good parenting.  I wish I could just believe he's floating around on a cloud or in the corner watching us. Julie wants Bryan to comfort her, but he doesn't.  He wanted to say good night to his father. Riley goes over and stiffly gives Bryan a hug.  Stop it! Look at me. The fountain shoots up and cascades down. Riley leans toward the water and for a second his feet lift up. Bryan starts up, but then Riley is playing again.  Here's a question: how do you think it looks to profit off the death of your six year-old? This gets through, but then --  Bryan, we're going back to America.",
        "Rebecca": "",
        "Jimmy": "Is the Caspian a lake or a sea, Thomas?  Oh give me another lecture on subsurface rights, Thomas. Jimmy stands. He is imposing in a Lyndon Johnson visits Congress sort of way.  If the Caspian is a sea, you can make deals with the Stans, but if it's a lake, then the rights are shared equally by all countries, including Iran. And by an act of our Congress it is illegal to trade with Iran, so we can't be in business with any of those countries, even though they have oil and we sell it. This is our business, Tommy, selling oil, not finding it. Anyone can find it. It's everywhere. Jimmy motions out the window --  A monkey can stick a straw in the ground, slurp it out and boil it, right, Thomas? But you wanna make it commercial, you wanna turn it into a commodity, then you gotta be able to move it and to move it, you gotta have relationships. Take The Gulf --  No, I want to talk about The Gulf and how a goddamn E-mir, what is an E-mir anyway --  How some podunk King tossed you out on your ass. Jimmy pulls out a sharpie, walks to the Resource Map and defaces it, drawing the outline of an actual country, Kazakhstan, in Central Asia, home of the Tengiz Field.  Every company in the world wanted into Kazakhstan, into the Tengiz, but Killeen got it and then Connex wanted Killeen and here we are. I made investments. Investments that will bear fruit for this company.  Hell, Tommy, we've all got the Foreign Corrupt Practices Act committed to memory. I've got a little copy taped to the wall of my head... Up here.  Caspian's surrounded. Like a pond. Caspian pond.     El Presidente Nazerbayev's best pal in the whole world.  Six billion barrels of oil, a billion of natural gas liquid, fourteen trillion cubic feet of  That's Kenya, Danny, not one of these turkey shoots.  Fuck Connex. Fucking slant- drillers. Don't know why I ever sold 'em my company in the first place. Here, take your pick. He hands Bennett a thick catalogue. ANGLE ON CATALOGUE: Pages of animals you can shoot with pictures and description. ADDAX -- \"this large African antelope is white with a gray masked face. It's horns corkscrew up making multiple twists in both sexes. Large males can weigh 275 lbs. Both males and females make handsome trophies.  The Tengiz is the Holy Grail. You get into that stream, nobody in your family will ever have to clean a toilet again.  Like somebody who didn't get into Tengiz and is pissed off about it.  How 'bout every other oil company in the world.  What's your fancy? Bennett randomly picks an animal from the list.  The Kudu. Good choice.  Floyd. Kudu. Bennett sees in the distance \"Beater Boys,\" Mexican men in orange jackets, flushing quail for a party of hunters.  Jesus H. Christ. Kudu is rare. Get that gun up. Bennett lifts the rifle. THROUGH THE CROSS-HAIRS the Kudu is gigantic and unaware of the hunters.  Come on, son. He won't wait all day. Finally Bennett PULLS THE TRIGGER. The gun is LOUD. He stares, then slowly pulls back from the scope.  My granddaddy was a wildcatter. Same with my daddy. That's how I got my start. Luck and hard work. Nobody handed me shit. Now, I got libraries and parks named after me. And I'll probably ruin the grand-kids. You wearing a wire, Bennett?  Mind if I pat you down? Jimmy checks for a recording device. He's clean.  We all tell ourselves little stories, Bennett. Sometimes I'm the flame burning in the Jefferson Memorial. Other times I'm a guy with his nose pressed up against the windows of a whorehouse -- Suddenly there's a RUSTLING as a large animal passes somewhere close. Bennett freezes. Jimmy looks at him.  Boar. This deal snapped the lights on in the kitchen and the rodents all scurried. Now you're standing there under the lights trying to point to where they all went. Don't be the one caught out in the kitchen. Jimmy unslings his rifle and motions to where, obscured in the thicket, a pair of intense dying eyes stares back.  What'd your daddy do, Bennett?  Oh, fer Chrissakes, Tommy, we both got letters from the Grand Jury, it's not your own private little pity party --  The lowliest little shareholder knows we deal with some of the most stank places on earth --  Oh, is it? I have personally seen a bill from this law firm to the government of Saudi Arabia for 36 million dollars. A one line bill for services rendered.  Well, it oughta be. Danny's a good man. He's a friend of mine.     I'd be real careful. You dig a three foot hole, you'll find one body, but you dig a six foot hole and you might find twenty.  We use one quarter of the oil in the world, Bennett. Your house is light and warm and my house is light and warm, but what if it was that way half the week, or none of the week. Hell, China's economy ain't growing as fast as it could because they can't get all the oil they need. I'm damn proud of that fact. Bennett gives him nothing. A beat.  What if it involved someone at your firm? Someone way the hell above you. We'd have to have an understanding.  Just like that.  Call me Jimmy.",
        "Pope": "I'd be real careful. You dig a three foot hole, you'll find one body, but you dig a six foot hole and you might find twenty.  We use one quarter of the oil in the world, Bennett. Your house is light and warm and my house is light and warm, but what if it was that way half the week, or none of the week. Hell, China's economy ain't growing as fast as it could because they can't get all the oil they need. I'm damn proud of that fact. Bennett gives him nothing. A beat.  What if it involved someone at your firm? Someone way the hell above you. We'd have to have an understanding.  Just like that.  Call me Jimmy.",
        "Tommy": "You're not taking this seriously. You don't think this is a problem. One wall is a map of the world except where there should be jagged country boundaries are perfectly straight resource lines. It's color coded: the world divided into energy corporations: EXXON/MOBIL, BRITISH PETROLEUM,  A U.S. Attorney is looking into your relationships in Kazakhstan and the U.S. Government is holding up approval of our merger... At one end of a long table in a corporate boardroom President TOMMY BARTON, 50's, a hatchet-man of Zen-like corporate efficiency, heads a group of EXECUTIVES. A small placard labels this faction - CONNEX.  The Board thinks it's a problem. Mr. Janus certainly thinks it's a  That's an important legal point --  That's enough, Jimmy.  King. It's a king --  Thank you, Jimmy. You know how much we appreciate hearing your point of view; however, Mr. Janus and I have asked Connex's Washington counsel, Sydney Hewitt, to come down here and talk about strategy for the next thirty days. The eyes all shift to SYDNEY HEWITT,. 60's, Alabama smooth accent and ever-so-certain.  Not to my recollection -- Bennett and Sydney square off against Tommy, Jimmy, their personal lawyers, one apiece.  I was at the meeting, but I don't focus on those kinds of details.  I attended the meeting but, as I said, I don't focus on those kinds of details.  A firm retained by Killeen well prior to Connex's involvement --  This is the oil business we're talking about, right?",
        "Barton": "",
        "Bennett": "Are you a director or executive of this company? The leader gnaws on a bone. Bennett points down to a mess of contracts and legal papers in front of him.  Is this your fax number? The leader speaks rapidly in RUSSIAN. Bennett is baffled. Finally, an UNDERLING translates.  Ask him if he's been receiving faxes'at this number? Ask him if this is his phone number?  Is this a number to reach you? Again, the leader speaks in rapid Russian.  I'm asking you about this payment. Who is this person on the account? Bennett notices a Russian, OSKAR WERNER-TYPE, wearing THICK-FRAMED GLASSES, smoking and staring at him. Another RUSSIAN glances at the paperwork.  I know bank is no more. I'm trying to find out where the assets went. The Russians nod to the MUSIC coming from the poles. Now the leader speaks in surprisingly good English.  Provided the government approves the merger --  I know him. He taught a class of mine at Georgetown Law. Sydney knew this, of course. Sydney looks Bennett over, then he chuckles, the effect of which is unsettling.     I'm not making this coffee for you. I'm making it for me. You I'm making oatmeal and then you sleep.  You look like shit.  Are you working?  I had a little trouble at work. Bennett grabs his travel coffee and starts away --  There's some beer in the fridge for after you wake up, so you don't die on my floor of the DT's. And no smoking in my house. Bennett leaves the kitchen. The man yells after him.  I don't need your goddamn hospitality. The front door SLAMS. The man glances up at a photo of Bennett Jr. at his Howard University graduation. And next to it, the man, BENNETT SR., graduating 25 years earlier. ON TV: old, white senators listening judiciously.  You know, can't complain.  Why don't you tell me what you have so I can respond? Farish looks at his guys. They all choke back laughs.  I guess you guys really have a handle on the angles. The U.S. Attorney team shares a moment at his expense.  Sentencing a company after a guilty plea, cooperation will be factored in, which includes waving the privileges afforded their attorneys.   He was an easy grader.  I'm sorry, Sir. HIGH ANGLE - down to the fishbowl aspect of the court. Sydney has a very good serve. As they talk he wins three points in a row, Bennett lunging at the spinning ball.  Sir, I don't want to get ahead of myself, but Kazakhstan... You got capitalists with a K -- Point.  You got banker gangsters, gangster bankers. The Federal prosecutor is a good man. Smart.  I think they've got someone inside the deal. Somebody they can squeeze.,  Yes, Sir. Like an informant. Just my feeling based on their overconfidence. Sydney aces Bennett.  Good to see you again, Sir.  I don't know, Sir. The Tengiz field, Killeen's largest asset, is being looked at pretty heavily by the U.S. Attorney's office. Sydney Hewitt nods to another club member. Bennett turns to see DONALD FARISH III joining a far table.  Sea. Caspian Sea. Like seashore.  The other side?  I have a feeling this U.S. Attorney has a source.  Any idea who that might be? Jimmy looks at Bennett like he was just born.  I'm not sure --  No.  I don't know who my father is. On Bennett as Jimmy FIRES --  Russian. I don't read Russian. Get it translated. Man, I was dreaming about something good, too.  What are these?  Everybody stop what you're doing. They look up, bleary.  We're starting again. I want you to ignore any document that doesn't pertain to VIDAK LIMITED.  Hello... Hello. English?  Does anyone here speak Russian? The paralegals just stare. Someone in the back shouts --  Take this to Sydney Hewitt. Now. Please. INSIDE THE ROOM the guard makes his way to Sydney Hewitt and hands him the card.  Killeen Oil through Daniel Dalton and PetroKa Energy Consultants created assetless shell companies owned by the heirs of President Nazerbayev. This was. discussed...  At the Upstream Division Meeting held in January of 2003 in Sun Valley, Idaho?  Wherein it was described that Killeen bore all financial risk, but President Nazerbayev's children, while attending The Lily School in Switzerland, were entitled to all of the profits - seventy million dollars. Tommy's personal lawyer leans in and whispers in his ear.  Daniel Dalton Jr. and PetroKa Energy Consultants --  A good faith purchaser is in good faith only if they didn't know about the problems at the time of the purchase --  It is illegal to offer gifts, money or the promise of money or anything of value to influence foreign officials --  The business of Whiting, Sloan is not under discussion at this time.  You broke the law, Mr. Dalton.  You have 37 million dollars hidden away and the only question I can see of any relevance is whether you'll get to keep any of it. The two men are tiny against the architecture, the nation's capitol going on with it's day around them.  He has kids. He's got a wife.  I do, Don. Very well.  That's quite a statement, Don.  One word. Dalton.  Defrauded the Government of Kazakhstan of funds to which it was entitled, defrauded the people of Kazakhstan of the right to the honest services of their elected and appointed officials. Seven years, does three, maybe two point seven, on your recommendation. out the window the bad neighborhood is giving way back to the developing neighborhood where Bennett lives.  Dalton's a bit of a rogue, it's true.  Not so little, I imagine. Don, we can spend the next five years in court to get back to this very place we are right now. They will fight tough. They will fight dirty. They will pressure your boss. They will pressure the people who appointed your boss. They will pressure the wives of the people who appointed your boss. You won't ever hit 'em any harder than this. And you know it. Bennett waits. After a beat Farish shakes his head.      What are you doing?  The question is what are you doing?  Really. Well, I'll tell you what I'm not doing: I'm not running a shelter. You going back to work? No answer.  What happened at your job anyway? Another jerk? Another white asshole? What? You think you get where I've gotten and there are less of them? You think I don't want a fucking drink? You have no idea what I'm doing, what is actually going on with me. The only way you can change this shit, all this shit, is from the inside. I'm trying to get inside. Which a fucking loser like you will never understand. Bennett Sr. puts down, his paper, stubs out his cigarette and starts for the door.  Good. The door shuts behind his dad --   I love this country. It's a great country, if you're not a quitter.  Dalton's not enough. So they will sit on him until he explains the how and why and the who, and they will be forced to unravel this merger. Jimmy turns from the grill.  Dalton's not enough.  If he's as big as you say then when he goes down the merger will be approved. Despite himself, Jimmy is impressed --  We're looking for the illusion of due-diligence. Two criminal acts successfully prosecuted gives us that illusion. Jimmy hands Bennett a plate of ribs and smiles.  The lawyers are saying, hey, if you can't trust a Big Five accounting firm. And the accountants are saying, hey, we're not lawyers. Legal didn't understand. Accounting didn't understand. Nobody understood anything. The regulatory bodies had to scratch their heads for a minute that nobody at Connex or Killeen was at fault, but this merger is so balance-positive for American consumers that ultimately Justice wants it, the Federal court wants it. Everybody wants it. Our real client is US, the American people, and we're building our presence in Kazakhstan, so we had to give them a little something meaningful and they got out of our way. Mr. Janus glances at the TV where a pro golfer sinks a long, undulating putt.  Unfortunately, yes. And the best option seemed to be a secret deal for excess Iranian pipeline capacity that I uncovered during the diligence, a side deal benefiting the lead lawyer involved in the Connex-Killeen merger approval process. A slow dawning on Sydney's face --  Of course, it's illegal for an American to control these rights --  Finesse. Strategize. Advise. But don't own. Your words.  A piece of advice Syd, one attorney to another... Bennett leans close --",
        "Holiday": "",
        "Bryan": "You are a Cheerio dissemination device. Yes, you are -- Pull back to find his father, BRYAN WOODMAN, American, late 20's, in a shirt and tie. Blonde and blue-eyed like a modern T.E. Lawrence, he's lost in the child, sharing his sense of wonder.  . An evolutionarily perfect machine for the spreading of imported Cheerios to all corners of the kitchen. The toddler smiles at him. Julie puts four plates down. They both notice the empty place setting. Just then, a golden boy, MAX, 6, enters the kitchen.  Our position is that there is at least twelve dollars of instability premium in the market. Protests in Iran. Threat of more strikes in Venezuela. The Turks still making noise about Russian crude through the Bosphorus. You're welcome, Rebecca.     That's a very good job to have.   I can't. I've got all this --  It's Max's birthday. We've got stuff all weekend. Vincent sticks his head in the door --  Read my report --  .I'm probably the tenth guy this month to pitch something like this. It's like the Godfather. Emir, I come to you on this special day. Vincent is riding motorcycles through Cambodia, through land-mines. Some charity thing.  I thought you like him. Vincent.     Hedge strategies are tough for these guys. Oil goes up the people wonder why those extra billions aren't in the treasury. Prices go down, no one's thanking them for saving a few bucks. Julie looks at her husband to determine whether he's testing his \"pitch\" or in need of encouragement.  Here? They nod. Bryan looks around. It's awkward.  Well, okay... The real worry facing you guys is another year of record pricing. There are no more elephant fields. Not even in Natural Gas. As structural alternatives are more fully realized you'll need a new strategy to maximize every penny from your existing resources, particularly in a climate of falling prices. One businessman turns to the other --  That minister eulogizing our child made me sick. How do you eulogize a child? He was great at playing. He loved popsicles. She rolls into him and he holds her, but he's staring at the ceiling as the child's cries echo down the hallway.  If on Monday Khatami refuses the I.A.E.A. inspectors, look for crude prices to spike yet again. Push into the television --  It's not like it's any secret Iran will refuse the snap inspections.  okay. Thank you, Rebecca. Bryan nods and the lights go off on Bryan. He stares --  It was a stupid question, Henry.  There's an arrow on the ceiling pointing the direction of Mecca. The Bin Laden group air- conditioned Mecca. One of their big projects. They made billions and billions. No response on the phone.  Women are covered head-to-foot walking five feet behind the men. It's humid. 125 degrees and humid. I walked out of the airport and it was like a wall fell on me. All the Arabs in white sheets. It says, it's hot and I don't have to work. I'd like to see them play baseball dressed like this. He dwindles away. silence on the other end of the phone.  Fine. I'm fine. No, I'm fine. How are you? More silence. He looks down at the swimming pool of the luxury hotel, a peaceful blue aberration in the desiccated landscape.  You can't possibly understand.  Six blocks. Which phase?           Great. That's great. Seventy-five million dollars... How much for my other kid? Prince Nasir stares at Bryan.  If I were your economic advisor I'd tell you it's not the dumbest thing you've ever done, but it'll probably be the dumbest thing you do today. Probably. But why would you need an economic advisor? Twenty years ago you had the highest GNP in the world and now you're tied with Paraguay. Your second biggest export is second-hand goods. Followed by dates on which you lose five cents a pound. You want to know what the business world thinks of you. They think a hundred years ago you were chopping each other's heads off in the desert and that's exactly where you'll be in another hundred. So, yes, on behalf of my firm, I accept your money...  Okay. You want an idea, here's an idea.  Your kingdom is here. The North Field is here. Europe is here. Because of trade restrictions and outdated alliances, you've been selling your gas for peanuts, loading it on ships, and waving as it sails away.  But, pretend for a second this is excess Iranian pipeline capacity. He lays the stick across the circles in the sand like an overland pipe running to Europe.  Here is your route. Overland. Through Iran. You commoditize it, you control it, you take it right to the front door of every home in Europe. Your profit just went up by a factor of three, possibly four. I think that's a pretty good idea. Overhead the falcons spiral higher and higher, chasing. each other in the sky. The rising MURMUR of AMENS --  He invited me to come with him. I think he thinks he's somekindof reformer. He's got a nice jet. Okay, very nice. Hold on a sec -- He glances at the Blackberry screen. Another call -- JULIE HOME. He hits \"IGNORE CALL.\"  Julie's fine with it.  El Segundo. No one has heard of it.  It's near Los Angeles.  El Segundo is like Saudi Arabia with a surf break. They hoot and protest. They don't believe him.  It's a desert town on an ocean controlled by an oil company. Tankers lined up offshore. There's this smell in the air. They pass out flyers to families moving in. This town is a quiet town where everyone works and our families are happy. If you have a problem with it or if you don't like the smell, you can leave.  A Mareva injunction?  What are they thinking? They're thinking we're running out. We're running out and ninety percent of what's left is in the Middle East. So if you look at the whole progression from Versailles, through Suez, 1973, Gulf War One, Gulf War II, it's really shaping up as a fight to the death.  so what they're thinking is keep playing, keep buying your toys, keep spending fifty thousand dollars a night for your hotel room, but don't invest in your infrastructure, don't build a real economy, so when you finally wake up, they will have sucked you dry and you will have squandered the greatest natural resource in history. The Prince remains impassive. After a beat --  That's great, that's exactly what you should do.  Sure, it looks like just hanging around in a hotel but that's how these people do business. It's world historical stage time. With the delivery deals we can make in Europe, transport through Iran, this guy might be able to revolutionize not just his country, but the whole region.  His dad's about to keel over and Prince Nasir could be like Mossadegh in Iran in 1952, with a real democracy springing up organically. I mean if we could just be a part of one of these countries getting a Parliament, helping them find efficiency, showing them how real incentivized capitalism can do its job --  Julie, the little trading company I work for is now the chief economic advisor to Prince Nasir. Do you know what this means? It's like someone put a giant ATM on our front lawn.  Fuck you. I changed the diapers and put cream on rashes and gave bottles in the night and went to doctor's check-ups and worried about percentiles... I did everything right. I did everything right. They look at each other and, for a second, it seems he may melt and hold her, but he doesn't and it's cruel.  Good.  I don't see you moving to Colorado.     He's a visionary, like Faisal or Attaturk, and the people love him. By Monday, he'll be running the country. The Chinese seem unconvinced. Finally, the tent opens and the leaders file out. Prince Nasir addresses the crowd.  You guys should ride together. Nasir and Bryan exchange a glance then Nasir helps his wife into the vehicle. Bryan hands the baby up to them.",
        "Max": "Mommy, I want bacon.  I want real bacon.  I want pig bacon.",
        "Bryan's": "",
        "Boss": "The Emir's summer party. In Marbella. Any interest?  I'm not really asking.  Through much finagling we have an audience with the Emir. He wrote the strategy and he's not slick. In fact, take your children with you - a birthday weekend for Max. The towelheads love children. ON TV: JOHN D. ROCKEFELLER in a safari hat leads a group in BAPTIST HYMNS on a croquet lawn while the tanks roll through Baghdad.  Go home.",
        "Bob": "Liquid MDMA? No, I never tried it. The music is louder. Arash proudly shouts over it --  Great. He's great. Arash just stares. Bob sips his drink.  Are we gonna do this? A girl begins to dance in front of Arash.  You said they were both for you. Arash tosses an envelope at Bob --  I was looking for the bathroom. MSA seems remarkably serene, then he screams in Arabic.  You don't speak Farsi, do you, you son of a goat? MSA screams again, tightening his finger on the trigger, then he backs out the door, never losing aim on Bob.  Those people back there don't know what's going on. They don't wanna know.  And it's not like anybody else could roll in here. It's not like it's just reading reports.  Well, then here we are.  Let's say, somehow, I get a Branch or even a Group, then what? Will you come? Will you bring Robby? Now, Margaret looks away. A STUDENT-LEADER is up on a platform brandishing a Coke bottle, SHOUTING in Farsi into a bullhorn.  He's against the ban on Coca-Cola. He says you have to fix your soul, which is not something you can put on a soft-drink. We see the faces of the protesters, silently staring, their mouths covered by black tape.  And our analysis seems to be on the mark... And we're getting good satellite coverage. Bob is clearly working from a script. Terry George is pleased and gives Bob the slightest of approving nods.  And we're reprogramming resources into Iran. Our next review will show that ---  It's possible. It's complicated.  They let young people march in the street and then the next day shut down fifty newspapers. They have a few satellite dishes up on roofs, let 'em have My Two Dads, but that doesn't mean the Ayatollahs have relinquished one iota of control over that nation. The steno guys hands are frozen.  We've had Iran in embargo for almost thirty years, we backed their neighbor, a neighbor we invaded twice, in a ten year war against them, we're hanging on by a thread with a massive occupation force, so I got news for you... Thomas Jefferson just ain't that popular over there right now. Silence except for the steno guys clicking away, then complete silence. Terry George stares at Bob a long beat.  How's your mom?  she's a secretary.  She was a secretary. Robby, are you nervous? Indignant Robby speaks loudly for The Perfect Family --  Robby, you know, I live... Where do I live? Maryland. I live in Maryland. Meaning you have residency there. In Maryland. For the University. Of Maryland. Robby liberally uses the hot sauce. Two LEBANESE MEN at another table nod in approval. Robby fires off Arabic.  Robby, it's complicated. I may have really screwed up at work.  I was supposed to keep my mouth shut and didn't. Robby is disappointed and angry.  She's a secretary. Robby turns back to the Arab men --  Intelligence work isn't training seminars and little gold stars for attendance.  It's two people in a room and one of them is asking a favor that's a capital crime in every country on earth. A hanging crime. Another corner. Another white hallway.  Prince Nasir Al-Subaai.  It's a great city. Everybody chuckles.  Did you see my report on the missile? I reset guidance to blow ten feet off the ground --  We're not getting divorced. Stan looks at him like he's kidding himself.  What about this C.L.Z. - Committee to Liberate Iran?  My goal was always to own a bar in Macau, before Macau got ruined like everywhere else.  I'm not doing anything sitting in that office. That's the problem.  Bourbon rocks -- Bob glances up at the TV. ON TV: financial news, BRYAN WOODMAN in front of the trading floor at his company.  Stan, I got a chance to go back. I want to go back. Is it safe for me?  How can you tell if you're talking to a Shiite or a Sunni Muslim. If you feel like Shee-iteing your pants you know. The driver glances at Bob in the rearview. OUTSIDE a MAN has a gun stuck in his waistband. Another MAN on a roof has a rifle. A paranoid, guarded place. They turn and suddenly a metal gate is across the road. MEN pour out around the car. Flannel shirts, olive drab army shirts, beards, no beards, guns in waistbands. Bob's door is opened and he is yanked from the cab.  I'm here to see Said Hashimi. They roughly frisk Bob.  Hashimi. Said Hashimi. They take his pen, remove his belt, check his passport: it's Canadian. Bob's picture. The name is SEYMOUR RISEN. They check his license: the name is SEYMOUR RISEN.  Thank you for this audience. I have a business proposal for Mussawi. One that benefits everyone. Hashimi nods magisterially.  I thought it would also be prudent to say, I have no interest in Hezbollah. This is business and it doesn't concern Hezbollah. In the distance a dog barks and chickens cluck. After a beat, Hashimi turns his rheumy eyes on Bob.  Yeah, sure. Only one of them was propelled by gas and the other by  He saw an engine coming at him at 27,000 feet per second and his heart stopped. This settles a beat.  I'm between State Department and Defense. Bob surreptitiously looks around to see if Mussawi is alone. It's clear Bob makes him nervous as well.  I'm getting some information, Jimmy.  Okay, Jimmy. Mussawi glances down at the picture. It surprises him. ANGLE on the picture of PRINCE NASIR crossing a street. Bob has a small pad on which he scribbles a dollar figure. Mussawi glances at the number. He's impressed.  I want you to drug him, put him in the front of a car and run a truck into it at fifty miles an hour.  Canadian. Nasir motions for them to squeeze together for Bob. The gate closes. The lift creaks and begins to rise.        Yes.  Yes. Bob is framed by two, not-bright CIA SECURITY OFFICERS.  Yes.  Of course I was aware. It's why I went after them.  what do you think?  I'm okay. I'm fine. Hey --  I saw these Shiites selling an Egyptian a missile. In Iran. I had a feeling about this guy, a Sunni nut-job, but I'm back here where I got on the wrong side of Terry, then an opportunity just happened to come up involving someone I worked with before, not a radical, I mean, he went to Rutgers, only now he flips, wants to cut my goddamn head off. And now they got me isolated away in here and they send these suits around asking me nonsense questions about bad people who are no longer with us, no longer with us on their goddamn orders. So you tell me what happened. You tell me, Margaret. Margaret doesn't know what to say so she says nothing.  What about Fred?     Fred. Fred turns and sees Bob, looks around uncomfortably.  What's going on, Fred?  I was almost killed, Fred. My hands were mutilated. And they're asking me about the Amiri brothers? About Tehran?  I typed in Prince Nasir Al-Subai and my computer gets seized.  Where did this Prince Nasir job come from? Why was I tortured. Why am I being investigated? Why was I sent? NEIGHBORS stare. Fred's kids look out the window.  Stan, why did Mussawi double-cross me? Why does no one care that a Sunni radical named Mohammed Sheik Agiza has our missile? And why did they open a damage assessment on the Amiris? And on me. For doing my job?  What about Mussawi?  Did Prince Nasir hide Mohammed Sheik Agiza in the Water Ministry? Does he fund terrorist organizations?  Who's worried about the Nasir job? Stan, who's worried about me talking? On the screen: a LOUD, ACTION BEAT. Stan leans over and  You were in Beirut in '84.  I didn't used to need to know. A Grand Slam Breakfast is set in front of Bob.  Bacon looks perfect, Deborah. Bob puts syrup on the pancakes. Eats a piece of bacon.  Innocent until investigated. That's nice. It has a nice ring to it. I bet you've worn some miles on little sayings like that. Very wise, gives the listener the sense of law being written as it's spoken.  If anything happens to me or my family, an accident, an accusation, anything, then first your son will disappear, his body will never be found. Then your wife. Her body will never be found either. This is guaranteed. Then, whatever is the most dangerous thing you do in your life, it might be flying in a small plane, it might be walking to the bank, you will be killed. Do you understand what I'm saying? I want you to acknowledge that you do understand so that we're clear and there won't be any mistakes. After a beat, Whiting nods.  I've made decisions that resulted in deaths, but I never lost a nights sleep. Never. I killed people, but I always had about 500 pages of U.S. law behind me, law that I believed in, and that was good enough.  I want my passports back.  If I told you I knew of something that was going to happen to someone and that I felt I had to try and stop it even though it will probably cost me my job, what would you say? She really looks at him.  It's okay. It's okay. Bob slowly. approaches Prince Nasir's vehicle. They stare at one another. Nasir lowers his window.",
        "Barnes": "",
        "Arash": "Have you ever tried liquid MDMA? Bob's forehead is sweating and his hair is sticking to it, which he wipes away as he sips his scotch.  Tehran is the world capital!  What do you care? Bob glances in the envelope. Behind him, the Amiris are picking up the other case. Bob moves toward the curtain. IN THE BACK OF THE SHOP Bob's eyes adjust. Several robed shapes, ghosts in grey light, carry the case out a door. The BARREL OF A GUN touches the side of Bob's head. The SOUND of a SHELL CHAMBERED and a MOUTH BREATHER. Bob raises his hands. The barrel slides around to his forehead and Bob is staring into the blue eyes of MOHAMMED SHEIK AGIZA, 40's, bearded, and calm.",
        "Leland": "",
        "Janus": "Sydney, how are you? And you must be Mr. Holiday? she shakes his hand. Gives Sydney both cheeks. They cross the large suite, one wall of which is floor-to-ceiling windows giving a dazzling view of mid-town Manhattan.  Syd! Bennett! Lee Janus! How're we doing? Janus is standing with his hand out --  Those number crunchers can get a little over-zealous, can't they, but Christ, when we write the GAAP rules like some kind of abstract painting. Stare at that liability hard enough and before long it'll turn into an asset.  Something besides Dalton?  Is there something you want to tell me, Syd?  I'm a straight shooter, Bennett. I think it was Trollope who said the best capitalist is someone who's greedy and honest. We can't forget that second part.  It was Trollope, honey.  We're creating a lot of jobs this quarter, Bennett, a lot of jobs. We're building a business and that's what America's all about.  Thank you, Sir David. Thank you.  It's not a secret vote, so we can see who is voting for themselves. It's all right to vote for yourself. I did not vote for myself. The rapt faces of oil men listening to an oil man.  I voted this year, as I do every year, for Ali Naimi, the Saudi Oil Minister, who has done more for shareholder value than all of us combined. Laughter as a smiling SAUDI accepts a round of applause.  And that is certainly not a criticism of any of us in this room. My father told me when I was young, never criticize a man until you have walked a mile in his shoes. This is something I've tried to live by, because, if you do criticize, you're already a mile away and you've got his shoes. LAUGHTER, people glancing... who knew he was so funny?  I accept this award on behalf of the employees of Connex-Killeen, our people, the finest in the world... Guys, could I get you to stand up for a moment? At the CONNEX table, Tommy and Jimmy and the others get to their feet. The crowd APPLAUDS. Bennett applauds Jimmy who sees him clapping and applauds him right back --  I want to thank our strategic friends from around the globe who are here tonight. More APPLAUSE. Emir Meshal Al-Subaai gives a little wave to both sides of the room.  I hope I'm not giving away trade secrets when I say Liquefied Natural Gas truly is the fuel of the future. Mr. Janus raises his crystal derrick in a toast.  And to everyone else who helps make this the most exciting and important and profitable industry on earth. The crowd again begins CLAPPING for itself. Light catches the crystal oil derrick and refracts --"
    },
    "imdb_rating": "6.9",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BN2FiZmQ4MDgtYzZlOC00ZmI0LThmZDMtMzBhNTVmZDE3ODc3XkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "American oil companies Connex and smaller Killen are undergoing a merger, the new company named Connex-Killen. The move is in response to Connex losing a number of oil fields in the Persian Gulf region as Prince Nasir Al-Subaai, his country's foreign minister, and the oldest son of the Emir and thus the heir apparent to the throne, signed a contract with the Chinese instead. As Killen somehow managed to get the contract for the oil fields in Kazahkstan, the merger would give Connex-Killen additional control of the industry in the Middle East. Connex's retained law firm, headed by Dean Whiting, assigns Bennett Holiday to demonstrate to the US Department of Justice that due diligence has been done to allow the merger to proceed i.e. that the merger would not break any antitrust regulations. The US government is unhappy with Prince Nasir's decision to award the contract to the Chinese, and in combination with issues around illegal weapons, the CIA assigns field agent Bob Barnes, who has experience in the Middle East, to assassinate the Prince, whose eventual leadership would further undermine US oil security. Barnes becomes a pawn in the goings-on between the players. Meanwhile, Geneva based Bryan Woodman, an energy analyst, eventually becomes associated with the Emir and his family, largely due to a tragic incident. In the process, Woodman learns of Prince Nasir's western leanings and his want to change radically his country into a western democracy with a diversified economy. If the Emir found out, it could threaten Prince Nasir ascension to the throne and thus derail the democratization process. Through all these manoeuvrings, migrant workers are affected, some who cannot retain work with the changing of companies controlling the oil. Some of those may try to take matters into their own hands for their form of justice.—Huggo",
    "name": "Syriana",
    "genres": [
        "Drama",
        "Thriller"
    ]
}