{
    "filename": "Ted_script.txt",
    "imdb_id": "tt1637725",
    "imdb_url": "https://www.imdb.com/title/tt1637725",
    "characters": [
        "Tom Skerritt",
        "Ted (voice)",
        "Donny",
        "Thomas",
        "Narrator (voice)",
        "Sam Jones (as Sam Jones)",
        "Norah Jones",
        "Lori Collins",
        "Tami-Lynn",
        "Guy",
        "Rex",
        "Robert",
        "John Bennett",
        "Young John (as Brett Manley)",
        "Frank"
    ],
    "dialogues": {
        "Tom": "",
        "Skerritt": "",
        "Ted": "Hug me.  You're my best friend, John.  Uh-huh.  Don't look so surprised. You're the one who wished for it, aren't you?  Well, here I am.  For real.  Sounds good to me.  Merry Christmas, everybody!  Let's all be best friends!  Is it a hugging gun?  I'm sorry, Mr. Bennett. I didn't mean to scare anybody. I just wanted John and I to be friends.  Nope. We're thunder buddies. And the thunder knows it. We're totally safe.  Yeah, John?  I promise.  Thunder buddies for life.     All I'm sayin' is Boston women are are, on the whole, a paler, uglier sort than women from the elsewheres of life.  Lori's from Pennsylvania, not a Boston girl.  The fact that you have to say they're not that bad means that they are that bad. They turn into drunk, half-white, half- pink monsters after 2 hours at any beach.    I think it sucks, I'm gonna have a talk with him.  No, I know this guy a long time. I've known him since 9/11. Remember, I was like, \"Aw, shit. 9/11. I gotta get high.\"  Hey, you mind pickin' up a bird feeder on the way home? I wanna start enjoying the beauty of birds.  I'll drive you, I feel fine.  Aw, Jesus. / Fuck.  Is it bad?  It's okay, go, go, I'll pull outta here. Hi, Thomas! How are ya?    Yes, a study in contrasts.    Fuck yeah, Flash!  Hey, before I forget, let's nail down a plan for the Bruins game tomorrow night.  For what?  Oh, fuck me. Nice.    Oh, fuck that! It's four years! You and I have been together 27 years!  Where's my ring, Johnny? Where's my ring, asshole?  No, John. It's a bad idea. And it's the wrong time. What with the economy and... the credit bubble... the Supreme Court... I mean, look at Haiti.  Tom Brady could do that.  Hey, Lori.  Oh. Okay. Are we having homos over for dinner or something?  Whoa!!!  She's funny, John. You got yourself a regular Toni Collette.  Hey Johnny, while you're up, grab me a beer, huh?  Yes, a Brew-stoy-ovski would be nice right about now.  Perhaps a Ted Kazyn-brewski?  Ohhhh, that doesn't work!/Come on, don't ruin it, yeah, that doesn't work.  No, it's gotta have a \"ski\" at the end. Otherwise where's the challenge? If there's no \"ski\" at the end of the root word, then we would just be idiots saying nonsense.  Thunder buddies for life, right Johnny? C'mon, let's sing the thunder song!    Boomp.  Lori! Hey, you're home early! The ladies and I were just watching \"Romancing the Stone.\" Got it on Blu- Ray. Came in a two-pack with \"Jewel of the Nile,\" but I don't know that we'll end up watchin' that one.  Oh, where are my manners? Lori, this is Angelique, Heavenly, Cherene, and Sauvignon Blanc. I love you girls. Y'know, somewhere out there are four terrible fathers I wish I could thank for this great night.  What's what?    Yeah, she's passed out in the bathroom now, she seemed like she was hopped up on somethin'. I mean, mystery solved, I  Lori, if I can-- now this is just speculation, but... is it possible that this is not so much about the stool in the corner, and more about maybe tonight's dinner not measuring up to your expectations?    43    God, there are some fucked up fish out there.  Jesus, look at that one. Mister tough guy fish.  \"Hey! Whatsa big idea? Cold fusion? Well that is a big idea, I beg pardon!\" Look at that guy. WASP-y white guy fish.  \"I don't care for some of Conan O'Brien's humor. I don't like Irish humor. And this food is too flavorful. I don't care for flavor in my food.\"  (switching to goofy voice as a bottle-nosed fish swims  Wh... what?  What...what did I do?  Hey, look, that was a tough night for all of us.  She's makin' you do it, isn't she?  What about... thunder buddies for life, Johnny?    46  And we'll hang out a lot, right?   Bring it over here.  That was the-- the thing-- The old-- Yeah-- no, I know- that doesn't mean-- I'm not - gay.  I look stupid.  I look like Snuggles' accountant.  I don't wanna work at a grocery store.  I told you, I can totally be a lawyer.  I'm a special case. I'm a fucking talking bear. They might make an exception `cause they're all like, \"Aaa! This bear can talk and do stuff! Let's give him a job and maybe he'll give us a few laughs,\" but then they're surprised at what a stellar performance I'm turnin' in. And then they practically have to give me the Anderson case.  And if I don't get the job will we still smoke that pot?   Yeah. Okay, good speech, coach.  Nope.  Shit.  Well, I'm a former celebrity with a minimum wage job. This must be what the cast of Different Strokes feels like.  Yeah, that was ah... that was a good time.  Huh? / Excuse me?  Hey, I'm not an \"it\", pal. I'm a \"he.\"  Wow. Can you imagine what that little shit would do to me?  Fuck you. Why do you have to take it so far? Now it's real. Fuck you again for that. C'mon, let's go find a better place to get stoned.  Yeah, sure is.  Yeah. First night in my beautiful new apartment. They say they're ain't hardly been no murders here.  I know.  I know. I'll be fine, Johnny.  Thank you, please come again, we have a lot more groceries.  Hey Ellen?  Who's that over there?  Yeah. Very cute. You know what I'd like to do to her? Somethin' I call a Dirty Fozzie.    Johnny. What are you doin'? You wanna come over and catch a buzz?  Fuck that, I traded off yesterday, so I got the night shift. C'mon, I'm bored as crap over here, just swing by for a bit.     John. Five minutes. And then I'll kick you out, I promise. C'mon, I picked up the \"Cheers\" DVD box set, and supposedly everybody talks shit about each other in the interviews.  Yeah, and apparently George Wendt confesses to a rape.  They do, John. Sometimes they do.  John, I have to kick you out. I am extraordinarily busy today, I have so much teddy bear paperwork to get through, it is retarded. Five minutes and you're outta here.  Just tell him you don't feel well.        Was there cocaine on the set of \"Cheers\"? Hm. Lemme figure out the best way to answer that. Um...are there naked dicks in gay porn? Yes, there was quite a lot of cocaine. I mean, it was the eighties. And I was king. I was king of the eighties. I was Ted fucking Danson. And not only that, I was Sam fucking Mayday Malone. Was I popular? Gee, lemme think: are there naked dicks in gay porn? Yes, I was quite beloved.  He is. He is. Someone the likes of which we should all aspire to become.  Woody Harrelson. Smallest dick I've ever seen on a man.   Here, try this stuff. I told my guy to step it up, and he gave me this.  It's called Kennedy's Head. It's actually pretty mellow.  No, it's-- it makes you cerebral. Like Kennedy. Kennedy was smart. That's what it refers to. Decisions under pressure. Cuban missile crisis. Go on, spark it up.  Yeah, it's all Ikea. Did the whole apartment for 47 dollars.  There's an Asian family next door, but they don't have a gong or nothin', so it's fine.  How's work?  Ah.  It's actualy not bad. Met a girl. She's a bagger.  White trash name. Guess.  Nope.  Nope.  Nope.  I know you do, and I am not fucking with you.  Nope.  Yep.  Tami-Lynn.  Hey, isn't this great? The four of us here, having dinner together? Lori, how've you been? Haven't seen you in forever.  Company's turnin' 20, eh? So you can bang it but you can't get it drunk.  Well, it's funny, usually the first item on our agenda is \"what's goin' on with Lori?\" So I'm surprised that one slipped through the cracks.  Right?  That was a lengthy conversation.  A canter.  No, no, that's not what she's sayin' at all, right Lori?  Whoa! Whoa! Whoa! / What the hell happened? We're havin' a friendly meal here!  It's okay, Tami. Nice, Lori. Real nice.  Baby! Baby! Baby. Baby. Let's get outta here. We'll go back to my place for a couple vodka and strawberry Quiks. Okay? See ya, John.  Yes.  Oh.  Kareem!  You suck, Kareem.  Hello?  Gah! Uh... hi there.  Uh... no. No I'm not. I'm... you know, you're never alone when you're with Christ.  I'm... I'm pretty happy where I am. I just got a shitty new apartment--  Well, gosh, you know, since I just returned from active duty in the Civil War, that sounds really appealing. Oh wait, no, that was a hundred and fifty years ago, and I don't give a shit.  Yeah, I'm comin', sweetheart. Yeah, my dance card is quite full, so I'm gonna have to decline.  Yeah, sorry. But, ah... you know, I'd like to thank you for creepin' up my night, and... Jesus be with you. In Christ.  Johnny! You gotta get over here, man!  I'm havin' a little impromptu thing with some people, and John... Sam Jones is here.  Sam Jones. Flash fucking Gordon. Is here.    Remember I said, my buddy's cousin is friends with Sam Jones? My buddy's in town with his cousin and who's with `em? Sam Jones!!  Sam Jones is here, and John...  ...his hair is parted down the middle.  Get over here.   John. There are moments in a man's life: Nathan Hale, \"I regret that I have but one life to give for my country.\" Alan Hale, \"Yes, I accept the role of the Skipper on `Gilligan's Island.'\"  John, this is your Alan Hale moment. For god's sake, come share this with me.     Johnny! Thank Christ you made it!  Okay, get ready, man.  Hey, Sam! This is the guy I was tellin' you about!       John, this is Sam Jones. Sam, this is my best friend in the whole world, John.     Wow.       Look Johnny, if we're ever gonna get serious about openin' a restaurant we gotta start plannin' it now.  Italian, yes.  Eggplant parm.  And it's a non-restricted place.  Anybody can come.  Mormons are welcome.  Exactly, that's what I'm saying.  You don't bring it up. You just let `em in.  No one will.  You're talkin' about it, I'm just sayin' let `em in.  Exactly.  Good.  No Catholics, though.     No see, I can do this.  My teddy bear biology gives me superhuman reflexes.  Well, you never shoulda trusted me, I'm on drugs!     Oh god, that was a fun day.  I do not sound that much like Peter Griffin.       See? There. Proof. Garfield's eyes look like a pair of tits.     Okay, Johnny, c'mon up here and do this with me!  Come on!      See there's this one part of the wall that's really soft, you could punch through it wicked easy.  Holy shit! / Ha! / Wow! / Etc.     Dude, we're sorry! We're sorry!  Chill out okay? We'll pay for it! Let's talk this out okay? What's your name? I'm John!        Johnny, come on upstairs. Tami-Lynn's gonna make some RC Cola from scratch.  What?  Oh come on, she'll go home, watch Bridget Jones' Somethin' Asshole, cry a little bit, she'll be fine, you'll talk to her tomorrow.  Well... `course I do, Johnny. Thunder buddies for life.  Johnny, I'm... I'm sorry.  Johnny, wait! Hey, listen!    Johnny, it's me.  Johnny, open the door, please. I wanna talk.  Sorry. Look, Johnny, I know you're pissed, but just listen to me for five seconds. I saw Lori out on a date with Rex.  I'm serious, John, I went over to your house to talk to Lori to try and take some of the heat off you, and I saw Rex picking her up. They were going to the Hatch Shell.  Johnny, it's the truth. I'm tellin' ya--    Yes. You are actin' like a giant, V- shaped-funny-lookin'-guy-in-a-porno cock.  `Member that porno we saw with the guy with the V-shaped cock--forget it. What I'm sayin' is that you're blamin' me for somethin' you did to yourself.  Lori was right about you. You can't take responsibility for anything that goes on in your life.  I don't have to, I'm a fuckin' teddy bear! Y'know somethin', I didn't tie you up and drag you to that party. I wanted you to come because you're supposedly my best friend.  Whoa whoa, it's not my fault you didn't care enough about your relationship.  Wow. Listen to yourself. What am I, Emperor Ming here, controllin' your mind? That's your choice, John! And you know, by blamin' me, you just make yourself look like a pussy.    C'mon, motherfucker!    I'm so sorry, Johnny. I'm so sorry.  I love you.  Listen... you gotta let me help you make things right with you and Lori.  No, John, we can get her back. Look, remember when you were ten, and you hit that squirrel with your BB gun, and then when we saw it fall from the tree we both starting crying? Remember? And then we ran up to it and tried to give it CPR? And it came back to life? John, we could do that again.    Hey, play chopsticks, you jazzy slut!  Well, I'm not a hot half-Muslim chick who sold 37 million records, but I'm hangin' in there.  Eh, ooga booga, whatever. Hey, I want you to meet a good pal of mine. Hey Johnny, come on in!  Norah, this is my friend John.  Jesus, you look fantastic.  Me and Norah met in 2002 at a party at Belinda Carlisle's house and we had awkward, fuzzy sex in the coatroom.  I have written so many letters to Hasbro about that.   Ah, god.  Down here, I swear to god I'm not lookin' up your towel.  Not lookin' up your towel. Not lookin' at your funny business.  I need to talk to you.  Lori, do me a favor and let me talk first, and then you can say whatever you want.  Look, John loves you very much. More than anything in the world. And he's fallin' to fuckin' pieces without you. He knows he screwed up big time, but you gotta believe me that is wasn't all his fault. If you'll just give him one more chance to be with you--  Listen to me! If you'll just give him one more chance... I promise I will leave and never come back. He'll be all yours. Just give him one more chance.  Because of me! Look, you want him to be a man. And I'm the one who's keepin' that from happening. As long as he's got his teddy bear, he's still a boy. And I care about him as much as you do. But I'm willing to give up the boy so you can have the man.  Look, I'm givin' this the best shot I got here, Lori. I'm beggin' you. I'm no good at this emotional crap, but I gotta help my best friend. Please. Just talk to him.  Thank you. He's waitin' for me down at Charley's. So... maybe you could, y'know... go down instead of me?  Please. You'll regret it for the rest of your life if you don't.   Hey, you mind if I stay and watch the Sox?  Jesus Christ, what a chick fridge. Yoplait, a cantaloupe, and a Brita water filter.  Michelob Ultra Tuscan Orange Grapefruit. My god, America is imploding.  Forget your keys?  You know, your beer suck--  Fuck.  Whoa...  Heh, you know what's hilarious, I got tons of pictures of you guys at my house.  I'm guessin' you guys don't have a PS3. I'm guessin' you're more of a wooden horse with a wig kinda family.  Huh. Wig horse.  Y'know, you think you're just gonna get away with a kidnapping? Nice fuckin' example you're settin' for your kid.  Maybe \"no\" to a Snickers bar every once in awhile wouldn't hurt.  Jesus fucking Christ!  Yeah well, fuck your dad.  Shit!  That's a great story, I felt like I was there.  Okay... okay, kid. You win. We'll do it your way. You wanna play a game or somethin'? It's play time, let's play a game.  Good, good, hey, how `bout we play a little game of hide and seek?  Well, now, Robert, your dad likes you to show good manners, right?  Well, a well-mannered kid lets his guest hide first, don't ya think?  Great. Fantastic. Okay, now you count to a hundred and then try to find me, okay?  You... well-- no, you-- god, that's a weird fuckin' question, no, just start countin'.  Okay, no peekin', now, or you'll get kid cancer.  John! It's me! Can you hear me?  No, John! Don't hang up, I'm in trouble!  They got me! That freaky guy and his freaky fat kid!  I'm in their house, John! You gotta call the police, they won't let me outta here! They tore my ear off!  Uh... I'm not sure, it's uh--  Shit.  Yeah, good idea.  Aaaa!   Johnny!   Aaaaa! Shit!!  Back off, Susan Boyle.  Johnny! Total T.J. Hooker, right?  God dammit!   Johnny...  Johnny...    I... I don't think so. I'm... I'm in trouble. I need... I need to tell you something.  Don't... don't ever lose her again. She's the most important... most important part of your life.  Even more than me. She's your thunder buddy now. She's--           Son of a bitch...You wished for my life back.  You were pretty great out there at Fenway, Johnny.   Yes!  Y'know Sam, there's only one way to end a perfect day.  On three.  Flash jump.",
        "(voice)": "",
        "Donny": "I'm sorry to bother you, but my son and I couldn't help but admire your teddy bear.  I'm Donny. And this is my boy, Robert. I have to tell you, I've been fascinated by your story ever since I was a boy. I remember seeing you on the Carson show. You were just wonderful.    Don't swear in front of my child. Now. We are very interested in the bear. If you'd like to work out some sort of arrangement, here's my address and phone number.  Hello, Ted.  Are you all alone out here?  You know, Robert and I could give you a very, very good home.  I can offer you six thousand dollars in railroad bonds. They were left to me by my father.  I really wish you wouldn't...  Hi, Ted.        Yes, as you can see, you've been part of our family for quite some time. Welcome home.  He's all yours, my little winner. You've arrived at a lucky time, Ted. It's almost Robert's play hour.  Now, remember, Ted, you belong to Robert now. So you will do as he says.  (leaning in to Ted with  When I was a little boy, I saw you on television. And I thought you were the most amazing, most wonderful thing I'd ever seen. Ever. And I asked my father if I could have a magical teddy bear, too. And he said no. And I was heartbroken. I decided that if I ever had a son, I would never say no to him.  Yes. You are. Happy play time.    Ted, are you making friends with Robert?  Ted?         Ted looks around, and spots a phone on the counter. He jumps up, grabs the handset, and jumps back down. He dials John's number.       You're not a very polite guest.     You've put us in a pickle here, haven't you? We have to go now.  We tried to make do with other teddy bears. But none of them were you, Ted.         Robert, seat belt.     Ted scrambles to his feet.                   Ted shakes himself off, still a little dazed, and climbs back up. Robert climbs into the way back and grabs one of his legs.",
        "Thomas": "John! May I speak with you, please?     John, it's almost ten o'clock.  What do you mean?  John, all you have to do is not fuck up, and you get my job when I go to corporate next month. You will be the new branch manager. All you have to do is not fuck up, and all you're doing is fucking up. Not that I don't think you're too fucked up to handle not fucking up my job, but you happen to be the least fucked-up person in the whole office. The next least fucked-up is Alix, and you've been here three fucking years longer than him. But I'm telling you, I will promote the fuck out of him if you fuck up one more time. That is all. Fuck.  Good. I like hearing that. Because in a month my life now could be your life: a cushy $38,000-a-year branch manager who's personal friends with Tom Skerritt. It's not a bad life, is it?  Did you know I'm friends with Tom Skerritt?  I'll show you something I don't show too many people, because I don't want anyone treating me differently.  That's me and Tom Skerritt.  Goddamn right, wow. Now get outta here. I'm gonna dock you for being late, and for the scratch on that car. Try and be a little more responsible tomorrow.  What?  So?  Oh.     Oh my god.  Jesus, John.  Oh my god. Up the dog's ass, right?  That's how they get `em to stop biting, sure.  Go go go, take care of it, let me know how she is.  You don't owe me anything, go.   Jesus.",
        "Narrator": "It has been said that magic vanished from our world a long time ago. And that humanity can no longer fulfill its desires through the power of wishes. To those who have lost the wondrous vision of childhood eyes, submitted here is the story of a little boy, and a magical Christmas wish that changed his life forever.  It began in 1985, in a town just outside Boston.  It was Christmas Eve, and all the children were in high spirits. That special time of year when Boston children gather together and beat up the Jewish kids.  But there was one child who wasn't in such good spirits. Little John Bennett. That one boy in every neighborhood who just has a tough time making friends.  John longed with all his heart for that one true friend that he could call his own. And he knew that if he ever found that friend, he would never let him go.  Well, as it does every year, Christmas morning finally came.  All the children were opening their gifts with holiday glee.  And for little John Bennett, Christmas Day brought a very special new arrival.  John became instantly attached to Teddy. There was something about that bear that made him feel as if he finally had a friend with whom he could share his deepest secrets.  Now, if there's one thing you can be sure of... it's that nothing is more powerful than a young boy's wish. Except an Apache helicopter. An Apache helicopter has machine guns and missiles. It is an unbelievably impressive complement of weaponry. An absolute death machine. Well, as it turned out, John picked the perfect night to make a wish.  John was just about the happiest boy in the world. And he couldn't wait to tell everyone the good news.  Well, it wasn't long before the story of John's little miracle was sweeping the nation.  Before long, Teddy had become a huge celebrity in his own right.  But through all the fame, Teddy never forgot his very best friend, John.  And that was a promise that neither one of them ever forgot.  So where are John and Teddy today? Well, let me put it this way: no matter how big a splash you make in this world, whether you're Corey Feldman, Frankie Muniz, Justin Bieber, or a talking teddy bear, eventually nobody gives a shit.  And so John, Lori, and Ted lived happily ever after, having discovered at last that all they really needed was each other. John and Lori were married in a beautiful ceremony in Cambridge, by a very special Justice of the Peace.  And that's the story of how one magical wish forever changed the lives of three very special friends.  Ted and Tami-Lynn continued their torrid love affair for quite some time. One afternoon Ted was caught behind the deli counter eating potato salad off of Tami- Lynn's bare bottom. He was instantly promoted to store manager.  Sam Jones moved back to Hollywood with the goal of restarting his film career. He currently resides in Burbank where he shares a studio apartment with his roommate Brandon Routh.  Remember Brandon Routh from that god- awful \"Superman\" movie? Jesus Christ. Thanks for getting our hopes up and taking a giant shit on us.  Rex gave up his pursuit of Lori. Not long after he fell into a deep depression and died of Lou Gehrig's disease.  Donny was arrested by Boston police and charged with kidnapping a plush toy. The charges were dropped when everyone realized how completely stupid that sounded.  Robert got a trainer, lost a substantial amount of weight, and went on to become Taylor Lautner.",
        "Norah": "Thanks so much! We're gonna take a short break, but we'll be back in a few!   Teddy!! How you doin', you fuzzy little asshole?  Well, half-Indian, but thanks.   Ha. Whoa, relax there, sweaty. You ready to bring down the house?  Well, you're probably not used to seeing me fully clothed.  Actually, you weren't so bad for a guy with no penis.  Okay, I'm gonna give my chops a rest here and invite a friend of mine up to the stage. He's gonna sing a song to a very special lady in the audience who he loves very much. Let's give a big hand to John Bennett!  Jesus.",
        "Jones": "I now pronounce you man and wife. You may kiss the bride.  What's that?  What on three?",
        "Lori": "John and Lori paint the apartment walls. Lori sneaks up behind John, and paints his back. John turns around and grabs her. They scuffle playfully, and then kiss. We ANGLE ON Ted, who stands on a little stepladder hammering a \"Home Sweet Home\" picture into the wall. He steps back, but realizes he has nailed his hand to the wall. He tugs, slips, and the ladder falls. Ted hangs there like an idiot.                         Hi guys.  Ooh. I think you just got me stoned.  Turkey burgers.    Wait, who's that? Is that good?  Oh nice. Is she pretty?  Good.  Rex is fine. He only hit on me once today, so that's good.  He's harmless, I can handle it.  Jesus.  Y'know, I think I might also have a Martina Navra-ti-brewski.  Bullshit, what do you mean?  I thought we were just doing funny names.          It says they got separated and one of them had his foot trapped under a rock for five days.    No, I think it's only cannibalism if you swallow.  Really? That's not what I heard about you.      You're disgusting.  Ooh.  Oh, are the new wines in?  I love you, too.   I don't understand it, 35 years old, and you're still scared of a little thunder.  Oh, I'm okay... except I didn't have time for breakfast, the garage was full, I spilled coffee on my leg, and I have a boyfriend who can't sleep through a storm without his teddy bear.  No, it's not that, I don't care about that. I'd love him even if he was a janitor. I mean, he's got a huge heart, we laugh together all the time, and it's just a bonus that he's like the hottest guy in Boston.  I just wish he could get his life together, you know? Our life. And he can't, and I swear to god, it's all because of that bear.  I can't do that, he'd be devastated. And I mean... what if he chose Ted?  Not really, but what if?  Actually Rex, I have a lot of work I need to get to--    So... what do you need to talk to me about, Rex?    I have a boyfriend, Rex. I think you know this.    Goodbye, Rex.    Oh no, I'm fine, thanks.    Ooh, Cristal.  It doesn't seem like four years, does it?  You had no business being out on that dance floor, but I'm glad you were.   Yeah, I'm... I'm fine.  Well, yeah, I... I would hope it was an accident.  Um, yes. My head hurts a lot.  (beat, noticing him for the  I'm Lori.  Okay, here's a question that'll show how much you actually care about me. You remember we stayed and talked until the place closed, and then we went for late night eggs and waffles, and we stayed there til 5 a.m. watching a movie on the little TV in the diner. Name the movie.  Gold star.  I'm gonna give you the benefit of the doubt.    So do people with Parkinson's.  Yeah, how do you remember it?  Whatever you say, baby.  No, we didn't.  There was no such rule.  Oh, John.  Oh. Yeah.    38  I remember you liked it when you saw Tom Brady wearing one in GQ.  John, I don't need the Hope diamond, all I want is--  Look, I'm only saying this because I love you, but that's not realistic. You're never gonna have any kind of a career if you're always partying and wasting time with Ted.  John, please get him to find his own place, so we can get on with our lives.  Yeah. Fine. Let's talk about it ten years from now.  Well, it's good to know that a talking teddy bear is the only thing that kept you from gunning down your classmates, but John, you're not eight. You're thirty-five. And unless you're too blind to notice, he's not your only friend anymore. You have me. And I love you.  Look, I've put the best physical years of my life into this. I mean, I'm cute now, but in a few years my body's gonna fall off a fucking cliff. Things'll be hanging and stretching in ways that might scare a man. I need to feel secure in the fact that you won't leave me when that happens.  And, my boobs and vagina will all be in the same place, so that's a lot less movin' around for you.  Exactly, and you can do whatever you want with the other hand.  We can achieve critical acclaim and become rich just by screwing each other.       That's my ringtone?  What is it? It sounds negative.  All right, well I'll see you upstairs.     What the hell is all this?!  This place is a wreck! Who are these girls?  What is that?!!!  There is... a shit in the corner! On the floor! There's a shit!  There is a shit!! On my floor!!  What the fuck!!!!  What!!! The fuck!!!       45  It's so gross!!  No! Oh my god!  AAAA, I got some on my thumb!  Shit!     Hey there.  Listen... I just wanna say thank you. What you did with Ted was a big step, and I know it wasn't easy, but I just want you to know that I love you for it. And, I think this a new beginning for our relationship.  Y'know, I don't have to be at work for another twenty minutes...  You know what my favorite thing about you is? After four years, you can still surprise me. To step up and change such a big part of your life just to make your girlfriend happier... I dunno, I bet you most guys couldn't do it.  I'm sorry if I was pushy about it...   Inevitable. Well, that's... romantic? I think?  That sounds like something Stephen Hawking would say to his girlfriend.  Yeah, I do. And I feel exactly the same way about you.  (smiling coyly, as she  Jesus.  Um, I've been good. Not much going on. My company's 20th anniversary is next week, that's something.  It's not that big a deal.    So, Tami, where are you from? Tell us about yourself. I'm always... fascinated to meet Ted's girlfriends.  No, right, I was-- all I was doing was asking. Ted's very... attractive, I'm just always interested in the... type of girl that can snatch him up.  What? No, I--  I was just asking a question.  What?! It's not my fault she can't speak English.  What a cunt.  Huh?  Well, you didn't exactly stick up for me.  Yeah, well, I think you're being a little more fair to him.  Y'know, your boss called this morning and asked me how my arm was.  Yeah. Because of the dog fight I tried to break up.  If I had to hazard a guess, I'd say that was some bullshit lie you made up so you could take off work and go to Ted's. Am I right?  John, Ted moved out so we could give ourselves a chance without him. You're not really giving anything a chance if you're blowing off work to get high with your teddy bear.   Yes. It will.  I wanna break up.  I'm just... I'm done. This isn't gonna work. We're in two different places.  You promised me you were gonna grow up and take our life together seriously.  Jesus, he might as well still be living with us, John. You spend more time with him than you do with me.    John... this really is your last chance. I can't do this anymore.    Did you really just fart?  Oh. Wonder where it'll hit first.   I'm glad you're here.  Play nice. Please.  Sure.  I want you out of the apartment... tonight. Gimme my car keys.  No.  I have given up a big chunk of my life for you.  Just give me my keys, John!                    You're asking me out the day after I broke up with someone.  Okay.  Rex, I don't think it's smart.  Fine... I guess it beats crying myself to sleep every night.  Oh my god.  Yeah, I'd rather just not talk about it.  Nope, I think I'd rather you just take me home.  Nope, not really feeling up to it.  Just to be clear, I am not embarrassed. Listen, John and I may have our problems but at least he tried. You know what? I don't feel like talking to you about this.  Taking a cab. I'm going home.      Ted? What're you doing here? What do you want?  Look, if you're here to fight John's battle for hi--     Ted... that's a very nice offer, but I don't want you to do that. This is about John and me and our problems. And I don't think it can be fixed.    What... now?  Alright, alright, I'll go.     You can thank Ted.  How are you?    Yeah. Work's fine.  There is no Rex.   Wow. Thank you. I appreciate that.  Hey.  Kinda late to be walkin' home by yourself.  Listen, John... there's something I wanna say to you, too.    John, I just want you to know that... I mean, I hope you don't think that--  I, um... I just feel like we should... keep talking. Because--    What's the matter, is he all right?  Where is he?  Why? What happened? Can you call him back?    Which way?                I'm trying!        I know.  I know!  Shit!  Oh my god.  (spotting the action on the  Wait, John! What are you--  Oh my God...         John... I don't know if this is gonna--  John... I'm sorry. You did everything you could. I'm... I'm just so sorry.  (almost too softly to be                     Welcome back, Ted.  No. I wished for my life back. Because I love you both.  Yeah, that's my big brave man.     That's all I ever wanted.",
        "Collins": "",
        "Guy": "There you go, here's your key and rental agreement, and a complimentary map of Boston. Thanks for choosing Liberty, drive safely.  Hey, heard you got busted.  I don't know, man. I got fuckin' wasted last night, and my phone says I texted somebody at 3:15 asking them to beat me up. And then at 4:30 I texted the same person saying thanks.  No. Same as last time.  I don't know. Maybe, yeah.  I don't know. I dig chicks. I don't remember any of it, I was so fucked up. I might be gay, I don't know. You mind covering for me for a bit? I'm gonna go lay down in the john.  Hey Alix. / Hey, how was the club last night?  Oh, well, that's good I guess.  For what?  You guys`ve been goin' out for four years?   Lori ever fart in front of you?  Really.  You Italian?  Oh.  I dunno, just seems like-- never mind, take her to Benihana.  You could put the ring in her ass and let her fart it out.      Hey, dude, you think you could open more than one register? There's like a thousand people here!  Shut up.  Let him try it, man.  Fuck it, all right.  Hey. What's goin' on. This is Jared. He's the guy who beat me up. We're in love.  Yeah. Turns out I'm gay or whatever. Had no idea. C'mon Jared, let's get a drink.  You're an asshole!",
        "Rex": "Well hello there. Sorry if I'm interrupting any private girl talk about Channing Tatum's index finger but Lori I need to see you in my office.  Oh, this is work, I swear.     See that? That's me on the diving team in high school. We dove the shit outta that pool that year. If you look close, you can see the outline of my root.  Lori, what is wrong with you? Why don't you like me? I'm rich, I'm good-looking, my dad owns the company--  Yeah, the guy with the teddy bear, that's a cute relationship, but I'm talking about being with a real man, Lori.  Someone who wears a blazer on an airplane.  Well then, how do you have all that time to be in my head?     There she is! I was worried you weren't coming! Hi kiddo, how ya doin'? Where's your bunny rabbit?   Got it. \"Hey, this house is fucking huge!\" I know guys, try not to get lost.     Oh, here come the ladies.  Say listen, why don't John and I give you gals a chance to talk tampax while we go grab a drink at the bar, huh?     ...and that's a Wade Boggs autographed bat. Just barely outbid Phil Donahue for that at auction.  Yeah, cool. And those boxing gloves were worn by Joe Louis in his first fight. (passing an abstract  See that? Know what that is?  That's Lance Armstrong's nut.  Something, isn't it? Had it freeze-dried and bronzed.  Every now and then, when I feel like my life's gettin' me down and things are tough, I just come in here and look at it, and it reminds me that things aren't so bad. That some people have it worse than me. I mean, he's only got one ball, and I have three. One of them, of course, being his.  I've fucked the shit outta life. So talk to me, Goose. How are things with you and Lori?  That's good, that's good.  Whoa, whoa, okay, look, I think I oughtta just clear the air here a little. I... just want you to know that... I mean, yeah, I'm kind of a \"fun-time boss\" and whatnot, but... look man, I do that with everybody at the office! I'm just a kook! I have no designs on your girlfriend. We work together, and that's it. I think you're a great guy and she's very lucky.  Well, that's how it is, so...there we go.  Yeah.      I got your back, my friend. Been there. She'll never know.  Dude. One man to another. I got you on this.               So, word through the grapevine is you are newly solo. I have tickets to see Norah Jones at the Hatch Shell tonight, and I would love it if you'd go with me.  Look, I'm gonna cut the shit here.  This is the first time you've been single in all the years you've worked here. Just go out with me one time. And if you're miserable and you hate it, I promise I will never even hint at the subject again. Please.  Look, I'm an asshole. I know that. It worked for me in high school, and it's been like a reflex ever since.  Lori, the worst that can happen is you have a fun, casual date with a guy who only wants a chance to prove to you that he can be something more than a jerk. Besides, you're a huge catch and it's about time somebody treated you that way.  Great. Pick you up at seven?  God, she's so brave. YOUR MUSIC IS SO  (fake voice, covering his mouth and looking away You suck, get off the stage!  Hey, come on guys!  That was insane. Did you see the way that guy's body hit the ground? It was like a rag doll!  You want to go get a drink after this? I feel like I could use one after seeing a guy almost die.  One drink, come on.  Alright, alright, I get it. I don't blame you. When you think about it, it was actually really unfair of him to embarrass you like that.  Where you going?  Finally.",
        "Robert": "Sit up straight when you talk to me.  Daddy, is he all mine?     Me and Ted are gonna be best friends, daddy.  No! Daddy said no bad words!  I said a bad word one time, and daddy punished me for it.  Daddy gave me an ouch. Now I have to give you an ouch.  Yeah, I wanna play a game!  I love hide and seek! I'll hide!  Yes.  Okay, you hide first.  Do I need to wash my hands before this game?  One... two... three...     Good, daddy!  Daddy, you're gonna ruin the game!  Found you.  No! You're being bad!   You can't have my teddy bear!!",
        "John": "Hey guys, can I play?    Wow!  I guess Santa paid attention to how good you were this year, huh?    4  He talks!  I'm gonna name you Teddy.       Hey Teddy... can I tell you something nobody knows?  Last week, my mom and dad took me to the park for a picnic. And they have this duck pond there, and... when nobody was looking, I pooped in my hand and threw it at a duck. Was that mean?    You know... I wish you could really talk to me. Because then we could be best friends forever and ever.            Teddy?  Teddy?!  Teddy?  Did you... did you just talk?    Whoa...  Yeah, I... I did wish for it.  You mean... we get to be best friends... for real?  Forever and ever?  Well, I think we had a wonderful Christmas this year.  One of the best. And I particularly enjoyed the gift you gave me last night.  Mom! Dad! Guess what?! My teddy bear's alive!    No mom, he's alive! For real! Look!  Jesus H. Fuck!  Oh my god...  John, get away from that thing! Come over here, right now!    Helen, get my gun.  Dad, no!  Helen, get my gun, and call the police!  Yeah, Dad! I made a wish last night that Teddy was alive, and my wish came true!       The thunder can't get us, right?  Teddy?  Do you promise we'll always be together?  Thunder buddies for life.                  John and Lori paint the apartment walls. Lori sneaks up behind John, and paints his back. John turns around and grabs her. They scuffle playfully, and then kiss. We ANGLE ON Ted, who stands on a little stepladder hammering a \"Home Sweet Home\" picture into the wall. He steps back, but realizes he has nailed his hand to the wall. He tugs, slips, and the ladder falls. Ted hangs there like an idiot.                    That's bullshit, what about Lori? She's hot.  They're not that bad.  I-- It's workin' for me.  Yeah, I don't know that you wanna go to a drug dealer with complaints.   Oh fuck, is it nine-thirty? Shit, I gotta get to work.  Jesus, I don't know if I can drive.  Aw, Jesus. / Fuck.  Aw, man.  It's not good.  Shit.  I know, I'm sorry, it wasn't my fault.    Sir, I promise, you're not gonna regret promoting the fuck out of me.  N--no.  No.    I will, sir. Thank you. I won't let you down, Goose.  Top Gun.  Tom Skerritt.  Jesus, Guy, you look like shit, what happened?  And you don't remember it?  It... it just seems gay, doesn't it?  Do you think you're part of some, like, gay beat-up underworld? Like one of those gay beat-up clubs?  Hey Alix. / Hey, how was the club last night?  Hey guys, does anybody know a nice restaurant? Like something where the napkins are cloth?  Lori and I have been dating four years tomorrow, and I wanted to take her someplace nice.  Yeah.  Wow, you're... not very tolerant, huh.  Yes.  Yes. Many times.  No.  Why?  Like what?  Oh come on, nobody's expecting anybody to propose. Marriage isn't... I mean, isn't love enough? I submit that love is enough.       So bad, but so good.  Oh, I love this part.    I can't, I'm taking Lori to dinner.  Well, we've been dating four years tomorrow.  Lemme ask you something... you don't think she's gonna be expecting something... big, do you?  No, like... a circular gold thing on the finger.  Stop it! Jesus Christ, knock it off!  I mean, do you think she might be expecting me to make that kinda move?  I guess I didn't think about that.  This is the American fantasy, right here. A professional NFL player is called upon to save the world.  Tom Brady could do that.  Hey, sweetie.    Whoa!!!  She's a comedienne.  She's as pretty as she is funny. How was work?  How's your dickhead boss?  I'm not saying this to be mean, but I really hope that fucker gets leukemia.   Oh yeah, a coupla' Charles Brew-Kowskis?  Maybe a Mike Brew-ga-slow-ski?  Ohhhh, that doesn't work!/Come on, don't ruin it, yeah, that doesn't work.  It doesn't work, the name has to have a \"ski\" at the end of it. You just put \"brewski\" on the end of Martina Navratolova.        They did? What happened?  You know, if your leg got trapped under a rock, I'd chew it off to get you free.  I sure would. Is that cannibalism?  Oh yeah, no, I don't swallow.  It's not true, I'm a fuckin' classy broad.  You kiddin' me? Four years we been going out, I'm takin' you to the best place in town. I been crappin' out room for it for two days, I know exactly what I'm gonna order.  And you get to pick any bottle of wine.  Any bottle of 2012 wine.  They are in and they. Are. Fresh.  I love you.  Ah, come on!  I am not.    Actually, could you wrap just this up for me? I wanna scare the shit outta somebody.  Yeah, but I read at a six year-old level.  It's a special night. We've been dating for four years. And hey, all those rich black people can't be wrong, right?  (affectionately taking her  Oh my god, are you okay? Oh god, I'm so sorry!  Oh Jesus, I'm so so sorry! I didn't see you! It was an accident!  Did you hurt your head?  Oh, man. Here, let me get you some ice.  Sorry. Does it hurt?   I'm... I'm John.  Octopussy.  But does that show that I care about you, or I care about Roger Moore?  Thank you. And by the way, my dancing was not that bad.  I had some cool moves.  That's not how I remember it.  Hey, here's to four more years, huh?  Now I know we said no gifts, but--  --But, I got you something anyway, in clear violation of the \"no gift\" rule.  Lori, I've wanted to give this to you for a long time.  Those are the ones you liked, right? From that kiosk at the mall?  Check out the card.  See, I even wrote the words with different colored markers so you wouldn't get bored while you were reading it.    Yeah, I mean his was analog, but this is so awesome, I love it!  Y'know, Lori... Someday, there's gonna be a ring in there. But I wanna wait `til I can get you something really special, y'know? I just don't have the money right now.  I know, but it's important to me that you have the engagement ring you deserve. And what with the credit bubble... the Supreme Court... I mean, look at Haiti.  Oh, Jesus, here we go--  Look, can we talk about this another time, and just enjoy our anniversary dinner?  (rolling his eyes with a  I love you, too. You know that.  Not only will I not leave you, it's gonna be even better. `Cause I can have sex with you, and press your arm fat against a comic book so I can see it backwards.  I can do it all with one hand.  I can write a novel. Maybe a bestseller.  Well, I hope these jokes have distracted you from the actual problems in our relationship.  I dunno, I got a lotta fuckin' jokes.        Oh, yeah...  No, it's from The Notebook.        Who lives here? I'm comin' to get whoever lives here! You owe me lobster money!  Found my phone.  What's goin' on?  Is that a shit?  Yeah.  Ted... you gotta move out.  It's... it's gotta happen.  Ted, my relationship is at a very delicate stage, and, y'know, Lori and I may just need a little space right now. Plus a hooker took a shit in our apartment.     Aaaa, what?!  Don't tell me, I don't wanna hear about it! Did you get it?  Tell me when you get it!  AAAAA! You can never cook with that hand again! I'm serious, learn to cook other- handed!  I'll get the next one, okay?   Yes. But, that doesn't mean we can't hang out. We'll hang out all the time!  I know. Fuck. I just don't know what to do here. I know it sucks, but otherwise I'm gonna lose her. And I do love her, Ted.  I'll help you get on your feet out there, I promise.  Fuck, all the time.  That was the-- the thing-- The old-- Yeah-- no, I know- that doesn't mean-- I'm not - gay.  We've got to get you a job.  No, you don't. You look dapper.  Look, I know it sucks, but you gotta make some money so you can pay for an apartment.  Well, you have no skills.  As I said, you would need a law degree from a law school.  Look, you get the job, and we'll celebrate after.  Probably, yes.   Oh. Um, thank you.  Huh? / Excuse me?   I'm sorry, little guy, but my bear isn't for sale. I've had him since I was about your age. He's very special to me.    Okay. Will do. Here it goes, in the really important pocket for really important stuff.  Oh man, I can totally see him just taking you down to the basement and really slowly de-limbing you while singing some creepy Victorian nursery rhyme.   Well... I guess this is it, huh?  First night on your own.  Okay... so... if you need anything...  Seriously, anything...       Hey.  Hey, anything for you. This is all part of the new grown up, adult John Bennett. So, get used to him.  (guiding her down onto the  Most guys don't have you to motivate `em.  No, you were right! Look, the reason I love you so much is the same reason I guess I take you for granted sometimes. It's `cause you're... inevitable.  No, what I mean is, there's just no version of this universe where you and I don't end up together. You're inevitable.  But do you get what I'm saying?  Oh, I'm all right. Just... getting used to things, that's all.  Really?  Oh... yeah. So... I guess we both lost our furry little guy.  Hey, Ted.  I could probably swing by after work.  I can't just ditch work, man. Look, I'm trying to get my shit together and be an adult here, y'know? For Lori's sake.  Really?    You'll kick me out in five.  What do I tell Thomas?  I gotta duck out for a bit. Lori tried to break up a dog fight, and I guess she got hurt pretty bad.  Yeah, she's-- that's the way she is, she sees trouble, she tries to help out, and I guess one of these dogs clamped his jaws on her forearm, and he wouldn't let go until the fireman showed up and had to stick his finger in his ass.  Yeah, she's pretty shook up.  Yeah, that's how they--  Yeah.  Oh gosh, thank you, sir. I owe you one.  You know, he's exactly who you want him to be.  What is it?  That doesn't sound very mellow.  Y'know, this place looks great.  How are the neighbors?  That's lucky.  Sucks.  You?  No way, that's awesome. We should double date, you, me Lori and, what's her name?  Uh, Mandy?  Madison?  Britney, Tiffany, Candice?  Don't fuck with me on this. I know this shit.  Okay, Brandi, Heather, Channing, Breanna, Amber, Sabrina, Melody, Dakota, Sierra, Bambi, Crystal, Samantha, Autumn, Ruby, Taylor, Tara, Tamra, Tami, Lauren, Charlene, Chantel, Courtney, Misty, Jenna, Krista, Mindy, Noelle, Shelby, Trina, Reba, Cassandra, Nikki, Kelsey, Shawna, Jolene, Earline, Claudine, Savannah, Kasey, Dolly, Kendra, Carla, Chloe, Devon, Emmylou, Becky?  Okay, was it any one of those names with a Lynn after it?  Okay. Brandi-Lynn, Heather-Lynn--  Fuck!  Hey, well... it sounds like everything worked out then.   Lori's a senior VP at a big PR firm.  We do, we talk about you all the time.  Oh my god, remember, Ted, last week we were talking about... how... neat all of Lori's shoes are?  And we were saying like, a lot of women look like unsteady horses when they wear high heels, but Lori has a sort of... regal... trot.  Oh my god yes. You canter.  Whoa! Whoa! Whoa! / What the hell happened? We're havin' a friendly meal here!   Ooh! I hate that word.  That word is so sharp. It's like an electric sword, slashing everything in its path.  I... I'm trying to walk a line here, I want to be fair to you and to him, y'know?      Ohh...    It won't happen again, I promise.    Lori, look, I know--  Hey, Ted moved out, didn't he? I did that for you-- for us! And it wasn't easy.  Okay, look. I've been getting stoned too much. I know that. I've been bumming around with Ted too much, I know that, too. Give me one more chance, I promise I can fix it. Lori, I love you too much, please give me one more chance.  I know. Done. Man, right here in front of you. Look at these pecs. Man pecs. Look at the hair on my upper lip. Man hair. I just farted. Man fart.  You won't have to. Trust me. I love you.  Aw, sweetie, I love you so much! You won't be sorry, I swear.  Yeah, but I pushed it that way with my hand.  Yeah, me too. Is it cool if I kick your boss' ass? That won't affect your workplace chemistry, will it?  He's a bear.  Wow, cool.    That's inspiring. You've led a rich life.  Things are great, actually.  You know... Lori would hate me for saying this, but... she's told me how you are at the office, and... as one gentleman to another, I just wanna say I really hope you fucking get Lou Gehrig's disease.  Well... that's good to hear.  Okay.  Hey, Ted.  Why? What's going on?  What?!  Holy shit! How?    73  Fuck! I can't... I'm with Lori. I'm already on probation here.     I'm coming.  Rex. I gotta go. I'll be back in thirty minutes tops, but Lori cannot find out. She absolutely cannot know I was gone. If you can cover for me... we're cool on all that other stuff.  This is one man to another. I don't really know you, but I'm trusting you. As a man. This is serious. Can I trust you?      75   I... thank you for saving every one of us.  With you? Yes. Oh my god, yes.   Not... recently, no.  Holy shit.  All these people need to be talked to.  Italian.  What's the special on Tuesdays?  Chopped salad half price.  Yeah--wait, whaddaya mean?  Of course.  Well yeah--why wouldn't they be?  But why even bring that up--  Yeah, but why mention it?  So why are we talking about it?  Yes, let `em in.  Right.  Okay.      No no.  No, I don't sing in front of people!  Holy shit! / Ha! / Wow! / Etc.  AAA! AAA!! Break his arm, Flash! Cut his arm off!!  Dude, we're sorry! We're sorry!  Sam, no! Get off him!  Guy?  What??  Yeah. Yeah, I don't feel good.  Holy shit. Holy shit, oh my god!  I gotta-- I gotta go! Shit!  Lori... I...  Lori! Lori wait!  I'm sorry! I messed up! I--  Can I please just explain--  I was gonna--  I was gonna stop in for like five minutes, and then Flash Gordon--  Lori... please. I love you.  Fuck you! I don't want to talk to you!  Do you know what just happened? Do you have any clue? My life just ended.    Jesus, Lori was right. I should have stopped hanging out with you a long time ago. I'm never gonna have a life with you around. I'm 35 years old and I'm going nowhere. All I do is smoke pot and watch movies with a teddy fucking bear. And because of that, I just lost the love of my life.  I just... I gotta be on my own, Ted. I can't see you anymore.                    Who is it?  Go away.   Jesus Christ!  What?  You're un-fucking-believable, you know that? How stupid do you think I am? First of all, Lori would never go out with Rex, and second of all, if you think that by making shit like that up you're gonna make me choose some kind of loyalty to you over her--  Get outta here.  What? I'm acting like a cock?  Huh?  Oh, and you can?  Oh, yeah? Is that why you've manipulated me for years to stay eternally eight years old at the expense of the rest of my life?  You can't stand there and tell me you haven't always seen Lori as a threat to our friendship! It works out so much better for you when you and I are getting fucked up on the couch at 9 am, doesn't it?    Teddy... Rux-fucking-pin.  AAAAAA!!! Fucking Jesus fucking Christ! god fucking dammit!!!  My dick is in the TV.  So am I, man.  I love you, too.  There is no putting things right. She hates me.  Ted, we crushed its rib cage and blew out its lungs trying to give it CPR. It died.   Yes ma'am. Thank you for the opportunity, Ms.-- Ma'am Jones.  Uh, hi. Um... This is for Lori Collins. Because I love her. This song always reminds me of the most important night of my life. The night we met. It's the theme song from the movie \"Octopussy.\"              Lori! What-- what are you doing here?  Good, good. I've, uh... made myself a nice little home at the Midtown Hotel up the street. I'd show you around, but it's kinda classy. They require an undershirt and at least one visible cold sore for all customers.  Uh, yeah.  So, work's good? Everything good there?  How's Rex?  Oh. Good. Well... I guess we can't make small talk all day, so I'll say what I wanna say. I could sit here and tell you I'm sorry, it was a huge misunderstanding, and I'm ready to change. But I don't think you wanna hear any of that crap. I'm not gonna try and get you to take me back. Why would you? I've been a really shitty boyfriend for the last four years. I don't deserve you. I didn't take our relationship seriously, even though I love you more than life itself. All I want is... just to end on good terms. Because I owe that to you. I want you to be happy... and for us to be friends.  Well. That's pretty much it.  Hey.  Oh, I'll be okay. If I get raped, it'll be my fault with what I'm wearing.  Go ahead.  Whoever this is, it's not a good time.  Ted?  Listen, I gotta call you back.  What do you mean, what kinda trouble?  What?  Wait, slow down! Where are you?    I don't know.  I don't know, but he's in trouble.  No, it's blocked-- wait a second.  Go! Take Columbus to Herald and get on the expressway!  It's this creepy fucked-up guy who wants Ted for his creepy fucked-up son. They got him somehow.  Shoot up 99!      114  Come on, we're losing him!  Get closer!  Easy...   Yes! Fuckin' A right!    Sorry, someone had to go Joan Crawford on that kid. Come on!  Oh Jesus... Stay here.   Ted!  Lori, get the stuffing! Get it all!  You're gonna be okay, buddy. you understand? You're gonna be fine.  No, look at me, buddy. I promise, you're gonna be okay.  What is it?         Just try. Please. Just try.                     Ted!  Oh my god!  You're back!  You asshole!  It... it was you. You did it. (cover this line with addition:) It was your wish.  Oh my god, do you know how awesome it was punching a kid? I felt so powerful! I mean if that's what it's like to hit a woman, watch out, I liked it.  I love you, too. And, I want you to know that... I'm probably never gonna be any more than a guy who rents cars, but... I don't care. You're the only thing that matters in my life.  You and Ted.  And after last night, I... I don't ever want to lose anyone who matters to me ever again. I'm not gonna wait any longer for my life to start. Lori... will you marry me?",
        "Bennett": "",
        "Frank": "So. You think you got what it takes?   No one's ever talked to me like that before. You're hired.  What the hell?  There's supposed to be three registers open, for god's sake!     You had sexual intercourse with a coworker in a storeroom filled with produce that we sell to the public."
    },
    "imdb_rating": "6.9",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTQ1OTU0ODcxMV5BMl5BanBnXkFtZTcwOTMxNTUwOA@@._V1_QL75_UX380_CR0,20,380,562_.jpg",
    "description": "John makes a Christmas miracle happen by bringing his one and only friend to life, his teddy bear. The two grow up together and John must then choose to stay with his girlfriend or keep his friendship with his crude and extremely inappropriate teddy bear, Ted.Anonymous",
    "name": "Ted",
    "genres": [
        "Comedy"
    ]
}