{
    "filename": "American-President,-The_script.txt",
    "imdb_id": "tt0112346",
    "imdb_url": "https://www.imdb.com/title/tt0112346",
    "characters": [
        "Esther MacInerney",
        "Beth Wade",
        "Lewis Rothschild",
        "Robin McCall",
        "Lucy Shepherd",
        "Mrs. Chapil",
        "Senator Rumson",
        "Sydney Ellen Wade",
        "Susan Sloan",
        "Agent Cooper",
        "David",
        "A.J. MacInerney",
        "Andrew Shepherd",
        "Leon Kodak",
        "Janie Basdin"
    ],
    "dialogues": {
        "Esther": "Sydney, the President told me about how you two met. I think it's priceless.   Men like being insulted by women. It makes them feel loved. Don't ask me why.   Latin.   No, Latin.    holding hands smiling as they watch their old friend, and we",
        "MacInerney": "holding hands smiling as they watch their old friend, and we",
        "Beth": "A few suitcases and two or three moving cartons serve as evidence that SYDNEY's staying with her sister BETH temporarily.  BETH, still in hospital scrubs from a 12-hour shift, opens a bottle of wine while SYDNEY, in a bathrobe and wet hair, tries to get off the phone.   Tell him the part about walking out the wrong door.   I wanna hear it.   If he thinks you're a jerk, I'm sure he thinks you're a first-rate jerk.   And then you walked out the wrong door.   That's my current plan, yes.  The TELEPHONE RINGS...    as the PHONE RINGS.   You want me to deal with him?    SYDNEY's still holding the phone and seems a little confused...an emotion which is about to be replaced by horror as the unbelievable into the reality.   What's going on?   This box just says \"Miscellaneous.\" Is this bedroom miscellaneous or kitchen miscellaneous?   Sydney?   You kissed him?   You didn't' tell me that.   Where?    Where in the White House?!   The dish room?   Then what happened?   It's always something.   In what language?! Sydney, this man is the leader of the free world. He's brilliant, he's funny, he's handsome, and he's an above-average dancer. Isn't it possible our standards are just a tad high?  The PHONE RINGS--  SYDNEY freezes.  The PHONE RINGS again.    Answer the phone.   Answer the phone.   Answer the phone.   Answer the phone.   I can't believe I'm loaning you clothes. I thought you owned every piece of clothing there was.   Go ahead, try it on. I brought earrings, too.  The PHONE RINGS. SYDNEY answers it--",
        "Wade": "",
        "Lewis": "You skipped the whole paragraph.   \"American can no longer afford to pretend that they live in a great society\"...and then nothing. You dumped the whole handguns paragraph.   That was the kick-ass section.  The three of them are now OUTSIDE and making their way down the COVERED WALKWAY that runs from the East Wing to the West Wing.   Sir, of course I didn't mean to imply--   That's great news, sir, but...  They walk past a GROUNDKEEPER who's at work at a patch of grass.   Sir, the press is gonna need an explanation.   Because you dropped the whole kick-ass section, now we've got this thing hanging out there.   \"Americans can no longer afford to pretend that they live in a great society.\" Then ...nothing. No explanation. No context. So now it's just this thing.   Yes, sir.  SHEPHERD stops at an open doorway, calls to a STAFFER--   Mr. President, I really feel we need to focus on...   I don't drink coffee.    He dumped a whole section.   See?   What they want is a 20 percent reduction in fossil fuel emissions.   We haven't really tried.   Hang on, are we not--   Are we not putting back the handgun restrictions?!   Sir, we campaigned on this issue. Now, I understand we took it out when we were in the low forties, but we can push it through now.   Sir, we may never have an opportunity like this again. Let's take this 63 percent out for a spin and see what it can do.   Can I just say, to return to the subject for one moment, that it might be easier to fight a war on drugs if we weren't arming drug dealers.  SHEPHERD responds a little too quickly -- we see a spark of a temper.   Yes, sir.   What did you tell him?   We've got Jarrett.   George Jarrett. He's ours. Solid \"yes.\"   I wish I could take credit. He just said, \"Lewis, I support the President a hundred percent .\" Not the bill, the President.   We're gonna win this in a walk. It's like a kissing booth at a carnival. Give us a vote, get a photo-op with number 63.  LEWIS reaches to the tote board and pulls the \"17\" off, revealing \"16.\"   We should have gone after the handguns.   We don't have time to do one thing at a time.    looking on from the back of the room.   They make a nice couple.   We've got troubles.   Who are we calling, sir?   Yes, sir.  LEWIS and ROBIN exit the Oval Office. SHEPHERD picks up the phone.   Janie?   What's the President doing?   Janie, I'm the President senior domestic policy advisor. It's important that I have a full understanding of--   There is no need to entertain that at this point.   We should have a consensus on how the White House is going to handle it.   General Rork says around O-Eight Hundred.   'Morning, Mr. President. Hi, Sydney.   They're camped out at every exit.   The press.   You shoulda taken a cab, Sydney.   How do we exit Sydney from the building and what do we say to the press at that point?   Can I state very clearly that I can't be party to anything illegal.   Say what you want, but it's always the guy in my job that ends up doing eighteen months in Danbury Minimum Security Prison.   Okay. Good. Now, the press statement.   We can't just leave it at that, sir.   But, sir...   We've got a small problem.   Robin sees it as a problem. I see it as a opportunity.    We caught it.   You've got 14 people working for you. Did any of them--   I'm sorry, sir. It's the evening news. It was buried as the third story--   Sydney was at a protest rally where they burned a flag.   About 13 years ago.   See, I think it's important, when we deal with it, that we--   Excuse me?   I'm not sure that's the wisest--   I tell any girl I'm going out with to assume that all plans are soft until she receives confirmation 30 minutes beforehand.   Well, I say it with a great deal of charm.  SHEPHERD sees something out the window and gets excited.   What?   Here?!   No, he's not hopping. Sir, no hopping. Stay in the car. I'll get the flowers.   Let the agents do a security sweep. We don't know who's in there.   It's possible.  SHEPHERD hops out of the car. AGENT COOPER trails after him.   Hell, I question it all the time.   Mood swings? Nineteen post-graduate degrees in mathematics and you explain going from a 63 to a 46 percent approval rating in 5 weeks on mood swings?    It's Christmas?   I'm hearing rumors that your boss is wavering on the crime bill.   That's what I wanted to hear.   Congressman, it was our understanding  that we had your support.   Congressman, the assault weapons are gone.   The well is drying up. The President's gotta make a move or we're gonna die fast and quiet.   And we put Sydney in the new model?  A.J. hesitates.    A.J., it's meaningless unless we ask him about Sydney.    You're supposed to be a United States Congressman, for the love of Christ.  ROBIN and KODAK appear in the doorway, sensing a surprise development. LEWIS is losing it on the phone.    But you're not gonna stay at 41. The numbers are gonna be go back up.  But they're gonna go back up.  George...  Congressman...  Congressman Jarrett...  George, it's crunch time. It's personal. This is one of those moments. It's just you and the President. Now that's it gonna be?  LEWIS looks over at ROBIN and KODAK ...his face telling the story.    Yeah.  Yeah.  Hey, George? Can I tell you something? We're gonna win this thing. We're gonna get the votes and we're gonna win. And after we do, I mean that very night, I'm gonna go to Sam &amp; Harry's, I'm gonna order a big steak, and I'm gonna make a list of everybody who tried to fuck us this week.  ROBIN and KODAK are trying to get their friend from setting fire to a bridge out of pure frustration.    Vote your conscience, you chicken- shit, lame-ass--  LEWIS hangs up the phone. He takes a deep breath, slumps down in the nearest chair, and looks up at ROBIN and KODAK.  There's a long silence before LEWIS says--    We lost Jarrett.    Karen, it's Lewis. Could you hunt down Congressman Quincy for me. I need to talk to him right way.   He thinks your numbers aren't likely to rebound.   She? You meant \"it,\" didn't you, sir? You meant the \"important legislation\" deserves every opportunity.   Respectfully, sir. I think we should examine the new poll for more than its value as a box score.   It's not that simple, sir. I think this poll helps bribg a murky problem into specific relief.   Mr. President, two hundred and sixty- four million people don't give a damn about your life. They give a damn about their own.   Mr. President, you've raised a daughter almost entirely on your own, and she's terrific. What does it say to you that in the last seven weeks, 59 percent of this country has begun to question your family values?   Oh yes, he does, A.J.  I'm a citizen, this is my president, and in this country it is not only permissible to question our leaders, it is our responsibility. But you already know that, Mr. President, because you have a deeper love of this country than any man I've ever known, and I want to know what it says to you that in the past seven weeks 59 percent of Americans have begun to question your patriotism?   They don't have a choice! Rob Rumson's the only one doing the talking. People want leadership. And in the absence of genuine leadership, they will listen to anyone who steps up to the microphone. They want leadership, Mr. President. They're so thirsty for it, they'll crawl through the desert toward a mirage, and when they discover there's no water, they'll drink the sand.   He's got the whole White House Press Corps asking each other how to spell \"erudite.\"   I know. Gotta rewrite the State of the Union.   Oh, good. I thought I was gonna be rushed.  LEWIS goes off in one direction. A.J. heads towards the Oval Office.    Mr. President, I thought you might want to look at this. I moved Social Security up front. Hello, Sydney.  JANIE enters--   Sir.   I know sir, I'm sorry.   That's kind of you, sir, but I realize I've been a little insensitive about some personal...   Just so you know I've never been one of them, Mr. President.",
        "Rothschild": "",
        "Robin": "I didn't truly appreciate it until I came back and discovered that America isn't a great society.   Not a great society, sir?   There's a press room full of people saying \"What did he mean by that?\"   Are they blaming the President for global warming?   Can I tell my morning press gaggle that gun control--   Got it.    David Sasser from the Times called and wanted to know what the White House felt was a great society.   I told him I couldn't speak for the President, but for my money: Bermuda.   You gonna go stag?   No. We've never gone wrong parading you around as the lonely widower.  The words came out casually, but they instantly freeze everyone.    My God.  I can't believe I said that.  Mr. President, that was an incredibly thoughtless remark. I would never dream of insulting you or the memory of your wife.   Mr. President--    looking on from the back of the room.   Lovely.   Huge.  As PEOPLE start onto dance floor, we   Mr. President, we need five minutes before scheduling if you can spare it.   Does this have something to do with Sydney Wade?   Sir, they're gonna be pressing today about whether the White House is prepared to soften the assault weapons section of the crime bill.   How do you want me to handle the Sydney issue?   Sir, what do you think about a national address?   Last question.   That was my fault, sir. We should have prepped you for that.   \"Newsweek\" is begging for ten minutes today. Any ten minutes you got.   Good morning, Mr. President. Hi, Sydney. I came over as soon as Lewis called.   I think the important thing is not to make it look like we're panicking.   We need a diversion.   You understand that by diversion I'm not saying we set the White House on fire.   No diversion.   No comment?    Sir...    It could've been a small problem. It's now at the very least a medium- sized--   It could've been an opportunity if we'd caught it...   At 5:45. Five-forty-five doesn't do me any good, Lewis. Five-forty-five, network news is in makeup.   --It's got a bullet.   Outside the Department of Commerce. Anti-apartheid.   See, it's already distracting you. Why don't you let A.J. and Lewis--   And they find this romantic?   Now?!   It's not what men do. I know no men who do that.    No reaction from the White House.  SHEPHERD's off in a corner, talking on the phone. The Presidential Suite has been turned into the St. Louis Oval Office for the night as STAFFERS zigzag around room service tables during the late-night preparations.   Fellas, we haven't slept in three years. Can't we forget work for one night and take this moment to enjoy each other as friends? It's Christmas.    How're the numbers?   How bad?   Who is Lewis on with?    Lewis!   The press is expecting an announcement on the crime bill by the Sate of the Union.    And we declare victory, sir.   Good morning, Mr. President.  SHEPHERD takes the podium. There's a palpable BUZZ in the room as video operators adjust their equipment, etc. People starts to stand.    who's picked up the receiver from a wall phone and punches in four numbers.  She turns in to the wall to shield her conversation from the rest of the room.    Lewis...call A.J. and come on down here...I don't know, but something's happening.   Any questions?   Mr. President, they're waiting for you.    This way, people. Let's go.",
        "McCall": "",
        "Lucy": "LUCY, Shepherd's 12-year-old daughter, stops playing.   Scales.   Are my lips swollen?   Yeah.   Whatcha got behind your back?   Is it a dirt bike?   Is it a really old seventh-grade textbook of yours that you're gonna make me read cover to cover and discuss at dinner and drive me crazy with?    \"Understanding the Constitution.\"   You talked to Mr. Linder?   I like it fine, Dad.   I don't know what to say, Dad. I guess I'm just not...I don't know.    \"Property of Gilmore Junior High School.\"    \"We, the People, of the United States, in order to form a more perfect union...\"   I can't wait.   Do you see it as part of your job to torture me?   It's supposed to be tight. It's supposed to make you look regal.   All done.  He looks in the mirror.   Social studies.   I don't know...I just guess...   Yeah.   It's totally okay.   Dad, it's cool. Go for it.   You'll be fine. Just be yourself.   And compliment her shoes.   Girls like that.   Are you Ms. Wade?   Lucy Shepherd.   My dad told me to tell you he's on the phone with his dentist and that I should behave myself and entertain you till he gets here.   No. He told me to tell you he's on the phone with his dentist. He wants you to think he's a regular guy.   The Prime Minister of Israel.   No. They're talking about that abbreviation I can never remember.   Yeah.   Right.  SHEPHERD enters.   Can we eat?   Dad--    This is a nightmare. This is a social studies nightmare.   G'night, Dad.   It was nice meeting you, Mrs.--   It was nice meeting you, Sydney.   I love you, too.  LUCY leaves. SHEPHERD and SYDNEY are alone now.    Lucy is giving a little trombone recital for SHEPHERD and SYDNEY. SYDNEY cheers madly at the end of the piece, giving Lucy a big hug for her effort.   I honestly don't know.    SHEPHERD pops his head in.   It's progressive.   Hey, Dad, what's wrong with Sydney? You guys have a fight?   She seemed pretty--   She's here.   In your room. Why is she mad?   Were you a dork?   If you were a dork, you should say you're sorry. Girls like that.   This is oatmeal.   We never have oatmeal.   I'm from Wisconsin. I need food.   We're done.   We ratified it last week.   It's not a big deal, Dad.   Dad, I'm perfectly--   Damnit, Dad!   You know--   Look--  LUCY winds herself up. It would appear she's about to burst. She's about to say the hardest thing she's ever had to say in her life--    --sometimes when you talk, you say things I disagree with.  SHEPHERD is stunned and totally confused...   I mean politically.   Yes.   Yes. Okay. Yes. Sometimes, I mean, I'm not sure. You know a lot more than I do -- but still, I have these feelings, and I don't think they're wrong. Like, okay, for instance, I'm not so sure it's all right to burn a flag. I mean, it really bothers a lot of people, and I don't know why you think it's okay. I hear Senator Rumson talk, and some of the things he says sounds right to me, and I think, \"God, am I like Bob Rumson?! I mean, Dad thinks he's a jerk. Dad hates this guy! Why am I agreeing with him\" And then I think, \"Well, maybe I'm not really like Bob Rumson, but maybe I'm not like Dad either.\" But the point is I'm the President's kid, and people pay attention to what I say, and if I say something different from what you say, it'll be embarrassing for you. So I can't just get up in social studies class and say whatever I want.  SHEPHERD is silent...totally blown away...he had absolutely no idea...  He stands up slowly and moves toward her...LUCY doesn't know what's coming...   What's that?   Dad, is everything all right?   Hold still.  ROBIN steps in.   All done.   Article 2, Section 3, of the U.S. Constitution. Executive Powers.  \"He shall, from time to time, give to the Congress information of the State of the Union, and recommend to their consideration such measures as he shall judge necessary and expedient.\"",
        "Shepherd": "SHEPHERD's walking with his personal assistant, JANIE, a shy, professional and incredibly efficient 25-year-old.    The 10:15 is American Fisheries?   Janie, make a note. We need to schedule more events where somebody gives me a really big fish.  JANIE starts to make a note.   Janie, I was kidding.          (to the AGENT at the         elevator Hey, Cooper.   Is he upset about the speech last night?   Well, it wouldn't be a Monday morning unless Lewis was concerned about something I did Sunday night.  The elevator doors open, revealing LEWIS ROTHSCHILD. At 32, LEWIS is the President's chief domestic policy advisor. It would appear that he averages about two hours sleep a night, though that doesn't seem to slow him down.    And Monday morning it is.  LEWIS falls into the pace as the three of them head for the double doors leading to the South Lawn.   This is a time for prudence, Lewis.   I thought what with being the President and all...   I thought you'd be turning cartwheels this morning, Lewis -- 63 percent job approval.   'Morning, Charlie.   For what?  SHEPHERD, LEWIS and JANIE walk through the door being held open by an AGENT. The conversation continues as they make their way through the corridors of    There's a thing hanging out there?   And it's hanging out there?   Maria--   Did they tell you I'm gonna need--   Thanks.  SHEPHERD moves on. LEWIS and JANIE stay with him.   Lewis, however much coffee you drink in the morning, I want you to reduce it by half.   Then hit yourself over the head with a baseball bat, would you please?  Another STAFFER crosses their path--   Hey, Laura, happy birthday.    I should send her some flowers.   How're you, Mrs. Chapil?   Sixty-three percent of it, at any rate.  And by now they're in the OVAL OFFICE itself. SHEPHERD has gone to his desk and is looking over the various overnight briefing memos that have been left for him. As someone used to doing six things at once, he has no trouble reading, listening, and talking at the same time.    What time does she get home today?   How's my afternoon look?   Schedule some time for me at 3:30.   Too-tall McCall, how was Mexico?   Now there's a thing hanging out there.   Well, with you out of the country, it wasn't, Robin. Now that you're back, we're great again.      (re: a memo he's been     looking at A.J., did you get one of these?  This is said to A. J. MACINERNEY as he walks through a separate entrance on the left side of the room. In addition to being the President's Chief of Staff and closest advisor, he's the President's closest and oldest friend.   It would appear to be a letter from the entire environmental community. These people are outta control.   Talk to the GDC again, A.J. Tell them the President resents the implication that he's turned his back on the environment. Tell them I'll send 455 to the floor. But we're gonna ask for a 10 percent reduction. If they want to pull their support, fine. At 63 percent job approval rating. I don't need their help getting a bill passed. We gotta get going-- where's Leon?   You all right?   Okay. First, I wanted to say congratulations. Three years ago, we were elected to the White House by one of the narrowest margins in history, and today Kodak tells us 63 percent of registered voters think we're doing a good job.   But the poll also tells us what we already knew: We don't get this crime bill of ours through Congress and these numbers are gonna be a memory. So, starting today, we're shifting it into gear.   After the elections.   We can't take it out for a spin, Lewis. We need it to get re-elected. For reasons passing understanding, people do not relate guns to gun-related crime.   Lewis, we've gotta fight the fights we can win.   Eighteen votes in 72 days. Thank you, everyone. Janie, what's next?   Try it like this and lose that.   Perfect.  JANIE steps in--   That's too bad. Remind me to give her a call later.   That's not a problem.   That's okay, forget it.  What time is it?   I'm gonna go over and say hi to Lucy.   Robin, don't worry about it.   No, keep going. I liked what you were playing? What's it called?   Well... you play it with gusto!   Are they supposed to be?   Then you're doing fine.   A little gift.   Nope.  He hands her an old textbook ...   I'm not comfortable with the \"really old\" part, but everything else you said was true.   Your social studies teacher said your class would be starting on the Constitution this week.   Yes. It's called a Parent-Teacher Conference. Mr. Linder and I were the key player in that discussion. Why don't you like social studies, Luce?   All your other teachers say you're happy, you're enthusiastic, you've always got your hand up...Mr. Linder says you don't participate unless he calls on you, and even then it's a one-word answer.   Luce, take a look at this book. This is exciting stuff. It's about who we are and what we want. Read what it says on the first page.   The next page.   See? Grabs you right off the bat. It's a page-turner.   Good, 'cause it's possible the subject might come up at dinner tonight.   No, it's just one of the perks. See you tonight.  He gives her a kiss on the head and heads out the door. Behind him, he hears Lucy's rendition of \"Hail to the Chief.\" SHEPHERD shoots her a look as we   Okay. Let's move on it. Thank you, gentlemen.  SHEPHERD and A.J. leave the Cabinet Room amidst a volley of \"good-bye\" 's and \"Thank you, Mr. President\"'s. They pass MRS. CHAPIL and JANIE.    Have a good evening, Mrs. Chapil.   I'll see you in the morning, Janie.   It's about time.   Maybe we should try to steal her. Ten percent, A.J. Don't let them leave the room till they're clear about that.   Mention it to Janie.   Then let's clear this off the table and get everybody focused on the crime bill. I don't want to win this. I want to win it by a couple of touchdowns.   Good.  A.J. starts to leave. SHEPHERD stops him.     Listen, Robin said something to me today that I'm sure she wouldn't have said it if...I mean, she wasn't saying it to me, I realize...  Ah, never mind. Have a good night.   A.J., when we're out of the office and we're alone, you can call me Andy.   I mean you were the best man at my wedding, for crying out loud. Call me Andy.   Good night, A.J.  SHEPHERD enters the White House.   The day the government starts subsidizing private schools is the day we give up on public education.   We're already doing the least we can do, but I can't think of anything better, so we'll go with this for now.  Jerry, say hello to Linda for me. And if I don't see you again, have a good Thanksgiving.   How're we doing?   Ahead?    Janie, this is unprecedented. I don't know what to do with myself.   The GDC meeting. Right.   Couldn't be better.  I apologize for the interruption, but A.J. asked me to stop and say hello. You wouldn't be Sydney Ellen Wade, by any chance, would you?   All evidence to the contrary.   Sydney?   You got a second?   I thought maybe we might have a word in private. Someplace a little less intimidating.  Janie?    This is my personal assistant, Janie Basdin. Janie, would you show Ms. Wade into the rec room. I'll be there in a second.  SHEPHERD enters a doorway off of the hall. SYDNEY continues down the hallway.   Sorry to keep you waiting.   Is it okay if I call you Sydney?   Have you ever been in the Oval Office?   I hear it's pretty good.   Are you under the impression that I'm mad at you?   Sydney, seldom does a day go by that I'm not burned in effigy.   No, I'll give you that.   Did you know that when the City Planners sat down to design Washington, D.C., their intention was to build a city that would intimidate and humble foreign heads of state? It's true.   The White House has the single greatest home court advantage in the modern world.   Sydney, this bill is important to me.   But you don't believe me?   It's not gonna pass at 20 percent. It's a long shot at 10.   Sydney, at 20 percent, we are 34 votes shy in the House. It can't be done. But I tell you what. I'll make you a deal with you. If you can get 24 votes, I'll get you the last 10.   If you can swing 24 votes by the State of the Union, I'll promise you full White House support.   Absolutely. Listen, are you hungry? I skipped breakfast. You wanna have some coffee? A donut or something?   You can't do that, Sydney.   Well, if you go through that door, the United States Secret Service. That's my private office.    Should I meet with them?   Fine. 2 in the side.  SHEPHERD sends the two-ball flying into the corner pocket.   Nice shot, Mr. President? You won't call me by my name when we're playing pool.  A.J. assesses the table.   At ease, A.J., and get away from the pocket. 9 in the corner.  SHEPHERD makes the shot.   I forgot to tell you.   Not our time. GDC makes a big push for the votes, and when they come up short, we move in with the softer bill, to get passed, we're everybody's hero. 3 in the side.   Sydney Wade?   Did she say anything about me?   When she called.   No, it's just that we had a nice couple of minutes together. She threatened me and I patronized her and we didn't have anything to eat, but I thought there was a connection.  A.J. is staring at him in disbelief.   She didn't say anything about me?   Tell me this: Hypothetically, what would happen--   --if I called Sydney and asked her to be my date at the State Dinner Thursday night?   Don't I sound serious?   Why not? Jefferson did. Wilson did.   Wilson was widowed during his first term. He meets a woman named Edith Gault. He dated her, courted her, married her, and somewhere in there managed to form the League of Nations.   I don't want you to get me a girl, A.J. What is this, Vegas?   And I'm talking about something that in no way is at conflict with my oath of office. I'm a single adult, and I met a woman that I'd like to see again socially. How's that different from what Wilson did?   What are you saying?   How big?   Five points we're standing here talking about?!   I drop five points when Wisconsin doesn't make it to the Rose Bowl. 5 in the corner.   Yeah.  No. No. I don't want to check a polling sample to see if this is okay, like I'm asking permission to stay out an hour past curfew. This isn't the business of the American people.   I like her, A.J.  Stop being my chief of staff for one minute.    Janie!  She didn't say anything about me?   That's something.  JANIE enters--   I need you to track down a phone number.   Uh, hi, is this Sydney?  SYDNEY doesn't recognize the voice--   Uhh...this isn't Richard, it's Andrew Shepherd.    as SHEPHERD, undaunted, dials the number again.    This used to be easier.   Sydney?   Listen, do me a favor. Hang up the phone.   Hang up the phone. Then dial 456-1414. When you get the White House operator, give her your name and tell her you want to speak to the President.  SHEPHERD hangs up.    He's just opened a bottle of beer when the phone rings. He picks up the phone--   Hello.   It's my fault. I shouldn't have called you at home. Should I call you at the office tomorrow?    What did you mean when you said you don't have a phone.    How did I get the number. That's a reasonable question. I don't know. Probably the FBI.   You know who else is good at that?   Well, yeah, but I was thinking of the Internal Revenue Service. They have computer files that...Well...I should stop stalling. As I'm sure you know, the French have elected themselves a new president, and we're having a formal state dinner at the White House, and I was wondering -- and you're under no obligation at all -- but I thought it might be fun... I was wondering if you maybe wanted to go...with me, and uh... there it is. That's why I was calling.  There's a long silence on the phone.    Sydney? Sydney, Congress doesn't take this long to--    Sydney, this is just a dinner. We're not gonna be doing espionage or anything.   I'm gonna have a very nice woman named Marsha Bridgeport call you. She's the White House Social Director, and she'll help you with anything you want. Now when she calls you and tells you her name is Marsha Bridgeport, it'll help if you give her the benefit of the doubt.   I'll see you Thursday night.   Me too.  They hang up.    Lucy is standing behind her father, tying his bow tie.   That's a little tight, Luce.   Is it supposed to cut off the blood flow to my face?   Not bad. Where did you learn how to do this?   Very funny.  Really, where did you learn?   Sweetie, did Mom teach you how to do this?    Lucy, is this okay with you? My having dinner with a woman?   Are you sure? Because if you want to talk about it...   You know, I'm a little nervous.   Be myself.   Her shoes?   Sydney. Andrew Shepherd. We spoke on the phone.    Mr. President, would allow me to introduce Sydney Ellen Wade of the Commonwealth of Virginia. Sydney, this is President Rene-Jean D'Astier and his wife Monique Danielle D'Astier of France.   Sydney, it sounds like our table's ready.  SHEPHERD's guests make their way out of the residence, leaving SHEPHERD with SYDNEY and the FRENCH PRESIDENT and  Once we hit the bottom of the stairs, I gotta do a thing. You'll be escorted...    This is, actually, only our second State Dinner. The first was for the Emperor of Japan, who died shortly after that, so we stopped having them for a while, just in case.   Do I date a lot?   No. How 'bout you?   Then you're experienced at this.   How are we doing so far?   Damn. And I wanted to find a way to be different from the other guys.  A BOOMING VOICE over the P.A. announces--   By the way, nice shoes.  --SHEPHERD walks into the hall as the Brass and Percussion Ensemble plays HAIL TO THE CHIEF.  The 180 GUESTS come to their feet and applaud long and loud.  The GROUP following the President catches up to the spot where SYDNEY has stopped walking. They all join in the applause. We can see in SYDNEY's face that she's been quite swept up.    STEWARDS are clearing away the main course and refilling wine glasses.  In addition to the two main couples, and ESTHER MacINERNEY and TWO OTHER COUPLES are seated at the President's table.   They're hammered. Esther, do you speak French?   I thought you spoke French.   Great, next time Julius Caesar comes to town, you're our gal. Sydney, I don't suppose that you speak any--      (proudly to A.J. and     Esther That's my date.   Sydney, you didn't dissolve the NATO treaty, did you?   More beheadings at the White House?   I'm sure he would, but I have a better idea.  SHEPHERD stands, holds out his hand to SYDNEY.    Would you like to dance?     Arthur Murray. Six lessons.   First of all, the 200 pairs of eyes aren't focused on me. They're focused on you. And the answers are \"Sydney Ellen Wade\" and \"Because she said 'yes.'\"    Good morning, Mrs. Chapil.   Fine. Janie, can you get me the number of a local florist?   I want to do it myself. I just need the phone number.   I want the phone number of a florist.   Yeah.   I want to send some flowers, Janie. I want to do it myself. I don't want to staff it out, and I don't want to issue an Executive Order. I just want a phone number.   Thank you.  He heads into the office.    I just need two minutes to make a call and I'll be right with you.  JANIE enters and hands SHEPHERD a piece of paper.    Thank you, Janie.  She exits.   I'm calling the Organization of the United Brotherhood of It's-None-of- Your-Damn-Business, Lewis. I'll be with you in a minute.    Yeah, good morning. How do I get an outside line? Really? That's simple. Thank you.  SHEPHERD dials the phone number JANIE's given him.      Tell me something. What is the state flower of Virginia?      Is there someone else there who might know?  No, I'm not trying to five you a hard time, I was--hold on please.     Janie, what's the state flower of Virginia?      Thank you.  It's the dogwood.  What? Hold on please.    (to JANIE, through     intercom Janie, the dogwood is a tree, not a flower.    The dogwood is both a tree and a flower. I'd like a dozen, please. Really? No dogwoods? How 'bout roses? Simple. Classic. Two dozen roses.   Janie! Do you have any idea where my credit cards might be?     Ah.  Listen, what might be better is if you just bill me for the flowers. I'm sure it'll be okay with your boss. Well, I don't know if you recognize my voice, but this is the President.  The United States.  Hello, hello...   The Sydney issue?   I sure hope the Sydney issue refers in some way to a problem we're having with Australia, because if it's anything else...  JANIE pokes her head in.   Tell her she can come right in. I'm finished here.    There is no Sydney issue.  SYDNEY enters, crossing paths with LEWIS and ROBIN. They exchange pleasantries.   No problem. Did you get the ham?   I wanted to send you flowers, but there seem to be some kinks in the system. I'm really glad you stopped by. I had such a good time last night.   I'm delivering a luncheon speech at the Governor's Conference this morning. I'm sorry to--   Are you free for dinner tomorrow night?   Casual. In the Residence. Without the United Nations. My daughter'll be with us, so it may seem like the United--      (reading to himself    as he talks SYDNEY She's gonna like you.  Excuse me -- Jeff!    I can't do this.   Either one. I have to be in and out.   Stackhouse wants to talk about grazing rights. Trust me.    Sorry. You have concerns.   Does it having anything to do with one of us being the President?   I am not mocking you, honest. I'm just a guy asking a girl over for a meal.  And, as if from out of nowhere, a LOUD CLAAAMMERING, like the sound of a jackhammer against cement, comes from somewhere outside -- growing louder and closer --   My ride's here.  And, sure enough, coming into view outside the windows of the Oval Office, is MARINE-1, the President's helicopter. JANIE comes back in and helps him on with his coat and scarf.   Yeah, well, when you put it that way, it doesn't sound that great to me either.   Have dinner with Lucy and me. It's meat loaf night -- how presidential can it be?  As SHEPHERD rushes out...    Seven-thirty.  SYDNEY now stands alone in the OVAL OFFICE, trying to figure out what just happened.   Let meat loaf night begin.   My teeth?   Oh, right. I've got a cavity in my upper bicuspid region.    You turned on me.   She's not having any fun, though.   They're doing a mock Congress. Each kid is playing one of the original delegates, and they debate the Amendments. Now what's not fun about that?  LUCY gets up from the table and kisses her father.   G'night, sweetheart.   Sleep well, honey. I love you.   She's her mother.   Would you like the 25-cent tour?   It was ready ahead of schedule. We've just been waiting for the personnel.   No, our guys. We've sent a team of Army instructors to train the Israelis.  SYDNEY and SHEPHERD enter the:     I think this is the dish room.   Yeah, it is. It's the room with all the dishes.   I'm more of a West Wing President. If you're curious about the mansion, there's probably a book you can get--   Sydney.   Do you think there will ever come a time when you can stand in a room with me and not think of me as the President?   I got news for you, Sydney. As a lobbyist, you would never be alone in a room with the President.  This last statement is not lost on SYDNEY.  He moves toward her until they are both bathed in the moonlight. He puts his arms around her.   Probably not.  They lean in to kiss each other. They barely make contact when...   Excuse me.  He moves out the door and into the corridor.  SYDNEY, knowing something's wrong, instinctively moves to follow him and be with him, but the AGENT hasn't moved from the doorway, so--   Listen--   I'm sorry, we're going to have to cut our evening short. The Libyans have just bombed C-STAD. I'll try to call you tomorrow.  Can you show Ms. Wade out.  SHEPHERD exits.  SYDNEY, alone for a second in the dish room, is finally approached by a SECRET SERVICE AGENT, who starts to escort her out.   And we're gonna hit Libyan Intelligence Headquarters?   Libyan I.H.Q's in the middle of downtown Tripoli -- are we gonna hit anything else?   Are we gonna miss?   How many people work in that building?   How many people work in the damn building?   The fewest. What shift puts the fewest people in the building? The night shift, right?   What time does the night crew go on?    Someday somebody's going to have to explain to me the virtue of a proportional response.  There's a SILENCE. SHEPHERD gets up and starts to head out the door.   Attack.  The last thing I want to do is put the Lybians center stage.   This isn't about Rumson. What I did tonight was not about political gain.   Leon, somewhere in Libyan right now there's a janitor working the night shift at the Libyan Intelligence Headquarters. He's going about his job 'cause he has no idea that in about an hour he's gonna die in a massive explosion. He's just going about his job 'cause he has no idea that an hour ago I gave an order to have him killed. You just saw me do the least presidential thing I do.   No. We did everything but show them the blueprints. The hardware was sitting in a airplane hangar for a month. They didn't hit it until the  American personnel got there. Leslie.   Yes, we'd just finished dinner.   We don't have a relationship. We just had dinner.   Folks, a lot of people got killed last night. Let's try to keep our eyes on the ball, okay?  SHEPHERD is herded out of the briefing room amidst a chorus of \"Mr. President\" 's.   There's nothing that needs prepping. A.J., let's meet with the leadership after we meet with the Security Council.   Nobody gets ten minutes today.    SHEPHERD sits at his desk, is on the phone. A TELEVISION NEWSCAST is doing a report on Congressional reaction to the events of the day. ROB RUMSON is talking.   Lewis, tell the speaker to wait. I want to talk to him. No, I'll be right down.   I went to Stanford, you blowhole.    SHEPHERD opens his door, revealing SYDNEY. Agent COOPER is letting her in.    Thanks, Coop.  SHEPHERD closes the door.   Not as tough as some. You want a drink? Lemme take your coat.  But SYDNEY doesn't take her coat off.   Sure it will. You button the top button, and it doesn't fall off the hanger.    I didn't think so. Listen...   Well, I have no intention of pursuing you inside the political arena, so that leaves everything out, and that's unacceptable to me.   Let's clear up a couple of things. Number 1: I seldom prance. Number 2: I have no intention of engaging in a character debate, and Number 3: You're not on my staff.   Why is that, by the way?   Why aren't you on my staff?   How much do you make?   The name's Andy. How much money do you make?   You would raise your voice to the President?   Are you attracted to me?   I asked if--   Well, I tell you what. Let's make it the issue. Let's try something new, 'cause I know that most couples, when they're first getting together, are inclined to slam on the brakes because they're concerned about Bob Rumson's drool.   You know what your problem is?   Sex and nervousness.   Yes. Last night when we were looking at the different place settings in the dish room, I realized that those place settings were provided by the First Ladies. And I'll bet none of those First Ladies were nervous about having sex with their President husbands. And you know why?   I will. Because they weren't presidents when they met them. Not the case here.   You see what I'm getting at?   Sure. It's right through there.   As you pass through, you'll see a large closet on your left. And if you feel comfortable, hang up your coat, and when you come back I'll have fixed up a drink, we'll sit on the couch, and I will explain to you my plan.    Okay. You're attracted to me, but the idea of physical intimacy is uncomfortable because you only know me as the President. It's not always gonna be that way, and the reason I know that is because there was a moment last night when you were with me and not the President, and I know what a big step that was for you. So, Sydney, I'm in no rush. Here's my plan: We're gonna slow down. When you're comfortable, that's when it'll happen.  SYDNEY comes back into the room...she's wearing one of SHEPHERD's dress shirts and nothing else. She walks toward him.    Perhaps I didn't properly explain the fundamentals of the \"Slow Down\" plan.    Are you nervous?   Good. My nervousness exists on several levels. Number 1 -- and this is in no particular order -- I haven't done this in a pretty long time. Number 2: Any expectations you might have, due to the fact that I'm, you know...   Exactly, thank you. Just so you remember that's a political distinction that comes with the office. I mean, if Eisenhower were here instead of me he'd be dead by now. And number three...    It is very early, and SHEPHERD is still asleep. As we PULL BACK, WE REVEAL that he is alone in his bed. The PHONE RINGS.  SHEPHERD picks it up--    Yeah...put him through.  Lewis, it is 5:00 a.m. You gotta get yourself a life, man.  Yeah...all right.  He hangs up the phone and looks around the room, only to notice SYDNEY is tiptoeing around in the dim light, trying to quietly dress herself and gather up her things. SHEPHERD watches this odd spectacle for a moment before he says--    Sydney?  SYDNEY turns around.   What are you doing?   I have those same thoughts every day of my life. Say, you know Lewis Rothschild, don't you? Well, he's...   ...on his way up.   Come on in, Lewis.  LEWIS comes in--    What's the situation?   Thank God.   See, and I think the important thing is actually not to be panicking.  A.J. KNOCKS on the open door and walks in.   No, please, let's do.   Rest easy, Lewis. We're not creating a diversion.    We'll have somebody take you home.    Sydney, when you leave here, you're gonna run into reporters and photographers. Your picture's gonna be taken every day, and you're gonna be asked questions every day. Answer them, don't answer them -- it's entirely up to you. The White House has no official position except to say \"no comment.\"   The White House doesn't comment on the President's personal life.   I tell you what, Lewis, we just did.   I'm sorry about all this. We'll do it better next time.   No, I mean...   Me, too. I'll call you. I'll be in Panama, but I'll call you.   All right...okay...this is good.    Douglas, does the N.R.A. have videotapes of you playing golf with Satan? We've already softened the assault weapons. We're leaving the SKS, the mini 14, and about 250 other types on the street. I mean, how much pull can one lobby--  JANIE catches SHEPHERD's eye and makes a subtle gesture to her wristwatch.      (continuing;     into phone --Yeah, look, we're gonna continue this tomorrow. I'm late for the party fund-raiser. I'll be sure and put in a good word for you, by the way.  Okay.  He hangs up.   I studied under a Nobel-Prize-Winning economist. You know what he taught me?   Yeah. I'm going to St. Louis.    Hop in. We'll talk in the car.  As they do they're told, and the motorcade gets on its way.     Guys, do I have to be here for this meeting?    Today?   Let me see if I've got this: The third story on the news tonight was that someone I didn't know 13 years ago, when I wasn't President, participated in a demonstration where no laws were being broken in protest of something that so many people were against it doesn't exist anymore?  Just out of curiosity, what was the fourth story?   Don't deal with it.   They're trying to get us to swing at a pitch in the dirt. No one ever wins these fights. It'll go away.   Aw...hell!   No, you reminded me, I'm supposed to have dinner with Sydney tonight.    SHEPHERD's on the phone to SYDNEY.    I feel terrible, but I have to cancel our date tonight.   No, I've gotta go to St. Louis and avert a massive airline strike.   Thanks for understanding. I'll call you tonight  SHEPHERD hangs up the phone.   Boy, I hate doing that. She was trying on dresses.   Look! Look! There it is! Carmen's House of Flowers! We gotta stop.   I gotta get her flowers.   I broke our date. This is what men do.   Coop, I'm gonna hop out at that flower shop.   Then it's not personal.   You think there's a florist who's planning an assassination on the off-chance that I'd be stopping by?   Excuse me--   Excuse me--    Hey, I don't know if you're the one I talked to on the phone... Virginia, dogwood, the President ...any of it ring a--  And apparently it does, because the GIRL faints and falls to the floor.   Same girl. She remembers me.    Brutus and Cassius? They want me to get into the character debate and mix it up.    Sydney says you guys are really stupid.    She's questioning your loyalty.    Wait a second, here comes my favorite part.  He's referring to RUMSON on the TV.    It's a good thing he cleared that up, 'cause the crowd was gettin' ready to buy some AMWAY products.    Sydney, his number have nowhere to go but up.    We're fine. We'll be back up in the 60's once I get the votes for the crime bill.  Say, what're you doing this weekend?    The negotiations are going pretty well here. It looks like the nation's going to keep on flying. Lucy's sleeping over at a friend's house Saturday night.    Have you ever been to Camp David?    It's sass, right? You're sassing me.    I'll have a car pick you up Saturday morning.   How many \"e\"s in \"kaleidoscope\"?   What?   Are you still reading that ridiculous biography?   Seven-trillion-dollar communications system at my disposal, you'd think I'd be able to find out if the Packers won.   Yeah...that course wasn't about what I thought it was gonna be about.  SHEPHERD has landed on a news station.   Who cares? Let's see some scores.   I'm so sorry about this, Sydney.   You gotta tell him to turn a deaf ear.   Sydney, I can't challenge the school bully to a fight just because he picked on my girlfriend.   I have one more election left, Sydney. I don't have the luxury of losing my patience.   Things will be better when I pass a crime bill. And Sydney, if you disappeared, I'd find you.  He goes to kiss her, she responds.   Is that a fact?   If I'm not mistaken, Gill, I think the courts ruled on Title 9 about 20 years ago.   Well, it's a world gone mad, Gill.  LEWIS, KODAK and ROBIN stand huddled with cups of eggnog...   Hi, Syd. Get stuck on DuPont Circle again?   I'll look into it.   You went to see the Motown Three?   The woman knows no fear. She'd lobby the Carolinas to the American Lung Association.   I don't think the Pep Boys know too many words.    Okay.   No, I was...I was thinking about-- nothing.   No, the GDC's political director didn't tell us anything. Sydney Wade told her boyfriend and her boyfriend's best friend that she had a lousy day.   I made a promise, A.J.   I made it with Sydney.   Yeah, well, this is all academic anyway. We're not going to need those votes.   This was delicious. Thank you. Is there any left?   Are you kidding me, of course I did. But actually it's not for me. The agent who checked the food thought it was delicious, and I sort of told him I'd bring him some if there was any left.   No, I loved it.   No, I'm not.   When have you seen me do a thing with my face?   You were?   Vaguely.   Ah.   How did you know?   Wow...what's the occasion?   Two votes?    That's great, Sydney. I mean it. That's great work.   Look, no matter what happens, you have every right to be proud of yourself.   Yeah, well...   Yeah?   Did he give a reason?   We said as a last resort.   No. Come on. There's gotta be three votes someplace else.   Bullshit, Leon. There's gotta be somebody we haven't--   Storch.   What about Storch?   Wagner.   Sobel.   Clark.   Not that Clark, the one from Indiana.   She is one vote away, A.J. It's important legislation that for the first time has a legitimate chance.  I think she deserves every possible opportunity to--   You got something to say to me?   Examine what? They don't like that I'm going out with Sydney.   Whose problem we talking about, Lewis? Yours? You worried about your job? This poll isn't talking about my Presidency. This poll is talking about my life. Two hundred and sixty-four million people have decided--   Look, if people want to listen to Bob Rumson--    Lewis, we've had Presidents who were beloved, who couldn't find a coherent sentence with two hands and a flashlight. People don't drink the sand, 'cause they're thirsty, Lewis. They drink it 'cause they don't know the difference.  The room is slightly stunned by what their President has just said.  SHEPHERD picks up the polling data and heads to the door...      (continuing; on his     way out Make the deal.   Sounds good.   I'll say.    What do you mean?   You saw her?   Where?   Don't worry about it.   Practice your music.    Syd?  SYDNEY comes out.   A grey...sweater? No. I called you at the office, but...   Where were you going?  SYDNEY continues her search.   Connecticut?   What's in Connecticut?   When did you decide to get a new job?   Why did he fire you?   I'll call him.   What do you think went on here today?  She stops.    The environment got screwed. Nothing happened to you today, Sydney. Governing is choosing. Governing is prioritizing. I've made no secret of the fact that the crime bill was my top priority.    Sydney. Please. I don't want to lose you over this.   Richard Reynolds' district office. She's thinking of running his campaign. Four in the corner.  SHEPHERD gets down over the ball--    Hartford. The insurance capital of the world. Have a good time, Syd.  SHEPHERD smacks the ball, BULL'S-EYE.   You handling me, A.J.?   Good. 14 in the side.  SHEPHERD gets down over the ball...   Excuse me.   Has he lied?!   Has Rumson lied in the last seven weeks?   Other than not knowing the difference between Harvard and Stanford, has he said something that isn't true? Am I not a Commander-in-Chief who's never served in the military? Am I not opposed to a Constitutional amendment banning flag burning? Am I not an unmarried father who was sharing a bed with a liberal lobbyist down the hall from my twelve-year-old daughter?   I don't think you win elections by telling 59 percent of the people that they are.   Don't--   Is the view pretty good from the cheap seats, A.J.?   It occurs to me that in 25 years I've never seen your name on a ballot. Why have you always been standing a pace behind me?   Fuck you.  SHEPHERD's tossed his cue stick and is heading out...    Have Lewis put the final drafts of the State of the Union and the Crime Bill announcement on my desk in the morning.   If Mary hadn't died...would we have won three years ago?   If we'd had to go through a character debate three years ago, would we have won?    Yeah.  SHEPHERD exits, leaving A.J. alone as we   You're not hungry?   Yeah.   It's good for you.   You're not from Wisconsin. I'm from Wisconsin. You've lived in Washington your whole life.  He glances toward the T.V. screen. ROBIN's standing up there doing what she's been told: \"No comment...No, this President is not participating in character debates...\" He mutes the volume.    How are you doing in your Constitutional debates?   You're done?   Oh...well...that's good. Why didn't you tell me?   Okay, I give up. I don't care why you're not happy in social studies. I care about why you're not talking to me about why you're not happy in social studies.   You're not perfectly happy. You don't think I know when something's bothering you?   Hey!   Talk to me.   Almost every time I talk, I say things you disagree with.    Politically?    What do you mean?  It just starts spilling out in a stream--    Stand up please.  LUCY gets up slowly...  She's never seen her father like this...    I want you to pay very close attention to what happens now.  SHEPHERD knees down, cups her daughter's face in his hands, and gently kisses her forehead. He pulls her to him and holds her in a tight embrace...    In your  lifetime, you will never embarrass me. It could never happen. You're not the President's daughter, Lucy, you're mine. And no one's gonna vote me out of that job. You're my daughter, and everything else is a distant second.  School is for you, Lucy. You say what you want. The only thing you have to do to make me happy is come home at the end of the day.  LUCY squeezes her dad tight...they hold the embrace for a long moment.    One more thing. I don't dislike Senator Rumson because of his political views. And even if you voted for everything he would vote for, that wouldn't make you like him. There's a fundamental difference between you and the Bob Rumsons of the world.   The difference is that he says he loves America. Saying you love America is easy. What takes character -- and this is what you have--  SHEPHERD trails off, realizing he's about to quote Sydney...    What takes character is loving Americans.   And now it's as if SHEPHERD is waking himself up from the longest trip of his life...  ...he looks over at the T.V. monitor...\"No comment\"... \"No, I don't know how many other ways I can say it. The White House isn't getting involved in...\"    Luce, I gotta go.   Everything's fine. I'm just a little late for work.  He heads for the door, shouting out as he goes--   Somebody get my daughter some food! The girl's from Wisconsin, for cryin' out loud!  And he's gone as we...   Yes, he will. 'Morning.   That's all right, you can keep your seats. For the last couple of months, Senator Rumson has suggested that being president of this country was, to a certain extent, about character...   ...and although I have not been willing to engage in his attacks on me, I've been here three years and three days, and I can tell you without hesitation: Being President of this country is entirely about character.  LEWIS enters with A.J. and KODAK.    For the record: Yes, I am a card- carrying member of the A.C.L.U. But the more important question is why aren't you, Bob? This is an organization whose sole purpose is to defend the Bill of Rights, so it naturally begs the questions.    Why would a senator, his party's most powerful spokesman and a candidate for president, choose to reject upholding the Constitution? If you can answer that question, then, folks, you're smarter than I am, because I didn't understand it until a couple of minutes ago. Everybody knows American isn't easy. America is advanced citizenship.    You gotta want it bad, 'cause it's gonna put up a fight. It's gonna say, \"You want free speech? Let's see you acknowledge a man whose words make your blood boil, who's standing center stage and advocating, at the top of his lungs, that which you would spend a lifetime opposing at the top of yours. You want to claim this land as the land of the free, then the symbol of your country can't just be a flag; the symbol also has to be one of its citizens exercising his right to burn that flag in protest.\" Show me that, defend that, celebrate that in your classrooms. Then you can stand up and sing about the land of the free. I've known Bob Rumson for years. I've been operating under the assumption that the reason Bob devotes so much time and energy to shouting at the rain was that he simply didn't get it. Well, I was wrong.    Bob's problem isn't that he doesn't get it. Bob's problem is that he can't sell it. Nobody has ever won an election by talking about what I was just talking about.    This is a country made up of people with hard jobs that they're terrified of losing. The roots of freedom are of little or no interest to them at the moment. We are a nation afraid to go out at night. We're a society that has assigned low priority to education and has looked the other way while our public schools have been decimated. We have serious problems to solve, and we need serious men to solve them. And whatever your particular problem is, friend, I promise you, Bob Rumson is not the least bit interested in solving it. He is interested in two things and two things only: Making you afraid of it and telling you who's to blame for it. That, ladies and gentlemen, is how you win elections. You gather a group of middle-aged, middle-class, middle- income voters who remember with longing an easier time, and you talk to them about family and American values and personal character. Then you have an old photo of the President's girlfriend. You scream about patriotism and you tell them she's to blame for their lot in life, you go on television and you call her a whore. Sydney Ellen Wade has done nothing to you, Bob. She has done nothing but put herself through law school, prosecute criminals for five years, represent the interests of public school teachers for two years, and lobby for the safety of our natural resources.    You want a character debate? Fine, but you better stick with me, 'cause Sydney Ellen Wade is way out of your league. I've loved two women in my life. I lost one to cancer, and I lost the other 'cause I was so busy keeping my job I forgot to do my job. Well that ends right now.    Tomorrow morning the White House is sending a bill to Congress for its consideration. It's White House Resolution 455, an energy bill requiring a 20 percent reduction of the emission of fossil fuels over the next ten years. It is by far the most aggressive stride ever taken in the fight to reverse the effects of global warming. The other piece of legislation is the crime bill. As of today it no longer exists. I'm throwing it out. I'm throwing it out and writing a law that makes sense. You cannot address crime prevention without getting rid of assault weapons and handguns. I consider them a threat to national security, and I will go door to door if I have to, but I'm gonna convince Americans that I'm right, and I'm gonna get the guns. We've got serous problems, and we need serious men, and if you want to talk about character, Bob, you'd better come at me with more than a burning flag and a membership card. If you want to talk about character and American values, fine. Just tell me where and when, and I'll show up. This is a time for serious men, Bob, and your fifteen minutes are up. My name's Andrew Shepherd, and I am the President.  SHEPHERD exits the press room, leaving a stunned room in his wake.  The MURMURS begin from the PRESS CORPS. They're talking among themselves, confirming that they just saw what they just saw. ROBIN steps to the podium.   I don't want the limo. I don't want an escort.  A.J. enters.    I want a plain, ordinary, non- bullet-proof automobile. Someone around here must have a Chevy I can borrow. Well, find one and meet me outside the West Wing entrance in five minutes.   I'm going to her house. I'm gonna stand at her front door till she lets me in. And I'm not leaving till I get her back.   I haven't worked that out yet. But I'm sure groveling will be involved.   I'm the Commander-in-Chief of the most powerful army in the world. You don't think I can drive ten blocks?   I'm glad.  SYDNEY and SHEPHERD just gaze at each other for a moment and smile. SYDNEY starts toward him.    Sydney, I didn't decide to send 455 to the floor to get you back.    I've got some things to do.   I'm having a cuff links crisis.  LUCY takes his sleeves.    I think they've locked.   Lewis.   Things have been a little rough between us lately.   Don't stop what you're doing.   No, you were right. Two hundred and sixty-four million people don't give a damn about my life.    See you after.  The PEOPLE in the room start to gather their things and exit, ROBIN handling any and all last-minute \"Mr. President\"'s as she herds people out the door.  LUCY walks past SHEPHERD. She holds SHEPHERD's old tattered textbook and has it opened to a specific page...    Whatcha got there, Luce?   Thank you.  I'll see you afterward. I want a critique.  The room clears out...revealing SYDNEY, dressed like the First Lady she's soon to be, sitting against the window sill.    There's been something I've been trying to give you since our first date. I tried a bunch of times, but somehow I've always managed to trip over my job.  Anyay...  SHEPHERD has picked his black canvas gym bag with the gold Presidential seal.  He reaches in the bag and pulls out a bouquet of flowers.    These are for you.   Gotta go.   No, walk with me.  They exit into a hallway lined with Congressional STAFFERS, SECRET SERVICE, CAPITOL SECURITY, WHITE HOUSE STAFF, and, most prominently, A.J., LEWIS, ROBIN, JANIE and KODAK.  SYDNEY is still clutching her flowers as they near the double doors to the House Chamber--      (raising his voice     above the cheering Do what?   Well...it turns out I've got a rose garden.  SYDNEY is stopped in her tracks as--  --the doors to the Chamber fly open--",
        "Mrs.": "Good morning, Mr. President.   Fine, thank you, sir. Mr. Kodak left the detailed breakdown of the approval poll for you. He seemed to indicate that it was very good news.   Lucy called just a moment ago. You forgot to sign her permission slip for her class--   Aaagh!   You too, Mr. President.  SHEPHERD starts his walk from the West Wing back to the residence.  It is the exact reverse of the path he took to the OVAL OFFICE in the morning.   Good morning, Mr. President. Mr. Rothschild and Miss McCall are in the office, sir. They said they needed to speak with you before scheduling.   The dogwood.   Mr. President -- Excuse me, Miss Wade -- Miss McCall is on her way over.",
        "Chapil": "Good morning, Mr. President.   Fine, thank you, sir. Mr. Kodak left the detailed breakdown of the approval poll for you. He seemed to indicate that it was very good news.   Lucy called just a moment ago. You forgot to sign her permission slip for her class--   Aaagh!   You too, Mr. President.  SHEPHERD starts his walk from the West Wing back to the residence.  It is the exact reverse of the path he took to the OVAL OFFICE in the morning.   Good morning, Mr. President. Mr. Rothschild and Miss McCall are in the office, sir. They said they needed to speak with you before scheduling.   Mrs. Chapil. State flower of Virginia.   The dogwood.   Mr. President -- Excuse me, Miss Wade -- Miss McCall is on her way over.",
        "Senator": "",
        "Rumson": "Lloyd, it's a long time till next November. Right now, I'm just looking forward to a pleasant evening.    where the Minority Leader's game face can barely conceal the gears that have slowly begun to turn in his head, as we   You're over-thinking this.    Voters aren't interested in how to achieve economic growth, and they don't want to hear our plans to strengthen foreign policy.   Reporters like him. Networks and newspapers like ratings and circulation. For all the bitching we do about liberal bias in the press when it comes down to a character debate...   Because it couldn't. Our polling told us that attacking his character less than a year after he'd lost his wife was gonna be a turn-off and was gonna make people feel sorry for him. We couldn't run the campaign we wanted because the opponent was a widower.    You'll have to forgive my friend. He's been on a hunting trip and cut off from the world.   The President's got a girlfriend.   ...Last night, the price of his liberal programs was raised to include the blood of 22 American soldiers.  He hangs up. On the TV, we see a quick sound bite from RUMSON.   ...Mr. Shepherd's read a lot of books, but you didn't need a Harvard degree to see this comin' a mile down the road.   The fat that our Commander-in-Chief has not served one day in uniform--  SHEPHERD clicks off the TV and then stares at   Does New Hampshire want traditional American values back in the White House?   Does New Hampshire want the pride back?  The CROWD goes nuts upon hearing Rumson's signature phrase--   My name is Bob Rumson. And I'm running for President.  And as the CROWD loses its mind, we    I agree a hundred and ten percent, Mrs. Harper. That's why I'm up here in the dead of winter talkin' about it with you folks.  Rumson is signaling for an AIDE to take over his phone call.      (continuing;     into phone That's very generous of you, ma'am, and I'm gonna take that money off your hands right now.  He hands off the phone--    What do you got for me, Stu?   Shit, Stu, my mother's got an FBI file.  RUMSON starts to walk away when STU pulls an 8\u001b$B!_\u001b(J10 photo from the manila folder.    Oh man...tell me the smoke is coming from what it looks like it's coming from.    \"It's beginning to look a lot like Christmas...\"   Yes, and I'm glad to see ol'  Andy's got himself a girl.  APPLAUSE and appreciative LAUGHTER from a CROWD as we    Never mind she's the hired gun of an ultra-liberal political action committee.  The crowd's getting into it--    Never mind that the President takes the Fifth anytime a reporter has the temerity to ask a question about a woman in a position to exert enormous influence over a huge range of issues.  A wave building--    Never mind that this woman's idea of how to unwind at the end of a tough day is by getting together with her ACLU pals and setting American flags on fire...   My name is Bob Rumson, and I'm running for President.    I'm not saying--    I'm not making an acc-- let me be very clear. I'm not making an accusation. I am saying when we hear one thing, we dismiss it. We hear two, we dismiss it. But when several, several well- respected members and former members of the Virginia State House--    --each of their own accord, comes to me and expresses concern over the woman standing next to -- I don't even know, do we call her the First Mistress? When several--",
        "Susan": "You wanted to see me?   Did the President read the letter?   It was aggressive, and we should stand by every--   We don't need another environmental expert to confirm what every other environmental expert--   Who?   Oh Christ. That woman doesn't know the first thing about the environmental lobby.   He just needs your driver's license.  SUSAN hands the guard her license.   He doesn't care.   He doesn't need to know that.  The GUARD BUZZES her through the gate.   He doesn't know what Capra-esque means.   Sydney, we should leave Mr. MacInerney alone now. He's already given us more time than--   Sir, Ms. Wade's been thrown into the deep end of the pool on her first day. She hasn't even had a chance to read the report of the Quebec Conference.  SYDNEY -- whose brain is telling her to slam on the brakes, check her swing, smile and leave the building -- decides, instead, to hit the gas and swing away. The OTHERS are watching this as if they were watching the evolution of a train wreck.    It's really time to--   Sydney!   Mr. President, we haven't met. My name is Susan Sloan. I used to work with Congressman Myers. I hope this episode in no way--   I want to go on the record and apologize for my attitude toward you since your arrival.   I think I have a lot of pent-up hostility.   I wonder who I can blame it on.   'Cause I've been blaming it on my mother and my ex-husband, and that hasn't been working.",
        "Sloan": "",
        "Agent": "Liberty's moving.  Another AGENT rounds the corner into the corridor and is followed a step or two later by   'Morning, Mr. President.  SHEPHERD and JANIE enter the elevator. As the doors close...    Liberty is moving.   Mr. President...  An AGENT is standing in the doorway -- SHEPHERD and SYDNEY break apart.   We have a secure call from the sit- room.  SHEPHERD knows what that means.   Sorry, ma'am.    Liberty's moving.   You're gonna hop out, sir?   She'll be fine.",
        "Cooper": "Liberty's moving.  Another AGENT rounds the corner into the corridor and is followed a step or two later by   'Morning, Mr. President.  SHEPHERD and JANIE enter the elevator. As the doors close...   You're gonna hop out, sir?   She'll be fine.",
        "David": "Carol, it's David in Sydney Wade's office. I want to confirm her lunch with the Congressman.   You're awfully jumpy today. What do you have -- a big date tonight?  With that, a big pile of papers is sent flying off the desk.    Ask him about his position on stateboard for Hawaii.  SYDNEY wads up some paper and flings it at David to shut him up.   How's this?   Hey, Syd, I saw on your schedule you're gonna meet with McSorley, McCluskey and Shane.   Sydney, these are people who represent people who make cars for a living.   Cars, you understand, run on gasoline.   Well, if we're gonna try, we should do some prep work. You wanna order in?   Okay. I'm having lunch at the Kremlin, so we'll have to, you know, start real early...   ...in order for me to catch the morning plane to Moscow.    Scattered STAFF and MARINE PERSONNEL hold their hats to their heads against the wind that MARINE-1 kicks up as it touches down on the helicopter pad.    She got Pennybaker.    Leo needs to see you.   He needs to see you in his office.   He just got off the phone with MacInerney. There's been a development.  SYDNEY holds for a moment...then heads out the door and we",
        "A.J.": "Is that the letter from Solomon at the GDC?   I think they're just frustrated, Mr. President.   Well, they don't think he caused it, if that's what you mean.     (continuing;     to SHEPHERD Sir, I'm on the phone with these people twice a week. I honestly don't know what they want at this point.   It won't pass at 20 percent.   Lewis, McSorley, McCluskey and Shane hold too many markers. If we try to push this through and lose, there will be a very loud thud when we hit the ground, and that's not what you want in an election year.    Would you call Mr. Kodak and tell him the President's--  A.J.'s sentence is cut short by the sound of a head-on pedestrian collision in the outer office--    Never mind.  LEON KODAK comes into the oval office. The White House pollster is a likable, if clumsy, numbers whiz. He, along with A.J., LEWIS, and ROBIN, are regarded as the President's Starting Team. The people in this room have grown very close over the past few years.   We're all here, Mr. President.   Crime control, Robin. Gun control means we're wimps and we're soft on crime.   Lewis--   We're leaving 'em out.   Robin, you can brief the press this afternoon. As of today, the crime bill's priority one on the President's domestic agenda.   Leon, you're gonna run the war room. We're gonna need detailed projections for all the target districts by the end of the week. And, Leon, don't be a nice, sweet guy from Brooklyn. Do what the N.R.A. does.   Yeah.   Lewis, we want you to be legislative liaison on this. You're gonna run the show on the hill.   We want to announce the crime bill at the State of the Union, which is 72 days from today. The last nose count put us 18 votes short.   Thank you, Mr. President.  The meeting's over. LEWIS, ROBIN, and KODAK say their \"Thank you, Mr. President\"'s as they exit.   How soon can you deploy them?   Any security concerns?   Leo Solomon brought in a hired gun at the GDC.   She's a lawyer from Virginia named Sydney Ellen Wade. I know this woman well. She's had a lot of success getting congressmen elected.   You know, if you've got a free second, maybe you could stop in and say hello. It might smooth the way.   Good.   We will, Mr. President.     Yes?   Good night, Mr. President.   I beg your pardon?      (laughing off the     suggestion Whatever you say, Mr. President.  They have reached the south entrance to the White House.    Have a good night, sir.   Your concerns are not falling on deaf ears. The environmental lobby has known no greater alley in the White House than President Shepherd.    I'm afraid Sydney's right. Although not about Michigan and California. The President has asked me to convey to you that he's sending his energy bill to the floor with a call for a reduction of 10 percent.  There's an uncomfortable silence in the room...    The President is willing to go it alone on this, but he's asking for, and frankly he's expecting, the full support of the GDC.   Yes, he is.   Good morning, Mr. President. How are you today?   McSorley, McCluskey and Shane know we're making our move on the crime bill. They're circling the wagons on the assault weapons.   Let Lewis take a pass at them first.   Nice shot, Mr. President.   I will not do it playing pool, I will not do it in a school, I do not like green eggs and ham, I do not like them Sam I am.   Leo Solomon phoned. He said he was thrilled with the deal you made this morning.  SHEPHERD lifts his cue for a moment...trying to think it there was something he was supposed to tell A.J.   It's a waste of time.   Also, Sydney Wade called.  SHEPHERD, a hair too excited by this news, misses by a mile.    She wanted to apologize one more time for her behavior. 3 in the side.    Sydney Wade?   Did she say anything about you? 13 in the corner.    Well, no, but I could pass her a note before study hall and--   I feel a nightmare coming on. 1 in the corner.  He misses the shot.   You're not serious.   The President can't just go out on a date.   You're not--   Mr. President, this is an election year. If you're looking for female companionship, we can make arrangements that'll insure total privacy and--   No, sir, this is the White House.   The difference is he didn't have to be the president on television. You've said it a million times: If there were a television set in every living room 60 years ago, this country does not elect a man in a wheelchair.   We'll take a hit.   I don't know. Five points. Maybe more.   It could be more.   Do you want me to have Kodak put together some numbers so we know what we're talking about?   Mr. President, the American people have a funny way of deciding on their own what is and what is not their business.    Give her a call.   She said you're taller than she thought you'd be.   Sydney, come on in. You look beautiful.   I promise you there's no hidden agenda.  SHEPHERD approaches SYDNEY.   You know my wife, Esther.   Sydney, when you meet the French President, don't make him feel too loved, all right? We just signed a new trade agreement.   I'll bet no one accused Louis of being soft on crime.   Bob Rumson would embrace it.    holding hands smiling as they watch their old friend, and we   What's the estimate?     It's immediate, it's decisive, it's low risk, and it's a proportional response.   Robin, as soon as our planes have cleared Libyan airspace, you can call the press. I don't know when we'll have the full B.D.A.--    Get him off.   Good morning, Mr. President. Good morning, Ms. Wade. I see everyone's getting an early start today.   Good for you, Lewis.   Esther's over in my office. She's got the station wagon outside.  SHEPHERD regards A.J. for a moment...clearly the man planned ahead.    Thank you, Mr. President.  LEWIS, ROBIN and A.J. say their \"Thank you, Mr. President\"'s on the way out ...    Sydney. Esther'll be in my office. You take your time.   Mr. President. I just got off the phone with the Federal Mediator in St. Louis. Management just walked away from the table. The baggage handlers, pilots and flight attendants are getting set to walk in 48 hours.   Don't have a airline strike at Christmas?   You can leave straight from the fund- raiser. Janie, get him outta here.   Hey, Sydney, Merry Christmas.   Where you been?   Syd, relax. It's Christmas.  SHEPHERD joins them.   What were you doing up on the Hill, anyway?    On its merits?   You're in good company. I sat with 'em a week ago. They told me there was nothing on the President's domestic agenda they were more committed to defeating than the crime bill.   You're kidding, right?   SYDNEY isn't aware she's said anything of particular consequence.   Yeah...   Did what I think just happened, just happen? Did the GDC's political director just tell the President and the White House Chief of Staff that there are three votes on the crime bill that can be bought by stickin' the fossil fuel package in a drawer.   It doesn't change the facts, Mr. President. If Sydney gets her 24 votes and we're three short, there's some maneuvering to be done.   You made a deal, Mr. President.   You made it with the GDC.   If your approval rating drops any more, things are gonna get tight.    LEWIS and KODAK stand in front of A.J.'s desk.   Fine. Do it.   We lost Quincy, too.   Mr. President--   Mr. President, I think we have to do it.   Lewis, shut up.  There's a horrible silence in the room. SHEPHERD has locked eyes with LEWIS.   All right, that's enough.   The President doesn't answer to you, Lewis.   Hartfort? What's in Hartford?   Listen. I'm gonna have Janie clear your schedule for the weekend. You need to get some rest.   No, sir.   But I sure as hell will if you don't start gettin' your head outta your ass.   Lewis is right. Go after this guy.   What?   Has he lied?   And you think you're wrong?   We fight the fights we can win.   You fight the fights that need fighting!   I beg your pardon.   Because if I hadn't been, you'd be the most popular history professor at the University of Wisconsin.   Yes, sir.  SHEPHERD gets to the doorway...stops...turns around...   Would we have won?   I don't know. But I would've liked that campaign. If my friend Andy Shepherd had shown up, I would have liked that campaign.  SHEPHERD looks away...nods absently...   Well, you don't see that every day of the week.   Lewis, call the printer.   Every word, Lewis. It's a whole new ball game. You've got 35 minutes.   Where are you going?   How're you gonna do that?   You're just gonna drive over?   It's nice to see you, Ms. Wade. If anybody needs me, I'll be in the Roosevelt Room, giving Lewis oxygen.  A.J. exits.   Sounds right up your alley.  SHEPHERD looks at his old friend and extends his hand for a deeply-felt handshake. A.J. grasps SHEPHERD's hand and then pulls him into a strong embrace.  A.J. whispers a shout into SHEPHERD's ear--    Give 'em hell, Andy.  A.J. pulls away, leaving SHEPHERD to enjoy the moment without having to speak--    You've got 30 seconds, Mr. President.",
        "Andrew": "SHEPHERD's walking with his personal assistant, JANIE, a shy, professional and incredibly efficient 25-year-old.",
        "Leon": "",
        "Kodak": "Sorry! Sorry, my fault.   Excuse me. Good morning, Mr. President.   They keep moving that big ficus plant.   Wait a second. You wanted me to poll registered voters?  Everyone LAUGHS... even SHEPHERD smiles...   Scare the shit out of 'em?   I can do that.   Who's on Indiana?  Excuse me. New people, I can't remember your names. Raise your hand if you're on Indiana.  Two INTERNS raise their hands--    Put your hands down -- you're on Illinois.  LEWIS comes in.   What?   I don't believe it.  You. New guy. \"Jarrett, Democrat, Minnesota.\" Slide his name on over to \"for.\"  We just had his name laminated under \"Undecided.\" How'd you get the fence pole out of his butt?   We gotta do one thing at a time.   It's a tree and a flower.   Yes. What's going on?   I think it's a great idea, sir. You know Rumson's gonna be talking about your lack of military service.   But it can be, sir. What you did tonight was very presidential.   yes, sir.   The country has mood swings.   Well, I could explain it better, but I'd need charts and graphs and an easel.   Yeah, you didn't get the memo?   The bill is priced to move, see.   The President's coattail's are gonna have room for you, Congressman, you leave that to us.   I wouldn't say he's in a free--   What if I do a new poll? We give him detailed public opinion.   Bad.   Forty-one. Character across the board.   Jarrett. He's trying to keep his finger in the dam.    I hope so. 'Cause, you know, if that was an \"undecided,\" then we need to work on our people skills.  LEWIS picks up the phone and punches in a few numbers. Even before that line starts ringing, he picks up another phone and punches in a different set of numbers.   We're three votes down again, sir.  There's a pause before ...    Mr. President, as of this morning, Sydney only needed one more vote. The Motown Three have gotta be scared blind. I don't think there'll be a better opportunity.   If you agree to stick 455 in a drawer until after the elections, they'll give you the three votes.   We're there, sir. The State of the Union is 48 hours away.   There isn't.   There isn't, sir.   I beg your pardon?   Storch is a \"no.\"   No.   No.   No.    That one too, sir.  SHEPHERD is stopped.",
        "Janie": "The 10:15 event's been moved inside to the Indian Treaty Room.   Yes, sir. They're giving you a 200-pound halibut.   Yes, sir.   Of course, sir.   Mr. Rothschild asked to have a moment with you this morning.   He seemed concerned.   Charlie.   Happy birthday, Laura.   You already did, sir.  And, with that, they walk through a doorway and into    --the museum trip. I'll go get it.   Three-twenty.   Very crowded.   Security briefing, sir.   Mr. President, your cousin Judith's come down with the flu and won't be able to join you Thursday night.   Yes, sir.   It's 3:45, sir.   You have the Attorney General at 4:00 and the trade representative at 4:30. Somewhere in there you promised NPR five minutes.   You will, Mr. President.  A SECRET SERVICE AGENT follows at a distance.   You're running four minutes ahead of schedule.   Yes, sir.   Mr. MacInerney asked me to remind you to pop your head in on--   Yes, sir.    This way...  JANIE leads SYDNEY into...    Yes, sir?   Miss Wade? The President wants you to join him upstairs in the residence. May I show you the way?   Mr. President, I'm sorry to interrupt. The receiving line is in place.   I'll take care of it, sir. Where do you want them sent?   I don't understand.   You just want the phone number?    I don't understand, sir, is there--   I'll get it for you right away, sir.   Yes?   I'm sorry, I'm really not at liberty to say.   I'm really not at liberty to say.      (turning to MRS.   The dogwood, sir.   Are you sure?    Sir, it's a tree and a flower.   They're in storage in Wisconsin with the rest of your personal items.   Mr. President, Ms. Wade is here to see you.   Yes, sir.   They're 45 seconds away, sir.  During the following, JANIE will go to the desk, pick up two briefing books and stick them in a briefcase and gather up his things -- all without interrupting the conversation a beat.   You're incredibly late.  They head to door as A.J. enters from the other side of the office.   He's incredibly late.   Mr. President, Leventhal at Treasury wants two minutes. Hello, Sydney.  MRS. CHAPIL enters--   Mr. President?",
        "Basdin": ""
    },
    "imdb_rating": "6.8",
    "description": "Andrew Shepherd is approaching the end of his first term as President of the United States. He's a widower with a young daughter and has proved to be popular with the public. His election seems assured. That is until he meets Sydney Ellen Wade, a paid political activist working for an environmental lobby group. He's immediately smitten with her and after several amusing attempts, they finally manage to go on a date (which happens to be a State dinner for the visiting President of France). His relationship with Wade opens the door for his prime political opponent, Senator Bob Rumson, to launch an attack on the President's character, something he could not do in the previous election as Shepherd's wife had only recently died.garykmcd",
    "name": "The American President",
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNjhkMmU0M2YtZDUwYi00OWE0LWI5NTktODBjNDc1M2ZlMjI4XkEyXkFqcGdeQXVyNDAxNjkxNjQ@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}