{
    "filename": "Wizard-of-Oz,-The_script.txt",
    "imdb_id": "tt0032138",
    "imdb_url": "https://www.imdb.com/title/tt0032138",
    "characters": [
        "Complete credited cast:",
        "'Hunk' /The Scarecrow",
        "Nikko",
        "'Zeke' /The Cowardly Lion",
        "'Hickory' /The Tin Man",
        "Glinda",
        "Miss Gulch /The Wicked Witch of the West",
        "Auntie Em",
        "Toto (as Toto)",
        "The Munchkins (as The Munchkins)",
        "Professor Marvel /The Wizard of Oz /The Gatekeeper /The Carriage Driver /The Guard",
        "Dorothy",
        "Uncle Henry"
    ],
    "dialogues": {
        "Nikko": "",
        "Glinda": "Are you a good witch, or a bad witch?  Oh!   Well....  Well, I'm a little muddled. The Munchkins called me because a new witch has just dropped a house on the Wicked Witch of the East. And there's the house, and here you are, and that's all...  ...is, are you a good witch, or a bad witch?  The Munchkins. They're laughing because I am a witch. I'm Glinda, the Witch of the North.  Only bad witches are ugly.  The Munchkins are happy because you have freed them from the Wicked Witch of the East.  The little people who live in this land -- it's Munchkinland, and you are their national heroine, my dear. It's all right -- you may all come out and thank her. It's all right now - you may all come out.        The Wicked Old Witch at last is dead!  That was her sister -- the Wicked Witch of the East. This is the Wicked Witch of the West. And she's worse than the other one was.  Leave her alone!  ...ting the ruby slippers?  It's too late! There they....  Keep tight inside of them -- their magic must be very powerful, or she wouldn't want them so badly!    It's all right. You can get up --   she's gone.  It's all right. You can all get up.  Pooh -- what a smell of sulphur! I'm afraid you've made rather a bad enemy of the Wicked Witch of the West. The sooner you get out of Oz altogether, the safer you'll sleep, my dear.  No -- that's true. The only person who might know would be the great and wonderful Wizard of Oz himself!  Oh, very good, but very mysterious. He lives in the Emerald City, and that's a long journey from here. Did you bring your broomstick with you?  Well, then, you'll have to walk. The Munchkins will see you safely to the border of Munchkinland. And remember, never let those ruby slippers off your feet for a moment, or you will be at the mercy of the Wicked Witch of the West.  It's always best to start at the beginning -- and all you do is follow the Yellow Brick Road.  Just follow the Yellow Brick Road.  You don't need to be helped any longer. You've always had the power to go back to Kansas.  Because she wouldn't have believed me. She had to learn it for herself.  That's all it is!  No. She had to find it out for herself. Now, those magic slippers will take you home in two seconds!  Toto, too.  Whenever you wish.  Are you ready now?  Then close your eyes, and tap your heels together three times.  And think to yourself -- \"There's no place like home; there's no place like home; there's no place like home.\"",
        "Auntie": "Dorothy -- Dorothy -- where are you? It's me -- it's Auntie Em. We're trying to find you. Where are you?",
        "Em": "Fifty-seven, fifty-eight --  Dorothy, please! We're trying to count! Fifty-eight--  Seventy --     Dorothy, please!  Dorothy!     Dorothy!   We're busy!  I know, but we all got to work out our own problems, Henry.  Oh, I hope we got them in time.  Here, here, what's all this jabber- wapping when there's work to be done? I know three shiftless farm hands that'll be out of a job before they know it!  I saw you tinkering with that contraption, Hickory. Now, you and Hunk get back to that wagon!  Well, don't start posing for it now. Here, here -- can't work on an empty stomach. Have some crullers.  Just fried.  It's no place for Dorothy about a pig sty! Now you go feed those hogs before they worry themselves into anemia!  Now, Dorothy, dear, stop imagining things. You always get yourself into a fret over nothing.  Now, you just help us out today, and find yourself a place where you won't get into any trouble.  How would it be if she keeps him tied up? He's really gentle -- with gentle people, that is.  Now, we can't go against the law, Dorothy. I'm afraid poor Toto will have to go.  Dorothy!  Put him in the basket, Henry.  Almira Gulch, just because you own half the county doesn't mean you have the power to run the rest of us! For twenty- three years, I've been dying to tell you what I thought of you! And now -- well, being a Christian woman, I can't say it!  Dorothy!   Dorothy!  Henry! Henry! I can't find Dorothy! She's somewhere out in the storm! Dorothy!  Dorothy -- Dorothy -- where are you? It's me -- it's Auntie Em. We're trying to find you. Where are you?  Dorothy.   Dorothy, dear. It's Aunt Em, darling.  Yes, darling.  There, there, lie quiet now.   You just had a bad dream.  Oh, we dream lots of silly things when we --",
        "Dorothy": "She isn't coming yet, Toto. Did she hurt you? She tried to, didn't she? Come on - - we'll go tell Uncle Henry and Auntie Em. Come on, Toto.  Aunt Em!   Aunt Em!  Aunt Em!  Just listen to what Miss Gulch did to Toto! She --  Oh, but Aunt Em, she hit him over the --  Oh -- oh, the poor little things. Oh, but Aunt Em, Miss Gulch hit Toto right over the back with a rake just because she says he gets in her garden and chases her nasty old cat every day.  Oh, but he doesn't do it every day -- just once or twice a week. And he can't catch her old cat, anyway. And now she says she's gonna get the sheriff, and --  Oh -- all right.  Zeke, what am I going to do about Miss Gulch? Just because Toto chases her old cat --  I have so got brains.  Oh, Hunk, you just won't listen, that's all.  Well, gee, I try and have a heart.  This?  Oh!  Hickory!  I'm not afraid of her.  Oh!  Oh! Oh, Zeke! Help! Help me, Zeke! Get me out of here! Help!  Yes, I'm all right.   Oh -- I fell in and - - and Zeke --  Why, Zeke, -- you're just as scared as I am!  Auntie Em, really -- you know what Miss Gulch said she was gonna do to Toto? She said she was gonna --  No --  Some place where there isn't any trouble.  Do you suppose there is such a place, Toto? There must be. It's not a place you can get to by a boat or a train. It's far, far away -- behind the moon -- beyond the rain --      Destroyed? Toto? Oh, you can't!    You mustn't! Auntie Em! Uncle Henry!   You won't let her, will you?  Please, Aunt Em, Toto didn't mean to. He didn't know he was doing anything wrong. I'm the one that ought to be punished. I let him go in her garden. You can send me to bed without supper --  No --  Oh, no, no! I won't let you take him! You go away, you....! Oooh, I'll bite you myself!  You wicked old witch! Uncle Henry, Auntie Em, don't let 'em take Toto! Don't let her take him -- please!  Stop her!  Oh, don't, Uncle Henry.   Oh, Toto! Don't...  Toto, darling! Oh, I got you back!     You came back! Oh, I'm so glad! Toto!  Oh, they'll be coming back for you in a minute. We've got to get away! We've got to run away -- quick!  How did you guess?  Why --  Why, it's just like you could read what was inside of me.  Please, Professor, why can't we go along with you?  ...polite!     We haven't been asked yet.  Oh, no, I wanted to go along with you.  Nobody cares about me at home. They wouldn't even miss me.  No, they won't - honestly.  Auntie Em was even going to let them kill Toto yesterday for biting Miss Gulch. Oh, please, Professor, why can't we go with you and see all the Crowned Heads of Europe?  That's our farm!  Yes...That's Aunt Em.  That's right. What's she doing?  Oh --  Me?  I had the measles once -- and she stayed right by me every minute.  What's she doing now?  Has it poppies on the wall.... MCU - Professor - Camera shooting past Dorothy  ...paper?  Oh, no -- no!  Oh, you....  ...you don't suppose she could really be sick, do you? Oh -- Oh, I've got to go home right away!  Oh, no, no, I have to get to her right....  ...away! Come on, Toto! Oh, what'll I do? If we go home, they'll send you to the Sheriff. And if we don't, Aunt Em may -- well, she may die! I know what I'll do - I'll give you to Hunk. He'll watch out for you. But we've got to hurry. Goodbye, Professor Marvel -- and thanks a lot!  Auntie Em!     Auntie Em!  We're not on the ground, Toto!  We must be up inside.... MCS -- Toto looks out from under bed -- DOROTHY o.s.  Toto -- I've a feeling we're not in Kansas anymore.  We must be over the rainbow!  Now I -- I know we're not in Kansas.  Who, me? Why, I'm not a witch at all. I'm Dorothy Gale from Kansas.  Who, Toto?  Toto's my dog.  Oh, but I've already told you, I'm not a witch at all -- witches are old and ugly. What was that?  You are! Oh, I beg your pardon! But I've never heard of a beautiful.... MCU -- Glinda looks to r.f.g. and speaks -- DOROTHY o.s.  Oh. But, if you please -- what are Munchkins?    I thought you said she was dead.  No -- No! It was an accident! I didn't mean to kill anybody!....  Oh!  Oh, I'd give anything to get out of Oz altogether -- but which is the way back to Kansas? I can't go the way I came.  The Wizard of Oz? Is he good or is he wicked?  No, I'm afraid I didn't.  But, how do I start for Emerald City?  But -- what happens if I --- CS -- Glinda speaks to Dorothy o.s. in f.g. --  My -- ! People come and go so quickly here! Follow the Yellow Brick Road. Follow the Yellow Brick Road?  Follow the Yellow Brick Road?   Follow the Yellow....?  Now which way do we go?  Who said that?  Don't be silly, Toto.     Scarecrows....  ...don't talk.  That's funny. Wasn't he pointing the other way?  Why....  ...you did say something, didn't you? CS- The Scarecrow shakes his head, then nods - -  Are you doing that on purpose, or can't you make up your mind?  How can you talk if you haven't got a.... MCU -- Scarecrow speaks to Dorothy o.s.in f.g. -- DOROTHY o.s.  Yes, I guess you're right.  Well, we haven't really met properly, have we?  How do you do?  Very well, thank you.  Oh, dear -- that must be terribly uncomfortable. Can't you get down?  Oh, well, here -- let me help you.  Well, oh, dear -- I don't quite see....  Oh....  ...yes.  Ohh!  Oh -- does it hurt you?  Ohhh --  Oh!    Oh!   Ohhh!  No, No -- I -- I just thought you hurt yourself.  No -- of course not.  Well, what would you do with a brain if you had one?    Wonderful! Why, if our Scarecrow back in Kansas could do that, the crows'd be scared to pieces!  Um-hmm.  That's where I live. And I want to get back there so badly I'm going all the way to Emerald City to get the Wizard of Oz to help me.  Um-hmm.  I couldn't say. But even if he didn't, you'd be no worse off than you are now.  But maybe you'd better not. I've got a witch mad at me, and you might get into trouble.  I don't blame you for that.  Why, of course I will!  Oh -- well -- you're not starting out very well.  To Oz?  Oh -- apples -- Oh look!   Oh.   Oh ---  Ouch!  We've been walking a long ways and I was hungry and -- Did you say.... MCU -- The First Tree -- gestures as it speaks --  Oh, dear -- I keep forgetting I'm not in Kansas.  Oh --  Why, it's a man! A man made out of tin!  Yes.    Oh -- look --  Did you say something?  Oil can?   Oh -- oh, here it is!  Where do you want to be oiled first?  Here -- here --  Yes --- there.  Oh...  ...Oh, did that hurt?  Oh, goodness! How did you ever get like this?  Well, you're perfect now.  Oh --!   No heart?   Oh --  Oh --  Oh, oh, oh, oh, oh, oh, oh, are you all right?  Oh, dear -- That was wonderful! You know -- we were just wondering why you couldn't come to Emerald City with us to ask the Wizard of Oz for a heart.  And I'll keep the oil-can handy.  Oh, but he will! He must!   We've come such a long way already.  Oh, goodness! Did any of them sting you?  Oh, dear. I don't know what I'd do if a whole swarm kept -- Oh! Oh! Oh, there's one on me!  Oh! Oh!  Oh --  Oh-oh-  Oh, there....  ...there. Don't cry. There. CU - Dorothy looks o.s. - speaks -  As a matter of fact, that's just an old drone bee, and it would have died.... CU - Tin Man looks o.s. - DOROTHY o.s.  ...just that the Witch is so wicked. I don't think you two ought to come with me because you'll get into trouble.  Oh, you're the best friends anybody ever had! And it's funny, but I feel as if I've known you all the time. But I couldn't have, could I?  Still, I wish I could remember.    But, I guess it doesn't matter anyway.   We know each other now, don't we?  I don't like this forest!   It's -- it's dark and creepy!  Do -- do you suppose we'll meet any wild animals?  Oh --  Lions?  Oh!    Lions and tigers and bears!  Oh, my!   Lions and tigers and bears!   Oh, my!   Lions and tigers and bears!   Oh, my!   Lions and tigers and bears!   Oh, my!   Lions and tigers and bears!       Oh, my!  What sort of an animal is that?  Shame on you!  No, but you tried to.  It's bad enough picking on a straw man, but when you go around picking on poor little dogs --  Well, of course not. My goodness, what a fuss you're making. Well, naturally, when you go around picking on things weaker than you are -- Why, you're nothing but a great big coward!  I don't see why not. Why don't you come along with us? We're on our way to see the Wizard now. To get him a heart.  I'm sure he could give you some courage. MCU -- Lion -- Camera shooting past Dorothy --  No, of course not.  Oh.      There's Emerald....  ...City!    Oh, we're almost there at last! At last!  It's beautiful, isn't it? Just like I knew it would be. He really must be a wonderful Wizard to live in a City like that!  Yes -- let's run!  Oh -- Oh -- what's happening?     What is it?  I can't run anymore. I'm so.... CS -- Tin Man and Scarecrow -- DOROTHY o.s.  Oh, no -- please. I have to rest for just a minute. Toto!  Oh --  Look! He's rusted again. Oh, give me the oil can -- quick! Oh-oh, quick!  Oh -- here quick -- oh! - we'll oil him up.  Oh, he's been crying! Why have you been --  Come on -- let's get out of here! Look -- Emerald City is closer and prettier than ever!   We did.    What notice?    \"Bell out of order.   Please knock.\"    We want to see the Wizard.   Well, then -- how do you know there is one? CU -- Doorman speaks -- reacts -- starts out --  ...sir. I've got to see the Wizard! The Good Witch of the North sent me! CU -- Doorman looks o.s. -- speaks --  Well, would you take us to see the Wizard?  Oh, thank you so much. We've been gone such a long time, and we feel so mess -- What kind of a horse is that? I've never seen a horse like that before!    Jolly old town!  Ho -- ho --ho -- ho  It's the Witch! She's followed us here!  Oh --  Dear, whatever shall we do?  If you please, sir. We want to see the Wizard right away -- all four of us.  Oh, but we must!  Oh, but -- but please. It's very important.   We want to see the Wizard.   I'll be home in time for supper!  Your Majesty, if you were king You wouldn't be afraid of anything?  How about a hippopotamus?  Supposin' you met an elephant?  Oh --  Oh -- and I was so happy!    I thought I was on my way home!  Auntie Em was so good to me -- and I never appreciated it. Running away -- and hurting her feelings.  Professor Marvel said she was sick. She may be dying -- and -- and it's all my fault!  Oh, I'll never forgive myself! Never -- never -- never!  Don't you know the Wizard's going to give you some courage?  Oh, well, then -- we'll ask him for you.  But why?    Why?  Oh, come on.  Our echo.  Oh, come on - come on! We'll soon find the Wizard!  I -- If you please, I - I am Dorothy,  ...the small and meek.   We've come to ask you --  Ohhh -- Jiminy Crickets! ELS -- Throne --   Oh -- Oh -- Ohhhh! LS -- Throne -- MCU -- Lion tries to speak -- faints and falls back -- MLS -- The Lion falls to the floor -- Dorothy and the others run forward to him --   Oh -- Oh -- Oh!....  ...You ought to be ashamed of yourself -- frightening him like that, when he came to you for help!  Oh -- Oh, come on.  Does it work?  Oh --  Oh!   Oh, Tin Man!   Oh!  Oh -- Oh --  Oh! Something bit me, too!    It may be just a cricket Or a critter in the trees.  Are you gonna stand around And let 'em fill us full of horror?  Whozat?  ...and the bees  What are you going to do with my dog? Give him back to me!  Oh, please give me back my dog!  But the Good Witch of the North told me not to.  No! No -- no! Here -- you can have your old slippers -- but give me back Toto.  I'm sorry. I didn't do it!    Can I still have my dog?  What are you gonna do? CU - Witch looks up o.s. - speaks -  Run, Toto, run!  He got away! He got away!    I'm frightened, I'm frightened, Auntie Em -- I'm frightened!  I -- I'm here in Oz, Auntie Em. I'm locked up in the Witch's castle....and I'm trying to get home to you, Auntie Em! Oh, Auntie Em, don't go away! I'm frightened! Come back! Come back!  Yes, it's me! She's locked me in!  Oh, I knew you'd get here in time!  Oh, hurry -- please hurry!  ...ty!  Oh -- Oh -- Oh! Toto -- Toto!  Lion, darling -- I knew you'd come!  I knew you would!  Oh!  Oh!  Oh!  Ohhh!  Ohh!   OHH!     OHH!  I -- I didn't mean to kill her....really I didn't! It's...it's just that he was on fire!  You mean, you're...you're all happy about it?  The broom!  May we have it?  Oh -- thank you so much! Now we can go back to the Wizard and tell him the Wicked Witch is dead!  Please, sir. We've done what you told us. We've brought you the broomstick of the Wicked Witch of the West. We melted her.  Yes, sir. So we'd like you to keep your promise to us, if you please, sir.  Tomorrow?    Oh, but I want to go home now.  If you were really great and powerful, you'd keep your promises!  Who are you?  Who are you?  You are?  I don't believe you!  Oh ....  ...you're a very bad man! MCU -- The Wizard reacts, speaks humbly --  Yes...!  ...yes.  Oh -- oh -- they're all wonderful.  Oh, I don't think there's anything in that black bag for me.  Oh, will you? Could you? Oh -- but are you a clever enough Wizard.... MCU -- The Wizard -- DOROTHY o.s.  Weren't you frightened?  Ohhh!  Oh, come back here!   Toto!  Come back! Oh, don't go without me! I'll be right back! Toto!  Oh! Come back! Don't go without me! Please come back!  Oh --  Oh, now I'll never get home!  Oh, that's very kind of you -- but this could never be like Kansas. Auntie Em must have stopped wondering what happened to me by now. Oh, Scarecrow, what am I going to do?  Oh, will you help me?   Can you help me?  I have?  Well, I -- I think that it -- that it wasn't enough just to want to see Uncle Henry and Auntie Em -- and it's that -- if I ever go looking for my heart's desire again, I won't look any further than my own backyard. Because if it isn't there, I never really lost it to begin with! Is that right?  Oh....  ...Toto, too?  Oh, now?  Oh, dear -- that's too wonderful to be true! Oh, it's -- it's going to be so hard to say goodbye. I love you all, too. Goodbye, Tin Man. Oh, don't cry. You'll rust so dreadfully. Here -- here's your oil-can. Goodbye.  Oh -- Goodbye, Lion. You know, I know it isn't right, but I'm going to miss the way you used to holler for help before you found your courage.  I think I'll miss you most of all.  Yes.    Say goodbye, Toto.  Yes, I'm ready now.  There's no place like home. There's no place like home. There's no place like home. There's no place like home.    -- no place like home -- there's no place like home -- no place --  Oh, Auntie Em -- it's you!  But I did leave you, Uncle Henry -- that's just the trouble. And I tried to get back for days and days.  No --  No. But it wasn't a dream -- it was a place. And you -- and you -- and you -- and you were there.  But you couldn't have been, could you?  No, Aunt Em -- this was a real, truly live place. And I remember that some of it wasn't very nice....  ...but most of it was beautiful. But just the same, all I kept saying to everybody was, I want to go home. And they sent me home.  Doesn't anybody believe me?  Oh, but anyway, Toto, we're home!  Home! And this is my room -- and you're all here! And I'm not going to leave here ever, ever again, because I love you all! And -- Oh, Auntie Em -- there's no place like home!",
        "Uncle": "Don't bother us now, honey -- this old incubator's gone bad, and we're likely to lose a lot of our chicks.  Poor little orphan, and her Miss Gulch troubles. Gosh all hemlock - you know, she ought to have somebody to play with.  Yes.  Yes.  Howdy, Miss Gulch.  Dorothy?   Well, what has Dorothy done?  You mean she bit you?  Oh, she bit her dog, eh?  Of course we won't. Will we, Em?  Uhh -- yeah --  Hunk, get them horses loose! Where's Hickory. Hickory! Hickory! Doggone it! Hick --  Hey, what are you doing there?  Doggone you! Help Hunk get them horses loose!  Go on, hurry up! Hurry up, I tell you!  Come on -- everybody in the storm cellar!  She got quite a bump on the head -- we kinda thought there for a minute she was going to leave us.  Of course we believe you, Dorothy.",
        "Henry": "Don't bother us now, honey -- this old incubator's gone bad, and we're likely to lose a lot of our chicks.  Poor little orphan, and her Miss Gulch troubles. Gosh all hemlock - you know, she ought to have somebody to play with.  Yes.  Yes.  Howdy, Miss Gulch.  Dorothy?   Well, what has Dorothy done?  You mean she bit you?  Oh, she bit her dog, eh?  Of course we won't. Will we, Em?  Uhh -- yeah --  Hunk, get them horses loose! Where's Hickory. Hickory! Hickory! Doggone it! Hick --  Hey, what are you doing there?  Doggone you! Help Hunk get them horses loose!  Go on, hurry up! Hurry up, I tell you!  Come on -- everybody in the storm cellar!  She got quite a bump on the head -- we kinda thought there for a minute she was going to leave us.  Of course we believe you, Dorothy."
    },
    "imdb_rating": "8.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BY2NjNDU1ZjctN2VhZi00Nzc5LTljNmItMTZiOTg1ODkwYjgwXkEyXkFqcGdeQXVyNTkxMzEwMzU@._V1_QL75_UX380_CR0,7,380,562_.jpg",
    "description": "When a tornado rips through Kansas, Dorothy Gale and her dog, Toto, are whisked away in their house to the magical Land of Oz. They follow the Yellow Brick Road to the Emerald City to meet the Wizard, and on the way, they meet a Scarecrow who wants a brain, a Tin Man who wants a heart, and a Cowardly Lion who wants courage. The Wizard asks them to bring him the Wicked Witch of the West's broom to earn his help.—Jwelch5742",
    "name": "The Wizard of Oz",
    "genres": [
        "Adventure",
        "Family",
        "Fantasy"
    ]
}