{
    "filename": "Manchurian-Candidate,-The_script.txt",
    "imdb_id": "tt0368008",
    "imdb_url": "https://www.imdb.com/title/tt0368008",
    "characters": [
        "Laurent Tokar",
        "Raymond Shaw",
        "Jameson",
        "Scout Dad (as Ray Anthony Thomas)",
        "Villalobos",
        "Wilson",
        "Al Melvin",
        "Owens",
        "Eddie Ingram",
        "Atkins",
        "Ben Marco",
        "Boy Scout #2 (as Joseph Alessi)",
        "Robert Baker",
        "Boy Scout #1",
        "Scoutmaster"
    ],
    "dialogues": {
        "Laurent": "",
        "Tokar": "",
        "Raymond": "Beat.                                                   Now Ellie stares at him, mouth agape.                                                                            -- distractedly staring at a pretty young woman (JOCELYN JORDAN) near the entrance.                     The following flows, overlapping, easy:          Raymond flashes a dazzling Kennedyesque smile, as the men chuckle appreciatively.                            Marco slides in front of him with a disarming grin.          Beat.   Marco's eyebrows go up.                                                                    punches the line, lifts the receiver --       CLOSE on RAYMOND'S EAR --    CLOSE on RAYMOND'S EYE --    -- everything is brighter, sharper, more luminous -- more etched than it was just moments ago --                                                                                                       Marco stops, turns.                                                    Raymond looks steadily at Marco ... who nods, interested:       Seeming startled, Raymond's reverie is broken.     His eyes harden as he refocuses on Marco.                     I don't have the dreams, Ben.    I do.   I said I did.    Ha ha, don't mix me up, I'm tired, and -- Fine. It's like this. It's as if I know what will happen, Ben, but I never get to the part where I feel that it actually did happen. But I think that's probably perfectly normal.    What? No. Who would I ask? My old Army \"buddies,\" who love and adore me for saving their pathetically unimportant -- present company excluded -- asses?    I'm sure the press would have a field day with that.    Nobody's put anything in me.                        Marco LUNGES at Raymond -- they fall, together, over the desk, onto the floor -- Chinese food scattering.                                                                                                                       Silence.   The question hangs there.          There are actual tears in Ellie's eyes.   Raymond just stares at her, coldly.                                                                                                                                                                                     She touches his bare shoulder, leaves her hand there.",
        "Shaw": "powers through with Gillespie and a couple of our media FLAKS, giving them an earful:",
        "Jameson": "",
        "Villalobos": "",
        "Wilson": "",
        "Al": "Marco laughs deliberately, trying to diffuse the tension.                              TV115 Raymond emerges from a private jet, waves to a crowd of     TV115",
        "Melvin": "Beat.   Marco stares at him.       The notebook DROPS BETWEEN THEM, and PAGES SCATTER on the floor. Both men go down to collect them --",
        "Owens": "",
        "Eddie": "",
        "Ingram": "",
        "Atkins": "",
        "Ben": "31",
        "Marco": "He refers to some satellite surveillance maps --       No response. And we RUSH TOWARD: A SOLDIER IN A LAWN CHAIR, face lifted to the heavens, sitting directly between the two armored vehicles. This is SGT. RAYMOND PRENTISS SHAW, late twenties, haunted and aloof.                                                           18   MARCO -- coming off the machine gun, grabbing Raymond's        18                  23   ANOTHER ENEMY WITH A ROCKET LAUNCHER -- slides around an           23                           29   MARCO'S P.O.V. - THE HUMMER -- is no   longer stalled on its    29     31                                   35                                                                        Melvin's face falls, disappointed. Fumbling in his clothes, he finds a SPIRAL NOTEBOOK, dog-eared, and fat with newspaper clippings -- tries to press it into Marco's hands.                                                                                          -- most selfless human being       -- most selfless human being I've ever ...                      you've ever known. Half a beat --                                    Whereupon    Excuse us please --               Whoa -- FOR AN INSTANT Ellie and Marco lock eyes -- then the crowd swallows her again --    watches Raymond take his leave from the Manchurian Global guys -- while, at the bar, the generals have established their beachhead of Bloody Marys with a couple of younger men in NAVY WHITES:    Whereupon Raymond parades past, with his Secret Service handlers, oblivious to Ben until he calls out.    Raymond turning, but not stopping --                           Raymond turns --       He starts to move away, but Marco grabs his arm --    Raymond yanks his arm away --       Raymond's secret service agent, ANDERSON slips himself between him, smiling politely, easing Marco away:                No --                            -- can avoid the truth.    Beat.    Garret and Howard trade looks.                                                                                                                            Sorry. I didn't know you          It's okay.     It's okay. were -- -- Marco's DOWN ON HIS KNEES, struggling to gather the pills together and put them back in the plastic vial. The big man goes.       Marco ducks into the bathroom and shuts the door.                                                                                                                                 Delp has known Marco too long, and too well, not to take him seriously.                                                             Marco reaches into his folder, pulls out one of Melvin's notebooks --    -- and Raymond's staring at the notebook without taking it, the way Marco once did with Melvin. Anderson and Mirella -- the staffers in the office -- are all staring at Marco the same way the Boy Scouts once stared at Melvin.    ... which is exactly what Melvin said to him.    Marco nods again, numb, makes a vague resigned gesture.    He jams the notebook back into his folder, starts to walk away.                      Who said I was jealous?    How can you not remember saving the unit?    You said you don't remember doing it.    Did you ever talk to anybody about this little discrepancy?    No.  You ask Army Intelligence. Look, we can go together, tomorrow. You tell them what you just told me, everything you do remember, what you don't \"exactly\" remember, about Kuwait, let 'em run some tests on you --    Raymond. They put an implant in me. I found it yesterday. Maybe they put one in you.    Marco moves toward him, Raymond backs away --             KNOCKING at the door:    -- where Marco  wraps Raymond in a headlock, RIPS Raymond's shirt from the shoulder --                                                    Implant.   The Feds just stare at him.   Like he's nuts.                              Delp rounds a corner -- monkeys scrambling around their cages as he comes to the clearing where    sits on one of the experimental gurneys, using a pen to write on his arm.                He's scrawling words on his palm, with a ballpoint pen:                                                                                                                                                    He releases her throat, and she gasps for air --       Rosie bucks -- gets a hand free -- SLUGS, Marco, and they tumble off the bed in a tangle of blankets and limbs --                                                                                                                                                                                 He looks to Rosie, who stands in an archway. There are SOLDIERS here, with weapons -- could be here to guard Marco. Could be here to protect him.    His arm is in a simple sling. He moves like a man who's been shot, and not quite recovered -- moves past Rosie, out of the broken-down ruins ...    ... Rosie motions the soldiers to stay back, follows him by herself ...    PULL BACK as they walk down the beach to the sea. A few tumble-down buildings are all that remains of an ancient seaside town.    Marco approaches the water's edge, staring out at the uncertain horizon. Nothing but water as far as the eye can see. PULL BACK.   And back.   And back ...",
        "Robert": "",
        "Baker": "",
        "Scoutmaster": ""
    },
    "imdb_rating": "6.6",
    "description": "When his army unit was ambushed during the first Gulf War, Sergeant Raymond Shaw saved his fellow soldiers just as his commanding officer, then-Captain Ben Marco, was knocked unconscious. Brokering the incident for political capital, Shaw eventually becomes a vice-presidential nominee, while Marco is haunted by dreams of what happened -- or didn't happen -- in Kuwait. As Marco (now a Major) investigates, the story begins to unravel, to the point where he questions if it happened at all. Is it possible the entire unit was kidnapped and brainwashed to believe Shaw is a war hero as part of a plot to seize the White House? Some very powerful people at Manchurian Global corporation appear desperate to stop him from finding out.—A Prentiss",
    "name": "The Manchurian Candidate",
    "genres": [
        "Drama",
        "Mystery",
        "Sci-Fi"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZDU2YjA4MmItODk0OS00OTllLWFmNzUtMTg2ZmM3YWYzOGFmXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_QL75_UY281_CR3,0,190,281_.jpg"
}