{
    "filename": "Fifth-Element,-The_script.txt",
    "imdb_id": "tt0119116",
    "imdb_url": "https://www.imdb.com/title/tt0119116",
    "characters": [
        "Zorg",
        "General Staedert",
        "Cornelius",
        "President Lindberg (as Tommy 'Tiny' Lister Jr.)",
        "General Munro",
        "Fog",
        "Mactilburgh",
        "David (as Charlie Creed Miles)",
        "Korben Dallas",
        "Professor Pacoli",
        "Right Arm",
        "Billy",
        "Ruby Rhod",
        "Mugger",
        "Leeloo"
    ],
    "dialogues": {
        "Zorg": "CLOSE ON: A pair of feet limping heavily.  A MAN comes alongside them.   Fire 1000.    Aknot?  Is that you?  The LEADER nods. A disgusted look stamps Zorg's features.   ...What an ugly face! Doesn't suit you at all! Take it off...  AKNOT's face burns away revealing the head of a monstrous MANGALORE.   That's better! Never be ashamed of who you are... You're warriors... be proud...  AKNOT says nothing, but if his eyes could talk!   So what if the Federal Army crushed your entire race and scattered your people to the wind... Your time for revenge is at hand... Voila... the ZF1.  He takes out a weapon from one a crate and goes into a sales pitch.    ...It's light... the handle's adjustable for easy carrying... good for righties and lefties.  Meanwhile, two MEN set up a mannequin rigged with various defense mechanisms at the far end of the warehouse.   ... Breaks down into four parts, undetectable by X-rays.. It's the ideal weapon for quick, discreet interventions.  A word on fire power: Titanium recharger. 3000 round clip with bursts of 3 to 300. With the replay button, another Zorg innovation, it's even easier... one shot.  He fires at the mannequin.   ... and replay sends every following shot to the same location...  Zorg spins around, the rounds all hit the mannequin.    I recharge, but the enemy has launched a cowardly sneak attack from behind, the automirror takes care of that.  Gives me the time to turn around and finish the job. 300 round bursts, then there are the Zorg oldies...  He fires off each item he names.   ...Rocket launcher.  The always efficient flame thrower... My favorite. Our famous net launcher, the arrow launcher, with exploding or poisonous gas heads - very practical. And for the grand finale, the all-new ice-cube system!  The mannequin has been blasted into a pile of ashes covered by a net,. stuck with arrows, the whole mess frozen solid. He tosses the weapon into AKNOT's hands.   ...Four full crates, delivered right on time! What about you, my dear Aknot, did you bring me what I asked you for?  AKNOT sets the case on a crate.  Zorg gloats while stroking the case.   ...Magnificent.  Zorg smiles, takes a deep breath, opens the case.  It's empty    AKNOT looks into the case.  Things grow tense.   Alright..I've got an open mind here.. anyone care to explain?     I'm fucked!  Zorg calmly closes the case and gives Aknot a blood-chilling stare.    A case with four stones in it. Not one! Not two or three! But four!!! Four stones!!! What the fuck am I supposed to do with an EMPTY case?!!  AKNOT's men grow edgy.    But you can still count.  Look... my fingers.  He holds up four fingers.   ...Four stones, four crates... Zero stones...    So, you are a merchant, after all.  Leave them one crate.  For the cause!  Zorg's men leave a crate and exit with the other three.    Zorg walks along the street to his limo.  RIGHT ARM carries the empty case.   I don't like warriors!  They're too narrow-minded, no sublety.  Worse, they fight for hopeless causes..for honor! Honor has killed millions of people but hasn't saved a single one.  You know what -- do I like though, I like killer.   A real dyed in the wool killer.  Cold-blooded. Clean.  Methodical.  Thorough.  A killer, when he picked up the ZF1, would've immediately asked about the little red button on the bottom of the gun.    The warriors have all taken a weapon. One of them inspects his ZF1.  He turns it over and notices the little red button. He presses it.    Behind Zorg, an ear-shattering explosion levels the warehouse.    Bring the priest.    Zorg turns to Cornelius.   Zorg. Jean-Baptiste Emmanuel Zorg... nice to see you again   I'm glad you got your memory back, Father... Because you're going to need it... Where are the stones?   Personally, they are of no interest to me, I'd rather sell weapons..but I have a customer... so tell me...   Why?  What's wrong with me?   Ah, Father... You are so wrong. Let me explain...  Zorg leads Cornelius into his inner office.   ...would you like a drink?   Follow me.. Life, which you so nobly serve, comes from destruction. Look at this empty glass.  Zorg pushes the glass with his finger.   Here it is... peaceful... serene... but if it is...  Zorg pushes the glass off the table.  It shatters on the floor.   Destroyed...  Small individual robots, both free-wheeling and integrated, come zipping out to clean up the mess.   ...Look at all these little things... so busy all of a sudden. Notice how each one is useful. What a lovely ballet, so full of form and color.  So full of..life!   Yes but... by that simple gesture of destruction. I gave work to at least fifty people today. The engineers, the technicians, the mechanics. Fifty people who will be able to feed their children so they can grow up big and strong.  Children who will have children of their own, adding to the great cycle of life!  Cornelius sits in silence.   Father, by creating a little destruction, I am, in fact, encouraging life!  So, in reality, you and I are in the same business!   Let me reassure you Father..I will never kill more people in my entire life than religion has killed in the last 2000 years.  Zorg smiles, holds up the glass and takes a drink. Unfortunately, he chokes on the cherry.  Unable to breathe, Zorg starts to panic.   You saved my life... So, I'm going to spare yours.  Throw him out!  The GUARDS throw Cornelius out.    I know...  The GUARDS drag Cornelius out of the office.   ...Torture whoever you want, the president if you have to but I want those Stones. You have an hour.  Right Arm salutes and hurries out of the office.          Right Arm is on the phone, facing Zorg.   Don't come back without the Stones.    Zorg's Right Arm is in a phone booth in the middle of the hall.    I'm listening.   This is a joke, right?     I cannot hear you. We have a bad connection here.  What's your number?  Right Arm reads off the phone number.   I'll call you back.    A keyboard slowly appears in front of Zorg.    278... 500...   3... 2... 1...  - The engines at full blast.  - The stewardess in close to screaming.    Picasso purrs contentedly on Zorg's lap.  The phone rings.   Yes... Zorg here.  The voice is feeble.  It comes from the far reaches of time, from the bowels of the universe.   No... not at all.  Where are you?  SHADOW'S breathing is awesome.   Really? Maybe I can get you on my screen and see you at last!  Zorg brings up a huge screen and pushes a few buttons.  In the middle of an electronic snowstorm, a blackish, vaguely human, quiverinq form appears. Two eyes, like lava, give an idea where the head is. Zorg feels sick.   Got it.    Fine, just fine!  I'll have the 4 pieces you asked for any time now.  But it wasn't easy. My costs have tripled.  Shadow pauses an instant.  A black slimy liquid starts to ooze from the top of the screen.  Zorg is feeling worse all the time.   The Stones will be here. I'll see to it personally!    More than enough.   My compliments, little lady! ...And thanks for doing all the dirty work! I couldn't have done it any better myself!  ...Now hand over the Stones!  Leeloo smiles and hands him the case.  Zorg arms the ZF1 and gets ready to kill her.   Nice knowing you.  Leeloo catches on quickly.  She kicks the scotch bottle on the floor into the gun which throws Zorg's shot off.  She jumps to the ceiling and disappears in an air vent.  Furious, Zorg fires at the ceiling.    You can run but you can't hide...   You want something done, do it yourself!   Nothing I can't fix myself.  He brings up the ZF1 and wipes out the garage.    Allow me...  Zorg slips a small magnetic card in the bomb, it starts to count down from 5 minutes.   Just for the fun of it.  Loc Rhod faints.   Well, what do we have here? Is this Korben Dallas? The famous winner of the Gemini Croquette contest? Or is this Korben Dallas from Special Section sent by old Lindberg himself.  Korben doesn't reply.   ...In any event, whoever you are, I was glad to meet you.  Zorg fires at Korben who figures he is dead.  Nothing.  Zorg tries again. Nada.  The clip is empty.  Zorg starts to panic.   ...A 3000 round clip! I didn't fire off 3000 rounds... did I?   I didn't fire three thousand rounds...    Maximum Protection.  A mauve-colored magnetic shield closes around Zorg like an indestructible sarcophagus.   How's that? Can you hear me better now?   Who gives a shit! I didn't come here to listen to music! Listen up instead of running off at the mouth! The batteries on my phone are almost gone.   Dispatch me another ZFX200 immediately. Someone stole mine.   I'm not at the hotel!   Hello?...    Stay calm.... stay calm...",
        "General": "Sir..the Mondoshawan do not belong to the federation. We do not know their intention.. I must recommend a full trinuclear assault..   Mr. President, the attack was launched by two unregistered warships.   Yes, sir.",
        "Staedert": "Don't you have anything?  Not even a temperature?   ...Send out a probe.   I can hear you, Mr. President, but I can't see you .  The President grabs the mini-camera on his desk and yanks it around to face him. His face fills the screen.   Perfect, Mr. President.   There are no results from the chemical and molecular analysis as of yet, all the calibers are overshot..we're hoping a thermo nucleatic imaging..   Not yet Sir..The only thing we know is it just keeps getting bigger!   Wait or act.   My philosophy Mr. President is shoot first ask questions later. I don't like uninvited guests.   Mr. President, we're at crisis point.  The President looks puzzled.    (to the CAPTAIN) ..Up front loading of a 120 ZZR missile. Marker lights on the objective.    I don't, Mr. President.   Load a series of 740 missiles. Maximum shield protection.   I'm about to, Mr. President.    ...What do we have that's bigger than 240?    ... Good God!  The flame fills the screen with a horrendous NOISE that....",
        "Cornelius": "Imagine for a moment that this. thing is not anything that can be identified because it prefers not to be, because it is the antithesis of all we are. Because it is evil.. TOTAL EVIL.   Evil begets evil, Mr. President. Shooting would only make it stronger.   Time is of no importance, Mr. President. Only life is important.   The most terrible intelligence imaginable, Mr. President.  The President hesitates.    We have forty-eight hours, the time it needs to adapt itself to our living conditions.   And then it will be too late. The goal of evil is to wipe out life! All forms of life. For all eternity...Life upsets it.  The President appears upset himself by this image.    Yes..thank God..    The Mondoshawans don't belong to the Federated Territories, but they are peaceful... in their possession are the four elements of life. These elements when they are gathered around a fifth: The Supreme Being, ultimate warrior, created to protect life......  The SUPREME BEING is standing, as if frozen in armor.  All we see is the bottom half of his body.  Big metallic gloves hold the case engraved with the emblem of the three suns containing the four Sacred Stones.   ..will produce what the ancients called the light of creation, the light of total goodness which is the only thing that can defeat EVIL.  The President points to the spot occupied by the 5th element.   White turns to black.  Light to Dark. Life to Death.  For all eternity.  The President's nerves quiver.   They are the only ones who can help..    Thank you, Mr. President.   We are lost!    What are we going to do?    The door opens. Korben is there with the unconscious girl in his arms.    Weddings are one floor down. Congratulations.  Cornelius closes the door.  The doorbell RINGS again.    That's me.  But I don't know who she is... where did you find her?    The fifth element.  He faints dead away.  Korben, with the girl still in his arms looks around helpless.    In his armchair, Cornelius gets woken by a slap in the face.    Who are you?   The girl?  Cornalius gets up.  He looks at the handle.    He's a she!    There's not a moment to lose! Wake her up, but be gentle about it!  This woman is mankind's most precious possession! She is... perfect!   Uh yes, we're cousins..distant cousins..  Cornelius runs into the next room.  Korben looks at the girl, goes to slap her, then changes his mind.  Her beauty troubles him.  He hesitates, then, gently caresses her cheek. Her skin seems so soft, so fragile.   It's a miracle!!!    I can't wear these clothes! This calls for dignity! I have to dress the part!  He opens a closet filled with identical robes and plunges in, disappearing as David looks on, uncomprehending.    Korben gently kisses the girl's cheeks, but she doesn't respond.  He looks around then kisses her on the lips.  The girl's eyes snap open. When Korben straightens up he discovers his own gun jammed under his chin.   The Supreme Being, the fifth element is here, in our parish!!! It's a miracle!!!   Appipulai Leeloo Minai..    At your service.  LEELOO lowers her guard starts to laugh.  An irresistible childish laugh. Korben smiles.   Absolutely sure There's the triple suns on her gloves!  David bows low, but his eyes glance up at Leeloo.  Cornelius begins to lead Korben toward the door, hustling him out.   She's an exception..   Thank you so much for your help Mr...?   Yes. That's fine! Thank you very much. A thousand times over!   She's fine, really..don't you worry.. just needs some rest..she's had a very long trip.   It means, \"Never without my permission\".    Leeloo has a towel wrapped around her, it looks like she just took a shower.  She sits  in front of a computer wolfing down some chicken.  Data scrolls by on the screen.  David watches from the corner, in awe.   Learning our history! The last 5000 years that she missed! She's been out of circulation a while, you know.  Leeloo breaks into her childish laughter.   What're you laughing about?   Yes. Of course..  Leeloo takes her plate out of the microwave.  A steaming plate heaped with chicken and exotic vegetables.   Leeloo..I'm sorry to interrupt you but..  She sits back down in front of the screen and chomps away heavily on her second chicken.  Cornelius sits opposite her. and holds up the case handle.    The case..with the stones... Where is it?   The case was stolen?  Leeloo nods her head, quite unperturbed and continues to devour the food in front of her.    Who in gods name would do such a thing?    ... and David enters carrying a bundle of clothes.   There was this guy with a limp who came a month ago..said he was an art dealer ... Asking all these questions about the Sacred Stones..at the time I didn't think anything of it.. What was his name? I'm so bad with names...   Perfect.  Leeloo finishes dressing. She is delighted.   Leeloo?  The Stones... We must get them back.  Leeloo settles down, sits at the computer and turns it on.   You know exactly where they are!    Leeloo breaks into her childish laughter once again.    What do you mean empty?    Leeloo explains what happened in her language.    She says that the Guardians never really had much faith in humans. They were afraid of being attacked. The stones were given to someone they could trust who took another route. She's supposed to contact this person in a little less than twelve hours from now in a hotel. She's looking for the address!  A map of the stars flashes onto the screen, Leeloo points.   ...We're saved!    Leeloo is polishing of' an immense pile of dessert as David bangs away at the computer.   Good work, my son.  Now all we need is a way to get there.  The doorbell rings.   I'll get it.  Finish your work my son.  Cornelius opens to Right Arm with armed escort.   My son?   Mr. Who?     I remember you now..the so called art dealer.   ...Why on earth do the stones interest you?   Even it I did know where the stones were I would never tell somebody like you.   ...I'm a priest! I'm here to serve life, All you want to do is destroy it.   No thank you.   They are robots!  A SERVANT comes in pours water in another glass.  Zorg tosses a cherry into it.   Destroying a glass is one thing..killing people with the weapons you produce is quite another.    Where's the robot to pat your back?  Zorg falls, writhing, on his desk, inadvertently hitting buttons which trigger a slew of little mechanisms.  They pop out all over the desk. True chaos reigns.  Even a cage appears, holding a Souliman Aktapan, a fat multicolored beastie, PICASSO, who seems surprised to be out in daylight.  He licks his half-dead master in thanks.  Cornelius gets up and walks around the desk.  Zorg motions for help.   Can I give you a hand?  Cornelius whacks him on the back.  The cherry comes flying out.  Zorg regains control of himself. GUARDS come running in.   You are a monster, Zorg!   I'm sorry to have to resort to such methods, but we heard about your good luck on he radio and we need the tickets to Fhloston.   We're not going on vacation..we're on a mission..    We have to save the world.   Of course.   Oh my god oh my god..  Korben pushes a button sending the fridge to the next floor.  A shower takes it's place.   What are you doing?   No, I'm not proud of myself... But we don't have the luxury of choice.   Leeloo, be careful.  He turns to David who in holding his bloody nose.   Did you get them?  David hands Cornelius two passports.   Excellent... Leeloo Dallas.  He hands it to her.  The name makes her smile.   And Korben David Dallas.  She frowns.   I can't pretend to be your husband... David's in great shape.  She looks at David holding his bloody nose.   He'll protect you. Go on... See the Diva... get the Stones... See you at the temple... God be with you.  ANGLE ON: Korben comes rushing into the airport. Walking quickly, he scopes the hall looking for Leeloo. A POLICE PATROL bearing down on the STRIKERS jostles him. The cops open fire.  The strikers dive into the garbage and disappear.    I feel so guilty sending her to do the dirty work. I know she was made to be strong but she's also so fragile... So human. You know what I mean?  The bartender, a robot, nods his head as he pours Cornelius a drink.   Yeah...   Where's Leeloo?   It's all my fault.  I'm the servant... It's my mission! Here!  He hands David the Temple Key from around his neck.   Here's the key to the Temple.. Prepare for our arrival!  Cornelius tosses David's drink into his own, downs it all in one shot, and takes off, passing the Mangalore couple headed for the exit.  They are very nervous. A police patrol is coming.  This time, it seems to be for them.   Where was I?   And the smile of an angel?  They all turn to look at him.    May I speak to you alone.   ...My God!    Mangalores! The Diva's suite! They want the Sacred Stones! They must be stopped. We must stop them!. I'm going to free you but you must promise to help me!  The Chief of Police nods his agreement.    I told you...    Of course I was telling you the truth!... If you had listened to me in the first place, we wouldn't be in this predicament now!   You're probably very angry with me and I quite understand. But I want you to know I'm fighting for a noble cause.   Leeloo's in trouble?   Uh.. Have you tried the Diva's suite?  Korben realizes that Cornelius in probably right.   Probably the time remaining before it explodes.  Cornelius smiles and continues his search.   Doesn't matter all you need are your legs.   There's a General on the phone... His name's Mambo, I think.   Later, David! Later! There's not a minute to lose!  The small group enters the chapel.    Uh, this one... must be water!  It's obvious he doesn't know where to put it.   Theoretically, yes! The four Stones form the beam and the Fifth Element is supposed to stand in the middle there, but... I don't have the reference book. I've never seen the Stones work!  Korben can't believe his ears.  He tears the Stone out of Cornelius' hand and studies the inscriptions.  He goes over to one of the four bases the stones rest on and tries to figure it out.  The symbol of air is on the Stone, the same as on the base.    Yes, of course, but... The Stones are shut! They have to be open for it to work.   That's what I'm saying.   Come on Leeloo! Come on!  The beam loses its intensity.  Leeloo crumples to the floor.    Tell her, for God's sake!  A bit of the black acid falls on Loc Rhod's shirt setting it on fire.  He rips if off.",
        "Munro": "Mr. President, the attack was launched by two unregistered warships.   Yes, sir.   This is all that survived?   Have you identified it?   Talk English Doc.   Sounds like a freak of nature to me.    Is there any danger? Some kind of virus?   OK, go ahead! But Mr. Perfect better be polite... otherwise I turn him into cat food.  Mactilburgh starts the operation rolling as Munro puts his hand on the sell-destruct button, ready to use it.  Thousands of cells form in the heart of the generator, an assemblage of DNA elements.  Then the cells move down a tube, like a fluid, and gather in an imprint of a HUMAN body.  Step by step bones are reconstructed, then the nervous and muscular systems. Whole veins wrap around the muscles.  An entire body is reconstructing before our very eyes.    Wonderful!  The meter slows, drops to zero.   ...I'd, uh , like to get a few pictures for the archives before she wakes up.  Mactilburgh looks at him with a grin.  A remote-control camera approaches the girl's face, a flash goes off.  Blinded by the flash, the girl jumps and screams.  She cowers in a corner, shaking from the cold, darting eyes everywhere looking for the case she was holding.    What's she saying?    This thing solid?    You're gonna have to learn to communicate better than that angel if you want out.  Munro dangles the key on a chain that will let her out.  The girl rams her fist right through the window.  She grabs the key and yanks it.  The chain snaps tight and Munro slams into the window knocking himself out.  The girl puts her hand through the window again, unlocks the chamber and steps out.  She is still bit wobbly on her legs.  Two GUARDS try to grab her. She sends them flying across the room. Mactilburgh is most impressed.  He sets off a general alarm.   I managed to contact the Mondoshawan. They deplore the incident, but accept our apologies.   The-Stones weren't aboard the ship.   The Mondoshawan never fully trusted the human race..they felt we're too unpredictable.. so they gave up the Stones to somebody they do trust. Her name is Plavalaguna. She's a Diva and she's going to sing at the charity ball on Fhloston Paradise in a few hours.  She has the Stones with her.  The President breathes easier.  Zorg's Right Arm is delighted.   Don't worry, Sir. I have the perfect one.    Major Dallas, if our calculations are correct you still have 57 hours owed to the Federal Army on your enlistment which is more than you will need for a mission of the utmost importance.   To save the world.   You're to leave immediately for Fhloston Paradise. Retrieve four Stones from the Diva Plavalaguna. And bring them back with the utmost discretion as possible. Any questions'?   Three reasons... One: As part of The Elite Special Forces Unit of the Federated Army you are an expert in the use of all weapons and spacecraft needed for this mission.  Munro pulls out a long list of documents.   Two: Of all the members of your unit you were the most highly decorated.   You're the only one left alive...  Munro removes the message Korben hasn't bothered to look at.   Don't you open your messages?    You have won the annual Gemini contest and a trip to Fhloston Paradise. For two. Congratulations. Here are your tickets.  He hands Korben the tickets.  Korben gets it.   Major Iceborg will accompany you... as your wife...  The idea of taking a trip with Iceborg makes him sick.   Old tricks are the best tricks eh?   Why not?    What is it?  Korben has two seconds to make up something to get rid of Munro.   I thought you were divorced.   Three of us will never fit in there!    ...Mangalores!   From us!  The President gives Munro a hard look.   Major Dallas has the Five Elements on board. The priest is guiding them directly to the temple.  President Lindberg closes his eyes in relief.   Munro here. President Lindberg wants to talk to you.  Hold the line.  The President clears his throat and takes the phone.   They just landed in the desert.   We've lost contact with them.   Mr. President, let me introduce you to Professor Mactilburgh, who runs the center.",
        "Fog": "The Diva's ship is coming in.   Yes. Sir!   Hello, I'm head of security. Everything is in order. You can...  The Diva enters her suite without letting him finish.   ...make yourselves at home safely. If you need anything...give it a knock!   Thanks for your help.",
        "Mactilburgh": "Actually only one cell survived..   It's not that easy..we've never encountered anything like it before..you see normal human beings have 40 DNA memo groums..which is more than enough for any species to perpetuate itself..This one has 200,000.   This cell is like a huge library. It has infinite genetic knowledge stored inside. Almost like it was...engineered.   Yes... I can't wait to meet him.  They pass into the lab.    The compositional elements of his DNA chain are the same as ours, there are simply more of them tightly packed. His knowledge is probably limitless..   We put it through the cellular hygiene detector. The cell is for lack of a better word... perfect.  Munro hesitates a moment.  Then he sighs and uses his personal key to open the self-destruct box.    ...This is the crucial phase, The reconstruction of pigment. Cells are bombarded with slightly greasy solar atoms which forces the body cells to react, to protect themselves. That means growing skin. Clever, eh?    Activate life support system.  An electrical discharge fills the glass chamber causing the body inside to jerk. After a few moments of silence, the SOUND of a heartbeat fills the room over the loudspeaker.   Remove the shield.  The ASSISTANT automatically removes the ultra-violet shield which slowly reveals... a woman... nude... young... and very beautiful.  Munro stands there gaping.  Not quite his vision of the Supreme Being.  Mactilburgh glances at Munro and gently pushes his hand away from the self-destruct button.    I told you ... perfect!  Munro is hypnotized by the GIRL's beauty.    Activate the phonic detector.  The girl kicks the window repeatedly.   And give her a light sedative... and something to wear!  The ASSISTANT hits a button.  A pile of clothes drops out of a trapdoor in the ceiling.  She snatches up the clothes angrily and dresses quickly. Munro draws closer to the glass window.  He watches her dress with undisguised pleasure.    An elephant couldn't crack it.  The Girl finishes dressing.   It's an honor to receive you. Mr. President.   They were so tired from their ordeal that we put them in the reactor this morning..   I.. uh.. they need five more minutes, Mr. President.  The President, pressed for time, looks over to his aide who in struggling with a phone call.",
        "Korben": "I'm coming.  He grabs the phone and crosses his tiny apartment (27 feet long by 6 feet wide) heading for the door, patting himself for a light.  Behind him, the bed makes itself automatically.    Yeah?     Hi sweetie!  ...A Medal of Honor Certificate to Major Dallas   I was talking to the cat.   At least, the cat comes back.   I don't want a million - I just want one.  A perfect one.   I just found a picture of you.   Like shit.  Korben finds a box of matches with three matches.  He strikes one. It does not light.  Korben opens the fridge, bare, except for an empty can of GEMINI croquettes. On the packet is an ad:   I don't need one.   Finger!  I'm driving a cab now, not a space fighter!!    Uh... at least fifty.   Cheers!    A thermo nuclear explosion fills a T.V. screen..Which Korben's cat watches with interest.  Korben is about to exit the apartment.   Don't watch it all day, it'll rot your mind. Bye sweetie..  In response, the cat meows.  Korben opens the door to..A huge gun, brandished by a nervous MUGGER, pointing right in his face.   Been here long?   Isn't that a Z140? Alleviated titanium. Neuro charged assault model?   You know you could hurt someone with this puppy..good thing it's not loaded..  The mugger is lost.  He looks at his weapon.   You gotta push the little yellow button...  Korben points to the button on the side of the gun.  The mugger takes his advice.   You're welcome..  And with lightning speed, Korben blasts the mugger with a straight right hand, sending him down for the count.  Korben retrieves the gun.   ..you know these things are VERY illegal.. you could get in a shit load of trouble.. I better hang onto it for you..  As the mugger clears his head, Korben opens a drawer next to him which is full of similar guns! The mugger's eyes pop out of his head.  He scampers to his feet and runs off.  Korben shrugs, exits his apartment, and closes the door.  The cat watches a nuclear holocaust on T.V.,  uninterrupted.    Korben enters his taxi.  A robotic voice greets him.   How you doing this morning?  Sleep OK? I didn't.  Korben hits a button.  The garage door starts to open.   I had the worst goddamn nightmare.   Thanks for reminding me..  As the garage door lifts, the Megalopolis that is New York City in the 23rd century comes into view.  Startling in it's height, and breath.   Right..  He lets the gear slip.  The taxi rockets off into the City.   You have one point left on your license. Have a good day.  Korben sighs and looks in the back seat to see what the damages are.  The girl, a bit dazed , emerges from the debris and sits up. There's some blood on her face.  Korben is stunned. The girl's still alive and... so beautiful.  His heart heads for a meltdown.    ...'Scuse me?  A police car with wailing sirens halts in front of Korben.    Sorry, Hon, but I only got one point left on my license and I gotta get to the garage!  The police car presses up against the cab.  Doors slide open.  Huge guns point at her.  Korben feels lousy.  The girl's helpless, there are tears in her eyes, she looks exhausted. Korben glances at her in the rear view mirror. She's looking all around to find something to help her communicate with him.  Her POV: an ad on the back of the seat. An 800 number to help an orphanage. A teary photo of a kid over the words Please Help.  She shoots to Korben a look of pure distress.   Don't put me in this position... I can't... I'm late as it is...  But he cannot say no to her eyes.   Finger's gonna kill me.  Korben shuts oft the meter and floors it, sideswiping the police car as he roars away.   I hate when people cry... I got no defense...  The police car takes out after him, sirens screeching.  An insane chase ensues.   It there's one thing I don't need advice on, it's how to drive.  Korben turns his cab sideways and scrapes through a narrow passageway, ripping his taxi light from the roof.  The police car smashes into the wall.  The other one brakes just in time.   We'll wait till things quiet down a bit. You mind?  The girl grabs his shirt collar and pulls him close, whispers in his ear.   You're not that bad... Come on we'll get you to a doctor.  The girl hands him the handle of the case, struck with the three Egyptian suns.   Vito Cornelius?  The girl nods, then faints.  Korben is somewhat lost faced with so much mystery.    Excuse me, I'm looking for a priest.   She's not my bride, she's my fare. She's looking for this Vito Cornelius. According to the phone guide he lives here.   She dropped in on me... holding this.  Korben hands him the metal handle with the three Egyptian suns, stamped on it.    Finger's gonna kill me...   I brought the girl remember?   Yeah! She dropped in on me. I mean on my taxi... talking... this... this bizarre language...  And then it dawns on Cornelius who the girl is.    You noticed...   So you do know her.   Perfect...    I'm sorry, it's just that... I was told to wake you up gently, so I figured...  The girl pauses a moment.  She stares at him, looks puzzled.   You're right, I was wrong! I shouldn't have kissed you... especially since we haven't been introduced and...  Here, it's a bit late, but... my name is Korben, Korben Dallas. Keep it, you never know, maybe... you'll need a cab one day.  I'll be happy to open the door this time!.  The girl hesitates, then snatches the card like a wild animal.   ...What's your name?    Hey,  that's... cute... Do you have a nickname, something a little... shorter?   That's... really cute...  Cornelius bursts into the room.  She turns the gun on him. He bows before her.   They all like this in your family, father?   Dallas. Korben Dallas.  Cornelius takes his arm. Leeloo stops laughing when she sees Korben leaving.   I might call to check up on her, you know... to see if she's better?   I know. I was there when she arrived.  Cornelius is about to close the door.  Korben's hand blocks it.   Excuse me! Just one thing!  She said something to me a while ago and... I don't really get it... Akta Gamat?   That's what I thought.  Cornelius slams the door in his face.   ...Thanks.    Korben beads down the hallway. He passes his NEIGHBOR.   Evening...   ...Thanks... You, too.  Korben enters his-apartment.    The door slides back and the cat comes rubbing up against him, tail in the air.   Oh god. I forgot your food ... I'm really sorry! How about a nice Thai nosh to apologize? How does that sound, huh?  The cat meows, appeased, just an the phone rings.   Hello?   Finger..man..I'm sorry..listen..I was on the way over but I had a fare fall into my lap.. y'know one of those big fares you just can't resist..   5'7\", green eyes... long legs... great skin... perfect..  Korben takes out a cigarette.    Leeloo..    Korben is finishing a Thai meal, cooked by a Thai on his mini restaurant anchored at the window. The cat eats next to Korben, contented.   So you forgive me?  The cat meows just as a red light blinks, announcing the arrival of a message in a glass tube.  Korben ignores it.   I've never gotten a message that wasn't bad news.   The last two messages I got?  The first one was from my wife telling me she was leaving! And the second was from my lawyer telling me he was leaving too... with my wife.   At least I won lunch.        C.U. The most disgusting dessert ever made.  Korben looks at it shimmying on a plate as the Thai serves it to him proudly.   Saved by the bell.  Korben rises to get his cigarettes, and answer the phone.   ...Hello?    Hi Ma...    Yes ma..  Korben sighs and puts the match back in the box.  Korben enters his code on the keypad the Thai is holding.    Go on... This is gonna take a while!  The Thai casts oft.  Korben closes the window.   Other than that... You all right?    I'm coming!. Ma, what're you talking about?   All I want is an explanation! I just got in, I lost my job. I smashed my cab. I got mugged, but other than that everything's peachy, Ma, thanks for asking!! Now settle down and explain to me calmly..  A message drops in his tube.  The red light goes on.   Ma. If I'd won, I'd know about it. Someone would have notified me.   Ma.. it's the door. I'll call you back.  Korben hangs up before his mother can say anything and heads for the door.  Before he gets there it opens, General Munro enters followed by a Captain and a Major. MAJOR ICEBORG is a woman. All she needs to become a man is a mustache. Munro opens a file.   What mission?   Where have I heard this song before?    Just one... why me?   And the third one?   I've had enough good news for today   You rigged the contest?  Munro nods.    You couldn't come up with something a little more discreet?   I'm not going.   One reason... I want to stay the only one left alive.    Leeloo and Cornelius search for Korben's apartment. Leeloo carries the card Korben gave her.  Cornelius finds the apartment, and yanks the. number off the door.  He waves Leeloo over as his hand goes to the bell.    The doorbell rings.   ...Scuse me.  Korben goes to the door and looks out the peephole: the beautiful Leeloo. Korben panics, overcome with happiness.   ...Shit!   It's my wife.   I mean my future.. my ex.. My future ex.. if she sees you here I'm finished.  She hates you guys. It's what killed us in the first place. Please...  He puts them in the fridge, shoving the jellyfish cake in Iceborg's hands.   ...Sorry, General, but we've got no choice! It'll only take a minute! Let me set up another meeting and I'll be back.    Oh, yes you will...  Korben slams the fridge door.  The doorbell RINGS again.   ...Coming!  He whips through his place in ten seconds, gathers up things laying about, shuts drawers, rolls up his laundry in the folding bed. He brushes his hair back and opens the door with a big smile only to discover a gun stuck between his eyes held by Cornelius.   I suppose that means \"Hi\" ?   Is that the usual way priests go on vacation?   What kind of mission?    Good luck..   Father, I was in the Army for awhile and every time they told us we were on a mission to save the world the only thing that changed was I lost a lot of friends. So thanks for the offer.. but no thanks.  Cornelius is disappointed.  Leeloo looks crestfallen.   I'm sorry..    A group of POLICEMEN bursts into the hallway.  One of the cops enters a code on the police wall box.  A device descends from the ceiling, a flashing light-siren, a VOICE fills the air.   Leeloo, hide in here and don't move!  Leeloo hops in.  Korben tosses Cornelius on the bed.   Trying to save your ass so you can save the world.  ..and hits a button on the wall.  The bed disappears into the wall.  Korben grabs his tickets and slides them in his belt.    Meanwhile, the automatic police voice continues.   No, I'm a meat popsicle.    Korben still has his hands to the wall.   Wrong answer.  SHOT O.S. EXPLOSION.  Scuffle.    Korben opens the shower door.  Leeloo is soaking wet, her teeth chattering from the cold.   I'm really sorry.. there wasn't time.  His eyes fall on an old blanket.   Here let me wrap you up.  Korben wraps her in an blanket and vigoroualy rubs her back.  Leeloo warms gradually and snuggles closer to that warm comfortable shoulder. Korben's rubbing slows, looking more like caresses.   ..It's funny.  I've met you twice today  and you've ended up in my arms both times.  Leeloo suddenly realizes that she has maybe gone a bit too far. She recovers, looking embarrassed too.   Uh..you're welcome.  The intimacy makes him nervous.  He looks for a diversion.   Coffee!  That's what you need! A nice, hot cup of coffee!  He pushes a button on the coffee machine.   With some honey!  You'll see, honey's great!...  Korben rummages through the drawer.  Leeloo, innocent, doesn't seem to quite understand everything that is going on.   A hot cup of coffee... with honey...  He rummages through the cupboard, exceedingly nervous.  Leeloo smiles and begins to look around.  She opens a drawer and comes upon..    I've got this great honey somewhere. You know about honey?  There used to be these little animals who made it with antenna...  ..pictures of Major Korben Dallas War Hero.   ..and these other animals who ate it.. one were bees the other were bears..  She looks back to the man fumbling for honey.   I forget which ate it and which made it but..  And she smiles.   Here it is!  Korben holds up the jar of honey.   Taste this...  Leeloo innocently sticks his finger in the jar then puts it in her mouth.   It... melts in your mouth, doesn't it?  She savors the honey, slowly; sensually.  Her lips shine with honey.  Her eyes narrow with pleasure.  Korben is hypnotized by her lips, like a moth attracted to a flame.  He begins to lose control, which makes him nervous.  An indistinct sound comes from the wall.  But Korben is so entranced with the sight of Leeloo licking her honied fingers, he doesn't hear it until it becomes quite a racket.   You hear that?   Oh god!  Korben pushes the button on the wall.  The bed pops out, fully made, with Cornelius tucked in it, struggling to get out.   I'm really sorry.. let me help you..  Korben begins to pull at the covers when..   What?  He turns to Leeloo struggling out of her wet clothes. His breath is taken away by the sight of her perfect body.  Cornelius whacks him heavily on the head with a lamp.  Korben drops to the floor.    The POLICE exit the elevator and head for the front door.  A cop suddenly takes a hit from a silencer, then a second. Others are bashed on the head by MANGALORE warriors.  One of them picks up the prisoner bag, takes it into a small shed.    Korben gets unsteadily to his feet, some blood drips down his face. He daubs at it.   Jesus!... Some priest!  The phone rings, he manages to answer.   Yeah?   ...Not yet.  He hangs up.  Korben opens the fridge door.  The three officers are frozen solid. Korben grabs some ice, presses it to his forehead.   I'll take the mission.  He closes the door.    Hey! I really thought I was going to miss my flight!  Thanks, kid! You put the luggage on the conveyor belt?    Great! Now beat it!  Paralyzed, David leaves.  Korben turns to the attendant.   Excuse me.  I was so afraid I'd miss the flight that I sent the kid here to pick up my boarding card.  He looks at David's fake ID.   ...My cousin David...  Leeloo is unable to hold back a smile.   Uh, yes... Newlyweds.  You know how it is... Love at first sight. You meet, something goes tilt,. you get married, you hardly know each other. Right, darling?  Leeloo rips her boarding card out of the attendant's hand.   Took the words right out of my mouth. Go on... I'll be right with you.  It's our honeymoon. We're going to use the trip to get to know each other better.  He winks at the stewardess.   Listen... I don't want to be interviewed. I'd prefer to remain anonymous.  The stewardess stops in the corridor.    You gotta be kidding!  The stewardess smiles and shakes her head.  The door next to him suddenly swings open and smashes him in the face.  In walks LOC RHOD amidst a tornado of music and security guards.  He is young, good-looking, eccentric, charming as an elf or sly as a fox.  A bundle of energy.  He is the 24th century's most popular DJ.    ...Hi.   Uh... not really.  Loc Rhod lets go of Korben's arm and grabs the Stewardess.    I didn't come here to play Dumbo on the radio. So tomorrow between 5 and 7 give yourself a hand, that clear pal?   Not hard to find you...just follow the Chaos...  Leeloo smiles, as if complimented.   Leeloo, listen to me... these tickets... they're not mine... I mean they are, but not for vacation like everyone thinks... I'm on an operation... and if I didn't come get you, you'd be in a shitload of trouble... I'd love to be on vacation with you... but now.... now I've got to work... And Leeloo... I would love to work in peace.  Leeloo types in \"LOVE\" on the keyboard.   Yes! But \"love\" isn't the operative word here, PEACE is!  Leeloo types in this new word.   Sometimes you can't learn everything from a screen..sometimes it's better to ask someone who has experience..   Know what? On that subject maybe you'd be better off asking the screen.  He turns the computer back on.   Finished what?   Which one?   You learned 900 languages in five minutes?!   I know how to say \"Hello\". Teach me how to say \"Good-bye\", that's all I need.   Apipoussan?    Uh...    Help...  Luckily, a stewardess smiles at him through the box window.    Pardon me.  Excuse me. I'm trying to reach my wife.. Sorry!   I'll take you to the bar, after that, you're on your own.   I don't think this is a good time...    Yeah, very big, a giant.    The door opens.  The HOSTESS turns on the light and enters.  Korben follows her, gaping at all the luxury.  The BAGGAGE BOY enters bringing Leeloo's two suitcases.  Korben grabs the notice announcing Diva Plavalaguna's concert at 5:30 in that evening.  Dress: Formal attire.   For the concert it says formal attire... I didn't bring...  The hostess pulls back the closet door.  Twenty tuxedos in a row.   Hello?   ...Ma???   ...Ma!!!    Korben finishes putting on his tux, still on the phone.   Listen, Ma! I've only got a few days vacation and I'll be damned if I'm gonna spend them on the phone.  The door RINGS.   ...Hang on, it's the door. No! I told you I didn't bring anybody! I'm all alone... as usual!  Korben opens the door.  It's not the champagne.  Even better. It's Leeloo.    ...I'll call you back.  Leeloo heads right for her suitcase and starts to undress.  Korben has to turn away once more.   Here we go again...   You get that off the screen?   You noticed..   Where you going?   No, not at all!  I mean, just the opposite, you're... you're beautiful!  Leeloo smiles at him, his compliment pleases her.  She turns, revealing her unzippered back.  Korben cannot help but stare at her bare flesh.  Her perfect bottom.   I have an idea.  But instead of pulling on the zipper he slips a bracelet on her wrist.  A flourescent beam bursts out of the bracelet and forms a vertical bar going from the floor to the ceiling. Stunned, Leeloo is held captive.   I told you I need to work in peace. Remember? I need to concentrate.   It's difficult.  She tries to breakout.   Army issue. I'm sorry.  Leeloo tries desperately to get out of the handcuffs. Impossible.  Korben sets the radio down in front of her and turns it on. Leeloo looks like she'd like to break his head.   The words you're looking for weren't in the dictionary you studied. I won't be long.  The door flies open.  Loc Rhod barges in.   No..to all of the above.  And yanks Loc Rhod out of the room.  Leaving Leeloo looking extremely unhappy.    Leeloo, still a prisoner, listens to the concert.    Leeloo has tears in her eyes    The ship comes close enough for Leeloo to see it out the window.    Leeloo is alarmed.  She has to act.  She seizes the flourescent bar beam with great effort and rams it into the ceiling, marking a hole large enough for her to escape.    I was sent by the government to help you.   I've never heard anything so beautiful in my life.  A Mangalore jumps on them from the stage.  Korben makes short work of him and grabs his gun.   Who?   Leeloo... is... she's...   (to himself, suddenly realizing ...So Cornelius was telling the truth!   ...Yeah, so am I.  The Diva takes his hand.    I'll help her, I promise, but I think you should tell me where the Stones are!   I... I don't know! We hardly know each other... it takes time!   Listen, the last time I admitted to a woman I loved her ... I never saw her again.   You tell me to save the world then you go off and leave me in the shit!  He shakes her, gently slapping her cheeks.   Come on! You're not gonna die in peace! You're not going to die at all! You hear me? Where are the Stones?   I'm sorry, but... the Stones...    ...The Stones are with me?  and then it occurs to him.   ...In me?  He touches the Diva's stomach and senses something hard.  Girding himself, he sticks his hand in the wound and pulls out a Sacred Stone. Then another.  And another.  Korben pulls out all four Stones, covered in blue blood.  Everyone has left the theater.  The Mangalores check the aisles one by one.  Loc Rhod peeks out from under a seat.   That's it... I've had... all day people have been sticking guns in my face...  Korben wraps up the four Stones in his shirt.   You don't do what I say... I'll waste you myself. Got it?   Everybody down!  Korben takes out two more WARRIORS coming towards him, rolls behind a column. Laser bullets stinging all around his head.   Toss me the balls!   The balls for Christ's sake!  Korben apes playing pool, but Baby Ray really is stone-deaf.   How far is he from here?  The EMPEROR glances at the Mangalore, who in reloading.   Forget it.  Korben grabs Loc Rhod and takes him with him.    Korben bursts into the room. He stares at the luminous bar still struck to the ground and sees the hole Leeloo escaped through.   Leeloo???   The winner of the Gemini Croquette contest.  Korben goes to the door and peeks around the corner.  Loc Rhod arrives.   Seven to the left. Five to the right.   Six to the left. One to the right.    We got to find the leader. Mangalores don't fight without a leader.   Found him...   Mind if I go? I'm an excellent negotiator.   Anyone else want to negotiate?   Yeah, I know... to save the world... but right now all I want to do is save Leeloo.   When is she not in trouble?    Leeloo?  Up in the airshaft, Leeloo has heard him.   A molecular bomb.  Three minutes left on the timer.   Not without Leeloo.  Loc Rhod cannot take his eyes off the bomb.   It's the latest model.. I've never seen one before... it works off a magnetic coded card... Let's see if I can rig it up.   Don't worry, I'm here now!  He pulls her toward him, helps her out of the shaft and stretches her out on the desk.   Just relax. I've got the Stones. Everything's going to be fine.  30 seconds left on the timer.    I'll be right back.  Korben dashes over to the bomb.  He is stopped by the barrel of the ZF1. Zorg, in person, holding a magnetic card.   Don't you know how to count. It's not all that hard. Watch!  Korben punches him square in the face, shows him his index.   One! That's for trying to kill me!  Second Punch.   Two! That's for firing me! Three! That's for pushing around a priest! And the rest is for what you did to my wife!  Korben pummels him mercilessly.   We're outta here!  He picks Leeloo up in his arms.  Cornelius grabs Loc Rhod and gives him a resounding slap.    It's like a cab isn't it?   Anyone know how to release the lines on this crate?   Found it?  Loc Rhod searches frantically.   Fuck it! Hold tight!  Korben slams the throttle into full forward.  The ship roars away ripping the lines to shreds.  Loc Rhod is thrown to the rear of the ship.   Solid little jobs, aren't they?    Apipoulai..  Leeloo smiles, weakly, feverish.   Why? We did pretty well, wouldn't you say?   I told you not to read all that crap!    So now what's the problem?  The President drops into his armchair and sighs.   How much time before the collision?  The President queries the scientist with a nod of the head.   I'll call you back in two hours.  Korben hangs up.  The President looks stunned.   Excuse me, Father, but... could we pray later?  Cornelius bends the cross and pushes it down.  A mechanism is set off lowering the altar like a service elevator.  The altar descends amid rocky walls.   Don't tell me you don't know how all this works?   Match the symbols!  Korben places the first Stone and picks up another one.  Cornelius has found the symbol for water.  Loc Rhod sits down.  He is very tired.   No. It's much simpler. If we don't figure out where these Stones go in five minutes, we're all dead! Think you got it?  Loc Rhod's got it and runs over to put in his Stone.  The four Stones are all in place but nothing happens.   There's no light! You told me there were supposed to be four beams of light.   And you don't know how they open, is that what you are saying?   Leeloo? The Stones! We have to open them! How does it work?   I know all that, Leeloo! I'm talking about the Stones.   The rain falls... the wind blows?  Loc Rhod stands in front of his Stone looking at Korben.   Try and figure out how this fucking thing opens, instead of staring at me like that!  Loc Rhod starts feeling the Stone all around.   What did you say? What did you do?   Look, you did something that set it off. Try to remember. Concentrate. Tell me exactly what you did!!  Loc Rhod tries to duplicate the same movement.   Is that all?   The wind! The wind blows...  Korben blows on the Stone which immediately opens revealing a patch of blue sky with some miniature clouds floating around inside.  A yellow beam pops up like a ray of sunlight, like Korben's smile.   Quickly, everyone on a Stone! Water for water!  Fire for fire! Earth for earth!  The two men move fast.  Korben on the 4th Stone: Earth.  He grabs a fistful of earth  and throws it on the Stone.  A miniature patch of green appears and immediately forms a green beam.  Cornelius wipes his forehead with a scarf and wrings it out over the Stone.  It opens revealing a patch of miniature raging sea.  A blue beam appears.  Loc Rhod has a problem.   Don't breathe.  Loc Rhod and Cornelius hold their breath.  Korben strikes the match.  A small flame appears on the tip.  A breeze goes through the room.  Korben feels like he's got TNT in his hands.  He approaches the flame to the Stone. The flame twists, dims, flickers ...but holds on.  The Stone opens.  A patch of miniature fire appears. Korben sighs, snuffs out the match.  The fourth beam, a red one, immediately forms.   It's up to you now, Angel!   You can sleep tomorrow... come on...   Leeloo! Listen to me! I'll take you on a vacation afterwards! A real vacation, this time, for as long as you want. Come on! You can do it!  Korben slowly releases Leeloo and steps back from the altar. Leeloo can barely stand in the center of the four beams. An indistinct white beam begins to form around her, starts to rise.   Leeloo! If you don't get on with the program we're all gonna die! And that's not on my agenda for today.  Leeloo wraps her arms around Korben's neck.   You're right but there are lots of good things... beautiful things...   Exactly.   Yes, you do! I need you. More than you can imagine! Stand up straight!   Because...   Because...  Leeloo has tears in her eyes.  The heat is overpowering.  Black acid is everywhere.   I love you...  Despite her fatigue, Leeloo smiles broadly.",
        "Dallas": "",
        "Professor": "\"..when the three planets are in eclipse..\"  His fingers trace across the wall which is covered with symbols and strange hieroglyphs as he deciphers.   \"..the black hole like a door is open... Evil comes ... sowing terror and chaos...\" See?  The snake, Billy.  The Ultimate Evil ... make sure you get the snake!  The Professor points emphatically to the snake, the symbol of Evil, coming through the door between the three planets in eclipse.  C.U. Billy's hand sketches the snake quickly.  He is a natural artist.   ..if this is the five..and this the thousand..  He calculates.   Every five thousand years..   \"..then arrange the elements of life against the Terror just so..\"  His fingers run on.   \"..Water..fire..earth..air..four elements around the fifth..\"  His fingers fall on the one element that has a human shape, surrounded by all the others.  The Priest opens the water skin and begins to pour a vial of powder into the skin.  ANGLE ON:  Aziz falling asleep.  The mirror falls, the light fails.   Aziz!  Light!  The boy struggles to stay awake.  The mirror comes up.   \"..in which all the history of the Universe resides ..all the strength..all the hope..Protect us from Evil..\"   Father.. it in the most extraordinary thing.. the greatest find in history..can you imagine the implications.   I mean look.. it is like a battle plan..  In his excitement he does not drink, much to the Priest's chagrin.   Here the Good.. Here the Evil..  As the Priest looks up, Aziz the mirror  boy, tips his mouth under the water skin, drinking the leakage.   Here..  He points to the Five Elements.   A weapon against evil.  Amazing!  I am going to be famous.   To fame.. salud..  The Professor raises the cup to drink, and then...   We cannot toast with water.. Billy ! In my sack.. the Grappa!  The Priest watches, disconsolate, as the Professor tosses away his water. Billy finishes his cup before running off into the tunnel.   \"..this perfect person.. this perfect being..\" I do not understand this.. perfect?   Where is that boy? Billy!   And this divine Light they talk about.. what is Divine light?  At that moment, the reflection from Aziz's mirror drops again.  The light fails.    Aziz light!  The room is flooded with light all of the sudden.   Better.. this is the most unbelievable thing I have ever seen..  The Professor turns around, and is stunned speechless to find himself face to face with two MONDOSHAWANS.  A dozen others fill the hall manning the source of the light, large luminous globes.  Aziz is fast asleep.    ...Uh, yes?  The Professor is lifted up and carried off to the side by the aliens. The KOMMANDER stops in front of the Priest who is still on his knees, face to the ground.    Who are you?  Are you Germans?  Sprechen Sie Deutsch?   Unbelievable!!!  The Kommander turns around and crooks a finger.  One of the MONDOSHAWANS waves his hand, puts the professor to sleep and heads down the hallway revealed by the opening.  He is followed by his men.  The Priest slips in behind them.   Of course.. Let me see if they're revived.",
        "Pacoli": "",
        "Right": "Excuse me sir, the council is worried about the economy heating up.  They wondered if it would be possible to fire 500...  They reach a door at the end of the corridor.  Zorg enters a code.   But... 500 is all they need, sir.  ZORG turns slowly.  A small scar across run across his face, his eye stutters. This is not a man to cross, or contradict.   1000! Fine, sir! Sorry to have disturbed you.  The door opens...   Father Cornelius?   Mr. Zorg would like a word with you.    Glad to help.  He hangs up.   They just arrested the guy for Uranium smuggling. Everything's going as planned.  He shows him a plane ticket, and a passport with his picture and Korben's name.   All I have to do now is to go to the airport and take his place.  I should be in Fhloston in less than four hours.  Zorg sits there quietly for a moment.   That's right.  The attendant scans the ID with a yellow beam, it checks out, and the blue light reveals no other face but his.   That's impossible!  He's in j... I mean, there must be some mistake. I have my ticket! I'm the real Korben Dallas!  A shrill BELL rings out.   I want to see your boss!  Get rid of this fucking window! Somebody's made a mistake, goddamnit!  He pounds on the counter with both fists. A steel curtain comes down. Red sighting beams target spots on his body, ten gun barrels protrude from the wall, all aimed at him.    Sorry, my fault... Just a little overexcited... that's all... I'm calm now.   Yeah, it's me... Put Zorg on.  He is already sweating.   The real Korben Dallas is on the plane! He took my place.   278-500-645-321",
        "Arm": "Excuse me sir, the council is worried about the economy heating up.  They wondered if it would be possible to fire 500...  They reach a door at the end of the corridor.  Zorg enters a code.   But... 500 is all they need, sir.  ZORG turns slowly.  A small scar across run across his face, his eye stutters. This is not a man to cross, or contradict.   1000! Fine, sir! Sorry to have disturbed you.  The door opens...   Father Cornelius?   Mr. Zorg would like a word with you.    Glad to help.  He hangs up.   They just arrested the guy for Uranium smuggling. Everything's going as planned.  He shows him a plane ticket, and a passport with his picture and Korben's name.   All I have to do now is to go to the airport and take his place.  I should be in Fhloston in less than four hours.  Zorg sits there quietly for a moment.   That's right.  The attendant scans the ID with a yellow beam, it checks out, and the blue light reveals no other face but his.   That's impossible!  He's in j... I mean, there must be some mistake. I have my ticket! I'm the real Korben Dallas!  A shrill BELL rings out.   I want to see your boss!  Get rid of this fucking window! Somebody's made a mistake, goddamnit!  He pounds on the counter with both fists. A steel curtain comes down. Red sighting beams target spots on his body, ten gun barrels protrude from the wall, all aimed at him.    Sorry, my fault... Just a little overexcited... that's all... I'm calm now.   Yeah, it's me... Put Zorg on.  He is already sweating.   The real Korben Dallas is on the plane! He took my place.   278-500-645-321",
        "Billy": "And when is this door opening snake act supposed to occur?  The Professor's fingers touch the signs.    So I have some time..  He reaches for the pad.  ANGLE ON:  Omar.  Standing at the entrance to the chamber with the water bag, entranced by the sight.  A skeletal hand falls on his shoulder.  Omar turns to an ancient PRIEST in a rough milled black cannock.   Stop.  Billy trips, the gun goes off.  He empties the clip.  The Mondoshawan carrying the case crumples to the ground.  The wall immediately begins to close.  Billy fires wildly, unable to control the powerful kicking gun.",
        "Ruby": "",
        "Rhod": "Korben Dallas! Here he is The most hated man in the universe. The one and only winner of the Gemini Croquette contest! Ladies, start melting 'cause the boy's hot! Hot! Hot! The boy is perfect..  ...The right size, right build, right hair.  Right on! Say something-to those 50 billion pair of ears out there D-man!  An ASSISTANT hands a totally lost Korben a mike.   Does it get any better or what!  Loc Rhod grabs Korben's arm and leads him down the hallway, as fast as the music.   ...Quiver ladies, he's gonna set the world on fire right here from 5 to 7! You'll know everything there is to know about the D-man. His dreams, his desires, his most intimate of intimates.  And from what I'm looking at intimate is the stud muffin's middle name. So tell me my main man... you nervous in the service?   Freeze those knees, my chickadees, 'cause Korben is on the case with a major face...  Loc Rhod rubs up against the stewardess.   ...Start drooling, ladies! My man here is a sharp-tongued Sire who's gonna stroke your every desire.  They come to an intersection.  The airline company has prepared drinks for them.  Loc Rhod pushes on, grabs a glass of champagne, scribbles his autograph.   Yesterday's unknown will be tomorrow's Prince of Fhloston Paradise, the hotel of a thousand and one follies, home of luxury and beauty.  A magic fountain flowing with non-stop wine, women and Bootchie Koochie Koo...  He tosses away his champagne glass.   Beware out there puppy dogs my man is on the prowl. Owwww!  Howling, Loc Rhod grabs another stewardess by the arm.   ...And start licking your stamps little girls, this guy's gonna have you writing home to Momma! Tomorrow from 5 to 7, I'll be your voice, your tongue and I'll be hot on the tail of the sexiest man of the year... D-man... Your man... My man.  The stewardess shivers.  A BEEP is heard.   Korben sweetheart do me a favor I know this is probably the biggest thing that ever happened to you in your inconsequential life. But I've got a show to do here and it's got to pop. So tomorrow, when we're on air, give me a hand... Try to make believe you have more than a one word vocabulary. OK pal?  That does it.  Korben grabs him by the collar and drags him into a corner. Loc Rhod's feet don't touch the ground.    Crystal.    I don't want an individual position, I want all positions!   Now you're talking!   No!! I swear to God! I've never been this sincere with a human before!    My main man! Please don't leave me here alone. My head's killing me and my adoring fans are gonna tear me apart! Get me outta here!    Oh, yes! Do that! You treat me right, man. Tell me all about yourself, your roots, your personal life, your childhood dreams...   ...You got brothers and sisters? What about your dad? Tell me about your dad! What was he like? Physically? Big, I suppose?   I didn't have a dad... never saw him... never even heard him. 50 billion people listen to me every day... and he doesn't hear me...   Hey Stud we gotta...  Then he sees the scene, Leeloo cuffed, in a low cut dress.  His mind goes to the obvious.   Korben my man what's happening here? Who's the chick? What's the gig? We free forming here? Getting funky with the monkey? Can I get in on this?  Korben grabs him by the collar..      We have just walked into what is probably the most beautiful concert hall in the universe. Totally awesome! Magnificent paintings on the ceiling. I don't know who painted them, but he must have busted his balls! I see a row of former ministers, more sinister than minister! A few generals practicing how to sleep. And there's Baby Ray, star of stage and screen, drowning in a sea of nymphets. He's not gonna get much out of this concert, he's stone-deaf!    ...And over there is Roy Von Bacon, the king of laserball and the best paid player in the League.  ...And over there is the Emperor Kodar Japhet whose daughter Aachen is still at the bar. \"I love to sing, too, but in the shower\", she recently confessed to me. She will no doubt prove to be as generous tonight as she always is.  A waiter gives them two glasses of champagne.  Track with the WAITER an he leaves the hall with his empty tray.  He enters a small room reserved for staff.    Ladies and gentlemen, I think we're being... attacked.  The place is crawling with warriors.    They're hideous. They've got a crest on the head, the eyes of a toad and fingers all over their hands. Totally hideous!   Don't you think we'd better be going?  A Mangalore spots Korben kneeling alongside the Diva.  He grabs Korben by the shoulder and pokes him with his gun.   Korben man... These dudes are going to waste us if we don't do what they say.  Korben gives him the package and grabs his mike.   Got it...   This is amazing! Korben, Korben Dallas, the winner of the Gemini Croquette contest just killed three warriors like he was swatting flies...  Panic everywhere!  Heavy firing fills the hall.   It's Roy von Bacon, the Lions center forward joining in the battle...  Someone taps Loc Rhod on the shoulder.  He jumps with fright.    ...And our man Korben has literally knocked out the opposition with an amazing 90 foot pitch.  The COPS on the floor rise, scoop up weapons from dead Mangalores and lay down a line of fire at the last of the fleeing rebels . Roy whirls his arm in victory.   He's on vacation.   Korben man... what the hell is this?  Korben gives the bomb a prefunctory glance.    And, uh, what're these numbers clicking by?    You're just saying that to scare me! Right? If it was a bomb, an alarm would've gone off. There's bomb detectors in all these hotels!  A general alarm goes off.  Loc Rhod is crushed.   Maybe we oughta be going, what do you think?   Like D-Man, I hate to bother you but uh, like, we're down to 2 minutes here...  Korben breathes out, bothered.  He turns his attention to the bomb.   Hey! What are you doing? The bomb!  Korben drags the desk over, jumps on it and pokes his head in the torn up airshaft He spots Leeloo who gives him a weak smile.    Like Korben, can I have 30 seconds of your time here?   Are you nuts, Father? That hurts! I can't feel my teeth.   You know how to fly this thing?   I don't even know what I'm looking for!    Dear listeners, your favorite DJ is alive and kicking. It's seven o'clock and time for the news. Tune in tomorrow for another adventure.    The best show I ever did!   What is this some kinda game? Like chess?  Korben pulls him to his feet and sticks a Stone in his hands.    I'm looking, I'm looking.   ...we'll never make it.  He sighs.  Three hooks pop off the Stone.  Loc Rhod can't believe his eyes.   It... it moved! Korben! Korben!  Korben rushes over, looks at the Stone.  Hooks are undone.   Nothing! Swear to God, I didn't do nothing!   I was like this... With my hands here and... I said, \"We'll never make it!\" That's all!  Nothing happens.   Yeah... then I sighed... like this.  Loc Rhod sighs, really depressed this time.  The Stone opens even more. Korben's got it.    I don't have a light.  I stopped smoking last week! If we'd come a bit sooner...  Korben pats his pockets, he comes up with a box of matches.  There's only one left.   This guy is a killer with the babes. I knew it from the moment I laid eyes on him.  Cornelius and Loc Rhod burst out laughing.  Korben and Leeloo keep on kissing.",
        "Mugger": "The cash man!   Don't fuck with me man or I'll blow you into tomorrow!  Unperterbed, Korben looks at the mugger's fearsome weapon.    Uh..   It's not?   Thanks..    There's no more resistance. Everything's under control.  Three Mangalores are suddenly blasted through the glass door leading to the theater.  Korben bursts into the hall, two huge guns in his hands.",
        "Leeloo": "Corn-i-Lius?    Napoleon... small.  She laughs again and tosses some capsules into the microwave.   San Agamat chay bet... envolet!    Domo danko!  David smiles, dumb with admiration.  Cornelius comes over.   Ikset-kiba.  Me imanetaba oum dalat!   Dot!  The little group comes over to look.   Apipoulai!    Valo massa... Chacha hamas.    Cornelius..   Achta ge lumitai de matala..  Korben turns..    Vano da, mechteba?! Soun domo kala chon hammas!   Akta dedero ansila do mektet.    Dinoine chagantakat!   Apipoulai!   Love...    Peace... and love...  She brings up a picture of a 60's style Hippie flashing a peace sign. Korben sighs and switches off the screen.    What is... Make Love?  Korben just stares at her for a few minutes.    OK! Finished!   Learning language.   All 900.  Korben doesn't know if he should laugh or not.    Yes! Now it's your turn! I learned your language, you have to learn mine!   Apipoussan!   Good! Do you know how we say \"make love\"?   ...Hoppi-hoppa.  Korben literally melts.    You know women normally change five times more than men.   Yes... you know there's a lot of differences between men women.   OK, you can turn around!  Korben turns around.  Leeloo has put on a very simple dress which is sexy to the max.  He is smitten.  So much so that Leeloo wonders if something isn't quite right.   I'm going to see the Diva sing. What's the matter?... Do I look bad?   Do you know how this works?  Korben's blood boils.  She wriggles, pressing her hands together close to the zipper.   And you can't concentrate with me around?.    You're nothing but a... a...    Apipoulai!    Kor... ban...   Korben...  Her voice is too weak, Korben can't hear her.   I'm so very sad.   Five hundred wars... Arms... Drugs... Money... Everything you create is used to destroy...   Protect life... Until death.  Her eyes close and she falls back asleep.  Korben is worried.  She seems so depressed.  Cornelius enters.    The wind blows... the fire burns...   ...The rain falls...  Korben is desperate.  Leeloo's too weak, he won't get anything more out of her. He darts over to a Stone and turns it over and over.   I'm so tired...   I want to sleep... forever...    What's the use of saving lives... when you see what you do with them!   ...Like love...   But I don't know love... I'm like a machine programmed to save other people's lives but never to have one of my own.   I have thousands of memories but none of them are mine... There is no need for me other than this. I'm immortal but I have no life.   Why?... Why would you need me?   Tell me...   Now you're allowed to kiss me.  - Korben wraps his arms around her and kisses her like he's never kissed anybody before.  - The white beam, the Divine Light, immediately forms around Leeloo and Korben. - The stopwatch hits zero.  - The Absolute Beam explodes from the top of the pyramid and heads straight into the sky zapping the fireball smack in the middle, slowing it down.  - Korben and Leeloo kiss like there was no tomorrow.  - The beam hardens and slowly solidifies the Evil Planet.  Inaudible screeches escape from the dying planet.  Screeches of terrifying pain as if a million souls were dying.  - Streams of black acid spurt from the pyramid and solidify like brilliant stalactites."
    },
    "imdb_rating": "7.6",
    "description": "In the 23rd century, the universe is threatened by evil. The only hope for mankind is the Fifth Element, which comes to Earth every 5,000 years to protect humans with stones of the four elements: fire, water, earth, and air. A Mondoshawan spacecraft is bringing The Fifth Element back to Earth but it is destroyed by the evil Mangalores. However, a team of scientists use the DNA of the remains of the Fifth Element to rebuild the perfect being called Leeloo. She escapes from the laboratory and stumbles upon the taxi driver and former elite commando Major Korben Dallas who helps her to escape from the police. Leeloo tells him that she must meet Father Vito Cornelius to accomplish her mission. Meanwhile, the Evil uses the greedy and cruel Jean-Baptiste Emanuel Zorg and a team of mercenary Mangalores to retrieve the stones and avoid the protection of Leeloo. But the skilled Korben Dallas has fallen in love with Leeloo and decides to help her retrieve the stones.Claudio Carvalho, Rio de Janeiro, Brazil",
    "name": "Le Cinquime lment",
    "genres": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZWFjYmZmZGQtYzg4YS00ZGE5LTgwYzAtZmQwZjQ2NDliMGVmXkEyXkFqcGdeQXVyNTUyMzE4Mzg@._V1_QL75_UY281_CR3,0,190,281_.jpg"
}