{
    "filename": "Prestige,-The_script.txt",
    "imdb_id": "tt0482571",
    "imdb_url": "https://www.imdb.com/title/tt0482571",
    "characters": [
        "Julia McCullough",
        "Alley",
        "Sarah",
        "Alfred Borden",
        "Cutter",
        "Judge",
        "Jess",
        "Tesla",
        "Owens",
        "Prosecutor",
        "Olivia Wenscombe",
        "Sullen Warder",
        "Captain",
        "Defender",
        "Robert Angier"
    ],
    "dialogues": {
        "Julia": "There'd be no seats left for the punters.  Who's Ackerman?  I think I had my wrist turned- 17.  I can slip a Lanford underwater.  I think he's alright.  Even you.      You're pretending to be someone else.  Not just your name- who you are, where you're from...  I came up with a name for you... \"The Great Danton\" You don't like it? It's sophisticated.",
        "McCullough": "",
        "Alley": "I'm sorry about the fence. People keep interfering with our work.  Why?  Impossible, I'm afraid.  I'm sorry, Mr.Angier. I simply can't help you.  What am I holding?  Tesla sends me down here during the storms. Perfect excuse to come shere a drink with the Great Danton.  Have you tried our Bourbon yet, Mr. Angier? It matches the scenery nicely. Two of 'em. Beautiful, isn't it? I do miss New York, though.  The lightning lives here. And noit much else- our work is secret.  A cypher?  Which is? 32.  You have a circle of trust with someone whose dairy you stole?  Magicians sell their secrets?  You're hoping to find a great secretin there?  Why would you want the same thing?  Tesla has built unusual machines for unusual people, but he would never talk about it.  Finish your drink. You'll have a special appreciation for our work.      We do our tests when the townspeople are asleep- Mr.Tesla doesn't want to scare anyone.  Not long now.  Our equipment requires a great deal of current. Tesla eletrified the whole town in exchange for using the generators when we need to.  Exactly.  You saw it last week.  Fifteen. And I have to ride all of them before I get to bed.  I'll send word for you in a few days, Mr.Angier.  It's perfectly safe. 54.  You might want to stand back.  Perhaps it would be best if you left us to it. We'll see you next week? 66.              Who by?  We never said he had.  Where?  Sir, my cat?  When I told you I could make your machine I spoke the simple truth. Science is just a name for the art of rendering the exotic mundane. It has no boundaries- its very purpose is to destroy boundaries.  Nowhere. 90.  We've tried the damn thing a dozen times. And the hat went nowhere.  You are responsible for whatever happens to this animal, Doctor.  I never bothered to check the calibration. The hat never moved.",
        "Sarah": "He lives with Mum.  I think so. Wil I see you again?        Alfred?!       Where did yo get all of-  I need talk to you.  We can't afford to pay him-  And until then? What I earn is barely enough for us.  You're already going to be sharing it with someone else.  Having a baby.  What's this?  Your great trick? The \"masterpiece that will make our fortunes\"? 24.  I'm not letting you get shot.  Show me.  Then you're not doing it. I can't raise a child on my own, Alfred.  Once you know it's so obvious.  How?  Such as?  Say it again.                  I don't understand, Alfred. How can it be bleeding again?  What have you been doing to it? It looks as had as the day it happened. We need to get the doctot back-  You've woken her.  Alfred, you have to face things. What tricks could you peform with this kind of injury?  See? Today, it's true.  What is this for? 58.  When I asked last week you said we couldn't afford.  But you want through all the-  I didn't know we'd be joined for dinner.  Miss Wenscombe. Mr.Fallon.  What are we celebrating, dear? 83.           Perhaps, Mr.Fallon, you might escort Miss Wenscombe home. My husband's being a bore. I see no reason for the two of you to suffer as well.  \"Freddy\"?  Not at home. 84.  Alfred, why are you being like this?  What?  I see. More secrets.  When you're like this, Alfred, I'm not seeing the real you. You're treating me like your audience. Performing. I can't live with that.  We each have our vices.  You mean it today.  That makes it so much harder when you don't.  Deny it all you want- I know!  I'll go yo her! I know what you really are, Alfred!  I'll do what I have to!  I can't live like this! 100.     Do you love me?",
        "Alfred": "",
        "Borden": "Are you watching closely?      How much?     Talk to Fallon, my ingenuer- the money's for him.  I'd never forgive myself for selling my greatest trick.  Fallon can take care of-  Angier never learned my trick.       We were too young men at the start of a great career...  Two young man devoted to an illusion...  Two young men who never intended to hurt anyone.  Milton's squadering their goodwill or a bunch of tired second-hand tricks-  What about something fresh? He won't even try a bullet catch-    Fine- no bullet catch. But a real magician tries to invent something new, something other magicians scratch their heads over-  No one else could do my trick.  You don't even know what it is.  Tickets are pricey.  The most powerful theatrical agent in London.      We've been practiced it-  Look- he's all right. He's fine. 19.  Sharp lad, your son.  You're the lucky one tonight.   Are you watching closely?  Look closer.  Never. Show. Anyone. 20.  They'll beg you and flatter you for the secret- but as soon as you give it up you'll be nothing to them. Understand? Nothing. The secret impresses no one- the trick you use it for is everything.  Where do you two live?  And you?  Enough to keep me out?  It is. He carries the bowl between his knees for the entire performance.       Total devotion to his art...  Utter self-sacrifice. It's the only way to escape this.  We have our routine for Ackerman!  Mr.Fallon is my ingeneur- 23.  Begged, borrowed and don't ask. Mr.Fallon's an enterprising soul.  We'll start making money once we have our audience-       You're...?  The trick to wake up Ackerman at the end of my audition.  No. The world isn't ready for that one, yet.  This is merely a run-of-the-mill daring and spectacular bullet catch-  It's perfectly safe. Shoot me.  The bullet goes in the gun. Then comes the ramrod.    The buller's not even in the gun when the charge is fired. 25.  Yes, well, people still get killed perfoming it.  Sme smart-arse drops something down the barrel.  A penny, or a button. Or, of course, a bullet.  But don't fret-  I'm not letting anything happen- I love you too much.  I love you.  What?  Bloody fool.  How often I've fought with my self over that night .. one half of me swearing bling that i tied a simple slip knot... the other half convinced that I tied the Langford double. I suppose I'll never know for sure-  \"How can be not know?!\" Because, Angier, life is complicated, people are complicated, knots are  How could I not know? How can you read my story and not understand?  They took her away? To the workhouse?  Tell him I've reconsidered. It's for the best. 31.  A volunteer.  Are you man enought, sir?           I'm sorry. I just need this to heal so I can het back to work.  Some of the card pulls, prop tricks...  And the trick I've been telling you about. The trick they'll remember me for.  I love you.  Guard! Guard!!  Paper and pencil. Please.       Perhaps I'm just biding my time. Perhaps one day I'll just hold up my  -get you attention. Then quietly  Magic.  I need a volunteer.  As you can see , it's just a rubber ball. But it's not normal at all.  Thank you.     It's a magic ball.    Would you like to see a magic trick?  You caught me in the wrong mood.  Sarah, I'm allowed to change my mind, aren't I? The act is taking off, maybe soon I'll get us into a bigger theatre. Things will work.     We make do.  I know who you are. Are you here to steal the rest of my show?  And what might that be?     Why on earth shouldn't I trust you? The mistress of my enemy. 67.  Alfred.  Ah. The truth. A slippery notion in our life of work, Miss Wenscombe.  What does he need my secret for? His trick is top notch. The Great Danton vanishes and isntantly reappears on the other side of the stage -- mute, overweight, and, unless I'm mistaken, rather drunk.  Tell me, Olivia. Does he like taking his bows under the stage?  He has no secrets from me.  And this is the truth? 68.  You are the Great Danton, aren't you?  Just a humble admirer. And fellow practitioner.  Another?  You could probably do it blindfolded.  Have it.  Actually, there's something I might warn you about.  Well, it's your Transported Man illusion. Now, I'm noit claiming to know your method... but I had a similar trick in my act- and I used... (looks around,  At first. Then it went bad. You se, I hadn't counted on the fact that once I incorporated this bloke into my act, he had complete power over me. 72.       Great Danton, I must apologize! I simply had too much magic for my stage at the Pantages!  Pardon my intrusion!     Notebook.  Then he's just getting started.  I'm walking tonight, gentlemen.  Let him come. I don't care.  I'm impressed.  You're finally getting your hands dirty. This is what a good trick costs, Angier. Risk. Sacrifice.  Which is?  My secret?      The keyword is the method.  Where is my ingeneur?    Absolutely. We're celebrating.   Champagne. Your finest  Well, we've hit upon a new trick, haven't we, Fallon?      Who are you to tell me what?!  It's my name.  I'm not always at home.  Sarah, I had a terrible ordeal today. I thought I'd lost something very precious to me.  Secrets are my life, Sarah. Our life.  Today, a most curious development...      His assistent come to us with a proposition...  Obviously Angier has sent her, and told her to admit as much...  Tell me Olivia. Does he like taking his bows under the stage?  He has no secrets from me.  This is the \"truth\" you spoke of? 86.  I can spot Angier's methods from the back of the theatre. What could you possibly have to offer me?     I think she is telling the truth. 87.     I think we cannot trust her. But I love her. I need her. We need her.  How could he send you away? He must be blind, deaf and dumb.  Trust is not the point- love is the point... who have we ever trusted? To open myself to such a relationship,  ...to the dangers of such an affair... I need assurances of fidelity. Of love.  But how to be sure when truth is layered like the skin of an onion? I know a way... she must help me rid ourselves of Angier. It is the only way to kow her mind.  Today my mistress proves her truthfulness. Not to me, you understand. 88.  I have been convinced since she led me to Root... today, Olivia proves her love for me to you, Angier.  Yes, Angier. She gave you this noteboook at my request. Yes, she led me to Root, and yes, Tesla is merely the key to my dairy, not to my trick. Did you really think I would part with my secret so easily after so much? Good-bye, Angier, may you find solace for your thwarted ambition back in yout American home.     Daddy's got some business this afternoon.  Did I?  Then go to the zoo we shall.   Who's that?  Daddy has some errands to run. I'll be back before you know it, so get ready. 93.  Sarah. Whatever you may think, your only competitions for my affections is my little girl. I love you. I will always love you, and you alone.  Absolutely.  More shopping. She doesn't like the smell of money, doesn't she?  The little lady wants to visit the Zoo, I thought you could take her. I'll do it tomorrow, if not.  Sarah... she knows. At least, she knows things aren't right. (looks at Fallon,  Please don't call me that. It's nothing, just... sometimes things seem... wrong.  I'm trying, Olivia. Please.  You trust me?  Then trust Fallon- he protects the things I care about.  Angier's journal, the \"gesture of good faith\"? It's a fake.  It has to be- it refers to events that happened after his death.  It doesn't matter.  My tricks. All of them.  No he won't. They're not complete- you only have the Pledge and Turn for each.  You'll get the rest after you bring my daughter here.  I want to say goodbye.       Stop it! Just stop it!       Sarah, it's not true! I've told you Olivia means nothing to me!           Sarah, you can't talk like this!          Not today.        Who?  Why would I talk about her to you?      Part of me loved her. But part of me didn't. The part that found you. The part that's sitting here now. I love you. That is the truth that matters.  He's back?     Why only 100 performances? Do his methods dictate it, or is it simply a publicity move?  Fifty yards in a second. And all I know is that he uses a trapdoor. What's going on under that stage?     They do this every night. After each performance?  We're done.  Let him have this trick. You're not to go back there. I don't need to know his secret. Leave him alone.  A GLAMOROUS ASSISTANT beckons Borden from the aisle. He shuffles along his row towards her. Embarrassed. Borden and four other VOLUNTEERS follow the Assistant down towards the stage... On which stands Angier, leaning on his cane, smiling. Looming over him is the large and complex ELECTRICAL MACHINE. Borden STARES at the machine as he mounts the stage. Borden, FASCINATED, and the other volunteers look over the vast machine. As Angier GESTURES theatrically at the various features of the metal and glass apparatus. As the Assistant leads the Volunteers to the side of the stage, Borden slips through the gas at the side of the  I'm part of the act, you fool!  For now.  Jess, how are you?  Are you alright?  I've missed you. Fallon's missed you. We both have.  Everything's going to be okay.  You must be Lord-  I saw you die.  You were always afraid to get your hands dirty... (looks down at his  You win. But don't take my little girl...  Wait. Don't you want this? You paid for it.  Angier! Let me say good-bye. Please.  Soon. I promise. Soon.  Daddy's coming, I promise. I promise.  I promise. 116.  You think this place can hold me, Angier?  Angier!  We go alone now- both of us. Only I don't have as far to go as you.  You were right. I should've left him to his damned trick... I'm sorry. I'm sorry for so many things. For Sarah. I didn't want to hurt her.  Don't cry. Not for me. Go live your life in full. For both of us.               We were both Fallon. And we were both Borden.  We took turns. The trick is where we would swap...  Simple, maybe. But not easy.  Nothing easy about two men sharing one life.  We each loved one of them. We each had half a full life. Enough for us, but not for them.  Sacrifice, Robert- that's the price of a good trick.  But you wouldn't know anything about that, would you?  It takes nothing to steal someone else's work.",
        "Cutter": "Every magic trick consists of three part, or acts...  The first part is called the Pledge...  ...the magician shows you something  A deck of cards, ar a bird...  ...or a man.  He show you this object, and pledges to you its utter normality... 2.  Perhaps he asks you to inspect it...  ...to see that it is indeed real...  ...unaltered...  ...normal.  But, of course, it probably isn't...  Who was that?  The second act is called the Turn...  The magician takes the ordinary something...  ...and makes it do something extraordianry.  Now you're looking for the secret.  But you won't find it...  Because of course, you're not really looking...  ...you don't really want to know. 4.  ...you want to be fooled.  But you couldn't clap yet. Because making something disappear isn't enough... you have to bring it back.  That's why every magic trick has a third act. The hardest part..,  ...the part we call...  ...The Prestige.  No, sir. Something went wrong.  I saw a someone head below the stage... I followed... and I found  -watching Mr. Angier drown in a tank.  I'm an ingeneur. I design illusions and construct the apparatus necessary for perfoming them.  Eight years. I was privvy to the secrets of his entire act.  No, sir. The tank had been used for the first trick, then taken offstage. Borden must have put it under the trap door after the interval.  The sort of tank used for underwater escapes- four or five hundred gallons. 6.  Ask him- he's the magician.       Bullet catch is suicide. 15.  All it takes is a smart-arse volunteer dropping a button down the barrel...  They sells it to them for a small fortune.  I suposse you have such a trick, Mr.Borden?  Care to sell it?  I admire your spirit, Mr.Angier. But if Borden here really has invented his masterpiece it might well be something only he can do. 16.  It might be something only he is prepared to do.  my illusions employer, Mr.Milton, is a skilled showman. But Borden's right- he won't get his hands dirty. You want to see what it takes to make real magic- go to the Tenley. There's a Chinaman there who's got what it takes.  I know a lad on the door. You two watch his show- whoever tells me how he does his goldfish bowl trick gets the prize.  Ten minutes onstage in front of my old friend, Mr.Ackerman.  I saw you drop the knot again, Borden.      The Langford double's not a wet knot it's too dangerous. The ropes could swell and she'd never slip it-       Where are you from?  He shuffles props for Virgil at the Hall.         He's a natural magician. Of course you can't trust him.  And Mr.Angier...?  Learn your aight lines- if I can see you sneaking a peck on your wife's ankle from the wings, the blokes on each end of rows 3 and 4 can, too.  Angier's machine.         your honour, what will happen to these things when the trial is over?  Don't let him take this.  It's dangerous.  The most disappointing of all- it has no trick. It's real.  This lets the performer's hands reach the trick padlock... -a small section POPS open.  With one important difference... 28.  This isn't a trick lock... it's been switched out for a real one.  These are magicians, you honour. Showmen. Men who live by dressing up plain and sometimes brutal truths to amaze. To shock.  There was and audience.  See, the water tank had a particular signinficance for the two men...  A particular awful significance...  Hasn't stopped you looking. I heard about a booking. Nice little theatre. Good up-and-coming magician.  You.  Because I want to keep working...  And who's going to hire the ingeneur who killed Julia McCullough in front of a sellout crowd at the Orpheum? 36.  Heard he had a spot of bad luck doing a bullet catch South of the river.  I knew an old sailor. Told me about a time he got pulled over the side tangled in the sheets... they dragged him out, but it was five minutes before he coughed...  He said it was like... going home.  He wouldn't say.  It was as if... as if he didn't know.  We'll have to whitewash the windows to cofound the more curious members of your audience... But this should do. 37.  I've made arrangements. Have you settled on a name?  Hmm. Bit old-fashioned?  In here, Miss Wenscombe. No point meeting Mr.Angier unless you fit.  Breathe as little as possible.  Not much experience , but she knows the basics. She knows how to present herself and a pretty assistant's the most effective from of misdirection.       Not like this, they don't. 39.       Put your hands on the sides...  Hang on, hang on...  There we go. Now you tell the volunteer to put his hands here... 40.  And the best part...  Someday, perhaps you will. I needed to know that you can.  cheap thrills, Mr.Merrit. People hoping for an accident- and quite likely to see one, too. What would that do for your business?  This is a grand theatre with a sophisticated audience- They've seen most of these tricks before. But not this next one. You'll see.  You! Piss off out it!     You had a lot of plates spinning.  No.  Mr.Merrit-  There are plenty of good theatres... if we can come up with another trick and change the name of the act-  Right. Well, the new trick will have to be irresistible, then. I've a couple of methods to try out, but we'll need a fresh angle on the presentation. 45.  If you need inspiration, there's a technical exposition at the Albert Hall this week. Scientists and engineers. That sort of thing captures the popular imagination.  Not very enthusiastically.  The trick is too good -- too simple- the audience harly knows what they've seen.  He's a wonderfull magician- he's a dreadful showman. He doesn't know how to dress it up, how to sell the trick.  He uses a double.  You think that because you don't know the method. It's a double who comes out at the end. It's the only way.        We'll have to find someone who can look like you on a stage.        He's perfect. A little work, mind you, but when I'm done with him he could be your brother.  Ready to meet yourself, Mr. Robert.  A little faith, sir. Could you favor us with a perfomance. Mr. Root?  You can go back to being yourself. Root. For free..  Root has to keep a low profile-- anyone sees him the game's up.  Have you thought about what we should call the trick?  The manager said he's never seen a reaction like it.     Root, you bloody fool, get that costume and makeup off right now, anyone could walk in here! 63.  Congratulation, all.  Best be getting changed for the martinee, sir.  ROOT! You're late. And even more drunk than usual. Get yourself below stairs, right away!  No?!  We have a bigger problem. Root.  Worse. He realized he can make demands.  In a word, yes. I'm surprised, to be honest- it usually takes them a lot longer to figure it out.  It makes no difference- we have to stop doing the trick.  Look at yesterday's. And last week's, where they called you \"London's premiere stage performer\", not \"magician\" mind. Performer. Of any kind.  My point, Robert, is that you've climbed too high to get away with any kind of professional embarrassament. We're not doing any tricks we can't control.  Get it down!  I don't see how Borden found him- I had him under wraps, I was careful.  Sit, do you think it might be her? Olivia? 74.  Shall we cut him down?  I'll live. You save me the trouble to making you an air hole!  Still attached. Did you get your answer?  I already know how he does it, Robert. The same way he always has, the same way we do. You just want it to be something more.  What does it mean?  Robert, listen to me.  Obssession is a young man's game, I can't follow you any farther in this.  I- I'm looking for an old friend-  You came back.  Good rehearsal space. Blind stagehands. I like it- You always had an eye for publicity.  Your last show?  You want to design a show around it?  What sort of booking are you after?  Mr.Ackerman. It's an honor to see you again, sir.  It's a very special trick. Mr.Ackerman. 103.   Turn it on, please.  It's Cutter.  I'm looking for Angier.  What are they doing?  What's down there? 109.  Perhaps not.  Who was that?  What did you do?  Thank you for coming, Mr.Owens. It's fallen to me to dispose of Mr.Angier's equipment. Looking at the manifest, it's cleat that Lord Caldlow has purchased the bulk of the items.  It's not just that, Mr.Owens. There is a particular item  This time, in fact, that I wish to... well, that is to say, I want to-  I suppose so, yes.  Perhaps if I dould talk to Lord Caldlow in person.  You're alive. You're Lord Caldlow.  How?        Who's the girl?  I've seen her. I've seen her in court with Fallon...      She needs her father, but you're letting him hang. And I helped you.  I came here tonight to beg Lord Caldlow to let me destroy that machine. But I won't beg you for anything.  Then, Lord Caldlow, where would like me to deliver it?  I once told you about the sailor who described drowing to me...  I was lying. He said it was agony.  Thank-you gents.  Don't worry. Someone's coming to help.  I'm bringing this over after we're done.  No room left- you couldn't have acommodated 100 performances.  I'll go mix the cement.  Take a minute to consider your achiviement. 121.  Angier FREEZES. He can hear a small THUD, THUD, THUD getting closer, approaching from the darkness... Angier FLINCHES as a RUBBER BALL bounces into the light- Angier DROPS his cane to CATCH the ball. He turns it around in his hands, confused. Light EXPLODES around him as a GUNSHOT rings out. Angier stands for a moment, confused, staring at the ball, then COLLAPSES to the ground, clutching at his stomach. Fallon's BOWLER HAT breaks into the circle of light. he is holding a smoking pistol... Angier drops the ball and it rolls across the floor, coming to rest at Fallon's feet. But it is not Fallon's gloved hand that picks up the ball- -it is a MUTILATED HAND, WITH 2 1/2 FINGERS MISSING. Angier  Every magic trick consists of three parts, or acts... 127.  The first part is called the Pledge.  The second part is called the Turn. I take the ordinary something...  But you wouldn't clap yet.  Because making something disappear isn't enough...  You have to bring it back. 128.  Now you're looking for the secret...  But you won't find it...  ...because you don't really want to know...  ...you want to be fooled.",
        "Judge": "Mr.Cutter, I see your predicament but we are talking about a capital offence- Alfred Borden's life hangs in the balance.  If you were prepared to disclose the details to me in private, I might be able to judge their relevance to the case. Might this be an acceptable compromisse? 7.  What's in there?  You built this, Mr.Cutter?  They've benn sold to a Lord Caldlo. An avid collector, apparently very interested in the case.  Why ever not?  I'm sure beneath its bells and whistles it's get some simple and disappointing trick.  This is the tank Angier drowned in?  A standard magical apparatus for escapes?  What a way to kill someone. Why in God's name go to such lengths?  Even without and audience?  Alfred Borden, you have been found guilty of the murder of Robert Angier. You will, in one month's time, be hanged by the neck until dead. May the Lord have mercy on your soul.  Alfred Borden, you have been found guilty of the murder of Robert Angier...  You will, in one month's time, be hanged by the neck until dead. May the Lord have mercy on your soul. 112.",
        "Jess": "Are we going to the zoo this afternoon, daddy?  But you promised.  That's you, daddy?  Can I come in there, Daddy? 114.  Not anymore.  When are you taking me home, Daddy?",
        "Tesla": "With a system like this I could have the entire city electrified whitin two years. 46.  Mr. Edison's direct current system is flawed and dangerous. With my alternating current devices-        So this is the Great Danton.  Mr. Alley has effused about your act to me on any number of occasions. Something you did with pockets?  Our bodies, Mr. Angier, are quite capable of conducting, and indeed, producing energy.  Have you eaten, Mr. Angier?  Alley has explained that you require a very interesting device.  You're familiar with a phrase 'Man's reach exceeds his grasp'? 55.   It's a lie. Man's grasp exceeds his nerve. The only limits on scientific progress are these imposed by society.  The first time I changed the world I was hailed as a visionary. The second time I was asked politely to retire. The world only tolerates one change at a time. And so here I am.  Enjoying \"retirement\".  Nothing is impossible, Mr. Angier. What you want is simply expensive.  Alley says you are a stage magician. If a built you this device, you would be presenting it only as an illusion?  Mr.Angier, the cost of such a machine-  Perhaps not. But have you considered the cost?  I can make your machine, Mr. Angier. But I can also give you some advice... Go home. Forget this thing. I can recognize an obsession. As Mr. Alley could tell you, I myself an given to one now and then. It will not do you any good. 56.  At first. But I've followed them too long- I am their slave. Their whipping boy. And one day they may choose to destroy me.     I have already begun to build it, Mr. Angier. I hope you enjoy the mountain air. This will take time.        You must be curious to see what so much money had bought you, Mr. Angier.  Fitting that you should be here for the maiden voyage.  Your hat.  No, no. It will be fine. Mr. Alley, please proceed.                       That would be unwise, Mr.Angier.  It is true, sir, that you are your one remaining financier. But we have not stolen your money...  Because exact science, Mr.Angier, is not an exact science. The machine simply does not operate as expected. It needs continued examination.  Which is why we need to rey a different material. It may provoke a different result.  You don't expect me to handle the thing myself?           These things never quite work as you expect them to, Mr. Angier. That's one of the principal beauties of science.  We'll need a couple of weeks to iron  Don't forget your hat.  They are all your hat, Mr. Angier.  My dear Angier, you will find what you were looking for in the box. I apologize for leaving without saying goodbye...       But I seem to have outstayed my welcome in Colorado.  The extraordinary is not permitted in science and industry. Perhaps you'll have more luck in your field, mystified. As to the use of the machine...  Alley has written you a thorough set of instructions. I add only one suggestion on using the machine-  -Destroy it. Drop it to the bottom of the deepest ocean.  Such thing will only bring you misery.",
        "Owens": "My name is Owens- I'm a solicitor.  I represent Lord Caldlow, and accomplished amateur magician and historian of magic-  Lord Caldlow is interested in- 8.  Five thousand pounds.  I did. He offered to sell all of your tricks... except the most valuable one - The Transported Man.  Even for your daughter?  If the newspapers are right, and you're for the drop, your daughter's going to need looking after  Bernard Fallon? A man with a past even more obscure than your own? The court have already motioned to have the girl removed from his \"care\". No, the girl is to be an orphan. I've been to the work house...  It's better than this.  I'm offering you a way to warp up your affairs with dignity, and I'm offering your daughter a future. As Lord Caldlow's ward she will want for nothing. Ever.  Think it over. 9.  Lord Caldlow wanted you to have this- (produces a leather  Robert Angier's diary... It includes the time he spent in Colorado learning your trick...  Really? When he returned from Colorado he mounted a version of the Transported Man that the papers said was better, even... Than your original.  I want your secret, Mr.Borden... Consider your daughter!  Lord Caldlow was happy to hear that you'd reconsidered his offer.      Clever predictions, I'm sure. The provenance of the journal is clear and under no doubt. It's written in Angier own hand, of which we have numerous examples.  What makes you think it's a fake?  Including the Transported Man? Lord Caldlow will be very pleased.  Without the Prestige for each trick these are wothless. 99.  Mr.Cutter? Owens.  Mr.Cutter, if you needed to know where to deliver the items you surely could have just-  You wnat to buy it instead.  This is the machine? I'm afraid Lord Caldlow was adamant about procuring this particular item.  Out of the question, I'm afraid. 113.  of course, I suppose... if, in the course of your delivery arrangements your paths were to cross... I can't stop you from speaking your mind.",
        "Prosecutor": "The Prestige...?  And did Robert Angier, the Great Danton, your employer, get to that final part of his trick that night? 5.  What went wrong?  Would you describe your occupation to the jury please, Mr.Cutter?  And for how long had you been Mr.Angier's \"ingeneur\"?  So, Mr.Cutter, was this water-filled tank beneath the stage part of Mr.Angier's illusion- the illusion billed as \"THE REAL TRANSPORTED MAN\"?",
        "Olivia": "What's so hard about this?  I'm so nervous- I'm sorry, I'm making mistakes.  I don't really.... have anywhere to go.  Cutter said it would be okay till we get another booking. What are you doing?  You're going to do something to that man, aren't you?  Cutter's hopig you'll let things life. He says if Borden thinks things are even between you then we can-  Us.  You're going to need a better disguise.  What happened?  What happened, Robert?  Was it good? 51.  It is the same man.  He wears padded gloves to hide his damaged fingers, but if you look closely you can tell.     Mr. Angier, Mr. Cutter, I would like you to meet Mr. Gerald Root.  He's an out-of-work actor- of course he's out of his mind.  You walk through this one- then...?  Oof. Couldn't you find a softer one?  And Root goes up through there? 59.  It's going to be amazing, Robert.  You went and saw his show again?  You becoming obsessed, Robert.     I care about the man in the box.  Life is not full of these moments, Robbie.  We've worked hard for this, and we need to celebrate properly.  What's wrong? It is your wife?  Didn't you see the audience?  Well, they loved it.  Borden's trick is nothing compared to ours. He doesn't have any style-  Why?  Work for him? Are you joking        Why would he trust me?     My name is Olivia Wenscombe.  No. I'm here to give your show what is missing.  Me.  I've left Angier. I want a job.  I know you have no reason to trust  Mr.Borden-  Alfred. I'm going to tell you the truth.  I'm here because he sent me here. He wants me to come and work for you and steal your secret.  No. It's killing him. he's obsessed with discovering your method. He thinks of nothing else, and takes no pleasure in our sucess. I've had enough. There's no future with him. He sent me here to steal your secrets, but I've actually come to offer you his.  I was expecting you sooner, Robbie. Your message said \"afternoon\". 75.  What do you mean? You sent me to-  That's my job-!  You abandoned me to him!  I did everything you asked.  Cutter was right- it's a double.  He didn't say anything- he'd never say. I've seen things- make-up, glasses, wigs. We don't use any of it for the show, but I've found it hidden backstage.  All the time? He doesn't know when  You thing you can see everything, don't you?  But the Great Danton, is a blind fool.  His notebook.  I borrowed it for tonight. I thought you'd be able to translate some of it, but now I realize-      And without the keyword? 77.  No, we won't- if I don't get that back tomorrow morning, he'll know I took it.      He knows where I live!      He'll know it was you-  Robert? I have fallen in love with him.  What trick, Freddy?    Good-night, Mrs.Borden. Good-night, Freddy.  No. It's killing him. He's obssessed with discovering your method. he thinks of nothing else, and takes no pleasure in our success. I've had enough. There is no future with him. He sent me here to steal your secrets, but I've actually come to offer you his.  No. This is what he told me to tell you.  The truth is that I loved him. And stood by him. And he sent me to you like he'd send a stagehand to pick up his shirts.  I hate him for that.  You may know he does his tricks... but you can't understand why no one can see that yours are better.  You hide this. I had to look closely to spot it when you performed the Transported Man.  But this makes you unique... it shows the audience that you aren't using a double; You musn't hide it, you must display it proudly...  I'm sure it takes great skill to perform illusions with one good hand.  Then let people know. You can be so much more then he is. I can show you how.  Robbie's blinded by his jealosy. He'd do anything for you secret. Sending me away was the least of it.       What is it. Freddy?  Freddy, I've told you before. When you're with me, you're with me. Leave your family at home where they belong.  I'll get dressed.  I saw Fallon hanging around my house again, after you left.  There's something about him I don't trust.  You haven't spopken about her, Freddy. Not once.  Don't be cruel.  Because she was part of your life and now she's gone.  She wanted to meet me the day before she killed herself. Said she had something to tell me about you. I was such a coward, I couldn't bring myself to face her.  What would she have said, I wonder?     You could be sitting in some other restaurant talking to some other woman about me that way. It's unhuman to be so cold. 106.  By the way, have you seen who's opened at the Pantages?  The Great Danton.  After two years. And he has a new trick. They're saying it's the best that London's ever seen.  If you could see the look on your face, Professor. You should go to him- you deserve each other.",
        "Wenscombe": "",
        "Sullen": "Let me see?  I'm going to know all of the Professor's secrets.  Just stupid tricks, right? Haven't helped you get out of here- Have they? Or can't you open real locks, Professor? 48.  How'd you get so famous, then?  Oi, Borden, get back here!      Got a visitor. Lord Caldlow. With a little girl.",
        "Warder": "",
        "Captain": "I'm going to have to ask you to turn out your pockets.  Not my idea, sir. The Warden saw his show in Manchester last year where he vanished into thin air- he's convinced he'll try an escape.  I told him the only way Borden's going to disappear is if I leave him out with the others immates.       Dead God.",
        "Defender": "How large was this tank?  How do you think Mr.Borden was able to move the tank under the trap door without anyone noticing?",
        "Robert": "",
        "Angier": "A cypher. An enigma...  ...Borden's cypher is simple- unraveled by a single word. Now it takes only patience. And a passion to know his mind.       Quit a reception.  As long as it takes. I'll need a coach tomorrow to take me up the mountain.      Not the welcome I was expecting. 12.  I've come to see Tesla.  He built a machine for a- for a colleague of mine. A long time ago. Can you get me a meeting with him?  I've come a very long way.  I've brought a lot of money.  I'll be staying at the hotel. Indefinitely.  Your watch. 13.  April 3rd, 1893... a few days after he first met me...        He can't use plants for every trick.  Actually, I do.  I could.  Show it to me twice, I'll do it.  Why?  Chung Ling Soo.  Which is?       Where's he from?  He works for another magician? Aren't you worried he'll steal your tricks?  How do you know? 18.  I don't know if I trust him.  You think everyone's alright.  You're wrong. It can't be.  but look at the man!  I can barely lift this thing and it's not even filled with water. Or fish. He must be strong as an ox.  Any time he's in public. Any time he goes out. It's unthinkable. 22.  Borden saw it at once. I couldn't fathom it- living your whole life pretending to be someone else.  I don't think changing your name compares.  I promised my family I wouldn't embarrass them with my theatrical endeavors.  It's French.  Borden writes as if no one but he understood the true nature of magic...  ...but what does he know of self- sacrifice more than the rest of us?     How can be not know?!  He must know what he did. He must. 30.  Why are you here?  My profession also deals in secrets.  It's a rotating transposition that shifts every day of the dairy. Simple but time-consuming to translate once you have the five-letter keyword.  We magicians have a circle of trust.  Maybe I bought it.  It's how we pay for our retirements and how greats tricks outlive us.  I've already found it. That's why I'm here.  Tesla built one for another magician.  Call it a professional rivalry.  I understand discretion. I just want the machine.  I thought it was a secret. 33.  Where are the wires?  Where's the generator?  But that must be ten miles from here. 34.  Never thought I'd find an answer at the bottom of a pint glass.  Who?  You got me a booking? Why?  Someone who know that it wasn't your fault. Someone who knows Alfred Borden and his repertoire of exotic knots.  To die like that. Locked in water... lungs screaming... What did she go through, Cutter?  Which knot did Borden tie that night?  Wouldn't say?!  We should see about an assistant.  Yes, I have. The Great Danton.  No. It's sophisticated.          The bird cage can't be our climax- everybody knows it.  And I don't want to kill doves.  You sound like him.  I need a volunteer.        Of course not.  And one, two... THREE!         Bloody marvelous, Cutter.  Thought you said I had to get my hands dirty.      Don't worry.  You sir, in the hat. Could you show us your handkerchief?  Perhaps you'd be so good as to return it to the other man. He has yours. 42.  The audience doesn't seem to be responding much, Cutter.  Wish us luc, Cutter.  You've seen this one before?  Well, I'll make it a little harder, shall I? 43.  Two volunteers, please. A lady and a gentleman to hold this cage with me...  I'll perform this feat in a manner never before seen by yourselves or by any other audience anywhere in the worth...  Any magician can make this cage disappear... that's why I'll ask this good lady and fine gentleman to place their hands firmly on the cage...  ...to ensure that no trickery whatsover is employed.    I should've spotted him. 44.  Don't suppose they'll let us do this one again.  So what's the climax of our show?  Mr.Merrit, we have a week's engagment-  The name stays.  I saw hapiness...  ...hapiness that should have been mine. But I was wrong.  Reading his account I realize that he never had the life I envied.  The family life he craves one minute he rails against the next, demanding freedom. His mind is a divided one... 47.  His soul restless. His wife and child tormented by his fickle and contradictory nature...           You've been sleeping here?  Researching. Part of a magician's job is to watch his competition, to see what illusions they're-  Even? My wife for a couple of his fingers? He has a child now. And he's perfoming again. Borden is out there, living his life just as he always intended. As if nothing had happened. And look at me. I'm alone. And no theatre will touch me.     He had a new trick.  It was the greatest magic trick I have ever seen.     Did they applaud when you saw it?        He's a dreadful magician.  How does he do it?     I've seen his perfom ir three times now, Mr. Cutter- the Prestige is the  The same man comes out of the second cabinet. I promise you.  He doesn't know how to sell his trick to an audience. But I do. 53.  The man stole my life. I'm going to steal his trick.  He doesn't use a double-  Take a good look- let's get out there and find me.  I saw a lecture you gave in London, several years ago. I'm flattered you agreed to see me.  What's conducting the electricity?  I need something impossible.  If people thought the things I did on stage were real, they wouldn't clap- they'd scream. Think of saving a woman in half.  Price is not an object.  I'm noit sure I follow.  Have your obsessions done you no good?  if you understand an obsession then you know you won't change my mind.  Will you build it?  He's out of his mind.  I don't need him to be my brother. I need him to be me.       It has to be. Borden's trick is getting noticed. The place was packed today.  All I have to do is keep myself stinking drunk all the time and no one will be able to tell the difference.     No point being coy. Borden calls his trick 'The Transported Man'?  Ladies and gentlemen, much of what you've seen tonight can be termed illusions. Entertaining trifles of the sort you may have seen other magicians perform.  Alas, I cannot claim this next feat as illusion. Watch carefully- you will see no trickery, for no trickery is being employed. Merely a techique familiar to certain citizens of the orient and various holy men of the Himalyas. Indeed, some of you may be familiar with this technique, but for those of you who aren't, do not be alarmed, what you are about to see is considered safe...       At least he got to see it. I spent the ovation hidden under the stage. No one cares about the man who disappears, the man who goes into the box. They care about the man who comes out the other side.  Thank you. Maybe we could switch before the trick. That way I could be the Prestige and Root ends up below stage.  I suppose I should get more rest.  The trick isn't good enough.  No.  It's not as good as his trick.  He doesn't have to spend the finale hiding under the stage. 64.  I need to know how he does it.  So that I can do it better.  I need you to go and work for him.  You'll be my spy.  It's how we advance.  Think of it, Olivia... we've got people excited about Cutter's version of the trick- imagine what we could do with the real illusion. We'll have the greatest magic act anyone's ever seen.  Exactly why he'll want to hire you. He'll want my secrets.  Because you're going to tell him the truth.  I don't understand-  We have a problem, Cutter.  He'll be perfoming right across the street.  Don't tell me he fell over again.  He's blackmailing us? 69.  How much does he want?     What's the point?  Pay him whatever he wants, for now. We keep doing the trick till Borden opens, then we'll phase it out.      Cutter was always surprised how fast Root turned bad.  We paid him enough to keep him in beer- you wouldn't expect him to rock the boat. Today I learned Borden's view on the episode...  ...and his account suggests a reason.  ...some of you may be familiar with this technique, but for those of you who aren't, do not be alarmed, what you are about to see is considered safe...  Well, he did.  No. I don't.  He's the Great Danton. Let him cut himself down.  You weren't expecting me?  Well, it takes a bit for me to get around these days...  He's taken everything from me. My wife, my career... now you.  I sent you to steal his secret- not to improve his act-  Or to fall in love with him!      Of course Borden said that-       All the time, Olivia- that's who he is, that's what it takes- he lives his act, don't you see?! And just because you're sleeping with him doesn't mean he trusts you.  You stole it?  I can't.  Olivia, no one could- It's a cypher- with a transposition that probably shifts every day of the diary. Even with the keyword it would take months to decode...  Perhaps never. We'll see.  You can'r possibly think I'd let this go? This is his diary, Olivia. All of his secrets are right here, in my hands.      I need to know his method.  I don't care about my wife- I care about his secret!  Look, I'll go to his workshop and stage a break-in-  Yes, me, not you. Understand? 78.  Then I know how hard this had been hard for you.  Why's that?  The sacrifice, I'm afraid, is all going to be yours. Unless you give me what I want.  Your secret.  Your method for the Transported Man. Fallon wouldn't tell me. In fact, he doesn't talk at all.  Useless without the keyword.  Write down your method Mr. Borden. Describe it in full.  I want the method not the keyword- I don't even know if the secret is in you notebook. 81.  How fast can you gid?  How's the arm?  Our answer, Cutter. I haven't looked yet, I wanted you to share this.  Well, let's find out, shall we? 82.       Then the rest is up to me.  I thought I had the place to myself.  No?      I've veen played for a fool!  Tesla never made a machine like the one I asked for.  You let me believe that he had, Alley! 89.  You stole my money because your funding was cut off- you've been shooting sparks at my top hat, laughing at me all along while you use my money to stave off ruin. I've seen Edison's men-  In the hotel. I've every mind to bring them up here myself-  Then why isn't the machine working?  Where did my top hat go?  I'll go.  Here, kitty, kitty.  So the machine was working?  Which one is mine?       What box?  Tesla's warning is as unheard as he knew it would be. Today I tested the machine...  Taking precautions in case Tesla hadn't ironed out the kinks in its operation...  ...if it went wrong I would not want to live like that for long...  But here, at the Turn, I must leave you, Borden...  Yes, you, Borden. Sitting there, in your cell, reading my diary. Awaiting your death. For my murder. 98.  I heard about a booking...  Nice little theatre. Good up-and- coming magician.  It's a good to see you, John.  I need your help, John. My last show. A limited engagement.  A wise man once told me that obsession was a young man's game. I'm almost done. One thing left...  The real Transported Man. 102.  i don't want you backstage, I need you front of house, managing.  i need you calling in any favours and connections you have left to get us the right booking for the run.  The sort that Borden can't ignore.  Pleased to meet you, Mr. Ackerman.      Are you interested in helping us?  Ladies and gentlemen, my first trick of the evening is one that involves considerable risk.  Anyone in the audience who would be irrevocable damaged by seeing a man drown should leave now, for when I tell you that the young lady who taught performing it, you will understand the seriousness of the danger involved.  In my travels I have seen the future, and it is a strange future indeed. The world is on the brink of new and terrifying possibilities.  Man's reach exceeds his IMAGINATION!  You found him.  I told you, John- I don't want you backstage on this one.  Disposing of the Prestige materials.  Do you really want to know?          They flatter you with all those chains, Alfred. Don't they know you can't escape without your little rubber ball?  All I wanted to do was prove that I was the better magician. But you couldn't leave me alone.  No. Not anymore. And I win. Because no one cares about the man in the box, the man who disappears.  I know how hard it is to have someone so precious taken away, don't I 115.  Borden? But you can't take her with you know, can you? She'll be looked after. Good-bye, Professor.  Your secret.  You always were the better magician, Borden. We both know that.  But whatever your secret was, you'll have to agree-       For God's sake, Borden.  Hello, Cutter.      I magician never reveals his secrets.  Good night, Jess.  She needs looking after-  You don't have to. I'm going to make sure the machine. is never used again. A good magician never repeats his tricks. 118.  My theatre. It belongs with the Prestige materials.     Cautions as ever, Cutter. No one's going to use the place. I own it.  It's a good thing I retired early then.  We'll put it down the end.  Cutter, I tried not to involve you.              A brother. A Twin.  You were Fallon. The whole time...  Were you the one who went into the  -or the one who come back out?  Cutter knew. But I told him it was too simple. Too easy.  What about Olivia? And your wife?     It takes everything.                         It took courage to climb into that machine every night...  Not knowing if I'd be the Prestige.... 126.  Or the man in the box...  Nothing? You never understood, id you? Why we did this? The audience knows the truth- that the world is simple. Miserable. Solid all the way through. But if you could fool them, even for a second, you could make them wonder. Then you got to see something very special...  You really don't know?  It was the look on their faced."
    },
    "imdb_rating": "8.5",
    "description": "Set in London in the 1800s, two rival magicians read each others diary containing the secrets of their magic tricks and personal life. As we go back in time when the diaries were written, both magicians become obsessed with their rival's best trick. The tricks, as shown to the audience, look the same, but neither magician can figure out how his opponent does it.gary",
    "name": "The Prestige",
    "genres": [
        "Drama",
        "Mystery",
        "Sci-Fi"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMzZhOTVmOTEtZGIxZS00MmExLTk1OWItOTFhMzNjNzNiN2M4XkEyXkFqcGdeQXVyOTU2NDAzNDE@._V1_QL75_UY281_CR11,0,190,281_.jpg"
}