{
    "filename": "Other-Boleyn-Girl,-The_script.txt",
    "imdb_id": "tt0467200",
    "imdb_url": "https://www.imdb.com/title/tt0467200",
    "characters": [
        "Anne Boleyn",
        "George Boleyn",
        "Henry Percy",
        "Lady Elizabeth Boleyn",
        "The Duke of Norfolk",
        "Sir Thomas Boleyn",
        "William Carey",
        "Katherine of Aragon",
        "Rider",
        "Physician",
        "Lady in Waiting",
        "Jane Parker",
        "William Stafford",
        "Mary Boleyn",
        "Henry Tudor"
    ],
    "dialogues": {
        "Anne": "May we come in..?  Look at you..! Younger than me. More beautiful than me. Married before me. I am eclipsed. I am just the `Other Boleyn Girl.'  Who is that? He was staring at me in church?  Betrothed is not married, brother George. A lot can happen before you reach the altar.  You asked to see me father?  Yes. But Father took me aside. It seems he has ambitions for me, too.  It's known the King has a wandering eye. Imagine...if he were to like me?  But as the King's mistress the least I'd get after he finished with me would be an Earl. And if I fell pregnant? And gave him what his wife has failed to? Quite apart from the money, it'd be a Duke at least.  I could be a happy Duchess.  Are you nervous?  You'll tell me everything in the morning?  No details spared?  There he is!  You think he will like me?  Your Majesty..  Here is the library.  And through here, the observatory..  falcon, your Grace.  I have no idea. Ask my father. Perhaps because falcons are vaguely associative with field sports - field sports with aristocracy - and in the absence of a genuine coat of arms.. ...a man with ambition will do the strangest things.  Oh, his Majesty has nothing to fear from me. Unless he fears an excess of compliments.  Me, my Lord? I know little of such matters, but I've not heard mention of our armies. Undefeated, I believe, in a generation.  Or our navy? The finest in the world.  The universities in Spain and the philosophers in Germany may be strong, but are they really the equal of Oxford and Thomas More?  I doubt there is a country that is fairer in Government, or better protected by nature from her enemies, whose people are happier or more prosperous..  Good morning, your Grace.  On my own your Grace.  They have invented a new saddle which allows ladies to ride on their own.  Why? The same way you hold onto yours, your Grace.  Hah!    What?!?  What for? You think I want the King? Or to be used and abused by him? No! You're welcome to him. I have my own plans, which don't involve becoming a rag that will one day be discarded.  No.  No one.  But you cannot undo what has been done before God. And consummated too.  I have lain with my husband. There is nothing improper about it..  ou told them, didn't you?  Really? For MY good? I'll try to remind myself of that. While I'm in exile. And you're here, in the King's bed, and unchallenged for our father's affection. That it was for MY good. Not yours.  I was just giving my thoughts on the new French King.  That for someone with such great wealth, and power..he has surprisingly little authority as a man.  And is SO consumed by one particular rivalry he can barely think.  A neighbouring King, who's name one is forbidden to mention at court. Whose reputation haunts him in his thoughts and dreams.  Whose armies and navy thwart his every endeavour. Whose physical and intellectual endowments are known far and wide.  In order to restore his confidence, this French King spends a fortune on anything that glitters, on building of castles with large towers..  But these symbols of wealth and virility fail to convince. Talk among the ladies at court in France suggests..  That in this department too, the King has his shortcomings.  Open it.  I said `open it.'  Now close it again. And send it back.  You heard me.    Yes.  On the contrary, my Lord. They pleased me greatly.  ecause my sister lies in bed with your  beg you, my Lord, do not do this. What  But Mary is still the mother of your child. And even if she weren't..  How could I forget that you chose her above me when we first met? You liked her better.  Either way, I could never betray my own sister..  Perhaps. But since it can never come to anything..  Your Grace, this is not the time..  But how could I ever TRUST you?  When I have seen how you have betrayed first your wife. And now my sister.  Then don't acknowledge the child.  What my sister has given you, I could, too.  Very well.  Or what...Uncle?  Mary should go back to her husband.  She has been inconvenienced long enough by this family.  I understand you're angry - but be assured. I did nothing, except remind him of you.  Well, hasn't it?  Never. I'll make sure he understands I'm a greater thing by far. That he can never have me until he makes me a far greater offer.  That's not what I mean.  And don't you ever mention his name to me again. I'll never forget how you betrayed me.  I did, sister. Every day for three years.  As what?  But it's not true. You are loyal to the QUEEN above all others.  But she sits on a throne beside you. Accompanies you to every state function.  Still, she is your WIFE. And ever present. And I feel her eyes on me. And those of her spies.  And look at us. Forever reduced to meeting in secret like this. Speaking in whispers. Hardly conducive to passion?  109                                                            109   I'd like to. But I'm afraid I find the insult too much to bear.  Because as long as we remain unmarried, any child I gave you would forever be daubed `bastard' and I a `whore'.  Katherine of Aragon is alive. That woman is not worthy of the title `Queen'.  I really do not know why we waste time talking of convents when you could annul the marriage.  That woman married two brothers and therefore sinned against God.  They were married six months.  And Katherine is a shrewd woman who knew that her position as Queen would never be safe until she bedded your brother. Talk to your advisers. They will tell you as much.  But that's wonderful.  Why do you look sad?  es. But any court made up of YOUR  hen you, my sweet Lord, will be free to  Then what troubles you?  Why? You have justice on your side.  21                                                             121  Who?  I must go to the King.  Mary?  uch beautiful hair.  Thank you for coming.  I hate how this matter has come between us. I wanted to come to see you after your daughter was born, and again when your husband died, but..  I'm frightened, Mary. What have I done?  And..?    hen let it be exactly that. A new start  What? That damp old ruin? With no food? Or warmth? Why don't you let your family look after you? Your children would have the best of everything here. They would grow up safe and secure.  Yes, it is. Stay with me, please? I need my sister by me side.  The crowds have no vote. And the bishops that do are in Wolsey's pocket.  God, she's coming towards us.  You failed to give England an heir.  What upsets the King upsets me.  Wolsey promised the King his verdict. Instead he has humiliated him.  Yes. But without the Pope's blessing, the result will seem hollow. If only the King would take matters into his own hands.  But the alternative is leaving this country without an heir. Failing in his duty as a King. And risking civil war.   One he could hold in his arms..  A strong, rosy-cheeked boy..  Go, on..  139                                                               139   I thought I had made myself clear. Until we are married, there is no questi..  Stop, you are hurting me..!  140                                                              140   How was he with you? As a lover?  No reason.  Did you hear? On the way to the church? They were calling me a witch.  But what if it doesn't? What if they hate me forever?    What? No! I need you here more than ever. Besides, as the Queen's sister, you can't live alone out there like some gypsy. We need to make you a proper match.  What about the Duke of Suffolk?  All the ladies at court are mad for him. Or Lord Fardingly. Marry him and you'd own half Scotland..  God, I look hideous.  Little nips and stabs.  But if it isn't? The King will take that as evidence of God's displeasure. And will turn further against me. He's already become so cold.  They say you can tell by the shape of the stomach. Mary, what do you say? Boy or girl?  What's the matter with her?  You've been like this for days.  Mooning. You're not in love, are you?  And..?  A girl?  146                                                            146   Who is it?  Yesterday it was the wife of the French Ambassador. The day before with the Countess of Salisbury. How could he DO that to me? So SOON?  Now I know how it must have been for you.  You can't ignore me like this. I am your wife! Why don't you just admit it!  Liar! I can smell the whore on you! Get away from me! You disgust me!  I struck him today. What am I doing? I am destroying this all on my own..  I can't sleep at night! And without sleep I cannot think!  nd it's getting more and more difficult  It's slipping away, Mary. I can feel it.  150                                                            150 1     HENRY repeatedly strikes her. Hating her. Hating himself.            I'm fine, thank you. Just a bad dream.    155                                                             155        I lost it. Almost without pain. And so fast it was over in a moment.  ou have to get rid of it. Bury it. Get  It's not the first. Miscarriage.  They will take it as proof that I cannot bear children. That I am cursed by God. And should be dispensed with.  he King would never lie with me now,  No, if I am to survive..I have to take matters into my own hands.  I need a baby, Mary. Must I spell it out?  Of course.  Obviously, it would have to be someone close. Very close..  Don't you see? This affects all of us. If I go down, so do all of you. The only way to save ourselves..is to do this.. And pray it's a boy.  Mary, sit down..  George is staying. He understands this involves the whole family..  George, is STAYING!  Mary! Come back!      159                                                               159      61                                                               161  163                                                               163    164                                                               164    It is a sad day for England when the nobles do not rise for their Queen.  Charged is different to convicted, Uncle. Or is it not? In this court?  Not guilty, my Lord.  My noble Lords..the love I have for my brother is the love any sister would have for someone with whom she has grown up in the same house, nursed when sick, played games as children, shared life's celebrations.  That is the love I have for him. Not what you suggest.  Judge me, my Lords, as you see fit. But never forget that your verdicts will be judged again by God, in the greatest court of all..  196                                                               196     How has it come to this?  198                                                            198   They're letting the crowds in.  The King saw you?  We all made a mess of that, didn't we? We all underestimated little Mary.  I don't think he ever stopped loving you.  It is. He never loved me in the same way. And deep down you know it.  You should have been Queen. You even gave him a son. But instead all this has happened because.. Because I couldn't bear to be the Other Boleyn Girl.  And now look?  Hold me..  You'll look after Elizabeth?  he couldn't ask for a better moth...  I...I come here to die...a loyal subject..    ..I..I do not blame the King. Never was there a more just or goodly Lord..  ..I beg God's forgiveness and his mercy..",
        "Boleyn": "5                                                                 5   7                                                                 7   17                                                             17       18                                                               18   19                                                             19   36                                                             36   49                                                               49   0                                                              80  82                                                                82    83                                                                83    85                                                                85    86                                                                86    89                                                             89   90                                                             90      91                                                             91   92                                                               92       124                                                            124  27                                                            127  128                                                            128   131                                                            131",
        "George": "No, is this it? This is the end of the unholy trinity?  That's Henry Percy. Heir to the Duke of Northumberland. Richest landowner in England.  But don't get your hopes up. He is already betrothed.  It would be a great honour, Sir.  Not noticed her? Jane Parker? Of course I have. How could I not? She looks like a goat.  Ugh. Well say you haven't seen me. Or that you forgot.  There is something about that woman that makes me feel...  ANNE? You know she took being upstaged by you very badly.  And no amount of interventions on my behalf would make her believe you hadn't done it intentionally.  I know.  Just give her time. She'll come round.  t's Anne.  he's married Henry Percy!  In secret. Without telling anyone!  tailing off  It would make her the future Duchess of Northumberland. Our sister!  What?  Mary..! Wait! Come back!  Jane Parker..?  But must I actually...marry her?    I suppose they felt three years of exile was punishment enough.  They just want to protect you. Leave nothing to chance.  Why DO they make this room such a dungeon? Does it really need to be this dark?  Don't worry. She's had three years to forgive you. And she's not going to risk being sent away again. She'll do as she's told, I'm sure. Besides, the most important thing is..  The three of us will be together again.  Oh, yes. Each has her own, quite distinct virtues. Mary for example..  Anne? Well, she's strong. Some might say `difficult'.  But with it comes great passion, too. It's both the best and the worst thing about her. There are no half measures with Anne.  Oh, no. I'm certain Mary is the   right choice. You will have a serene,   happy, life with her. The risk is with   Anne, it might be like being caught in a   wild summer storm.  He's on his way.  Just imagine. It it's a boy. The unholy trinity will be mother, uncle and aunt to the next King of England.  If it's a boy, the King will have been vindicated in getting rid of his first wife, and his authority will be unassailable. But if it isn't. Or if, God forbid, she miscarries.  The King will have to move swiftly to silence his enemies. He will claim innocence. That he was corrupted. Anne will swiftly be replaced as Queen, by someone more `acceptable'. And we Boleyns will never be able to show our faces at court again.  ike the wise William Stafford.  You didn't know? Sold up and went. Left for the country. Just like that. Gone to live in some place called..  Where he grew up, apparently. Did you know he came from a better stable than all of us? His grandmother was a Beaufort, cousin to the King. And he never mentioned it. Who'd have guessed?  But that would be treason.  What..? No..!",
        "Henry": "Sir Thomas. Lady Elizabeth..    Had we known, we might have come sooner.  A pleasure.  Charming.  Lovely..  What's that?  I can see that. But what's it doing there? More to the point.. ..not just there, but in every corner in the house?  Really? And what would they be..?  Well played! And, may I say.. ..an excellent choice of music too!  Sir Thomas, Lady Elizabeth, dear Anne. Your health.  ..I had it from the lips of the Spanish ambassador himself. That our musicians are the envy of all Europe.  Our Universities and philosophers, too.  What of our painters, then?  What? Is no one proud to be English? Anne? What say you?  It's true.  Never!  She's right, by God! She's right!  Good morning, Anne.  ho will you be riding with?  Your own..?  ut with no man to hold onto? How will  We'll see.  Let's away!      Then we must follow.  And who are you?  You've been here all week-end?  Really? How could I have overlooked you?  Nonsense.  Then why haven't I seen you at court?  A charmed life in the country? Away from it all?  Everything I would have wished for myself. But then my brother died. And duty called.  You don't think he'll miss court? A young, ambitious man?  Well said.  Thank you again, Lady Elizabeth. We'll take good care of your boy.. And Thomas..  You'll take care of that matter?  Please, don't be alarmed.  I hope your accommodation is comfortable. I realise it's no substitute for the life you had in mind in the country.. But please, give me the opportunity to try to make you happy here..    I am sorry. You obviously misunderstand me.  he faints! Quick! Take her to my rooms!  `Henry', please. The first rule of this room, is to leave `Your Grace's' and `Your Majesty's' outside.  Is there anything I can bring you?  Nothing to increase your comfort or well- being?  There. There ARE no servants.  And reads. And writes. And finds a few moments each day... ...for himself.  You look surprised?  Because I trust you.  A man in my position develops an instinct. You would never lie, could never lie to me.  I also sense...that you might relish an opportunity to be yourself, too.  Well, here you only say what you like, do what you like.  What?  There are many things I cannot admit to in public. Sadness, for example. And loneliness.  Do you not know what it is to be lonely in a marriage?  But I never looked at her or longed for her the way I do you.  Imagine how different it might have been. For both of us..had we been able to chose for ourselves..  54                                                                54    The biggest warship in the fleet. Thirty- two guns and two hundred feet long, and with your permission Thomas.. ..I'd like to name her after your daughter. The \"Mary Boleyn\".  onsense. She's an angel. It's the least  Name it.  You want me to make him a match?  Do you have anyone in mind?  Go on..  verreach themselves?  One is currently in the King's bed. If they are good enough for me, I suggest they're good enough for anyone else. So.. Who is it?  9                                                               59  62                                                             62      ou poor girl. All alone in here. But  I know. But the most important thing is a healthy child.  I'll come and see you as often as I can. I promise.  What's the noise? I can hardly hear myself think!  I'm only aware of one Boleyn girl and she is lying-in with a certain child in her belly!  What? That awful girl, Thomas? The one that almost killed me? You allowed her back?  Really..?  Well, come on. Where are you, other Boleyn girl? Show your face.  So? What is so amusing, Anne? Perhaps we might hear and judge for ourselves?  Which are..?  Hah!  eally? And who is this rival?  What?  You're a fortunate man, George. To be blessed with G  I'm familiar with Mary's. Tell me about Anne's.  Careful, you'll make me think I chose the wrong Boleyn girl.  Is that so..?  storm, you say..?  She did what?  Sent it back?  What? Again?  Your daughter. Where is she?  Anne!  Anne..       A  You received my gifts?  And? They did not please you?  Then why did you return them?  I have shown Mary enough kindness and generosity. It's you I want, Anne.  YOU. Don't you see? YOU have changed.  Not true..  You see! The same pain as mine! It proves you feel the same way!  Let me decide that. For now, you have given me hope.  Anne..  Anne, I love you..  I love you Anne. I cannot stop thinking about you. I cannot eat, I cannot sleep..  I vow from this moment forth I will never lie with my wife, or speak to your sister again. I will do anything you ask..  What?  Well, I have done what you asked. Will you give yourself to me, now?  My one true mistress. To whom I am loyal above all others?  My wife? I barely see her.  Well, what would you have me do?  Wolsey has agreed to draw up plans for the Queen to be sent to a nunnery.  She will protest, of course. She won't go quietly, but she knows she has failed to give me a son, and deserves her exile. Which leaves you all alone at court..  ...queen in all but name. Mother to any future heir.  So, is this assurance enough? Will you give yourself to me now?  What insult?  Annul it?  But she never consummated the marriage with my brother.  Arthur was a sick man.  Wolsey has agreed to charge the Queen?  Because she will contest it. Which means putting her on trial. And hearing these delicate matters in public.  The Queen has insisted a Papal representative be present at the trial. But Wolsey has assured me the trial will proceed for appearance sake only. We have our verdict.  One or two friends have refused to lend their support. Among them, Thomas More. And then there's the small matter of my conscience.  Do I?  119                                                            119          Ah! Mary! Come in.  Closer.. Into the light.  The Other Boleyn Girl. I'd forgotten how beautiful you were.  Mama? What's the matter?    Who's this?  My name is Henry.  Is it, now? A fine name. And how old are you?  Four, Sir.  Is that sword real?  I think so. Would you like to see it?  Now, `on guard'.  Now you will give yourself to me.  Silence! Enough of your GAMES! I have torn apart this country for you, gone against every principle in my heart, I've endured the doubts and counsel of good men and silenced them with the axe...just to be with you..  Now prove to me it was worth the sacrifice.  I do.  Is the child healthy?  ecause it's not true!  Where are we going?  Who lives here, Mother?  Mama, I'm hungry.  Mary..?  ALL of you!  Oh, Mary...  She has been tried and found guilty.  Anne? To a nunnery?  The French Queen was a blameless woman. Your sister a witch.  How could I have made that mistake?  Choosing her over you?  o. I will reflect on the matter.",
        "Percy": "",
        "William": "Are you happy?  You don't secretly wish you'd married someone grander? With a title?  Then you've found the right man.  I am the luckiest man in the world.  Drink?  You should. It will hurt less.  Lie back.  Thank you.  The King has also offered me a position. As Gentleman of the Privy Council.    We would be cut off. He made that clear.  You say that now - but when you're older? And our children are grown up? This won't last long. A year. Maybe two. And at the end of that - we'll we have everything we want. It's for our FUTURE.  You're in love with him, aren't you?  How is it? With him?  What does he do to you? Tell me. I want to know..  I know you look at me with contempt. But I had no choice. Your father insisted I stand aside. What was I expected to do?  Have you christened the child?  I see.  And is he to take my name? Or is he to be a Fitzroy or some other sign that he is a royal bast...  I see.  Well, then, here we are.  I could pretend none of this ever happened. Start again. If you could.  Mary..!  166                                                             166    67                                                             167  168                                                             168",
        "Carey": "105                                                              105",
        "Rider": "",
        "Physician": "It's a miracle, Majesty, you have no broken bones..  Happily, the baby lives. She's not miscarried.  But the placenta is weak. For the sake of the child..  She must begin her lying-in immediately.  A boy!",
        "Jane": "I know that must have been agony, but put yourself in her shoes. She knows the only reason the King has asked you here is because he desires you. For a wife that must be very difficult. She's a good woman. Trust me.  You have a brother, don't you? George?  I've seen him a few times at court. And like him...very well. But I don't think he has noticed me.  Would you?",
        "Parker": "58                                                             58",
        "Stafford": "Your Father wishes to see you.  Just Mary.  I have orders to bring you to your father.  Sir Thomas! It's Mary..!  I brought gifts from your family. A night-dress from your mother. This from your Uncle George.  It's Anne. She's turning this country on its head. She has persuaded the king to test the validity of his marriage, and put the QueenM on trial.  She continues to hold out. Expertly witholding her favours until...  Until he makes her the ultimate offer.  ow is your husband? I heard he was  I'm sorry.    Wait! Mary..  I couldn't help overhearing. And before you agree to any of your sister's matches, let me just say..  ..I have saved money...not a lot...but enough. I've my eye on a place in the West...Tatton...near where I grew up..  Mary...I love you. There..I've said it. From the moment I joined your family..  Yes.  Mary..I have watched how your family has treated you.  And you would CARE? What THEY think? After everything they have done to you?  166                                                             166    67                                                             167  168                                                             168    74                                                              174  175                                                              175        News from court.  They say it was deformed...monstrous. She is charged with incest and of summoning the devil. Your brother, too. He has already been sentenced. Anne is in the Tower, awaiting trial.  And do what? George is doomed. For Anne it's only a matter of time.  ou think he will listen? It's his own  Fine, go. But if you do, you might as well kiss your children goodbye. You are Anne's sister. That alone makes you her accomplice and co-conspirator.  And what of your new family? Your",
        "Mary": "3                                                                    3   Hardly.  No, George. Never. I'll be married, that's all.. Apart from that - it won't change a thing.  Very.  No. I want a husband who loves me. And who thinks it first thing every morning. And last thing at night.  o - the King himself is coming to  What? What are you saying..?  But...you could never be more than his mistress. And that's no substitute for a husband.  But what about your happiness? Your future?  A little.  I promise.  Hold me a moment?  I'm so lucky to have a man who is content with what he has.  You are, aren't you?  Of course, sister. How could he not?  Mary, your Grace. Anne's younger sister.  Yes, your Grace.  Next to Anne, it's easy to do.  Yes, your Grace. To William Carey.  Yes, your Grace.  Because I have persuaded him to spend a year or two here first. We have a small manor and some land. Nothing much. But enough to start a family.  Yes.  He says not, your Majesty.  But, if he ever changed his mind, I would always support him.  ut I don't want to go to court. Nor  What?  But what about our future? Here in the country?  William, please! Don't you understand what this means?  They will separate us. Put me in different accommodation. Where the King can always...find me.  What about Anne? Couldn't she go instead?  How could he DO this to me? My own father. What if we just refused?  But would that be so bad?  Position means nothing to me. Nor wealth. We could find somewhere. A small farm. Away from everything.  ut can't you see? Do this, and we might  I'm so sorry..   N-no..   ..I'm afraid not. Your Majesty.  No..really..I beg you, your Majesty.  Mary Carey.  Yes.  I can't imagine. Should I mention you to him?  Of course. Happily.  Well, she likes you, and asked me to give you this..to remember her by.  And our sister? Any word?  Yes, I know.  But you KNOW I would never do anything like that.  41                                                                41   Your opinion, Uncle.  Mine is that it's the greatest insult of all.  Asking a whore to have feelings, too.  48                                                                48       George? It's the middle of the night.  hat?    Oh, no...!  Why would I be pleased?  But they'll never allow it, don't you see? He's already precontracted to Mary Talbot, and if word of the consummation gets out her reputation will be ruined..  ...I have to tell Father. Before it's too late..  What?  Because you would never have got away with it. And it would have ruined your prospects forever. Believe me. I did it for your good.  ANNE, wait..!  What reason have I to be happy?  Do I know you?  Wait! Who ARE you?  My name is Kindness.  What is it you desire?  You demand a great deal.  It is easy for a man to declare love from behind a mask.  If your feelings were sincere, I would never reject you.  o matter how you looked. Or who you  Your Majesty..!  Thank you, your Grace.  No.  You might ask your servants to bring me some water.  So, this is it? This is where the King of England sleeps?  I am. I suppose it's more..  ..simple than I imagined.  And yet you invite me here?  You hardly know me.  No.  Yes.  Very well.  I'd like an apple, please.. ..Henry.  Now it's your turn.  To say something, or do something you couldn't outside.  But when you are loved as much as you are? How can you be lonely?  Yes. I do now.  My father..? Well, we'd better not keep him waiting.  Yes.  Yes. More than once.  I believe so, Uncle.  illiam, you're drunk.  He pleases me. Is that what you want to hear?  Say `no', husband. That was all you had to do.  60                                                             60  Yes.  64                                                             64      65                                                                65     But I'm only three months..           67                                                                67   Will it? It's six months?  70                                                             70   71                                                             71      Why?  But the King visits me every day. There's no need for her. Or anyone else.  But in who's interests do they imagine Anne will act? Certainly not mine.  77                                                             77   Or HER, you mean.  'm wary of any suggestion that Anne  Really?  Then ask yourself this. If she is really so concerned for my well-being...       5                                                                95  96                                                                96     My Lord..?  8                                                                 98  00                                                               100  How can you show your face in here?  Oh, spare me. You did this deliberately. As revenge. And now you have what you wanted you probably think justice has been done.  Be careful, that's my advice. Learn from my experience. Because he'll only do to you what he has done to me.  You'll never get Henry Percy back, if that's what you mean.  If that's what you think, fine. Tell yourself that.  Henry.  He is to be Henry Carey.  Thank you.  Please be sure to thank them - though one wonders what's kept them so busy that not a single one of them found time to visit the new baby.  What?  ..until what?  High stakes indeed.  And my brother George?  He is.  It's fine.  Leave me. Please..?  ou asked to see me, your Grace?    You owe me nothing, sister. I did it that we may finally draw a line beneath everything that has happened between us.  Thank you. But I'd rather go back to our home in the country.  ho's that?  So, it's true. It's really happening?  The crowds are with her.    Tender. Surprisingly so. Why?  All that will die down as soon as they get to know you.  They won't. They will see how much the King loves you, and follow.  ister, I wonder if you've given any  hat?  Wait..  It was you, wasn't it? At the masked ball?  Oh, Stafford..  But it's impossible. You know that. Now Anne's Queen, my family would never allow it.  What?  What? Certainly not..    Well done...  It's a girl!  A beautiful, healthy girl.  Lady Somerset, I believe.  148                                                            148   Oh, Anne..      152                                                            152  That's no bad thing.  Anyone with any sense would have run away from this hell-hole already. As far as they could go.  What?      Why? There's still time. You could sleep with the King, and fall pregnant again. No one would know..  I..I don't understand.  You mean lying with another man?  esides, where would you find someone  Stop it, Anne! It's madness..  I can't listen to this.. ...this is monstrous..  No, Anne! I understand you have had a shock tonight. A terrible shock. But there is no need for this..  Come, George..  No. Come, George..    158                                                               158   Come on, darling wake up.  Away from here. Far, far away.  Someone. A friend.  William?  I'm sorry. I just didn't know where else to go.  I do.  What is it?  hat? It's Anne. Tell me..  I must go.  I can petition the King..  I have no choice. Anne and George are my family. I cannot desert them.  Henry and Catherine have you. Anne and George have no one. I'm sorry..  ho was it?  Your Majesty.. I understand my family has offended you. But having taken my brother today, I beg you to spare my sister.  I realise you must replace Anne as Queen. But must she die, too?  You could send her away.  You could send her to a nunnery. No one would know.  There is precedent, my Lord. Louis of France did it, too. When his wife could not conceive.  I understand Anne has offended you. I ask only that if there is any regret you might..feel yourself.  For your part in the matter..  ..does not unduly colour your thinking. Killing Anne will not make it go away. It would only make it worse.  Oh, Anne..  Ssshhhhh.  It's all right. You will be spared. The King as good as gave me his word.  Yes.  That's not true.  It will be all right. Trust me.  e will spare you. I am sure of it.  Come on..  No!",
        "Tudor": ""
    },
    "imdb_rating": "6.7",
    "description": "A sumptuous and sensual tale of intrigue, romance and betrayal set against the backdrop of a defining moment in European history: two beautiful sisters, Anne (Natalie Portman) and Mary Boleyn (Scarlett Johansson), driven by their family's blind ambition, compete for the love of the handsome and passionate King Henry VIII (Eric Bana).—Marisa_Gabriella",
    "name": "The Other Boleyn Girl",
    "genres": [
        "Biography",
        "Drama",
        "History"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMGNkYjIwNGQtZjk1ZS00ZGU5LThiMjctNTlkMmNmMmI2OTVjXkEyXkFqcGdeQXVyOTgxMDMxNTc@._V1_QL75_UY281_CR11,0,190,281_.jpg"
}