{
    "filename": "Grudge,-The_script.txt",
    "imdb_id": "tt0391198",
    "imdb_url": "https://www.imdb.com/title/tt0391198",
    "characters": [
        "Emma",
        "Jennifer",
        "Peter",
        "Doug",
        "Matthew",
        "Takeo",
        "Toshio",
        "Karen",
        "Yoko",
        "Igarashi",
        "Nakagawa",
        "Maria",
        "Susan",
        "Kayako",
        "Alex"
    ],
    "dialogues": {
        "Emma": "...I've told them over and over... I've told them over and over...  I just want her to leave me alone.",
        "Jennifer": "Mmmmmm.  Not at night.  I told you, Matthew, you can sleep through anything.  I didn't unpack it yet.  Yoko.  Yeah.     Maybe.  I went for a walk yesterday. Just to explore. I got lost and couldn't find anyone who could speak English, who could help me. I felt so... stupid.  Or else?  Deal.  I think so.  I knew you'd forget.  Dinner, your sister?    At seven?  You were going to cook.  I'll do the shopping. Just call me if you're going to be late.  If you need something, all you have to do is say so --  Who's -- who's there?  Even in our own house?  Why?",
        "Peter": "Happy Monday.  I don't even know her. She says I used to tutor her, but I don't know who the hell she is.  Hello?   Excuse me?  Hello.  My name is Peter. I'm here to see your mother. Is she home?  Hey!   Are you okay??? Hello???    Are you alright?  Are you alone? Where are your parents?  What happened to you?  ...I know, I'm sorry -- these staff meetings always run over -- maybe another ten minutes or so -- okay, I'll be home soon -- I love you too.    Toshio!   We have to --",
        "Doug": "Karen!  Maybe we should find a different train station.  We walk past this temple every day, Karen --  It's amazing. You're like this infinite storehouse of wisdom. Or trivia. I'm not sure which.  Nothing. I just -- I like that about you. You seem to be able to remember everything that's really important.  Except the time.  Is that right?  Will I see you tonight?  Fourteen.    I hate odd numbers.  It's okay.     I've got you.  Your boss told me what happened. I'm sorry.  I talked to your teachers. They said you can take as much time as you need. We could go to Kyoto for a weekend, see those temples you're always talking about.  There's nothing to run away from, Kat. No one blames you for what happened.      You went to help someone who was, quite simply, beyond help.  Don't beat yourself up searching for a greater truth, Kat. An old woman passed away in her sleep. It's sad, but that's all it is --  I'm sorry this happened to you. But maybe, in a way, it will help you later. Death is an unfortunate but integral part of your future career. There's no avoiding it. Maybe now you'll be more... ready for it.  I'm Doug.    Karen's boyfriend.  You up for this?  I got us a guidebook to Kyoto. I thought maybe we'd leave tomorrow --  Tell you what?  You were recovering from a shock. I didn't want to --  Karen -- wait --  Look, I'm sorry. I was just worried about you, and -- I know you, Karen.  So you think the events are connected?  Okay. How about this: the American family knew about what had happened there before, and this knowledge subconsciously caused them to repeat the same events.  It's exactly how superstitions survive: if you walk under a ladder and think uh-oh, you're in for some bad luck, sure enough, what do you know? You trip over --  Makes sense, right?  Saw what?    Karen?  You watched a woman die, Kat. That's a horrible thing to experience. I can't imagine how you must feel. But sometimes the mind tries to cope with terrible things in a way that distorts what actually occurred.  You just need to rest. We'll get you home, get a good night's sleep.  You sure?  I come bearing gifts.  How can I believe you, Karen?  Maybe, what?  I'm concerned about you going out while you're so upset --  Why?  \"Hey, Karen. It's me. I just wanted to say -- I'm sorry. I know I wasn't hearing you.  Hello?   Karen takes Doug into her arms as the SOUNDS continue above, growing closer. But it's no use -- he's dead.  And now there's a new sound, moving down the stairs. A familiar THROATY CROAKING SOUND, along with a strange SKITTERING, like the world's biggest cockroach.  Karen turns to the staircase to see --  -- KAYAKO, crawling down the stairs. Still wrapped in the plastic sheeting, she moves like a wounded animal, neck hanging limply, struggling to pull herself forward --  -- her eyes locked on Karen, CROAKING horribly --  Karen sorrow turns to abject terror. She tries to lift Doug's body and pull it to the front door. It's too heavy.  And KAYAKO is getting closer.  Sobbing, Karen drops Doug and falls back against the front door, bumping into --  THE GAS CANS. The one Nakagawa unscrewed TIPS OVER, spilling gasoline into the entryway.  As Doug's arm flops to the floor, his outstretched HAND lands next to Karen. She sees something clenched in his fingers --  -- his ZIPPO LIGHTER.  Realization dawns over Karen as she feels the liquid spilling onto her hands. The odor is unmistakable.  Karen immediately reaches forward, trying to loosen Doug's grip on the lighter as --  -- Kayako reaches the bottom of the stairs. Her broken neck makes a horrific CRACKING as she swivels to face Karen.  Karen finally gets the lighter. She pushes back against the door with legs too numb to stand. Her eyes drift up to see --     -- TOSHIO, watching from the railing above, as before, his cold eyes locked on hers.  Karen grabs another can, and spins the lid until it pops off. She tips it onto the floor, spilling more gas.",
        "Matthew": "You're up?  I wonder if Mom's okay. She's been sleeping ever since we got here.  I'm sorry, sweetheart. It was probably just the move -- I'm sure she'll get back on schedule.  You seen my travel mug?  Maybe you should say something to the helper, what's her name?  Who knows? Maybe there's something she can suggest.  I miss seeing this every morning.  Hey, kiddo. You okay?  This will get easier soon, for Mom, for all of us. I promise.  Or else I'll tell the company it's just not working out, and that we're going back to the States with or without my old job. They can get someone else to crunch their numbers.  But until then -- promise me you'll give it a good try, okay Jen?  Is this Yoko's bike?  It's been here all night.  I'll probably be home late, maybe around nine or so.  Oh yeah.   Right.  I have a big conference.    They usually run long.    Jen?   Susan?  What the hell? --  Mom?   Are you alright?  Where's Jennifer, Mom?  Did Yoko come today, Mom? Remember? The pretty girl?  Jen?   Are you up there?  Dammit.  Jennifer?    What is it --  What's wrong? What happened???  I'll... I'll call an ambulance...  Dammit!  Jesus Christ...  `Ambulance'... \"kyukyusha\".  Who are you? What -- what are you doing here?  She went out. Something came up.  I'm sorry.     This is a bad time.  You should go.  She doesn't love me... she never loved me...  Leave me alone.    What did he say?  Oh.    Right.  Isn't the layout great? Wait `till you see the back room. It's perfect for Mom -- she won't have to deal with the stairs.  Her bed won't be here until next week, but we can put the mattress on the floor. What do you think?  Where's Mom?  Did you get her?  She okay?  It's perfect. We'll take it.  It's me.  I'm downstairs. What number are you again?",
        "Takeo": "",
        "Toshio": "",
        "Karen": "I'll never get used to this.  A public display of affection is considered rude in Japan.  What's that?  Yeah, but I've never seen this before.  It's a Buddhist ritual. The incense smoke carries the prayers to the spirits of his ancestors, to help them remain at peace.  It's not trivia. It's what they believe. And it's far better, by the way, than your little pollution ritual.  What?  Oh, crap --  C'mon, you're gonna be late.  Uh-uh. Seven years of bad luck. And I might have a vested interest in those years.  Maybe.  I'll call you when I get home.  I just came by to pick up some books I left here. I'm not scheduled to work today --    What's this phrase?  Hello?   Mrs. Williams?  Is anyone here?  Oh my God... are you alright? --  Okay, Emma. Let's try again: my name is Karen. Do you remember? I'm from the Health Center. I'm substituting for Yoko, just for today.  Looks like you need a new Band-Aid. How'd this happen, Emma? Would you like a bath? Maybe that will help you feel better.  It's okay, Emma.  Nice one, Karen.  How did you get up there?    Yes, he was shut in a closet! There was tape around the -- No, they're not home yet. I don't know, Emma hasn't said a word to me -- He's still upstairs -- yes, I'm sure he's Japanese -- But -- Yes, alright, Alex. Just please get here as soon as you can.  Hello there.  My name is Karen. What's yours?  Emma, who were you talking to?  You should get some rest, Emma.  Running away won't help.  I'm not even sure what did happen.  No, that's not what I mean...  That house. There was something...  Is that how they said she died?  I don't think I'll ever be ready for something like that.    Okay.   Tired.  Three months. I needed a social welfare credit.  Yes.  Did you find him?  Yes, that's right. He was... holding a cat. A black cat. There was a book in the closet, too. I think it was a journal.  I don't think so. I think it belonged to a woman.     Nakagawa looks up.   Karen tries to explain:   The writing. It looked feminine.  I left it on the kitchen table.  I asked him his name.   He said `Toshio'.  This is him. This is the boy.  Yes.   Positive.  Detective Nakagawa?  The whole time I was in that house, I felt something was... wrong.  What happened there?  Toshio...  Why didn't you tell me?  About the bodies they found in the attic.  The same thing happened three years ago, Doug. To a Japanese family, who lived in that house. They were all found dead.  How would you explain it?    Okay. Then explain this: when I went to that house, I didn't know anything about its past. But yet I still saw...  Emma and I were alone in that room, but -- there was something else there. I'm sure of it.  You might be right, Doug. But I know what I saw. I think I know what I saw...  Yeah.  You've got class, and I'm sure I only have to fill out a few forms or something --  I'm fine, Doug. Really.                                     That's the boy who was there yesterday. In that house. But this boy, he's --  -- he's supposed to be dead.  I saw him, Doug. I talked to him. He told me his name. A boy who was killed by his father three years ago told me his name.  You don't believe me.  Hello?    Alex and Yoko are dead.     You don't understand.   I have to, Doug.  Because I've been inside that house, Doug. Don't you get it? I've been inside!  I love you. But I have to go.  I'm looking for Maria Kirk?  My name is Karen Davies. I'm a student at -- I'm sorry to bother you, but I was wondering if I could ask you a few questions.  Ms. Kirk?  I'm here because... I need to speak with you about your husband.  Maria --  I just need a couple minutes.  Your husband, Peter.    Three years ago he...  He killed himself.    I didn't.  I think there's a connection between your husband's death and something that happened to me.  It's... hard to explain.  Look, I know this sounds strange, but... I don't think your husband wanted to die.  If that's true, then why are you still here in Japan?  Did you know a woman named Kayako?  Did Peter?  Maybe it was someone he worked with?  Please. I don't know what else to do. Please help me.    Excuse me, I need to speak with Detective Nakagawa.  It's an emergency.  Yes, I have important information for him about a case...  His partner, Detective Igarashi? Can I speak with him?  They're dead, aren't they?  A reading light on the computer desk provides the only illumination in the dark apartment. Karen enters, standing in the doorway for a moment.     Shell- shocked. As she slides off her coat:  Doug?  No.  Doug!   Where are you???  Doug???  Oh my God...  No more... please, no more...",
        "Yoko": "Hi, excuse me?  Emma?   It's Yoko.   I'm coming in.  Hi, Emma.    It's good to see you again.  My name is Yoko.  You should be in bed --  You shouldn't be playing with this!",
        "Igarashi": "I can handle this myself, you know. It's just a routine call. I don't know why you wanted to come.  That's Matthew's sister.  This must be her.  God!  What the hell... what is going on?  What is that?  Someone just reported another death. It's not in our district... but I think we should check it out.  The cause of death is not clear... but it is the man who sold them this house.  We checked the apartment of Susan, the sister. She wasn't there...  The chain lock had been drawn from the inside. And the deadbolt. But we found no one in the apartment.  They were the first family to live in that house since the incident three years ago --  But I thought you said her body was found with this man, tonight.",
        "Nakagawa": "I am Detective Nakagawa. This is Detective Igarashi, my assistant.  She is very shaken. We would like her to stay in the hospital tonight, under evaluation.  Do you know these people?  When was the last time you saw him?  We've spoken with his employer.   He did not show up for work today.  If you could please come by tomorrow to make a statement, the address is there, at the bottom --  I'm sorry?  For how long?  Call her at work, then at home. If no one answers, send someone to --  I need your flashlight.  We don't know.  Is it possible that someone could live without... that?  Why?  I'm sorry to disturb you, Miss Davies. I was wondering if you could answer some additional questions?  How are you feeling?  You are an exchange student? And you have been volunteering at the Health Center for...?  You said this was the first time you'd been in that house?  About the Japanese boy you said you saw there --  No, not yet. You said the boy had been taped into the closet?  Did it belong to the boy?  I didn't see any book on the table. Perhaps someone moved it. Did you speak with the boy after you opened the closet?  One more question, please.  We found this in the room where...  Are you certain?  The bodies of the son and daughter- in-law of the woman you were caring for were found in the attic.  It seems that the son killed his wife, and then himself --    Yes?  Get the surveillance tapes from the office building.      Hello?  Have you determined a cause of death?  I don't understand. He killed Yoko, before he died?  Then how did she get from the house to the Health Center?  She survived for two days without this?  How is that possible?  Nakagawa is looking at the same picture, in his file. OFFICER #1 appears in the hall.   Knocks gently on the door.",
        "Maria": "Hey.     Are you okay?  Peter?    What's the matter?  Yes?  Who is this?  Questions about what?  Leave me alone.  Please.  I'm late for work.    Well?  He what?  Thank you.  How did you know Peter?  Then what are you doing here?  What happened to you?    Let me guess: `hard to explain'?  I put all this behind me. I don't want to open it back up again.  Because I can't leave. I tried. But I couldn't. Not without...  He usually didn't wake up before me. But that morning, he did. He made coffee for us. Then he sat there and waited for me to wake up. And when I did, he looked me right in the eye. And then he jumped. The night before we'd been talking about having children together...  No.  I don't think so.  Look. I've had the police up here, I talked with Detectives, I even hired a P.I.--  I don't know what you're going through, or what you think you know about my husband. But I don't have any answers. I'm sorry.  This is all his stuff from school.  This was our first date.  What?   Did you find something?",
        "Susan": "\"Hey, guys, it's Susan. Matt, are you there? Pick up...  \"I just wanted to make sure Mom is okay. Yesterday was... a bit weird, and -- I'm just a little worried.\"  \"Listen, just give me a call when you can, okay?\"  Hello?  You guys in the kitchen?    Hi, Mom.    How are you feeling?  I guess I came at a bad time, huh?  I'll give you guys one minute to finish whatever you're doing up there and get your butts down here.  I mean it, guys.  Well, I warned you. Prepare to be emotionally scarred.  Matthew!   Don't scare me like that!  What's going on?   Where's Jennifer?  I hope she's not long.    I'm absolutely starving.  I knew it. You guys forgot to go shopping, didn't you?  Are you okay? What's going on?  Did something happen?    What's --  What are you talking about?  Stop it, Matthew.  Matthew, please --  This is Suzuki-san, he's the Real Estate broker.  He said: \"welcome to Tokyo\". And that you must be very important to your company for them to rent this place for you.  Your shoes.  Even in your own house.  He says no one has lived in this house for three years.  Mom?   Where are you?    C'mon, Mom. You know what the doctor said about stairs.  Mom?   What is it?         Hey, guys, it's Susan. Matt, are you there? Pick up... Okay, well, I'm leaving work now so you can try my cell, or just call me at home later.  I just wanted to make sure Mom is okay. Yesterday was... a bit weird, and -- I'm just a little worried. Listen, just give me a call when you can, okay?    In the stairs... there was... something... a strange person... all the lights were going out...              Hello?  Matthew!   Are you alright?  702.   I'll buzz you in.  I don't know what you're up to, but this is not cool --                     -- slowly walks into THE KITCHEN. She reaches out and turns the faucet handle. Tightens it. The dripping stops. Relieved, Susan turns away -- -- DRIP.   DRIP.   It begins again.   Louder, more intense. Scared, Susan turns back to the sink. Water is now GUSHING OUT from the faucet, filling up a bowl in the sink. She slowly reaches out a hand and turns the faucet, as tightly as she can manage -- -- tighter... tighter... straining with the effort.. Until the water stops.   Only then does she let go -- -- just then, a CHILD'S PALE HAND quietly rises to the surface from water in the bowl, and starts VIOLENTLY SPLASHING the surface. Susan screams and runs back to her bedroom -- She lies down, shivering, pulling the quilt to her chin.      A final retreat.  Please... stop it...",
        "Kayako": "",
        "Alex": "Karen!  Are you free this afternoon?  I know. But are you free?    Do you have class?  Your wish has been granted.  It's Yoko's case, but she didn't show up for work this morning, and I can't reach her at home. She must be sick, or something. And she has the damn house key.  \"Mild dementia with severe lethargy.\" Apparently she sleeps through most of the day. Her daughter-in-law doesn't work, so she'll probably be there.  You're the one who's been bugging me about getting out there on your own. Besides, it's an English-only house.  Here's the address. Use the wall chart if you need help -- and don't forget to bring a map.  Don't worry Karen, you're ready.  Karen?  Is Karen okay?  Matthew Williams, and his wife Jennifer. He's Emma's son, the woman Karen came here to see.  I met them when they came to register. It's standard procedure, though the visits were arranged by his employer. He works at --    Karen was a substitute -- Yoko is the girl who is normally in charge of Emma. She's also been missing from work.  For the last two days.  I think I saw her bike outside.  Yoko?  What... What happened, Yoko?  Say something, please..."
    },
    "imdb_rating": "5.9",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjIxODg1Nzc3NF5BMl5BanBnXkFtZTcwMjM0MjEzMw@@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "Karen Davis, an American Nurse, moves to Tokyo and encounters a supernatural spirit who is vengeful and often possesses its victims. A series of horrifying and mysterious deaths start to occur, with the spirit passing its curse onto each victim. Karen must now find a way to break this spell, before she becomes its next victim.—simon",
    "name": "The Grudge",
    "genres": [
        "Horror",
        "Mystery",
        "Thriller"
    ]
}