{
    "filename": "Last-of-the-Mohicans,-The_script.txt",
    "imdb_id": "tt0104691",
    "imdb_url": "https://www.imdb.com/title/tt0104691",
    "characters": [
        "Alexandra Cameron",
        "Chingachgook",
        "Jack Winthrop",
        "Capt. Beams",
        "Uncas",
        "Hawkeye (Nathaniel Poe)",
        "James Cameron",
        "Cora Munro",
        "Col. Edmund Munro",
        "Gen Montcalm",
        "Ongewasgone",
        "John Cameron",
        "Alice Munro",
        "Magua",
        "Maj. Duncan Heyward"
    ],
    "dialogues": {
        "Alexandra": "",
        "Cameron": "roasts potatoes on a stick in the stone fireplace next to CAPTAIN JACK WINTHROP, an American in very worn quasi-military gear. On a rough table in the tiny cabin ALEXANDRIA, his wife, is kneading bread. Three children climb on their father. He grabs their wild seven year old son, JAMES, who shrieks laughter and dodges away. The cabin has two primitive rooms, waxed paper windows, log walls. O.S. a dog barks. Others pick it up. Cameron &amp; Jack are suddenly alert, reaching for weapons ...    appears warily, musket in hand.   Alexandria! Set three more places.  How is Chingachgook, then?  Behind him, emerging from the dark trees are Hawkeye, Uncas, cradling flint locks, blankets and packs over their shoulders, leading a mule laden with skins and the elk carcass. Crossing the splitrail fence ...   Gettin' along. Yes, it is.  Nathaniel.    Yes, I did.    tears past his father &amp; runs full bore. Just before he's going to collide into Uncas, he leaps into the air and Uncas snatches him with one hand and swings him up onto his shoulders. The kid screams with delight and rides back towards the cabin that way. Alexandria comes to the door.   It was a good year for corn.   You take much fur?   Dear Father, thank you for rewardin' the fruits of our labor with plenty. Amen.  As they start to eat ...    EXTERIOR CAMERON CABIN - MOHAWK BOY &amp; JAMES CAMERON - MORNING  slam into other kids as they battle through a Lacrosse game. In the background are sixty men, women and children. It's a community gathering held out of doors. We've entered mid-scene. Captain Jack is standing on a box. Some women and kids mill around some tables and boards laid over barrels. Cooking fires. Smoke. Most but not all around Captain Jack are men, nine settlers, 3 hunter/trappers, eight Mohawk farmers in mixed European and native clothing. Off to the side are an English Lieutenant on horseback and a ten-man escort from whatever regiment's in Albany. A man named HENRI speaks in French. His son, MARTIN, translates.   I am stayin' on my farm. And any man who goes, his family is welcome to fort-up with us 'til he comes back.    Burned, smoldering, having fallen in on itself. TRACK LEFT past what was the doorway. A dead child's hand protruding from the ruin. A fragment of a dress. Charred and smoldering wood. John Cameron's body in the wreckage. And then, through the collapsed posts and timbers, Hawkeye, Chingachgook and Uncas have advanced and are seeing what we've just seen; and then Cora and Alice.",
        "Chingachgook": "The French call him \"Le Gros Serpent,\" the Great Snake, because \"he knows the winding ways of men's nature and he can strike a sudden, deathly blow.\"    runs, disturbing no leaves, no branches; making no sound. He's running parallel to Uncas through the cathedral of mature forest. It's heavily canopied. There's very little brush. The girth of the trees is huge. Shafts of light illuminate motes of dust and turn leaves emerald where the sun breaks through. Sometimes there's ferns; rhododendron, sometimes pale grass and outcroppings of rock. These men run the forest streams, over boulders, fallen trees and down into ravines as if they own them. They do.    slips through young trees and stops, shouldering his smoothbore musket. Is this an ambush?    We're sorry to kill you, Brother. Forgive us. I do honor to your courage and speed, your strength ...     Halloo! John Cameron!  Doorway: Cameron towards the interior ...   The Master of Life is good. Another year pass ... How is it with you, John?    lights &amp; smokes a clay pipe. The scene says: this is a rustic, frontier home and these people have known each other &amp; live in dangerous circumstances.   Your eyes are too sharp, Alexandria Cameron. They see into my heart.   Fathers of England &amp; France, both, take more land, furs, than they need. They're cold &amp; full of greed ...    - in a stream - relaxed but attentive, abruptly stops. The others freeze in their tracks. Chingachgook sees and then stoops to examine ...    has headed off further down the stream and discovers nothing. Rapidly he rejoins Uncas and Hawkeye who've become extremely alert. They move up the bank into the forest ninety degrees from their previous path.  TRACKING: HAWKEYE, UNCAS &amp; CHINGACHGOOK  moving. Fast. Nearly soundless. They hardly disturb a blade of grass. The impression: expertise, deadliness and an impression something's wrong.    pursues two fleeing Hurons up the incline. Two strides gain him the first man, who he hamstrings and runs over to pursue the second up the hill ... as ...    flashes up the hill. It cleaves the second man's back and bowls him over. Chingachgook retrieves his club as his scalping knife slashes down ...    to Hawkeye: let's go ... Then a fast exchange of Delaware. Cora's surprised to see it's Chingachgook's decision. Chingachgook looks at the survivors, gives his assent, starts off.    Yengeese no good in woods. Make more noise, I kill him.  Heyward spins. Hawkeye coolly watches Cora. Her attitude is hostile; aligned with Heyward. He turns away. Meanwhile ...    is already moving out front, low and fast ...    Ottawa.   Leave them.  Heyward stops. Hawkeye and Uncas follow Chingachgook, leaving the cabin.    mutters something to Uncas. He nods and disappears amongst the white birch, soundlessly.    His massive arms spread revealing his war club in his left fist; his fusil in his right hand.    tensely monitor the Ottawa retreat.  UNCAS &amp; ALICE  He slowly removes his hand from her mouth. She's a little shy, then she looks up, catches his eyes. Then she averts her face.    sees all of it; doesn't like it.    run diagonally past pyramidal stacks of cannon ball, smoldering beams and shrapnel, wounded men. Just then a mortar is fired and explodes, killing the gun crew. On the ramparts Mohawks and Colonial Militia, sniping at the French. Women huddle in corners next to the sick and dying.    Why do they make my son prisoner?    What will they do with my white son?  One of the guards - scared to death by Chingachgook - nervously fingers his musket.    protecting Hawkeye, slams his war club into one Huron, breaking his attack, his arm and his skull and swings the other way burying the bladed end into the chest of an Ottawa who's behind him. Then ...    smashing his war club straight down on a Huron, reaches for the man's musket and shoots another. Then he sees ...   THE RANGER &amp; THE MOHAWK  back into the water. They're pursued by Ottawa and Hurons as they fight their way to the canoes.    followed by Uncas, takes stock of their supplies. They check their powder. They have almost none. Uncas shares his with Hawkeye. The Redcoat's cartridge case is soaked, the paper cartridges a soggy mess. Heyward has none. The Ranger has two left. In Mohican, Chingachgook decides some things. Hawkeye and Uncas nod. Heyward approaches Hawkeye.    has their weapons slung over his back. He says something in Mohican. Uncas spins looks at Alice: her expression's vacant.    rocketing at us, battering and drowning us. We glimpse something downstream ...    tries to focus, slammed against rocks, he's striking out towards the right, swimming against the current. He's grabbing for something.    out on the flank. Running hard.    running. Then Uncas drops and the other two follow.    holding Killdeer.    Sky &amp; flames. Suddenly, Heyward's stood upright into the fire, bound to a bracket by his arms. As the flames start devouring him ...  HAWKEYE &amp; CORA  close to Chingachgook and the tree line ...    tosses Hawkeye Killdeer. As fast as he jams it into his shoulder he FIRES.    freezes.    seeing his boy killed, CRIES out and is charging up the path, Hawkeye following.    Huron warriors are an irrelevance. He slams one aside with his musket.    isn't there. He rolled and, on one knee with his back to Magua, his arm slams rearward. The massive war club crashes into Magua's back.    now up and towering - slams his club right into Magua's assault ... destroying it,  breaking Magua's right arm. And ...    ... with his momentum, spins like a shot-putter and the next blow cripples Magua's left side and crushes part of his chest.     speaks to the sky.    Great Spirit and the Maker of all Life ...  ON HAWKEYE &amp; CHINGACHGOOK  We HEAR Hawkeye's English translation in VOICE OVER:    The frontier moves with the sun and pushes the red man of the wilderness forests in front of it. Until one day there will be nowhere left. Then our race will be no more, or be not us ... The frontier place is for people like my white son and his woman and their children.   No. It is true ... One day ... there will be no more frontier. Then men like you will go, too. Like the Mohicans.  And new people will come. Work. Struggle to make their light ... One mystery remains.   Will there be anything left to show the world that we ever did exist?",
        "Jack": "Tradin' your skins in Castleton?   A French &amp; Indian army out of Fort Carillon's heading south to war against the English. I'm here to raise this county's militia to aid the British defense.   We'll see in the morning ...   Few'd deny that? Where you headin'?   Boys. My sense of it is enough of us will join-up to fill the county's levy. But only if General Webb accepts a few terms I got in mind ...  HAWKEYE &amp; UNCAS  cross through the people. A few men drift off to their women at the tables. It is apparent two-thirds of the men will join. A couple of jokes, light banter, no hostility.    ... if they are not allowed leave to defend their families if the French or Hurons attack the settlements, no colonial militia is goin' to Fort William Henry.   Does that mean they will be granted leave to defend their homes if the settlements are attacked?   You got yourself a colonial militia, General.    Get together by the West Battery James &amp; Ian, Sharitarish &amp; William.  Hawkeye uses the fine cotton he took from Cora. Uncas sees it.   Chingachgook's of the same opinion. Taken together, that's gospel. Your fort will stand or fall depending on Webb and reinforcements, not these colonials' presence.   We are not forgettin' Webb's promise!   Nathaniel's word been good on the frontier a long time before you got here!    Does the rule of English law no longer govern? Has it been replaced by absolutism?  This is very dangerous talk.    I believe if they set aside their law as and when they wish, their law no longer has rightful authority over us. All they have over us is tyranny, then. And I'll stay here no longer. No force on earth will keep me here ... Anyone caught leavin' the fort could be shot. So each man make your own decision ... Those who are goin', be back here in an hour.    You're not coming with us?  Hawkeye shakes his head.   That reason wear a blue dress and work in the surgery?  Low laughter",
        "Winthrop": "",
        "Capt.": "",
        "Beams": "Captain Jeffrey Beams. We didn't think you'd make it through!    The drums are from Munro's honor guard. They stop.",
        "Uncas": "flash as he runs. One carries a flintlock musket. Sweat on the man's skin. A calico shirt is gathered at the waist with a wampum belt of small white beads over a breechcloth. He wears leggings to protect his legs. A long-handled tomahawk is stuffed in his belt.    stops dead, holding out his hand ... no sound.   Your farm good to you this year, John?   Mohawk field we saw was 5 mile long on the river. Chief Joseph Brandt's field.   No, Schylerville. With the Dutch for silver. French &amp; English want to buy with wampum &amp; brandy.  Pause, then ...   So I can find a woman and make Mohican children so our father will leave my brother &amp; me in peace.  Alexandria laughs. So do Hawkeye &amp; Chingachgook.   No. You are too strong. Turn me old too fast!  Hawkeye grabs the kid from Uncas. The kid's laughing &amp; can't stay still. Chingachgook watches, content, smoking his clay pipe.   We had our say, Ian.  They approach the Lacrosse field. Chingachgook stands with Cameron in the background, watching.    scalps the man he killed. Chingachgook dispatches the Huron he hamstrung.    just cut the throat of the second Narraganset. It drops into the brush. Alice attacks him.    ... too easy to track ... they can be heard for miles ... find yourself a musket ...  Cora's surprised by Uncas' easy English. Hawkeye's scanning the forest.    stops, alarmed. Something in the air bothers him. Hawkeye smells it, too.    returns from under one part of the wreckage, ashen, stoic, as they all are. We know the degree of their inner pain.   All dead ...    enters, very careful where he places his feet ... Hawkeye gestures to Heyward to stay where he is: on the periphery with the women.   Mirrors ... tools ... clothes ... all inside.    moving fast. He gestures back the way he came and it means they're in jeopardy. Uncas disappears around the mound.    tensely monitor the Ottawa retreat.  UNCAS &amp; ALICE  He slowly removes his hand from her mouth. She's a little shy, then she looks up, catches his eyes. Then she averts her face.    looks over his shoulder, sees something in the far distance, gestures to Hawkeye and Chingachgook.    looks over his shoulder.    Didn't!   Some food.   You told him about the raid?   Tight weave.    sees a flash of something yellow. So does Hawkeye. They charge into the swirling chaos of attacking bodies. As we lose sight of them ...   THE RANGER &amp; THE MOHAWK  back into the water. They're pursued by Ottawa and Hurons as they fight their way to the canoes.    leaps off the stern of Hawkeye's canoe and climbs up the stern of Heyward's and takes control. He roughly gestures to the Redcoat and the Major to stop paddling. He and Hawkeye will pilot the two canoes.    Same thing. When they crested the wave Uncas hollers at them to \"pull\" and they do. As soon as they're through it, Uncas slams the paddle in the water and makes the canoe revolve a hundred and eighty degrees in a vortex so that now it's going through stern-first or the stern becomes the bow, so that Uncas could pilot it a different way through a hazard of ...    lurches sideways, grabs a tree root. He is the only link of the canoe to earth. The bow, with Heyward, is literally hanging over the edge. Uncas strains and pulls the canoe to the rock. He gestures to Heyward.    immediately starts up the right acclivity to one fissure, and Chingachgook moves carefully to the first fissure. Hawkeye follows.    against one wall, has his ear cocked, monitoring, facing away from the sky ...    yanks her down next to him. He pulls her head into his chest, looking out over the edge, his tomahawk in front of him, his musket near his right hand. There is no sign she was seen.  UNCAS &amp; ALICE  He relaxes, looks at her and puts his finger to his lips telling her to be silent. Languorously, she lies back, closes her eyes and lays a hand on his shoulder, palm up, as if he were a prince in a romantic fantasy. Uncas tries to restrain her.    his hand buried in her hair irradiated by the moon, then she seems to reach some emotional climax and begins to cry softly, and Uncas stops making love to her and holds her. Then she's flooded with shame. He reaches for her. She jerks away. He reaches for her again and clutches her to him. And she breaks down. Then he turns her face to him, but her expression has completely flattened.    Listens. Hears. Then he inches above cover to see ...  UNCAS' POV: THE RIVER &amp; SIX WAR CANOES  of Hurons approach to assault the island carrying torches.    runs. Then sees something.    half-way up the rock face. He's approaching an overhang. He climbs with a reckless desperation ...  EXTERIOR STREAM - HAWKEYE &amp; CHINGACHGOOK  pound across the  to the meadow towards Magua's path ...    reaches the overhang. It juts away from the face six feet.    ... a rock flake. An indentation. Anything ... His fingers find a diagonal crevice and ...    swings out, now hanging by the vertical face above the overhang. His features are distorted with determination. Nothing will stop him. His right hand grabs another rock. His arms snap him up. Then push. He's on the ledge. Moving fast ...    slams him off the rock with the butt of his musket.    three tomahawk swings are dodged by Magua whose own knife streaks like silver flashes. Uncas, gashed on arms and chest, feints right and slams Magua with an open hand, closes and the men are intertwined steel and muscle ... and Magua throws Uncas. Going with him and rolling off Uncas, Magua's knife flashes into his armpit. Uncas' right arm is useless. He scrambles up. Next to the expertise of a mature warrior like Magua, Uncas' raw, young determination may not be enough.    closing, swings. Magua moves inside, stabs Uncas twice, turns him to face the edge, ripping his head left to expose the right underside of his throat.    And he spins and swings. The blade side of the war club punches into Magua's chest, caving him in two.",
        "James": "tears past his father &amp; runs full bore. Just before he's going to collide into Uncas, he leaps into the air and Uncas snatches him with one hand and swings him up onto his shoulders. The kid screams with delight and rides back towards the cabin that way. Alexandria comes to the door.   A son like me?  Uncas grabs James &amp; suspends him upside down.",
        "Cora": "Heyward! Duncan Heyward.  Heyward looks to the side. An inner light turns on. In this mode, this is a man we could like.    enters from the garden. She's vivacious, dark-haired, unconventional in that she's educated, but with conventional values and attitudes. She hugs Duncan to her and then pushes him away to look at him.   I'm embarrassed to be so indecisive ... after so long apart and after you've traveled so far ...   You still have an aversion to the water?    Dear Duncan, my affection is as towards a closest friend. Alice and I depend on you and respect you immensely ... I wish they did, but my feelings don't go beyond that. Do you see?   Some say that's the way of it.   Cousin Eugenie, my father, but ...    Yes. Yes, I will.  She's still unsettled.   My God, Alice.    of trees is dark, except for spots where leaves are sparse, and there the light is golden. It's the forest of childhood.  In a ravine a buck disappears into a deeper stand of trees.    Alice, did you see that ...?    reverie's broken by Heyward entering the frame.   Alice?  Alice rouses from fatigue.    bucking.    covers Alice with her body, holding the reins of their bolting horses.    who's unaware she's a target. Why is he singling out a Munro girl to kill?    glances back at Hawkeye. She doesn't know why he's looking at her.   No, Duncan!  Duncan ignores her.    appalled.    Though they are strangers, they are at least entitled to a Christian burial!   I will not. I have seen the face of war before, Mr. Poe, but never war made on women and children. And almost as cruel is your indifference.  Hawkeye turns back and rapidly approaches her. She takes a step back, fearful.    realizes Hawkeye knew these people and is deeply affected. She also realizes for the first time this is a whole new world with dynamics and complexities, behavior and rhythms she doesn't understand. He turns away from her and walks on. She hesitates a moment.   Why didn't you bury those people?   You knew them.  Hawkeye looks at her and nods.    You were acting for our benefit. And I apologize. I misunderstood you.   Your \"father\"?   He did?   What?!    tensely monitor the Ottawa retreat.  UNCAS &amp; ALICE  He slowly removes his hand from her mouth. She's a little shy, then she looks up, catches his eyes. Then she averts her face.    Why did they turn back?  In answer Hawkeye looks behind &amp; above her head.    turns and makes out stilt platforms of skeletons and torn strips of buckskin silhouetted against the night sky in the distance. They have camped on sanctified ground, a burial place.  CORA &amp; HAWKEYE  She thinks it would be a mistake to ever underestimate the skill of these men or the danger &amp; complexity of this place. She hands the pistol back to him. Their hands almost touch.    \"We're a breed apart and we make no sense\" ...?    Thank you so much.  Cora is angry. Hawkeye, staring at the trees, glances at her. She settles, looking at him. Her mood changes. Then ...   You called Chingachgook your \"father\"? Where is your real family?  Hawkeye's surprised by her question.   I'm sorry.   How did you learn English?   And what were the consequentialities of European culture you didn't bother with?   In London those radical ideas could land you in Newgate prison.  Why were those people living in this defenseless place ...?    pensive. Hawkeye's watching her. Her reaction is enigmatic. After a pause ...    You are right, Mr. Poe. We do not understand what is happening here. And it is not as I imagined it would be, thinking of it in Boston and London ...    On the contrary. It is more deeply stirring ... to my blood ...  ... than any imagining could possibly have been ...  She closes her eyes, turns slightly and prepares to sleep. Hawkeye is the one left staring into the birch forest, a little surprised. Some of his assumptions about her were wrong ...   Much further?   Thunder ... Papa will arrange something.   Alice!  Heyward laughs. Hawkeye sees them. It bothers us: will these Europeans, including Cora, shed their frontier experience?   And you, Duncan? What are you looking forward to?   I think it's very important and exciting.  Heyward looks at her. She's not kidding.   Lightning?  Hawkeye doesn't answer as he, Chingachgook, Uncas and Heyward make their way to the top of the ridge.  CLOSER ANGLES: CORA &amp; ALICE  join them and look down upon their expectation of a secure piece of England in the wilderness, a safe harbor, a father's warm welcome.   When? How?   There was none!   There was no letter.   He delivered no such message.  Munro's stunned.    Fine, Mr. Phelps. Have you cat gut and a suturing needle?  And we could use some rum, clothes, and a place to wash ...  Cora tries to remove Alice from her father, but she clings to him. Munro holds her tighter. Then he whispers something to her. She nods her head. And Cora takes her. They exit.    Mr Poe?   What are you looking at, Mr. Poe?   Alice ...   Her nerves are shattered. She's trying to be brave.  There's a lot going on under Cora's surface. We don't know what it is, but it's disconcerting.   Duncan ...  Duncan, I promised you an answer. You have complimented me with your persistence and patience ... But the decision I've come to is I'd rather make the gravest of mistakes than surrender my own judgment.  Heyward is stunned.   And it's been unfair to you, while I search myself for feelings, which, if they were there and as strong as they ought to be, would've made themselves known long ago ...  Take my admiration and friendship, Duncan. And please take this as my final answer. It must be no.  Heyward' shattered inside.   I am sorry, Duncan ...  Heyward nods. He's speechless. He's errect as he leaves the room.    The tension rushes out of her and she shudders and leans against the quarter-timbered walls for support. Then she collects the linen and starts out.    moving through the corridor past wounded. Two French mortar bombs explode above one of the casements. We hear shrill screams in the distance and ...    Hawkeye, Captain Jack Winthrop, Ian, seven or eight other militia spokesmen, Munro, Heyward, two adjutants, one lieutenant of Rangers.    beyond the periphery of men, staring at him.    examines him with a cool, level stare.    saddened. Heyward's stature has fallen irrevocably in her eyes.    in the shadows, leaning against the wall, searching ... we sense she's been looking for him. He comes up to her. She turns in surprise.    To her everything about him seems to be somehow right. She's discovered that the passions and outrage that move him, move her ... And her readiness to give herself to what stirs the deepest resonances of her soul is the same as his.     He saved us! We are alive only because of him ...   He knew the consequences. And he stayed. Are those the actions of a criminal? ... Duncan, do something.   You know he wouldn't send me ...! You misrepresented what you saw and caused this.  I, too, was at that farm. It was as he said ...   They do not live their lives \"by your leave.\" ... They hack it out of the wilderness with their own two hands, burying their dead and their children along the way.   Duncan, you are a man with a few admirable qualities. But taken as a whole, I was wrong to have thought so highly of you.  Heyward's shot through the heart.   \"Justice\"? If that's \"justice\" ..., then the sooner French guns blow the English army out of America, the better it will be for these people.    Yes I do! I know exactly what I am saying. And if it is sedition, then I am guilty of sedition, too!  She exits, leaving them there.    They are silent for a moment, then ...   They're going to hang you.  Why didn't you leave when you had the chance?   What would you have me do?  He touches her hand.   No. I will find you.   The whole world's on fire, isn't it?  A pause.   What is it?    on the back of a mare. Alice, living through a wide-awake nightmare, is huddled under the arm of her sister. They ride behind the standard bearers. In the B.G. her father is seen approaching and takes his position at their side. Cora looks down the column, sheilding her eyes against the sun. We know who she's looking for ... Hawkeye.    The 62nd and 42nd Highlanders including Heyward ... thirty to forty women and a number of children - for safety - in the middle, some frontiersmen, Ongewasgone and many Mohawk, walking wounded. The column is still snaking its way out of the fort. No Hawkeye.    straining to see.    riding near the front where there are no more French soldiers. Only a few scattered and curious Huron and Ottawa. She does not see him.  PROFILE OF COLUMN - HIGH &amp; WIDE  as it passes left to right below like a long snake through the narrow valley. We're shooting from inside the dark woods. Lower, in the light, we see a scattering on both slopes of a couple of hundred Ottawa and Huron. They are in no order, are spread out and don't constitute a threat. They watch the column. SLOWLY THE CAMERA ... slides across the shoulders and back of a large man wearing black plumes in his scalp-lock and other than a breechcloth is almost naked. He is heavily war-painted ...    doesn't see him, but something else has caught her eye.    horrified, holds Alice tighter.    shoots him in the face.   THE RANGER &amp; THE MOHAWK  back into the water. They're pursued by Ottawa and Hurons as they fight their way to the canoes.    held up by Hawkeye, suddenly screams.   No!   Stop it!!  Heyward comes to his senses. His head is gashed. A scarf, as a tourniquet, is tied around his leg. He lowers the gun.    is soaked to the bones. Hawkeye strips off his buckskin hunting shirt and wrings it out. Cora turns her back, strips off her white blouse and puts on the faster-drying chamois.   Are we safe?   Our father? Did you see my father?   Tell me!    says into Hawkeye's ear, after she looks O.S. ...   Say nothing to Alice ...!  Hawkeye nods.    crosses to the Ranger who's semi-conscious, feverish and getting delirious. She can't do a thing except hold his hand and think of her father.    with the Ranger, looks up. Hawkeye enters. The look on his face. Then hers. They've been discovered. Now they're backed into a hole in the ground with no powder and no way out.   Yes. Go ahead.   Yes. I want you to go.   You try. With all you have. To save yourself. If the worst happens, and only one of us survives, something of the other does, too ...    turns aside. Hawkeye insists.     ... never doubt what you are doing.    supporting Alice, is dragged forward by a Huron warrior by a woven rawhide thong tied to her neck.    sees him enter, doesn't believe he's there.   Nathaniel!  Hawkeye glances at her, doesn't respond. The situation is a stick of dynamite ready to go off.   looks to Alice, then to Hawkeye.    What are they doing to Duncan? Duncan!  He's gone. They start to ease away from the mass of Hurons.   Alice?  Hawkeye's concentration is on backing out of the Huron mob. Will the Sachem's judgment be honored? Will some warriors hack down Hawkeye &amp; Cora? As they go ...    moves towards her sister. But Hawkeye holds her tightly as they retreat.    with Magua's group crosses the path. He drags Alice behind him like baggage. She regains her feet. Magua is oblivious to her. He's heading towards the plateau.    are on Alice, off to the right in the meadow.    trying to stay with them, scrambles up ...    collapses to her knees on the ground and her face falls forward into her hands ...    alone, kneeling in the meadow. Her eyes downcast ...    is standing, her back to us, in front of a rock-covered grave with a wooden cross. Next to it is Uncas' burial platform. Cora [says a] silent prayer. Then she pauses, crosses herself. Her emotions are spent. She moves next to Hawkeye. He takes her hand.  HAWKEYE &amp; CORA]   I have nothing to go back for.  Long pause.   Yes.  They hold each other's eyes. She searches his face.   Where will we go?",
        "Munro": "enters from the garden. She's vivacious, dark-haired, unconventional in that she's educated, but with conventional values and attitudes. She hugs Duncan to her and then pushes him away to look at him.    eighteen years old, white-blonde hair, wide blue eyes. She's effervescent and runs to hug him. Heyward is taken aback by her enthusiasm and laughs.    who's unaware she's a target. Why is he singling out a Munro girl to kill?    running from his quarters is shocked to see them.    Why are you here?!  Cora is stunned. Alice is decimated by her father's anger. Munro sees and whips off his coat to cover them and takes Alice under his arm. Bombardment resumes. Alice clings while they race for the cover of his quarters:]    Why did you allow them to come? ... And where the bloody hell are my reinforcements!!  They race into the yellow lantern light of Munro's quarters and slam and bolt the heavy door. Heyward's confused ...      Told you to stay away from this hell hole! Why did you disobey me?   My letter ...   What?   I sent three men to Webb!   Does Webb not even know we are besieged?    What happened to you?   Thank you. How can I reward you?  No answer. Then ...   What else?    I'm indebted to you. And get your side sewn up, young man.    sees his exhausted and bloodstained surgeon in the doorway that leads to the next rooms.    Mr. Phelps!  PHELPS' face lights up when he sees Cora Munro.    is moved beyond words by his daughters' presence. There's a break, a pause ...    What a place for them ...      Logistics are his guns are bigger than mine and he has more of them. They keep our heads down while his sappers make thirty yards of trench a day. His thirteen inch mortars have a two hundred yard range, so when they're close enough, they'll move them in, lob explosive rounds over our walls and pound us to dust.   Bloody murderers.   ... not enough time to get to Albany and back with reinforcements ...  A Sergeant enters, snaps to attention, says something to Beams, exits.   Webb's at Edward?   Only twelve miles away! He could be here day after tomorrow.  Find your man, sir! Captain Beams will give you the message.  Beams nods. Munro turns back to the map. Hawkeye has something else to say.   Yes, Mr. Poe? So?    Thank you.  Hawkeye's dismissed, frozen out.   That's all, sir.  Hawkeye is furious. Chingachgook gestures Hawkeye out. He leaves Munro's quarters almost knocking over an entering Adjutant who backs way up to let Chingachgook pass.   Terrible feature of war in the Americas.  Best to keep your sight fixed on our duty. Our duty is to defeat France. That hangs on a courier to Webb.    a knock and Heyward enters.  CORA &amp; ALICE  Alice is in her father's bed. Cora is collecting and tearing linen into strips for bandaging.    I must receive proof more conclusive than Mr. Poe's opinion before I weaken our defenses by allowing militia to withdraw.   I judge military matters, Captain Winthrop, not you.   (looking to Heyward for confirmation of his point of view) What did you see, Major?  Heyward looks around the room. And he catches the doorway ...    I'll have none of that!  Montcalm is a soldier and a gentleman. Not a butcher.    You forget yourself!   British promises are honored. And the militia will not be released. Because I need more definite proof than this man's word!   This interview's over! The militia stays!    Anyone fomenting or advocating leaving Fort William Henry will be hung for sedition. Anyone leaving will be shot for desertion.   My decision is final. Get out.  Hawkeye and the others are not intimidated. Their rage smolders. The look on Hawkeye's face says this is not over.     The man encouraged the colonials to desert in this very room, in my presence. He is guilty of sedition and must be tried and hanged like any other criminal, regardless of what he did for my children.   Not with enough certainty to outweigh British interests in this fort.   But the man is guilty of sedition and subject to military justice and beyond pardon.   You do not know what you are saying!    The drums are from Munro's honor guard. They stop.   And I to make yours, Monsieur le Marquis.   Monsieur le Marquis, I am a soldier, not a diplomat. You called this parlay for a reason.   However I may apprise such testimony from Monsieur Montcalm, Fort William Henry is strong and stands.   Perhaps the General's glasses can reach to the Hudson and he knows the size and imminence of the army of Webb ...?  Montcalm takes a moment to reply and appears genuinely sympathetic to Munro.     You have heard your answer, Monsieur le Marquis.   Munro starts off. Montcalm stops him.   Such as ...?   Their arms?   The honors of war?   My colors?   Allow me to consult with my officers.  As he turns away something's been disconnected inside Munro that can never get put back together. As the men move away from the French ...   I have lived to see two things I never expected. An Englishman afraid to support a friend. And a Frenchman too honest to profit by that advantage.    Death and honor are sometimes thought to be the same. Today I have learned that they are not.  Munro looks at the fortress behind him.    The decision is final.  A beat. Then Munro turns toward Montcalm. Their eyes meet across the churned, scarred earth of the battlefield.   I am deeply touched by such unusual and unexpected generosity ... The fort is yours under the condition that we be given until dawn to bury our dead, prepare our men and women for their march and turn our wounded over to your surgeon.    at the end of the column, rides out on his horse. Both sides of the gate are jammed with armed French troops standing at attention. The French colors and honor guard are just outside the gate along with Bougainville, Chevalier de Levis, both on horseback as is - at the head - Montcalm.    trots past his walking column out the gate. He does not look at the French.    salutes Montcalm.    Monsieur, the fort is yours.    has seen it too. And now he sees ...   Steady! No one fires!    gallops his horse away from Cora and Alice towards the scene of the last attack. We hear him from the distance ordering ...   Do not break ranks! I want these ranks to hold ...!  Cora's frightened.    hollering   Cora! Alice!  He cuts down a Huron with his sword who is trying to leap at him from the right. An Osage warrior with red scalp-lock leaps on the back of Munro's horse, reaching over to stab down into Munro's neck. The old man's left hand grabs the warrior's knife hand in an iron grip. His right hand pulls his horse pistol and under his upraised arm fires backward, point blank, blowing the Osage off the back of his horse.    his lower body is trapped under his dead horse. Magua leans in towards him.    frozen in agony by shock.    back through the swirling smoke. There seems to be a lull. Then they're hit from the side by musket fire. One of the Rangers is shot, the other wounded. Hurons attack. The Mohawk supports the wounded Ranger.",
        "Gen": "",
        "Montcalm": "of three Seneca women and five boys, led by a Jesuit, sing the Te Deum in the Iroquois language. This is a large tent that could sleep twenty. Montcalm's four personal guards are at the entrance as well as COMTE DE LEVIS in dirty lace, a facial wound and a braceful of pistols on a sash. Inside is simple campaign furniture and a six by eight foot battle standard and flag of France.    stands with a huge and fearsome elaborately tattooed and robed Seneca chief in a silk turban ...    For my children and the children of the true faith, my friendship and esteem is boundless ... I will give you three oxen for a feast and tomorrow I, myself, will sing the war song with you in the great council house.  The Seneca Chief is satisfied and his people, plus the Jesuit, exit. The look on Magua's face and the wry expression on Montcalm's allows us to understand their relationship is based on realpolitik.   Le Renard Subtil, how are things with your English friends?  Magua exhales in derision as he brings a chair to face Montcalm and sits, European style ...    Louis Antoine, join us.  LOUIS ANTOINE DE BOUGAINVILLE enters. He wears a functional melange of Indian moccasins over white linen breeches and an officer's waistcoat.   Hear what le Subtil has to tell us ...  Bougainville published a book on integral calculus at twenty-five, at twenty-six was a secretary to the French Ambassador in London, in January 1756 at twenty-seven he was elected a member of the British Royal Academy of Science and at age twenty-eight he's aide de camp to the Marquis de Montcalm with the rank of captain. Later in life, he brought \"bougainvillea\" from Tahiti to Europe to America.   Why do hate the Grey Hair, Magua?   My sappeurs are advancing the trenches through the night, now. You may have your opportunity soon.   Colonel Munro, I have known you as a gallant antagonist. I am happy to make your acquaintance as a friend.   Please accept my compliments for the strong and skillful defense of your fortress. Under the command of a lesser man it would have fallen long ago given the superior numbers and material ... mere chance has allowed me to array against you ...   You have already done everything which is necessary for the honor of your Prince. I will forever bear testimony that your resistance has been gallant and was continued as long as there was hope. But now, I beg you to listen to the admonitions of humanity. I beg you to consider my terms for your surrender.   Honor that is freely accorded to courage, may be refused obstinacy ... These hills afford to us every opportunity to reconnoiter your works and I am possibly as well acquainted with your weak condition as you are yourselves.  Is Webb really en route and Montcalm hopes to take the fort by duplicity before British reinforcements arrive?    My scouts intercepted this dispatch intended for you.  Munro is puzzled, suspicious.    Read the dispatch.  HEYWARD &amp; MUNRO]   Sir.  I am incapable of mistreating brave men. I beg you not to sign the death warrant of so many until you have listened to my terms.  Munro turns.   My master requires the fort be destroyed. But, for you and your comrades, there is no privilege that will be denied. None of your men will see the inside of a prison barge. They're free to go so long as they return to England and fight no more on this continent, and the civilian militia return to their farms.   They may leave the fortress fully armed, but with no ammunition ... Other than that, ask what you wish.  Munro's impressed with Montcalm's generosity.   Granted.   Carry them to England to your King with pride.   Granted, Monsieur.  And Montcalm bows deeply and as he does so ...   France.   La victoire.   Il est necessaire d'etre vigilant, mon enfant.  The cloak parts. By the light of the moon the man's face is dimly perceived by us and the soldier as General Montcalm. The soldier snaps erect as Montcalm continues walking out beyond the line to a small stand of trees.    The moon is broken into pieces of light on the water and behind Montcalm; from the front of the stand of trees emerges a tall figure.   Yes.   My master owns these lands and your father has been ordered to drive off the English squatters. They have consented to go. So now he calls them enemies no longer.   But so many suns have set since Le Renard struck the war post. Is he not tired?   That Le Renard has the power to lead his people into the light, I know well.  Magua grabs the hand of the French commander. Imperceptible surprise in Montcalm's eyes. Magua jams Montcalm's fingers to his chest.   That's where a lead bullet has torn you.   My son has been sadly injured. Who did this?   My son Magua's pain is my pain.   Munro would. But General Webb will not send their soldiers across the salt lake. Having let them go, I fear I will only fight the same men again when I move south.  And yet, I cannot break the terms of the capitulation and sully the lilies of France ...  Long pause, wheels turn. Then:   As the English march away, our soldiers and the Canadiens will be drawn to the looting of the fort ... except for a small guard ...  Magua abruptly leaves Montcalm.    salutes Munro and bows gravely from the saddle.",
        "Ongewasgone": "is an unusually large Mohawk in a blue match coat with a little girl holding his hand. He says something to Chingachgook who nods. Hawkeye and Uncas are a little apart in an outer grouping of the men. Ongewasgone is a war chief and wears a white plume and is tattooed. As Martin finishes, he steps forward.   John Cameron, thank you for your hospitality ... Twin River Mohawk got no quarrel with Les Francais. Trade furs with Les Francais. Now Les Francais bring Huron onto Mohawk hunting grounds ...  These people are English, Scots-Irish and Dutch farmers; some French Huguenot \"mechanics\" . They're in shirt-sleeves and Indian moccasins &amp; leggings. The Mohawks' vast lands and corn agriculture border the settlement. They 've been acculturated for over a hundred years. Some wear European calico hunting shirts. Their heads are shaved to scalping locks and many are tattooed. They've politically and commercially played France &amp; England against each other very adroitly for over a hundred years because of their military power and geographic position. Their relations with working farmers and settlers and their families has been mostly one of co-existence because there's always been more than enough for all. This is a WPA  mural of ethnic diversity and plurality of frontier America. The Europeans are former indentured laborers, farmers exiled by economics or religious persecution, frontier hunters and trappers ... working people.    Now Mohawk will fight Huron and Les Francais. My brothers have asked me to lead them in this war so I speak for the Twin River Council.  The importance of this commitment is apparent to the lieutenant.",
        "John": "roasts potatoes on a stick in the stone fireplace next to CAPTAIN JACK WINTHROP, an American in very worn quasi-military gear. On a rough table in the tiny cabin ALEXANDRIA, his wife, is kneading bread. Three children climb on their father. He grabs their wild seven year old son, JAMES, who shrieks laughter and dodges away. The cabin has two primitive rooms, waxed paper windows, log walls. O.S. a dog barks. Others pick it up. Cameron &amp; Jack are suddenly alert, reaching for weapons ...",
        "Alice": "Duncan!    eighteen years old, white-blonde hair, wide blue eyes. She's effervescent and runs to hug him. Heyward is taken aback by her enthusiasm and laughs.   We leave in the morning?!   I won't sleep tonight. What an adventure! I absolutely cannot wait to return to Portman Square, having laid eyes upon the full-blooded, red men in the wild!   Nonsense. Papa wouldn't have sent for us if it were dangerous.  Alice takes Hewyward's hand. Cora pours Heyward more tea. The white sheets billow.   Can we rest soon?    shrieks. Cora grabs Alice's reins and her own.    bolting, dodging sideways, spilling Alice to the earth.    on the ground, screaming insanely, covered by Cora who's protecting her little sister, and ...    Cora, holding her, is stunned but functioning. Moments ago both women were clean and demure. Now their riding dresses are torn, mud-stained, blood-spattered and their baggage is gone.    Stop it!  Heyward spins.   We need them to get out of here!  Uncas gently restrains her. Cora reaches Alice and grabs her away from the \"savage\". Heyward runs in to protect the women ...    approaches and is frozen in horror. Cora shields her from the sight. Cora is affected but confronts it directly.    hits the blanket. She curls into a fetal position and she's out. Heyward is nearby on watch. Hawkeye has taken a position two-thirds of the way around the crescent shaped mound. Cora has sought him out.    seeing the red-painted Ottawa approach, starts to panic. Her hyperventilating and involuntary small sounds of fear will reveal their position. A hand covers her mouth and silences her struggling. WIDEN. It's Uncas. His other arm is around her, holding her, looking towards the advancing Ottawa.    Re-energized, her spirits pick up.   Will we be able to bathe?  Before Cora can answer they hear a deep, rolling roar. Alice is alarmed.   Duncan, you are absolutely gallant. If Cora doesn't marry you, I shall.   I can't wait to see Papa ...    Papa, Papa!!   Talk to Duncan, Cora ... I must manage ... I cannot be an invalid schoolgirl. (starts for door I'll see if Mr. Phelps needs anything ...  She leaves.    on the back of a mare. Alice, living through a wide-awake nightmare, is huddled under the arm of her sister. They ride behind the standard bearers. In the B.G. her father is seen approaching and takes his position at their side. Cora looks down the column, sheilding her eyes against the sun. We know who she's looking for ... Hawkeye.    and her eyes take it all in. And her affect starts to flatten. A blankness suffuses her expression and the girl withdraws from this reality into a deep dark cave inside her head.    on her hands and knees. A massive Ottawa pulls her upright by her hair about to take her life and her scalp. He's struck by a rock in the hands of Cora which barely phases him. He bats her aside and returns to Alice, when suddenly ...   THE RANGER &amp; THE MOHAWK  back into the water. They're pursued by Ottawa and Hurons as they fight their way to the canoes.    stands in the chamber not far from the wall of water, fascinated with its shimmer. She's oblivious to all the events and everything going on around her ...    sensing new danger, slips away on her own.    looks at the sky through the fissure. She sees the starfields and feels silver moonlight pull her forward. She starts out onto the island, oblivious, unaware she'll expose them. Suddenly ...    eyes slowly open. Oblivion disappears. It's replaced with escalating fear. She holds onto Uncas with desperation. Her fingers claw his shoulders. She buries her face in his chest.   Uncas ...  Her body shudders. Her terror's total. He tries to restrain and calm her. She won't let him. Then her mouth seeks his and in the passion of despair and fear and wanting life, she holds him between her thighs. And Uncas is confused, but Alice whispers his name and he responds. He loves her in the half-light.    with Magua's group crosses the path. He drags Alice behind him like baggage. She regains her feet. Magua is oblivious to her. He's heading towards the plateau.    backs to the edge.    looks down at Uncas, her lover, dead on the rocks below. She turns to Magua with enigmatic calm. Her eyes seem to see into him. She steps off the edge. She falls to her death next to Uncas ...",
        "Magua": "rises and slowly walks into the light. He is reserved and over six feet tall. His head is shaved into a mohawk. Rings, beads &amp; feathers pierce his ears. A blanket is worn as a shawl over his left shoulder exposing his right arm and heavy tattooing. A long tomahawk is in the belt of his breechcloth.    cradling his musket.    I understand. This is not good place to stop. Two leagues from here. No water 'til then. That where we stop. Better place.    \"Magua understand paleface is a dog to his women. When his women want to eat, he lay aside his tomahawk to feed their laziness.\"   Magua say: \"Yes. Good idea.\"  As they begin to stop ...    on point. The trail cuts the side of a hill. The ground on one side rises into a forest acclivity and on the other falls off into a forested ravine. Magua walking towards camera.    slid his tomahawk out from the front of his belt that girdles his waist. He lets the shaft drop into his hand. He shrugs off his blanket. There is a solidity to his dark, tall figure we didn't see before. Magua turns about face and advances on the column. TRACK WITH Magua. Heyward and the Munro girls pass the camera as does Sgt. Major Ambrose, marching in advance of the men. Magua is approaching the soldier on the left in the first row. We see Magua has caught the Redcoat's eye.    shoots Ambrose in the chest, and ...    calmly sees the odds have changed. His attention becomes focused. He commits a very revealing act seen through the blurred foreground action of struggling bodies. We will remember it. He raises his musket and aims at ...    senses Hawkeye. Moving through liquid, his eyes drift left. The moment is frozen.    entering with four Huron braves. This is not the Magua we saw on the trail. In his scalp lock, now red-stained and cut to a Huron roach, are three blacl plumes. A match-coat blanket drapes his left shoulder.   English war chief, Webb goes to Fort Edward with 33rd Regiment. He does not know my father's army attacks Fort William Henry.   The Grey Hair will try.   The Grey Hair's children were under Magua's knife but escaped. They'll be under it again.   When the Grey Hair is dead, Magua will eat his heart. Before he dies Magua will put his children under the knife so the Grey Hair will see his seed is wiped out forever.  Montcalm won't get a direct answer.    in full war paint, with a coterie of Huron warriors, silent, waiting. Drums.   Is the hatchet buried between the English and my French father?   Not a warrior has a scalp and the white men become friends.   Magua took the hatchet to color it with blood. It is still bright. Only when it is red, then it will be buried.   Where is that sun?! It has gone behind the hill. It is dark and cold. It has set on his people, they are fooled and kill all the animals and sell all of their lands to enrich the European masters who are always greedy for more than they need.  And Le Subtil is the son of his tribe. There have been many clouds and many mountains. But now he has come to lead his nation.   Does my father know that?    A deep indentation and scar.   And this?  Magua turns his naked back to Montcalm and puts Montcalm's hand on his back ... deep ridges of a scar a half inch wide.]    Magua slept hard in the English wigwams. And the sticks left their mark ...  Magua's village and lodges were burnt. Magua's children were killed by the English. Magua was taken as a slave by the Mohawks who fought for the Grey Hair. Magua's wife believed he was dead and became the wife of another. The Grey Hair was the father of all this.  In time Magua became blood-brother to Mohawk to become free. In his heart he always was Huron. And his heart will be whole again on the day when the Grey Hair and all his seed are dead!   Does the chief of the Canadas believe the English will keep the terms?   Many things my French father cannot do, Magua can.  Montcalm reacts as if he hadn't thought of that.    walking back to the Huron camp. Reveal a Huron sub-chief has been in the woods, waiting for Magua. Now he joins him. They walk in silence. Then ...    I wonder at the blindness and pride of the white man. He believes only he knows how to speak falsely to make other men do his bidding.  Magua exhales in derision.    and the left two-thirds of his face is painted red. The right third is painted black. Much silver is in his ears. His tomahawk is in his left hand. His cut-down musket in his right fist. Magua's attention is all focused to one point.  MAGUA'S LONG &amp; TIGHT POV: MUNRO &amp; CORA &amp; ALICE  at the head of the column. This is the focus of Magua's attention.  WIDE FRONTAL: COLUMN, STANDARD BEARERS &amp; MUNROS  Cora turns again to look for Hawkeye.    His eyes see Munro.  WIDER &amp; LOWER: MAGUA  raises his musket in his fist and emits a war whoop. WE NOW SEE ... hundreds have been stalking the column, hidden in the trees, maybe thousands. Then ...    charging down the hill ... with his coterie of twenty Huron warriors, heading for the area in which he saw Munro.  CORA &amp; ALICE  at the head of the disintegrating column. Cora's holding Alice's head to her bosom, covering her ears as if to protect her from the sounds.    glides through the scenes, striking and hunting. Some of his coterie of braves near him. He sees ...    His eyes drop to what's in front of him. The field goes quiet.    his lower body is trapped under his dead horse. Magua leans in towards him.   Grey Hair. I will cut your heart from your living chest in front of your eyes. As you die, know that I will put under the knife your children and wipe your seed from this earth forever ...  Magua pulls his knife and as he leans down towards Munro ...  MOHAWK &amp; HURON  spin and flail furiously at each other with tomahawks and knives. The Huron goes down and then the Mohawk is shot. The Huron who shot him is cut down by a Ranger with tomahawk in one hand and bayonet in the other. Two Mohawks and three Rangers fighting back to back. They become an island swamped by Huron and Ottawa: amidst bodies and ground slippery with blood. As smoke obscures their image.  CORA &amp; ALICE  in a group of civilian militia. Two of the militiamen are shot down. The third engages a Fox warrior. Cora &amp; Alice run.    reaching down and up into something, emerges and jams an object we barely see into the air. But his arm and shoulder and half his chest are splashed red with blood.    seen from far away, holding aloft the heart of Munro.    beaches a canoe on the bank. He and eight braves ease out. His war paint is fresh: green handprints on his chest and black and green on his face. Black plumes are affixed to his scalp-lock and his shawl is over his left shoulder. The right arm carrying his musket is exposed. Many scalps are tied to his tomahawk. He walks towards us approaching the island, two hundred yards away ...    enters. His blanket, like a shawl, over his left shoulder, black plumes in his hair. He's imperturbable.    reaches out and touches Cora's hair. Cora is frozen to the spot. His hand drops away from the hated Munros and as Magua turns to go, he says something low in Huron and the two women are jerked towards the fissures. Heyward is dragged by the arms.    Gifts?   Wampum?   Does Yengeese Major have property across salt sea?   Yengeese Major give all property to Magua. Magua give Yengeese Major much wampum, many gifts, maybe three, four oxen.  Magua looks at Heyward derisively. Does this white man think he's an idiot?   For Munro children?   How much gold has the master of the Yengeese?   Not enough.  Heyward is first realizing with whom he's playing.   Heart. Give Magua new heart.  Magua totally disdains the Englishman and walks away from him, starting up a steeper forested hill.    is imperturbable.    Many of the Yengeese are dead, great Sachem.  I have brought three of my prisoners, to honor you. Two are the children of Munro. Whose scalp hangs on my lodge pole. And whose heart I cut from his chest.  Now we see Cora on the ground. Defeat &amp; fear are held in place by her determination. Alice looks around, in another place. Heyward's hands are bound between his back with a piece of wood wedged through his elbows.     ... the earth was pale. Our tomahawks were bright. Now they are dull from war. And the Huron rich with the trophies of honor ... Magua will sell the English officer to Les Francais and the reward is my gift to you, wise one ... The women - children of the white war chief - will burn in our fires so all can share in this.  The sachem considers this. Then he looks up and sees something beyond Magua.    senses the sachem's eye line ...    Our father, Montcalm, is greater than the Yengeese in the arts of war. The Huron do not fear English anger.    It made our French father happy to never have to fight the same Yengeese again. He told me this without telling me this.  Hawkeye realizes this is true.   No.  Huron serve no one. The French father believes he fooled Magua because he is so proud of his cleverness, he is blind. But it is the Huron path that Magua walks down, not the French one ... Now, Les Francais, also, fear Huron. That is good. When the Huron is strong from their fear, we will make the terms of trade with Les Francais. And we will trade as the white man trades. Take land from the Abnakes; fur from the Osage, Sauk &amp; Fox. And make the Huron great. Over other tribes. No less than the whites, as strong as the whites.  Hawkeye appears to be losing his debate with Magua.    The red man put down the bow, picked up the fire stick and became the best warrior in the forest. Yes. It is the only way.    waits for the decision.    This is not the voice of wisdom. I go to the Hurons of the Lakes! You are women. Send your arrows and guns to the Seneca, beg from them venison to eat, corn to grind. Slaves, dogs, rabbits, thieves ... I spit on you!  Those Hurons who hear, do so in deadly, boding silence. Magua and his fourteen hard core braves start out as ...    running forward past Five, confronts Uncas head on. It's incredibly fast.    knife arm punches forward.    moves on Alice. His knife is low, about to strike. She stares at him. Her eyes are like pools of deep water, calm, open, almost beatific. It stops Magua ...    inexplicably, drops his knife hand. He's riveted by her. About him, there's a glimmer of something else. He wears a human face for this one moment. He reaches out with his other hand to offer her safety. To bring her back from the edge ...    sees the approach of Chingachgook.    charging Chingachgook.    stunned, turns to hatchet Chingachgook ...    amazed. His body is broken and crippled, but he still stands. He looks into the eyes of the last warrior of the Mohicans."
    },
    "imdb_rating": "7.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZDNiYmRkNDYtOWU1NC00NmMxLWFkNmUtMGI5NTJjOTJmYTM5XkEyXkFqcGdeQXVyNzQ1ODk3MTQ@._V1_QL75_UX380_CR0,2,380,562_.jpg",
    "description": "The last members of a dying Native American tribe, the Mohicans -- Uncas, his father Chingachgook, and his adopted half-white brother Hawkeye -- live in peace alongside British colonists. But when the daughters of a British colonel are kidnapped by a traitorous scout, Hawkeye and Uncas must rescue them in the crossfire of a gruesome military conflict of which they wanted no part: the French and Indian War.Jwelch5742",
    "name": "The Last of the Mohicans",
    "genres": [
        "Action",
        "Adventure",
        "Drama"
    ]
}