{
    "filename": "Big-Lebowski,-The_script.txt",
    "imdb_id": "tt0118715",
    "imdb_url": "https://www.imdb.com/title/tt0118715",
    "characters": [
        "Maude Lebowski",
        "Nihilist #3, Franz",
        "Smokey",
        "The Dude",
        "The Big Lebowski",
        "Woo, Treehorn Thug",
        "Nihilist #2, Kieffer",
        "Jesus Quintana",
        "Marty",
        "Nihilist #1, Uli Kunkel /'Karl Hungus'",
        "Bunny Lebowski",
        "Theodore Donald 'Donny' Kerabatsos",
        "Blond Treehorn Thug",
        "Walter Sobchak",
        "Brandt"
    ],
    "dialogues": {
        "Maude": "In a sense, yes.  Elfranco, my robe. My art has been commended as being strongly vaginal.  Which bothers some men.  The word itself makes some men uncomfortable.  Vagina.   Yes, they don't like hearing it and find it difficult to say.  Whereas without batting an eye a man will refer to his \"dick\" or his \"rod\" or his \"Johnson\".   Thank you.  This to Elfranco, who has handed her a robe.  All right, Mr. Lebowski, let's get down to cases.  My father told me he's agreed to let you have the rug, but it was a gift from me to my late mother, and so was not his to give. Now.  As for this. . . \"kidnapping\"--   Yes, I know about it.  And I know that you acted as courier.  And let me tell you something:  the whole thing stinks to high heaven.   Do you like sex, Mr. Lebowski?   Sex.  The physical act of love. Coitus.  Do you like it?   You're not interested in sex?   I like it too.  It's a male myth about feminists that we hate sex. It can be a natural, zesty enterprise. But unfortunately there are some people--it is called satyriasis in men, nymphomania in women--who engage in it compulsively and without joy.   Yes Mr. Lebowski, these unfortunate souls cannot love in the true sense of the word.  Our mutual acquaintance Bunny is one of these.   Take a look at this, sir.  She is aiming a remote at a projection TV.  The screen flickers to life.  A title card:   And you recognize her, of course.  The girl answering the door is Bunny Lebowski.  Bunny The TV is in here.    The story is ludicrous.   Lord.  You can imagine where it goes from here.   Don't be fatuous, Jeffrey.  Little matter to me that this woman chose to pursue a career  in pornography, nor that she has been \"banging\" Jackie Treehorn, to use the parlance of our times.  However.  I am one of two trustees of the Lebowski Foundation, the other being my father.  The Foundation takes youngsters from Watts and--   Little Lebowski Urban Achievers, yes, and proud we are of all of them. I asked my father about his withdrawal of a million dollars from the Foundation account and he told me about this \"abduction\", but I tell you it is preposterous.  This compulsive  fornicator is taking my father for the proverbial ride.   I'm getting to your rug. My  father and I don't get along; he doesn't approve of my lifestyle and, needless to say, I don't approve of his. Still, I hardly wish to make my father's embezzlement a police matter, so I'm proposing that you try to recover the money from the people you delivered it to.   If you successfully do so, I will compensate you to the tune of 1% of the recovered sum.   Thousand, yes, bones or clams or whatever you call them.   --your rug, yes, well with that money you can buy any number of rugs that don't have sentimental value for me. And I am sorry about that crack on the jaw.  The Dude fingers his jaw, where the lump from the sap has all but disappeared.   Here's the name and number of a doctor who will look at it for you.  You will receive no bill.  He's a good man, and thorough.   Please see him, Jeffrey.  He's a good man, and thorough.    She strides toward us, naked under a robe which she is just cinching shut.  Paint flecks her skin.   Jeffrey, you haven't gone to the doctor.   Do you have any news regarding my father's money?   She most certainly was not!   And please don't call her my mother.   She is most definitely the perpetrator and not the victim.   From who?   Dieter Hauff?   Her \"co-star\" in the beaver picture?   Dieter has been on the fringes of-- well, of everything in L.A., for about twenty years.  Look at my LP's. Under 'Autobahn.'  The Dude fingers through the albums filling one bookshelf.   That was his group--they released one album in the mid-seventies.  The Dude stops between two albums.   Huh?  Autobahn.  A-u-t-o.  Their music is a sort of--ugh--techno-pop.  The Dude pulls out an album with a worn sleeve.  On it is the group's name, Autobahn, the album name, Nagelbett, and a picture   Is he pretending to be the abductor?   Look, Jeffrey, you don't really kidnap someone that you're acquainted with.  You can't get away with it if the hostage knows who you are.   So Dieter has the money?   Do you still have that doctor's number?   Please Jeffrey.  I don't want to be responsible for any delayed after- effects.   I want you to see him immediately.  She is picking up a telephone.   I'll see if he's available.  He's a good man, and thorough.     Jeffrey.   Love me.  The Dude is stupefied.   Tell me a little about yourself, Jeffrey.   Uh-huh.   Mmnun.  Click--the Dude turns on a bedside lamp.  He and Maude lie next to each other in bed.   Oh?   Uh-huh.   What do you do for fun?   What happened to your house?   Finder's fee?   It's not my father's money, it's the Foundation's.  Why did he think you had it?  And who does?   Jeffrey--   I keep telling you, it's the Foundation's money.  Father doesn't have any.   No no, the wealth was all Mother's.   We did let Father run one of the companies, briefly, but he didn't do very well at it.   He helps administer the charities now, and I give him a reasonable allowance.  He has no money of his own.  I know how he likes to present himself; Father's weakness is vanity. Hence the slut.   It increases the chances of conception.  The Dude spits some White Russian.   Well yes, what did you think this was all about?  Fun and games?   I want a child.   Look, Jeffrey, I don't want a partner. In fact I don't want the father to be someone I have to see socially, or who'll have any interest in rearing the child himself.   Exactly.  What happened to your face? Did Jackie Treehorn do that as well?  The Dude is staring off into space, thinking.  His answer is absent.   What?  The Dude is leaving the bedroom.   What're you talking about?  Beep.   Jeffrey?",
        "Lebowski": "We are floating up a steep scrubby slope.  We hear male voices gently singing \"Tumbling Tumbleweeds\" and a deep, affable, Western-accented voice--Sam Elliot's, perhaps:   Okay sir, you're a Lebowski, I'm a Lebowski, that's terrific, I'm very busy so what can I do for you?  He wheels himself behind a desk.  The Dude sits facing him as Brandt withdraws.   You told Brandt on the phone, he told me.  So where do I fit in?   I'll say it again, all right?  You told Brandt.  He told me.  I know what happened. Yes?  Yes?   Did I urinate on your rug?   Hello!  Do you speak English?  Parla usted Inglese?  I'll say it again. Did I urinate on your rug?   Hello!  Hello!  So every time--I just want to understand this, sir-- every time a rug is micturated upon in this fair city, I have to compensate the--   You're just looking for a handout like every other--are you employed, Mr. Lebowski?   Are you employed, sir?   You don't go out and make a living dressed like that in the middle of a weekday.   But I do work, so if you don't mind--   My wife is not the issue here. I hope that my wife will someday learn to live on her allowance, which is ample, but if she doesn't, sir, that will be her problem, not mine, just as your rug is your problem, just as every bum's lot in life is his own responsibility regardless of whom he chooses to blame.  I didn't blame anyone for the loss of my legs, some chinaman in Korea took them from me but I went out and achieved anyway. I can't solve your problems, sir, only you can.  The Dude rises.   Sure!  Fuck it!  That's your answer! Tattoo it on your forehead!  Your answer to everything!  The Dude is heading for the door.   Your \"revolution\" is over, Mr. Lebowski!  Condolences!  The bums lost!  As the Dude opens the door.   ...My advice is, do what your parents did!  Get a job, sir!  The bums will always lose-- do you hear me, Lebowski?  THE BUMS WILL ALWAYS--  The Dude shuts the door on the old man's bellowing to find himself--   It's funny.  I can look back on a life of achievement, on challenges met, competitors bested, obstacles overcome.  I've accomplished more than most men, and without the use of my legs.  What. . . What makes a man, Mr. Lebowski?   Huh?   Is it. . . is it, being prepared to do the right thing?  Whatever the price?  Isn't that what makes a man?   You're joking.  But perhaps you're right.  The Dude thumps at his chest pocket.   Bunny.  He turns back around and the firelight shows teartracks on his cheeks.   Bunny Lebowski. . . She is the light of my life.  Are you surprised at my tears, sir?   Strong men also cry. . . Strong men also cry.  He clears his throat.   I received this fax this morning.  Brandt hastily pulls a flimsy sheet from his clipboard and hands it to the Dude.   As you can see, it is a ransom note. Sent by cowards.  Men who are unable to achieve on a level field of play. Men who will not sign their names. Weaklings.  Bums.   Brandt will fill you in on the details.  He wheels his chair around to once again gaze into the fire. Brandt tugs at the Dude's shirt and points him back to the hall.   Start talking and talk fast you lousy bum!   Where's my goddamn money, you bum?!   They did not receive the money, you nitwit!  They  did not receive the goddamn money.  HER LIFE WAS IN YOUR    What in God's holy name are you blathering about?    No.  No Mr. Lebowski, that had not occurred to me.   Brandt, give him the envelope.   Since you have failed to achieve, even in the modest task that was your charge, since you have stolen my money, and since you have unrepentantly betrayed my trust.  The wadding, undone, reveals a smaller wad of gauze taped up inside.  The Dude undoes the tape with his fingernails and starts to unroll the inner package.   I have no choice but to tell these bums that they should do whatever is necessary to recover their money from you, Jeffrey Lebowski.  And with Brandt as my witness, tell you this:  Any further harm visited upon Bunny, shall be visited tenfold upon your head.  Between thumb and forefinger the Dude holds up the contents of the package--a little toe, with emerald green nail polish.   ...By God sir.  I will not abide another toe.      Walter's car pulls up the drive into the foreground and he and the Dude get out.  Both are gaping off at the front lawn.    Well, she's back.  No thanks to you.   Who the hell is he?   Well, you have your story, I have mine.  I say I entrusted the money to you, and you stole it.   Well?  Aren't you?   All right, get out.  Both of you.   I said out.  Now.   Stay away from me, mister!  Walter reaches around from behind and hoists the big Lebowski out of the wheelchair by his armpits.   Put me down, you son of a bitch!    You're bullies!  Cowards, both of you!  Walter is abashed.  The Big Lebowski flails about on the floor.   You monsters!   Stay away from me!  You bullies! You and these women!  You won't leave a man his fucking balls!",
        "Smokey": "Bullshit.  Eight, Dude.   Bullshit. Walter!   Yeah, but--   Yeah, but I wasn't over.  Gimme the marker, Dude,  I'm marking it an eight.  Walter takes out a gun.   I'm not--   Look Dude, I don't hold with this. This guy is your partner, you should--  Walter primes the gun and points it at his head.   Walter--   All right!  There it is!  It's fucking zero!  He points frantically at the score projected above the lane.   You happy, you crazy fuck?",
        "The": "We are floating up a steep scrubby slope.  We hear male voices gently singing \"Tumbling Tumbleweeds\" and a deep, affable, Western-accented voice--Sam Elliot's, perhaps:        Looking.    Donny calls out from the bench:      The Pomeranian is excitedly yapping at Walter's elbow, making high body-twisting tail-wagging leaps.   Mr. Lebowski, this is Brandt at, uh, well--at Mr. Lebowski's office. Please call us as soon as is convenient.  Beep.   Mr. Lebowski, this is Fred Dynarski with the Southern Cal Bowling League. I just got a, an informal report, uh, that a uh, a member of your team, uh, Walter Sobchak, drew a loaded weapon during league play--  We hear the doorbell.    It swings open to reveal a short, hairy, muscular but balding middle-aged man in a black T-shirt and black cut-off jeans.    The  voice continues on the machine.       Displaying great slow-motion form as the Dude and Walter's conversation continues over.    They have been joined by Donny.    An  end  table  is  upset,  but  otherwise the  furniture is in place. The rug is gone.  The  Dude  looks  around.    The  bowling sounds  continue. The beeps continue.  The phone starts to jangle.    The car rocks and the Dude wrestles with the wheel.      He scowls.     The Dude takes a hurried sip from his drink.    A waitress enters.         That's a good one.  Waiting for his drink, he looks amiably around the bar.  His crinkled eyes settle on the Dude.   How ya doin' there, Dude?  The Dude, still staring down at his drink, shakes his head.   One a those days, huh.  Wal, a wiser fella than m'self once said, sometimes you eat the bar and sometimes the bar, wal, he eats you.   Far from it.   Much obliged.  He looks back at the Dude.   I like your style, Dude.     Thankie. . . Just one thing, Dude. D'ya have to use s'many cuss words?  The Dude looks at The Stranger as if just now noticing how out of place the cowpoke is.   Okay, have it your way.  He brushes his hat brim with a fingertip.   Take it easy, Dude.    Tony, the unformed limo driver, is at the door of the bar, beckoning.     His eyes are closed, a headset on, his shirt off.  Leaking tinnily through the headset we hear the opening bars of \"Comin' Up Around the Bend.\"  Behind him, cropped so that we see only a little of his torso, a white-smocked figure taps at the Dude's back.  After a moment the figure circles to one side, out of frame.  His hand reaches in to pull one arm of the headset away from the Dude's ear, and as he does so the music issues more strongly.    His eyes still on the mirror, he absently takes the joint between thumb and forefinger of his right hand and flicks it out the driver's window--except that the window is not open. The butt bounces off the glass and around the car, showering sparks.    The car careens wildly as the surrounding traffic veers off to, make way, horns blaring.  The car finally spins and comes to rest with its passenger side wrapped into a telephone poll.    The Dude frantically grabs at his door, which won't open, and then slides over to push at the passenger door, which also won't open.    We are behind Walter, the Dude, and Donny, facing the stage in the background where Allan, the Dude's balding landlord, is performing a dance moderne.  As Walter talks to the Dude he leans in to him, his voice hushed, so as not to disturb the rest of the very sparse audience.    Walter rings the bell.  It is opened by a matronly Spanish woman.        Lights are going on in houses down the street.  Distant dogs bark.      He wrestles the crowbar away from the startled Walter.    Glass rains in on a terrified, cringing, Donny.    We are looking into the car through the broken windshield as it rattles down the freeway.  Wind whistles through the caved- in windows.  The Dude drives, his jaw clenched, staring grimly out at the  road.  Walter, beside him, and Donny in the back seat, munch 'on In-and-Out Burgers.  Creedence music plays above the bluster of wind.    The Dude is looking around at the '60's modern decor.    Looking up at the Dude as his face hits the glass and squishes.   Darkness warshed over the Dude-- darker'n a black steer's tookus on a moonless prairie night.  There was no bottom.  We hear a thundering bass.        The cab screeches over towards the curb.  Another car, oncoming, its radio blaring Metallica, speeds by.    It is a red convertible.  The driver, singing loudly and badly along with the radio, her hair blowing in the wind, a dreamy smile on her face as she speeds along, higher than a kite, is Bunny Lebowski.    On the accelerator her right foot, in an open-toed bright red high-heeled shoe, has five painted toes.  When she downshifts her left foot enters to engage the clutch.  Five more toes.          He emerges on his front stoop, pulling on a shirt. His attention is caught by something down the street.    Striding purposefully down the street.    As he gets to the car.  He reaches through the open driver's window and grabs the newspaper and hurls it to the ground. He is revved with nervous energy.   PAST!   I--Jesus.  What the hell happened?  He is looking off as the car slows.  The Dude looks where Walter is looking.    Walter's car pulls up the drive into the foreground and he and the Dude get out.  Both are gaping off at the front lawn.    Tire treads lead across the manicured front lawn to where a little red sports car rests with its hood crumpled into a palm trunk.    Through the French doors at its far end we can see Bunny, naked, briefly bouncing on the diving board before splashing into the illuminated pool outside.  Heavy metal music filters in from a boom box by the pool.  Brandt, approaching, stoops and straightens, stoops and straightens, picking up the discarded clothes that run the length of the hall.    The big Lebowski turns at the sound of the door.  His wheelchair hums as he spins it around.      Dieter drops it.    ---  They sit side by side, forearms on knees, in a nondescript waiting area.  Walter bounces the fingertips of one hand off those of the other.  They sit.  They wait.  A tall thin man in a conservative black suit enters.  He eyes the Dude's bowling attire and sunglasses and Walter's army surplus, but doesn't make an issue of it.       We watch each of them glide across the floor, release, follow through--gracefully.  We have never seen them bowl before. They are quite good.  Each wears a black armband on his bowling shirt.   Howdy do, Dude.   Wouldn't miss the semis.  How things been goin'?   Sure, I gotcha.  The bartender has put two gleaming beers on the counter.   Sure.  Take it easy, Dude--I know that you will.     The Dude abides.  He gives his head a shake of appreciation, then looks into the camera.   I don't know about you, but I take comfort in that.  It's good knowin' he's out there, the Dude, takin' her easy for all us sinners.  Shoosh.  I sure hope he makes The finals.  Welp, that about does her, wraps her all up.  Things seem to've worked out pretty good for the Dude'n Walter, and it was a purt good story, dontcha think?   Made me laugh to beat the band.  Parts, anyway.  Course--I didn't like seein' Donny go. But then, happen to know that there's a little Lebowski on the way.  I guess that's the way the whole durned human comedy keeps perpetuatin' it-self, down through the generations, westward the wagons, across the sands a time until-- aw, look at me, I'm ramblin' again.  Wal, uh hope you folks enjoyed yourselves.  He brushes his hat brim with a fingertip as we begin to pull back.   Catch ya further on down the trail.  As we pull away The Stranger swivels in to the bar.  As his voice fades:   ...Say friend, ya got any more a that good sarsaparilla?...     </html>",
        "Dude": "It's the LeBaron.    The Dude is going up the walkway of a small Venice bungalow court.  He holds the paper sack in one hand and a small leatherette satchel in the other.  He awkwardly hugs the grocery bag against his chest as he turns a key in his door.   It's uh, it's down there somewhere. Lemme take another look.  His head is plunged back in.   Oh, man.  Don't do--   Look, nobody calls me Lebowski.  You got the wrong guy.  I'm the Dude, man.   Bunny?  Look, moron.  He holds up his hands.   You see a wedding ring?  Does this place look like I'm fucking married? All my plants are dead!  The blond man stoops to unzip the satchel.  He pulls out a bowling ball and examines it in the manner of a superstitious native.   Obviously you're not a golfer.  The blond man drops the ball which pulverizes more tile.   Hey.  At least I'm housebroken.  The two men look at each other.  They turn to leave.   Yeah man, it really tied the room together--   What's your point, Walter?   What's the point of--we all know who was at fault, so what the fuck are you talking about?   My rug.   This Chinaman who peed on my rug, I can't go give him a bill so what the fuck are you talking about?   Walter, this is not a guy who built the rail- roads, here, this is a guy who peed on my--   Walter, he peed on my rug--   So who--   No, but--   Yeah, but--   Fuckin' A.   Yeah, I could find this Lebowski guy--   Yeah, this is the guy, this guy should compensate me for the fucking rug. I mean his wife goes out and owes money and they pee on my rug.   Yes, uh, very impressive.   I'm not really, uh.   Uh-huh.  We are panning the walls, looking at various citations and  certificates unrelated to the ones being discussed offscreen:   Uh-huh.   Hey, is this him with Nancy?   Lebowski on the right?   He's handicapped, huh?   Far out.   Nancy's pretty good.   Are these.   Different mothers, huh?   I guess he's pretty, uh, racially pretty cool--   I see.   Jeez.  Think he's got room for one more?   Well, yeah I did, but I spent most of my time occupying various, um, administration buildings--   --smoking thai-stick, breaking into the ROTC--   --and bowling.  I'll tell you the truth, Brandt, I don't remember most of it.--Jeez!  Fuck me!  Our continuing track and pan have brought us onto a framed Life Magazine cover which is headlined ARE YOU A LEBOWSKI ACHIEVER?  Oddly, the Dude's sunglassed face is on it; we realize that, under the magazine's logo and headline, the display is mirrored.  We hear the door open and the whine of a motor.  The Dude, wearing shorts and a bowling shirt, turns to look.  So does Brandt, the young man we've been listening to.  He wears a suit and has his hands clasped in front of his groin.  Entering the room is a fat sixtyish man in a motorized wheelchair--Jeff Lebowski.   Well sir, it's this rug I have, really tied the room together-   Well they were looking for you, these two guys, they were trying to--   So you know they were trying to piss on your rug--   You mean, did you personally come and pee on my--   Well no, like I said, Woo peed on the rug--   Come on, man, I'm not trying to scam anybody here, I'm just--   Look, let me explain something. I'm not Mr. Lebowski;  you're Mr. Lebowski.  I'm the Dude.  So that's what  you  call me.  That, or Duder. His  Dudeness.  Or El Duderino, if, you know, you're not into the whole brevity thing--   Employed?   Is this a--what day is this?   No, look.  I do mind.  The Dude minds. This will not stand, ya know, this will not stand, man.  I mean, if your wife owes--   Ah fuck it.   Okay.  The old man told me to take any rug in the house.   It's the LeBaron.    Tracking toward the pool.  A young woman sits facing it, her back to us, leaning forward to paint her toenails.  Beyond her a black form floats in an inflatable chair in the pool.   Yeah sure, if I'm ever in the neighborhood, need to use the john.    Looking.   Huh?  She waggles her foot and giggles.   You want me to blow on your toes?   You sure he won't mind?  The man bobbing in the inflatable chair is passed out.  He is thin, in his thirties, with long stringy blond hair.  He wears black leather pants and a black leather jacket, open, shirtless, exposing fine blond chest hair and pale skin. One arm trails off into the water; next to it, an empty whiskey bottle bobs.   Practicing?  The young woman smiles.   You're Bunny?   I'm just gonna find a cash machine.   Your maples, Carl.  Walter, just arriving, is carrying a leatherette satchel in one hand and a large plastic carrier in the other.   You're fucking twenty minutes late. What the fuck is that?   Huh?   What the fuck're you talking about? The carrier.  What's in the fucking carrier?   What the fuck are you--   You brought a fucking Pomeranian bowling?   Hey, man, if my fucking ex-wife asked me to take care of her fucking dog while she and her boyfriend went to Honolulu, I'd tell her to go fuck herself.  Why can't she board it?   Hey man--   Come on Walter, it's just--it's Smokey.  So his toe slipped over a little, it's just a game.   Hey Walter--   Walter, they're calling the cops, put the piece away.   Walter, you can't do that.  These guys're like me, they're pacificists. Smokey was a conscientious objector.   And you know Smokey has emotional problems!   He's fragile, man!  He's very fragile!  As the two men get into the car:   No, you're not wrong--   You're not wrong, Walter, you're just an asshole.  They watch a squad car take a squealing turn into the lot.   Just, just take it easy, Walter.   Well, just take 't easy, man.   Yeah?  Wavin' a gun around?!   Just take it easy, man!  Walter is still smug.    A large, brilliant Persian rug lies beneath the Dude's beat- up old furniture.  At the table next to the answering machine the Dude is mixing kalhua, rum and milk.   Shit!   Hiya Allan.   Sure Allan, I'll be there.   Yeah, yeah I know. Okay.   Yeah, okay.   Huh.  Brandt throws open a pair of heavy double doors.  The music washes over us as we enter a great study where Jeffrey Lebowski, a blanket thrown over his knees, stares hauntedly into a fire, listening to Lohengrin.   Dude.   I don't know, sir.   Sure.  That and a pair of testicles.  Lebowski turns away from the Dude with a haunted stare, lost in thought.   Mind if I smoke a jay?   'Scuse me?   Fuckin' A.     Bummer.  Lebowski looks soulfully at the Dude.   Why me, man?   So he thinks it's the carpet-pissers, huh?   Fucking Quintana--that creep can roll, man--   Huh?   Huh.    They have been joined by Donny.   Twenty grand.  And of course I still keep the rug.   Yeah.  He slips a little black box out of his shirt pocket.   ...They  gave  Dude  a  beeper,  so whenever these guys call--   I told him if it was during league play--  Donny has been watching Quintana.   I figure it's easy money, it's all pretty harmless.  I mean she probably kidnapped herself.   Rug-peers did not do this.  I mean look at it.  Young trophy wife. Marries a guy for money but figures he isn't giving her enough.  She owes money all over town--   It's all a goddamn fake.  Like Lenin said, look for the person who will benefit.  And you will, uh, you know, you'll, uh, you know what I'm trying to say--   Yeah.   Yeah, well, what do you care, Walter?   I don't see any connection to Vietnam, Walter.   Walter, face it, there isn't any connection.  It's your roll.   It's your roll--   It's your roll.   Yeah well, that's just, ya know, like, your opinion, man.  Quintana looks at Walter.   Jesus.    We are looking down at the Dude who is prone on the rug. His eyes are closed.  He wears a Walkman headset.  Leaking tinnily through the headphones we can just hear an intermittent clatter.  In his outflung hand lies a cassette case labeled VENICE  Oh man.  He  raises  himself  onto  his  elbows  and  massages  the red   lump  on his  jaw.  The  beeper  on his  belt is blinking red  in sync  with the continuing irritating beeps.   Oh, nothin', you know.  They have reached the little desk outside of the big Lebowski's office; Brandt opens its bottom drawer with a key and takes out an attache case.  He hands this to the Dude along with a cellular phone in a battery-pack carrying case.   Uh-huh.   Oh, man, don't say that..   Shit.    We pan off the Dude, driving, to his point of view through the front windshield.  The headlights play over Walter standing waiting in front of the storefront of SOBCHAK SECURITY.  Though he is wearing khaki shorts and shirt, the fact that he holds a battered brown briefcase makes him look oddly like a commuter.  He also holds an irregular shape bundled in brown wrapping paper.  The car stops in front of him and he opens the Dude's door and hands in the briefcase.   The what?   What the hell is this?   Agh--  He closes the briefcase.   Walter, I'm sure there's a reason you brought your dirty undies--   Walter--what the fuck are you thinking?   We?  What the fuck we?  You said you just wanted to come along--   Yes you're wrong.  This isn't a fucking game, Walter--   Yeah, but--  The phone chirps.  Dude grabs it.   Dude here.   Dude the Bagman.  Where do you want us to go?    Shit. . . Uh, yeah, you know, me and the driver.  I'm not handling the money and driving the car and talking on the phone all by my fucking--   Yeah?   The driver man, I told you--  Click.  Dial tone.   Oh shit.  Walter.   They hung up, Walter!  You fucked it up!  You fucked it up!  Her life was in our hands!   We're screwed now!  We don't get shit and they're gonna kill her! We're fucked, Walter!   Shutup, Walter!  Don't fucking say peep when I'm doing business here.   Dude here.   Yeah.   Hey, just tell me where the fuck you want us to go.   That was the sign.  Walter wrestles the car onto the two-lane road.   Terrific, Walter.  But you haven't told me how we get her back.  Where is she?   Yeah.  That's a great plan, Walter. That's fucking ingenious, if I understand it correctly.  That's a Swiss fucking watch.   Dude.    There is no fucking hand-off, Walter! At a wooden bridge we throw the money out  of the car!   We throw the money out of the moving car!  Walter stares dumbly for a beat.   Well call them up and explain it to 'em, Walter!  Your plan is so fucking simple, I'm sure they'd fucking understand it!  That's the beauty of it Walter!   I'm throwing the money, Walter! We're not fucking around!   Fuck that!  I love you, Walter, but sooner or later you're gonna have to face the fact that you're a goddamn moron.   Walter!   What the fuck?   Uzi?  Walter points across the seat at the paper-wrapped bundle.   Walter, please--  Walter has flung open his door and is leaning halfway out over the road.    WE HAVE IT!!. . . We have it!  The Dude and Walter stand in the middle of the road, watching the three red tail lights fishtail away.   What the fuck is that supposed to mean?  What the fuck're we gonna tell Lebowski?   Huh?  The problem is--what do you mean what's the--there's no--we didn't-- they're gonna kill that poor woman--   No, Walter!  I said I thought she kidnapped herself!  You're the one who's so fucking certain--   Walter, what'm I gonna tell Lebowski?   Walter--   Who gives a shit, Walter?  What about that poor woman?  What do we tell--   Yeah, and in the meantime what do I tell Lebowski?   Walter, how--   That's it.  I'm out of here.   But Walter, we didn't make the fucking hand- off!  They didn't get, the fucking money and they're gonna-- they're gonna--   Walter--   \"Our\" car, Walter?   You don't know, Walter?  You seem to know the answer to everything else!   It's been stolen, Walter!  You fucking know it's been stolen!   Aw, fuck it.  The Dude walks away across the lot.  The portable phone starts ringing again.   I'm going home, Donny.   Thank you, Donny.    The Dude is slumped disconsolately back in his easy chair, fingers of one hand cupped over his sunglasses.  Facing him on the couch are two uniformed policeman, one middle-aged, the other a fresh-faced rookie.  At the cut the portable phone, in the Dude's lap, is chirping. The Dude waits for the rings to end.  When they do:   1972 Pontiac LeBaron.   Green.  Some brown, or, uh, rust, coloration.   Huh?  Oh.  Yeah.  Tape deck.  Couple of Creedence tapes.  And there was a, uh. . . my briefcase.   Papers.  Just papers.  You know, my papers.  Business papers.   I'm unemployed.   ...Me, I don't drink coffee.  But it's nice when they offer.   ...Also, my rug was stolen.   No.  Here.   You find them much?  Stolen cars?  Dude's Voice on Machine The Dude's not in.  Leave a message after the beep.  It takes a minute.   And the, uh, the briefcase?  Beep.   Is that what that's a picture of?   Oh yeah?   \"Johnson\"?   Huh?   Right, but let me explain something about that rug--   Excuse me?   I was talking about my rug.   You mean coitus?   Oh, no.   Listen, Maude, I'm sorry if your stepmother is a nympho, but I don't see what it has to do with--do you have any kalhua?   Shit, I know that guy.  He's a nihilist.   He fixes the cable?   Shit yeah, the achievers.   Yeah, but my-   Well--sure, I could do that--   A hundred.   Yeah, but what about--   Oh that's okay, I hardly even--   That's really thoughtful but I--   Fuckin' A, man.  I got a rash. Fuckin' A, man.  I gotta tell ya Tony.  He takes a sip of a freshly-mixed White Russian, which leaves milk on his mustache.  I was feeling really shitty earlier in the day, I'd lost  a little  money, I  was down in the dumps.   Yeah, man!  Fuck it!  I can't be worrying about that shit.  Life goes on!  The limo has rolled to a stop.  The Dude gets out, still holding his drink.   Huh?  His eyes on the rearview mirror, Tony jerks a thumb over his shoulder.  He followed us here.  The Dude turns to look.    He scowls.   When did he-  The Dude is grabbed from behind and muscled away in a half- nelson by another uniformed chauffeur.   Fuck, man!  There's a beverage here!  The waiting limo's back door is flung open.   Well we--I don't--   No, man, nothing is fucked here--   C'mon man, who're you gonna believe? Those guys are--we dropped off the damn money--   I--the royal we, you know, the editorial--I dropped off the money, exactly as per--Look, I've got certain information, certain things have come to light, and uh, has it ever occurred to you, man, that given the nature of all this new shit, that, uh, instead of running around blaming me, that this whole thing might just be, not, you know, not just such a simple, but uh--you know?   I'll tell you what I'm blathering about!  I got information--new shit has come to light and--shit, man! She kidnapped herself!  Lebowski stares at him, dumbstruck.  The Dude is encouraged.   Well sure, look at it!  Young trophy wife, I mean, in the parlance of our times, owes money all over town, including to known pornographers-- and that's cool, that's cool-- but I'm saying, she needs money, and of course they're gonna say they didn't get it 'cause she wants more, man, she's gotta feed the monkey, I mean-- hasn't that ever occurred to you...? Sir?   Well, okay, you're not privy to all the new shit, so uh, you know, but that's what you pay me for.  Speaking of which, would it be possible for me to get my twenty grand in cash? I gotta check this with my accountant of course, but my concern is that, you know, it could bump me into a higher tax--   Well, okay, if you've already made out the check.  Brandt is handing him a letter-sized envelope which is distended by something inside.   Whose toe was it, Walter?   The nail polish, Walter.   Someone else's--where the fuck are they gonna--   But Walter--   They're gonna kill her, Walter, and then they're gonna kill me--   What about the toe?   Walter, this isn't a First Amendment thing.     All right, I'm leaving.  I'm sorry ma'am.    A dripping noise.  The Dude sits in the bathtub, staring stuporously, a joint pinched in one hand, a washcloth draped over his head.  We hear the phone ringing in the other roam.  The Dude is staring at his toes, which protrude from the soapy water, splayed against the far side of the tub.  After the Dude's outgoing message we hear:   Far out.  Far fuckin' out.   Hunh?  He looks blearily at the open doorway.  A tall man dressed in black leather with a cricket paddle is striding across the living room towards the bathroom.   Hey!  This is a private residence, man!  The man has entered the bathroom and, in stride, swings the cricket paddle up to smash the overhead light.  Two other men are entering behind him.  The room is dark now except for spill from the living room; the men are backlit shapes.  One of them holds a string at the other end of which a small animal skitters excitedly about the floor.  The Dude looks curiously at the small, nattering animal.   Nice marmot.  The man with the string scoops up the marmot and tosses it, screaming, into the bathtub.  The Dude screams.  The marmot splashes frantically, biting at the Dude in a frenzy of fearful aggression.   Jesus!   Jesus Christ!   Excuse me?   My fucking briefcase!  It's not here!   My fucking briefcase!  Jesus--what's that smell?   When will you find these guys?  I mean, do you have any promising leads?  The policeman laughs, agreeing broadly.   I figure my only hope is that the big Lebowski kills me before the Germans can cut my dick off.   Thanks Walter.    Yeah, thanks Walter.  That gives me a very secure feeling.   That makes me feel all warm inside.   This whole fucking thing--I  could be sitting here with just pee-stains on my rug.  Walter sadly shakes his head.   They're nihilists.   They kept saying they believe in nothing.   Yeah.   What're you, a fucking park ranger now?   Who gives a shit about the fucking marmot!   Fuck your sympathy!  I don't need your sympathy, man, I need my fucking Johnson!   Fuck the tournament!  Fuck you, Walter!  There is a moment of stunned silence.   Another Caucasian, Gary.   Friends like these, huh Gary.   Ahh, not so good, man.    Uh-huh.  That some kind of Eastern thing?   Mm.  The bartender puts a brown bottle and a frosted glass on the bar in front of The Stranger, who touches his hat brim.     Well I like your style too, man. Got a whole cowboy thing goin'.   The fuck are you talking about?  The Stranger chuckles indulgently and pushes off from the bar.   Yeah.  Thanks man.  He is gone.  \"Tumbling Tumbleweeds\" is ending as we hear an offscreen voice, breaking the spell:    Tony, the unformed limo driver, is at the door of the bar, beckoning.   No it's fine, really, uh--   I, uh... money, yeah, I gotta respecfully, 69 you know, tender my resignation on that matter, 'cause it looks like your mother really was kidnapped after all.   Hey man, why don't you fucking listen occasionally?  You might learn something.  Now I got--   Now I got--   I'm telling you, I got definitive evidence--   The main guy, Dieter--   Well--yeah, I guess--   Beaver?  You mean vagina?--I mean, you know him?   Roy Orbison. . . Pink Floyd.   Jeez.  I miss vinyl.   Well...yeah--   Well yeah...I know that.   Well, no, not exactly.  It's a complicated case, Maude.  Lotta ins. Lotta outs.  And a lotta strands to keep in my head, man.  Lotta strands in old Duder's--   Huh?  No, really, I don't even have the bruise any more, I--  She is scribbling.   Delayed after-eff--    His eyes are closed, a headset on, his shirt off.  Leaking tinnily through the headset we hear the opening bars of \"Comin' Up Around the Bend.\"  Behind him, cropped so that we see only a little of his torso, a white-smocked figure taps at the Dude's back.  After a moment the figure circles to one side, out of frame.  His hand reaches in to pull one arm of the headset away from the Dude's ear, and as he does so the music issues more strongly.   Huh?  No, she, she hit me right here.    The Dude is driving home.  A Creedence tape plays.  The Dude is sucking down a joint.  He glances at the rear-view mirror-- and, noticing something, looks again.    His eyes still on the mirror, he absently takes the joint between thumb and forefinger of his right hand and flicks it out the driver's window--except that the window is not open. The butt bounces off the glass and around the car, showering sparks.    The glowing butt rolls down the car seat between his legs. The Dude screams.   Fuck Me.  But he is sitting on the passenger  side now,  away from the lit butt.  He looks around for it.  Smoke is wisping up from between the Driver's seat cushion and back cushion.   Fuckola, man.  He takes his beer and pours it in between the cushions. There is a hissing  sound.   But there is a piece of paper sticking out from between the cushions.  The Dude pulls it out.  It is lined spiral notebook paper, slightly singed and dripping beer, covered with handwriting.  In the upper right- hand corner is the name Lawrence Sellers, and under that, Mrs. Jamtoss 5th Period.  The theme is titled \"The Louisiana Purchase.\"  In red ink is a large circled D and some handwritten marginal comments; misspelled words are circled in red throughout.   The In-and-Out Burger is on Camrose.   Who the fuck is that?   Who the fuck is Arthur Digby Sellers?   Yeah.   Yeah yeah, I know the fucking show Walter, so what?   Uh-huh.   Uh-huh.   No.   Uh.   Fuck me, man!  That kid's already spent all the money!   Look, man, did you--   Just ask him if he--ask him about the car, man!  Walter is still holding out the homework.   Is the car out front yours?   We know it's his fucking homework, Walter!  Where's the fucking money, you little brat?  Throughout Walter has been staring at Larry with the homework extended towards him.   Oh, for Christ's sake, Walter!   And the fucking money!   No!  No!  NO!  THAT'S NOT--    We are looking into the car through the broken windshield as it rattles down the freeway.  Wind whistles through the caved- in windows.  The Dude drives, his jaw clenched, staring grimly out at the  road.  Walter, beside him, and Donny in the back seat, munch 'on In-and-Out Burgers.  Creedence music plays above the bluster of wind.    As the Dude talks on the phone he is hammering a two-by-four into the floor just inside, and parallel to, the front door.   I accept your apology. . . No I, I just want to handle it myself from now on. . . No.  That has nothing to do with it. . . .Yes, it made it home, I'm calling from home.  No, Walter, it didn't look like Larry was about to crack.  He finishes hammering, rises and grabs a straightbacked chair that stands nearby.   Well that's your perception. . . Well you're right, Walter, and the unspoken Message is FUCK YOU AND LEAVE ME THE FUCK ALONE. . . Yeah, I'll be at practice.  He hangs up and has just finished sliding the chair into place with its top under the doorknob and its legs braced against the two-by-four, thus wedging the door closed, when the door is opened--outwards.  The chair clatters to the floor.   Huh?  Woo and the blond man who earlier peed on the rug stride in, kicking the chair away.   This is quite a pad you got here, man.  Completely unspoiled.   White Russian, thanks.  How's the smut business, Jackie?   Which one was Logjammin'?   On you, maybe.  He hands him the drink.   Uh-huh.  Well, I still jerk off manually.   I thought you might know, man.   But she hasn't run off, she's been--  Treehorn waves this off.   Yeah, well, right man, there are many facets to this, uh, you know, many interested parties.  If I can find your money, man-- what's in it for the Dude?   Does the Pope shit in the woods?   Okay, Jackie, done.  I like the way you do business.  Your money is being held by a kid named Larry Sellers. He lives in North Hollywood, on Radford, near the In-and-Out Burger. A real fuckin' brat, but I'm sure your goons'll be able to get it off him, mean he's only fifteen and he's flunking social studies.  So if you'll just write me a check for my ten per cent. . . of half a million. . . fifty grand.  He is getting to his feet, but sways woozily.   I'll go out and mingle.--Jesus, you mix a hell of a Caucasian, Jackie.  The Dude shakes his head, tries to focus.   No funny stuff, Jackie. . . the kid's got it.  Hiya, fellas. . . kid just wanted a car.  All the Dude ever wanted. . . was his rug back. . . not greedy. . . it really.  He squints at Jackie Treehorn, who swims in and out of focus. Tied the room together.  He tips forward, spilling his drink off the table.     He was innocent.  Not a charge was true.  And they say he ran awaaaaaay.   I know my rights.   I want a fucking lawyer, man.  I want Bill Kunstler.   Uh-huh.   That guy treats women like objects, man.   I'm sorry, I wasn't listening.  The Chief hurls his steaming mug of coffee at the Dude.  It hits him in the forehead with a thud, the scalding coffee splashing everywhere.  The Chief is already up off his chair, rounding the desk.   --Ow!  Fucking fascist!  The Chief slaps him twice.    The back of the driver, a large black man with rasta dreds under a knit cap.   Jesus, man, can you change the station?   I've had a--   --had a rough night, and I hate the fucking Eagles, man--    The Dude staggers in the open front door, one hand pressed to a lump on his forehead, and looks around.   Jesus.  The place is a wreck.  Furniture has been overturned, upholstery slashed, drawers dumped.  Quiet.  The door to the bedroom starts to creak open.  The Dude cringes.  Maude emerges from the bedroom.  She is wearing a bathrobe.   Maude?  She pulls open the bathrobe as she approaches.   That's my robe.   Well, uh. . . Not much to tell.  A match is dragged across a headboard; the Dude is lighting himself a joint.  He shakes the match out to restore blackness except for the glowing tip of the joint.   I was, uh, one of the authors of the Port Huron Statement.--The original Port Huron Statement.   Not the compromised second draft. And then I, uh. . . Ever hear of the Seattle Seven?   And then. . . let's see, I uh--music business briefly.   Yeah.  Roadie for Metallica.  Speed of Sound Tour.   Bunch of assholes.  And then, you know, little of this, little of that. My career's, uh, slowed down a bit lately.   Oh, you know, the usual.  Bowl. Drive around.  The occasional acid flashback.  He climbs out of bed but Maude remains in it.  She wedges a pillow into the small of her back and clasps a hand on each kneecap.  She pulls her knees in toward her chest to keep her pelvis raised.   Jackie Treehorn trashed the place. Wanted to save the finder's fee.   He thought I had your father's money, so he got me out of the way while he looked for it.   Larry Sellers, a high-school kid. Real fucking brat.  He picks a White Russian off the bedside table.   It's a complicated case, Maude. Lotta ins, lotta outs.  Fortunately I've been adhering to a pretty strict, uh, drug regimen to keep my mind, you know, limber.  I'm real fucking close to your father's money, real fucking close.  It's just--   Huh?  He's fucking loaded.   But your father--he runs stuff, he--   But he's--   Huh.  Jeez.  Well, so, did he--is that yoga?  Throughout, Maude has been lying on her back with her knees pulled in.   Increases?   Well...no, of course not--   Yeah, okay, but see, the Dude--   Huh...  Something occurs to him.   So...that doctor.   No, the, uh, police chief of Malibu. A real reactionary. . . So your father. . . Oh man, I get it!   Yeah, my thinking about the case, man, it had become uptight.  Yeah. Your father--   Walter, if you're there, pick up the fucking phone.  Pick it up, Walter, this is an emergency.  I'm not--   Walter, listen, I'm at my place, I need you to come pick me up--   Huh?   It is a fucking emergency.   THEN WHY CAN'T YOU--fuck, never mind, just call Donny then, and ask him to--     He emerges on his front stoop, pulling on a shirt. His attention is caught by something down the street.    Striding purposefully down the street.    As he gets to the car.  He reaches through the open driver's window and grabs the newspaper and hurls it to the ground. He is revved with nervous energy.   Get out of that fucking car, man!  The man nervously complies.  The Dude flinches at the man's movement as he gets out.  The man cringes, reacting to the Dude's flinch.  He is wearing a cheap blue serge suit.  He is bald with a short fringe and a mustache.  The Dude shouts to cover his fear:   Who the fuck are you, man!  Come on, man!   Who the fuck are you?  Why've you been following me?  Come on, fuckhead!   Brother Shamus?  Like an Irish monk?   Huh?   I'm not a--ah, fuck it, just stay away from my fucking lady friend, man.   She's not my special lady, she's my fucking lady friend.  I'm just helping her conceive, man!   Who're you working for?  Lebowski? Jackie Treehorn?   The?  Who the fff--   Jesus fucking Christ.   Boy.  How ya gonna keep 'em down on the farm once they seen Karl Hungus.  He hands back the picture.  She's been kidnapped, Da Fino.  Or maybe not, but she's definitely not around.   Yeah, it sucks.   Yeah, I get it.  Fuck off, Da Fino. And stay away from my special la-- from my fucking lady friend.  The Dude steps out to meet Walter's car as it pulls up, its passenger window open and the pomeranian leaning out and yapping.   I mean we totally fucked it up, man. We fucked up his pay-off.  And got the kidnappers all pissed off, and the big Lebowski yelled at me a lot, but he didn't do anything.  Huh?   I'm saying if he knows I'm a fuck- up, then why does he still leave me in charge of getting back his wife? Because he fucking doesn't want her back, man!  He's had enough!  He no longer digs her!  It's all a show! But then, why didn't he give a shit about his million bucks?  I mean, he knew we didn't hand off his briefcase, but he never asked for it back.   His million bucks was never in it, man!  There was no money in that briefcase!  He was hoping they'd kill her!  You throw out a ringer for a ringer!   Shit yeah!   Huh?   Walter, come off it.  You're not even fucking Jewish, you're--   You're fucking Polish Catholic--   Yeah, and you were--   And you were divorced five fucking years ago.   This driveway.   It's just part of your whole sick Cynthia thing.  Taking care of her fucking dog.  Going to her fucking synagogue.  You're living in the fucking past.   Where'd she been?   But I guess she told Dieter.   Where's the money, Lebowski?   We know the briefcase was empty, man.  We know you kept the million bucks yourself.   You thought Bunny'd been kidnapped and you could use it as a pretext to make some money disappear.  All you needed was a sap to pin it on, and you'd just met me.  You thought, hey, a deadbeat, a loser, someone the square community won't give a shit about.   Well. . . yeah.   Walter!    He can't walk, Walter!   Help me put him back in his chair.  Walter moves to comply.   Walter, you fuck!   We're sorry, man.  We're really sorry.  The Dude has picked up the Big Lebowski's plaid lap warmer and is frantically tucking it back in around his waist and batting the dog away.   There ya go.  Sorry man.  Walter, puzzled, hands on hips, stands over the big Lebowski.    Each with a beer at the scoring table.   Uh-huh.   Yeah.   They finally did it.  They killed my fucking car.   You don't have the fucking girl, dipshits.  We know you never did. So you've got nothin' on my Johnson.    The men in black, stunned, confer amongst themselves in German.  Under his breath:   Hey, cool it Walter.  Walter ignores the Dude, addresses the Germans:   Hey, cool it Walter.  Listen, pal, there never was any money.  The big Lebowski gave me an empty briefcase, man, so take it up with him.   Come on, Walter, we're ending this thing cheap.  Walter's eyes, burning with hatred, are locked on Dieter's.   Come on, Walter!.  Louder, to the Germans, as he looks in his wallet:   Four dollars here!  He inspects the change in his palm.   Almost five!    He rushes Franz but draws up short as Franz sends out karate kicks, his leather pants squeaking and popping.  Franz gives a loud cry with each kick; the Dude leans back, throwing his arms up, evading the kicks.    Awkwardly circling, evading Franz's kicks.    The Dude and Franz, both now panting heavily, have yet to establish body contact.  Franz continues to kick.    With a piercing shriek Franz finally summons the nerve to charge the Dude, hands raised to deliver karate blows.  As he reaches the Dude--WHHAP--the  boom box swings into frame to smash him in the face.  Its volume shoots up.  Walter bashes him a few more times over the head.  The music screeches to static, then quiet.  Laid out now, Franz too is quiet.  All quiet.  Walter, panting, looks around.   Hy God!  They shot him, Walter!   They shot Donny!  Donny gasps for air.  His eyes, wide, go from the Dude to Walter.  One hand still clutches his eighteen dollars.   Then what's...   Wha.   Wha. . . Donny--    ---  They sit side by side, forearms on knees, in a nondescript waiting area.  Walter bounces the fingertips of one hand off those of the other.  They sit.  They wait.  A tall thin man in a conservative black suit enters.  He eyes the Dude's bowling attire and sunglasses and Walter's army surplus, but doesn't make an issue of it.   Yeah man.   Jeffrey Lebowski.   The Dude, actually.  Is what, uh.   Nothing.   Well can we--   Can we just rent it from you?   Walter--   Hey man, don't you have something else you could put it in?   Goddamnit Walter!  You fucking asshole!   You make everything a fucking travesty!   What about that shit about Vietnam!   What the fuck does Vietnam have to do with anything!  What the fuck were you talking about?!  Walter for the first time is genuinely distressed, almost lost.   You're a fuck, Walter!  He gives Walter a weaker shove.  Walter seems dazed, then wraps his arms around the Dude.    We watch each of them glide across the floor, release, follow through--gracefully.  We have never seen them bowl before. They are quite good.  Each wears a black armband on his bowling shirt.   Two oat sodas, Gary.   Thanks, man.   Yeah.  Well, you know, sometimes you eat the bear, and, uh.  \"Tumbling Tumbleweeds\" has come up on the jukebox, and The Stranger ambles up to the bar.   Oh, hey man, how are ya?  I wondered if I'd see you again.   Ahh, you know.  Strikes and gutters, ups and downs.  The Stranger's eyes crinkle merrily.   Thanks, Gary...Take care, man, I gotta get back.     Yeah man.  Well, you know, the Dude abides.  Gazing after him, The Stranger drawls, savoring the words:",
        "Jesus": "",
        "Quintana": "wheeling and thrusting a black gloved fist into the air.  Stitched above the breast pocket of his all-in-one is his first name, \"Jesus\".   I see you rolled your way into the semis.  Deos mio, man.  Seamus and me, we're gonna fuck you up.   Let me tell you something, bendeco. You pull any your crazy shit with us, you flash a piece out on the lanes, I'll take it away from you and stick it up your ass and pull the fucking trigger til it goes \"click\".   You said it, man.  Nobody fucks with the Jesus.  Jesus walks away.  Walter nods sadly.   What's this \"day of rest\" shit, man?!  Walter looks at him innocently.   What is this bullshit, man?  I don't fucking care!  It don't matter to Jesus!  But you're not fooling me! You might fool the fucks in the league office, but you don't fool Jesus! It's bush league psych-out stuff! Laughable, man!  I would've fucked you in the ass Saturday, I'll fuck you in the ass next Wednesday instead!    He makes hip-grinding coital motions as O'Brien leads him away.   You got a date Wednesday, man!  Walter, his head cocked, and the Dude, peeking over his shades, watch him go.",
        "Marty": "",
        "Bunny": "I'll suck your cock for a thousand dollars.  Brandt releases a gale of forced laughter:   Brandt can't watch though.  Or he has to pay a hundred.",
        "Walter": "This was a valued rug.  He elaborately clears his throat.   This was, uh--   This was a valued, uh.  Donny, the strike-scoring bowler, enters and sits next Walter.   Were you listening to the story, Donny?   Were you listening to the Dude's story?   So you have no frame of reference, Donny.  You're like a child who wanders in in the middle of a movie and wants to know--   There's no fucking reason--here's my point, Dude--there's no fucking reason--   Huh?   Huh?  No!  What the fuck are you talking--I'm not--we're talking about unchecked aggression here--   Forget it, Donny.  You're out of your element.   What the fuck are you talking about?! This Chinaman is not the issue!  I'm talking about drawing a line in the sand, Dude.  Across this line you do not, uh--and also, Dude, Chinaman is not the preferred, uh. . . Asian- American.  Please.   What the fuck are you--   YOU'RE OUT OF YOUR ELEMENT!  This Chinaman is not the issue, Dude.   Jeff Lebowski.  Come on.  This other Jeffrey Lebowski.  The millionaire. He's gonna be easier to find anyway than these two, uh. these two  . . . And he has the wealth, uh, the resources obviously, and there is no reason, no FUCKING reason, why his wife should go out and owe money and they pee on your rug.  Am I wrong?   Am I wrong!   Okay. That, uh.  He elaborately clears his throat.  That rap really tied the room together, did it not?   Donny!  Please!   Thaaat's right Dude; they pee on your fucking Rug.   Way to go, Dude.  If you will it, it is no dream.   Theodore Herzel.   State of Israel.  If you will it, Dude, it is no--   Huh?  Oh--Cynthia's Pomeranian. Can't leave him home alone or he eats the furniture.   I'm saying, Cynthia's Pomeranian. I'm looking after it while Cynthia and Marty Ackerman are in Hawaii.   What do you mean \"brought it bowling\"? I didn't rent it shoes.  I'm not buying it a fucking beer.  He's not gonna take your fucking turn, Dude.  He lets the small yapping dog out of the carrier.  It scoots around the bowling table, sniffing at bowlers and wagging its tail.   First of all, Dude, you don't have an ex, secondly, it's a fucking show dog with fucking papers.  You can't board it.  It gets upset, its hair falls out.   Fucking dog has papers, Dude.--Over the line!  Smokey turns from his last roll to look at Walter.   Smokey Huh?   Over the line, Smokey!  I'm sorry. That's a foul.   Excuse me!  Mark it zero.  Next frame.   This is not Nam.  This is bowling. There are rules.   This is a league game.  This determines who enters the next round- robin, am I wrong?   Am I wrong!?   Smokey my friend, you're entering a world of pain.   Mark that frame an eight, you're entering a world of pain.   A world of pain.  A manager in a bowling-shirt style uniform is running for a phone.      This is a league game, Smokey!   You know Dude, I myself dabbled with pacifism at one point.  Not in Nam, of course--   You mean--beyond pacifism?   Huh.  I did not know that.  Well, it's water under the bridge.  And we do enter the next round-robin, am I wrong?   Am I wrong!   Okay then.  We play Quintana and O'Brien next week.  They'll be pushovers.   That's your answer to everything, Dude.  And let me point out--pacifism is not--look at our current situation with that camelfucker in Iraq-- pacifism is not something to hide behind.   I'm perfectly calm, Dude.    Calmer than you are.  -his irritates the Dude further.   Calmer than you are.   Yeah, but he's a fucking pervert, Dude.   The man is a sex offender.  With a record.  Spent six months in Chino for exposing himself to an eight- year-old.   When he moved down to Venice he had to go door-to-door to tell everyone he's a pederast.  The door swings open and a beer-swilling middle-aged man looks dully out at Quintana, who looks hesitantly up.   Shut the fuck up, Donny.    They have been joined by Donny.   Anyway.  How much they offer you?   Just for making the hand-off?   What if it's during a game?   Life does not stop and start at your convenience, you miserable piece of shit.   Huh?   That...fucking...bitch!   That fucking bitch!   Shut the fuck up, Donny!  V.I. Lenin! Vladimir Ilyich Ulyanov!   That's fucking exactly what happened, Dude!  That makes me fucking SICK!   Those rich fucks!  This whole fucking thing-- I did not watch my buddies die face down in the muck so that this fucking strumpet--   Well, there isn't a literal connection, Dude.   Have it your way.  The point is--   The fucking point is--   Eight-year-olds, Dude.   Take the ringer.  I'll drive.  The Dude takes the briefcase and slides over.   The ringer!  The ringer, Dude!  Have they called yet?  The Dude opens the briefcase and paws bemusedly through it as the car starts rolling.   My dirty undies.  Laundry, Dude. The whites.   Thaaaat's right, Dude.  The weight. The ringer can't look empty.   Well you're right, Dude, I got to thinking.  I got to thinking why should we settle for a measly fucking twenty grand--   My point, Dude, is why should we settle for twenty grand when we can keep the entire million.  Am I wrong?   It is a fucking game.  You said so yourself, Dude--she kidnapped herself--   Dude, are you fucking this up?   What the fuck is going on there?   Easy, Dude.   Dude, nothing is fucked.  Come on. You're being very unDude.  They'll call back.  Look, she kidnapped her--  The phone chirps.   Ya see?  Nothing is fucked up here, Dude.  Nothing is fucked.  These guys are fucking amateurs--    Okay Dude.  Have it your way.  The Dude unclips the phone from the battery pack.   But they're amateurs.  The Dude glares at Walter.  Into the phone:   Yeah.  So as long as we get her back, nobody's in a position to complain. And we keep the baksheesh.   That's the simple part, Dude.  When we make the handoff, I grab the guy and beat  it out of him.  He looks at the Dude.   ...Huh?   Thaaat's right, Dude.  The beauty of this is its simplicity. If the plan gets too complex something always goes wrong.  If there's one thing I learned in Nam--  The phone chirps.   What'd he say?  Where's the hand- off?   Huh?   We can't do that, Dude.  That fucks up our plan.   Wooden bridge, huh?   The bridge is coming up!  Gimme the ringer, Dude!  Chop-chop!   Okay, Dude.  No time to argue.  Here's the bridge--  There is the bump and new steady of the car on the bridge. The Dude is twisting around to pull the money briefcase from the back seat.  Walter reaches one arm across Dude's body to grab the laundry.  And there goes the ringer.  He flings it out the window.   Your wheel, Dude!  I'm rolling out!   Your wheel!  At fifteen em-pee-aitch I roll out!  I double back, grab one of 'em and beat it out of him!  The uzi!   You didn't think I was rolling out of here naked!   Fifteen!  This is it, Dude!  Let's take that hill!  Walter rolls out with his parcel, giving a loud grunt as he hits the pavement.  The car swerves and lurches and the Dude, cursing, takes the wheel.   Ahh fuck it, let's go bowling.    He turns from the lane to where the Dude sits in the nook of molded plastic chairs.  The Dude listlessly holds the portable phone in his lap.  It is ringing.   Aitz chaim he, Dude.  As the ex used to say.   Huh?  Oh, him, yeah.  Well I don't see, um-- what exactly is the problem?  The portable phone stops ringing.   What the fuck're you talking about? That poor woman--that poor slut-- kidnapped herself, Dude.  You said so yourself--   That's right, Dude, 1  % certain--  Donny is trotting excitedly up.   Donny, shut the f--when do we play?   Saturday!  Well they'll have to reschedule.   I told that fuck down at the league office-- who's in charge of scheduling?   I told that kraut a fucking thousand times I don't roll on shabbas.    C'mon Dude, eventually she'll get sick of her little game and, you know, wander back--   I'm shomer shabbas.   Saturday is shabbas.  Jewish day of rest.  Means I don't work, I don't drive a car, I don't fucking ride in a car, I don't handle money, I don't turn on the oven, and I sure as shit don't fucking roll!   Shomer shabbas.  The Dude gets to his feet with the portable phone.   For Christ's sake, Dude.  Walter and Donny join the Dude as he walks out of the bowling alley.  Hell, you just tell him--well, you tell him, uh, we made the hand-off, everything went, uh, you know--   Went alright.  Dude's car got a little dinged up--   Yeah yeah, \"kill that poor woman.\"  He waves both arms as if conducting a symphony orchestra.   Kill that poor woman.   Really, Dude, you surprise me. They're not gonna kill shit.  They're not gonna do shit.  What can they do?  Fuckin' amateurs.  And meanwhile, look at the bottom line.  Who's sitting on a million fucking dollars? Am I wrong?   Who's got a fucking million fucking dollars parked in the trunk of our car out here?   And what do they got, Dude?  My dirty undies.  My fucking whites--Say, where is  the car?  The three bowlers, stopped at the edge of the lot, stare out at an empty parking space.   Where's your car, Dude?   Hmm.  Well, we were in a handicapped spot.  It, uh, it was probably towed.   Well, certainly that's a possibility, Dude--   That wasn't her toe.   How the fuck should I know?  I do know that nothing about it indicates--   Fine, Dude.  As if it's impossible to get some nail polish, apply it to someone else's toe--   You want a toe?  I can get you a toe, believe me.  There are ways, Dude.  You don't wanna know about it, believe me.   I'll  get  you  a  toe by  this afternoon--with nail  polish. These fucking amateurs.   They send us a toe, we're  supposed to  shit our- selves with fear.  Jesus Christ. My point is--   Well that's just, that's the stress talking, Dude.  So far we have what looks to me like a series of victimless crimes--    Oh, please dear!  I've got news for you: the Supreme Court has roundly rejected prior restraint!   Lady, I got buddies who died face- down in the muck so you and I could enjoy this family restaurant!   Don't run away from this, Dude! Goddamnit, this affects all of us!  The Dude has left frame; Walter calls after him:   Our basic freedoms!  He looks defiantly around.   I'm staying.  Finishing my coffee.  He stirs the coffee, bopping his head in time to the Muzak, affecting nonchalance.   Finishing my coffee.   Oh for Christ--will you shut the fuck up, Donny.   Now that is ridiculous, Dude.  No one is going to cut your dick off.   Not if I have anything to say about it.   Dude--   Now Dude--   Fucking Germans.  Nothing changes. Fucking Nazis.   Come on, Donny, they were threatening castration!   Are you gonna split hairs?   Am I wrong?   Huh?   Nihilists!  Jesus.  Walter looks haunted.  Say what you like about the tenets of National Socialism, Dude, at least it's an ethos.   And let's also not forget--let's not forget, Dude--that keeping wildlife, an amphibious rodent, for uh, domestic, you know, within the city-- that isn't legal either.   No, I'm--   --We're sympathizing here, Dude--   You gotta buck up, man, you can't go into the tournament with this negative attitude--   Fuck the tournament?!   Okay Dude.  I can see you don't want to be cheered up.  C'mon Donny, let's go get a lane.  They leave the Dude sitting morosely at the bar.  As he stares   He lives in North Hollywood on Radford, near the In-and-Out Burger--   Near the In-and-Out Burger--   Shut the fuck up, Donny.  This kid is in the ninth grade, Dude, and his father is--are you ready for this?-- Arthur Digby Sellers.   Huh?   Who the f--have you ever heard of a little show called Branded, Dude?   All but one man died?  There at Bitter Creek?   Fucking Arthur Digby Sellers wrote 156 episodes, Dude.   The bulk of the series.   Not exactly a lightweight.   And yet his son is a fucking dunce.   Yeah, go figure.  Well we'll go out there after the, uh, the.  He waves a hand vaguely toward the stage.   What have you.  We'll, uh--   Shut the fuck up, Donny.  We'll, uh, brace the kid--he'll be a pushover. We'll get that fucking money, if he hasn't spent it already.  Million fucking clams. And yes, we'll be near the, uh--some burgers, some beers, a few laughs.  Our fucking troubles are over, Dude.   Hardly Dude, a new 'vette?  The kid's still got, oh, 96 to 97 thousand, depending on the options.  Wait in the car, Donny.   Hello, Pilar?  My name is Walter Sobchak, we spoke on the phone, this is my associate Jeffrey Lebowski.   May we uh, we wanted to talk about little Larry.  May we come in?   That's him, Dude.   Thank you, ma'am.  He and the Dude sit on a sagging green sofa.  In a lowered voice, to Pilar:   Does he, uh. . . Is he still writing?   Uh-huh.   I just want to say, sir, that we're both enormous--on a personal level, Branded, especially the early episodes, has been a source of, uh, inspir---  There are footsteps on the stairs.  Larry, a fifteen-year- old, looks at the two men.   No ma'am, I didn't mean to give the impression that we're police exactly. We're hoping that it will not be necessary to call the police.  He adopts his command voice in turning to Larry:   But that is up to little Larry here. Isn't it, Larry?  Walter pops the latches on his attache case and takes out the homework, which is now in a ziploc bag.  He holds it out at arm's length, displaying it to Larry.   Is this your homework, Larry?  Larry does not respond.   Is this your homework, Larry?   Dude, please!. . .  Is this your homework, Larry?   Is this yours, Larry?  Is this your homework, Larry?   Is this your homework, Larry?   Look, Larry. . . Have you ever heard of Vietnam?   You're going to enter a world of pain, son.  We know that this is your homework.  We know you stole a car--   And the fucking money.  And we know that this is your homework, Larry.  No answer.   You're gonna KILL your FATHER, Larry!.   Ah, this is pointless.  As he shoves the homework back in the attache case:   All right, Plan B.  You might want to watch out the front window there, Larry.  He is heading for the door.  The Dude, puzzled, rises to follow him.   This is what happens when you FUCK a STRANGER in the ASS, Larry.   Fucking language problem, Dude.  He pops the Dude's trunk, flings in the briefcase and takes out a tire iron.   Maybe he'll understand this.  He is walking over to the Corvette.        Hunh?  The man looks about, wildly.   Dude?   I can't drive, Dude, it's erev shabbas.   Erev shabbas.  I can't drive.  I'm not even supposed to pick up the phone, unless it's an emergency.   I understand.  That's why I picked up the phone.   Dude, I'm not supposed to make calls--     Walter's eyes are on the road as he listens, driving, to the Dude, whose speech is occasionally punctuated by yaps from the back seat.   Well it's, sometimes the cathartic, uh.   What's your point, Dude?   Yeah?   Okay, but how does all this add up to an emergency?   I'm saying, I see what you're getting at, Dude, he kept the money, but my point is, here we are, it's shabbas, the sabbath, which I'm allowed to break only if it's a matter of life and death--   What the fuck are you talking about?   What the fuck are you talking about? I converted when I married Cynthia! Come on, Dude!   You know this!   Yeah?  What do you think happens when you get divorced?  You turn in your library card?  Get a new driver's license?  Stop being Jewish?   I'm as Jewish as fucking Tevye   Three thousand years of beautiful tradition, from Moses to Sandy Koufax--  Jesus Christ.   Jesus, Dude!  He never even kidnapped her.   Who'm I?  I'm a fucking VETERAN!    I'll tell you who I am!  I'm the guy who's gonna KICK YOUR PHONY   Look at that fucking phony, Dude! Pretending to be a fucking millionaire!   Let me tell you something else. I've seen a lot of spinals, Dude, and this guy is a fake.  A fucking goldbricker.  He is crossing to Lebowski.   This guy fucking walks.  I've never been more certain of anything in my life!   Walk, you fucking phony!  The big Lebowski waggles helplessly, his rubbery feet grazing the floor like a Raggedy Ann's.  The pomeranian gaily leaps and yaps.   It's all over, man!  We call your fucking bluff!    Sure, I'll put him down, Dude.  RAUSS!  Oh, shit.   Oh, shit.   Yeah, I can see that, Dude.   Shit, sorry man.   Shit, Dude, I didn't know.  I wouldn't've done it if I knew he was a fucking crybaby.   Shit.  He didn't look like a spinal.    Each with a beer at the scoring table.   Sure you'll see some tank battles. But fighting in desert is very different from fighting in canopy jungle.   I mean 'Nam was a foot soldier's war whereas, uh, this thing should be a fucking cakewalk.  I mean I had an M16, Jacko, not an Abrams fucking tank.  Just me and Charlie, man, eyeball to eyeball.   That's fuckin' combat.  The man in the black pyjamas, Dude.  Worthy fuckin' adversary.   Shut the fuck up, Donny.  Not a bunch of fig-eaters with towels on their heads tryin' to find reverse on a Soviet tank.  This is not a worthy--   He's cracking.   A tree of life, Dude.  To all who cling to it.  They react to the droning synthesizer-based technopop coming from a boom box.   They're nihilists, Donny, nothing to be afraid of.  The Germans stop conferring.   Fuck you.  Fuck the three of you.   There's no ransom if you don't have a fucking hostage.  That's what ransom is.  Those are the fucking rules.    Fair!  WHO'S THE FUCKING NIHILIST     They won't hurt us, Donny.  These men are cowards.   Fuck you.  The Dude is digging into his pocket.   What's mine is mine.    What's mine is mine.  With a ring of steel, Dieter produces a glinting saber.    Come and get it.   Come and get it.  Fucking nihilist.   Show me what you got.  Nihilist. Dipshit with a nine-toed woman.  In a rage, Dieter charges.    hurls his leather satchel.    twists away as Dieter reaches him; grabs Dieter's head in both hands; draws Dieter's head up to his mouth, which closes on Dieter's ear.    His jaw is still clamped on Dieter's ear.  Dieter draws his saber against Walter's side, drawing blood.  Walter doesn't react to the wound.  Growling as Dieter screams, he worries his ear, waggling his head with his jaws clamped.    still worrying the ear.  With a tearing sound his head and Dieter's separate.    draws back his fist.    We've got a man down, Dude.  With a hand pressed to his bleeding side he trots over to Donny, who lies gasping on the ground.  The Dude, also panting, rises and trots over.   No Dude.   There weren't any shots.   It's a heart attack.   Call the medics, Dude.   Hurry Dude.  I'd go but I'm pumping blood.  Might pass out.  The Dude runs into the lanes.  Walter lays a reassuring hand on Donny's shoulder.   Rest easy, good buddy, you're doing fine.  We got help choppering in.    ---  They sit side by side, forearms on knees, in a nondescript waiting area.  Walter bounces the fingertips of one hand off those of the other.  They sit.  They wait.  A tall thin man in a conservative black suit enters.  He eyes the Dude's bowling attire and sunglasses and Walter's army surplus, but doesn't make an issue of it.   Walter Sobchak.   Yeah.   Yeah.  He takes it, opens it, puts on reading glasses that sit halfway down his nose, and inspects the bill with his head pulled back for focus and cocked for concentration.  Silence. The Dude smiles at Donnelly.  Donnelly gives back a mortician's smile.  At length Walter holds the bill towards Donnelly, pointing.   What's this?   Don't need it.  We're scattering the ashes.   This is a hundred and eighty dollars.   A hundred and eighty dollars?!   Yeah, but we're--   We're scattering the fucking ashes!     I'll say a few words.  The Dude clasps his hands in front of him.  Walter clears his throat.   Donny was a good bowler, and a good man.  He was. . . He was one of us. He was a man who loved the outdoors, and bowling, and as a surfer explored the beaches of southern California from Redondo to Calabassos.  And he was an avid bowler.  And a good friend.  He died--he died as so many of his generation, before his time. In your wisdom you took him, Lord. As you took so many bright flowering young men, at Khe San and Lan Doc and Hill 364.  These young men gave their lives.  And Donny too.  Donny who. . . who loved bowling.  Walter clears his throat.   And so, Theodore--Donald--Karabotsos, in accordance with what we think your dying wishes might well have been, we commit your mortal remains to the bosom of.  Walter is peeling the plastic lid off the coffee can.   the Pacific Ocean, which you loved so well.   Goodnight, sweet prince.  The wind has blown all of the ashes into the Dude, standing just to the side of and behind Walter. The Dude stands, frozen. Finished eulogizing, Walter looks back.   Shit, I'm sorry Dude.  He starts brushing off the Dude with his hands.   Goddamn wind.  Heretofore motionless, the Dude finally explodes, slapping Walter's hands away.   Dude!  Dude, I'm sorry!  The Dude is near tears.   Dude, I'm--it was an accident!  The Dude gives Walter a furious shove.   Dude, I'm sorry--   Shit Dude, I'm sorry--   Awww, fuck it Dude.  Let's go bowling.    We watch each of them glide across the floor, release, follow through--gracefully.  We have never seen them bowl before. They are quite good.  Each wears a black armband on his bowling shirt.",
        "Sobchak": "",
        "Brandt": "How was your meeting, Mr. Lebowski?   Manolo will load it into your car for you, uh, Dude.   Well, enjoy, and perhaps we'll see you again some time, Dude.   Our guest has to be getting along, Mrs.  Lebowski.  The Dude grudgingly allows himself to be led away, still looking at the young woman.   Ha-ha-ha-ha!  Wonderful woman.  Very free-spirited.  We're all very fond of her.   Ha-ha-ha-ha-ha!  That's marvelous.  He continues to lead away the Dude, who looks back over his   We've had some terrible news.  Mr. Lebowski is in seclusion in the West Wing.     Mr. Lebowski.  Jeffrey Lebowski waves the Dude in without looking around.   Mr. Lebowski is prepared to make a generous offer to you to act as courier once we get instructions for the money.   He suspects that the culprits might be the very people who, uh, soiled your rug, and you're in a unique position to confirm or, uh, disconfirm that suspicion.   Well Dude, we just don't know.   They called about eighty minutes ago.  They want you to take the money and drive north on the 4 5.  They'll call you on the portable phone with instructions in about forty minutes. One person only or I'd go with you. They were very clear on that: one person only.  What happened to your jaw?   Here's the money, and the phone. Please, Dude, follow whatever instructions they give.   Her life is in your hands.   Mr. Lebowski asked me to repeat that: Her life is in your hands.   Her life is in your hands, Dude. And report back to us as soon as it's done.   We've been frantically trying to reach you, Dude.  Brandt sits catty-corner from the Dude; directly across from the Dude is the big Lebowski, a comforter across his knees.   This is our concern, Dude.   That had not occurred to us, Dude.   We received it this morning.  The Dude, frowning, untucks its flap, takes out some cotton wadding and unrolls it.   He can't see you, Dude.  We pull the Dude and Walter as they approach the doors to the great study.  Walter's dog follows, stiffly waving its tail.   Visiting friends of hers in Palm Springs.  Just picked up and left, never bothered to tell us.   Who's this gentleman, Dude?   You shouldn't go in there, Dude! He's very angry!  BANG--the Dude and Walter push through the double doors into--"
    },
    "imdb_rating": "8.1",
    "description": "When \"the dude\" Lebowski is mistaken for a millionaire Lebowski, two thugs urinate on his rug to coerce him into paying a debt he knows nothing about. While attempting to gain recompense for the ruined rug from his wealthy counterpart, he accepts a one-time job with high pay-off. He enlists the help of his bowling buddy, Walter, a gun-toting Jewish-convert with anger issues. Deception leads to more trouble, and it soon seems that everyone from porn empire tycoons to nihilists want something from The Dude.ahmetkozan",
    "name": "The Big Lebowski",
    "genres": [
        "Comedy",
        "Crime"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BY2YxMjQxYjctYTQyOC00MDYxLTgxYjItYTVkYTg5OTFjNmUwXkEyXkFqcGdeQXVyMjI0NTA4NzA@._V1_QL75_UY281_CR46,0,190,281_.jpg"
}