{
    "filename": "Time-Machine,-The_script.txt",
    "imdb_id": "tt0268695",
    "imdb_url": "https://www.imdb.com/title/tt0268695",
    "characters": [
        "Mrs. Watchit",
        "Robber",
        "Über-Morlock",
        "Vox",
        "Emma",
        "Flower Seller",
        "Alexander Hartdegen",
        "Fifth Avenue Carriage Driver",
        "Flower Store Worker",
        "Jogger",
        "Motorist",
        "Teacher",
        "Central Park Carriage Driver",
        "Soldier #1",
        "David Philby"
    ],
    "dialogues": {
        "Mrs.": "I can't rightly say, sir. - Several days...I hardly catch a glimpse of him lately.  He never leaves the laboratory and comes out only to nibble at his meals...but he did tell me days ago about dinner tonight and left these instructions.  Dinner is served, gentlemen! First sensible thing I've heard all evening.  There!...there...  Will you be having supper in this evening, sir? I don't think so, Mrs. Watchett.  Why don't you take the evening off and celebrate.  Thank you, sir, but if you won't be needing me I think I'll turn in early and get some sleep... ...it I can. - Goodnight, sir.  Happy New Year, sir.  I'll turn down your bed for you!  Nothing.  Nothing except three books.  I don't know. -- Is it important?  Mr. Filby, do you think he will ever return?",
        "Watchit": "",
        "Robber": "",
        "Vox": "",
        "Emma": "",
        "Flower": "",
        "Seller": "",
        "Alexander": "",
        "Hartdegen": "",
        "Jogger": "",
        "Motorist": "",
        "Teacher": "",
        "Soldier": "",
        "#1": "",
        "David": "",
        "Philby": ""
    },
    "imdb_rating": "6.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTM4YTViNGMtYTYyOS00MTViLWEyYTgtNGM0OTIwMWRmYzdhL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "Based on the classic sci-fi novel by H.G. Wells, scientist and inventor, Alexander Hartdegen, is determined to prove that time travel is possible. His determination is turned to desperation by a personal tragedy that now drives him to want to change the past. Testing his theories with a time machine of his own invention, Hartdegen is hurtled 800,000 years into the future, where he discovers that mankind has divided into the hunter - and the hunted.—Tim1370",
    "name": "The Time Machine",
    "genres": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ]
}