{
    "filename": "Postman,-The_script.txt",
    "imdb_id": "tt0119925",
    "imdb_url": "https://www.imdb.com/title/tt0119925",
    "characters": [
        "Bridge City Mayor",
        "Pineview Sheriff Briscoe",
        "Irene March",
        "Ford Lincoln Mercury",
        "Idaho",
        "Ellen March",
        "Colonel Getty",
        "Gibbs",
        "General Bethlehem",
        "The Postman",
        "Bandit 20",
        "Woody",
        "Abby",
        "Luke",
        "Old George"
    ],
    "dialogues": {
        "Irene": "",
        "March": "Did he say my name?  I'm Irene March.  Would you read it?  Please.   Someone has to.  My sister in Denver. Fifteen years ago. Thank you.  You're a Godsend. A savior.  Oh, yes, absolutely... Is there anything else?    Know what?  I have a feeling about you. I know you'll do what's right.",
        "Idaho": "All men between 15 and 50 and of suitable ethnic foundation are required to show themselves now.  Sir?  You were required to show yourself.  Take the mule.  Let's move it.     Everybody up and at 'em.  All right, girls. We're gonna run. Twenty miles. With packs. You got three hours. Everybody makes it. Or nobody eats.  Eat up!    You got meat tonight.  Why don't you tell Shakespeare what kind of meat that is.  A godawful animal. The sterile offspring of a horse and a donkey. Can you imagine that?! There's no room in this new world for a bastard like that.  Uh uh. Any man last in line ain't hungry enough. You show up last, you don't eat!  You thinking of challenging for leadership of the clan?  You see Colonel Getty? Always following the General? He's the only man who ever challenged. Fight lasted six seconds, but the General didn't kill him. He cut off his tongue and he cut off his balls and old Getty's been following him like a dog ever since.  The General don't see it, but I say you got some nigger in you.  The General would like a word with you, Shakespeare.  And the book, sir?  One of you dogs has earned himself a treat. Over there.  Those men hunted themselves a lion this morning. Must've been a zoo around here before the war. Anyhow, they shot him and he crawled into that thicket. A third man went in after him. We don't know if he's dead or alive. I need a volunteer. Someone's gotta go in and get our boy out.  I guess size ain't a measure of courage, is it? Shakespeare!    What are you waiting for, Christmas?    Good, boy.   Get him.  Finish it.      You want your St. Rose?",
        "Ellen": "Be quiet, everyone! Can't we just let this man eat?  That's not a toy, honey. That's very important. Give it back.",
        "Colonel": "",
        "Getty": "",
        "Gibbs": "They say they got a representative of the restored United States in there. They say this army is illegal. They say --  Can't tell what it is if you stand too close. The colors all kinda run together, don't they?  We captured him on the Oregon border.  Yes, sir.  Births and deaths, the weather, gossip. There's nothing here.    Not yet. General wants the message to get back.  Ready!  Aim!  Fire!  Ready!    Aim!  He's got a letter. Says The Postman sent it.  Sir?  Should we fire, sir?  In accordance with Law Eight...  ... We were outnumbered, sir.  A least a hundred. With guns.  Yes, sir...",
        "General": "",
        "Bethlehem": "What are you doing there?  I said, what are you doing?  A play? Show me. It's all right, children, show me.    Really?   But you had time for a play?  I'm taking three conscripts from each town. They will have the honor of serving in the Holnist Army until such time as I see fit. Three men. You suppose you could do that?  Acceptable.  Acceptable, Captain!  You'll need to put some meat on, but I like an impressionable mind. Acceptable.  Mongoloid.   Unacceptable.  I want pure blood. Someone like...  That man.  Welcome, gentlemen, to your new life. You have been born again as soldiers in the army of the United Clans of Holn. The strong have been sapped by the whimpering propaganda of the weak. Men, strong men, have been denied their destiny. You men have been saved from that fate. Redemption is within your grasp.  You. What did you do before you were given this opportunity?  You digged holes... Well, now you're going to fill them. And you?  Is there any question in anyone's mind that I was talking to you? Yes, you. You look like a dangerous man. Are you?  Shakespeare?  I know who Shakespeare was... 'Cry \"Havoc!\" and let slip the dogs of war.'  'We few, we happy few, we band of brothers.'  You're pretty good. You're also a fighter. I see it in your eyes.  Don't you agree? Come on, a man's got to speak his mind.  Don't you think I should be the judge of that, soldier?  Get up.   I said, get up.  Put up your fists.  Now fight.  You're right. You're not a fighter. But you will be. I'm giving you a chance at a life that means something. A life worth living.  The laws of eight, gentlemen. That is the legacy handed down to us by Nathan Holn.  These are the laws that we live by. The eight is our symbol. Each man will bear it with pride.  Only then will you be part of the clan. Sit down, gentlemen.  Law One. You will obey orders without question. I told you to sit.  I didn't specify chairs. You could've sat down on the ground.  You disobeyed a direct order.    You broke Law One.  Law Two.   Punishment shall be swift.  Law Three: Mercy is for the weak. Four: Terror will defeat reason. Five: Your allegiance is to the clan. Six: Justice can be dictated. Law Seven. Any clansman may challenge for leadership of the clan. Does any man here wish to challenge me?  On your feet!  Law Eight: There is only one penalty: Death.  You will get out of this army what you put into it. Work and you'll be fed. Fight and you'll be respected. Die and you'll be remembered. It's up to you.      (re: the book and  If he wishes to rise above mere thuggery, a military commandeer must be classically educated. Philosophy, history. Even a sense of the dramatic. Do you know what I did before the war? Do you think I was in the army? I sold copying machines. I was a salesman. The talent to lead men and devise and execute a battle plan were locked away inside me.  If Nathan Holn hadn't come along, I'd still be selling copying machines. Can you imagine the wasted life? Can you imagine the magnitude of it? But war... War gives men like me a chance.  Here... 'The prize is often left unclaimed. Have the courage to grasp it. For fortune always favors the bold.' It always inspires me. I have a design for the future. A master plan. I'll need able officers to carry it out. You have the intelligence. If your heart matches, you'll go far. We'll talk more in the weeks to come. Dismissed.  Issue the binoculars to a scout.  Burn it.  Quit moving.  I don't think so, Captain.  Come out alive and you got yourself a lion steak.  In the water. Come back without him and you and another man will die in his place.  They don't usually look at me.  Who's responsible for that?!  You.  You'll be responsible. Get him a torch.  Set that flag on fire.  Now throw it through the window of your 'post office.'     The United States doesn't exist. That flag is an abomination.  Make sure that fire doesn't go out.  Good Lord. That, gentlemen, is a first-rate piece of ass.  Tell the Sheriff I want to be introduced. She does not belong in a mudhole like this.    Do you know what system of government we have here, son? A feudal system. Like the Middle Ages. With lords and vassals. That's you and me. Those lords, they had some ideas. If a vassal got married, it was the lord's right, his right, to sleep with the bride on the wedding night.  Sorry, but I wasn't invited to the wedding. Now, you've already done me one favor, son. Don't let this be a black mark on an otherwise perfect record.  We'll be civilized about this. I want you to give me your blessing.  Can't? I'm tired of can't. We had a great nation once. Do you know what made it that way? I can! Till the weak came along. The 'I can'ts' destroyed us. But I'm going to make us strong again. I'm going to be the father of a new nation. Do you know why it will be me?  Because I can!  Didn't have to what, Sheriff?  Your people seem seditious.    You seem seditious.  What am I seeing here? I'm waiting.  What government?  Who said that?  Which way did he go? Do not make me ask again.     What?  The Romans had an expression they used to scare their children. 'Hannibal ad portas!' -- Hannibal is at the gates. Do you know who Hannibal was? Of course not. A pretty girl like you wouldn't know a thing. Colonel Getty, get some men up there and open that gate.  Make it quick.     I've got an attack to coordinate.  Do I know you?       The restored United States. Do these people really believe that shit? Who are you really?  I was at the Battle of Georgetown. I watched the White House burn to the ground. Don't try to sell me on any restored U.S...  You're funny.    Now, what are the terms?  Appreciate your offer, Postman. Problem is, you're in no position to negotiate. These people made it through the bugs and the riots and the three year winter. But they're not going to survive you.  Law six, justice can be dictated. Kill him. And kill the restored United States with him.  Get her.  Colonel Getty!       What do you think, Lieutenant?  Yes...  Well, if it isn't our old friend the U.P.S. man.  Who the hell are you?  I want the camp struck at dawn. We're moving north.    Nothing? Everything is here.    Am I the only one who sees that? Get out!  Give the people back their hope and their dreams won't be far behind.  What is it, Getty?    No.  No. Not him. No. Children. I want a man and you bring me children!    You want a war? I'll give you a war. I was born for it!  No. Let it stand. All by itself. So it can remind them what it cost them.  You think you can ride? Then today's your lucky day.    You feel it too, don't you? Didn't have to end like this, Sheriff. He knew where I'd be if he wanted to face me like a man. Instead, he's hiding like a rabbit. So much for your Postman.  Fire!       Good lord, what do we have here?  A letter?  'Bethlehem. This letter is my testimony to the fact that there is no restored United States and there is no Postal Service.' Then who the hell have we been fighting...? 'My carriers are returning home. In exchange, I'm asking you to let them be. The Postman.'  He expects me to believe this?  Then I've won.     I've won.  You were supposed to kill him.  Why doesn't that surprise me?  Bring out the one we found yesterday. They can die together.  Wait a minute... wait a minute!  Hold your fire! You don't know each other? This will never be over. It'll go on except I'll be fighting a goddamn ghost.  No goddamnit.  No, I won't fight a ghost. Tabula rasa, gentlemen. A clean slate. I want all mail carriers hunted down. I want The Postman found. I want him dealt with. Colonel, organize the scouts. He rode west?  How many?    Looks more like two hundred to me...  (donning a pair of    Reckoning, gentlemen. This is the day I've dreamed of.  They're an eager-looking bunch. Morale's a dangerous thing. Bring him up. I want this postman to see how the game is played.  God, I hope not.     My little shipping clerk.  Great men are made by other great men. Patton had Rommel. Grant had Lee. But I get you.  Are you trying to goad me into a fight?  Unfortunately, it doesn't work that way.  What?  You're not a Holnist. You're not a member of the clan. You don't have the right.  Where do I know you from?  Shakespeare. The one who didn't want to fight.  Law seven it is. This war is settled here!  I study people. I know your problem. Do you know why you can't fight?  You have nothing to fight for. You don't care about anything. You don't value anything. You don't believe in anything. That's what makes me better.  Would I had bestowed that time in the tongues that I have in fencing, dancing and bear-baiting. Oh, had I but followed the arts...",
        "The": "I don't know. And if you ask me again, I'm going to slug you.  It's been fun, hasn't it, kids? You're welcome!  Damnit, Bill, you know I need to check it first!  Better than turpentine. Tastes about the same. Your call, Bill.  You ain't picky, Bill. I like that about you.  'Running on Empty'? Tell me about it.  Hey, Bill! We got TV! 147 channels. Everything from Jesus to 'Jeopardy'.  'Like sands through the hour- glass, so are the days of our lives...' 'Michael Shields, come on down, you're the next contestant on...'The Price is Right'.' I'll take Domestic Nuclear Disasters for two hundred thousand, Alex...  We interrupt our regularly scheduled program to bring you the Second Civil War... Well, shit.  I don't want any trouble... I bet you don't either... Let's just call it a draw, okay?  Look out, Bill!  I'm rich.  I'm just passing through. I don't mean anyone any harm. Water's good.  I'm not a Holnist.  Okay?  I'm headed for a town called St. Rose. Somewhere west of Portland.  Well, I heard different.  No, it's just that it's hard to get good information.  This is all I got.    Dried peas.   Beef jerky. Cigarettes.  Sure.   There's the ladder.  It's going to take a second.    I got my stuff bolted in.      Bill!  It's true, we haven't done this in a while, but it's like riding a bicycle. Now, open your mouth.  I know the rule. It's my rule! Avoid civilization at all costs. But we gotta eat, don't we? What are you so worried about, Bill? All you gotta do is stand there. I'm the one with all the lines.  They said, 'Fear not, MacBeth, 'til Birnam Wood comes to Dunsinane'!  I said, Birnam Wood comes to Dunsinane!  Arm, arm yourselves! If the witch's words are true, there'll be no running or hiding here!  Tomorrow, and tomorrow, and the day after that. Out brief candle! Life's but a walking shadow, a poor player that struts his hour upon the stage and is heard no more. It's a tale told by a moron. Full of sound and fury, signifying nothing. But blow, wind! Come wrack! At least we'll die with the harness off our back!    Thanks.   You're very nice.  I don't think you understand how it works.  I'm glad I could help.  Good enough to get something to eat?  Well, I'd just as soon not give them anything of mine. Let's find the back door, Bill.  You don't understand...  But, I'm not with these people. I'm just passing through. I --    Kind of.  So what did you guys do with my cigarettes?  Wonderful.   What happened to your partners?  Me?  I'm just a performer. Shakespeare. Stuff like that.  He was a writer. He --  I, um, you want a line?  'To be or not to be: That is the question.'    I don't mean any disrespect, sir, but you'd be better off just letting me go. A fighter is about the last thing I am.  You'd win.  Thanks.   Did I win?  I tried to tell him...  Say what?  'Blow, wind. Come wrack. At least we'll die with the harness off our back.'  Live free or die.  That's what they're hoping for.  These were supposed to be the best years of my life.       No, sir.   I'm a follower not a leader.  No offense, General, but you seem to have read some Shakespeare yourself.  Nothing.  No.  We got to get out of here.  Escaping. You ever hear of St. Rose? It's on the coast. They say it's a paradise. They've even got electric lights.  Between the three of us, we could --  I found him.  Yeah.  Just let me go. I don't want to be part of your army.  Don't --  Come with me.  I know.  Hey.   How ya doin'?  'Jerry Ball, Pine View.'  So, arrest me. Here's a piece of good news. Jerry's decided to go to school to get his contractor's license.    Thanks for being there for me. Here's to you. I consider my taxes very well spent.  All dressed up. Nowhere to go.  Well, that's easy.  Greetings, Pine View, Oregon!  Civilian, I'm on official business. I demand entry into the town of Pine View.  I'm through talking to you, buddy boy! Now get somebody with authority to open this gate!  I'm a representative of the United States Government --  Authorized by order 417 of the restored Congress to reestablish a communication route to Idaho and lower Oregon. Now open that damn gate!  I'm your postman!  Understand that tampering with or obstructing the mail is a federal offense. Furthermore, the Bolin Act requires you to provide all mail carriers with sanctuary and nourishment. Now open that damn gate!  Is Jerry the contractor here?  Wait! I'm going to get something out of my bag.  Paul Davis!   124 Vernon Street!  Lois Kent!   14 Weymoth Lane!  Irene March!   478 River Road!  Oh, no...    I'm sure it's personal.  We're delivering the old stock piles, but I'll accept all new correspondence as well.  'Dear Irene. Sorry I haven't written. Everything's so crazy. The strange weather. The food shortages. That farmer Nathan Holn causing all that trouble. It's hard to understand. David's home from the Army. The war was over before he even got there. Thank God for that. He's still my baby no matter how big he gets. We're going to miss you for Christmas, but maybe next year. All our love. Donna.'  No.   I'm just... a postman.  I've been on the road a while. I could use a little something to eat --  Yes, there is! If there are dogs in this town, you have to leash them while I'm here!  'Stop. Oh, yes, wait a minute, Mr. Postman. Waaa-ait, Mr. Postman...'  Thanks. Didn't somebody say something about dinner?  V-eight. Eight cylinders.   That means an eight-banger.  The important thing to remember about cars is, you can't eat 'em.  Yeah.  You know, I'm pretty hungry.  His name is, uh... Richard Starkey. From Maine. He has a saying. 'Things are getting better, getting better all the time.'  Parties are over with. The individual is what counts. You vote for the best man.  Lady Di's in charge. Sixty years old and she still kicks ass.    The government's just getting started. You're on your own for at least eighteen months.  Never thought I'd hear myself say this, but I can't eat anymore.  What?    Almost fits.  I don't know if I can, I think I'm still on duty.  It's been a long time.  Is something wrong?  About six feet.  Smarter than some I guess.       Why?  Never had the bad mumps.  Is that a trick question?    I'll have to think about it.  Look, Mrs. March, you should know that...  Know that...  I got to get out of here.    You did, huh?  You have to be in the right place at the right time.  I thought you wanted to drive cars.  Could be anywhere. Anytime. Only another postman can make you a postman.  Something like that. You have to be sworn in.  The organization's kinda shaky. It might not last.  You'd meet a lot of people who don't believe in you.  It's a lonely job.  So have I, Ford. So have I.  What the hell?     Repeat after me.  Okay then.  No, no, no, I'm saying that. You just listen... By my authority you are now empowered to carry the mail. Congratulations, you're a postman.  Sure thing, Ford.  I take it you're not.  What can I do for you, Sheriff?  I'm afraid you don't understand, Sheriff. I'm a government employee. Authorized by --  This is going in my report.  Just leave it.  I said leave it.  Hello, Abby.  I guess.  How about you?     Do you have a letter?  I'll find you a pen pal. Someone with interests similar to your own. Dancing, checking for mumps.  I guess no one feels much like laughing.  Oh, well, I've been thinking about it.  Sure.   Why not?  God, you're beautiful. Sorry, I know you'd probably like to keep things more clinical. You don't even know my name.  What about those?      Thank you.  Go?... Oh yeah... I'll head west, then work my way back here in a sort of figure eight.  Times seem hard right now. But you have to believe it's getting better. Birds are migrating again. The rains are back. 'Oh beautiful for spacious skies, for amber waves of grain. For purple mountain's majesty, above the fruited plain. America...'  Is Abby around?  If I come back with some mail, you'll know!  Eugene.     Benning. Portland. Boston! Seattle. Boise... St. Rose, Paradise on the Pacific...  Maybe one thing can still be sacred. All in all, not a bad gig, huh?     Rachel Clark! Charlie Sykes! Graham Druitt!  That's it for now, folks. There'll be more once a real system is in place.  Survive? They got Broadway up and running again. There's a kid doing Andrew Lloyd Webber like you wouldn't believe.    The catch is the only currency recognized are silver American coins minted before 1964 and two dollar bills. Look for Thomas Jefferson. Of course, food is always acceptable as barter.  You don't. Negotiate a settlement. Give them extra supplies.  General, um, they've asked me to negotiate a peace treaty.  I don't think so, sir. I --     I am a United States Postman. Authorized by order 417 of the restored Congress to --  The new capital is based in Minneapolis. Inside the Hubert Humphrey Metrodome. You know, where the Vikings used to play?  They'll open the gate and give you double what they usually give. Just don't hurt anybody. This was all a misunderstanding.    Thank you.  I don't think I ever had water soup before. Maybe next time we could try it with a little sand? Dirt? Wood? A twig garnish?  You used to think I was funny.  I'm sorry.  What's that supposed to mean?  What's with you?  A mark doesn't mean I'm a --  Then, why didn't you?  You were with Bethlehem. Does that make you one of them?    Wind's come up. Getting colder too. Must be another storm --  I didn't mean for you to --  I'm hurt.  Lazy?! I got a hole in my stomach. I'm weak. The two big meals around here are grass and snow. And we're running out of grass.  Where are you going?  You're not leaving me here, are you?    Why are you in such a hurry to get out of here? I can think of worse places. And worse company to --  You can't play tic-tac-toe with yourself.  I can't help you.  That's why you should have it.  You're weird, you know that?  We walked on the moon once, Abby.  Obviously you've forgotten Tang and microwave ovens. Your face looks pretty.  Not so bruised.  How do you know it's mine and not Bethlehem's?  Abby.  What is it?   What's wrong?    Is it the baby?  What happened?  You got our stuff out.  Of course?   I don't understand.  Am I missing the point here?  Yeah...  You're really weird, you know that?  Have you ever heard of St. Rose, Abby?  He's wrong. St. Rose is out there. And I'm going to find it.  Look, I'm nobody, Abby. I'm just...  This is what I hate. Strangers. Do you say 'hi' or do you blow their head off? Do they want to share what they got or take what you have? And if they want to take, how far are you willing to go to stop them? Damn it. All right. That's far enough.  We don't want any trouble.  That's impossible.  Who told you all this?  Direct contact... I don't believe this.  You said Carrier Eighteen. That mean there's eighteen of you?  What's all this?  P.S.   Ford knows what to do.  President Starkey? Minneapolis? Ford knows what to do?  So? I'm not making the connection. What's all this then?  Why?  I don't know how long I can stay, Ford. President Starkey will send word one day and I'll have to move on. Understand?  Aw, don't do that. Hands down.  Yeah, till he sends word, right.  Two plus two equals four.  You spelled tyranny wrong.  How old are you?  Can you ride?  Why are you here?    Abby --  Ford wants me to have his trailer. Said it's the best one.  I got plenty of room here.  So much for the uniform theory.  I wish they'd stop saluting.  Just stay safe and remember. The mailman's more important than the mail.  What the hell?  For President Starkey and the First Congress of the Restored United States, I officially declare Postal Station 10... What's the name of this town?    I'm back!   And I got mail.  Thank God it wasn't a carton of cigarettes.  Got a letter for you, Sheriff.  You thought wrong.  Tell me about the baby, Abby.   I want to know.  Who do you talk to?  No. No thanks. Hey, don't let the kids see that.  What is it?  That makes five. All on Southern routes.  Tell me about the other stuff you know...  Ford, I want you to get rid of the bodies. I don't want these people blamed for what we did.      Get this mail sorted. Bring me a fresh horse. Something to eat.  And all the mail going South!  They changed the oath.  Figures. They don't think to ask who they're replacing. Or why.  You look like... Do I know you?  Well, good luck to you.  Nice kid.   Probably be dead in a week.  Where are you going?  You're grounded. Get off the horse. You know the rule.  Twenty-two's too far south.  Get off the goddamn horse.  (re: Ponytail's  Doing what?  Did I ever tell you how I got to be a postman, Abby? I don't know if you'd laugh or cry.  I'm going to stop this.  Get out of my way, Ford. All of you.  Goddamnit --  There's still time, Ford!  Why?  God damn you, Ford. Those people down there are dying because of us. Because of what we did.  My God, what have I done? We don't even know their names...  I am.  If I don't, those kids are going to keep on getting themselves killed.  What? Being a postman? It's all bullshit, Abby. All of it. I took this uniform off a skeleton to stay warm. I made up the rest to stay fed. There is no restored United States.  Weird thing is, being a Postman was almost the best thing that ever happened to me... Remember this? You left it behind that night.  I always liked to think you left it on purpose. But maybe you just forgot it.  Is this everybody?  This is everybody. Got a letter from President Starkey.  'Greetings all carriers.'    In dark days, in a weary world, you gave everything and asked for nothing. You beat back despair and replaced it with hope and for that your country can never repay you. But the price is too high. I won't see anymore of my bravest die. It is my duty to hereby disband the Postal Service of the restored United States. You are to burn your uniforms and The Postman is to return to Minneapolis at once. Thank you and that is all.  If he could've that's what he would have said.  Bethlehem. I'm taking it to him in the morning.  Mail's private. You know that.    Tell me something, Ford. How much mail can a dead postman deliver? It's over.  I can't trust you.  Whoever takes this letter probably dies for it.  I'm going to St. Rose, Abby. And I'm taking you with me. I know you don't want to hear it, but that's my child inside you. I want to see it born somewhere safe. I have a right to that, Abby. Whether you like it or not.  Thought I recognized you.  I don't give a damn what that asshole said.  The general is a fucking lunatic.  You don't own a thought in that goddamn head of yours, do you? You want to see a man?  That's a man.  You don't understand, do you? You never will until you can think for yourself and be willing to pay the price for it.  You ready?  You're a better man than Bethlehem, Luke. I've seen it.  We can't help you. We're just as lost as you are.  I don't know him. Do you?    You ever hear of a city called St. Rose?    Did you see that?  This old thing? It isn't even loaded. Where are we?  I know you.     You're famous.  We will be. Right now, we'd just appreciate some food. I got some kids behind me, too.  Three. Hey, guys, come on in! I know you're out there!  Thanks.    She's not my wife.  Let me ask you something, have you ever heard of a town with electric lights?  Yeah!  How far?  You seem like a decent man. And these seem like decent people.  And this seems like a safe place.  All of them. I'll give you the horses and my gear. Abby's special. She's strong. Probably end up running the place.  Yes.  Yeah, I guess I am. And all of a sudden, I'm not wearing the right clothes.  I'm sorry I've brought this on you.  The order was to burn all uniforms.  You know what to do then?  Yeah, tell them that, too.  Abby, do you think a lie can become the truth?  How do I stop --  Once more into the breach, dear friends, once more. Or close the wall with our dead. In peace nothing so becomes a man as modesty and humility. But when the blast of war blows in our ears, then imitate the action of the tiger.  Summon up the blood. Disguise fair nature with rage and lend the eye a terrible aspect.          We're both a couple of frauds. You know it; I know it.  You're no fucking   general. You're a copying machine   salesman. You're not even a   good painter.  Wouldn't it be great if wars could be fought just by the assholes who started them? We could settle this thing right here. You and me.  It does in your army.  I invoke law seven of the Laws of Eight! Any man may challenge for leadership of the clan!  I challenge you.  I have every right. I invoke law seven!  I challenge for leadership of the clan!  'Cry Havoc! And let slip the dogs of war.' Remember that?  I should've found a way to kill you then. But you seemed so strong.    Neither snow... Nor rain... Nor heat... Nor gloom of night... Will stay this courier from the swift completion of his appointed rounds...  It doesn't have to be this way. We don't have to kill each other. We can live together. We can --  Ford, don't...  He isn't worth it. I'm the head of the clan now! There are going to be new laws! Law one! No more killing! There's going to be peace!  Who else?   Who else has a law?  That's law two. Who else?!  How about it, Ford Lincoln Mercury? You give us law eight.    Grow like savages -- as soldiers will -- that nothing do but mediate on blood.  Somebody take a letter.  A letter...  Mail's slow.   I'll have to see about that.",
        "Postman": "I don't know. And if you ask me again, I'm going to slug you.  It's been fun, hasn't it, kids? You're welcome!  Damnit, Bill, you know I need to check it first!  Better than turpentine. Tastes about the same. Your call, Bill.  You ain't picky, Bill. I like that about you.  'Running on Empty'? Tell me about it.  Hey, Bill! We got TV! 147 channels. Everything from Jesus to 'Jeopardy'.  'Like sands through the hour- glass, so are the days of our lives...' 'Michael Shields, come on down, you're the next contestant on...'The Price is Right'.' I'll take Domestic Nuclear Disasters for two hundred thousand, Alex...  We interrupt our regularly scheduled program to bring you the Second Civil War... Well, shit.  I don't want any trouble... I bet you don't either... Let's just call it a draw, okay?  Look out, Bill!  I'm rich.  I'm just passing through. I don't mean anyone any harm. Water's good.  I'm not a Holnist.  Okay?  I'm headed for a town called St. Rose. Somewhere west of Portland.  Well, I heard different.  No, it's just that it's hard to get good information.  This is all I got.    Dried peas.   Beef jerky. Cigarettes.  Sure.   There's the ladder.  It's going to take a second.    I got my stuff bolted in.      Bill!  It's true, we haven't done this in a while, but it's like riding a bicycle. Now, open your mouth.  I know the rule. It's my rule! Avoid civilization at all costs. But we gotta eat, don't we? What are you so worried about, Bill? All you gotta do is stand there. I'm the one with all the lines.  They said, 'Fear not, MacBeth, 'til Birnam Wood comes to Dunsinane'!  I said, Birnam Wood comes to Dunsinane!  Arm, arm yourselves! If the witch's words are true, there'll be no running or hiding here!  Tomorrow, and tomorrow, and the day after that. Out brief candle! Life's but a walking shadow, a poor player that struts his hour upon the stage and is heard no more. It's a tale told by a moron. Full of sound and fury, signifying nothing. But blow, wind! Come wrack! At least we'll die with the harness off our back!    Thanks.   You're very nice.  I don't think you understand how it works.  I'm glad I could help.  Good enough to get something to eat?  Well, I'd just as soon not give them anything of mine. Let's find the back door, Bill.  You don't understand...  But, I'm not with these people. I'm just passing through. I --    Kind of.  So what did you guys do with my cigarettes?  Wonderful.   What happened to your partners?  Me?  I'm just a performer. Shakespeare. Stuff like that.  He was a writer. He --  I, um, you want a line?  'To be or not to be: That is the question.'    I don't mean any disrespect, sir, but you'd be better off just letting me go. A fighter is about the last thing I am.  You'd win.  Thanks.   Did I win?  I tried to tell him...  Say what?  'Blow, wind. Come wrack. At least we'll die with the harness off our back.'  Live free or die.  That's what they're hoping for.  These were supposed to be the best years of my life.       No, sir.   I'm a follower not a leader.  No offense, General, but you seem to have read some Shakespeare yourself.  Nothing.  No.  We got to get out of here.  Escaping. You ever hear of St. Rose? It's on the coast. They say it's a paradise. They've even got electric lights.  Between the three of us, we could --  I found him.  Yeah.  Just let me go. I don't want to be part of your army.  Don't --  Come with me.  I know.  Hey.   How ya doin'?  'Jerry Ball, Pine View.'  So, arrest me. Here's a piece of good news. Jerry's decided to go to school to get his contractor's license.    Thanks for being there for me. Here's to you. I consider my taxes very well spent.  All dressed up. Nowhere to go.  Well, that's easy.  Greetings, Pine View, Oregon!  Civilian, I'm on official business. I demand entry into the town of Pine View.  I'm through talking to you, buddy boy! Now get somebody with authority to open this gate!  I'm a representative of the United States Government --  Authorized by order 417 of the restored Congress to reestablish a communication route to Idaho and lower Oregon. Now open that damn gate!  I'm your postman!  Understand that tampering with or obstructing the mail is a federal offense. Furthermore, the Bolin Act requires you to provide all mail carriers with sanctuary and nourishment. Now open that damn gate!  Is Jerry the contractor here?  Wait! I'm going to get something out of my bag.  Paul Davis!   124 Vernon Street!  Lois Kent!   14 Weymoth Lane!  Irene March!   478 River Road!  Oh, no...    I'm sure it's personal.  We're delivering the old stock piles, but I'll accept all new correspondence as well.  'Dear Irene. Sorry I haven't written. Everything's so crazy. The strange weather. The food shortages. That farmer Nathan Holn causing all that trouble. It's hard to understand. David's home from the Army. The war was over before he even got there. Thank God for that. He's still my baby no matter how big he gets. We're going to miss you for Christmas, but maybe next year. All our love. Donna.'  No.   I'm just... a postman.  I've been on the road a while. I could use a little something to eat --  Yes, there is! If there are dogs in this town, you have to leash them while I'm here!  'Stop. Oh, yes, wait a minute, Mr. Postman. Waaa-ait, Mr. Postman...'  Thanks. Didn't somebody say something about dinner?  V-eight. Eight cylinders.   That means an eight-banger.  The important thing to remember about cars is, you can't eat 'em.  Yeah.  You know, I'm pretty hungry.  His name is, uh... Richard Starkey. From Maine. He has a saying. 'Things are getting better, getting better all the time.'  Parties are over with. The individual is what counts. You vote for the best man.  Lady Di's in charge. Sixty years old and she still kicks ass.    The government's just getting started. You're on your own for at least eighteen months.  Never thought I'd hear myself say this, but I can't eat anymore.  What?    Almost fits.  I don't know if I can, I think I'm still on duty.  It's been a long time.  Is something wrong?  About six feet.  Smarter than some I guess.       Why?  Never had the bad mumps.  Is that a trick question?    I'll have to think about it.  Look, Mrs. March, you should know that...  Know that...  I got to get out of here.    You did, huh?  You have to be in the right place at the right time.  I thought you wanted to drive cars.  Could be anywhere. Anytime. Only another postman can make you a postman.  Something like that. You have to be sworn in.  The organization's kinda shaky. It might not last.  You'd meet a lot of people who don't believe in you.  It's a lonely job.  So have I, Ford. So have I.  What the hell?     Repeat after me.    Okay then.  No, no, no, I'm saying that. You just listen... By my authority you are now empowered to carry the mail. Congratulations, you're a postman.  Sure thing, Ford.  I take it you're not.  What can I do for you, Sheriff?  I'm afraid you don't understand, Sheriff. I'm a government employee. Authorized by --  This is going in my report.  Just leave it.  I said leave it.  Hello, Abby.  I guess.  How about you?     Do you have a letter?  I'll find you a pen pal. Someone with interests similar to your own. Dancing, checking for mumps.  I guess no one feels much like laughing.  Oh, well, I've been thinking about it.  Sure.   Why not?  God, you're beautiful. Sorry, I know you'd probably like to keep things more clinical. You don't even know my name.  What about those?      Thank you.  Go?... Oh yeah... I'll head west, then work my way back here in a sort of figure eight.  Times seem hard right now. But you have to believe it's getting better. Birds are migrating again. The rains are back. 'Oh beautiful for spacious skies, for amber waves of grain. For purple mountain's majesty, above the fruited plain. America...'  Is Abby around?  If I come back with some mail, you'll know!  Eugene.     Benning. Portland. Boston! Seattle. Boise... St. Rose, Paradise on the Pacific...  Maybe one thing can still be sacred. All in all, not a bad gig, huh?  Rachel Clark! Charlie Sykes! Graham Druitt!  That's it for now, folks. There'll be more once a real system is in place.  Survive? They got Broadway up and running again. There's a kid doing Andrew Lloyd Webber like you wouldn't believe.    The catch is the only currency recognized are silver American coins minted before 1964 and two dollar bills. Look for Thomas Jefferson. Of course, food is always acceptable as barter.  You don't. Negotiate a settlement. Give them extra supplies.  General, um, they've asked me to negotiate a peace treaty.  I don't think so, sir. I --     I am a United States Postman. Authorized by order 417 of the restored Congress to --  The new capital is based in Minneapolis. Inside the Hubert Humphrey Metrodome. You know, where the Vikings used to play?  They'll open the gate and give you double what they usually give. Just don't hurt anybody. This was all a misunderstanding.       Thank you.  I don't think I ever had water soup before. Maybe next time we could try it with a little sand? Dirt? Wood? A twig garnish?  You used to think I was funny.  I'm sorry.  What's that supposed to mean?  What's with you?  A mark doesn't mean I'm a --  Then, why didn't you?  You were with Bethlehem. Does that make you one of them?    Wind's come up. Getting colder too. Must be another storm --  I didn't mean for you to --  I'm hurt.  Lazy?! I got a hole in my stomach. I'm weak. The two big meals around here are grass and snow. And we're running out of grass.  Where are you going?  You're not leaving me here, are you?    Why are you in such a hurry to get out of here? I can think of worse places. And worse company to --  You can't play tic-tac-toe with yourself.  I can't help you.  That's why you should have it.  You're weird, you know that?  We walked on the moon once, Abby.  Obviously you've forgotten Tang and microwave ovens. Your face looks pretty.  Not so bruised.  How do you know it's mine and not Bethlehem's?  Abby.  What is it?   What's wrong?    Is it the baby?  What happened?  You got our stuff out.  Of course?   I don't understand.  Am I missing the point here?  Yeah...  You're really weird, you know that?  Have you ever heard of St. Rose, Abby?  He's wrong. St. Rose is out there. And I'm going to find it.  Look, I'm nobody, Abby. I'm just...  This is what I hate. Strangers. Do you say 'hi' or do you blow their head off? Do they want to share what they got or take what you have? And if they want to take, how far are you willing to go to stop them? Damn it. All right. That's far enough.  We don't want any trouble.  That's impossible.  Who told you all this?  Direct contact... I don't believe this.  You said Carrier Eighteen. That mean there's eighteen of you?  What's all this?  P.S.   Ford knows what to do.  President Starkey? Minneapolis? Ford knows what to do?  So? I'm not making the connection. What's all this then?  Why?  I don't know how long I can stay, Ford. President Starkey will send word one day and I'll have to move on. Understand?  Aw, don't do that. Hands down.  Yeah, till he sends word, right.  Two plus two equals four.  You spelled tyranny wrong.  How old are you?  Can you ride?  Why are you here?    Abby --  Ford wants me to have his trailer. Said it's the best one.  I got plenty of room here.  So much for the uniform theory.  I wish they'd stop saluting.  Just stay safe and remember. The mailman's more important than the mail.  What the hell?  For President Starkey and the First Congress of the Restored United States, I officially declare Postal Station 10... What's the name of this town?    I'm back!   And I got mail.  Thank God it wasn't a carton of cigarettes.  Got a letter for you, Sheriff.  You thought wrong.  Tell me about the baby, Abby.   I want to know.  Who do you talk to?  No. No thanks. Hey, don't let the kids see that.  What is it?  That makes five. All on Southern routes.  Tell me about the other stuff you know...  Ford, I want you to get rid of the bodies. I don't want these people blamed for what we did.      Get this mail sorted. Bring me a fresh horse. Something to eat.  And all the mail going South!  They changed the oath.  Figures. They don't think to ask who they're replacing. Or why.  You look like... Do I know you?  Well, good luck to you.  Nice kid.   Probably be dead in a week.  Where are you going?  You're grounded. Get off the horse. You know the rule.  Twenty-two's too far south.  Get off the goddamn horse.  (re: Ponytail's  Doing what?  Did I ever tell you how I got to be a postman, Abby? I don't know if you'd laugh or cry.      I'm going to stop this.  Get out of my way, Ford. All of you.  Goddamnit --  There's still time, Ford!  Why?  God damn you, Ford. Those people down there are dying because of us. Because of what we did.    My God, what have I done? We don't even know their names...  I am.  If I don't, those kids are going to keep on getting themselves killed.  What? Being a postman? It's all bullshit, Abby. All of it. I took this uniform off a skeleton to stay warm. I made up the rest to stay fed. There is no restored United States.  Weird thing is, being a Postman was almost the best thing that ever happened to me... Remember this? You left it behind that night.  I always liked to think you left it on purpose. But maybe you just forgot it.  Is this everybody?  This is everybody. Got a letter from President Starkey.  'Greetings all carriers.'    In dark days, in a weary world, you gave everything and asked for nothing. You beat back despair and replaced it with hope and for that your country can never repay you. But the price is too high. I won't see anymore of my bravest die. It is my duty to hereby disband the Postal Service of the restored United States. You are to burn your uniforms and The Postman is to return to Minneapolis at once. Thank you and that is all.  If he could've that's what he would have said.  Bethlehem. I'm taking it to him in the morning.  Mail's private. You know that.    Tell me something, Ford. How much mail can a dead postman deliver? It's over.  I can't trust you.  Whoever takes this letter probably dies for it.  I'm going to St. Rose, Abby. And I'm taking you with me. I know you don't want to hear it, but that's my child inside you. I want to see it born somewhere safe. I have a right to that, Abby. Whether you like it or not.  Thought I recognized you.  I don't give a damn what that asshole said.  The general is a fucking lunatic.  You don't own a thought in that goddamn head of yours, do you? You want to see a man?  That's a man.  You don't understand, do you? You never will until you can think for yourself and be willing to pay the price for it.  You ready?  You're a better man than Bethlehem, Luke. I've seen it.  We can't help you. We're just as lost as you are.  I don't know him. Do you?    You ever hear of a city called St. Rose?    Did you see that?  This old thing? It isn't even loaded. Where are we?  I know you.     You're famous.  We will be. Right now, we'd just appreciate some food. I got some kids behind me, too.  Three. Hey, guys, come on in! I know you're out there!  Thanks.    She's not my wife.  Let me ask you something, have you ever heard of a town with electric lights?  Yeah!  How far?  You seem like a decent man. And these seem like decent people.  And this seems like a safe place.  All of them. I'll give you the horses and my gear. Abby's special. She's strong. Probably end up running the place.  Yes.  Yeah, I guess I am. And all of a sudden, I'm not wearing the right clothes.  I'm sorry I've brought this on you.  The order was to burn all uniforms.  You know what to do then?  Yeah, tell them that, too.     Abby, do you think a lie can become the truth?  How do I stop --  Once more into the breach, dear friends, once more. Or close the wall with our dead. In peace nothing so becomes a man as modesty and humility. But when the blast of war blows in our ears, then imitate the action of the tiger.  Summon up the blood. Disguise fair nature with rage and lend the eye a terrible aspect.             We're both a couple of frauds. You know it; I know it.  You're no fucking   general. You're a copying machine   salesman. You're not even a   good painter.  Wouldn't it be great if wars could be fought just by the assholes who started them? We could settle this thing right here. You and me.  It does in your army.  I invoke law seven of the Laws of Eight! Any man may challenge for leadership of the clan!  I challenge you.  I have every right. I invoke law seven!  I challenge for leadership of the clan!  'Cry Havoc! And let slip the dogs of war.' Remember that?  I should've found a way to kill you then. But you seemed so strong.    Neither snow... Nor rain... Nor heat... Nor gloom of night... Will stay this courier from the swift completion of his appointed rounds...  It doesn't have to be this way. We don't have to kill each other. We can live together. We can --  Ford, don't...  He isn't worth it. I'm the head of the clan now! There are going to be new laws! Law one! No more killing! There's going to be peace!  Who else?   Who else has a law?  That's law two. Who else?!  How about it, Ford Lincoln Mercury? You give us law eight.    Grow like savages -- as soldiers will -- that nothing do but mediate on blood.  Somebody take a letter.  A letter...  Mail's slow.   I'll have to see about that.",
        "Bandit": "Portland's under twenty feet of water.  You mouthin' me?  He is mouthin' you; I say we kill him.  Don't be in such a rush, Martin. Now I see a pack mule over there, but I don't see no packs.  Oh... Kill him, Martin.  What do you got in there?  Shut up. What do you got in there?  Cigarettes!  Maybe he's got it booby-trapped.  You go up and get it.  Just you start tossing those cigarettes down!     Maybe he fell asleep.     Put some buckshot through it, Martin. Just to hurry him up.  I only got three shells left.  So use his gun.  We're rich!  Hi.  Well... I mean, we know each other, kind of...    We traded them for a woman.  They traded me to the Holnists.  I'll die before I'm last in line again.  Serious?   This isn't bad.  What happened?  What did he say?  Did he say anything about me?  What are you talking about?  We can't.  No, no. I can't. I like it here. I like being a part of something.  I'll go.    My army.   I like the sound of that.  I got him!   Over --",
        "20": "What do you got in there?  Maybe he's got it booby-trapped.  Maybe he fell asleep.  We're rich!  Hi.  Well... I mean, we know each other, kind of...    We traded them for a woman.  They traded me to the Holnists.  I'll die before I'm last in line again.  Serious?   This isn't bad.  What happened?  What did he say?  Did he say anything about me?  What are you talking about?  We can't.  No, no. I can't. I like it here. I like being a part of something.  I'll go.        My army.   I like the sound of that.  I got him!   Over --",
        "Woody": "Say it again.  The words you said in town. About the wind blowing. And the rest... Say it again.  What's it mean?  They sent me to kill you.  It's you or me.  No harness on my back.",
        "Abby": "Would you like to dance?  All you got to do is hold on.  How tall are you?  Are you smart?  Just wondering. Did you ever have the bad mumps?  Have you ever had herpes or syphilis or anything like that?  So as far as you know, you have good semen?  I don't mean to be nosy. I'm only asking because I want you to make me pregnant.  This is my husband.    Michael.  We've been trying to have a baby for three years. We can't on account of Michael had the bad mumps when he was twelve. So we need a body father. We could ask a man here, but it could cause trouble. I've seen it happen. Things go okay until the woman starts to show. Then it can be bad. But you'll only be around once in awhile with the mail.  He hasn't said 'no'.  You'll be leaving tomorrow?    I don't have anybody to write to.  You're funny. Hardly anyone's funny around here.  Have you decided yet?  I don't want to.  It would be easier for me if you closed your eyes.  What are you looking at?       Michael!              We can't stop now. They'll be coming after us.     Don't move.  You're right.  They killed Michael.  How sorry are you?  You got the mark of eight on you.  You're a liar.     I should've let you die.  Anything else?  Your legs are going to rot off if you don't try to walk.  You're lazy.  This is the last of it.  I'm going to check the pass.  Help!  I told you that's all there was.  I knew you could walk.  So?    What good is that now?  Look, there's something you'd better know. You're going to find out soon enough. I'm pregnant. It's Michael's baby. You're just the body father.  He tried with me almost every night. He couldn't do it. So he beat me. Said it was my fault.  The pass is clear. It's time to go.  Of course.  I set the fire.  You didn't think we'd stay here forever, did you? I'd appreciate if you'd walk with me long enough to find someplace safe for the baby. Then we can split up. You shaved.  It looks nice.  I've heard people talk. I've heard lots of names. Bliss. Hesperia. New Eden. Sheriff Briscoe says it's a fantasy.  But you're The Postman.  What are you?  No, tell us.  Yes?  I'm on the other side of town.  Ford's idea.    You can't keep doing this.  Riding all the routes.   You're not saving anyone.  Ford thinks you're going to do something.  Ford doesn't know what it means to be a kid. He doesn't have your memories. None of them do. All they've got is the lousy world we gave them. And this is the only decent thing in it.  I knew it was something like that.  I remember...  Yes.        There used to be a postman for every street in America. They wore uniforms. And hats. Like this one...  My postman knew the name of every kid on my street. He knew our birthdays. He'd even find the baseballs you'd hit down the street. I can still see the smile on his face. The tip of his cap -- when he had a letter in his bag with my name on it. Mine always came just after school. You could set your watch by him. Unless you were waiting on something special -- like a present from somewhere far away or a letter from your sweetheart. Then it seemed like he'd never come. I used to think they could make time stand still.  I don't think we ever really understood what they meant to us until they were gone. Getting a letter made you feel like you were part of something bigger than yourself. No place was ever too far away for the postman. So nobody ever had to be alone. The postman was someone you could count on. Things just made more sense when they were around. That's the kind of world we used to have. A world a lot of us took for granted. And now we've got this one. And it makes me wonder -- what kind of world do I want my child to live in? I want my child to live in a world where hopes and dreams aren't just lies you tell yourself to get through another day. I want my child, and I want my friends -- I want all of us to live in a world where you still get your mail.     This is hard for me. Michael was the best man I ever knew. I never thought there'd be another man I could love the way I loved him. I don't know why I've been so blessed. And I've tried to find a way to be thankful, but I swear, if I lose you...  I don't know, but I believe in you. You have a gift, Postman.     I saw it back in Pine View.  You made Mrs. March feel like she could see again. You made Ford feel like he was part of the world. You give out hope like it was candy in your pocket.  When you come back, we'll be waiting here for you. So you can take us to St. Rose.     Your daddy wrote to tell you that he'll be here as soon as he can. And that he loves you very much.  Your daughter.     Her name is Hope.",
        "Luke": "Sir? It'd be an honor if I could shake your hand.  Sir?  No, sir.  General Bethlehem said... ... You should be on your knees when I do it.  The general is a great man.  It's true, sir. I was there. He disbanded the carriers and rode west.  I couldn't get close enough. This one's his second in command.  Four.    No more tattoos.",
        "Old": "Why are you stopping?  He alive?  Bring him out.  It's right around the corner.  What you're looking for.  If you'd had a bullet, you'd a used it by now.  Seventy-five, sir.  Nope. Can't walk too good, either.  I know stuff.  1970. A girl with eyes as big as saucers did me in a little town called Saigon.     Not a soul in seven years of trying. But I will.  Go ahead. Take a look. Want some?  I was an aerospace engineer. I helped design the Galileo space station. I dream it's orbiting Earth forever. With a dozen human skeletons all grinning at each other. Laughing at us down here.     The post office, General?  Steady, boys, steady.  Get on with it, you floppy-eared sonuvabitch!  Law six. Mercy is, it's okay sometimes!  That was me.",
        "George": "Seventy-five, sir.  Nope. Can't walk too good, either.  I know stuff.  1970. A girl with eyes as big as saucers did me in a little town called Saigon.     Not a soul in seven years of trying. But I will.  Go ahead. Take a look. Want some?  I was an aerospace engineer. I helped design the Galileo space station. I dream it's orbiting Earth forever. With a dozen human skeletons all grinning at each other. Laughing at us down here.     Steady, boys, steady.  Get on with it, you floppy-eared sonuvabitch!"
    },
    "imdb_rating": "6.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNTAyYTFmYmUtNTFhZS00NGQxLWI0OGEtZDM2NDk1OGE4YzFmL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "2013,Post-Apocalyptic America. An unnamed wanderer retrieves a Postman's uniform and undelivered bag of mail. He decides to pose as a postman and deliver the mail to a nearby town, bluffing that the United States government has been reinstated and tricking the town into feeding him. However, he reluctantly becomes a symbol of hope to the townspeople there who begin to remember the world that once was and giving them the courage to stand up to a tyrannical warlord and his army.",
    "name": "The Postman",
    "genres": [
        "Action",
        "Adventure",
        "Drama"
    ]
}