{
    "filename": "Godfather-Part-III,-The_script.txt",
    "imdb_id": "tt0099674",
    "imdb_url": "https://www.imdb.com/title/tt0099674",
    "characters": [
        "Don Michael Corleone",
        "Anthony Vito Corleone",
        "Grace Hamilton",
        "Mary Corleone",
        "Kay Adams Michelson",
        "Archbishop Gilday",
        "Cardinal Lamberto",
        "B.J. Harrison",
        "Joey Zasa",
        "Dominic Abbandando",
        "Don Altobello",
        "Frederick Keinszig",
        "Connie Corleone Rizzi",
        "Al Neri",
        "Vincent Mancini"
    ],
    "dialogues": {
        "Grace": "",
        "Hamilton": "",
        "Mary": "Will. Daddy be at the airport?",
        "Corleone": "Gathered in Don Corleone's old cotter office are Santino, Tom Hagen, Rocco Lampone and Umberto Croce. Tony and Frankie enter.",
        "Archbishop": "",
        "Gilday": "",
        "Cardinal": "",
        "Lamberto": "",
        "B.J.": "",
        "Harrison": "",
        "Joey": "",
        "Zasa": "",
        "Dominic": "",
        "Abbandando": "",
        "Don": "Gathered in Don Corleone's old cotter office are Santino, Tom Hagen, Rocco Lampone and Umberto Croce. Tony and Frankie enter.",
        "Altobello": "",
        "Frederick": "",
        "Keinszig": "",
        "Al": "This is a. preliminary interview, not binding on either party. The next step, if it's agreed to take that step, would be a session with the Assessment and Evaluation sec- tion. Psychological testing. Biographical data. Ends with a polygraph test.  time you would be sent to our fac- ility at Camp Peary for a special training program -- Tony and Pal.mateer enter the office at the far- end of the hall. iT. MOREECUSE'S OFFICE - DAY It is a reasonably large office as befits one of the top echelon CIA men. Morehouse, himself, sits at a large desk. The seal of the Agency is an the wall behind him, flanked by the National flag and the Agency flag, an standards. We are close on Thomas Morehouse, about fifty-five, an imposing, silver-haired mar.. He locks up from a dossier he's been studying, then:  Just that there was an assignment we thought he'd be suited for. MOREHOQSr. All right. We've been authorized and funded to carry out a too priority covert operation in Latin America. Captain Palmateer w lZ be Field Coordinator. Your job wou.l.d be s.iasor.. There is a beat, then:  Tony and Stu Palszateer are in sweat clothes, playing a hard, ma-mercy game Of handball. ?almateer is close as he hits the ball:  You've got friends in high places, chino(. As Tony puts one away: PAI.6VxT..,ER Shot..    Obviously. However, the convulsions that my Countz went through four years ago last February were not so much a revolution as they were a -- I am thinking of the labors of I Herculi.o --- in the stable  Exactly. Muchas gracias. My Country was befouled by the corruption of its leaders and their exploitation at the people. A hard cleansing was needed and sometimes that is painful -- but the pain is over and now Z am 0 hoping. that qty little Cc=try and your great Yaticn can once again be  Devito?     A couple of things for you to sign 6 before you go operational. This is for your piece -- And this is your resignation. It's a technicality, but in case the shit ever really hits the fan, we'd have p to disclaim you. It's called the principal of plaus- ible denial. We never invoke it until the cock crows thrice. As Tony is signing the papers, Palmateer has produced a service automatic from a canvas carryi+:g case. He puts it on the table before Tony ---  You stationed in Washington?  Believe this is mine.  as an Admiral and his wife come out toward the drive- way with their guests. All are chuckling merrily at  something the old sea dog has said. Now his wife's expression alters as she looks of.  Charles: Isn't that our car? He looks off. His expression changes. He starts to run.. ANOTHER ANGLEZ=n=Y CENTER DRIVEWAY As Tony drives off, the Admiral runs vainly after his car, waving his hand..  Stop: Stop!             That's what I want you to find out. As Santino turns and goes, we ---  But make no mistake, any of you -- you of the North American delega- tion in particular. We welcome you to our Count=y -- but the days of exploitation are over.          The blood of our martyrs is still too fresh on our pavement. We will be friends and neighbors, but never again slaves to Imperialism. A young Latino, and we will recognize him as Ar=igo, has moved to Tony's side. As the cheers have erupted once more, Amigo, with'a brief nod of the head, indic- ates that Tony shouldfol:ow him.  She staffs the money in the pocket of the overcoat and exits. Roberto looks at A..-.rigo who nods and follows her out. Vow Roberto looks back at Tony.  The celebration on Vidal's Capitol is still in progress in this small city park. Suddenly, a police truck appears in one of the streets, blocking it, and a fly- ing squad of armed police piles out of the canvas- covered rear and. The Sergente blows his whistle.     Scmething wrong?  What's the problem?  Yes.  I If yon think the mission's compro- mised, we'll abort.     As Borracho, Pepe and Fararon rjn into the great central hall, wit:-1 its cu gyring S--a.=Case, and great crystal chan_delie= 84,  As Bcrracho Fararon and Pepe are rune og down an upstairs hallway, throwing open doors, a Soldier appears, fires, 3orracho spins and falls.  Jorge, Roberto and Tony are running along an alley in the darkness, bent over. One street away, in the town square, apparently all hell is breaking loose. As they run:  of various Police cars as they get the message. Some swing around in Q-turns, Their sirens are winding up to a howl.  Armando Vidal, his face a harsh mask, stands in the shattered doorway of the Presidential palace looking off toward-the central Square..  The cetinter-revolution has failed. The. people once more did not -rise up as expected.  In the. battle-torn square, outside the jailhouse, we see an angry croard of Rioters care ing the dead and bloody body of Roberto Barcenas.     Good.  Ten kinds of blue hell are breaking loose out here. Are you all right at that number till tomorrow?  Then I' 11 get back to you. Click, as Palmateer hangs up. Tony t.irns to Elizabeth.  A truck is blocking the alley. A big, cheerful-Looking Laborer with a ;knit cap on his head, is sitting on a h T e Eli cusine pu e l ls ap be fer hi ? n d e 1 s the 2 trac /+ k, s c y/?Yy?? toys a :'+t^i /? i a  Well, yes, Sir. His resignation did  Take your seats, please. Sergeant at Arms' Will. you see that every- an takes his seat? We pan over to the door as Tony enters and finds a seat.  And.'what light can you throw on this matter, Mister Davideau?  Gentlemen: Gentlemen!     I don't have a lot of time, Tony.  So they tell me.",
        "Neri": "It isn't like you won't be back from time to time.  You still want to catch that shuttle to New York?     Give him a _-- Suddenly veri breaks cg!, sensing something wrong. The other Puerto Ricans are surrounding the limousine. As Neri dives for the door of the car ---  He goes down to his knees, tries to raise his grin for one last shot. A Puerto Rican grins and putting his gun. an inch from Neri's face, pulls thetrigger.",
        "Vincent": "",
        "Mancini": ""
    },
    "imdb_rating": "7.6",
    "description": "In the final installment of the Godfather Trilogy, an aging Don Michael Corleone seeks to legitimize his crime family's interests and remove himself from the violent underworld but is kept back by the ambitions of the young. While he attempts to link the Corleone's finances with the Vatican, Michael must deal with the machinations of a hungrier gangster seeking to upset the existing Mafioso order and a young protege's love affair with his daughter.—ahmetkozan",
    "name": "The Godfather Part III",
    "genres": [
        "Crime",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMWUyMmJhMzUtZTFmYi00OTlmLWJjZGQtNDM5MDBjOTk3ZWNhXkEyXkFqcGdeQXVyMjI0NTA4NzA@._V1_QL75_UY281_CR46,0,190,281_.jpg"
}