{
    "filename": "The-Rage-Carrie-2_script.txt",
    "imdb_id": "tt0144814",
    "imdb_url": "https://www.imdb.com/title/tt0144814",
    "characters": [
        "Barbara Lang",
        "Monica",
        "Mark",
        "Jesse Ryan",
        "Sue Snell",
        "Eric",
        "Chuck (as Elijah Craig)",
        "Rachel Lang",
        "Brad Winters",
        "Lisa",
        "Tracy",
        "Arnie",
        "Boyd",
        "Eric's Father",
        "Sheriff Kelton"
    ],
    "dialogues": {
        "Barbara": "Yes, baby, I really am feeling so much better. I feel so good on the inside, I must be glowing on the outside.  Lord, you come all the way out here, we can't keep talking about me. How are you? I wane to hear every little thing I'm missing. 19. RACHEL takes a deep breath, working extra hard to seem happy and well adjusted today.  The Wallaces sure are a nice family.  What's wrong?  Oh, honey, those.crepes weren't nothing but watered down pancakes.  Come here baby. She gives her daughter a big hug.  Now you listen to me, the doctors say I'm doing well. You know what that means? That means someday, soon, you and I are gonna be eating crepes for breakfast, lunch and dinner. For the first time, RACHEL's smile is genuine.   Oh, I look at you, remembering what you were like at five, at ten...  All I need is a little Loving Care for these grey hairs and we'll make up for all the time we've lost. ooks at a wall clock 20.  Now you get going before you're late for work.   Well, first, I thought I saw the devil in your eyes. Then I started to see people's faces looking... deformed, like they'd had plastic surgery, or the bones were moving under their skin. For a while, I thought I had this bi snake wrapped around my neck, and I couldn't'talk, or it would try to go down my mouth. sits, thinking. BARBARA looks at her in confusion for a long beat.  There is something different about you. Baby, are you all right? Yeah. Yes. Everything's fine. Everything's gonna be all right.  Thank you for the chocolates. Thoughtful of you.  Why would she need to? Hrs. Lang, I need to know who he was.  sorry, that's private. 60.  I really don't see how that's any of your business.     You don't have children, do you, miss?  Then you don't kzgx. You will never ever know, how terrifying children can be. SUE, frustrated, it's like punching water with this wo     No, this couldn't be it. Rachel said it was a real nice house, surrounded by trees, with a pool in the back.  Oh, not Rachel! They race to the door as...  No, this isn't happening. It isn't happening, isn't happening... MARK pulls ERIC by the shirt collar and they careen down...  Rachel! A weakened RACHEL lays by the pool. She seems to be snapping out of her trance as she rolls over and sees BARBARA. RACHEL shudders and suddenly just looks like a wet, scared little girl reaching for her mother.  What are you? You're not my little girl. No. The devil's in you.",
        "Lang": "",
        "Monica": "Look at Jesse, talking to a burnout. TRACY turns, slips on a stylish pair of DKNY glasses.  Come on Trace, you're caviar, she's cheeze whiz. He'll come around. He's just letting little Jesse do the thinking for big Jesse. BACK TO -- A pissed-off JESSE.  Disrespected?  Finally, she's going into the mall.  Oh, hi. Karen, this is a friend of mine from school. The SALESWOMAN nods, moves away.  She does Step Class with my mom. You should see the scars from her liposuction. RACHEL edges way, checking out the lipsticks, but MONICA trails her. 76.  What are you looking for?  Is it perhaps, something to wear on a date? Perhaps with a certain jock- hunk we all know?  You know, Tracy isn't universally loved.  Exhibit A. I think she's a Melrose Place superbitch. RACHEL cracks a hint of a smile.  You have great lips. No, really. Look, this shade would look very kissable on you. Soft. MONICA goes to apply the lipstick on her. RACHEL pulls away.  Trust me. See, Tracy tried to steal Brad from me. Now hold still. And RACHEL does.  So, he invite you to the game? Just nod. RACHEL nods.  Well, there's a big party after. I hope you can go. I know it would mean a lot to Jesse if we all got along. 77.  Good. See? Checking in a mirror, RACHEL sees she's right.  Here, these two would also rock on you. The SALESWOMAN reappears.  Maybe next time. Bye. She pulls RACHEL away. As they walk the SALESWOMAN keeps looking at RACHEL with distaste.   Here, I kleptoed it for you. She slips RACHEL the lipstick.  Rachel, Rach, over here. Hey. Grab a seat. Looking around, RACHEL sees she's surrounded by Patio People.  Oh, please, you're.not gonna sit by your lonesome. There's plenty of room, if Amy;here slides her bubble butt.  No, no, it's an extra point when you score the kick after the touchdown. A safety is when you get tackled with the ball in your own end zone.  Okay, listen. Here's what Brad told me to say, doesn't matter if something good or bad happens, just say \"You. gotta be fuckin' kiddin' mel\" No matter what, just say that. It'll sound like you know what's going on.   You gotta be fuckin' kiddie' me! They turn to each other, burst into laughter. MONTAGE -- of the punishing game. Epic warfare with grunting, spitting and cursing as LINEMAN butt heads and. -- A CARLIN RUNNING BACK steamrolls through the BULLDOGS for a touchdown. -- RACHEL, MONICA and AMY do their You gotta be fuckin' kiddin' me routine. JESSE catches a pass, and is immediately slammed hard  Amy, Rachel's worried about Jesse.        C'mon, I'll give you a ride to Mark's.  Sure, Arnie, wait here. I'll come back for ya.. . And she waltzes past him.  . in two or three years. ARNIE points at a passing RACHEL.   To new friends. They raise their glasses and RACHEL joins in with a hesitant smile. Their glasses clink together for the...  Check out the tattoo on her arm wild huh?  I'm dying to get one, but my mom would have a shit fit.  A slut.  That's why you should take all of us in for tattoos! AMY and the other GIRLS laugh. RACHEL softens, joining in. She looks around at everyone at the party, laughing, dancing. The shiny, happy people. it feels weird, but here she is. She smiles, takes a sip of her drink. By the stereo, MARK cranks up the music as CHUCK dances over to AMY, pulls her into the dancing CROWD. BRAD grabs MONICA.  Oh, c'mon, Rachel. He'd want you to have fun.  All right, girl. RACHEL smiles. BRAD starts dancing before RACHEL. SLOW MOTION -- CLOSE on RACHEL's face, dancing, beaming. For a few moments, everything seems perfect. And she throws her head back and laughs. MARK dances into the group.     Look at her face, this is priceless. At the front door, JESSE walks in, TRACY behind him. He looks around, hasn't seen what's going on yet. ERIC intercepts him, turning JESSE away from the TV.  Here comes Jesse's big play!  Rachel! Rachel! Drowning out JESSE's cries. RACHEL's P.Q.V. -- spinning around. A NIGHTMARISH GALLERY of dancing, jostling torsos, TWISTED FACES and LAUGHING MOUTHS, smirking and pointing at her.",
        "Mark": "She was having a bad hairday. A group of PATIO GIRLS sit at another table. Among them is MONICA, a stunning brunette, AMY a cute redhead and TRACY, an icy BLONDE who could spend all day checking her makeup. JESSE looks over. TRACY graces him with a smile and turns away. MARK leans in to JESSE.  Hey, Jess. Tracy, she wants you, man. Jump her bones.  So what? You want her to want you cause of your dazzling personality? Look, you want someone to talk to, you got us. H, you screw.  When you wake up in the morning, and she's sleeping on your arm, and the only way to get up is to wake her. So you gnaw your arm off instead. BRAD snorts a laugh. A goatee'd ENGLISH TEACHER nods to both camps as he passes.  Backfield in motion. PULL BACK TO -- Pub decor with football paraphernalia everywhere; Bulldog lamps and paw prints painted on the floor. The bar's packed with local BUSINESSMEN. JESSE, MARK and the other BULLDOGS are in a corner booth. A.middle-aged, bearded WAILER with half his face bur -SS-arred approaches.  Hey, Al, we'll have three 1ï¿½.rge pepperoni pies and two pitchers of beer.  Yo, Jes$, I think Tracy's following you. He pulls out the black NOTEBOOK. ERIC eyes it, gets very nervous.  Now then, according to the scoreboard Jess, you'd have to bag every girl here to catch up. You need the points. I'll give ya ten for Tracy.  And she freaked and took a header.  No one knows 'bout you and her.  Shit. Okay. I'll handle it.  Eric, relax, its me, Mark. I'll handle it. The WAITER sets a pitcher of soda and cups on the table. AT THE BAR -- MR. STARK, a rotund lawyer in his 40's, takes a pitcher of beer from the BARTENDER.  Absolutely. We're gonna crush Carlin Friday and make it seven years in a'row.   It's good to be king.  So, Rachel, there were some pictures Lisa took. They have, what you might call sentimental value. She just stares at him. MARK pulls a twenty from his wallet.  Twenty bucks cover it?  What do you mean? I'll go thirty.  Well it's not like she's gonna be picking them up, is it? RACHEL turns away. JESSE glares at MARK.   Rachel, why don't I come by when you get off and, you know, take you for a ride? JESSE cocks an ear for her reply, but she doesn't answer.  C'mon, I don't bite... not unless you want me to.  Why not?  Let's go, Jess. The car pulls away, MARK glances in the REARVIEW MIRROR at RACHEL, framed like a target.   Bitch. I'll show you funny. ON RACHEL -- watching them go. Seconds later, a SHERIFF'S CRUISER pulls up. 26.  He shoots, he scores. ON TRACY -- in the front seat, using the rearview to adjust her makeup, pleased with what she sees. She glances at JESSE as he re-enters on the driver's side.  Bitch wouldn't give it to me. Stay frosty, no one else knows anything. It's still at the photomat, I'll get it.  Not me. I love it. MARK pops up, grabs a steak, rips off a bite, and runs full tilt at the, blocking tackle, smashing into it with meaning.  What happened?  Relax, that's bullshit. Your dad's a lawyer, he'll kill that talk dead.  What about Carlin?  I tried. That Rachel bitch wouldn't give'em to me..     who is Wig?  Ding, ding, ding. Wrgnq, guess again.   You. The JIGGLING and the TAPPING starts up again, loud. The BOYS VOICES are heard outside chanting...  Rachel, come out and play now. RACHEL grabs a knife from the kitchen, backs into...  Don't go tellin' stories about my Eric. Click and the line goes dead. She hangs up. The PHONE RINGS again. She doesn't answer.  Brad, how many points he gonna get for straightening a dyke?  What's with him?  Jess, what's the matter?  What? Papering McCabe's house? I asked you if you--  what? We were just sendin' her a message. JESSE slams his locker closed.  Look, man. She's getting Eric in all kinds a shit. I mean, if he gets charged with rape, there goes any  What are you getting bent for? She's just a burnout, a slut-- BANG as JESSE shoves MARK against a locker. MARK shoves him back. The rest of the PLAYERS in the background go quiet.  What's wrong with you?  Get to the bad part.  What are you talking about? We're friends, we're all friends.  Let's nail the bitch. Plan a way to screw her like she's screwing us. .TRACY, a wicked smile as she nods. 68.  Hey.  Just wanted to say two things. I'm sorry. Maybe I overreacted.  I'm not. We've been friends since we could both pee standing up. And I thought we'd be best friends forever. Never thought some girl could come between that. Look, I know I'm scum. I'm lower than scum, I'm smegma, I'm butt lint. 72.  I'm sorry.  You're right. I'll come up with a way to make it up, to b of you.  tryin', brother, I'm tryin'.  Hey, man, I got it. This girl, this Rachel, is special to you, huh?  The cabin. My folks aren't there. Get away from all of us idiots. Go have a romantic time. JESSE looks at him. MARK tosses the key, JESSE catches it. MARK smiles.  And bring her to my party. I'll show you we can be one big, happy family.  C'mon, Jess, you're up. JESSE stares in horror at how identical they all look now. Then he starts to... giggle, then breaks into laughter, turns and walks away.  An upper-class home built in the international style of fieldstone and gray-stained wood. The house is set back from the road, surrounded by trees, with a pool in the back. A herd of parked cars and throbbing music indicate MARK's party is at full tilt.           Hey, Chuckzilla, why don't you put on the highlights tape?  Yeah, tonight's game.  No, it's the other game. Still dancing, she turns back to the group. 93.  The game you were in. The others laugh. She smiles, confused.  Yeah, yeah, what was the score? Chuckie, pass me the scoreboard, I wanna show Rachel how she helped Jesse win the game. CHUCK pulls the BLACK NOTEBOOK next to the CD's off a shelf, pretends he's a quarterback hiking a ball. Twenty-four, twenty-six, hut, hut, hut. He drops back to pass the NOTEBOOK.  Rachel, catch! He throws the NOTEBOOK through the air, where it tumbles end over end for a few slow beats, then is caught by her. 94.  Open it. Go 'head, read off the scores.  What's Eric's score?  What's up, Rach? You know someone on that list?  Oh, yeah, Lisa, forgot about her.  Rach, look under Jesses's name, how many points you get?  No, more than that, remember, we thought Rach was a dyke. He got extra-points for the conversion.  See, we didn't think Jess could do i so he offered to get evidence, proof that he'd scored you.  Lookie, lookie, Rachel. RACHEL realizes people are watching something behind her, then laughing at her. She turns and sees... The IMAGES of her and JESSE on the TV. Her face goes slack with horror.  Jess was disappointed with the picture quality, but I told him it was better than Pam and Tommy Lee's tape.  Why don't we ask Jesse? He turns and calls out.  Hey, Jesse! Over here! JESSE looks over and his eyes meet RACHEL's, but she just stares back, horrified. Then he sees the TV set behind her  Rachel! Rachel! She tries to get away, but BRAD pushes her into MONICA who shoves her to AMY as they join in the chanting. Rachel!  What the fuck? ON JESSE -- as he screams again. A CORKSCREW has pierced his other hand, at waist level. The SCREW spins around, burrowing into his flesh. 99. Everyone on that side of the room stops dead, taking in the bizarre sight. RACHEL straightens up and... The kitchen door CLOSES... The glass doors to the back yard slide SHUT... The front door SLAMS.     God, it'ls her! She's doing it! SUE moves towards RACHEL.  lowers his shoulder, crashes through a closing door into.  Wait till she's closer. TRACY tightens her finger on the trigger. RACHEL's eyes narrow and... TRACY's glasses shatter into her eyes, spewing blood milky fluid. Aaaaa... She staggers, fires her shotgun into ERIC's groin and he lands sitting next to the pool. A dying ERIC stares at his shredded lap, then falls over. MARK looks at his dead friend. Oh, shit. .recovers, and swings his aim back at RACHEL. But his rifle goes sailing over his head and into the grass twenty feet behind him. He makes eye-contact with a grim RACHEL advancing toward him, and hauls ass. RACHEL glances at a coiled GARDEN HOSE and it springs to life, slithering through the grass and across the concrete at high speed to wrap around MARK's ankle and trip him up. He hits the ground hard and rolls over to find the hose twisting around his legs and up his waist like a python.",
        "Jesse": "Yeah, whatever.  I don't know, you ever have a conversation with her? It's like talking down a well. She only wants me cause I'm on the football team.  That's harsh, man, keep it down.  Well, then Romeo and Juliet isn't a tragedy, because the only way they could really be together was in death.  All right, all right. ERIC leans over to MARK, urgently whispers, and the two of them move to... 22.  Sorry, didn't scare you, did I? RACHEL turns, slides LISA's PICTURES into an envelope. MARK checks her out, likes what.he sees, nudges JESSE.  You're... Rachel, right? She nods, surprised he knows she's alive, much less knows her name.  I'm Jesse.  Hey, cool. it.  The backseat. JESSE's on top of TRACY. He pulls away from her. She pulls her top down, sits up.  I'm sorry, it's not you. its me.  Nobody.  Oh. Nothing. 27.  Doesn't it bother you that a girl offed herself today?  What?     Damn. What... damn. RACHEL staggers up to him, holding a shivering mass of fur.  Oh, my god.  JESSE driving. RACHEL sits next to him, hugging the dog.  Everything's gonna be all right. His voice is not entirely convincing. 30. Through the spidered windshield: The car's headlights pierce the night.  Let's go. Best thing's to let her do her work. JESSE gently guides RACHEL away, who keeps looking back at her dog.  Your dog's gonna be okay. She nods, unconvinced.  God, I almost roadkilled you. Are you sure you're all right? She nods. They hear a muffled, \"pmt\", from the VET in the examining room. JESSE tries to take RACHEL's mind off it.  That tattoo on your arm, its pretty. Hurt a lot when you got it?  Yeah?  For what?  No problem. Glad to help, you know.  How bizarre was that,, huh? Anyway, wasn't your fault.  Better. You don't look like a mass- murderer now. She smiles, sips a coffee. A country song comes on the jukebox.  Wow, this music. Guess we should just count ourselves lucky it ain't Hanson.  She was a friend of yours? She nods.  really sorry.   Wow. It's late. \"ve got football practice tomorrow.  No, if it wasn't for you I wouldn't have had this nutritious medl,  The compliments, they just keep on comin'. He drops some money on the table.  's cool, I got it. Can I give you a Et home or something? I can walk  Yeah, right.  Right.          I guess I'll see you in school tomorrow?  You'll let me know how Walter's doing?  Good night. He extends his hand. She takes it. 3i2! The SHOCK of static electricity. Their words are simultaneous.  Acrylic sweater. They both laugh. Then go quiet. Then just stare at each other. Then the moment is gone. RACHEL gets out of the car, through the gate, back inside her house. JESSE watches her go. Starts his engine, and his car  Hi. How's Walter?     I just wanted to, you know, see how you're doing. Over his shoulder she can see the stir his presence aC Freak Hall is causing among...  So you'll meet me tonight, at the   Okay. See you. Tonight. ARNIE sees the Patio Girls glancing at RACHEL. She sits an ARNIE nudges her.  I hate this bullshit.  Okay. Thank you, then. He hangs up. Checks his watch. Waits.  Hey, what happened to you last night? I waited.  What? ON RACHEL and JESSE as she tells him what happened last night. He gets more and more agitated. TRACY is wearing her glasses as she and MONICA watch JESSE from the Patio.  Okay, don't worry, I'll talk to Mark, I'll take care of it  All what?  I'm picking you up tonight. We're gonna have a nice, mellow date. RACHEL stands, silent, torn. The BELL RINGS, everybody starts filing in.. She moves, he smiles, blocks her way.  I'm not going anywhere till you say yes.  Can't, Coach.  Well, I'm not a dog today, Coach, I'm a vegetarian.  Sorry, Coach. No can do.  You. What's with the stunt you pulled last night?  What you did at Rachel's.  Tell me, I'll pass it on.  Screw Eric, he's a big boy. He made his own decisions, he's gotta live with 'em. And stay away from Rachel, or deal with me. 55.   Don't call her a skank, don't call her a slut.  We screw with girls, use them, because it makes us feel like big men--  I'm tired. I'm tired of all of it.  No. We just grew up together. And he walks away. On MARK. Pissed. He sees JESSE left his letter jacket behind, hanging on the locker.  That's my dad's dealership. Y all that will be mine. 62.     You are good. I'm impressed.  Before he sold cars, my dad wanted to write this book: One Hundred Senators Pick Their Favorite Restaurants.' So, he wrote, to all of them.  Dear Senator So-and-so, I am writing a book.  Yes. No. Sort of. She laughs.  He got two letters back. one was a form letter which said, 'Thank you for your support.'  The other was from Hubert Humphrey.  He was the vice-President once. He wrote back a three page letter, raving about a place called Wally's Burger Hut. My dad was knocked-out.  He never wrote it. Or he was going to, and then my sister was born, and then I was born. And there was this car dealership, and it was security. So your dad wanted to be a writer. How'd his kid end up being this sweaty armpit jock?     Yeah, I love it. Except. My dad. He's got my life all mapped out. He wants me to take over the business.  Selling used cars is not what I want. And, unless I nail that football scholarship,' that's what I'll get. Wow. I can't believe I'm telling you all this. I've never said any of this out loud to anyone before.  Must be great not having to be like anyone else. 64.  Everything about you surprises me. There's the soft pops of rain hitting the car as it begins to drizzle, then it comes down hard.  Yeah? Want to come with me? She smiles. He leans forward. And she pulls away-, afraid, then decides to let him. They kiss. Then she pulls away.  What?  Yeah?  Oh.  Right. So... what's your favorite flower?  --later. She pulls away, exits, closes the door for the--  are making love. She's on top, her hands on his chest. Their glistening bodies catch the light of a RING OF FLAMES bursting around the bed. 66.  So, you're coming to the game, right?  C'mon. I need you, for good luck.  Good. I have practice today, but I can pick you up later, seven thirty?  What kind of life do you want? 67.  Well if you can't, I'll do it for you.  I will predict your future.  'm in it. ON THE PATIO -- are TRACY, MARK and MONICA, watching the.  Don't play with me.   Keep going.  I'm not the one you should be apologizing to.  Yeah. MARK extracts a KEY RING from his jacket, pulls a KEY off.  What happened to that little thing you wear, that, uh... He gestures to hib'nose, indicating her stud.  Too bad. I like it. It's different. RACHEL looks at the car seat. On it are DAISIES.     It was nice of mark to lend us the place. He's really tryin' to make peace. Invited .s to his party. But we won't go if y;,u,d be uncomfortable. 79. He moves to the bed.  Great.  What's wrong?  Sorry, Bullwinkle, lights out.  Feel better?  Funny. He too., He leans in to her. She backs away, like a skittish doe.  It's okay. Rachel, it's okay. It doesn't have to be tonight. Whenever you're ready. And, hey, you know what, you're the sanest person I know. And that's exactly what she needed to hear. She cups the back of his neck and pulls his lips to hers. They kiss; a deep, healing kiss.  in the bed, making love. Firelight playing over their skin. It's beautiful. what we all wanted our first time to be. They move slowly, as if all the pain in the world could be erased, ï¿½f only they could become one. JESSE watches RACHEL Her face open, vulnerable.  on the sideline bench. He scans the crowd behind him, sees. A NOTRE DAME SCOUT, wearing a \"Fighting Irish jacket, toting a clipboard. JESSE then spots RACHEL in the stands, gives her a reassuring grin. She glances at the SCOUT, smiles back at JESSE. TRACY sees them, is none too happy. SLOW MOTION -- A whistle sounds as a FOOTBALL is kicked to start the game. The BALL spins end over end until... 84. It's caught by a BULLDOG receiver who starts his return, then is popped hard and FUMBLES. An OPPOSING PLAYER leaps onto the ball on the muddy quagmire of a field. n the stands...  Brad, can you tell Rachel I'll be out soon? Have her wait for me.  Damn it. Under a pool of lamplight -- HIS CAR has had its tires slashed and someone has sprayed in red Carlin uies!â across the door. TRACY pulls up in. her BMW, wearing her cheerleading outfit.  Yeah.  You goin' to Mark's?  What... JESSE pushes his way through the crowd, trying to get to RACHEL. TRACY throws an arm around him, kisses his neck.  Rachel... He tries to shrug off TRACY, but ERIC and CHUCK grab his arms and pull him back into the crowd.  Rachel! MARK pushes RACHEL towards BRAD.  Rachel, listen. I swear, d know they were taping us. d never hurt you. She looks at his pleading eyes.           Jesus. WALTER, Rachel's dog, hops on his lap, licks at.his face. The sad-eyed DOG whimpers'and,JESSE scratches him. In the distance the CLOCK TOWER BELL can be heard CHIMING MIDNIGHT: One, two... As JESSE looks down and his eyes widen in surprise: Somehow, he's scrawled on the notebook paper on the desk in front of him: kINg of HELL Or, if you only look at the capitalized letters, it reads: Around it, the same phrase is written over and over again: kINg of HELL kINg of HELL kINg of HELL kINg of HELL kINg of HELL kINg of HELL kINg of HELL kINg of HELL JESSE lowers the dog How did... Trails off as he stares at the page. The CLOCK BELL in the background is still CHIMING: give, six, seven and... 110. T h e F R E N C H DOORS fly o behind JESSE. ns. It's the wind. The DOG starts barkin   Ssshhhh. Relax, boy. He takes a-deep breath, flips the page on the notebook, resumes his cram session. On the floor, the DOG looks at the open French doors, then scurries under the bed. JESSE is writing, in the MIRROR above h A WOMAN' s FIGURE anding in the French doors, her face hidden up, sees the WOMAN reflected, spins to watch her stop forward into the light. It's RACHEL, in hAk slip dress.      Rachel. He rises, envelops her in his arms, and kisses her. He pulls back to take her in. T!!s two of thaw are reflected in ANOTHER MIRROR behind the r 's door. opens her mouth to speak --",
        "Ryan": "",
        "Sue": "Corns. Come with me. Let's back off. One step. Good. Let's back away. PULL BACK to see the widening circles of shock as the students of Bergen High realize what's just occurred.   Was she a friend? This is a place where you can calk about it. 16.     It's okay. Let it out.  You stay here as long as you need to. RACHEL nods. SUE moves to the door and exits. Leaving RACHEL alone, looking all of five years old.  We will observe, at exactly two p.m... -- Her voice emanates from an INTERCOM BOX high on a classroom wall. STUDENTS bow their heads.  .a moment of silence.  Lisa Parker may be gone, but she will not be forgotten by her friends.  She will not be forgotten, by her fellow students, her teachers, and her school.  What is it?  Rachel, is there anything in there that strikes a chord for you? Do you know what Lisa was referring to?  Robbie, I had a Freshman crying in the hall last week. I couldn't get anything out of her, but her friend told me a football player slept with her, then dumped her.  Eric's 18. Lisa was 15. That's statutory rape.  Then let's make it. I don't know what's going on around here, but if that's what it takes to stop it, let's stop it, before someone else's daughter kills herself.  How are you feeling?  I was looking at chic last night. it says here your mom's in Arkham. How's your mom doing? 37.  I spent some time up there. As a patient. RACHEL looks surprised.  Does that surprise you?  Thanks. i try. You visit your moat often?  Is that scary for you?  Well, children of schizophrenics sometimes live with the fear of it happening to them. At your age, it's perfectly normal to be afraid of turning out like your parents.  You're right. I'm sorry. So. You've been in a series of foster homes since you were, what, four?  How's your foster family?  What about your real father?  Rachel, in a way, you've lost your mother. And now you've lost a friend. Losing someone can be a very lonely, painful place to be.  I really do care. How can I show you that I do? RACHEL is silent, staring at the MUG.  Rachel? But RACHEL's shut off, pushing down a storm of emotions.  You know, this room is a place where if you have feelings, you can talk about them. You can let them out. RACHEL shifts. SUE sees RACHEL's forearm near the coffee MUG. And, as if by proximity alone, it EDGES off the end of the desk -- And FALLS -- RACHEL catches it in one smooth motion just before it hits.  I didn't... see you knock it. 39. The DOOR swings open and the PRINCIPAL walks in, lays a computer printout on her desk.     These are just an exercise that will let me know how to help you better.  Just answer true or false to these statements.  \"There's a man inside the television set who tells me what to do.\"  \"Sometimes my thoughts assume the form of a giant insect.\"  Answer true or false and this won't take all day. Again: \"Sometimes my  \"If you want to play the piano well, you have to practice.\"  \"I can see sounds and hear colors.\"  \"Large furry animals crawl on my face every night while I sleep.\"  Sometimes I can move things with my thoughts. Beat. RACHEL stares at her, a million thoughts racing. Another beat. The only sound is the clock ticking on SUE's desk. RACHEL grabs her backpack and stands.  Honey, sit down. I just want to hel  July. June. May.  staring. Totally absorbed.     I'm here to see Barbara Lang.  Hello, Doctor Nelson. 59.  I'm visiting the mother of one of my students.  Mrs. Lang, it's important that I know his name.  I promise you, I'll keep the information in the strictest confidence. BARBARA just looks at her, chewing.  I'm just trying to help Rachel. She seems very troubled and I'm worried about her.  I am. Yes.  No. No I don't. BARBARA laughs. almost hysterically. SUE's thrown. BARBARA regains herself, then, with tremendous conviction...  Rachel needs my help. She... She has a... a disease, a genetic disorder I think her father passed on to her. I need to know so I can help her. Who was her father, Mrs. Lang? es SUE, then goes quiet, lost in her memories. 61.  So they are half-sisters.  There's something you have to see.  This used to be the school for the whole district. Chamberlain High. It was closed down in 1976.  There was a fire here that year. The night of the prom. Seventy-three people died. A few of us survived.  I haven't really been here in over twenty years. But it feels like I've been back here every day since.  Do you know what happened here?  What caused it?  Come on, you've heard of Carrie White.  And?  We both saw it. RACHEL looks at her, isn't going to talk about this.  I know everything there is to know about Carrie White. She did this. It began with what you did, with the snow dome. Then it got out of control.  It's a genetic recessive trait. The male is the carrier, when he combines with the right female, the trait surfaces in their offspring, usually in women. Like King's Disease, hemophilia.  Its a trait, Rachel, you inherited. Telekinesis.  Your mother told me your father was Ralph White. Carrie's father. It stops RACHEL in her tracks. 71.  You need help-- Like what? Like they helped you?  Yes. No.  No. I can help you, get it under control.  Rachel!  Rachel needs help. She doesn't believe me and I'm afraid for her. I want you to tell her who her father was. Why?  She'll believe it from your lips. Mrs. Lang, I really need your help, before it's too late. I can take you to her. Will you help me? BARBARA slowly nods, yes.  I guess she didn't want to worry you.  Oh, not Rachel! They race to the door as...  Stop! Stop it! RACHEL has her gaze locked on... MARK, who realizes he's a dead man. He moves toward a shattered window, through which some PEOPLE escape. But RACHEL turns her head slightly and... A TELEKINETIC PULSE travels across the row of LIQUOR BOTTLES at the bar, exploding them one-by-one, spraying alcohol which douses SUE. A FLAMING LOG erupts from the fireplace... Striking the alcohol-drenched BAR, setting a blazing trail and lighting the curtains on fire, creating a wall of FLAMES before the windows.  Stop it! You don't want to-- drenched clothes catch flames... and she , A. 102. A screaming SUE pitches forward, rolls on the floor to put out the flames, but caly succeeds in lighting another trail of liquor which creates a barrier to the backyard windows. In the eye of the storm is BARBARA, shaking her head in denial, muttering, as her mental state rapidly deteriorates.",
        "Snell": "",
        "Eric": "What's a coyote date?   When Lisa asked me to lunch, she was actin' like were on the road to marriage or something. I told her to wake up, she was just a pump, a nut.  And now I freakin.'. The Notre Dame scout's comin' Friday and it this gets out, I mean, sex and suicide? Catholic schools frown on that shit.  Lisa took a picture of me with. her.  How?  Hi, dad. STARK winks, takes MARK's empty cup and fills it with beer below the table.  You didn't get the picture?  No, sir. Never. KELTON produces the photo of LISA and ERIC.     So I'm suspended. And Coach, Coach he up and does this scene where he says, \"give me your helmet.\" 44.  What about Carlin? Game of the year, football scouts are gonna be there and I'm gonna be sittin' on the bench with my thumb up my...  You said you were gonna get the pictures.  She's the one who put me and Lisa together. Shit. what are we gonna do, Mark?  Hey, man, what did the scout say? Behind Rte... THE TV SET -- between shots of players grunting, tackling and smashing into each other, longer and longer segments appear of...",
        "Rachel": "Momma, come play with me. In my room. But her mother keeps painting across a door.  Right now, mommy, okay? BARBARA looks at her, or rather through her. And continues her task. RACHEL steps forward, tugs on her mom's  I got a idea, we could-- -- and gets , , splat, right-in the face with the brush  Hello? It's my mom. She's doing some... some wrong things. She's doing wrong things, so, and, you should come.  Momma! She starts towards her, but the OFFICER holds her back.  She breaks free, races into. 4.  joy.  the usual teenage mess, clothes strewn everywhere. A POSTER of Jim Morrison reads: \"No One Here Gets Out Alive.\" RACHEL stands before her dresser mirror, in a ratty bathrobe, putting on a small nose stud. She dons her daily armor -- -- Slipping on multiple earrings. -- Applying Kohl around her eyes. -- Shrugging on a T-shirt with a photo of Sharon Tate captioned \"Manson Sucks\". -- Disheveling her long black hair. Scooping up WALTER, she kisses him, takes him to an open ground floor window. Sorry, Walt. And gently lowers him outside.   Sorry. She picks through her cold cereal in silence.  Yes, ma'am. May I be excused? Without waiting for a reply, she stands and gathers the bowl.  And you should take that thing outta your nose. Don't you have enough holes in your head? As she turns away, RACHEL makes a face, but replies.  Yes, sir.  Later, Walt. On WALTER, bummed.  She speaks. She opens her mouth and sounds come out. The sounds are words. LTA gives her a Cheshire cat grin.  Why are you so weiz.ly happy?  Do you look any... Oh, my gawd. You did it.  C'mon. ' 1 Fess up.  You suck.  Best Blood. / Best Blood. ARNIE, a skinny, pimply stoner, plops into the seat behind them, sticks his head on their seatback, smiles full braces.  Love. JESSE looks at her, pensive.      I never cry. Miss Snell? She was so happy this morning. I don't understand. Why would she-- The INTERCOM BOX squawks:  You look great, mama.  Things are really great. Last night I, um, I had this slumber party, with some girlfriends. And this morning, Mrs. Wallace made us all pancakes before school.   Oh, they are. A nice family.  Nothing, I just... I miss those crepes you used to make me.  That would be so great.  Yes, mama.  C'mon, c'mon. Let me out! The door buzzes and she shoves through.     Uh-huh. The true romantic. MARK leans over JESSE, his voice low now, intimate.  No. 25.  They're not your pictures.  I don't think so.            Daddy's home. She walks to her bedroom and closes the door. 28.     Walter! And she breaks into a run. WALTER looks back, starts running, this is all fun for him. There's the low BLEAT of a TRUCK'S HORN and then... The high, piercing SQUEAL of a wounded animal. In the road, WALTER, laying flat, keening in pain. She runs to him and in one continuous motion SCOOPS him into her arms. RACHEL, in the middle of the two lanes. She turns as.__  Help me! Please! It speeds past, dangerously close. Another set of LIGHTS.  Stop! Please, stop! But the CAR passes, blaring its horn. She spins,around. is bearing down on her. She holds her ground.  THE CAR'S WINDSHIELD -- CRACKS, crazes, as if it hit with a sharp, fierce projectile. THE CAR -- lays down rubber as it screeches to a halt. JESSE is at the wheel. Sees through the crazed windshield: RACHEL, splattered with dog's blood. He gets out, stares at his'windshield, shaken-up, groping for some explanation.    It's my fault. He should have been in bed with me.  His name's Walter. will he be all right? The VET's intensely focused on inserting an I.V. into the dog.  some. 31.  But it's... you know, like the song says, you hurt yourself to see if you can still feel. I'm sorry.  For making you--  And I'm sorry about your windshield, about your car.  You can be sorry for things that aren't your fault. The VET enters, drying her hands. RACHEL sits up, bracing herself for the bad news. JESSE puts an arm around her seat back, getting ready to hold her.  Can I see him?   Lisa hLUd them.  Sometimes I'd see someone, from behind, and I'd know, I'd just know, it was Lisa. And then she'd turn ound, and it wasn't. But sometimes, you know, it was. And now... Whenever I see someone who looks like her, and she turns around... it won't be... ever. They both go quiet, not knowing what to say.  I know. I hope I didn't ru;.n  You're very polite, for a jock.  I don't have any--  Or hitchhike.     Thank you. For everything. 34.  Sure.  Yeah.  Dry weather.  Lisa don't! Somebody stop her! Stop! SLOW MOTION -- LISA falls through the air towards the car, arms outstretched, hair trailing like black flames. SMASH -- she goes through the windshield, but the face is    RACHEL's eyes pop open as her body jerks awake, heart, pounding. She looks around, realizes where she is.   Yesterday morning, she told me she'd, uh, lost her virginity. KELTON looks at SUE, produces the photo of LISA with ERIC.  Sure. Eric Stark. He's on the team. KELTON gestures to SUE and they step out into... 36.  okay. Fine. Can I go no SUE opens a file on her desk.  She's gonna be fine.  I guess. I mean, you seem pretty normal.  Why?  Normal, huh? Get real, I know I'm ten times more likely to get it than most people.    They're happy, - 'z-rig as they get 38.  Never met the gentleman. My mom won't even tell me his name. RACHEL stares at a ceramic MUG of coffee, very close o the edge of the desk.     sorry. I must've knocked it. SUE, the color draining from her face.        What do you wane from me? 40.  --yeah. Okay.  He asked me out.  I said, \"Okay, its your funeral.\"  She's beautiful.  jy are going to be late. She hears her doorbell go off. 45.  What'd you forget your-- There's nobody there. --keys? She looks around, closes the door, locks it, wraps her towel tighter.   Boyd? Emilyn? She turns when the DOOR HANDLE on the front door JIGGLES once. She stops dead. Spins as... The BACK DOOR handle starts JIGGLING. She backs into the living room and spins as-- Something starts TAPPING on one of the living room WINDOWS. Like a wave moving around her, a WINDOW on the other side starts TAPPING. RACHEL turns a full circle, scared, surrounded by TAPPING and JIGGLING, which grow increasingly loud r. She puts her palms against her temples, as if struggling to keep something bottled inside:  Oh, god, oh, god. Not now. Stop Suddenly all goes silent. She jumps as... The PHONE RINGS near her. She scoops up the cordless. Beat.  Hello? 46. There's a long pause on the other end.     Who is this?  Knock it off. Is this you, Arnie?  What do you want?  I'm calling the police. She hangs up, dials 911, fumbling with the knife.     No! The WINDOW SMASHES down on the intruder's HAND. There's a muffled YELL outside and the HAND is extracted.     Nothing. She retreats into her bedroom, looks at the Window. The PHONE RINGS in her hand. She answers.  curled on her bed with WALTER, calls out:  I'm not here.  You tell me what happened last night.     I mean, guys like you are supposed to date girls like Tracy.   All right. Okay.  Yes. JESSE lets her pass, with a chivalrous after-you sweep of his hand, then falls in next to her. RACHEL'S arm is grabbed by...  What are those, tonight's Top-Ten list?  You're wasting your time.  False. I don't see the point-  This ddesn't make any sense.  False. She sets down the SNOW DOME.  True.  False.  True. 52. SUE looks up, surprised.  I have a dog. SUE nods, watches RACHEL closely as she takes her time with this one, not reading off a card.    --and fuck you. You're not my mother! RACHEL turns to go. SUE jumps up, grabs her arm, and...  Mama, what was it like? WhEn you started to... when things went bad. What did it feel like, what did you see?  Did you see things move by themselves? Please, mama. I have to know.  My foster-dad taught me on his semi truck. Where we going?  All of them?  Anybody answer?  And the other?  Who? 63.  So your dad wrote a book, color me impressed.  And you like that.  What's wrong with that? Sounds like a nice life.  It's not so great. Sometimes I wish I could just be one of the shiny, happy people. Does that surprise you?     He had a talent. You. You got football. It'll get you outta this place. You can make your own path after that. Write your own book.  Um, I don't know how to say this. 65.  But I've never...  And, I'd want it to be special. Like you ring the doorbell, with flowers in your hand.             are making love. She's on top, her hands on his chest. Their glistening bodies catch the light of a RING OF FLAMES bursting around the bed. 66.  suddenly sink into the flesh of JESSE's chest. She SCREAMS as she tries to extract them,. but strips of his flesh stick to her like flypaper. RACHEL twists violently as her torso melds into his. Their bodies fuse, a grotesque apparition with four legs and two heads. Her mouth presses into his as their faces merge. The ring of fire leaps inward, consuming the bed.  I don't really get football.  All right. I'll be there.  Sure, go practice. Go be great. Live the life you want.     What do you mean?  Uh-huh. Can I get a hint?  Where are you taking me?  Happy homecoming. Can we go? This place is spooky. Gives me the creeps.  You just said. A fire.  They think a boiler blew up, okay? Am I gonna be graded on this?   Everybody has.           of a revenge-suicide thing. Elvis was her date and they escaped in a U.F.O. I know what happened to that snow dome, on my desk.        What are you saying I have?  With all respect, lady, you're seriously bat-shit. I'm walking, back to the real world. SUE's voice is low, quiet.  I don't believe you. She never told me, why would she tell you?  So then it's Arkham for me?  You want to know what I'm feeling today? `Happy. Happier than I've ever been. So I don't want or need your help. RACHEL runs off. SUE follows, trips on the rubble, falls.   You're normal. At the end of the counter, the PERFUME WOMAN approaches a SALESWOMAN helping MONICA.  Uh, just looking. The woman gives her a smile of devastating insincerity, crosses her arms and just stands there. RACHEL gets her drift. MONICA walks up behind RA  Thought she was gonna frisk me.  Nothing. Just lookin'.   No.  There's a shock.  Uh-huh.  Um, sure. How much are these?        Took it off.  No. Let's go.  I feel like.., we're being watched. She looks up at the MOOSE HEAD's MARBLE EYES, reflecting firelight. JESSE drapes his jacket over the MOOSE HEAD.  Feel scared.  I'm sorry, I just feel... weird. I don't know. Oh, wow, I am really losing my mind here.  in the bed, making love. Firelight playing over their skin. It's beautiful. what we all wanted our first time to be. They move slowly, as if all the pain in the world could be erased, ï¿½f only they could become one. JESSE watches RACHEL Her face open, vulnerable.  seems peaceful, holding on to JESSE like a child, they're covered by the chenille spread. Their sweat clings to them like the softest of prisons. He's awake, studying her. He gently runs his fingertips across her brow.         Thanks, but...  Thought that was a bunt. What?  I'm kidding, I'm kidding.   You gotta be fuckin' kiddie' me! They turn to each other, burst into laughter. MONTAGE -- of the punishing game. Epic warfare with grunting, spitting and cursing as LINEMAN butt heads and. -- A CARLIN RUNNING BACK steamrolls through the BULLDOGS for a touchdown. -- RACHEL, MONICA and AMY do their You gotta be fuckin' kiddin' me routine. JESSE catches a pass, and is immediately slammed hard  Do they have to hit him that hard?     Oh, no. RACHEL strains to see him as the team circles around JESSE. 86. FOUR PHOTOGRAPHERS rush along the sideline to snap shots, their cameras flashing. JESSE sits up, stands, shakes his head to clear it as he jogs to the sideline.  Thank, God. He's okay.  Yeah.             No. Well, yeah, actually some.  What type is that? There's an awkward pause which MONICA breaks.  No, I'd rather wait for Jesse.  Is that tonight's game?  What other game?  What?  THE TV SET -- keeps playing football highlights, but suddenly  Twenty-two? RACHEL stops dancing as she spots LISA PARKER's name at the bottom of ERIC's column with the number four next to it.   Lisa.  Oh, God MARK leans in to RACHEL, who hasn't noticed JESSE.  bursts from the water and grips his neck. MARK grabs her forearm as her other arm yanks him into the pool.  Mama. Maury? BARBARA'S P.O.V. o but it's a FOUR-YEAR-OLD RACHEL, pristine, without tattoos. BARBARA blinks and her P.O.V. is of a TEN-YEAR-OLD RACHEL, reaching for her. Mama, please. BARBARA blinks and it's now... The 17-YEAR-OLD RACHEL, covered in blood and tattoos. She looks her daughter in the eyes, backs away in terror.     Please, I don't have... anyone. She rolls onto her back, looks up at the STARRY NIGHT.  Please, God, let me die... And she tightly shuts her eyes.  .love you. JESSE tenderly kisses her lips. And all the TATTOOS fade from her face and body Love. Her face is serene. JESSE traces his fingers across her brow, embraces her, the flames start to encircle them, just like in RACHEL's nightmare. JESSE pulls RACHEL over the debris ridden floor toward the back windows, but stumbles and goes down. Her eyes flutter open.  Leave. Get out Instead of leaving her, JESSE hugs RACHEL closer. The sleeve of his jacket catches flames. And he accepts his fate. RACHEL shuts her eyes, gives one last TELEKINETIC PUSH...",
        "Brad": "Do her, Jess.  Who's place is this, again?  Oh, shit.     Twenty, no, thirty. They fingertip high-five each other. 54.  Jess, you score the skank yet? JESSE just glares at him, walks away.  Must be that time of the month.  It's gonna be a while, Jess is talkin' to the scout, he said for you to go ahead to the party.  C'mon, wench, let's dance. He pulls MONICA into the crowd, and she gestures for RACHEL to join them. 92.  The one you played.  Post-pattern, Mark! Ducking around DANCERS, MARK raises his hands for the pass. KIDS start to notice their antics and start laughing. BRAD passes the book over to MARK who catches it, mimes spiking it for a touchdown and does a silly victory dance. MONICA laughs and turns to RACHEL, who laughs, even though she still looks a bit befuddled.  Start with Eric.  Four. But maybe he shoulda lost those when she offed herself. 95.  points? Try thirty. RACHEL stares at the book, stunned, trying to make sense of it.  Hey, is that a zit on your ass? RACHEL has tears streaming down her face for the first time since she was four years old. She bows her head. 98.  glances down at RACHEL's arm. The THORN VINE around the HEART TATTOO looks bigger, edging up her arm. He looks away, shares a laugh with MARK, looks back and...  Holy shit. He releases her. RACHEL raises her head, eyes glowing with pain and rage, her broken heart turned to stone., The delicate THORN VINE has grown across her chin, cheekbone and forehead, swirling around to end on her other cheek. A stunned BRAD backs away from her. JESSE breaks free of ERIC's grip, slugs CHUCK and pushes his way towards RACHEL. Her HEART POUNDS at an alarming rate as she slowly turns and sees JESSE coming at her, his arms out to take her in his embrace.",
        "Winters": "",
        "Lisa": "What's wrong, fcscer-dad bein' a pain again? 8.  o I look any different?  Yep. With who?  You'd never believe me if I told you. I'm bringing him to lunch.  All will be revealed in due time. RACHEL pulls out a worn Anne Rice paperback from her ba gives it to LISA.  I love you too. Simultaneously, they bite their thumbs, then press them together; a pantomime of blood sisters.  Best Blood. / Best Blood. ARNIE, a skinny, pimply stoner, plops into the seat behind them, sticks his head on their seatback, smiles full braces.   Lunch. Meet me in the parking lot. 9.",
        "Tracy": "Who would love her?  It's okay. You should save your energy for the game anyway. JESSE opens the door, stands outside, tucking in his shirt. MARK and CHUCK make a crude humping gesture to JESSE. He hesitates, then nods at them. MARK pulls out the SCOREBOARD and enters JESSE's name with TRACY's and the number 10.  What are you thinking about?  I asked what, not who.  Why? She wasn't anybody.  I mean, I didn't know her. You know, I still don't have a date to Mark's party Friday. Hint, hint. She leans over and nibbles on JESSE's ear. He pulls away, forces a smile and turns the ignition.  She's not very good in daylight is she? wonder where she keeps her coffin.  Carlin creeps! At Freak Hall, ARNIE rises, wipes egg yolk from his hair.  What is wrong with this movie: does he see in her?  If he's gonna do it, you know, be seen talking in public with someone else, he should show some respect.  He should show me the respect, at least, to be seen with someone pretty. Someone cool. Someone who counts. Amy or you, you know, ate. Instead, it's Its. And I feel...  That's right. I wish there was something I could do to make him come to his senses. On MARK's face, a slow, insidious grin that seems to spread into eternity appears.  What?      Perfect. We have the homefield advantage.  Oh, wow, that sucks. Further proof Carlin guys are gravy sucking pigs.  Need a ride?  Wouldn't miss it. Hop in. As he gets into her car, TRACY has one hand on the wheel, the other hanging out her window. She drops something as JESSE closes the door. REVEAL a CAN of red spray paint TRACY dropped onto the parking lot's tarmac.  Just a quick stop at my house, want to change my outfit. Her car pulls off...  He told me he was thinking of me when he fucked you. 97. Seeing MARK laughing, JESSE realizes what's going on.     Screw that, get the shotguns! Shaking, freaked out, they gather weapons.",
        "Arnie": "Hi there gruesome twosome, how 'bout a threesome?   Love is fifteen seconds of squishing noises. Unquote. Johnny Rotten. Scattered laughs. JESSE overhears TRACY as she nods at RACHEL, whispers to AMY...  Food!  What'd he want?  What'd you say?  Pardon me, but is hanging out with jockboy such a hot idea? I mean, 41.  I heard he's dating Tracy Campbell, who is giving you the look of a thousand deaths right now. RACHEL casually turns to take in TRACY, then turns away. Her heart sinks.  Duh.     Hey, Monica, can ya get us into the party?  Man, we are missing one killer party.",
        "Boyd": "Daytime, yes; nighttime, no. We've been over this ground. I only brought him in this morning. No juice?   You watch that voice in this house. While you're here, you'll respect her as your mother, and treat her as such.  Come back here, mutt. Aw, good riddance. And he closes the gate.  Your dog got out. Better get'im.  What's wrong?  You were out all night. RACHEL nods, defiantly. He walks over to her and, without warning, slaps her.  You're grounded. No school today. You don't move from this room. He turns on his heel, walks out. The dog looks as stricken as she does.",
        "Eric's": "",
        "Father": "",
        "Sheriff": "",
        "Kelton": "Hi. He holds out Lisa's PHOTO STUB. RACHEL takes it, sees the name, her eyes widen.  \"For a moment, I thought someone was actually seeing me. But it was all a lie...\"  \"Eric lied when he said I was special. And I guess I was lying to myself when I believed him.\" He folds the note.  You recognize this boy?  What do you think?  Nothing illegal about breaking a girl's heart.  That's a stretch.  All right. I'll look into it.  So, you're saying you never met or talked to Lisa Parker?  Save it, Lou. Sue Snell told me there were other girls--  Youthful transgressions? A girl killed herself. The door opens and the town's MAYOR walks in, grey-haired, distinguished, with an air of authority."
    },
    "imdb_rating": "4.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNDZmMzE0NjUtZTIzNC00Mzc0LTgyZjgtNzUxMWRiMDIzMDQwXkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_QL75_UX380_CR0,3,380,562_.jpg",
    "description": "After the suicide of her only friend, Rachel Lang has never felt more on the outside. The one person who reached out to her, Jessie Ryan, also happens to be part of the popular crowd that lives to torment outsiders like her. However, Rachel has something else that separates her from the rest, secret amazing powers to move things with her mind. Sue Snell, the only survivor of Carrie White's rampage 23 years ago, may hold the key to helping Rachel come to terms with her awesome, but unwanted powers. But as Rachel slowly learns to trust, a terrible trap is being laid for her, and making her angry could prove to be deadly.—Anthony Pereyra {hypersonic91@yahoo.com}",
    "name": "The Rage: Carrie 2",
    "genres": [
        "Drama",
        "Horror",
        "Sci-Fi"
    ]
}