{
    "filename": "Good-Girl,-The_script.txt",
    "imdb_id": "tt0279113",
    "imdb_url": "https://www.imdb.com/title/tt0279113",
    "characters": [
        "Corny",
        "Mr. Worther",
        "Bubba",
        "Big Haired Woman",
        "Cheryl",
        "Gwen Jackson",
        "Lester (as Jonathan Shere)",
        "Old Woman",
        "Holden Worther",
        "Heavy Set Woman",
        "Phil Last",
        "Haggard Woman",
        "Justine Last",
        "Jack Field, Your Store Manager",
        "Mrs. Worther"
    ],
    "dialogues": {
        "Corny": "Hey, Justine. Can I talk to you for a second?  I was just curious. Have you ever been to a Bible study?  We got a good one going on every Wednesday at the First Church of Nazarine. Rodney comes, Benita comes. You got any interest in reading the Bible?  We don't preach fire and brimstone. Just the Ten Commandments. Were not interested in scaring people. Were about loving Jesus.  Well, maybe you'll have nights of eternal hellfire to yourself. Just kidding you. Drive safe.  Well I'm not a pagen but thanks all the same.  This is for you Justine. It's from Holden.   He's got the day off. He came by this morning with it.  Don't mention it. Hey, Gwen.  Justine! Poor lady. She just passed.   Gwen! She just passed away.  It got worse. She was on life support all day.  It's God's will, Justine. No one can understand it. It was just Gwen's time to fly away home.  Tomorrow night at eight. We'd love to have ya.  'Course! A couple that prays together stays together.  Hi. Welcome. Hey there people! Glad you could make it!  Y'all are in for a treat. We got a good discussion going tonight. If man is made in God's image, what does that say about God?  Justine, what happened to you? I looked up and I saw you two drivin' off like vampires in the night.  You coulda looked off your neighbor. It's a church, you know. You can't make water without bumpin' your nut on a bible.  What in blazes?!   Justine. Can we talk to you for a second?   Justine, you like workin' at the Retail Rodeo don't you? Like the company, like the people? You wouldn't want to jeopardize that by makin' some silly error in judgement would ya?  'Cause we know you're pretty tight with Holden.  I've seen you in the store room with him Justine. On many the occasion. I think you know him pretty well.",
        "Worther": "",
        "Bubba": "Hey, Justine.  The wind was flipping paint in our eyes.   Why?  What would be really neat is a paint that could change the molecular structure of a house, like a chemical acid deal.   I've seen better, I've seen worse. Nah. That's why I ain't never married. You got yourself the best fish in the sea.   If I was a woman, I'd be a slut. A lesbian slut.  So I heard about your friend bein' dead, and all. I'm sorry.  Well, at least you were with her when she went.  Ain't that right? You were... with her, when she went?  Workin' on your spiritual life?  Ain't that a hoot and a holler.  I saw you, Justine.  I saw you. We got some things to talk about, you and me. You come by my place after work. If you knwo what's good for ya.  Easy Bitz, easy Bitz. Back in your corner! Back in your corner! Back in your corner, Bitz! Come on in. I wanna show you somethin'. Sit.  I'm in shock.   You know why.  But don't you see? This is my chance, for liberation.  I'm gonna have to tell Phil then.  He's my best friend. I can't keep him in the dark about somethin' this big. He's a cuckhold.  Well that's different. That isn't about him. That's about my salvation. Look, you've got your choice to make. Either destroy your marriage, and break your husband's heart. Or have sex with me right now.  You're paranoid.  Phil is never gonna find out about any of this. Don't fret. (the dog is still barking  You're lookin' at a free man, Justine. A free man.  Thank you.   Knock 'em dead, partner. (Justine and Bubba watch Phil walk into one of the rooms) You look nice.  I know you're angry and I can figure why. But, from where I stand, what happened yesterday was a wonderful thing.  Well, I'm awful grateful to ya, Justine.   Let me just ask you one thing. How do I stack up against Phil? You know, how do I stack up where it counts?  Justine, this is Liberta. Liberta, this is Justine.  Congratulations, on your expectation.   Well, I hear Senor Tuna callin'. (phone rings  No. That just means they got it wrong, is all. They don't know everything.   I was just at your house and the mail came. Phil was opening letters, and he opened this bill from the credit card company. And F&amp;$%. Please don't tell him about us, Justine. Please. Please. I love Phil. I love him more than myself. Please have mercy on me.",
        "Cheryl": "Attention, shoppers. There's a Retail Rodeo special on aisle three. Liquid drain cleaner. Two 12-ounce cans for $5. Liquid drain cleaner has churning power and will churn right through your pipes. Ladies, shove something clean and new up your filthy pipes. Liquid drain cleaner on aisle three. Have a good day and thank you for shopping at Retail Rodeo.  You getting a whole one of these or a half?  You didn't bring this into the store?   Well then, I'll charge you for it. This is a hand lotion. So don't put it anywhere else, even if you need lubrication. We try to keep frivolous lawsuits to a minimum, unless, ofcourse, the customer is at fault. Here's your change and Fuck you very much.  Thank you very much.  Happy Halloween Retail Rodeo shoppers! There's a Retail Rodeo special on all bulk candy on aisle four. Ghouls and goblins, witches and warlocks, wandering these aisles, day after day. I'll put a Halloween curse on you.  What, you need a ride?  Sure... Sit right down here ma'am, we're gonna make you pretty. Now how do you like your hair?  No, I just need to know if that's your usual way of wearing it all big and high. If it is then I'll just put more makeup on your chin to off-set. Now, you're gonna want to take a whole bottle of this home wtih you. It's got quite alot of ingredients in it so you're getting a good deal. It's got Ginco extract in it, do you know what that is?  It's extract of the Ginco and it makes your skin real slick so that any liquid will roll right off, be it water or lemon juice or urine. I'll put that in a bag for you.  I'm just tryin' to match your face with your hair, I was thinkin' you're not white enough.  Well, the first rule of fashion is that you have to look wierd. What I'm doing here has come straight from France.   It's called circ du face, meaning circus of the face and it's all the rage with the Frenchies.  That's right.  What's wrong with you? You look like death.  Is it your period?  This job is stressful. I'm breaking out.  Maybe you're pregnant.  Justine, somethin's goin' on. Something is definately happening.  It's big. It's very big.  Someone stole fifteen thousand dollars from the safe. They blew the thing open with a gun.  Not only that but the cops know who did it.  Somebody who works here.  Holden, Holden did it. Fool left his cashier key in the door.  They can't find him though. They say he robbed his folks too. You in on it?   I know you two played hookie in the store room. I never rat on ya, I've done some things myself. But, still. You in on it?  Suit yourself.  Hey Justine.  I thought we were gonna get a day off and go to the movies....  Fake eyelashes. Extra long.  You want me to make the other cheek purple to even it out?  D'you hear about Corny? He was goin' home after Bible study last night and two beefy guys with painted faces pulled up in a truck and jumped him.",
        "Gwen": "On your left, honey.  Can't say.  Don't know. Yesterday?  Don't know. Can't say.  It's called work, princess. Kind of fun. You might want to give it a go someday.  That's good. Justine will be right with you. Where is she?  You don't get paid to pick your crack. You get paid to work.  Oh, come on! A little pancake, eyeliner, mascara, rouge on the cheeks and powder it up. Then you take a moist tissue, roll it in a ball and toss it in their face! Jeez, Louise... I'm talking to a tree stump! Girl, where are you?!   It's the food you eat, Justine. Look at me. I am 10 years older than you and have 10 times your energy. Cause I don't eat meat and I don't eat dairy. It's probably why you can't get pregnant, honey. And why you have that hung-jaw look on your face. It's the cheese in your pizza and the chicken in your salad.   Then what's the deal here? Did he say you get enough vitamins?  Good as new, I'll tell ya, good as new.   Well, that'd be a mistake. These are bargain prices.  Alright, close.  All I know is, everyone should have one beau, before anyone has two beaus.   Night Corny. Happy Halloween.  Which ankle did you twist, Holden?   Maybe you should put some cold water on it so it doesn't sweel up and inflame.   You want a blackberry, honey? A man was sellin' 'em on the road.  Hey sugar.  Oh, I had a dream. I had dream that I sprouted a beard made of bean sprouts.   Okay,You'll meet me inside?  Okay. Your a doll.",
        "Jackson": "",
        "Old": "Catcher in the Rye I'm named after it.  Holden. After Holden Caulfield. He's the main character.  He's put upon by society. Hypocrisy of the world.  I'm a writer.  Novels, plays, screenplays, stories, poetry.  Oh, he has a nervous breakdown. Goes to a mental hospital.  That makes two of us.  Maybe you're a maniac.  Twenty two.  How old are you?  I don't know.  How long you been workin' here for?   Oh, I live right down the street.  You wanna come in?  Well, I'm not gonna beg ya.  I'll be in my room.  It's my slave name. Holden's what I call myself. This is my room.  They're okay. They don't get me. I mean, they're alright.  Since when do you have a husband?  What's he paint?  Um, I had to drop out. I had a problem with drinkin' and stuff. I'll go back. I just gotta prove to my parents that I can fly staright. You go to college?   I twisted up my ankle on the stairs. I was wonderin', maybe you could give me a ride home?  Alright I'll talk to you about it later.   My, uh, left.  Okay.  You said he was a pig.  Dear Justine. Because of you I'll be quitting the Retail Rodeo. The last two days have been the most god-awful days of my life. I've not been able to get rid of you in my head. I never wanted anything so bad, and I have wanted many things. I'd given up long ago on being gotten by someone else, and then you came along. The idea of being gotten, because of circumstance, will never get got is the worst feeling I've ever felt, and I have felt many bad feelings. I'm sorry I can never see you again, Justine, forgive me for being so weak, but that is who I am. Goodbye, Holden Wurther. If for some reason, you could change your mind and want to be with me, body and soul, meet me after work. I will be waiting for you at five PM outside Chuck E.Cheese. If you are not there at five, you will never see me in your lifetime.  Hey. Oh god, I'm really glad you came.   Oh god, thank god.  Let's go to my house.  Let's just park somewhere.  Look. I don't know. I don't care I just wanna hold you.  We'll be back here before you know it.   Justine. I'm yours. I'm all yours.   Who cares, I don't care. I crave you. I wanna know everything about you. Who are you?  I wanna knock open your head and see what's inside. I've had so much pain in my life. I know you have too, I can see it.  I just wanna leave some kind of legacy. Somethin' great. After that I don't care what happens to me.  I would.  Seee, now that you met me you're mysterious. And dark and twisted.  Yes, you are.  I don't know.  I won't let him hurt you.  You can't worry about somethin' that hasn't even happened yet.  Okay. (leans in to kiss her; she pulls away  Makin' one out of two.  Justine, will you leave him?  Away. With you on my arm, my folks'll think I've changed. They'll stop thinkin' I'm suck a loner, I got a girlfriend, a pretty one, who knows me and likes me. And they'll be so happy, they'll give me money to write my novel.  We'll be like... Catcher in the Rye. Only by me. I'll be immortal and then like JD Salinger I'll just vanish.   You want me to help you get stuff out of storage?  Well, are you gonna give me a ride home? My ankle's actin' up.  Forget it.  Well, can't we go to the motel?  Well, let's go in the store room.  What?  I thought you said we'd go today.  What came up?  I'm starting to wonder if you even want to go. I'm startin' to think you don't get me.  You do, you do get me you just don't want to me 'cause I'm too intensified for you! Justine, who cares, who cares if someone finds out. We don't have to live like this, Justine. I know what it's like to go home every night and feel like you're hidin' out. We can leave all this behind...  You just, you just gonna give up?! You gonna go crawlin' back?!  You're so fucking afraid it makes me sick. Don't give up on us.  Okay. Good luck on your important thing.   You're a hooker, you hooker.  So, how many guys you gettin' with? You gettin' with every guy in the state?   I'm so alone!  Yes, I'm drunk! And I'll be drunk every day until the day I die! What do you care?! You jump on any pecker that's put in front of you!  I saw everything. Oh god. Oh god.  Where you goin'?  What?  I can't share you, Justine! Maybe with one man but not with a whole bunch of 'em!  You know, sometimes, I think to myself, at least it can't get any worse. But it can. I can worse. As long as you can say you've hit rock bottom you can.   A blind man can go deaf. A widow can lose her children. Babies starve and they never get food. They never get any food. They just come into the world and they die.  I can't calm down! I'd be easy if I was a hooker like you. I could calm down all over town.  I know you're not. I'm in agony.  What do you mean 'why'? I thought you hated your life.  I'll kill him. I'll murder him in his sleep. I'll kill my parents, I'll steal the money whatever it takes. You just, just whatever you want as long as it's you and me. Please don't forsake me Justine.  We need a plan. We can't keep livin' day to day. We gotta chart a course and we just gotaa stick....  But, they're dirty. (hesitating, he eats a blackberry and then smiles) They're sweet. If I could only get my hands on some money, someone could just tell me the answer. I gotta do. But If I ever do, I end up thinking about it instead. I gotta do. But do what? (Justine pushes the blackberry he's about to eat away from his mouth) What...? What was that for?  Hello?  It was a wrong number.  Justine! Justine!  I did it! I finally did somethin'!   Oh, who cares? I'm proud of myself. Fuck them, Fuck all of them!  Well, we're outta here! Justine, I got over twenty thousand dollars! I got a gun, what else?!  It's my baby.  Yes, it is. You know it is.  Yes, you can. I mean, you can't raise a baby here. You know that. Justine. You hate your husband. You hate your job. You love me, so let's go.  Well, then tomorrow. I'll go to the motel and wait for you. Just be there by noon.  Justine, what have you got to lose?   So be there by noon.  I love you, Justine. This is all gonna work out. I know it. I almost forgot. This is a story of your life. You inspired me. (they kiss and Holden gets out of the car",
        "Woman": "Hi, this is Dr. Williams returning the call of Jean Worther. I'm calling from the Holland County psychiatric hospital.",
        "Holden": "Catcher in the Rye I'm named after it.  Holden. After Holden Caulfield. He's the main character.  He's put upon by society. Hypocrisy of the world.  I'm a writer.  Novels, plays, screenplays, stories, poetry.  Oh, he has a nervous breakdown. Goes to a mental hospital.  That makes two of us.  Maybe you're a maniac.  Twenty two.  How old are you?  I don't know.  How long you been workin' here for?   Oh, I live right down the street.  You wanna come in?  Well, I'm not gonna beg ya.  I'll be in my room.  It's my slave name. Holden's what I call myself. This is my room.  They're okay. They don't get me. I mean, they're alright.  Since when do you have a husband?  What's he paint?  Um, I had to drop out. I had a problem with drinkin' and stuff. I'll go back. I just gotta prove to my parents that I can fly staright. You go to college?   I twisted up my ankle on the stairs. I was wonderin', maybe you could give me a ride home?  Alright I'll talk to you about it later.   My, uh, left.  Okay.  You said he was a pig.  Dear Justine. Because of you I'll be quitting the Retail Rodeo. The last two days have been the most god-awful days of my life. I've not been able to get rid of you in my head. I never wanted anything so bad, and I have wanted many things. I'd given up long ago on being gotten by someone else, and then you came along. The idea of being gotten, because of circumstance, will never get got is the worst feeling I've ever felt, and I have felt many bad feelings. I'm sorry I can never see you again, Justine, forgive me for being so weak, but that is who I am. Goodbye, Holden Wurther. If for some reason, you could change your mind and want to be with me, body and soul, meet me after work. I will be waiting for you at five PM outside Chuck E.Cheese. If you are not there at five, you will never see me in your lifetime.  Hey. Oh god, I'm really glad you came.   Oh god, thank god.  Let's go to my house.  Let's just park somewhere.  Look. I don't know. I don't care I just wanna hold you.  We'll be back here before you know it.   Justine. I'm yours. I'm all yours.   Who cares, I don't care. I crave you. I wanna know everything about you. Who are you?  I wanna knock open your head and see what's inside. I've had so much pain in my life. I know you have too, I can see it.  I just wanna leave some kind of legacy. Somethin' great. After that I don't care what happens to me.  I would.  Seee, now that you met me you're mysterious. And dark and twisted.  Yes, you are.  I don't know.  I won't let him hurt you.  You can't worry about somethin' that hasn't even happened yet.  Okay. (leans in to kiss her; she pulls away  Makin' one out of two.  Justine, will you leave him?  Away. With you on my arm, my folks'll think I've changed. They'll stop thinkin' I'm suck a loner, I got a girlfriend, a pretty one, who knows me and likes me. And they'll be so happy, they'll give me money to write my novel.  We'll be like... Catcher in the Rye. Only by me. I'll be immortal and then like JD Salinger I'll just vanish.   You want me to help you get stuff out of storage?  Well, are you gonna give me a ride home? My ankle's actin' up.  Forget it.  Well, can't we go to the motel?  Well, let's go in the store room.  What?  I thought you said we'd go today.  What came up?  I'm starting to wonder if you even want to go. I'm startin' to think you don't get me.  You do, you do get me you just don't want to me 'cause I'm too intensified for you! Justine, who cares, who cares if someone finds out. We don't have to live like this, Justine. I know what it's like to go home every night and feel like you're hidin' out. We can leave all this behind...  You just, you just gonna give up?! You gonna go crawlin' back?!  You're so fucking afraid it makes me sick. Don't give up on us.  Okay. Good luck on your important thing.   You're a hooker, you hooker.  So, how many guys you gettin' with? You gettin' with every guy in the state?   I'm so alone!  Yes, I'm drunk! And I'll be drunk every day until the day I die! What do you care?! You jump on any pecker that's put in front of you!  I saw everything. Oh god. Oh god.  Where you goin'?  What?  I can't share you, Justine! Maybe with one man but not with a whole bunch of 'em!  You know, sometimes, I think to myself, at least it can't get any worse. But it can. I can worse. As long as you can say you've hit rock bottom you can.   A blind man can go deaf. A widow can lose her children. Babies starve and they never get food. They never get any food. They just come into the world and they die.  I can't calm down! I'd be easy if I was a hooker like you. I could calm down all over town.  I know you're not. I'm in agony.  What do you mean 'why'? I thought you hated your life.  I'll kill him. I'll murder him in his sleep. I'll kill my parents, I'll steal the money whatever it takes. You just, just whatever you want as long as it's you and me. Please don't forsake me Justine.  We need a plan. We can't keep livin' day to day. We gotta chart a course and we just gotaa stick....  But, they're dirty. (hesitating, he eats a blackberry and then smiles) They're sweet. If I could only get my hands on some money, someone could just tell me the answer. I gotta do. But If I ever do, I end up thinking about it instead. I gotta do. But do what? (Justine pushes the blackberry he's about to eat away from his mouth) What...? What was that for?  Hello?  It was a wrong number.  Justine! Justine!  I did it! I finally did somethin'!   Oh, who cares? I'm proud of myself. Fuck them, Fuck all of them!  Well, we're outta here! Justine, I got over twenty thousand dollars! I got a gun, what else?!  It's my baby.  Yes, it is. You know it is.  Yes, you can. I mean, you can't raise a baby here. You know that. Justine. You hate your husband. You hate your job. You love me, so let's go.  Well, then tomorrow. I'll go to the motel and wait for you. Just be there by noon.  Justine, what have you got to lose?   So be there by noon.  I love you, Justine. This is all gonna work out. I know it. I almost forgot. This is a story of your life. You inspired me. (they kiss and Holden gets out of the car",
        "Phil": "Hey, Teeny. How was your day?  Paint stings. Feel like I've been attacked by hornets in my eyeballs.  I think we got most of it out.  Like what?  It's the wind doing that. They the wind's coming in different lately.  You could make paint where, at different angles, the house is different colours. You stand at the front door and the house is red. You stand at the street and the house is green. Or you could make, like, an invisible paint. Make the whole house disappear.  What do you think, Teeny?  Teeny, you're pretty. Bubba, isn't Teeny pretty?  I wonder what it'd be like to be a woman. All that smooth skin and long hair.   Lowers it to where?  I was thinking about what you were sayin' about my sperm bein' low. I mean, I know I got good sperm. It's baby-makin sperm. I suppose it couldn't hurt to have it confirmed by an expert.  What the hell?  Hey.  Were you been?  Did she sick up on you?  Did she sick up on anybody?   What? Are you kiddin? What for?  You okay?  Paintin' on Bovery. Why?  We knocked off early 'bout four. Bubba had a date with a stewardess, why?   Don't say that, Teeny. 'Course you were. 'Course you were.  Hey, Teeny. We've been up to no good. We got the day off on account of the rain.  Oh, I wish it would rain every day from here on out. Never have to paint again.   What's this?  Not very light is it?  I heard it was the couple that lays together stays together.  I completely didn't remember...  Hey. Where's Bubba?  Well, I'm ready. Let's go.  I don't know what to say about Jesus. I'm stoned.  Jeez. We forgot the Bibles, Justine.   Yeah, that sounds like a good one.   What?  What's goin' on?  What the hell?  Why not?  Justine, this is embarassing. We're runnin' away from Bible study like a couple of Devil worshippers.  You are freakin' me out, man. Why?   You just said a few minutes ago they'll forgive us.  I'm never goin' back to Bible study again.  I'm nervous.  'Cause I gotta go to that doctor tomorrow and jism into a cup, that's why. What if I can't do it?  You know, If you said you'd help me I'd feel alot less nervous. It's gonna be on your lunch hour anyway.  You didn't even say nothing about the TV bein' fixed.  You're welcome.  Wish me luck.  Who's there?  C'mon. I can't do this on my own. I need help.  Not in a place like this! Not where I have to hand over the results! Just, let me hold your boob.  What are you doin' in here? What's that?   Why you takin' it?  What's it say?  I wanna be here when you find out.   The little plastic doohickey's turnin' blue. What's that mean?  Bright blue.   I knew it. Waste of time going to that sperm doctor. We did it. We're gonna have ourselves a baby.  And tomorrow, we're gonna celebrate at Senor Tuna. Yes we are. I'm gonna bring Bubba. You can bring some of your friends from work. Or Bible study guy. Whoever. Too bad Gwen's dead.  Let's do it mellow then. You sure don't seem too excited.  Don't think negative. Think positive. We could have ourselves a tiny Phil. Or a tiny Teeny. Teeny's gonna have a tiny weeny Teeny.  What do you mean? Everything's gonna change.  What do ya mean?  Hey Teeny!  We were gettin' worried about ya!  Doesn't matter. As long as it plays quarterback for the Cowboys.  Hello. Yeah. Well, that's not right. What's that supposed to mean? Hey look. No. You don't know shit okay. Justine's pregnant. You got that? Well, look you better check your records again, pal, then call me! (hangs up) Some doctor says my sperm's no good. Does that mean Justine's not pregnant?   Looks like that wind's pickin' up again.   Hey.  What's going on in the bedroom? Looks like a twister hit it.  I thought we were robbed. Why aren't you at work?  Retail Rodeo? You know that guy?  Have you been sleepin' around behind my back?  I said, have you been sleepin' around behind my back?  Why? Why?  Don't you love me? Don't you love me at all?  Oh god. Please don't tell me it's not my baby.  Are you sure?  Who is he?  Yes, it does. Was it some guy from work?   Yeah, I know who it was. It was that Bible guy, wasn't it? The Nazarine. That's why you were actin' so spooked.   I'm gonna beat his ass.  You're gettin' all swollen. I'm sorry I hit you, baby.  I need to get stoned.  I just gotta escape, you know. You ever feel like that? Like you gotta escape?",
        "Last": "",
        "Haggard": "",
        "Justine": "As a girl, you see the world like a giant candy store, filled with sweet candy and such. But one day you look around and see a prison and you're on death row. You wanna run, or scream or cry. But something's locking you up. Are the other folks cows, chewing cud till the hour come and their heads roll? Or are they just keeping quiet, like you... Planning their escape?  What's that cashier's name?  When did he start working here?  Who is he?  What are you doing?  Yeah.  Yeah.  I have my own, you know, beliefs.  I kinda like my nights to myself.  Bye-bye.  The same. How was yours?  Bubba, stand up.  For Christ's sakes. Look at that couch, Phil. Y'all got paint all over it. This ain't gonna come off. Damn it, Phil.   You two were stoned. You, keep frying your brain liike that, you'll slip off a ladder and crack open your head bone. You do really stupid things when you're high, Phil.  Like sitting on my couch with your big blue ass. Everything just turns to shit. You finally get nice things, then everything just gets messed up. Why is this TV buzzing?  Different from what?  What you reading?  What's your name? Catcher?  What's he do?  I notice that you're, uh, not very social.   What do you write?  I better go. What happens at the end of your book?  I'm not sure I can do makeovers.  Sorry, Im just a little tired.  I went to the doctor. He says I'm fertile. He says I could repopulate the entire planet.  He didn't say.  I think you two are a pair of potheads.   Now, you might be interested in purchasing some of the products I used today...   I hate my job.  I hate everyone here. I hate Gwen. I don't know what the hell she's so happy about. I'm sorry I don't understand why maniacs get shotguns and shoot everybody to pieces.  Maybe so. You know you're lips are real pouty, like a woman. And how your eyes droop off to the side. How old are you?   I'm an old lady next to you.  How old do you think?  I am thirty years old.  Forever and a day!  You don't have a car?  Well, you can ride in here, there's room.  I don't know. I'm in a funk.  They call you Tom?  Not aolt to look at. What are your folks like?  My husband doesn't get me.  Since seven years. He's a painter.   Houses. He's a pig. He talks but he doesn't think. You go to college?   No, I was afraid I'd lose Phil if I went. Now that'd be reason enough to go. I saw you in the store and I liked how you kept to yourself. I can see in your eyes that you hate the world. I hate it too. You know what I'm talkin' about?  After livin in the dark for so long a glimspe of the light can make you giddy. Strange thought come into your head and you'd better think 'em. Has a special fate been callin' you and you not listenin? Is there a secret message right in front you, and you're not reading it? Is this your last, best chance? Are you gonna take it? Or are you goin' to the grave with unlived lives in your vains?  Gwen says smokin' marijuana lowers your sperm.  Maybe you're the infertile one 'round here. Maybe every time you smoke a little dooby, you're killin' our unborn children.   Why you limping.  Yeah, sure okay.  He's not my beau, he's my friend.  You're a writer so you have yourself a goal. I used to lie in bed and imagine other cities, other jobs I could have. Other husbands. Now I don't even know what to imagine anymore. Holden, I have a husband.  Well, Holden. I don't want to hurt anybody.   Oh who gives a shit, who needs a F&amp;$%' baby around here anyways? If you wanna make yourself useful, why don't you get that goddamn TV fixed?!  It sounds like a helicopter is landin' in here.  No thank you.  Well where is he?  Thanks.  Gwen? What's wrong?  Gwen? Gwen you sick?  Well what time is it?  Gwen?  I'm gonna let you off here, okay?  Yeah, you know what I'm gonna do? I'm gonna park the car, then I'm gonna meet you inside.  I just ditched Gwen at the hospital.   Where are we goin'?  No, with your folks there?  This isn't well planned.  I can't do it.  I don't wanna... I don't wanna go.   Gwen got real sick today. She was throwin' up all over the store. I had to take her to the hositpal, and sat with her.   No.  It's not funny, Phil, this is serious. I'm gonna go up there tomorrow too. And the next day.  What?  Well, how is she?  I bet it was those blackberries.  Stop it, somebody's gonna see!  I'm just this woman. I moved to Texas when I was eleven. My daddy was in the Air Force.  Holden gave me two of his stories to read. It's like what a story would be. I was about a boy who was put upon, his mother was cold and selfish, and his father wanted him to play football. Other people didn't get him, especially girls. Then the boy comes to believe no one can ever really know him. So he starts actin' out, drinkin', and doin' all kinds of drugs. At the end the boy kills himself but jumpin' over abridge. The second story was pretty much the same as the first. Except at the end, the boy kills himself by drinkin' a bottle of bug poison.  Your stories are intense.  Don't say that. I wish there was a story about me. I don't know who would read it though.  I like this. I like havin' a secret. You gave me a secret Holden.  I'm going to hell, aren't I?  That's Bubba's truck. Get in the car. Phil takes that truck to work everyday. Bubba picks him up, and drops him off. Why, why would that truck be parked there?  If he finds out about us....  He's big, Holden. He'll kill you. He'll beat me, but he'll kill you.  I gotta go to the hospital.  Don't! I mean he could be followin' us.  Who?  What do you mean? I thought she had a stomach ache?  I don't understand.  Gwen died today.  Parasite. Somethin' she ate.  Where were you this afternoon?  What time did Bubba bring you home?   Oh. I can't believe she's dead. I wasn't a very good friend to her.  Holden had the notion to go to Gabler's Creek, skinny dippin' and makin' love. He said we'd be like Adam and Eve, rollin' around around in the sticks and the dirt and bein' one with nature. He was so fixed on the idea thateven when the clouds started rollin' in, and the sky was gettin; dark, he kept on swimmin'. All my thoughts turned to death. I thought of Gwen's body, rottin' away. I thought of how nice a person she was, so full of life and good will. If there was a heaven, Gwen would be there. Givin' makeovers and offerin' up helpful advice. I thought if I died today, what would happen to me? A hateful girl. A selfish girl. An adultress. A liar.  What are we doin'?  I haven't thought this through.   And go where?  But where will we GO?  I thought you might.  Yeah. She was real healthy too.  Yeah.  Fine.  Not right now, maybe later.  I gotta get home. Maybe Cheryl can.   I think we gotta take a breather. I'm nervous.  Not today.  Just be patient, Holden!  I was wonderin', when was that, uh, bible study?  Can I bring my husband?  The Holy Bible. There's one for you, and one for me.  We're goin' to Bible study. A couple that prays together, stays together.   Well you heard wrong.  Cheryl? You think you can take this one?  Phil, what the hell are you doin'? We're gonna be late for Bible study. You're stoned, you got paint in your hair, would you just get in the shower?   Get in the shower.  Yeah, I guess.  What do you mean?  Saw me what?  He left.  Just let the other people do the talking.   Well, that's alright, they'll forgive us.  Hi Corny. This is my husband, Phil.   Phil, come with me to the car.  Come with me to the car, I gotta get somethin'.  Just get in the car. Get in the car, Phil.  I don't want to go to Bible study.   Because I don't want to. Now, can we please just get out of here?  I don't care. I'm not in the mood.   Why? Beacause we forgot our Bibles is why.  Yeah, well, they may not, alright. So can we please just get the shit outta here?  I don't care, fine by me.  Oh geez, we forgot our Bibles.  Oh. Well, we felt bad.  I can't go.  I can't go today. There's something important I need to tend to.  Well, something came up.  Um, okay. I think, maybe, somebody's found out about us.  Well, maybe I don't get you.  That's easy for you to say, Holden, you are not married.  Holden, you are gonna get us caught!   I won't.  I'll see you tomorrow, okay? Okay?   Thanks.  Why?  Bubba sat like that for what seemed like ten years before he began to speak. Finally, when he opened his mouth, he talked a blue streak about the ruin that was his life. He talked about how he loved Phil, and how he loved me. And how he always wanted a girlfriend just like me, and to be a guy like Phil, to this imaginary girl like me, that he never found. Then he wen on about givin' up your dreams and how it's all a part of gettin' older. Bubba had given up on his dream to be like Phil, and accepted his fate as Bubba, always and forever. Then, last week, a door that remained shut swung wide open. Bubba thought this no chance coincidence, a cosmic force was at work. The sounds of me makin' love to a man that wasn't Phil was like a shout in Bubba's ear from the creator himself. What it meant, or what to do, or why Bubba didn't know. All he knew was that he hated me for poisoning the well of idealism that he had drunk from for so long. I was no longer Bubba's image of perfection. To him I was just a liar, and a whore, and that sickened him. But on the other hand he loved me for opening his eyes and releasing him from the bitter chains of evny that bound him to Phil. Phil was no superman, just a cuckhold, and a foll, and that was beautiful. Bubba felt that there was just one thing left for us to do. Something that would solve both our problems and end this whole tragic cycle.  Bubba, I am not gonna sleep with you.   But, one person's liberation is another person's, well, badness. There's just no way.  Why?  You wanna cuckhold him yourself!  Oh god! There was someone in the window! Did you not see?  I gotta go.  Get this damn dog away from me!  Great. Good for you.  You're nervous? Why?  You can do it.  Okay.  Oh. Is it? Thanks.  We're not friends.  No, we don't.  Oh my god. What are you doin'?  I saw you. You followed me.  No, Holden, this is all because of you. He had me over a barrel. If I didn't sleep with him he was gonna tell Phil about us!  You've gotta get a hold of yourself! Are you drunk?  It's not what you think.  Look, go home. Sober up. And meet me after work.  I gotta help Phil with his sperm.  Just go. Go!  Great.  Good luck, honey.  No, I don't.  Nothin' happened yesterday, so drop it.  Bubba, I mean it.  It's Justine.   You've never done it on your own?  Ah, they're sore. (Justine looks fed up with everything  My stomach's crampin'. I feel sore.   Nah, it's stress.  You're breakin' out 'cause you put so much makeup on your face.  What?... No...  Oh my god, Blackberries.  Calm down, Holden!  Hey, hey! I am not a hooker.  Why?  I do. I mean I'm depressed but... You are really depressed.  Oh... I, I promise. (car is parked somewhere; Justine and Holden are sitting on the car, Holden's smoking  I realized then that Holden was at best a child, and at worst a demon. If I was ever gonna go straight I'd have to ditch him. Sometimes, to get back on the road to redemption, you have to make a few pit stops.  How much are the blackberries?  Thank you.  Have a blackberry.  Have a blackberry, Holden!  They looked dirty. I, I think I saw a bug in them or something.  I'm worried about Holden. Tom. I'm worried about Tom. I just befriended Tom, recently, and now, well, I think he's mentally ill. He has this idea in his head that we've had some sort of affair. Which is crazy because I'm, I'm married. He's been sayin' all sorts of strange things, and makin' threats. And drinkin'. And, and I just think he would be better off in a place where people, professionals, could take care of him. Otherwise, he's just gonna get himself in trouble.   It's a home pregnancy test.  'Cause I still haven't gotten my period.   Well, I haven't taken it yet. Could you give me a minute please?  Okay.  Blue?  It means I'm pregnant.  Maybe.  The test could be wrong, Phil. It's a little early to be havin' a party.   No, I'm excited. It's just, a lot of worries come with havin' a baby...   Do you think anything's gonna change havin' a baby?  Yeah, but I mean, do you think anything's really gonna change?  Go find out.  C'mon Cheryl, I'm gonna kill you.  Oh my god.  Who?  Cheryl!  Oh my god.  What?! No!  I don't know what you're talkin' about.   No. I don't know anything.  I hardly know him.  I don't know anything.  Holden, the police are lookin' for you!   Hey! They think that I'm in on it, too! Corny's got a camera in that storage room. That Bible thumpin' pervert's been watchin' us the whole time.  I'm gettin' all goosey. I think I'm gonna crash. (takes a right turn and stops the car) I'm pregnant, Holden.   Not necessarily.  Even if it is, you cannot raise a baby on the run.  I can't go tonight. I gotta pack my things and I'd have to get more money.   This is all going too fast.  Nothin'.  Okay.  Hey.  Sorry.  Hi.  Thanks.  They just got it wrong, so...  How it all came down to this, only the devil knows. Retail Rodeo was at the corner on my left, the motel was down the road to my right. I closed my eyes and tried to peer into the future. On my left I saw days upon days of lipstick and ticking clocks. Dirty looks and quiet whisperings. and burning secrets that won't ever die away. And on my right, what could I picture? The blue sky, the desert earth streching out into the eerie infinity. A beautiful, never ending nothing.  I know where you can find him.  He's at the Hotel Glen Capri, and he'll be there till noon.  Hey.  Oh yeah. I was doin' laundry.  They gave me the day off.  No.  What?  Hey Phil.  What?  Yes.  I don't know why.  You're the only man alive that I love.   It's your baby.  It is. I swear. I swear to God.  It doesn't matter.  Yes.  Yeah, yeah.  Don't.  I'm sorry, Phil.  Okay. Get stoned.  What are those?  Just do it normal for once?  No.  That's terrible.  That day I read the story Holden wrote for me. It was kinda different from the other one, but kinda the same. It was about a woman who was put upon. Whose job was a prison, and whose life had lost all meaning. Other people don't get her, especially her husband. One day she meets a boy who is also put upon, and they fall in love. After spending their whole lives not getting got, with one look they get eachother completely. In the end, the boy and the girl run away together in the wilderness, never to be heard from again.",
        "Mrs.": ""
    },
    "imdb_rating": "6.4",
    "description": "A young married woman's mundane life takes a turn for the worst when she strikes up a passionate and illicit affair with an oddball discount-store stock boy who thinks he's Holden Caulfield.—Elena Pérez",
    "name": "The Good Girl",
    "genres": [
        "Drama",
        "Romance"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BODA1NjA3MzAtNGYyYS00YThmLThkZDktNDk1ZTM4ZTJmNDgyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UY281_CR1,0,190,281_.jpg"
}