{
    "filename": "Invention-of-Lying,-The_script.txt",
    "imdb_id": "tt1058017",
    "imdb_url": "https://www.imdb.com/title/tt1058017",
    "characters": [
        "Anna's Mother",
        "Martha Bellison",
        "Blonde",
        "Shelley",
        "Landlord",
        "News Reporter",
        "Bob",
        "Waiter #1",
        "Brad Kessler",
        "Wedding Overseer",
        "Mark Bellison",
        "Anthony",
        "Anna McDoogles",
        "Greg",
        "Frank"
    ],
    "dialogues": {
        "Anna's": "",
        "Mother": "It's time, dear.  Jennifer?  What's wrong? Do you have food poisoning?",
        "Martha": "An elderly woman in a light blue robe sits on the side of her bed, with her back to Mark, staring at the wall only inches from her face.   The television is broken.  I don't understand anything you just said and that makes me scared and angry.  I do too.   I'm sorry, Mark. Things aren't any better for me here. I can't afford most of my medication, I'm very alone and I forget more and more every day.   I don't think I'm a loser.   Well, we're poor because we weren't born with money and it's very hard to make enough money in a single lifetime to move from one social class to another. We're only moderately intelligent because there's been a lot of inbreeding in our lineage. And we're only lonely and unloved right now. Remember, I've had two husbands I loved very much in my lifetime.    And maybe one day you'll have a wife that you love very much too.  I suppose we are. But things could be worse. We could be homeless.  Well that's sad. I love you, Mark. Good luck finding a job!  Oops.  I don't know, I fell on my way back to my room.  They say I'll probably die tonight.  I'm so scared, Mark. I don't want to die. You know, people don't talk about it much, but death is a horrible thing. One minute you're alive, there's a whole world around you, humming and jumping, people coming in and out, doors opening and closing, love and anger and the whole mess of it all, and then like that, it's all gone. This is it Mark, only a few hours left of this until an eternity of nothingness.  I'm scared.",
        "Bellison": "",
        "Blonde": "Don't look at me, I'm not attracted to you.  Don't bother. I've heard it all before.  Do we have time to get to a motel or do we have to do it right here?    I don't want to die in this motel room. I think I'm going to throw up. Help me get my pants off.  No! We have to have sex! The world is going to end! Think of the children and little babies!  How can I be calm? The world might end any second! DON'T YOU  WE'RE GOING TO LIVE! We're going to live! Thank you! Thank you!  This has been the worst... and the best... day of my life.  Oh no, please stay. We've been through so much together.",
        "Shelley": "Hi Mark. Everyday I realize more and more how over-qualified I am for this position and how incompetent you are at yours.  Anthony's coming by within the hour to see if he can work up the courage to fire you. If he can't, he said he'll definitely do it tomorrow.  Well, I told everybody you were getting fired this week and not to expect their calls returned, so no one left any messages.  You're almost definitely getting fired.  Okay, but everybody knows you are.  Okay, I'll be searching for new jobs on Craigslist.  I loathed almost every minute I worked for you.  What are you going to do now?  I don't have much hope for you either, but I wish you good luck.  Bye, Mark.  He's gone crazy!",
        "Landlord": "I'm here for the rent.  I know. That's why I'm here for the rent.  How much do you have?  The rent is eight hundred dollars.  Then you're evicted. I'll help you with your things.  Help me with the couch. It looks heavy.  You have one day to get your things out of this hallway.  You've got three hundred dollars. Rent a truck.  What are you doing here?  Where did you get this money?  Okay. Lucky.",
        "News": "In Seoul Korea, they wait. In Rome, Italy, they wait. In London, England, they wait. In New York City, they wait. The world has come to a standstill, everyone at their televisions and radios, or here on this lawn, waiting for Mark Bellison to come forth and tell the people what he knows.",
        "Reporter": "Twenty-four hours ago, Mark Bellison was just your typical nobody writer. Today, people are saying he knows new information about what happens after you die.  Are you all right, sir?",
        "Bob": "",
        "Waiter": "I'm very embarrassed that I work here. Hi.    Excellent. She's out of your league.     Do you guys know what you want or do you need a moment?  Excellent, I'll get those both started for you.    I'm an extremely important waiter. What can I get you?  Okay, I'll have those right up for you.  I don't know what's wrong with the chef today, but these just look awful.  Well, you're stupid.",
        "#1": "Look at Loser cave! So small!  I love these films. Saves me reading the book.  You look like my dead son.  She's seizing.  Go on.  There he is!  Is there only one place you go when you die?  You owe us an explanation. If you know something this important, you better tell us all.  The words you spoke last night, to your grandmother, spread like wildfire. Please, tell us more. Explain what you said.    What ethnicity is he?  What about being late for work?  If you do just one bad thing do you go to the bad place?  Like baseball!  As long as you don't do any of the bad stuff you listed, right?  How do you know these things?  Yeah, but how come we're just learning these things now, millions of years into our existence?  Is it from the Man in the Sky?  Do you have any samples?    That's the only plane I'll ever fly on again!",
        "Brad": "",
        "Kessler": "",
        "Wedding": "We are sitting here in this building today to share in the wedding of Rob and Jennifer. Two young, attractive people who have agreed that this union would be mutually beneficial and that their genetic match-up would most likely produce favorable offspring and a life of financial stability and physical security.  Rob, do you promise to stay with Jennifer for as long as you want to and to protect your offspring for as long as you can?  Jennifer, do you promise to stay with Rob for as long as you want to and to protect your offspring for as long as you can?  Jennifer?  Jennifer, do you promise to stay with Rob for as long as you want to and to protect your offspring for as long as you can?  Before I pronounce these two man and wife, is there anyone here who thinks they'd offer either of these people a better genetic match-up?",
        "Overseer": "We are sitting here in this building today to share in the wedding of Rob and Jennifer. Two young, attractive people who have agreed that this union would be mutually beneficial and that their genetic match-up would most likely produce favorable offspring and a life of financial stability and physical security.  Rob, do you promise to stay with Jennifer for as long as you want to and to protect your offspring for as long as you can?  Jennifer, do you promise to stay with Rob for as long as you want to and to protect your offspring for as long as you can?  Jennifer?  Jennifer, do you promise to stay with Rob for as long as you want to and to protect your offspring for as long as you can?  Before I pronounce these two man and wife, is there anyone here who thinks they'd offer either of these people a better genetic match-up?",
        "Mark": "That makes me think of your vagina. I'm Mark, how are you?  I hope this date ends in sex.        That makes me very horny.  Sure.   Mark and Jennifer drive in silence for a beat.   Greg's a good friend.  A cute little place called La Bonisera in West Hollywood.  I have very little money.  I don't know any of them.  I found that boring and started thinking about this place's fish tacos.  What are we going to talk about?  Two, please.  Hello.  I'll have a Budweiser.  Yup.  I'm going to ask you some questions about your life because that's what you do, but I'll only really listen to about half of what you're saying.  How do you spend your days?  That's a little more specific than I expected.  Do you have a job?  What job do you have?  What do you do?  Do you enjoy it?  Sure. Tell me more. I'm trying to get a little insight into you.  Are you always happy?  Sure.  I'm ready.  I'll have the fish taco's because I had them once here and it's all I know.  Don't think twice. How is your mom?  Fantastic.  Thanks for going on this date with me. You're way, way out of my league and I know you were just doing it as a favor to Greg, and that most likely I'll never hear from you again.  Give me a call if you still like me once you're sober.  Thanks for kissing me on the cheek, I know you didn't have to do that and....     Mark plops into bed in his boxers. His bedroom is bland, uninspired and completely furnished by the cheapest stuff found in an IKEA catalogue.  Mark flips on the TV and gets under the covers. A commercial comes on TV.    Mark stands in his building's elevator. The doors open and FRANK, mid-forties and bald, enters.   Not so good. Last night I went on a date with a girl I've had a crush on for years who will most likely never call me again and I'm pretty sure I'm going to get fired today. You?  See you tomorrow.   As Mark drives to work we take in a bit of his world.  A homeless man stands on a street corner with a sign that reads: \"I don't understand why I'm homeless and all of you are not.\"  A business man talking loudly into his cell phone pulls up next to mark at a red light.   Hi Shelley. I'm still attracted to you today.  Any messages?  Nobody else called? No calls to do with actual work?  Next time I'd rather you took down the messages just in case I don't get fired.  Well, it hasn't happened yet.  Okay, I'll be in my office.   Mark's office is completely boring and unremarkable, much like his apartment.  There's a knock on his door.  ANTHONY enters, looking very much the boss in his expensive suit, yet nervous and fearful as well.   Anthony, don't fire me.  They were about the black plague! It's the 1300's Anthony, what else am I going to write about!  No! I can make it work!  Is there anyway you could do it now? I'd rather not put it off.  Damn.  She's a really good writer, too.  I often fantasized about you naked.  I have no idea. But I have very little hope for the future.  Bye, Shelley.  Please don't make me feel worse. Or actually whatever, go ahead, I don't think I could possibly feel worse.  Well, now I feel worse.  I already have. Martha Bellison. I'm her grandson.  You say that every time I'm here.  Oh Grandma, that is so depressing. Come on, at least stare at the ceiling or something.  The television isn't broken. You probably sat on the remote and changed it to channel two again.  See, you had it on the wrong channel. It needs to be on channel three in order for the satellite to work.  I can't understand what it feels like to be you so it just irritates me and makes me think you're stupid. But I also love you and wish things were better for you.   Grandma, I lost my job today. I'm forty years old. I'm completely alone and I've got absolutely no prospects for anything.   I'm just so tired of life. Why does life have to be so... what's the word? Don't you sometimes wish you could change things? Don't you sometimes wish you weren't such a loser?   Of course you're a loser, grandma. Our family is made up of losers. We're all poor, we're all average looking, we're all only moderately intelligent, we're all lonely and unloved.   Yeah, but I'm not talking about the past, Grandma. I'm talking about right now. And right now we're both losers, Grandma. We're both shitty, shitty losers. Don't you know that?  I'd rather be dead than be homeless. That's why I need to get out there and find a job. If I have to be homeless, I'm going to kill myself.  I love you too, Grandma.  I'll start looking for a job tomorrow.  Hey, thanks for setting me up with your cousin by the way.  Very.  It felt nice to go out with someone that pretty. Like for just one moment I experienced what it would be like to be the type of person someone like that would date. It felt good. Doesn't matter anyway. I will always be just who I am right now: average looking, of average intelligence with an average personality. Just a completely generic human being.  By a good margin.  I really wish I had a better friend than you.  I don't know. Guess I'll start looking for another crappy job.  I'm going to go now. You're seriously depressing me. I really wish I was cool enough to have a better friend than you.  Yeah.   Mark drunkenly lies in bed. He picks up the phone and dials.     Shut the fuck up, I don't even have a job!   Mark opens the door to find his landlord, a middle aged, well- groomed man.   I was going to come talk to you about that. I got fired yesterday.  Well, I haven't got it.  I think I've got about three hundred dollars in my bank account.  I know. I haven't got it.   With all of his belongings piled up in the hallway, a tired and sweaty Mark stares defeatedly at his landlord.   How am I supposed to do that?  Oh, fuck me.  I'd like to make a withdrawal.  I've just been evicted from my apartment so I need to withdraw what I have left in my account so I can move my things out. I guess I need to close out my account to do that. I think I'm about to be homeless.  Well, I'd like to withdraw eight hundred dollars.  All of it. Just whatever is left.      Yup.  Large bills.  It's no problem.   Mark knocks on his LANDLORD'S door. A short, stodgy old man opens the door.   Paying my rent.  It was amazing. I went in to the bank and the system was down and I was going to take out three hundred dollars but she asked me how much I'd like to take out and...  I found it. Lying on the street.  Give me my key back.   Mark jumps around his apartment, dancing and screaming. Mark is a caveman who just invented sex.   Today I stumbled upon something no man has ever stumbled upon before. What I have done today they will write about in history books for generations to come. And yet, only moments ago... it was unfathomable not only to myself, but to mankind as a whole. What I have found there is no word for. And it was as simple as... ... how do I explain this...  ... I said something... that wasn't.  I said something... that... wasn't. I... what's the word I'm looking for? Well, there is no word. Of course there's not, I just invented it.  Here. Watch. Jim.    Come on guys. Are you serious? What's my name?  No. My name is Mark.  You guys aren't following me. Okay, guys...I'm black.  Fuck it, I'm an Eskimo.  Okay, I'm a pirate.  Okay then, I'm a lion tamer... and I have purple hair.  I invented the bicycle.  I give up. And I'm bored.  Guys, if you had the power to make things the way you wanted them, what would you do first?  Pretty much.  Specifically the ass?  Alright then, let's try that.  Out.  Wait!    This isn't right.  Just calm down for one second.    We're going to be okay. The world isn't going to end. Everyone is going to be fine.  Okay, I gotta go.  I'm an asshole.  That was one of the worst experiences of my life.  What else would you do if you could do anything in the world?  What else though. What's the second thing you'd do.  I'd get money. I'd get all the money.  Yeah. Let's do that. Greg, let's go.  We're going on a trip.   Greg is driving, Mark rides shotgun, both of them are completely plastered.   Thanks for driving man, I'm completely plastered.  Wait, officer. Don't do that.  How much does it cost to bribe you?  Wow, that's high.  Wait. He's not drunk.  Good idea.  That was awesome!  You're gonna be all right, Greg.  Vegas, baby. Vegas.  Sure we do.  Sure it will.  Chips please.  I know.  I know.  I know.  We'll both have beers and we'll take them at that roulette table over there.  It's okay. I'm feeling lucky.  Just watch.  I'm on twenty-seven red.  That's nothing. Watch this.  I'm on nine black. These are all mine.  I don't think I should. Lets go play slots.  Hi, I just won a major jackpot on this slot machine but no money came out.  Thank you.  Well, sort of.  We couldn't lose.  I've got a system.  And then what?  Why put it on black? Why stop there? Put it on a number and get thirty five times back.  Hold on, I think I found a flaw in your plan. How can they pay us if we have all the money in the world?  Well, they can't because we've got it all.  We already own the casino. We've got all the money in the world. We'll be betting against ourselves.  We own that one too. We won that.  Yup.  Yes.  I'm listening.  Brilliant.   Mark, exhausted from his long night, waits for the elevator to arrive. The elevator doors open and Frank, the depressive neighbor, steps out.   Hey there, Frank.  Pretty good, thanks.  Yeah. You?  Oh. All right. Bye, Frank.  Frank!  Don't do it.  I'll care.  Don't do it, Frank. Things are going to be all right.  Yes. You're going to meet someone soon. You won't be so lonely. Things are going to turn around at your job.  Well, things are going to get better. Better than they are.  It will go away very soon. You're going to be happy soon, Frank. You just need to wait for it. Listen to me: you don't need to kill yourself.  Really.  It wasn't.  I don't know. Not really.  Sure. Of course. Let's hang out.  Great.   Mark sits at kitchen table, pen and paper in hand.     I'm as excited as I've ever been in my entire life, and equally scared. I'm writing this down in a letter in case this thing I've discovered somehow ends up killing me. I want to ensure that, even if I wasn't strong enough to use it, that my invention doesn't once again disappear, never to be discovered again.  In just a few hours since I stumbled upon my discovery I have seen its potential for evil and I have seen its potential for good.  I must be careful with my discovery, for at this point I barely understand it, let alone think I have the power to control it. All I know is that if I'm not careful I could easily do irreparable damage to the world, or even cause my own premature death.  Now, to explain my invention. In essence, my creation is the act of saying words that simply are not. For example, if I tell someone that my eyes are blue, then it simply becomes fact. I still know that, indeed, my eyes are brown, but no one else is aware of this fact, so therefore I have blue eyes. It's a game of numbers: there is only one of me who knows I have brown eyes, and so many of them who do not. The numbers always win.  Whoever is reading this, go ahead and try it. Tell someone your eyes are a different color then they are. I think you'll be amazed at the results. It's so simple and yet... so powerful... this thing I've invented.  Au Revoir, future reader, au revoir.   Mark lies in bed watching TV. He picks up the phone and dials.   Jennifer. It's Mark.  No. Maybe. Who knows. I'm calling because I want to ask you out on another date.  I discovered something yesterday. I found out I can pretty much have my life anyway I want it from now on.  Wait, and I know you said you didn't want to date me ever again, but I'm different now. Things have changed. I think I'm in your league now.  No. I'm not better looking. I'm just more... powerful. I think you have to see it for yourself.  No, I haven't been to the gym. It's just... it's amazing. Things are different for me now. You have to see this. I think you'll hardly recognize me.  No, look can we just meet up?  Jennifer, If there was even a glimmer of something about me that you liked, please say yes. You even admitted that we got along well. Just give me one more chance. Just one little teensy, tiny date.  Fantastic. Tomorrow night. I'll pick you up at eight.    Yeah, no I was being... ...there's no word for it. See you tomorrow night.  Rob Marlowe, your streak of success has finally come to an end.  I'm not mad at all.  When you fired me, I was very depressed.  And so I left this building and I just started walking. And I walked all the way out of town. And then I walked into the desert and I fell asleep under a tree.  And when I woke up I found this strange old chest sticking out of the ground. So I started digging. And I unearthed a very old and ancient box. Probably, oh... about... seven hundred years old. And inside the box... ... was this.  It's a never-before-heard historical event from the past.  The 1300's.  This one isn't about the black plague. Well it isn't just about the black plague. Let me read you some of this.  Anthony, get excited about this. This is a brand new event from history that no one has ever heard before. It's a great human discovery.  The greatest movie Lecture Films has ever made.          The moment the bride and groom kissed, King Xardon performed a mind-wipe on all of the humans, thereby erasing all knowledge of these events from their minds, and sent them back to Babylon. For seven hundred years these events would be forgotten by mankind until one day, a great writer by the name of Mark Bellison, would stumble upon them in the desert, after being fired by his shit boss Anthony and mocked by Rob and Shelly, two huge douche bags. Lecture Films Motion Picture Studios would go on to make the picture and it would be a big success, and Mark would become very wealthy and famous from it. The End.    Thanks. Thank you for having dinner with me.  I don't want to know what it is, I just want to order the most expensive thing on the menu.  Today is the best day of my life. Hands down. Easy. Best day.  That wasn't the best part. It was great, but it wasn't the peak of my day. I've had a crush on you ever since I saw a picture of you on Greg's refrigerator two years ago.  The best part of my day today is right now, sitting at this table here with you.  You're the most beautiful woman I've ever seen in my life, and you're special... and it makes me happy to be around you.  Ah, my family. We're what you'd probably call \"not lucky\". My whole family is kind of marked by tragedy, bad luck and general... shittiness. It goes back a long ways and could probably drive someone to suicide just hearing about it, so I'll keep it simple. My mom died when I was six. Cancer.  And my dad got real depressed and lost his job. Out of work and with a kid to raise he had no choice but to turn to a life of crime.  He was a robber. Houses mostly.     He was a very unlucky man. He spent his last days behind bars. I never really knew him. But I guess I've also had a little luck in my life. I did have a wonderful grandmother who raised me.  Yeah, she's great.  Old person's home obviously. Who wants to live with that? Gross.  But I'm going to get her out of there tomorrow.  I'm going to buy her a big beautiful mansion where she can spend her few remaining days in luxury.  They look fine to me.  Right. I was thinking that since I'm going to be rich and successful now that I might be in your league. And that maybe we could be together. Romantically.  Well, I don't know, maybe we might enjoy it. Maybe we'd be good together and could have a happy life, raise a family together.  Good. Fantastic.  Sure.  Hello? What?    Grandma, they just called me. What's going on? Are you okay?  What do the doctors say?  What?  What are you talking about she's going to die?  Fuck.  Grandma!  Listen closely to me, Grandma. I have a surprise for you.  You're wrong about what happens when you die. It's not an eternity of nothingness.  When you die you're going to go to your favorite place in the whole world. And you're going to be with all of the people you've ever loved and who have ever loved you. And you're going to be young again, and you'll be able to run through the fields and dance and jump, and there will be no sadness, no pain, just love and laughing and happiness. There will be ponies made of gold, and everyone will live in giant mansions, and everything will smell like cookies. And it will last for an eternity, Grandma. An eternity.  Do your jobs!  You're going to be happy forever, grandma. I promise you. Say hello to my mom for me. Tell her I love her.  Damn it.   Mark and Jennifer pull up in front of Jennifer's apartment. There is a long beat of silence.   I think I just did something bad.  Hi.   A bleary eyed Mark drives home from Jennifer's. As he turns onto his street he finds hundreds of cars blocking the way. A massive crowd of people are leaving their cars and walking.  Mark gets out of his car to find a wild scene: hundreds of people camped out on the lawn of his apartment building.  Standing by his door is the NURSE from the hospital. She immediately points at Mark and screams.   Who are you people?  Fine, fine, just give me a minute.   Mark goes to his fridge and pulls out a beer. His mind is reeling. As he opens a drawer to get a bottle opener he sees the letter: \"MY INVENTION\". Mark eyes it ominously.  The phone rings. Mark screens the call.   Remember last night when I said I think I did something bad? Well now I know I did something bad.  Hold on.  Fuck.  I can't explain it all right now. Why don't you come over?   Jennifer pushes through the throng of people, which is now even larger than before. As she reaches the door Mark opens it for her and slides her through.   Come up quick, they look like they could get out of hand any second.   Jennifer sits on the couch while Mark, agitated beyond recognition, paces the room.   I don't think I should. Who knows what could happen next? I'm just going to keep my mouth shut from now on.  Sure I do. I could just walk out that door and get on a plane and go to Namibia. No one knows me in Namibia.  My grandmother was dying, and she was terrified, shaking all over. She didn't want to just become nothingness. So I told her that when she died there wouldn't be nothingness. That she would be with all of the people she loved who had died and that she would live an eternity of joy and happiness.  But you don't understand. The words I said... they weren't... it's not right.  Happy. At peace.  Good.  Okay. But I need a few hours to get my thoughts together.  Wait! Are you sure this is right?   Mark's neighborhood is a sea of candles. The crowd has grown beyond measure. A massive sea of people, all holding candles, all waiting quietly like serene cows for Mark to come down and make his announcement.     Mark is hunched over his table writing. There's a knock at the front door. Greg walks in with a large pizza and beer.   I didn't...   Mark opens the door. Jennifer and Greg are on his bed watching T.V. The same newscaster stands outside the building.   I'm done.  I guess.   They head towards the door.     I feel like I should be reading these off of something other than just notebook paper. I wish they were like, written on large tablets or even just nicer paper or something.  Feels better.   OTS of Newscaster cameraman. The newscaster is interviewing a young man, with Mark's apartment building in the background.   Hello.  Oh, thanks.  Wow.  So. I guess you've all heard the things I told my grandmother last night and... I understand why you're here. I know... some things. Some very important things. And I'm going to share these things with you now.  Everything you want to know is written here. On this old pizza box.          No, not that high.  Look, people I got a lot to get through here. I'm just telling you what I know: Man. Lives in the sky. You can't see him. Controls everything. Cool?  Number two: When you die you don't disappear into an eternity of nothingness. Instead, you go to a really great place. Number three: In that place every person will get a mansion.  I don't know. Whatever kind of mansion you're thinking of right now.  Look, it's the best mansion you can think of, not just now, but ever. Whatever the best mansion for you can possibly be, that's the one you'll get. Number four: When you die, all the people you love will be there too.  Yes, of course. Everyone gets a mansion.  If they want to live with you, they can leave their mansion and live in yours.  I don't know, it goes back on the market.  No.  Okay, they're probably there, but you'll never see them. They're far off, too far for you to get there.   They won't. They hate you too.   Well then you're just... you'll both be fine with it. There's only love there, okay? Number five: When you die there will be free ice cream. All day. All night. Whatever flavor you can think of.   But why would you eat bad flavors?   Well don't eat it then!   Well don't put it on then! What's wrong with you people? I mean...    Number six: If you do bad things you won't get to go to this great place when you die.  A terrible place. The worst place imaginable.  Murder. Crime. Rape. Things like that.  Fine.  Yes.  Then it's fine.  No.  That's fine too. I mean, you might lose your job if your boss doesn't like it, but it won't effect what happens after you die.  That also is fine. Unless the dog dies. Then it's bad.  No. You get... ... three chances. If you do three bad things you're out.  Kind of, yes.  Any more?  Look, can we just move on?  Fine. Let's start with you...  No. There's no hairstyle that will put you in the bad place. Like I've told you, the main things are hurting people physically on purpose, taking people's stuff, doing things to people they don't want done, killing people on purpose. Okay? Are we good?  Well, you didn't know about these bad things until I told you just now so you're fine.  You're all fine! I'm only talking about people who do bad things starting right now. Everyone else is fine.    Yes.  Yes.  Yes.    This guy who lives in the sky and controls everything is also responsible for all the good stuff that happens.  Yup.  Well, yes.  You betcha.  That too.  Right. But check this out: Number eight: Even if the man in the sky does bad shit to you, he makes it up to you by giving you an eternity of good stuff after you die.  Right. Of course.  Yes. Right. Well, that's it. That's everything I know.    I don't know, he forgot or something. I gotta go people, good night!   Mark, Jennifer and Greg wait for the elevator, all of them exhausted.   You think that went well?   A disheveled Mark, unshaven and sloppy looking, sits in a reclining chair, wearing boxers and a bathrobe, drinking a beer. Beer cans are littered everywhere.  A young gay man in a suit stands before him with a pad and a pen writing down everything Mark says.   So then the flying duck flew all the way to Alaska where it met up with a polar bear who could talk. And the polar bear's name was Martin. And the polar bear was wearing a green cape. And Martin and the flying duck both had race cars with their names printed on the side and...  (continuing; glaring at  Luckily the Polar Bear was there to snatch the race car back... Unfortunately, the witch was a smart witch and the polar bear was powerless.  Yeah.  Hey, don't look at me: it's the Man in the Sky's story.  Yeah. Tell them to shoot that one this week.    What?  Hey, he's the boss.  Yeah, yeah.  Not the entire world.    I'd trade it all in for you. All of it.    But why can't we be together. Why can't you be with me?     It would be great if it changed your genetic material because I really love you but I just don't...  It does change your genetics.  No. No, it doesn't. Our kids would be short and fat with little snub noses.  Why not?  What? With who?  You've got to be fucking... Rob Marlowe?!? He's a complete and total asshole.  Well of course he is, look at you. I mean, for fuck's sake, a shark would be nice to you...  Well no, I mean... Don't go out with him.  What's he got that I don't?  I don't want to move into your fucking mansion. And what are you doing thinking about marriage with him already? You haven't even gone on one date.  It's like nothing's changed.  He's picking you up here?   Mark and Greg are shit-faced, sitting around Mark's giant swimming pool.     Hey, watch this.  The man in the sky just told me something!  You're all gay!  And adopted!  I'm gettin' a beer.  Out of beer. Just Coke.  I want to do something big again. Like telling the people what happens when they die. That felt good. I gotta do something big like that again.  Maybe.  Hey, Greg. What if I told you that drinking Coke was good for you?  And not just Coke. But all the delicious foods you're not supposed to eat. What if they were all of a sudden really, really good for you?  Gentleman, thank you all for coming here on such short notice. I have some very big news for you all today.  Nope, this one I came up with all on my own. And it's going to change the way you all do business... forever.  Up until now, all products sold worldwide have warning labels printed on them. Warnings like these.  As you can see, a lot of these products can be very depressing. They remind people of all the horrible things that can happen to them in life. People hate thinking about horrible things.  Hear me out, fellas. Allow me to introduce you to the future of your companies.  It's the same Coke as before.  Guys, it's the same Coke on the inside. I've just changed the outside.  I didn't do anything, guys. I made this on my computer last night. The plane is exactly the same as it was before.  That's the point here guys. With these new advertising strategies, people will buy your products with abandon.  No. It won't. All you have to do is print these words on the packaging. That's it.  Even if you don't understand it, just start shipping these products out to people as you see them here and you're all going to get very, very rich.  Look, they're still the same products you have on the shelves right now. The only difference now is that people won't get bummed out or scared when they use them. Isn't that a good thing?  Gentleman, if you'll excuse me, I have five thousand gay orphans on my front lawn that are going bananas.   We follow a suburban housewife as she pushes her shopping cart through the aisles of a bright and shiny super market.  She picks up a six pack of Coke and notices the label: \"New Coke -- It Tastes Great! And it's Good For You!\"  The housewife smiles widely and enthusiastically tosses it in her cart.  SERIES OF CUTS: The housewife grabbing different products, marveling at the new, improved features: \"Cures Sadness!\", \"Tastes Better than Real Chicken!\", \"This Candy is All Your Body Needs To Survive!\"  With a full cart the housewife wheels it to the checkout counter to find swarms of people already there, all of their carts bursting to the brim with new, exciting products.  Everyone looks excited and happy.     He's watching the TV with a bit of worry on his face. He turns to Greg who is eating a stack of cookies and washing it down by gulping from a liter of coke.   You should slow down there, Greg.  Just because the package says it's not bad for you doesn't mean you have to gorge yourself on it.  That's just stupid.  I wish that worked for me, Greg.  Nevermind. I'll see you around.   Mark drives while we take in a bit of his world, highlighting the various changes he's wrought.  A homeless man stands on the street corner with a sign that now reads, \"Screw it. I'll be in my mansion soon.\" He has a big smile on his face.  The same business man pulls up beside Mark's car, this time eating a giant donut and talking loudly into his cell phone.   Yeah. So are you going to apologize?  Nothing's really changed. I gave people the Man in the Sky, made myself rich and successful, told the world they can eat whatever they want and feel good about it. Everyone's happy but me. Because I'm the only one who knows it all... isn't. I made it all up. You're not up there living in a mansion. You're right here. In the ground. That's all. And I'm the only one who knows that. And the one thing I want I can't have. Because the world is too stupid to change. The world only cares about what they can see, and what they can know, and what they're used to and what... makes sense. No one listens to what they really want. And that's why I'll always just be a loser, grandma. And that's why I'll always be alone.   With a beer bottle in his hand Mark searches through his kitchen drawers for a bottle opener. He opens a drawer and something catches his eye.  ANGLE ON: The envelope which reads, \"MY INVENTION\".  Slowly Mark pulls it out of the drawer and stares at it.  The sound of his front door opening startles him and Mark shoves the envelope into his back pocket.   Who's there?  Sure.  Haven't seen you much lately.  Don't do it.  No point really.  So don't marry him.  No you won't. Not to me you won't. I love you. If you really love someone it doesn't matter what they look like.  Do me this favor. Just one favor. Don't accept everything you see. Don't just do something because that's the way it's done.  Think about what you want. Find out what you really want. And if it's not the same as what I want, well then I'll know that and I'll never darken your doorstep again. I want you. What do you want?  Please don't. Will you just stay a little bit longer? I don't want to be alone. Just sit with me.   Mark stands before the mirror, dressed in a suit, putting on a tie.  Greg pokes his head into the room, dressed in a suit as well.   Yeah.  Me.  Yes I can. You've got shmuck genes.  And I love her. Jennifer, don't marry him. Is this what you really want?  All right. I'm done. Goodbye.  What?  So am I.  No.  Because I couldn't cope with the look on my grandmother's face.  I'm not sure. I just did it.  I mean just that. You'll always be beautiful to me.  It doesn't matter.  Me too. Everything is so hard. Nothing is easy anymore.  What?    No. But I'm sure it won't be long.  I'm not sure. I don't think everyone will understand.  Praise the Man in the Sky.",
        "Anthony": "Wow, you look really depressed today. That's going to make this so much harder.  Mark, the 1300's are boring. Nothing interesting happened in that century. Nobody cares about the post-Roman, pre-enlightenment era. The last few scripts you turned in were depressing.  It's not totally your fault, Mark. You got stuck with a bad century.  Give it up Mark, it's not like something new is going to have happened in the 1300's. At Lecture Films we're no longer interested in searching through the less well- known historical periods for great events, we just want to take the big name Reader's of the day and have them read the historical events that people know and love: the holocaust, D-day, the birth of electricity. These are the stories people want to see, because they know them. They find comfort in them.  Do you think I could come back and do this tomorrow? I just got very nervous about firing you. I don't do well with confrontation.    They're going to fire me any moment, I just know it. I'm really, really horrible at my job. I don't know anything about movies. I don't even like movies. I like sports. Head of development, what does that even mean? I'm not a smart person. Okay, talk to you later.  That was the head of the studio. I'm very scared that you're mad at me about the whole firing thing.  Oh good, because I feel really bad about it. I mean, I would be horrible at your job too. I would be horrible at any job in this place. I love sports.  Why are you here?  I knew it.  I don't do well with other people's life changing events.  What is it?  When does it take place?  I told you we're not interested in Black Plague movies here, Mark.  Yeah, but is there a movie there?  Start reading.  What?!  I want everyone in here now! We've got a BIG ONE.  Please, Mark. Continue.  Mark, tell us what it's called.",
        "Anna": "",
        "McDoogles": "",
        "Greg": "Lately I don't like Indian people. I don't like white people even more though. I fucking hate white people. I fucking hate people.  Third cousin. She's hot right?  Way out of your league. Dunno why you bothered.  Your life is still better than mine.  Lately I've been crying in my sleep and waking up in a pool of urine.  So, what are you going to do now?  Doubt you'll find one. Not much need for an out-of-work writer specializing in the Black Plague.  I'm the best you're gonna get, man. Call me later.  Huh?    It amazes me that I never knew your real name. Doug is good. It suits you.  It's Doug.    Mark suits you much better.  I knew it.  I've always wanted a black friend.  Fantastic.  I didn't know they still had those.  Aren't you scared you'll get bitten one day?  When's your launch date?  I love your work.  If I could do anything in the world?  I'd bone bitches asses.  If I could change things I would make all the hot chicks bone me.  Where are you going?    Bone chicks asses. That's what I'd do.  What else would you do, dipshit?  What?  I'll drive.  I'm just as hammered as you. But I don't care if I get arrested. I'm trying to hit bottom.  Here comes bottom.  I don't want to go to jail.  Yes.  Wow, that's high.  Stop laughing, I'm sick.  Oh good!  Stupid stomach flu. Where are we going?  What are we doing here? We don't have any money to throw away.  What is that, a few hundred bucks? That's not going to last us very long.  No. I have a stomach flu.  Oh come on, roulette is the stupidest game of them all. It's pure chance, no skill whatsoever.  You've never had a lucky day in your life.  You did it. You just, like, quadrupled your money. You lucky son of a bitch.  Do it again.  This is the most amazing night of my life.  It amazes me the winning streak you're on. You must be the luckiest man in the world.  It was like we couldn't lose.  Do you have a system?  Well, with your system in just a few weeks I figure we could be the richest people in the world.  Well, here's what I'm thinking. We take all the money in the world... and put it on black.  That's exactly what we'll do.  Well, they'd just have to.  Well, they'd better find it. They can't let us bet if they're not going to pay us back. They'll have to just give us the casino.  Then we'll go to another casino.  So we own all the casino's?  And if we win we can't pay us back because we already have all the money?  Only one thing we can do then.  Take ourselves into the back room and break our own fingers.  I brought pizza. How come you never told me we all get mansions?  Inventing the bicycle is one thing, but this...  Good luck out there, man.  Who was that?  I don't know why we're laughing. It's really probably very sad for those people.  Maybe the Man in the Sky will tell you something new.  Ugh, this shit is so bad for you. I really shouldn't drink this.  It would be the happiest day of my life.  Why's that?  But it tastes so good.  No it's not.  See?  You look sad. Here, have a brownie. They'll cheer you up.  What?  We're gonna be late.  Makes sense people would start getting married at these places. I mean, who you marry decides who's mansion you're going to live in one day. It's a big decision.  What's going on out here? Everyone's just sitting in there. Are we gonna finish this wedding?",
        "Frank": "Hi Mark. How's it going?  I spent the whole night throwing up pain killers because I'm too afraid to take enough to kill myself.  Bye.  Mark. How's it going?  Really?  Awful. I was doing some internet research last night about suffocation suicide. I'm probably going to give that a try tonight.  Bye.  Yeah?  Why not? I'm miserable. And no one will care.  You're a loser, though.  They are?  My job's actually fine.  What about the depression?  Really?  Wow. Man, and that suffocation thing really seemed like a good idea.  Okay. Well, my night's open now. You want to hang out later?  I'll see you after work."
    },
    "imdb_rating": "6.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTU2OTQzOTc1Nl5BMl5BanBnXkFtZTcwNDM5MDE4Mg@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "It's a world where everyone tells the truth - and just about anything they're thinking. Mark Bellison is a screenwriter, about to be fired. He's short and chunky with a flat nose - a genetic setup that means he won't get to first base with Anna, the woman he loves. At a bank, on the spur of the moment he blurts out a fib, with eye-popping results. Then, when his mother's on her deathbed, frightened of the eternal void awaiting her, Mark invents fiction. The hospital staff overhear his description of Heaven, believe every word, and tell others. Soon Mark is a prophet, his first inventive screenplay makes him rich, and he's basically a good guy. But will that be enough for Anna?—<jhailey@hotmail.com>",
    "name": "The Invention of Lying",
    "genres": [
        "Comedy",
        "Fantasy",
        "Romance"
    ]
}