{
    "filename": "Iron-Lady,-The_script.txt",
    "imdb_id": "tt1007029",
    "imdb_url": "https://www.imdb.com/title/tt1007029",
    "characters": [
        "Cleaner",
        "Young Margaret Thatcher",
        "Young Denis Thatcher",
        "Margaret Thatcher",
        "Susie - Margaret's Secretary",
        "Female Guest 1949",
        "Muriel Roberts",
        "Hostess 1949",
        "Alfred Roberts",
        "Grey Suited Guest - 1949",
        "Beatrice Roberts",
        "Host 1949",
        "Carol Thatcher",
        "June - Housekeeper",
        "Denis Thatcher"
    ],
    "dialogues": {
        "Cleaner": "",
        "Margaret": "How much is the milk?  Too much. Much too much butter.  Milk's gone up.  49p a pint.    Yes.  Here we are.  No no no no. The grey.  Yes.  ...Definitely the grey.  Oh, I haven't had a chance to look at that yet, dear.  Blot it...Blot it..  Wear your scarf. There's a chill out there.  I'm fine, thank you Susie.  Yes. Frightful.  Yes, of course, dear. Today.  What are they playing?  Silly man.  He hasn't got his scarf on.  I'll go.         What have you got on your head?  You look ridiculous.      I didn't know that you were dropping by today, dear.  Jaqueline...  Of course. We're having halibut.  Denis!    We must never, ever, ever give in to terrorists.  Oh, below the knee I should think.  No! Don't move those. I haven't finished sorting them.  There was no milk.  I am not for the knackers yet.  If I can't go out to buy a pint of milk then what is the world coming to. Really Carol, please don't fuss about it. You've always been like this, fuss fuss fuss. You must find something better to do with your time. It's most unattractive in a woman. When I was your age the last thing I wanted to do was fuss around my mother.  Obstinate.  Pearls. I'll wear the pearls.  There they are. My little twins. Thank you, dear.  Jacqueline.  Yes-  Yes I remember-  I've always preferred the company of men-  Well I don't like coalitions, never have...  Oh, yes, to his core. And Mayor of Grantham.  Yes.  Oh, yes. It was a family business.  That and a degree from Oxford.  (hushed aside to  What I do think is that a man should be encouraged to stand on his own two feet. Yes we help people of course we help people. But for those that can do, they must just get up and do. And if something's wrong, they shouldn't just whine about it, they should get in there and DO something about it, change things.  Can serve very well for the people of Dartford too.  I know much more than those who have never lived on a limited income. Just like the man or woman on the street, when I am short one week, I have to make economies the next.  A man might call it fiscal responsibility, a woman might call it good housekeeping.  Or woman?  Where?  No, uhm, yes - we have always lived alongside evil. But it has never been so patient, so avid for carnage, so eager to carry innocents with it into oblivion.  Western civilization must root out this evil, wherever it hides, or she risks defeat at the hands of global terror in a nuclear age. Unimaginable!  Yes. Clever man. Quite a smoothie.  You don't mind if I sit down...  It used to be about trying to do something. Now its about trying to be someone.  Good night to you.  Can you do the clasp, I can't quite -  Thank you.  What does Mark think about it?  Yes. Tell him to come up. I want to talk to him about it.  Well tell him to come up and see me after he's kissed them good night, would you Carol darling?  You look exhausted, dear. You really must try to get some sleep. Taxis'll be few and far between at this hour...  Good night, dear.  Disaster.  Not splendidly enough.  What game?    Yes. Yes!  I love you so much but...I will never be one of those women Denis - who stays silent and pretty on the arm of her husband. Or remote and alone in the kitchen doing the washing up for that matter.  No - one's life must matter, Denis. Beyond the cooking and the cleaning and the children, one's life must mean more than that - I cannot die washing up a tea cup.  I mean it Denis, say you understand.  There they are, my little twins. Mark...  You look happy.  They grow up so fast.  Mark.  There they are, my little twins. Mark...  You look happy.    The right honourable gentleman knows that we have no choice but to shut down the schools!  Because his union paymasters have called a strike deliberately to cripple our economy. Teachers cannot teach when there is no heating, no lighting in their classrooms. And I ask the honourable gentleman, whose fault is that?  If the right honorable gentleman could perhaps attend more closely to WHAT I am saying, rather than HOW I am saying it, he may receive a valuable education in spite of himself!  Yes...  Prime Minister, with the Miners' leader calling today for the army to mutiny in support of the strikes, this seems the wrong time for conciliation.  Right. The only thing you should remember is that everyone else is either reckless or inept. And often both.  One must be brave if one is to take the wheel-  Move over... Move to your right a little bit...  Carol!  To the right. Move to the right!  So sorry! Terribly sorry!  Have you been trying to make breakfast? For Goodness sake, Denis!    I'm going to run for Leader of the Party.  What's she on about?  Oh, right. Of course.    But he's weak, and he's weakened the party. One must know when to go. You're shaking.  Goodness me! What is the matter with everyone this morning?  And do you need a rest?  We both know that it's highly unlikely that I would ever be elected leader, I'll never be elected leader. But I will run. I will run. Just to nip at their heels and make them reaffirm the principles on which the Conservative Party must stand. There's so much to do.  Denis, you married someone who is committed to public service, you knew that. And it is my duty -  Where did you go?  Yes.  When did I lose track of everyone?  Oh that's rather easy to answer, actually. They are unafraid of success.  We in Great Britain and in Europe are formed mainly by our history. They on the other hand are formed by their philosophy. Not by what has been, but by what can be. Oh, we have a great deal that we can learn from them, yes. Oh yes!  It's all very well to talk about changing my voice, Mr Reece, but for some of my colleagues to imagine me as their leader would be like imagining, I don't know, being led into battle by their chambermaid. It's my background, and my sex. No matter how I've tried, and I have tried, to fit in, I will never be truly one of them.  Prime Minister?! Oh no. Oh no no no. In Britain? There will be no female Prime Minister here, not in my lifetime. No. And I told Airey, I don't expect to win the leadership, but I am going to run. Just to shake up the party.  Gentlemen, I am in your hands. I may be persuaded to surrender the hat. But the pearls were a gift from my husband on the birth of our twins and they are absolutely non-negotiable.  Maaaaaaaaaaaa.    (a little more  Denis.  You are the backbone of our nation! Small firms like Loveday's Ice Cream. How are you? So nice to meet you ladies.  I'll just have a small one, because I'm watching my figure. That's for you young man!  I passionately believe it's the growth of small businesses into larger ones that is critical for Britain's future.  It has to be something icy on a stick for Denis.    The Trade Union Movement was founded to protect workers. Now it persecutes them. It stops them from working. It is killing jobs and it is bringing this country to its knees. I say enough. It's time to get up. It's time to go to work. It's time to put the Great back into Great Britain!  Oh Airey...  Oh, thanks Airey. Goodnight.  No. No, no! Airey!  Now, as the test draws near, I ask your help. That together we can shake off the shackles of socialism and restore to greatness this country that we love so much. And the only way is for the Conservative Party to win!  I should just like to say that I take very seriously the trust the British people placed in me today, and I will work hard every day to live up to that responsibility. And now, I should like to share with you a prayer of St Francis of Assisi: Where there is discord may we bring harmony... Where there is error may we bring truth... Where there is doubt may we bring faith... Where there is despair may we bring hope..  Shoulders back, tummies in!  Oh. Thank you, Michael.  I'm perfectly healthy. There's no need for any of this.  Really it's becoming quite tiresome.  You. I was on my own for twenty four years before I met you and I can manage perfectly well without you now. So will you please go away and stop bothering me.  No  No.  Yes, I sleep. Four, five hours a night.  And I stay up late. I always have.  Yes. Of course.  My husband has been gone for years. Cancer.  Yes. It was my idea. To Oxfam. Perfectly good stuff. People can use these things.  What? What am I `bound to be feeling'?  People don't `think' any more. They `feel'. `How are you feeling?' `Oh I don't feel comfortable with that' `Oh, I'm so sorry but we, the group were feeling...' D'you know, one of the great problems of our age is that we are governed by people who care more about feelings than thoughts and ideas. Now thoughts and ideas. That interests me. Ask me what I am thinking-  Watch your thoughts, for they become words. Watch your words, for they become actions. Watch your actions, for they become habits. Watch your habits, for they become your character. And watch your character, for it becomes your destiny. What we think, we become. My father always said that. And I think I am fine. But I do so appreciate your kind concern.  Oh, do please answer that.  It might be someone who needs you.  Enough. Denis, enough!  When the Himalayan peasant meets the he-bear in his pride -  (sudden/like a  If I can't hear you then I can't see you. And if I can't see you then you are not here.  And if you are not here, I am not going mad. I will not...I will not go mad.    They're unveiling that portrait of me at Number 10 next month. The invitation's on the mantelpiece. So there'll be Churchill, Lloyd George and me. Just the three of us.  I said I didn't want any big fuss but they insisted..  Denis?  Yes, but in order to arrive at the palace on time, Geoffrey and I are will be walking out of that door in 15 minutes. As you can see -  Really. How much is a pack of Lurpak?  Butter, Francis. Forty two pence. Anchor butter is forty pence. Flora margarine, still the cheapest, is thirty eight pence. I can assure you I am not out of touch.  What - did you say?  Don't try to hide you opinions. Goodness me, I'd much rather you were honest and straightforward about them - instead of continuously and damagingly leaking them to the press. Well?  Ah. Worried about our careers, are we?  Gentlemen, if we don't cut spending we will be bankrupt. Yes the medicine is harsh but the patient requires it in order to live. Shall we withhold the medicine? No! We are not wrong. We did not seek election and win in order to manage the decline of a great nation.  The people of this country chose us because they believe we can restore the health of the British economy and we will do just that! Barring a failure of nerve.  Anything else?  Thank you. You saved the day once again, Crawfie, you're an angel.  I don't expect everyone just to sit there and agree with me. But what kind of leader am I if I don't try to get my own way - to do what I know to be right.  There must be closures of uneconomic coal mines, we seek only an efficient industry.  There are those who would say hold back, there are those who would make us retreat -  But we shall never give in to them. We shall never waver, not for a second, in our determination to see this country prosper once again.  And now, it must be business as usual.  I know, I'm coming DT. Nearly there -      That's when I thought I'd lost you.    How is... How's... Sarah?... And the children..?  ...Oh... You can't... That's a pity... I was hoping to see you... No really darling... That's fine... Of course... another time... Lovely Darling... Can't wait...Yes...    That was Mark. Not able to come.  Well it costs him a great deal to fly everyone up here.  Yes. He moved to Paris when he was fourteen. He played the King of Siam 4,625 times on the London and Broadway stages. What are you doing?  You're dead, Denis.  Gentlemen, the Argentinian Junta - which is a fascist gang - has invaded our sovereign territory. This cannot be tolerated. May I make plain my negotiating position. I will not negotiate with criminals or thugs. The Falkland islands belong to Britain, and I want them back. Gentlemen, I need you to tell me today if that is possible.  Forty-eight hours?  But?  Why were the islands left without any naval protection?  Did we?  I don't think we should be worrying about money at this point, Geoffrey.  The government has now decided that a large task force will sail, as soon as all preparations are complete.  Just like Hawaii, I imagine.  1941, when Japan attacked Pearl Harbour. Did America go cap in hand and ask Tojo for a peaceful negotiation of terms? Did she turn her back on her own citizens there because the islands were thousands of miles from mainland United States? No, no, no! We will stand on principle or we shall not stand at all.  With all due respect sir, I have done battle every single day of my life, and many men have underestimated me before. This lot seem bound to do the same but they will rue the day.  Now, shall I be mother?  Tea, Al, how do you take your tea? Black or white?  Is this ship a threat?  Sink it.    The families. I must write to them...  Foreign Secretary...    As the only Prime Minister in the history of our country who is also a mother with a son of my own, I can imagine your agony, and your grief.  We congratulate the men and women of the armed Forces for their skill, bravery and loyalty to this country.  We were faced with an act of unprovoked aggression and we responded as we have responded in times past: with unity, strength and courage, sure in the knowledge that though much is sacrificed, in the end, right will prevail over wrong.  And I put it to the Honourable Member opposite that this is not a day for him to carp, find fault, demand inquiries- they will happen I can assure him of that for we have nothing to hide- no, this is a day to put difference aside, hold one's head high and take pride in being British.  I don't agree in any measure!  I don't think the country is ready for it yet.  Our policies may be unpopular, but they are the right policies.  There it is again! Why not?  Nonsense. Arrant nonsense. This is a simple proposition. In order to live in this country, you must pay for the privilege- something, anything! If you pay nothing, you care nothing. What do you care where you throw your rubbish? Your council estate is a mess, your town, graffiti, what do you care? It's not your problem , it's somebody else's problem- it's the government's problem! YOUR problem is, some of you, is that you haven't got the courage for this fight. You haven't had to fight hard for anything. It's all been given to you- and you feel guilty about it! Well, may I say, on behalf of all those who HAVE had to fight their way up, (and who don't feel guilty about it) we resent those slackers who take, take, take, and contribute nothing to the community!  And I see the same thing, the same cowardice in our fight within the European Union, to retain British sovereignty of Britain, the integrity of the pound! Some of you want to make concessions. I hear some of you agree with the latest French proposals. Well, why don't you get on a boat to Calais? Yes, why don't you put on a beret, and pay 85% of your income to the French government!  Right. What can we realistically hope to achieve by the end of session, Lord President?  And why have we not made more progress to date? What is that? Is that the timetable? I haven't seen that. May I see it?  The wording is sloppy here, and here.  I do say so.  This is ridiculous. There are two \"T's\" in \"committee\"!  This is shameful. Shameful! I can't even rely on you for a simple timetable! Are you unwell? Yes you are unwell. Give me the pencil, give it to me!  If this is the best you can do I had better send you to hospital, and I shall do your job as well as my own and everyone else's. Gentlemen.  As the Lord President has come to cabinet unprepared, I am obliged to close this meeting.  Good morning!  Geoffrey-  I am the Prime Minister.    I do think my time is best spent seeing an end to the Cold War, don't you? After all this time they know what I stand for.  Treachery!  It was the people who put me here -  - it's up to them to tell me when to go.  Oh Denis.  154                  I am the Prime Minister.                       154  The Right Honourable gentleman is afraid!  They believe in striking, I believe in working!  Despicable and cowardly -  I offer my resignation after eleven and a half extraordinary years -  -proud to have left Britain in a much better state than when we took office.  What's this then? A radio... How useful.  All those years of taking the tough decisions, does any of it matter now?  What?  These inept placators.  Vacillators! Poll takers.  So busy taking the pulse of the public!  (pulling down a rack of Denis's black oxford shoes onto the floor These...weak...weak...weak...wea.. .weak...Men!  Don't they know if you take the tough decisions, yes people will hate you today but they'll thank you for generations.  (seizing shirts and  All I wanted was for my children to grow up well and be happy - happier than I was certainly. And I wanted you to be happy of course. Were you happy, Denis? Tell me the truth.  Denis? Denis?  Here's your bag. You're all packed, sorted.  (seeing he is walking away in his socks Denis wait...Where are your shoes? You can't go without shoes! Not yet.  Yes...Steady...  Steady...Steady the buffs...  154d                 NO...Not yet...Denis. Wait...I              154d  Denis...Please...No...Not...Don't. ..NO...I don't...I don't want to be on my own.    Yes, all sorted. Finished.  I was just going to get dressed.  Oh. No, you do it.  No, dear, I'll do it.  No no. I'm not going anywhere.",
        "Thatcher": "HEAD, grimacing with one eyeball blinded and the other detached and hanging bloody on a cheek.",
        "Muriel": "",
        "Roberts": "",
        "Hostess": "And did you help, err, in the...shop?  Ladies shall we ?",
        "1949": "The packed town hall, ALFRED ROBERTS in full flow on stage.",
        "Alfred": "Did someone cover the butter?  Margaret-  Good girl.  Tomorrow, no matter what they do, it'll be business as usual.  What is the life blood of any community? It's business....  Not just big business but small businesses, like mine.  We on this island are strong. We're self-reliant. Sometimes we're plain bloody minded.  But we also believe in helping  Never run with the crowd, Margaret. Go your own way.    Don't let me down Margaret.  We on this island are strong. We're self-reliant. Napoleon called us a nation of shopkeepers.  He meant it as an insult but to me it's a compliment. That's why he couldn't beat us, and that's why Hitler can't beat us.  We Conservatives believe in giving people the freedom and opportunity to fulfil their own potential, especially the young. There's no good in pretending we're all equal, we're not all the same, never have been, never will be. We should encourage our children to aspire to achieve more than we have, for our children today will be the leaders of tomorrow.",
        "Beatrice": "Leave it.  (passing/hushed     (passing/hushed",
        "Host": "...Attlee has his sights set on the steel industry, you mark my words.  So was your father a political man, too, Miss Roberts?  And a grocer as well!  And did you help, err, in the...shop?  With all due respect, Miss Roberts, what may have served in Grantham-  Ladies shall we ?  Miss Roberts, do join the ladies.  Well. That's told us!",
        "Carol": "Can I suggest you remove the sticker from the back of your car.  Well then take the sticker off! I call that false advertising! I would say keep the change, but there isn't any change.  Hello June, any news? I've brought every bag I could find.  Hello Ma. Bloody taxi driver. Wouldn't take my card. I said don't have a sticker saying you take Visa and then insist on cash. Can you believe it? I was rummaging around the bottom of my bag. He didn't get a tip.  (Dumping her stuff all over the place Yes, you said yesterday...You wanted to make a start on Dad's things. The cupboards ? Then I can help you dress.  You've got Michael and-  Coming for dinner tonight.  Oh God. Isn't it terrible?  They think it's Al Quaida -  I'm sure they've already-  Now ma, are we going long or just below the knee tonight?  I hear you went out today...You mustn't go out on your own Mummy. We've talked about that.  Call Robert he'll get it for you if June's not up-  No one is saying that.  What?  It's nearly all familiar faces, William, Michael and his lovely wife-  And then there's Peter, James R and James T and that very nice man-  - we met last year.  I think he's bringing his new lady friend just to mix it up a bit. We're rather short on women - but I'm sure we'll manage-  Ma?  The bombings, mummy. Today?  We were just talking about them?  Great to see you, thank you very much for coming.  OK...hold on to me...that's right.  You've got an eyelash.  Make a wish.  I spoke to Doctor Michael today-  He is very good and very expensive-  ...I know you're not due to see him for another month but I've spoken to him and he can fit you in tomorrow.  Just for a check up. Ma please-  Mark?  Mark's with Sarah and the children.  He's not here Mummy.  Mark lives in South Africa...  ...you are not Prime Minister anymore and Dad is...Dad is dead-  Righty-ho. Night night Ma. Sleep well.  I swear, it's all gone completely out of my head. My driving instructor thinks I should pass but I feel as if I've hardly had any lessons. Ridiculous isn't it? Maybe third time lucky.  Right-o.  But if I move to the right aren't I on the wrong side of the road?  Well he's in the way!  Hey, look at me, driving!  Thanks Ma, that was terrific! I really feel I've got a handle on it now.  You should have seen us, Pa.  Mummy took me for a test drive - We went absolutely everywhere. All over the place -  Silly me!  All the time I thought I was having a driving lesson, it was all about my mother, just for a change!  Mummy-  My God, Mum. Are you alright? Mummy you should have called for help, silly old sausage. Have you not even been in your bed properly? You've done all this?  Yes well don't worry about all this. June and I will crack on with it.  ...Shall I call someone, see if anyone can come over and do your hair?  Right, I'm off June.",
        "Denis": "I like butter.  Good grief! We'll have to economise. I suppose we could always sell the car. Or take in paying guests!  Watch out. She's on the prowl.  You sure?  Righty ho. Boss knows best.  Don't let her take my paper away.  Atta-girl.  Damn.  Now look what you've done. Are they to keep the loonies out or you in?  I'll be off then.  (without taking his  Sun's not quite over the yard arm. Time for tea.  Found it in the cupboard and thought bugger it, it's Friday, why not fancy dress?  Bosslady no like?  Oh, rumbled!  It'll be fine. Come on, get your head down, it's ten to three, for God's sake.  Now take it easy, Margaret.  Four down, 9 letters.  Something b something t something n...something something somthing...Refusal to change course-  Start on the outside...  ...and work your way in.  Eat!  Hang on...Hang on...Hang on...  You shaved thousands off their majority. You did splendidly.  Ah I see. Self pity.  No one is saying you don't need a safe seat. You deserve a safe seat. But it does not come unless you learn to play the game a little.  You are a grocer's daughter-  - in their eyes. A single grocer's daughter. But if you were to become the wife of a moderately successful businessman-  You'd get to parliament, and I'd get to be the happiest man in- in wherever they select you. Margaret, will you marry me?  Well ?  What ?  (trying to retain the  That's why I want to marry you, my dear.  Now eat.  Cornwall, wasn't it? Bloody hell... Look at `em, little imps. You never really got golf, did you?  Yes, I do, don't I? You're drinking too much.  Whatcha doing?  Not like you. Looking back.  Don't want to dig around too deep, M. Don't know what you might find.  You can rewind it, but you can't change it.  Cornwall, wasn't it? Bloody hell... Look at `em, little imps. You never really got golf, did you?  Yes, I do, don't I? You're drinking too much.  Whatcha doing?  I can boil a bloody egg.  What for?    It's her driving test this morning!  Are you saying you want to be Prime Minister?  The Prime Minister has been very loyal to you, MT.  I can do it!  I've told you what the matter is. The business is a bit rocky at the moment and the Doctor thinks I need a rest.      Don't worry about me, I'll be fine!  South Africa.  How many days passed before you realized I was gone? Probably had to ask the cleaning woman where I was.  Too busy climbing the greasy pole  Yes MT!  This is it, steady the buffs old girl.  Just let them look under the bonnet, MT. Check everything is hunky dory.  What is?  What about that medicine man, eh? Ah. Cold supper. Standards are slipping Margaret.  Well you really gave it to that quack didn't you, darling ? Just like the old days! Hallucinations my eye!  How dare he?  But then you give us all the run around, don't you?  I know you can hear me, sweetheart, so there's no use pretending you can't.    She does it in the end. Kills him-  I don't know why you're being so scratchy.  It's not as if you've got anyone else to talk to.  You know, it's a marvel to me that you can still quote huge chunks of Kipling but try remembering the name of that woman who's just made you that godawful cold collation... No? Come on... you can do it... month of the year... one syllable... rhymes with moon ...  June! Bingo. Knew you'd get there in the end. \"When the Himalayan peasant meets the he-bear in his pride, He shouts to scare the monster, who will often turn aside, but the she-bear thus accosted rends the peasant tooth and nail. For the female of the species is more deadly than the male...\"  Am I out of the doghouse yet?  Come on love, get to bed. I don't know why you do this to yourself every year, it's a speech at conference, not the Magna Carta!  Time to call it a day, darling. It's ten to three, for God's sake.  My shoes!    There you go, making excuses for him. Now look where it's got you.  Did you know Yul Brynner was a gypsy from Vladivostok?  (turning round  Ah. Well, if I'm dead... who are you talking to? Shall we dance ?  Thatcher, bed.  Well done, M.  GOTCHA! Well that paid off old girl! Your ratings soared! From the most hated Prime Minister of all time to the nation's darling...The world was at your feet, and Britain was back in business!  M, I really think you should come home and defend yourself old girl. Heseltine is campaigning ferociously.  Margaret, you can't let them do this to you. Please, boss.  They'll destroy you.  Throw in the towel now, love. Don't let those bastards see you humiliated. You just won't win, darling. Not this time.  Steady, MT.  The greatest Prime Minister since Churchill deposed by a bunch of spineless pygmies!  It's all been turned to mush!  By these fools! These lily-livered pinkos!  Very good! These vacillators.  Popularity seekers.  Weak -  Or forget you entirely and chuck you out with the rubbish!  And you did, love, you did.  Steady.  Steady the buffs -  You're going to be fine on your own, love. You always have been."
    },
    "imdb_rating": "6.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BODEzNDUyMDE3NF5BMl5BanBnXkFtZTcwMTgzOTg3Ng@@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "Elderly and a virtual prisoner in her own home due to her concerned staff and daughter Carol,Margaret Thatcher, Britain's first woman prime minister, looks back on her life as she clears out her late husband Denis's clothes for the Oxfam shop. Denis is seen as being her rock as she first enters parliament and then runs for the leadership of the Conservative Party, culminating in her eventual premiership. Now his ghost joins her to comment on her successes and failures, sometimes to her annoyance, generally to her comfort until ultimately, as the clothes are sent to the charity shop, Denis departs from Margaret's life forever.—don @ minifie-1",
    "name": "The Iron Lady",
    "genres": [
        "Biography",
        "Drama"
    ]
}