{
    "filename": "Long-Kiss-Goodnight,-The_script.txt",
    "imdb_id": "tt0116908",
    "imdb_url": "https://www.imdb.com/title/tt0116908",
    "characters": [
        "Mitch Henessey",
        "Luke /Daedalus",
        "Man in Bed",
        "Perkins",
        "One-Eyed Jack",
        "Raymond",
        "Caitlin",
        "Hal",
        "Girl #1",
        "Earl",
        "Trin",
        "Timothy",
        "Samantha Caine (Charly)",
        "Nathan",
        "Girl #2"
    ],
    "dialogues": {
        "Mitch": "You want I should hire actors, for Chrissake? These guys are cheap, they work for food.  Trin, I'm pissin' myself over here, you're so funny. What's this?",
        "Henessey": "Yep. Yep, yep, yep.  'Bewitched', yeah. Good show. Chick lived with a faggy guy, then in the last season it was a different faggy guy. Okay. Here's what we do; get on the horn to amnesia chick, tell her yes. Then tell her in 1967 she promised to give me a blow job. Worth a try, right?  ...and here's the jail here, see...? Escape chute for the Borian, he's a dinosaur guy, Moves quick, don't take no shit neither. See, you can make him shoot the guard -- ah, hell, look, I played with it a little myself, I'm sorry.  Hey, you go ahead, um... hope you like the present.  Tell her I don't steal them locally.  Dear Ma: Filled out the child support stuff last week. Office got pissed, under ex-spouse I put \"Spawn of Satan, Dweller in Eternal Dark.\" Just being honest, Ma, lady wants me to die.  I'd go without a ripple, that's the truth. Ex-con. Ex-husband. Expired. Thanks, Ma, for hiding the truth from me for so long. Or maybe you believed in me. I miss you. I hope you believed, even for a day. No one did, Ma. No one at all. It's cold here. I'm sorry you're dead. Your son, Mitch.  Me. What's up?  Hell, no! Use your head, girl. Let the fucker squeeze the Charmin.  Hey--! Slow down. The kid's okay, she's in my car, what the hell is going on?      Hah?  Whatever. You cold?  Turn on the heater. It doesn't work, but it makes a very annoying noise which distracts from the cold.  You kidding? Pure luck. Plus my secretary used her feminine wiles. She's got two, one wile per side. Huge. No kidding, you can see 'em coming around a corner, you got time to comb your hair. Nice kid, you'd dig her. Ah. Here we are.  Putting my glasses in my cooooat...\"  I sing what I do so I'll remember it. \"Turning off the downstairs liiiight...\" You know?  Do me a favor. Say, \"Always after me Lucky Charms.\"  Thanks. Just needed to hear that.  See anything you recognize?  Unmailed envelope. Addressed to a guy.  Another guy's address. Two addresses, is basically what I'm saying.  Anything else in there?  Yeah, well take a look at this.  Whoa. Ms. Class, drive a little truck on the side, do you?  No, ma'am, it's just that... well, when we met you're all, \"Oh, fooey, I burned the darn cupcakes.\" Now, you go into a bar, ten minutes later sailors come running out, they can't take it.  What the hell...? Lemme check the scanner.  Why?  Where the shit did you get that?  Sam, Goddammit, you're gonna kill someone! Hey!  The diner...? That's half a mile away, are you fucking crazy?  How the fuck can you tell?  Aw, cut me a break, Fran. I been out eight months, I'm back doing skip traces, now you got me stealing fuckin' bicycles?  You. You're the matter. Look, you wanna keep going, good luck. I'm driving back to Ohio. You're free to come with me.  Goddammit, lady, I'm taking you *home*.  Yeah, matter of fact. Four years inside. Marion, Illinois, real shithole. Get in the car.  Seven years ago, Atlanta PD. Me and my partner, we handled a lot of impounded shit. Fucker hated me, boy. One weekend, when he was conveniently gone...? Some bearer bonds disappeared from his office. And lo and behold, when the police responded to an anonymous tip, you'll never guess what just happened to be sitting in my closet.    Now every dollar I hand my kid, he asks his mother did I steal it.  No more killing.  Nice crowd.  Who wouldn't be? Corner booth, there's a beaut. While you're doing her doggie- style you can pop the zits on her back.  Whoa. You remember your father?  Ms. Caine, last week at a party I ran into a girl I knew from college and we chatted for a few minutes. And it wasn't til I was driving home on the freeway that I remembered that I'd screwed her in the back of a car once. Everyone forgets.  No, see, all's I'm saying is you're not alone.  Fine. I gotta use the head.  Pork. On your nine.  So you shot a guy in the head yesterday. We wait outside.  Too bad. People shouldn't shoot other people in the head. Just themselves. During that show with the little girl who's a robot.  How do you know?  You think I'm gonna shove it down my pants? Shoot my damn dick off.  Ho, ho.  *Jesus wept*...!  Beautiful. Fuckin' beautiful.  *What happened to bulletproof*?  Got a tail.  Don't ask me, I just work here. Did you bump pelvises with him or not?  And you kid, Cathead --  Yeah, whatever. Um, could he be the...?  Enough. You're giving me a stiffy.  Relax. She's with Luke. That's his name, Luke.  Yeah, yeah, we weren't real big on what you told us. I had him call you an ambulance, so shoot me. Should be here within fifteen minutes.  The guy's story checks out. Sam knows things about him. Stuff only a lover would know.  Don't worry about it. Chick signs my checks, I'm gonna watch her get aced? Lie back down.  Cut me a break, nimrod. She's married with a kid.  How'd you know?  Tell me about Daedalus, what's his story?  Come again?  Where the hell...? I know I just heard that somewhere, something about a...  Oh, fuck.  Nathan, that son of a bitch has one in *his* leg.  Oh, Jesus...! That's how she knew all that shit, not from *dating* him -- she *studied* the fucker to take him out!                Ah, that hurt like shit!!  Same as -- virgins, *what*...?  No, I slug 'em in the jaw and yell \"pop goes the weasel,\" what the fuck are you talking about? Who are you??  I'm confused. Gimme a minute.  Okay. Let's say I buy it. You're actually a trained killer, Jesus, I can't even say it with a straight face. So then... Samantha, she...  Fabrication. And now she's just... gone? Forever and ever?  Pretty convincing act.  I mean, her personality, it had to come from *somewhere* --  Drink up. What's next?  Chapter. Can you trust them?  ...The lady's whacked, Trin, she's lost it and I want fucking out, now *call the Feds*. She's moving us tonight, I'll sneak out to this phone, call you back at midnight with the details.  All right, Charly. What did that accomplish?    Whoa, time out.  \"Charly.\" fucking unbelievable. Shame about the fat ass. I bet you were really attractive once.  No.  Did he make good?  Your father was murdered.  Okay, what's going on?  You kidding me? I'm an ex-con, lady. I wear a shiny suit, my tie's crooked, and the last time I got blown candy bars cost a nickel. Plus I'm ugly, so what's up?  Chemistry my ass. Know what I think? I think this is why you'd fuck me. To kill a schoolteacher. Bury any trace of her.  Sorry, I liked the schoolteacher. When she comes back, give me a call.  Oh, and call your fuckin' kid, will ya'? It's two days to Christmas, and she's under the mistaken impression that Mommy gives a shit.  Saving your life. Woulda got here sooner but I was thinking up the sandwich line.  What other guy -- ?   Don't be so sure, others have tried. The entire population, in fact. Look, about me...? I mean, what's up, you're this hot survival chick, I'm getting the feeling you don't need me anymore.  Dear Mom: I was tortured, now I'm in Atlantic City. The girl of my dreams just threw me out of a speeding car. Now more people will come an shoot me in the head. On the plus side, I won two bucks at video poker.  Found a use for me.  Why didn't you say so? Gimme a second while I pull it out of my ass.  What about it?  How would you know? Someone filed off the numbers.  What's in it?  Why me?  Shoulda known. Gimme the key.  Humor me: you're a paid assassin, then you fall off a cliff. Sink under the ocean, and when you come out you're a fucking schoolmarm, wanna tell me what happened?  Mmmm. Personally...? I'm thinking maybe Samantha Caine wasn't an act. Maybe you forgot to hate yourself for eight years, ever think of that...?  No, just some loser thought he could maybe understand, fuck it. I been there, you know. I'd kill for fucking amnesia. I'm with my boy and all I can think is I got reamed in the ass by three guys. Merry Christmas, son, here's a ball glove, did you know Daddy screamed when they carved the name in his back...? Mary, by the way. I pushed for Cindy, but hell. God, I'm tired. I never did one thing right, you know it, not one fucking thing. Not even accidental, that takes skill.       Jesus wept.  Sure. It's not your fault the gun accidentally went off in mid-air as you tripped and flew over the car.  Phone bill, Christmas card... Five buck, swell. You didn't have to kill him, you know.  What the hell was that?  Which phone? Where?  Shit. Service centers...! They list 'em on the back of phone bills, right?  Shut up and find me a gun. HK, MP-5.  Almost dark now.  Pass. Listen, you sure we're doing the right thing? We've got money, we could negotiate...  Not so emotional, I'm getting embarrassed with these outbursts here.  Yeah? How come you know so much about this fucking guy?  I'm here. Suppose you tell me.  What's the matter?  Who?  Let me go in.  I get by.    I was gonna say enjoy life, eat out more often.     Christ, lady, what are you doing in there, playing fucking mah-jongg? *Move*.  Are you fucking insane? You're talking about 10,000 people!!  I'll wait for you to rescue me.  Get fucked, you dumb bastard. Charly called Washington, by morning this whole place'll be crawling with Feds.  Yeah, well, that's what I'm saying, there's a couple Feds, they couldn't sleep, said they might come early. Fuck you, someone'll screw up. Just watch.  Who?  The patsy.  Fuck you.  You foxy bitch.  Charly, you there? Hello, Charly.  Behind the big garage. Is Caitlin with you?  Charly, Timothy rigged the tanker to go off early. We got fifteen minutes. No more.     Hello...! Charly...?  All right, I'll go in and get her, you watch my back.  So kill 'em for me, bitch, Christ, what are you good for?    Piece of cake.  Gracias.  Dear Ma: I'm looking at the ants, they're pretty great. Some really funny ants here, Ma. All these funny ants, think I'll stay and watch 'em awhile...     Yeah, yeah. What else, we got a fucking lightning rod on the roof...? No, Caitlin, *don't check*.  I think that's yours...  Sorry, can't drive... Are you okay...?  ...funny thing...? You aren't going to die... I am...  Hey, gorgeous... know something... you got your mother's eyes... don't let... nobody tell you different...  Scared... to be nobody... without a ripple... please... remember me... ...Love you...",
        "Luke": "I can't believe you don't remember dating me. Charly, please, you pursued me for months.  It's December, you'll remember. Right...?  Goddammit, he's *dying*. Let me call the poor bastard an ambulance!  Sure don't look like an ambulance, does it?",
        "/Daedalus": "",
        "Perkins": "This can't happen, Harry. The President's already up at night, prowling his sock drawer for double agents, and now we've got a fucking rogue on our hands.  Oh, for the love of Christ, who can be so fucking important?  *You*...! Are you crazy, coming here??  What...?  Who is it?  Perkins.  Charly...? Oh, my God, what the hell are you *doing*? Listen to me, I'm going to direct you to a safe house, get you on a plane --  Charly, you're being paranoid. It's not like it used to be, you're eight years out of date.  Congress won't authorize a dime, Charly. Chapter's on the way out, we've been reduced to a records- keeping agency, we *don't have enough money to kill you*, understand...?  Your way, I see. And if I say go to hell?  She mustn't threaten our success. Contain her, whatever it takes. But be *careful*. If it gets out you're working for me... we'll both be grabbing our ankles on the White House lawn.  She mustn't suspect a trap.  God. We're monsters, aren't we...? Forget Charly. Talk to me about tonight.  That...? Something to prove that I'm not a complete ogre.  See? The young one will have a doll to play with on Christmas. Very popular item. It... well, it pees. You put water in it and... oh, fuck you.  You know, Colonel, you ought really to have stayed dead. You don't know the rules of the game anymore.  Budget cuts, remember? Congress blinded us in Eastern Europe, Central America. Across the board, an intelligence blackout. We had to recruit any eyes and ears we could find, even if it meant going to former targets.  Interesting theory.  It's not without precedent. 1993, remember the World Trade Center bombing...? The CIA had advance knowledge, don't think they didn't. Worse, the diplomat who issued the terrorist's visa was CIA, they *facilitated* the bombing. Purely to justify a budget increase. Of course, they'd no way of knowing the terrorists would botch the job.  No. This time, the terrorist event will come off precisely as planned. This time the terrorists can't muck it up... because we've killed them and taken over.     Continue dying. Out.  Anthony, get me the President...  Charly, I know we've treated you poorly, please, it was just business --  You... you promise.  It's done. Now, you promise... you won't shoot me... won't make me get on the mine...?  Goddamn you, I can't hold him... You bitch... YOU FUCKING BITCH...!",
        "Jack": "Gotta be fuckin' kidding. No. No way. SHIIIT!!  Evening Charly. Long time.  I want my eye back, bitch.  Goddamn you. Fight me. What's wrong with you, *fight* me!",
        "Raymond": "Um... morning, Ms. Caine.",
        "Caitlin": "His name is Mr. Perkins, my Mom named him for me.  Swear.  How would you know?  Daddy, make her stop!  Tomato.  Tomato. Tomato. Tomato.  Put Perkins in the basket. He's luck.  Are the training wheels off?  Wait...! I'm scared.  Mom, I can't do it, swear --  Ouch--! I can't do it, it HURTS-!  My arm hurts, please take me home...!  Mom, no...!  My wrist hurts...!  Mommy...!          Mommy...  ...bug in a rug... man with white hair... says the same thing you say...  Mom, it's cold in here-!  Mommy...?  Don't cry. I keep these here. For lighting your candle.  Am I gonna die...?      Don't go away again, Please...!        *Mommy, no...*!  It's okay. I'm sorry I left, please wake up, come on please...     Mommy, get up now. You just stop it, Mommy, you stop being a little baby. Stop it, you're not dead, I know you're not dead so you get up now.  *Don't you die*, you get up now, Goddammit...! Life is pain, you just get used to it, and stand up *right this minute*, Mommy. Life is pain, do it, you bitch. *Do it*.  Hurry! The truck is a bomb!  *You're a bad driver! Who said you could drive*?  Don't hit the cars!",
        "Hal": "Aw, honey, I had teenage girls playing the wise men, what'd you expect?  Well, I thought they did fine.  Christ, guy's all over you like a cheap suit.  Oh, boy. Someone's gotta take my father home. I'm plowed.  Honey, you can't cook, I'm not wrong about this.  Tomato.  Onion, flying in.  Beautiful language.  She rode all the way home. She didn't fall, not once. She didn't cry. You're good. You should work with kids, you know that?  We can still make six o'clock mass, you coming?  Go away. With a detective. Jesus, it's the holidays, Sam --  No matter what you find, I'm not scared. Not of you. Not ever...  Just talked to Dr. Sullivan, she's gonna need the full braces. Even with your teaching, insurance won't cover it... I don't know what to do.",
        "Girl": "Mommy, the men on the mountain...!  Turn on the nightlight.  That's her?  That's who?    Swear?  Too weird.  We gotta stop using bums.  It was embarrassing.  Uh-huh. So, when they puke all over you is that, like, a refund?  There's nothing odd about it. I'm only sixteen.  What?  Look, what if I'm ignorant? It's my father, we never stay in one place, I never meet bloody anyone.",
        "#1": "That's her?    Ooh, j'aimerais la baiser. (Subtitle: I'd like to fuck her.  Man, I'd eat a mile of her shit just to follow it back to the ass it came from.  ...As I say, we can only apologize for the system, Ma'am, but it's confirmed that your husband is innocent of the crime for which he was imprisoned. This is a photograph of the actual criminal...  A petty thief, now deceased. I'll respect your wishes should you choose to file charges against the State Attorney...",
        "Earl": "Freezing my nuts off.  Right, you don't wanna be rootin' --  This is little Billy talking?  Yeah, yeah. Spare me, I got a prostate the size of a melon.  Seriously, half my life's a doctor's hand up my ass, I should marry the fucker.  It's not that fucking little Billy again, is it?  You're married what now, five years...?  You and Hal, how often you two...?  Don't get all snippy...  Goddamnit, I'm not drunk. Would a drunk man have this much raw talent?",
        "Trin": "New case, honest to God chick with amnesia. You want the job?  Wasn't there a lady on TV named Samantha? Had a magic nose or something.  Mitch, we got a bite on amnesia chick's photo. Found a guy remembers seeing her, fall of '87. He wants cash, should I grease him?  You kidding? Guy's hideous. I'll do it, but we're talking time and a half. Plus a night on the town when I get back, and *no cockfights this time*.",
        "Timothy": "It'll be over soon.  Last chance. What do you know about a town called Santa Claus?  No. You don't. I can always tell, you know... If someone's lying to me. A little skill of mine, something to trot out at parties.  Timothy.  I'm listening.  Nix. I'm just finishing up here. Then I'm going bunjee jumping.  All right, what's so fucking important?  I saw it, too. It's called \"Empty Nest.\" How the fuck is it my business?  Tap his phone, yes. And tell Daedalus I'm on my way. Timothy out.  For you. Another in a long line of bad investments.  Just saw the ring on your finger.  Do I know you from somewhere...?  Whoa. Back up. Total pickup line, let's forget I said that.  No, you don't, do you...? I'd know if you did. I can tell if someone's lying. Sorry to bother you.  Okay, people, I got what I needed. Wait until she comes out. Then do them both. Walk soft, we got local law.  East, they're going east. *Head them off*.         Look at her. She's not faking it, she doesn't know me from Adam.  We're running on schedule, I just secured the tanker. We're borrowing it from Carbide in South Carolina. Cargo listed as fire retardant.  You don't remember *at all*...? The greatest night of your life, shit, drown this ungrateful wench.  Okay, I'll signal Daedalus. Your money will be waiting, and Jack...? Do yourself a favor, do her and dump her, I'm serious. Don't get cute, try to play doctor first. I made that mistake.  It's me, your poor black cousin. The one you can't be seen with.    Your rogue bitch just took him out. Probably went shopping in his weapons storage too.  We're still on, Perkins. I've got the tanker, the chemist, all ready to go... but you gotta contain her, man. We gotta step on her hard and fast.  Wanna be a statistic, lady? You're about to have 2.4 children.  I know where you live. Close your mouth, you look like a fish. Merry Christmas.  It's me, I got your kid. Give your location, we gotta lose the cellular.  Okay, here's how we do it. Drive to Harrison, find their main bus stop. Pay phone, fifteen minutes. Better drive fast, after five rings I hang up.  I got your cellular number off a cast on her right wrist. Right below Mommy loves you... Picture of a panda. Dog, panda, it's got funky ears.  I want money, Charly. I know you've got numbered accounts, we all do. I'll let you know where and when. Fuck with me...? I'll blind the kid and shoot out her knees.  I'll be in touch.  It's done, she hooked. All I gotta do is set the ransom meet.  No way. She thinks I'm acting alone, remember? Say the word, I'll hand her to you on a plate.  The tanker's on its way from Charleston, ETA 1:00 a.m. One terrorist on ice, waiting to play patsy. What's in the sack?    Bogey.  Take her alive, Perkins wants her!  Good to have you back again, Chuck.  Make sure you get all of them.  Chuck, you give me the fuck of my life then try to stick me, come back from the dead, whack my boss... No sense lyin', I'm miffed.  You wanna know the plan?  Santa Claus -- small town U.S.A. personified. We drive the chemical tanker in tonight, park it. Add a catalyst, chain reaction, it goes hot. We evacuate. The mix heats overnight, goes critical at 312 degrees Celsius. 8:00 Christmas morning... Main Street looks like a meteor strike.  Those roads are treacherous this time of year. When we dump a car to the bottom of a ravine, with the corpse of Imn Al Rahman in it... get the picture?  Why? For old times' sake...?  And why exactly should I do that...?  Priceless. Can't believe it...  Kid's down there. What it is, Charly, they're gonna find you both frozen to death in the woods. Suicide pact.  The freezer's downstairs, Charly. Let's get it done.  Shit, this place is loaded with fumes, nobody light a fucking match. You check her for flammables?  Bears, yeah, yeah. Enough.  Chuck, I'm not a total creep. I'll make you a deal, okay? There's a knife in that box. Now, you and the kid, you're going to freeze, *but* -- if you kill the kid *by your own hand*...? I won't kill your husband. Serious. We're gonna open that door and you'll both be frozen solid, but I wanna know that you've cut your own child's throat.  Tell me where Charly keeps her money. She must have mentioned it.  We'll be gone by then, Mitch.  Already did, Mitch, someone already did. Perkins got stuck with a double agent, someone trusted, highly placed.  Me. Chinks are paying me to bring down Chapter.  Truck goes, hundreds dead -- rescue teams within minutes, guess what they find...?  Uh-uh. They find Chapter, caught with their pants down. See, Mitch, I dumped in a much faster chemical catalyst... The tanker's gonna blow *tonight*. In the center of town, thirty-five minutes from now.  Charly's stash. What's the number of the locker, Mitch...?  Left nut, five bucks I make it.  Move it out of here, now!  I tried to give you a pretty death, baby. Did my best. Now you're fucked, now it's ground beef time.    Oh, spare me. You made a big noise and bought five more minutes on the planet. Give up. Die. I'll spit in what's left of your face.     All units converge. Divert local law, this is a government matter. Brook no interference, I want the Baltimore woman eliminated. *Where's the fucking chopper*?  Call it four minutes to detonation. I got a chopper on the way, lots of time.  You'll feel me.  You've lost a step, Chuck. Muscles never recovered from C-section, I'll bet. Am I right?  She's a worthless bitch. I know it 'cause she came out of me.  It's called shock, Charly... Your body wants to go into shock...  Look at you. You're out of your motherfucking league, dearie.  Fuck the shoulder, knee's worse. Just bring me around and hold her steady. I'm not leaving until I know the bitch is dead.  Where are *you* going??  *Somebody do her, somebody kill that fucking whore, kill her*!",
        "Nathan": "Alice, please...?  Your dog, Alice. It and my appetite are mutually exclusive.  It's simple. He's been licking his asshole for three straight hours. I submit to you that there's nothing there worth more than an hour's attention, and I should think whatever he's attempting to dislodge is either gone for good or there to stay. *Wouldn't you agree*?  Hello?  Who... who is this?  ...Charly...?  God, it really is you...!? Chapter, they think you're dead, *everyone* thinks --  You don't know your name.  Your full name... is Charlene Elizabeth Baltimore.    Charly, don't talk, just listen: We have to meet, understand? We have to meet *right away*.  A former student... is in trouble.  Get in! Both of you, NOW!      Charly. Jesus Christ, I don't believe what I'm seeing, you're so *fat*.  What in God's hell have you been *eating*, you look positively bovine! Hang on.  Bulletproof. Put it in myself.     Charlene, darling --    Dammit, Charly. The schoolteacher, that was your cover! Your memory was gone, you got confused and you BOUGHT YOUR OWN COVER. This ridiculous Ohio housewife business, it's a fantasy, you *wrote* the bloody thing!  Then quit. You're an assassin for the United States government. I ought to know, I trained you.     *The side windows were next, I swear*.     Here, you might as well have one too.  Three. One shoulder, one hip, and one right next to Mr. Wally -- Where most patdowns never reveal it, as an agent is often reluctant to feel up another man's groin.  Lucky bastard found the only cool car in the fucking midwest.  Your father was in the British SIS, assigned to the Irish situation. After he was murdered in 1971, his friend Perkins recruited you for Chapter, a black bag operation working out of the U.S. State Department.  Fall, 1987: Presidential orders come down. You're to flush out a terrorist by the name of Daedalus. You never complete the mission, electing instead to die, of all things, despite clear orders to the contrary. And dead you remain until, without preamble, you re-emerge, eight years later and fifteen pounds heavier.  I think we can safely assume Daedalus is aware of your resurrection and is attempting to reverse it. *Damn*, I can't drive around in this thing. Any idea where we can go to stash this car?  Perhaps you'd best drive.  Let me do it.  *No ambulance*. The car I ordered will be here soon.  I'm about to faint... And if you call an ambulance, I will fucking kill you.  Where's Charly...?  Goddammit, I told you --  Sod that... just watch them.  Checks. You're not fooling anyone, dear boy. You'd wash her feet and drink the water... wouldn't you?  My star pupil... That man in Pennsylvania yesterday... The one at the diner, that was hers, wasn't it...?    Arms broker, man without a face. Veteran of Baader-Meinhoff and the Red Brigades. He's rumored to be based in the U.S. Doesn't travel much, they say. Too afraid of metal detectors, the poor sod's got a foot- long piece of steel in his leg.  A pin, Mr. Henessey. A surgical pin.  You blithering idiot, the son of a bitch wasn't her lover, he was her target, he's Daedalus!",
        "#2": "That's who?  Swear?  Too weird.  Oui, j'veux etirer celle-la autour d'une chaise. Comme je le vois, une femme c'est comme Gumby avec des seins. (Subtitle: I'll stretch her over a chair, women are merely Gumbys with tits.  Christ, I'm trying to have breakfast."
    },
    "imdb_rating": "6.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNTkzOWZkN2QtNDJkYy00OTdjLThlNDQtNDg4MjMyMWE5Y2U5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,14,380,562_.jpg",
    "description": "Samantha Caine, suburban homemaker, is the ideal mom to her 8 year old daughter Caitlin. She lives in Honesdale, PA, has a job teaching school and makes the best Rice Krispie treats in town. But when she receives a bump on her head, she begins to remember small parts of her previous life as a lethal, top-secret agent. Her old chums in the Chapter are now out to kill her so she enlists the help of a cheap detective named Mitch. As Samantha remembers more and more of her previous life, she becomes deadlier and more resourceful. Both Mitch and Charly proceed to do the killing thing, the bleeding thing and the shooting thing.—Tony Fontana <tony.fontana@spacebbs.com>",
    "name": "The Long Kiss Goodnight",
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ]
}