{
    "filename": "Hitchhiker's-Guide-to-the-Galaxy,-The_script.txt",
    "imdb_id": "tt0371724",
    "imdb_url": "https://www.imdb.com/title/tt0371724",
    "characters": [
        "Eddie the Computer (voice)",
        "Reporter",
        "Marvin",
        "Trillian",
        "The Whale (voice)",
        "Ghostly Image",
        "Pub Customer (as Su Eliott)",
        "Ford Prefect (as Mos Def)",
        "Narrator /The Guide (voice)",
        "Humma Kavula",
        "Fook",
        "Jeltz (voice)",
        "Bulldozer Driver",
        "Arthur Dent",
        "Questular Rontok"
    ],
    "dialogues": {
        "Reporter": "...and of course, the top story is still the sensational theft of the new Improbability Drive prototype ship Heart of Gold last week, stolen at the launch ceremony by none other than Galactic President Zaphod Beeblebrox.  ...the question everyone seems to be asking is, has the Big Z finally flipped? We asked his private brain care Specialist, Gag Halfrunt...",
        "Marvin": "I think you ought to know I'm feeling very depressed.  It won't work, I have an exceptionally large mind.  Just that?  I won't enjoy it.  All right. I'll do it.  I'm not getting you down at all am I?  Life.   Don't talk to me about life.  Ghastly, isn't it?  I've been ordered to take you up to the bridge. Here I am, brain the size of a planet, and they ask me to take you up to the bridge. Call that job satisfaction? - 'cause I don't.  \"All the doors in this spacecraft have a cheerful and sunny disposition. It is their pleasure to open for you, and their satisfaction to close again with the knowledge of a job well done.  Hateful, isn't it? You can thank the Marketing Division of the Sirius Cybernetics Corporation for building robots with GPP.  \"Genuine People Personalities.\" I'm a personality prototype. You can tell can't you?  Sorry, did I say something wrong? Pardon me for breathing, which I never do anyway, so I don't know why I even bother to say it. Oh god, I'm so depressed. HHGG 3rd Revised Draft 8/8/03  And then I've got this terrible pain in all the diodes down my left side. I've asked for them to be replaced but no one ever listens.  I've brought the aliens.    Don't thank me or anything.  Do you mean sit in a corner and rust or just fall apart where I'm standing?  Ghastly, isn't it? I was asked to change the personality type, this was the emergency back-up.  I can -- but I won't enjoy it.  Don't look at me.   I'm too depressed.  I know.    Dreadful, isn't it?  This will all end in tears, I just know it.  It's rubbish.  I told you this would all end in tears.  Don't talk to me about life.  Don't talk to me about God.  I know. You keep going on about it.      It sounds awful.  Did it have oceans?  Can't bear oceans.  You think you've got problems? What are you supposed to do if you are a manically depressed robot? No, don't bother to answer that, I'm fifty thousand times more intelligent than you and even I don't know the answer. It gives me a headache just trying to think down to your level.  I could calculate your chances of survival -- but you won't like it.  Funny how just when you think life can't possibly get any worse, it suddenly does.  Life. Loathe it or ignore it, you can't like it.       I know.    Wretched, isn't it?",
        "Trillian": "Four to one against and falling... HHGG 3rd Revised Draft 8/8/03    Can we put your ego aside for one moment? Something important has happened.  We have a couple of hitchhikers in our receiving bay.  I didn't pick them up. The ship did.  When you engaged the Improbability Drive.  We picked them up in sector ZZ9 Plural Z Alpha -- where you picked me up.  No.    Just very, very improbable.  Don't. I'll send Marvin. Marvin!  We have something to take your mind off things.  I know. Go down to the number two entry bay and bring the two aliens up here.  Yes.  No, no, Marvin, it's fine really. It's just part of life.  Everything okay?  Arthur? HHGG 3rd Revised Draft 8/8/03  I know. And it was rude to just leave, but I told you I wanted to get away, and he had a spaceship parked outside, well, honestly -- I assumed you were a sort of stay-at-home-and-read-a book type. But you're here...  Are you all right?  It is my name. I shortened it.  Computer?  Can you identify our pursuers?  You okay?  This way.  I suppose I should have said it resembles tea.  Or your own space ship.  Come on, Arthur, don't be like that.  Just be yourself. Have some fun. Does it hurt?  I mean...  I might have an aspirin.  Hey.   What are they doing in there?  They were from my lab at university.    Odd...  Can it keep? You might want to see this. HHGG 3rd Revised Draft 8/8/03  Because of this, obviously. HHGG 3rd Revised Draft 8/8/03  Definitely. I'm in.  Very probably, yes.  Computer? What planet is that, please?    I don't know. I'm not used to seeing him this way.  Clearly unlike any guy I've ever met. Look, if you're going to pout your way around space, then maybe you should just go home.    Alright, follow me.  Back off or I'll kill him, I swear I will!  Trillian.  Try Tricia McMillan.  No.     Tricia Imogene McMillan of Earth.  Earth. In the Milky Way? Um...galactic Sector ZZ9 Plural Z Alpha.  Destroyed? No -- that's impossible.   I don't believe you. This is some sort of trick. Zaphod wouldn't blow up a planet, especially mine.  Love and kisses...?     You bastard. You signed the order to destroy Earth?!  \"Love and kisses, Zaphod?\"  I saw the form. You didn't even read it, did you?  An entire planet, Zaphod. My home. Gone. All because you thought someone wanted your autograph!  You knew. Why didn't you tell me?  Get a backbone, Arthur.  Exactly where we were, I think.   Give me that thing.  Shoot him again.  Brilliant.  A gun that makes people suddenly see things from your point of view. Useful tool for the deranged evangelist trying to convert the masses, eh?  We should get back. Arthur's waiting.    Won't affect me.   I'm already a woman.  Arthur!  Arthur, these are our hosts. Benjy mouse and Franky mouse . They control a large sector of the Universe in our dimension . I'm sorry, I thought you were told about the mice...    We need that gun.  Now!  I thought I was...what are       I thought I was...I'll get you... get back... okay          it... you already... fine, fine...                          fine They each grab the gun just as Questular realizes...  Let's go somewhere.",
        "Ghostly": "Greetings. This is a recorded announcement as we're all out the moment. The Commercial council of Magrathea thanks you for your esteemed visit, but regrets that the entire planet is temporarily closed for business. If you would like to leave your name and a planet where you can be contacted, kindly do so at the tone.  It is most gratifying that your enthusiasm for our planet continues unabated.    As a token of our appreciation, we hope you will enjoy the two thermonuclear missiles we've just sent to converge with your craft. To ensure on-going quality of service, your death may be monitored for training purposes. Thank you.  This is a recorded announcement as we're all out at the moment. The Commercial council of Magrathea thanks you for...",
        "Image": "Greetings. This is a recorded announcement as we're all out the moment. The Commercial council of Magrathea thanks you for your esteemed visit, but regrets that the entire planet is temporarily closed for business. If you would like to leave your name and a planet where you can be contacted, kindly do so at the tone.  It is most gratifying that your enthusiasm for our planet continues unabated.    As a token of our appreciation, we hope you will enjoy the two thermonuclear missiles we've just sent to converge with your craft. To ensure on-going quality of service, your death may be monitored for training purposes. Thank you.  This is a recorded announcement as we're all out at the moment. The Commercial council of Magrathea thanks you for...",
        "Humma": "The handkerchief is coming, beloveds. Are you ready? Let us pray that the almighty will exhale a breath of compassion on us.  Almighty Arkleseizure, we lift our noses, clogged and unblown in reverence to you.    Bless you.     Zaphod Beeblebrox, our famous President. The Arkleseizure has exhaled many blessings upon you. What brings you to our humble planet?  I don't think I do.  Elequent as always, Zaphod. Your ability to communicate a clear thought never ceases to amaze.  This Humma you speak of no longer exists. He came here in his consolation position as Ambassador to Gamma Z10 to squelch an ideological threat to the system and repented from his wicked ways. He now goes by the holy name Tazelo the Unceasingly Righteous, given to him by his devoted followers.  The election is ancient history, Zaphod, but if memory serves -- you won, proving that good looks and charm win over brilliance and ability to govern.  And incidently -- you are stupid.  You haven't come halfway across the galaxy to settle a campaign grudge. Why are you here, Zaphod?  How very, very... ...improbable.  I kept a few souvenirs from my former life. Ah, the heady days of space piracy... so young, so foolish..,  I'll gladly give you the coordinates to Magrathea...  ...provided you bring me something in return.  A gun.  A very special gun. Designed by the greatest computer ever invented, now buried in the bowels of Magrathea.  And what will you give me to insure your return?  Ha! I'd be better off with the dung of a Bethusian Mega Donkey.  I need a hostage, something you hold dear. Only what does Zaphod Beeblebrox treasure?        You should quit while you're \"a head\" Zaphod. No one has ever got passed the Magrathean defence system alive.",
        "Kavula": "The handkerchief is coming, beloveds. Are you ready? Let us pray that the almighty will exhale a breath of compassion on us.  Almighty Arkleseizure, we lift our noses, clogged and unblown in reverence to you.    Bless you.  Zaphod Beeblebrox, our famous President. The Arkleseizure has exhaled many blessings upon you. What brings you to our humble planet?  I don't think I do.  Elequent as always, Zaphod. Your ability to communicate a clear thought never ceases to amaze.    This Humma you speak of no longer exists. He came here in his consolation position as Ambassador to Gamma Z10 to squelch an ideological threat to the system and repented from his wicked ways. He now goes by the holy name Tazelo the Unceasingly Righteous, given to him by his devoted followers.  The election is ancient history, Zaphod, but if memory serves -- you won, proving that good looks and charm win over brilliance and ability to govern.  And incidently -- you are stupid.  You haven't come halfway across the galaxy to settle a campaign grudge. Why are you here, Zaphod?  How very, very... ...improbable.  I kept a few souvenirs from my former life. Ah, the heady days of space piracy... so young, so foolish..,  I'll gladly give you the coordinates to Magrathea...  ...provided you bring me something in return.  A gun.  A very special gun. Designed by the greatest computer ever invented, now buried in the bowels of Magrathea.  And what will you give me to insure your return?  Ha! I'd be better off with the dung of a Bethusian Mega Donkey.  I need a hostage, something you hold dear. Only what does Zaphod Beeblebrox treasure?        You should quit while you're \"a head\" Zaphod. No one has ever got passed the Magrathean defence system alive.",
        "Fook": "Hang on. Did you say second greatest?  But we designed you to be the greatest computer so you could...  The Omnicognate Neutron Wrangler then?  Then what's the problem?  Oh Deep Thought, your task is this. We want you to tell us -- the Answer.  We'd really like an answer. Something simple. Can you do it?  Deep Thought.    Do you have...  There really is an answer?    Doesn't matter! We must know it!  Tell us!  Yes!  Everything! You know ... just EVERYTHING!",
        "Jeltz": "People of Earth, this is Prostetnic Vogon Jeltz of the Galactic Hyperspace planning council.  As you are probably aware, plans for the development of the outlying regions of the galaxy involve the building of a hyperspace express route through your star system...  ...and, unfortunately, your planet is one of those scheduled for demolition. The process will take slightly less than two of your Earth minutes. Thank you.  There's no point in acting all surprised about it. The plans and demolition orders have been on display at your local planning office in Alpha Centauri for fifty of your Earth years, so you've had plenty of time to lodge formal complaints.  Apathetic bloody planet, I've no sympathy at all. Energize the demolition beams.  Detonate.  <unintelligible and=\"\" gargles=\"\" howls=\"\">  This is your captain speaking, so stop whatever you're doing and pay attention!  According to our instruments we have unwittingly picked up a couple of hitchhikers who must be apprehended and...  <howl gargle=\"\" gargle...=\"\" howl=\"\">  ...and this is not a taxi service for degenerate freeloaders.  Oh freddled gruntbuggly! Thy suppurations are to me as plerdled gabbleblotchits on a lurgid bee.  Or I shall rend thee In the gobberwarts with my blurglecruncheaon, see if I don't!  So, Earthlings, I present you with a simple choice. Either die in the vacuum of space, or -- tell what you thought of my poem.  Continue. . . HHGG 3rd Revised Draft 8/8/03  An astute analysis. Very impressive. Throw them off the ship.  Hmph. \"Counterpoint the surrealism of the underlying metaphor...\" Death's too good for them.",
        "(voice)": "",
        "Bulldozer": "",
        "Driver": "",
        "Arthur": "3   IN THE BATHROOM - Arthur gargles in front of the mirror.    3            I'm game. We'll see who rusts first.  The first I heard of it was when a workman came yesterday. I asked if he'd come to clean the windows, and he said he'd come to demolish the house. He didn't tell me right away of course. First he wiped a couple of windows and charged me twenty quid. Then he told me.  On display? I had to go down to a cellar!  I eventually found them in the bottom of a locked filing cabinet in a disused lavatory with a sign on the door saying 'beware of the leopard'.  How much?  Ford?  Er, um...now's not the best time, Ford They're going to demolish my home,  But what about my house?  Can we trust him?  And how far's that?  Well, when does he get back from lunch? Or is he going straight out for tea?!  This is shaping up to be a crap day.  Three? At lunchtime?  Very deep. You should send that in to the Reader's Digest. They've got a page for people like you.  Why three pints?  What's going on. Ford?  Why, is it the sort of thing you're likely to say?  I assumed you were drunk.  And that's why you're named after a discontinued car from the seventies?  This must be Thursday. I never could get the hang of Thursdays.  No, it's not that.    It's....  I found her. Ford. The perfect girl. I found her, and then I let her get away. You remember that fancy dress party I told you about?  At that flat in Islington. I told you about it. Last week, remember?  I can't bear those sort of parties, didn't want to go, would have much rather stayed home and, I don't know, brush the dog. Anything. But there I was -- and then, there she was...  I'm Arthur. Arthur Dent.  Oh, the costume. Right. Er, um... Livingston, I presume. Granted. Not as clever as Darwin, but the best I could do on short notice.  Really? I thought the beagle made it rather obvious.  Really? I thought the beagle made it rather obvious.  She was amazing, Ford. Witty, and beautiful, and brilliant. Four or five degrees. One in math, one in astrophysics, another in biology...  And just as I was asking myself, \"Why is this stunning and intelligent woman even giving me the time of day, out of nowhere she says...  Yeah. It is a bit noisy. There's a lovely little cafe around the corner...  Is that a new club on Dean Street?  Oh, that Madagascar. Right, off we go then. Good God, you're serious.  Well...that's...an extraordinary proposition. But...I can't just up and go. What about my job?  I can't just...what about my house?     Who would feed my dog?  He's a Welsh Collie.   He'd feel all out of place in Madagascar.  I went to refresh our drinks.     When I came back, she was gone.  \"Would you like to see my spaceship?\" Really, what sort of chat up line is that?  I've left messages, sent letters... It's like she's vanished off the face of the earth.  My house!       So you're not from Guilford, which would explain the accent -- which I've always wondered about...and you're not an out of work actor -- but rather a writer for this...this...book thing.  I don't feel well. I need a cup of tea.  If I asked where we were would I regret  Good.  Obviously some strange usage of the word safe I wasn't previously aware of.  Tell me you're joking.  And do a reassuring little laugh.  Now tell me where we really are. HHGG 3rd Revised Draft 8/8/03  Get me home. Ford.  Oh God - it was demolished! I've got to reach my lawyer! He must be back from lunch by now...  Good god. Is this really the interior of a flying saucer?  Well, it's a bit squalid isn't it?  Blown up? BLOWN UP?! Couldn't you have done something?!!  But there's six billion other people.  Yes, but ants aren't exactly people!  What's a Vogon?  \"Vogons.\"  It can't be gone. It can't be! Earth!   That's it? That's all this idiotic book has to say about my home? \"Harmless?\"  What does it say now?  Ahhh, what the hell is that?!   Argh!   What's happening...?  Ford...  And if we're unlucky?  Actually...I rather liked it.  Um...some of the words I didn't understand, but I found the imagery quite effective.  And, um, interesting rhythmic devices which seemed to counterpoint the surrealism of the underlying metaphor of the humanity...  ... Vogonity, sorry. Vogonity of the poet's soul, which contrives through the medium of the verse structure to sublimate, er...  ... the poem was about.  What?  So this is it? We're going to die?  You know, it's at times like this, when I'm trapped in a Vogon airlock with a man from Betelgeuse and about to die of asphyxiation in deep space that I really wish I'd listened to what my mother told me when I was young.  I don't know. I didn't listen.  Ford...  I think I'm a sofa.  Now this is more like my idea of a spaceship. Look at all these buttons...   Er. . .  Really? Wonder why?  Yes, I know. I was being...never mind.  We've met.  Tricia McMillan?    Actually -- I am that type. But...well you do know what happened, don't you?  We're having a bit of a chat if you don't mind.  I feel like a bloody idiot. I've spent all week looking for Tricia McMillan and that isn't even your name.  Well, I'm still Arthur. Just plain average one-headed doesn't-own-a-space ship Arthur. Sorry to disappoint.  What's so bad about being drunk?  Normally I would say \"I'll live,\" but given the circumstances...  Arthur.  So two heads is what does it for a girl, then? I mean, if I'd had two heads. Or three?  Anything else he's got two of?  Well, what am I supposed to be like? Green? Bleeping? What?  No, I suppose it wouldn't..  So all that's left is me and you, \"mostly harmless,\" and two lab rats.  Look, there's something I should tell you...  Seven and a half million years later?  But -- you're President of the Galaxy, aren't you?  Arthur.  Why this ship? What's so special about it?  You're guessing?  Do I even have a choice?  What exactly does an Infinite Improbability Drive do?  Did it work? Are we there?     Why does he keep saying that?  You mean fully clothed?  Sorry, but I can't for the life of me figure out why you, the most brilliant woman I have ever met, have ended up with that half-witted, self-obsessed, vapid politician! I mean, look at him!  I can't. That's the whole point -- and I've been trying to tell you...  She deserves to know.  Do I need it?    That's Humma Kavula? I thought he was just using a swear word.  What was it?    Why do I get the feeling he's going to get us all killed?  Are we sure this is the right way?  Yes, thank you for clearing that up.  Oh God, I really hate Thursdays.  What?  Tricia!   We have to go!     Let's GO!  What? No! Follow those ships!  We have to go after her!  Can you change it back?  Ford?     Show me the override switch or I'll reprogram you with a very large axe.  What's that? What happened?!  Sorry about the landing.    Where are we?  What is it?  Well, I sort of had this idea we could...  Did anyone see that?  Nothing.  Nothing. Just my imagination.  Alright, stop. Everyone stop and watch me. Something's happening.  You, too?  What the blazes is that?  I can't, help it!    Trillian is in there somewhere and we need an idea to save her.  Okay, so... ...not thinking, not thinking, no ideas coming... ...this is by no means an idea that has any merit, but Marvin -- can you give me a hand?  Alright, where is she?  Actually, we're looking for... ...someone you're detaining, perhaps in some form of incarceration...    There.   That's it.   This way.  Leave this to me. I'm British. I know how to queue.  Yes. Hi. We're here about getting a prisoner released?  Right. Once I've filled it out can I return to the front of the line, seeing as I've already waited...  Can't you do something?!     You're President, aren't you?  Alright, look. This is the President.  He says the whole kidnapping thing was a terrible misunderstanding, she didn't mean anything by it and he's ordering you to let her go.     He did?  Trillian...  I tried. He threatened me.  What about coming here to rescue you?! That was my brilliant idea!  Look, you're right. You deserved to know and I should've told you. I don't blame you if you're angry.  Right.   Anyway...I'm sorry.  Closed? How can a planet be closed?  Computer!   DO SOMETHING!!  Look, why don't I just hit this thing?  I could really use a cup of tea.  You mean -- the hippies were right?  What?! Are you out of what's left of your mind? We can't step into that...that.  Yes -- big biggie. What if that's the last door we ever step through? What if it rips us into tiny little atomic particle...thingies.  Ford..?  Go with the hunch of a narcissist with half a brain who's wearing a ridiculous thinking cap!? Are you insane?!  I don't care what you think you think...  No.    No!     NOOO!!!  Life is full of paradoxes, isn't it?  Here I am, God knows how far from home...  ...and this is where I see the most spectacular sunset I've ever laid eyes on. We only had the one sun at home. Planet called Earth.  Oh no, it's beautiful.    Or at least, it was...  Yes.   Great wide rolling blue oceans.  So this is how it will all end, then? Me, on a dead planet -- with a manically depressed robot.  Aah!  Who are you?  Late? What for?  Dent. Arthur Dent.  Trust a man who won't tell me his name?  Whaa!  I have found this whole day a bit disturbing.  ...and men.  The best laid plans of mice and men.  Oh, you had that problem, too?  What? You did that? I've been there!  The Vogons?  So -- it wasn't destroyed?  So you're saying you ... made the Earth?  Mice?    Who cares about bloody mice?  They brought...I'm sorry, when you say \"mice\" do you mean the little white furry creatures with the cheese fixation?  Ah. I see where you're confused.    You see -- we were experimenting on them.  So -- you're trying to tell me that mice designed and built Deep Thought...and Deep Thought designed the Earth...which was a giant supercomputer...that you built...to calculate the Ultimate Question. Only, Vogons destroyed it ten minutes before the program was completed?  Actually, this explains a lot. All my life I've had this strange feeling that something was going on in the world, something big, something sinister ...  And are you?  Is this...?  What -- what are you doing? What happened to you?  Hosts attack you --? And then you sit down for -- is that tea?  Now that's a cup of tea.  Yes. Yes, I was. I just wasn't quite prepared for the full reality of it.  In a moment, perhaps.   I can't seem to let go of this table. HHGG 3rd Revised Draft 8/8/03  I'm sorry, when you say \"the only living native\" -- do you mean me? What about her?  So -- mostly harmless and me.    That's it.  Mmmm.    This really is delicious.  An Ultimate Question that sounds good... From a couple of mice...for a chat show.  I'm sorry -- did you just say you need my brain?  You can't have my brain. I'm using it.  I would!  Ford!    Zaphod!   TRILLIAN!!  What are they-- what's in the food?!  Wait a minute, JUST WAIT A SODDING  You want the question that goes with the answer \"42\" How about \"What's six times seven?\" Or \"How many Vogons does it take to screw in a lightbulb?\" Or here's one, \"How many roads must a man walk down?\"  Fine. Take it. There's plenty more where that came from because my head is filled, with questions, and I can assure you mate, no answer to any of them has ever brought me one iota of happiness. Confusion? Yes. Indecision? Loads. But happiness...?    I thought I was...what are       I thought I was...I'll get you... get back... okay          it... you already... fine, fine...                          fine They each grab the gun just as Questular realizes...  Thank you.  Yes.   Me.  Yes, You name it. I'll go.",
        "Dent": "3   IN THE BATHROOM - Arthur gargles in front of the mirror.    3",
        "Questular": "This is Vice President Questular Rontok. I am speaking to the kidnapper of the President. Surrender your stolen vessel at once or we will take action as defined and permitted by Section 1.8 of the Galactic Interstellar Space Bi-Laws.  You do realize he did what he did because he knew this is what you would do.  Don't you think this many ships is a bit, oh I don't know -- excessive?  You are aware, Commander, that the President kidnapped himself.  Do you have any idea how ridiculous this is?  This is ridiculous! What do you need, an executive order? Fine. I order you. Stop doing this! Go and get him!  But I'm acting president!  Commander! The President is the kidnapper!  There they are!    They're coming here!? But they've only accomplished half the mission. What about Zaphod? HE MUST FACE JUSTICE!!  What!? He's here?! Zaphod is here!? Let's go get him!  Commander?  Yes!   This is more like it.   It's a towel! It's only a TOWEL!!     GET  Shoot me. Please Zaphod. Shoot me.  What am I so pissed off about? I'm great? I'm zarking incredible! Everyone loves me! WHOOO HOOO!!! Look at me...etc.  Oh man! I love being me!!",
        "Rontok": ""
    },
    "imdb_rating": "6.7",
    "description": "Everyone has bad mornings. You wake up late, you stub your toe, you burn the toast, but for a man named Arthur Dent, this goes far beyond a bad day. When he learns that a friend of his is actually an alien with advanced knowledge of Earth's impending destruction, he is transported off the Earth seconds before it is blown up to make way for a new hyperspace motorway. And as if that's not enough, throw in being wanted by the Police, Earth II, an insane electronic encyclopedia, no tea whatsoever, a chronically depressed robot and the search for the meaning of life, and you've got the greatest adventure off Earth.—radioactive",
    "name": "The Hitchhiker's Guide to the Galaxy",
    "genres": [
        "Adventure",
        "Comedy",
        "Sci-Fi"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZmU5MGU4MjctNjA2OC00N2FhLWFhNWQtMzQyMGI2ZmQ0Y2YyL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}