{
    "filename": "Cell,-The_script.txt",
    "imdb_id": "tt0209958",
    "imdb_url": "https://www.imdb.com/title/tt0209958",
    "characters": [
        "Gordon Ramsey",
        "Catherine Deane",
        "Ella Baines",
        "Lucien Baines",
        "Cole",
        "Carl Stargher",
        "Edward Baines",
        "Henry West",
        "Dr. Barry Cooperman",
        "Peter Novak",
        "Mrs. Hickson",
        "Dr. Miriam Kent",
        "Anne Marie Vicksey",
        "Teddy Lee",
        "Julia Hickson"
    ],
    "dialogues": {
        "Gordon": "",
        "Ramsey": "Who found her?  Cole nods at a visibly shaken WORKMAN seated in a patrol car.   Well, honey, what's worse?  Doing it yourself or asking your mother for help?  Can it wait 'til I get back/  I have no idea, Jeannie.  Novak checks his watch and the street.  Clearly waiting for someone or something.   Well all right.  Good luck with the Monster.  I love you too.  Bye-bye.  Ramsey snaps shut the cell-phone.   We call Jeannie's mother \"The Monster\" because, well... she just is.  Novak is oblivious, pouring over tire-related info.   I know you could care less about my personal life, Peter, but I do appreciate the occasional, \"How's your wife, Gordon?\"  He waits.  Novak obliges:   Pregnant.  Thanks for asking.  Novak is distracted by Teddy Lee entering the diner.   Damn, man, I give up.  Your partner tells you his wife's gonna have a baby, and all you care about is a coroner's report!  Ramsey assesses the exhausted, lonely, intense man sitting across from him.   I feel for those girls too, Pete.  And their families.  But it's just a job. Someday it'll be over.  And then what'll you have?  Much to Novak's appreciation, Teddy Lee's arrival provides an escape from answering the question.    More hair.  I could knit this guy a toupee.  Novak finds something in the report that catches him by surprise.  He double-checks and shows the item to Teddy.   And that means?  Teddy moves aside and takes another bite of his lunch .   A purebred German Shepherd.  Novak shows them a picture of a WHITE GERMAN SHEPHERD taken from a resource on the Internet.   Breeders typically destroy albino pups, so this animal is truly unique.   Registered breeders of German Shepherds.  The list is long and a few of the cops GROAN.  Novak silences them with a fierce look that says, \"I will not rest until this man is found and neither should you.\"   She was still living at home?   John, you came to pick her up when?   No sir.  I'm sorry.  Ramsey's cell-phone rings and he excuses himself to a corner of the room, leaving Novak alone to deal with this uncomfortable, sad situation, no one saying a word until an emotionally shattered Mrs. Hickson, fingering a rosary, feels compelled to tell him.   She remembers because it was her \"dream truck.\"  Wanted one just like it.   Let's give old Carl a call.  Tell him he's got company.   She's not here.  Novak would give anything for that not to be true.    You should come downstairs.   What the hell does that mean?   What're you doing here, Reid?  Paving the way for his insanity defense?   Whoa.  Wait a minute.   We'll go back to his house, Pete. There's still a lot to do.  Analyze the videos, track sales of the bleach, go through his records.  Maybe he owns property somewhere.   Is it possible?   You sure you want to go through with this?   I don't know, Pete, but for god's sake... This is nuts.  Do you really understand what they're going to do?   Why jeopardize what we've already done? We caught the sonofabitch.  Carl Stargher.  That's going to be like Bundy, Gacy, Dahmer.  A case that makes careers.  But if we push our luck.  If this is all bullshit and we come out smelling like it.    That's not what I'm talking about, Pete. I'm talking about waking up and realizing this girl's gonna die.  The words are anathema to Novak.   We removed eight metal rings.  Miriam peels away a bandage and examines the flesh.   Sorry.  Miriam prepares a series of CHEMICAL CARTRIDGES and loads them into a container connected to the IV-like tubes linked to the suspension device.   What is it - are they - exactly?  That's like asking her to explain the rules of cricket.   What happens here?   Where the hell you been?  They turn to see Ramsey.   Next time, tell me, okay?   Your colleagues want to know what to do with Stargher.  Novak looks to Catherine for the answer.  Through the window blinds, she watches John Tracy lower his head.   Jesus Christ, man, you look like hell.   Whoa-whoa-whoa.  Mind telling me what the fuck is happening?   Novak points to the photo of Stargher's basement, specifically the hoist.   You're bettin' the farm on something you saw after they pumped you full of god knows-what kind of shit?   You might've seen Jimmy Hoffa dancing with Timothy Leary.  I don't care.  Novak is not stopping...   Pete, listen to me.  What did you really learn in there?  Anything new?  You really think Stargher gave you a save the-day clue?  What if this is all some kind of trick your head is playing on you?  He won't consider that.  Novak climbs into the helicopter and buckles himself in.  He looks to Ramsey - you coming? - Ramsey pats the side of the chopper and signals for the pilot to take off.   What are you talking about?  Miriam analyzes the situation and regretfully, angrily, worriedly realizes what's happened.   Done what?",
        "Catherine": "Thanks for the horse.  He's a shy child, yet comfortable with Catherine.   He's beautiful...  Edward smiles, delighted he made her happy.   But I thought we were going sailing.  The boy frowns.   You promised.  A devilish glint in his eye, Edward redirects the mirror. Catherine follows the flicker to a TOY BOAT in the sand.   We can't fit into that!  Edward shines light in her eyes, momentarily blinding her, then snaps the locket shut.  When her vision clears, Catherine sees a GIANT SHIP perched among the dunes.  A craft weighing hundreds of tons just sitting there in the desert.   That'll do.  She walks toward it, but Edward doesn't follow.    Come on, Mister E.  She extends her hand, but he adamantly shakes his head no.   What now?    Who says?   Oh no... No you don't.   I bet we can fix it.  She opens a rusted iron DOOR.  It makes an HORRIFIC SCREECHING SOUND.  Similar to metal-on-metal, but more piercing, more pained.  As if made by a living thing.   (familiar with the noise, a warning to him Ed-ward...  The boy's FACE CONTORTS, turning into something half-human, half-animal.  A monster.  Mocky-Lock.  He SCREECHES, trying to frighten Catherine, but she cocks her head...   We agreed.  No more Mocky-Lock.  The creature sticks its tongue out and DIVES.   Edward!  But it's too late!  Edward/Mocky Lock slithers into the sand and disappears.  Resigning herself to a failure, she opens the palm of her left hand, revealing a SMALL BUMP in the flesh between thumb and forefinger.  She presses hard and...    A pocketful of rye...   Baked in a pie...  IN THE CONTROL ROOM, Henry hits a switch and Catherine is lowered to the pedestal.  Miriam checks Monitors displaying Catherine's vital signs and continuing what must be a routine, presses numbers on a keypad to open the PRESSURIZED AIRTIGHT DOOR separating the two areas.  IN THE PROCEDURE ROOM, lights come on and Miriam eases Catherine out of the apparatus.  She checks her pupil dilation, pulse, throat, and reflexes.  She pokes and prods with a familiarity that would seem rude to an outside observer, but is nothing to them.  Getting to her feet, we see that Catherine's BODYSUIT is made of an unusual dark fabric almost liquid in consistency.  AT THE CONSOLE, Henry moves to another section and for the first time, we see there are two elaborate neural monitors. And the \"brain\" pictured here is smaller.  Younger...   Almost.  Mocky-Lock showed up.   Mocky-Lock is a pain in the ass.  Henry communicates with them via the intercom.   A nursery rhyme.  Catherine detaches the cables and eases Edward's frail body into a waiting wheelchair.  Miriam takes a penlight and examines the boy's eyes... An emotionless void, oddly beautiful.   I'll tell the nurse.  God, he loves when you visit.   You don't know about me, though, do you?   There's been progress.    You picked me, remember?  And I took the job.  Gladly.  This is the next wave and I want to be part of it...   Then what is it?  Introspective and solemn-eyed, Lucien takes a moment, then:     He hates me.   She thinks I can bring Edward back.   I want to try it.  Please.  Miriam knows what this is about.   Why not?  Just once.  A trial run.  What harm could it do?   Why is it taking so long for us to reach him?  Because we've been reactive, that's why.  And we need to be active.  Miriam reaches for Catherine's wrist and takes her pulse.    Miriam...   He creates the obstacles, he decides which games to play.    It could take years for me to get past the barriers he's created.   I do it all the time!   I'd be there for him.    Okay, okay...  Miriam takes a penlight and examines Catherine's eyes.    No.   Yes mother.   Okay.  Miriam gathers her belongings.    I've got to feed my cat.  Besides, I want to get to bed early.   Pleasant dreams, Mister E.    Small and isolated, the nearest neighbor a block away.    The place is a mess.  Computer print-outs, dirty dishes, unopened mail, videotapes, and notepads cover tables, chairs and floor.  On the crammed bookshelves, psychology texts sit next to volumes on mythology, religion, and the occult. Totems, figurines and artifacts (Central and South American in origin) adorn the walls and tables.  As Portishead plays on the stereo, we find Catherine suffering from insomnia, wearing goofy-yet-hip eyeglasses, sweatpants and a UCSD T-shirt, sharing a late-night snack with her pet CAT.  She shuts the refrigerator door and we linger on an odd POSTCARD taped to the surface.  A kitschy postcard of a warrior/goddess.    Lying on her bed , Catherine sleepily stares at the ceiling, rolls onto her side, and feels herself drawn into the comforter.  The folds of the fabric become ripples. Ripples become dunes.    IN HER OWN BED, Catherine's eyes are open.  In sharp contrast to a typical reaction to a nightmare, she remains calm.  No sweaty face, no gasp, no reaction at all, really.  She might as well have been dreaming of puppy dogs.  Wide awake, her eyes return their gaze to the ceiling.   Go.  To.  Sleep.   It's fixed!  AT THE TREE TRUNK, Catherine extends her hand and suddenly Edward is there, quite close, reaching out.  Catherine's hand trembles.  The boy is startled.    I'm not signalling...  Her hand tenses and shakes uncontrollably.    I'm not signalling!  Edward is frightened by what's happening and runs away. Catherine tries to call out, but her throat constricts, making speech difficult.   I'm not...      A pocketful of fucking rye.  What's wrong?    Why did we stop?  Cooperman appears in the window and explains.   What if...?  All eyes turn to her.   What if he wasn't like this?  What if he was \"normal?\"  Conscious.  How far would you go?   Do you think he'd tell you what you need to know?  John's discomfort is increasing and Novak is sensitive to it.   Really?  I don't work with violent cases, I work with children.  But even a kid lies.  They love it when they get you to believe something that isn't true.  Don't you think Stargher would do the same?   Okay.  Let's assume he wanted you to find him, that some part of him hated what he was doing... Most likely, that part is dead.  Schizophrenics with Whalen's Infraction sever all ties with the real world.  I'm sorry, I really am.   If he came to trust me, yes, but it takes months to build that kind of trust.  Someone like Stargher can't distinguish between fantasy and reality. It's all the same.  He might tell me she's in Timbuktu and absolutely, one hundred percent believe it to be true, but she's...   I realize that...   The first... What?  Six or seven times I went in.   Remember what happened?   Like a New Year's Day hangover.   You don't know the procedure.   Then he should like this.  Catherine connects Stargher to the SUSPENSION APPARATUS and it HOISTS him off the table.   They're comforted by the feeling of weightlessness.  Like floating in water.  Henry catches Ramsey poking his nose near a THIRD SUIT AND APPARATUS in the dressing area.   I'll be fine.   No.  No.  IN THE PROCEDURE ROOM, we see chemicals mix with her blood, then feed the IV.  AT THE CONSOLE, as Henry types furiously at the computer keyboard, Novak asks Miriam:   Hello?  The frightened child retreats into a corner of the claustrophobic room, but the horse does not startle. Surprisingly - to the boy - the horse takes an affectionate step toward Catherine, inviting her to take over.  Catherine allows the mare to smell her, then vigorously scratches along the mane and shoulder, much to the horse's delight.   Yeah, you like that, don't you?  She can see the boy hiding in the corner, stealing glances at her from the shadows.   Is your name Carl?  The boy - YOUNG STARGHER - is startled and intrigued by the question - How did she know that?! - but says nothing.   Another little boy I know, he has a horse, too.  The boy reacts to an unusual SOUND coming from the CEILING.   His name's Edward.  The boy, not the horse...  The boy takes a few steps toward her, out of the shadows, but he seems more concerned about something in the ceiling than \"connecting\" with Catherine.  Very anxiously, he looks at the wall behind Catherine and watches an old wind-up kitchen TIMER click down.   What's the matter, Carl?  Again, a sharp SOUND from the ceiling.   What's wro---?  Young Stargher RUNS at her and SHOVES her hard!  Catherine FALLS BACK just as EIGHT SHEETS OF GLASS drop from the ceiling!  Like oversize razor blades, they slice the horse into four clean sections.  They separate and compact the quadrants until four glass-contained sections of dissected horse stand within the room.  Catherine SCREAMS, but the mare barely acknowledged what happened.  Betraying no emotion, the boy runs.  The shaken Catherine takes a moment to collect herself, then gives chase.   Is it cold in here?   Do you think that's funny?   It doesn't have much to do with science.   The soul.  The spirit.  Whatever you want to call it.   Agent Novak?   Do you feel there's a side of yourself you don't show people?  The question catches Novak off-guard, but he's willing to answer.  Anything to get her talking.   Just like we all have fantasies, right? Things only we know, that we don't share.   During the sessions.  When I'm inside. I see those things.  What a person hides, what they despite, what they want to control.  With Stargher...  This is difficult for her.   With Stargher I saw things...    A kingdom.  His utopia. Life without consequence or restriction. He's not even Carl Stargher anymore. He's this... idealized version of himself who can do anything he pleases... Without fear.  A horrible primitive ugly thing.  I don't want to talk in here.  She kisses Edward's forehead and exits.   Why'd you bring him here?    As soon as I met him, you knew I'd say yes.  He makes Julia real for me.  Novak nods.  Guilty.   You thought Stargher wanted to be caught.   You were right.  There's a part of him that knows the truth.  About what he did, about himself.  Novak's curiosity is piqued.   This is going to sound terrible, but... I don't think she matters anymore.  Not to him.  He never finished her.  The others...he was able to make them his.   He might tell me about Julia.  The part of him that wants to help, that feels shame and remorse.  Who wants to be redeemed.   Not Stargher, not really.  He's split himself right down the middle. Good/evil, right/wrong, merciful/cruel. A monster.  And an innocent child.  If I could reach the boy.   Don't you feel there are different sides to every personality?  Maybe even the worst of us is capable of one decent act.  We're all human.   Then what is he?   If you believe that.    What happened to Charles Gish?  Novak doesn't respond.  She prods him.   What happened?   Tell me.  God, he does not want to do this.   You're sure of that?   Tell them to prep him.  And that I'll be right there.  Ramsey nods and heads back to the lab.   I need something.   You're a good boy, aren't you, Valentine?  The dog picks up a scent from the procedure room and moves it, Catherine and Novak following.  IN THE PROCEDURE ROOM, Stargher lies face down on a gurney. Now taped to the wall near Stargher are PICTURES from the basement - his dolls, the hoist, etc.  Miriam (in surgical mask and gloves) carefully re-inserts the METAL RINGS (taken from an FBI EVIDENCE BAG) into the eight straps of flesh on his back.  When he sees this, Valentine whimpers and hides. Catherine comforts him.  Miriam finishes her task and removes her mask.   Okay, okay...  LIGHTS FLICKER.  Catherine's eyes shut.  FADE TO BLACK...   Don't kid around, Henry...  Her suspension apparatus DESCENDS on the floor.   Yeah, yeah, yeah.  I'm not sleepy.  As she moves toward the panel, everything becomes larger.  By the time Catherine reaches the circuit breaker, it is the size of a garage door.  Curiouser and curiouser...  She turns around to see the LABORATORY IS EMPTY and DEAD QUIET.  And she sees herself - Catherine as small as a mouse trapped in a giant walled space.  AT THE CONSOLE, Novak, Miriam and Henry observe the procedure room.  And Catherine.  Suspended in the apparatus. Motionless...   Valentine?  Out from the darkness, moving in normal motion, comes the white German Shepherd, but in the thick haze, his face is indistinct and ghostly.   Hi sweetie...  And as she steps toward him, his face DISSOLVES into a STARK LANDSCAPE.  An ear becomes a hill, the nose a stone, mouth a path, and the eye a HOUSE. YOUNG STARGHER retreats towards the bleak structure as CATHERINE ENTERS FRAME.  Seeing the invitation, she presses on.   Need some help?  As Catherine enters the claustrophobic house, the boy hesitantly pushes a towel toward her, but doesn't look.  She reaches the counter and starts to dry, much to Young Stargher's relief.  As he washes, Catherine hands him a MIRROR LOCKET just like Edward's.   Carl, I want to give you a present.  He's hypnotized by the thing, his eyes lighting up.   If you need me, or if you feel that I'm around but can't find me, just shine it, like this.  She shines reflected light onto the walls.  Carl hands Catherine the wet plate and takes the locket.  The dish slips from her fingers and SHATTERS on the floor.  The boy's eyes fill with dread.  The kitchen clock reads 5:30.  He PUSHES Catherine toward a broom closet and shoves her inside.   What's wrong honey?  With a finger to his lips, he pockets the locket and shuts the door.  FROM WITHIN THE CLOSET, she watches the terrified child through a CRACK in the door.  IN THE KITCHEN, Young Stargher desperately tries to hide the broken plate. Startlingly, his father, Martin Stargher, is already in the room.  Cruel, imposing, manipulative man.   I want to help you, Carl.  His grin broadens to a smile and he almost laughs.   You sound like your father.  He gets close to her face and sneers.   Then help me.  Where is Julia Hickson?   Maybe, because you want to.   THING THROUGH HIS THROAT!   As Stargher King stumbles away gagging, blood pouring form his neck, we see that she has returned to normal.  The \"bride\" persona is gone.  As Stargher King emits animalistic growls, Catherine turns and sees an intact Novak standing next to her.  As if nothing had happened.  Catherine and Novak RUN out of the den, into the tunnel from which Novak gained access.  He stops, ready to press the sensor, when a FLICKER OF LIGHT dances across Catherine's face.   Wait...   He wants us to follow.  The little boy...   He brought you to me, didn't he?  If you want Julia to live, trust me.  Trust him.   Carl...  He so desperately wants her affection, but fear prevents him from reaching out to her.   This is Peter.  Scared, he shakes his head \"no.\"   Don't be scared.  You're my friend and I would never hurt you.  She extends her hand.  Oh-so-hesitantly he takes it.   Will you take us to her?  To Julia?  Shyly, hesitantly, he nods.  She smiles gratefully and affectionately touches the boy's face.  Clasping her hand, Young Stargher leads Catherine and Novak into utter darkness.   Carl, do you know?  Like on a map...  He shakes his head and buries his face in her shoulder.   It's okay, it's okay.  You helped so much already.  I'm proud of you.  As a frustrated Novak searches for anything identifying, Catherine comforts the boy and looks deeply into his sad, haunted eyes.   Carl, I think I can help you.  Would you like that?  Even if Peter can't find Julia, I want to help you.  The boy leans against her and she caresses his face.   I promise.  Novak finds himself standing in front of the idealized cell. Mounted beneath the glass is a shiny, perfect metal plaque reading CARVER INDUSTRIAL EQUIPMENT, with a logo.  Novak recognizes it from the hoist in Stargher's basement.    I can't leave him!  STARGHER KING APPEARS!  His throat wounded, bloody mess, he descends out of dark nothingness, HOWLING with rage.  He reaches for Catherine, but Young Stargher runs in front of her.   ...a pocketful of rye.   Baked in a pie.  AT THE CONSOLE, on a security monitor, Henry can see Novak and Ramsey exiting down the corridor.   What's wrong?   Go.  I'm fine.  Go.  As Miriam hurries to catch Novak, she tells Henry.    A bright, deliriously colorful realm visually reflective of things we saw in Catherine's home.  Unusual trees, rock formations, totems, statues, and a brilliant POOL OF WATER.  The pond ripples.  Visible through the crystal-clear water is YOUNG STARGHER, rising to the surface like a drowning victim suddenly breaking through to air.  Panicked, he scrambles to shore and pulls himself to land.  Although the place is comforting and beautiful, he's in strange territory and it frightens him.  Shivering, he hunches down, eyes darting this way and that.   You're all right, Carl.  The boy turns toward the voice and finds CATHERINE, her hair waving in the wind, skin glowing, eyes bright, cutting a magnificent figure in clothes that make her a warrior goddess. She opens her arms and the boy runs to her, basking in the comfort of her embrace.  He shivers and she holds him tightly.   It's okay, honey, you're with me now. You're safe here.  She looks deeply into his eyes and reassuringly explains.   I promised I would help you, and I always keep my promises.    Oh...no, honey, I'm sorry.  It's doesn't work that way.  The boy breaks away from her, turning his back.  She gently takes his hand but he yanks it free.   But what if I told you you could come visit?  He slowly turns to her.   I'll make sure it happens, Carl.  I'll get them to let me do it.  And maybe... maybe we can...  Young Stargher's eyes open wide with silent terror.  Over his shoulder, she sees a SNAKE slither through the pool. CENTIPEDES CRAWL over her legs and hair.  She stands and brushes them off.  The atmosphere grows darker and ominous.   No.!   I said no.  Like a vengeful Valkyrie, she emits what can only be called a BATTLE CRY!  STARGHER ATTACKS!  Arms reaching for her. Catherine BLOCKS, PUNCHES, AND KICKS.  Stargher King doubles over.  Catherine grabs his ears and pulls his face into her bent KNEE, breaking his nose.   Welcome to my world.  As blood flows from his nostrils, Stargher King grins...   My world...  A SHIMMERING KNIFE seems to enrage from within her forearm, out the flesh and into her hand.   My rules.  She SLASHES across his chest, drawing blood.   No one deserves it, Carl.  No one.  She reaches out to him, but the child is JERKED into the air by Stargher King.  In one hand, the monster holds little Carl.  In the other - a KNIFE.  His face and chest red with crimson, Stargher King fixes his eyes on Catherine with a predator's stare.   Carl!   Carl...?  The boy runs to adult Stargher who lifts the child into his arms and holds him close.   Goodbye Carl.  She presses the sensor in her hand.   Everything's alright now, Valentine.  I promise.    Two cars parked outside.  An old, quirky Volvo and a Land Rover.    As a television plays THE WIZARD OF OZ, we find Catherine watching the movie from the couch, sitting up, drinking a cup of tea.  She looks rested and quite cute in gym shorts and a T-shirt, her CAT sleeping next to her.  IN THE KITCHEN, Miriam packs up her stethoscope and blood pressure monitor, moves into the living room as Dorothy falls asleep in a field of poppies...   I don't need them anymore...   Thanks Miriam.  Say hi to Henry and...    Give a kiss to Edward.  The women exchange smiles and Miriam exits.    As Miriam walks to her Land Rover, she sees a government issue Suburban park on the street and Peter Novak exit.    As Dorothy and her companions confront the Wizard, there's a KNOCK at the screen door and Catherine sees Novak waiting.   Ready.  He opens the door and escorts a leashed VALENTINE into the living room.  Catherine's cat squirms from her arms and hides under the couch.   Give her a minute.  Hello, Valentine.  Novak unleashes the albino Shepherd and he runs to Catherine, licking her face, wagging his tail.   Absolutely.  Abigail...  Valentine picks up the cat's scent and sniffs around the base of the sofa.   I heard Julia and John got married.   Good for them.  Valentine settles on the floor.  Slowly, Abigail's curiosity gets the best of her and she creeps out, sniffing the dog's nose.  Patient and sweet, Valentine lies still, allowing the cat to reach an acceptable level of comfort.   I told you.  You have to be optimistic. Believe in them...   He's mine?   It doesn't matter...   Not just yet.  Okay?  Novak doesn't push it.  He just takes her hand and gives it a gentle squeeze.  The cat dashes into the kitchen and Valentine follows.   They're hungry.   Thank you.   No.  Thank you.  He smiles and nods, gently resting his hand on her shoulder. Catherine shuts her eyes and leans toward him, comforted by simple human touch...",
        "Deane": "",
        "Ella": "He needs a haircut.   My husband wonders if that's true.  He wants to place Edward in a hospital.  Seeing an unfunded future, Henry's ready to disassociate himself from Miriam and Catherine...",
        "Baines": "",
        "Lucien": "I realize that, Henry...  And I know your work, Dr. Kent, is invaluable to this company...   Catherine, we've waited eighteen months for signs of progress...   Yes, but there is no proof the procedure works.  All I have is a belief that your interaction with my son is not a hallucination.  Catherine is hurt and vulnerable due to exhaustion and the intensity of her experience with Edward, but feels she must defend herself.   I've invested millions of dollars in this study... And I've convinced others to do the same.  I suppose I should feel responsible to them, but I don't.  I could care less if they see a profit. I'm responsible to my boy, that's all that matters.  You tell me... Am I doing the right thing?",
        "Cole": "Surveyor for the railroad... 'Bout six this morning.  Novak sees a FEMALE BODY wrapped in plastic and bound by wire.  Supervising the examination of the woman is FBI PATHOLOGIST DR. THEODORE \"TEDDY\" LEE, a polite, dapper southern gentleman.   She the one from Santa Cruz?   Agent Cole.     Already there.    Carver Industrial Equipment.   The hoist was manufactured by Carver Industrial Equipment in 1982.  Serial number 117-337J.  Purchased by a boat shop in Lake Havasu, but sold to Lattimer's industrial Supply in 1992...   Lattimer sold the hoist to a guy named Bainbridge who tired to build a machine works out near Delano.  Bainbridge ends up in bankruptcy court and the state winds up with the land - it's just sitting there.   Yep.  And guess who they hired to seal up the place?   I never kid.  My wife hates it.  Says I'm too serious.  Novak locates Delano on the map.",
        "Carl": "Novak feels what's coming.",
        "Stargher": "CHAINS attached to bizarre HOOKS dangle from the ceiling. Admiring Anne's body, Stargher links the hooks to the rings in his back.  He presses a remote unit and up in the rafters, a series of GEARS click into motion.  The sound is torturous as the mechanical hoist LIFTS Stargher off the ground, pulling at the rings, strips of flesh rising.  Stargher grimaces, but clearly he wants the pain, needs it.  As the hoist clicks into another gear, it carries Stargher over the table until his body is perfectly positioned above Anne's.  In the flickering weird light of the television screen, Stargher resembles something from the twisted imagination of William Blake - a levitating demon ready to debauch an innocent angel.  With his free hand, he touches himself, chains clinking and swaying.    Good boy.    Stargher, the awful PAIN eating away at his skull.  He searches the medicine chest.    Struggling to stay on his feet, he moves to the KITCHEN. Valentine paces nervously, whimpering concern.  Stargher reaches for a bottle of vodka but falls to the floor. Valentine BARKS, but gets no reaction from master.  We MOVE IN on Stargher's unblinking eyes.    A sparsely populated lower-middle class neighborhood.  A half dozen plain houses at the end of a cul-de-sac.  Bare trees. Brown lawns.  Crows in the air.  The house furthest from the main road has a white Ford F250 pick-up in the driveway.  Green trim.  THE SUBURBAN, hidden from Stargher's house, four-wheels it through a prairie and stops outside the backyard of a PRESCHOOL, where two more Suburbans and a van already wait.    Quiet.  Calm.  And then we catch a glimpse of a FIGURE advancing, using any cover he can, until he is right outside the house.  The sneaky SWAT team member, ERICSON, whispers into his throat mic.    The SWAT TEAM SWARMS towards the house.      As an AMBULANCE emerges from a hiding place behind another garage, we FOLLOW NOVAK and RAMSEY as they run from the preschool into the house.    As a K-9 UNIT secures Valentine, Novak storms into the kitchen, checks Stargher for a pulse and barks at SWAT&gt;    FBI AGENTS and local police cordon off the area.    Valentine is muzzled and led away as the PARAMEDICS load Stargher onto a stretcher.  Agent Stockwell turns to a worried Novak.    Ramsey leads Novak into Stargher's \"workroom.\"  It's all here, the table, the piercing supplies, the bleach.  An odd, grisly collection of DOLLS fills cubby holes in a wooden storage/shelf unit.  Novak's eyes are like a camera, documenting and storing as much information as possible, but it's overwhelming.  He moves through the basement.  Careful not to touch anything.  He stops and focuses on the hoist and eight hooks situated over the stainless steel table.  (NOTE: ON THE   The pattern of the electronics grows into something more organic, textured, concrete.  Evolving into a world.  Black and shadow-filled, it resembles a labyrinthine complex of vertical walls with cubicle like rooms carved deep into its core.  Our journey into this bleak, grim place continues and we occasionally glimpse brief images of a boy's baptism.  INTERCUT with this journey are sections of cloudy blackness and fragmented visions of CATHERINE connected to the apparatus, face masked, DESCENDING into this world.  There is an abrupt SHIFT from still images to regular motion and we find ourselves gliding over a tidepool filled with tiny fish and tadpoles.  At water's edge, lying on rough, pebble-strewn ground, is a HAND.  Catherine's hand.  We sense MOVEMENT, but she remains still. From the darkness comes a DOG.  Black in color and featureless, it sniffs Catherine, dismisses her, and meanders into a cubicle opposite her, disappearing from view.  After a moment of odd quiet, a DROP OF BLOOD hits the mask and we follow Catherine's hand as it moves to the cloth and removes it from her own face.  IN MACROSCOPIC SUPER SLOW-MOTIONS, another BLOOD DROPLET sails 64 into the air and comes crashing down, hitting a RED ANT, catapulting it onto what looks like a tree, but is just a TWIG.  As the insect scurries away, MORE DROPS pound the earth, splatter against \"twig trees,\" and explode into pools of stagnant water...  As we begin to realize that this miniature landscape is the world into which Catherine descended.  She sits up, shivering, and breathes deeply, acclimating to her surroundings.  The \"floor\" is covered with filth, ash, pebbles, and insects.  Water is present in many forms, puddles, moisture, dripping ceilings.  Eyes focusing, queasy, not fully \"awake,\" Catherine notices the crimson stain on the cloth mask and the blood droplets showering the air.  She turns and finds the source.  THE BLACK DOG stands in the opposite room next to a tub full of BLOOD, shaking himself dry after his \"bath.\"  Satisfied, the animal stops and trots away.  Still adjusting to this nightmarish realm, Catherine at first doesn't hear it, but then realizes that somewhere, a child is CRYING.  She looks around, then through a crack in the \"floor,\" briefly catches sight of a BOY beneath her, on a level lower than hers.  As he disappears into corridor ending in \"nothing,\" we PULL BACK to show a MASSIVE LANDSCAPE of blocks, cubicles, crawlspace, walls, stairs, and ladders.  Leading everywhere and nowhere.  Catherine spots the boy as he crawls into a specific \"room.\" Shortly after, a LIGHT comes on within the cubicle and she moves to it.  We feel as though we're looking at a series of interlocked tenement rooms, some walls of which have been torn away to expose rooms within, rooms with no windows or doors.  Following a path of fragile steps, Catherine makes her way to the LIGHTED ROOM and enters.    A mottled HORSE stands with its head down, nose kissing the floor, allowing the BOY to caress its neck.  This sweet animal is an incrongruous vision in this hellish world and Catherine approaches with respect.    Young Stargher knows his way around the landscape, but Catherine has difficulty simply keeping him in sight.  She runs, climbs and crawls.  Until she's utterly lost and disoriented.  Tired and having difficulty breathing, she drops to her knees and \"cools down.\"  She hears a NOISE nearby, gets to her feet, and finds a GEARED MECHANISM connected to some kind of SHUTTERED DOOR composed of an almost metallic-looking glass.  Curious yet cautious, she examines the nearby walls, floor, and ceiling for any signs of \"traps\" akin to the glass blades.  Finding none, she pulls the mechanism and quickly steps back.  The shutter opens and Catherine knows there's something alive in the tiny cubicle beyond.  She retreats into shadow, hiding.  Released from the chamber is a WOMAN.  As she moves out of a darkness, we see VICTIM ONE.  Ghostly pale and adorned in eerie fetish garb, she appears to \"sense\" the presence of a stranger, targets Catherine in the shadows, and ATTACKS!  Catherine's had enough and moves to press the implant, BUT   VICTIM ONE drops Catherine in the center of the room and, job done, crawls away.  Groggy, feeling sick, Catherine sits up.  Unbeknownst to her, she is sitting at the base of a pedestal with her back to the kind of THRONE.  And someone is there.  In the dim pool of light above the pedestal, we see a MAN rise from the throne. The wall behind him is covered in BLOOD RED CLOTH, and as he descends, we realize it is a CAPE connected to EIGHT METAL RINGS pierced through the flesh of his back.  In a fluid motion, waves of red give way to harshly textured concrete as the man reaches the floor.  Catherine knows he is there. Unable to stop herself, she turns.  And sees the terrifying face of STARGHER.  But no the same Stargher.  This is STARGHER KING.    Where you come from priddy thing?  In a split second, Catherine presses the implant on her hand.    Catherine turns to see... Catherine lying in the fetal position, locked in a BOX made of thick clean glass.  The electronic HUM becomes RHYTHMIC, AMBIENT NOISE.. INSIDE THE BOX, staying calm, she searches for and finds a TRAP DOOR on the floor.  She pushes out.  The camera executes a complete 180-degree perspective change.  Catherine plummets.  She tries to reach out, to stop her descent, but cannot.  Catherine falls through a dark CAVERNOUS ROOM resembling a mammoth hollowed-out rib cage.  Below her is a DOME-LIKE STRUCTURE \"growing\" out of the floor, a HOLE in the center of its crest.  Dozens of other such domes are visible in the murky hell-hole, but Catherine has no choice.  She's dropping into this one.  Once she passes through the hole, INSIDE THE DOME, Catherine's body looks as though it's moving through water, but there is no water.  Like an aerial artist, she reverses her position so she's \"heads up.\"  Standing, stable, on the floor.  Sensing something with her.  And knows it is...    Young Stargher is at the sink WASHING DISHES, an anxious eye on the clock.    Young Stargher is forced to sit on the lap of an ugly MIDDLE AGED WOMAN barely wearing a man's robe.  On a nearby table are whisky, tumblers, and an ashtray filled with butts.    Martin has discovered his son's secret hiding place - a camouflaged corner of the attic.  Arranged in deliberate, artistic fashion are scavenged DOLLS.  Heads, limbs and torsos held together with twine, tape and wire.  Some wrapped in filthy plastic.  Faded photographs (including one of his MOTHER), mementos, and most disturbingly, the feathers and bones of dead birds, insect carcasses, and dissected, desiccated mice.  There's something peculiarly beautiful here, but Martin doesn't see it.  Not at all.    The adult Carl Stargher sits at the edge of the tub, his back to us, smoking a cigarette.  A white German Shepherd PUPPY clicks across the tile floor and YIPS at Catherine.  She again hears the WEIRD NOISE.  A STAINLESS STEEL BOWL wobbles as Stargher's bloody rubber-gloved hands fill it with something.  Stargher knows she's there and isn't surprised by her presence, but he's not sure what to make of her.  What to do with her.  He rises and walks past her to the sink.  He pulls off the gloves and washes his hands, glancing at her in the mirror.  Catherine cannot resist looking in the tub.  She sees a dead girl, her torso sliced open.  Disgusted and mortified, she pulls back.   She was the first...  She turns, and Stargher is no longer at the sink.   Didn't know what I was doing...  She turns, where's this voice coming from?!  She steps back.   Be careful...  The bumps into the stainless steel bowl and it topples to the floor, spilling its contents of human organs.  Wobble-wobble wobble.  The bowl makes its now-familiar noise.   What did you do now?  You make a mess?  And she can see him coming out of the shadows.  Catherine backs into a corner, fearing what will come.   I hate a mess.  Stargher steps into a pool of light, shooshes the puppy into the hall, shuts the bathroom door, and looks right at Catherine.   Why are you here?  God almighty, what does she say?  What does she tell him?!   Don't lie, now...  SCRITCH-SCRITCH-SCRITCH.  The puppy scratches at the door and whimpers, but Stargher's not about to let him back in. Moving slowly, carefully, he approaches Catherine.   Liars will be punished.  Catherine makes a break for the door.  \"Playfully,\" Stargher makes a half-hearted attempt to block her, but she evades him and reaches for the knob.  But the door's not there.  SCRITCH SCRITCH-SCRITCH.  She can still hear the dog, but there's no damn door.  She turns:  No door.  No window.  The girl's body and bloody remains have vanished.  An OVERHEAD LIGHT flickers on, giving the room the look and feel of the cell.   Where do you think you're going?  Catherine turns, back to the wall, calm and intimidating, Stargher stands in the center regarding her with great curiosity.  Catherine's ready to press the sensor.   Don't do that.  She hesitates.   If you go away, you'll never find her.  How did he know?   If you never find her, she dies.  Like the rest.  Catherine stops and listens.  She can't leave now.  The path to Julia has appeared.   I mean, that's why you're here, right? Why you came to my happy little home?  He reaches for her and she flinches.  Expecting such behavior, Stargher grins.   You're pretty.  A pretty, pretty thing.  Catherine cannot show her fear, not now.  She composes herself and approaches him.   Help me?  That's good.  That's a good one.  Liar.  Whore.  Cunt.  Catherine stands her ground.   I am not like him.  Stargher retreats into the shadows, but Catherine persists.   Why?   Is that right?  You think you know me?     A wave of fear, of impending doom, overtakes Catherine.   You wanna know who I am?  You stupid bitch!  And when he emerges from shadow, Stargher is STARGHER KING.   Now shud you mouth, priddy thing, or me god slice you from the kunt to the tits.  Catherine moves to touch the sensor in her hand.  He GRABS, LIFTS and SLAMS her onto the floor, the back of her head HITTING HARD.  Her vision blurs.  Ears are ringing.   Me god want you stay.  Stargher King straddles Catherine and pins her arms behind her back.  She's unable to touch the sensor.  With the tip of the TOOL he traces a line from her pelvis up the center of her suit.   Me god mek you beaudiful...  He shoves the tool through her neck and presses the trigger. A COLLAR CLAMPS SHUT around Catherine's neck and...  She blacks out.    CLOUDS hover above a dark, gloomy landscape dotted with hills.  THREE IDENTICAL WOMEN sit on black earth, their bodies positioned in a uniform pattern.  PULL BACK TO REVEAL NOVAK at their feet, in a kneeling fetal position, face down in the gritty soil, a piece of cloth draped over his head. With difficulty, practically inhaling black grit, Novak breathes deeply and rises to his knees.  His hand moves to his face and he's briefly astounded by the texture of the gravel, the sharpness of it against his face.  Removing the shroud-like cloth, he looks at the soil, smells it, tastes it.    Novak emerges in a cavernous room dripping with decadence. The place reeks of sex, pain, lust, and cruelty.  As he moves deeper into the chamber, Novak sees YOUNG STARGHER perched atop some kind of pedestal, crouching, fingering his mirror LOCKET, bouncing sparkles of light into the dark corners of the room  The FLICKERING LIGHT pinpoints a FIGURE emerging from the darkness.  It is Catherine.  Altered to an image of Stargher's victims.  Her skin, face, clothing, eyes, are just like the Victims'.  It's a shocking, strange image, made even more disturbing by the look of pleasure on her face.  Novak is staggered by the sight.  His vision and hearing become affected by blurred vision, sharp sounds - then focus to clarity as he reminds himself...    Catherine LAUGHS.  Novak catches only a fleeting glimpse of the monster before Stargher King GRABS him by the throat and SMASHES his head against a pedestal.    Eyelids rise and flutter.  Novak becomes conscious.  And instantly realizes what's happened.  He lies on the pedestal, face up, spread-eagle, his wrists and ankles bound to the cold stone surface with leathery cords.  Standing over him, in a pool of light, is Stargher King.  Wearing what could be seen as CEREMONIAL GARB, a silent, solemn Stargher King prepares himself for execution of a ritual by polishing and arranging an assortment of shiny, sharp, macabre TOOLS.  Novak shuts his eyes and silently tells himself, Not real. He opens them, breathes deeply and focuses on Catherine.    Me god gut you like a dear.  Although we don't see it, we HEAR something awful.  Like Stargher King fishing around inside the wound.  A pale, sweating Novak tries to stay conscious.  He will not go into shock...    Nod reel, nod reel, nod reel...   THING THROUGH HIS THROAT!   As Stargher King stumbles away gagging, blood pouring form his neck, we see that she has returned to normal.  The \"bride\" persona is gone.  As Stargher King emits animalistic growls, Catherine turns and sees an intact Novak standing next to her.  As if nothing had happened.  Catherine and Novak RUN out of the den, into the tunnel from which Novak gained access.  He stops, ready to press the sensor, when a FLICKER OF LIGHT dances across Catherine's face.    More stylized than the actual cell, it's bigger and ornately decorated, with the atmosphere of a church.  Individual IMAGES hang like SHRINES, each showing Julia Hickson from different angles.  Central to the room is a WINDOW INTO THE CELL ITSELF.  Where we find a beautiful, mermaid-like JULIA HICKSON floating in water.  Peaceful, joyous.  IN THE CENTER OF THE ROOM, we find Novak and Catherine, she holding the hand of Young Stargher, he stunned at the sight of Julia.  The child looks at Catherine with beatific, sad eyes, regarding her as one would a saviour.   Little Carl opens his mouth in a silent scream... Catherine's arms reach out to him, but Novak clasps her hand and presses. And she is haunted by the sight of a frightened child in the arms of a monster...    A team of FBI AGENTS is meticulously going through every inch of Stargher's house. Crisscrossed wooden beams have been laid across the pit allowing forensics experts to search without disturbing anything.  On the other end of the direct line is COLE...   Can...  Catherine is astonished and relieve to hear him speak.  A sad, trembling little voice.   Can I stay here?  She is touched that he would ask and strokes his face.   He found me...  Catherine bristles as STARGHER KING RISES FROM THE POOL like a human serpent.  The brilliant colors of Catherine's world fade to GRIM TONES.   He always finds me.  Stargher King SCREECHES with anger and confusion.   Where thiisss att?!?!  Me god no like id here...  He snarls when he sees Catherine.   You.  Priddy bish-hor-kund.  You big trubble-mekker...  And you.  You cumm home now, liddle cogsugger worm.  Or me god haffa punish you...  Young Stargher tightens his embrace of Catherine.  She steps back, away from the pond, hugging the boy tightly.   No?!??!?!?!?  Stargher King laughs.   Hoo you thing you are?? Himm Muther?  He comes close and reaches for the boy...   You gimme liddle worm.  For a moment, Catherine appears frightened and intimidated. Perhaps near an emotional breakdown.  But that is not the case.  She quietly lowers little Carl to the ground and whispers something in his ear.  As the boy nods, runs and hides, a ferocity grows within her.   You funny.  You thing you stop me god?  HE CHARGES.  At the right moment, Catherine sidesteps and SMASHES him in the ribs as he passes.  Stargher King crumples to the ground and she KICKS an uppercut to this chin.  Rising from the mud and muck, Stargher King lands a POWERFUL BLOW to her head, sending her flying.  He lifts the stunned Catherine with one hand and pulls her face to his...   You cum back wif me god.  You be good bish-hor-kund...  Catherine looks into his soulless eyes.  Then SPITS in them and BITES his face!  She breaks free as he YOWLS with pain. He steps toward her, but his feet don't move.  The earth itself appears to wrap around them and turn hard, like concrete.  Stargher King HOWLS with frustration.   No!  Catherine stops.  And turns to see the distraught Young Stargher.   Don't hurt him!  She spins around and sees not Stargher King, but MARTIN.   He didn't mean it.  I was bad.  Disturbed by the transformation, Catherine backs away.  Her vision blurs, the sound distorts.  And the earth cracks around Stargher King's ankles.   He teached me a lesson.  I deserved it.  Fighting feelings of disorientation, she kneels before the child and rests the knife on the ground.   Yer world.  My knife.  Stargher King raises the blade toward the boy's throat and - SNAP!  The strong arms of an adult Stargher breaks his arm at the elbow.  Both the knife and boy are dropped to the ground as Stargher King YOWLS like a stuck pig, the good arm cradling the other.   Me god hurt!  Why you do that?  Why?!   Enough.  Stargher King regards him with disgust.   Enuff?!?!  MARTIN STARGHER'S VOICE comes from the belly of the beast.   I'll tell you what's enough...  Stargher and Stargher King square off.  The boy stands between them with the knife at his feet.    Shut up cunt.  Give it here, worm...  the child picks up the blade and stands between them, looking to Catherine for guidance.    You want a mommy?  Is that what you want?  In an almost dream-like motion, the child hands the blade to adult Stargher.   Enough.  And he DRIVES the thing into Stargher King's heart.  For a brief moment, Martin's face is superimposed over Stargher King's.  Stunned, he slumps and regards adult Stargher with sad, troubled eyes.   Time to go 'way.   Bye.  She looks to adult Stargher and begins to understand.  He descends into the pool, the boy resting his head on his shoulder.   Thank you, Catherine.  You did help me. More than you'll ever know.  Man and boy disappear beneath the water's surface.  Catherine stands and sees that Stargher King's body has vanished. She walks to the shore and sees, deep underwater, Stargher and little Carl floating lifelessly like women in the cell. And FADE FROM VIEW.    Cole and a handful of other agents pour into waiting Suburbans.  .",
        "Edward": "You liked him?    's broken.  Undaunted, she... finds herself standing on the DECK.   Mocky-Lock.   \"Mocky-Lock is the bogeyman.  Mocky-Lock wants me where I am.\"    Although this is a hospital room filled with medical equipment, its sterility has been camouflaged with toys, posters, photographs, and drawings to make it more \"homey.\" .  Every comfort has been provided and no expense spared.  Henry, Miriam, and Catherine, now wearing funky/casual clothes under a lab coat, stand opposite Cooperman.  Sitting on the bed with Edward is ELLA BAINES, an elegantly dressed woman in her mid-40's.  There is a soulfulness to her, but the husband, LUCIEN BAINES, 60's, possesses the icy demeanor of a corporate tycoon.  One might write him off as cold, but we sense a genuine love for his wife and child.  Ella smiles and caresses Edward's hair.    And we find ourselves in the DESERT of EDWARD'S WORLD.  We fly over dunes and come up behind Catherine as she struggles through waves of sand.  The tree trunk is up ahead and we glimpse someone hiding inside.  Catherine reaches.  MOCKEY-LOCK ERUPTS FROM WITHIN THE TREE TRUNK!  SNARLING!  Catherine retreats, silently screaming.    The ship's engine ROARS TO LIFE and the PROPELLER spins through sand.    Catherine sits next to the boy's bed, holding Edward's hand, softly singing a lullaby .  Feeling that he must speak to her, Novak intervenes.    Miriam and Ramsey return to the lab to find Henry anxiously observing from the console.",
        "Henry": "\"Mister E.\" is doing fine.  REVEAL A SECOND FIGURE suspended from the ceiling in the PROCEDURE ROOM.  A SMALL BOY is lowered to the pedestal and as Miriam records data, Catherine removes the child's \"mask,\" displaying the haunted face of Edward.  Clearly, the boy is in some kind of catatonic state.   Where did that come from again?  Catherine looks annoyed - How could he forget?   Anybody hungry?  I'm hungry...  A BUZZER sounds and ANOTHER DOOR HISSES OPEN... A constantly fretting administrator, BARRY COOPERMAN, is waiting for them in the corridor.   There are other applications for the scanner, Mr. Baines...   So what you're asking us to do is illegal?   Shouldn't we get a catheter in him?   Gentlemen, you stand before the one and only Neurological Cartography and Synaptic Transfer System.  Although he's listening, Novak's eyes never really stray from his prisoner as Miriam uses safety scissors to cut away Stargher's clothes.   It provides a highly detailed map of the human mind.  Not the brain - any MRI can do that.  The mind.  It reads and processes electronically allowing information to be transferred and interrupted.  Let's say your thoughts could be stored on DVD.  If someone had the right kind of player, they could watch and listen to what you're thinking.  Novak observes Miriam as she \"undresses\" Stargher and Ramsey pokes around the lab.   But we can't record or store the data. The connections between nerve cells are constantly being modified.  Miriam needs a moment to fully take in the scars.  Henry continues, eager to focus attention back to him, but even he is fascinated by Stargher's skin.   It's like the early days of television. The subject sends out a live feed and you receive it during time of broadcast. Whatever happens, happens.  All you have to do is \"tune in.\"  Miriam gives Stargher an alcohol bath, the clinical procedure taking on the quality of ritual.  Her wash cloth moves under Stargher's chin and over his face.  She's careful around the eyes and finds herself unable to look at them for long.   But you do more than tune in... You become part of the snow.  Catherine enters from a dressing area wearing the bodysuit. Filled with curiosity, Novak watches Miriam and Catherine fit Stargher into his suit.   Don't touch that, please.   About twelve years of research, right Miriam?   There's a touch-sensitive microchip implanted in her hand.  If she becomes frightened, disoriented, or simply wants to end the session, she signals us to abort.  Catherine presses again and the red light shuts off.   Not a gift.  A highly evolved area in her cerebral cortex, that's all.  A genetic fluke.   Initiating connection.  We follow fibrous wires running from Catherine's mask to Stargher's.  Their blood mixing with chemicals in the IV-like containers.  The computer system humming.   Transfer begins 1100 hours, 34 minutes, 12 seconds.  Catherine's eye focuses on the mask.  As it comes closer, we see the lining is laced with thread-like wires and microchips forming hyper-miniature circuit boards.  Catherine's eye blinks.  The mask covers her face.  Catherine's eye shuts.  Vision fades.  Darkness.  A faint light.  Microscopic veins in the eyelid become wires connected to chips.  And we're MOVING, into the circuitry.   Gentlemen?  Novak looks at an INTERCOM SPEAKER.   She's back.  Novak doesn't wait for his just-stirring partner and moves.   Must've been rather unusual.  Noting Novak's confusion, Henry points to a CENTRAL MONITOR resembling a futuristic V.U. meter, gradiated in sections of white, yellow, orange, and red.    If her neural activity stays within this range, I know she's self-cognitive.  As if she were having a dream, but she knows she's dreaming.  She can \"wake up\" any time she wants to...  As Ramsey joins them, Novak nods, understanding, but his eyes are on Catherine, who's just coming back to consciousness.    However, if her level of involvement is rather intense, as it was just now, she can perceive things as true.  It's difficult to keep perspective.  As Novak lingers on that question, Ramsey gestures at the red section.   We don't talk about that.   Well, Theoretically, while she's inside. If she came to believe that Stargher's world is her world, her mind has the power to convince the body that anything done to it is, um, actually done.  Novak doesn't like the sound of that.   That's why we monitor the use of the drugs so closely.  We don't want her getting to that degree of perceptual disorientation.   I think that's the whole point.  Valentine runs to his \"sleeping\" master and barks at Catherine as if asking for help.  She encourages the animal to lick and sniff Stargher's face and hands.   That's interesting.  IN THE CONTROL ROOM, he scrutinizes the monitor showing the detailed \"map\" of Stargher's brain.   Increased neural activity in the frontal lobes.  Rising dopamine levels in the basal ganglia.  Ever since the dog walked in.  IN THE PROCEDURE ROOM, Catherine readies herself in the \"receive\" apparatus.  As Stargher is lifted off the pedestal, the doors HISS shut and Valentine curls up on the floor beneath his master.  As Catherine is lifted, she smiles at the animal, then looks to Stargher.   Uh-oh...  LIGHTS FLICKER.  We hear an ELECTRICAL HUM rise and fall. Catherine opens her eyes and the LIGHTS blink on and off in a weird pattern, making it difficult to see clearly.   I'm not.  It's a power problem.  I need you to go to the circuit breaker and check switches six through twelve.  Catherine moves toward the electrical panel.   Try to stay awake, okay?   Miriam...   Pulse is rapid, pressure's a little high...  IN THE PROCEDURE ROOM, Miriam asks:   We should hurry.  Miriam walks Novak through what's about to happen.   Agent Novak?  Press the sensor.  Novak does and the red light comes on.  As Novak is LIFTED, he looks at Catherine, then Stargher.  Valentine YIPS and settles beneath Novak.  The suspension device clicks into place and the MASK descends.   They're back.  Everything happens fast.  He and Miriam frantically cease the procedure. Novak and Catherine are lowered and Novak startles them by quickly regaining consciousness.  Miriam attempts to inject him with stabilizing drugs, but he's already trying to tear himself out of the apparatus.   The FBI has left the building.  IN THE PROCEDURE ROOM, Miriam appears concerned.   ...there was a moment when we thought we'd lost Agent Novak as well.  We see chemicals flow and computer programs initiate the procedure, but Henry is oblivious.   His post-procedure consciousness recovery was remarkably quick.  Never saw that before.  Hey, remember that one time...  He JUMPS when the door to the procedure room SEALS SHUT and mechanisms HUM.   Catherine?  When he looks through the window, Catherine is again suspended, the procedure under way.   What are you doing?  He types in a command, but nothing happens.  He tires again. On another keyboard, but gets no response.  When he looks at the \"map\" screens, he sees something odd.  It's a small change, but it makes all the difference in the world.    She changed the codes.   It would take hours to re-route the system, and even if I did, I shouldn't.   Instead of going into his mind...",
        "West": "",
        "Peter": "",
        "Novak": "Thanks for waiting, Teddy.  Teddy gives Novak a friendly, respectful salute - \"My pleasure.\"  Novak dons gloves, nods to an FBI PHOTOGRAPHER and assists Teddy Lee in snipping wire and peeling back thick clear plastic.  As the photographer reacts to a strong smell, Teddy comments.   Anne Marie Vicksey.  We recognize her, too.   Just graduated law school.  Single mom. Had a two-year-old daughter.  He and Teddy expose the bleached flesh of her torso, neither man surprised.  Coldly thorough, Novak finds another of the killer's tell-tale signs.    The semen on her legs and abdomen.  FLASH! Photos are taken.   Grandparents.  Live over in Davis.  Novak looks into the dead white eyes of Anne Vicksey, trying to imagine the horrors she beheld.  He moves to the creek and sees only a few inches of water.  His eyes move from the drop site to the highway above.   How is she?   Here he is.   Anne Vicksey didn't own a dog.  Ramsey checks his copy.   I need it.   Now.   The dog's an albino.  He'd love an animal like that.   Donna Krozin.  Helen Francis, Teresa Manicki...  The chatter dies.   Antoinette Simms, Natalie Pagels, Grace Cassatt... Anne Vicksey.  Every person is solemn and focused.   Smart, gentle, attractive young women. Just starting out in life. Embarking on careers, going to school, getting married...  He's hooked them.  The victims, these women, now mean something to them.  With great effect, he holds up grisly post-mortem photos.   They were killed.  Kidnapped, tortured, and murdered.  By a white male.  About 30-years old.  Who owns an albino dog./  Everyone knows this is a real clue and awareness is heightened.  Ramsey chimes in.   Nicole Labetzki.  Victim seven. Forensics found dog hair in her car, but they had a K-9 unit at the scene and never had it checked.   It's his dog.  Ramsey holds up a thick list.   Be thorough, but be fast.  This guy's accelerating. He only waited six days this last time. When he started, two months could pass.  A DESK SEARGENT enters the room and hands a FAX to Ramsey. Novak is curious about it, but continues.   This can mean different things.  He thinks we're stupid and can't catch him. He's having fun and needs more.  Or...  This dog hair thing is sloppy.  The body this morning was found in less than three inches of water.  He knew we'd find her.  He wants to be caught.  But if we can't stop him...  Gravely concerned, Ramsey moves across the room.    ...he can't stop himself.   After three years she remembers what the guy drove?   Where is he?   You're the bad man, aren't you, Carl?   Have they seen him?   We proceed assuming she is.   No.  Can you get a man close?   Go.   Paramedics.  NOW.  Ramsey pushes through and Novak informs him.   He's alive.   Make sure he stays cuffed.  Two men on him at all times.  I don't want anyone treating him but Reid.  Not so much as a thermometer up his ass.  Understand?  Stockwell nods and follows the stretcher outside.  A stoic Ramsey enters from the living room and Novak can see the disappointment in his eyes.   This girl.  Julia Hickson.  Only he knows where she is.   They're in that fucking thing for forty hours, Gordon.  Four-oh.  He got Julia at seven-thirty last night.  You know what time it is now...?!  Ramsey backs off, knowing his partner is on the verge of really losing it.  Reid thinks perhaps he shouldn't, but sensitive to Novak's pain and anger, mentions it anyway - if only to keep his friend from true hopelessness.   Sometime yesterday morning.  John tries to keep his composure, but Novak's making this tough for him.  Novak wants the scientists to see, to understand the boy's pain.   Each tape is the same.  He provides food, drinking water, a toilet. Periodically, a shower starts.  It's on some kind of timer - he's clever with machines, building things.  I think he wants them to believe this is a simple kidnapping.  That there's a possibility of rescue.  Of survival.  But it's just a form of torture.  At the end of the fortieth hour, the drain shuts.  The water starts and doesn't stop.  We've already lost more than a day.  If she isn't found tonight.  She dies like the rest.   Stargher is in custody.  The functional equivalent of being under arrest. Normally, we'd Mirandize him, and if he didn't lawyer up, we'd interrogate him. But because of his condition, he doesn't have the capacity to waive those rights.   No, not at all.  We're dealing with exigent circumstances.  Somewhere there's a kidnapped woman still alive.  If we weigh the suspect's Constitutional Rights against the public safety. The Law favors the victim and gives us a lot of leeway.  It's called the Public Safety Exception.   Pretty much anything we want.  There's a chance to save a human life.  Because of that, Stargher has no reasonable expectation of privacy.  Miriam, Henry and Cooperman appear to be onboard.  Novak's made a persuasive, heartfelt argument.  Only one person still remains uncertain.   As far as I needed.  Catherine nods, analyzes Novak's eyes, gestures, body language, and \"interrogates\" him.   There's always a chance they'll confess.   Sometimes... Once they've been caught they feel a need for disclosure.  They have so much they want to tell. But they've never had a sympathetic ear. They need someone to understand why.  Stargher used to hide the bodies very carefully.  It was part of the ritual. Some weren't found for weeks and any physical evidence had been meticulously wiped clean.  But these last three... They were still in water - always in water - but  Listen, he wasn't just careless.  It went beyond that...   Thanks.  Once he's gone, Ramsey takes this moment \"alone\" to question his partner.   What else do we do?!   I don't have to.   Tell you what.  If this thing burns us, I take that heat.  I give you permission to point your finger at me and say \"It was all his idea.\"   That won't happen.  Cooperman appears in the doorway and informs them...   I still don't understand why I can't do this... This isn't some \"troubled kid\" you're dealing with.   How hard could it be...?  Catherine and Miriam try to hide their laughter.   This man is deeply disturbed, he...   I know him.   (eyes on the chemical/drug monitors That's the stuff?   You said she has a \"gift.\"  Overhearing, Henry interrupts, pointing at a section of Catherine's \"mind map.\"   What happened?   What happens?   Dr. Kent?  IN THE PROCEDURE ROOM, Miriam eases Catherine back to consciousness.   I'll get her...   Edward Baines, I presume.  Hi, Ed.  I'm Pete.   No.  Not at all.  From what I understand, he knows I\"m here, isn't that right?  Catherine nods.  Novak picks up Edward's fallen teddy bear and rests it in the crook of the child's arm.   I read about a woman in TExas who was in a coma for seven years.  Every time her husband came to visit, her heart would beat faster.  Isn't that something?  I don't know what name scientists have for something like that...   What then?   Ah, the part of us that can't be explained.  She appreciates his understanding.  And finds herself comforted by his presence.  Catherine scrutinizes Novak, his intensity, his honesty, his complexity.  And asks:   Peter, okay?   Absolutely.  I suppose everyone does.   That's what therapists are for, right?  Catherine laughs.  It helps her relax.  If only slightly.   What did you see?   You're the shrink, you tell me.   It's an old lawyer trick.  Target the emotions.  Do it right, you get a reluctant witness to testify, a scared kid to confess.  Catherine looks at him with disbelief.  \"You?!\"   Before I was with the Bureau, I was an attorney, a prosecutor.  Mr. Law and Order.  And then... I had a murder case in North Carolina.  Charles Gish. Butchered seventeen people in three days.  And because of one tiny piece of tainted evidence, he walked.  That's when I quit the DA's office and joined the FBI.  Catherine can see the pain and frustration in Novak's eyes. She gives him a moment and asks:   I did, yeah.   What about Julia?   You think you can do this, don't you?    This is Stargher we're talking about?   Whoa.  Hold on.  Aren't they the same guy?   It's hard for me to see Stargher as human, capable of something like \"remorse.\"   Evil.   Maybe this is a big fucking waste of time.   What difference does it make...?   Right after the trial, the night after he was released.  Mr. and Mrs. Frank Simmons found Charlie sitting in their living room watching TV with their twelve-year old daughter Margaret.  He'd cut her right down the middle with a carving knife.   Found the girl's heart in the freezer - he thought they might want to keep it.  Luckily, the next thing he did was slit his own throat.  I am convinced of one thing. Charles Gish could've been raised by Ozzie and Harriet and the same thing would've happened.  He can see Catherine doesn't accept that.   A child can experience abuse worse than Charlie's.  And grow up to be someone who would never, ever hurt another living thing.   Yes.  I am.  Catherine realizes that was a confession.   Right here.   But you looked so cute.  All sleepy...  Ramsey shoots him a murderous look, then asks Catherine.   Thank you.  Briefly, he touches her hand.  Catherine looks away from John to Novak's hand, to the photographs on the wall.  Stargher's house, Valentine, the pick-up truck.  Valentine...    Remember, Julia Hickson is priority number one.  Nothing else matters.  Find out where she is.   When we got here, you just topped and pulled her out.   Into Stargher.  Inside...   No.  Miriam nods, knowing he won't accept an opposing argument.   Absolutely.  She loads a MICROCHIP SENSOR into a high-pressure injection gun and IMPLANTS it in NOVAK's HAND.  He winces from the brief pain as she loads the chemical cartridges.   Prevacid.  For my stomach.   No.   No.   I am.  I'm a pretty boring guy.   Not real...  Like an ethereal queen of the damned, she strides toward him, narrowing her eyes.   Catherine.  She exhibits no recognition of her name.  Catherine seductively moves closer to Novak, their bodies almost touching, her hands caressing his hair, lips, neck...   Jesus.  Catherine.  Listen to me...  She presses her finger to his lips and forces him down, onto the floor, his back to the pedestal.  Catherine straddles Novak, and when he tries to stand, she holds him down, forcing him to stay.    You're Catherine Young.  You majored in Psych at UC San Diego.  You work for Sunerset Industries.  Stargher King's fingers pass over an array of horrific instruments - the throat piercer/collar mechanism, a cleaver knife, a misshapen hammer, a long slender needle...   Your grandmother raised you after your parents died in a car crash...  Stargher King lifts the blade-like NEEDLE.  So far, Catherine looks at Novak like he's speaking gibberish.   When you were twenty-one, you were arrested for possession and got off with community service.  Stargher King SLICES through Novak's clothes, exposing the flesh of his abdomen.    Not real, Pete...This is not real...  You had to work at a center for abused kids for three months.  You stayed on two years for no pay.  You give half your fucking salary to the nursing home your grandmother stays at...  Stargher King grabs his throat and traces the blade down the center of Novak's torso.  Novak struggles and pleads with Catherine.   I know this because I work for the FBI. Peter Novak, remember?!?!  Remember.  You are Cath-  Stargher King cuts his flesh and INSERTS the needle into his stomach.  NOVAK SCREAMS!  This fucking hurts!   Help me!!!  Stargher King wiggles the needle, pulls it out, and digs his finger into the wound.  NOVAK CRIES IN PAIN.    Fucking FEELS real!  The intensity of Novak's cries hit Catherine like a thunderbolt.  There's a glimmer of life, of recognition in her eyes.   Not real.  Not real.  Not real.  A FEMALE HAND grabs the tool from the tray.   Like hell \"wait.\"  But she won't listen and he's forced to play catch up as she moves further from the den toward the cliff face.  The FLICKER OF LIGHT shines on the entrance to a specific TUNNEL.   Little boy?!  That's him!   Where the hell are we?   Let's go.  He pulls her to her feet.  Feeling betrayed and rejected, the child breaks away from her.  THE ROAR OF STARGHER KING shakes the cell.  Terrified, the boy searches for a place to hide.    Get me out!  Miriam MOVES into the PROCEDURE ROOM.    Is she alright?   This is Novak, who've I got?  A confused Ramsey enters and listens.   I need you to find something in the basement...   That hoist, with the winch...  WE FOLLOW Cole as he moves to the machine.   There's some kind of plaque, a metal plate, with a logo.  On the base.  Cole locates it.   Find out the history of that machine. Who bought it, used it, sold it.  And check Stargher's pay stubs.  I want to know every contractor he worked for. I'm calling you from the chopper in ten minutes.  Dizziness and disorientation again hit Novak.  Pale and sweating, he winces as his stomach agonizingly cramps.   Considering where I've been...  Fighting the pain, he gathers together MAPS, slips on his shoes and grabs gun and holster.  Ramsey is apoplectic.   I saw her.  Julia.  Alive.  I saw everything.   Cole?     Delano?   You're kidding me.   The exact location, Cole.  Give it to me.  The pilot grins and pushes the copper to top speed.    Cut the engine!  As the motor dies, Novak listens and listens.  There it is. Water pipes beneath his feet.  And very faintly, a pounding. He follows the sound, searching the earth.  It's clearer now, louder.  Novak tosses aside rusted junk and the pilot runs to assist him.  Together, they expose the entrance to the underground sanctuary.     Dr. Kent.   Thanks you.  Six weeks off does a body good.  I heard she got the approval to try the reversal with Edward.   Federal Bureau of Investigation, ma'am. We know all, see all...  Novak opens the rear compartment of the Suburban and we hear something moving inside.   How's the patient.   What about the cat?   Ready?  Catherine cradles her cat.   That went well.   You sure about this?   Yep.  Eloped.   Well look at that.   So you say.  Amazingly, Abigail brushes up against the dog and purrs.   All yours.  My boss says it's one of the strangest requests the Bureau's ever had.  Catherine laughs.  She likes that.   He also says that until proven differently, Julia Hickson was found as a result of good old-fashioned detective work.   I don't know.  I think it does.  You know, Catherine... If you ever want to talk about it.  What happened to Stargher.  That last time.  It's painfully clear the thought of it still troubles her.   I got it.  He moves into the kitchen.  In a moment of quiet introspection, Catherine looks at the television screen, at Dorothy accidentally hitting the wicked Witch with a bucket of water, causing her to melt.  And she looks away, unable to watch, disturbed by the image.  She turns to the kitchen and sees Novak feeding an appreciative dog and cat.  He rises and returns to the living room.   No problem.",
        "Mrs.": "",
        "Hickson": "Yes, sir.    But nobody was moving in together 'til after the wedding.  Novak hasn't said much.  Instead, he looks at something in his hands - a plastic evidence bag containing the TOY DOLL.   Maybe you made a mistake.  Maybe she... she...  Novak hides the doll.",
        "Teddy": "Bleach.  As the man snaps pictures, Ramsey and Cole join them.  Sadly, Novak recognizes the face.   Someone looking after her little girl?   The poor thing.  FLASH!  We're up there now, ON THE OVERPASS, with the photographer and Novak, examining TIRE TRACKS in the soft shoulder.  Novak peers over the edge at the crime scene, steps back, and focuses on the highway - imagining the killer's truck as it disappeared into the night.     Hot off the presses.  He gives them copies of the AUTOPSY REPORT and FORENSIC ANALYSIS of Anne Marie Vicksey.  The WAITRESS sees Teddy, approaches, and offers a menu.    Chicken fried steak, mashed potatoes, garden salad with Thousand Island dressing and an iced-tea.  Thank you darlin'.  She nods and moves to the kitchen.  Novak and Ramsey flip through the documents.   Water in her lungs.  Same brand of bleach.  Match on the semen.  Lots of hair.    So?   Now?   Complete absence of melanin.  Novak and Ramsey stand over his shoulder.   Gentlemen, I believe an albino dog is rare indeed.   The Phoenix office tested that hair thirty minutes ago.  And we got the match.    He's schizophrenic.  Novak doesn't like this.  Not one bit.   What about Thorazine? Or... Desoxyn?",
        "Lee": "Bleach.  As the man snaps pictures, Ramsey and Cole join them.  Sadly, Novak recognizes the face.   Someone looking after her little girl?   The poor thing.  FLASH!  We're up there now, ON THE OVERPASS, with the photographer and Novak, examining TIRE TRACKS in the soft shoulder.  Novak peers over the edge at the crime scene, steps back, and focuses on the highway - imagining the killer's truck as it disappeared into the night.     Hot off the presses.  He gives them copies of the AUTOPSY REPORT and FORENSIC ANALYSIS of Anne Marie Vicksey.  The WAITRESS sees Teddy, approaches, and offers a menu.    Chicken fried steak, mashed potatoes, garden salad with Thousand Island dressing and an iced-tea.  Thank you darlin'.  She nods and moves to the kitchen.  Novak and Ramsey flip through the documents.   Water in her lungs.  Same brand of bleach.  Match on the semen.  Lots of hair.    So?   Now?   Complete absence of melanin.  Novak and Ramsey stand over his shoulder.   Gentlemen, I believe an albino dog is rare indeed.   The Phoenix office tested that hair thirty minutes ago.  And we got the match.    He's schizophrenic.  Novak doesn't like this.  Not one bit.   What about Thorazine? Or... Desoxyn?",
        "Julia": "Oh no...   God... I didn't see you.  STARGHER'S HANDS COME AT HER FROM BEHIND!  One grabs her hair and the other covers her face with a chloroform-soaked towel. He presses so hard, she cannot scream, cannot move.  After a brief struggle, he SHOVES her into her car and holds her until she passes out.  Stargher pushes Julia into the passenger seat and starts the car.  Pulls a dog treat from his pocket and WHISTLES.  The Shepherd instantly perks up. Perfectly healthy.  And jumps into the car.   Hey!     Our Father, who art in heaven, hallowed be thy name.  Thy kingdom come, thy will be done.  ON THE OTHER SIDE OF THE GLASS, we watch her through one-way glass from the video camera's point-of-view.  She looks right at \"us,\" in the mirror, saddened by the dark circles under her bloodshot eyes.   ...on Earth as it is in Heaven.  We drift to the right and see the l.e.d. counters CLICKING AWAY.  01:44:54, 01:44:53, 01:44:52... Less than TWO HOURS to live and she has no idea.   Do something, Julia.  She looks around the room and runs her hands along the walls, the tile, looking for a weak spot.  She focuses on the CEILING PANEL and although it's painful because of swollen fingers, removes her ENGAGEMENT RING.    The thick Plexiglass still remains, but she now can see him. Novak pulls his ID BADGE and smacks it against the glass."
    },
    "imdb_rating": "6.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMDY1NmVmOTItYWU0NC00OGU2LWIyNTctYTU3NTY3ZjJkOWJjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "Catharine Deane is a psychotherapist who is part of a revolutionary new treatment which allows her mind to literally enter the mind of her patients. Her experience in this method takes an unexpected turn when an F.B.I. Agent comes to ask for a desperate favor. They had just tracked down a notorious serial killer, Carl Stargher, whose method of operation is to abduct women one at a time and place them in a secret area where they are kept for about forty hours until they are slowly drowned. Unfortunately, the killer has fallen into an irreversible coma which means he cannot confess where he has taken his latest victim before she dies. Now, Catherine Deane must race against time to explore the twisted mind of the killer to get the information she needs, but Stargher's damaged personality poses dangers that threaten to overwhelm her.Kenneth Chisholm <kchishol@home.com>",
    "name": "The Cell",
    "genres": [
        "Crime",
        "Horror",
        "Sci-Fi"
    ]
}