{
    "filename": "Tourist,-The_script.txt",
    "imdb_id": "tt1243957",
    "imdb_url": "https://www.imdb.com/title/tt1243957",
    "characters": [
        "The Englishman",
        "Brigadier Marion",
        "Frank Tupelo",
        "Sergente Cerato",
        "Inspector John Acheson",
        "Tenente Narduzzi",
        "Tenente Tommassini",
        "Reginald Shaw",
        "Brigadier Ricuort",
        "Conte Filippo Gaggia",
        "Brigadier Kaiser",
        "Chief Inspector Jones",
        "Elise Clifton-Ward",
        "Capitaine Courson",
        "Colonnello Lombardi"
    ],
    "dialogues": {
        "The": "ANGLE ON A SPECIALIST who kneels to open an electric panel. REVEAL a glass plate with a fingertip shape in the center. The SPECIALIST places his hand against the glass: a red light beeps on -- it's a bio-metric lock.  He turns to Ackerman.    Ackerman shakes the doorknob, cursing; a Tall Commander calls for the BATTERING RAM which is rushed up the stairs...  The tactics team CRACKS the door.  Ackerman charges into...    Cara stands frozen beside the man's effects on the night table. The wallet. The keys. The watch.    Ackerman turns to face the study.  On the desk is a cup of coffee with steam gently rising from its surface. A cigarette sits lit in an ashtray, the smoke curling toward the ceiling.  Ackerman stares at the empty, slowly revolving, chair.  He walks toward CARA, now in custody.      He holds her defiant gaze for a moment.     A clear, bright winter day at the beach. Devoid of tourists, the famous stretch is a completely different Venice from the one we're used to seeing.  Sandbanks stretch out into the dark green sea.  Cara and Frank walk on a deserted patch of sand.   The wind wraps her light sun dress around her body, intermittently hugging her perfect curves.    REVEAL the lens of a PALM-SIZED VIDEO CAMERA peering out from behind a vendor's cart in the street below.  Frank, his face slightly obscured, kisses Cara.  WE HEAR the WHIRRING of the video camera.     The silhouettes of Cara and Frank disappear into the hotel room as...     Laying the paper on the table, Frank walks to the door.    The two TOUGHS rapidly move through the room, searching. Nyet, Nyet.   The one place they haven't checked...    Frank puts one bare foot on the stonework. He grimaces as he HEAVES himself onto the railing of the balcony adjacent to his.  He hangs desperately, flailing, 100 feet over the street below. He gets a tentative hold...  A PALLID FRENCH WOMAN drops her coffee and screams.  The Russians sprint out to the balcony.    They spot Frank...  Who shoves the Pallid Woman inside, struggles past her breakfast table, and prepares to leap again-- but slips on the spilled coffee.  Bullets shatter China around him. He cuts his foot on a broken plate. He grabs his bleeding foot.    Frank runs through the hotel room, past the Welshman's wife to the door.  A SHOT behind him and pounding feet send him out into the corridor past a room service steward to an...    Ducking inside a leather shop, Frank heads straight for the back entrance and finds it.  He stands on the cobblestones. Blood streams from his forehead as well as his hand. He has     Have you been reading the newspaper?   Cara narrows her focus. She walks away from Frank, stealing away into the bedroom. Her heart is beating.   No names.    Not on the phone.    There's a recipe in a Tuscan cookbook there I need. Would you look it up for me?  I want to make sure our guests are surprised.  You're a brave and loyal girl. I'm in awe of you.    You may not believe it, but every step of this miserable game is taken in the hope of earning your trust and ever-lasting regard. I mean that.   Frank listens to the end of Cara's conversation, his forehead creased with concern.     Frank struggles to close Alexander Pearce's pants around his lightly padded mid-section... a little too tight.  Frank is irritated to discover he's not quite as trim as Pearce.     Frank engages himself in a spontaneous program of CALISTHENICS. He struggles through a batch of push-ups, then sit ups.     Frank flosses his teeth. Then he backs up, taking in his outfit. The lines of the suit highlight his frame.  He likes what he sees.     Standing up, Ackerman holds his hand up.     Cara glances up from her menu as she senses the elegant man approaching.  The WAITER walks quickly toward Cara's table...  The elegant man is FRANK.     Ackerman stares at the monitor with Frank's face on it. He's quietly furious.    Cara stares slack-jawed at Frank.  He has given himself a complete make-over.    New haircut. Pearce's suit fits him well.  He looks terrific. Cara notices before quickly recovering her composure.    Ackerman barks whispered orders into the speaker:     Defiantly, Frank pulls his chair in closer to Cara.    He signals to a different THIN WAITER.    The Undercover Waiter tries to move past Frank.    The black boat slips underneath some moorings.  A gloved hand tosses a grappling hook up to a beam ten feet overhead. It catches. The boat is tied off.  Silently, a masked figure begins to climb from the boat up into the bottom floor of the villa in the semi- darkness.     PEARCE'S ENTRY HALL. Cara unlocks the front door with a key and walks inside.     Cara takes a step back toward the window.   Demidov follows.     $20 million dollars worth of surgery and that's the face you chose?",
        "Englishman": "Have you been reading the newspaper?  No names.    Not on the phone.    There's a recipe in a Tuscan cookbook there I need. Would you look it up for me?  I want to make sure our guests are surprised.  You're a brave and loyal girl. I'm in awe of you.    You may not believe it, but every step of this miserable game is taken in the hope of earning your trust and ever-lasting regard. I mean that.  $20 million dollars worth of surgery and that's the face you chose?",
        "Brigadier": "",
        "Marion": "",
        "Frank": "Sorry!   Excuse me. Pardone moi.  Hmm?  I'm afraid of hurting you.  I'm... sorry.  Maybe I should let you do this--  My name is Frank.  Pardon me?   Oh, no.   We're not actually--  What?   No.  Just nervous.    I don't like travelling.  I'm on my honeymoon.  She's in Pennsylvania.  You're sure you want to hear this?  Two weeks ago she left me. For the owner of a pizza parlor.  No travel insurance. No refund on the tickets. So... here I am. On my honeymoon.  I really loved that pizza too. \"Bala Pizza\" if you're ever in Rosemont.  Thanks.  What takes you to Venice?  Okay... you'd be a diplomatic attaché or... let's see... a girl from East Germany whose father's been kidnapped by Soviet agents. They're blackmailing you into stealing... probably a microchip. There's usually a microchip involved.  Trouble, certainly.  No doubt. You'll probably be shot at in less than two chapters.  Maybe.  I was afraid I'd missed you. I wanted to ask where you're staying in Venice... I'm supposed to catch a shuttle to my hotel but I thought maybe--  What's not to like?  I can see that.  No, no, no. The sofa's fine. Perfect in fact.  I'll get it.  I've put my things in the other bathroom.  I'm a teacher. High school math. And you? What do you do?  You're good at it.  I'm not really into weddings at this particular moment in my life...  Hmm?  I suppose that's a possibility. That's what I tell my statistics class anyway; life is a game of chance. Endless possibilities and permutations. You just have to calculate the odds.  Well... I'd like to think that love is a question of destiny, not chance...  He doesn't sound like much of a friend.  So why are you wearing his watch?  What? No, I can't. This thing must be worth a fortune--  I'll wear it until you regain your senses.  What?  I could get used to this.  What... what did I do?  When she...?  Thank you.  Goddamn it!   I'm a fucking tourist!  Shit...  Excuse me...  The officers told me to wait here. I've been sitting here for over two hours...  Somebody tried to kill me.  You think I'm crazy but it's all true.  I have absolutely no idea.  They came to the room. They pretended to be room service.  I didn't \"scopata\" anybody!    No.  I met her yesterday.  I didn't take her. She took me.  Not usually.  No.  I think that's possible.  She didn't give me one.  Um... thanks.   Where are we going?  I'd really rather just go--  Hello?  That's a relief.  I'd like to be on a flight home tomorrow morning.      A little.  Um... you may not believe this but there are some people trying to kill me--  Do you know why?    There's not enough room!  We won't make it!  Do I look that much like Alexander Pearce?  The watch.    Great.  We should go to the police.  And I thought I wouldn't get to do any sight-seeing.  Whoa!  What are you doing?  He goes Barracuda fishing?  With these ingredients, it's not hard.  You know something? Food tastes better after you've been shot at.  Can I ask you a question.  What's it like? Being a criminal?  You carry a gun, you consort with people being chased by killers... I hate to break it to you, but--  For Alexander Pearce?  What's he like?    Kissing you.  I thought...   His eyes are open.    Resolved?  When will I see you again?  Is he worth it?  You're going to risk everything for him. Would he do the same for you?  He doesn't deserve it.  Time for Alexander and me to meet face to face.      Not particularly, but I'm tired of being afraid. I've been running around like a frightened mouse long enough and I've decided I'm finished.  When I first saw the name I got scared: \"Alexander Pearce.\" He even sounds like some super cool master criminal with Russian enemies and the beautiful girlfriend... he probably works out. He might own a pizza shop on the side for all I know.  These are disgusting.  Probably not. But I'm doing it anyway. Alexander Pearce nearly got me killed. It was his idea, right?  He told you to pick out some random sap on the train to take a bullet for him, didn't he?  Well I'm not playing the role anymore. I'm going to confront him. He's supposed to meet you here, isn't he? I'm going to tell him exactly what I think of him.  What's the lure, Cara? Obviously not his character. Is it the money? The luxury? What's any of that worth if you're getting shot at and you could go to jail?  He's smooth, right? He probably has mistresses in every European city, too.  What the hell?  Is this him?  You hide out poolside and send your girlfriend and a total stranger to face the murderers who are after you? Not much of a tough guy, are you?  Where I come from, we don't treat women like that!  Cara!  It's borrowed.  Unfortunately.  Police... better than the alternative I suppose.  Who's watching from behind there?  I haven't needed it lately.  You're in for a disappointment. I'm not Alexander Pearce.  Since when?  How...?  You?  Cara...    I want to speak with somebody at the American Embassy. I'm going to tell them that you and your undercover officer knowingly and recklessly endangered the life of an American citizen! Let's see what my government has to say about that!  Then I'll go to the press. I'll tell the entire story to the New York Times.  Why not?  In my case, they don't come along at all.  If she's so smart, how did she get caught up with Pearce?  Then why are you still using her?  You think she'll turn him in this time?  It's not just me, is it?  If you're all around his house, will he show up?  I'm sorry.  Ackerman told me everything.  There's no apology necessary.  Like the most beautiful woman on earth.  Ackerman asked me to stay with the surveillance team in case the thugs who came after me at the Danieli show up. I'm the only one who can identify them.  Did you tell him to keep an eye on me?  You shouldn't worry about me. What about you?  What are you going to do?  You all read the same newspaper.  I look forward to meeting him.    Nothing to be sorry for.  Are you all right?  You didn't get to arrest Alexander Pearce...    It's me.   I'm here.  You said I'd told so many lies, you wouldn't believe me even if I did tell the truth... This was the only way to convince you. The truth is that I love you. All that matters is that you believe me.      The Americans have their money.   I left it all for them.  Well... You have to save something for your pension.",
        "Tupelo": "",
        "Sergente": "",
        "Cerato": "",
        "Tenente": "",
        "Narduzzi": "",
        "Tommassini": "",
        "Reginald": "",
        "Shaw": "",
        "Ricuort": "",
        "Kaiser": "",
        "Elise": "",
        "Capitaine": "",
        "Courson": "",
        "Colonnello": "",
        "Lombardi": ""
    },
    "imdb_rating": "6.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTMyMzc3OTkwMV5BMl5BanBnXkFtZTcwMjc0MTgwNA@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Elise (Angelina Jolie) sits next to an American tourist, Frank (Johnny Depp), on a train going to Venice. She has chosen him as a decoy, making believe that he is her lover who is wanted by police. Not only will they need to evade the police, but also the mobster whose money her lover stole.—Douglas Young (the-movie-guy)",
    "name": "The Tourist",
    "genres": [
        "Action",
        "Thriller"
    ]
}