{
    "filename": "Shawshank-Redemption,-The_script.txt",
    "imdb_id": "tt0111161",
    "imdb_url": "https://www.imdb.com/title/tt0111161",
    "characters": [
        "Captain Hadley",
        "Bogs Diamond",
        "Tommy",
        "Brooks Hatlen",
        "Andy Dufresne",
        "Skeet",
        "Floyd",
        "Warden Norton",
        "Ernie",
        "Jigger",
        "Guard Mert",
        "Heywood",
        "Snooze",
        "1946 D.A.",
        "Ellis Boyd 'Red' Redding"
    ],
    "dialogues": {
        "Captain": "",
        "Hadley": "On your feet before I fuck you up so bad you never walk again.   Eyes front.  WARDEN SAMUEL NORTON strolls forth, a colorless man in a gray suit and a church pin in his lapel. He looks like he could piss ice water. He appraises the newcomers with flinty eyes.    Off with them clothes! And I didn't say take all day doing it, did I?  The men shed their clothes. Within seconds, all stand naked.   First man into the shower!  Hadley shoves the FIRST CON into a steel cage open at the front. TWO GUARDS open up with a fire hose. The con is slammed against the back of the cage, sputtering and hollering. Seconds later, the water is cut and the con yanked out.   Delouse that piece of shit! Next man in!  The con gets a huge scoop of white delousing powder thrown all over him. Gasping and coughing, blinking powder from his eyes, he gets shoved to a trustee's cage. The TRUSTEE slides a short stack of items through the slot -- prison clothes and a Bible. All the men are processed quickly -- a blast of water, powder, clothes and a Bible...   What the Christ is this happy shit?    You'll be tellin' him with my baton up your ass!  Hadley arrives at Fat-Ass' cell, bellowing through the bars:   What's your malfunction you fat fuckin' barrel of monkey-spunk?   I ain't gonna count to three! Not even to one! Now shut the fuck up 'fore I sing you a lullabye!  Fat-Ass keeps blubbering and wailing. Total freak-out. Hadley draws his baton, gestures to his men. Open it.  A GUARD unlocks the cell. Hadley pulls Fat-Ass out and starts beating him with the baton, brutally raining blows. Fat-Ass falls, tries to crawl.  The place goes dead silent. All we hear now is the dull THWACK-THWACK-THWACK of the baton. Fat-ass passes out. Hadley gets in a few more licks and finally stops.   Get this tub of shit down to the infirmary.  If I hear so much as a mouse fart in here the rest of the night, by God and Sonny Jesus, you'll all visit the infirmary. Every last motherfucker here.  The guards wrestle Fat-Ass onto a stretcher and carry him off. FOOTSTEPS echo away. Lights off. Darkness again. Silence.   ...so this shithead lawyer calls long distance from Texas, and he says, Byron Hadley? I say, yeah. He says, sorry to inform you, but your brother just died.   I ain't. He was an asshole. Run off years ago, family ain't heard of him since. Figured him for dead anyway. So this lawyer prick says, your brother died a rich man. Oil wells and shit, close to a million bucks. Jesus, it's frigging incredible how lucky some assholes can get.   Thirty five thousand. That's what he left me.   Dumbshit. What do you figger the government's gonna do to me? Take a big wet bite out of my ass, is what.   Maybe leave me enough to buy a new car with. Then what happens? You pay tax on the car. Repairs and maintenance. Goddamn kids pesterin' you to take 'em for a ride...   That's right, wanting to drive it, wanting to learn on it, f'Chrissake! Then at the end of the year, if you figured the tax wrong, they make you pay out of your own pocket. Uncle Sam puts his hand in your shirt and squeezes your tit till it's purple. Always get the short end. That's a fact.  Some brother. Shit.  The prisoners keep spreading tar, eyes on their work.   That's funny. You're gonna look funnier suckin' my dick with no fuckin' teeth.   That's it! Step aside, Mert. This fucker's havin' hisself an accident.  Hadley grabs Andy's collar and propels him violently toward the edge of the roof. The cons furiously keep spreading tar.   You better start making sense.   Naw, that ain't right! Tax free?   You're the smart banker what shot his wife. Why should I believe a smart banker like you? So's I can wind up in here with you?   Fuckin'-A. I don't need no smart wife-killin' banker to show me where the bear shit in the buckwheat.   Ambulance-chaaing, highway-robbing cocksuckers!   What are you jimmies starin' at? Back to work, goddamn it!   Drink up, boys. While it's cold.   Poor fella must'a tripped.  A tiny drop of blood drips off the toe of Hadley's shoe and  splashes across Red's upturned cheek. He wipes it off, then looks down at Bogs. Cons and guards are racing to the scene.   You wanna explain this?  Andy glances over. Hadley is holding up a rock blanket, a polishing cloth roughly the size of an oven mitt.   Looks pretty clean. Some contraband here, nothing to get in a twist over.  Norton nods, strolls to the poster of Rita.   Dufresne!   another GUARD, a huge fellow named DEKINS.   That's him. That's the one.  Hadley exits. Dekins approaches Andy ominously. Andy stands his ground, waiting for whatever comes next. Finally:     What am I, talkin' to myself?   Dufresne! What the fuck did you do?  Your ass, warden's office, now!  Andy shoots a worried look at Red, then heads off.   You tell me, fuck-stick! They're addressed to you, every damn one!  Wiley thrusts an envelope at Andy. Andy just stares at it.   I want all this cleared out before the warden gets back, I shit you not.  Hadley exits. Andy touches the boxes like a love-struck man touching a beautiful woman. Wiley grins.   who?   Last night's count.   Go on, boy! We got a hold of you!  Looking none too happy about it, Rory squeezes from the tunnel and dangles into the shaft. He gets lowered, shining his light, smothered by darkness. Not having a good time.",
        "Bogs": "You're some sweet punk. You been broke in yet?  Andy tries to step past them. He gets shoved around, nothing serious, just some slap and tickle. Jackals sizing up prey.   Hard to get. I like that.  Andy breaks free, flushed and shaking. He hurries off, leaving the three Sisters laughing.   Honey, hush.  Andy backs up, holding them at bay, trying to maneuver through the maze. The Sisters keep coming, tense and guarded, eyes riveted and gauging his every move, trying to outflank him. Andy trips on some old gaint sugglies. That's all it takes. They're on him in an instant, kicking and stomping.  Andy gets yanked to his feet. Bogs applies a chokehold from behind. They propel him across the room and slam him against an old four-pocket machine, bending him over it. Rooster jams a rag into Andy's mouth and secures it with a steel pipe, like a horse bit. Andy kicks and struggles, but Rooster and Pete have his arms firmly pinned. Bogs whispers in Andy's ear:   That's it, fight. Better that way.  Andy starts screaming, muffled by the rag. CAMERA PULLS BACK, SLOWLY WIDENING. The big Washex blocks our view. All we see is Andy's screaming face and the men holding him down...  ...and CAMERA DRIFTS FROM THE ROOM, leaving the dark place and the dingy act behind...MOVING up empty corridors, past concrete walls and steel pipes...     Take a walk.   I said fuck off.  Terrified, the old man darts past and out the door. Pete slams and locks it. Bogs shoves Andy to the center of the room.   Take a walk.   I said fuck off.  Terrified, the old man darts past and out the door. Pete slams and locks it. Bogs shoves Andy to the center of the room.   Ain't you gonna scream?  Andy sighs, cocks his head at the projector.   Now I'm gonna open my fly, and you're gonna swallow what I give you to swallow. And when you d mine, you gonna swallow Rooster's. You done broke his nose, so he ought to have somethin' to show for it.   You don't understand. You do that, I'll put all eight inches of this steel ii your ear.   You little fuck.  Andy gets a bootheel in the face. The Sisters start kicking and beating the living shit out of him with anything they can get their hands on. In the theater, the convicts are CHANTING AND CLAPPING for the movie to come back on.",
        "Diamond": "A BATTER in a \"Noresby Marauders\" baseball uniform WHACKS the ball high into left field and races for first.",
        "Tommy": "The bars slam with a STEEL CLANG. Tommy and his new CELLMATE take in their new surroundings.   Well. Ain't this for shit?    C'mon there, old boys! Movin' like molasses! Makin' me look bad!  The old guys just grin and shake their heads.   ...so I'm backin' out the door, right? Had the TV like this...  Big ol' thing. Couldn't see shit. Suddenly, here's this voice: Freeze kid! Hands in the air! Well I just stand there holdin' on to that TV, so the voice says: \"You hear what I said, boy?\" And I say, Yes sir, I sure did! But if I drop this fuckin' thing, you got me on destruction of property too!  The whole table falls about laughing.   Yeah. That was an easy ride, let me tell you. Work programs, weekend furloughs. Not like here.   What the hell you know about it, Capone? What are you in for?   I'm thinkin' maybe I should try for high school equivalency. Hear you helped some fellas with that.   Thing is, see...  ...I don't read all that good.   So this raven just sits there and won't go away?    Why don't that fella get hisself a 12-gauge and dust the fucker?   The cat sh--The cat shh...  The cat shat on the welcome mat?  Andy shakes his head. Not exactly.   Well. It's for shit.  Wasted a whole fuckin' year of my time with this bullshit!   It's worse! I didn't get a fuckin' thing right! Might as well be in Chinese!   I'll tell you how the goddamn score comes out...  Tommy grabs the test, wads it, slam-dunks it into the trash.   Two points! Right there! There's your goddamn score!  Goddamn cats crawlin' up trees, 5 times 5 is 25, fuck this place, fuck it!  Tommy is gone. Red and others stare. Andy gets up, pulls the test from the trash, smoothes it out on the desk.   I feel bad. I let him down.   Smart fella, ain't he?   What's he in for anyway?   The hell you say.    Oh my God...   'Bout four years ago, I was in Thomaston on a 2 to 3 stretch. Stole a car. Dumbfuck thing to do.  Few months left to go, I get a new cellmate in. Elmo Blatch. Big twitchy fucker. Crazy eyes. Kind of roomie you pray you don't get, know what I'm sayin'? 6 to 12 for armed burglary. Said he done hundreds of jobs. Hard to believe, high-strung as he was. Cut a loud fart, he'd go three feet in the air. Talked all the time, too, that's the other thing. Never shut up. Places he'd been, jobs he pulled, women he fucked. Even people he killed. People that gave him shit, that's how he put it. One night, like a joke, I say: \"Yeah? Who'd you kill?\" So he says...   It's my fault.   The son of a bitch mailed it.   Thumb up my butt sounds better.  He gets hemmed in by the older men. Red snatches the letter.   C'mon, just throw it away. Will you please? Just throw it away?  Red rips it open, scans the letter. Expressionless.   Out here?   Warden?  Norton steps into the light.   Yes sir, I sure can.   Yes sir. Absolutely.   Just gimme that chance.    gets chewed to pieces by the gunfire. He smacks the ground in a twitching, thrashing heap. Eyes wide and staring. Dead. Surprise still stamped on his face. Silence now. Norton turns, strolls into darkness.",
        "Brooks": "You gonna eat that?   You mind?  Andy passes the maggot to Brooks. Brooks examines it, rolling it between his fingertips like a man checking out a fine cigar. Andy is riveted with apprehension.   Mmm. Nice and ripe.  Andy can't bear to watch. Brooks opens up his sweater and feeds the maggot to a baby crow nestled in an inside pocket. Andy breathes a sigh of relief.   Jake says thanks. Fell out of his nest over by the plate shop. I'm lookin' after him till he's old enough to fly.  Andy nods, proceeds to eat. Carefully. Heywood approaches.   Middle shelf, wrapped in a towel.  Andy's hand snakes through the bars and makes the object disappear. The hand comes back and deposits a small slip of folded paper along with more cigarettes. Brooks turns his cart around and goes back. He pauses, sorting his books long enough for Red to snag the slip of paper. Brooks continues on, scooping the cigarettes off the cart and into his pocket.   Andy! Thought I heard you out here!   I know, they told me. Ain't that a kick in the ass? Come on in, I'll give you the dime tour.   Here she is, the Shawshank Prison Library. Along this side, we got the National Geographics. That side, the Reader's Digest Condensed books. Bottom shelf there, some Louis L'Amours and Erle Stanley Gardners. Every night I pile the cart and make my rounds. I write down the names on this clipboard here. Well, that's it. Easy, peasy, Japanesey. Any questions?  Andy pauses. Something about this doesn't make any sense.   Since 1912. Yuh, over 37 years.   Never needed one. Not much to it, is there?   I dunno. Be nice to have some comp'ny down here for a change.   Pull down one'a them desks there.  Andy and Dekins grab a desk standing on end and tilt it to the floor. They find chairs and settle in. Brooks returns with a tablet of paper and a pen, slides them before Andy.   God is my witness. And Dekins, he just blinks for a second, then laughs his ass off. Afterward, he actually shook Andy's hand.   Shook his fuckin' hand. Just about shit myself. All Andy needed was a suit and tie, a jiggly little hula girl on his desk, he would'a been Mister Dufresne, if you please.   Son, I've had six wardens through here during my tenure, and I have learned one great immutable truth of the universe: ain't one of 'em been born whose asshole don't pucker up tight as a snare drum when you ask for funds.   Goddamn miserable puke-eatin' sons of whores!  He kicks a table over. Tax files explode through the air.   Nothing left to talk about! It's all talked out! Nothing left now but to cut his fuckin' throat!   That's what they want! It's the price I gotta pay!  Andy steps forward, rivets Brooks with a gaze. Softly:   But it's the only way they'll let me stay.  Brooks bursts into tears. The storm is over. Heywood staggers free, gasping for air. Andy takes the knife, passes it to Red. Brooks dissolves into Andy's arms with great heaving sobs.   I can't take care of you no more. You go on now. You're free.  He tosses Jake through the bars. The crow flaps away.   Dear Fellas. I can't believe how fast things move on the outside.   I saw an automobile once when I was young. Now they're everywhere.   The world went and got itself in a big damn hurry.  He arrives at the Brewster. It ain't much to look at.     People even talk faster. And louder.    Brooks enters. The room is small, old, dingy. Heavy wooden beams cross the ceiling. An arched window affords a view of Congress Street. Traffic noise drifts in. Brooks sets his bag down. He doesn't quite know what to do. He just stands there, like a man waiting for a bus.   The parole board got me into this halfway house called the Brewster, and a job bagging groceries at the Foodway...   Yes sir, double-bag, surely will.   It's hard work. I try to keep up, but my hands hurt most of the time. I don't think the store manager likes me very much.   Sometimes after work I go to the park and feed the birds. I keep thinking Jake might show up and say hello, but he never does. I hope wherever he is, he's doing okay and making new friends.    Dark. Traffic outside. Brooks wakes up. Disoriented. Afraid. Somewhere in the night, a LOUD ARGUMENT is taking place.   I have trouble sleeping at night. The bed is too big. I have bad dreams, like I'm falling. I wake up scared. Sometimes it takes me a while to remember where I am.   Maybe I should get me a gun and rob the Foodway, so they'd send me home. I could shoot the manager while I was at it, sort of like a bonus.    Brooks is packing his worldly possessions into the carry bag. Undershirts, socks, etc.   But I guess I'm too old for that sort of nonsense anymore.    Brooks is dressed in his suit. He finishes knotting his tie, puts his hat on his head. The letter lies on the desk, stampe3 and ready for mailing. His bag is by the door.   I don't like it here. I'm tired of being afraid all the time. I've decided not to stay.  He takes one last look around. Only one thing left to do. He steps to a wooden chair in the center of the room, pulls out s pocketknife, and glances up at the ceiling beam.  He steps up onto the chair. It wobbles queasily. Now facing the beam, he carves a message into the wood: \"Brooks Hatlen was here.\" He smiles with a sort of inner peace.   I doubt they'll kick up any fuss. Not for an old crook like me.",
        "Hatlen": "",
        "Andy": "is on the witness stand, hands folded, suit and tie pressed, hair meticulously combed. He speaks in soft, measured tones:   It was very bitter. She said she was glad I knew, that she hated all the sneaking around. She said she wanted a divorce in Reno.   I told her I would not grant one.   If they say so. I really don't remember. I was upset.   She packed a bag and went to stay with Mr. Quentin.   I went to a few bars first. Later, I decided to drive to Mr. Quentin's home and confront them. They weren't there...so I parked my car in the turnout...and waited.   I'm not sure. I was confused. Drunk. I think mostly I wanted to scare them.   Yes. I did.   No. I was sobering up. I realized she wasn't worth it. I decided to let her have her quickie divorce.   I did not. I got back in the car and drove home to sleep it off. Along the way, I stopped and threw my gun into the Royal River. I feel I've been very clear on this point.    Yes. It does.   Yes. It does.   Strike me as a fantastic coincidence.   It's the truth.    Since I am innocent of this crime, sir, I find it decidedly inconvenient the gun was never found.    The bars slam home. Andy is alone in his cell, clutching his clothes. He gazes around at his new surroundings, taking it in. He slowly begins to dress himself...   Hadn't planned on it.   What was his name?   I was wondering if anyone knew his name.    Andy lies staring at the darkness, unable to sleep.    Hello. I'm Andy Dufresne.  Red glances at the hand, ignores it. The game continues.   How do you know that?   I didn't, since you ask.   What else have you heard?   What do you think?   I understand you're a man who knows how to get things.   I wonder if you could get me a rock-hammer?   You make your customers' motives a part of your business?    Fair enough. A rock-hammer is about eight or nine inches long. Looks like a miniature pickaxe, with a small sharp pick on one end, and a blunt hammerhead on the other. It's for rocks.   Quartz, sure. And look. Mica. Shale. Silted granite. There's some graded limestone, from when they cut this place out of the hill.   I'm a rockhound. At least I was, in my old life. I'd like to be again, on a limited scale.   I have no enemies here.   Tell me something. Would it help if I explained to them I'm not homosexual?   Thanks for the advice.   If there's trouble, I doubt a rock- hammer will do me any good.    You'll know when you see the rock- hammer.   Seven dollars in any rock and gem shop.   Ten it is.   Oh?   I understand. Thank you, Mr...?   Red. I'm Andy. Pleasure doing business with you.  They shake. Andy strolls off. Red watches him go.   You get this in your eyes, it blinds you.   shaping his rocks after lights-out...       wildly swinging a rake at his tormentors.   Mr. Hadley. Do you trust your wife?   What I mean is, do you think she'd go behind your back? Try to hamstring you?   Because if you do trust her, there's no reason in the world you can't keep every cent of that money.  Hadley abruptly jerks Andy to a stop right at the edge. In fact, Andy's past the edge, beyond his balance, shoetips scraping the roof. The only thing between him and an ugly drop to the concrete is Hadley's grip on the front of his shirt.   If you want to keep that money, all of it, just give it to your wife. See, the IRS allows you a one-time- only gift to your spouse. It's good up to sixty thousand dollars.   Tax free. IRS can't touch one cent.  The cons are pausing work, stunned by this business discussion.   It's perfectly legal. Go ask the IRS, they'll say the same thing. Actually, I feel silly telling you all this. I'm sure you would have investigated the matter yourself.   Of course not. But you will need somebody to set up the tax-free gift, and that'll cost you. A lawyer, for example...   ...or come to think of it, I suppose I could set it up for you. That would save you some money. I'll write down the forms you need, you can pick them up, and I'll prepare them for your signature... nearly free of charge.  I'd only ask three beers apiece for my co-workers, if that seems fair.   I think a nan working outdoors feels more like a man if he can have a bottle of suds. That's only my opinion.  The convicts stand gaping, all pretense of work gone. They look like they've been pole-axed. Hadley shoots them a look.   No thanks. I gave up drinking.  Heywood drifts back to others, giving them a look.   Chess. Now there's a game of kings. Civilized...strategic...   Maybe you'll let me teach you someday. I've been thinking of getting a board together.   We might do business on a board. But the pieces, I'd like to carve those myself. One side done in quartz... the opposing side in limestone.   Years I've got. What I don't have are the rocks. Pickings here in the exercise yard are pretty slim.    Not yet. I suppose I should.   I suppose we are.   I'm innocent, remember? Just like everybody else here.  Red takes this as a gentle rebuff, keeps playing.   What are you in for, Red?   Innocent?    Andy lies in his bunk after lights out, polishing a fragment of quartz by the light of the moon. He pauses, glancing at all the names scratched in the wall. He rises, makes sure the coast is clear, and starts scratching his name into the cement with his rock-hammer, adding to the record.   I know. I've seen it three times this month already.  Ray Milland starts SCREAMING. The entire audience SCREAMS with him, high-pitched and hysterical. Andy fidgets.   Can we talk business?   Rita Hayworth. Can you get her?   Weeks?   I know. I've seen it three times this month already.  Ray Milland starts SCREAMING. The entire audience SCREAMS witt him, high-pitched and hysterical. Andy fidgets.   Can we talk business?   Rita Hayworth. Can you get her?   Weeks?   They'd never hear me over that. Let's get this over with.  Seemingly resigned, Andy turns around, leans on the rewind bench -- and curls his fingers around a full 1.000 foot reel of 35mm film. Rooster licks his lips, pushes past the others.   Okay.  Andy whips the reel of film around in a vicious arc, smashing it into Rooster's face and bouncing him off the wall.   Anything you put in my mouth, you're going to lose.   Okay. But you should know that sudden serious brain injury causes the victim to bite down. Hard.  In fact, I understand the bite-reflex is so strong the victim's jaws have to be pried open with a crowbar.  The Sisters consider this carefully. The film runs out of the projector, flapping on the reel. The screen goes white.    Andy finds the cardboard tube lying on his bunk.   Good evening.  Norton gives a curt nod. Hadley and Trout start tossing the cell in a thorough search. Norton keeps his eyes on Andy, looking for a wrong glance or nervous blink. He takes the Bible out of Andy's hand.   Watch ye therefore, for ye know not when the master of the house cometh.   John. Chapter 8, verse 12.   It's called a rock blanket. It's for shaping and polishing rocks. Little hobby of mine.  Hadley glances at the rocks lining the window sill, turns to Norton.   It's very pretty, sir.   No, sir. Not especially.   Hey, Jake. Where's Brooks?  Brooks Hatlen pokes his head out of the back room.   I've been reassigned to you.   Brooks? How long have you been librarian?   In all that time, have you ever had an assistant?   So why now? Why me?   another GUARD, a huge fellow named DEKINS.   I see. Well. Why don't we have a seat and talk it over?   What did you have in mind? A weekly draw on your pay?   He was right. You don't want your money in a bank.   What's that gonna earn you? Two and a half, three percent a year? We can do a lot better than that.  So tell me, Mr. Dekins. Where do you want to send your kids? Harvard? Yale?   I wouldn't say \"friends.\" I'm a convicted murderer who provides sound financial planning. That's a wonderful pet to have.   Maybe it can do more than that.  How about expanding the library? Get some new books in there.   Ask the warden for funds.  LAUGHTER all around. Andy blinks at them.   I see. Perhaps I could write to the State Senate and request funds directly from them.   Still, I'd like to try, with your permission. I'll send a letter a week. They can't ignore me forever.    Andy is on his bunk, writing a letter.    Andy is doing taxes. Mert Entwhistle is seated across from him. Other off-duty guards are waiting their turn.    The Batter sits across from Andy. The line winds out the door.   Moresby Prison issued you that gun, but you actually had to pay for it?   See, that's all deductible. You get to write that off.   Say Red, could you hand me a stack of those 1040s?    Dark. Andy's in his bunk, polishing a four-inch length of quartz. It's a beautifully-crafted chess piece in the shape of a horse's head, poise and nobility captured in gleaming stone.  He puts the knight on a chess board by his bed, adding it to four pieces already there: a king, a queen, and two bishops. He turns to Rita. Moonlight casts bars across her face.    Floyd rushes in with Andy and Red at his heels. They find Jigger and Snooze trying to calm Brooks, who has Heywood in a chokehold and a knife to his throat. Heywood is terrified.   Brooks, you're not going to hurt Heywood, we all know that. Even Heywood knows it, right Heywood?   Why? Ask anyone, they'll tell you. Brooks Hatlen is a reasonable man.   You're not fooling anybody, so just put the damn knife down and stop scaring the shit out of people.   Take it easy. You'll be all right.   I just don't understand what happened in there, that's all.    ANGLE ON RITA POSTER. Sexy as ever. The rising sun sends fingers of rosy light creeping across her face.   P.S. Tell Heywood I'm sorry I put a knife to his throat. No hard feelings.  A long silence. Andy folds the letter, puts it away. Softly:   Red!  Red steps in with an armload of files. Andy gingerly reaches in, grabs a black feathered wing, and pulls out a dead crow.   That's real pretty, Red. Nice work.   What is all this?   Dear Mr. Dufresne. In response to your repeated inquiries, the State Senate has allocated the enclosed funds for your library project... \"  This is two hundred dollars.  Wiley grins. Hadley glares at him. The grin vanishes.   In addition, the Library District has generously responded with a charitable donation of used books and sundries. We trust this will fill your needs. We now consider the matter closed. Please stop sending us letters. Yours truly, the State Comptroller's Office.  Andy gazes around at the boxes. The riches of the world lay at his feet. His eyes mist with emotion at the sight.   Only took six years.  From now on, I send two letters a week instead of one.   They broke the door down before I could take requests.   Easiest time I ever did.   I had Mr. Mozart to keep me company. Hardly felt the time at all.    The music was here...and here. That's the one thing they can't confiscate, not ever. That's the beauty of it. Haven't you ever felt that way about music, Red?   Here's where it makes most sense. We need it so we don't forget.   That there are things in this world not carved out of gray stone. That there's a small place inside of us they can never lock away, and that place is called hope.    Like Brooks did?   You wonder where it went. I wonder where ten years went.  Red nods, solemn. They settle in on the bleachers. Andy pulls a small box from his sweater, hands it to Red.   Anniversary gift. Open it.  Red does. Inside the box, on a thin layer of cotton, is a shiny new harmonica, bright aluminum and circus-red.   Had to go through one of your competitors. Hope you don't mind. Wanted it to be a surprise.   You gonna play something?  --  Red considers it, shakes his head. Softly:    Men line the tiers as the evening count is completed. The convicts step into their cells. The master switch is thrown and all the doors slam shut -- KA-THUMP! Andy finds a cardboard tube on his bunk. The note reads: \"A new girl for your 10 year anniversary. From your pal. Red.\"    Marilyn Monroe's face fills the screen. SLOW PULL BACK reveals the new poster: the famous shot from \"The Seven Year Itch,\" on the subway grate with skirt billowing up. Andy sits gazing at her as lights-out commences...    ...Stevenson. Next?   Trade skills and hobbies, those go under educational. Stack right behind you.   Dumas. You boys'll like that one. It's about a prison break.  Floyd tries to take the book. Heywood yanks it back. I saw it first. Red shoots Andy a look.   Two deposits, Casco Bank and New England First. Night drop, like always.  Norton pockets the envelopes. Andy crosses to the wall safe and shoves the ledger and sundry files inside. Norton locks the safe, swings his wife's framed sampler back into place. He cocks his thumb at some laundry and two suits in the corner.   Very nice.   What you hear isn't half of it. He's got scams you haven't dreamed of. Kickbacks on his kickbacks. There's a river of dirty money flowing through this place.   That's where I come in. I channel it, funnel it, filter it...stocks, securities, tax free municipals... I send that money out into the big world. And when it comes back...   Cleaner. By the time Norton retires, I will have made him a millionaire.    I thought you had more faith in me than that.   Sure it will. But not to me, and certainly not to the warden.   Peter Stevens.   The silent, silent partner. He's the guilty one, your Honor. The man with the bank accounts. That's where the filtering process starts. They trace it back, all they're gonna find is him.   A phantom. An apparition. Second cousin to Harvey the Rabbit.  I conjured him out of thin air. He doesn't exist...except on paper.   Sure you can, if you know how the system works, and where the cracks are. It's amazing what you can accomplish by mail. Mr. Stevens has a birth certificate, social security card, driver's license. They ever track those accounts, they'll wind up chasing a figment of my imagination.   It's funny. On the outside, I was an honest man. Straight as an arrow. I had to come to prison to be a crook.   I don't run the scams, Red, I just process the profits. That's a fine line, maybe. But I've also built that library, and used it to help a dozen guys get their high school diplomas. Why do you think the warden lets me do all that?   I work cheap. That's the trade-off.  TWO SIREN BLASTS draw their attention to the main gate. It swings open, revealing a prison bus waiting outside.   Perhaps it's time you considered a new profession.  What I mean is, you don't seem to be a very good thief. Maybe you should try something else.    Everyone's innocent in here. Don't you know that?  The tension breaks. Everyone laughs.   I don't waste time on losers, Tommy.   That's a good start. If we do this, we do it all the way. One hundred percent. Nothing half-assed.  Tommy thinks about it, nods.    Well. You've come to the right place then.   ...and the lamplight o'er him streaming throws his shadow on the floor...and my soul from out that shadow that lies floating on the floor, shall be lifted nevermore! \"  Andy slaps the book shut, immensely pleased with himself.   That's right.    TIGHT ANGLE on chessboard. Most of the pieces complete. PAN TO Andy lying in his bunk, carefully polishing...   Well?   May not be as bad as you think.   We'll see how the score comes out.   Sir?   I think he's telling the truth.   It wouldn't matter. With Tommy's testimony, I can get a new trial.   They'd have his last known address. Names of relatives...  Well it's a chance. isn't it? How can you be so obtuse?   Obtuse! Is it deliberate? The country club will have his old time cards! W-2s with his name on them!   Look, if it's the squeeze, don't worry. I'd never say what goes on in here. I'd be just as indictable as you for laundering the money!   I was just trying to rest your mind at ease, that's all.   What's the matter with you? It's my chance to get out, don't you see that? It's my life! Don't you understand it's my life?   I'm done. It stops right now. Get H&amp;R Block to declare your income.  Norton lunges to his feet, eyes sparkling with rage.   My wife used to say I'm a hard man to know. Like a closed book. Complained about it all the time.  She was beautiful. I loved her. But I guess I couldn't show it enough.  I killed her, Red.  Andy finally glances to Red, seeking a reaction. Silence.   I didn't pull the trigger. But I drove her away. That's why she died. Because of me, the way I am.   No. I didn't. Someone else did, and I wound up here. Bad luck, I guess.   It floats around. Has to land on somebody. Say a storm comes through. Some folks sit in their living rooms and enjoy the rain. The house next door gets torn out of the ground and smashed flat. It was my turn, that's all. I was in the path of the tornado.  I just had no idea the storm would go on as long as it has.  Think you'll ever get out of here?   Tell you where I'd go. Zihuatanejo.   Mexico. Little place right on the Pacific. You know what the Mexicans say about the Pacific? They say it has no memory. That's where I'd like to finish out my life, Red. A warm place with no memory. Open a little hotel right on the beach. Buy some worthless old boat and fix it up like new. Take my guests out charter fishing.  You know, a place like that, I'd need a man who can get things.  Red stares at Andy, laughs.   You underestimate yourself.  -   Not me. I didn't shoot my wife and I didn't shoot her lover, and whatever mistakes I made I've paid for and then some. That hotel and that boat...I don't think it's too much to want. To look at the stars just after sunset. Touch the sand. Wade in the water. Feel free.   You're right. It's down there, and I'm in here. I guess it comes down to a simple choice, really. Get busy living or get busy dying.  Red snaps a look. What the hell does that mean? Andy rises and walks away. Red lunges to his feet.    Red, if you ever get out of here, do me a favor. There's this big hayfield up near Buxton. You know where Buxton is?   One in particular. Got a long rock wall with a big oak at the north end. Like something out of a Robert Frost poem. It's where I asked my      wife to marry me. We'd gone for a picnic. We made love under that tree. I asked and she said yes.  Promise me, Red. If you ever get out, find that spot. In the base of that wall you'll find a rock that has no earthly business in a Maine hayfield. A piece of black volcanic glass. You'll find something buried under it I want you to have.   You'll just have to pry up that rock and see.  Andy turns and walks away.   Just about done, sir.  We follow Norton to his wife's sampler. He swings it aside, works the combination dial, opens the wall safe. Andy moves up, shoves in the black ledger and files. Norton shuts the safe.   Three deposits tonight.  Andy hands him the envelopes. Norton heads for the door.    Andy is polishing a chess piece.    Norton steps to the center of the room, working himself up into a fine rage:    RORY TREMONT, a guard barely out of his teens, tries not to look nervous as they lash a rope around his chest. He's getting instructions from six different people at once.    Red and others listen to violent barfing from below.    Once again, we see Andy using the rock-hammer to scratch his  name into the cement. Suddenly, a palm-sized chunk of cement pops free and hits the floor. He stares down at it.    Andy lies in the dark, studying the chunk of concrete in his hands. Considering the possibilities. Wrestling with hope.    Andy stands peering at the small hole left by the fallen chunk. Carefully runs his fingertip over it.    Rita is now on the wall, hanging down over Andy's back.   Just about done, sir.  Norton crosses to the wall safe and works the dial, his back turned. This time, though, we stay on Andy:  He pulls up his sweater, yanks out a large black book and a stack of files, lays them on the desk. He then grabs the real ledger and files, jams them down his pants and smoothes his sweater down. He picks up the bogus stack, crosses to Norton, and shoves everything in.    The lights go out. Andy places the last chess piece. Gazes up at Racquel. Smiles. Pulls the rope from under his pillow. He stands and unbuttons his prison shirt, revealing Norton's gray pinstripe suit underneath. A FLASH OF LIGHTNING floods the cell, throwing wild shadows.    The storm rages. Andy, naked, carefully slips Norton's folded suit into a large industrial Zip-Lock bag. Next to go in are the shoes, chess pieces , black ledger en files. Last but not least, a bar of soap wrapped in a towel.    Once again, we see stunned faces as CAMERA PULLS BACK.   My name is Peter Stevens. I've come to close out some accounts.   Thank you. I'm sure I will.   Please. Would you add this to your outgoing mail?  He hands her a package, stamped and addressed. Gives them a pleasant smile. Turns and strolls from the bank.   Dear Red. If you're reading this, you've gotten out. And if you've come this far, maybe you're willing to come a little further. You remember the name of the town, don't you? I could use a good man to help me get my project on wheels. I'll keep an eye out for you and the chessboard ready.  Remember, Red. Hope is a good thing, maybe the best of things, and no good thing ever dies. I will be hoping that this letter finds you, and finds you well. Your friend. Andy.  By now, tears are spilling silently down Red's cheeks. He opens the other envelope and fans out a stack of new fifty- dollar bills. Twenty of them. A thousand dollars.   You look like a man who knows how to get things.",
        "Dufresne": "is on the witness stand, hands folded, suit and tie pressed, hair meticulously combed. He speaks in soft, measured tones:",
        "Skeet": "What say, Red?   We ought to keep an eye on him.   Christ. What do we do?",
        "Floyd": "Takin' bets today, Red?   Smokes. Put me down for two.   That gangly sack of shit, third from the front. He'll be the first.   You're so smart, you call it.   Smell my ass...   Gettin' himself killed.   That ain't quartz. Nor limestone.   He didn't say that!   Red? Andy? It's Brooks.   Red, I do believe you're talking out of your ass.   Was it worth two weeks in the hole?   Cristo, you dumbshit.   A month in the hole. Longest damn stretch I ever heard of.   Christ! Remember Brooks Hatlen?   Where the hell is he?   Nothing we can do. Not tonight.",
        "Warden": "Andy is led in. Norton is at his desk doing paperwork. Andy's eyes go to a framed needle-point sampler on the wall behind him that reads: \"HIS JUDGMENT COMETH AND THAT RIGHT SOON.\"    Dozens of parcel boxes litter the floor. WILEY, the duty guard, picks through them. Hadley enters, trailed by Andy.",
        "Norton": "This is Mr. Hadley, captain of the guard. I am Mr. Norton, the warden. You are sinners and scum, that's why they sent you to me. Rule number one: no blaspheming. I'll not have the Lord's name taken in vain in my prison. The other rules you'll figure out as you go along. Any questions?   Any other questions?  I believe in two things. Discipline and the Bible. Here, you'll receive both.  Put your faith in the Lord. Your ass belongs to me. Welcome to Shawshank.   ...the roof of the license-plate factory needs resurfacing. I need a dozen volunteers for a week's work. We're gonna be taking names in this steel bucket here...  Red glances around at his friends. Andy also catches his eye.   Solitary. A week. Make sure he takes his Bible.   Add another week for blasphemy.  The man is taken away. Norton's gaze goes up.   Let's try the second tier.   I'm pleased to see you reading this. Any favorite passages?     Luke. Chapter 13, verse 35. I've always liked that one.  But I prefer: \"I am the light of the world. He that followeth me shall not walk in darkness, but shall have the light of life.\"   I hear you're good with numbers. How nice. A man should have a skill.   I can't say I approve of this...  ...but I suppose exceptions can always be made.  Norton exits, the guards follow. The cell door is slammed and locked. Norton pauses, turns back.   I almost forgot.  He reaches through the bars and returns the Bible to Andy.   I'd hate to deprive you of this. Salvation lies within.  Norton and his men walk away.    Andy is led in. Norton is at his desk doing paperwork. Andy's eyes go to a framed needle-point sampler on the wall behind him that reads: \"HIS JUDGMENT COMETH AND THAT RIGHT SOON.\"   My wife made that in church group.   You like working in the laundry?   Perhaps we can find something more befitting a man of your education.   Not a dime. My budget's stretched thin as it is.   Far as them Republican boys in Augusta are concerned, there's only three ways to spend the taxpayer's hard-earned when it come to prisons. More walls. More bars. More guards.   They sure can, but you write your letters if it makes you happy. I'll even mail 'em for you, how's that?    Andy pops his head in. The GUARD shakes his head.    Andy enters and drops a letter on the outgoing stack.   ...a genuine, progressive advance in corrections and rehabilitation. Our inmates, properly supervised, will be put to work outside these walls performing all manner of public service. Cutting pulpwood, repairing bridges and causeways, digging storm drains...  ANGLE TO Red and the boys listening from behind the fence.   These men can learn the value of an honest day's labor while providing a valuable service to the community -- and at a bare minimum of expense to Mr. and Mrs. John Q. Taxpayer!   Ned, we're providing a valuable community service.   Ned, I wouldn't worry too much over this contract. Seems to me I've already got my boys committed elsewhere. You be sure and thank Maisie for this fine pie.    ANGLE on Maisie's pie. Several pieces gone.   Get my stuff down t'laundry. Two suits for dry-clean and a bag of whatnot. Tell 'em if they over- starch my shirts again, they're gonna hear about it from me.  How do I look?   Big charity to-do up Portland way. Governor's gonna be there.  Want the rest of that? Woman can't bake worth shit.     Well. I have to say, that's the most amazing story I ever heard. What amazes me most is you were taken in by it.   It's obvious this fellow Williams is impressed with you. He hears your tale of woe and quite naturally wants to cheer you up. He's young, not terribly bright. Not surprising he didn't know what a state he'd put you in.   Let's say for a moment Blatch does exist. You think he'd just fall to his knees and cry, \"Yes, I did it! I confess! By all means, please add a life term to my sentence!\"   That's assuming Blatch is even still there. Chances are excellent he'd be released by now. Excellent.   What? What did you call me?    Dufresne, if you want to indulge this fantasy, that's your business. Don't make it mine. This meeting's over.   Don't you ever mention money to me again, you sorry son of a bitch! Not in this office, not anywhere!  Get in here! Now!    Solitary! A month!  Andy gets dragged away, kicking and screaming:   Tommy, we've got a situation here. I think you can appreciate that.   I tell you, son, this really came along and knocked my wind out. It's got me up nights, that's the truth.  Norton pulls a pack of cigarettes, offers Tommy a smoke. Tommy takes one. Norton lights both cigarettes, pockets his lighter.   The right decision. Sometimes it's hard to figure out what that is. You understand?  Think hard, Tommy. If I'm gonna move on this, there can't be the least little shred of doubt. I have to know if you what you told Dufresne was the truth.   Would you be willing to swear before a judge and jury...having placed your hand on the Good Book and taken an oath before Almighty God Himself?   That's what I thought.  Norton drops his cigarette. Crushes it out with the toe of his shoe. Glances up toward the plate shop roof as --    Andy is led in. The door is closed. Alone with Norton. Softly,   Terrible thing. Man that young, less than a year to go, trying to escape. Broke Captain Hadley's heart to shoot him, truly it did.   Nothing stops! NOTHING!  Or you will do the hardest time there is. No more protection from the guards. I'll pull you out of that one-bunk Hilton and put you in   -  with the biggest bull queer I can find. You'll think you got fucked by a train! And the library? Gone! Sealed off brick by brick! We'll have us a little book-barbecue in the yard! They'll see the flames for miles! We'll dance around it like wild Indians! Do you understand me? Are you catching my drift?  SLOW PUSH IN on Andy's face. Eyes hollow. His beaten expression says it all...    Andy's working away. Norton pokes his head in.   Lickety-split. I wanna get home.   Get my stuff down t'laundry. And shine my shoes. I want 'em lookin' like mirrors.  Nice havin' you back, Andy. Place just wasn't the same without you.  Norton exits. Andy turns to the laundry. He opens the shoebox. Nice pair of dress shoes inside. He sighs, glances down at the old ragged pair of work shoes on his own feet.    Andy is diligently shining Norton's shoes.    Norton is kicking back with the morning paper. He notices ha dingy his shoes are. He glances at the shoebox on the desk. kicks his shoes off, opens the box -- and gulls out Andy's o grimy work shoes. He stares blankly. What the fuck indeed.  An ALARM STARTS BLARING throughout the prison. He looks up.   I want every man on that cellblock questioned! Start with that friend of his!   Him.  Red's eyes widen. Guards yank him from his cell.   What do you mean \"he just wasn't here?\" Don't say that to me, Haig! Don't say that to me again!   I can see that, Haig! You think I'm blind? Is that what you're saying? Am I blind, Haig?   What about you? You blind? Tell me what this is!   You see Dufresne's name? I sure do! Right there, see? \"Dufresne.\" He was in his cell at lights out! Stands to reason he'd still be here this morning! I want him found! Not tomorrow, not after breakfast! Now!  Haig scurries out, gathering men. Norton spins to Red.   Well?   I see you two all the time, you're thick as thieves, you are! He must'a said something!   Lord! It's a miracle! Man up and vanished like a fart in the wind! Nothin' left but some damn rocks on the windowsill and that cupcake on the wall! Let's ask her! Maybe she knows! What say there, Fuzzy- Britches? Feel like talking? Guess not. Why should you be different?  Red exchanges looks with the guards. Even they're nervous. Norton scoops a handful rocks off the sill. He hurls them at the wall one at a time, shattering them, punctuating his words:   It's a conspiracy!  That's what this is!  It's one big damn conspiracy!  And everyone's in on it! Including her!  He sends the last rock whizzing right at Racquel. No smash.  It takes a moment for this to sink in. All eyes go to her. The rock went through her. There's a small hole in the poster where her navel used to be.  You could hear a pin drop. Norton reaches up, sinks his finger into the hole. He keeps pushing...and his entire hand disappears into the wall.   I don't care what it smells like!   Never mind, I said! Just keep going!   Lickety-split. I wanna get home.    Andy sorts through Norton's three suits. He pauses, checking the gray pinstripe. Nice.    Norton opens his safe and pulls out the \"ledger\" -- it's Andy's Bible. The title page is inscribed by hand: \"Dear Warden. You were right. Salvation lay within.\" Norton flips to the center of the book -- and finds the pages hollowed out in the shape of a rock-hammer.    Norton is staring out the window as they approach the building. He goes to his desk, opens a drawer. Inside lies a revolver and a box of shells.    Norton sits blankly at his desk, revolver before him. The doorknob rattles, a VOICE is heard:    ...so do the bullets. Norton is riveted to the door. For every key, he loads another bullet. Methodical and grim. He gets the final bullet in just as the right key slams home. The door bursts open. Men muscle in. Somebody SHOUTS. Troopers dive in all directions as Norton raises the gun --  -- and jams it under his chin. his head snaps back as the wall goes red. His swivel chair does a slow half-turn and creaks to a final stop. Troopers rise slowly, gazing in horror.",
        "Ernie": "Me too.  Other hands go up. Red jots the names.   Heads up. They're tossin' cells.  Word travels fast from cell to cell. Cons scramble to tidy up and hide things. Norton enters, nods to his men. The guards pair off in all directions, making their choices at random.    Say that when you been inside as long as Brooks has.",
        "Jigger": "Comin' from you, Heywood, you being so pretty and all...   Oh, Christ, here he comes.   C'mon, Brooksie, why don't you just calm the fuck down, okay?   Shit. I could never get that way.   That's fine, during the day. But at night he's got that cell all to himself.   Andy'd never do that. Never.  They all look to Red.",
        "Guard": "All clear!  GUARDS approach the bus with carbines. The door jerks open. The new fish disembark, chained together single-file, blinking sourly at their surroundings. Andy stumbles against the MAN in front of him, almost drags him down.  BYRON HADLEY, captain of the guard, slams his baton into Andy's back. Andy goes to his knees, gasping in pain. JEERS and SHOUTS from the spectators.   That's lights out! Good night, ladies.  The lights bump off in sequence. The guard exits, footsteps echoing away. Darkness now. Silence. CAMERA CRANES UP the tiers toward Red's cell.   Time's up, Bogs.   Lights out!  The lights go off. Andy opens the tube and pulls out a large rolled poster. He lets it uncurl to the floor. A small scrap of paper flutters out, landing at his feet. The poster is the famous Rita Hayworth pin-up -- one hand behind her head, eyes half closed, sulky lips parted. Andy picks up the scrap of paper. It reads: \"No charge. Welcome back.\" Alone in the dark, Andy smiles.   What kind'a contraband you hiding in there, boy?  Cells are opened, occupants displaced, items scattered, mattresses overturned. Whatever contraband is found gets tossed out onto the cellblock floor. Mostly harmless stuff.  A GUARD pulls a sharpened screwdriver out of a mattress, shoots a nasty look at the CON responsible.    Andy pops his head in. The GUARD shakes his head.    Andy enters and drops a letter on the outgoing stack.   Water break! Five minutes!  The work stops. Cons head for the pickup truck, where water is dispensed with dipper and pail. Red and the boys look to Andy. Andy nods. Now's the time. The group moves off through the confusion, using it as cover. They head up the slope of a nearby hill and quickly decide on a suitable spot. The guards haven't noticed.  Jigger and Floyd start swinging picks into the soft earth, quickly ripping out a hole. Red reaches into his jacket and pulls out a beautiful wooden box, carefully stained and varnished. He shows it around to nods of approval.    Dozens of parcel boxes litter the floor. WILEY, the duty guard, picks through them. Hadley enters, trailed by Andy.    Andy wrestles the phonograph player onto the guards' desk, sweeping things onto the floor in his haste. He plugs the machine in. A red light warms up. The platter starts spinning.  He slides the Mozart album from its sleeve, lays it on the platter, and lowers the tone arm to his favorite cut. The needle HISSES in the groove...and the MUSIC begins, lilting and gorgeous. Andy sinks into Wiley's chair, overcome by its beauty. It is \"Deutino: Che soave zeffiretto,\" a duet sung by  Susanna and the Contessa.    Andy shoots a look at the bathroom...and smiles. Go for broke. He lunges to his feet and barricades the front door, then the bathroom. He returns to the desk and positions the P.A. microphone. He works up his courage, then flicks all the toggles to \"on.\" A SQUEAL OF FEEDBACK echoes briefly...    Andy is reclined in the chair, transported, arms fluidly conducting the music. Ecstasy and rapture. Shawshank no longer exists. It has been banished from the mind of men.    Norton and Hadley break the door in. Andy looks up with a sublime smile. We hear Wiley POUNDING on the bathroom door:   Kid passed. C-plus average. Thought you'd like to know.  The slot closes. The FOOTSTEPS recede. Andy smiles.     Open number twelve!  Andy gazes directly at Red. A beat of eye contact. Red shakes his head. Don't do it. Andy smiles, eerily calm...and enters his cell. The door closes. KA-THUMP! We hold on Red's face.   Man missing on tier two! Cell 12!  The head bull, HAIG, checks his list:   I'm not sure which one it is...  He starts trying keys in the lock. And as the keys go sliding in one after another...",
        "Mert": "And drive it, if they're old enough.   Damn, Byron. Look'a that.   Warden wants to talk.   That's what the man said.  Mert swings the gate open, sends Tommy through, turns and heads back inside. Tommy proceeds out across a loading-dock access for the shops and mills. Some vehicles parked. The place is deserted. He stops, sensing a presence.",
        "Heywood": "Never seen such a sorry-lookin' heap of maggot shit in my life.   Bullshit. I'll take that action.   You're out some smokes, son. Take my word.   I say that chubby fat-ass...let's see...fifth from the front. Put me down for a quarter deck.   Fat-Ass...oh, Faaaat-Ass. Talk to me, boy. I know you're in there. I can hear you breathin'. Now don't you listen to these nitwits, hear?   This ain't such a bad place. I'll introduce you around, make you feel right at home. I know some big ol' bull queers who'd love to make your acquaintance...especially that big white mushy butt of yours...  And that's it. Fat-Ass lets out a LOUD WAIL of despair:      Mornin', boys. It's a fine mornin'. You know why it's fine?  Heywood plops his tray down, sits. The men start pulling out cigarettes and handing them down.   That's right, send 'em all down. I wanna see 'em lined up in a row, pretty as a chorus line.  An impressive pile forms. Heywood bends down and inhales deeply, smelling the aroma. Rapture.   Gee, Red. Terrible shame, your horse comin' in last and all. Hell, I sure do love that horse of mine. I believe I owe that boy a big sloppy kiss when I see him.   Say Tyrell, you pull infirmary duty this week? How's that winnin' horse of mine, anyway?   What? What'd you say?   What the fuck you care, new fish?  Doesn't matter what his fuckin' name was. He's dead.   Didn't do it! Lawyer fucked me!  Red gives Andy a look. See?   Poor Byron. What terrible fuckin' luck. Imagine inheriting thirty five thousand dollars.   Just keep spreadin' tar...  The guards stiffen at Andy's approach. Youngblood's hand goes to his holster. The tower guards CLICK-CLACK their rifle bolts. Hadley turns, stupefied to find Andy there.   Oh God, he's gonna do it, he's gonna throw him off the roof...    Here's a cold one, Andy.   Sounds good to us. Figure we owe him for the beer.   What are you, fuckin' geologist?   What the hell is it then?   Bullshit.   My ass!   How you 'spect to do that, \"Mr. Dufresne-if-you-please?\"    Sure. I know that. Sure.   Him? What about me? Crazy old fool! Goddamn near slit my throat!   Nothin'! Just came in to say fare-thee-well.  Ain't you heard? His parole came through!  Red and Andy exchange a surprised look. Andy wants to understand. Red just motions to let it be for now. He puts his arm around Brooks, who sobs inconsolably. Softly:   Old man's crazy as a rat in a tin shithouse, is what.   Institutionalized, my ass.   Shovel man in. Watch the dirt.   Couldn't play somethin' good, huh? Hank Williams?   Shit. No such thing as easy time in the hole. A week seems like a year.   Treasure Island. Robert Louis...   The Count of Monte Crisco...   ...by Alexandree Dumb-ass.   Sounds like road-gangin', you ask me.   Give us a break, lady.    No, ma'am.   You heard the lady.  Heywood unzips his pants, reaches inside. The others do likewise. The woman turns back and is greeted by the sight of a dozen men displaying their penises and smiling brightly. Her legs go wobbly and she sits heavily down on the dirt grade.   C'mon! We're showin' our tools and grinnin' like fools! Take the damn picture!   You did a stretch in Cashman too?    Red? You saying Andy's innocent? I mean for real innocent?  Sweet Jesus. How long's he been in here?   Oh Lord. Andy come down to the loading dock today. Asked me for a length of rope. Six foot long.   Sure I did. I mean why wouldn't I?   How the hell was I s'pose to know?   Probably still up in the warden's.   Let's pull him aside tomorrow, all of us. Have a word with him. Ain't that right, Red?",
        "Snooze": "Rich bet.   What's he doing?   Oh shit, oh fuck, oh Jesus...   He's right, it ain't.   You tell me, man. One second he was fine, then out came the knife. I better get the guards.   Sounds like you done time all over New England.   Shit! You gave it to him?",
        "1946": "",
        "D.A.": "Mr. Dufresne, describe the confrontation you had with your wife the night she was murdered.   What was your response?    I'll see you in Hell before I see you in Reno. Those were the words you used, Mr. Dufresne, according to the testimony of your neighbors.   What happened after you and your wife argued?   Glenn Quentin. The golf pro at the Falmouth Hills Country Club. The man you had recently discovered was her lover.  Did you follow her?   With what intention?   You had a gun with you?   When they arrived, you went up to the house and murdered them?   Quickie divorce indeed. A .38 caliber divorce, wrapped in a handtowel to muffle the shots, isn't that what you mean? And then you shot her lover!   Yes, you have. Where I get hazy, though, is the part where the cleaning woman shows up the next morning and finds your wife and her lover in bed, riddled with .38 caliber bullets. Does that strike you as a fantastic coincidence, Mr. Dufresne, or is it just me?   I'm sorry, Mr. Dufresne, I don't think the jury heard that.   Does what?   On that, sir, we are in accord...   You claim you threw your gun into the Royal River before the murders took place. That's rather convenient.   You recall Lt. Mincher's testimony? He and his men dragged that river for three days and nary a gun was found. So no comparison can be made between your gun and the bullets taken from the bloodstained corpses of the victims. That's also rather convenient, isn't it, Mr. Dufresne?   Ladies and gentlemen, you've heard all the evidence, you know all the facts. We have the accused at the scene of the crime. We have foot prints. Tire tracks. Bullets scattered on the ground which bear his fingerprints. A broken bourbon bottle, likewise with fingerprints. Most of all, we have a beautiful young woman and her lover lying dead in each other's arms. They had sinned. But was their crime so great as to merit a death sentence?  He gestures to Andy sitting quietly with his ATTORNEY.   I suspect Mr. Dufresne's answer to that would be yes. I further suspect he carried out that sentence on the night of September 21st, this year of our Lord, 1946, by pumping four bullets into his wife and another four into Glenn Quentin. And while you think about that, think about this...  He picks up a revolver, spins the cylinder before their eyes like a carnival barker spinning a wheel of fortune.   A revolver holds six bullets, not eight. I submit to you this was not a hot-blooded crime of passion! That could at least be understood, if not condoned. No, this was revenge of a much more brutal and cold-blooded nature. Consider! Four bullets per victim! Not six shots fired, but eight! That means he fired the gun empty...and then stopped to reload so he could shoot each of them again! An extra bullet per lover...right in the head.  I'm done talking. You people are all decent, God-fearing Christian folk. You know what to do.   Byron Hadley?  ANGLE SHIFTS to reveal Captain Hadley. Staring. Waiting.   You have the right to remain silent. If you give up that right, anything you say will be used against you in court...  TROOPERS move in, cuffing Hadley's hands behind his back. The D.A. drones on. FLASHBULBS POP. Hadley says nothing. His face scrunches up. He begins to cry.   Samuel Norton? We have a warrant for your arrest! Open up!  The POUNDING starts. Norton dumps the box of bullets out on thr desk. He starts sorting them to see which ones he likes."
    },
    "imdb_rating": "9.3",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNDE3ODcxYzMtY2YzZC00NmNlLWJiNDMtZDViZWM2MzIxZDYwXkEyXkFqcGdeQXVyNjAwNDUxODI@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red.J-S-Golden",
    "name": "The Shawshank Redemption",
    "genres": [
        "Drama"
    ]
}