{
    "filename": "Theory-of-Everything,-The_script.txt",
    "imdb_id": "tt2980516",
    "imdb_url": "https://www.imdb.com/title/tt2980516",
    "characters": [
        "Robert Hawking - Age 17",
        "George Wilde",
        "Frank Hawking",
        "Timothy Hawking - Age 8",
        "Jane Hawking",
        "Diana King",
        "Beryl Wilde",
        "Dennis Sciama",
        "Carter",
        "Lucy Hawking - Age 14",
        "Brian",
        "Rees",
        "Barman - Rowing Club",
        "Ellis",
        "Stephen Hawking"
    ],
    "dialogues": {
        "George": "",
        "Wilde": "",
        "Frank": "And Jane? What are you studying?  Oh? What in?  Arts. So, what painters do you like?  Really? Turner? To me they all look as if they've been left out in the rain.    Stephen doesn't like my homemade wine. Philistine. If you don't watch out I'll send you back with a couple of bottles.    How plucky of you.  It's so nicely cocked.  HA! Marvelous! Very good. \"The breast is yet to come!\" Indeed it is! Well done.  You don't realize what lies ahead. His life is going to be very short. So. Be careful. Science is against you. And it's not going to be a fight, Jane. It's going to be a very heavy defeat. For all of us.  Oh, it's nothing. The climb is absolutely worth it. You get the luggage.  Oh--Rain?--Falling?--Rain Falling Down?--Shivering?--Uhhhrrrrr---  Very well, no doctors.  I've always supported you in your choice not to have home help, but now, you need a permanent solution. This--this current 'situation' can't go on. You need a proper live- in nurse immediately.  You know what I'm talking about.  You can't afford to-- There must be a way. You need to find a way. For your family's sake. You're world famous -  I believe it's urgent.",
        "Hawking": "And Jane? What are you studying?  Oh? What in?  Arts. So, what painters do you like?  Really? Turner? To me they all look as if they've been left out in the rain.    Stephen doesn't like my homemade wine. Philistine. If you don't watch out I'll send you back with a couple of bottles.    How plucky of you.  It's so nicely cocked.  HA! Marvelous! Very good. \"The breast is yet to come!\" Indeed it is! Well done.     You don't realize what lies ahead. His life is going to be very short. So. Be careful. Science is against you. And it's not going to be a fight, Jane. It's going to be a very heavy defeat. For all of us.   _____________________________________________________________      Oh, it's nothing. The climb is absolutely worth it. You get the luggage.  Oh--Rain?--Falling?--Rain Falling Down?--Shivering?--Uhhhrrrrr---  Very well, no doctors.  I've always supported you in your choice not to have home help, but now, you need a permanent solution. This--this current 'situation' can't go on. You need a proper live- in nurse immediately.  You know what I'm talking about.  You can't afford to-- There must be a way. You need to find a way. For your family's sake. You're world famous -  I believe it's urgent.",
        "Jane": "Who is that guy?  Hello.  Arts.  So what do you-?  What's a cosmologist?  C of E. Church of England.  So--what do cosmologists worship then?    Why didn't you stay at Oxford?  What's a viva?  They gave you the 1st.  Well, I hope you find your equation.  Hello.  Reasonably low. Uh - this is - Stephen.    I'm actually busy Sunday mornings.  So I gather you've never been to church?  Tempted to convert?  Arts. Languages, poetry. I'm thinking of doing a PhD eventually.    Well, I like--Turner...  And...William Blake.  Yes, please.    Sounds less of an argument against God than against physicists.  Er - light, please.  That's okay - - the breast is yet to come.  Should we dance, do you think?  I absolutely agree. I mean, who would want to dance?    Why?  The washing powder?  Why do you know that?  - like that.  Why?    The Twenties is always fun.  \"Seek then/ No learning/ from Starry Men!/ Who follow with Optic Glass/ The Whirling Ways of Stars that Pass.\"  Was it -  - was it a good time for science?  Spacetime...  The perfect couple!    - Alright -  Winding back the clock!  That's what I'm doing.  Stephen? Hi. It's me. Stephen?   Brian--have you seen Stephen?  What is it?  Something educational?  Are you close?   Don't do this.  Cut me off.  Teach me croquet. Come on. Teach me. What is this?  If you don't get up and play a game with me I won't come back here again. Ever.  STEPHEN? Let me in. Please. Please let me in.  Are you going to talk about this or not?  Is that what you want?  I can't.  I can't.  I think--I've fallen in love with you.  I know. Strange. Inexplicable.  My chances are probably - - well, some \"integer of zero\", but I think we can make a go of this. I want us to be together, for as long as we've got. And if that's not very long then - well, that's just how it is. It will have to do.  Your glasses are always dirty.  There. That's better. Isn't it?  I know--I know what you all think. That I don't look a terribly strong person. But I love him. And he loves me. We're going to fight this illness--all of us.  Ready. Good luck. Are you sure I can't drive you?   To Doctor Stephen Hawking.    Of course.    One second.          Are you alright?    Get in the car! Get! In! The Car! Come on! Let's go see Gran and Grandad!  Yes. I see. But what about all the steps, Frank?  He needs to see a doctor. This keeps happening!  I need help. I keep--I keep looking for a way-- to make this work--but I can't find it.      Ready?  It's an electric wheelchair. We can take it back--if you don't like it.  Mum--I think that is possibly the most English thing anyone has ever said.  I used to love singing.  I don't know about that.  Hello.  I um--I just came to--  I wish.    Good question.    I wouldn't call it a repertoire. Brahms--I know a little-  Well, I have sung--\"Immer leiser.\"  Jane. Jane Hawking.  Now?  No, no. No, no. Just let me remember the lyrics. In English.  Okay.    None of that wishy-washy do-gooder stuff--Matthew, Luke.  Well I should be going.  Absolutely. My husband loves music too.  Well, that's a long story. 'Night.  Water.  PhD thesis.  ...is irrelevant                   ...is irrelevant  ...in physics.    Stephen is looking for a single law that governs all the forces in the universe. So God must die.  The two great pillars of physics  ...Einstein's theory. Which governs the very large, planets and such--but Quantum -  They don't remotely play by the same rules. Peas are chaotic, and don't behave predictably at all -  Which you can set your watch by.  If the world were all potatoes, easy--you could trace a precise beginning, as Stephen once did, a moment of Creation. Hallelujah, God lives.  But if you want to incorporate peas into the menu, which Stephen now wants to do, then it all goes  Tits up. Haywire. Becomes a Godless mess.  Einstein hated peas, Quantum Theory. \"God doesn't play dice with the universe\", he said.  Seems he not only plays dice -  - he throws them -  Stephen's swapped his telescope - for a microscope. Order for chaos--hoping to find a law to cover both.  God is back on the endangered species list.  Physics is back in business. Stephen thinks it a fair exchange.  (to JONATHAN, ignoring    Thank you for coming.  Of course. For infinity.  I have to tell you something.  I'm um--I'm pregnant.  Does it make a difference?  No. I don't.  Know what?!  That's what you think of me?  There is no way that Timothy could have any other father than Stephen. None. And for the record--I will never leave Stephen.  Please don't go.  So. What does it matter?  I have feelings for you, too.  It's - it's difficult for me!    I know, I know.  You have no -                    It's so wonderful, for me,  I have to go. I don't think I    Please, please -  Invited? Where?  Geneva?  What students?  You know how much I hate -  To fly. Yes.  - Me and the children--go on?  - bring the car -  Bayreuth? How can I manage that? On my own?  I doubt he would be willing.  And please please remember, 5 milligrams of Riluzole before and after the flight.  Travel safely.  Forty-nine...Fifty. Coming ready or not!    Stephen must live! You have to bring him round from the anaesthetic!  There's no question. Stephen must live. I will see he gets everything he needs. I will have him transferred back to Cambridge.  Drive--safely, yes? Did you get everything in the car? His chair, equipment...  Stephen?  This is a Spelling Board. First, you tell me what letter you want by blinking when I say the colour of the group that contains that letter. Once I know the group, you can choose the character inside that group by blinking again when I go through the colours of each letter in that group. Apparently. Okay? Let's just try.  So...Green, Yellow, Blue, White, Black, Red. Blink to choose the group that contains the letter you want? Green? Yellow? Blue? White? Black? Red?  She's here. Okay. Promise not to eat her alive...  Thank you.  - wheels.    How does it work?    It's American! Oh, my Goodness. Are there any other voices?  At four words a minute? About what?   Elaine? Can we - ?  Would you mind if I spoke with Stephen alone for a moment?     So you're acknowledging him?  Did you just say something?  So you're actually going to let me have this moment.    America? You always used to tell me when an invitation came in.  They said - two. We've had so many.  I have loved you. I did my best.  He wants to marry her.  I'm trying hard not to think of this as a failure.  But it feels like it! It feels like it, Mum. Was it inevitable?    It's going to have to be a wonderful piece of mathematics. All the accidents...  And vice versa.  Then add Time - Adversity -  - until the situation becomes unstable, heats up.  And the whole thing starts over. Whole new galaxies.  It's from Stephen. He's--he has invited--the children and I--to accompany him.  Your glasses are always dirty.     Thank you. For today. It's been extraordinary. It's all just been rather extraordinary though, hasn't it?  What are you writing?",
        "Diana": "Scientists! Don't worry. We don't have to stay long. Looks mortifyingly dull. Oh, hang on-- Be right back, okay? Okay?  That's better.     This party is officially deceased! Come on--I've fixed you up a ride home.",
        "King": "And Jane? What are you studying?  Oh? What in?  Arts. So, what painters do you like?  Really? Turner? To me they all look as if they've been left out in the rain.    Stephen doesn't like my homemade wine. Philistine. If you don't watch out I'll send you back with a couple of bottles.    How plucky of you.  It's so nicely cocked.  HA! Marvelous! Very good. \"The breast is yet to come!\" Indeed it is! Well done.        You don't realize what lies ahead. His life is going to be very short. So. Be careful. Science is against you. And it's not going to be a fight, Jane. It's going to be a very heavy defeat. For all of us.  THE THEORY of EVERYTHING   37      _____________________________________________________________      Oh, it's nothing. The climb is absolutely worth it. You get the luggage.  Oh--Rain?--Falling?--Rain Falling Down?--Shivering?--Uhhhrrrrr---  Very well, no doctors.  I've always supported you in your choice not to have home help, but now, you need a permanent solution. This--this current 'situation' can't go on. You need a proper live- in nurse immediately.  You know what I'm talking about.  You can't afford to-- There must be a way. You need to find a way. For your family's sake. You're world famous -  I believe it's urgent.",
        "Beryl": "Jane--Jane? Jane? Jane! STOP!  Sit down. Sit.  Now--I'd like to make a suggestion-- it might sound unusual--but I've seen it work wonders. I think--you should consider - - joining the church choir.  Maybe so.  You're very good at it.  Go.  It's one hour a week.  Remarkable. How is he?  Don't blame yourself. We're proud of you.  But it wasn't a failure.  Perhaps too many people were drawn in? What will Stephen do next?  All the unexpected forces... attractions...    Of course.  Yes. Adversity over time --  Bang!  Darling, I think we've cracked it. Shall we phone the Nobel committee now or shall we have another cup of tea first?",
        "Dennis": "",
        "Sciama": "A little challenge for you all, as you embark on your separate doctoral journeys - - whatever they may be, Mr Hawking -  Something to sort--the men from the boys--the wheat from the chaff-- the mesons from the pi-mesons--the quarks from the quacks--ten questions--each more impregnable than the last. Good luck. You'll need it. Shall we say, Friday 3 o'clock?     Stephen, glad you could join us.  Train timetables? Stephen, these are totally unacceptable--they expired a month ago.  Well...I see...well thank God. Well done Stephen.   Stephen, come in. Sit down. Now-- we're all rather concerned--about your choice of subject. What it's going to be.  Any ideas?  Come with me.  This lab is where JJ Thomson discovered the electron, where Rutherford split the atom. One of the great rewards of this job is that you never know from where the next great leap forward is going to come, or from whom.  Next Friday. I'm taking a few graduates of merit to London, to attend a talk by the mathematician Roger Penrose. Come along if you're interested. Oh, and close the door as you leave.  Go on. If?     A singularity.    Keep going. Develop the mathematics.     ...the solutions to the Schrodinger equation must vanish at the boundary of the box, so we have...  Time. That's your subject? Any aspect of it, in particular?  Come in Stephen.  How are you?  Would you like to sit down?  So. Chapters One--full of holes and lacks mathematical support. Professor Thorne?  But Four?  A black hole at the beginning of Time.  Brilliant. It's brilliant Stephen. So all that remains to be said is...well done. Or should I say, well done Doctor. And extraordinary theory.  So, what now?  Yes. It would. It would indeed.  Kip! He's done it, Kip! He's -  Stephen! He's changed everything!     All set?  You'll do fine.  Ready or not.     I don't get it. You've spent years assuming Black Holes exist--you believe Cygnus X-1 will turn out to be the first black hole we can actually observe==and yet you bet Kip Thorne that it isn't a black hole?  Why would you bet against yourself?  A subscription to what? Nature magazine?  Penthouse?  Oh. I'm sorry.  Thankyou. I first met--the Professor--was it really 1963? Time- -where does it go? Back then, he was kind of annoying. He knew things that his woeful work ethic should not have allowed him to know.  But it's been--really--one of the great joys of my life to watch this man defy every expectation, both scientific and personal. So it's with no small pride that I ask him to return to the stage once more, to continue to do what he has always done - answer your questions. My most irritating student, my esteemed colleague, my good friend--Professor Hawking.  The first pre-selected question, please!",
        "Carter": "No, no, listen, listen, pay attention. A man enters a lift, wanting to go to the fiftieth floor but only gets as far as the 46th. Why?  Me too.",
        "Brian": "First to find a drink.  I'm sure the secret of the universe has something to do with sex. There you go--why don't you do your doctorate on that? The physics of love.  You'd better decide on your subject. I'm serious--they'll boot you out.  Did you?  Well, it's a back-up plan--in your case not a bad idea. Did they accept you?  - slept in. Well, thank Christ,    Actually--I think she's--yes-- Basil's sister. Wilde--Jane Wilde. \"So. You like for me I introduce?\"    Oh come on, get up. How many have you got?  Afternoon, Stephen. Where are they? Where are you hiding them? Your answers.  How many of Sciama's questions have you done?  You liar!  Later? You mean you haven't even started?  Stephen, are you aware you have voluntarily embarked on a PHD in physics at one of the most prestigious colleges in England?  Oh, good. Thought maybe you'd slept through the induction or something.  What?  Sod off.    (exhausted, speaks one    Hey--it's the closest I'll get to a unifying theory, leave me alone.    Okay, I've got one. Okay, okay-- A naked girl enters a lift -    \"Welcome--to this week's episode of The Natural World, where we explain the extraordinary hibernation patterns of the rare Cambridge Physicist--seen here in his wonderful plumage...\"  So? What did they say? Your wrist. What did they say?    Motor what? Sorry, I'm lagging behind in my pioneering work on rare automotive and baseball diseases. Come on, let's go to the pub.  What? I--I don't understand. It's not possible! It's ridiculous!  You were fine a couple of days ago. Steve? You're fine. What did they say...?  I'm sorry, look, I was just being a berk...I'm so...  Right. OK. So--see you soon, yeah?  Jane!  Jane, have a seat.  I understand you saw him. You know he was in hospital...  -Who?  What's astonishing is that for Stephen and I, \"work\" was the worst four-letter word, the worst. Stephen probably averaged, what was it?--an hour a day your entire university career? Unbelievable levels of sloth!  No,no! What he's saying is--just as a hot body loses heat--right? -  - that a black hole -  - that if it is losing particles, then, then over time -  Gone!   From nothing--into nothing.  He's just told us that - - Time! Had a beginning! He shown us how -  Crunch! It's beautiful! It's racy! It's totally, totally -   Jeez!--uhhhh!--how the hell does Jane manage?  So, tell me, this Motor Neuron Disease, does it effect, y'know...  Everything..?  That's kinda wonderful, actually. And it explains a great deal about men.",
        "Rees": "Second law of thermodynamics.  - thanks -  You owe me another beer.  Bang.",
        "Ellis": "No--we give up. No idea.",
        "Stephen": "More your field, I think.  I applied for a job.  Civil Service.  Unfortunately, that I'll never know. Morning of their exam,  I was going to ask you.  Hello.  Science?  Cosmologist. I'm a cosmologist.  It's a kind of religion--for intelligent atheists. You're not religious, are you?       That is the question.  My finals papers were such a shambles the examiners called me in for a 'Viva' and I told them -  A mildly terrifying face-to-face thingy. An interrogation. So I told them that if they gave me a 2nd class degree I'd stay with them and do my research at Oxford, but if they gave me the 1st I needed to get into Cambridge, then they'd never have to see me again.  They gave me the 1st.     Morning, Brian.  Brian, I have no idea what you're talking about.  None.  I was going do them later.  Yes.    Can you whip on some Wagner?  Sorry.  Sorry. It's on the back. Had a little accident.  I could only do nine.  Full, give me twenty - One, drive! - Two, drive! - Three, big legs! - Four, press! - Five, boom! - Hook, send! - Catch, big send! - Hold at 32! - Big legs, Brian! - Big legs!  - Stay long, Brian! - Stay long Brian!!!...  He was too short to reach the button for the fiftieth floor.    Uh - my napkin just walked in.  Hi.  What's the probability?  Croquet. Do you play croquet?  Sunday morning?  Oh. Of course. Him.  I can't decide.  Umm-- No.  Once upon a time.  I have a problem with the whole Celestial Dictator premise. What are you doing for lunch? Ma makes a cracking roast.    Positively saintly, thank you.  A physicist can't allow his calculations to be muddled by a belief in a supernatural creator.  I'll wing it. As usual.  Stop egging him on!  Oh! - I'm inviting Jane to be my partner for the May Ball.    Oh, no, no. Happy to observe the phenomenon--but I can't possibly imagine participating.  No, I'm quite serious. I don't dance.    Do you know why?   The fluorescence in the washing powder is caught by the UV light.    So why... ...why...  Why medieval Spanish poetry?  And what particular time periods do you visit?  The roaring twenties! Cheers!  So--The 1920's. A good time for poetry was it?  Ouch.  A smashing time actually. Spacetime was born.  Space and Time finally got together. People always thought they were too dissimilar, couldn't possibly work out. But then along comes Einstein, the ultimate match- maker, and decided that space and time, not only had a future, but had been married all along.  Well that's astonishing, isn't it?  Would you dance with me?    If you applied Penrose's theory about black holes to--the entire universe?  If--if--so--If--Einstein is right, if--general relativity is correct, then the universe is expanding, yes? -  - which means - that--if you reverse time, the universe would get smaller and smaller. So what if--if I reverse the process all the way to see what happened at the beginning of Time itself? The universe, smaller and smaller, denser and denser, hotter and hotter as we approach its birth. Wind back the clock...  What are you doing?    Well keep winding! You've got quite a way to go. Keep winding, Jane! Keep winding...back to the beginning of Time...Keep winding...    A spacetime singularity. At the beginning of time.  The universe born from a black hole exploding.  Keep going? You mean go further back, Professor? Before the universe began?  I don't know how.  What is it? What's wrong with me?  What's that?  Is--is--is there a cure? Some--? Is--can you--?  Wait! What about--what about the brain?  What?       I have a disease, Bri.  No. Motor neuron disease. Lou Gehrig's Disease. He was a baseball player.     Will you leave me Brian?       THE THEORY of EVERYTHING   31        John is having an affair with Martha. But Martha is in love with Alan. And I think Alan is homosexual by the look of his shirts. I'm trying to work out the mathematical probability of happiness.  It's some integer of zero, but I'm not there yet.    You just missed him. He was here earlier.  What?  Go.  I believe you poetry under- graduate types call it...\"a slough of despond.\"  My turn.     Go away.    Go away!  There's nothing to say-- just...  That's what I want. I haven't got time for you. So - if you care about me at all - go.  I've got two years. I need to work.  You've--you've leapt to--a false conclusion...  You don't realise what's coming. It'll affect everything.      Time.      No thankyou.  Thankyou.  Prove it. Prove...with a single equation, that Time has a beginning. Wouldn't that be nice Professor? One single elegant equation to explain everything?  I'm sorry.  It's okay Robert.  This--is--temporary.  Well, it's convenient for breakfast!  Thank you.  I said--thankyou.  Go Jane.       In other words--the steady emission of heat energy causes black holes to slowly lose mass, they evaporate, eventually disappearing in a spectacular explosion. So...  - it must eventually disappear.  First a star vanishes into a black hole, but then the black hole must itself--vanish.  Was it something I said?  Big legs! Big legs Brian!  What?  Different system. Automatic.  No doctors!  (forcefully, but with a      Pent-house. That way even if I'm wrong, I still win!  (testily, his slurring  My new project - disproves it.  What one believes - - is irrelevant--in physics.  No. Mine.      Tits up.  Seems he not only plays dice -  - he throws them - where we can't find them.  But physics--is back in business.    More wine?  Wrong guy to ask.  I understand you need more help. And if there is - someone - who is prepared to offer it - I won't object, as long - as long as you continue to love me.  We have help.    For black holes--not rock concerts.  I've just been invited -  Geneva.  Students can accompany me.  I know how much you hate -  - to fly.  I was thinking - that you and the  could bring the car -  - meet me in Bayreuth -  Bring Jonathan.    Is--this okay?  Jane--needs--help.        (electronic voice,  Daisy. Daisy. Give Me Your Answer Do.  Frankly my dear, I don't give a damn.  Ex-terminate..! Ex-terminate..! Ex-terminate..!  I will write. A Book.  Time...  What is the nature of Time?  Will it ever come to an end?  Can we go back in time?  Some day these answers may seem as obvious to us as the earth orbiting the sun, or perhaps as ridiculous as a tower of tortoises.  Only Time, whatever that may be, will tell.  It is for a friend.  So I said - I have long been looking for a model of the universe. I finally found her.  Yes. Of course.   You - are - welcome.  E-laine has offered to travel with me to A-merica. She will look after me.  Don't worry.    Everything will be okay.  How many years?  Be. Happy.  I cannot sign copies of my book-- but if you like--I could drive over it.  Can you hear me? There are some things I cannot do. But. They are mostly the things I don't particularly want to do anyway.  I was stopped recently by a tourist in Cambridge who asked if I was 'the real Stephen Hawking.' I replied that I was not, and said the real one was--much better looking.  He believed me.  I now predict -- that I was wrong.  I have experimental evidence that Time Travel is not possible. I gave a party for Time-Travellers but no- one came.  It is clear that we are just an advanced breed of monkeys on a minor planet orbiting around a very average star in the outer suburb of one among a hundred billion galaxies...  ...but--ever since the dawn of civilisation, people have craved for an understanding of the underlying order of the world. There ought to be something very special about the boundary conditions of the universe - and what can be more special than that there is no boundary? And there should be no boundary to human endeavour. We are all different. There is no such thing as a standard or run of the mill human being--but we share the same human spirit. However bad life may seem, there is always something you can do, and succeed at. While there's life, there is hope."
    },
    "imdb_rating": "7.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTAwMTU4MDA3NDNeQTJeQWpwZ15BbWU4MDk4NTMxNTIx._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "The Theory of Everything is the story of the most brilliant and celebrated physicist of our time, Stephen Hawking, and Jane Wilde, the arts student he fell in love with while studying at Cambridge in the 1960s. Little was expected from Hawking, a bright but shiftless student of cosmology, after he was given just two years to live following the diagnosis of a fatal illness (ALS) at 21 years of age. He became galvanized, however, by the love Jane Wilde, and went on to be called the \"successor to Einstein,\" as well as a husband and father to their three children. Over the course of their marriage, however, as Stephen's body collapsed and his academic renown soared, fault lines were exposed that tested the resolve of their relationship and dramatically altered the course of both of their lives.—The Times",
    "name": "The Theory of Everything",
    "genres": [
        "Biography",
        "Drama",
        "Romance"
    ]
}