{
    "filename": "Siege,-The_script.txt",
    "imdb_id": "tt0133952",
    "imdb_url": "https://www.imdb.com/title/tt0133952",
    "characters": [
        "Frank Haddad",
        "Muezzin",
        "Sheik Achmed Bin Talal",
        "Mike Johanssen",
        "INS Official",
        "Khalil Saleh",
        "INS Uniform",
        "General William Devereaux",
        "Fred Darius",
        "Danny Sussman",
        "Elise Kraft /Sharon Bridger",
        "Samir Nazhde",
        "Tina Osu (as Liana Pai)",
        "FBI Agent Floyd Rose",
        "Anthony Hubbard"
    ],
    "dialogues": {
        "Frank": "Black-and-whites on the scene?  Residence or business?  On the way.    In this traffic, maybe tomorrow.     Oh, fuck. It just blew.    -- That's what they're telling me.  Maybe it's performance art.  -- available from The Sharper Image catalogue.  Jihad isn't known for their sense of humor, and Hamas is raising so much money here, why queer their deal?  -- And, excuse me, but why do we immediately assume they're Arabs?  Hub... I think we're all eager to give up our weekends on this. It just occurs to me, has anybody even committed a crime here? I mean, assault with a deadly color?  -- Omar Abdel Rahman... asshole.  Under protest.    -- big orthodontia bills. Someday, you'll understand.  Where we going?  You sleep here? Immigration called.  -- who's trying to score points with his boss, bigtime.    ...He means, \"dowry.\"  The tabac. Sssssss... The territories.  A '97 Contour. On my Visa. Back home, the security services'd be up this guy's ass with a poker, but what do we do, we let him go.  Not my first date, Hub. He's taking the BQE. Looks like it's Brooklyn.  You're micro-managing.  I get reimbursed for this, right?      Don't know him. If we were allowed to get sound on them, we'd know him.  He's making him. Shit. Fuck. He's --  Christ!  Shit --! I didn't take the insurance.  It's not his dog, numbnuts. They're spies.  Hi, guys, I expect you know the drill.  So, Elise... You okay back there, you don't get carsick or anything? Those handcuffs too tight --?  Wow. You're really good. She's really good.    The driver's name is Larry Kaiser. He says they've got explosives strapped to their chests, they got automatic weapons, and they're speaking Arabic.  Tunnel's got twenty minute delays and they're working on both bridges.  Meaning?  -- Hub...  -- So?  I don't know if they understand.  The guy's just breathing into the phone, maybe they're not even Arabs.  Okay, here we go...       Shut the fuck up and go give somebody a parking ticket.  IAP66. What's IAP66?  -- Today, Danny...  Which is... vaporized.  At the point of issuance. Could be the American Consulate in Tel Aviv. The American Consulate in Amman, Cairo, Alexandria, Riyadh -- all an easy drive from the West Bank --  Sorry, boss. Hello, Elise. Mmmm, is that pastrami? Oh, yeah, we made the guy in the picture.  My people. The last of the unambivalent smokers. Monsters. The toughest motherfucker in Bed-Stuy is a muffin compared to some of these guys.  His name's Samir Nazhde. Teaches Arab Studies at Brooklyn College. He sponsored Ail Waziri's student visa. And dig this -- his brother blew up a movie theatre in Tel Aviv.    Yes, and he's on the next plane for Tunis.    Samir Nazhde, my name is Frank Haddad, I'm a Federal Agent. We have reason to believe you are an accessory to the bombing of Bus 87.  You are an associate of Ali Waziri.  You got him a student visa.  You spent two years in Israeli jails during the Intifada.  Sorry. Family matter. You're going downtown, my friend.  Defrauding the INS is a Federal Offense. Reservation for one, please.     -- Someday I will tell you what those people did to my village in '71.  What's there to tip?  So you're saying... you sleep around?  I'll have somebody drive you.  Elise. I'm really high strung, too.  Beats cable.  -- You're telling me that just because some Brooklyn landlord tips you off that he's been paid in cash, you have the right to call in the cavalry -- ! Hub, as far as I know, paying cash is not yet a crime in this country.  -- You've observed him giving cash to --  -- But you have hard evidence linking this apartment to the people that blew up bus 87 --?  And when you do, you'll get your warrant.  Meaning?  Tell me the difference between that and breaking-and-entering?  Not good enough.  Waves mean nothing to me; there's been a wave of violent crime committed by black people in this city for the past twenty years, but if you came to me with a plan to put all black people behind bars as a preventative measure I'd send you packing. There's a price to be paid for living in a free society --  Three sounds right. If we had microwave we'd know for sure. The CIA's got microwave, how come we don't have microwave.  Drop your weapon!  Anybody like anchovies --?  What --?  So am I --! Hey, Elise... tell us about being a spook? Ever meet Aldrich Ames? Weren't you at the Bay of Pigs?  The Shah of Iran, Noriega, I love the way you guys predicted the collapse of the Soviet Union.  Whoa... What do they put in these drinks --?  Fred, Whitney, we're waiting on who else...    Been better.  Says Samir.  That's good sound.  One's his uncle, he owns the place. The other's a doctor. They check out clean.  A clean body and a pure heart.  -- If you're on the State Department Terrorist Watch list you cannot get into this country. But Ali Waziri was on the watch list, and he got in.  They told me to call INS.  They told me to call State.  What the fuck is the NYPD doing here?!   They got Frankie. My kid's here someplace --  (fighting back tears of rage  They came into my house. My wife told them who I was -- How many times did I put it on the line, Hub --? How many times --  We're American citizens, twenty years. Ten years in the bureau -- They knocked her down... and took him. Out of my own house.  NO! I've got to find him. Besides, this is where I belong. Here. I'm not their sand nigger anymore.      He's alright. Thanks for getting him out.  I trust her about as far as I can throw her.  Ah, microwave.  We've got a problem.     What the --  She knew we were listening.       Allah Ahkbar --",
        "Haddad": "",
        "Muezzin": "Allahuh Akbar...",
        "Mike": "You sure this is all they got?  Not yet...  Some detective you are. They stopped.  Federal Agents. Hands behind your back --  Hub, we don't have positive ID on anybody.  You want change, right --?  You gonna open the door, or what --?  Jesus, didn't ya hear crime's down seven-percent...  Same here.  We got semtex, we got detcord, same stuff as the bus, the whole enchilada...",
        "Johanssen": "",
        "INS": "-- all in small bills. So we figure, smurf, right? Then I think, considering the gentleman's nationality, plus where he's been recently, we better call Frank.  No, sir. He's twenty bucks under the $10,000 limit.     Howard Kaplan. INS. So we've pulled every ethnic visa in the city and traced them to source. Who wants em?  Sixteen hundred, maybe more.",
        "Official": "-- all in small bills. So we figure, smurf, right? Then I think, considering the gentleman's nationality, plus where he's been recently, we better call Frank.  No, sir. He's twenty bucks under the $10,000 limit.  ...so, Kahlil, you're saying this is an INHERITANCE? Somebody DIED and you're bringing them the MONEY?  Howard Kaplan. INS. So we've pulled every ethnic visa in the city and traced them to source. Who wants em?  Sixteen hundred, maybe more.",
        "Khalil": "",
        "Saleh": "",
        "Uniform": "...so, Kahlil, you're saying this is an INHERITANCE? Somebody DIED and you're bringing them the MONEY?  What about translators --?",
        "Fred": "Excuse me, sir. I think you should see this. Came in on the Fax.  The Hamas guy got released in April.  Really? I wonder if she likes white guys.  They just found the van. Doesn't look like they're gonna find any prints.  Floyd Rose.  -- Keep 'em where we can see 'em, thank you very much.  I'm on it.  Sir. They want you in the lab.  You're saying they're Egyptian?  Terminal.",
        "Darius": "",
        "Danny": "-- He doing her?  I wonder if she likes bald guys.  I had a dog like that once.  The dog works for the CIA?  -- He's way over his head.  Hold on, hold on, I'm looking it up --  Wait, wait -- Here we go. Student Visa, J-1.  In his passport.  Three-fifteen. P.M. When's the last time you ate?  Fiber thinks they've come up with a piece of the shroud. Egyptian cotton.   My department WHAT, ASSHOLE...?  We bring 'me in, have a talk.  Where the hell we gonna put sixteen hundred people?  -- one of the moms was carrying a piece, wounds the guy as he's planting the device. He kills her and locks them all in. Up there in the corner... by the clock.  -- It's got a timer on it only we don't know how much time is left.  I don't know. Somebody must have --",
        "Sussman": "That's it.  Last I looked they weren't offering exploding paint bombs.  McVeigh? Sheik what's-his-name from the Trade Center.  You think it's phony?",
        "Samir": "Are you crazy --?  Who? I know no one by that name.  I sign these applications as a matter of course, hundreds of them. Everyone wants to come to the land of opportunity and Baywatch.  The only ones who didn't were women like you.  You cannot hold me. I know my rights. I watch American television.  You let him HIT ME --!! You cannot care about me and let such things happen!  Sometimes I hate you just because you are so American. It makes me want to hurt you. I think about fucking you and hurting you.  Don't tell me what I have to do.       -- Some people just cannot live in the camps. For my brother, it was already like dying. The only thing he lives for is movies.  -- And then some sheik tells him that, to die for Allah is beautiful. If he does this thing, our parents will be taken care of, and he will live on in Paradise with seventy virgins. Seventy. And my brother, he needs to believe it very much, so he straps ten sticks of dynamite to his chest and goes to the movies... And I become a VIP. It is very confusing.  You are using me, too! Everybody uses the Palestinians! We are the whores of the Middle East! You make reports about our little talks --? What about fucking me?     Oh, my God. Oh, my God...  Listen to that --! Are you listening? They're killing Arabs out there!  What are you talking about --? The army is here. They're setting up interrogation centers right now. They're torturing people in cellars.  -- I've got to get out of here. You have to help me --  Money... I must have more money...  I... got it myself.  She's crazy. They're ghosts. Jinn. They'd never trust someone like me.  Please...  I'm afraid of going to hell.  His name is Tariq Husseini. He runs an auto shop. ...on Commerce Street in Red Hook.     Ahhhhhh...  He is Afghani. Ahhhh. He got word to my uncle at the bath-house. You never met him.       This is not the way to the bath-house. You said to get a key from my uncle so that we --    What are you doing?  It is all so... tragic.  Arab and Jew, side by side. Black and White, Christian and Muslim --  -- so American. Can you imagine a better target?  They'll be here.  What message do you have for them, Sharon?  That's right.  There will never be a last cell. You should listen to the young men in that stadium. It is just beginning.      Praise God. When will he be free --?    No. It's not.  I want you to bleed... as we have bled.  Do not speak to me of the Koran, woman. You take our leader. A holy man. You put him in prison for preaching the word of God. You must learn the consequences of trying to tell the world how to live.  Yes. And they, too, will become its martyrs.  Move away from the door.        It is God's will.",
        "Nazhde": "",
        "Anthony": "",
        "Hubbard": ""
    },
    "imdb_rating": "6.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNDg5YTgzYzQtYmYxMC00ZTJhLWEzMTgtYzM3ZWU3ODBkNDQ5XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_QL75_UX380_CR0,3,380,562_.jpg",
    "description": "After the abduction by the US military of an Islamic religious leader, New York City becomes the target of escalating terrorist attacks. Anthony Hubbard, the head of the FBI's Counter-Terrorism Task Force in New York, teams up with CIA operative Elise Kraft to hunt down the terrorist cells responsible for the attacks. As the bombings continue, the US government responds by declaring martial law, sending US troops, led by Gen. Devereaux, into the streets of New York City.—Karen Eiler <keiler@sprintmail.com>",
    "name": "The Siege",
    "genres": [
        "Action",
        "Thriller"
    ]
}