{
    "filename": "Hurt-Locker,-The_script.txt",
    "imdb_id": "tt0887912",
    "imdb_url": "https://www.imdb.com/title/tt0887912",
    "characters": [
        "Contractor Charlie",
        "Beckham",
        "Professor Nabil",
        "Staff Sergeant William James",
        "Sergeant JT Sanborn",
        "Colonel John Cambridge",
        "Contractor Jimmy",
        "Colonel Reed",
        "Connie James",
        "Specialist Owen Eldridge",
        "Contractor Feisal",
        "Contractor Chris",
        "Black Suit Man (as Suhail Al-Dabbach)",
        "Contractor Team Leader",
        "Sergeant Matt Thompson"
    ],
    "dialogues": {
        "Contractor": "",
        "Charlie": "",
        "Beckham": "",
        "Professor": "",
        "Nabil": "",
        "Jimmy": "",
        "Colonel": "Hi boys.      Well hot damn, that was some hot shit. You're a wild man, you know that?  He's a wild man, you know that? Let me shake your hand.  How many bombs have you disarmed, Sergeant?  Sergeant, I asked you a question.  Holy shit. One hundred and seventy fucking three bombs. God damn. That must be a record. So tell me, what's the best way to go about disarming one of these things?     You guys should all get Bronze stars and I'm gonna recommend it.  Good luck, boys. Keep on keeping on.  You wouldn't catch me walking down on no fuckin' bomb. Hell no, you're not gonna get me in that monkey suit.  Okay fellas?  We haven't found a body so it could be a suicide bomber or some clever bastard that caused all this -- and slipped away to sip tea with his mommie -- we just don't know.  This kind of situation we may never know what happened. This is a mass casualty situation - terrible destruction.  They're cowards, you know. I wish they would stand up and fight us, man to man, instead of playing hide and seek with me.  Right, go ahead Sergeant.",
        "Reed": "Hi boys.      Well hot damn, that was some hot shit. You're a wild man, you know that?  He's a wild man, you know that? Let me shake your hand.  How many bombs have you disarmed, Sergeant?  Sergeant, I asked you a question.  Holy shit. One hundred and seventy fucking three bombs. God damn. That must be a record. So tell me, what's the best way to go about disarming one of these things?     You guys should all get Bronze stars and I'm gonna recommend it.  Good luck, boys. Keep on keeping on.  You wouldn't catch me walking down on no fuckin' bomb. Hell no, you're not gonna get me in that monkey suit.  Okay fellas?  We haven't found a body so it could be a suicide bomber or some clever bastard that caused all this -- and slipped away to sip tea with his mommie -- we just don't know.  This kind of situation we may never know what happened. This is a mass casualty situation - terrible destruction.  They're cowards, you know. I wish they would stand up and fight us, man to man, instead of playing hide and seek with me.  Right, go ahead Sergeant.",
        "Connie": "James?  Well, you woke me up. But - ah - we - we're fine. Will junior said \"bobba\" He means bottle, but he's talking, Will.  Will, I can't wait until you come home.  Will?  Will you call me again soon?  Bye honey.  Let's put the chicken on first and the vegetables on last, so they don't burn?  Will?  Well, good thing the army is hiring, and they've got so many great guys over there.  Thanks for coming. Maybe he'll listen to you.",
        "James": "Yeah.  It's open.  Victory? I thought this was called Camp Liberty.  It's Will. Good to meet you J.T.  Yeah. Here, give me a hand with this.  By the window.  A mortar once hit near my trailer -- boom -- a two inch piece of frag cut through the aluminum and flew this far over my head, past my balls and landed in my computer hard-drive. Where's the damn light?  Yeah, I'm good unless it comes through the roof  in which case I'm gonna need a closed casket.  Tennessee.     Trailer park off I-5.  Okay.  Thanks.  Thanks. But no.    I'm sorry about Thompson, I heard he was a good tech.  I know I can't fill his shoes, but I'm here to try--  --but you know, if it's your time it's your time. No man can change that.  Looking forward to it.      Yeah?  Gimme a minute.  We had a few bombs up in Kabul too.  (looking around at the  Hello boys --    I'll get it. Break out the suit.  Don't need it.  Nah, I'm going to take care of it.     24                           (chuckling into his        30  (gulping air as the helmet  Colt.    Are we going on a date, J.T.?  Hey, this is combat.  I don't mean to mix it up. But the situation dictated it.  I'm serious. We're gonna work together. You'll get used to my ops tempo.  I don't always stop to chat, and I like to go fast. You know, so the insurgents don't have time to plan. I don't want them make any cell phone calls.  Yeah?  I don't know, what?  I don't think about it. Waste of time.    Keep the change.        Hey.  Shoot.  I know. We'll get it.  (spitting out water,  Did you evacuate?  Eldridge - I want you in that window - keep the alley clear. Sanborn, cover it from the street.                                                 Got it.  Yeah?   Yes, sir, it was.  Yes, sir.  Thank you, sir.  Hell, I'm not sure.    A lot.  One seven three.   Counting today, Sir.  The way you don't die.  Thanks, sir, thank you very much. Sir, couldn't do it without my team Hey, Sanborn! Get over here!     Thank you, Sir.                 Thank you, Sir.  Give me my five bucks and I'll give you your ball.  Those DVDs were crap. They were so fuzzy I couldn't see a thing.  I'm telling you, they were fuzzy.  What's your name anyway?  Oh yeah - like the soccer player?  Ready? One, two --  -- three. Shit.  I like to disarm them. Tell   you what, kid, I'll buy another   DVD from you but if this one is   fuzzy you better watch out. Cause   I'm coming for you.  Hey.    You'll be lucky if all you do is turn off the walkie.  How are we on water? I'm dying.    Hold on a second. I think I forgot my gloves back there.      We should save our ammo at least until we can see these bastards.  Roger that, Alpha Nine. Go ahead.                           Let me see those binocs. The Sergeant hands the binocs to James.  Eldridge, I need ammo.  (looking through the    Spit on `em Eldridge. Spit. Rub. Spit rub.  Come on, Eldridge. I need ammo.  You're doing good, man. (putting his hand on Eldridge's shoulder). You're okay.  I will keep you safe, Owen, that's my job.      He's on the left by the smoke stack. Guy in white.  Good. There's another one just behind him. Up a meter.  Good.     Eldridge, grab me the juice out of an MRE.  Yeah.  Deal with it.  It's your call.     Ready?  Now we're even.  One more, boy.    Everyone is a coward at some point in their lives.  That's my son. A real tough little bastard. Like me.  Well, she was my girlfriend, we had a baby, then she became my wife, then we got divorced.  I thought we got divorced. But she's still in the house, and she says we're still together.  So, I don't know. What does that make her?  She ain't dumb. She's loyal.    Bomb parts.  This is from the Blue Opal. (to himself) It's wild, isn't it, to hold something in your hands that could have killed you. (he tosses the board to Sanborn    I agree.  I agree with that too.  Alright.  Beauty mark, my mother dropped me at birth.  Ahhhh! Excellent. Now your turn.    There there. It'll be okay.  Oh yeah, ride me, ride me.  You're alright, Sanborn. Let's have another.  I got him.  Okay. Here we go big boy.  Sure.    Great. I'll call you tomorrow when you're awake.  (trying his best to mean  Sure. Bye honey.          Hell, yeah.  Aren't you supposed to be at your shrink?  What the hell does that mean?  You're healthy? Well, why not.  I'm going back to sleep now.  Yeah.  Anytime, Sir. It's a privilege.  Don't mean to insult your intelligence, Sir. But if the shit hits the fan, please don't fire out of these windows. They're bullet proof and the round will just bounce around the cabin.  You been inside already?   Why don't you wait here? We'll bring out anything of interest.  Yeah, with like twenty pounds of high explosives on it so you get anyone in the room when you open the door.  Guess no one's home.    The kid at camp.  He sells DVDs.  You see him every day. He sells DVDs by the mess tent. His name is Pele.  Don't touch it. Let's blow it.                           Our ride is here.  We're movin'.  Hey - you haven't seen that kid around here by any chance - who sells movies?  No English? Don't lie to me. Where's that kid?  Are you guys responsible for this area?  That motherfucker over there could be an insurgent, watching the camp and giving intel to his buddies so they know where to launch their mortars.  He's a security risk. You should get rid of him.  Does this change anything?   Don't fuck with me man, I'm having a bad day already.  Wait here.  Do you speak English?    Pele. The body bomb.  Take me to the people responsible.  Maybe you don't understand?    Whorehouse two clicks from here.      I didn't. Sergeant. Let's go.  Watch the road, Owen.  Sanborn, get the big spotlights.  No, we're EOD.  Oil tanker?  Sorry, Sir. I didn't recognize you.  We'll take a close look, Sir.  Roger that, Sir. We'll do our best.  Roger, Sir. We better get moving.     Hey! Hey -- you alright? -- Keef Halek?  Hey, I'm right here.  This is where the blast stopped. Look over there.  Perfect vantage point for a remote det -- and I bet he's out there right now watching us make fools of ourselves. We could get him.  Yeah, let's go hunting.  No?      You got to work on your pull ups.  That little bastard. Let's torch this spot so he can't use it again.  Do you have an incendiary?  Eldridge!!!  This guy comes out of the dark - Eldridge shoots.  Another guy comes from behind him -- gets the drop on him. You're a hostage.  Hit `em with both lights on three.  One. Two.  Three.  Again. One two three. Do it. Do it.  No. You're fine.  Fine. I'm fine.  Yeah. Thanks. I'm just tired.  Nah, I'm good.  You'll probably be walking in a few months.  Wow. Six ain't bad.  I'm sorry.              What's going on?  We'll follow you.        You don't need to. I'm going down there.    Where's that helmet?  That's why it's called a suicide bomb.  Nah. That guy wants to catch an American? I'll give him an American.  Uh-huh.  If I shoot you now, I can disarm this bomb much more easily. Do you understand?                     Nope.    Motherfucker. What's our time?  Shit. Ok. Let me think.  We'd need an arc welder to get this off properly.  Let's try the back of it.  Go. I got the suit.  Take it with you, that's a good pistol.  In forty five seconds.  I'm sorry.  The metal is too thick.  Sorry.                You alright?  Have a hit.  Bro, you're not going to die out here.  You got time.  Hell, I don't know.  Yeah.  I do. But I don't know why. Do you know why I am the way I am?  This traffic is pissing me off.  I know where I am but I'm lost.                Yeah, okay.  You know, they're really short on bomb techs over there.  Uh-huh.            I know, it's crazy. So how's life at home treating you?  We just did, buddy.         (trying to settle him  Once upon a time, in a distant kingdom, there were many magic  Every person had a magic box. But you couldn't tell they were magic boxes on the outside. Like this one.  It just looks like a plain old box. Then a new king came along and told all the people, you have to give me all your magic boxes. But the people, instead of giving away their boxes decided to hide them. And they put their boxes in secret places all over the kingdom. They put them in the roads. They put them in cars. They put them in buildings. And the King said, (does a King's gravelly baritone) \"Well, how am I going to get my magic boxes now?\" And one of the King's men said, \"We have a special Knight with special armor, and he can find the boxes. And only he.  And this Knight gathered up all the boxes, far and wide. And sometimes - - when he wasn't sure if it was a magic box -- he opened them.  And the King said to the Knight, you have done a wonderful job. I will grant you one wish. What do you wish?  But the Knight didn't know what to say.  You see, the thing is, son. One day you'll understand that when you start out like you are now, you love everything. You love your Mommy and your Daddy. You love your bobba. You love your blanket.  You even love your little crib, and these dumb toys. But as you get older some of the things you love don't seem special anymore. That bobba is one day just going to look like an ordinary plastic bottle to you. And the older you get, the more this happens and the fewer things you love. And by the time you get to be my age, sometimes you only love one -- or two -- things.  With me, I think's it's one.  You lost again, Sergeant?  Your welcome, m'am.",
        "Feisal": "",
        "Chris": ""
    },
    "imdb_rating": "7.5",
    "description": "An intense portrayal of elite soldiers who have one of the most dangerous jobs in the world: disarming bombs in the heat of combat. When a new sergeant, James, takes over a highly trained bomb disposal team amidst violent conflict, he surprises his two subordinates, Sanborn and Eldridge, by recklessly plunging them into a deadly game of urban combat, behaving as if he's indifferent to death. As the men struggle to control their wild new leader, the city explodes into chaos, and James' true character reveals itself in a way that will change each man forever.—BWR Public Relations",
    "name": "The Hurt Locker",
    "genres": [
        "Drama",
        "Thriller",
        "War"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZTcwYzczYjktN2Q3NS00NGJkLWI2MjAtNGRjOGRlYmQ4OWYwXkEyXkFqcGdeQXVyMTM1MDExOTE2._V1_QL75_UY281_CR5,0,190,281_.jpg"
}