{
    "filename": "Men-Who-Stare-at-Goats,-The_script.txt",
    "imdb_id": "tt1234548",
    "imdb_url": "https://www.imdb.com/title/tt1234548",
    "characters": [
        "Tim Kootz",
        "Bob Wilton",
        "Scotty Mercer",
        "Lyn Cassady",
        "Ron",
        "Todd Nixon",
        "Debora Wilton",
        "Brig. Gen. Dean Hopgood",
        "Larry Hooper",
        "Lt. Boone",
        "Maj. Gen. Holtz",
        "Dave (as Todd Latourrette)",
        "Mahmud Daash",
        "Bill Django",
        "Gus Lacey"
    ],
    "dialogues": {
        "Tim": "Ask Angela Lansbury.",
        "Kootz": "Ask Angela Lansbury.",
        "Bob": "In 1983, when Special Forces told General Putkin that they weren't interested in his ideas...that was a lie.  And when they told him they didn't have access to animals...that was also a lie.  The hundred goats in the disused hospital building had been secretly flown in from Central America so as to avoid customs. Special Forces weren't worried about the General hearing the goats because they'd been de- bleated.  This is the story of those goats.  My name is Bob Wilton. Imagine me back in Michigan, where I was born and raised. I studied journalism at Western in Kalamazoo and then I got a job at the Ann Arbor Daily Telegram. I wrote a lot of stories about competitive food eating contests.     This is Ron.  He's the man who died.  My wife, Debora, told me later that Ron's death had been like a wake-up call for her - what people used to call a memento mori.  That massive coronary had reminded her that life was too short to waste any chance of true happiness.  A week after the funeral she left me for my editor.       I was like a child. Or a Hobbit, safe in the Shire.  Or a blonde farm boy on a distant, desert planet, unaware that he was already taking the first steps on the path that will lead him inexorably towards the heart of a conflict between the forces of Good and Evil.  Had I known where that path would lead, had a soft wind from my future brought me the name of Bill Django, I might never have gone. But as it was, I did what so many men have done throughout history when a woman has broken their heart... I went to war.  Yeah, no it's been...well, I won't lie to you Debora - it's been pretty damn hairy.  Yeah, it's not, uh... I've seen things that you shouldn't, you know...  Pretty damn hairy.        Oh, that's, that's...  Okay. Gotta go. We're moving out - heading up north to cover the fighting there...  Yeah.     Yeah, I think they didn't want me going over because I'm not embedded.    What's that mean?     DeWitt Resources. Arkansas.  You over here for the conference? Looking for a contract right?  What's your pitch?  Bob Wilton.  Could I bum a smoke, Skip?  I sat there watching those reporters and realized I didn't want to be me anymore. I wanted to be them. I wanted to face peril and stand witness to the fall and rise of nations.  Everyone gets everything he wants. Like the man said. I wanted a mission.  (patting his pockets  And for my sins, Fate brought me one.     Right here?  Wandering?  So what have you seen lately?  Okay. Wow.  So...when did this all start for you Gus?  Right. I don't know who that is.  So what did you do in the army?        Wow. I don't know what to say.  Well, I've never owned a hamster Gus, so I don't know what...  Maybe some of the readers have hamsters so...  Yeah, I guess any hamster-owning readers will know what's aberrant behavior and, uh, what's...Oh, shit, he's down!  Oh my God! You've dropped both hamsters!  Well...it didn't die. I thought you said you killed it?  Who's the Skipper?  Do you...do you know a Gus Lacey?  Lyn?  Skip?  Lyn?  Whoa!  Hooper? No. I work for the Ann Arbor Daily Telegram.  I interviewed him a few years ago. He'd been appearing on this radio talk show.  He said he joined Bill Django's unit in the army and was trained to, to, uh remote view?  And he said the Loch Ness Monster was the ghost of a dinosaur. Who's Bill Django?  Yes.    But you're saying there was a secret unit?           Um...brown?  A Super Soldier?     You're a Jedi Warrior?  What does that...? I don't think     Hold on, let me...let me just...  Okay, so, so you're saying you were a Psychic Spy, like Lacey?  How does that work?  What about you?  Yeah?  Like who?           Actual invisibility?  Like camouflage?  I don't...can I be honest, Lyn? I don't know what to make of this. I don't know what to say. This is amazing stuff.  How would you...I wanna...could I write a story about this?  No, but see, I've been looking for a story Lyn. I was going to write about the re-build contracts but this...this is even better and  All I'm saying is we could talk some more tomorrow and...  You're going home?  Oh.     I could come with you, maybe, and...  No, listen, we could change names, stuff could stay off record and...  Well you know, you don't... I look after myself. Okay? I look after...And I've been in some pretty hairy situations before. I'm not, you know...I'm a journalist, Lyn. You understand?  A journalist. I go where the story is.  I was an American. I was Resolute. I wanted adversity to reveal my character to the world. And to my wife. And to that one-armed cunt Dave.  What? Nothing. I was just doodling.  What's the matter?            The Jedi Warrior will follow in the footsteps of the great Imagineers of the past - Jesus Christ, Lao Tse Tung, Walt Disney...     What's the sparkly eyes technique?  Okay.  I think so.  Lyn?  Who is this Bill Django?  Every single one of Bill's men fired high. They instinctively hadn't wanted to shoot another person. Later Bill would come across a study by General S.L.A Marshall, which revealed that only 15-20 percent of fresh soldiers shot to kill. The rest aimed high, didn't fire at all, or pretended to be busy doing something else.  Recovering in hospital, Bill wrote to General T.L Cornplow, Vice Chief of Staff for the Army, explaining that he wanted to go on a fact-finding mission to explore alternative combat tactics. The Pentagon agreed to pay his salary and expenses for the duration of the journey.  What Bill hadn't told the Pentagon was that he was really looking for the answer to the riddle of his vision. How could his men's gentleness, their general lack of interest in killing people, how could this be turned into a strength? How could love and peace help win wars? Bill knew where to go to find out.  Bill disappeared into the New Age Movement for six years.  Like all Shamen before him, he had traversed the wilderness. Now he was returning to his people, a changed man.  He brought with him his confidential report - The New Earth Army Manual.          The cone. Does it direct your psychic powers or something?  What does it do?  Yes.  But...  Nothing.  Well it's just...it's hard to believe the Pentagon paid for this. I mean, it's very interesting, but there's nothing in here that's actually about...fighting?  Non-lethals?         Stop it! Stop hurting me!  No!!!!!  I think it's officially night now.  Amongst Bill's audience that night was Brigadier General Dean Hopgood, from the Defense Intelligence Agency. For some time the General had been concerned about information he had been receiving about Soviet research into psychic powers.  According to some stories the Soviets were psychically spying on American bases and had designed \"psychotronic generators\" - machines capable of bombarding the President with negative energy.  They were also conducting sadistic experiments to see whether animals had psychic powers.  Could they, for instance, telepathically detect that their babies were distressed?  Two weeks later the Army adopted the slogan Be All You Can Be and appointed Bill Commander of the first New Earth Army Battalion.          I didn't...I thought...What are you doing?  What are you doing?  Really? Which one?  That one?  Isn't that one too far away?  Jesus Lyn. You had like the whole desert to drive in...       What's your record at this?     (scrambling to his  Can you help us? We drove into a rock. Could you take us to a town or someplace?      Hi! Hello there. Thanks so much for this.            We're going to die! I'm going to be killed by Al Qaeda!  Oh what the hell do you know? You don't know! You don't know anything! And this is all your fault!     How are we gonna stop them? There's three of them! And they've got guns!  What do you mean?     We haven't got a pen.  Oh...I don't want to Lyn.  I don't think I...there's sharp edges around here...  What's with the quotation fingers? That's like implying I'm you know...only capable of ironic attacking or...       Yes.  I don't know. I was pretty terrified anyway but the fear I felt on the run-up to the choking did seem, you know, unusual.           Uhuh.  You really don't work for DeWitts?     Oh. Okay.  And you're really on a mission out here?     Yes.  Do you really think so?  Yes. Yes I have.  Have you always had powers?  Why?  After years of feeling like an oddball Lyn had finally found a home. At last he was amongst men who prided themselves on being different.  These were Golden Days for Lyn. There was something so noble and pure in Bill's vision that the Jedis felt themselves inspired to be more than soldiers. In a world torn apart by greed and hate they would be a force for good, for peace.  For the first time in his life Lyn felt truly happy.  Then into the garden a serpent did come.  Larry Hooper was a failed Sci-Fi writer from Colorado, recruited to the Jedis after Brigadier General Hopgood met him at a spoon-bending party.  Right from the start he had made himself unpopular with the other Jedis.  Larry made it quite clear that he despised most of the other Jedis.  But Lyn - Lyn was different. He really hated Lyn.  After a year's training, Lyn was given his first tasking. A senior Nato General had been kidnapped by Red Brigade members in Italy. Bill was unofficially asked if his unit would be able to help find him before it was too late.  It's true that the unit never found out whether any of their remote viewings were accurate or not. Nevertheless from that moment on Lyn's reputation soared.  The word soon got out in the intelligence community that there was a sergeant at Fort Bragg who could find whatever you needed found. It was as if Lyn could fly anywhere in the world without leaving his room.  As Bill Django said - the Force truly was strong with this one.  Lyn?    Shit...shit...        Now at the time I thought Lyn was having some kind of fit here. Later I discovered what he was actually doing was performing the Echmeyer technique.  Ben Echmeyer was a Vietnam vet with sixty-three confirmed kills. He remains the only non-Korean to achieve the rank of Master in Kwa Ra Do. He was one of the Jedi teachers at Fort Bragg.  It was said he could have a tug of war with a dozen men and not move an inch.  He was also able to lift bags of sand on hooks hung through his scrotum.  Another demonstration involved letting a recruit drive a jeep over him. This, in the end, was to be his undoing.  Before his untimely death Ben caused quite a stir by advocating his controversial \"shock and awe\" knife attack method.  The approach was hailed by some knife aficionados as revolutionary but criticized by others who believed that the leaping and spinning might lead you to accidentally stab yourself.  Lyn Cassady, however, became a firm convert to the style.  Of course, Lyn didn't actually have a knife with him at this particular time...so I still think what he did was kinda...reckless.  (pulling his head  What happened?  Oh shit! Oh shit, they're coming!  Sounds good Muhammad.  Muhammad led us to his home which it turned out had been robbed in his absence.  And also accidentally set on fire by a US tank. Neighbors told him his wife had left, they weren't sure where she had gone.  I understood he was going     through a lot, but considering we     had saved him from kidnappers     I still thought his welcome could     have been a little warmer.  Lyn?  What are you thinking?  Lyn was thinking of Larry Hooper and the part he had played in the destruction of the New earth Army. But, in fairness, the Jedis' own eccentricities hadn't exactly won them many allies in the Army.  For example, there was Tim Kootz who, on being asked to ascertain the whereabouts of General Manuel Noriega, had replied...  Or there was the time Major General Gilling was visiting the base and saw Jedi trainee Clifford Hickox...  ...practising the ancient Sun Dance of the Sioux Nation.  The Jedis survived such minor scandals, protected, it was rumored, by a President who was a fan of both the Star Wars films and the paranormal himself. But then, one summer, a young, likeable Lieutenant called Norman Pendleton was recruited to the New Earth Army...  Larry Hooper wasted no time befriending the newcomer. Desperate to compete with Lyn, Larry had been doing research into the infamous CIA MK-ULTRA experiments which he believed could enhance his own psychic powers.  All he needed was a lab rat to try them out on, check if they were safe.  It turned out they weren't.  Norm's father, who it turned out was pretty high up in the Pentagon, wanted blood.  Although the Jedis were pretty sure Larry was responsible, nothing could be proved and when he was called to the disciplinary hearing Larry made sure to smear Bill with everything he could...  Brigadier General Hopgood resigned and died some years later. Bill received a dishonorable discharge.  After Bill left, Major Holtz of Special Forces took command of the Jedis.  And nothing was ever the same again.     Well?     Oh for the love of...Here...  What?  So? That's...  Well how the hell am I supposed to know?  You're the navigation expert here. You told me you could find the way.  Turns out you haven't even got a watch! Now what the hell are we...     Just...instant?    Oh, it's that way?  Right. Now you know.        Oh Jesus.  I can't believe this. Great fucking intuition Lyn. I can't...put me down. I can walk. Put me down.  Oh, Jeez. Oh, Jeez.  Where are we going? We should stay with the car so the army can find us.  Well, I disagree. I totally disagree. The Federal what?  What are you doing?    Jesus, it's hot. I'm so hot. Aren't you hot?  I can't breathe properly. I can't...Oh boy...  I think I'm bleeding to death.  If we'd stayed at the road we would be safe now! Now we've got no water, no food or, or... Will you forget about the fucking tantric currents?  Stop saying that! I just got blown up! I'm in the middle of a desert!    Wait a minute. That's west. Al Qaim's in that direction. We're going the wrong way.  Where?  Is that...is that...is that a joke? We've come six hundred miles and you don't know where we're going?  Who gave you the mission Lyn? Lyn?  What?     Oh Jesus. Oh Jesus Lyn. There's no mission? We're in the middle of the desert because you heard voices? There's no one here! There's no-one fucking here.  Lyn!  Is it the Crohns?  What's the matter with you?  What curse?  Who destroyed it?  When the dust of the Pendleton Affair had settled it revealed a surprising victor.  Major Holtz regarded Larry Hooper as a patriotic whistle-blower and the one sound fruit in an otherwise dubious barrel of apples.  Goat Lab was originally created as a clandestine laboratory to provide in-the-field surgical training for Special Forces soldiers.  The goats would get shot in the leg with a bolt gun and then a trainee would have to dress the wound successfully. Goat lab actually used to be called Dog Lab...  But it turned out most soldiers didn't feel good shooting dogs in the leg...  ...whereas the army had long felt fine about doing stuff to goats - even testing atomic weapons on them.  Huh?  So, it's not that the goat fought back?  But...that was it?  Lyn said he had no intention of killing the goat.  Collateral damage?  The silence of the goats.  But before he could leave Larry arranged one last parting gift.  The Dim Mak?  What does the Death Touch do?  Jesus.  Then and there?  Lyn?      Lyn!  I don't think we should...  Psy for psychic?     If this is Psyops what are you doing here?  \"Sick?\"  There's a subliminal message in this?     What are you going to do?  Lyn? What are you going to do?  Oh, you're not dying! I don't believe you can kill someone with a mail order Dim Sum. You can't...  Whatever. I don't believe you can just...  ...just tap someone and ...it... What?  I think you should go and see Lyn, sir.  he needs you.  The man crossed a desert to see you again.  You know, he told me all these stories about Bill Django, and I was pretty excited to meet you, but I've gotta tell you...you're one big disappointment.  He told me to give you that back. I don't know why. Its supposed to be a mark of honour isn't it? I don't see how you deserve that.  What isn't?        Bill? Bill are you okay?        Don't eat the jello.  We put LSD in the jello.  Bill showed me where Larry had bottles of LSD. So we put it in the jello mix last night.  What?  But...we've drunk the water.        At the time I was hurt that Lyn hadn't taken me with him. But now I know it was because he and Bill had already seen what was to come.  Nobody knows exactly what happened. The official story is that their helicopter must have crashed, either because they were hit by an RPG or because...well, that's what happens when you fly a helicopter while you're tripping on acid. All I know is they've never been seen since. Like all Shaman they returned to the sky.  When I got back home I wrote the story up. Everything.       I sent it to the newspapers, the radio stations, the TV stations, because that was what Lyn wanted me to do. The people needed to know.       I was ready for whatever they would do to me. I was ready to disappear. I was ready to go to prison. I was a Jedi and I was fighting for the New Earth Army.  But they didn't put me in prison. They did something much worse.  That was it. That was the only bit of my story that ran anywhere. And it was a joke. And if I ever needed proof of how the Dark Side have taken the beautiful dream of what a nation could be and had twisted it, destroyed it, that was it.  Bob?  But I won't stop. I won't give up.  Because when I look at what is happening in the world, I know that now, more than ever, we need to become ALL that we can BE.  Now, more than ever, we need the Supermen.",
        "Wilton": "",
        "Scotty": "It's...it's something cylindrical? I think it's a pencil?",
        "Mercer": "",
        "Lyn": "Bob straightens from lighting his cigarette, stares at Lyn.  You working for Hooper?  How do you know about Lacey?  Little prick...what'd he tell you?  (shaking his head in  (walking off down the     We...don't...divulge.     Okay. Let me ask you something. What color were the chairs in the hotel bar?  You were in there for hours. What color were the chairs?  They were green. How many lights are there in this room?  A Super Soldier wouldn't need to look. He would just know.  A Jedi Warrior. He would know where all the lights were. He could walk through a room and tell you how many power outlets there were. People are walking around with their eyes closed. At Level One we were trained to instantly absorb all details.  You're looking at one.  That's correct.         Soldiers with Super Powers. We were the first generation of the New Earth Army.  That's correct.  We prefer the term Remote Viewer.  Different Jedi had different techniques. Mel Landau used to visualize packing all his cares and worries in a little suitcase, to clear his mind. Steve Cuttle used to read Bible verse...  Well, I find drinking helps. Also if I'm listening to classic rock music.  I like Boston. Boston usually works.  Invisibility.  Yup. That was Level Three.  Well...yeah, that was the goal. But after a while we adapted it to just finding a way of not being seen. When you understand the, the linkage between observation and reality, you learn to dance with invisibility.  It's not like camouflage. We also practised Phasing. Crossing from particle to wave, from the physical realm to the plane of energy. Solid objects seem to pass right through you. It's starts with a breathing exercise...  Then you think black. That's the nothingness.  Not going to happen.  Not going to happen.  I'm shipping out tomorrow.  Going to Iraq. There's this factory we might be partnering with in Al Qaim.     Bob, I don't want to be a story, okay? I don't need the attention and...  It's a war over there Bob. Okay? A war. I can't be looking out for you.  What's this?        You wanted to know who Bill Django was?  He's the man who wrote that book.  You see it?  Yeah?  I don't know where to begin.  Bill always said it started for him when he fell out of a helicopter in Vietnam.  What?  No.  It cooks supper.  Solar. Utilizing the power of the universe - no pollution, totally renewable. This is like New Earth Army technology.  Pretty mind-blowing, isn't it? First time I read it, I was like...what the fuck?  What?  Go on - what?  The New Earth Army was tasked with preventing conflict. We're a force of peace, not war. Bill realized if you want to change the world, you've got to start by changing the armies. He was the one that started the research into non- lethals.  Check this out.  The Predator.  You see? You're mine now. The Predator is completely biodegradable. It's friendly to the earth but it can hurt you in a hundred ways.  It has warrior functions. And it looks a bit funny. This is New Earth Army technology.  I bought it on line. What's cool about it is that you could see this lying on the ground and you'd never know it had such lethality.  Eyeballs.      )  Sometimes there's a need, Bob. Sometimes people are calling out for something, even if they don't know it themselves. And then a man like Bill appears out of nowhere, because he heard the call....  What?  Salute to the Sun.  Okay. We're Oscar Mike. (Getting up) That's \"On the Move\" soldier.  Cloud bursting. Keeps me in shape.     No. That one. The big one.  They're all far away.  And it's gone.  Yeah. I'm sorry about that Bob. Must have got a little bi- locational there, you know? But don't worry. Someone'll come along soon.  Heads.  Heads.  Two hundred and sixty four. Tails.      I don't think they're Al Qaeda.  Bob, there's something I have to tell you. When I said I was retired from the unit, that was a lie. I'm on a mission. DeWitts was just my cover. I've been reactivated. I couldn't tell you because this is a Black Op, but...I think you have a part to play. I think that's why you're with me.  Have you heard of Optimum Trajectory before? Your life is like a river, Bob. If you're aiming for a goal that isn't your destiny, you will always be swimming against the current. Young Ghandi wants to be a stock-car racer? Not gonna happen. Little Anne Frank wants to be a High School teacher. Tough titty Anne. That's not your destiny. But you will go on to move the hearts and minds of millions. Find out what your destiny is and the river will carry you. Now sometimes events in life give an individual clues as to where their Destiny lies.  Like those doodles you just \"happened\" to draw?  This is the Ajna chakra - the third eye - the symbol of the Jedi. When I saw you'd drawn it...well, the Universe gives me a sign like that, I don't ignore it. You're meant to be here with me, Bob. The Jedi inside you sensed that.  Now listen to me. I don't think these guys are FRL's or Mehdi Army... I think we're talking standard criminals here, okay? What they're gonna do is try and sell us on to another group. We can't let that happen.  We're Jedi, Bob. The Jedi don't fight with guns. We fight with our minds.  Let's say we have no choice but to fight with these men. Then we use visual aesthetics to instill psychically in the enemy a disincentive to attack.  Okay, you lock eyes with one of them, you go into a monotone and you say \"No, I'm not going to attack you.\" You totally relax your body and your voice. And then you rip out one of his eyeballs.  Or you use a pen, stab him in the neck, create a fountain of blood, I mean really a fountain, get the blood to squirt on his buddies. That's a psychic disincentive, right there.     Choke me.  Choke me. What am I gonna do? Just here. Choke. Choke.  C'mon...(making quotation marks with his fingers) \"Attack me.\"  Quit jawing, Bob, and choke me.  I'm going to interrupt your thought pattern.  See? I hardly moved. Physics wise there's not much going on. It's the psychic energy that's important.  You okay?    Would you say that level of fear was abnormal for you?     That's okay. You learnt a lesson. \"Whatever you fear most has no power - it is your fear that has power.\"  Oprah.  Just my cover.  No. I do run a dance school. I love dance.  In time, Bob.  We learn to recognize our own kind after a while. You ever dream about flying?  That's one of the signs.  Don't you? Haven't you always really felt you were different?  That's the way it is for us. We're the ones who don't fit in as kids.  Kind of. They used to call me the Jinx.     Lyn Cassady sir.  Opelousas, Louisiana, sir.     Stop acting so fucking QUEER!  It's a man on a chair.        Don't move Bob.  Let's hope it doesn't come to that.  You can put your weapon away. You're not interested in us.     (to the Iraqi,  Ben, you're not forgotten. The knife you gave me lies next to my beret. God bless Ben Echmeyer.  There he is.  (yelling over the  Oh crap!      Sir? Are you okay?  Bob, give me a hand here will you?       Right.  What is this?  They're really good.  I'm very sorry for running you over, sir.     Not your fault sir. I mean we get kidnappers in America too, so...you know. There's always, uh, bad apples, right?     Did I say it wrong?  What?  Just Mahmud. People try to build something of their lives, something lasting, something good... but there's always someone wants to smash it up...  I really appreciate this sir.  Bedouins have been navigating this desert for centuries without maps. You can use a wrist-watch in conjunction with the sun.  What?  I haven't got a watch.  This is a digital watch, Bob.  So you need a watch with hands for Christ's sake!  Will, if you'd just be quiet for a...  Will you shut up? I don't need a watch. I'm using Level Two.  Level Two. Intuition. We were trained to make correct decisions. Somebody runs up to you and says \"There's a fork in the road. Do we turn left or do we turn right? And you go... \"We go right!\"  Instant. Just like that.       Improvised Explosive Device.  You're okay Bob. It's gonna be okay.  Alright, c'mon...  Fedayeen will find us first.  Fedayeen Saddam. Paramilitary. Fellas who probably laid the IED. They could be on their way now. Hold this Bob.  Could be IED's or mines around here. I'm checking for disturbances in the telluric current.    You're okay.  You're not bleeding to death, Bob. It's shock, okay? It's just the shock. It'll pass. You're gonna be okay.     Bob, you're suffering from shock. If you start panicking now your heart's gonna stop.  The mission isn't in Al Qaim. It's somewhere near Al Qaim.     If the exact whereabouts of the Target was known it wouldn't take a Jedi to find them, would it?  Bill did.  Bill did. He appeared in my trailer two months ago. A psychic projection. I could hear him calling my name.  He needed me.  I don't have Crohns.  I'm dying.  I've been murdered.  It's gone Bob. I can't find him. I've lost my power. It's the curse.  (With profound  I did.  This was the real deal, Bob. I was at the Gateway. Afterwards I realized I'd got injured.  Sympathetic injury I guess. I was bruised all over.     I wish it was. Hooper told Holtz we should try the experiment again. Only this time they said...kill the goat.  There was no way! What had the goat ever done to me? It was totally against the way of the Jedi. I was just going to pretend to try so they would say, \"okay - it can't be done\" and forget about it. But then, as I sat there, I felt this, this pulse start inside of me and...I couldn't stop it.  You know what I keep thinking?     ...as he stares, concentrating.  Maybe deep down inside some dark part of me wanted to see if I could do it?       I finished my tour and I quit. I walked out of the unit and I never went back.  What do you wan...?  What the hell?  It was the Dim Mak.  The Dim Mak. The Quivering Palm. The Death Touch. It's like this legendary, martial arts move. It was forbidden in the New Earth Army. Larry had got it from a mail- order book.    There's a story that Wong Wifu, great Chinese martial artist, had a fight with some guy and had him beat when the guy gave him this light tap, and Wong looked at him and the guy just nodded. That was it. He'd given him the death touch and Wong died.  No. Eighteen years later. That's the weird thing with Dim Mak - you never know when it's going to take effect.     This is Bob.  I remote viewed you.    An IRAQI PRISONER sits huddled in the cell, illuminated in the flashes of a powerful STROBE LIGHT OVERHEAD.  It's the Dark Side.  It's too late...I'm dying, Bob.  Dim Mak.  It's cancer.  I mean, I know it was caused by the Dim Mak. But...it's...you know...it's cancer. That's what the doctors say. Different ways of looking at...different names for a reality or, or uh...  I shouldn't have come Bob. Shouldn't have come.  ...Give this back to Bill...I don't deserve it.     I told you. I remote viewed you.  No.  I haven't seen Scotty.  Carry my body through space and time. You are my connection to the Universe...  ...and all that comes after. I am yours and you are mine.  I salute you.     What's going on?  What?       We're very sorry. Ma'assalama.      (Over the sound of",
        "Cassady": "You working for Hooper?  How do you know about Lacey?  Little prick...what'd he tell you?  (shaking his head in  (walking off down the     We...don't...divulge.  Okay. Let me ask you something. What color were the chairs in the hotel bar?  You were in there for hours. What color were the chairs?  They were green. How many lights are there in this room?  A Super Soldier wouldn't need to look. He would just know.  A Jedi Warrior. He would know where all the lights were. He could walk through a room and tell you how many power outlets there were. People are walking around with their eyes closed. At Level One we were trained to instantly absorb all details.  You're looking at one.  That's correct.         Soldiers with Super Powers. We were the first generation of the New Earth Army.  That's correct.  We prefer the term Remote Viewer.  Different Jedi had different techniques. Mel Landau used to visualize packing all his cares and worries in a little suitcase, to clear his mind. Steve Cuttle used to read Bible verse...  Well, I find drinking helps. Also if I'm listening to classic rock music.  I like Boston. Boston usually works.  Invisibility.  Yup. That was Level Three.  Well...yeah, that was the goal. But after a while we adapted it to just finding a way of not being seen. When you understand the, the linkage between observation and reality, you learn to dance with invisibility.  It's not like camouflage. We also practised Phasing. Crossing from particle to wave, from the physical realm to the plane of energy. Solid objects seem to pass right through you. It's starts with a breathing exercise...  Then you think black. That's the nothingness.  Not going to happen.  Not going to happen.  I'm shipping out tomorrow.  Going to Iraq. There's this factory we might be partnering with in Al Qaim.     Bob, I don't want to be a story, okay? I don't need the attention and...  It's a war over there Bob. Okay? A war. I can't be looking out for you.  What's this?        You wanted to know who Bill Django was?  He's the man who wrote that book.  You see it?  Yeah?  I don't know where to begin.  Bill always said it started for him when he fell out of a helicopter in Vietnam.  What?  No.  It cooks supper.  Solar. Utilizing the power of the universe - no pollution, totally renewable. This is like New Earth Army technology.  Pretty mind-blowing, isn't it? First time I read it, I was like...what the fuck?  What?  Go on - what?  The New Earth Army was tasked with preventing conflict. We're a force of peace, not war. Bill realized if you want to change the world, you've got to start by changing the armies. He was the one that started the research into non- lethals.  Check this out.  The Predator.  You see? You're mine now. The Predator is completely biodegradable. It's friendly to the earth but it can hurt you in a hundred ways.  It has warrior functions. And it looks a bit funny. This is New Earth Army technology.  I bought it on line. What's cool about it is that you could see this lying on the ground and you'd never know it had such lethality.  Eyeballs.      )  Sometimes there's a need, Bob. Sometimes people are calling out for something, even if they don't know it themselves. And then a man like Bill appears out of nowhere, because he heard the call....  What?  Salute to the Sun.  Okay. We're Oscar Mike. (Getting up) That's \"On the Move\" soldier.  Cloud bursting. Keeps me in shape.     No. That one. The big one.  They're all far away.  And it's gone.  Yeah. I'm sorry about that Bob. Must have got a little bi- locational there, you know? But don't worry. Someone'll come along soon.      I don't think they're Al Qaeda.  Bob, there's something I have to tell you. When I said I was retired from the unit, that was a lie. I'm on a mission. DeWitts was just my cover. I've been reactivated. I couldn't tell you because this is a Black Op, but...I think you have a part to play. I think that's why you're with me.  Have you heard of Optimum Trajectory before? Your life is like a river, Bob. If you're aiming for a goal that isn't your destiny, you will always be swimming against the current. Young Ghandi wants to be a stock-car racer? Not gonna happen. Little Anne Frank wants to be a High School teacher. Tough titty Anne. That's not your destiny. But you will go on to move the hearts and minds of millions. Find out what your destiny is and the river will carry you. Now sometimes events in life give an individual clues as to where their Destiny lies.  Like those doodles you just \"happened\" to draw?  This is the Ajna chakra - the third eye - the symbol of the Jedi. When I saw you'd drawn it...well, the Universe gives me a sign like that, I don't ignore it. You're meant to be here with me, Bob. The Jedi inside you sensed that.  Now listen to me. I don't think these guys are FRL's or Mehdi Army... I think we're talking standard criminals here, okay? What they're gonna do is try and sell us on to another group. We can't let that happen.  We're Jedi, Bob. The Jedi don't fight with guns. We fight with our minds.  Let's say we have no choice but to fight with these men. Then we use visual aesthetics to instill psychically in the enemy a disincentive to attack.  Okay, you lock eyes with one of them, you go into a monotone and you say \"No, I'm not going to attack you.\" You totally relax your body and your voice. And then you rip out one of his eyeballs.  Or you use a pen, stab him in the neck, create a fountain of blood, I mean really a fountain, get the blood to squirt on his buddies. That's a psychic disincentive, right there.     Choke me.  Choke me. What am I gonna do? Just here. Choke. Choke.  C'mon...(making quotation marks with his fingers) \"Attack me.\"  Quit jawing, Bob, and choke me.  I'm going to interrupt your thought pattern.  See? I hardly moved. Physics wise there's not much going on. It's the psychic energy that's important.  You okay?    Would you say that level of fear was abnormal for you?     That's okay. You learnt a lesson. \"Whatever you fear most has no power - it is your fear that has power.\"  Oprah.  Just my cover.  No. I do run a dance school. I love dance.  In time, Bob.  We learn to recognize our own kind after a while. You ever dream about flying?  That's one of the signs.  Don't you? Haven't you always really felt you were different?  That's the way it is for us. We're the ones who don't fit in as kids.  Kind of. They used to call me the Jinx.     Lyn Cassady sir.  Opelousas, Louisiana, sir.     It's a man on a chair.        Don't move Bob.  Let's hope it doesn't come to that.  You can put your weapon away. You're not interested in us.     (to the Iraqi,  Ben, you're not forgotten. The knife you gave me lies next to my beret. God bless Ben Echmeyer.  There he is.  (yelling over the  Oh crap!      Sir? Are you okay?  Bob, give me a hand here will you?       Right.  What is this?  They're really good.  I'm very sorry for running you over, sir.     Not your fault sir. I mean we get kidnappers in America too, so...you know. There's always, uh, bad apples, right?     Did I say it wrong?  What?  Just Mahmud. People try to build something of their lives, something lasting, something good... but there's always someone wants to smash it up...  I really appreciate this sir.  Bedouins have been navigating this desert for centuries without maps. You can use a wrist-watch in conjunction with the sun.  What?  I haven't got a watch.  This is a digital watch, Bob.  So you need a watch with hands for Christ's sake!  Will, if you'd just be quiet for a...  Will you shut up? I don't need a watch. I'm using Level Two.  Level Two. Intuition. We were trained to make correct decisions. Somebody runs up to you and says \"There's a fork in the road. Do we turn left or do we turn right? And you go... \"We go right!\"  Instant. Just like that.       Improvised Explosive Device.  You're okay Bob. It's gonna be okay.  Alright, c'mon...  Fedayeen will find us first.  Fedayeen Saddam. Paramilitary. Fellas who probably laid the IED. They could be on their way now. Hold this Bob.  Could be IED's or mines around here. I'm checking for disturbances in the telluric current.    You're okay.  You're not bleeding to death, Bob. It's shock, okay? It's just the shock. It'll pass. You're gonna be okay.     Bob, you're suffering from shock. If you start panicking now your heart's gonna stop.  The mission isn't in Al Qaim. It's somewhere near Al Qaim.     If the exact whereabouts of the Target was known it wouldn't take a Jedi to find them, would it?  Bill did.  Bill did. He appeared in my trailer two months ago. A psychic projection. I could hear him calling my name.  He needed me.  I don't have Crohns.  I'm dying.  I've been murdered.  It's gone Bob. I can't find him. I've lost my power. It's the curse.  (With profound  I did.  This was the real deal, Bob. I was at the Gateway. Afterwards I realized I'd got injured.  Sympathetic injury I guess. I was bruised all over.     I wish it was. Hooper told Holtz we should try the experiment again. Only this time they said...kill the goat.  There was no way! What had the goat ever done to me? It was totally against the way of the Jedi. I was just going to pretend to try so they would say, \"okay - it can't be done\" and forget about it. But then, as I sat there, I felt this, this pulse start inside of me and...I couldn't stop it.  You know what I keep thinking?  Maybe deep down inside some dark part of me wanted to see if I could do it?    I finished my tour and I quit. I walked out of the unit and I never went back.  What do you wan...?  What the hell?  It was the Dim Mak.  The Dim Mak. The Quivering Palm. The Death Touch. It's like this legendary, martial arts move. It was forbidden in the New Earth Army. Larry had got it from a mail- order book.    There's a story that Wong Wifu, great Chinese martial artist, had a fight with some guy and had him beat when the guy gave him this light tap, and Wong looked at him and the guy just nodded. That was it. He'd given him the death touch and Wong died.  No. Eighteen years later. That's the weird thing with Dim Mak - you never know when it's going to take effect.     This is Bob.  I remote viewed you.    It's the Dark Side.  It's too late...I'm dying, Bob.  Dim Mak.  It's cancer.  I mean, I know it was caused by the Dim Mak. But...it's...you know...it's cancer. That's what the doctors say. Different ways of looking at...different names for a reality or, or uh...  I shouldn't have come Bob. Shouldn't have come.  ...Give this back to Bill...I don't deserve it.     I told you. I remote viewed you.  No.  I haven't seen Scotty.     What's going on?  What?       We're very sorry. Ma'assalama.      (Over the sound of",
        "Ron": "",
        "Todd": "",
        "Nixon": "Then I say \"There it is. The Future!\"  We play this on these big screens at the conferences, you know? This trumpet music blasting out. Every time I see it, it gets me.  You a businessman, sir?  Yeah, Ali Babas have been targeting locals lately.(Holding out his hand) Todd Nixon, Army Small Business Office.  Ask me what business I'm in, Muhammad.  Right now, I'm in the Quality of Life business.         We're not gonna rest until there's a satellite dish on every one of    (cheerfully, out of  (muttering to  Trying to help you fucking savages.",
        "Debora": "(over phone, not as  Well I don't even know why you're there. You're not exactly war correspondent material are you?    Yeah. He says Hi.",
        "Larry": "Congratulations Scotty. I'm sorry it doesn't work out for you two.  This is Larry's Spirit Guide, Maud. I'm looking into the cupboard now and I'm seeing...I'm seeing...a tin mug?     ...cowering terrified under the couch, as the sound of GUNSHOTS fill the room. Norm's NAKED LEGS stride past him.  ...looking every inch the neat, professional soldier.  Lieutenant Colonel Django used funds from the project's black budget to procure prostitutes...  ...and also drugs for himself and his men.  It's some scientific research I've done for possible offensive psi applications sir.  I did show the report to Lieutenant Colonel Django, but he didn't seem interested.    Well sir...there is goat lab?  Oh good...  ...the gang's all here.  This is primarily a Psyops base.     Oh, that's an Iraqi Psyops leaflet they dropped on us.  Yeah, hadn't exactly done their homework there.  How'd you find us, Lyn?  I said primarily Psyops. This is a restricted area, you understand? Everything you hear and see stays secret or you go to prison.  There are individuals in the current administration who are looking for...creative solutions for the War on Terror.  They're far more open minded then their predecessors, and they've out-sourced experimental research to my company.  It's pronounced psi-ike. Psychic Systems International Corp. Turns out certain people had heard about the New Earth Army and were interested in some of the work we were doing back then. They got in touch with me, I got in touch with Bill.  Bill's been looking into subliminal messaging. (Selecting a disc) This is one we've designed to play to our own troops before combat.    Air bag mine. Non-lethal mine, catapults the fucker up into air. Gimme another one.  Excellent. Attack Bees. The Forces of Nature! Another.  We're not doing that anymore!  Idiot!  The point is we've got a budget, we've got supporters. I'm rebuilding the New Earth Army. Only this time without the hippy crap.  You okay Bill?  You get the odd flash of what he used to be but... he's pretty burnt out with the booze.  Ooo, Twizzlers.      Oh. Didn't mean to wake you.  Heard you weren't feeling well?  How'd you find us?     Yeah, he did. We told Scotty we were coming over here, asked him if he wanted some work.  That's funny, because he told me he'd run into you and mentioned that there might be some jobs going with us over here. Isn't that why you came, really, Lyn? You want back in, don't you?  It can happen. You've only got to say the word. Could be the new Golden Age for Psi research.  You, me and Bill, back together again. Just like the old days.  Mother Earth, my life support system. As a soldier I must drink your blue water, live inside your red clay and eat your green skin.  I pray my boots will always kiss your face and my footsteps match your heartbeat.  Carry my body through space and time. You are my connection to the Universe...  ...and all that comes after. I am yours and you are mine.  I salute you.      Wow. I'm hungry.",
        "Hooper": "Congratulations Scotty. I'm sorry it doesn't work out for you two.  This is Larry's Spirit Guide, Maud. I'm looking into the cupboard now and I'm seeing...I'm seeing...a tin mug?     Lieutenant Colonel Django used funds from the project's black budget to procure prostitutes...  ...and also drugs for himself and his men.  It's some scientific research I've done for possible offensive psi applications sir.  I did show the report to Lieutenant Colonel Django, but he didn't seem interested.    Well sir...there is goat lab?  Oh good...  ...the gang's all here.  This is primarily a Psyops base.     Oh, that's an Iraqi Psyops leaflet they dropped on us.  Yeah, hadn't exactly done their homework there.  How'd you find us, Lyn?  I said primarily Psyops. This is a restricted area, you understand? Everything you hear and see stays secret or you go to prison.  There are individuals in the current administration who are looking for...creative solutions for the War on Terror.  They're far more open minded then their predecessors, and they've out-sourced experimental research to my company.  It's pronounced psi-ike. Psychic Systems International Corp. Turns out certain people had heard about the New Earth Army and were interested in some of the work we were doing back then. They got in touch with me, I got in touch with Bill.  Bill's been looking into subliminal messaging. (Selecting a disc) This is one we've designed to play to our own troops before combat.    Air bag mine. Non-lethal mine, catapults the fucker up into air. Gimme another one.  Excellent. Attack Bees. The Forces of Nature! Another.  We're not doing that anymore!  Idiot!  The point is we've got a budget, we've got supporters. I'm rebuilding the New Earth Army. Only this time without the hippy crap.  You okay Bill?  You get the odd flash of what he used to be but... he's pretty burnt out with the booze.  Ooo, Twizzlers.      Oh. Didn't mean to wake you.  Heard you weren't feeling well?  How'd you find us?     Yeah, he did. We told Scotty we were coming over here, asked him if he wanted some work.  That's funny, because he told me he'd run into you and mentioned that there might be some jobs going with us over here. Isn't that why you came, really, Lyn? You want back in, don't you?  It can happen. You've only got to say the word. Could be the new Golden Age for Psi research.  You, me and Bill, back together again. Just like the old days.  Mother Earth, my life support system. As a soldier I must drink your blue water, live inside your red clay and eat your green skin.  I pray my boots will always kiss your face and my footsteps match your heartbeat.      Wow. I'm hungry.",
        "Lt.": "",
        "Boone": "Yes General?  Yes sir.",
        "Mahmud": "My house is not far. We could walk from here.  Mahmud.     Taameeyah.  It was an accident.  I apologize for the kidnappers.  No...that was right.",
        "Daash": "My house is not far. We could walk from here.  Mahmud.  Taameeyah.  It was an accident.  I apologize for the kidnappers.  No...that was right.",
        "Bill": "Oh, man...    Will you knock it off? (Climbing to his feet) Jesus. What do you think...?  (trying to free his  Well!?  What the fu...! Why isn't anyone firing?    I'd like us to begin this with a mantra. If we could all breathe in and then out, holding a long \"eeeeee.\"  Breathe in... and out...  We are a Hollow Army, gentlemen. Vietnam has crushed our soul. We are traumatized and melancholic. We are ashamed. That is why I have brought you to this place of Sanctuary. Here we can mend our wounds and dream our dreams. My dream is of an America that will lead the world to paradise, an America that no longer has an exploitative view of natural resources, that no longer promotes consumption at all costs. I believe this is America's destiny.  But to achieve it we must become the first Superpower to develop super powers. We must create Warrior Monks - men and women who can fall in love with everyone, sense plant auras, pass through walls, stop saying mindless cliches and see into the future. I want you to JOIN me in this vision.  Be ALL you can BE.  I am Lieutenant Colonel Bill Django. From now on, you will speak only when spoken to, and the first and last words out of your mouth will be \"Sir, yes, sir!\" Do you understand?  If you complete this course you will be a Psychic Weapon, an Angel of Death, our enemies Worst Nightmare! Until then you are Nothing! Less than Nothing! Do you understand?       Okay! Give it everything you've got! That's it!  What's your name son?  Where you from?  Tough place to grow up?  You've gotta free your feet before you can free your mind, Lyn.  But that isn't true is it Lyn? You can dance. It's just someone told you not to.  Well, I'm your commanding officer Lyn, and I'm ordering you to let the dance out!  C'mon goddamit! DANCE! Let it go! Let it all go!          Okay, only when you're ready.        Okay. Larry?  Lyn?  Bravo Zulu, Lyn. Outstanding.  Aikido is a vehicle for harmonizing ourselves with the Universe and the Way. Look upon these sessions as an opportunity to discover yourself and your training partner in a loving environment.  (addressing the  (without looking at  Rank, medals...these things mean little to the Jedi. But growth in spirit, in wisdom, in psychic power, these things earn our respect.  Native Americans believed that when one received an Eagle feather, it was the mark of love, of gratitude and ultimate respect. Only true Human Beings may carry the Eagle feather.     And?      That's a lie!  That's a... Well the hooker thing is definitely a lie!  Continue the work, Lyn. The World needs the Jedis, now more than ever.  Hello Lyn.  Hello Bob.       The feather. Twenty thousand dollar fine for taking an eagle feather. This one's off a turkey. You just die the tip black. Don't tell Lyn.  None of it was real.  I just saw Timothy Leary.  I know. He's had an idea.         I put it in the main water tank as well.     That might have aroused suspicion. But don't worry. Over the years I have built up a massive tolerance to all narcotics.  In the name of the New Earth Army and loving people everywhere I'm liberating this base!",
        "Django": "Oh, man...    Will you knock it off? (Climbing to his feet) Jesus. What do you think...?  (trying to free his  Well!?  What the fu...! Why isn't anyone firing?    I'd like us to begin this with a mantra. If we could all breathe in and then out, holding a long \"eeeeee.\"  Breathe in... and out...  We are a Hollow Army, gentlemen. Vietnam has crushed our soul. We are traumatized and melancholic. We are ashamed. That is why I have brought you to this place of Sanctuary. Here we can mend our wounds and dream our dreams. My dream is of an America that will lead the world to paradise, an America that no longer has an exploitative view of natural resources, that no longer promotes consumption at all costs. I believe this is America's destiny.  But to achieve it we must become the first Superpower to develop super powers. We must create Warrior Monks - men and women who can fall in love with everyone, sense plant auras, pass through walls, stop saying mindless cliches and see into the future. I want you to JOIN me in this vision.  Be ALL you can BE.  I am Lieutenant Colonel Bill Django. From now on, you will speak only when spoken to, and the first and last words out of your mouth will be \"Sir, yes, sir!\" Do you understand?  If you complete this course you will be a Psychic Weapon, an Angel of Death, our enemies Worst Nightmare! Until then you are Nothing! Less than Nothing! Do you understand?       Okay! Give it everything you've got! That's it!  What's your name son?  Where you from?  Tough place to grow up?  You've gotta free your feet before you can free your mind, Lyn.  But that isn't true is it Lyn? You can dance. It's just someone told you not to.  Well, I'm your commanding officer Lyn, and I'm ordering you to let the dance out!  C'mon goddamit! DANCE! Let it go! Let it all go!          Okay, only when you're ready.        Okay. Larry?  Lyn?  Bravo Zulu, Lyn. Outstanding.  Aikido is a vehicle for harmonizing ourselves with the Universe and the Way. Look upon these sessions as an opportunity to discover yourself and your training partner in a loving environment.  (addressing the  (without looking at  Rank, medals...these things mean little to the Jedi. But growth in spirit, in wisdom, in psychic power, these things earn our respect.  Native Americans believed that when one received an Eagle feather, it was the mark of love, of gratitude and ultimate respect. Only true Human Beings may carry the Eagle feather.     And?      That's a lie!  That's a... Well the hooker thing is definitely a lie!  Continue the work, Lyn. The World needs the Jedis, now more than ever.  Hello Lyn.  Hello Bob.       The feather. Twenty thousand dollar fine for taking an eagle feather. This one's off a turkey. You just die the tip black. Don't tell Lyn.  None of it was real.  I just saw Timothy Leary.  I know. He's had an idea.         I put it in the main water tank as well.     That might have aroused suspicion. But don't worry. Over the years I have built up a massive tolerance to all narcotics.  In the name of the New Earth Army and loving people everywhere I'm liberating this base!",
        "Gus": "This is the home learning course we're putting out, which is very popular.     Then there's the seminars. When I'm not teaching I spend a lotta time, right here, remote viewing.  The kitchen table. That is correct. That's where my body is. But my mind...that's, you know...  Wandering. Roaming. Yeah.  Lately I've been watching the Loch Ness Monster in Scotland, England - which it turns out is the ghost of a dinosaur. That's an exclusive for you.  It started when I was a kid. I used to lie on my bed and RV my cousin, Irene, undressing at night. Then, when I was in the army I joined Bill Django's unit. He trained me and the rest, as they say...  I can't really talk about Bill.  We were Psychic Spies mainly. That was our initial tasking but...once they realized what they were sitting on, the forces at work...  We were trained to kill animals.  With our minds. That is correct. Just by staring at them.  One of our unit stopped the heart of a goat.  The power they unlocked in us... Last week I killed my hamster.  You wanna see?  You ever seen a hamster do that before?  Look at the way it's glaring at its wheel. Usually that hamster loves its wheel.  Good. Then they'll know how rare that is.  Yeah, he's down. At this point I'd been staring at him for about three hours.  No, the other one's just fallen over.  (switching off the     This was nothing. You should have seen the Skipper at work.  Lyn Cassady. After Bill he was the most psi-gifted guy I ever met. He was like an Occultic force. I think he runs a dance studio now.  Did he show you his \"Home Study Course\"?",
        "Lacey": "This is the home learning course we're putting out, which is very popular.     Then there's the seminars. When I'm not teaching I spend a lotta time, right here, remote viewing.  The kitchen table. That is correct. That's where my body is. But my mind...that's, you know...  Wandering. Roaming. Yeah.  Lately I've been watching the Loch Ness Monster in Scotland, England - which it turns out is the ghost of a dinosaur. That's an exclusive for you.  It started when I was a kid. I used to lie on my bed and RV my cousin, Irene, undressing at night. Then, when I was in the army I joined Bill Django's unit. He trained me and the rest, as they say...  I can't really talk about Bill.  We were Psychic Spies mainly. That was our initial tasking but...once they realized what they were sitting on, the forces at work...  We were trained to kill animals.  With our minds. That is correct. Just by staring at them.  One of our unit stopped the heart of a goat.  The power they unlocked in us... Last week I killed my hamster.  You wanna see?  You ever seen a hamster do that before?  Look at the way it's glaring at its wheel. Usually that hamster loves its wheel.  Good. Then they'll know how rare that is.  Yeah, he's down. At this point I'd been staring at him for about three hours.  No, the other one's just fallen over.  (switching off the     This was nothing. You should have seen the Skipper at work.  Lyn Cassady. After Bill he was the most psi-gifted guy I ever met. He was like an Occultic force. I think he runs a dance studio now."
    },
    "imdb_rating": "6.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjIwOTQwNzg1MV5BMl5BanBnXkFtZTcwODc4MDU4Mg@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "A reporter, trying to lose himself in the romance of war after his marriage fails, gets more than he bargains for when he meets a special forces agent who reveals the existence of a secret, psychic military unit whose goal is to end war as we know it. The founder of the unit has gone missing and the trail leads to another psychic soldier who has distorted the mission to serve his own ends.Rob Harris",
    "name": "The Men Who Stare at Goats",
    "genres": [
        "Comedy",
        "War"
    ]
}