{
    "filename": "Bourne-Ultimatum,-The_script.txt",
    "imdb_id": "tt0440963",
    "imdb_url": "https://www.imdb.com/title/tt0440963",
    "characters": [
        "Martin Kreutz",
        "Ezra Kramer",
        "Neal Daniels",
        "Wills",
        "Lucy",
        "Desh",
        "Tom Cronin",
        "Paz (as Edgar Ramirez)",
        "Jason Bourne",
        "Nicky Parsons",
        "Dr. Albert Hirsch",
        "Pam Landy",
        "Noah Vosen",
        "Simon Ross",
        "Jimmy"
    ],
    "dialogues": {
        "Martin": "A WORK TABLE, covered with sheet music, music paper, pencils. And, sitting on the upright piano against the wall, a framed PHOTO of MARIE...  A KNOCK on a door beautifully, heavily lacquered with centuries of paint...  MARTIN KREUTZ, late 20s, opens the door and finds BOURNE. A long look between them -- like two lost brothers who recognize each other -- each has been waiting for this moment for a long time.     Martin looks out the window.   Where is my sister?  I knew it was going to end this way. It was always going to end this way...  Why did she die?  And then you killed him.  Now what?",
        "Kreutz": "",
        "Ezra": "",
        "Kramer": "Two other senior CIA officials sit in on the meeting. Kramer looks at a file on Bourne and Abbott.   Who's \"she?\"  A dirty section chief in league with a corrupt Russian Billionaire commits suicide when confronted by Jason Bourne. You couldn't make this stuff up. You watched this happen?  Bourne's last confirmed location is Moscow, three days ago?  So what does he do now?  Like what?     What's he after?  Pam, what I need to know is, what kind of a threat is he to us?  Maybe he still will. Maybe he gave it to you because he wants to throw you in the opposite direction of his real plan. I don't know. I just know my number one rule is \"the only way to stay safe is to assume the worst.\"   As far as I'm concerned Bourne is a serious threat until proven otherwise.  Hello.  You still think he's after Daniels?  Daniels knows way too much. Daniels knows everything. We can't let them meet.  Good. And fill Hirsch in.     Just in case.     Tell her I'm unreachable.  He's ready. Send him to Operations.",
        "Neal": "",
        "Daniels": "Turn off that tape recorder.",
        "Wills": "We tracked the phone. Registered to a London reporter named Simon Ross. He works at the Guardian newspaper.  Yeah, thanks Mike. We have a survey team covering him at work...and a sneak and peek's on their way to his apartment.  We don't know, we pulled his background and ran a cross check on any known anomalies, but we've come up with nothing. But, I think if we follow Ross, we are going to be able...  Yeah.  Jimmy, give me Ross's profile on one.  That's a hard line, Jimmy, why don't we have it?  Okay, he is on the move.   Target is mobile.  Okay, people, look sharp, give me eyeballs on the street.  Where's that audio on the street? I want to know where he's going...  Jimmy, I need that phone!  Sir, we haven't yet become operational --  Okay, who's the guy in the blue hood?  In place in one minute.  Maybe he's the source?  There. That silver door. Bourne's behind that door?  Okay, pull the agents back and give Bourne's location to the asset.  What about Bourne?  This is Pamela Landy. She's gonna be quarterbacking our search effort. I think what we oughta do, just to get started, let's go around the room, say who you are and what your spec is.  Do you have a better idea?  Do it Jimmy.  Jesus Christ.  Sir, we have an unauthorized breach. Someone with active system knowledge has penetrated out protocols. Information was passed to the asset at 14.11. The trace is confirmed and valid. It comes from a computer belonging to Nicky Parsons.  Station chief in Rabat just called, they found a body. Bourne?  Get in here! Bourne called Landy!  Landy just left the building.  Bourne got into your safe!  The asset lost Bourne.   We lost him.  What about it?  Everything stops.  Fifteen. Seventy-one. What do they mean?  --hang on -- wait -- Seventy First Street? Like what? Like York and First?  She gave him the facility.     She gave him--",
        "Lucy": "",
        "Desh": "Desh goes up to the rooftops now. Bourne has him in sight -      * DESH is prepping his gun with a silencer.                        *  DESH speeding up. BOURNE sees NICKY down below amongst the       * crowds. In Desh's sights.                                        *  BOURNE knows he has to gain more ground.                         *  CABLE CAM shot - Two trained assassins leaping across the        * narrow streets - silently effortlessly -- the cops down          * below searching the alleyways, oblivious to the chase            * unfolding above them.                                            *  BOURNE nearly on terms with him - then --                        *  DESH dipping down again into the street below.       Avoiding    * the police -- he melts into the crowds.                          *  STEADYCAM SHOT - following BOURNE as he heads downstairs.        * More stairs. Through a corridor then a courtyard -               * bursting out of a door into the street -                         *  A police checkpoint. Right in his path.     Bourne forced to     * dog leg and take another route.                                  *  BOURNE'S lost him- for the moment.                               *",
        "Tom": "",
        "Cronin": "We think that's Bourne hitting him on the head and then--    Initials .....Bring that up on main.  They tracked Daniels' passport to a hotel in Tangier. They're holding up a bank transfer he made to keep him in place while they move an asset in from Casablanca.  The hub just got word Bourne and Nicky are dead.  Not yet.  Pam, You need to see this.     This passport just cleared Immigration at JFK ten minutes ago. It's an early Treadstone identity registered to Jason Bourne but he never used it and it never went to the grid. Bourne's alive.  No, if they knew Vosen wouldn't be in his office right now.  Yeah. Maybe Bourne wants us to know, just like Naples, maybe he's communicating.    Maybe he's trying to communicate with you.     Bourne got into Vosen's safe.  Where to?  4.15.71...     Jesus, Pam.",
        "Jason": "",
        "Bourne": "SUPER:    Six Weeks Later  So we got in the way?   Is that why Neski died? Is that why you killed Marie?  I told you people to leave me alone! I fell off the grid. I was half way around the world.  She wouldn't want me to. That's the only reason your alive.  She's dead. She was killed.  I didn't believe that.  She was shot. A man came for me.  Someone started all this...and I'm going to find them.          Waterloo Station, south entrance, thirty minutes.  This is Jason Bourne.  Don't ask questions. Just listen...  To your left. Blue hooded top. Walking towards the bus stop  Go to the bus stop, sit next to him. Head down...  Take the footbridge. Go to the West Entrance. I'll meet you at the newsstand.  Why do you know so much about me?  The article. You talked to someone from Treadstone. Someone there at the beginning.  What's his name?  Whoever they are it's trouble.  Blackbriar, what's Blackbriar?  What? What are you talking about?  (spotting approaching  Answer your phone.  Three o'clock. Female. Blonde black top.  Not yet. Dip left past the photo kiosk.  Straight ahead. News kiosk.  Change of plan. Stop. Tie your shoelace.  Clear. News kiosk. Straight ahead.  Negative.  Negative.    Keep straight ahead.  Get into cover. Now!  Keep moving...  Faster....  The front...    Service doorway -- Now!  Keep moving.  Through the store room.  I'm going to get you to safety but you have to stay calm do exactly what I say.  No, listen to me: Exactly what I say this time. Understand?  Stay here while I look for an escape.  No, stay behind that door.     No.   Something's not right.  Don't move until I tell you.  No, No not now.              What are you doing here?  Where's Daniels?  How long do I have?  334 Calle Norte. I hear gunfire. And men shouting. I think they're Americans --  Okay, where is Daniels headed?  Okay, Tangier is about 300 miles away, we can make the morning ferry.  Do you know who this is?  I have to get back to the beginning...or I'll never be free of this.  I think he started Treadstone.    I remember meeting him.   I remember the first day... Daniels brought me to him.  An initiation...I guess...  Why are you helping me?  No.  We should move.  Now they found Daniels, do you know where he is?  Find out who.  Tell him you're going to meet him and that you have a new phone for him.  We're not going to stop him. We're going to follow him. He'll take us right to Daniels.  Nicky?    Listen to me.   You need                * to -                                              *  Alright, we need to be dead.    You need to code that in.  I can see all their faces. But I can't remember any names....  I was starting to remember who they were...in India...with Marie.  I've killed people and I've tried to apologize for what I've done, for what I am. None of it makes it better...  They're going to come for you again. You are going to have to run now.  It gets easier.  I hear you're still looking for me.  Is that official?  Good-bye.  Get some rest, Pam.  You look tired.  This is Jason Bourne.  You didn't actually think I was coming to Tudor City, did you?  Where are you right now?  I doubt that. If you were in your office--  We'd be having this conversation face-to-face.  10-13. Shots fired. Officer down. Port Authority parking lot. Level four.  Stay out of sight until one of your own arrive.                      They'll kill you for giving me this place.  Why'd you do it?  Then stop it. Everything you need is in there.    I've spent three years running. Three years trying to find out who I was.  Let's start with the moment you found out I wouldn't execute Wombosi. The amnesia wasn't the issue, it was the fact that I didn't pull the trigger....  It was always you, behind Conklin, behind Abbott.... They were just following orders.  (shoving Hirsch hard  Why me?   Why did you pick me?  What does that mean?     Yes, sir.  You said I'd be saving American lives. Instead you just turned me into a killer.  I'll be whoever you need me to be, sir.  Who is he?  What did he do?  I remember. I remember everything.  I'm done running.  That's why I'm here. To end you, to shut this down. I'm no longer Jason Bourne.  No. You don't deserve the star they give you on the wall at Langley.      Do you even know why you're trying to kill me? Look at what they make you give.",
        "Nicky": "I was posted here after Berlin.  Hello.  This is Nicky Parsons. Who's this?  Response: \"Everest\".  I just walked in.  They're down. Unconscious, but alive.  No.  Bourne, are you still looking for Bourne? I thought the case was closed.  Okay.  They know you're here.  Three minutes...  My car's outside.    I know where Daniels is.  8 o'clock this morning, he wired $100,000. to a numbered bank account in Tangier.  And then what?  They're coming.  What are you after, Jason?   Why are you looking for Daniels?  That's Daniels. I don't know who that is.  Who is he?  What happened?  Jason...that wasn't some one-off initiation. Daniels said they did that to you over and over again.   That's how they...  It was difficult for me...with you.  You really don't remember anything?  His location's being blocked.  They'll get one of the operatives to terminate him.  Desh.  If you stop Desh they'll just get someone else.       Code in?                                            * Code in?                                            *  Bourne?                                           *  It's just going to lead to more killing, Jason. Are you sure you want that?",
        "Parsons": "",
        "Pam": "",
        "Landy": "His girlfriend, Marie. She was killed in India three weeks ago.  Right.  I think he's looking for something he hasn't found.  I'm not sure. Maybe he hasn't gotten his memory back yet.  Not all of it.  If he just wanted to hurt us he could have sent this tape to CNN.  Nothing for me.  Suggested? Are you sure it was just a suggestion?  Meaning?  Bourne's finished.  It was finished the moment I realized I was chasing him for something he didn't do.   The case is closed.  This doesn't feel like Bourne to me.  Probably because it's coming from you, Noah.  So what happened at Waterloo?  And the reporter ended up dead?  So what was he doing?  The real question is how you managed to get in a fire fight in the middle of a public train station.  I'm going to the office now. I'll make my own introductions.  Let's do names later.  What's Bourne's last fixed position?  Anybody.  Status?   Wounded?   Armed?  Where are your grids coming from?  You have an Echelon package?  Why isn't it on?  For what? You're nine hours behind the toughest target you've ever tracked. I want everyone to sit down, strap in, and turn on all you've got. That would mean now.  Thank you.  I want everything you've got on Ross on screen one.  I think we can be pretty certain that Bourne's not your source then?  Ross's call to his editor, where he said he just met the source on Blackbriar, took place just after his flight landed. His met his source in Turin.  So, what, Bourne met Ross for breakfast and then, at noon the same day Bourne calls Ross to demand a meet at Waterloo?  The guy you're after is a CIA operative with clearance above Top Secret.   He was committing treason by talking to Ross.   Do you really think, while doing that, he used a cell phone he knows we can track?  Yeah, I'd look at all the people whose cell phones were switched off the entire period Ross was in Turin.    Now check everything in Ross's apartment against those names. Look for common patterns, look for -  Neal Daniels.   He's Station Chief in Madrid now, isn't he?  \"Heavy?\" Daniels isn't--  Nicky, this is Pam Landy. We have reason to believe there is a connection between Neal Daniels and Jason Bourne.  No, some people are convinced he's still a threat. I disagree but to find out I need to talk to him.  The only way this has a happy ending, Noah, is if we find a way to bring Bourne in voluntarily.      Since when do you have authorization for lethal action against Daniels?  So grab him--  What's going on?    What's Daniels got?  I think the world's well aware we have a rendition and lethal action capability at this point, Noah.  You still don't have the authority to kill him.  You just decide? No oversight. No checks and balances.     It's Pamela Landy for him. Would you tell him it's urgent?        Now.   I want to know what's going on.  I'm asking on what basis you're continuing this operation.  This is about Daniels, not Nicky!  You don't know the circumstances!  You don't have the authority to kill her or Bourne!  She's one of our own.   You start down this path...where does it end?!     Confirmed?  Get me a copy of Bourne's personnel file.                    They don't know.  It's a hell of a risk.  Maybe we should communicate back. Because I think I know what Bourne's looking for.     Pamela Landy.       Bourne?    I guess I owe you an apology.  No. Off the record. You know how it is.    Wait.     Wait.  David Webb. That's your real name.  You were born 4/15/71 in Nixa, Missouri.    Why don't you come in, and we'll talk about it? Bourne?          What just happened?  What?!  415 East 71st Street.  4/15/71 isn't much of a code. My guess is Vosen's already on his way.  This isn't us, David. What they turned you into, what they're doing with Blackbriar... This has to stop.  David... Come in with me. It's better if we do this together.  Oh, my God...  You better get a good lawyer.",
        "Noah": "",
        "Vosen": "You tracking him?  Well, who talked to him? How did he find out about Blackbriar?  Right. Ross is easy. I want the source.  Is that all?  I want rendition protocols and I want the asset put on standby, just in case.  People, listen up, this is a full priority situation  Our target is a British national, Simon Ross, a reporter. I want all his phones, his blackberry, his apartment, his car, bank accounts, credit cards, travel patterns...I want to know what he's going to think before he does. Every dirty little secret he has. And most of all, we want the name and real time location of his source. This is NSA priority level 4, any questions?  All right, let's get to it.  Where's my picture please?  That's too long.  Why aren't we hearing this?  Where's he going?  Where is he heading?  What's he doing? I thought we blocked his cell? Who the hell is he talking to???    I said activate the asset.   I want options.  Okay, there, he's talking to the guy with the hood. Take them down.  Watch that bus! The bus! -- don't lose them! Stay triangular and don't get blocked.  Grab Team B. Grab the hoody and stay with Ross...  No, no, look...Ross is not on the bus.   Split up the team -- get the guy on the bus and send someone to stay on Ross.  I don't like this. Patch me through to Met surveillance.  He's got to be close. Seal the entrances.  We're losing him! We cannot afford to lose him!  64H             What's the status of the asset?                     64H   Alright, I want to take him now. Get him out of there and have the asset cover it.  Close him down...  Jesus Christ, that's Jason Bourne.  It doesn't matter, the asset now has 2 targets. Take them both out.  Oh...shit...  Get the asset out of there ...  Get him out of there - NOW!  It's Vosen. We have a situation.    You're late. Traffic?  I'm buying.  When the Director called, it was suggested we bring you on--  Funny how different things look depending on where you sit. I look at this as doing a favor for you. Giving you an opportunity to complete some unfinished business.  Jason Bourne.  Really?  So what do you make of this? French intel picked up Bourne meeting Pierre Elattrache on Tuesday. He threatened to burn our house down if you didn't tell him who started Treadstone. That's a big problem, wouldn't you agree?  Why's it so hard for you to believe?  Lets try and be adults okay? We all thought he was done, off the grid. But Bourne's back. Maybe he's a threat. We both want the same thing here.  We have a leak. Bourne showed up in our surveillance. We had very little time to react.  Bourne saw us coming.  We don't know. But just the fact that he was there means he's up to something, don't you think? Maybe he's the source?  Don't second guess an operation from an armchair, Pam. It's not fair.  How?  So?  Cross check the secure cell phone usage of everyone with Blackbriar SCI clearance against all calls in and out of Turin during the morning Ross was there  Call the RSO at the Embassy and have them take Daniels into custody if he's there.   If he's not, get a grab team to the Calle Norte safe house. Send them in heavy and tell them we'll assist with entry.  I'm worried about Bourne. If he's not Ross's source, then he must be after Ross's source -- just like us.  Team two, ETA Callee Norte?  Okay, put it live.  That has to be Bourne.  Shit...    Track the passports.  Goddamn it! Get a back-up team in there!  How long till back-up arrives?  How long? Stop! Hang on. I have an idea...  Who is this?  Nicky, I need to do an ID challenge first. Code in: \"Sparrow.\"  Nicky, this is Noah Vosen. How long have you been on site?  We have two officers on site. Are you in contact with them?  Is there any sign of Daniels?  Hold on Nicky.  What are you doing? You know Bourne's probably listening.  How long till back up arrives.    You \"disagree\" he's a threat? He just took out two more of my men. Not to mention his ultimatum to Ellatrache?  He wants revenge, Pam. The only realistic way to deal with this is to eliminate the threat.  Issue a standing kill order on Jason Bourne, effective immediately.     We lost Bourne.  Yeah. Nicky's just the means. But if we find Daniels, we'll find Bourne.  I'll take care of it.          Since he cleaned out a Blackbriar safe and fled to Morocco!  I don't have the people on the ground to do that and I'm not going to risk that file falling into the wrong hands.  What's he got? He ran all of Blackbriar's operations in Southern Europe and North Africa.  For Christ's sake, Pam, he's got our entire playbook. Names, dates, ghost sites, how we train our assets.....  Oh, yes I do, Pam.  That's what makes us special. No red tape. No more getting badguys in our sights and then watching them escape while we wait for some bureaucrat to issue the order.  Come on, Pam, you've seen the raw intel. You know how real the threat is.    We can't afford to have our hands tied like that anymore.  Give me the subject's location.  Get an elevation and a floor plan, tic-tac-toe. Locate the room. Give the asset Daniels's location and the route between Daniel's hotel and the bank.  Do we have that room yet?  Get the hotel's trunk line. Run all calls through here with an iso on 117  Find out why.  Where did the course deviation occur?  That's where Parson's is.  When we're finished with Daniels send the asset after her. We find Parsons, we find Bourne.  Not now.  Not now.  On the basis that Nicky Parsons has compromised a covert operation. She is up to her neck in it.  She has betrayed us!  She's in league with Jason Bourne for Chrissake!  Yes, I do Pam, it's right here and it's legal.  It ends when we've won.  Notify the asset of the additional target.  Have the bank release the funds.  Okay, that's it.    Bar her cell.                   * Tie it off.                                         *  I want to be sure. Have the station chief in Rabat confirm the deaths and do a sub-rosa check...And keep and eye on Landy.     Desh.     Are we triangulating?!  Why the hell did she give him that?    ...This is a national security emergency. We have an imminent threat.  Jason Bourne is alive and at large in New York City. We believe in one thousand yards of this building. I want an immediate twelve block lockdown of the area. Send a FLASH message to Langley, prep for local backup assistance.  Check Landy's phone.   Is she using it?  Nothing?   No calls since Bourne-- ?  What the hell do you mean we can't read it?     I want that goddamn text.   We need to get out in front of her!  Surround it. Anyone not on Landy goes to Tudor City. Now! Get the trucks. We're going mobile.     Get the map up.  He wouldn't have chosen it if he didn't have a reason.    As soon as you have eyes on Landy, I want to know.    Copy that, I see her.  Any sign of Bourne?     Noah Vosen.  How did you get this number?  No, I guess not. But if it's me you want to talk to maybe we can arrange a meet.  In my office.     Noah Vosen.               This is a code ten abort, I want everybody back in the vehicles this is a code ten abort! Back to the vehicles immediately, back to CRI immediately.        ...I want the entire building searched. Every room. Every hallway. Every closet. Every goddamm airduct. Do you understand? I want him found!           Tell them again!        Take him out!    (practically screaming                       Bourne knows everything. I think he's heading for you right now.  Not long.    Get out of there.  Are you crazy, he'll--     Landy! Right there!    She's got Bourne's backpack!  (to a group of six  Do you know who I am? Where's your security room?  I want to see all your footage for the last three minutes.",
        "Simon": "",
        "Ross": "...This is big -- a skein of lies -- you pull at it and it just keeps coming -- I'll fill you in when I get home. And it's not finished, either. They're calling it `Blackbriar'.  Have you heard of an Operation Blackbriar? I'm going to try and get my head around this, see you first thing.  There's more. He was scared.  Blackbriar.  Who is it?  Who is this?     Hello?         What?  I can't tell you that.... Who's following me?  Are they Blackbriar?  I don't know. I heard the name this morning for the first time. Whatever it is, my source said it started with you.  Look, just help me get away from these people...and we can talk more...we can--  Has she seen me?  Are we clear?  Straight toward me.     Bin man?  He's got a gun.    Yes.  I can see the entrance from here I can make it out--     If I run now I can make it--  I'm going to go for it, okay?  I'm going to go for it.",
        "Jimmy": "We have his line, sir, but he's not on it.  Three names: Tom Brewster, Jack Boulin, Neal Daniels."
    },
    "imdb_rating": "8.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNGNiNmU2YTMtZmU4OS00MjM0LTlmYWUtMjVlYjAzYjE2N2RjXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Bourne is once again brought out of hiding, this time inadvertently by London-based reporter Simon Ross who is trying to unveil Operation Blackbriar--an upgrade to Project Treadstone--in a series of newspaper columns. Bourne sets up a meeting with Ross and realizes instantly they're being scanned. Information from the reporter stirs a new set of memories, and Bourne must finally, ultimately, uncover his dark past whilst dodging The Company's best efforts in trying to eradicate him.—Corey Hatch",
    "name": "The Bourne Ultimatum",
    "genres": [
        "Action",
        "Mystery",
        "Thriller"
    ]
}