{
    "filename": "Fault-in-Our-Stars,-The_script.txt",
    "imdb_id": "tt2582846",
    "imdb_url": "https://www.imdb.com/title/tt2582846",
    "characters": [
        "Monica",
        "Michael",
        "Flight Attendant (as Toni Saladina)",
        "Gus' Dad",
        "Lidewij",
        "Gus' Mom",
        "Isaac",
        "Peter van Houten",
        "Hazel",
        "Frannie",
        "Gus",
        "Hostess",
        "Dr. Simmons",
        "Monica's Mom",
        "Dr. Maria"
    ],
    "dialogues": {
        "Monica": "Always. Always. And Hazel hears:  Always. Always.  What in God's name --",
        "Michael": "Wanna see a movie?  This is a really good show.  Of course we can, we're your parents.  Hazel, you need to get out of the house. Make friends. Be a teenager.  You don't take pot. 8.  Would you like to be excused?  By all means.  Is that a Rik Smits jersey?     You're a survivor yourself?  How's your health now?  That's fantastic.  Son, you have to understand... Hazel's still pretty sick. She will be the rest of her life.  She'll want to keep up with you - she's that kind of girl - but the truth is, her lungs --  It wasn't - thank god -- 46.  The good news is... no tumor growth. No new tumors in your body.  We're all so relieved.  Better, thank you. Much better.  I'm sorry --  Of course I will.  Gus.  Why don't you go home, get some rest?  So we're gonna do nothing?  Gus again.  I'm sorry Gus, she's asleep. 51.  Amsterdam!         What's that?  I don't know, Haze. I always thought being an adult meant knowing what you believe... ... that has not been my experience. 87.    Hazel, listen to your mother.  Hazel. You of all people know it's possible to live with pain.  We didn't want you to feel  Can I come in?  I'm so so sorry. It was a privilege to love him, though, wasn't it?  Gives you an idea how we feel about you.",
        "Gus'": "Hazel is terrified. Turns out, Gus is the world's worst driver. When he brakes, her body flies forward against the seatbelt. And when he hits the gas, seconds later, her neck snaps back in the seat. Gus sees the look on her face.  Gus has one eye on the road, the other on Hazel. He was impressed with her before. He's totally dazzled now.  Hazel follows Gus inside. She quickly notices all sorts of engraved plaques and framed signs with phrases like \"Home is Where the Heart Is\" and \"True Love is Born from Hard Times.\" Hazel looks at Gus quizzically.  Augustus, hi. New friend? 20.  How's it going, Just Hazel?  Isaac's head is buried in Gus's couch. He's wailing like a banshee, having some kind of nervous breakdown.  Hazel descends the steps. She hears an ungodly moan before she sees anyone. What has she gotten herself into? Gus appears at the base.  Gus  in bed, a laptop on his chest.  They fall onto Gus's bed, kissing. Hazel is very in the moment and now it's Gus who seems nervous. As they kiss:  Gus lays in bed, eyes open, a PICC line now being fed through a port in his chest. Chemotherapy at work. Hazel and Isaac are keeping him company.  Gus comes home from the hospital. He does not look good - but he lives. Hazel is there to help get him inside.  Gus no longer sleeps in his basement. Nor does he sleep in his own bed. He sleeps in a HOSPITAL BED set up in a guest room. Hazel is with him. They're watching sports on TV.  Hazel and Gus getting some fresh air. She sits there reading a book. Gus just sits there. His eyes staring off into nothing. Hazel waves to him. Gus looks over, as if waking from a dream. She manages a smile. He manages one back.  Mr. Van Houten, I'm a good person but a shitty writer. You're a shitty person but a good writer. We'd make a good team. I don't want to ask you any favors but if you have the time, and from what I saw you have plenty, please fix this for me. It's a eulogy for Hazel.  She asked me to write one and I'm trying, I just, I could use a little flair. See the thing is... we all want to be remembered.  We all want to leave a mark.  But not Hazel. Hazel is different. Hazel knows the truth. She didn't want a million admirers, she just wanted one. And she got it. Maybe she wasn't loved widely but she was loved deeply. And isn't that more than most of us get?  When Hazel was sick, I knew I was dying. But I didn't want to say so. 113.  She was in ICU and I snuck in for ten minutes and sat with her before I got caught. Her eyes were closed, her lungs were intubated...  ... but her hands were still her hands, still warm, and the nails painted this dark blue back color and I just held her hands and I willed myself to imagine a world without us and what a worthless world that would be.  She's so beautiful. You don't get tired of looking at her. You never worry if she's smarter than you cause you know she is. She's funny without ever being mean.  I love her, god I love her. I'm so lucky to love her, Van Houten. 114.  You don't get to choose if you get hurt in this world but you do have a say in who hurts you.  I like my choices. I hope she likes hers.  Ok, Hazel Grace?",
        "Dad": "How's it going, Just Hazel?",
        "Lidewij": "Please. I am sorry. Come in.  Fan mail. 18 years worth. He never opens it.  Perhaps some breakfast first Peter?  I also think the Earth is round.  It was our pleasure.  Peter!  Peter!      I have resigned.  I'm so sorry. Circumstance has made him cruel. I thought meeting you would help him, if he would see that his work has shaped real lives, but... I'm very sorry. 79.  Perhaps we can do some sightseeing. Have you seen the Anne Frank House?  He is not invited.  I'm afraid there's no elevator.  No, there are many stairs. Steep stairs.  Shall we?  This is the bookcase that hid the Frank family and four others. 80.  The only member of the whole family to survive was Otto, Anne's father.  I don't know how you go on, without your family. 81.",
        "Mom": "Augustus, hi. New friend? 20.  Hazel sits down on a patio chair and dials the phone. Gus answers on the first ring.  Hazel lays on the grass in her backyard staring up at the stars. She rings him back and as she does SPLITSCREEN w/ Hazel in the grass and:  Gus is with Frannie and Michael downstairs.  Still silent. Michael drives, trying to keep it together. Frannie's in the back with Hazel's head in her lap. Hazel continues to scream in silence, whether from pain or terror, we do not know.  Michael carries Hazel into the chaotic emergency room. They're practically running. There's still no sound.  Hazel sits at the computer screen writing a Craigslist post. Gus stands next to her.  Frannie races out of her room in a towel, dripping wet.    They wait in line for the security checkpoint. When it's Hazel's turn she unhooks the plastic nubbins from her nose. Gus places the oxygen tank on the conveyer belt. Hazel takes slow, careful steps through the metal detector. She seems determined to get through this without any help. But upon reaching the other side it's clear that even these few steps without oxygen were a struggle. Hazel holds on to the side of the conveyer belt to steady herself. As soon as her tank reappears she puts the cannula back in place. Still light-headed, Hazel closes her eyes and focuses on her breathing. She catches her mom looking at her, nervously.  Hazel sits in the middle with Frannie on the aisle and Gus at the window. He looks around, antsy.  A VIDEO plays on a MONITOR showing the Nazi invasion of Holland. Hazel and Gus stand with Lidewij in a pack of BACKPACKERS and TRAVELERS about to take the tour. Many of them begin to walk up the first flight of stairs.  Hazel, Gus, and Isaac lean against Hazel's car staring something down.  What in God's name --     Hazel drives like a maniac down the street, eventually finding herself at the Speedway gas station. Gus's car is alone in the parking lot and she pulls up next to it. She gets out of her car, opens his driver's side door, and finds him sitting there, his shirt stained with vomit and blood. She gags from the smell.",
        "Isaac": "Yeah, um... I'm Isaac. 17. Eye cancer. It's looking like another surgery in a couple weeks. After which, well, I'll be blind...  Not that I'm complaining or anything. I know a lot of you have it way worse but, still, I mean, you know, being blind's gonna suck...  ...My girlfriend helps. And friends like Augustus here...  So... yeah. That's what's up.  Always. Always. And Hazel hears:  Always. Always.  She didn't want to do it after the surgery. Said she couldn't handle it. I'm about to lose my eyesight and she can't handle it.  I kept saying \"always\" to her. Always, always, always. And she just kept talking over me and not saying it back. It was like I was already gone, you know? \"Always\" was a promise! You can't break promises.  Right, sure, but you keep the promise anyway. That's what love is. Love is keeping the promise anyway.  She hasn't even visited. Fourteen months we were together. What kind of person...  You'll get over her Isaac. Just takes a little time. You'll see.  Is she gone?  Did she really just say \"you'll see?\"  Doesn't pun your disability.  That is huge. I mean, seriously, is this my freakin' arm or a dartboard? Three - no condescending voice.  I don't know. To be honest, I think a hell of a lot more about Monica than my eye. Is that crazy? That's crazy.  But I believe in love, you know? I don't believe that everybody gets to keep their eyes or not get sick or whatever, but everybody should have true love. Don't you think?  Gus was here earlier.  Mmm... that's better.  Do you like him?  But you don't want to hook up with him?  Great. Wonderful. I mean, they're not in my head is the only problem.   Did you write his eulogy yet?  What?  Oh. Oops.  My bad.  Hey!  You guys are adorable.  Not a word.  I've stopped thinking about it. Moving on. There's a new girl in Support Group with these humongous -  I'm blind but I'm not that blind.  Is it there?  She's in the house?  I didn't hear anything.  My throw was to the left or I should aim to the left?  Really?  You're late.  \"Augustus Waters was a self- aggrandizing bastard. But we forgive him. We forgive him... not because he had a heart as figuratively good as his actual one sucked, or because he got 18 years when he should have gotten more.\"  I'm assuming you've got some time, you interrupting bastard! I mean seriously...  \"Augustus Waters talked so much that he'd interrupt you at his own funeral. And he was pretentious. 102.  Sweet Jesus that kid never took a piss without pondering the resonances of human waste production. And he was vain. But that comes with superhuman handsomeness.\"  \"But I will say this: when the scientists of the future show up at my house with robot eyes and they tell me to try them on, I will tell the scientists to piss off, because I don't even want to see a world without Augustus Waters.\"  \"And then, of course, having made my rhetorical point, I will put my robot eyes on because, I mean... robot eyes!\"  \"So anyway, Augustus, my friend... Godspeed.\"  Goddamn it, Gus.  Shit! Ass! Balls!  Can I get a hand here, Hazel?  Of all the things I've lost in my life, this hurts the most.  Hazel and Isaac have climbed through his open bedroom window. They sit on the roof.  Do you know if it hurt or whatever?     Are you angry?  Me too.  Gus really loved you, you know.  He wouldn't shut up about it.  It was annoying.  Did you read the note or whatever from your author friend?  We talked at the cemetery. Said he came all this way to give you that.  Yeah but he didn't write it - Gus did.  That's what he said. Gus had written something, sent it to Van  What?  I do it all the time. Go.",
        "Hazel": "You have a choice in this world, I believe, about how to tell sad stories.  On the one hand, you can sugar coat - the way they do in movies and romance novels.  Where villains are vanquished and... heroes are born and...  ... beautiful people learn beautiful lessons...  ... and nothing is too messed up that can't be fixed with an apology and a Peter Gabriel song.  I like that way as much as the next girl, believe me. It's just not the truth.  This is the truth.  Sorry.  Late in the Winter of my 17th year...  ... my mother decided I was depressed.  I'm not depressed.  I'm not depressed.  I'm not depressed!  The booklets and web sites always list depression as a side effect of cancer... 3.  Depression's not a side effect of cancer...  ... it's a side effect of dying.  Which is what was happening to me.  Why stop there?  Keep `em coming. I can take it. I'm like the Keith Richards of cancer kids.  I'm not sure it's for me.     What?  \"Journey?\" Really?  I'll spare you the gory details of Patrick's ball cancer. Basically, they found it in his nuts, cut most of it out, he almost died, but he didn't die, and now here he is - divorced, friendless, addicted to video games, exploiting his cancertastic past in the heart of Jesus - \"literally\" - to show us that one day - if we're lucky - we could be just like him.  I'm, uh, Hazel. 16. Thyroid originally but with quite the impressive satellite colony in my lungs.  You mean besides the terminal cancer? 6.  Alright? I guess...?  \"America's Next Top Model\" is on the TV. Hazel sits on one side of the L-shaped couch, flipping through her novel. Frannie and Hazel's dad MICHAEL (40s, kind, doing his best to stay positive) sit on the other side, watching her - but trying not to make it seem that way. After a few beats:  Hmm?     Why don't you guys go to a movie?  7.  You haven't been out in a while. Go. Have fun. Take the night off.  And that was my life.  Reality shows. Doctor's appointments. Eight prescription drugs, three times a day.  Hazel and her parents in the kitchen.  And worse worse worst of all... support group.  Ugh. You can't make me.  If you want me to be a teenager, don't send me to Support Group. Buy me a fake ID so I can go to clubs and drink gimlets and take pot.  See, that's the kind of thing I would know with a fake ID.  And so I went...  Not because I wanted to or because I thought it would help. But for the same reason I did anything these days...  ... to make my parents happy.  Are you gonna sit here and wait the whole time?  Ok.  Love you too Mom.  The only thing worse than biting it from cancer - is having a kid bite it from cancer. 9.  I'll take the stairs.  Ooph. Sorry!  My bad. No, it's... For a brief moment, the Earth stops. They stand looking at one another. Hazel is speechless.  Excuse me.  I just wanna say... there will come a time when, you know, all of us are dead. 12.  It might be tomorrow. Might be a million years from now but... it's gonna happen. And when it does, enough generations will come and go, there'll be no one left to remember Cleopatra. Or Mozart. Or Muhammad Ali, let alone any of us, right?  Oblivion's inevitable. And if that scares you, well, I suggest you ignore it. God knows it's what everyone else does.  Someone should probably tell him, don't you think? Jesus? Seems kinda dangerous keeping all these kids with cancer in your heart.  Hazel.     What?  Why are you looking at me like that?     What's with the \"always?\" 14.  He's gotta be hurting her boob.  Oh. Um. Uh...  Sure. Yeah. I'm... pretty free this  What?  What do you mean \"now?\"  You could be an axe murderer.  Oh my god. Oh. My. God. You're kidding right?  You just ruined the whole thing! 15.  What, you think that's cool? Oh you idiot! There's always a hamartia, isn't there? And yours is - even though you had FREAKING CANCER you give money to a corporation for the chance to acquire EVEN MORE CANCER!? Ugh. And you were doing so well.  Let me tell you... not being able to breathe? Sucks. Totally sucks.  A fatal flaw.  Sorry?  Metaphor.  Can't tonight.  I've made plans with Augustus Waters.  You don't say.  I'm surprised you have a license.  Aha. Cancer perk.  I was 13 when they found it.  Stage IV thyroid cancer.  I had surgery first.  Then Radiation...  Then Chemo...  All of which worked for a while.  And then stopped working.  And then my lungs started filling up with water.  That should have been the end. 18.  But it wasn't.  The antibiotics kicked in. They drained the fluid from my lungs. And in time I got better. Stronger.  I even found myself in an experimental trial. You know the ones that are famous in the Republic of Cancervania for not working.  It's called Phalanxifor. Didn't work in over 70 percent of patients but, for some reason...  ...it worked in me. They called it \"The Miracle.\"  Tumors shrank, my mets have hardly grown since... 19.  Of course my lungs still suck but, theoretically, they could continue to suck in just this way for, I dunno, a while maybe.  Yeah.  Can't.  Got my GED.  It's just... Hazel.  Nice to meet you!  Must have been pretty good.  Need to sit.  Don't get any ideas.  All that standing... and stairs... and then more standing... lotta standing for me.  I'll be fine in a minute. Unless I faint. I'm a bit of a Victorian lady, fainting-wise.  I already told you my story. I was  Um...  No. I'm just... I don't know... un- extraordinary.  \"An Imperial Affliction.\"  It's a novel. My favorite novel.     Seriously? It's not that kind of book.  It's not, it's... kind of my bible actually.  Cancer.  But not in that way, trust me. The guy who wrote it, Peter Van Houten, he's... well, the only person I've ever come across who seems to a understand what it's like to be dying and b) not have died.  Not so much cold as under- oxygenated.  Hazel sits in bed reading Gus's novella. Frannie stands in the doorway, notices the new book.  By \"it\" do you mean herpes?  I'm not worried. Please. It's not like I'm waiting for him to call or anything. I just... we hung out. No big deal.  Hazel at the dinner table with her parents. She's a little sullen, barely touching her food. Hazel's phone buzzes. She tries not to seem too eager to check it, what with her parents watching and all. She subtly looks down at her lap. And sure enough: a text from Gus! Her eyes bug out. We see: \"Tell me my copy is missing the last ten pages or something.\" Hazel smiles. Goes back to eating. Frannie and Michael share a quick glance. A second later, there's a follow-up text. \"Tell me I have NOT reached the end of this book!\" Hazel smiles again. And then a third text:  Hazel sits down on a patio chair and dials the phone. Gus answers on the first ring.  Welcome to the sweet torture of reading \"An Imperial --\"  What the -- are you ok?  How ya doing Isaac?  Oh I'm sorry. Do you want to talk about it? 26.  Fair enough.  I actually think his response is appropriate.   You're quoting my book!  Sometimes people don't understand the promises they're making when they make them.  I know, right?  It is rather abrupt.  But that's part of what I like about it. It portrays death truthfully. You die in the middle of your life, in the middle of a sentence. But I do - God, I do want to know what happens to everyone else.  The Dutch Tulip Man... 28.  I've written letters. He's never responded. Apparently he moved to Amsterdam, became a recluse. Hasn't published anything. Doesn't do interviews.  Hazel lays on the grass in her backyard staring up at the stars. She rings him back and as she does SPLITSCREEN w/ Hazel in the grass and:  Hello Augustus.     What we need is a sequel.  That's what I kept asking Van Houten for in my letters.  That's correct.  Yeee-up.  Unfortunately so.  Augustus!?  Keep reading, keep reading! 31.  You're making this up?  Holy hell.  Can I... would you mind...  Hazel sits at her computer, Van Houten's assistant's email address staring her in the face. The cursor blinks on a blank page. And then Hazel starts writing...  \"Dear Mr. Peter Van Houten, my name is Hazel Grace Lancaster. My friend Augustus Waters, who read your book - at my recommendation - just received an email from you at this address. I hope you will not mind that he shared that email with me.\" 32.  \"I was wondering if you wouldn't mind answering a few questions I have about what happens after the end of the book. Specifically, the  \"Does Anna's Mom marry the Dutch Tulip Man; is the Dutch Tulip Man up to something - or is he just misunderstood? What happens to Anna's friends?  Lastly, I was hoping you could shed some light on Sisyphus the Hamster. These questions have haunted me for years. And I don't know how long I have left to get answers to them.\"  \"I know these are not important literary questions and that your book is full of important literary questions, but I would just really like to know.\"   \"And of course, if ever you do decide to write anything else, even if you don't want to publish it, I'd love to read it. Frankly, I'd read your grocery lists. Yours with great admiration, Hazel Grace Lancaster. Age 16.\"  You think?  Is it really almost 1?  I gotta get to sleep.  Ok...  Ok...  Ok.  Ok.  Yeah.   Qualities of a Good Nurse. Go.  Gets blood on the first try.   \"I'm gonna stab you with this needle now, so there might be a little ouchie.\"  You doing alright, Isaac?  It's a little crazy. 35.   Was he?  The pain?  Good. Good, Isaac.  What about Gus?  Hazel rolls out of bed, stumbles to her computer. She casually checks her in-box and is shocked to discover - he's written her back!  Holy shit! \"Dear Ms. Lancaster... I cannot answer your questions, at least not in writing, because to do so would constitute a sequel, which you might publish or otherwise share on the internet. Not that I don't trust you, but how could I trust you, I barely know you.\"  \"Should ever you find yourself in Amsterdam, do pay a visit at your leisure. Yours most sincerely, Peter Van Houten\" Son of a - WHAT   Nothing. Sorry.  Everything! Look!  Can we go to Amsterdam? Please?     Mom, no. Please. Don't do anything. Forget I mentioned it.  Guilt is definitely a side effect of cancer.  I've used it already. Pre- \"Miracle.\"  I was 13...        I met Goofy...  Why are you embarrassed?  Wait, what? 38.  Gus is waiting on the front stoop when Frannie's car pulls up. They're home from the hospital. He wears an Indiana Pacers JERSEY and carries a bouquet of bright orange TULIPS. Michael gets out of the passenger's seat to help Hazel out of the car. Gus rises to assist them.  Gus?  Gus is with Frannie and Michael downstairs.  You ready Gus?  Is this where you bring all your romantic conquests? 40.  You're not a virgin.  Are you really?  He sounds Dutch.  Let me guess --  You do love your symbols.  It has crossed my mind.  I was thir--  Sorry. Please, continue...  But I... didn't save it.  Are you saying --  Wait a minute. Are you only doing this so I'll kiss you?  Cause I'd totally kiss you either way.  Seriously... why are you doing this? 43.  Frannie folds laundry while Hazel pleads her case.  He's not a stranger.  Don't be gross.  Can we at least ask Dr. Maria?  You said the PET scan was encouraging!  They have doctors in Amsterdam. And cancer. Someone will know what to do. 44.   So you'll come too.  The Genies can hook it up. They're loaded.  You've never been to Amsterdam, have you Mom?  And then this happened.  [Note: There's no sound in this sequence. Just images.] Hazel wakes up screaming in the middle of the night, shaking and holding her head. Frannie and Michael burst in. Mom grabs her crying daughter, frightened beyond belief, waves to Michael to call for help.  People talk about the courage of cancer patients. And I do not deny that courage...  I'd been poked and stabbed and poisoned for years and still I trod on.  But make no mistake...  In that moment I would have been very, very happy to die.  Hello.  Hi.  You're ok, Hazel.  Would you like to see your parents?  So what happened?  Um, I feel like I'm not the most qualified person to answer that.  Can't I just get like a lung transplant or something?  I have a question.  Can I still go to Amsterdam?  Why not?  Why not, Dr. Simmons?  So does going to the mall --  They have oxygen on airplanes.    It's my life, right?  I have this opportunity I may never have again. If the medicine's working, I don't see why --  Hazel parent's bring her home from the hospital. She looks miserable. It's clear the last few days have been a big emotional set back. CUT TO:  Her parents tuck her in.  Hazel sits staring at nothing. The house phone rings. Michael comes in from another room with the phone in hand. Whispers:  Hazel reads from \"An Imperial Affliction.\" Her phone buzzes again. \"Augustus.\" It just says \"hello?\" Again she ignores it. And then a second text. She looks at it. \"The silence is deafening.\" She puts the phone back down. Hazel's heart breaks. She can't take it anymore. She picks the phone back up. She texts the following: \"I don't know if you'll understand this but I can't see you anymore. I mean I want to. I just...\" She thinks about the rest. She writes: \"I'm a grenade.\" She sends the text. Waits. And then there's more to say. She sends a second text. \"When I look at you, all I can see is what I'm going to put you through. I can't have that. I'm sorry.\" She sends that text. Waits. He writes back. \"Ok.\" Hazel reads it. Writes back: \"Ok.\" A beat. Gus responds: \"oh my god, stop flirting with me!\" Hazel smiles - she can't help herself! - but she must. She gets her emotions in check. Puts the phone away. CUT TO:  An ugly day in Indianapolis.  Inside, Hazel is about as miserable as the weather. The sky - and the circumstances - have cast a grey pall over the day.  Hazel walks out back. Looks up at the clouds, threatening rain but not yet delivering it. She sits down in the grass, on the verge of tears. She looks at the old rusty SWING SET that's been in her backyard for years. And starts to cry. Just for a few brief moments, she lets herself cry. Then she wipes the tears. Becomes strong again. And makes a decision. Hazel dials her phone. We hear:  Hi Augustus.  Kind of.  I don't know. I want to go to Amsterdam. And I want him to tell us what happens after the book and I don't want my particular life and also the sky is making me sad and there's this old swing set that my Dad made for me when I was a kid. It's just... everything.  Thanks for coming over. 53.  It's not about Amsterdam. It's about me. It's about...  Exactly.     Hazel sits at the computer screen writing a Craigslist post. Gus stands next to her.     \"Lonely, Vaguely Pedophilic Swing Set Seeks Butts of Children.\"  No?  Gus and Hazel watch as a TOWNIE finishes loading the swing set into the back of his PICK-UP. Gus salutes the swing set as the truck drives off. Then he sneaks a quick kiss on Hazel's cheek. She shoots him a look. Gus throws up his hands.  Of course I like him. 55.  It's complicated.  Hazel is at her computer reading a new email from Lidewij Vliegenthart. Clearly Hazel was not expecting this.  \"Dear Hazel, I have received word via the Genies that you will be visiting us with Augustus Waters and your mother beginning on the 4th. A week away! Peter and I are delighted and cannot wait to --  Mom?  Mom!  Sorry, I... I didn't know you were in the shower.  Did you ever call the Genies to tell them the trip is off? I just got an email from Peter Van Houton's assistant. She still thinks we're coming. 56.  What?   Really...      One week, lungs. Keep your shit together one more week...  Amsterdam!  For what?  Mom?  Ok...?  Ok.   Amsterdam!  Oh that's not necessary. 59.  It's called a Cannula. These tubes give me oxygen and help me breathe.     I dunno. Wanna try?  Right?  Well... I'd love to give you my cannula but... I kinda really need the help.  I think that's us. 60.  Have you never been on a plane before?  It's a metaphor. He puts the killing thing in his mouth but doesn't give it the power to kill him.  Ok?  This is what it feels like to ride in a car with you.  We're just friends, Mom.  Something like that.   This is Amsterdam? 62.  Good morning.  How was the park?  Mom!  What do you mean? 63.  Mom...  A 16 year old girl running free with an older boy on the streets of a foreign city famous for its vice and debauchery... is totally cool with you. Is that what you're saying?    Ok.  Wow that's good.  Thank you for letting me hijack your wish.  Oh my god.  I mean...  There are no words.  I like your suit.  That isn't the suit you wear to funerals?  It's your death suit.  I have one of those. Bought it for my 15th birthday. Don't think I'd wear it on a date, though.   Watch it. 67.  Maybe.  Undecided.  No. Well... Maybe I wouldn't go so far as to say no. I just... I'd like some evidence. What do you think?  Really?  Maybe there is no point.  I hope you're right.    Van Houten will get it. Trust me. There are like fifty Magritte references in \"Imperial Affliction.\"  Exactly.  No it's not. It's a drawing of a pipe. See? All representations of a thing are inherently abstract. A drawing of a thing is not the thing itself. Nor is a t-shirt of a drawing of a thing the thing itself.  Why is the sky blue?  I'm so excited I can barely breathe.  Trash? 72.  Um, no thanks.  Yes. We - well, Augustus, he made meeting you his Wish so that we could come here and talk to you.   Kinda. 73.  We have some questions --  About what happens, you know... after... the end of your book. Specifically to those who Anna leaves behind. Like her Mom, the Dutch Tulip Man, Sisy --  I would say... limited?   I'm sorry, sir. We don't speak Swedish.  So anyway... when the book ends, Anna's mom --  Can we please, maybe, talk about Anna for a sec? I mean, I understand that the story ends mid- sentence because she dies or she becomes too sick to continue --  - but that doesn't mean her family and everyone she loves doesn't have a future, right?        Mr. Van Houten, you said you would tell us what happens and that's why we're here. We... I need you tell me. Surely you've thought about it. I mean, as characters --  They can't! (again, has to calm  I don't want your pity --  Hey listen douchepants. You're not gonna tell me anything I don't already know about illness. I need one thing and one thing only from you before I walk out of your life and that's for you to tell me what happens to your goddman characters!  Bullshit!  Make something up.  You're really not gonna tell us?  Go fuck yourself.  I spent your Wish on that asshole.  I wanted...  Oh, um, that's alright.  I can do it.    I can do it!     What? 82.  Oh get over yourself.  I love you, Augustus Waters.  \"Get up you fat bastard.\"  I said \"get up.\"  God, what an asshole. 83.  It was awful, Mom. You can't imagine.  Then we went to the Anne Frank museum.  We just... walked around.     That was weird.  Augustus? 84.  Oh no...  Oh god.  Oh my god no!  I'm so sorry, Augustus. I'm so so  It's so unfair --  It's so fucking unfair! 85.  Does it hurt?  Ok.  I'm just... I'm very fond of you.  I don't think you're dying, Augustus. You've just got a touch of cancer.  Hazel sits with her father on the couch.  Gus had a recurrence.  You're not gonna say it?  The usual. \"Everything happens for a reason...\"  How are your eyes?  What are you talking about?        It would be an honor.  How's your love life? Anything from Monica?  She hasn't even like, texted to ask how you're doing?  That is so messed up!  How do you even know that?  Gus is in the passenger's seat. Isaac sits in the back. Hazel returns to the car. With a CARTON OF EGGS.  Ok now what?  Woo hoo!  A few days later, Gus landed in the hospital with chest pains.  How's he doing?  What about the chemo?  Can I see him?  If you don't mind, I'll just hang for a while. 92.  What are you thinking about?  Augustus...  You are.  I do know what you mean, I just... I don't agree.  This obsession with being  But I am mad! I think you're special, is that not enough?      You think the only way to live a meaningful life is for everyone to love you, for everyone to remember you. Well guess what, Gus, this is your life. This is all you get. You get me, and your family, and this world. And if that's not enough, well I'm sorry, but it's not nothing. Cause I'll remember you, I'll love you --  And I just wish... I just wish you'd be happy with that.  It's not over yet, you know.  Hazel is asleep. Suddenly, her phone buzzes. She looks at it - \"Gus\" - then she looks at the clock - 2:35am. A pit grows in her stomach. A quick panicked beat before she answers:  Hello?     What?  Hazel drives like a maniac down the street, eventually finding herself at the Speedway gas station. Gus's car is alone in the parking lot and she pulls up next to it. She gets out of her car, opens his driver's side door, and finds him sitting there, his shirt stained with vomit and blood. She gags from the smell.     I think it's infected...  Gus, what the -- why are you here? Why aren't you home?  Oh, sweetie...  I can't fix this. I have to call someone. I'm sorry.  I wish I could say Augustus Waters kept his sense of humor till the end, did not for a moment waiver in his courage and his spirit soared like an eagle to the sky...  ...but that is not what happened.  Read you something?  I know one.  \"The Red Wheelbarrow\" by William Carlos Williams.  \"So much depends / upon / a red wheel / barrow / glazed with rain / water / beside the white / chickens.\" 96.  No of course not. Um... what else... so much depends/ upon a blue sky/ cut open by the branches/ of the trees./ So much depends/ on the transparent G-tube/ erupting from the belly/ of the blue-lipped boy.  So much depends upon this observer/ of the universe...  One of the less bull-shitty conventions of the cancer genre is the convention known as the \"Last Good Day...\"  This is where the victim of cancer finds himself unexpectedly with some hours...  ... when it seems like the inexorable decline has suddenly plateaued, when the pain is for a minute bearable.  Hazel sits at dinner with her parents. She is barely touching her food.  The problem, of course, is that there's no way of knowing that your last good day is your \"Last Good Day.\" At the time, it's just another decent day.  Hi, Augustus.  I may have...  Um... sure. Is everything --  I gotta go.  I can't, I have to meet Gus. 98.  I'm not hungry.  I am aggressively unhungry, ok?    I have to go.  No!  I can't! I can't stay healthy because I'm not healthy, Mom. I am dying. I am going to die and leave you here alone and you won't have me to hover around and you won't be a mother anymore, and I'm sorry, but I can't do anything about it, ok?! Just leave me alone!  When.  I worry that you won't have a life. That you'll sit around all day with no me to look after and stare at the walls and be miserable or off yourselves or something.  You are?  So when you're waiting for me outside Support Group or whatever, you're always -- 100.  Why didn't you tell me?  Are you kidding? Mom, this is awesome! This is fantastic! Oh my god!  I'm so excited! You're gonna be so great, Mom!  I know Mom. And I will. I promise. But right now... I really gotta go.  I know, right? So, um, what's going on guys?  Late for what exactly? 101.  Why now?   How did you even get in here?  Um, no.  \"Augustus Waters was the great star- crossed love of my life. Ours was an epic love story, and I won't be able to get more than a sentence into it without disappearing into a puddle of tears. Like all real love stories - ours will die with us, as it should. I'd hoped that he'd be eulogizing me, because there's no one I'd rather have...\"   \"I can't talk about our love story so instead I will talk about math. I am not a mathematician, but I know this: there are infinite numbers between 0 and 1. There's .1 And .12 And .112 And an infinite collection of others. Of course, there is a bigger infinite set of numbers between 0 and 2, or between 0 and a million. Some infinities are bigger than other infinities. A writer we used to like taught us that. I want more numbers than I'm likely to get, and God, I want more numbers for Augustus Waters than he got. But, Gus, my love, I cannot tell you how thankful I am for our little infinity. You gave me a forever within the numbered days, and for that I am eternally grateful. I love you.\"  Hazel turns on the LIGHT by her bed. Her HOUSE PHONE is ringing and it's 4am. She knows instantly.  Augustus Waters died eight days later in the ICU...  ... when the cancer, which was made of him, stopped his heart, which was also made of him.  It was unbearable. The whole thing. Every second worse than the last.  Hazel sits in the car in the dark. She's blaring the loudest music she can possibly blare - a means of drowning out the horrors of the world. Over which we hear this:  One of the first things they ask you in the ER is to rate your pain on a scale from 1 to 10. I'd been asked this question hundreds of times and I remember once, early on, when I couldn't catch my breath and it felt like my chest was on fire, and the nurse asked me to rate the pain and though I couldn't speak, I held up 9 fingers.  Later on, when I'd been feeling better, the nurse came in and she called me a fighter. \"You know how I know,\" she said. \"Because you called a ten a nine.\"  Hazel puts on her funeral dress. She looks in the mirror.  But that wasn't the truth. The reason I called it a nine was... I was saving my ten. 105.  And this was it. The great and terrible ten.  He loved you so much too.  It's ok, you hear me? It's ok.  I was his girlfriend.  There's a beautiful quote in Gus's home that reads \"if you want the rainbow, you gotta deal with the rain.\"  I didn't believe a word, of course. But that was ok. Funerals, I'd decided, aren't for the dead. They're for the living. 107.  I'll be fine.  No, I'd... I'd like to be alone for a while.  How did you even --  And you just... bought a ticket?  You read your fan mail now? 108.  I'm so not in the mood --  Goodbye Mr. Van Houten.  Nope. Thanks though. Have a great life.     She had leukemia? Like Anna?  Were you married then?  Well I'm sorry for your loss. 109.  You didn't ruin our trip, you asshole. We had an awesome trip.  You think I care about that? I don't give a shit, Van Houten.  You're a drunk and a jerk and a failure. And I'd like you to get out of my car right now so I can go home and grieve.  Get out of the car!  Hazel lies in front of the TV. \"Top Model\" is playing but she's lost in her own world. Tears fall from her eyes and she can't do anything to stop it. Hazel gets up.     He was really fighting for breath, I guess. He eventually went unconscious, but it seems like, yeah, it wasn't great or anything. Dying sucks.  Happens all the time.  Very. 111.  I know.  I know.  I didn't find it that annoying.  He is not my friend and -- how do you know about that?  Yeah well I'm over it. I never want to read another word of that asshole's again.     I... I have to go. I... Are you...? 112.  Hazel is inside the car, rummaging crazily through the trash in an effort to find what Van Houten gave her. She's about to give up when she sees it - crumpled up into a ball beneath the passenger's seat. She reaches under, pulls it up, and unwraps it. As she reads, WE HEAR:  Hazel walks out to the grass behind her house, the oxygen tank dragging behind her. She lays down on the grass and looks up at the stars - the same IMAGE that opened the movie.  Ok.",
        "Frannie": "... she eats like a bird. She barely leaves the house,  ... she reads the same book over and over...  ... some days she won't even get out of bed.  She's gone a few times.  Hazel.  It's Friday night.  I was just thinking... you should call your friends, see what they're up to.      Of course not, no. I...  I have errands to run.  Love you.  Make some friends!  Hi sweetheart. Ready for some \"Model?\" 16.   Are you ready, sweetie?  That's different.  Did he give it to you?  I'm sure he'll call, don't worry.  Dr. Maria called today. The PET Scan is set for the eighth.  I told you Support Group was a good idea.  What's wrong?!     Hazel, I... I love you and... you know I'd do anything for you, but we don't... We don't have the money. The expense of getting equipment over there - love, it's just not possible...  I mean, I could talk to your father  Something to drink?  Are you out of your mind?  It's too much, Haze. We can't accept something like that from a virtual stranger.  Really?  It's still \"no,\" I'm afraid.  What?    Still silent. Michael drives, trying to keep it together. Frannie's in the back with Hazel's head in her lap. Hazel continues to scream in silence, whether from pain or terror, we do not know.  They thought it was a brain tumor.  The usual. Fluid in the lungs, preventing oxygenation. They put that in...  Drained a liter and a half last night.  This is just a thing Hazel. It's a thing we can live with.   Are you ready, sweetie?  I won't be a mom anymore. 49.    We'll be right outside.  What is it, what's wrong?!     I'm not supposed to tell you until your father gets home. We're going to Amsterdam.  Dr. Maria called last night and made a convincing case that you need to live --  I'm getting back in the tub now.  Amsterdam! 57.  We can't eavesdrop, Hazel.  Amsterdam!  (not looking up from her  We're from Indiana.  Actually, it's five o'clock.  Never made it.  What? I like watching you sleep.  I promise I'll do crazy Mom stuff tonight while you and Gus are at dinner.  You have reservations at a place called Oranjee. Mr. Van Houten set it up. Very fancy according to the Book. And romantic.  I'm just saying...   Let's get you dressed!   Hazel! Gus is here. Looking sharp.  I really don't get that shirt.     But it is a pipe.  When did you get so grown up? I feel like it was yesterday I was telling 8-year old Hazel why the sky was blue. You thought I was a genius back then.     And then what happened?  And after that?  Sounds lovely.  Listen... I'm gonna stretch my legs a little. Give the two of you some time to talk.  Finish eating first.  You haven't eaten a thing.  You can't not eat, Hazel.  Sit down.  You have to eat, Hazel. You're not gonna starve yourself to death just because Gus is sick. You have to stay healthy --  You heard me?  You heard me say that to your father? 99.  Oh god, sweetie. I'm sorry. I was wrong, ok? It wasn't true. It's not something I believe.  As long as either of us is alive, I will be your mother. Even if you die, I --  Even when you die, I will still be your mother. I will always be your Mother.  We're not gonna off ourselves. It's gonna hurt like hell to lose you  I don't just sit around, you know.  I'm taking some classes. Online. To get my master's in social work.  Working or reading. If I get my MSW, I can council families in crisis or lead groups dealing with  Thank you. That means everything to me.  I'd still really like you to eat.  Are you sure? We can drive you --",
        "Gus": "Ooph. Sorry!  My bad. No, it's... For a brief moment, the Earth stops. They stand looking at one another. Hazel is speechless.  Hi. I'm Augustus Waters. 17. Had a touch of osteosarcoma bout a year and a half ago - lost this baby as a result... 11.  But really I'm just here at Isaac's request.  Me? Oh I'm grand. I'm on a roller coaster that only goes up, my friend.  My fears?  Oblivion.  Yeah, see... I intend to live an extraordinary life. To be remembered. If I'm scared of anything it's... not doing that.  Literally.  I thought we were in a church basement but apparently we were literally in the heart of Jesus.  What's your name? 13.  No your full name?  I didn't say anything.  Because you're beautiful.  I enjoy looking at beautiful people and I decided a while back not to deny myself the simpler pleasures of existence. Particularly given that, as you so astutely pointed out, we're all gonna die pretty soon.  Hey Alisa.  \"Always\" is their thing. They'll \"always\" love each other and whatnot. Must have texted \"always\" to each other at least four million times this year.  Let's watch a movie.  No I mean now.  Hmm?  I've got a car.  There is that possibility. Come on Hazel Grace... take a risk.  Whole thing?  Hamartia?  They don't hurt you unless you light them.  I've never lit one.  It's a metaphor. See? You put the thing that kills you between your teeth. But you don't give it the power to do the killing.  Hazel is terrified. Turns out, Gus is the world's worst driver. When he brakes, her body flies forward against the seatbelt. And when he hits the gas, seconds later, her neck snaps back in the seat. Gus sees the look on her face.  I failed the test a couple times.  Most amputees can drive with no problem but... yeah. Not me.  Tell me about it!  The fourth time I took the test... it was going about how this is going... and when it was over, the instructor looks at me and goes, \"your driving, while unpleasant... is not technically unsafe.\"  Total cancer perk.  So what happened to you? 17.  Gus has one eye on the road, the other on Hazel. He was impressed with her before. He's totally dazzled now.  Wow.  So are you back in school or...?  Why not?  A college girl! Well that explains the aura of sophistication...  We're here.  Hazel follows Gus inside. She quickly notices all sorts of engraved plaques and framed signs with phrases like \"Home is Where the Heart Is\" and \"True Love is Born from Hard Times.\" Hazel looks at Gus quizzically.  My parents call them \"encouragements.\"  Don't ask.  Hey guys.  Augustus, hi. New friend? 20.  This is Hazel Grace.  How's it going, Just Hazel?     I used to play.  These are mine. And these. The rest of it's just cancer perks.  I understand. 21.  You ok?  So what's your story?  Not your cancer story. Your story. Interests, hobbies, passions, weird fetishes...  Don't tell me you're one of those people who becomes their disease.  I reject that out of hand.  Think of something you love. First thing that comes to mind.  Ok. What's that?  Does it have zombies?  Stormtroopers. 22.  Sounds horrible.  Interesting. What's it about?     ... all I ask is that you read this brilliant and haunting novelization of my favorite video game.  Your hands are cold.  Ooh Hazel Grace... I love it when you talk medical to me. 23.  Hazel Grace.  Me? Yeah. I'm excellent.  Isaac's head is buried in Gus's couch. He's wailing like a banshee, having some kind of nervous breakdown.          Isaac! Focus. On. Me.      Hazel descends the steps. She hears an ungodly moan before she sees anyone. What has she gotten herself into? Gus appears at the base.   Isaac, Hazel from Support Group is coming downstairs.  A gentle reminder: Isaac is in the midst of a psychotic episode. You look nice, by the way.  Seems Isaac and Monica are no longer a going concern.  He just wants to cry and play video games.  It doesn't hurt to talk to him, however. If you have any sage words of feminine advice...  \"Pain demands to be felt.\"  That could be an \"encouragement.\" 27.  Isaac...?  Here we go...  That's it! Punch that thing.  I've been wanting to call you on a nearly minutely basis but I have been waiting until I could form a coherent thought in re: \"An Imperial Affliction.\" I can't stop thinking about it.  The only problem is the ending.  It's torture! I mean, I totally get that she died or whatever - Anna. But there is an unwritten contract between author and reader and I think ending your book in the middle of a sentence kind of violates that contract.  Yeah like her Mom.  Sysiphus the Hamster...  Have you tried contacting this... Peter Van Houten?  Sad. Hang on.  Isaac!  Pillows don't break.  You need to break something.  Go to town, my friend.  I've been looking for a way to tell my Dad that I kinda hate basketball. Think maybe we've found it.  Feel better? 29.  That's the thing about pain... it demands to be felt.  Gus  in bed, a laptop on his chest.  Hazel Grace.  So I read it again. And I just kept feeling like... like it was a gift. Like you'd given me something important.  On the other hand... we need closure, don't we? 30.  Yes. We need to know what happens to Anna's family after she dies.  But he never wrote back.  Because he's a recluse.  Utterly unreachable.  \"Dear Mr. Waters... I am writing to thank you for your electronic correspondence received this 6th of April.  \"I am grateful to anyone who sets aside the time to read my book...\"  I found his assistant. I emailed her. She must have forwarded it to him.  Shall I continue?  \"I am particularly indebted to you, sir, both for your kind words about `An Imperial Affliction' and for taking the time to tell me that the book, and here I quote you directly, `meant a great deal' to you.\"  \"To answer your question: No, I have not written anything else, nor will I. I do not feel that continuing to share my thoughts with readers would benefit either them or me. However thank you again for your generous email. Yours most sincerely, Peter Van Houten.  Hazel Grace, could I, with my meager intellectual capabilities, make up a letter from the great Peter Van Houten?  Indeed.      Not bad. 33.  Bit pretentious. But then again, Van Houten uses words like \"tendentious\" and... \"bacchanalia\" so I think he'll like it.  Guess so.  Ok...  Ok...  Perhaps \"ok\" will be our \"always.\"  Ok.  Just use your wish.  What'd you do?  Not Disney.  Tell me you did not go to Disney World.  Hazel Grace! You did not use your one dying Wish to go to Disney World!   Oh my God!  That is the saddest thing I've ever heard!  Now I'm embarrassed.  How can I have a crush on a girl with such cliche wishes?  What?  It is indeed.  Hi Hazel. How would you like to go on a picnic?  I'm great Mrs. Lancaster. 39.   Didn't cut this fella off for the hell of it. Though it is an excellent weight-loss strategy. Legs are heavy!  N-E-C for fourteen months.  I'm very lucky.  Every last one. Probably why I'm still a virgin.  See this? This circle is virgins...  And this... is 17 year old dudes with one leg.     And he is. Much like Rik Smits. And tulips.  Sandwich?       How cool is that? A skeleton being used as a playground.  Speaking of which...  You're probably wondering why you're sitting here eating a bad cheese sandwich and drinking orange juice with a guy in a Rik Smits jersey.  Hazel Grace, like so many before you - and I say this with great affection - you spent your Wish... moronically.  Hush! I'm in the midst of a grand soliloquy here.  You were young. Impressionable. The Grim Reaper staring you in the face. And the fear of dying with your one true Wish left ungranted led you to rush into making one you didn't really want, for how could little Hazel Grace, having never read \"An Imperial Affliction\" ever know that her one TRUE wish was to visit Mr. Peter Van Houten in his Amsterdamian exile.  If you were smart, you would have saved your wish til the time in your life when you really knew your true self. 42.  Good thing I saved mine.  Got it in exchange for the leg. And I still have it.  I'm not gonna give you my Wish or anything. But I too have an interest in meeting Peter Van Houten and it wouldn't make much sense to meet him without the girl who introduced me to his book, now would it?  I talked to the Genies and they're in total agreement. We leave on May third.  Because Hazel Grace... I found my Wish.  Mr. Lancaster! How's she doing?  They won't let me in. Family only.  No I get it. Will you just... will you tell her I was here? 47.  Hazel Grace!  Are you crying, Hazel Grace?  What's the matter?  I demand to see this swing set of tears.  I see your point. That is one sad swing set.  You do realize... trying to keep your distance from me will in no way lessen my affection for you.  All efforts to save me from you will fail.  Is this about Amsterdam? Cause we  Grenades.  I get it. One day you're going to explode in a huge ball of fire and everyone close to you will die in your wake.  There's already two people in your life you're going to destroy. Why add a third to that list. Am I right?  We have got to do something about this frigging swing set.  \"Desperately Lonely Swing Set Needs Loving Home.\"  That's why.  In case you were wondering... that's why I like you.  You're so busy being you that you have no idea how utterly unprecedented you are.  Friendly.          Ok.   I don't smoke.  We're flying! Look! 61.  Holy -- look at that?! NOTHING HAS  She is. I'm not.  I'll be right down the hall.  Thank you ma'am.  Wow.  You look gorgeous. 64.  Ok.  The chef's choice sounds lovely.  And can we get more of this?  Thank you for coming to Amsterdam.  Thank you for wearing that dress which is like whoa.  Yeah?  That is just...     I want this dragon carrot risotto to become a person so I can take it to Vegas and marry it.  Thanks. First time wearing it.  Oh no. That one's not nearly this nice.  When I first found out I was sick - I mean, they told me I had like an 85% chance to be cancer-free. Great odds, sure. But that meant a year of torture, the loss of my leg, and still a 15% chance it might fail. So right before the surgery I asked my parents if I could buy a suit, like a really nice suit, just in case I didn't make it.  That's what it is.  Are we on a date?  God?  Angels?  Afterlife?  Absolutely.  Oh for sure. I mean, not like a heaven where you ride unicorns, play harps, and live in a mansion made of clouds but, yeah, I believe in something.  Something becomes of us. It has to. Otherwise what's the point?  I refuse to accept that. I won't accept it.  I'm in love with you. 68.  You heard me.    I'm in love with you. And I know that love is just a shout into the void, and that oblivion is inevitable, and that we're all doomed and that there will come a day when all our labor has been returned to dust, and I know the sun will swallow the only earth we'll ever have, and I am in love with you.  Sorry.  Just the check, please.  Who's ready for some answers! 70.  As opposed to other days...?  Maybe he can't hear over the music?  Mr. Van Houten?  It's 11am.  Incidentally, thank you for dinner last night.  Um...  Are you messing with us?  Is this some kind of performance?     Hey. It's ok. It's ok...  I'll write you a sequel.  I will. Better than any shit that drunk could write. With blood and guts and sacrifice. You'll love it.  You did not spend it on him. You spent it on us.  I know... I know. Apparently the world is not a wish-granting factory.  I'm not going anywhere with that monster.    You're a champion.  That's enough --  We're at the top. That's it.  They fall onto Gus's bed, kissing. Hazel is very in the moment and now it's Gus who seems nervous. As they kiss:  It's above my knee.  It tapers a little and then it's just skin --  My leg. Just so you're prepared --  I love you too, Hazel Grace.  \"I can't stand up, I'm too drunk.\"  \"Standing is for fools!\"  Shall we?  There's something I have to tell you...  Just before you went into the hospital... There was this... I felt this... ache in my hip.  I had a PET scan.  It lit up like a Christmas tree, Hazel...  The lining of my chest, my liver... everywhere.  I'm sorry too --  I should have told you --  Apparently the world is... not a wish-granting factory.  Don't you worry about me, Hazel Grace. I'll find a way to hang around and annoy you for a long time.  It's ok. I'm ok.  Ok.  What?  I don't suppose you can forget about it, treat me like I'm not dying.  Would it be absolutely ludicrous to make out right now? 86.  Gus lays in bed, eyes open, a PICC line now being fed through a port in his chest. Chemotherapy at work. Hazel and Isaac are keeping him company.  I hate to one-up you but... seems my entire body is made out of cancer now, so...  Whoa, I'm taken.  Dude.  I haven't asked her.  I need speakers at my funeral. I thought maybe you and Isaac... but especially you --  Would you be kind enough to whip something up?  Hazel Grace!  Do you happen to have four dollars? 89.  Oh it's there.  Who cares where she is? This is not about her. This is about you.  Hazel...  A little to the left.  Aim left. 90.  Lefter.  Yes! Excellent! And throw hard.  Bullseye!  No you missed it by like 20 feet.  Try one more time.  Keep throwing, keep throwing!  Are you Monica's mom?  Hello ma'am. Your daughter has done an injustice and we've come here seeking revenge. We may not look like much. Between the three of us, we have five legs, four eyes, and two and a half working lungs. 91.  But we also have two dozen eggs. So If I was you, I would go back inside.  Oblivion.  I know it's kid's stuff but... I always thought I'd have a grand story to tell, you know? Something that would run in all the papers. I always thought I was special.  Yeah but... you know what I mean.  What?  Don't get mad --    You're right --  You're right. I'm sorry.  I'm sorry.  It's a good life, Hazel Grace.     I'm at the gas station -- 94.  Something's wrong. You gotta... please come help me.     No! Please! Hazel, listen to me. Do not call 911 or my parents -- I'll never forgive you -- Don't, please.  Please just look at it.  I wanted to buy some cigarettes. I lost my pack. Or they took it. 95.  I don't know. They said they'd get me another one but I wanted... to do it myself. Do one little thing myself.  No, Hazel, please!   I hate myself I hate myself I hate this I hate this...  Read me something.  Do you know any poems?  Read it to me.     Gus comes home from the hospital. He does not look good - but he lives. Hazel is there to help get him inside.  Gus no longer sleeps in his basement. Nor does he sleep in his own bed. He sleeps in a HOSPITAL BED set up in a guest room. Hazel is with him. They're watching sports on TV.  Hazel and Gus getting some fresh air. She sits there reading a book. Gus just sits there. His eyes staring off into nothing. Hazel waves to him. Gus looks over, as if waking from a dream. She manages a smile. He manages one back.  Good evening, Hazel Grace.  Quick question for you. Did you ever write that eulogy I asked you to prepare?  Excellent. Do you think you could find yourself at the Literal Heart of Jesus in 20 minutes.  I love you Hazel.  Hazel Grace, you look ravishing.  I wanted to attend my funeral. By the way, will you speak at my funeral?  Sweet. I'm hopeful I'll get to attend as a ghost, but just to make sure, I thought I'd - well, not to put you on the spot, but I thought I'd arrange a pre-funeral.  No time like the present.  Would you believe they leave the door open at night?  As well you shouldn't.     Thank you Isaac.  Hey don't swear in the Literal Heart of Jesus.  Hazel Grace, it's down to you. 103.  Mr. Van Houten, I'm a good person but a shitty writer. You're a shitty person but a good writer. We'd make a good team. I don't want to ask you any favors but if you have the time, and from what I saw you have plenty, please fix this for me. It's a eulogy for Hazel.  She asked me to write one and I'm trying, I just, I could use a little flair. See the thing is... we all want to be remembered.  We all want to leave a mark.  But not Hazel. Hazel is different. Hazel knows the truth. She didn't want a million admirers, she just wanted one. And she got it. Maybe she wasn't loved widely but she was loved deeply. And isn't that more than most of us get?  When Hazel was sick, I knew I was dying. But I didn't want to say so. 113.  She was in ICU and I snuck in for ten minutes and sat with her before I got caught. Her eyes were closed, her lungs were intubated...  ... but her hands were still her hands, still warm, and the nails painted this dark blue back color and I just held her hands and I willed myself to imagine a world without us and what a worthless world that would be.  She's so beautiful. You don't get tired of looking at her. You never worry if she's smarter than you cause you know she is. She's funny without ever being mean.  I love her, god I love her. I'm so lucky to love her, Van Houten. 114.  You don't get to choose if you get hurt in this world but you do have a say in who hurts you.  I like my choices. I hope she likes hers.  Ok, Hazel Grace?",
        "Hostess": "Your table, Mr. And Mrs. Waters.  The champagne is our gift.",
        "Dr.": "That's out of the question.  The PET scan is encouraging. We just don't know how long it'll stay that way. What if you get sick in a foreign country?  Be that as it may, without someone familiar with your particular case, I can't --  It's a strange case. Normally the tumors start resisting the treatment. But that hasn't happened here - yet.  Unfortunately, the drug may be worsening the edema. 48.  But if we stopped it entirely, we're likely to face even graver dangers.  That's what we have to decide. The truth is... very few people have been on Phalanxifor as long as Hazel has. We don't really know the long term effects.  You would not be considered a... strong candidate for a transplant.  We're trying to prevent endothelial growth while at the same time preventing immunosorbent...  Yes Hazel.  That would not be wise at this juncture.  Excuse me?    It would... increase some risks --  Yes but an airplane?  You're Stage IV -- 50.  Because, Hazel. Look, I don't know any other way to say this... You're just too sick.  I'm sorry.",
        "Simmons": "It's a strange case. Normally the tumors start resisting the treatment. But that hasn't happened here - yet.  Unfortunately, the drug may be worsening the edema. 48.  We're trying to prevent endothelial growth while at the same time preventing immunosorbent...  That would not be wise at this juncture.  Excuse me?    You're Stage IV -- 50.  Because, Hazel. Look, I don't know any other way to say this... You're just too sick.  I'm sorry.",
        "Monica's": "What in God's name --",
        "Maria": "That's out of the question.  The PET scan is encouraging. We just don't know how long it'll stay that way. What if you get sick in a foreign country?  Be that as it may, without someone familiar with your particular case, I can't --  But if we stopped it entirely, we're likely to face even graver dangers.  That's what we have to decide. The truth is... very few people have been on Phalanxifor as long as Hazel has. We don't really know the long term effects.  You would not be considered a... strong candidate for a transplant.  Yes Hazel.  It would... increase some risks --  Yes but an airplane?"
    },
    "imdb_rating": "7.7",
    "description": "Hazel and Augustus are two teenagers who share an acerbic wit, a disdain for the conventional, and a love that sweeps them on a journey. Their relationship is all the more miraculous, given that Hazel's other constant companion is an oxygen tank, Gus jokes about his prosthetic leg, and they meet and fall in love at a cancer support group.",
    "name": "The Fault in Our Stars",
    "genres": [
        "Drama",
        "Romance"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNTVkMTFiZWItOTFkOC00YTc3LWFhYzQtZTg3NzAxZjJlNTAyXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}