{
    "filename": "Sting,-The_script.txt",
    "imdb_id": "tt0070735",
    "imdb_url": "https://www.imdb.com/title/tt0070735",
    "characters": [
        "Luther Coleman (as Robertearl Jones)",
        "Floyd - Bodyguard",
        "Kid Twist",
        "Henry Gondorff",
        "Doyle Lonnegan",
        "Lt. Wm. Snyder",
        "Billie",
        "Eddie Niles",
        "J.J. Singleton",
        "F.B.I. Agent Polk",
        "Mottola (as James J. Sloyan)",
        "Bodyguard",
        "Loretta",
        "Johnny Hooker",
        "Erie Kid"
    ],
    "dialogues": {
        "Kid": "Hey, Luther told me he was carrying a wad, but I didn't figure this much.   Straight north.  He was gonna take it all and run.   Aw come on, it was the only thing to do.  He knew he was holdin' ya back.   If you saved a little, you wouldn't have to grift so much.   You could buy yourself some things. Clothes, or a nice car...   Forget it.  They walk on a few more feet, when suddenly a police car pulls up alongside them and two men jump out.  The first, a uniformed policeman, grabs Eirie around the neck.  Hooker makes a break for it, but the second Figure, a burly detective named Snyder, tackles him in the middle of the street, drags him back into the alley and plasters him up against a brick wall.  The two have met before.   I thought you blew all your money.    What the hell you gonna do when Snyder rushes his finger right to Lonnegan?  You're committin' suicide, kid.   Listen to me, Hooker.  What ever you do, don't go back to your place tonight, don't go anyplace you usually go, ya hear me?  Get outa town or somethin', but...  Hooker, still getting no answer, slams the phone down and blasts out of the booth.   Hello, Snyder.  What are you doin' up here?   Yeh, he packed it in and enrolled in detective school.  Snyder, in no mood for jokes, grabs Eirie by the hair and slams his face into the table.  Eirie just stays there; he knows it doesn't pay to assault a detective.  Twist is watching all this intently from the viewing port.    Names's Joe Eirie.  Twist waits for more, but it's not coming.   No.   No...I never played no Big Con before.  But Luther Coleman was a friend a mine.  I thought maybe there was something I could do.   C'mon War Eagle.  That Dancing Cloud's a hell of a finisher.  War Eagle's gonna have to open up a little more on 'em.   Naw, he's never done much.  Probably in here just to round out the field. War Eagle's where you wanna have your money.  Eirie excuses himself and heads for the bar.    Yeh, sure.   Who you got?   Me too.  Maybe it's our day.  Lonnegan nods and wanders away.  Hooker comes over to him.   We won!  We won!  You hear that!  I won 30,000!  You hear that!  Yeh, Lonnegan heard that.  Lonnegan shakes loose, grabs his coat and heads for the door.",
        "Twist": "(showing Hooker photographs of three men These are Combs' favorite torpedoes. Riley and Cole.  We recognize Riley and Cole as the two guys who got into Mottola's cab.   They do most of the small jobs, but Lonnegan might not wanna use 'em on you 'cause they're kinda messy.  No class.  We go to Hooker.  He's real grateful.  Billie, wearing an evening dress, enters the room and begins gathering up the empty beer mugs on the table.   We got reason to believe Riley was the guy who hit Luther.  But if you see either one of these two, find yourself a crowd, or take 'em someplace you know you can handle 'em.   No.  They're just the only ones we know of.  Billie has finished  gathering the mugs, and leaves the room with them.  We follow her down the hall and into the:   Lotta plungers ride that train just to play him.   What are you going to do, con the payoff to a gambler?   We'll take it.  You manage the building at the end of the alley?   I'll need a room over there that faces this way.  How much a week?    This is the last time I expect to see you down here.    You wanna work flat rate or percentage?   Doyle Lonnegan.    How ya doin', Lacey.   Coupla days ago.  I'm workin' a big one with Gondorff on the North Side.  The two men sit down together, apart from the others.   Listen Duke, we're setting up a wire store.  I need a twenty man boost right away.   These guys have gotta be the quill, Duky.  We can't afford to rank the joint.   (taking a look through the viewing port No.  Never saw him before.  He's a dick, though.  Snyder walks all the way to the back, and then retraces his route.  About halfway back, he stops at one of the tables, recognizing a grifter he knows.  It's the Eirie Kid.   Good, have 'em down at Stenner's old Pool Hall before 3:00.  We're gonna run through the route tonight.   Don't worry about it, pal.   You ever played the Wire, Curly?   All right, Curly, you're in.  We got a rack of suits over there. Get yourself a nice tweed one.   You the Duff that didn't come up with his end when Little Jeff was sent up?   He was a con man, wasn't he?    Shove off, Duff.  Duff stands there a second and then slouches away from the table.  He stops however, by the door.  The next man up is the Eirie Kid.  Twist knows he's seen him somewhere before.   You played for any particular mobs?   You know the Wire at all?   (pointing to Eirie slightly swollen nose You get that nose in Duke Boudreau's tonight?  Eirie nods a reluctant \"yes.\"   You got moxie, Eirie.  Get yourself a suit.  Eirie is so happy, he can barely blurt out a thank you. Buck Duff, enraged that Twist would hire a total amateur, turns in disgust and strides vengefully out of the store.   Bluenote at 6 to 1 on the nose.  The receiver clicks down at the other end.  Lonnegan hangs up and goes out the door, followed by his entourage.   All right, when?   Okay, Tootsie.  Hooker blows a mock kiss through the phone and hangs up.  He turns to leave the booth, when suddenly he sees something that stops him cold.  There looking through the glass is the smirking face of Detective Synder.  Hooker is immobilized.  Snyder puts his hand inside his coat and slowly draws out his gun.  He points it right at Hooker's face and then violently smashes all the glass in the upper half of the door with the barrel.  Fragments of glass spray into the booth, a couple of which imbed themselves in Hooker's cheek.  Hooker quickly whips open the door, trapping Snyder's hand in the accordian and jarring loose his gun.  Hooker sprints out of the booth as Snyder scrambles for his pistol and gives pursuit.    Excuse me.  We're here to paint Mr. Harmon's office.   We'll try and hurry so we don't keep you out of your office too long.   Hour or two at the most.  We do good work.  Harmon is resigned.  Twist and Singleton pick up their gear and march into the office.  Once inside, we notice that the office has an exit door which opens to an outside alley. Twist immediately removes his overalls, revealing the suit and tie he's wearing underneath.  He takes out a picture of himself, a woman and three small children, and puts it on Harmon's desk, replacing a similiar picture of Harmon's family.  Singleton, meanwhile, has spread a few tarps and begins to paint the walls.    What the hell's the matter with you. We coulda met at a club or somethin'.    Well we can't talk in here.  They're having the place painted.  Twist walks over to the intercom on his desk.  He leaves the door open so that Lonnegan can get a good look at the office, Twist's picture in it, the painter, etc... Lonnegan's not missing any of it.    Miss Barnes, I'm going home a little early today.  Tell anyone that calls that they can reach me here in the morning.  Thank you.   Can't do it.  There're telegraph inspectors all over the place.  I got 750 grand coming in from the coast, and I'm not gonna blow it for a lousy 14 gees.  We'll get somebody else to do our betting.   But who says you will.  I got a guy I can depend on.  He's liquidating everything he has for this.  You wouldn't even give Carver his money back.    On a 6-1 shot?  The hell with ya. We'll keep the deal we got.    We were getting 50 from our guy.   Yeh, and what if we play tomorrow and he doesn't come up with the money.  We risk our whole operation for nothing.  I'll say when we make our bets.   All right.  Be at the booth at 1:00. I'll give you all three places this time, Lonnegan.  That better be proof enough.  Hooker and Lonnegan smile at each other like life-long friends.  They get up to leave, and we frame the shot with a coffee cup large in the foreground.  As they go out the door, a black-gloved hand with four fingers enters the frame and puts a nickel down next to the cup.    Billie enters and gives Twist the piece of paper she wrote the race results on.  He picks up the phone and starts to dial.   Sorry, but I just couldn't wait. Did everything go all right?      On the nose!  I said place.  Place it on Syphon.  That horse is going to run second.  Lonnegan looks like he's just been stabbed.  He vaults over the table to the teller's window and grabs Niles.",
        "Henry": "",
        "Gondorff": "The room inside if small and cluttered, consisting of a bed, a sink, and a bathroom, all covered by a layer of books, dirty clothes and beer bottles.  Draped over a chair, fully dressed, but completely passed out is the one and only Henry Gondorff.   Turn the goddamn thing off, will ya.   I can talk, can't I?  Hooker makes no move to get up.  Gondorff struggles to his knees, turns off the water, and slumps back against the wall. The two men just look past each other a second.  Down in the bottom.   Glad to meet ya, kid.  You're a real horse's ass.    I'm sorry about Luther.  He was the best street worker I ever saw.   Aw, I conned a Senator from Florida on a stocks deal.  A real lop-ear. He thought he was gonna take over General Electric.  Some Chantoozie woke him up, though, and he put the feds on me.    Luther didn't tell me you had a big mouth.   No, I lammed it around for a while while things cooled off.  Philly, Denver, Baltimore, nuthin' towns.  Hooker's disappointment is obvious.   But don't kid yourself, friend, I still know how.  Hooker nods, unconvinced.   (getting up from the floor and emptying the water out of his pockets You gonna stay for breakfast, or do you already know how to eat?    Lonnegan after you, too?   You never do, kid.  We go to Hooker.  He hadn't thought of that.   Fine, Billie.    Great little countess, that Billie. Runs a good house up there, too. One of the few left that Luciano doesn't own.  Gondorff walks around on the carousel, checking straps, bearing and poles.  Hooker follows him.   (on his back, checking underneath one of the horses You didn't act much like you wanted to learn it.    You know anything about him?   (going over to start the machinery And a packing company, a chain of Savings and Loans and half the politicians in Chicago and New York. There ain't a fix in the world gonna cool him out if he blows on ya.    Why?   You can't do it alone, ya know.  It takes a mob of guys like you and enough money to make 'em look good.   This isn't like playin' winos on the street.  You gotta do more than outrun the guy.   (going right on, ignoring Hooker's remark You gotta keep Lonnegan's con, even after you spent his money.  And no matter how much you take from his, he'll get more.   Right down to my socks, turkey.  If I'da been half as scared a that lop-ear, I wouldn't a fallen asleep on 'em.  Lonnegan might kill me, but at least he won't bore me to death.   If I can find a mob that'll risk it. But no matter what happens, I don't want you comin' back to me halfway through and sayin' it's not enough... cause it's all you got.  Hooker nods.  Gondorff switches on the carousel and steps back to admire his handiwork.  The carousel makes a grinding sound, does a few lurches and stops cold.   But most of all let us know.  If they got a hit on you, we gotta fold up the con.  You're too exposed.  You got that?  Hooker nods, but we know he hasn't really got that.   Everybody'll sit still for somethin'. What did ya find out about the train, Eddie?   Wonder why he doesn't fly both ways.   Fancies himself a gambler, huh?    See J.J., he's slowly down already.   We'll use the wire.  Never known a gambler who wouldn't like to beat the ponies.   That's why he won't know it.   We'll give him the hook on the train, and play him here.  You think I can get in that poker game, Eddie?   I also gotta win.  He looks at Hooker.  There is a challenge in their book. Gondorff smiles broadly, then casually, to them all.   By the way, any of you guys been passing off any green goods lately?  We go around the table.  No reply.   Billie, if that Dick comes in again, stall him till I can get a look at him.  And let me pay ya for these beers.    Naw, I want ya to have this.  He hitches up Billie's skirt, and puts the bill in her garter.   Don't look at it till ya go to bed though or it'll turn to paper.  Billie smiles and leaves the room.    Guy in the blue pinstripe and grey fedora.  Hooker looks and finally spots him in the crowd.  We go back to Lonnegan, as he moves off from the cigar counter, toward his train.  Hooker watches him with the intensity of one gazing on a religious object.    Neither are we.   I hear there's a friendly poker game on this train tonight.  You know anything about that?   You think you could get me in that game?    Gondorff is rapidly shuffling cards to four empty places. He is alone.  He looks up as Singleton enters.   Yeh, I think so.  I gave the kay- ducer a C-note.  You find out the deck?   Nice work, J.J.  Singleton slips out as Gondorff unpeels the packs.    Gondorff is still practicing.  He looks up as Hooker enters and tosses him the wallet.   Fifteen grand.  Looks like he's expecting a big night.  He takes out his own wallet and puts the money in it, and tosses the empty wallet back to Hooker, and resumes his shuffling and dealing.  Hooker sits back silently and watches him.   Let him wait.  As he deals, on the second pass he attempts to cut from the bottom, muffs it completely and sprays half the deck on the table.  Hooker regards him steadily as he gathers them back up.  Gondorff finally meets his gaze.   You just worry about your end, kid.    Gondorff is standing in front of the mirror dressing.  He grabs up a clean white shirt and rumples it up in his hands. He then picks up a half-full bottle of bourbon.  Hooker gives him a disapproving look.  Gondorff smiles and pats some on his face.   Sorry I'm late boys.  I was takin' a crap.  This bit of grossness does little to improve his image.   Yeh, that'd be real nice of ya, Mr. Lonneman.    See ya and raise three.   Five and call.  Lonnegan lays down his hand, a solid two pair.  Gondoroff turns out three tens.  Lonnegan is beat.   Tough luck, Lonnihan, but that's what you get for playin' with your head up your ass.  Couple more like that and we can all go to bed early, huh boys.  Lonnegan burns, and the \"boys\" have no comment.   Raise 300.   Two and call.  Jameson lays down two pair.  Gondorff has a flush.  Gondorff rakes in the chips, which now put him ahead of Lonnegan.   Don't worry about it, pal.  Lemongan here wouldn'ta let you in the game if you weren't a chump.    Just take it easy there, Larrabee.  Jameson and the conductor step in between.   Raise 1,000.    Raise 2,000.  The spectators shift a little.  It's the biggest bet of the night.    Raise 5,000.  Lonnegan fingers his remaining chips.  He knows he's won, but he wants to bleed it for every bit of suspense.   Call.  Lonnegan puts down his four nines.  Gondorff just stares at them a second, lets out a deep sigh and lays down four jacks. Lonnegan is aghast.  This just can't be.  He glances at Floyd, who can do nothing but sit there with his mouth open.    Well that's all for me tonight, boys.  I'm gonna leave ya some cab fare.  The other players look at each other in disgust, and reach for their wallets, all of which are well stocked.    You owe me 15 grand, pal.  Lonnegan, with a stare that could kill, reaches for his wallet.  Suddenly the stare goes soft.  He tries a few more pockets.  No soap.    What!  Don't give me that crap you little weenie.  How do I know you ain't gonna take a powder. (waving his wallter, which is full of Lonnegan's money You come to a game like this, you bring your money.  Lonnegan, having had all he can take, goes for Gondorff, but is restrained by the conductor.   All right, buddy, I'm gonna send a boy by your room in five minutes, and you better have that jack, or it's gonna be all over Chicago that your name ain't worth a dime.  Gondorff stalks out of the room.  We pick him up coming down the passageway to his compartment.    The drunkenness has vanished.  We follow him into his cabin, where Hooker is waiting anxiously.    Well we got some workin' money anyway.  Gondorff tosses his winnings on the table.    Okay, kid, you're on.  But I gotta tell ya, its a hard act to follow.   Everything go all right?   No signs of trouble?   You know, somebody tailin' ya.  A torpedo or somethin'.   How 'bout Lonnegan?   And?   Hell, they don't do that and you know you're not gettin' through to 'em.  We concentrate on Niles, who's making up the \"boodles\" or fake bankrollls.  He puts a real $100 bill on the bottom, then two inches of cut green paper on top, and then another $100 bill on top of that, so that it looks like he has a whole stack of $100 bills.  The bundle is then bound with a sealed label, like those used in banks, that says $10,000. We see that he has already made several of these bundles.   Did he hold you up on anything?     That's all right.  Once they start listening, they're in trouble. Just don't give him more than he asks for.  If you rattle his imagination a little, he'll come up with all the right answers himself. But all he's gotta do is catch you in one lie and you're dead.    They both look tired.   Did he say he wouldn't?    He'll show.   Eddie, cut that out, will ya.  The boardmarker walking nervously back and forth in front of his odds board, checking every letter and number.  He stops to cross a T on one of the horses' names.  It was already crossed, but he does it again anyway.  Billie and Singleton, in an area hidden from the rest of the room, watching the print-out on the ticker machine.  The clicking of the ticker is the only sound we hear in the store.  Curly Jackson in front of a mirror, pasting a fake Van Dyke on his chin to go with his tweed suit and monocle.  A couple of Billie's girls adjusting their waitress outfits and primping their hair.  Each has a tray full of drinks beside her.  The Eirie Kid silently retracing his \"route\" to make sure he has it down.  Despite the crowd, there is no talking and little movement, save for the constant swirling of smoke from several cigars and cigarettes.  The group is like a theatre company waiting to go on opening night.   That's what I like about these guys, J.J... They always got protection against things we'd never do to 'em.  Everywhere there is activity.  A bank of telephones buzzes incessantly.  Sheet writers scurry from phone to phone, taking bets of tremendous size from prominent people.   Never get enough, huh pal?  I'd think you'd get tired of losin', Honnigan.    Make sure you see cash from this guy, Eddie.  He's got the name for bettin' money he don't have.  The man in front of Lonnegan puts $5,000 on Dancing Cloud. He makes the bet on credit.  Lonnegan steps to the window.    That's not where we want him to sit.  Eirie tries to ignore Lonnegan at first, but realizes he better make some conversation.   (getting his name right this time Don't bother to come back with a piker's bet like that again, Lonnegan.  We got a $5,000 minimum here.  Show this bum out.  Hooker hesitates a second.   Go on, ya goddamn ninny.  Gondorff gives Hooker a hard shove in the back with his foot, sending him into a table and sprawling to the floor.   (indicating Lonnegan's bodyguards And tell him not to bring his garbage men in here no more.  This is a class joint.  Hooker, pretending to be humiliated, gets to his feet and escorts Lonnegan to the door.  Lonnegan stops, gives Gondorff a derisive smile, and walks out.  Once he's gone, the general clatter and hubbub in the room cease, like it had been turned off by a faucet.  Most of the boost sit down and relax.  Curly Jackson rips off his Van Dyke.  It's been itching him.   He's gaffed, kid.  He should start coming to you now.   Why didn't you tell me about Snyder before?    Hooker sits sullenly at the table.  Billie stands over him putting some ointment on his face to close the cuts. Gondorff looks on.  Their discussion continues.   Well you found him again and we're gonna have to do somethin' about it. What else haven't ya been tellin' me?   Then why'd ya move outa your room?   You can't play your friends like marks, Hooker.  Hooker doesn't reply.  He knows Gondorff's on to him.   You know how easy it'd be for one of Lonnegan's guys to nail you?   You just won't learn, will ya. Hell, you come in here, I teach you stuff maybe five guys in this world know, stuff most grifters couldn't do even if they knew it, and all you wanna do is run down a bullet.  You're just like all them new jerks. Lotsa nerve and no brains.  And ten years from now when me and the others are through and you dumb guys are all dead there won't be one gee left who knows the Big Con was anything more than a way to make a livin'.   (trying to be angry and failing Christ, they'll probably miss you and hit me.   How ya doin'?   We don't need big odds on this one, J.J.  Take anything you get at 3-1 or better.  Gondorff leaves the room, as Singleton turns back to his vigil at the ticker.   He's gonna hit ya with 20 grand, Eddie.  How much cash we got?   Get a couple extra guys in the line, then.  We'll give him the shut-out.  Niles nods.   All right, Furey, your horse is Wingless.  Paltrow, the Big Alabama and Phillips'll take Grand Theft. Rodgers and Eirie have Wrecking Crew.  Jackson -- His Dandy, Cowan -- Change of Heart, Fiskin and Chappie -- Made to Order. (pointing to the Eirie Kid Eirie, he gets a bang outa seein' you lose, so we oughta use that on 'em.  If you play the birds of a feather routine we worked on, it should steam him up pretty good. You think you can handle that?   O.K., you guys in line take your time, and I wanta see lotsa joy on Wrecking Crew.   Don't take it so hard, pal.  You probably woulda lost it.  Lonnegan wanders over to the bar in a funk.   If we're lucky, this'll bring him back stronger than ever.    Gondorff and Hooker are playing gin rummy and drinking. Gondorff makes little comments as he plays, but Hooker is quiet and withdrawn.  The carousel is not in operation and a heavy silence hangs over the place.   What's the matter, kid?  You're not sayin' much.   Luther always told me to bite my toenails when I get nervous.  You see yourself doin' that and you realize it ain't worth it.  Hooker smiles feebly.  Billie appears at the door.   Take it easy, you won't lose him now.  We had him 10 years ago when he decided to be somebody.  Believe me, I've seen enough to know.   Two or three hundred I guess. Sometimes played two a day when I was in Shea's mob.  We had it down to a business.  'Course Chicago was a right town then.  The fix was in.  The dicks took their end without a beef.  All the Wall Street boys wanted to make investments for us.  Even had marks looking us up, thinkin' they could beat the game.  Yeh, kid, it really stunk.  No sense in bein' a grifter if it's the same as bein' a citizen.  Gondorff chucks his cards on the table.  He's through for the night.   I better do some packin'.  I'm gonna be a hot number again after tomorrow.   Seems worthwhile, doesn't it? Maybe it's just for the cave-in on Lonnegan's face when we put in the sting.  That's good enough.  Hooker gets up to leave.   Ain't nothin' gonna make up for Luther, kid.  Revenge is for suckers.  I been griftin' 30 years and never got any.  Hooker just nods and walks out the door.    A record spinning lazily on an old phonograph.  We hear Robert Johnson's \"Come On In My Kitchen.\" Gondorff is sitting up in bed, with his hat on, lost in thought.  Billie is curled up asleep next to him.  There's a packed suitcase next to the bed.  Billie wakes up and turns over a second.      Gondorff is standing in front of the bathroom mirror, putting on his tuxedo.  He goes to his dresser, pulls out a very small gun and tucks it in his cummerbund.   What's the problem?    I can't lay that off in time.  We lose a bet that big, it could break us.    What are the odds on Syphon?   A half mill on an eight to one shot. You're dumber than I thought, Lonnegan.    Take it.  Niles hurriedly writes out a slip for 500,000 dollars. Lonnegan, allowing himself a sly smile, picks it up and retires to a nearby table.  He flashes a little okay sign to Hooker who acknowledges it with a nod.    Nice con, Hickey.  I thought you were Feds myself, when you first came in.   Okay, let's take this place apart and get outa here.  You can get your splits from Eddie at Boudreau's tonight.  Gondorff walks over to Hooker, who's wiping the blood off his face and hands.   You beat him, kid.   You wanta wait for your share?",
        "Doyle": "",
        "Lonnegan": "(not looking up from the table I'm busy, Floyd.    Which one?   You sure he didn't just pocket it?     They workin' for anybody?   All right, mark Mottola up a little and put him on a bus.  Nothin' fancy, just enough to keep him from coming back.  Get some local people to take care of the other two.  We gotta discourage this kinda thing.   What about the other one?   Who's got the contract?   Hackers.   You see the guy in the red sweater over there?  We cut to one of Lonnegan's foursome, a short, squat little Irishman in a red sweater.  He was a good-time, friendly manner and a winning Irish smile.  We like him immediately.   Name's Danny McCoy.  No Neck McCoy we called him.  Runs a few protection rackets for Carnello while he's waiting for something bigger to come along.  Me and Danny been friends since we were six. Take a good look at that face, Floyd, cause if he ever finds out we let one lousy grifter beat us, you'll have to kill him and every other hood in Chicago who'd like to do the same thing.  You understand what I'm sayin'?   Good lad.  Lonnegan is called to the tee by one of his foursome.  He exchanges a friendly smile with McCoy and belts the ball down the fairway.    Where the hell is this guy?   All right, let's start without him. Mr. Clemens, give me the cards.  The Conductor hands him a sealed deck.  As he begins to open it, Gordoff comes into the room, coatless, rumpled, unshaven and looking slightly tipsy.  The others at the table, all men of high school or financial standing, are somewhat put off.    Mr. Shaw, we usually require a tie at this table.  If you don't have one, we can get ya one.    Lonnegan.  He begins to deal, obviously not pleased that his evening seems to be peopled with drunks.    Raise 500.    See and raise five.   Pass.    I've had enough of your lip, Shaw.  Gondorff grabs the whiskey bottle next to him, breaks it against the table and waves the jagged end in Lonnegan's face.    I've had it with that bum, Floyd. Stack me a cooler.    I don't care.  Load me a deck.  Set it up for threes and nines.  I'll cut it in on his deal.   Nothin'.  They gotta be outa there early.  I'm gonna bust that bastard in one play.   250.   Raise 500.  Gondorff looks at Lonnegan very carefully for a second. Lonnegan meets his stare.   See and raise 1,000.    See, and raise the rest.  Lonnegan pushes in the rest of his chips.  Gondorff, who is only required to match Lonnegan's total, throws in all his too.  It's a showdown.    I guess I left it in my room.    Lonnegan sits in a chair smoking, obviously still upset. Floyd paces in front of him.   What am I supposed to do?  Call him for cheating better than me?  There's a knock at the door.  Floyd goes and opens it.  It's Hooker.   Your boss is quite a card player, Carver.  How does he do it?   (reaching into his coat pocket He'll have to take a check.  I couldn't find my wallet.    What do you mean?    I could have you put under this train for this, errand boy.   Then why the rat?    C'mon, I'll give ya a lift home.  Hooker hesitates, not sure whether to accept or not.   What's the matter?  You gotta get back to Shaw?   All right, then.    Driving through the city, the driver and Floyd in front, Hooker and Lonnegan in back.  Hooker glances out the window from time to time, just to make sure they're really going to his place.   Why me?  Shaw probably has lotsa enemies to choose from.    I'm a banker, friend.  That's legit in this state.   That's worth fifteen grand to ya?   You're dreamin', kid.    If I'm not there by quarter of, I'm not coming.  Hooker nods and walks up the steps to his apartment building. Lonnegan's car speeds away from the curb and on out of sight. Hooker breathes a sigh of relief.  He's passed his first test; or has he?  We follow him up the stairs to his room.   You should always look to the back too, kid.    Get on with it then.   You're not gonna break him with a $2,000 bet.   And you were gonna pay me back?   We're waitin' for a call.  The man looks at Lonnegan a second, and then at his four goons.  He decides maybe he'll make the call later.    The name is Lonnegan.   Two-thousand on Bluenote.    That's all.  Bluenote's race is now up on the board.  The race caller comes on the loudspeaker.   You know anything about a horse named Bluenote?   (out of the corner of his mouth You really picked a winner, kid.    War Eagle's where you want to have your money, huh?  Eirie doesn't reply.  He can't believe Bluenote won. Lonnegan looks to Hooker.  Hooker gives him a wink.  For the first time, Lonnegan permits a smile.    Niles is counting out $16,000 to him (all of which Gondorff won the night before).  Gondorff looks somewhat perturbed. Lonnegan picks up the money and tauntingly waves it at him.   All right, Riley.  What the hell happened?   You weren't hired to miss him.   Yeh, and what does Cole say about that?   All right, get outa here.  You're outta work.  Riley gets up and drags himself out the door like a whipped dog.   We'll put Salino on it.  I need somebody careful.   Then why ain't he dead?   Use Salino.  It'll take a little longer, but there won't be any holes in it.  Combs gives up.  The second time's the charm.   And tell Cole I wanta see him when he gets in.   He had his chance and all he did was shoot up a rooming house.  Made a lotte noise and woke up a few cops, but didn't hit nothin'.  Combs keeps his mouth shut.  There's no way to talk to Lonnegan when  he's like this.    This is Salino's job now, Vince. If Cole wants to muscle in on it, that's his business.  But he's breakin' the rules and when Salino finds out about it, I can't feel sorry for what's gonna happen to him.    The finest the period had to offer.  We pick up Hooker coming down the hall to Lonnegan's suite.  He is admitted by the Bodyguard.  Lonnegan, wearing a smoking jacket, is seated at a table counting a pile of money.  There are two other assistants standing behind him.  They don't look friendly.   You're a lucky man, all right.   Why don't ya then.   You got a system, Carver?     I'm in.   You got the 400 grand yet?    I think we oughta place another bet tomorrow.    If your system's as foolproof as you say, you'll get even more.  Hooker's in a jam and he knows it.   Let me talk to him.   You want your money back?  Try and get it in a court of law.  C'mon, don't be a sorehead.  I'll make it worth your while.  Migth even help ya finance the big play if this one works out.  Hooker says nothing for a minute, and then reluctantly nods his head.    We pick up Hooker coming out of the hotel and going off down the street.  As he does so, we pull back all the way across the street and through the interior of a parked car to reveal the silhouette of a man seated at the wheel.  We move to his right hand, which rests on the steering column.  It's covered by a black glove and the middle finger is missing. His trigger finger, however, taps lightly on the wheel.   What happened to your face?   I could come up with 750 grand in a day if I had a reason to.   I need more proof, that's all. Anybody can get lucky once.   If it works again tomorrow, I'll have a half million in cash here by noon the next day.  We split 60-40.   With 20% coming off the top for me laying your bet.  Either way you end up with 40.  Twist hesitates.   A week's a long time, friend. Anything can happen.  All of it bad.   Not if you want me to keep makin' 'em for ya.      C'mon, let's hurry up there.  The man at the head of the line turns around and gives Lonnegan a chilling look, as if he were beneath contempt. He puts down $25,000 on Grand Theft.  The next man in line plunges down $30,000 on Wrecking Crew.  Just as Lonnegan is about to step to the window, Gondorff gives a quick signal to Singleton.  The speakers come on.    Twenty-thousand on Wrecking Crew.    Wrecking Crew.   I didn't get the bet down in time.   Tell your friend I'll have the money here by post-time tomorrow. We'll take the first race where the odds are 4-1 or better.  And make sure I can get to that window this time.    I don't know, figure something out.  Lonnegan storms across the street to his waiting car and drives off.  Hooker relaxes into a smile.  He's already figured something out.    Lonnegan paces nervously around the room, looking at the clock.  Obviously waiting for something, he's getting extremely impatient.    Lonnegan goes to the door to admit Floyd and two assistants, one of whom carries a large brief case.  Lonnegan takes the brief case to a table and opens it.  Inside is a half million dollars in cash.    Lonnegan, carrying the brief case personally, is seen getting into his limousine.  Four assistants get in with him.    He holds the brief case in his lap, his fingers tapping lightly on it.    Five hundred grand on Syphon.  Niles is struck dumb.  He's never seen that much money before.    If ya win it could make ya, too.   You're more gutless than I thought.  The words \"Last Flash\" are heard on the speaker.  Gondorff looks at Lonnegan with utter contempt.  He turns to Niles.   (motioning for him to keep his voice down Take it easy.  Everything's all right.  I put it on Syphon, on the nose.   You give me my goddamn money back! You hear me?  There's been a mistake!   You give me my money back.  There's been a mistake, do you hear me?  Gondorff leaps to Niles' aid when suddenly there is a crash at the entrance door, and Polk, Snyder and eight federal agents burst into the room, guns drawn.  The place falls silent except for the loudspeaker, the members of the boost afraid to move.  Gondorff and Niles look at each other wondering how this could have possibly happened.   My money's back there.",
        "Billie": "No.    You Hooker?   Why didn't you say so.  I thought maybe you was a copper or somethin'.  She goes to a side door and unlocks it.   It's the room in the back.  He wasn't expecting you so soon though.  Hooker's not quite sure what that means, but there's something about Billie that makes him know that you don't ask.   You feeling all right this morning, Henry?   You mind opening the round a little early today?  We got some business coming in before hours.  Gondorff waves okay.    Set me up five more beers, will ya Danny.  As Danny goes to fill the mugs, Billie's eyes fix on a man at the end of the bar.  We move to reveal Snyder, intently scanning the room, as if he'd lost a dancing partner in the crush.  Not finding what he wants, he comes down the bar to Billie.   That's right.   Joliet badge, Snyder.  Don't cut much up here.   Don't think so.  I know everybody in the place and I always bounce the lamsters.   No, but you're welcome to a free beer before you go.  Billie grabs a bottle of beer, pours some in a shot glass and pushes it over to Snyder.  He ignores the gesture.   Who told ya this guy was in here?   Maybe I could help ya if ya told me his name.   Right through there.  But I wouldn't go in there if I were you.     I don't have to.  You'll be bustin' in on the Chief of Police just up the hall.    Snyder is stopped cold.  He calls after her.   What are you talking about?  It's on the house.   What's the line on Visitation?   He'll probably fall down.  Gondorff appears at the doorway.   Best we had was Cat's Eye in the second at Del Mar, and he was only 5-2.  Not many longshots comin' in today.   Yeh, go ahead.   Things are a little slow tonight, Henry.  I wanna open the round for the girls.  Gondorff takes out a set of keys and tosses them to her. She leaves to go start the merry-go-round.  Gondorff settles back into the game.   C'mon, Henry, knock off.  You've done everything you can.  Gondorff nods his agreement like a zombie and goes right on thinking.",
        "Eddie": "",
        "Niles": "He's been taking the 8:10 Century Limited outa New York on Friday and getting in here early Saturday morning.  He usually stays a day to check on his policy operations, and then flies back.   The porters say he runs a braced card game in one of the cars.  $100 minimum, straight poker.  Last time he pulled in here ten grand heavier than he left New York.   No good, J.J.  You're not gonna con stocks to a banker.  Lonnegan's too smart for that.     The wire is ten years outa date.   All you gotta do is show up with some money and look like a fool.   Looks all right.  It's big enough and off the street.   Got to.  Gondorff's ridin' the mark in from New York on the Century.  Garfield thinks it over a little.  He's taking another look at the place.  We go to Twist and the old man by the door.   All we need is the bookie setup for now.  We'll worry about the telegraph office later.   C'mon, you can do better than that. We ain't no heel grifters.   Just give us what ya can, Benny. We'll send a truck down.  Twist has rejoined them by now.   Does J.J. know how to use this thing?    Is that all?   Not enough to cover a bet that big.   I'm sorry, sir.  We can't take bets after the race is started.  He points to a sign above the window, which says exactly that.  Lonnegan grabs up his money in disgust.    Looks like he's sulking.   (playing the flustered clerk Hold on, I'll have to get the manager.  Niles goes and returns with Gondorff.   (pointing to the brief case He wants to put a half million on Syphon.  Gondorff looks at the money a second and then looks up at Lonnegan like he's gotta be crazy.   Eight to one.  Gondorff looks at Lonnegan long and hard.   I'm sorry, sir.  The betting's closed.  Lonnegan begins to shake him violently.",
        "J.J.": "",
        "Singleton": "Lonnegan's a fast egg, Henry.  He's not gonna sit still for a standard play.   I think we ought to play him on the Rag.  It's the tightest game we got, and it's not all over the papers yet.   I'm not sure I know it.   You in?   He usually plays with a Royal or a Cadenza. (handing him two sealed decks I got you one of each.  He likes to cold deck low, 8's or 9's.   Look at that.  He's got four apes with him.   Ah, he's like all them supervisors. They think they're too good for regular people.  He says he was in here a while ago and the place was a mess.  Harmon looks around, hoping it's not true.   Look pal, we gotta cover the floor, the furniture, everything, so we don't spill on nothing.  Now if you wanta sit in there with a tarp over your head, you're welcome to it.   Visitation is still up by two at the three-quarters.  Single Action second, Fasanella third.   (checking further up on the print-out sheet 7 to 2.  That ain't bad.   (eyes still glued to the ticker Nothin' yet.  I got a good one on the lead at Hialeah, but he's fadin'.    Billie.  You ready?  Billie prepares to write on her pad.   At the finish, it's Single Action by two, Fasanella second, Visitation third.  Line on Single Action... 3 to 2. Hell with it, that's no good.  Billie crumples up the piece of paper she's been writing on and chucks it in a wastecan.    Okay, the Fairfield Stakes at Santa Anita.  Mile and a quarter for 3 year olds and up.   Okay, Billie, here we go.  Billie snaps to and prepares to write as Singleton reads.   At the wire it's Wrecking Crew the winner by five, Grand Theft second, Wingless third.  Wrecking Crew was...4 to 1. (ripping the sheet out of the ticker That's our boy.  Billie and Singleton hustle out of the room.",
        "Bodyguard": "",
        "Loretta": "You done?    It isn't any better.    She don't work here no more.  I'm fillin' in for a couple days... till I can get a train outa here.   (putting the check down and walking away I don't know.  Depends what train I get on.  Hooker looks for some sign that she's putting him on.  He doesn't get it.  He takes out some money, drops it on the table and walks out.    Sixty-five.  Hooker gives her a dollar.  She goes to the register for change.     Yeh, sleepin'.  Hooker figures that's enough of that.  He pockets his change and starts out the door, when suddenly he stops short.   No.  What's wrong with the front?   No.   What the hell for?   What does this guy want?   Looks like he missed ya.   Good night, Mrs. Hillard.  Mrs. Hillard quickly closes her door.   You move right along, don't ya.   And you expect me to come over, just like that.    I don't even know you.",
        "Johnny": "",
        "Hooker": "A shabby little place he rents above a cigar store.  We pick him up in a jerry-built outdoor shower, which he's rigged up on the fire escape.  The rinse water drips down through the landing into the grimy alley below.    'With plenty of money and you-oo- oo, Oh baby, what I wouldn't do-oo- oo...'   Come into a little dough.  You wanna get outa here tonight?   I'll spend fifty on ya.  Crystal looks at him a second and starts to giggle.  We're pretty sure she's gonna get outa here tonight.   How ya doin', Jimmy.     Naw, just a little hard times, that's all.  It's all over now.    Three grand on the black.  Jimmy is stunned.  The others at the table, used to dollar bets, look at Hooker like he's some kind of foreign dignitary.   I feel lucky tonight.   Three grand on the black, Jimmy.  Jimmy wants to argue some more, but the ball is getting ready to drop into the center.  We see Jimmy quickly press a hidden lever under the table with his foot.  The ball falls and settles into red 27 with a motion that is not quite right.  The others at the table fail to notice, but Hooker is not fooled.  He stares venomously at Jimmy, who knows that Hooker is on to him.   Spin it again.  Jimmy doesn't know what the hell to do.  He gives Hooker a little head motion to indicate a small window high up in one of the walls.  Behind it, we see a pair of eyes.  Suddenly, Hooker understands why Jimmy had to cheat him, but it doesn't change his demand.   Spin it anyway, Jimmy.  Jimmy is beside himself.  If he doesn't spin again, Hooker may expose him.  If he does spin, and loses, his management will fire him.  He pleads to Hooker with his eyes, but it's no use.  Jimmy spins the wheel and reluctantly drops in the ball.  This time there is no foot on the lever, and it settles into black 15.  Hooker stares at the ball a second and then looks up at his terrified friend.   Don't worry, pal.  I knew it was my night.  Hooker pushes the money over to Jimmy and walks out of the room.  He's lost $3,000, but he's still working on a lucky night.   (going into his pocket for more money Hey wait a minute.  Aw, the hell with ya.   Howdy, Louise.   I'll never be as good as that mark, Alva.   You goin' to church now?   Which way did he do, Eirie?    The bastard.  He can blow his nose all the way.  They laugh again, but Luther doesn't share their enthusiasm. He watches Hooker who becomes uncomfortable under his gaze.    I had some appointments.    All of it.   I checked the place out.  There weren't no dicks in there.   What's eatin' you?  I've blown money before.   You think my play is bad?    What?   What are you talkin' about?  We just took off the biggest score we've ever had.  We can do anything we want now.   Hey look.  You think I'm gonna run out on ya or somethin'?  Just cause we hit it big.  Luther, I owe you everything.  If you hadn't taught me con, I wouldn't know nothin'.   But you played the Big Con.  You said it was nothin'.  A game for flakes and mama's boys.    What the hell you gonna do with yourself?   You'll take a cut of what I make, won't ya?   If that's the way you want it.   How do you like that Coleman, huh? After three years.   We were partners.  If it weren't for Luther I'd still be hustlin' pinball down at Gianelli's.  I don't need anything more than I got.   You ain't gonna have nothin' if you don't lay off them games of chance. There's a depression on ya know.   There's always a depression on.   I like griftin'.   I don't look any good in clothes and I don't know how to drive. What else ya got to sell, Eirie?   Hi there, Snyder.  Things a little slow down at the Bunco Department tonight, eh?  Somebody lose the dominoes?   (knocking Snyder's hand away Aw, find yourself a shoplifter to roll.  Snyder gives Hooker a swift knee in the thigh and follows it with an elbow across the head.  Hooker flies into a row of boxes and garbage cans.    You got the wrong guy, pal.  I been home with the flu all day.  You can stake out my toilet if you want.  Bang.  Snyder, infuriated by Hooker's irreverence, slams him to the ground again.  The policeman is no longer holding Eirie but is almost daring him to make a move.  Eirie wants to go to Hooker's aid, but he knows the policeman will beat him to a pulp.    You're crazy.  I'm not stupid enough to play for rackets money.   I'll square it with the fixer.    My end was only one.   All right.  He reaches into his coat, pulls out a stack of bills and counts out $2000 to Snyder.  Eirie looks on in amazement; he didn't think Hooker had it.   I did.  That stuff I gave him was counterfeit.  They'll pinch him the first place he tries to spend it.  Snyder and his partner disappear around a corner.  Hooker suddenly takes off like a shot.    Aw Christ, it doesn't make no difference now.  If Snyder knows about it so does everybody else. He never gets anything first...Damn, there's no answer at Luther's.    Pumping down the street.    C'mon Luther, get up.  You gotta get up, Luther.  In the distance, sirens are heard.  Heads are out of the windows and some people are starting to gather in the courtyard.   Goddamn you, Luther, will you get up?  I'm not waitin' for you, Luther. I'm not waitin' anymore.  Get up, you son of a bitch.  Goddamn you, Luther, goddamn.  The sirens are close now, and Hooker tears himself away from Luther and runs.  The others gather to look at the body.   (flashing open his wallet to reveal the little tin badge and then closing it again quickly Excuse me, sir.  Treasury Dept... I'd like to ask you a few questions.   We don't doubt that, but there's a counterfeiting operation passing bad money in the station.  Have you made any purchases here today?   Then I'm afraid we'll have to impound your money until we're sure that it's all good.  Can I see your wallet and your ticket, please?   (taking out the money and returning the wallet It'll only take 20 minutes or so. You can pick it up at the window down the hall.    We'll get 'em!  Give us a chance. I'm not the only agent in here, ya know.  We go around advertising ourselves, how many counterfeiters do you think we'd catch, huh?  You think I'm wearin' this rag here 'cause I like it?  Christ, everybody thinks life's a holiday or somethin' when you got a badge.  I been here since three this morning, Charlie, and I never knew there was so much ugliness in people.  You try to help 'em and they spit on you.  I shoulda let ya go and gotten yourself arrested for passin' false notes.  The Businessman is totally shamed.   All right, I'll give ya a break.  Down that hall there, there's an unmarked door on the left.  Go on in there and wait at the window. I'll take this...  ...in the back and run it through right away.  We'll have you outta there in a couple minutes.    Think nothin' of it.  The man goes off down the hall, more than grateful to be given a break like this.  Hooker heads for the \"back\".  We follow the Man down the hall to the unmarked door.  He strides on through to find himself face to face with a wall of busily flushing urinals.    Boarding the 8:10 for Chicago.   Excuse me, I'm looking for a guy named Henry Gondorff.  You know him?   Luther Coleman sent me.  Billie stops and comes back down the stairs.  It's the first time she's stopped chewing.   Yeh.    The great Henry Gondorff.   You sober?   Yeh, Luther said you could teach me something.  I already know how to drink.  Gondorff wipes his face with his hand.  His mood softens a little.   He had you down as a big-timer. What happened?   You mean you blew it.   He didn't tell me you was a fuck- up, either. (Gondorff looks at him coldly You played the Big Con since then.    I picked something up on the way.   I don't know.  Haven't seen anybody.    Gondorff, you gonna teach me the Big Con or not?   I wanna play for Lonnegan.    Yeh, he croaked Luther.  What else do I gotta know.  Gondorff just sits tight and waits for him to cool off.   (waving Gondorff off, embarrassed at his own outburst Aw right, he runs the numbers outta the south side.   I'll take him anyway.    'Cause I don't know enough about killin' to kill him.  It's the right answer. Gondorff didn't know it himself until now.   We'll get by without 'em.    I never played for winos.   You're sacred of 'em, aren't ya?   Then you'll do it?   You sure it'll be one of these two?   He's not as tough as he'd like to think.   She got him clean.  He hasn't missed it.  Gondorff nods, takes the money out, counts it.   He's waitin' for you in the card room.   If we ever get to it.   How'd ya do?   My name's Carver.  Mr. Shaw sent me.  Floyd motions him in without a word.    He cheats.  Lonnegan says nothing.  He doesn't like smart asses.  He looks Hooker over a second, as if considering whether to have him wasted or not.   Yeh, he knows that.   (pulling out Lonnegan's wallet and tossing it to him He hired a dame to take it from ya.  Lonnegan just holds the wallet.  He can't believe it.     You were set up, Lonnegan.  Shaw's been planning to beat your game for months.  He was just waiting for you to cheat him so he could clip ya.    So could Shaw.   Cause I'm tired of bein' his nigger.  I want you to help me break him.  Lonnegan looks at Hooker long and hard, as if the intensity of his gaze could separate truth from fiction.  Lonnegan hadn't expected this, but now that it's here, it better be on the level.  The silence is suddenly broken by the noise of the train braking into the station.   Naw, he picked up some jane in the bar.  Can't see him till morning anyway.   I need somebody respectable...but not completely legit.  What I'm gonna do isn't very legal.   All you gotta do is place a bet for me at Shaw's place.  I'll supply all the money and the information.  Lonnegan is listening, but you'd never know it.   If you help me out, I'll pay ya back the money you owe Shaw, myself.   Maybe a couple million.  We go to Lonnegan.  He's still not talking, but that last phrase has registered.    The car pulls up in front of Hooker's place.    660 Marshall Street.  Tomorrow at 12:30, if you're interested.    He's just about to unlock the door, when he notices the little piece of paper he left in the door is on the floor. Without the slightest hesitation, Hooker leaps over the bannister and races back down the stairs.  Two gunmen, Riley and Cole, burst out of his room and fire at him over the railing, but he's already too far down.  Riley and Cole give chase.    Yeh, it was easy.   What do ya mean?   (wanting to get off the subject No, not a thing.  Gondorff has his doubts, but lets them ride.   I gave him the breakdown just like ya told me to.   He threatened to kill me.   Then he drove me home.  He tried to put himself away as legit, so I went right into the pitch.   Naw, he just sat there and listened. I don't know if he bought it or not.    They both look tired.   You think he'll show?   No.   (sliding out of his booth and into Lonnegan's I was afraid you weren't gonna come. We haven't got much time.    Sometime after 1:00 a guy's gonna call here and give you the name of a horse.  All you do is take this two grand across the street to Shaw's place and bet it on that pony.  There's nothin' to it, but don't take too much time.  We only have 3 or 4 minutes after you get the call.   This is just a test.  The big one comes later.  Be careful with that though, it's all I got.   I am after this race.  Lonnegan says nothing.  He's not sure he likes a man who's stupid enough to bet his last dollar on a horse race.   I gotta get back before Shaw misses me.  Good luck.   Give 'em a little time.   You're doin' great, Eirie.  He loves ya.  Eirie nods, somewhat unconvinced, and heads bak to the table.   Well, what did I tell ya?   Lucky, hell.  I could do it every day.   'Cause it's better to do it all at once.  We're puttin' down 400 grand next week.  At 5-1 we make 2 million. Twenty per cent of that is yours if ya stick with us.   You stayin' in or not?   (drawing up a chair, barely able to contain his enthusiasm It's foolproof.  We got a partner downtown runs the central office of the Western Union.  Race results from all over the country come in there and go right across his desk on their way to the bookies.  All he does in hold them up a couple minutes until he can call us and get a bet down on the winner.  Then he releases the results to the bookies and we clean up on a race that's already been run.  It can't miss, unless the Western Union Dicks get onto it.  Lonnegan is amazed.  He sits back a second, then comes forward again and pushes a pile of bills over to Hooker. Hooker smiles and begins to count the money.   Not yet, but...  Hey, there's only a grand here.    What is this?  That's my money. You tryin' to muscle me?    I gotta talk to me partner first. We can't afford to expose our game too much.    No.   Four o'clock tomorrow.  Pick me up at Dewey Lyle's.   Twist?  I told him the tale.  He wants to see ya.   Tomorrow, after 4:00.  Stay inside, I'll come in and get ya.  And be hard on him for a while; he's talking money.    Winding his way through the slum area of town, dashing along backstreets, over fences and through vacant lots, making good his escape.  From our angle, he looks like a rat in a maze.   I thought I'd lost him.   Nothin'.  I told ya everything there is.   It was too noisy.   All we need is a couple days, Henry. A couple days and we'll get Lonnegan down and stomp on 'em.   A couple days; that's all I'm askin'.  I can stay clear that long.   Yeh, I guess I shoulda had the meat loaf.   Where's June today?   Where you goin'?   Had a little fight with a raggle down on 13th.  She got me with her ring.  Lonnegan laughs.   We'll go to the side door.  We follow Hooker and Lonnegan across the street to the side entrance which opens into:   Les, I got Mr. Lonnegan with me. He wants to see you a second.   I thought it might be good for him to see the setup.   He's right, Les.   And what do we know about your guy. He says a week, but who knows if it's a month?  Lonnegan here's a banker.  He can get that dough with no questions asked.  Twist says nothing for a minute, then:   What happened?    Oh, Jesus.   How am I gonna do that?    Hooker sits at the counter finishing a plate of meat loaf. Loretta is down at the cash register, leaning on the counter, looking idly out into space.  Hooker glances over at her every once in a while to see if she might be interested in striking up a little conversation.  She's not.  He finishes his meal and comes down to the register to pay his bill.   Meat loaf, apple pie and a cup of coffee.   What time you get off work here?   You doin' anything tonight?   You got a back door to this place?    Look, I don't have time to fuck around.  There's somebody out there I don't need to see.  You got a fire escape or anything?   All right, do me a favor.  Go into the bathroom, open the window and wait for me there.   Just do what I tell ya and everything'll be jake.  Cracks of concern begin to appear in Loretta's marble.    He'd like to kill me.  Loretta just looks at him a second.  Realizing that this is no joke, she turns and walks slowly but steadily to the bathroom.  Hooker waits until she's out of sight.    Hooker comes in the front entrance and goes to the elevator, one of the old-fashioned kind with the iron grid on the inside.  He's still a little rattled and waiting for the elevator is making him restless.  It finally arrives, and he steps inside, closing the grid behind him.  As he starts to push the button for his floor, he realizes for the first time that he's not alone.  He looks to the corner to find Snyder, holding a gun on him.  This time there's not much doubt that he'll use it if necessary.   No.   Don't think I know him.   Lt. Snyder doesn't know shit.  Capt. Polk almost laughs, but he checks it.   You got nothin' on me.   No.     I'll make parole.    Will you wait until the chump is played?    I mean completely played.  Until he's beat and the score is taken. You come in before we beat him and I'll kill him.  You'll have a tough time explaining that, won't ya.    Just as long as I get to finish the play.   Just a little nervous, that's all.    How many guys you conned in your life, Henry?   Then why you doin' it?   Henry.   Yeh.    I appreciate your stickin' your neck out.  I wouldn't have asked ya if it weren't for Luther.   Yeh, this time anyway.  Loretta notices an old busybody peeping out at them from her room across the hall.    I, ah...thought you might wanna come out for a while.  Maybe have a drink or somethin'.   (with more innocence than confidence I don't mean nothin' by it.  I just don't know many regular girls, that's all.   If I expected somethin', I wouldn't be still standin' out here in the hall.  Loretta looks at him carefully.  She knows it's not a line.    You know me.  I'm just like you... It's two in the morning and I don't know nobody.  The two just stand there in silence a second.  There's nothing more to say.  She stands back and lets him in.    Hooker now has his tuxedo on.  He takes two small rubber bladders out of a drawer and puts them in his pocket.    Hooker is busily stuffing all his possessions in a paper bag, lumping clothes with food, records and toilet articles.    Hooker is on the phone now.    Hooker finishes the conversation, hangs up and goes to take one last look at himself in the mirror.  Finding everything in order, he grabs up his sack of possessions and leaves the room.    We pick him up emerging from the building, and follow him around the corner to a secluded alley which he generally takes on his way to the store.  As he walks along, he notices Loretta coming toward him from the other end.  She's wearing a coat, obviously on her way somewhere.  As she comes closer, we move to reveal the gunman appearing suddenly in the alley behind and to the right of Hooker.   She coulda killed me last night.   Who are you?   How do I know you're tellin' the truth.    You were right, Henry.  It's not enough... But it's close.   Naw, I'd just blow it.  Gondorff nods, and walks slowly to behind the bar.  He comes out with his suitcase in one hand and Hooker's paper bag in another.  He throws the paper bag to Hooker, who stops by the door.  Eirie Kid is standing there.  Hooker gives the \"office\" to Eirie, who beams and gives it back.",
        "Erie": ""
    },
    "imdb_rating": "8.3",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNGU3NjQ4YTMtZGJjOS00YTQ3LThmNmItMTI5MDE2ODI3NzY3XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_QL75_UX380_CR0,10,380,562_.jpg",
    "description": "Johnny Hooker, a small time grifter, unknowingly steals from Doyle Lonnegan, a big time crime boss, when he pulls a standard street con. Lonnegan demands satisfaction for the insult. After his partner, Luther, is killed, Hooker flees, and seeks the help of Henry Gondorff, one of Luther's contacts, who is a master of the long con. Hooker wants to use Gondorff's expertise to take Lonnegan for an enormous sum of money to even the score, since he admits he \"doesn't know enough about killing to kill him.\" They devise a complicated scheme and amass a talented group of other con artists who want their share of the reparations. The stakes are high in this game, and our heroes must not only deal with Lonnegan's murderous tendencies, but also other side players who want a piece of the action. To win, Hooker and Gondorff will need all their skills...and a fair amount of confidence.headlessannie",
    "name": "The Sting",
    "genres": [
        "Comedy",
        "Crime",
        "Drama"
    ]
}