{
    "filename": "Limey,-The_script.txt",
    "imdb_id": "tt0165854",
    "imdb_url": "https://www.imdb.com/title/tt0165854",
    "characters": [
        "Rick (Valentine's Bodyguard)",
        "Adhara",
        "Warehouse Foreman",
        "Uncle John (as Joe Dallessandro)",
        "Terry Valentine",
        "Eduardo Roel (as Luis Guzman)",
        "Wilson",
        "Elaine",
        "Stacy the Hitman",
        "Tom Johannson",
        "Jim Avery",
        "Pool Hall Creep (as Wayne Péré)",
        "Lady on Plane",
        "Larry (Valentine's Bodyguard)",
        "Jennifer 'Jenny' Wilson"
    ],
    "dialogues": {
        "Adhara": "I used to hate it.  Now I like it.  I <u>want</u> to know why you <u>need</u> that scary guy in your house.  Then what good is he?  Is that a problem?  I'm loyal to things that make me happy.  Well, you're certainly not a person.  No.  You're not specific enough to be a person.  You're more like a vibe.  It's not a knock.  It's an observation.  Like:  I'm hungry. When are we eating?  What kind of food?  Why?  Like you.  You demand to be served.  A fork fetishist.  For some, eating is a sensual experience. <u>The</u> sensual experience.  Oh, god.  Okay.  Italian?  Italian.  Not who, food.  Should we get Italian.  As long as I don't have to pass Gordon again.  I'm never ready for that.  You have the same posters.     That you have down at your office.  I like the colors.  It must've been a time.  A golden moment.  Shit.  Hello?  Hey!  Great.  You got my message? Yeah.  No, Crestview Terrace, not Crestview Place.  Yeah, there's like three different ways up the hill; the quick way is to bear to the right.  Sure.  Okay. Okay.  'Bye!  That's me.     Hey, I thought you weren't a buffet person.           I've lived in L.A. all my life, I've never done this drive.  Nothing.  I guess it's hard to pass on this road.  Just feels like the car behind has been following us the longest time.  Uh, you've heard of knocking?  Why, what --  Okay.    We think?  Did somebody call the cops?  Why not?  You guys are fucking nuts, I'm calling --  Hey.  Where are you going?",
        "Warehouse": "",
        "Foreman": "",
        "Terry": "",
        "Valentine": "Adhara.  I told your father, if you're looking for a name, you can't go wrong with a constellation.  Could be worse, he could've named you Reticulum.     Is there anything in the world that you want or need?  Gordon?  He's been with me for years. He's not as tough as he looks.  Is it possible that you're too young to be acquainted with the idea of loyalty?  Not for you, clearly.  Am I a thing?  I'm not.  I'm so glad we're having this chat.  It's not a compliment.  As soon as you get dressed.  Anything but Japanese.  I'm not into finger foods.  Too fussy.  I don't like do-it-yourself cuisine. Buffets.  Salad bars.  It's just fuel to me.  I'm not there for distractions.  That's what Gordon's always saying.      We can leave as soon as you're ready.  What.  What kind?  Our black friends?  I thought he was in prison, in England.  What do we do?  I'm sorry.  Who?  Sure.  Yes.  Are you ready?  No.  I know another way out.  Hmm?  Different ones.  We all did.  Have you ever dreamed of a place ... you don't really recall ever having been to ... a place that probably doesn't even exist except in your imagination ... somewhere far away, half-remembered when you wake up ... but when you were there you spoke the language, you knew your way around ... That was the 60's.  No, it wasn't.  Wasn't either.  It was '66 ... early '67. That was all.  Hi.         I'm a gracious host.           Hi.  Terry Valentine.  Have we met?  There's something I can't quite --  Ah.  I don't.  I suppose that's good, unless things were fine the way they were.  Thanks.  You, too.               Why, because you're my security consultant? This cocksucker nearly burnt my house down.  I told them a long-time employee flipped out.  Had a drug problem, refused counselling.  Set the garage on fire, then committed suicide.  One of my \"guests\" tried to stop him -- <u>but how do</u> <u>you stop Gordon</u>.  I mean, Gordon must weigh a good four hundred pounds.  As it happens.  I didn't make that part up.  I don't know everyone here.  He was so traumatized he split. Maybe he was Gordon's <u>pusher</u>.  Where do <u>you</u> think he is, Mike.    You think I'm staying?  Well, can we make it one more.  Nowhere the fuck near me.     All your life.  That happened while I swam the length of my pool.  What's the matter?  The freeway's faster, but lacks a certain majesty.  I sure hope so.  Hello there.  Exercising my visitation rights.  I miss my kids.  You've made it ... brighter.  Sure you do.  Don't shut the door -- I have people with me.  No trouble.  Susan.  I just need ... somewhere remote.  Away from L.A.  For a couple of days. I pay for this house too.    Is he here?  Go to him.  Go to his studio, or writers workshop or artists colony, Esselin retreat, nudist camp --  In a couple of days this whole thing --  Go now.  That's right, your life is Shit, and I'm to blame.  It's that simple.               Where's Larry?  What's happening?  We think someone is here.  We can't find ... ... two of our guys.  No.  Because --     What?                            What.  Tell you ...  She could've had the deal!  I would've handed it to her if she wanted.  I would have given her everything.  She didn't want to share it, she wanted to stop it.  To stop me.  <u>She said she'd</u> <u>turn me in</u>.  She said, \"You go ahead with this, I'll turn you in, Terry.\"  She was serious.  She would have done it. She had the phone in her hand.  She was going to do it.",
        "Wilson": "Edward Rama?  You're home, then.  My name's Wilson.  You wrote to me about my daughter.  No reason.  Round about, yeah.  It was better than a telegram.  Who done it, then?  Snuffed her.  No, but between the lines, eh? Mysterious circumstances, and that.  This bloke she was bunked up with.  This Terry what'sit.  Valentine.  What's he got to say for himself?  How long had she been in the States? Near on ten years, wasn't it?  Long enough to know her way about, I reckon.  What more is there.  No, not my girl.  Self-control, she had. Point of pride. And people don't change, do they.  Going straight, are ya.  Y'what?        Where abouts?  Did Jenny know?  Nah, coppers don't do nothing, do they.  She didn't write to me, did she.  Who'd Jenny get it off of -- this grass or whatever?    Nick's a nick, n' it?  No matter what state you're in.  State of remorse, most likely -- for gettin' caught.  Just got out meself, didn't I.  I'll be needing a shooter.  What do I do, then, look in the bleedin' Yellow Pages?    Sod that.  Gotta get back before my probation officer wonders where I've skived off to.  Travelling on a dodgy passport, n' all.  Which is why I thought, save some time, get what I need under the table, like.           Trouble is, I'm not at home, see. Fancied a bit of target shooting, y'know, while I'm here -- with me mate.  England. Only, we saw there was a show on, thought I might pick something up for a price, type of thing.  Just luck, this, really.  Never been to one of these before.  (picks up another, checks it  Don't have time for a lot of paperwork, y'know.  Just popped over on a quick visit.  Yeah?  No.  Not at all. Do we?  I mean, it's already a steal, n'it -- what you said -- four hundred for this one?  Oh, aye?  Violation of my parole, this. -- Goin' abroad.  Fucking out of order, that.  Shouldn't be allowed.  It's only insurance.  Can't be too careful.  This Terry Valentine, he's probably a wonderful fella.  They were together how long?  Well, there you are.  Jen must've liked him.    And that's where you met Jenny.  How'd the two of you hook up, then?           Walked.  Looking for a bloke named Valentine. Know him?    I have a message for him.  About Jennifer Wilson.  You know her?  Is Valentine here?  Where is he, then?  You tell him.  You tell him I'm coming!!  Had a feeling it was you.    She used to pinch 'em off me. Funny that.  One thing she never tried to get me to stop.  Wanted to talk to you, didn't I?  Sort a few things out.  How d'you mean?  I was skint -- didn't have no money to get here.  What was that, then?  It was the bars, then.  Sewing mailbags?  Me?  Never did an honest day's work in my life, dear. Wasn't about to start when I was in stir -- not with all that leisure time on my hands.  (trying to conceal his  Here, aren't you gonna let me in.  ... No, I went in for more improving pastimes.  Philosophy classes, language courses, European history, all that lark. Did you know that in Paris in the Eighteenth Century there were more rats in people's houses than there were people in people's houses.  Here, are you always this sarky?  Weren't you on a television series?    Oh, it just ended, then.  When you've lost as many years as I have, love, puts things in perspective, know what I mean.  I can't believe Jenny told you all that. About me.  She was always so embarrassed.    She never told Eddie, though.  How'd you manage that, then.  Yeah, well, she started all that in London.  Learnin' 'ow to speak proper. Central School of Speech and Drama. It's no doddle gettin' in there, y'know. At seventeen.  They offered her a place at RADA n' all, only she'd've had to wait till the next session and she was always in hurry to get on, was Jenny.  She could talk posh without any training, when she was knee-high to a grasshopper. Show up the old man, you know.  In Jenny?  'Course not.  How could I be. 'Course I wasn't.  Footloose and fancy free.  That's the trouble, n' it. She enjoyed life.  Yesterday.  Afternoon.  No, I had -- some other matters to attend to, you know.  Getting a car sorted ...  Well, I reckoned, Saturday night, if you were goin' out, you'd probably have to come home first.  Yeah, saw Eddie, yeah.  Me and him are muckers.  He give me your address.  Well, don't suppose she did, really, most of her life.  On her own after her mum died.  Aunts and uncles for a time -- and then the bright lights beckoned.  Nah, we split up when Jenny was six.  Her second husband done a runner after she got sick.  They give me compassionate leave from Parkhurst to go visit her in hospital.  We were always mates, me and Jenny's mum.  I like to think they're together again now.  Y'know.  Heavenly choir.  Nah, accommodation address.  Something like that, yeah.  Well, you gotta have something permanent, don'tcha.  Even if it's a hole in the wall.  No matter which jug I might be transferred to, I always got someone on the out checks up on it for me, see. Anything I need to know, comes round on visitor's day -- word in my ear.  I already knew.  Knew beforehand.  When was it supposed to have happened? -- two o'clock in the morning, Eddie said.  Eight hours difference between here and London.  Would've been, what, ten in the morning, my time.  I was just coming out on the yard.  Now, I was in the habit of saving my newspaper till then.  Bit of fresh air, stretch me legs -- well, stretch the day out, really, that's what you wanna do.  And I'll tell ya:  I couldn't open the paper.  Could not pry the pages apart -- it was like they was glued together.  That's how weak my hands went.  Thought I was having heart attack, only I knew I wasn't.  Bloke come up to me, he says, Dave, he says, you've gone all white.  I said, fuck me, I've been in prison half my life, what d'ya expect. But he was dead on, 'cause I could feel the blood drain right out of me head. And I knew ... Something had happened to Jen.  Well, I gathered something from the article what Eddie sent me.  Some sort of pop music producer, wasn't it.  What's he done lately.  Now, you shouldn't run yourself down.  My employer, Mr. Lindgren --  -- Mr. Lindgren.  My employer.  Proprietor of a London firm.  Of longstanding.  Based in London, but with international concerns.  Various enterprises, style of thing.  Well, not to say Mr. Lindgren is dishonest, exactly.  Anyhow, he's always saying to me, Dave, never run yourself down, son -- 'cause there'll always be plenty of people willing to do it for you.  This and that.  Y'know.  Ways and means.  Why not.  Have you ever known me not to be.  What'd you want me to do.  Stay at home, twiddlin' me thumbs.  Doing sweet F.A. [Fuck All].  What do you think.  Depends, don' it.  I'll bloody well ask him.     I got his number.     Gate's open.  I had a butcher's at the house.  Butcher's hook.  Look. I don't much reckon those minders of his.  He's brought in the heavy mob.  Extra muscle.  Bodyguards.  They look a right load of wallies. Patrolling back and forth outside the gate, all ponced up like the fuckin' Household Cavalry. Watch it.    Look at that.  What's so fucking funny?     Valets.  What d'ya mean valets.  What is he, then, the Earl of fucking Doncaster?  Keep it handy, mate, all right?  We're not stopping long.  Cheers.  Valets, eh?  Aren't we all la-de-da.  Well, that's what we're doin', n' it.  First in, first out, that's me.  (suggesting Ed take first              Ian?  Sorry.  Wasn't me.  Unless I'm not who I think I am.  Yeah?  No kidding.  Right.  Chain of respect.  That's good, that.  Yeah.  Cheers, mate.           (jumps back with only slightly  What are we standing on?  Could you?  Why don't you go nick one of those little cooker what's its warming up the sausages cocktail and meet me in the garage.  Look about for a toolbox while you're at it.  Pleasure.  EMI in London.  I work with Ian.  You must know Ian.  Great bloke.  Really turned things around there.  180 degrees.  Oh, I think a shake-up was in order. Definitely.  Otherwise, people get lazy, don't they?  Forgetful.  Start thinking they can get away with things.  Gotta shake 'em up now and again, make 'em pay attention.  Glad I got to meet you.  Be seein' you.  Got it?  Toolbox?  Put the Sterno on the ground, near the center of the garage.    One thing I need.             Steady on.        Bloody hell.  That would be too easy.  He's gotta know why.                        She told you all about my details but not about his.  Lovely.      How long've you lived here?  Early 70's.  I was away. Maidstone.  Possibly Brixton.  You don't seem bothered.  Tell us about it.  Oh, I was gonna say ...  I can see the attraction.  A jeweller's up the West End.  We tunnelled our way under the shop floor from the public lavatory down the road. Filthy work.  Trouble was, the bloody thing collapsed -- <u>after</u> we'd made the grab, 'n all.  Would you Adam n' Eve it.  We were <u>lucky</u> to be nicked.  Me and the lads went down there Sunday evening, we weren't discovered till the Monday.  Good job we were still breathing.  Hey?  I'll tell ya something:  it made me a model prisoner.  Put me right off any escape attempts.  Tunnel my way to freedom after that experience?  Not bloody likely.  Did you.  What was that in aid of?  Get seven years, did you?  Just now? Overnight?  It's true.  Has to be said.  I got off to a slow start.  Honest.  Didn't know where to look till I was 21.  Me mate introduced me to a woman up the street.  Funnily enough, she was married to a milkman.  Straight up.  I said, \"Good is she?  Been around?\"  He said, \"<u>Good</u>?  Listen, mush, it's not that she's been around, it's that she's been around hell of a long time.\"  It was for nine years. The last nine years.  You ever been to London?  I've 'ardly ever left it.  I've got the hang of the driving.  Found this place all right.  Not that I recall.  Nah -- she was married to me grandad -- he was as bent as a boomerang -- used to make knuckle-dusters down the shop. Crafty old sod.    Black market during the war.  You sound like my fucking probation officer.  Good luck to him.  He couldn't find his prick if he didn't wear Y-fronts.  Do us a favor.  Can't even go have a slash without 'em saying, what're you going in there for?     I got a steady income -- I'm on the dole.  I fiddle it.  They got me down as an immigrant with five kids.  Last time might as well've been the first.  I remember all the times, don't I.  Watching her grow up -- in increments.  Well, she twigged by the time she was eight or nine that daddy wasn't in the Royal Marines or doing scientific research in the jungles of Borneo or playing Iago in a worldwide tour of  She used to tell me she'd turn me in. Little kid.  Ten year old.  \"If you're naughty, Dad, I'll tell on ya.\"  She didn't want me sent down again, see. When I was planning some job.  \"I'll tell 'em, Dad, I promise I will.  Here, look, I'm calling the Old Bill right now\" -- picking up the telephone.  I can see her, the phone in her hand.  Became a sort of joke between us.  Only it wasn't a joke.  I know that.  But as time went on ... well, it <u>wasn't</u> a joke, was it?  She had a feeling about it -- about the last job -- how long I'd get the hook for.  Said she wouldn't be there this time when I got out.  This is where I come in.  How's it going, squire, all right?  Now listen -- when I was in the nick -- second time, it was -- no, third.  Third stretch, yeah.  There was this screw had it in for me.  That geezer was top of my list.  Two years after I was slung, I saw him.  He was sitting on a bench in Holland Park.  There was no one else about.  I coulda gone up behind him and snapped his fucking neck.  But I left it. Coulda nobbled him, but I didn't.  'Cos what I thought I wanted wasn't what I wanted.  What I thought I was thinking about was something else.  This berk on the bench wasn't worth my time.  See what I mean?  It didn't matter.  It meant sod all in the end.  Look, mush, you're the guv'nor here, I can see that, I'm on your manor now, right.  So there's no need to get out of your pram.  I'm Johnny-come-lately to all this.  Whatever the bollocks between you and this slag Valentine, it's got nothing to do with me.  I don't wanna know.  I can well believe it.  I'm sure he has done, son.  He's about as straight as a dog's hind leg.  Your guess is as good as mine, mate.  I'm here on another matter entirely.  Good job your lot showed up when they did or it would've been <u>me</u> for the high jump.  Yeah.  Shouldn't wonder.  Must've done.  Nothing financial.  Strictly personal. I can see how all this import-export malarkey might give rise to confusion where I'm concerned.  A foreigner, showing up unexpectedly, like.    No, I can reassure you on that point. Valentine was just as surprised by that turn of events as you.  All of what?  Oh, yeah, right.  The deal.  As you prefer, squire.  As you prefer.  And that is?  Looking the other way. Gotcha.                 Again?  Yeah, I suppose.  Call 'em that, yeah. Down the boozer Saturday night.  Meet some of the lads.  You can't count on very many people, that's the trouble.  Number of times a decent job's been cocked up ...  Useless gits.  I was gonna do the Post Office once.  The lot.  The whole British bloody Post Office.  I had a brilliant plan -- all worked out -- work of genius, it was. Could I get anybody interested?  No -- they're too busy pinching orange squash from the milkman.  Lazy sods.  Jumble sale on in Watford, they'll be up at the crack of dawn.  Too bleeding true, 'n' it.                                             Tell me.  Tell me.  About Jenny. Tell me about Jenny. About the <u>deal</u>.  Whatever fucking deal you had to kill my daughter for when she found out about it, you bastard.  Tell me.  Tell me about it, you fucking bastard.  <u>Why</u> then.  Why did you do it!        Ta.  Yeah, that's right.        I would have preferred staying home, me.  Got called out to L.A., unexpected like, to do a job of work.  Yeah.  Another little matter needs attending to soon as I return.  Been away a lot.  Out on a oil rig.  In the North Sea. Nine years.  Well, time off for good behavior, you know.  I shouldn't have even been there -- it was these other blokes who shoulda gone in my place.  I got lumbered with the job they were responsible for.  I don't mind pulling me own cart, but not someone else's, know what I mean.  I had to, didn't I.  Nothing else for it. Then just when I'd finished my nine years -- my contract -- wallop, I had to bugger off to the States.  Could do, yeah.  But first I gotta give these lads a talking to, these geezers what sent me up the river, in a manner of speaking.  Yeah.  Them next.",
        "Elaine": "You're Jenny's father.  You look alike.  Not her brand.  Why did you come here?  No, why did you come here?  Been busy, have you.  It's been a while.  That's not what I heard.  I heard you were -- what's that adorable phrase? -- \"at Her Majesty's pleasure.\"  In any case, I don't suppose the salary you make sewing mailbags is really commensurate with international airline travel.  And not with all that buried loot you had waiting for you when you got out.  From the Wembley Staduim job, wasn't it?  Pink Floyd concert receipts.  Jenny would've been ... fourteen at the time?  Well, that kind of security can't be bought.  Must be more comforting than a daughter to greet you.    I was just going to toss some vegetable rolls in the microwave, open a can of diet soda. Want to take me out?  Sounds like Beverly Hills.  Sarcastic, moi?  Maybe I'll mellow when my ship comes in.  It's expected any day now.  I'm all packed and ready to go.    Three seasons.  They found that's the limit of human tolerance when it comes to following the adventures of a family of Mormons on the Chisum Trail. I was wife number three -- the ingenue.  Now who's being sarcastic?  I'm sorry.  I guess the rest of us have no excuse for wondering where the time went. It must've been the bars.  It's a kind of prison, doing a series. Early to bed, early to rise, no time off for good behavior, you grab the boodle for as long as it lasts. Only difference is you can't get arrested afterwards.  Not embarrassed.  Not ashamed.  Disappointed.  She never told anyone else. About the convict strain -- or is it stain?  No, I was privileged.  I was someone who helped Jenny efface her past.  When I'm not honing my craft in episodic television I do double-duty as a voice coach.  Not that her accent would have hobbled her progress.  Not with that look.  Modelling.  You weren't disappointed in her, then.  She was twenty-one when she came to me. ... Straight from leaving you.  She was happy here.  However the two of you might have parted.  Don't think she wasn't.  When did you get in?    I might've been away for the weekend.  And you've seen Eddie Rama.  I should really give him a call.  He's a character, isn't he.  Well, not to you. I meant to us squares in the outside world.  I gave him yours.  Said, here, you want to write, I think this is a relative.  I guess I thought I was being true to Jenny.  Who told me she didn't have a father -- before proceeding of course to tell me why.  Were you still married at the time -- to Jenny's mother, I mean?  The address Jenny gave me, that wasn't a prison, was it?  What's that, like a P.O. box.  Where you get your bank statements.  Some word.    Make yourself at home.  Steal something.  There's nothing I can't afford to lose.  Do you even know who Terry Valentine is?  Rock n' roll, is what we called it.  He's sort of a forgotten figure now, but back when the West Coast was the grooviest place on earth, Terry Valentine was where all the happenings happened.  More of a kind of promoter, I guess, whatever that means.  Just took that whole Southern California Sixties Zeitgeist and ran with it.  Packaged and sold it.  Made out like a bandit.    -- Your employer?  Who's Mr. Lindgren?  What line is he in.  I see.  I bet.  I thought you said you never did an honest day's work in your life.    In what capacity are you employed by this Mr. Lindgren?  -- When he wants someone run down, you're willing to do it for him.  So what's the deal.  You and Terry Valentine at twenty paces.  Is that what this is about.  Are you serious.  You fuckin' guys and your dicks.  You don't believe it was a car accident.  Terry's never going to give you satisfaction.  Not the type.  On what.  What makes you so certain.  There's the phone.  You want his number.     I'm not going to help you.  I was in the neighborhood.  I come down here quite a bit.  Watch the planes taking off. Study the architecture of early David Lynch.  Jenny was supposed to come to my place that night.  She called me, asked if she could come over.  She and Terry had been -- having some trouble.  Lately.  I don't know about what.  On this occasion, it reached some sort of crisis point.  She'd never called me like that before. She sounded more ... pissed off -- angry -- than upset or afraid.  But she never turned up.  I called the house but only got the answer machine.  When they found her ... she'd been going the wrong way. Not the direction she'd have gone if she'd been coming to see me.  Or coming <u>straight</u> to see me.  Who knows.  Maybe she just wanted to drive.  You think Terry gave me access to her things?  Probably sold her clothes.  <u>She</u> gave me your address.       This town's been chewing my flesh since ... what we now refer to as \"the early 70's.\" Christ, my past became nostalgia and no one even asked me.  These more highlights from the Zagat prison guide?  You don't know how I've compromised my standards.  It's too involved; a lifetime of non- involvement.  Anywhere else I'd be an interesting little number, here I'm just SAG number forty-eight thousand and one. SAG meaning Screen Actor's Guild.  Still, there have been rewards.  It's sunny.  And some of the producers who call even have credits.  What did you do?  To make them take the early 70's away from you.  You mean if they'd nabbed you before you actually broke and entered you would only have been charged with making a mess.  It didn't discourage you, though.  From pursuing your chosen profession.  I was inside once.  I punched a cop at a demo.  Who remembers.  Overnight.  What about just now?  You <u>have</u> been away. Or is all this just new to you?  I don't believe it.  Pushing the legal limit even then.  Your most recent incarceration.  What was that for?       -- they want Southern, I do Southern, they want Midwest, I do Midwest, they want tall, blonde, and twenty-two, I'm shit out of luck. One thing I can't do is English. Americans can't.  Shouldn't even try. And Laurence Olivier couldn't do us.  Only in the movies.  Yeah, well, you're here now -- -- where <u>h</u>urricanes <u>h</u>ardly ever <u>h</u>appen.  Stick with me, kid.  Looks big when you get here but you can cover it in five minutes.  So, is there anybody in your family who's not a criminal?  What about your grandmother?  He alive to see this?  What'd your father do?  I guess you're just habitual.  Won't he be looking for you about now?  Minor officials bother you, don't they?     Tell me you wouldn't prefer a steady income.    Yeah ... Jenny spoke fondly of her imaginary siblings.  Do you remember the last time you saw her?  She told me you were a ghost in her life. Daddy the friendly ghost.  Coming back to haunt her.  Still, you could never ... do what she wanted.  She never would have turned you in, not in a million years.              Not much -- you?  Uh-huh.  Probably.  Really.  Well, those are the breaks.  You just cooking then?    Poor baby.  You're just on a higher plane, Wilson.  (finding herself at another  No, but I know what he means.    I'd rather be with him than without him. I don't want to be found dead in L.A.",
        "Tom": "All I'm sayin' is travel time shouldn't be the same rate.  Travel time is down time, right?  I mean, we're not even in the same car as the client. You told me the job was at the house. When we get to it.  Well, are we shadowing the client right now or are we just going the same way?  The company I was with in Seattle, these distinctions were made. Now, I don't dispute <u>him</u> getting the full whack. Seniority and all that.  But if I'm getting paid the same hourly rate when we're at the <u>house</u> as I am in this car, that doesn't sit well with me and I feel obliged to say so.  'Cause in Seattle what you're paying <u>now</u> for so-called travel time was half what we got for actual clock-time with the client.  So I just feel we should get more when the job actually <u>commences</u>.      Mr. Avery.  Fuck.  Avery's down.        Fuck this.",
        "Johannson": "",
        "Jim": "",
        "Avery": "There's been some trouble downtown.  What the papers used to call a \"gangland slaying.\"  No, Terry.  They don't work like that. Jenny Wilson's father paid a little visit, left a message.  Well, either they have a very liberal work-release program, or he's out, because he's here in L.A., looking for you.  We wait, and we watch.                            You should have let me do the talking.  (more concerned about police  Heavier than that now.  But are there any drugs in that stomach to back up your story.  And where is this guest?  Don't they want to interview him.    You could use a few of my prime shitkickers up here.  There's already gonna be talk about how people close to you keep falling into canyons.  I have other resources.        Stacy.  Come over here.     How they goin', kid?  How'd you like to kill someone for me?  Same as last time -- the rest after.  When you find the guy, you'll know.  I'll point you in the right direction, but you'll have to take it to the end- zone.  He's a hit-and-run gunman -- I figure he's not cruising the Polo Lounge.  See, a successful man like me has limitations -- I lose touch at a street level.  So I have to depend on a smart boy like you who's closer to the nitty and the gritty than I am.  That's why I'm letting you take care of this.  I'm the one with appearances to maintain.  But who gives a shit about you?  Not even God.          Where's the remote?        Turn all the lights out.  I'll get Adhara.  Stay away from the windows.  I need you to come with me.  Please.       Everybody in the kitchen.  Behind the counter.  Because I'm taking care of it.              Watch my back.                             ... that way ..."
    },
    "imdb_rating": "6.9",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BOTAzNjI3ZWItNmMzMC00OTBhLTg2ZTItYWU2MmJkYmQ1ZWRlXkEyXkFqcGdeQXVyMjA0MzYwMDY@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "Fresh out of prison on his latest stint inside in being a career criminal in his native Britain, Wilson, an uneducated Cockney, heads to Los Angeles in learning that his young adult daughter Jennifer died in a car accident there, her car careening over a cliff into a fiery blaze at the bottom. Despite not being a present father because of his prison stints, Wilson is certain in knowing Jennifer that her death was no accident and that someone was behind it. With information from a couple of Jennifer's friends who she met in her pursuit of being an actress, fellow acting student Ed, who works in a restaurant kitchen, and Elaine, one of her acting coaches, Wilson learns more about Jennifer's life in Los Angeles and becomes certain that the person behind her death is the older wealthy man she had been living with, 1960s rock music promoter Terry Valentine, while not knowing the reason why he would have wanted her dead. Thus begins a battle not only to the death but of wits between Wilson and Valentine, the former who not only wants to discover the reason for Valentine killing Jennifer before Wilson in turn kills him, but who wants Valentine to know in return why he is after him. Getting in the middle is Valentine's similarly upscale security consultant, Jim Avery, whose job it is not only to protect Valentine from whatever harm or threat exists, but to ensure that both he and Valentine appear clean to the outside world in their criminal endeavors.—Huggo",
    "name": "The Limey",
    "genres": [
        "Crime",
        "Drama",
        "Mystery"
    ]
}