{
    "filename": "Life-of-David-Gale,-The_script.txt",
    "imdb_id": "tt0289992",
    "imdb_url": "https://www.imdb.com/title/tt0289992",
    "characters": [
        "Duke Grover",
        "Joe Mullarkey",
        "Zack Stemmons",
        "Berlin",
        "Bitsey Bloom",
        "David Gale",
        "Reporter A.J. Roberts",
        "Barbara Kreuster",
        "Constance Harraway",
        "Supervising Guard",
        "Door Guard",
        "Dusty Wright",
        "Motel Waitress",
        "Braxton Belyeu",
        "Margie"
    ],
    "dialogues": {
        "Duke": "",
        "Grover": "Well, I don't rightly know one fraternity from another. But if we catch any those boys out here again, we're gonna Arrest and Prosecute... You do that, Susan... Bye now.   (turning to Bitsey and Zack  Stemmons. Sorry, won't happen again. I'm Duke Grover, T.D.C. community relations.    Bitsey it is. Margie, I'm stealin' your umbrella.  Bitsey, you ever been in a prison?  On death row?  Well, we house 422 inmates here. Average stay with us is nine years. Some get commuted, move on, most get killed. It'll put you off your supper, but then it's supposed to.     Rules say seven days prior to execution inmates must be interviewed in a cage.  This changes for no man. You're not carryin' a weapon are you?  Mr. Stemmons, you packin'?    (to Bitsey, indicating the metal detector  Now, should any kinda of unpleasantness occur in the visitation area, we ask that you stay put. Come on through, Mr. Stemmons. And please follow the instructions of these fine correctional officers should they see fit to give you any.  Anythin' you say can be overheard.  Here we are.",
        "Joe": "",
        "Mullarkey": "",
        "Zack": "Half-a-thumb print.  Could have touched it before it was a murder weapon.  Yeah, I get very touchy around household plastics. 'Hello, everybody -- ooooh, Tupperware.' Chill. I'm just saying the bag could have been out on the counter or something.  Yeah.  But the murder's way too fucking clumsy. And this guy's a major intellectual. Top of his Yale class, a Rhodes gig, tenured at 27, two books. He's an academic stud.  Look at his wife, she's a regular Grace Kelly. Old money svelte. Father was Ambassador to Spain --  Ignore it. It's a rental.  No. Besides the guy's a flaming liberal.  Wrong, seventy-three percent of all serial killers vote republican.  I'm not gonna fucking pollute.  How far to Huntsville?  ('Hard Copy' announcer's voice  Little did they know their troubles were just beginning.  Oww! Jesus, yes. Isn't it always?  So what do I do?  Now what?  I hope whoever it is never saw Deliverance.  The non-smoking section's over there.  Oh.  9:15. The waitress says the Ellis Unit is about fifteen minutes out of town, so we've got like five and half hours. I --  I was thinking we should drive to Austin, check out the crime scene. Could be some story stuff for us.  Okay, what do I watch you do for the next five hours?  You know, your reputation as Siberian- Female-Dog-Person doesn't do you justice.  So where do we report?  Stemmons.  No, sir.  Hi.  Fucking better than watching you work.  You think he's telling the truth?  Can't say that. If you say 'there is no truth,' you're claiming it's true that there is no truth -- it's a logical contradiction.  I, on the other hand, think Gale's telling the truth.  It's just my perspective.  Thirty-three o what?  Bitsey.  You don't mind living here?  He's not exactly a serial killer.  Right.  What? Where was it?  Fuck, in her stomach? That's colder than Wisconsin.  What?  Yeah.  Same truck.    Fuck.  Hey.  You're not a happy camper.  Talked to the Austin prosecutor. Belyeu's a yokel. Prosecutor says he fucked up the penalty phase, says Gale probably would have gotten life on mitigating factors. Gale stuck with him, though, all through appeals, despite major pro bono offers.  Notta on Berlin, we pick up the money in Houston tonight, overheat light came on twice, and you're about to get a surprise.    This is mostly an Oklahoma caravan. I got stuck behind them on the way in.  Execution's not for another 36 hours. It's gonna be a zoo. There's the P.R. guy.  Fuck, look.  'Cause I couldn't see the license plate.  6:05. Why don't you have a watch?     What!?  So? Maybe the maid forgot.  I'll check the bathroom.  Clear in here! Don't touch it!  Fuck, Bitsey, there could have been prints.  She says no one asked for you. And all the room keys are different.  Just she and her husband have masters.  That you have a jealous boyfriend.  She didn't ask. I think she assumed it had something to do with why he was jealous. I still say we should do this in my room -- this one's a fucking crime scene.  Maybe they could look for D.N.A. Try three.  You sure you want to see what's on here?  Fuck. Is it her?  Belyeu says to bring the tape first thing tomorrow. Also said you were right about not calling the police.  Are you gonna be okay?  Let's say Gale's right. Some sick- fuck-Agatha Christie-wannabe set him up, arranged like the perfect murder. Why send a magazine journalist proof a few hours before he's won? Doesn't make sense.  Why does he give a shit?  That's a lot of hate. You're talking beyond sadism.  Then why release it?  Or?  The 'cat' is a fucking psychopath.  Why do they call it check-book journalism if we always pay cash?  Woa, woa. Sadist at six o'clock!     Yep, and doing a lousy job of hiding.  He must think we're idiots. You think he's our fucked-up feline?  No. Just sitting back there.  Too much mist. What the fuck does this guy want?  He went in Belyeu's building?  Fuck!  How are you gonna get to Ellis?    Any word on the writ?  What?  Yeah, I guess. It's a hotel room. What --  No. Fuck, Bitsey. I'm sorry, it's not like it's --    What?  Where?  It's just a patriarchal figure of speech.  Move those index cards, too.  We can imagine that part. I'll position her.  Towel or something.  Fucking good question.  Jesus, maybe she was faking, hoping he would go away.  Woa. Not a good idea.  Bitsey, I'm not so sure about this.  Twenty-two seconds.  Thirty seconds.  Thirty-five... Forty... Forty-five... Fifty.  Fifty-five... one minute... five... ten... one-fifteen...  Fuck. Twenty... twenty-five... thirty...  ...thirty-five... Fuck... one-forty... one-forty fi...    No more fucking experiments, all right? Just tell me what's going on. You okay?  Maybe, all right, maybe. But why wear these?  Woa, chill, chill. Why not hang yourself, or take pills. Why take your fucking clothes off? Why make it look like a murder?  Why, Bitsey? Why fake your own murder?  Motive's like a major issue here.  It doesn't make sense. The woman's a bleeding-heart abolitionist. Why frame an innocent man? Why send Gale to the chair for what looks --  She had to know some innocent fuck would take the fall.  Get the fuck out of here.  A dead woman put the tape in your room?    Hairy.  She was in love with him.  Why he was fired from DeathWatch, and the A.C.L.U.  Which would only prove the system works.  So he'll wait, release the whole tape after the execution.  Let's talk about your tape... No, meet me at the station down the hill, in fifteen minutes.  I know. Go.  Go!  Come on. Fucking come on.  He didn't show! Fuckin' move!  Took me 30 this afternoon. You've got 26, maybe more.",
        "Stemmons": "",
        "Berlin": "Sorry about being late. There was, you know, a thing.  Look, I know I'm not doing well.  And to torture a cliche, I'd do anything to pass.  Anything, Professor Gale.    Any thing.  Talking about me?    What?  Aren't we so fucking clever.  You were a jerk this afternoon.  Is that supposed to be an apology?  One more. C'mon, one more.  I'm not a student anymore.  There once was woman named Berlin, Who liked a bit now and again. Not now and again, But Now! And Again! And Again! And Again! And Again!  Cute, huh?  I have a secret. But I have to come over there to tell you.  Here I come.    Ssshhhh.  We'll just talk, analyze, contemplate. Or... you can put your mouth on my body.    Rip them.  Rip them off.  No. From behind.  Yes.  Do it hard.  Harder.  Harder.  Yes.  Bite me. Bite my shoulder.",
        "Bitsey": "Gale's going down.    Meaning?  Protecting sources, even kiddie porn scumbags, is magazine policy.  I could go if I were an ugly blabby guy?  'Well, Your Honor, I started to notice that my assignments were evaluated on the basis of my sex.'  'Certain references were made -- '  I'm not baby-sitting.  Gale was seen leaving the house.  His sperm was inside her.  His prints were all over the kitchen, including one on the bag.  Okay, half-a-thumb print.  Do you fondle your friends' garbage bags?  Hey, Zack?  He did it.  And, empirically speaking, a psychotic.  (looking at the car's instrument panel  Thanks, Zack. Do you smell anything?  A person's politics has nothing to do with their propensity to commit crime. Aren't we supposed to smell it if it's overheating?  Throw the cigarette out so we can smell.  No! You'll stink up the car. Throw it out!  Zack!  We better pull off. Shit, this is so irritating.  Look.  Is it hot?  I don't know, something male.  Company.  Actually yes.  Little early, isn't it?  I meant the book.  What time is it?  Never eat where the menus have pictures of the food.      My reputation got us invited here. I play by the rules. It's called objectivity.  Yes, hello.  Bitsey.  Yes.  No.  No.  Thank you.  Yes.  He said the gift shop could do it.  This is Zack.  Hello.  So...  He's a character.  Where's your ex-wife?  All right. Anything else, just clearly say, 'off the record.' I'll take it to my grave. But then you know that about me. Otherwise I wouldn't be here.    I'd say you're a man with a story to tell, Mr. Gale. You chose the magazine, the format. You chose me.  Go.  Why'd she do it?  Do you know where I can find her?  Anything written on it?  Try phone records, a net search.  Don't ask me that. I don't know. There is no truth, only perspectives.  Working on our philosophy merit badge, Zack?  This you know telepathically?  Seven. 'Check out the crime scene in Austin.' You made it sound so close. Shit, two and half hours and that damn lig --  Hi. I'm Bitsey Bloom and this is Zack Stemmons. We --  Uh, yes.  Okay.  Oh, sure.  Do many people take the tour?  We know, you can save that.  It was in the case file.  (looking in the rearview mirror  The vanity mirror, pull it down.  See that truck behind us?  Isn't that the cowboy from the rest area?  Weird coincidence, huh?  Alright, we're off.  You're telling me someone's framing you?  Right, facing her body. Are we on?  Maybe you're being paranoid?  Any ideas who 'they' are?  Belyeu's hired a detective?     (waving her hand at the smoke  It's not a happy place.  What else?  I don't want a surprise.  What a life, waiting around for someone to die.  This is a little too coincidental.  Forget it. What time is it?  It's a long story.  Give me an hour.  Zack!  It's open.          Look.     What did you tell her?  Thanks. How about the V.C.R.?  Whoever got in here -- without a key in broad daylight -- was probably smart enough not to leave prints. I have the remote.    No. Start it.  I hope this isn't what I think it is.  God, no.  Turn it up.  No, it's perfect. He knows News Magazine won't give the scoop to the dailies or nightly news, not after having paid for it. Probably guessed we wouldn't call the cops. And, most importantly, knows I'll tell Gale tomorrow.  Zack, what if Harraway's murder was just a means to getting Gale. I mean sending him through hell, a sick cat and mouse game. You kill the one person he has left. Make sure he sits six years on death row for the murder -- a place he's made a public career of loathing. And then just let him die, die knowing everyone will remember him with disgust. You destroy his loved ones, his life's work, his memory -- and you make him watch.  If the mouse dies the game's over. Maybe the cat's enjoying himself. Or...    Yeah, but smart.  Is it the truck?  Is he gaining?  Can you see the license?  I couldn't sleep afterwards.  Yeah, but it's her kitchen, in her house.  But it will at least get us a postponement?  Why?  But someone put it in my hotel room.  Thanks.    Shit.  Did you see the cowboy go in?  Into his office. Just saw him.  Follow him. Find out who he is, where he lives -- what he --  A taxi.  Then why was he following us? Why was he at Belyeu and Crane?  Why?  He would've said something.  Maybe Dusty was jealous because you were seeing Constance.  She died... she had your sperm --     But there has to be someone. Someone with a motive, who knew you both. Someone who visited that morning.  There's not enough time.  You know that's not what I meant. You should have done this earlier.  You're going to let them kill you.    No thanks.  What time is it?  Belyeu!  Did you have Dusty Wright follow us?  You could have said something.  No.  How's David?  Tell him I'll take care of it, about his son, I mean.    Were Dusty and Constance close?                Did you throw the towel on the floor?  The towel on my bathroom floor. Did you put it there?  Do you do that at home?  Get up.  Grab the T.V. I want to check something.  We're taking a tour.  Austin. Get the T.V.  Wanna make a hundred bucks?  We're going over the crime scene.  And for the next hour I want you to do exactly what I say when I say to do it. If I say suck Zack's dick, all I want to hear from you is 'May I swallow.'  Is your boyfriend here?  Well is his video camera here?  Get it.  Zoom in a hair.  Put the gloves on a dish rack.  Turn them inside out.  Move the tape roll about a foot to the left. And get rid of the handcuffs.  Come check this, Zack. Could you... what's your name?  Nico, lie down on the floor, facing the counter.  That's fine. Just straighten her legs.  What's this?  Okay, look at this.  I noticed this back at the hotel. See?  She moves her foot. Why?  It's another fifteen seconds before she comes to. If she had passed out once, without fresh air she wouldn't come back. There was no head trauma, her blood tested normal --  Or...  We've got to bag her.  All right, I'll do it.    Three full minutes. Just stand behind the tripod. Both of you.      (still breathing heavily  She used the gloves to keep fingerprints off the tape and bag. Then she put them back on the dish rack, but upside down and inside out, a housewives' habit. A murderer would have just tossed them aside -- like they were the first time we were here, like you do a towel in a hotel.  They threw me. I forgot you have to have the key to put them on. But she needed them. She knew she would instinctively try to rip the bag off, that at some point automatism would kick in.  And she swallowed the key so she couldn't get to it. She made sure there was no way out.  It's so calculated. She's handcuffed, taped at the mouth. The gloves. The damn tripod.  I don't know.  Thanks, Zack.  What'd you say?  Oh my God, Zack, that's it! That's why! To prove it happens. To have absolute proof that the system convicts innocents.  No, that's how she thought. She lived for DeathWatch. If she's gonna die, why not die for it? That's why the tripod was here. To record proof, undeniable proof, the tape. That's why we got an out-take.  Of course not. She needed help, someone to keep it, release it. Someone she could trust, someone dedicated to the cause...  Come on.  ...Because of the Berlin thing, Constance knew the police would go straight to Gale. In a way, he's perfect. A high profile alcoholic whose life was shit anyway. But...  I don't know. Something. They were close. She wouldn't want him dead.  Remember this thing about Dusty being a bull-horner, going to far?  Right. Maybe the plan was for Dusty to release the tape after Gale's conviction, after a year or so. You know, force him to dry out, let him play the heroic victim, give him back his dignity. So, Dusty Wright's sitting on this tape, waiting, the only one who knows about it. And maybe good ole Dusty starts to think that an erroneous execution is a hell of a lot more politically useful than a last-minute save.  Yeah. Almost martyrs don't count. What's one murder to stop thousands?  Right. Somewhere he must have the original. What time is it?  Don't move from the booth. Call the second you see the truck. Remember, let it ring just once. Then get into the woods --      Shit!  Shit!            Everyone! Wake up New York, the warden, the Governor, the goddamn Supreme Court death clerk! How far is it?  I'll make it.           Key to your freedom? Key to your...",
        "Bloom": "",
        "David": "I'm going home. Let's do the press fax tomorrow.           Hey!  Yo! Officer!  Your seatbelt.  Hello.  (to the microphone above him  They're practicing being cruel and unusual.  I need it for Billy's appeal.  Sorry. Have a seat.  Yeah, known Benny most my life. Met the summer after 4th grade, spent the day burning ants with his dad's magnifying glass. We called it playing 'Execution.'  Since I grew up in foster homes, he's become the only family I have.  We agreed minimal contact would be easier. Please don't mention her, or my son.  How should we start?  Think. What do you fantasize about? World peace? Thought so. Money-Fame-Ferrari? A Pulitzer? Nobel? M.T.V. Music Award? A genius hunk -- ostensibly bad but secretly simmering with noble passions, and willing to sleep on the wet spot?  A Victoria's Secret model -- just slumming between law school and running her family's Vastly Endowed Foundation for Tragically Sad-Eyed Children?  Okay, good, you see Lucan's point. Fantasies must be unrealistic. The minute you get something, you don't, you can't, want it anymore. To exist, desire needs absent objects. So desire supports itself with crazy fantasies...  This is what Pascal means when he says the only time we're truly happy is when day-dreaming about future happiness.  Or why we say, 'The hunt is sweeter than the kill' or 'Be careful what you wish for.'  Not because you'll get it, but because you're doomed not to want it if you do. Think about it next time you're at a wedding.  There usually is, Berlin.  Anything, huh?    Tell you what, I'll give you good grade, a really good grade, if you will... ...study.  Hey.  (pretends to read a quote  Tell me again why you aren't doing the debate.  I hadn't noticed.  That's not what I meant.  'Governor, you bat a lovely lash for a woman who executed thirty eight last year.'  Anything else?  I'm going to Greer's party. Fax them to Sharon's number at the house.  (hangs up, walking away  Did you mark your calendar?  Only three. That's great, huh?  What's he doing in here?  Where's your laser gun?  That's 'cause you're a special-duper- super-quadruper boy. Who's now going to sleep.  Who loves you?  Ooooh. Good night, son.    Back before midnight.  Rest assured.  Meinen Herren.  Spain.    Yep.  He mentioned it.  It's called schmuck.  The part of the foreskin that gets thrown away. I think it's called schmuck.  Black Bush.  For what it's worth, I didn't know about the suspension.  More like a conciliation.  (feeling good but very much in control  Enough. That's enough.  I'm done.  Don't think I want to know what that means.  Cute.  Berlin, this, this is not...  What?    And 'Almost Martyrs' don't count.  Um-hum.  What?  I can listen and appear to listen at the same time. Yeah, no. Damn, I left it home.  Nothing. Everything. Something profoundly stupid happened last night.  It was Berlin.  Constance, you're not my wife. Thank God.  I didn't mean --  Are you okay?  So you don't subscribe to the idea that 'a good state is one that protects its most despised members'?  It's a quote from you, Governor, from your first state attorney campaign.  So, basically you feel, to choose another quote, 'society must be cleansed of elements which represent its own death.'  No, ma'am. That was Hitler.  Governor, can't we examine the possibility that capital punishment isn't working. That murderers aren't deterred by the law because they have about as much forethought as lemmings. That it's expensive, inequably administered, that...  ...that we may even be killing innocents.  Dead men can't make a case.  Thank you, Governor.  Of course.    What's that supposed to mean?  Look, guys, there's not much more to say --  What, arguing with the Governor is a crime?  Berlin had my bite marks, bruises, ripped clothing. My skin was beneath her nails. It didn't look like anything but rape. Two days later she called the D.A., said she wouldn't testify, too drunk to be sure, etc. On the plane home, Sharon read about her husband's rape case being dropped.    First year in here I received a card postmarked San Francisco. It wasn't signed, but I suspect it was from her -- the front had the text 'Sex is Power.'  Yeah. It said, 'I'm sorrier than you can know.' See you tomorrow, Ms. Bloom.  Off-the-record?  Constance was murdered with what's called the Securitat Method. You're hand-cuffed, forced to swallow the key, taped at the mouth, a bag's sealed over your head and you're left to suffocate. The Securitat did this to Romanians who wouldn't inform or confess. Sometimes the bag was ripped off at the last second, you got a second chance. If not, you die knowing the 'key' to your freedom was inside you the whole time. A cheap-but-effective metonym. Problem is I mentioned the method in an early article. The prosecution never knew.  It's more than that.  There was a tripod.    Ms. Bloom. I'm an anti-death row activist on death row. Doesn't that strike you as odd?  No.  But I have someone on it, someone I'm hoping will one day find an answer.  A journalist.    Who's your hero?  Call me when you get to Boston?  I wish you --  After awhile, Crocodile.  Okey-dokey, Artichokey.  Okay?       Well?  How did Ross vote?  And you?  So, I wanted to get your feedback on the idea.               So my chances of getting partial custody aren't good?     I feel... washed.  Nothing like I need you, both. You're all I have.  Jo Ann will be commuted and you'll only prove the system works.  (referring to the bruises      Constance, who did she kill?  She admit to it?  You're a crazy woman. Not your medium grade thinks-she's-Teddy Roosevelt's- bathrobe, but stark-raving-loose- screws-in-the-belfry insane.  A real danger to flora and fauna.    You're burning up.  Hello, folks.  Gladly.  Latte on your left, partner.     Sharon, pick up. For once just pick up the goddamn phone! If you keep him in Spain, I'll... I'm begging you. He's my son! Please! Please.... Please.  We're seeking refuse, refuge, uge.  We fell off our wagon.  Know why Saint Jude is the patron saint of lost causes? 'Cause his real name was Judas. There were two Judases, Judai, the saint guy and the bad Judas who ratted on Jesus, and tried to kiss him. Medievalers wouldn't pray to good Judas for fear of getting bad Judas on the line by mistake. Ergo, they only gave him business when really desperate. That's why. Then they changed his name.  Constance?  Your mail's blowing.  Fine. How's Constance?  What?  Constance has leukemia?  No, no.    When I asked why she hadn't told me, she muttered, 'too busy.' I guess she figured as long as death was chasing her, she could help others escape.  Constance left the world better than she found it. It's a small, difficult thing.  Okay, okay. Calm down. You have to sit.  (to the microphone above   He and Benny used to work A.C.L.U. cases together, until Dusty punched a clansman in a federal court. Benny sometimes still gives him work, probably had him follow you.  To make sure you honored your agreement, one for which there's no contract.  He's a lawyer, Ms. Bloom.  I wasn't 'seeing' Constance.  It's more complicated than that.     Denial, anger, bargaining, depression, and acceptance. Where are you?  Denial's my personal favorite.  Mending bridges.  No regrets?  Me, too.  How much... how many lovers have you had?  Including college.  Well, it's... not every... yeah, you should have had more sex.  I see you.  Want to make it five? Finish the hand?  It wouldn't be pity.  Are you okay?    I'm here.  It's okay.  Okay.  Shhh. I'm staying.  It's okay. I'm inside. I'm not pulling out.  I know, I know.  Shhh.  I'm here. It's okay.  Shhh. I'm here. I'm here.  Rescued. You?  Let's say they move back from Spain, that I somehow got my one weekend a month. Would it matter? By high school, I'd be his weak spot, the focus of locker room jabs, embarrassed pride. In college there'd be late- night angst: 'What if I turn out like the old man?' Holidays would be forced smiles and unscheduled exits. I mean, what girl comes home with you if there's talk that Pops is a rapist?  I can't stand the idea of being his model of failure. Without him, I drink. To cover the hole. To prove to myself he's better off without me.              If I could answer... we wouldn't be having this conversation. It's why I need you, why I chose you. You have my story, now... 'Go.'  You'll find time.  You're not here to save me. You're here to save my son's memory of his father -- that's all I want.  We live to stop death. Eating, inventing, loving, praying, fighting, killing -- choose a verb. All to stall this evil, Job's 'king of terrors.' But what do we really know about it? Nobody comes back. There's a point, when your mind out-lives its obsessions, when your habits survive your dreams, when your losses... You wonder, maybe death is a gift. All I know is that by this time tomorrow, I'll be better off. What I don't know is why. Goodbye, Bitsey.  I couldn't watch.  It helped her to think her death would save me.  Yeah. Almost martyrs don't count.",
        "Gale": "",
        "Barbara": "",
        "Kreuster": "",
        "Constance": "David, don't start throwing things.  Go. I'll do it.  David!  The T.A. finished transcribing the Governor's radio and TV comments. Listen: 'I hate killing, that's why I'm willing to kill to stop it.' The woman breathes in soundbites.  You might can use some of her pre- centrist stuff.  Telegenics. You have a cuter butt.  I know.  She's gonna do the whole mother thing. She empathizes with you completely, but experience has given her the courage to take the tougher road, ta- da, ta-da. Keep it rational. And flirt politely.  And watch your ego. Don't come across as one of those I-hate-authority- because-nobody-in-charge-reads-the- New Yorker types.  Yeah, don't fall into one of your brooding silences. Oh, I'm getting new federal stats from Amnesty tonight.  If you have a hang-over tomorrow --        Okay, let's say we find an innocent on death row. Wouldn't matter. Corrections would let him go. Governor Harding would go on TV, say, 'Thanks to the good people at DeathWatch, the system works.' Yeah, if they executed an innocent, and we had absolute, undeniable, in-your-face proof, we could demand abolition. Just like happened in England. Are you okay?  But it hasn't happened, not since '76. And won't happen.  Dead men can't make a case.  Just keep it rational. The death penalty is expensive and ineffective. No one wants to see a murderer as a victim.  And stop that.  Active listening. I hate active listeners. Makes me feel like I'm with a Dale Carnegie grad who cares more about appearing to listen than actually listening. Did you bring the Amnesty fax?  I have a copy.  You want to tell me what's up.    Jesus Christ, David. Was she one of yours?  Oh, that's great, great. I can hear the grapevine now. They suspended her so Gale could dick her with a clear conscience.  A power differential equals coercion. Great. You are so weak.  I know you can tell yourself it's a position I aspire to, but believe me, I would rather...  Let's go.  Yes, let's just go.  Your exact words were, 'Just tell me when my ego gets in the way of the work.' Now I'm telling you: Your ego's in the way of work.  You put up precisely two seconds of protest at the thought of a televised debate.  It means DeathWatch suffers because you're so anxious to finger authority, to publicly prove that David Gale is so much fucking smarter than the powers that be. Learn to work without an audience. Try squeezing money from the donor list. Have you ever licked one single mail-out envelope?  I'll drop by your office after.  You could at least hide the bottle.  Officially, you're on sabbatical. Unofficially, they want you to look for another position. It was four to two.  You're not supp... Against you.  Against my politics.         I'm sorry.        You look good.    Look.  Jo Ann Johnson's been re-scheduled.  I've got a call with Hawkins tonight, and if national will commit emergency funds...  But I'll save a life.  Spring cleaning.    She went up at 18, she's 26 now.  I really want us to get behind this one. She's articul --  A cop.  You're mixing metaphors.  Are we gonna do this?  I'm sure we can get some pulpit time, maybe cable.    No.        Come on, come inside.     All I can feel is envy.      Remember those Kubler-Ross stages, the ones the dying go through?  Denial.  The whole idea of there being a process makes me tired. I'm not up to the job of Dying Person. Marveling at blades of grass. Lecturing strangers to relish every moment.  Mending bridges. Confessing regrets. Uuuggh.  Nope.  Take that back. I wish I had a child.  I'm sorry, David.  I guess I just wish I would have risked more.  (making a face, swallowing hard  Including college?  You work hard not to be seen as a sex object. Before long, you're not seen at all.  A pity lay. No thanks.      Don't worry.  It's good.  Talk to me. Let me hear your voice.  Hold me tight.  Tight... I'm scared.  Don't stop. Stay in me. Please stay in me.  I need to feel you inside.  I'm so tired.  Tired of being afraid.  Help me.  Help me. Please. Make it stop.        How do you feel about last night?  Like I have a reason to get out of bed. Ironic, huh?",
        "Harraway": "",
        "Supervising": "",
        "Guard": "Sit down, Gale.    Gale, time's up.        Visitors need to stay seated.     Car's on its way. Wanna wait in here?",
        "Door": "",
        "Dusty": "Hello?  All there?    Senorita Gale esta viviendo aqui?  Gracias.    Want me to turn this off?  She preferred it that way. You were right about not tellin' her the whole plan.  You sure you want to do this?  Better go ahead then.",
        "Wright": "",
        "Motel": "",
        "Waitress": "",
        "Braxton": "",
        "Belyeu": "Miss Bloom?  Did that P.R. man validate your parkin'?    Benjamin Belyeu, Mr. Gale's attorney.  Pleasure. And this is the man of the hour.  Now, why can't they turn that thing down?  Mrs. Bloom, I'm sure you're a bitin' at the bit.  Now, it is our understanding that you are to have three two-hour sessions. Today, tomorrow and Thursday, all at three in the P.M. I'm sorry we can't afford you more time, but contrary to popular rumor we have not yet begun to fight. Furthermore, it's our understanding that you will do this with no recording equipment of any kind. You have my Gregg book?    (handing her a business card  Fine, till Thursday then.  Good luck, Miss Bloom. I'll come by later. We can play a game of hangman, take up smokin'.  Bye, ya' all.  Because divorce proceedings do not require her presence in the country. For a custody hearin', yeah, she'll have to return.  But without successful completion of an alcohol treatment program, you'll be lucky to get the odd Thanksgivin'.  Roughly the same as you sinkin' that from here.       Fine. Oh, and bring in Miss Bloom's original when that's done. Don't blame you for not watching that twice.  I understand. I generally tell folks I'm no more afraid of the grim reaper than I am of a Presbyterian on Mother's Day. But watching your tape... well. I had to keep tellin' myself 'that's not Constance' just to get through. Unfortunately, others may argue the same.  Currently home to Weirdos Incorporated. Arguably, that tape could have been made by anybody with twenty dollars and a tolerance for vulgarity.  I hope so, Miss Bloom, I certainly hope so. But you've got to remember that there's a machine a runnin'. And come six o'clock tomorrow mornin' that machine wants to be fed.     You've been fraternizin' with the condemned. In the court's eyes, he's the most likely candidate to have put you onto the tape. He's a persuasive man, you're a out-of-state woman -- it don't look good on paper.  A fact for which we have no evidence.  Thank you, Bobbi.    Fine. I'll call over at the motel later and give you an update.  I employ Mr. Wright from time to time.     Denied. Tape went to a federal judge two hours ago. Your videographer friend made contact?  What you got was definitely a snippet. Could be he has more previews scheduled. Best stick close to your room.  Holdin' up. I'm headed back over.  Will do. We'll talk later?  Watch yourselves.  Thick as thieves.  Passport and ticket as well.  What are you going to do?",
        "Margie": "He's usually real good with names.  Okey dokey."
    },
    "imdb_rating": "7.5",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTAxMzU0NTgxNzZeQTJeQWpwZ15BbWU2MDQzNDkxNw@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "When anti-death-penalty activist David Gale is convicted and condemned to death for the murder of a colleague, reporter Bitsey Bloom sets out to learn the story behind Gale's crime. What she finds challenges her belief in Gale's guilt and, finally, in the justice system.—Jim Beaver <jumblejim@prodigy.net>",
    "name": "The Life of David Gale",
    "genres": [
        "Crime",
        "Drama",
        "Mystery"
    ]
}