{
    "filename": "Island,-The_script.txt",
    "imdb_id": "tt0399201",
    "imdb_url": "https://www.imdb.com/title/tt0399201",
    "characters": [
        "Dr. Bernard Merrick",
        "Laurent Team Member",
        "Lincoln Six Echo /Tom Lincoln",
        "Lima One Alpha",
        "James McCord",
        "Gandu Three Echo",
        "Jones Three Echo",
        "Albert Laurent",
        "Starkweather Two Delta /Jamal Starkweather",
        "Jordan Two Delta /Sarah Jordan",
        "Community Announcer"
    ],
    "dialogues": {
        "James": "",
        "McCord": "Sorry, chief. I can't let you get any closer. We got live wires over there.  What's that you said?  He y , you get yourself contaminated, don't come pointing the finger at me.  You know how it is. `Gets to the end of shift, `crew starts draggin t h e i r feet.  I guess if we bust our backs, we could be out of here by the end of the week.  Thanks , chief. I appreciate that.  What do you mean?  You mean, these things? Well, these things ain't good for you anyways.  That's because we ain't supposed to. They got rules about fraternization.  M o r e of the same. They cycle us onto the disposal detail. Hump `n dump crew.  D e b r i s clearance. We hump the heavy stuff to a site on the outside.  Right.    He y , take it from me, you got a sweet deal right here. So why worry, huh?",
        "Albert": "",
        "Laurent": "",
        "Community": "Good morning - this is a community bulletin... Following an incident in Sector Four earlier this morning, The Department of Sanitation is issuing an all-sector contamination warning...  The incident involved a resident found to be infected with a pathogen. While the risk is assessed, residents are advised to be aware of the symptoms. Should you experience aberrant levels of anxiety or witness it in others, immediately contact The Medical Center.",
        "Announcer": "Good morning - this is a community bulletin... Following an incident in Sector Four earlier this morning, The Department of Sanitation is issuing an all-sector contamination warning...  The incident involved a resident found to be infected with a pathogen. While the risk is assessed, residents are advised to be aware of the symptoms. Should you experience aberrant levels of anxiety or witness it in others, immediately contact The Medical Center."
    },
    "imdb_rating": "6.8",
    "description": "Set in a dystopian future, a group of people work in a facility, essentially as slaves. They do have an incentive though - a regular lottery is held and one of them gets to leave the facility and its restrictions and move to The Island, a paradise. Lincoln Six Echo is one of the workers in the facility and he is infatuated with Jordan Two Delta. His life is fairly uneventful and mundane until Jordan Two Delta gets selected to go to The Island. Then Lincoln starts to discover the truth about the facility and The Island.—grantss",
    "name": "The Island",
    "genres": [
        "Action",
        "Sci-Fi",
        "Thriller"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMzA0MDExOWQtZjZkOC00NTcwLTk2NzEtYmU4ZGM5OTczZmVmXkEyXkFqcGdeQXVyMTM1MDExOTE2._V1_QL75_UY281_CR5,0,190,281_.jpg"
}