{
    "filename": "Master,-The_script.txt",
    "imdb_id": "tt1560747",
    "imdb_url": "https://www.imdb.com/title/tt1560747",
    "characters": [
        "V.A. Doctor",
        "Freddie Quell",
        "V.A. Patient (as Patrick Biggs)",
        "V.A. Patient",
        "Portrait Customer",
        "Rorschach Doctor",
        "V.A. Nurse",
        "V.A. Doctor /Interview"
    ],
    "dialogues": {
        "V.A.": "",
        "Doctor": "What are you going to do when you get out of here? You're going to have to wear a belt for six months, maybe a year...  A surgical belt. You won't be able to do very heavy lifting.  But you spend time outdoors.  What do you do?  You didn't have very much on you when you were admitted. Where were you going?  How old are you, Freddie?  Why don't you turn honest? You seem like an intelligent fellow. 'Quick on your feet - you like to drink?  I know what the other is too.  The tattoo's.  No one ever made money chasing girls.  Who's that?  College?  Why'd you leave?  That's how you end up like this. With a burst appendix. 3.  A medical belt. Similar for lifting. You're going to need some money. What do you plan to do?  You don't owe me anything. I'm on surgical duty. But you're expected to pay the hospital for medicines. And your belt.  You couldn't be an orderly, it's too much lifting -- and a lot of things you'd have to learn. But maybe you could run an elevator, something of that sort.  I know you were, Freddie.  Too lucky?  Were you in the service?  Navy? 4.    Your luck was up this time, Freddie. You should have seen the pus in your belly. Something to think about. It's not too late to stop being a weisnheimer, no matter what you think. you're still a young man.  Freddie places a note on the door of the Doctor. He walks away, CAMERA sees the note, it reads:",
        "Freddie": "What kind of belt?  .I try to stay away from that.      I was on my way to Placerville. To the Fair. Had a job waiting for me, with a friend of mine. He doesn't know where I am.          It's a weakness. But I like it.  How can you tell that? I'm clean.  Is that a weakness...  You're wrong. This tatoo's my Auntie.  My Auntie Bertha,  But that doesn't mean I don't have a weakness...  I tried that, it didn't work.  Sometimes my hypo's get the best of me, I really feel like walking into the street and hitting people's hats off.  That's when I know it's time to get to the sea.. what kind of belt?  I'm going to pay back the hospital. And you.  Alright. I intend to do that. You saying you have a job for me? What? As an orderly?  I want to get out of here, but I also like it here. You think I was gonna die?  I don't know. I'm not saying you didn't save me... . but...I can't seem to die.  Something like that.  Yes, sir.      You come any closer and I'll slice your  You can talk standing in front of the restaurant, around the corner -- At that moment, TWO OTHER MEN come out of the shadows and  He's left a little bloody, messy, no money in the alley.  You have a break coming?  When?  I saw you.  What's your name?  Freddie.  This is homemade..  Yes. She sips it. Makes a face. Horrible.  Taste good? 7.  Maybe we think the same things at the same time.  Yes. She pulls her top down, the coat drapped around her-reveals her breasts -  Yes.  Wanna go out tonight?  I don't have any cigarettes...  There's secrets in liquor, this is just booze.    .somebody shut him up..                 Yeah, fine. 12.  Alright. What is this?  I walked.  I was just looking f'work... I'm working here.  I need to sit down. Freddie is already sitting in a chair they have him in.  Whatdchu put in my drink?  I'm sleepy. 13.  .I just need the work. Wasinmy drink?  .I'm a good worker..Iknowthese ships... BEAT. Freddie just looks at him, then MASTER SPEAKS:  I am.      Yeah? Whatdo you do your company?         I just want to go to sea. I am looking for a berth--  I'm a seamen.  I like being at sea.  What do you want? .what's your name?  Nothing.  I'm here to work, I know ships...  No. I don't know-what?  More than a little watchu put in my drink. 15.  Dick.  Don't know him. / no  . you got alotta questions..  I don't know you...  Yes, sir.  I just woke up.  My name is Freddie Sutton. 40114-78  Yes.  Hah.  I fired and fixed torpedo room, USS Barton. Yes, I killed people. I'll Kill you.  Wakemeup.  You know where - dn'ask me what you know... wakemeup wakemeup wakemeup come on wakemeup.  -- I toldju I'm just trying to get to sea.  It was leaving...  It was leaving...  No, sir. 17.  You make me feel like I'm in hell. lemme wake up or lemme sleep.  Sure.  Thanks.  Thanks.  LONG PAUSE. Freddie's eyes close ane he passes out again.  Morning sun comes in, hits him in the face. Wakes him up. He looks around. He looks out the window.  Alright.  Is this your ship?  Where's it going?  Yes.  .what did I say last night...?  You have any?  What was in my drink?  I didn't surrender myself. 20.  I don't think I was.  So what are you gonna do?  Depends on when you're ready to go...do you have a job for me.  What condition is that?  What's that mean?  I've got no trouble. You got a job for me to do, I can do it.  Do you own this ship? 21.  .What do you do?  Where's your money come from?    .well: I apologize if I got a little out of hand last night - I'm just... looking for work and your ship looked good, so...it's a nice looking ship.         I don't understand what you're talking about.    I'm not saying yes to anything I don't  What about it?  Secrets.    It's just booze.  Horrible Hooch. BEAT. They both smile, laugh a little. MASTER gets up and comes over him...    Oh yeah?  .I don't know...  .what destination?  Sure.  Ok.  Hello.  Yes.  I don't really know.  I don't think so. VAL is distracted by a WELL WISHER who comes over. FREDDIE looks around at everyone. All the faces having a good time and celebrating... He catches the eye of a YOUNG WOMAN. . .then sees her  Yeah.  No.  Whenever you'd like. I'll get making it -  I'll take care of it. MASTER makes his way down the table trying to say goodbye to everyone, he finally tears away from the party by  He lays in bed and reads the book. He reads about to lines and his eyes slam shit, asleep, still holding the book.  Who's attacking him?  What's a time-hole?  Yes. She hold her pregnant stomach;  I'm fine.  Well-not really-no...  How long have you been studying 32.  What's your name?  That's right.  Hi.       .drink just a little. It's very strong. The good stuff takes time. And there's secrets in good liquor. This is just booze for now...  Good.  Yes.  Sure.  Yes. 34.  Yeah, good. They CHEERS AND DRINK. Shudder at the strength of it.  Sure...  Yes. HE FLIPS THE TAPE RECORDER ON. Master smiles, reads,  Freddie Sutton.  Freddie Sutton.  Freddie Sutton. 35.  Freddie Sutton.  I usually put some thought into them.  No.  Only on my good days.  No.  No.  No.  .I don't know. . .you keep asking me..no, not really. 36.  .not really ... .. life's alright.  Sure.  .sure... Yes.  Not really  Yeah.  No .about what?  I'm..I don't know. Don't care about science.  I don't understand. 37.  .I suspect people...yes. Sure. So...no, rarely. Most people are ass's anyway.  .no... I don't know. Guess so.    Is that it?  I'm ready for more if you want to ask me... 38.  Ask me, Master. This is fun.. .nobody's asked me questions before --  Sure.  No.  Yes.  No I don't.  Yes. 39.  Yes.  My. Auntie.  No,  Not me.    No.  Three times.  Don't know. Probably Princeton.  45 Province Lane.  No.  No.  No.  I don't know.  I don't know. Freddie BLINKS.    Yes.  No.  Yes.  No.  My Auntie Bertha.  At home in new Jersey.  No.  Yes.  Yes.  Japs.  Yes.  Nothing.  I think I may have blinded a man. Maybe he's dead, I don't know...  In Salinas, I served him up booze and he drank too much of it.  Not if you drink it smart, he was stupid.  No.  I don't know.  I don't know. Maybe New York, New Jersey, anywhere. Don't know.  Auntie Bertha.  She said she'd let me have my inheritance if I were to sleep with her. So I did and I never got my money. I was drunk. She looked good.  Yes. Because I liked it. It felt good.  She controls it all.  I am.  Yes.  I thought you were fools. But now I see that you're not  Doris Schoemann.  Best girl I ever met. The girl I am gonna marry one day.  Lynn, Massachussets. ( I just got to get back to her.    I'm an idiot. I don't know. I got no reason.  Yeah.  Yes sir.  Freddie Sutton.  Yes...  Feels good.  Yeah.  Yeah.    I don't know what that is.  No.  No, sir.  You have the name's and information of the guests at this lady's party?  You're coming with me. Get up. I need some help and you wanna make a good show, no? Who's paying your way? CLARK looks to Elizabeth, who gives a look that says, \"He's right.\"  You don't know what we're going to do, so don't bother thinking about this anymore... CAMERA with FREDDIE AND CLARK as they walk out of the hotel and into the streets of New York --  You have any money on you?  Where are you from, Clark?  What's there? 59.  .how'd you see them?  What did it say?  That's good.  He's a very smart man. I can tell that. I don't understand myself but - more time with it and I might - I feel better - I feel like I've more to do with my life since I met him... and I JUST met him. So - that can't be a bad thing, right?  I have a delivery for Mr. More. Special. Late night delivery. I need a signature.    What about me...?  What? Steal what?  I don't understand what you're saying.  I still don't understand what you're saying...  .no...  The truth about all what?  What is something like that worth?  Where is it?  Where?  Needed for what?  How do you know about this?  There's something... something that can hepp you...you... If you need helpp in yer life... .where is it?  Thizz helped me. It can help you.. you can go back in time and learn thingz... He is about to say..   But he PASSES OUT, FACE FIRST ON THE TABLE.  I don't think John More will be speaking out against you again.  You were right.  You were right. . .he had a wise-ass mouth.  That's why I won't tell you. Nothing bad. Just scared him good.  It won't.  I don't really think about all that stuff with my Auntie, you know ...I got other things going on besides that thing I told you about.. .that's yesterday's news to me, so...    I don't like smart-mouths. If that's what you mean. 66.  -- what is it? He grasps his shoulders, touches his head to Freddie.  Keep an eye on him?  Alright. MASTER leaves. 67.     Hi.  I'm working.  Errands.  I didn't do anything.  No.  It's too strong.  Not big enough yet -  Don't argue with me. You're Father's speaking .get dressed and get down there...  Bobby?  It's Freddie.    Are you home?  I'm comin' over - He hangs up. He looks back across the street at the group in the coffee shop. And WALKS AWAY, OFF DOWN THE STREET...  Where's everybody? 71.  Here and there. Antarctica. Where's your dad?  Where's my mom?  Where's your mom?  Anybody ever hear about stolen jewels and money in the sewers?  Near Harlem. They shake their heads.  I heard about a load of money and jewels that are hidden in a sewer wall up near Harlem. A long time ago. With crocodiles that live down there and protect it.  Anybody want to go look for it?  They come to an intersection -  Let's go this way and that way - come with me - BOB follows FREDDIE, the rest go the other way - VARIOUS ANGLES watching them move around, etc.  BOB AND FREDDIE walking/talking:  How'd she do that?  You don't want to go there, dummy.  You're an idiot.    No.    There's nothing here...let's just go...  Bob... BOB turns ...FREDDIE in kneeling down, aims the  I found them right here.  and leaves.  .with what?  Considers this a moment.  No.  .lost 'em in the streets...  Wake up. Your Father's speaking.. .you could learn something.  You heard me.  Maybe you should pay more attention.  I'm curly-q. Round in circles. So shut up. .FREDDIE takes a nice big drink from his FLASK... FREDDIE looks out the open front door: TWO POLICEMAN AND A MARSHALL are parking their cars and walking towards the house... 82.  Watching them advance... He hesitates. He's not sure what to do. So he stays put... The MEN walk up to the house ...FREDDIE and VAL look:  I don't know who that is...  No. You cannot.  You can't come in. Get outta here. MASTER, ON STAGE, looks out - AGAINST THE GLARE OF THE DOOR, he can recognize the FIGURES AS UNIFORMED...      I don't want to talk to you right now.  Stop talking...  Horseshit.  Just shut-your-mouth? You're a fucking  Helen's house...all those girls walking around, the wives of ... . I want to fuck all of them.  I want to fuck 'em all. I want to stick it in every one of them.  I don't belong in here, man. I gotta get out of here...  .hmph...  Why're you talking about her?  It was Val who let them in the house and told them who you were... Val did it.       What happened?  Yes.      I won't drink.  Who?  .What is Val doing in all this?  Yes.       What is it?    Yeah.  Are you Dick Breton? I'm Freddie Sutton. You're expecting me... FREDDIE is very friendly, but focused on the task, he asks to use the phone to call Master - some place private, perhaps...  Someone broke into the house.  Someone's been there. I don't know when. I may have just missed them - the front door was locked, I went in with the key and the house up ended, all smashed up on the ground - I walked to the back - the door was open -  Yes.  I'm at the office with Dick Breton.  He's outside. The door's closed.  Yes. It was right where you said it would be...I haven't opened it.  Is...did...did Val break into the house looking for it?  What should I do now?  It's good. I got it.  Yeah, yeah. I'm alright. I'm shaking..  I don't know. It's hot down here.  No.  No.  Yeah.  I'm alright.      Phoenix will be the home of the Universe Process Congress of the Cause.. .to be held June 5th to 9th... Everyone is excited. 97.  And it is hoped that a major part of the program can be devoted.to a report on a demonstration of any new data or techniques MOC may reveal at that time.  Yes. This will be a unification Congress. All of us together - all branches and as many members as possible, organized in one city - for the presentation of all new levels.  You don't have to change you faith or leave the congregation you belong to...So those interested in freedom are urged to please come for free sample processing sessions in being 'younger' feeling 'freer' and understanding where you come from... If every individual in the world had one other individual to whom he could go with his troubles and his ideas; and if he could tell that Other all about his troubles and ideas; and if that Other would listen AND understand, but not evaluate or invalidate or approve or give advice or in any other way try to control the thoughts of the speaker; the people of the world would become sane, well and happy.  The key. Master takes it, pockets it... He looks down at his desk...  I'll get some.  Alright.  .where's Clark?  What's in Denver?    What kind of mission?  Bill.  There's nothing going on, Bill.  That's what that means.  That's it. 102.  Yes.  We appreciate that.  Yes.  Yes.  No.  No.  Yes.  No.      No.  Yes.  No.  No.  No. 104.  You're a dissenter. And an unfaithful woman.  I'm not embarrassed. That's sunburn.  You can't see Master.  Because he's busy and I'm not going to let you.  Just watching him with no/very little compassion.  Listens from the sidelines. It's sweltering HOT in here.  He's sitting up straight, watching, pouring sweat. It's the end of the lecture. EVERYONE STANDS UP AND GIVES  No more booze, Girl-y. Or haven't you heard?    \"ho! For kansas.\"      Hi. I'm lookin' for Doris.  'cause I'm looking for her. Because i want to talk to her. That's what for.  Jim day? Jim day-jim day? That jim-day?  When did that happen?  To jim day?  Is he still ugly?  .boys or girls?  I'm just visiting, wanted to see if she was around, say hello.  Yeah, alright.  Well, ok-then. If she's not here.  No, I'm not gonna write her a latter.  Was she upset that last time I was here? When I left her here?  Was she broken up about it?  Did she tell you what happened?  What did she say?  Yeah.  ...I been working. I been doing a lot of work and travelling, I think I been halfway aroudn the world doing things since I last saw doris... how old is she now?  Casue I wanted to know. She was too young when I knew her, when I saw her. how's Sonny?  Yep. Yeah. Alright.  I loved Doris, but when I came back hom..and she was only sixteen, so...i couldn't wait for her-but she's happy and that's good. So...  That's not going to matter - give me a  It's better if she thinkgs I was a heel. That's better - so if you can - don't tell her - but you're her mother you'll tell her, so -  Well. . .you do whatever you think is right.  . am I leaving?  I gotta go. Thank you. So. . .thank you. How's Mr. Shoeman?  Tell him I said hello.  So her name is Doris Day? The the Doris Day?  Like the movie star. FREDDIE comes up and gives her a kiss on the cheek and walks off.  Hello?  How'd you find me?  What?  Nothing. Nobody.  Where?  My spaceship's in the shop and the dance  They don't have 'em there?  How'd you find me?      I fell over the balcony. 116.  Am I alright?  Sure I'm not dead?  Not dreaming?  .why are you here?  Do you have a cigarette?  I really want a cigarette... She goes away...comes back...lights him up a cigarette...  I want to get to a phone ...I gotta make a phone call. . .can you help me with that?  This is Freddie Sutton calling for MOC.  My name is Freddie Sutton. I'm calling for MOC.  Is someone there. Elizabeth or mary Sue or Norm Conrad, the family?    Is Dick Breton there?  My name is Freddie Sutton and I'ma friend of the the family. Where in England?  They keep you from drowning... keep the sea from swallowing you..pig and rooster's always survive a shipwreck.  I don't know. They can swim better? Never thought about it.  .I did. 119. HOLD. He thinks about this. Ellen starts to get a little teary. She hugs his legs and feet, holds onto him...  You can...  .how else do you get someplace? 120.  .I'm here to see your Master.    You look good, Val.  Was in the neighborhood, stopped in to see your old man.  He should... MASTER comes down the long hallway...  he's listening to MASTER speak -  Not really.  No.  Nobody.  I don't think so.  How did you get this castle?  I don't look that way, that's not the way I look.  It's just not how I look.  I don't know.. I had a dream. 123.  Do you need some photographs taken? I could do that for you. You know. Whatever I do for you, I'm only gonna do for a minute. It's only gonna be a minute before I go somewhere else again... just the way it's built.    What's your name?  Say it...  No. Not drunk yet. Say it...  Say your full name.  Say it again...  Say it again...  Are you sure you haven't lived before?  Maybe this isn't your only life...",
        "Quell": "",
        "Patient": "",
        "Portrait": "",
        "Customer": "",
        "Rorschach": "",
        "Nurse": ""
    },
    "imdb_rating": "7.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTQ2NjQ5MzMwMF5BMl5BanBnXkFtZTcwMjczNTAzOA@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Following his discharge from the US Navy after WWII, Freddie Quell is having difficulties adjusting to non-military life partly due to his war experiences in the tropics. He has a violent temper. He is obsessed with sex, which is partly why he can't and won't commit to his teenaged girlfriend, Doris Solstad. And he is an alcoholic, drinking primarily concoctions he creates himself with dangerous ingredients. It is these factors in combination that lead to him being fired from one job after another, from department store portrait photographer to cabbage picker. Wandering one night in 1950 while drunk, he stumbles upon a yacht being used by Lancaster and Peggy Dodd, the yacht aboard which their daughter Elizabeth will get married. Feeling a connection to the stranger, Lancaster invites Freddie to stay aboard to work. In addition to that work, Lancaster indoctrinates him into his cult, named the Cause, which purports to do things as varied as cure serious maladies and create world peace. Peggy, Elizabeth and Elizabeth's husband Clark all subscribe to and support Lancaster's teachings. The only one of the Dodd family that doesn't is Lancaster and Peggy's son, Val Dodd, who believes his father is just making things up as he goes along. Because of being lost psychologically, Freddie is easy prey, he who is looking for something or someone to guide him to a higher plane. But as Freddie travels with the Dodd family as they spout the gospel, he and the Dodds may become at odds with each other if Freddie cannot or does not find from them and the Cause what he needs in life to survive emotionally.—Huggo",
    "name": "The Master",
    "genres": [
        "Drama",
        "History"
    ]
}