{
    "filename": "Thing,-The_script.txt",
    "imdb_id": "tt0084787",
    "imdb_url": "https://www.imdb.com/title/tt0084787",
    "characters": [
        "MacReady",
        "Helicopter Pilot",
        "Childs",
        "Garry",
        "Palmer",
        "Dr. Copper",
        "Clark",
        "Norwegian Passenger with Rifle",
        "Dr. Blair (as A. Wilford Brimley)",
        "Fuchs",
        "Nauls",
        "Norwegian",
        "Windows (as Thomas Waites)",
        "Vance Norris",
        "George Bennings"
    ],
    "dialogues": {
        "MacReady": "35. Helicopter pilot. Likes chess. Hates the cold. The pay is good.     Poor little son of a bitch. You're starting to lose it, aren't you?  ...Cheating bastard...  We got any more of those electronic chess things down in supply?  What for?  ...Craziness... This is goddamn insane...  It's against regulations to go up this time of year!  So, I don't want to end up crawling around with them when we go down.  What are you talking?! He's had two months training in those choppers!          Anybody in there?!  Come to help you!!  Give me a hand.  Hey, Sweden...! You okay?  Sweden?!  Come on, Copper.  Hey, Sweden!!!  Norwegian of the Month, Doc. Harmless.    Portable video unit.  Anything?  What are you doing?  It's getting late. Hurry it. I'm going to check the last few rooms.  Copper, come here!!  Careful. It's about to go.  Little ice core drilling... some seismology... glaciology... same old shit we do.    Decanite...? Thermite charges...?  What in...  Clark.  Dogtown's going nuts. Take care of it.  I'm going to shoot.  Clark? Where are you? Clark!  Childs, you got the torch? You get your ass in here!!  Torch it over there!  Screw the dogs!! Torch it!!  Don't let up, Childs!  Screw it, I'm going up anyway.        So what do you make of it?  No chance it could have been some new kind of test craft?  Look, I'm just guessing...  ...So it crashes, and this guy, whoever he is, gets thrown out, or walks out, and ends up freezing.  Yeah, they dig him up and cart him back. He gets thawed out, wakes up and scares the shit out of them. And they get into one hell of a brawl...    And the horse you rode in on, Fuchs. Light it up.  Fuck history. At least we're going to live to be an old bunch of assholes.  I ain't going anywhere in anything over forty knots, Garry...      All set.  To us.  Now go easy on me, Esperanza. I'm just a beginner.  Aw shit.  Sorry, hon.  Never any damn ice around here...     Now in Mexico... Tahiti... They got ice... They got ice coming out of their ears.        What's...  He smashed one of the choppers up good. Childs, go check the other one and the tractor.  Too damn dangerous.  No, wait a minute. The fuse box.    If you're right we've all got to stick together.  And mainly ours.  Leave a bit of an opening so he can see out.  How you doin', old boy?    What?  They couldn't have gotten that far in this weather.  I am going after them.  Get these things out of supply and meet me over by the snowmobiles.  Palmer, how long would it take you to strap those big four-cylinder carburetors on?  Then get a move on. Childs, come with me.  That's good enough.  Let's load 'em.     Maybe dinner.    Probably the next meal.  Where these tracks headed?  Let's move.  Turn back if you want.    Let that thing fly, Childs. Don't let up until he's ash.  Childs!!    How the fuck do I know?!  Torch them!!  He's gone already! Do it!  Well, you can believe it now.  Nauls found this yesterday. It's ripped just like the clothing on the Norwegian we brought back. The same thing was happening to Bennings' clothes when it got to him. Seems these Things don't imitate clothes. Just flesh and bone.  Size large. What do you wear, Clark?  So do I. So do most of us.  Doubt if it got to more than one or two of us. But it got to someone. Somebody in this room ain't what he appears to be.  Copper thinks they swallowed pieces of it during the fight.  Was it broken into?  Well, who's got access to it?  Would that test have worked?  Who else could have used that key?  Could anyone have gotten it from you?    Maybe it should be someone a bit more even-tempered, Childs.    ...From what we know this Thing likes to go one on one. So we stick together as much as possible. In two's and three's.  We got morphine, don't we.  Well, we keep them loaded. Stash them here in the rec room and watch 'em twenty-four hours.  Right. Half of us awake at all times.    Also... When this Thing turns... it turns slowly at first. I think we can handle it in that state. But if it ever got to full power... from what I saw of that Norwegian camp... well, I just don't know... It would probably take it an hour or more to get like that. So no matter what anybody's doing, we all return to this room every twenty minutes. Anybody gone longer than that... anybody trying to leave... we kill 'em.  Look for shoes, too. And burned cloth.  Just keep looking.  How's it going?  Gotchya.  Move it, Palmer.      Yeah!    What?     Where's Sanchez?  Who... Who is that?  Sanchez...?  Hey, who...  We going to make it?  Screw the flashlights. Where the hell were you?  Anybody see Fuchs... or hear him...? Huh?  That storm's going to start ripping any minute -- so we don't have much time.  We've got to find Fuchs. When we find him -- we kill him.  If he's one of those Things, we've got to get to him before he changes... Nauls, you and Childs and I'll check the outside shacks...  Sanchez, you and Palmer search the inside...  Cut the bullshit... Okay, Sanchez, you come with us. Norris... you stay here... Any of them move -- you fry 'em. And if you hear anything, anything at all you let loose the siren. We all meet back here in twenty minutes regardless. And everybody watch whoever you're with. Real close.  Let's move.  Hey, Blair!!  Has Fuchs been out here?  Have you come across Fuchs?  We'll see...            Open up!  ...Hey, somebody! Open up, it's me, MacReady... ...Come on, damn it... The towline snapped. Been crawling around like a seal out here...  ...Where is everybody?! I'm half frostbit!  What's going on out there?  What are you doing?  What clothes?  Someone's trying to mark me, you bastard... trying to frame me.  Anyone messes with me -- the whole camp goes.  Put those torches on the floor and back off.  ...back way off.  ...Where's the rest...  So help me I mean it!!  Anybody touches me... we go.  Go untie the Doc. Get him in here. Bring the others, too... From now on no one gets out of my sight.  So you sweethearts had yourselves a little trial. I just may have to kill you on general principle, Nauls.  ...Ever occur to the jury that anybody could have gotten to some of my clothes and stuck them up...  I'm a real light sleeper, Childs...  And if anyone tries to wake me...  Get out of the way!!  A little test.  I'm sure a lot of you already know.  Palmer, you and Copper tie everyone down. Real tight.  For your health.  Damn if I won't.  Then I'll have to kill you.  I mean it.  Tie up Clark, too.  Norris looked pretty dead, himself. Bullets don't kill these Things.  Now Copper, you tie Palmer up.  We're going to draw a little bit of everybody's blood.  Watching Norris in there... gave me the idea that maybe every part of you bastards is a whole. Every piece of you is self-sufficient, an animal unto itself. When a man bleeds it's just tissue. But blood from one of you Things won't obey. It's a newly formed individual with a built-in desire to protect its own life. When attacked, your blood will try and survive -- and crawl away from a hot needle say.  Now you.  Slide it back here.  Now step way back.  I guess you're okay.  I didn't think you'd use that fibrillator on Norris if you were one of them.  Watch them.  Now I'll show you what I already know.  We'll see. Let's try Clark.  Palmer now.  Thought you'd feel that way, Garry. You were the only one who could have gotten to that blood plasma... ...we'll do you last...  Copper!!             Everything that's been missing.  Smart S.O.B. He put it together piece by piece.  Anyplace but here.  But he ain't going to make it.  Forget about Childs. He's over.  It'll come. It needs us. We're the only thing left to imitate... Give me a hand.    Chance we got to take. We got to force him to come down the east side to the door we got rigged.  I'm going to blow the generator when you get back. He'll have to come for us -- or freeze.  We've got portable heaters -- we'll last longer.  ...Hold it.  Sodium cyanide. We place them between our cheeks and gums... This Thing can't imitate anything that's dead.  If it gets a hold of you -- bite down... They're supposed to be fast and painless... Now move.  Looks good.  What are they doing out there?!  Got to get to the generator.  The generator!  Calm down and get in your position.  Little over two hours.  Then we go after him.  Wait...  Okay, creep! Just you and me now! Be on your toes! We're going to do a little remodeling!  Chime in if you know that words, old boy.     You like whiskey? Come on, join me for a drink. Be good for you. Grow fangs on your chest.  Damn it, ran out of gas.  Sweetheart, it's going to get mighty cold in here soon... You better make your move... I mean, hell, I'm only one person...  I know you're bugged because we ruined your trip, right? Spiffy little toy you had there.  But your real hang up is your looks...    Come on, sucker.       I think so.  Yeah. I got it. Pretty mean frostbite.  Not the only one.  Neither will we.  Maybe we shouldn't.  Maybe we shouldn't make it.  If we've got any surprises for each other -- we shouldn't be in any condition to do anything about it. You play chess?",
        "Helicopter": "",
        "Pilot": "",
        "Childs": "33. Six-four. Two-fifty. Black. A mechanic. Can be jolly. But don't mess.     Am I starting to look Norwegian to you, Bwana?  How my brothers and sister doing today? Doin' fine.  What say to some nice Al Green for my babies, huh?  What you...? You get the hell on out of here.  ...Comin' in here... goin' to urinate on my babies.     Mac wants the what?!  What's happening?  Where are you?  The dogs?    Okay now, Mac, run this by me again. Thousands of years ago this rocket ship crashes, right...? And the...  MacReady!  Well, go on.  I just can't believe this voodoo bullshit. You believe this voodoo bullshit, Blair?  Cool it, Palmer!!  So, MacReady, come on now. These Norwegian dudes come by... find him and dig him up...  Now how's this motherfucker wake up after thousands of years in the ice, huh?  You buy any of this, Blair?    He got both choppers and the tractor... I don't know how bad yet.  I can get maybe another five or six feet out of it.  What is it?  Where's the other half?  They could be hours ahead of us, Mac.  Where's the other one?  What we going to do?!  But...  Bullshit! You left it open so they could get out!  Don't you be telling me...  Who you trying to protect, mutherfucker? I'm telling you this S.O.B. could be one of them.  Whose uncontaminated blood we going to use?  That key ring of yours is always hooked to your belt. Now how could somebody get to it without you knowing?    I'll take it...  What do we do about those three?  You can eighty-six that thought right now, man.  No, Doc. He's doing a real fine job.  Ain't it there?  Be quick.  Oh, no.  No. The generator. You got the auxiliary box just off the kitchen. Get to it. Where's the damn flashlight? You fellas okay over there?  Cut that out, Copper. Nauls? What's taking you?!  That's impossible, man! Okay, Clark, out of the john where I can see you!    Where's... Where's Garry?  Where are you, Garry? Don't you move an inch, Copper. Nauls, bring me a goddamn flashlight!  Clark, you want me to come in after you?!  MacReady!  Garry's missing!  Gee, thanks!  Where'd you go?  I said where? Where'd you go?!  You lying bastard...  You sit back down...  Well, who says I want you going with me?!  Don't walk behind me.  Cut, bullshit. Been pulled apart.  My babies.  Now who'd go and do...  Let go of me...  What's it going to do, being a plant?  Now hold on, you dumb...  You stupid, sonofa...  No one's that strong, boy!  Wasn't enough time. Generator was out, what...? Thirty minutes. Takes the bastards an hour, maybe two to absorb somebody.  He was working on a test. Fuchs must have been onto something. These bastards got scared and got rid of him. ...Hey... Where's...     Nauls!! MacReady!!  How long they been out now?  We better start closing off the outside hatchways.  Cut him loose?    Hell no.  ...Nothing human could have made it back here in this weather without a guideline...    No. Just let him freeze out there.  Then we're wrong.  Damn it, he's got the keys.  You're a dead man, MacReady -- or a dead whatever the hell you are!  We found your clothes -- the ones you tried to burn.  You been made, MacReady.  Move in slow now.  We ain't buying that.  (to MacReady, threatening  What for?    Then kill me.  I guess you do.    Load of bullshit.  So Clark was human, huh?  So that make you a murderer.     Let's do it, Bwana.  Muthafu...  Get me... get me the hell away from... cut me loose, damn it!  Spaceship of some kind.  Did you kill it?  What do you mean \"you think so?\"  It'll turn black again soon enough. Then I guess I'll be losing the whole thing... ...Think my toes are already gone.  So you're the only one who made it.  The fire's got the temperature way up all over camp... won't last long though.  Maybe we should try and fix the radio... try and get some help.  Then we'll never make it.    I guess I'll be learning.",
        "Garry": "46. The station manager. Stiff. Ex-army officer. Wears a handgun.  Norwegian... Jans Bolen.  How far's that?    You catch anything he was saying?  How long have they been stationed there?    How many in their party?  Nothing we can do about that.  In this weather?  A tad?  Forget it, Palmer. Doc, you're a pain in the ass.    Just go get him.  ...Quit the griping MacReady. Sooner you're there -- sooner you're back.  Look, if you're going to keep bitching, MacReady -- Palmer's offered to take him up...  Turn that crap down, Nauls. You can hear it all over the camp!  You reach anybody yet?  Well, stick to it.        What were they involved in?  Could be anything... Men in isolation... some beef that snowballed... got out of hand...  What's going on, damn it?      I just can't comprehend any of this. It was just a dog.  Couldn't make much of it myself.  Sure. You think there's a connection?  So...? So what? It's over with.    Anybody sick?  Any luck yet?  Well, stick with it. I want you at it round the clock. We got to get help in here...        I've got six dead Norwegians on my hands, a burned up flying saucer, and we've just destroyed the scientific find of the century. Now fuck off!  Doesn't look broken.  You're not thinking of going after them, are you?  You're not going to catch them in one of those with the start they got.    But why didn't you kennel that dog right away?  Hold on, damn it. We're getting nowhere... If this bit of Blair's about absorbing and imitating is true... then that dog could have gotten to anybody.  What's that?  How long will it take you to prepare this?  Well, get to it.  And I've got the only key.  Ah... no one... I give it to Copper when he needs it...  I suppose... well, it's possible someone might have lifted it from me. But...    Copper's the only one who has any business with it.  Hey, Sanchez!  Put that down!  I'll put this right through your head.  I don't know about Copper. But I didn't go near that plasma... But I guess you'll all rest easier if someone else is in charge.  Can't see anyone objecting to you, Norris.  Was dark... find a light...      Pure nonsense. This won't prove a damn thing.          I know you gentlemen have been through a lot. But when you find the time... I'd rather not spend the rest of the winter tied to this couch.  Make 'em short. They'll go off quicker if we need to use them.  One thousand volts. Should be enough.  What's he saying?  I'm going to bump this up, much as I can.  How long's it been?",
        "Palmer": "27. Second string chopper pilot. Crack mechanic. Long hair. Slight sixties acid damage.  Was wondering when \"El Capitan\" was going to get a chance to use his pop gun.  Damn straight.  Shit, Doc, I'll give you the lift if...    Clark! Will you kennel this goddamn dog? Hey, Clark?!        Wow...    Read von Daniken! Have you read von Daniken? Get your facts straight!  Well, that Thing in the ice sure weren't no dog.  Blair. He's gone berserk.  Chopper aren't going to be ready for days.       How's that Thing get to the dogs? I though we stopped it in time.  And that was enough?      Childs, where's that magneto from Chopper One?  No it ain't there. Would I be asking if it were there?  The fuel pump... it's gone... You've got to get up to supply, Mca. If we don't get this thing started soon, it'll freeze on us and we'll never get it going.  Mac, where the hell is that pump!!  Somebody definitely messed with it.  Hope so. Another ten, fifteen minutes. What I don't get is...  Tons of stuff's been missing around here. Magnetos, cables, wire...  I ain't going with Sanchez.  I ain't going with him. I'll go with Childs...  I ain't going with you!  What'd we ever do to these Things anyway...  What?  Right.  Auxiliary light cables...? Been cut.  Somebody broke in.  Childs!!  Don't get near 'em. The plants! They're alive. Those things can imitate anything...  We got to burn 'em.  Why didn't it imitate Fuchs? Isn't that its number -- to get more recruits.     MacReady!!  Where's MacReady?  Could have been anytime. Anywhere.  When the lights went out...  Right. Garry was missing... ...And Sanchez...  Let's open it.  Let's open it. Now...    The supply window!  Yeah, man, really. Just relax.  What kind of test?",
        "Dr.": "45. Professional. A decent man. A good doctor.  Don't \"ouch\" me. Two stitches. It just grazed you.  Stir crazy. Cabin fever... Who knows.  How do you know?  ...Guys as crazy as that could have done a lot of damage to their own before they got to us.  Yes, there is. I'd like to go up.    Screw regulations! Four guys could be crawling around on their bellies out there!  Anybody there?!  We're Americans!      Christ...  ...Laboratory.  All in Norwegian.  Could be important work. Might as well bring it back.  Watch it.  About nine more hours.  Probably right.  MacReady and I were listening to some of these cassettes on the way back. Like you gentlemen to hear it.  Goes on like that quite awhile. What do you gentlemen make of it?  Maybe.  There's something else we want you to see.  We found this.  I know he's pretty badly burned... but could fire have done this?  Blair, I'd like you and Fuchs to help me with autopsies on this one and the one Garry shot this morning.  Nothing wrong with this one. Physiologically, anyway. Find anything toxic?  I don't understand.      It's for your own protection, Blair.  Put this in Blair's juice before you take him his tray.  How long do you suppose they've been gone?  And if it got to Clark... Clark could have gotten to anybody.  Theoretically any of us could be whatever the hell this thing is.  A serum test possibly.  It's a simple blood typing test. This Thing's blood chemistry is different than ours. Basically we mix someone's blood with uncontaminated human blood. If we don't get the proper serum reaction -- then that person isn't human.  We've got blood plasma in storage.  A couple of hours.  Garry. The rest of you! Come here!  Somebody got to the blood... sabotaged it.  I guess I'm the only one.  I think so.  I don't see how... when I'm finished I return it right away.    Now... wait a second, Garry, you've been in here on several occasions...  I'll do it. You're going to break the needle in my arm.  I'm getting worried about you. You ought to have a checkup.    Damn it, quit the bickering and give me a hand. Wheel that fibrillator over here.  Palmer, turn on that oxygen and hold the mask over his face... Childs, grab his shoulders.  Quiet down... ...turn that thing on.  Now hold him.  Enough, MacReady!  Again... More current this time, Sanchez...  Damn you, MacReady!",
        "Copper": "45. Professional. A decent man. A good doctor.  Don't \"ouch\" me. Two stitches. It just grazed you.  Stir crazy. Cabin fever... Who knows.  How do you know?  ...Guys as crazy as that could have done a lot of damage to their own before they got to us.  Yes, there is. I'd like to go up.    Screw regulations! Four guys could be crawling around on their bellies out there!      Anybody there?!  We're Americans!      Christ...  ...Laboratory.  All in Norwegian.  Could be important work. Might as well bring it back.  Watch it.  About nine more hours.  Probably right.  MacReady and I were listening to some of these cassettes on the way back. Like you gentlemen to hear it.  Goes on like that quite awhile. What do you gentlemen make of it?  Maybe.  There's something else we want you to see.  We found this.  I know he's pretty badly burned... but could fire have done this?  Blair, I'd like you and Fuchs to help me with autopsies on this one and the one Garry shot this morning.  Nothing wrong with this one. Physiologically, anyway. Find anything toxic?  I don't understand.      It's for your own protection, Blair.  Put this in Blair's juice before you take him his tray.  How long do you suppose they've been gone?  And if it got to Clark... Clark could have gotten to anybody.  Theoretically any of us could be whatever the hell this thing is.  A serum test possibly.  It's a simple blood typing test. This Thing's blood chemistry is different than ours. Basically we mix someone's blood with uncontaminated human blood. If we don't get the proper serum reaction -- then that person isn't human.  We've got blood plasma in storage.  A couple of hours.  Garry. The rest of you! Come here!  Somebody got to the blood... sabotaged it.  I guess I'm the only one.  I think so.  I don't see how... when I'm finished I return it right away.    Now... wait a second, Garry, you've been in here on several occasions...  I'll do it. You're going to break the needle in my arm.  I'm getting worried about you. You ought to have a checkup.    Damn it, quit the bickering and give me a hand. Wheel that fibrillator over here.  Palmer, turn on that oxygen and hold the mask over his face... Childs, grab his shoulders.  Quiet down... ...turn that thing on.  Now hold him.  Enough, MacReady!  Again... More current this time, Sanchez...  Damn you, MacReady!",
        "Clark": "24. The dog handler. Likes it here. Good at his job.  I'll be here a while. Shell's pretty deep.  Mac's really taking it up, huh?           What's got into...  I don't know what the hell's in there, but it's weird and pissed off, whatever it is.  Mac, where are you?  No! Wait!!  I know. Mr. Childs killed it. I saw.  Jesus, why would those guys ever want to leave Norway...?  What do you mean \"got\" to the dog?  No. Just that he recovered real quick... That night when I found him in the rec room, he had already scraped off his bandage. Before I put him with the others, I redressed his wound and noticed it had healed up real good...    Well, after I worked on him -- thought I'd let him rest. Left the room for a bit. When I came back, he was gone.  Don't know. Looked for him for a bit... couldn't find him.  Well... yeah.  Ah... He was hurt bad. Bullet nicked an artery... I don't know... An hour... hour and a half...  What the hell you looking at me like that for?  The dogs...  No. Door was wide open. I know I latched it.  All three of them took off.  I haven't seen them since their last feeding. Could be as much as twenty- four hours.  ...I'm telling you I don't remember leaving the kennel unlatched...  ...Would I even have told you they were gone if I had anything to hide?  I told you I couldn't find... ...get that out of my face.  So what?  Gotta go to the can, Childs.  What you got in mind, MacReady?",
        "Fuchs": "Gotta be from the Norwegian camp.  'Bout eighty kilos southwest.  Says here about eight weeks.    What in the world kind of cell structure is this?  (in violent protestation  Well, I'm not going to let this happen...  I just can't believe it... We're going to go down as the biggest bunch of assholes in history...  ...Goddamn fools...  Right. Why not?  No. Somebody opened it. Closed it. And then locked it.  And the Doc thought of the test.  I'll try.  I could sure use Copper's help though.  Nothing yet. But, MacReady, I've been thinking... If our dogs changed by swallowing parts of that other one... We better see to it that everyone prepares their own food and we eat out of cans.",
        "Nauls": "22. The cook. Bright. Black. Irreverent. But kindhearted. Roller skates.  Maybe we at war with Norway.  Bullshit, Bwana, sweetheart. Five minutes is enough to put a man over down here.  I mean Palmer been the way he is since the first day.  Oui, Bwana. Can do.     It's okay now, man. It's dead. It's over. You see.  Right, man. Right.  Where's that big ol' steel pot of mine?! Damn!  Which one you muthers been tossing his dirty underwear in the kitchen trash?!  I want my kitchen clean. Germ free!  Finish what?    Oh, my God.  That thing's too smart to be hiding any more of its clothes, MacReady.  I got your goodies, superdude.  What you doin'?  Well, who the hell you think wants to get in there with you?  Now why'd you go and...  You promise?  Crazy white scientist motherfucker...  Childs! That a fuse?  I'm working it! Nothing's happening!  It's shorted out or something!  Somebody's taken it. I can't find it!  Kitchen things, too...    This storm do that?  Goddamn white women.  Cut him loose of the line up by his shack.  When we were up poking around his place... I found this...  ...It was stashed in his old coal furnace... wind must have dislodged it... I don't think he saw me find it.  ...Made sure I got ahead of him on the towline on the way back... cut him loose.  He's one of them.  Look, man...    It's cool, man. We ain't near you, man... Stay cool...  I don't think he's breathing.  What are you going to do? Drink it?  Shut the damn hell up.  What is it?  Where was he trying to go?  What about Childs?    Hear what?  It's got into the pub! It's turned on the stereo!  It's in between us and them!! How we going to get back?!     MacReady! We been cut off!!     Get back!!  Screw the generator!!  Got Sanchez... World War Three wouldn't mess with this fucker... Can go through walls... And it's like all over the place...  Position, my ass...  Boulder Dam might do it.  Maybe it ain't coming.  Bet the last place you ever go.",
        "Norwegian": "",
        "Vance": "",
        "Norris": "44. Stocky. Rugged looking. A geophysicist. An incipient heart condition.      What the fu...     Yeah. I caught that he wanted the better part of my ass to come apart.      You jerking off or just pissed?  Get your gear on.  ...Seems they were spending a lot of time at a place four miles northeast of their camp.  Maybe the whole camp got bent... Something they ate. What about food poisoning, Doc?  Here. This is where they were spending most of their time.  One of their sites would be directly over here.        Magnesium of some type... or some kind of strange alloy. And those poor dumb bastards had to go and blow the hell out of it.  You know damn well what we both make of it.  Seismic activity has been pushing this are up from way down for a long time... ...This ice it was buried in... It's over a hundred thousand years old.  You been into Childs' weed, Blair?  The back window. A couple of us could maybe surprise him.     They didn't teach you much about working them either.  What in the hell for? Even if Blair's right -- they'll just die out there. No food. They're over a thousand miles from anything.  It's just too damn wild -- I can't believe it.  I wear a size large, too.  Can there be... some kind of test? To find out who's what?  Somebody else sure as hell thought so.  When was the last time you used it?  Sorry, gentlemen... ...Don't think I'd be up to it. Haven't been feeling well lately.  We should sleep in shifts.  MacReady, that you?  It's the generator I think! No power.  Enough...  Let's just not get worried about anything just now.    Forty... Forty-five minutes.  All of you! Come here!  Would have been a perfect time...  This is just what it wants... to pit us against each other.  He hasn't had enough time.  All right... all right... we've got no choice now...",
        "George": "",
        "Bennings": "38. A meteorologist. Dutiful. An old pro.         What in the hell were they doing...? Flying that low... shooting at a dog... at us...  Winds are going to let up a tad, next couple of hours.  Can't condone it myself. But it is a short haul. Hour there, hour back.  Sixteen.  How much more of this crap is there?  We can't learn anything from this.  What do you want from us?  Clark, will you put this mutt with the others where he belong?!    Pretty nasty out, Mac. Thirty-five knots.      He's in the radio room. Got a gun. Beat on Sanchez something fierce.  Holy shit. Whatever he's going to do, he ain't fucking around.  All right... Box of dynamite... box of thermite... three shotguns... box of flares... two flare guns... thirty cans gasoline... and a case of alcohol.  Dogs don't eat each other.  Nowhere... Just straight to the ocean.  Gonna get dark soon, too. Supposed to be fifty below tonight."
    },
    "imdb_rating": "8.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNGViZWZmM2EtNGYzZi00ZDAyLTk3ODMtNzIyZTBjN2Y1NmM1XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "description": "A US research station, Antarctica, early-winter 1982. The base is suddenly buzzed by a helicopter from the nearby Norwegian research station. They are trying to kill a dog that has escaped from their base. After the destruction of the Norwegian chopper the members of the US team fly to the Norwegian base, only to discover them all dead or missing. They do find the remains of a strange creature the Norwegians burned. The Americans take it to their base and deduce that it is an alien life form. After a while it is apparent that the alien can take over and assimilate into other life forms, including humans, and can spread like a virus. This means that anyone at the base could be inhabited by The Thing, and tensions escalate.—grantss",
    "name": "The Thing",
    "genres": [
        "Horror",
        "Mystery",
        "Sci-Fi"
    ]
}