{
    "filename": "Last-Station,-The_script.txt",
    "imdb_id": "tt0824758",
    "imdb_url": "https://www.imdb.com/title/tt0824758",
    "characters": [
        "Complete credited cast:",
        "Tolstoy",
        "Sergeyenko",
        "Priest",
        "Andrey",
        "Dushan",
        "Sofya",
        "Masha",
        "Sasha",
        "Ivan",
        "Mourning Girl",
        "Chertkov",
        "Reporter",
        "Valentin"
    ],
    "dialogues": {
        "Tolstoy": "I have seen your banner. And I´ve heard what you say. You think I´m the hope of Russia, do you? Well, that´s not true. You are the hope of Russia. The hope of all the world. You say, you want a new way to live? Well, you are not gonna find it making a fuss over me. So, I suggest that you get on with your work and let a poor old men get on with his.         Nothing's working... Hand me my other boot, my friend, will you?  It doesn't matter. If my heart had stopped beating, I'd still go riding today.      Riding with Sasha. Don't expect us for lunch.  What do you mean?  It's not meant to offend you.  I doubt it not, my dear.  These people are bandits.  They come into my house and arrest a man whose only crime is to express a view of life saner than that which prevails.    Sasha!  I'm glad you're here. So glad.  God bless you.  Vladimir Grigorevich has already written about you at length. I need your help badly. The manifesto against the government is hard work. They commit their idiotic abuses faster than I can catalogue them...and the new book...  I've become convinced that all the world's religions have a single organizing principle. Can you guess what it is? Love! Love! Simple... Now, I want to talk about you. How are you? How was your journey? Come, sit down.  You know, I was born on this sofa...  Sit. Sit.  Myself, my brother, my children, at least five or six of them, right here. Now, I've read your essays. How`s your work progressing?  My boy, what is it? I upset you in some way. Was it the sofa? It's only a sofa.  You rest for a moment and I'll fetch you a glass of tea. Rest, because there's work for both of us together.  I'm not suggesting they be given land. Private property is the root of the problem... We should be giving ours away.  I believe that wealth corrupts us all, yes I do.  If the peasants had money, they wouldn't surround themselves, as we do, with footmen costing ten rubles a month.  Valentin Fedorovich, do you think fifty years from now, people will eat while grown men walk around and wait on them hand and foot?    It's tiresome. Another remarkable invention will supercede it.  Please excuse me.  Oh, that´s better. That´s nice. Very nice indeed.  I couldn't write. I was distracted I think...I had a dream last night, about a Tartar girl I knew in the war.  No, no...A girl I had sexual intercourse with... Sometimes we did it twice a day.  God bless...I've never forgotten our time together, the position of our bodies, the taste of her...  Torture? You are a virgin, aren't you.  To be what, a good Tolstoyan?  You see, I myself am not a very good Tolstoyan. You should think twice about asking my advice about anything... Torture...  Kalya, her name was...She's an old woman now, white hair, old body like me. She'd hardly remember my name, I suspect. She may even be dead.  Do you think that meant something?  I mean that little romance. Was there some meaning to it?  I say lots of things. What do you say? What do you think?  I don´t know, either.  Smell that...  Precisely. It's lilac. The smell's stronger when the sun goes down.  I've enjoyed myself, my boy.  My dear, dear man.  An old man is a very ugly thing.  My dear boy. Come and kiss me.  Now, who is this? Maria Filipovna.  You're both looking so well. Life here at Telyatinki obviously agrees with you.  God bless you, boy. What are you nervous about, now? Sit down. Sit down.  Dear Masha, Valentin tells me you're the great treasure of Telyatinki. He claims you're a very gifted teacher.  What do you mean?  Forgive him. He can't help it. He's a better Tolstoyan than I am.  No, my dear, I'll go alone.  Sofya.  Sofya, are you ill?  It's no good, you know, all this. You frightened everyone.  That was some sort of love call?  Why? Why? Why, do you do it? We live in the country and you insist on making it an opera house. What's wrong with a little peace now and then?  I do.  Of course, my dear.  What are you talking about?  About what?  Laughing about what?  I have a great affection for Vladimir Grigorivich. Let them laugh if they find it amusing.  We have a great deal in common.  Because he understands what I'm trying to do? Because he tries to help me accomplish it?  This is absolute nonsense.  It's impossible for you not to distract me. Let me alone... for God's sake. You're like a spoiled child.  Of course, I do.  Why do you say that?  There's no new will.  There is no new will.  There's no new will.  There is no new will.  I´ve told you the truth. Now, let me work. Please, will you?  This is unbearable. You don't want a husband. You want a Greek chorus.  Not dangerous... She's concerned for the welfare of the family.  It´s a terrible thing you ask. I can´t do it.  She's my wife. She´s part of me. We've been together now, so many years....  But she won't. She'll never understand.    Our life together has become intolerable.  I didn't come for more recrimination. Despite good cause for alienation between us, I have never stopped loving you.  God knows you don't make it easy.  Sit down. So, this is what love is.   Does that surprise you, boy?  God bless you  He's right, though. If we cannot live a decent, quiet life, if I cannot work, if I cannot find some peace, I shall simply go away.  Not to Chertkov, but I shall go.  Dushan says you're killing me.    Why did you bring him here?  And astoundingly stupid in the way of all scientists.  I'm sorry, my friend, but this is all very upsetting to me.  Take them downstairs. Thank them for me. Offer them a drink.  Valentin Fedorovich will stay with me, won't you, boy  You rest now.  You see, I no longer feel I have a choice in the matter. She isn't...  Is it?  I need a pen.  I feel like a conspirator.  Of course, my dear.  \" Your youth and your desire for happiness reminds me cruelly of my age and the impossibility of happiness for me.\" When I was courting Sofya, she was so young and pure, it seemed impossible that I'd ever have her. I didn't want to tell her how I felt and I wanted to tell her nothing else. So I wrote down a string of letters and asked her if she could decipher them. She looked completely confused, thinking it was a game or...  I gave her one clue. The first two Y's, I said, stand for \"your youth\" and then the most miraculous thing happened. She simply spoke the phrase, my phrase...  ...as if she had read my mind. In that moment, we both knew we would always be together. For those first years, we were incredibly happy, terrifyingly happy.  And now this.     Then I shall try and die as soon as is convenient.  I don't write for publishers. I write for people.  Valentin's in the library.    He's asked to speak to me.  I don't see anyone starving in this house. On the contrary, our privilege revolts me.  What is it, dear boy? You look unhappy. What do you want to say?     Sofya, what are you doing?  You're not well.  You behave like this, I have no choice. Now give me the gun.  Give it to me, please.  I'd like you to stay here tonight.     Essentials only. Nothing that isn't absolutely necessary.  Please...we must hurry.  When I was a boy, my brother Nikolai once brought me to a place when I was a boy. He told me he'd found a green stick with some words on it... the secret to happiness for all men everywhere. He hid it in the ground. I looked for it very often. I've looked for it all these years. I really believed I would find it here...but I never did.  I never did...but this life is behind me now.  Help me up, will you?  Give this to Sofya.  Don't cry. I'll send for you when I can.  My position in the house has become intolerable. What I'm doing now is what people have commonly done - leave their worldly life behind to spend their last days in peace and solitude.  I beg you to forgive me for everything I've done to you, just as I forgive you with all my soul for everything you've done to me.  We don't need a plan, my dears, we'll simply go   I guess our little secret is out.  Where are we?  Where are we?  Good old Dushan,...you needn't worry. Remember, you are my doctor, not my angel. Whatever happens, it's not your fault... I'm feeling much better now. I just need to sleep.  Very lucky.  And then we'll be on our way.  It'syou.  I needed  to see you. Thank you. We have so much  to do.  I´m sorry. Damn hic ups. Have you seen Sofya?  I don't know when  she'll come. But she'll come . I know it.  Don't apologize, my friend. Your enemashave become the news of the world. Now, all of you, help turn me over.  Sofya!  She's come, hasn't she? She`s here.  Sasha...where's your mother?  If she wanted to see me I couldn't refuse her. Is she going to come here?  To what?  At home.  Very beautiful isn't it?  Yes.  Sofya...my dear Sofya. So much has  fallen to her.  Who's going to look after her? Someone needs to look after her.  This is it. The end.  Sasha, Sasha.. It'snothing...Nothing.",
        "Sergeyenko": "Telyatinki was created by Vladimir Grigorevich as a center for the movement. Just last week we had a visitor from India. We talked to the group about the healing properties of cobra venum.  Yes, but we will pay for it.  The meeting room is behind us. This is the tool shed. The dormitory ahead.  Telyatinki is a place of freedom. Nothing is forbidden here.  Each man is alone with his conscience and his God. The kitchen is below. You'll be expected to assist with meals at least twice a week ...and to give a hand in the garden. We're all equals here, you know...as Tolstoy teaches us.     Yes... you're lucky....We're all envious.  Vladimir Grigorevich is anxious that you begin your reports as soon as possible. You have the notebook he gave you?  You understand we must keep the existence of the diary a secret.  What is it?  But you'll admit, you're no expert.  If we're spared.  Valentin Fedorovich.  Open the door.  Yes, well...Leo Nikolayevich is here. He want s to see you.  Yes..and tell Maria Filipovna we could use another hand in the kitchen.  If you see her...yes. And if you're going to behave like rabbits, you should go live in the woods.  Masha will be overjoyed.  Monumentous.  I...uh...  He's a secretary, too.      Ask him.",
        "Priest": "If the Count should have a change of heart...if in the last moment he chooses to confess, mother church is there to embrace him with open arms.  As a daughter of the church, I'm sure you wouldn't object to my saying a few words at the funeral.",
        "Andrey": "Give it to whom?  Papa's not in his right mind. He can't defend himself against these thieves. My tooth is killing me.  A man'th responthibility ith to hith family.  To dethtroy uth all.  There's a reporter outside from the Russian World.  But that's a lie, right?  We'll make inquiries in the morning, mother.  That'll cost a fortune.  Rent a train? God!",
        "Dushan": "Let me finish.  Your pulse is my responsibility...  and if you must ride, I insist you wear a coat. Even the sun is cold today.  He's forgotten his coat.  Count Tolstoy, you've forgotten your coat.  Let him walk. Let him walk.  I said, let him walk.  Let him walk. Let him walk.  But you don't banish these people very much to your credit...I wish I had your largeness of spirit.  It really is the most extraordinary thing.  Oh, that's good...that's good.    I believe he's one of the prophets. God speaks through him. I recognize the cadence in his voice.  In defense of my gift, let me demonstrate. It's quite remarkable, really.  Leo Nikolayevich is something of a Luddite, I fear.  Look at the love in him, like Jesus..suffering the children...all that...  From Sofya Andreyevna. \"I beg you. Stop. Unwell. Stop. Hurry back.\"  It´s sadly more than possible.  Please, Countess Sofya-    Sofya! Open your eyes.  You're lying on a fork. Sit up and you'll improve markedly...Valentin, help to get her upstairs, would you?  She's alright. I'm more concerned for you... We should all go to bed before something else happens.  Yes.  He's an old friend, you know, from Rome.  Yes.  You'll be alright?  A lantern, I think. It's very dark tonight. And the apparatus for giving an enema.  He's changed his mind. He's going back to the house.   I know. Stay back.  It's alright. Everything's fine.  Let me take your temperature.  Good, good. Yes.  He will be fine.  Yes.  I'm sorry, but it's time for your enema.  Yes I'll...uhm...  Listen to him. I'm supposed to be a doctor, for God's sake.  What is it? What is it?  It's true, Leo Nikolayevich.  His pulse, you see...  First cessation.  Second cessation.  Yes.  At ten minutes after six in the morning, a great soul passed from our world. Leo Nikoleyevich Tolstoy is dead.",
        "Sofya": "Why are we slowing down?  We're stopping. Why are we stopping?  Excuse me, why has the train stopped?  But if they block the track, the train can't go...YOU HAVE TO MAKE  Oh, they won't move. We are gonna die here. Leo, Leo, go and say something to them. It's the only way we are gonna get out of here.       Darling.  This is impossible! It really is! These people are parasites! Look... \"Countess Tolstoy has become estranged from her husband. They barely speak.\"  You know who spreads all this rubbish....  C'est la meme en France. They gossip about us in Paris... \"They do not share a similar view of either religion or politics.\" Incroyable!  I think it's none of the world's business.  What are you doing? Don't do that.  Darling, where are you going?  Leovochka, why do you insist on dressing like that.  Like the man who looks after the sheep.  But it does offend me, because it offends reason. You're a Count, for God's sake.  Oh darling, I have something else to say.  These people have nothing.  It's not for lack of land that the muzhiks live in poverty. They have no will power and they drink too much.  It's all ridiculous. You think that poverty makes the peasants somehow morally superior.  Oh, I know all about the movement.  No, they'd spend it on drink and whores.  Stop scribbling! You all think he's Christ, don't you? He thinks he's Christ.  But what?  This is unbearable. No wonder I feel lonely. I'm surrounded by morrons.  Am I? I sit here and listen to this talk of love and God and equality, knowing full well that Count Generosity here is fully prepared to give away everything we have.   I see a fine young man before me. Clear eyes. Nice features, rather handsome in a peculiar way.  Call me Sofya Andreyevna. We don't stand on formality here, as you may have observed. Many young men ruin their looks by loose living. You're a real Tolstoyan, I can tell!  That's excellent. He likes that.  He's very grateful for the help you've been giving him. He told me so himself. I think it surprises him that a young man would be so diligent. When he was your age, he was whoring in the Caucasus.  He wrote it all down. He even gave me a copy, so I could read all the details...  You've read War and Peace?  When he was writing it, long before Chertkov created that monstrosity at Telyatinki, before all this \"new religion\" and revolutionary nonsense... What do you think of Chertkov, by the way?  But you see what a fool he is, a self-serving puritanical idiot. I have to say, it's been extremely pleasant since they've locked him in his house.  When my husband was writing it, in the mid-sixties, he'd bring me pages to re-copy everyday. I was the only one who could read his handwriting. I could read his intentions, too. Afternoons, we'd drink tea and discuss changes. \"Natasha wouldn't say that to Prince Andrey,\" or \"Pierre's too simple here. He's not stupid.\"  But I don't count anymore.  You must help me, Valentin Fedorovich. I want only what is best for my husband and my family. I could tolerate the situation if it only concerned me What I can not do is sit back while they steal my children's inheritance. Do you know I was the only person. I could understand his intention.  I have a little gift for you  It's a diary.  Everyone should always keep a diary.  You're teasing me, but I trust you'll write the truth.  Nonsense. You've been listening to your friends at Telyatinki... Write what you see. That's always the place to begin. What. You. See.  More tea?  He'll try again to convince your father to change his will.  To give the copyright as \"a gift to humanity.\"...the reptile.  You're a fine son, darling. None of this make believe chastity and made up religion. I wish all my children had turned out like you.  Chertkov's notions of virtuous behavior are calculated to destroy me.  There is nothing more pathetic than impoverished aristocrats.  Vladimir Grigorevich, what a surprise.  And I'm happy to make you happy...always.     I'm fine...now that you're home.  Did I really? I don't believe it. Not you. I'm your little bird. You know the sounds I make.  It brought you back to me.  Come out of the dark... where I can see you.  Look at me. This is who I am. This is what you married. We're older, maybe we're old, but I'm still your little chicken You're still my big cock.  Let me make you crow.  Let me make you sing.  Do you love me?      Good morning, my darling? Do you mind if I join you?  It's quite insane, my darling. Everyone is making fun of you.  Even the muzhiks. I heard them laughing in the barn.  I don't want to ruin last night.  Laughing about the fact that you've developed a senile crush on a fat middle aged flatterer. Your passion for Chertkov has become a standing joke.  But it's not amusing, darling. It's sick. It's not normal. You hang on his every word.  You have nothing in common. You are a genius. He's a sycophant and a pervert.  He is using you. You just can't seem to see it.  That bold, obese, idiotic man. You treat him...  Do you love me, Lyovochka?  Then why would you betray me?  Because of the will?  The new will.  Does Chertkov have it?  But that's why he's come back. You talk about it, you and your boyfriend. You plan for it. You have no heart for the people who really love you. You'd rather be seduced by charlatans and deluded by flatterers, all in the name of love....You can't even love your own children. You can't even love me.  Tell me where it is?  Then, promise me there never will be.  Tomorrow, I'll go to the Station and lie down on the track. Tolstoy's wife becomes Anna Karenina herself! See how the papers will like that!  And I'm happy to make you happy...always.  Your moustache is...  Let me get to the point. Vladimir Grigorivich, I don't wish to be your enemy. I'm delighted that my husband has a friend who understands and shares his ideals. All I want is what's reasonable - an opportunity to evaluate the new will. If you agree, I'm sure we can be friends.    Very well.  Yes. Valentin Fedorovich...are you coming back to the house with me?  Have you been keeping something from me? How delightful.  We've become close friends, I think. Tell me everything, dear boy. I love a romance.  A young woman in your life is nothing?  A lover?  That sounds serious enough.  I don't mean to annoy you.  You forget that I'm an experienced reader. I can read your face, every letter. It's beautifully clear. Do you love her?  Not something they'd understand, these so called disciples of my husband. They've never understood a word he's written. What do any of them know about love?     Ivan, who's wearing that awful perfume?      How dare you?  You're all plotting against me. In my own house, too. I bear you thirteen children. How can you betray me like this? Someone help me up.  Give everything you've got to him, your fat little catamite. \"What will it be, my dearest dear, my Vladimir Grigorivich? My wife's heart on a platter? Her kidneys? With salt? But of course, my dear Chertkov, whatever pleases you. The china. The estate. Permanent copyright on everything I've ever written? Anything for you, my love.\"  Give me that. Give it to me, you little weasel.  Now...  You! Don't think you deceive me for one little moment! I know exactly what you're doing. I want to see the will. It's my right, in the name of god.  You.   I'm afraid of you.  Tell them anything you like. Go ahead. Ruin us.  Why can't my husband see you for what you are?  Do you like the opera?  This aria is very beautiful.. It is about a woman who is abandoned by the man who loves her...Everyone is very moved by that...in the opera.  Sit down, Valentin.  No, no, no. Enjoy your dinner. We've had a disagreement. No more than any other married couple.  Of course...  Why should it be easy? I'm the work of your life. You're the work of mine. Its what love is.  Everything with him is hysterics  God bless you  Go? Where?  Go where?  Then go! Go! Anywhere you please!  I hate you. I hate what you've become.  You'll destroy me.  My back. My back... I'm hurting.      Ya...your...your...I can´t remember now...Yo, what did I say? What did you mean?  Lyovochka? Prozeveskeny wants to purchase the rights to your work after your death.  Don't be silly. They've offered one million rubles.  How can you not be pleased?  Where are you going?  Splendid...while your wretched family is left to starve.  But you're always first to the trough...always have been.  How could you do this to me?  You hurt me again and again. You take little pieces of me until I become nothing. I don't know who I am anymore. I read your diary. I know what you've done.  No! Give me the gun!  You're a liar. Liar!  So, he's gone. For good.   Let me die. Please. Why would you rob me of that?  Ivan, go to the station. Find out which train the master took.  They've all gone  You're writing to your girl. That's lovely.  But you believe you'll see her again.  Yes. Refuse to believe in the end of love. Do all you can to prevent it...  I know you know where he is, Valentin.  I won't ask you to betray his trust...but I need you to go to him. I do. I have to see him. I have to talk to him. I won't make a scene. Promise him that. I must see him.  Tell him we've received an apologetic letter from your father..very embarrassed. We expect him back any day...  Yes, that's a lie.  We must leave at once.  We'll rent a train.  Don't say irrelevant things, Andrey. It's unbecoming. Contact someone. I'll go and pack.  I'll see what I can do, father.  I want to see my husband.  I want to see him. Now!  Valentin...Will you help me?    I have to see him. Please.  It is.   It's the right time for me.  I want to see my husband.  But he's not too weak to see you. Not too weak to see that...  I am the leper outside the gate, while he sleeps with the devil himself.  Is that true?  Have you told him I nearly drowned in the pond?  What did he say?  He'd be upset?  I want to see him. He's not your husband.   He's my husband.  And you are a stone-hearted bitch of a daughter.  I lost five children. Why couldn't one of them have been you?  Valentin, will you take me back?  I've behaved badly, haven't I?  Has he asked for me?  Lyovochka!  Please forgive me, my darling!  I'm a fool.. I'm a selfish woman. But I love you. Please believe me. Please understand me. Please forgive me for all my weakness and badness. Please! Please! Love me!  Was I shouting?  You don't speak, but I hear you.  \"Do you love me, Lyovochka.\" \"Never stopped, my little bird.\" \"And you will never stop\" \"Never.\" \"Nor ever leave me again.\" \"Never, ever again. \"Good...good... let's go home\"  Please forgive me if I cry a little now.  It's alright. What happens from now on... it will never really matter. Not really. Everything's finished.  Dushan, could you tell them your great friend is gone?  My husband needs no justification. Besides, it´s been enough talking as it is. Thank you, father.  Valentin... and who's this...  This is your girl. Good. Good. Is there anything I can do for you?  Yes...Good bye, good bye.     God bless you.  Well, I'm ready to go now. Why aren´t we moving? Can't someone make it move?  Oh!",
        "Masha": "I've brought you a glass of tea.  It's your first day. Enjoy it.  You met Sergeyenko?  Ad what do you think?  Say that again.  Is that what you think?  Masha. But you should still say what you think. Not just about him. We all should.  Tomorrow you can make your own.  He's a sorry old tight-assed stick in the mud...but yes, he's sincere.  You're finished for the day?  No, I find it sweet. I find you reactionary.  He admires you, I believe.  Sergeyenko told me. He's miserable about it.  What do you talk about when you're with him? Why are you blushing?  Really.  And what relations are these?  I had a lover before I came here... headmaster of a school where I taught. He was married - happily married. It was difficult. We could make love only at school.  In the gymnasium, after the girls had gone. There were straw mats on the floor.  Have I upset you?  But you disapprove of me. I see it in your eyes.  Listen to you. You're a prig. Just like Sergeyenko. Why else would they have hired you?  I don't care if it's fair. It's true...neutral...my God...  Do as you like.  Valentin Fedorovich.  You forgot your horse.  Ssshh.  Move the book.  Your book.  Is it alright?  You really are a virgin.  I'm playing. It's fine. It's wonderful... Hold me.  I am awake.  It was wonderful.  What do you mean?  You mean, why does someone who doesn't follow the rules come to a place like this?  ..it's not about rules.    Not for Tolstoy anyway...  We're happy to have you with us.  It's absurd. That's all.  I'm sorry but- It's a mosquito.  I'm not supposed to do this either.  You wouldn't look at me.  But it wasn't difficult in your bed... When it was only you and me in front of God.  So, I made you forget God?  Yes, only for a moment. You forgot your rules and remembered love.  It is simple. What we did is what men and women do, have done, will continue doing. What could be more simple? We touched each other-- stayed close together. Something passed between us. Something real. That is a betrayal of what? Of nothing.  But you're afraid... All your ideas. What are you afraid of?  No. I feel a little sad, but it is not for me. It's for you.  Fine...fine...Why did you...?  I think I've confused you. I've confused us both.  Maybe you could help me a little.  Yes...  I'll wait for you, then.  I'm going back to Moscow.  Chertkov spoke with me this afternoon. He says I could be more useful there...which means...  We've both disappointed him.  No, I want to go.  I'm leaving the movement.  I am not. Look, when I read his Confession, it moved me, Valya. He was searching for freedom. Freedom from anger. Freedom from attachment. Freedom from all the superstition and nonsense of the church. It moved me so much. I thought that's what it would be about. Isn't that what it's about? Freedom and love? But they mix it all up.  Come with me. Please.  I'm going to my room.  I know you do...I know.  Yes. Yes. I know, but I came for you, Valya. I came for you, too.  Then, hold me. Hold me. Hold me.",
        "Sasha": "I don't know, mother.    No idea.  Papa.  Did you ride this morning?  Papa's out. You can wait in the library. Ivan will show you up.  Mama, you're being ridiculous.  My mother doesn't understand my father's goals, not since his work as a novelist became secondary.    His commitment to the spiritual life offends her. They've fought about it for years.  Quite.  God Bless You.    What is it?  Well, give it to him then.  She is looking for allies. Pay attention. This is war.  Where's papa?  Papa!  He's free. He's free...He's coming back  From my mother \"Nerves dreadful. Stop. Insomnia. Stop. Pulse 100. Stop. Please come home.  Don't give in to her, Papa. It'll never end...I swear to God, that woman has an instinct for knowing when you're just about to enjoy yourself  Who taught her to use that damned machine?  It's a trick, Papa. She'll drain you. You'll be miserable.  Then, let me go with you.  Listen to him, papa. He has our best interests at heart.  I know it´s hard for you, papa. But we must be realistic.  What are you doing?  Mama, please...  You'll kill him, Mama. That's what you want, isn't it? You want him to die!\"  Valentin. Valentin.  Get up. He's leaving.  He´s leaving.  Absolutely essential.  Everything's ready.  Papa...?  Be well. Be well.  I'm simply telling you what happened. He's gone. I have no idea where. Nobody does.  Honestly, I have no idea.  The pond!  Mama, Mama! Stop. Not this. Hurry! Hurry!  No! She's drowning.     Help her!  She's dead. My mother. She's dead.  Let me take you to the house, mother.  Let's go to the house.  I see no harm in it. Let's get her to bed.  She's exhausted herself. She's slept for nearly four hours.  The noise subsides a little.  Well, a little.  Come in.  For me?  She's allowed to send a note to my father. I just don't know where to tell her to send it.  Why are you giving it to me? She is allowed to send my father a note!  She never gives up. \"Dearest papa. Return at once.  Sasha.\" She signed it with my name.  Obvious.  Yes?  He's with my aunt.      At the Shamardino.  He's right, you know, to go. She will be right behind us.   He can´t breath. Valentin, please. The smoke is too much.  We've come to the end of the world.  You'll be comfortable here, papa. The rest of us...we'll find cots or sleep in the station.  Papa.  She's coming this way.  He's too weak now, mother.  Vladimir Gregorovich is here because father asked him to be here.  We didn't have to. It was in all the papers.  That if you killed yourself, he'd be upset.  Horribly upset...but he could not have acted other than he did.  You're unbearable.  I don't think so...I don't know, Papa. There's no way to...  She's at home. I'm sure of it.  Yes, Papa.  Our home?  He said to me once...\"you're like your mother. You're so full of anger.\"  I know it's terrible...but who will protect him? I don't want him to die.  It can't be right.    His fever is down.  Shall I call her?  Do you want to see her, papa?  I can't do this anymore.  I want you to come.    Take a coat. It's cold.  Mother...  Mother!  Control yourself.  You have to control yourself.",
        "Ivan": "It´s a note, for him.  Life returns to torture her for awhile.  A message, miss.  No, for your father. From the Countess, miss.  She's addressed it to train number 9. That's the train the master took. The station master told me...  He gave me this as well...the stationmaster. A note for you.",
        "Mourning": "",
        "Girl": "",
        "Chertkov": "But sex... You are twenty three. Not an easy age for abstinence, is it?  He despises them, in fact...  I don't want to belabor the point, but I arranged for a manservant last year who proceeded to ruin two housemaids just like that. He was very upset.  Yes, I've heard many good things about you. I've even read what you`ve written. So has he.  My dear boy, if you were to become Tolstoy's private secretary, you would be given a great gift. You'll be with him every day, eat together, walk in the forest by his side.    Yes, we. If we can encourage the spread of passive resistance...just think of it Valentin   thousands of ordinary Russians casting off centuries of spiritual and political oppression-  Truth and freedom, yes but still, my boy, there are so many enemies-  The Czar's police...You'll be followed when you leave here...and the church will stop at nothing to bring him back into the fold. His children can't be trusted... only Sasha... and then of course there is the Countess... Well, one doesn't like to come between married people whatever the circumstances, but her dogged attachment to private property, her public criticism of our movement...    And although they've allowed me to return to Russia, I can't see him. They keep me under house arrest... They might as well keep me in a cage.  So, I need you to put these letters directly into his hands. One can't be sure what gets through to him.  Sofya Andreyevna does not respect his privacy.  I have another task for you, my dear.  You'll keep a diary for me.  I need to know everything that goes on at Yasnaya Polyana. Let me know who visits the house, any talk of the copyright to his work, any contact with the church, what letters come and go. Anything Sofya Andreyevna says.  She's very, very dangerous.  Godspeed, my boy.  And remember what I said.  Write everything down! Go!  Sofya Andreyevna, I'm happy to see you.  I'm glad to have a moment alone with you, Valentin. How do you think you're getting on?  Yes. He seems satisfied and that's good. The reports I've received from you however... There seems to be some confusion.  You send me never ending commentary on Tolstoy's writing. That's all very interesting but not very useful. I need to know what goes on with Sofya Andreyevna. You must see by now she's committed to undermining her husband's best intentions.  Because she is duplicitous. You are very bright. Too bright to let her into you.  You value our work?  The ideals we share?  Good, of course it is.  Do you think the Countess suspects something?  How so?  What does she say?  We simply want to distribute Tolstoy's work to the widest audience possible. She just has no understanding what it is we are trying to do. There´s nothing in it for any of us but a real chance to increase the world´s happiness.  I can only be of limited help to the master if I don't know what's going on. Any effort she makes to shore up control of the copyright, I must know. The survival of our movement depends on it. Remember who your friends are. What you've come here to do.  What are you doing?  You've killed a living thing.  Do you have something to say?  It's not the message we want to send.     Perhaps Sasha's right. Encouraging this may not be the best thing.       How does she know it even exists?  He is obviously not thinking clearly. And now we have to put up with her petty grasping.  I beg your pardon?  And you're her advocate? You've been taken in by her celebrity. I worried about this.  We should see her. Act as if nothing has happened.  Sofya Andreyevna, at last, you honour us with your visit.  What is it?    You're very kind. Sofya Andreyevna. But I can't help you. Not without specific instructions from your husband.  No witness you produce will change my position. But I'll certainly talk to Leo Nikolayevich at the first opportunity.  I want us to be friends, too, Sofya. Leo Nikolayevich is the most valuable thing in the world, for both of us. We should endeavor to set things right between us. Give him peace. Let him work.  I hate to say it but the Countess has become more and more dangerous.     You've been more than reasonable. She already controls the income from your property.  We're speaking only of the rights to your words, your ideas.  With all love and respect, the Countess is too interested in making a profit from your work.  But you're more than a husband and father. She must understand that. The best interests of the people are one with your own. You belong to them.  She's unstable...I wonder if she isn't ill.  Do you really think she's fit to control the final disposition of the will?  What are you afraid of?  The press is bloodthirsty. Had I wished, I could've demolished you and your family. You make it easy.  I have too much respect for Leo Nikolayevich. You're lucky.  If I had a wife like you, I would have blown my brains out long ago. Or gone to America.  Good afternoon, Leo Nikolayevich.  This will insure that the complete works will live in the public domain.  Your work is the birthright of the Russian people. Now, they possess it forever.  Yes?  Of course.  What?  You're a secretary.       How can you not have a pen?  Valentin Fedorovich, do you have a pen?  Are you alright?  Thank you again, Valentin Fedorovich, for your forethought.  You know I had thought for a time to suggest that Leo Nikolayevich look for someone else. But...he said no. He said \"He reminds me of myself when I was young.\"  Really.  She is leading you around the nose.  Yes... The love he tells us to practice, the love of the Gospels. Why do I have to explain this? Perfect love. Eternal love. The love that binds mankind together.  Leo Nikolayevich also teaches us love can not be weakminded. Go. You won't be missed ...a naive sentimentalist  Why are you laughing? You think I'm ridiculous.  Bulgakov! Where is he?    Take me to him.  He left...astonishing...He actually, finally left.  It's a triumph for the movement.  He looks so small.  My dear friend, waht is all of this?  I've made a point not to.  And we'll be ready.  Not before she stops to tell them lies, catalogue my atrocities.  Do you really want to do this here?  Are you finished?  You're imagining things.  She's at home.  Kind thoughts from George Bernard Shaw.  Keep your voice down.  What exactly do you think she will bring him?  I´ll tell you what she´ll bring...Vanity, fuss and noise.  What? Promised you what? You´ve seen her at close quarters, boy. You think she´s capable of restraining herself?  You're a victim of her romantic nonsense. You seem to forget she wants to destroy everything we do. She travels with that unctious little priest.  These people are vultures. They send in at the last moment and welcome him back to the church. That's their fantasy. A death bed recantation. Do you have any idea the damage it would do? Everything he's dreamed of, everything we've worked for will be gone. A simple noble death is what we want. It is what he wants.  I will do everything in my power to prevent that.  I used to think you were just naive, Valentin, maybe a little stupid.   I see now you're more dangerous than she is.  It's almost over.  He won´t know who she is anyway.  I am sorry, Sofya Andreyevna.",
        "Reporter": "Countess...Countess...Do you have any information? Countess...Is he dying? Is he dead?",
        "Valentin": "Do you know who that is? That is the greatest man in the world.  Tolstoy does not approve of sexual relations. I know this.  This would not be a problem. I'm celibate. I'm also a strict vegetarian.  Believe me, since becoming a Tolstoyan, I have become so eager to learn, so comitted to discussing ideas, improving my very soul.  We?  In the name of truth and freedom.  Enemies?  She wouldn't open his private correspondence...  Please.  Anything?  Oh, goodness..It's a beautiful day.  I look forward to it.     Of course.  Just that...secrecy doesn't seem to me the essence of Tolstoy's thought.  Yes, I...I'll see you in the morning.     Come in.  That's very kind of you.  Last night.  He seems very sincere.  Thank you. Why are you laughing?  I said he seems very... Why?  I just arrived...What's your name?  Thank you for the tea.  Hello...hello...  I'm... I'm... Here is-  I'm sorry.     Sometimes I...  He told me about it...It's very exciting.  I'm very happy. You are very kind. I'm no one and you are... you are Leo Tolstoy and you ask me about my work.  It's a keystone of the movement.  I think...  It's your voice. It's wonderful.  Do your parents often speak to each other so...bluntly?  I'm sure she means well.  Your father is the greatest writer in the world.  I mean to say, I feel privileged to be here. It's an... honor.  I'm sorry. Sometimes I sneeze when I'm nervous.  It´s from your mother. She wants to see me.  Thank you, Countess...  I admire your husband immensely.  His ideas are beautiful...social justice...the idea...Don't you think?  Thank you.  Many times... twice.  He's given me an extraordinary opportunity.  I don't believe anyone wants to do that.  It's a very popular activity around your husband.  That may not be so easy.  He didn't need me this afternoon.  Leo Nikolayevich disapproves of women doing physical labor. Don't you find that reactionary?  Tolstoy's kind to everyone.  We talk about me.  He wants to know everything about me, my parents, my relations with women, my experience of god -  At school?  I see...  No...I appreciate your frankness  I don't. Not at all...I think sexual activity...how men and women combine their physical parts is completely neutral.  That's not fair  I'm going.  Yes. You know, I think that I... never mind.  A girl who died?  You shouldn't torture yourself. It was a long time ago.  I try to...you know, to...  Are you alright?  What do you mean?  It´s interesting. I think you would say..I mean, I´ve read where you say that the physical body isn´t real. That it´s all an illusion.  I...I don´t know.  Lilac?    What do you mean?  It's not quite so obvious to me.  I do.  That's why I'm here.  Well, I think the Countess is very suspicios by nature.  I don´t think she likes you very much.  It´s a tone I´ve picked up.     Hello... Hello?  Masha?  Masha.  Masha.  What...what is it?     Wake up, wake up.  I want to ask you something..Say it again.  Why did you come to a place like this?  You don´t follow any of the rules.  What is it?  At the moment, I'm indisposed.     Tell him... I'll be down at once.  If I see her I will...  Let me go out first...give me five minutes...  What are you saying?  Masha. You are not supposed to smoke at Telyatinki.  It was difficult in front of the others.  I'm not sure I was conscious of God.  No...  You make it sound very simple.  I'm afraid I've hurt you, haven´t  She's here to question you about the new will.  She claims Leo Nikolayevich told her she could examine the draft.  It doesn't seem petty to me.  He`s her life. The work, in her mind, is theirs...together.  I'm talking about their history -- - simply that.  Nothing has happened.  I'll escort the Countess home and be back in time for supper.  It's nothing, really.  Masha is a friend.  A good friend.  I'm not annoyed.  Maybe I do.  Sorry, sorry, I'll... I didn't mean to scare you...Are you alright.  I came back as soon as I could. It was a strange day. Leo Nikolayevich,...I love to listen to him. I love nothing more...  But today I could hardly concentrate.  All I could think of was you.  What's wrong?  No. No. You didn´t confuse me..I was stupid. I was afraid, but I'm not afraid anymore.  I love you, Masha!  Masha...  Before the other night...I'd committed the act of copulation many times in my heart.  I think about you all the time. In my heart I´ve comitted the act of copulation many times. I just want to say...It was never like it was with you.  I hope you're feeling better.  I took singing lessons for years. I thought about a career in music. The only thing I lacked, in the end, was talent. I'm sorry about everything.  Really, I'm expected at Telyatinki.  I should go.  I thought it might be quieter, but-  Countess...Are you alright?  Is she alright?  It was terrible there today... between them. They loved each other so much, but you see what it becomes.  Masha, what´s the matter?  What?  This is him punishing us, punishing me for befriending Sofya Andreyevna. For not... This is Chertkov.  I don't care. You can't go away. I'll talk to him. I'll make him change his mind. i´m going to make you stay.  What?  You can´t leave Tolstoy.  Don't leave me, Masha... I need you.  I do.  Maybe we should get back. It'll be dark soon. May I ask you something that has nothing to do with work?  Do you love your wife?  I'm a secretary, after all.  I'm leaving Telyatinki.  I am going to Moscow.  Look, you say the movement's about love-  But I've never met mankind, only men and women, imperfect men, imperfect women.  I'm laughing because I didn't sneeze.  Yes, of course.  What?  Where will you go?  Do you want to go back?  I will.  I think so, yes.  I have this for you.  Countess!  Sasha, go back to the jetty. Here, let me help you.  I will. I will. Stay here.  I'm glad she can sleep. The pain subsides a little.  Ingenious.  I'm here.  I don't know if she's my girl.  I very much hope so.  I´ve told you she has promised she wouldn´t make any problems. But besides, where are we going?  Please move back. Please let him breath. Please give him some room.  The stationmaster says we may have his house for as long as we need it. There are no inns nearby, so we're lucky.  Hello, hello? Could you send a cable for me?  Tolstoy ill at Astapovo. Temperature high. Send it to Sofya Andreyevna, Yasnaya Polyana.  He wasn't well enough to travel. It's very cold.  Ready for what?  I'd like to send another cable.  At Astapovo. Stop. Tolstoy Ill. Stop. Heart breaking. Stop. Please Come.... That's it.  It goes to Masha...to Maria Filipovna Melinov, Moscow. Thank you.  Let me speak to her.  Countess!  Of course. But I'm not certain if it´s the best time, Countess.  Sofya Andreyevna... Stay back, stay back.  Let me take you back.  Yes, of course.  No, Countess, Don't worry. Not at all.  What is it? Dushan, what´s wrong?  You lied to him.  He wants to see her.    You heard him say it.  I don´t know, they´ve been married for 48 years.  She promised me-  They have a whole life togehter. Why do you have to deny that?  Keep the priest away-  No, you want an icon. You want to take photographs and give out postcards..You want people to kneel in front of an image you´ve created. But he doesn´t wanted that. He never wanted that, and it will give him no peace.  He wants to see her...let her come.  Oh, God. You exhaust me.  Tell me one thing. That image you want to create, just looks like you, doesn´t it?  Masha...  Masha...Masha...I'm so sorry he's gone. He´s gone.  I love you. I do. I love you.  Excuse me, Countess. This may not be the time, but-  Masha...this is Masha.  No, no. Not at all. I just wanted to say good bye.  God bless you, too."
    },
    "imdb_rating": "6.9",
    "description": "The Countess Sofya Andreevna Tolstoy (Dame Helen Mirren), wife and muse to Leo Tolstoy (Christopher Plummer), uses every trick of seduction on her husband's loyal disciple, whom she believes was the person responsible for Tolstoy signing a new will that leaves his work and property to the Russian people.—IMDb Editors",
    "name": "The Last Station",
    "genres": [
        "Biography",
        "Drama",
        "Romance"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTA4MTAzNTQzMDNeQTJeQWpwZ15BbWU3MDgzNTg2MDM@._V1_QL75_UY281_CR5,0,190,281_.jpg"
}