{
    "filename": "Visitor,-The_script.txt",
    "imdb_id": "tt0857191",
    "imdb_url": "https://www.imdb.com/title/tt0857191",
    "characters": [
        "Mr. Shah",
        "Zev",
        "Darin",
        "Walter",
        "Jacob",
        "Mouna",
        "Cop #1",
        "Tarek",
        "Omar",
        "Barbara",
        "Karen",
        "Charles",
        "Martin Revere",
        "Cop #2",
        "Zainab"
    ],
    "dialogues": {
        "Shah": "Zainab, you're also undocumented, right?  You know you can't visit Tarek at the detention center, right?  How long have you known Tarek?  Mr. Vale?  A week?  Does Tarek have any family living here?  She's also undocumented, correct?  It's OK. This is all confidential.  Does she know that Tarek is in custody?  Has he ever been convicted of a crime?  Do you know if they ever applied for asylum?  When was that?  And did they appeal it?  Fear of being deported. It used to be that when your asylum case was denied, they let you go until your appeal. A lot of people didn't bother with it. Getting denied once was enough to spook them.  Then there may be a final order of deportation on him which means he won't even go before a judge this time. He'll just be deported.  Look, one step at a time. Let me talk to him then we'll have a better idea of his status and what our options are.  Visit him.   Walter and Mouna are talking to the Mr. Shah.   And what happened after the hearing?  And your appeal was denied?  Then they should have sent you a bag-and-baggage letter which basically tells you where to show up and be deported.  But you didn't receive it?  You sure?  Did you move?  Well, it wouldn't be the first time that happened. And pre 9/11 it wasn't much of a priority tracking people down.  It keeps our chances alive. If they got it and just ignored it then we couldn't push to reopen the case.  It's still a long shot. Like I said, the Government's approach has changed radically.  It's very black and white now. Either you belong or you don't. Which means a lot of people who have been living here for years are suddenly being swept up and thrown into detention. Tarek's lucky. Most of them don't even have lawyers.    Actually, I don't have the time right now. I have to be in court very shortly    Yeah. Two kids. And for what it's worth my uncle was deported after raising a family here for twenty- three years. If I can get Tarek out, I will. 76  Queens.",
        "Zev": "How far is Senegal from Cape Town?  I told a guy I was from Israel yesterday and he asked if I had ever visited the Holy Land.  Hey, look who it is. What's up Tarek?  Good man.  Ahh. You know.",
        "Darin": "",
        "Walter": "Yes.  Yes. Come in.  Can I take your coat?  OK. Would you like anything to drink?    Walter and Barbara sit side by side in a very close proximity.   The same thing?   What?   Walter walks Barbara to the front door. He opens it and then hands Barbara some money.      Here.  No. I don't think I'm going to continue with our lessons.  No.  Goodbye.  Four.  East Asia's experience is really the exception to the rule, because the conditions there that made trade liberalization for the Middle East successful weren't present in the developing countries in sub- Saharan Africa, and in Central and South America.   Walter is staring out the window in his simple but very lived- in office. Classical music plays softly in the background. A knock at the door.   Come in.  Why is it late?  I'm sorry. I can't accept it now.  I'm sorry.     Walter pulls into the driveway of his house. He gets out, grabs his belongings out of the back seat and walks inside.     Walter is making dinner. Classical music plays from the other room. He adjusts the flame and covers a sauce pot. He leans against the counter and picks up a half empty bottle of wine and pours some into his glass. He catches sight of A SMALL FRAMED PICTURE of him and HIS WIFE, smiling.     Walter sits at the piano and practices. It is still going badly. The wine glass sits on top of the piano. He lifts his hand and inspects his \"tunnel\".     Walter is at his computer. He pulls up his YEAR SYLLABUS on the computer and carefully changes 2005 to 2006. He saves it. His work is done. There is a knock at the door.      Yes.  Charles.  That's OK.  Why can't she go?  When?  I wish I could, but now is not a very good time, Charles.  I just don't think I can with the start of classes and my book.  So I can stay focused on my writing. I'd really rather not go right now.  Charles, the truth is this is really Shelley's paper. I just agreed to co-author it because she asked me to. I'm not really prepared to present it.  Thanks.  Just busy with work.    Two cars are parked in Walter's driveway.     Walter is packing, laying out his shirts on the bed. After a moment, Karen walks in, drying her hair with a towel.   Today after class.  Yeah. Thanks.   Walter drives along the highway. He notices a SIGN which reads \"Support Our Troops!\"     Walter drives through the small busy streets of the East Village.    Hello?  Hello?   A YOUNG BLACK WOMAN is soaking in the bath tub.   She see's Walter and screams.     Walter screams too and then slams the door, stepping back into the hallway.   It's OK. I'm not going...  I'm not going to hurt you.  This is my apartment.  My name is Walter Vale. I have keys. It's my...  Stop it! I am not...   No! No!  Yes! Yes! I have keys. It's my apartment.  This is my apartment. I've owned it for twenty-five years.  I live in Connecticut. I haven't used it in a long time.  Ivan? Who is Ivan?  No.  No.  I don't know Ivan. Who is he?  I don't know who he is but this is my apartment. I assure you.   Yes. OK.  Yes. I'm just going to sit down.  Yeah. I'm OK.   Walter is sitting on the couch with a glass of wine. Tarek enters and sets down a bag. He picks up TWO AFRICAN DRUMS next to the piano and places them by the front door.  Zainab enters from the bedroom mumbling something in an African dialect. She drops a bag and crosses back to the bedroom.   How long have you lived here?  Good bye.   Walter walks to the window and picks up a handcrafted, decorative FRAME off of the sill. It is a PHOTOGRAPH of Tarek and Zainab. They are hugging each other and smiling. Walter looks down onto the street.  He sees Zainab and Tarek exit the building and cross the street. Zainab's cart tips on the curb and the contents spill out onto the sidewalk. Tarek quickly moves to help her. Zainab yells at him.  Walter watches as they finally collect their belongings and move down the street.    You left this at the apartment.  Do you know where you're going to stay tonight?   Walter takes some books out of his briefcase. He crosses to the bookshelf and sets them down. He notices a small stack of CD's sitting on a shelf. He picks one of them up and stares at the CD for a long moment.   Yes.  No. Do you?  OK. Good night.   Walter is lying in bed, unable to sleep. He can hear Tarek and Zainab whispering and laughing.     Tarek and Zainab are lying in bed together.    Jacob walks outside with Sprinkles.     Walter is tying his tie in the mirror.     Walter walks out of his bedroom and runs into Zainab who is leaving her bedroom at the same time. It's obvious that she was trying to avoid Walter.   Good morning.  I made some coffee.  Have a good day.   Walter is walking up the stairs carrying a briefcase. He passes a MIDDLE-AGED MAN who is walking down the stairs with a SMALL DOG on a leash.   Yes.  Yes.  Oh. Right.  No. She passed away.  How's your mother?  Nice to see you, Jacob.   Walter walks into the apartment. No one else is there.  He sets down his case and walks toward his bedroom but stops at Tarek and Zainab's door, which is closed. He listens. Nothing.     Walter is reading over and \"rehearsing\" the paper that he has to present.      Walter is practicing the piano. He continues to struggle. He sits back and takes a break. He notices the drum next to the piano. He looks at it for long moment and then continues playing.        Walter is lying in bed awake. He listens as Tarek and Zainab come home.    Yes. In a minute. I have to make a call.   Walter arrives on the top floor. He can hear the drum being played. He stops in front of his apartment. He listens for a moment and then slowly opens the door.     Tarek is playing his drum in his T-shirt and underwear. He sees Walter and finishes with a flourish.   Hi.  It was a half day.  Fine.  That's good. You can keep practicing if you like.  No.   It's fine.  OK. Thank you.   Walter is lying down on his bed reading through his paper. His foot is tapping to the rhythm of the drum.    Are you sure that you wouldn't like some?  Yes. Thank you. Here, let me...  Well, thank you for the dinner. It was very good.  Economic Growth in Developing Nations.  Three. I'm working on my fourth.  Is he still writing?  I'm sorry.  I have to get some work done but thank you.    Tarek and Zainab are walking down the stairs.   Hello.  If you don't mind, I think I will come.  He's very good.  The whole band is very good.   Walter walks into the apartment and sets down his briefcase. He notices Tarek's drum sitting in the middle of the room.   Tarek?  Tarek?  Oh. Hi.  Yeah. Well. I was just...I'm sorry if I...  Yes.   Oh. Right.     Sorry.  No. 33   Zainab enters the apartment and sees Walter drumming. His shirt is unbuttoned exposing his white undershirt. He stops. He is breathing very hard and sweating.      Hello.  He went out. To look at another apartment.  Yeah. Tarek is teaching me the drum. I'm practicing. Don't worry, I'll keep my pants on.  Nothing. I was just...nothing.  I have to present a paper at eleven. I should be done by twelve- thirty.  Well...if China continues to threaten the wage earners in the first-world economies by keeping wages down, then it's really just a matter of time. What they buy they inflate. What they sell they deflate. But then you have to ask the question `who's paying the cost?'. And the answer is the Chinese people.  Fine. Thanks.  That's good.  I think she will as long as no else lives there.  Oh. Yeah. Thanks. 37  Are you hungry?  Uh...yeah. I like sharmas.  Yeah.  Thank you.  No.  OK. I will.  Yeah.  Hi.  What does habibti mean?  Does she know that?  Is he good?  So why haven't you?  I think I'll just watch.  What is Arab time?  Sir, I did pay his fare.  But I paid this man's...  I don't think that's necessary.  But he didn't mean...  Where are you taking him?   Walter enters and shuts the door and Zainab is sitting on the couch working on her jewelry.  She stops when she sees Walter standing alone, holding the two drums.   He was arrested.  Yes. In the subway.  Yes. It was just a misunderstanding. They said he would be released later tonight. 47  He didn't. I'm sure we it will be  Yes it will. I went down to the precinct and made a statement.   Walter is talking on his cell phone and pacing.   Yes. His name is Tarek Khalil. Khalil. K. H. A. L. I. L. That's right. Yes. I came down and made a statement. They said he would be released. That was six hours ago. Well when should we know? Tomorrow? Why? But he...OK. OK. Thank you.  They've moved him.  To a detention center in Queens. He was turned over to immigration. They said we can see him during visiting hours tomorrow night from five to ten.   Zainab's bedroom light is on.   INT. WALTER'S APARTMENT, TAREK'S &amp; ZAINAB'S ROOM - SAME  Zainab is sitting on her bed and talking on her phone.   A week.  Why wouldn't they appeal it? 51  So what happens if that's the case?  Is there anything I can do?  Hi. I'm here to see Tarek Khalil.  No.  Of course.  She's upset. I have a letter from her.  How are they treating you?  Do you need anything?  Zainab and I met with a lawyer today. 55  He is going to stop by to see you tomorrow.  Tarek, Zainab said you were denied asylum.  Did you go to your deportation hearing?  You did?  Yes.  Goodbye.   Walter and Zainab are sitting at the kitchen table. Zainab is holding her letter.   Yes. He said that he did.  You don't have to leave. You can stay here.  Yes.   Zainab walks away from the apartment.        Walter practices the drum.     Jacob walks Sprinkles in front of the apartment building. Walter walks outside and waves hello as he walks past.     Walter is playing the drum. He finishes with an \"end beat\". He looks around the quiet apartment.    But I thought you said you went to the hearing.  So why is there a final order on you? Did he say?  Maybe you should call your mother. She might have...  Did he say anything else?  He's trying to deal with the case as quickly as possible.  Tarek. I have to go back to Connecticut. I'll be reachable by phone if you need me for anything.  I won't.  Yes.    I will.  What?  Now?    Walter is packing his suitcase. Suddenly there is a knock at his door. He exits the room.     Walter opens the door. Standing there is a strikingly attractive forty-five year-old ARAB WOMAN. She seems startled to see Walter.   Hello.  Can I help you?  Are you Tarek's mother?  Oh. This is Tarek's apartment. I...share the apartment with him.  I'm not here very often. I live in Connecticut.  No. He's...uh...he's not here. But please come in.  Please.  I'm Walter. Walter Vale.  Would you like to sit down?  Would you like something to drink? Coffee or water?  Tarek was arrested. He's being held in a detention center in Queens. They are trying to deport him.  It's not far from here. Twenty minutes.  Yes. I saw him yesterday. He's OK.  He was stopped in the subway station. He didn't do anything wrong.  OK. But Mrs. Khalil. The lawyer mentioned that...I don't think that you can...  OK. I can take you if you'd like.  Let me get my coat.  Have you been to New York before, Mrs. Khalil?  I have a son. He lives in London.  My wife passed away.  That's it.  Yes. That's it.  I think that's the point.  Tarek said about three hundred.  There is a coffee shop on that corner. It's not very nice but...  I was.   Tarek, your mother is here.  She is waiting outside.  Today.  She said she hadn't heard from you.  OK. OK. Here. I have a letter from her.  He's good but he's concerned about you being here.  Mrs. Khalil, I'm not sure that your being in New York will do any good. We have a very good lawyer working on Tarek's case...   Walter and Mouna arrive back at Walter's apartment building. Jacob emerges from the front door with Sprinkles.   Hello, Jacob.  Goodbye.   Walter and Mouna enter the apartment. Mouna picks up her suitcase.   Where are you going?  You can stay here. You can use Tarek's room.  You're not imposing. Please. I would like you to stay.   Mouna walks down the stairs.   Mrs. Khalil?  Please. I was with Tarek when he was arrested. He was in the subway in the first place because of me. Please. Stay. Even if it's just for the night.   Walter enters the room and sets down Mouna's suitcase. She follows him into the cramped bedroom.      The bathroom is just across the hall.  You can call me Walter.  Do you need anything else?  Good night.   Walter walks out of his bedroom. He hears talking from the living room. He walks down the hall and sees Mouna sitting on the couch in the living room, talking on her cell phone in Arabic. He turns and walks back down the hallway.     Walter pours a cup of coffee. He notices two newspaper's on the counter. One is the Financial Times and the other is Al Hayat, an Arabic newspaper. He picks up the Financial Times and reads the front page. Mouna enters.   Good morning.  How is he?  Well, you can stay here as long as you need to.  Thank you for the newspaper.  Uhm...Yes. They did.  She's staying with her cousin in the Bronx.  We can go by her stall.  Her stall. She sells jewelry in a stall.  No. Not really. I just came down to present a paper at a conference.  Yes. Well I coauthored it.  So if they didn't get the letter then does this help us?  There. In the middle.  Yes.  Hi Zainab. This is Mouna Khalil. Tarek's mother.  Why?  Yes. I think so.  No.  Excuse me. Hello? Oh. Hi Charles.  What's that? Yes. I'm still in New York actually. I stayed down here to do some research. What's that? Oh. I'm on a boat. Yes, a boat.  Listen Charles, I'll explain when I see you but I have to go right now. I'll call you back. Goodbye.  Yes.  Yes. She liked it.  Yeah. She told us.  Really?  Yes. I think your mother likes her very much.  I don't think so.  I'm sorry.  Are you hungry, Mouna? We can stop for dinner.   Yeah. That's probably a good idea. 83   Mouna is preparing dinner. Walter comes in and takes a bottle of wine out of the refrigerator.   Would you like a glass of wine?  Mouna? I need to go back to Connecticut tomorrow. For work. I told Tarek.  I don't know yet. I'll try to make it back to visit Tarek as soon as I can.  I'll see what I can do.   Mouna and Walter are eating in silence.   Broadway? Uhm. No. I haven't been in a long time.  No. I haven't.  Tarek is teaching me the drum.  Well, I sound a lot better when he's playing with me.  My teaching?  Well...I have a lighter schedule so I can work on my book.  Well, it covers quite a bit, so it's hard to explain.  I'm close.  No. It's just a bit complicated.  It just is. It's just not a process that's easy to talk about with someone who's not a writer.  I shouldn't have spoken to you like that.   Walter is sitting on the edge of his bed and takes off his shoes. He pauses.    Thank you. You have my number if you need anything.  Well good bye.   Walter pulls into his driveway. He gets out of the car. He opens the trunk and takes out his bag and then his drum.    Good afternoon.   Walter sees Karen walking toward him. She is talking on her cell phone and does not notice him. Walter just watches her pass without saying a word.     Walter sits in his office working. He stops and listens to the silence.        Walter pours himself a drink and wanders around the empty house.     Walter opens the front door and walks outside.     Walter walks onto the front lawn and looks around the sleepy neighborhood. He listens to the quiet. It's a stark contrast from New York.     Walter roots through his briefcase and pulls out the FELA KUTI CD. He slips the CD into the stereo. He presses play. FELA KUTI's, \"DON'T GAG ME\" blares over the speakers.     Walter is sitting in a chair and playing the drum along with the Fela song. He is only wearing a T-shirt and boxers.     Three MOVERS are carefully removing the piano from Walter's house as Walter and Barbara Watson look on.     Walter drives back down the highway. The Fela Kuti music is playing. He is tapping on the steering wheel.     Walter walks quickly up the stairs to the fourth floor. He seems to be moving with a little more pep.     As he approaches his door, he hears music emanating from his apartment. It's a PIANO SONATA. The music stops him in his tracks. He listens for a couple of moments. Finally he walks inside.     Walter enters to find Mouna mopping the floor.   Fresh flowers are on the table. She sees Walter and smiles.   No. Thank you.  Yes.  Thank you.  Yes.  Yes.  Thank you.  Yes. Thank you.  Mouna?  I was wondering if...Thursday night ... Do you have plans?  Well, I thought that...we might do something.   To where?  Has anyone said anything to you?  I know.  I'm sorry.    He would make some calls but they can move him to another facility at their discretion.  He said it could be anywhere. Upstate. Pennsylvania. There is even one in Louisiana.  Yes.  Yeah.  No. No he didn't know anything else.   Mouna is sitting on her bed, speaking in Arabic. Walter, dressed in a jacket and tie, is sitting in his bedroom. Suddenly Mouna appears in the doorway.   That's alright. How is he?  I am. You look very nice.  Yes.  Ready?  Yes.  Yes. Is that OK?  Yeah. It was kind of scary.  I'm sorry. I didn't even think to ask.  Two please.  I haven't been to theatre in a long time.  Cheers.  Mouna, I've taken a leave of absence for the rest of the semester.  I just thought I might spend some more time in New York.  I want to.  It's fine really.  I'm not busy. Not at all. Mouna, the truth is I haven't been doing any work for a long time.  I didn't even write it. I just read it. I've been teaching the same course for twenty years. It doesn't mean anything to me. None of it does. I pretend. I pretend that I'm busy. That I'm writing. Working. But I'm not doing anything.  I'm sorry.  I don't know.  Mouna, what do you do?  Yes.  Really?   Mouna and Walter walk into the apartment. Mouna takes off her coat.   Twelve thirty.  Yes.  I think that happens a lot in New York.  I told Tarek I was going to take you. He was very happy about it.  Good night.   Walter wakes up. He checks his watch. He notices that his phone is blinking. A message. He picks it up and listens to it.      Damn it!  There's a message from Tarek. Something's wrong.  Just that they were moving him. He didn't know what it meant.  Well when do you expect him back? Can you have him call me the minute he is? It's an emergency. Thank you. He's still in court. Can you hurry please?  Hello. I'm here for bed 38. Tarek Khalil.  What does that mean?  You're not sure? Was he moved to another facility? Another state? What?  Well can you ask someone who does know?!  Yes. Did you find him?  Removed? To where?  What? When?  He...how can that be? Is there any way to contact him?  You don't think so? What kind of answer is that?!    It's not fair! We are not just helpless children! Do you hear me?!   Walter is looking out the window. Mouna walks out of the kitchen and turns out the light. She walks over and stands next to Walter.   When are you going to leave?  You won't be able to come back here.  Mouna. I'm sorry.   Walter is lying awake in bed. There is a knock at the door. He sits up.   Yes. 103  It's not your fault.  It's not your fault.  No. Not yet.  Thank you. It's very nice.  I like it.  Cool?  I don't want you to go. 105",
        "Jacob": "I used to live here with my mother. Your wife used to give me piano lessons.  It has been a long time. I thought that maybe you sold the place. Oh. This is Sprinkles. Say \"hi\", Sprinkles. Is your wife here with you?  What?! No! I had no idea. I'm so sorry. She was such a nice lady. And I just loved listening to her play.  She moved to Florida. Now I live here. It's nice. There are a lot of new faces. I hardly know anyone anymore. But I have Sprinkles so...  You too, Mr. Vale. Goodbye. Welcome back.  Oh. Hello, Mr. Vale.  Oh, hello again. Did you find your son?     So you two know each other?  Oh. Who is that?  Oh. Tarek. He is very nice. And so is his girlfriend. They are both so polite.  My mother and I are planning a trip to go to Israel next summer. She's always wanted to go.  Oh sure. We need to go on our walk and do our business. Very nice to meet you, Mouna.  Goodbye, Mr. Vale.",
        "Mouna": "Thank you.  No. Is my son alright, Mr. Vale?  Where is Queens?  You have been there?  How did this happen?  I would like to go there. To Queens.  I know I can't visit Tarek, Mr. Vale. I just want to see where they are holding him.  Thank you.  No. Tarek wanted to come to New York to play music. I did not want him to go but...do you have children, Mr. Vale?  And your wife?  I'm sorry.  This is where the prison is?  It does not look like a prison.  How many people are in there?  I'll wait there. Here.  Thank you.  No.        How is he?  I will not leave.    Shall we go?      Yes. Thank you.  Nice to meet you, Jacob. I'm Mouna.  Yes. Mr. Vale knows my son.  Tarek.  Thank you.  I hope you enjoy it. Now if you'll excuse me.  You too, Jacob.  Thank you, Mr. Vale.  I will find a hotel.  Thank you for your offer but I cannot accept this. I don't want to impose on you.  Again, thank you. But I will manage. Goodbye.  Goodbye.  Thank you, Mr. Vale.  And I am Mouna.  No. Thank you. Good night.  Good morning.  Tarek said hello.  I can't really tell. He wants me to leave. But I am not leaving.  Thank you. That is very generous of you.  Walter? Did Tarek and his girlfriend, Zainab, live here together?  And where is she now?  I would like to meet her.  Her what?  Oh. OK.  Do you spend a lot of time in the city?  You wrote it?  Congratulations.  We appealed. It took two years.  Yes.  No.  Yes. I would remember this.  Yes. Eventually we had to. But we had our mail advanced.  So you can help him?  Lucky?  Can you explain what that means?  How long will he be in detention?  Do you have children, Mr. Shah?  Thank you. Where are you from?  Which one is she?    She is very black.  Hello, Zainab. 77  Please. Call me Mouna.  Neither did I.  Your jewelry is very beautiful.  Do you have time for coffee or a walk?  Why?  Yes. He called me this morning. He is doing all right.  Me too. How long have you been here?  Blame you?     No. I do not blame you.  He said the same thing about you.  Yes. 79  Zainab, I would like you to do something for me.  I would like you to show me something that you and Tarek liked to do. Some place that you like to go.  Anything. Whatever you want.  So what is in Staten Island?  Can you go up in the Statue?  You haven't been?  Oh.  I would prefer to cook if you don't mind?  Should we stop at a market?  No thank you.  How long will you be gone?  You don't have keep visiting him, Walter. I'm sure you are busy.  OK. Dinner will be ready soon.  Do you go to Broadway, Walter?  Tarek sent me the CD for \"Phantom of the Opera\" for my birthday. The music is lovely. Have you seen it?  I haven't either but I think I know every word.  Really? How is it going?  How is your teaching going, Walter?  Yes.  Your book? What is it about?  Are you almost finished? 85  You don't like to talk about your work?  Why is that?  I didn't mean to pry.  It's OK.  I'll be fine. Thank you. Have a safe trip.  Goodbye.  Walter.  I did not expect you so soon. I was just cleaning a bit. I hope you don't mind.  I like this CD very much.   The music is lovely.  Is it your wife?  She was beautiful.  These are different glasses?  Are they new? 89  They're nice.  I was going to make some lunch. Are you hungry?  Yes.  No, Walter, I have no plans.   What did he say?  That's so far.  Did the lawyer say anything else?  No one seems to know anything. It feels like Syria.  Sorry to keep you waiting.  He says hello. He wants to make sure that you are practicing your drum.  You too. Should we go?  This city is just so huge! It never ends. 93  For what?  Really? The Phantom? Are we seeing it?  Now?  That's wonderful. Thank you. I am so excited.  I have to say that show was really kind of scary. 94  Yes.  Very good. But I think I would like a glass of wine.  It's OK. It's not every night that you see The Phantom. I'll have a cabernet.  Me neither. There is a place in Syria called Maaloula. It is a huge outdoor theater. It's beautiful. We used to take Tarek there to see concerts.    Really? Why?  Walter, you do not have to do this for Tarek.  But you have to be in Connecticut. You have your teaching. And your book.  This is not your problem, Walter. It's OK that you are busy.  You just presented your paper at the conference. 96  Don't be. I appreciate you telling me this.  Walter, what would you do if you didn't teach?  I think that is exciting. Not to know.  Do you mean for work?  I work in a car dealership. I take care of the accounting.  Yes. It's very exciting. 97  What time is it?  No?! Is it?  My God. Twelve-thirty! I have not been up this late in a long time.  Thank you, Walter. That was a very nice evening. It's the most fun I've had in a long time.  Good night, Walter.  What did he say?  I hate this feeling.    Walter. Let's go. There is nothing we can do. Let's go.  Come on, Walter.  He did nothing wrong.  Walter, I need to go back to Syria. I should to be there for Tarek.  Tomorrow. I already bought a ticket. It's best for me to be there as soon as possible.  I know.  Good night, Walter.  It's my fault. What happened to Tarek. I did receive the letter telling us to leave. I threw it away. I never told him.  We were here for three years by the time the letter arrived. I had found a job. Tarek was in school. Everyone told me not to worry. That the government did not care. And it appeared to be true. And then, after time, you forget. You think that you really belong.  Have you visited your son in London?  You should visit him.  Here.  Zainab and I picked it out especially for you.  Let me see.  So do I. You look cool.  Yes. You are very cool, Walter.  I should go.  Thank you, Walter. For everything.",
        "Cop": "Just step over here, pal.  You jumped the turnstile.  Could you step back please?  Sir, stand over there. 45    You got anything else, Tarek.  Where are you from?  Well we do. You can come down to the station and make a statement.  Sir, that's all I'm saying. Now step back or we are gonna take you in too.  Ninth Precinct.",
        "#1": "And so I just stood up and walked out!  Coming in? 25  See you inside.  You jumped the turnstile.    You got anything else, Tarek.  Where are you from?",
        "Tarek": "Do you have keys?  I don't know! Show me your keys! 13  So why haven't you been here!?  Are you friends with Ivan?    You didn't call the police?  And you don't know Ivan? 14  He rented us this place. He said it belonged to his friend who was out of town.  Shit!  Enough! OK. Look. We don't want any trouble. We will get out of your apartment. This is all a mistake. I'm sorry.  We will leave, OK?    Are you OK?  Of course. Please.  I'm sorry if I hurt you. Are you sure that you're OK?  OK. Well, we'll pack up and get out.  I know I'm in trouble when she starts speaking Wolof.  Two months. We will pay you if you want.    Here is the coffee you wanted.        What!?  Thanks.  Yeah.  You like classical music, huh?  Me too. Do you play piano?  Me? No. I play the djembe. Well, thanks again for letting us stay. You saved me a lot of trouble.  See you in the morning.   Tarek and Zainab are lying in bed together.   Trust me. He's asleep.  So let him hear. The guy probably needs some excitement. 19  I don't know. We'll figure it out tomorrow. Who knows? Maybe he'll let us stay. He's not really using the place.  OK. OK. So we'll figure it out in the morning. I promise, habibti.  Do you still love me?  Really?  Not even a little?  So what is this?  But what about our roommate?  Hey Walter. Welcome home.  You're home early.  How was the conference?  Sorry about the pants. I've been playing like this since I was a kid.  Hey. I think I might have a lead on a place in Brooklyn.  Really? It won't bother you?  Great. Thanks. I'll keep my pants on.  Hey, Zainab's going to make dinner if you want to eat with us later.  I'm sorry. That was my mother. If I don't call her every day she thinks something happened to me.  Yeah. I'll have a bit. Thanks.    So what's the conference about?  That's us. Syria. Senegal.  So have you written some books?  Four books?! Great. My father was a writer. A journalist.  No. He died. Before we left Syria.  So am I.  Oh. We have to go. I have a gig tonight.  Walter, you can come if you want.  OK. Well maybe another time  Bye.    You know you are very sexy when you're mad at me.  Cool.  Sorry guys. Let's go.  It sounded good Walter.  Don't be sorry. That's what it's there for.  I was lying on my bed listening to my music and then I was like \"what's the crazy rhythm I'm hearing?\".  Sit. Come on. I'll show you.  Just put your feet flat on the ground.  Now take the drum between your legs. Like this.  Now you want to lift the inside edge off the ground with your ankles. Like this.  Great. Feel OK?  OK. Now Walter, I know you're a very smart man but with the drum you have to remember not to think. Thinking just screws it up. OK?  Now just give it a couple of bangs.  Not so hard. You're not angry at it.  Better. Did you think?  Good. Now one more thing, Walter. You listen to classical music so you think in fours. One. Two. Three. Four. Da. Da. Da. Da. This is an African drum. So we are gonna play in three's. Tat. Tat. Tat. You have to forget your classical. Leave it behind. Tat. Tat. Tat. One. Two. Three. Come on. Follow me.  Good. Good ear. Now keep going.  Don't worry. Start again.  Yeah! There it is. OK. Good. Now keep it going and I will do this.  Yeah. That's it. Keep it going.  Hey Walter, what time are you done tomorrow?  Cool.  That's good. Because the Chinese are taking over the world.  It's already happening. One day our kids will be going to China for jobs. Ask Walter.  You see?  Hey, Walter!  How did the presentation go?  Cool. Guess what? I found an apartment in Brooklyn. We can move in on Monday.  Yeah. It's small but it's a nice building. I just hope Zainab likes it.  I think you're right. Come on, let's go. You should take off the name tag.  Yeah. I'm starving. Do you like shwarmas?  Shwarmas.  Here. This is for you. For letting us stay.  It's Fela Kuti. You know him?  You don't know Fela? Oh, man! Walter, you are in for a treat. He started the whole Afro-Beat movement. And his drummer Tony Allen was just scary, man. You want to play drums, you have to listen to this.        Au revoir.  The Lebanese. Bunch of playboys. You ready?  Zev!   How are you?  Hey honey.  How's business?  Her stuff is great, right? She made me this?  You should make one for Walter.  So Walter and I are going up to the park to play for a little bit. OK?  I know. I know. No problem.  I know. I will not be long. We'll go up and play and then we'll come back to help you. I promise, habibti.  No. Not Arab time. Real time, habibti.  Habibti? It means \"beloved one\".  He's been playing here for a long time.  I have no idea but it's cool. I always wanted to play down here. It's supposed to be good money.  Maybe some day we can do it together. Split the profits.  What do you think?  Come on, Walter.  It's easy. You just wait until you feel it. Let's go.  Shit, we have to get home. Zainab is gonna kill me. I'm on Arab time again.  It means I'm late by an hour. All Arabs are late by an hour. It's genetic. We can't help it.  That's our train!  I got your drum. My card is empty. Can you swipe me?      What are you doing?  Please, what do you want...  I did not jump it! I paid. I paid! It just didn't work.  No.  Syria. Why?  Why? I'm sorry. What did I do?  Walter take the drum. Tell Zainab what happened but don't let her come for me. I will call you.  Don't let her come! I will call her!  Walter. Thank you for coming. 54  How is Zainab?  You can't give it to me. It has to be sent to me by mail. But you can put it up to the glass.  Go ahead. Open it and place it up to the glass so I can read it. It's OK. It's allowed.  Thank you, Walter.  OK. The place is very depressing. There is no privacy. The lights are always on.  No. I just want to get out of here.  Yes. What did he say?  You mean when we came here? Yeah.  Yeah.  Yeah. We did everything they told us to.  Hey, could you tell Darren? I didn't call him.    Good. And tell Zainab I will call her as soon as I can. 56  Goodbye, my friend.  We did. I remember it.  No. He didn't know yet. He just said that unless he can find a way to reopen the case quickly they're going to deport me.  No. I don't want her to worry. I can handle this.  Yeah. Three years ago I was working for some guy who said he was going to sponsor me for my green card but then he turned out to be jerk. But the lawyer said that might allow us to reopen the case. I don't even understand it.  Walter, there are guys who have been in here for years! I can't do that Walter. I'll go crazy.  OK. Just please...don't forget about me in here.  Are you still practicing?  You should go back to the drum circle.  OK. But listen to that Fela CD. That will help you, I promise.  So show me what you've been working on. 60  Show me. On that. Come on. I need some music, man.  Don't worry. They can't arrest you. At least not yet.  Ah. There it is. Good. Good. You are getting better.  Walter, I thought you were leaving.  What? My mother?! Where?  When did she arrive?  Oh man. Why did she come? She can do nothing for me.  Walter. Listen to me. She can not stay here. She doesn't know anyone in New York. I'm sorry but you must get her to go back to Michigan.   Walter enters the room and sets down Mouna's suitcase. She follows him into the cramped bedroom.      You went on the ferry?  My mother too?  Did Zainab tell you how we used pretend we arriving in New York for the first time?  You know they don't even let us outside here. They just cut a hole in the roof in one place.  Yeah. It's crazy stuff.  And they seemed to get along? Zainab and my mother?  My mother's not going home, is she?  I know she's thinking about my father. He spent seven years in jail in Syria for something he wrote in the newspaper. By the time they released him he was very sick. He died two months later. That's when we came here.  She thinks the same thing is gonna happen to me.  You know I have never seen them together. Zainab and my mother.  They keep moving people.  I don't know. I think to other detention centers. Two Moroccan guys were just moved. They had no idea. Suddenly they were just gone.  No one in here knows anything. I'm not a criminal. I have committed no crime. What do they think? I'm a terrorist? There are no terrorists in here. The terrorists have money. They have support. This is not fair!    It's just... I'm starting to wonder if I'm ever going to get out of here. I sit in here at night and I keep thinking about Zainab.  I just want to play my music and live my life. What's so wrong about that?",
        "Omar": "",
        "Barbara": "Thank you.  No, thank you.  No. Shall we get started?  Let's try it again.  Yes. Remember, fingers curved. Like a tunnel.  Don't flatten.  Make room for the train.  I said \"make room for the train.\" It's something that I tell my kids. If you curve your fingers like this... Then the train can pass through the tunnel.  Thank you. Next Tuesday at the same time?  Oh, no. Are you giving up?  Oh. OK. Goodbye.  Mr. Vale? If I may ask, how many teachers have you had before me?  Well, for what it's worth, it's difficult to learn an instrument at your age. Especially if you don't possess a natural gift for it. I'm not saying this to be mean. But if you do decide to give up then I would really like to buy your piano. It's a beautiful instrument.  Goodbye.",
        "Karen": "Here you go, cutey.  So I thought you forgot about me. Where've you been hiding?  Well you're never gonna make it on the wall with that excuse. I'm glad your back. Give a holler if you need anything. I'm just gabbing with one of my girlfriends.  When are you going?  Sounds like fun. I'm gonna go have a cigarette. You want some coffee?",
        "Charles": "Hello Walter.  I'm sorry to interrupt.  Walter, Shelley can't make it down to the NYU conference to present your paper. I'm going to need you to cover for her.  She's been put on bed rest until she has the baby.  Next week. We'll cover your class and make the arrangements.  I understand but you co-authored the paper and the Dean wants it presented. He wants to keep Shelley on track for tenure.  You're only teaching one class, Walter.  I'm sorry but there really isn't another option at this point.  That may be the case but you are the co-author and she can't go. Look Walter, you can take it up with the Dean if you want, but, as your friend, I wouldn't advise it. Not with that argument.  Good bye.",
        "Martin": "",
        "Revere": "",
        "#2": "Just step over here, pal.  Could you step back please?  Sir, stand over there. 45  Well we do. You can come down to the station and make a statement.  Sir, that's all I'm saying. Now step back or we are gonna take you in too.  Ninth Precinct.",
        "Zainab": "I'm in here! He is crazy!                    I think so. Do you want to check!?  Tarek?  Tarek?   Tarek and Zainab are lying in bed together.   Stop it, Tarek. He'll hear us.  You don't know that.  I think he's probably had enough for one night.  Tarek. No!  What are we going to do, Tarek?  I don't want to be his roommate!  No.  No. I don't love you.  No. 20  It's your punishment.  Shhh.  Morning.  Thank you.  Goodbye.  I don't drink.  Are you finished?  It's the least I can do.  You're welcome.  Tarek. It's eight-thirty.      Yes.  Yes.  Hello. Where is Tarek?  Are you OK?  What?  Yes. I made it.  Thirty-five dollars.  No. thiry-five.  Senegal.    Far.  Hello. Hi, Walter.  Tarek, I told you we have to pick up my new table today. He said he would only hold it for today. 41  Tarek. You always say \"no problem\" and then you are late or you forget.  Yes. It's always \"habibti\" when you want your way. It closes at five p.m. Not Arab time, Tarek.  Don't \"habibti\" me.  Where is Tarek?  What?!  Arrested?!  How could this happen? He knows better! He would not do anything wrong.  No. It won't be OK.    Well?  To where?  I can't visit him or I will end up in that place too.  Yes. We are going tomorrow. The appointment is at eleven. I don't know, he found him. What? No. I don't want to. I just don't, Tarek. Yes. I've already called him. I know. I know. I just want you to be here with me, Tarek.  Yes.  Yes. I know.  Almost a year.  His mother lives in Michigan.  Yes, she is.  No. Tarek told me not to tell her. He doesn't want to worry her.  No. He has had no trouble. He is a good person.  Yes. When he first arrived from Syria. But he didn't get it.  Seven years ago.  I don't know.  They had to leave Syria! They had no choice!  Did you ask him if he went to his hearing?  Walter, I'm going to leave now. I have a cousin in the Bronx. I will stay with him for now.  I think it's best if I leave. When Tarek calls me then I will tell him. You know how to reach me if you need to. Is it OK if I leave Tarek's things here for now? My cousin's place is not very big.  Walter?  Oh.  It is a pleasure to meet you, Mrs. Khalil.  OK. I'm sorry. I did not know you were coming.  Thank you.  Yes. I would like that. But I have to watch my table.  I'm living with my cousin. He has two kids. And his mother. I mean his wife...I'm sorry, I am very nervous.  I don't know. Have you spoken with Tarek?  I wish that I could see him. Just for a minute.  Two years. I was in detention when I first arrived. Three months. It was horrible. I would probably still be there but they closed the facility for poor conditions. They released some of the women on parole because we were...low risk. I met Tarek one year later. I am sorry for what happened with Tarek. I hope you do not blame me.  Tarek was doing nothing wrong. I miss him so much. I don't know what I am going to do without him.  He did?  What?  Like what?  OK. But maybe we should get Walter first.  I don't know. We never got off. We just would go to the other side and then come back.  It's free. And it felt like we were going somewhere.  That is where the towers were. I never saw them but Tarek did.  And over there is the Statue.    And behind that is Ellis Island.  Sometimes Tarek would point at the statue and jump up and down like we were arriving to New York for the first time. It was very funny.  What facility? Where?  Louisiana? Where they had the floods?"
    },
    "imdb_rating": "7.6",
    "description": "Lonely widower Professor Walter Vale has a boring life in Connecticut. He teaches only one class at the local college and is trying to learn how to play the piano, despite lacking the necessary musical talent. Walter is assigned to attend a conference about Global Policy and Development at New York University and give a lecture about a paper he co-authored. When he arrives at his New York apartment, he finds Tarek Khalil, a Syrian musician, and Zainab, a Senegalese street vendor, living there. He sympathizes with the illegal immigrants' situation and invites the couple to stay with him. Tarek invites him to go to his gig at Jules Live Jazz. Walter is fascinated with his African drum and Tarek offers to teach Walter how to play it. However, after an incident in the subway, Tarek is arrested and sent to a detention center for illegal immigrants. Walter has just hired a lawyer to defend Tarek when, out of the blue, Tarek's mother Mouna arrives at the apartment from Michigan. He invites her to stay in Tarek's room, and while trying to get Tarek released, Walter and Mouna get close to each other and he finds reasons to feel life can be exciting and worth living again.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "name": "The Visitor",
    "genres": [
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTIzNTg3NzkzNV5BMl5BanBnXkFtZTcwNzMwMjU2MQ@@._V1_QL75_UY281_CR1,0,190,281_.jpg"
}