{
    "filename": "Pacifier,-The_script.txt",
    "imdb_id": "tt0395699",
    "imdb_url": "https://www.imdb.com/title/tt0395699",
    "characters": [
        "Shane Wolfe",
        "Seth Plummer",
        "Howard Plummer",
        "Julie Plummer",
        "Director",
        "Zoe Plummer",
        "Lulu Plummer",
        "Capt. Bill Fawcett",
        "Helga",
        "Principal Claire Fletcher",
        "Peter Plummer (as Keegan Hoover)",
        "Peter Plummer",
        "Vice Principal Dwayne Murney",
        "Baby Tyler Plummer"
    ],
    "dialogues": {
        "Shane": "Lieutenant Shane Wolfe, United States Navy. I'm gonna get you outta here. But you have to do exactly what I say, when I say it. My way -- no highway option. Do you copy? Where's the briefcase?    Hold on.  You know how to swim?  Better keep that on `til we get to the rendezvous point.    Negative. Not imperative to the mission. We have to keep moving. I have strict orders to get you out of here safely.    Negative.  We're almost ready.    Just gives us a -  Professor, RUN!!!  Captain, sir.  ... I know sir. And I except full responsibility for the mission's failure.  He had to call his family. A lapse in judgement on my part that I regret sir.  The case was empty sir, as I stated in my report.  Sir. Thank you. I... appreciate your confidence.  I'll need to put a team together. I'm gonna need the mini sub, I need access to an EP3 aries 2 spy plane...  That's it? Why would you want me for that, sir.  Sirnosir. It's just that... I've never been very good with kids, sir. Not even when I was a kid sir.   Shane packs his duffel bag. He opens a drawer: There's five t-shirts, identical to the one he wears. He opens another drawer: Five khaki pants, also identical to the one he wears. He opens the closet: There's a massive fur- collared coat. Hm. He rejects it.  Shane packs his duffel with military gear: GPS compass, night vision goggles, camouflage vest, machete... they all go in. Shane heads to the door, then goes back to his chest of drawers. He reaches in, and pulls out a small, old MEDAL: the ribbon is faded and frayed. He looks at it for a moment, then unzips his suit and pins it to the inside, like it's a lucky rabbit's foot.            You have a pleasant family, ma'am.  Mrs. Plummer, I have to tell you that I did everything I could...  Nothing will happen to your family as long as I'm here. I've dealt with much...  Mrs. Plummer-  ... Mrs. Plummer, I'll go secure the perimeter.  Don't worry. They'll be safe with me.  ... No.  Could you turn that dow-  Hey-  ... Where's the baby?  You run a very loose ship.  So you're the one who broke in. Zoe -- go back inside.  Not with this kid.  You -- Gimme twenty!  I meant PUSH-UPS!  My apologies. We had an intruder. A simple misunderstanding.  Oh. Sorry.  Sorry.  Your mother thought you were in real danger. You should have told her the truth.  Not anymore.  Lights out.  This family's in for a rude awakening.  You're burning daylight. Move.       Move.  Now move it!  Hey. Not in front of the kids.  Usca mi-as chilotii pe crucea lu mata!  Listen up, ladies. Your behavior is unacceptable. In order to maintain a state of safety we need to maintain a state of discipline and order. I've only got one rule: Everything is done my way. No highway option. Do you copy?  What?   I said -- do you...  Do not copy me!  Tracking devices. Now that I know I can't trust you... Never take them off. The panic button is only for emergencies. Touch that -- you better be dying, or you're dead.  Let me explain how the chain of command works. I tell you what to do -- and you do it. End of chain. Now I'm not gonna have time to learn your names. So you are --  Red 1, Red 2, Red Leader, Red baby... wait, where's the older male? There were five.  Red 4!    Open this door!  It didn't have to go down like-  All I need is a hammer and some plaster of Paris. I can fix this.  Here's your bracelet. If you'd been wearing it, this wouldn't have happened.  Hey, hey, good soldiers aren't afraid of anything.  Really?   And where is this ghost?  Red Leader, remain calm --  Let's not be hasty.  Hello--- Don't even think about it.  Ah, Mrs. Plummer. No no -- everything's fine. You're gonna be gone how much longer?  Five business days?  That is not a problem. Just doing my...  Duty.  Ah! Things are GREAT!!! You do what you have to do.  Take care, Mrs. Plummer.  Red Leader! I command you to come back! That is a direct order! You can't leave a man behind!!     His jaw drops in disbelief. He drops his head, defeated. Then -- he slowly glances up.    Rises, takes a deep breath and strides inside.   Okay, listen up. There's been a change of plans. Your mom's not coming back as soon as she thought...  Soon. In the meantime, we're just gonna have some more big fun.  Whoa, WHOA! HALT! We'll take this hill one inch at a time. Only then can we rise to the challenge. All for one, and one for all!  That's Army. I'm Navy.     But I appreciate your enthusiasm.  Tell me that was the duck?  Hey.   HEY!   He gulps.   The things I do for my country.    Affirmative.  None of your business.  I think -- it's time for you take a nappy- poo, in beddibye land, little girl.  What are you waiting for?    Dig in.  Don't worry, I can get lots more of those. And I've survived off this stuff for months.  Okay, ladies. Your mama -- is not here to take care of you now. So -- here's how it's gonna be. We're gonna pull together, all for one, one for all. If I say in, you stay in, if I say out, you go out...  I did not say at ease!  You play too many video games. Yes.  Negative.  Plummer residence... yes, I know it's Monday. Oh. Thank you, sir.  Your vice principal. He said if you're late again, you and Todd are expelled. He wants to see you in his office. With your ... legal guardian.  Not on my watch.  Wolfe. Shane. Lieutenant. I'm in charge of watching these kids for... a few days.  Red 1, Red 2. Get moving.  Bodyguard. You see, Mrs. Plummer called my captain, she thought the kids needed -  ... You're kidding?  \"Honor, Courage...  Can't be too careful. So. Permission to stick around and keep eyes on the kids?  No one will even notice I'm here.  Clean as a whistle.  Back off. Official Business.  Give up now. Save us both a world of pain. Now -- last time: Open the hanger, Black Hawk coming in.  Open in T minus three, two, one...  Show no weakness.  ... Sure.  Hey -- I out rank you, you know.  Oh, man...  ... Nice moves, man.  ... Sorry, sir. I'm on duty.  I'd love to, for one who'll eat, and not cry.  Oh -- change him. Roger that. Uh...  But...  Emergency!  Thanks.  Tell me where the kids are and I'll let you all live!   He's alone. He catches his breath, then checks his tracker. Todd and Zoe's BEEPS are coming from a MANHOLE.  Shane pries off the manhole cover.    He looks down.  IN THE MANHOLE - It's dark and dank.  No sweat. Shane lowers himself down.   Red 1?   Red 2?    Who are those people?  Get rid of them.  Selling cookies isn't imperative to my mission.  Alright, ladies. Here's how it's gonna be. Tonight, I'm gonna be your den -- commander. That means if you want to live to see tomorrow, do as I say. DO WE  Good. Now -- wait here.  I gotta get supplies. I can see you through the window, but if anything happens...  Where are my troops?  What happened?  Well?  Well then -- I'm afraid I have to eliminate them. If I don't come back -- avenge my death.  This is not a toy. I'm here to protect you. Not cookies. Get in the car, we're going home.  Where?  I wish I were in Chechnya.  In a big glass    This much ice... this much cyanide.  What?  I'm watching your brother...  That's not fair. Nobody can jump thirty feet.  That wasn't a documentary.  This isn't fair. My joystick's broken.     Move, move, move! Go go!  Inexcusable, to leave a man behind like that...  Clear out! GO GO GO!  Party's over.  No one leaves until this house is spotless! I want to be able to eat off the floor! The latrine! Hell, I wanna be able to eat in the kitchen!!  Oh no you don't. Now, we're gonna do this my way -- no highway option.  Start swabbing, ladies.  Those people aren't your friends. They show no respect for you or your house. Because you have no respect for yourself.  You got barf on your tank top. Company, downstairs!  You're right, Red 1. I'm not the man for this job.  In all my years I have never been treated with such disrespect. Not even from the enemy. Don't worry, as soon as your mom comes back, I'm gone.  Now what?  Puberty... talking doesn't do any good. Go to your rooms.    Okay -- who wants some?      He squints, blinded. The cloud dissipates... and Shane sees he's now alone. He runs to the broken window.   Kids.   It's safe. You can open up.  I'm not going anywhere.  Shhh... It's okay.  They're looking for a program, that your father invented.  They're not after you. They want this. But nothing's gonna happen to you, as long as I'm here. And I'm not going anywhere.  But I can't do this without your help, okay? We need a little more cooperation here.  Tell you what -- let's start over. From now on, you listen to me, and do what I say. (to Zoe and Todd:) And I... I'll listen to you too. Deal? Truce -- okay?  C'mon c'mon c'mon...  Mrs. Plummer... two men tried to get into the house tonight.  No - it's okay. They're gone, everyone's fine. They were looking for GHOST, but they didn't find it. You have any luck?    I gotta warn you guys: From now on, I'm gonna be sticking even closer.  Don't worry. So, she wrecked a driver's Ed. car -- she'll pay for the damage...  Red two? I mean Todd?  Has he been skipping class?  He's not a NAZI.  I'll talk to him.  Another time, maybe...  Did you kick me in the back? Is there a footprint on my jacket?  Wait Todd, I want to talk to you...  Smart kid.  Zoe, you're in charge. If anyone gets within forty clicks of the perimeter, signal me. Keep all doors sealed, do your homework, preheat the oven, and make sure Lulu brushes her teeth!  You want in or out?  No. My hands are freezing.  AT EASE.  Would you listen, just once? Look, I don't know a hell of a lot about this kinda stuff, but... You're good. A lot to learn, but with hard work, discipline -- you could make a go of this.  That guy's an idiot.  \"Sound of Music\" is a great show. My dad took me to see it when I was a kid.  Come on. Julie Andrews was hot.  You know what girls think is weird? Wrestling. Men in leotards pinning each other to the floor? I've never understood that. Chicks dig guys who can dance.    No director? I have directed rescue missions in Afghanistan! I've directed numerous snatch and grabs in countries who's names you are not allowed to know. I have choreographed multi-pronged amphibious landings and stealth air attacks! Do you think I have the stomach to whip this production into shape, or not?   ... What's up?  I don't see what you see in this guy.    Okay. I promise. I won't touch him.  Okay. Let's see. Once there was a family of Elves.  One day, the little Elf family -- Uh. Went into the magic forest. To find a secret gnome... facility, where gnomes where turning mushrooms into... Uranium. The elves had to go in and take it out.  They were ordered to. By the Elf Unit commander at Elf station bravo. So -- they waited for cloud cover, and they came in from the north...  The Elf Team decided on an L Ambush -- so three elves formed a base leg and laid down a heavy suppressive fire on the gnomes while the others maneuvered around to the right flank and walked through finishing off anything left alive... I mean standing...                    D  ... And not one Elf got left behind that day. We got `em all. Even, the teeniest little elf of all -- Rodriquez.  Oh, c'mon... I can't remember that thing.  When you're down and low, lower than the floor. And you ain't got a chance. Don't make a move `til you're in the groove, and do the Panda Dance...  Just hop three times like a kangaroo -- Sidestep twice, just like the crabs do.  Take three steps forward and one step back...  What are you looking at?  Today you drive.  Exactly.   Do you know what causes most accidents? is that you keep an absolute focus on...  THE ROAD! Don't look at me...  No. Keep going. I trust you.  Good. Next lesson, 1500 hours.  I know 437 ways to hurt a man without touching him. Broken promises lead to broken legs. Do we understand each other?  Wow.   I'm glad I never had you for a CO.  Thanks.  You look nice today.  You said you wanted to wrestle. You win. Let's do it.  I'll be sure to lock up when I'm through.  Dislocated nerve, that's all. He'll be fine in  two months.    If you're ever lost in the woods, the first thing you have to do is find a source of drinking water! And make sure it's potable. If you're not sure, boil it for thirty minutes!  You have to eat, right? Well let me tell you you're not gonna find Girl Scout cookies out here.  No brownies   either. A lot of roots are edible. So    is some tree bark. When I HALO'd into   Rwanda, I lived off the underground   fern stem for three weeks!  Insects. They look nasty but they're full of nutrients that may save your life.    Okay -- we'll put Von Trapps here, here, and... here at the top of the stairs. Now the Nazis are gonna come in, this way -- and the Von Trapp is set...  Why don't we just let the Nazis win tonight -- huh? Now. From the top -- think of yourself as a gazelle prancing over the plains. Graceful.  Gazelle.   Prancing. Graceful.   Again.  Don't touch that dial sleep for a while -- HEAAAY! And say good night, Peter Panda.  Good night, Peter.  I'm not your daddy, Peter. But sweet dreams.  That's my troop.  Sound off!  It's all in the wrist...  What's wrong... Scott?  How long you been together?  That's longer than any relationship I've ever had.    This was my dad's. He was the only family I ever had. Mom left when I was little, cause dad was always gone. Two years in... an indisclosable locale. Another six in... Another indisclosable locale. I didn't really have a home, so I went to military school -- then one day my mom got the letter. No more dad.  I always wanted to be just like him. I'm starting to realize, I never really knew him. I don't know if I'm like him or not.  The hardest part was living without any details...why? How? Where? I always wondered if he thought about me.  You could say I just shut down my emotions. I turned off all feelings and dedicated myself to becoming the perfect soldier.   He's left alone.   Just another assignment. No reason for personal attachments.  Hey Gary, your wings aren't clipped. How come you don't fly away?  I guess you've got it good.    Kids to play with. Three squares a day.  All quiet on the western front. I guess I better fix that Playroom window.  What happened, Gary?  What do you suppose this is?  Sir! Excellent news. I think I found  No. It's in a steel vault. I've been trying all night, can't crack it, sir.  One things for sure. After we turn this in to my CO, whoever's been bothering you guys won't be bothering you anymore.  What's wrong, Lulu? You should be happy.   He goes silent.    Tongue-tied, he has no answer.   You guys better get ready.    Your mom should be home soon.  Captain.  That's kind of you, Sir... But I'll have to think about it.  Sir, all I've never known is the military. At nine years old my father put me in cadet school and from there I never looked back. Don't get me wrong, I wouldn't trade it for anything and I have no regrets...  But being with these kids has made me feel like there's more to life than taking out your enemy. And I think I want to explore that some more.  Mr. and Mrs. Chun?     They checked out-    Lights out. He turns, startled, and starts to fall. Disoriented, confused, he looks up as he drops...    He is losing consciousness. Things are spinning... woozy.     Bill, don't hurt the kids.   They look over -- Shane is standing in the doorway.   I know the code. I'll get you in... just please don't hurt anyone.  Anybody got any perfume?          Hair spray... breath freshener...  Zoe, Todd, Lulu, Peter, Tyler!  The key is the kid's names. Watch.  But... That was the code! I swear! I saw Plummer use it on his briefcase.   Shane's thinks. He notices a GROOVE carved in the floor, not quite centered to the room. He feels the Groove. Something she said...       Just hop three times like a kangaroo --  Sidestep twice, just like the crabs do.  Three steps forward and one step back.  Wriggle like a snake `til you can't no more. Then better jump quick, like there ain't no floor.    And that's the Peter Panda Dance.  I was devoted to you, sir. And you betrayed all of that. All that we stand for.  There will be no mercy.  You're a... terrible neighbor.  ... Say, good night, Peter Panda!   Whoa, WHOA!    What are you doing to these kids??     He breaks into a big grin.      Just doing my job.  Well. I'm kinda, re-conning the situation, here... And to tell the truth. I don't see anything but reasons to stay.  ... I don't know. I'm on dry land. You're the superior office. You tell me.  Sir yes sir.  Ah, come here you.  He would've wanted me to give it to someone I care about. Like he did. Thank you. For everything.   This is too much.    He wipes his face.   Your dad would be so proud.  What are you talking about?      I'm gonna see you Friday night.  Tonight is the night we trained for, and failure is not an option! No detail is too small! We are the BEST! Remember your lines, hit your marks, and stay in character! I expect perfection!    YESSS!  Huu-ah!",
        "Wolfe": "",
        "Seth": "",
        "Plummer": "How did you know where I...  Oh my God. I can't believe you... how'd we... That was the most incredible...     It's warm and quiet.   Petite Julie SCREAMS up the stairs-         Julie, with her suitcase, Shane, Helga and the Kids stand in the doorway. Zoe listens to her I-Pod ignoring the hug Julie gives her.    The yard is littered with toys. In the middle is a TRAMPOLINE. He spots the Figure climbing the TRELLIS. Shane runs, jumps onto the trampoline. He flies in the air and latches onto the figure. They both tumble to the ground.  Shane yanks off the DARK FIGURE's hood, revealing SCOTT a nervous teenager. He's dazed, but alright, wearing SHARPER IMAGE night vision goggles.    blares from Todd's room.    The sun rises over the neighborhood, warm orange light.     Helga, suitcases in hand, heads to the door -- Shane tries to block her path. Peter's in the aquarium. The duck flies around, QUACKING.    Principal Claire sits with the Kids in the living room. From outside, they hear the front door open, and the sound of OMINOUS, SQUISHY footsteps.  Then the door swings open, revealing Shane, looking like a Swamp Creature. Everyone gasps, then covers their noses. A CUTE YOUNG COP enters behind Shane. Todd stiffens. Zoe fixes her hair. The Cop looks at them.    Zoe's on the phone, the Zhouse is quiet.    As Zoe hangs up, we WIDEN OUT: The house is PACKED with TEENAGERS: they're keeping quiet until the phone is in its cradle, then the TEENAGE DJ starts the music back up.  Zoe looks around at the mess. She turns to Scott, who doesn't seem concerned at all.    Shane is exhausted, as he pulls up in the Minivan. He gets out -- and groans in disbelief. It's insanity: HIP HOP blasts, gyrating TEENAGERS everywhere, chugging drinks, making out, peeing in the bushes, jocks throwing footballs.  Reeling, Shane takes Lulu, Peter and Tyler up the path. He protectively guides them past the craziness -- until a football suddenly WHIZZES by. Outraged, Shane snatches it mid-air -- then CRUSHES the ball. POP!     Inside is worse, a total wreck.   Zoe's dancing with Scott.  Shane drags the needle across a record at the D.J.'s turntables. Everyone recoils from the horrible sound.    Shane inspects the house, as kids clean. Shane wipes a finger down the sofa. Clean. He lifts the sofa, and rubs his finger UNDER IT. He holds it up to a KID... residue. The Kid quickly starts cleaning again.  A GIRL reorganizes a stack of CD'S. Shane goes over them, straightening -- then he notices something. He pulls out a CD: It is a home-burned disk, labeled with a Sharpie. It reads: GHOST. Oh my god...   Two DARK CLAD FIGURES watch, through binoculars. They see Shane find the CD, and walk out of sight.        Shane quickly tucks the CD into his pocket.    A long line of exhausted party-goers files out. Scott's the last one to leave.    Shane works his way through the house. It's SPOTLESS: counter tops glisten, furniture polished. It looks like Better Homes and Gardens. He heads upstairs. Zoe blows past him -- into the bathroom, where she throws up. Shane sits down, outside the bathroom door.    The minivan pulls up, with Shane and all the Plummers piled in. Shane parks, Todd runs towards the house. Shane holds Todd back by the arm.    Shane's patrolling the hallway. He hears Zoe in her room, BREAKING something, angrily. He peeks in -- just as Zoe THROWS her cell-phone into the wall, furious.    As Mr. Chun gets his paper, Shane, (Tyler in the snuggle), hands out bag lunches as the Kids load into the minivan. Shane turns and catches Mr. Chun, staring.    Shane leads the Brownie Troop through Combat exercises. In unison, the Girls PUNCH, KICK. PUNCH, PUNCH, KICK. Shane's got Tyler's cradle next to him, in between punches, in perfect tempo, he reaches out and rocks it. The Duck watches all this -- fascinated.    Lulu, in   her BROWNIE uniform, ties a complicated knot -- we WIDEN   to see she's tying Shane's hands behind his back, as   the Brownie troop watches. He counts \"1,2,3...\" and then   begins wriggling free. They watch closely.    Shane has the Brownies assembled. He's attached SOFA CUSHIONS to himself. The Brownies attack, mercilessly.    Shane works his way down the hall, checking on the kids:    Shane is on the floor, sliding forward, nervously.        The minivan races toward the house.   The Police Cars chase after, SIRENS wailing.  IN THE VAN, everyone is SCREAMING.       F.B.I. AGENTS swarm the area. Bill and the Chuns are being hauled away in cuffs. Julie huddles with the kids. Shane talks with an F.B.I. Agent.   Claire walks up to Shane. Mock-angry.",
        "Howard": "",
        "Julie": "Of course. I'm so sorry.   Thank you for coming.  Come in and meet the rest of the gang.   Get your butts down here and say \"hello!\"  You've already met Lulu. This is Peter, Zoe and Todd. Kids, this is Lieutenant Wolfe. He's the man who is going to be staying with us for a while.  And this is Helga and Tyler.  Kids, go finish your homework.   And I'll be checking.  Charles wasn't around too much. His work took him all over the world. He'd be gone six or seven months at a time. So I think for the younger ones it's a little confusing. Zoe and Todd... well, they're dealing like your normal teenagers. Maybe in Todd's case semi-normal.  Charles was in a dangerous business. I knew it when I married him. No one's to blame here. Everyone thinks that Charles told me or the kids where he hid it. And until G.H.O.S.T. is found, we're all in danger.  That's Gary. He was Charles'.  Call me Julie.  I'm glad you're here-  What is it?  That's wonderful. This could all be over!  I'll be there.  Don't worry about the Kids, Helga will handle everything.  But if there is an emergency, all the emergency numbers are on the fridge. And on the phone. And on the back door...    Lieutenant, I don't want you to worry about anything except the safety of my children. Helga will take care of everything else.  Can't you call somebody? Do something to get us around all this paperwork?  Thank you. How long is that?  I'm a mom, it's my job to worry.  It's only a few more days. I hate leaving you, but you know I have to do this. I love you.  Oh my god!  Well, yes and no. We found something in the box... But we're not sure what it is. Bill thinks it's part of the GHOST. It looks like some kind of \"key\". We just don't know what its for.  The good news is I'll be home in two days, as soon as the customs paperwork clears.  The red tape is cleared up, we're on the first plane in the morning.   Julie opens the door, comes into the dark hall. Bill is carrying her suitcases.   I had a fight with Zoe when I left, so they probably trashed the place...  I trusted you. Charles trusted you. So did the Department of Defense.   Keep going!     RUN! Go GET HELP!!!  How does what work?  I don't know any code -- Charles didn't tell me about the room...   You can't make him do this -- He doesn't have a chance.   Shane!   Watch out!  Thank you Shane. It's finally over. Now we can go back to our peaceful...  What's Friday night?",
        "Director": "Okeydokey. Starting from where we left off Gimme Rolf and Liesl -- let's give You are Sixteen a run up der flagpole...  Baby Jesus, have I done some unspeakable evil that I deserve to be saddled with the world's worst production of Sound of Music?  We open in a week. The set's not finished... The cast is a bunch of clumsy goats -- every kick ball change would make Bob Fosse dig himself out of the earth, so he could have a heart attack again.  None of you will ever get it right! Which is why, I quit.  And with that, he exits stage right... end scene.",
        "Zoe": "Mom -- we'll be fine, chill.  He's my boyfriend, tool.  Okay, fine... come on Scott.  Who do you think you are -- my dad?  Let me go! It's Saturday night.   I have plans!  I am not wearing that. Just because my mom's paranoid doesn't mean we have to take orders from you.  He's in his room.  He has to go.  Here he comes...!   They gulp, terrified.   Uh-oh.  I need a signed release for Driver's Ed!  Like I'm really gonna eat all those carbs.  He's only two, he doesn't have any idea what you're talking about. I don't have any idea what you're talking about...  Who was that?  Kick his butt, Todd!  ... yeah, he's a total psycho. I think mom found him from one of those Tough Love boot camps or something...   Shane's finishing up the last window.   This is totally cruel and unusual! You can't do this -- we could run out of air!   Inside, Zoe picks up the phone, hits speed-dial.   .. he's got us on lock-down, it's like  Mom -- stop worrying.  Seriously, everything's cool. The guy's just a control freak.  I know. Don't worry, we're okay. Tonight I'm just doing homework -- in my cell.  Dude, this is outta hand. Who are all these people?  Dude, not cool...  It was YOUR idea! I don't even know most of these losers.  ... Thanks a lot, Rambo. My friends will never come here again.  I do too respect myself.  You're not my dad!  We hate you, you hate us. You're like a robot. Why don't you just leave us alone?  It's Scott...  I'm sorry for giving you a hard time.  So Mom's not paranoid? There really are people out to get us.  Hey mom we're fine, absolutely nothing happened you should worry about. Nope.    It's just nice to think someone's thinking about you, you know?  ... No wait! ...What are you gonna do? You're not gonna hurt him are you? Promise you won't touch him.  But -- I can't even pass driver's Ed.  Have you given a driving lesson before?  What?!?  You wanna drive?  Ha ha ha. Very funny.  Don't worry.    I'm not gonna jump.  o. Scott's fine. I don't know what you  A month...  You're okay, Shane. I'm not used to anyone giving me the benefit of the doubt. My teachers don't trust me. Mom doesn't. My dad didn't care about us, he was never here...  I miss him so much...  That's horrible, Shane.  Mommy's coming home! Mommy's coming home!  Tomorrow morning!  Welcome home, mom.  Hurry!   C'mon! Buckle up!!  What's taking you?  Come on. Use the gas, not the brake, 5-0.  People are trying to kill us. They have my mom, and our bodyguard -- you have to follow me!  Fine. Don't follow me!  Hey, I'M the one in Driver's Ed!    I think I know what I'm doing!!  But, officer...  If you're reading this, then Julie found the key. Julie, Tyler, Peter, Zoe, Todd, Lulu -- I want to say: I love you more than anything. I always have.  But...",
        "Lulu": "Mom! There's some weird bald guy at the door!  Do you copy?    Stop it, Peter!  This house is haunted. Daddy even said so. He said there's a ghost.    But tomorrow's a school day.  I've got Brownies!    Hi. Zoe thinks you look like the Hulk. I think you're cute.  Do you know Kung Fu?  Did you ever punch someone so hard that their head came off?  What's that medal for?  I'll trade you a SpongeBob button for it.  Is that so people can't hurt us?  Do I look like I'm five to you?  Can you kill a man with your bare hands?  ... I can cross my eyes. Wanna see?  Tyler hates it when I do that...  We're gonna be late.  See! My nanny can kick your nanny's butt.  It's my troop, it's Monday. Monday, Wednesday and Saturday are troop nights.  I can't. Everybody's parents go out on troop nights. They won't be home `til ten. Mom's our den mother.  Tonight we're supposed to sell cookies.  We have to. If we don't sell enough cookies, we can't go the Jamboree, and if we can't go to the Jamboree. Come on, Shane. You gotta help me out. They already think I'm a loser. And it's not like I have any other friends, cause mom never lets me out of her sight...    Those boys over there broke our cookies.  Let's fight!  I pressed two player. I thought you liked combat. Unless you're scared.  Prepare to be annihilated!  The Hulk can.  You wanna switch?  You're not even trying...  Too slow... come on -- take a shot... oops too slow... swing and a miss...  In your face! I am the greatest hand-to- hand combat champion in the entire world!  Should we send someone in after him?  Shane --!  Please don't leave us Shane.   The TEACHER shows the children how to dye Easter eggs.  ANGLE on Lulu, making a mess of an egg.   She smiles.  ANGLE on Shane, squashed at a little desk.   He dips an egg in some purple dye.    The TEACHER hangs a series of cute \"Turkey Hand\" drawings above the blackboard (the kind where your fingers make the feathers). She hangs one of a HUGE HAND, and smiles at Shane, who sits in the back, sunglasses on. Shane nods, \"yeah, I know it's good.\" Then...    Shane tucks Lulu into bed.   We're Brownies.  Go away and we won't hurt you.  Uh oh. You're gonna have to pay for that.  From now on, you do things our way -- no highway option!  But, Shane -- does that mean you'll have to go?  Hi ya!  Look out Zoe! Rollers!  Do you have to wear that thing in your ear all the time?  Does it itch?  This is it. Your work here is through. Guess you have to go now...  Shane, we're never gonna see you again!",
        "Helga": "Everything will be fine, Mrs. Plummer.  Tell me, are you licensed to kill?    You don't like it? You're the SEAL. You do something. I make bottle.  Sidestep twice, just like the crabs do. Three steps forward, one step back.  Then quick like a turtle lie on your back! more.    What's it matter? Nobody speaks Romanian.       AGGH!     These brats!   Sugi Pula!  I am calm. I QUIT, that makes me calm!",
        "Peter": "Whhhoooooo!  Ba ba do the hokie pokey...    Mama!  Wheee!"
    },
    "imdb_rating": "5.6",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTE5MTcxOTQxNl5BMl5BanBnXkFtZTYwMzk3Nzg2._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "After a Navy SEAL fails to rescue a scientist who developed a top-secret device, he is assigned to guard his children while searching for information on where the device may be hidden inside their house. Along the way, he must cope with rebellious teens, childcare, an overbearing school official, and foreign spies who are also looking for it.—Disneyfication",
    "name": "The Pacifier",
    "genres": [
        "Action",
        "Comedy",
        "Drama"
    ]
}