{
    "filename": "Relic,-The_script.txt",
    "imdb_id": "tt0120004",
    "imdb_url": "https://www.imdb.com/title/tt0120004",
    "characters": [
        "Dr. Margo Green",
        "The Mayor's Wife",
        "Bailey",
        "Dr. Zwiezic",
        "Mr. Blaisedale",
        "Dr. Greg Lee",
        "Tom Parkinson",
        "Mayor Robert Owen",
        "McNally",
        "Mrs. Blaisedale",
        "Dr. Albert Frock",
        "Dr. Ann Cuthbert",
        "Lt. Vincent D'Agosta",
        "John Whitney",
        "Det. Hollingsworth"
    ],
    "dialogues": {
        "Bailey": "Uh, Vince.  Sorry.  This won't wait.  There are a couple of kids who were lost yesterday near the site of the murder.  Claimed they saw a monster. They're pretty determined to tell you their story.  You want to see them?  Should be there any minute.  They came out a side door a while ago. Said the exhibit's clear.  McNitt's headed back to spell you.  I know.  You can go home if you want to.  I'll come relieve you myself.  He called a minute ago looking for you.  He starts vacation tomorrow and he wanted out.  I said you were on the way.  He could split.  Any sign of a green-eyed monster?  Above you!  Look out!  Manual overrides aren't working.  I'm getting nothing, Lieutenant.  I'm in.",
        "Dr.": "Hello, Margo.  Sorry about the mess.  You're late, Vince.  Oh yes!  Who could forget.  Afterwards you sent me that amazing case of Chateau Lafitte.  Lovely bouquet.  After our last case, Vince took me out for a draft beer. As I recall we split the check.      Caucasian male.  Age about 27.  Blond. Height well I can't give a height because Mr. Beauregard has been decapitated.  The state of the body is such that other identifying marks are out of the question.  There are numerous lacerations proceeding from the left anterior pectoral downwards through the sternum and terminating in the abdomen.  This is a massive wound, two feet long and a foot wide.  The head has suffered severe trauma and the occipital portion of the calavarium has been crushed and removed.  It almost looks like...    What are we talking about here?  Right. The entire brain appears to have been extracted.  May I see it, please?  Curious.  There's something missing.    Okay.  One saliva test.  Now... let's look at these lacerations.  They start wide and then converge.  Too extreme.  Perhaps some kind of weapon.  I'm now probing the wound and... there's a piece of foreign material deep in the muscle, lodged on a rib.  Photograph.  It's a claw.",
        "Zwiezic": "Okay.  One saliva test.  Now... let's look at these lacerations.  They start wide and then converge.  Too extreme.  Perhaps some kind of weapon.  I'm now probing the wound and... there's a piece of foreign material deep in the muscle, lodged on a rib.  Photograph.  It's a claw.",
        "Blaisedale": "",
        "Tom": "",
        "Parkinson": "",
        "McNally": "",
        "Mrs.": "Don't run, children!  Stay with your partner and do not run!  If anyone runs they will be sent back to the bus!  Henry!  Larry!  What did I just say! You walk right this minute!  Did you hear me?!",
        "John": "",
        "Whitney": "",
        "Det.": "",
        "Hollingsworth": ""
    },
    "imdb_rating": "5.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNjQyMWQ0MWItY2QxZi00NjQ5LTk3OGQtZjU4NTljMjY1ZWJmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "A detective is puzzled after recent spate of deaths involving decapitations. He visits a museum when a new victim is found murdered in the same way. In the museum, he encounters an evolutionary biologist who herself is puzzled after discovering a mutated beetle that possesses both insect and reptilian DNA. The detective finds a common link between the murders, hypothalamus missing from the brains of the victims. Together they both try to defeat a monster/killer who is on a killing spree.—Fella_shibby@yahoo.com",
    "name": "The Relic",
    "genres": [
        "Horror",
        "Mystery",
        "Sci-Fi"
    ]
}