{
    "filename": "American,-The_script.txt",
    "imdb_id": "tt1440728",
    "imdb_url": "https://www.imdb.com/title/tt1440728",
    "characters": [
        "Waiter (Market)",
        "Mathilde",
        "Old Cheese Vendor",
        "Father Benedetto",
        "Hunter #1",
        "Jack /Edward",
        "Ingrid (as Irina Bjorklund)",
        "Fabio",
        "Man on Vespa",
        "Hooker #2",
        "Postmaster",
        "Hunter #2",
        "Pavel",
        "Clara",
        "Young Swedish Man (as Samuli Vauramo)"
    ],
    "dialogues": {
        "Waiter": "Cafe?  Buon giorno. Desidera?  Signore?  Per due?  Menu in Inglese?  Tedesco? Olandese?  Gasata?  Buona sera. Desidera?",
        "(Market)": "",
        "Mathilde": "It's hot. My car has no air conditioning. I asked for it, but...  One fifty to one seven five meters.  Five seconds. Seven at the most.  One.  Rapid.  Large. Preferably 9mm Parabellum.  The weapon must be fairly light. And compact. Possible to be broken down into its constituent parts.  As compact as possible.  A small vanity case would be permissible.  Not necessary.  Silencer.  Excuse me?  I didn't see him. In any case, I'm alone.  I can accept a slight loss of range.  Can you do it?  Mr. Clarke. How good to see you again.  Refreshments?  You picked a beautiful spot.  You would be hard pressed to make a fast get away in this.  I would have thought you to have had at least an Alfa Romeo.  Is it far?  Up there?  The train was tiring. One has to keep alert so much in cities.  Are we nearly there?  I told you I work alone.  Are those houses occupied?  We should check again.  I'll be careful.  You have tested the gun here before?  It's beautiful here.  I wish everywhere could be this tranquil.  You don't like the peace?  Rounds?  I should like a hundred of each.  And fifty explosive.  Mercury will do very nicely.  I have made my own targets.  Muzzle velocity?  Socimi?  I've not had one before.  You've done a good job, Mr. Clarke. Thank you. Thank you very much.  Go to the stones and fire near me.  Say...  ...into the bush with the yellow flowers. Two bursts. Five seconds apart.  The sound suppression is superb. I couldn't place the direction of fire.  I shall require the rounds and the weapon by the first of next month. In the meantime would you tighten the adjusting screws on the sight, they are too loose. And lengthen the stock by three centimetres. I also want a sixty round magazine.  I'm prepared to accept that.  What about the a case?  Eight-two-one.  What do you want done with these?  How thoughtful.  I don't know Italian wine.  You chilled the wine. I thought...    Wow.  It's so beautiful.  You like coming here.  You've never taken a woman here before?    Friendships are transitory. It is...  I wish you hadn't brought me here.  This is the sort of place I wish I'd discovered by myself. Then maybe one day I could have retired here. But you already know it.  We will meet as before?  On the first of next month?  Around noon?  Thank you for a lovely day. Mr. Butterfly.  You must take your mistress to the meadow for a picnic.  Hello. I see you have brought it in from the car with you.  What's in the paper bag?  That is most thoughtful of you.  Yes, I expect so.  I'm just going to the ladies. Wait here.  Shall we go.  You won't need your piece.   Everything's just fine.  Final payment.  Buy yourself a retirement clock.  Have you taken your girl up to the meadow yet?    Goodbye, Mr. Butterfly.  What else could I do? There were kids everywhere. Besides he's suspicious.  I prefer it that way.  The Socimi is the perfect weapon.  He made short work of the last guy you hired.",
        "Father": "You are American.  You speak Italian?  Va bene! You stay at Pensione Arbruzzo.  On vacation?  Lavoro? Che genere de lavoro?  Va bene. Che genere de fotografia?  People?  Ah! Magazine! Which magazine?  Va bene. So you must share a glass of wine with me. Questa sera. This evening.  Certo. You want to know the truth about Abruzzo? A priest sees everything.         Que siamo! The quality of the brandy is good, the liquor is smooth and the glass warmed by the sun.    The French are... pezzi di merda. This is not an American discovery. Italians have known this for centuries. [In ITALIAN] When Rome called France the province of Gaul, they were just the same. Arrogant sensualists. Their cuisine is fussy and their wine effeminate. Only their brandy is worthy of any attention.    You come to Italy to make a guide book and you don't care about history?  Of course. You are American. You think you can escape history. You live for the present.                    All the sheep in my flock are dear to me, but some are dearer than most. Especially those that have strayed from the fold.  Fabio. He is a... [in ITALIAN] 'car doctor'. But I suspect his practice is not entirely sound. Ecco!  Fagiano. Pheasant. With sauce of orange juice, orange peel, chestnuts, garlic, Marsala wine and... Come si dici in Inglese? Brodo di Pollo. Chicken broth.  Also: salsify in garlic butter. Mange-tout. Fried wild mushrooms with truffle.  The Holy Father eats better than this.  Have you ever wanted to be anything other than a... come se dice in Inglese...?  Photographer.  I'm sure you have other talents. You have the hands of a craftsman, not an artist. You are good with machines. Yet you told me just the opposite when we first met.  Journalism cannot make you a rich man.  Perhaps you are rich already?      \"The grave soul keeps its own secrets, and takes its own punishment in silence.\"  I've been looking for you.  A man was here asking questions about you.  He came to the church this afternoon.  To know where you live. He said he was a friend from Switzerland.  Of course I do not tell him. How do I know him? He is maybe the police. Certainly he is no friend. A friend would know your pensione. Besides...  Friends do not carry guns.  If you live in Italy, and you are a man of the cloth, you meet many people. Besides, I lived once in Naples. If you live in Naples you know the difference between a fat wallet and a... custodia per armi di spalla. How you say in English?  Si.  I am a priest.  Signor Clarke?  I make a mistake. He did not say he was from La Svizzera: Switzerland. He said- forgive me the names in Italian are so similar- La Svezia: Sweden.  Buon giorno!  I walk here to meditate. Once a week, Wednesday, the farthest one can travel in the week from the Sabbath. The trees are like the Stations of the Cross: by certain trees I thank God for certain favours he has granted me, or certain gifts he has made to me and all men. For example, here by this pine, I thank him for the many friendships I have and ask him to look after those of my friends who are troubled.  Some walk here in the cool of evening. Others come at night.  I wonder how many bastards have been made here?  Perhaps you'll stay and settle here yourself?  You told me as much when we first met. Besides, those who seek for peace seldom find it. They're always moving on, looking elsewhere. [A BEAT] And they are usually sinners.  Some are greater sinners than others. And those who seek peace have much sinning in their history.  Until now.  Forgive me. This is the priest in me speaking. And the friend. But you have done much sinning, Signor Clarke. You still do.  I do not refer to the sins of carnality. But to the deadly sins...  We are not discussing theology, my friend, but you. You like this town, this valley.  You should like to remain here and find your peace at last. Yet you cannot. There is something you cannot ignore. Some force. Some enemy.  You want to speak but you dare not. You know no one sufficiently well to share your history with them. You know I am trustworthy yet still you are cautious.  What job do you do, Signor? Are you on the run, as they say?  It's an expression, no?  Some men watch some of the shadows. You watch them all.  Do you wish to tell me?  For your own sake. Perhaps I can pray for you?  Counterfeit money?  You work in metal. You are given some steel by Fabio, the car doctor.  I know only what you do in the town. People talk to me. I am their priest and they trust me.  Of course.  Why do you ask me that?  I do not remember, Signor. It was twenty-five years ago.  In the end it is I who confesses to you.  Perhaps. For your own good. You cannot doubt the existence of Hell. You live in it. It is a place without love. As for me, I go about my daily duties because the town requires it of me. Some know what you know. Perhaps I have no right to wear these robes. But I do have a heart full of a father's love. Something close to His heart! And for that I am both grateful and happy.  What do you have, my friend?  Ciao Fabio, come stai?  Dear Father Benedetto. I promised myself that I would write to you- as your friend- to say goodbye...  Everything I've ever done...  I've done for a reason.   FATHER BENEDETTO stands stock still, facing JACK.  The SIRENS get louder.   I will them that the man who wrote this letter is my friend.  Jack.",
        "Benedetto": "You are American.  You speak Italian?  Va bene! You stay at Pensione Arbruzzo.  On vacation?  Lavoro? Che genere de lavoro?  Va bene. Che genere de fotografia?  People?  Ah! Magazine! Which magazine?  Va bene. So you must share a glass of wine with me. Questa sera. This evening.  Certo. You want to know the truth about Abruzzo? A priest sees everything.         Que siamo! The quality of the brandy is good, the liquor is smooth and the glass warmed by the sun.    The French are... pezzi di merda. This is not an American discovery. Italians have known this for centuries. [In ITALIAN] When Rome called France the province of Gaul, they were just the same. Arrogant sensualists. Their cuisine is fussy and their wine effeminate. Only their brandy is worthy of any attention.    You come to Italy to make a guide book and you don't care about history?  Of course. You are American. You think you can escape history. You live for the present.                    All the sheep in my flock are dear to me, but some are dearer than most. Especially those that have strayed from the fold.  Fabio. He is a... [in ITALIAN] 'car doctor'. But I suspect his practice is not entirely sound. Ecco!  Fagiano. Pheasant. With sauce of orange juice, orange peel, chestnuts, garlic, Marsala wine and... Come si dici in Inglese? Brodo di Pollo. Chicken broth.  Also: salsify in garlic butter. Mange-tout. Fried wild mushrooms with truffle.  The Holy Father eats better than this.  Have you ever wanted to be anything other than a... come se dice in Inglese...?  Photographer.  I'm sure you have other talents. You have the hands of a craftsman, not an artist. You are good with machines. Yet you told me just the opposite when we first met.  Journalism cannot make you a rich man.  Perhaps you are rich already?      \"The grave soul keeps its own secrets, and takes its own punishment in silence.\"  I've been looking for you.  A man was here asking questions about you.  He came to the church this afternoon.  To know where you live. He said he was a friend from Switzerland.  Of course I do not tell him. How do I know him? He is maybe the police. Certainly he is no friend. A friend would know your pensione. Besides...  Friends do not carry guns.  If you live in Italy, and you are a man of the cloth, you meet many people. Besides, I lived once in Naples. If you live in Naples you know the difference between a fat wallet and a... custodia per armi di spalla. How you say in English?  Si.  I am a priest.  Signor Clarke?  I make a mistake. He did not say he was from La Svizzera: Switzerland. He said- forgive me the names in Italian are so similar- La Svezia: Sweden.  Buon giorno!  I walk here to meditate. Once a week, Wednesday, the farthest one can travel in the week from the Sabbath. The trees are like the Stations of the Cross: by certain trees I thank God for certain favours he has granted me, or certain gifts he has made to me and all men. For example, here by this pine, I thank him for the many friendships I have and ask him to look after those of my friends who are troubled.  Some walk here in the cool of evening. Others come at night.  I wonder how many bastards have been made here?  Perhaps you'll stay and settle here yourself?  You told me as much when we first met. Besides, those who seek for peace seldom find it. They're always moving on, looking elsewhere. [A BEAT] And they are usually sinners.  Some are greater sinners than others. And those who seek peace have much sinning in their history.  Until now.  Forgive me. This is the priest in me speaking. And the friend. But you have done much sinning, Signor Clarke. You still do.  I do not refer to the sins of carnality. But to the deadly sins...  We are not discussing theology, my friend, but you. You like this town, this valley.  You should like to remain here and find your peace at last. Yet you cannot. There is something you cannot ignore. Some force. Some enemy.  You want to speak but you dare not. You know no one sufficiently well to share your history with them. You know I am trustworthy yet still you are cautious.  What job do you do, Signor? Are you on the run, as they say?  It's an expression, no?  Some men watch some of the shadows. You watch them all.  Do you wish to tell me?  For your own sake. Perhaps I can pray for you?  Counterfeit money?  You work in metal. You are given some steel by Fabio, the car doctor.  I know only what you do in the town. People talk to me. I am their priest and they trust me.  Of course.  Why do you ask me that?  I do not remember, Signor. It was twenty-five years ago.  In the end it is I who confesses to you.  Perhaps. For your own good. You cannot doubt the existence of Hell. You live in it. It is a place without love. As for me, I go about my daily duties because the town requires it of me. Some know what you know. Perhaps I have no right to wear these robes. But I do have a heart full of a father's love. Something close to His heart! And for that I am both grateful and happy.  What do you have, my friend?  Ciao Fabio, come stai?  Dear Father Benedetto. I promised myself that I would write to you- as your friend- to say goodbye...  Everything I've ever done...  I've done for a reason.   FATHER BENEDETTO stands stock still, facing JACK.  The SIRENS get louder.   I will them that the man who wrote this letter is my friend.  Jack.",
        "Hunter": "",
        "#1": "",
        "Jack": "Nothing.  A hunter.  Go for help. Call the police.  Blending in?  I closed the Stockholm account.  But there were complications.  Collateral damage. Two shooters. Unidentified. [A beat] And a girl.  Guess so.  Since now.  So.              Buon giorno.  America.  Si. Il Americano.  I'm no good with machines.  Si.  Poco.  Not for much longer.  Working vacation.  Photographer.  Pictures of the region. Architecture, landscapes...  No people. Sights and landmarks. For guidebooks, magazines...  Actually it's a syndicate. Lots of different publications. Um... Casa editrice.  You're very kind, but I...  Did I forget to mention my electromagnetic hypersensitivity?  Who's the client?  This is a small town, Larry. I don't like small towns. I grew up in one. Besides, I'm already attracting attention.  I'll think about it.  No.  I take pictures, father.  I try to, father.                              Un po' di formaggio, per favore.  Questo.  E un po' di pecorino.  Prego. You're welcome.  \"Amidst gathering clouds\".    Una gelata alla fragola. Per favore.  Edward.  What car did they give you?  Range?  Time?  Targets?  Fire rate?  Magazine capacity?  You want a submachine gun to fit in a lady's purse?  A small briefcase would be possible.  X-rays? Camouflage: lap-top, DVD player, MP3 or digital camera?  Noise?  No such thing. You'll have to make do with a suppressor like everyone else. It'll dampen the decibels, dislocate the sound source and reduce muzzle flash. I can't make you silent but I can make you invisible as the Finnish phrase goes, but only as long as you're prepared to lose some range.  Two o'clock.  By the clothes stall. Light blue shirt, open at the neck, expensive buff suede shoes. Is he with you?  You want a weapon with the firing capacity of a submachine gun and the range of a rifle.  Give me a month. To trial. Then a week for final adjustments.         Buon giorno.  Il fermo posta?  Clarke.  Clarke. Una pacchetto.  Grazie.  Your source in Rome.  I hope you paid below the odds. The more you pay them the more cops gossip in the locker room.  Yet.  Sinful.  Have you ever wanted to be anything other than a priest?  Photographer?  I do what I'm good at.  No.  I'm not a young man. I have my savings.  I don't think God is interested in me. Father.  What are the snakes for, father?  Sono un amico di Padre Benedetto.  Buon giorno.  I'm taking pictures forty minutes north of here. Right up in the mountains. Father Benedetto said you might be able to help.  My publisher wouldn't stretch to a four by four and the park trails are playing havoc with my chassis.  Not really. I just need something to work on a ruptured driveshaft.  Just a hobby. I tinker.  I appreciate that.  Bene?  Quant'e?  Ciao. Grazie.          E Clara qui? [Is Clara here?]  Forse un altro tempo. [Perhaps another time.]       I've got company.  If he's not baby-sitting the Belgian contract then he's either a Joe, a cop or a shooter. He's not with The Company, they're fast: it's been three days and no TA. He's not intel: they're deep background and he wants to be noticed. He might be a cowboy but he can't be a cop: they work in pairs and he's alone. Strike Guarda di Finanza, State Police and NOCS: he's not Italian- he doesn't look like one, dress like one or behave like one. So who the hell is he?  Larry?  What's he waiting for?  I can handle it.  It's a bad line.  Yes?  The Carabinieri around here like roadblocks. It's cover.  This attracts less attention.  Fifty minutes.  I'll wake you before the turn-off.  The turn-off's up ahead.  Just a precaution.  Derelict. I checked three days ago.  I'll check alone. There are adders the mountains. And vipers. Your shoes.  Yes.  You'd be out of a job.  It's hard to like something you know nothing about.  I've made up two sorts.  Thirty lead and thirty jacketed.  Not a problem.  Will mercury do?  Watch out for vipers.  At least three hundred and sixty miles per hour. That's including twenty off the top for the sound suppression.  Eight-two-one.  You'll find it easy. I've re- balanced it for the longer barrel. The fulcrum is two centimetres forward of the grip now. Which won't matter if you're firing- and I'm guessing you are- from a fixed position.  No major recoil issues. You should be able to hold onto any target. Even the smallest.  Good shot.  You'll upset the balance.  Then I'm happy to oblige.  A briefcase. Samsonite. Standard pattern in black with combination locks. Is there a number you'd prefer?  Eight-two-one.  Throw them in the lake.  Aspirinio. Like Mosacata but frizzante.  It wouldn't look right if the picnic wasn't touched.  It had to be chilled. They're Italian cops.  I'm paid to. Don't move.  Parnassius apollo. It's endangered.  It serves its purpose.  No.  I have an acquaintance.  Wild boar.  I'm much older than you. By the time you've retired I'll be dead.  Hokey.  Morboso?  You needn't act.  You might have to act with your other clients but you don't have to pretend anything at all with me.  I want you to be yourself with me. Be as indifferent as you like. I came here to get pleasure, not to give it.  I don't sleep with the other girls.              Here?  What did he want?  Switzerland?  And you told him?  Shoulder holster.  You're a true friend, father.  Grazie.  Buon giorno.  I'm fine.  It's nothing really. Just a broken rib. Un costollo rotta?  I came off my bike.  No, no, no. I have pain killers. I just need a strong cup of coffee.  Why d'you call me that?  How did he know I was here, Larry?  I doubt it.         How do you do?  Will you take a coffee with me?  Prego.  Have you been to England?  I am.  Due cappuccini e un cafe corretto.  If not with gold, than at least not with enough medieval cobbles to loosen every-self tapping screw in a Fiat.  Where do you come from, Anna?  Dove abita?  Great. I'll see you then.  How about our usual place?  You've forgotten?  Maybe we should try something different.  Locanda Grapelli?  Good.  Seven.  Locanda Grapelli.  I'll be there.  See you then, Clara. It was a delight to meet you Anna. Arrivederci.           What makes you think I'm leaving?  All men are sinners.  I don't seek peace. I never have.  Perhaps. Perhaps I'll stay. The valley. The villages. The mountains.  I see a whore. She's young enough to be my daughter.  Aren't all sins equal?  Who says?  Everyone's on the run from something.  I've done nothing I didn't have good cause to do.  For what reason?  I make things. Artifacts.  Why do you say that?  You know a lot about me.  And I should too?  Fabio. The `car doctor'. Was he conceived here father?  He looks like you. Even more than he does in the photos you keep of each other. Where was he conceived, father? Under one of these trees? At night? Like all the other bastards?  Expecting me to reciprocate?     I wasn't sure you meant me to.  No, grazie.  Small towns.  It is. Very good.  Sure.  No.  I doubt any of the couples here are. With the exception of the Germans at table seven. She's wearing a wedding ring and they haven't spoken a word to each other for eight and half minutes.  What makes you think I have a secret? I'm an ordinary man. I cough. I fart. I earn a living.  Why spoil the illusion?  How is it?    No thanks.    It's bitchin'.  Sure. Bastardo. Imbecile.  Eat shit and die, pimple dick?  I guess I've led a sheltered life. Of sorts.  Too much work.  For what?  Never apologise.  Mine too.  Si.  Retire.  Liar.  Would you be flattering me if I wasn't a client?  Am I a client?  Give it away.  Grazie.  Grazie, Clara.  Where?  I don't deliver, Larry. I never deliver. It's too dangerous. She comes to me. I know the town. That's what we agreed.  Breach? What breach?  Not possible.  Cops?  How come I'm still here?  Where the hell's this information coming from?  They don't.  They can. They can trust me and so can you.  I've never jeopardised an operation in my life.           Put them in the back. We've got a way to go.  Swimming.  An hour. And we're not going to the sea, we're going to the lakes. In the mountains.  A picnic.  It is.  Ten kilometres. Another twenty minutes.  We're going off the beaten track.  Lontano. Fuori mano.  You shall see.  There's no need to worry. I've been here before several times. Taking photographs.  You're not afraid of coming into the wild with me, are you?  This is a Citroen!  This was made by the French for taking potatoes to market. Besides, I always come here in this car.  Of course. I don't want to walk back to town any more than you do.  I assure you it does.  No. Not quite. We go another hundred metres, through the wood. But from here we just roll forward. No motor. No sound. And you'll see a wonder.  You won't need to hold on. I'll go slowly. Just relax and look.  No.  Yes.  There are vipers! Vipera! Marasso!  If we stay here for a year, they'll devour us.  Maybe we should...  I haven't.  Let's eat.  Is Clara yours?  Edward is my real name.  Quite sure.  Nothing.  Dear Father Benedetto...  I promised myself that I would write to you- as your friend- to say goodbye.  Everything I've ever done...  I've done for a reason.  I never thought the day would come when I'd run out of reasons. Reasons to worry. Reasons to run. Reasons to pull the trigger.  Maybe that day's come.  Or maybe I've just found a reason to change.  I still don't understand. What's the point of a gun if it's not loaded?  Does the gun make you feel safer with me?  Then why's it in your purse?  Maybe this is suicide. Cops often put the graft on working girls. Perhaps the girl I told you about, Clara, has sold me out.  I guess I'll go to work too.  I can't stay here forever.  It's not that I've given up on life, Father. Just the way that I was living it. If you can call it living.  It's time to go home.  I can't, Clara. One day...  If I had one request, Father, it would be this. That it's not Clara who finally pulls the trigger. But whoever it is...  ...by this time tomorrow I'll be dead.      All there, as agreed.  Sweets. For your journey.  I guessed you'd have a sweet tooth.  I suppose I'll read about this in the Times or the International Herald Tribune. Or Il Maessagiero.  You never know.  Sure. You?  How do you know I'm retiring?   When can I see you?  If I asked you would you come away with me?  Why not?  Together.  Wherever. Then when we're through, we could come back here. For good.  Where else?  Forever.  Unless you have other plans.   Someone got what was coming to them.  Go to your apartment and pack. Wait `till I get there. Don't answer the door to anyone but me.  Trust me.  Clara. My name is not Eduardo.  My name is Jack.  I promise. Take this.  Look after it. In case.  Now go.  What will you tell them?",
        "/Edward": "",
        "Fabio": "L'Americano?          Si! Si! Va bene!  Niente!  Ciao, Americano!",
        "Hooker": "",
        "#2": "",
        "Postmaster": "Nome?  Clarky?  Pacchetto!  Clarky, Clarky, Clarky. Ecco.  Identificazione.",
        "Pavel": "",
        "Clara": "Morboso?    Morboso is like... when you can't stop thinking about something.  Or someone.  Act?  Maybe I pretend very well. I got more tip than the other girls usually get.     Buon giorno!  You are hurt?  What's wrong with you?  Stronzo! Let me help you!  But you have to go to the hospital!  I know a place which make the strongest coffee in L'Aquila.        Ve bene. Tutto posto. Signor Farfalla. [Good. Everything's OK. Mr. Butterfly.]  You have a tattoo. On your back.  My friend Anna. This is my friend Signor Farfalla.  That would be very good.  Anna is learning English.  Anna is like all Italians. She thinks America is like in the movies. Little Italy, \"West Side Story\", \"Chicago\".  I tell her in these times America is like here, there, anywhere. The streets are not... pave-ed with gold.  Perhaps we will have a drink together soon? I am free...  ...on Monday.  But Eduardo... Where would you like to meet?  Our usual place?  I forgot. Where is our usual place?  Remind me.  Where would you like to try, Eduardo?  Locanda Grapelli! Si!  Seven?  Locanda Grapelli.  You'll be there?  See you then, Eduardo.     Ciao.  I did not think you would come.  Certo.  Si.  Una botiglia di acqua minerale non gasata et... una Parasini, per favore.    Una botiglia di acqua minerale et una Parasini, per favore.  Non gasata.    Parasini. From Calabria. It is good, you will agree?  Can I ask you something, Eduardo?  You are married?  I was sure this was your secret.  I do not think you are an ordinary man. I think you are a good man. But you have a secret.  He thinks we are a couple.    Woooow!  Bitchin'.  It's- come se dice- `slang', no? Eco.  Come on, Eduardo!  It is good, you will agree?      \"Imbecile?\" Eduardo! Try: Mangia merde e morte: tuo cazzo un brufolo.  Perdone!  Shell-tered?  Too much work.  I don't apologise, Eduardo.  For this I do. My job.  Except this job is full of testa di cazzo.  Lei?  But you are too young to... pensione?  Si.  No!  This say yes.  This...  This cannot be for sale. But I am not want to... come se dice?  Stronzo! I buy you a present!  Prego. Eduardo.  My apartment is not far from here.                   Ciao, Eduardo!  Where we go?  How far do we go? To Fanale?  For a... come se dice... you have in the back...  A pick-nick! We are going for a pick-nick. Just the two of us.  I have practise my English, Eduardo. I love to have pick-nick. It is a beautiful day, isn't it?  Is it more far?  Twelve kilometres? In twenty minutes?  You will speak Italian. One day, I will teach you.  Where are we going?  I think it is good we should stay close to the road.  No!  Of course I am not. Not with you. But this...  ...sentiero!  You should have a jeep. A Toyota. It is not good for a... berlina.  You sure?  I think you are crazy. This will go to nowhere.  Now there is no road!  Is this where we go?  No one comes here?  Just you.  Well?  I am going to swim in the lake. Are you coming?  Maybe! But I am lucky!    Come, Signor Farfalla!  Come!  Stand by me.  Keep still. Watch.  It is said that if these fishes bite at two hands holding, then love is good for the people.  Do you make love in the water?  What's wrong?  Eduardo.  Is this your real name?  Si. Yes.  Ed-ward.  You are sure you are not married, Eduardo?  Will you put this on my back?  Eduardo?  Amore?  Eduardo, what's wrong?  Grazie, Eduardo.  One of the girls borrow it to me after the second hooker in Chieti is murdered. With some of the clients it make me feel safe. I don't tell the police, of course, but... Madonna, Eduardo. How they do to these two women! A police agente from Rome show me photographs. They show photographs to everyone in Via Lampedusa.  Non capito... how one person hurt another in this way.  You are not a client.  I have to work tonight, amore.  What will you do?  And after that? Tomorrow and the next day.  I want always to stay here.  Let me come to your home.  Stay forever here.          I have to work tonight.  You come to my apartment after.  Come away with you?  Together?  Where?  To live?  Forever?  Other plans?  I love you, Signor Eduardo Farfalla.  What's happening?  Eduardo, please?  I trust you.  No?  Jack.  You promise you're not married?"
    },
    "imdb_rating": "6.3",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjAxMDg1NDcxM15BMl5BanBnXkFtZTcwODc3MDg1Mw@@._V1_QL75_UX380_CR0,12,380,562_.jpg",
    "description": "Alone among assassins, Jack is a master craftsman. When a job in Sweden ends more harshly than expected for this American abroad, he vows to his contact Pavel that his next assignment will be his last. Jack reports to the Italian countryside, where he holes up in a small town and relishes being away from death for a spell. The assignment, as specified by a Belgian woman, Mathilde, is in the offing as a weapon is constructed. Surprising himself, Jack seeks out the friendship of local priest Father Benedetto and pursues romance with local woman Clara. But by stepping out of the shadows, Jack may be tempting fate.—Anonymous",
    "name": "The American",
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ]
}