{
    "filename": "Family-Man,-The_script.txt",
    "imdb_id": "tt0218967",
    "imdb_url": "https://www.imdb.com/title/tt0218967",
    "characters": [
        "Evelyn Thompson",
        "Paula",
        "Adelle",
        "Lorraine",
        "Annie Campbell",
        "Betty Peterson",
        "Kate Reynolds",
        "Jack Campbell",
        "Cash",
        "Alan Mintz",
        "Josh Campbell",
        "Arnie",
        "Peter Lassiter",
        "Big Ed"
    ],
    "dialogues": {
        "Evelyn": "Kate!  Jack! (turning around,  to guests    Everybody, Jack and Kate    are here!  Jack looks right past her...to the house filled with 50      Like the dress...?       I thought I saw you    notice it at the kids    recital.  Jack shoots her a confused look...then walks in, trying to catch up with Kate...   (holding out a  puff to Jack    Finger food...?       Cmon, as soon as I put    them down, youre gonna    grab a couple...you    always do...  Kate sees Evelyn and Jack from her position on the other side of the room...Kate watches as...  Evelyn holds the puff up to Jacks mouth, slowly putting it near his lips...      Let me.  Theyll melt in    your mouth...  He instinctively opens his mouth as Evelyn pushes the treat inside...      Good?  On Jacks face...if freezer burn were a facial expression, this would be it...      Mushroom puffs arent the    only thing I do well...   Hi Jack...  A moment of confusion as he tries to place the face. Then...   Very funny.  I saw you out there on lane five. What do you have the flu or something?    Need a nurse?   If thats what you want...  She brushes past Jack, continuing to her lane...Jack follows her with his eyes a moment, then...   Are we what, Jack?   Are we finally being honest?   Okay, youre right, weve been dancing around this for years...  Evelyn looks a little flush...she briefly fans her face.   God, my heart is racing. Here goes...  When I get dressed for a party and I know youre going to be there... well, lets just say I dont go strapless because my husband likes it...  An intrigued smile from Jack.   Ive got six sets of snow tires piled up in my garage and I wont even drive in the snow...And our kids just happen to be in the same ballet class every year?  She picks a piece of lint off his shirt.   So, if youre asking me whether Id like it to be more, the answer is yes...  A look of surprise from Jack.   ...and Kate would never have to know.  Jack considers this for a moment.   Steves out of town with the kids this week.  Why dont you just stop by...  She turns, leaving Jack standing there, watching her sashay back to her lane.    Jack looks around, sees the street is empty, then nudges the dog, leading her up the path to the house.  He gets to the front door...moves his hand up to the doorbell...but its a tentative move...he keeps it there a moment, perched at the button...but for some reason he cant bring himself to push it...  He looks down the street, toward his own house, then to the window upstairs.  Finally, he turns...",
        "Thompson": "Jack and Kate, a casserole dish in her hand, walk up the path to this tacky but large house, its outside decorated with the most garish display of Christmas decorations this side of Pasaic.  Kate RINGS the doorbell...  EVELYN THOMPSON, 30s, wearing a dress thats a bit too tight and a bit too low cut, opens the door...    As Kate heads into the living room, Evelyn takes Jacks arm...    The party is in full swing, Christmas music in the b.g., GUESTS talking, laughing, drinking egg nog...  Jacks eyes dart around the room...its large, neater than his and Kates house but still very lived in...The Thompson KIDS run in and out of the room, playing with new toys... nobody is wearing or eating anything imported from Europe, but everyones having a good time...  ...everyone except for Jack, standing with Arnie and THE GUYS, having his ear chewed off by NICK CARELLI, a walking advertisement for Levis Cotton Dockers...    Jack is sitting on the arm of a couch filled with guests coats, talking on a FOOTBALL SHAPED telephone...the tray of mushroom puffs on the table...    Jack comes down the stairs, a lost look in his eyes. He looks across the room and sees...  Kate, with a group of GUESTS, looking great in her jeans and white blouse, the center of attention.  Jack passes through the guests, people waving to him, slapping him on the back as he approaches Kate...  He catches Kates eye...she gives him a subtle smile.    Jack looks around, sees the street is empty, then nudges the dog, leading her up the path to the house.  He gets to the front door...moves his hand up to the doorbell...but its a tentative move...he keeps it there a moment, perched at the button...but for some reason he cant bring himself to push it...  He looks down the street, toward his own house, then to the window upstairs.  Finally, he turns...",
        "Paula": "I hope you don't mind.  There    were like ten new ones in the    cabinet.  A playful smile from Paula.      Did you really mean what you    said about Tuscany?      Last night was great...      Thanks.  You're not bad    yourself...  Jack grabs his Frank Mueller watch from the night stand, puts it on his wrist.  He looks at Paula as she slips the dress on.      I'd like that, too.      It's Christmas Eve, Jack.       I have to go to my parents'    house out in Jersey.  Would    you like to come?      I'm taking the train...  Paula approaches Jack, leaning over him, her long hair dangling on his chest.      Don't you have anywhere to go?       Maybe I can try and sneak away    some time tomorrow morning... (kissing him on  the lips    Okay?   It was nice meeting you, Jack...   Waiting for me by the door, huh?  Jack looks at her.    Merry Christmas...    Its whatever you want it to be, Jack...  Jack grabs a leather jacket then walks right by a shocked Paula and heads out the door, practically running down the corridor.   Jack?...Jack!",
        "Adelle": "Only eight thirty?  What's the    matter, had some last minute    shopping to do?  Jack pops a peppermint Lifesaver in his mouth as Adelle hands him his messages.       You're a ray of sunshine,    Jack.  They approach an office, the words, \"Jack Campbell - President\" stenciled on the glass...      Oh, and Oxxford called...      Her assistant said you could    call her at home after eight.  Jack stares at the message like he's looking at a ghost.      Yeah Jack, her assistant...       You?  Married?      Excuse me?      So you left her?  Just like    that?      Stop Jack, I'm getting all    weepy.      And look where it's led you...     I'm gonna get her on the    phone...  Jack pauses, focused on the message, his mind drifting back...  Adelle begins dialing the number.  Finally, Jack reaches out and hangs up the phone.      No?!  You almost married this    woman.  Aren't you even    curious what she wants?      That'll be a nice little    holiday treat.   Hey Santa, where are you? Everybodys here.   You were supposed to be here half an hour ago...the emergency strategy session? Your trip to Aspen? Theyre all panicked here...  Silence from Jack...   Jack...? Are you going through the tunnel?  Finally, Jack shakes his head, defeated.",
        "Lorraine": "Talk to him, Jack.    Please.  One day a year    away from the Ponderosa.    I dont think thats too    much to ask.      I need some egg nog...      Where are you going,    Jack?     Wheres he going?      Oh just let him borrow    your precious Cadillac,    for gods sake.  Jack spots a set of keys hanging on a hook.",
        "Annie": "Jingle bells, Santa s    mells, Rudolph laid an    egg...la la la, la-la la    la, la la la la la...  Annie places Josh on the bed and then jumps up herself.  She gestures to the dog, patting the bed.      You too, Luce...  The dog faithfully jumps on the tiny bed, joining everybody else and leaving very little room.  Annie starts jumping.      Rise...and...shine...!      Mom, dont you think we    need to open the    presents?      Cmon, Dad.  Get up!  She said Dad.  Thats it.  Jack moves the baby gingerly over, then gets out of bed, stumbling over a baseball bat lying next to it.  He picks up the bat...the same Willie Mays autograph bat that was encased in glass in his N.Y. apartment.  Frightened, Jack drops the bad, looking down at himself for the first time...hes naked...  ...a mortified look on his face as he sees the kids on the bed...  ...he quickly grabs a pair of sweat pants and a yellow cardigan off the chair and throws them on...  Kate, still half asleep, reaches out her hand.       Whats that?  Jack watches as she pedals over, reaches into his hand and takes the bicycle bell...       I like this... (jumping up and  giving hima peck  on the cheek    ...thanks, Dad!  Annie rides excitedly out of the room on her bike.  Leaving Jack and Kate alone again...      Youre not really our    dad, are you?  Jack turns to her.  Shes looking back at him with complete earnestness.  They stare at each other another moment.  Then...      Wheres my real dad?      They did a pretty good    job.      The aliens...In the    mother ship.  You look    just like him.      Do you like kids?      You know how to make    chocolate milk?      You promise not to kidnap    me and my brother and    implant stuff in our brains?      Welcome to earth.      Stop here...  Jack stops the van outside the Playland Day Care Center.      This is day care.  Its    where babies go when    their parents are at    work.      I have winter camp until    four, then ballet until    five thirty.      Try not to be late    because kids dont like    to be the last one picked    up.      Bye...      Big Eds.      Thats where you work.  A beat.  Then...   Mary Janes, Mom.  You promised.    Put the bicycle back on the ground...  Jack turns and sees her, gently lowering the bicycle.   Not bad...I shoulda warned you.  Dad always does something really special for their anniversary.   One year he had a solar system named after her...   Mom liked it.  Jack raises an eyebrow.   Thats good but...you did forget the anniversary.   Youre really gettin the hang of this.  Suddenly, a look of confidence comes over Jacks face. For the first time, he seems like a man in control.   The black one...  Kate nods.  Shes about to put it on when she looks at Annie...   Im not worried, Mom. Hes still learning our ways...  Kate looks at her with a raised eyebrow, then nods. Its true.  She puts down the dress and holds out a hand to Annie.    Really?  Kate nods then applies some red lipstick to Annies lips.    Annie is in a nightgown, practicing her violin. Jack walks in.  Its all he can do to hold back cringing at the missed notes. Annie finishes the piece, lowering the bow.   Mary Had A Little Lamb.   (whispering in  Jacks ear I knew youd come back...    Ringing my bell...  On Jacks anxious face...    Jack is standing over Annie, kissing her on the cheek.    Is it morning yet?",
        "Campbell": "Close in on Jacks face, bathed in morning light...he opens his eyes...feels something strange...  Jack looks down...theres a womans head resting on his chest.  A look of confusion crosses his face...trying to remember... did he meet a woman last night...?  He turns his head to find a large MUTT sitting faithfully beside the bed, wagging his tail...  ...did she have a dog?  He looks down at the woman again, craning his neck to get a look at her face.  And then he sees her...    A garishly decorated Christmas tree sits in the middle of this messy and disorganized living room, a bevy of gifts underneath and four red stockings over the fireplace.  Jack darts to the top of the steps...    Jack emerges from this charming, suburban two-story house, some tasteful Christmas lights decorating a tree in the center of the snow-covered lawn...  He races to a blue Dodge mini-van sitting in the driveway, a My Ferrari Is In The Shop sticker on the rear bumper.  He climbs into the mini-van and peels out of the driveway...    Jack steps inside.  He turns back to the door but Arnies gone.  Then, Kate enters the room, holding a portable phone...    Jack at the closet door, looking at a row of Hagar slacks, Docker sport coats and imitation leather shoes...  He reaches in and touches the fabric on one of the sport coats.    Kate and Jack walk in the front door...the dog greets them happily, jumping up on Jack, a weary look on his face.    Kate is in bed, fast asleep.  Jack walks into the room, his face still red from the cold outside.  He looks over at Kate, sleeping happily.  He takes off his shirt and khakis, laying them neatly on the chair.  He looks over at the pair of flannel pajamas folded on the dresser.  He shakes his head, resigned, then dons the pajamas and climbs into bed...    Morning light streams into the room.  The clock reads, 7:14.  Jack opens his eyes  a burst of light hitting them from the window...like the morning light in his Manhattan loft...  He reaches across the bed...its empty...  A smile of hope from Jack as he puts his head back on the pillow...maybe it was only a day...Then...  The sound of a baby CRYING from the next room...A pained look on Jacks face as he realizes hes still in Jersey.  Now the baby is WAILING...Jack lies still a moment, hoping itll stop...it doesnt.  Then, he hears the sound of the SHOWER TURN ON in the bathroom.  He gets out of bed and walks to the bathroom...    Jack is in bed watching CNBC...On the TV a young woman REPORTER at the anchors desk...    Jack walks into the house carrying his bowling bag.  He dumps the bag in the coat closet and walks into the kitchen where...  Kate is at the counter, her back to him, poring over some legal documents.    The front door opens and Jack walks in with Lucy on a leash, his face red from the cold outside.  He gives the dog a pat on the rump, then takes off his coat, hanging it and the leash on a hook by the door...  He walks through the quiet house, into the living room, rubbing his hands together to warm them up.    Lucy licking Jacks face.  Jack pushes the dog away...as...  The ALARM RINGS.  Kate pushes the button to stop it.    Jack is mixing a glass of chocolate milk.  Annie, arms folded, is waiting expectantly.  He finishes, sliding the glass to her.  She takes a long sip, puts the glass down, a chocolate milk mustache on her lip.    Annie walking through the downstairs of the house, practicing her violin...its a noise bordering on MUSIC, but not quite...  She walks into the kitchen where...  Jack stands at the counter in his robe, reading the Newark Star Ledger and drinking a cup of coffee.  He lowers the paper, watches Annie with a smile as she strolls through the room playing her violin badly...he goes back to his paper.    The front door of the Campbell House...  Jack emerges in his work clothes, putting his coat on, a bagel in his mouth...  He disappears from frame, the screen door closing slowly behind him...  In a moment...Kate appears at the door, a cup of coffee in her hand...she follows Jack with her eyes as he heads to the car.  Then...a smile from Kate...  In a moment...Jack returns to frame and heads straight into Kates arms...  ...a passionate kiss as she leans against the door post...    Kate, sound asleep in bed...  Pan across to Jack, his eyes wide open, lost in thought...    Jack...standing in front of the desk, nursing a drink.  He looks at Lassiters business card, sitting on the surface of the desk...  He gazes around the room...his eyes coming to rest on a bookshelf...a book...  He moves toward it...looking at its spine...its a tattered copy of Vonneguts Cats Cradle.  He pulls it off the shelf, theres something inside...a bookmark...  ...a PAN AM ticket jacket sleeve...  ...inside...a boarding pass...From: London/Heathrow, To: New York/JFK, 10/4/87.  He looks at it...somethings not right...    Jack walks into the room...  The lights are off, Kate already in bed sleeping.  He undresses for bed, unable to take his eyes off Kate.  Finally, he lifts the covers and climbs into bed next to her, moving closer to her, putting an arm around her, drawing her in...  In her sleep, Kate nestles in Jacks embrace.  He savors the feeling, then closes his eyes as...  They lay there...side by side...together...a single person.    The morning light streams into the room.  Kate opens her eyes.  Jacks not in bed.  A look of curiosity.  Then, she hears LAUGHTER from outside.  She goes over to the window...opens the blinds... revealing...  Jack in the backyard, LAUGHING with joy, playing in the snow with Annie and Josh.  Kate watches...a satisfied smile sweeping across her face...    ...Jack reaches out and snags Annie...she CACKLES in delight...  The three of them fall over onto the soft white snow...  The laughter from the kids is uncontrollable, Jacks joy is just as palpable...  Finally, Annie stops laughing and grabs Jack around the neck, hugging his tight.    Jack walks to Josh.  Hes sleeping soundly.  Jack gently kisses Josh on the head, careful not to wake him.    Jack is standing over Annie, kissing her on the cheek.    The clock reads, 11:17.  Kate is already in bed as Jack walks in.    The room is dark...  Jack enters, sees Kate sleeping soundly in bed.  He sits down in a chair and watches Kate asleep, a sad look in his eyes...  As he continues to watch her, to listen to her, his own eyelids appear to grow heavy...  He tries to fight the sleep...opening his eyes... focusing on her...but its no use...  Finally, he closes his eyes...falling into a deep sleep...    Jacks Ferrari pulls up in the driveway and he hops out. He races to the front door, POUNDING on it...  A MAN in a Van Heusen shirt and Hagar slacks answers. Jack stares at him in shock.",
        "Betty": "",
        "Peterson": "Hello Jack.  You dont    have to stop singing on    my account...      You know you could never    satisfy me the way he    does...  The doors open to the lobby.  Mrs. Peterson walks out ahead.   (to Tony re:  Jack, annoyed    Who is this man?  Tony shrugs his shoulders.   (raising a hand  to Tony    No...      And sleep you shall.    Noblesse oblige is not    dead.  Not yet    anyway...Come, lets get    you some help.  Surely    there must be a shelter    somewhere in this city.",
        "Kate": "I got you a few necessities...  Kate hands Jack a new copy of Vonneguts Cats Cradle.   Your copy was a mess...  Jack accepts the book but hes unable to take his eyes off Kate.  She hands him a cassette.   Every one of these songs will remind you of me in a slightly different way...   I also put side two of London Calling on there...  Kate leans over and kisses him passionately on the lips.   That was not officially the goodbye kiss. It was just an interim kiss...  He looks at her, his eyes welling up. He pulls her close, kissing her deeply. Then...   You have your ticket?  Jack pulls out a BLUE PAN AM TICKET ENVELOPE.  Kate nods. They embrace and kiss again.  As they separate.   Wait.  Jack turns. Kate approaches him.   I have a bad feeling about this.    I know weve talked about this a thousand times and we both agree that going to London is the right thing to do. But in my heart... this feels wrong.  She looks at the gate...the last few passengers are boarding, then back into Jacks eyes.   Dont  go, Jack...   Believe me I know what an incredible opportunity this is for you...   Right, for us. But...Im afraid that if you get on that plane...    Go. Im sorry, you should just go...   We're being responsible.  Go. Get on the plane.  His eyes narrow as he measures her determination...    Get the hell outta my sight. You bother me.  A laugh from Jack.  Kate gives him a calm smile and a nod - it's not entirely convincing but it's enough for Jack.   I can't seem to let go of you...   You want to do something great, Jack?  Let's flush the plan...start our lives right now, today...I don't know what that life's gonna look like but I do know it has both of us in it.  And I choose us...  Jack is jolted by her words.   The plan doesn't make us great, Jack.  What we have together, that's what makes us great.  Her words sink in...A long moment of decision...He looks toward the gate, only one person left in line...back to Kate...imploring him with her eyes.  Finally...He kisses her deeply on the lips...    ...now 34 and even more beautiful, a look of utter contentment on her radiant face, sleeping soundly...  His head darts around the room - its cramped and lived in, clothes and toys are strewn about, family photos on the dresser, Laura Ashley curtains, a tiny poster bed and a charming little bay window.  He instinctively reaches for his Franck Mueller watch on the night stand, but its not there.  Its a Timex Indiglo and it reads, 7:57 A.M...  Jack looks back at Kate...he rubs his eyes...maybe its a dream...but nothing changes.  Then, Kate stirs...      Mmmm...ten more minutes,    Jack... its Christmas...  Jack jumps as he hears Kate talk for the first time...  Suddenly, the door bursts open...A SIX YEAR OLD GIRL, ANNIE, in a little nightgown, walks into the room carrying an 18 MONTH OLD BOY, JOSH, SINGING at the top of her lungs...       Youre jumping,    sweetheart...  Jack looks at this activity like a man at his own funeral.       Mommy needs five more    minutes in la la land.    That could be her    present...  Josh crawls directly up to Jacks stomach, climbing on.      Jack...?  Jack turns by instinct.  Kate grabs him, drawing him near.  A look of fear on his face as Kate opens her eyes...  Eye contact...Jacks certain hes about to hear her scream...       Strong coffee, okay?  She lets him go as Jack backs out the door...   (calling from  the bedroom    Use an entire can if you    have to!  He looks back at the bedroom, then at the stairs...quickly heading down the CREAKY steps, still in shock.  He grabs an overcoat from a hook by the front door...about to step out when he looks down and realizes...  ...hes barefoot.  He glances at a pair of rubber over- boots sitting by the door, slips them on, just about to leave when...  He hears the sound of a KEY TURNING in the door lock...Jack looks at the door, not quite sure what to do...  The door opens...into the house, arms laden with wrapped gifts, walk BIG ED and LORRAINE REYNOLDS (both 60s), Kates parents.  Big Eds wearing a ten gallon hat and a suede overcoat.  Lorraine has a cigarette dangling from her mouth.       Hold on a second...  She cups the receiver.  Jack looks at her, shes dressed now, nothing fancy but she looks great.      Ten years ago...  Kate just stands there looking at Jack, giving away nothing.      Are you okay?       Never mind, he just    walked in...  Jack grimaces as she resolutely hangs up the phone then stares him down angrily.      Do you have any idea what    you put us through    today?!  You walk out of    here at 7:30 in the    morning, dont tell me    where youre going, or    even that youre going,    and I dont see you til    hours later.  I had state    troopers looking for    you!  I called    hospitals... (pointing at  the phone    ...I was just on the    phone with the morgue    for gods sake!  Jack watches her vent, the frustration on his face building.      What kind of man leaves    his family on Christmas    morning without a word    about where hes going?  Jacks almost to a breaking poINT.      What kind of man does    that!?      Where were you?      The city?  New York    City?  Why?      Jack...dont even    start...      You know what, Jack?    Its not funny this    time.  Im really angry.  She stares him down, expecting an answer.  But he has no answer.       Jack!  Jack takes the bell out of the plastic bag that Cash gave him, holds it up in front of her and starts RINGING it furiously.  Then...Annie rides into the room on her new bike.      You missed the whole    thing, Jack.  The    pancakes, the    presents...you spent six    hours putting that bike    together and you didnt    even get to see the look    on Annies face when she    opened it...  Jack sees the disappointment on her face...      You missed Christmas,    Jack.  Jack looks down, almost ashamed...he relents, giving in to the moment...      Look, we dont have time    for this right now, well    talk about it later.  Now    get dressed... (pointing to his  outfit    Youre not wearing that    to the Thompsons party.    I dont care how    hilarious you think it    is...      You look forward to this    party all year.  Whats    with you today?      Fine.  Do whatever you    want.  She picks up the phone, starts dialing...      Telling my mother she    doesnt have to stay with    the kids.      Because youll be here.  Kate just looks at him.      Funny, Jack.  Im    laughing on the inside.      Jack...?  Jack turns, sees Kate standing in the doorway, watching him take his frustrations out on the phone, concern on her face.      Are you sure youre    okay...?  A forced smile from Jack.       Uh huh...  Kate notices the tray of mushroom puffs on the table.      You must really love    Evelyns mushroom puffs,    huh?     You know theyre not    real...  She turns and leaves...Jack looks at her, confused...       ...then she asks me to    put this sweater on.    What choice do I have,    right?  Jack watches as Kate charms the crowd...      But as Im slipping it on    I notice shes misspelled    the word lawyers.     I had to go through the    entire day wearing a hand    embroidered sweater that    said, Non-Profit Layers    Do It For Free.  The guests laugh again.  Even Jack finds himself laughing, until...       Jack...      I better go wake my    mother...  Kate grabs a leash off a hook and hands it to Jack.      Here you go...      Shes your dog, Jack.      Fine, shes the kids    dog.  Lets go wake Josh,    see if he wants to walk    her.       Youre having a bad day,    Ill go with    you...actually, theres    no way in hell youre    gettin me back out    there...  Jack looks at the dogs face.  Lucy couldnt be more excited.  Finally, Jack shakes his head and takes the leash.   (heading up the  stairs    Make sure you reward her    verbally when she does a    number two...       ...my feet are hurtin...       And...?  ...her expression makes Jack turn his gaze from her naked body.      Dont give me that look,    Jack, Tuesdays your day    and you know it.  And try    to get Josh to day care    on time, okay?  He missed    the macaroni painting    last week...  She closes the curtain and turns the radio back up.      The kids are asleep...  She goes over to the window and draws the blinds.  Jack looks up at her, nods, then goes back to the TV.      Jack.  I said the kids    are asleep...      I thought we had a deal    about you watching CNBC    in bed.      Fine, but not tonight...  She climbs onto the bed, a seductive look on her face.      That is the general idea,    yes...  Kate starts kissing him...but Jacks a little uncomfortable with the sudden intimacy...he pulls back, a little nervous.      Its ten thirty, Jack.    By eleven youre gonna be    sprawled out on the bed    snoring your head off.    We dont have time for    wining and dining.      Thanks, Jack...      This is good stuff, Jack,    keep it coming...      How can you do that?      Look at me like you    havent seen me every day    for the last twelve    years...  Jack freezes.  Theres love in her eyes but its not meant for him...  She kisses him...      Dont move.  She gets up off the bed and heads for the bathroom...  He looks around...not sure what to do...Finally...  He turns onto his side and closes his eyes...  Kate emerges from the bathroom, she sees Jack on the bed, hears his breathing heavy with sleep...  At once charmed and disappointed, Kate sighs.  She turns off the CD player and heads into bed.  She pulls the covers up over Jack, shutting off the light... She puts an arm around him, kissing him sweetly on the neck...      night, honey...  Close in on Jacks face...turned away from Kate...he opens his eyes...looks down at her arm...loneliness on his face...    Were almost done here...   Thats right.  Okay, lets make a quick stop at the kids shoe department, pick up my watch from the battery place, then Ill run into the linen store...  An unhappy look on Jacks face.   You know what, Jack?! Ill go with the kids. Why dont you just hang out here in the mens department... okay?  Jack glances at the Mens Dept., sighs and gives Kate a nod.  She takes off with the kids...and then he sees it...  ...the Zegna section.  Hes drawn to the neat rows of beautiful suits like a moth to the light...  He approaches the rack, pulls out a dark green suit, gently touching the soft wool.   You look amazing in that suit...  Jack snaps out of his trance.  He sees Kate standing behind him, Annie and Josh happily playing a few feet away.  I mean...wow...off the charts great.   $2,400?!  Are you out of your mind?   Those shoes were twenty five dollars.  Cmon, take it off.  Well go to the food court and get one of those funnel cakes you like.  Jack looks at her...its a moment of decision.   No?   Excuse me?   Really.   Its sad to hear your life is such a disappointment to you, Jack.   Who are you?  Kates words pierce Jack...he has to avert his eyes.   Maybe youre not.  The Jack Campbell I married wouldnt need a $2400 suit to make himself feel better about his life, but if thats what its gonna take, then buy it. Just buy the goddamn suit ...we can take the money out of the kids college fund.  They stare at each other for a moment...a stand-off...   Ill give you this, life has thrown us a few surprises...  A glimmer in Jacks eye...   Well...Annie for one.   I think it worked out okay, dont you?   Good, Jack.  Maybe well keep her.   We were young...  Remember that little place on Charles Street we used to go to?   You cant really raise a kid in an apartment in the Village...  Jack nods, starting to piece it together.   The trek out to the hospital every day didnt help either...  You were great. Surviving the heart attack was one thing...    Jack, stop that. I'm still mad at you...  ...who knows what wouldve happened if you hadnt stepped in at the store.   If you want to look at it that way...   A great success story...  A smile from Jack.  He admires her outlook even if he cant bring himself to share it.    How was the game, honey?    You mean this chocolate cake?   Its good...  Jack approaches the counter.   No way.  He makes a grab for the plate but she holds it out where he cant reach it.   Sorry, Jack.  Its too important to me.  They stare each other down a moment.  Then...  He tries to swipe the plate.  Kate jumps out of her chair, running out of the kitchen with the cake, laughing...  Jack takes off after her...chasing her through the house... just about the catch up to her when...  She darts up the stairs, still laughing...he follows her...    You want the cake!?   Its good, right?  He takes a big clump of it and smooshes it in her mouth.  They stay there a moment, lying on the stairs, feeding each other cake, laughing.  Jack leans back on the stairs.  He looks at Kates face, practically covered in cake, smiling, and realizes...  ...he hasnt laughed like this in thirteen years. Then...   (caught up in the  moment Say it, Jack...   Cmon, you know what I like to hear...    Then say it...just say it to me...!   What...?  Jack looks up at her, he can practically see the passion drain from her face...   Nice, Jack.  Youre sweeping me off my feet.   Jack.    Time to get up, honey...  Jack obliges without question, getting out of bed, putting on a robe and slippers and exiting, still practically half-asleep.   Happy Anniversary, honey...  Terror on Jacks face.   (pushing the gift  forward Before you do whatever crazy stunt youve got planned I want you to open mine...  Jack musters up a smile, then approaches the gift.   No, open it...  He hesitates, then begins unwrapping the package, revealing...  ...a suit, similar in color and style to the Zegna suit...   I found it at an outlet store.  I know its a knock-off, but I think itll look great on you...   Enjoy it, sweetheart...  Jack looks at Kates expectant face, suddenly remembering how truly screwed he is.   What are you talking about?  You never wait all day.  You can barely wait until its light out.   You forgot.  Jack stands there, silent.   You actually forgot our anniversary.   (holding back  the tears Jesus, Jack...Is this where we are now?  Is this our marriage? Suddenly Im the wife who has to drop hints two weeks before her anniversary so her husband doesnt fuck it up?  Jack sees a tear run down her face...a pang of guilt on his...   (shaking her head,  crying I dont want to be that, Jack...  Jack approaches her, holding out a hand but Kate pushes it away, gets up and walks toward the bathroom...  Jack is left standing alone, holding Kates gift...   Which do you think?  Annie thinks about it for a moment, taking it very seriously...   Fightings a part of it, Annie.  You know that, right?   Cmere.  Kate leads her to the makeup table, then opens a lipstick...   Now go like this...  Kate rubs her lips together, showing Annie how to do it.  Annie mimics her Mom, then Kate looks at her  Annies beaming.   Youre gonna break a lot of hearts, you know.  A smile from Annie...  Pull back to reveal...Jack standing at the door, watching ...appreciating the kind of mother Kate is...   You okay?  He takes Kate by the arm...    Jack...can we afford all this?   How do you even know about this place?  Jacks caught for a moment.  Then...   Its five hundred and fifty dollars, Jack!  A wince from Jack...for a moment there it was almost perfect.   You are so not off the hook yet, slick.   I dont think theres dancing here, Jack.  Jack gets up and holds out a hand.   (whispering to  Jack Pretty good for a tire salesman from Jersey...  Jack flashes her his most charming smile.   Mmmm...  ...here, try one of these...  Jack takes a scallop from Kates fork.   Okay...   Now Im worried...just say it.  Whatever it is well deal with it.   Worse, you mean...   And now...?   Me neither.  A raised eyebrow from Jack.   I think its good to be a little unsure about who you are.  Its very human.   Cmon, Jack, you think there arent mornings when I wake up and wonder what the hell Im doing in New Jersey...   My office is a dump, I answer my own phone...and youve seen my pay check.   I mean yes, I help people that need it...    God, sometimes I think it would be so nice not to have to stretch ground beef or maybe drive a car with a CD player...  He smiles, right there with her.   Imagine having a life where everything was easy...where you asked for things and people just brought them to you...   I think about it, too, Jack.  I do.  I think about the kind of person Id be if I hadnt married you...  Its as if shes inside his head.  They stay like this for a moment, looking into each other.   And I realize Ive just erased the things in my life Im most sure about.  You, the kids...  Jack nods.   What are you sure about?  Jack looks into Kates eyes.   This is so beautiful...  Jack smiles as he opens a champagne bottle sitting on a silver ice bucket...   You know champagne makes me do crazy things.   I dont know how you did it, hoss, but you pulled it off.   Way out...  Kate saunters into the bedroom, looking at the king- size poster bed, feeling the down quilt.  Jack follows her...    You may even get lucky tonight...  Kate kisses him...when their lips separate, we can see the powerful effect it has on him.  Jack looks deep into her eyes, stroking her hair, lost in her.   I already told you you were gonna get lucky, Jack...  They kiss again, a long soulful kiss.  Then...  Jack pulls back, a look of realization on his face...    Thats all I wanted to hear...  She kisses him, their bodies intertwined...hands caressing ...more and more passionate...then reaches behind her to the light.  The room goes dark...   Mmmm...Jack...  Kate lifts her head, turning to face Jack.   I feel like I should give you money...  Jack laughs.   I mean, my god, Jack you were always good but this...this was... like a porno movie.  Kate lays her head back on Jacks chest, looking at Washington Square through the window.   I could stay here forever...   Have a good day...  A smile from Jack as she pats him on the ass and sends him on his way...   Its like a museum.  Jack nods.    So whats the big surprise? You didnt rent this place for the weekend, did you?   For the week?  Jack chuckles.   A perk for what?   What are you talking about, Jack?    Are you out of your mind?   Annie goes to a great school.   Jack, what could you possibly be thinking? What about my job?    I cant believe you want to move back into the city.  I thought the reason we left was because we didnt want to raise the kids here?    Jack.  Jacks starting to struggle...   In traffic?  Its over an hour each way?  Thats almost three hours a day.  When are you going to see the kids?  Hes frustrated...he pauses a moment to gather himself. Then...   Then get a goddamn snow blower!  Jacks taken aback by the intensity of her tone.   Dont get a new career without even telling me. Dont take Annie out of a school she loves.  Dont move us out of a house weve become a family in...  Kate stands there, wounded...    Dont do that...   They already do envy us, Jack...  Kate picks up her bag and walks out of the apartment.   Our finest moment, right...  A quizzical look from Jack.   When you got on that plane I was sure it was over.  I left the airport afraid Id never see you again.  And then you showed up the very next day...  That was a good surprise...  She continues into the room, leaning against a bookshelf.   I think about you on that plane, about what must have been going through your mind...you sitting there imagining our life together, our life apart...I think about the decision you made...  Jack watches her as she lets out a small sigh.   Maybe I was being naive but I believed wed grow old together in this house.  That wed spend holidays here, have g randchildren visit us here.  I had this image of us all grey and wrinkly, me working in the garden, you repainting the deck...  Kate smiles gently as she pictures this.   Things change, right? People change...  If you need this, Jack, I mean really need this, I will take these children from a life they love, and take myself from the only home weve ever shared, and move wherever you need to go.  Ill do that because I love you...  The words are like a warm embrace for Jack...   I love you, Jack. And thats more important to me than our address...  Kate smiles lovingly at Jack...she walks over to him, kisses him gently on the forehead.   I choose us.  She turns and heads out of the room, leaving him there, the boarding pass still in hand, staring lovingly at her as she goes...   (looking up from  her book Hey...  Jack approaches her, sitting on the bed...   Its been interesting, thats for sure.   Youve been Jack Campbell.  And thats always a good thing...  She kisses him on the cheek.  He takes her arms in his hands and looks her in the eyes.   Are you okay, Jack?   I promise, Jack...   I promise. Come to bed, honey.  Jack stands up, heading toward the door.    Jacks limo pulls up outside this house on Washington Mews...  Jack gets out...    Did you call the airline like I asked?!  Jacks eyes come alive as Kate appears wearing jeans and a white blouse...except for her hair, she looks the same.   Jack...God, its been so long...You look...  She searches for a kind word, but he looks terrible.   Its good to see you...  She looks at him another moment, then turns...    Lori! Wheres that box?!  Kate walks inside, Jack follows her in sheepishly.    ...Jack accidentally knocks into a stack of boxes, sending a GLASS CANDY DISH CRASHING to the floor, SHATTERING it...   Dont worry about it, Jack...  Jack looks up at...a beehive of activity  Lori on the phone, boxes stacked everywhere, TWO MOVERS packing up...    Im moving to Paris...it was right here...  Its a box marked Jack.  I put it in the stack for the Salvation Army...   Hey, kind of under a little pressure here.   You didnt seem to mind offering to help me on Christmas day when you were unwrapping that Prada bag I gave you.   Uh huh. To Paris. My firm has an office there and Im going to be heading it up.   (searching the  boxes Thats the one...    Not with what they pay me...   No, Jack, I never got married. You?   Yes!  A relieved smile from Jack...   I found it!   Here you go.  Its just some old things of yours...  Jack stands here, looking at the box, then at Kate...   Youre serious...  A nod from Jack...   Ill tell you what, Jack, if youre ever in Paris, look me up. Maybe well go for that cup of coffee.  One of the movers passes by Jack carrying a box...  Jack looks at Kate, flush with the realization that this isnt the same woman he knew thirteen years ago, or left yesterday.   Jesus, Jack...   Jack.   What do you want from me? You want me to tell you everything that happened was okay?  Jack just stands there, unsure...   Well it is. Yes, I was heartbroken ...But I got over it. I moved on. People change, Jack. I changed. I dont know why you suddenly feel the need to revisit that time in our lives but I assure you, its over...  Kate turns her back to Jack, leaving him standing there...  He watches her walk to the podium, realizing shes right...  He sees Kate reach the podium...hand her ticket to the attendant...  Finally, a look of determination crosses his face...   Dont do this, Jack... But he continues...   Okay, Jack...",
        "Reynolds": "...now 34 and even more beautiful, a look of utter contentment on her radiant face, sleeping soundly...  His head darts around the room - its cramped and lived in, clothes and toys are strewn about, family photos on the dresser, Laura Ashley curtains, a tiny poster bed and a charming little bay window.  He instinctively reaches for his Franck Mueller watch on the night stand, but its not there.  Its a Timex Indiglo and it reads, 7:57 A.M...  Jack looks back at Kate...he rubs his eyes...maybe its a dream...but nothing changes.  Then, Kate stirs...",
        "Jack": "All in one tape?   Im not even gonna say it, Kate. Maybe itll be like I never left...  Jack takes one lastlook at her, then heads for the gate.  Kate stands there, watching him go.  Then...  ...a  moment of intuition. Something isnt right. She looks at Jack, about to disappear into the jetway, trying to decide...   About the plane? What do you think its gonna crash? Dont say that...   You mean dont go at all? What about my internship?   For us, Kate.   What?  Kate looks at him, pleading with her eyes, but she cant say...    No, youre right.  What are we doing?    Okay, I'm going...  He takes her in his arms one last time and hugs her tight.  Jack looks toward the gate, the line disappearing...Kate grasps his shirt tightly.   You hear me complaining about that?  A sober look in Jack's eyes.   Look, we're at the airport and no one ever thinks clearly at the airport so we should just trust the decision we already made.  You've been accepted to one of the best law schools in the country, I've got this internship at Barclay's Bank. We have a great plan, honey...  Kate nods, then, with resolve...   I love you, Kate...  ...a smile from Kate...relief...then...   (taking her face in  his hands ...and a year in London's not gonna change that.  A hundred years couldn't change that...  Jack gives her one final kiss then walks pensively to the gate, handing the attendant his ticket, not able to look back.  Kate watches him go, tears streaming down her face, as the gate door closes behind him.  She waits, almost willing it to open again...waiting...waiting...but it doesn't...    A huge space with gleaming hardwood floors, ornate moldings, and a great view of the Hudson and Jersey behind it...  The place looks like a museum display...everything is of the highest quality and meticulously maintained.  A wall of photos - Jack and Clinton, Jack with Patrick Ewing, Jack between Alan Greenspan and Henry Kravis.  And a \"Willie Mays\" baseball bat encased in glass...    ...impeccably decorated and obsessively neat.  Close in on the bed where JACK CAMPBELL, now 35, sans mustache and long hair, opens his eyes. A FLASH of bright morning light from the window.  Jack shields his eyes, turning his head toward the bathroom where he sees...  A WOMAN'S BACK...draped in a towel...an incredible back, neither flabby nor overly toned, beautifully curved...Jack focuses on it a moment. As the woman turns to him...  PAULA.  Beautiful, late 20s, a toothbrush in her mouth...      It's not what you think.  I    took Mentadent public...  Paula smiles, moves over to a chair and grabs a little black dress hanging neatly over it.      Of course I did.      You are an amazing lover.  You    should be giving motivational    seminars.      I want to see you again.      Tonight.  She turns to him.      So we'll get egg nog.  Paula laughs.      Jersey?  You know what the    traffic's gonna be like?      I've got plenty of places to    go.  He stays there, confident, sexy, waiting for an answer...       If it's something you feel    strongly about. Paula walks to the door, then turns back to Jack.    Jack saunters over to a Yamaha Grand Disclavier in the living room.  He puts a disk into the piano and...  ...the keys come alive with the music of BACH.  Jack hits a switch and suddenly the entire apartment is enveloped in music...    Paula, waiting for the elevator, hears the MUSIC emanating from Jacks apartment...an intrigued glance back at the apartment door as the elevator arrives...    Backs Passion According to St. Matthew is blaring through the speakers, the music is swelling to full orchestra...  Jacks at the mirror in this incredibly neat marble- tiled bathroom, shaving with a silver-plated Hammacher Schlemmer razor, HUMMING with the orchestra...    ...the size of a small house, a long row of Zegna suits, shoe trees stacked with Italian shoes, tailored shirts everywhere.  Jacks still HUMMING to the music as he dresses in front of a mirror.       Mrs. Peterson.      Its because Im shy,    Betty.  So, when are you    going to leave that old    corpse Mr. Peterson and    run away with me?    TONY THE DOORMAN holds the door open for Jack and Mrs. Peterson...      Howd you do this year,    Tony?      Just until the Deutsche    Mark turns...  Jack exits the building...        ...if MedTech's shares sink    any lower than... (casually executing  a keystroke    ...forty three, we're in    trouble with the stock    valuation.  So for god's sake    watch what you say to your    institutional customers...  Jack notices Alan Mintz playing with the cherub.      ...we still have almost a full    day of trading before zero    hour and I don't want any    trouble...     ...penny for your thoughts,    Alan...  Alan looks up.      Is that tonight?  A LAUGH from the group.  Jack approaches Alan.      You think I like being here on    Christmas Eve, Alan?      Okay, maybe I do have a touch    of tunnel vision this holiday    season.  But in two days we're    going to announce one of the    largest mergers in U.S.    corporate history.  Thirty    billion dollars...     When this kind of deal turns    up you get on and you ride it    `till it's over.  You don't    ask it for a vacation...  A chuckle from the group...the esprit de corps seems to energize Jack.       December 26th.  After that    there'll be so much money    floating around here it'll be    like Christmas every day...     December 26th, people.  If    you'd like to celebrate that    day, you all have my    blessing...  Enthusiastic nods and words of agreement from the suits around the table...      I don't want you to be sorry,    Alan, I want you to be    excited.  I want my gift to be    the first one you open this    year.  You know why?      Because my gift comes with ten    zeroes at the end...  A MURMUR of excitement in the room, even Alan cracks a smile.  Jack puts a hand on Alan's shoulder.      Good man...      You too?  This holiday's about    giving, Adelle.  And I'm    giving everything I've got to    this deal, so in a way, I'm    more Christmassy than    anyone...     Lifesaver?    ...continuing past Adelle's desk, Jack looking at his messages, and into Jack's office...    A cavernous office, you could land a helicopter in it - high tech fixtures, full bar, leather sofa, $3,000 Stairmaster...  Jack walks to an enormous, bare mahogany desk, and sits down in a high tech ergonomic leather chair.      Ooh, my suits are ready...  He gets to the last message, sees the name on it, and reels back.      Kate Reynolds...      Her assistant?       Kate Reynolds was my    girlfriend in college.  I    almost married her...       Almost married.  And almost a    junior broker at E.F.    Hutton...      She didn't want me to go to    London.  We're standing at the    airport saying goodbye and she    asks me to stay.      God, no.  I thought about it    for practically the entire    flight...      I took the road less traveled,    Adelle.      No...      She's probably just having a    fit of nostalgia.  You know,    lonely Christmas Eve, call the    one that got away, that kind    of thing.  Adelle rolls her eyes at him.      I'm telling you, it's ancient    history...  Jack looks up as PETER LASSITER, 60s, founder and chairman of P.K. Lassiter and Associates, saunters into the room.      Peter.  I don't see you    rushing home to trim the tree.      And God love you for it.  Lassiter drops down in a soft leather chair opposite Jack.      That'll happen when you're    about to spend thirty billion    dollars on some aspirin...      Why are you staring at my    breasts, Peter?      Where is he?       Call Aunt Irma.  Tell her I    won't be able to make it    tomorrow...  Adelle rolls her eyes at him...      Hey Peter, lemme ask you a    question.  An old girlfriend    calls you out of the blue on    Christmas Eve...      Not by a long shot.       I'll leave from the office    tomorrow afternoon.  Call the    group.  Schedule an emergency    strategy session for noon.    Jack is alone in the office working on his computer, checking spreadsheets on a large flat screen monitor.  Jack leans back in his chair rubbing his eyes.  He checks his watch.  It's past eleven.  He gets up, goes to the window, sees the city in all its Christmas glory, then he see it...  ...the message from Kate, crumpled in the trashcan...then turns back to the window, gazing out at the night...      I'm thinking I might walk    tonight, Frank.      Thanks.  To you too...  Jack puts on a pair of soft leather gloves and heads out into the crisp night air...      Egg nog?       Let me see that ticket.  Cash turns to Jack.      Maybe I'll buy it from you.  Now Cash walks over to Jack...      Hey, c'mon...  In a flash, Cash whips a .38 from the back of his pants, aiming it at Jack's face.  The woman SCREAMS, covers her baby.      No.     Look, I'm talking about a    business deal here.  I buy the    ticket for two hundred, take    it to a store where the guy    behind the counter...     ...doesn't have a death wish     ...I just made myself a quick    thirty eight dollars.  Cash gets closer...      Like I said, it's a business    deal...      How'd you know my name was    Jack?      There's no way I was gonna die    in that deli...     Let's just say I've been on a    lucky streak lately.      I don't do that.  That's just    not for me...  Cash looks at him, then smiles.      Hey...  Cash turns around.      What do you want to carry that    gun around for, anyway?    You're just gonna do something    you'll regret...      I'm just saying that you seem    like a smart guy.  At a    certain point you're gonna do    something, and then there's no    turning back...      I mean there must be programs    out there, opportunities...      Everyone needs something.  Cash looks at Jack...      Me?      I've got everything I need.      Look, I'm not saying you'd be    able to do it without some    hard work...      Sure it's about you.  But it's    about society, too.    Jack walks in and throws his keys on a table.  He takes off his gloves and overcoat, glances at the mail, then heads into the bedroom.  Through the large windows we see snow falling...    Jack, flat on his back in bed, fast asleep...   (drawing on a  memory    Ed?  Lorraine?  Big Ed hugs Jack as best he can with an armful of gifts.      Excuse me.  Jack dashes out the door.      Wheres my car?!  Wheres    my Ferrari!?      Look, can I just borrow    your car?!  I promise    itll be returned!      Tony, thank god...  Jack starts to walk past but Tony blocks the way.      What are you talking    about?  Its me, Jack    Campbell.  Penthouse C.    I put you into commercial    paper!      Elizabeth Peterson!  The little dog starts BARKING ferociously at Jack.      You know me, Betty.  You    do.  Jack Campbell.    Were on the co-op board    together.  We fought side    by side for garbage    disposals.  Every morning    we exchange quasi-sexual    witty banter.  Think...  She looks at Jack with a raised eyebrow, the dog still      Thank you, Betty.  I know    if I can just sleep this    off, Ill be fine...      A shelter?!  Im the    richest guy in the    building...Ive got twice    the square footage you    have!  Mrs. Peterson shakes her head at him, a look of pity on her face.  Frustrated, Jack turns and runs back to the mini-van...      Frank.  Wheres Alan    Mintz?  Is he here yet?      Look, I dont know whats    going on here but I am    Senior Vice President of    this company.      Maybe youre not hearing    me.  I am Jack    Campbell... (approaching the  building directory    Right here.  Jack    Campbell, President...  And then he sees it...ALAN MINTZ - PRESIDENT, listed plain as day on the building director...  Jack looks at Frank, then back to the building directory...  A pitying look from Frank...Jack stands there, in shock...      Thats my car!  You stole    my car!      What?!       What the hell is    happening to me?!  Jacks freaking out and Cash is enjoying every minute of it.  Cash hands Jack a paper bag.  Jack starts breathing into the bag.      Brought what on myself?!    I didnt do anything!      You mean because you    thought I was cocky Im    now on a permanent acid    trip?!!  Cash gets a laugh out of Jacks overreaction...       Give me my goddamn life    back!       Please.  Just tell me    whats happening to me.    In plain English.  None    of that mumbo jumbo...  Cash turns to Jack.      I glimpse?  A glimpse of    what!?  What glimpse?!    Glimpse!      I asked you a direct    question!  A glimpse of    what?!  A look from Cash.      How much time?!      Look, I just want my life    back.  Now whats it    gonna take?  You wanna    talk turkey?  Lets talk    turkey!  How much    money...?  Cash looks at Jack, relishing the moment.  He flashes Jack a smile.      Why not?      Figure it out?  Figure    what out?!  Cash just stares at him...      Thats it?  Thats all I    get?!  A glare?!      Look, I dont have time    for this right now.  Im    in the middle of a    deal...     You know what?  Ive had    it with you.  Ive had it    with all of this shit...  SCREECH...Cash slams on the brakes...practically sending Jack through the windshield.  Jack recovers, looks up...the car is parked right next to the mini-van.  Cash pulls out a small plastic bag, holding it out to Jack...      Whats this, a signal?    Will you come whenever I    ring it?       But what do I do?      Hey, you did this to me,    you cant just leave me    like this.  Cash looks at Jack, the desperation on his face.       Thanks, man...  Jack gets out of the car...and before he can even turn around, Cashs door SLAMS shut and the car takes off in a blast of horsepower...  Jack stands there gazing down the street, listening to the sound of the Ferrari shifting gears, disappearing...  The wind whips up...shivering, Jack looks toward the Lassiter Building, then to the plastic bag in his hand, and finally to the mini-van.      Excuse me.  Do you know    where Merrison Street is?  Arnie looks up and sees Jack in the van.       Great room...  A satisfied smile from Arnie, Jacks approval means something to him.      Were friends, arent we?      Im having kind of a bad    day.      Is it...?      I dont think so.      Kates my wife...  Jack looks at Arnie as if hes seeking confirmation.       Its just two kids,    right?  A chuckle from Arnie.      You cut your hair...  A curious look from Kate.      Yeah...fine.  She gives him a resolute nod, then...       I dont know!  Please    stop yelling at me!  She looks at him curiously.      I was in the city.      Because thats where I    live.      Look, you dont    understand.  I woke up    here...and this is very    strange ...this is not my    house...  A raised eyebrow from Kate.  Jack moves around the room...       Im not Dad....  Kate,    youre not my wife...  Kate looks him over, assessing, then...      Im...Im sorry.  Kate looks at him.  He seems sincere enough...      Party?  Oh no, I cant go    to a party...      Trust me on this Kate.  I    really dont think going    to a party is the right    move for me at the    present time.  Kate looks at him a moment, then shakes her head.      What are you doing?      Why not?      Ill be ready in ten    minutes.  He walks past her...toward a hallway door, Kate watching him...  He opens the door...its a closet.      Christ...     Where the hell is the    bathroom?      This is just... (searching for  the words    ...this is sub-par...  Annie appears at the bedroom door, watching Jack at the closet.  He turns...sees Annie watching him...a look exchanged... then, Annie runs away...  Jack turns back to the closet and mournfully takes a pair of the slacks...     Its lovely...      The Nets?  Youre kidding,    right...?  Nick looks at him in disbelief.       Well...theyre certainly    due.  BILL KRAMER, a huge pile of fried chicken wings on his plate, tugs at Jacks shirt.      Okay...why?      Triple bypass? (pointing to his  plate    You really think you    should be eating all    that?      I dont think so, thank    you...       Theyre great!  Thank    you!  ...Evelyn licks her fingers suggestively then hands Jack the entire tray with a sexy smile...  A raised eyebrow from Kate, still watching...      Well do whatever it is    you do well, and    just...just do it.    Excuse me...  Evelyn nods as Jack walks toward the staircase...  Kate follows Jack with her eyes as he climbs the stairs...       ...what do you mean he    wont come to the phone?!     Do you realize how much    money Ive made for that    sonuvabitch in the last    eight years?!  Click.  A dial tone.  Jack slams the phone down...      Damnit!  He slams the phone again...and again...and again...      Yes, Im fine.  Its just    this god awful football    phone!  Who has a phone    like this anyway?!       So youre a lawyer...?  A chuckle from the group.  Kates confused.      A non-profit lawyer...  People are starting to LAUGH.      Pro bono.  You dont get    paid at all.  Nobody    makes a dime.  Well,    bravo...  Blank stares from everyone, including Kate...      Youre kidding me...      No, shes not.      But its twenty degrees    outside...      Figure it out...Im s    crewed...dont have to    be a genius to figure    that out...  The dog stops, sniffing at a manicured lawn...       Its as good a place as    any...  But the dog keeps moving, pulling Jack with her.      ...but obviously not up    to your high standards...     Okay...he said youre    working on a new deal    now...fine, youve done a    thousand deals, whats    the first thing you do?  Lucys sniffing around someones Christmas display but Jacks too wrapped up in his thought process to notice.      Triage.  Its your    signature.  You survey    the damage, find out    everything you can, you    probe, leave nothing to    chance.  Im just gonna    have to go detective.    How did you get    Mentadent?  You learned    everything there was to    know about toothpaste and    then you pounced...  Jack narrows his eyes, thinking about that deal...      Thats our play here...  Resolute, Jack turns to the dog.      If you could take a dump    some time in this    century, then we could go    home where its warm...  Jack looks around at the unfamiliar houses...      That is if I can even    remember how to get    home...     You remember, dont you    girl?  But the dog ignores him, dragging Jack along...      Hello?  No answer...       Hello!        Uh...that babys crying...      Pull tape...  Jack searches the diaper for the tabs of tape, then gingerly pulls them apart, releasing the diaper from the babys bottom, and seeing whats inside.      Holy mother of god!  Jack holds the diaper out away from him, searching for a place to put it.  Annie points to a Diaper Genie by the dresser.  Jack throws the diaper in, then quickly replaces the lid.  Annie points to the container of Baby Wipes.      You must be kidding...  Annie stares at him a beat.  Then...      No, Im not.  A look of curiosity from Annie.      I work on Wall Street,    you know with the big    buildings...?  No response from Annie...      I live in an apartment    house with a doorman, I    can buy just about    anything I want...  Annie nods at Jack, still suspicious.      This isnt my real life.    Its just a glimpse...      I dont know...  A concerned look on Annies face, Jacks petrified that shes about to cry.      But dont worry, he loves    you and Im sure hell be    back very soon...     ...very, very soon...  Annie approaches Jack, climbing up on a little chair and tugging firmly at his hair.      Who did?      Uhh...thanks...slightly    better looking though,    right?  Annies now stone faced, trying to decide about Jack.      Youre not going to start    crying, are you?  Because    Im not really sure I    could deal with that    right now.  She thinks about it for a moment.      On a case by case    basis...      I think I could figure it    out.      Sure.  Beat.  Then...a smile from Annie.      Check...  He gets out of the van...      Do I get a receipt or    something...?  The woman looks at Jack like hes crazy.      Five thirty.  Okay.      Got it.  Good tip.       Hey!  Annie!  Annie turns back toward him.      Where do I go now?      Big Eds?  Big Eds    Tires?     Why...?      You mean I sell tires...  She shrugs her shoulders and walks off.      Thats what I do.  Im a    tire salesman...      Good Lord...  ...a huge, three-story-tall plastic likeness of Big Ed Reynolds, ten gallon hat, lassoing a tire...      Uh...lemme get back to    you on that one... (looking at his  name tag    Tommy...      Im gonna have to get    back to you on that...Ed.  Big Ed makes a gun gesture with his forefinger, winking at Jack, then turns back to the activity at the counter as...  Jack spots KENNY, a very young sales associate, walking by.  He reaches out and taps Kenny on the shoulder.      Do I have a private    office somewhere in the    building?      Thank you.  Jack walks into the office with his name on the door...    Theres no Stairmaster here, no leather sofa or bar...its small, cramped and cluttered, the walls littered with tire inventory and price lists...  Jack takes a slow, sad lap around the office.  He makes it to the small wooden desk at the far end of the room and sits down behind it...  On the desk are photos of Jack, Kate and the kids, a plastic Michelin Man model, a tire-themed day calendar and a small plastic figurine of a BOWLER, the word, Bowlers Do It In An Alley embossed on its base...  He surveys the desktop briefly, then opens the top drawer, finding a personal checkbook and looking inside...  He sees the bottom line and winces, then puts it back...  Jack picks up the Bowlers Do It In An Alley figurine and gives it a good look...      Bowlers do it in an    alley?...Non profit    lawyers do it for free...    what is it with these    people?  Dont they    realize this refers to    sex?  He replaces the figurine then opens the bottom drawer where he spots a bottle of Glenfiddich.  He lifts it out...      At least you splurged on    some decent scotch...  He takes a paper cup and pours himself a shot.  He drinks it down in one gulp and then crumples up the cup, throwing it toward the NETS basketball hoop/garbage can near the door.  He misses...  He looks more closely at the photographs...most are family photos, a happy Jack with Kate, with Annie at the pony rides, at Joshs birth...in every one of them, Jack is smiling...   (to Jack in  the photo    What are you smiling    about...?  He turns his head...spots a small plaque on the wall behind him.  It reads, Jack Campbell - E.F. Hutton #1 Junior Sales Associate, 1988.  Jack raises an eyebrow...      Number one...not bad.  He grabs it off the wall and looks at it more carefully...       1988...?  I was in London    in 1988...  Jacks jarred into reality...       You never went to London...     ...you never got on that    plane...  He stays there a moment...in shock.  Then...  The P.A. system comes to life...      ...I was the number one    junior sales associate at    E.F. Hutton in 1988.  Did    you know that?      Thats the kind of thing    you can really build    on...      I mean sales has always    been a feeder for M and    A, always...  They approach Mag Wheels where TOMMY, a slick sales associate, stands with a CUSTOMER looking at the displays...      Well, Im just a little    confused right now about    why I work here...  Kenny looks at him nervously.       Do you know why do I work    here...?      I taught you the business?  Another nod to the customer.      Everything I taught you.    I want to hear it all,    right now.  Tommys confused.       What do you want?      Here.  These are great.    Youll need four.  The customer takes the wheel from Jack, looks at it confused...      Hey, you heard the guy,    Im the best damn tire    guy in the state of New    Jersey.     Everything.    Jack is behind his desk, his tie loosened, on the phone...       ...I have no idea what    our inventory level is,    thats why Im asking    you...  A KNOCK at the door...      Look, just send us what    you sent us last month,    okay...?  And keep doing    that until further    notice...  He hangs up the phone as the door opens.  Big Ed sticks his head in...      Ive got all the time in    the world...  Big Ed walks in, followed by SYDNEY POTTER, 60s, a tough looking man...      ...and a helluva bridge    player.  Eds told me a    lot about you...  They shake hands.  Potter nods his head at Jack, immediately impressed.  Big Ed is beaming.      I have no idea...  A surprised look from Potter.  An anxious laugh from Big Ed.       I mean it.  From what I    can tell, were a mom and    pop operation, were    already over-extended in    sales, and any price    advantage we could offer    would easily be matched    by a larger supplier...  Jack continues to stare down Potter.      So like I said, I dont    have any idea why you    should buy your parts    from us...  The staring match continues.  Big Eds getting more nervous.  Potters the first to blink.      Except for rule number    one...  Jack smiles.      The customer is always    right.  A cliché?  Sure.    The difference is, we    mean it.  Were small, we    need our customers.  We    cant afford to    disappoint them, ever.    Yeah, you could go to    some leviathan supplier,    probably save a few    pennies on the price of    oil filters, but with us    you get more than a    supplier, you get a    bridge partner...  A smile from Potter.  Jack gives Ed a wink.  Ed watches, thrilled...      You want to bid hearts,    were right there with    you.  You feel the need    to redouble, youre not    going to get any argument    from us...  Potter nods at Jack.  Jack moves in for the kill.      The big guys may have the    high cards, but you know    as well as I do, Sydney,    high cards dont always    take the trick.  Potter pauses a minute, then...      A Lamaze class...!?      What?!  Thats my deal?       Well thats just    great...those little    monkeys can be a real    handful...  Kate shuts off the TV.      Hey!  I was watching    that!      Im working on a new deal    now...  Kate throws a Kate Bushs The Sensual World into the CD player.      Wait a second.  You want    me, dont you?      Shouldnt we grab some    dinner first?  Maybe a    bottle of wine...?      Whatever you say...honey.  She starts kissing him again...but this time he just goes with it, and as her hands run through his hair hes brought back to a different time and place...  Jack momentarily pulls back and looks at her...its like the first time hes really looked at her in eleven years...       God...youre beautiful...  She smiles at him, almost uncomfortable with the compliment...      No, Im serious...youre    really stunning...      I mean back in college,    you were a very pretty    girl, theres no question    about that.  But this...     ...youve really grown    into a beautiful woman...  Jack stares at her, entranced...Kate pulls back, reacting to the intensity in his stare...       Do what?   Why dont we just go to all the stores?!  Kate looks back at Jack.   Every single store in this godforsaken shopping mall.  We can go to them all.  Kate gives him a look.  Then...   Its an unbelievable thing.  Wearing this suit actually makes me feel like a better person. (taking one final  look Im gonna buy it...  Kate raises an eyebrow, then looks at the price tag.   (pointing to Annies  new Mary Janes She got those shoes...   No.  Kate looks at Jack, a little surprised.   Do you have any idea what my life is like?   I wake up in the morning covered in dog saliva...I drop the kids off, spend eight hours selling tires retail...retail, Kate.  Kate just stands here, aghast...   I pick up the kids, walk the dog, which by the way, carries the added bonus of carting away her monstrous crap...I play with the kids, take out the garbage, get six hours of sleep if Im lucky, and then it starts all over again...and why is it that I always have to drive everyone everywhere?  I spend practically my entire day in that slow as hell mini-van listening to Raffi tapes and trying to figure out how the cup holders work...Im sick of it.   Whats in it for me? Where are my Mary Janes?  Kate stares at him, shaking her head...   I cant believe its not a disappointment to you!  Jesus, Kate, I couldve been a thousand times the man I became.  How could you do this to me?  How could you let me give up on my dreams like this?!  Kate stares at him in disbelief.  Then...    Look, Im sorry.  Im sorry I was such a saint before and Im such a prick now.  Maybe Im just not the same guy I was when we got married...   Forget it... (taking off the  jacket Well get a funnel cake. Itll be the highlight of my week...    Listen, Im sorry about that back in the store. I really dont want to fight with you...  Kate just keeps looking out the window.   But you must sometimes wonder how we ended up here.  I mean back in college, did you see us...  ...here...?  She turns to him.   It really has, hasnt it?  So if you had to...what would you say was the biggest surprise?  She glances at the kids sleeping in the back.   Surprise.  Were pregnant...  Yeah...that mustve been...I mean that was very unexpected.  But what are you gonna do, right?   Sure.  I really like Annie.   No, I love Annie.  We had a lot of good times, didnt we?   Charles Street?  In the Village?  When we were living in Greenwich Village...?  Great times.  Whyd we ever leave?   You had a heart attack?   Thats why I work for Big Ed?  A look from Kate.    I mean, thats why I work for Big Ed...  Jack looks out at the road a moment, piecing it all together in his mind.    So we had a baby, Big Ed had a heart attack, we b ought that house, and Ive been working for him ever since...Sayonara, Wall Street.  Kate looks at him a little strangely.    Our life in a nutshell...   How would you look at it?  She glances again at the kids in the back seat, then at Jack.   Damn...   Hey, Im doing the best I can...  Id like to see you hit a squash ball after seventeen beers...   (quietly, to  himself You are Jack Campbell. Youre better than this sport.  You shot the rapids at Kenai.  You ran with the bulls at Pamplona.  You jumped out of a plane over the Mojave Desert, for Christs sake.  You can do this...  Jack puts everything he has into the throw, heaving the ball down the lane with as much grace and power as he can muster...hitting the six pin and taking out four others.    Yeah!!  He turns, a fist pumped...But the guys could care less...   Evelyn, right?   Something like that.   Youre a nurse?  Evelyn laughs.   Wait a second...  She turns.   Are we...?   Is there something going on between us?  Evelyns surprised at Jacks directness.  She stands there a beat, then walks back toward him.   It would help me if we were.   Do I have your number?  A wide smile from Evelyn.    I just saw Evelyn Thompson.   She wants to have an affair with me.   Pretty much.   (pushing over a  napkin So could you write down her exact address?   It wouldnt really be cheating... (off Arnies  doubtful  look Its complicated.   Im telling you, those rules dont apply to me, Arn.   Hey, is that really necessary?    Long, boring, and generally pretty sad. Arnie seemed to enjoy it...  Hey, wheres that chocolate cake...?  Kate turns around, revealing a huge hunk of chocolate cake on a plate in front of her, a bite ready to go into her mouth.   Thats my piece.  I was saving it because I got nauseated from that store bought chicken.  Kate takes the bite, a little piece of icing sticks to the side of her mouth.   Gimme that cake.  She takes another bite.   Cmon.   I want that cake!  ...reaches up...grabs her shirt...pulls her down playfully on top of him...    I want it...  She looks at him, then takes the whole piece in her hand and smooshes it right in his mouth...  Beat.  Then, Jack starts laughing...   Thank you...   Are the kids asleep?  A sexy smile from Kate...they start kissing passionately right there on the steps...its heating up...   What...?   (in the throes  of passion Yeah, baby, I know what you like to hear...   (swept up in the  moment Oh yeah, youre a bad girl, baby... You make me so hot...Im gonna take you to that special place...  Kate pulls away.   Not it...?   What? You make me hot...  She gets up and heads up the steps, disappearing into the bedroom...Jack shakes his head, frustrated.  Then, he feels something licking at his hand...  He looks down and sees Lucy standing next to him, wagging her tail, looking up at Jack with an Ive gotta go look on her face.  Jack heaves a sigh, then...   Cmon, Lucy, maybe one of us can get a little relief tonight...  He leads the dog toward the front door...    Cmon, girl, lets go home...   And everyone knows image stabilization is for the weak...  Jack is jarred by the image of himself on the video...  Jack on TV...he smiles as Kate walks into frame, easily putting an arm around Jack...    Its your birthday? Today?  Whats your name?  Where were you born?   Wait a minute.  Youre my wife?  She slaps him playfully on the arm...   I do have one thing I wanna say...  Kate looks at him expectantly.  Then...    Oh those fingers in my hair, that sly come hither stare, strips my conscience bare, its witchcraft...  Jack doesnt have the greatest voice in the world but hes not the least bit self-conscious...and Kate seems to like it, theres a twinkle in her eye...some of the guests focus their attention on Jack and Kate.  Jack winces, embarrassed, as he watches himself sing...   ...and Ive got no defense for it, that heat is too intense for it, what good would common sense for it do...  Bill Kramer still at the piano, chimes in with the basic chords for Witchcract, sounding it out as he goes along...   ...Cause its witchcraft, wicked witchcraft...and although I know its strictly taboo...when you rouse the need in me, my heart says yes indeed in me, proceed with what youre leadin me to...  The camera catches the reactions of guests in the crowd... the women, smiles on their faces, wrapped up in the romance of the moment.  Envy on the mens faces as they watch Jack serenade his wife...  A musical interlude from Bill as Jack takes off his jacket...some HOOTS and HOLLERS from the crowd...Arnie captures the image of Kate whistling at her husband...  Arnie follows with the camera as Jack strolls in front of the gathered guests...   Its such an ancient pitch, but one that Id never switch, there aint no nicer witch than you...  Jack watches himself move gracefully.  But its no longer embarrassment on his face, its fascination...  Back in the video, the camera catches Evelyn Thompson watching longingly as Jack moves back toward Kate...Evelyn cant take it anymore, she abruptly turns and walks toward the kitchen...  Jack raises an eyebrow...  In the video...Jack approaches Kate, she couldnt have a more delighted look on her face.  He picks up the verse...   Cause its witchcraft, that koo koo witchcraft...and although I know its strictly taboo...  The camera pans across the crowd, even the men are getting into it, focused on Jack as he sings lovingly, unashamed, to his wife...Nick Careli mouths the words along with Jack, almost as if hes studying him, revering him...  Jack watches the TV, seeing Nick do this...maybe he underestimated his alter ego...  On the video...Jack staring into Kates eyes...   ...when you rouse the need in me, my heart says yes indeed to me, proceed with what youre leadin me to...  Jack and Kate exchange a sexy smile...   Its such an ancient pitch, but one that Id never switch...  Jack kisses her on the lips...HOOTS and HOLLERS from the crowd.   Cause theres no nicer witch than you...  Kate brushes a hand across Jacks face...  Smash cut to Jack watching this...seeing the connection, the heat between them...coveting it...  Back to the video...the music building...the crowd completely in the palm of Jacks hand...   ...than you...  The camera closes in on Jack and Kate as the music builds to a crescendo...   ...than you...  A little musical flourish from Bill as the crowd breaks out into huge CHEERS and APPLAUSE...  Jack, watching this other version of himself in the video, the center of attention, larger than life, focused on Kate...  Back on video...   (speaking quietly  to Kate Happy Birthday sweetheart...I love you.  Kate leans over, giving Jack a deep kiss...OOHS and AHHS from the crowd...but Jack and Kate are in their own little world...  Jack continues to watch himself on the video, his smile fading, becoming a look of realization...then loss...  A tear at the corner of his eye...  The SOUND fades in Jacks head as the action in the video continues...  Hes left standing there...silent, still...   Maybe I should wait...    Zeena...  Jack is overcome with emotion...Yes, its a ZEENA, but this is probably the nicest thing anyones ever done for him...    You really are incredible...   Youre probably expecting something from me...  Hes sweating bullets...watching as Kate gets a quizzical look on her face...   Heres the thing.  I really hadnt planned on giving you your...uh... anniversary gift until tonight. (an uncomfortable  smile You know, anniversarys good all day...   I know that, but...  Beat.  Kate looks at him like shes looking into his soul.   Ill fix it.  Ill go out right now and get you something.  Ill make it right.  That didnt help.   Please dont cry...  Kate wipes the tear away but they just keep coming.   Cmon...cmon...  Nothing.  Finally, he lifts the bike up in the air, RINGING the bell with everything hes got...   (shouting to the  sky Cmon, goddamnit, how was I supposed to know the date of their anniversary!?  I never married her!  Pull back...Annie in the doorway...looking at him.   Like what?   Dont you think thats a little gimmicky?   Maybe theres a jewelry store back at the mall. I could get her a pair of earrings or something.   Right.  Thats a major oversight...  So if Im Kate...I cant really afford the finer things, my husbands career is a crushing disappointment to me, Im trapped in suburbia...  Then...   Did he ever take her to the City?  Annie smiles, impressed.   You look beautiful...  A charmed smile from Kate as she hands Jack her coat.  Jack hands the coats over to the COAT CHECK GIRL...    Thanks, Catherine...  Jack fakes a SNEEZE, trying to cover up...Kate gives him a pat on the back...   Fine...  He leads her to the main room.  She looks out at the room, elegant tables, French country decor, a PIANIST playing Cole Porter...   Whats the difference? Im taking my baby out for our anniversary, damn the costs...   Arnie...  Arnie.  Hell throw you a curve ball once in a while, thats for sure...  Jack puts his arm around her and kisses her on the cheek...   Well have the tureen of quail breast with shiitake mushrooms to start, then the veal medallions in raspberry truffle sauce and the sea scallops with pureed artichoke hearts...sea scallops, North of the Caspian...  Kate looks at Jack, a mixture of confusion and awe on her face.   You may... (perusing the  wine list Also, well have a bottle of Lafite, 1982.  Kate reaches over and pulls down the wine list, reading it upside down.   Just a glass of red wine for each of us...  The waiter nods, then walks toward the kitchen...   But Im gettin close, right?  A noncommittal nod from Kate.  Then Jack notices her look over at the pianist, drawn in by the music.   You want to dance?  A puzzled look from Kate.  Theres nobody else dancing.  There isnt even much room to dance...   Sure there is...  Kate looks around again, then she smiles.  Kate rises, taking his hand.  Jack takes her in his arms, swaying slowly in the limited amount of space, confident and self-assured.  The pianist looks up, smiling, appreciating their role in this romantic moment.  Kate moves with Jack, following his lead comfortably. They look good together...in sync with each other...  People are watching them...some of the men are impressed, others are scoffing, but the women are clearly charmed...   I have my moments...  They continue to dance, in a world of their own...    God I missed that taste...  Kate laughs.   Why are you laughing?  Kate shoots him a look of curiosity.  Jack looks back at her, sees the trust in her face...He puts down his fork.   I need to tell you something.   I think it may help us but theres a slight chance it could make things worse.  She hears the seriousness in his voice.   Are you sure?  She nods.  Jack searches his mind for the right words. Then...   I feel like Im living someone elses life...  Jack looks to her, expecting the worst.  But she just nods reassuringly.  He continues...   I used to be so sure about everything, you know?  I knew exactly who I was and what I wanted. Then one morning I woke up and suddenly it was all different...   No.  Well, maybe a few things.  But mostly just different...  Jack lets out a small smile.  Now hes the one whos reassuring Kate.   I never used to be like this, Kate.  I had it all figured out.  No doubts, no regrets.   Now...I dont...  He looks at her, staring into her eyes, almost desperate for understanding.   But you always seem so certain.   Thats a big one for me, too.   Your pay check is a disgrace to pay checks.   I guess...some of them are probably faking.   Its wonderful...  Kate laughs, nodding.  A pause, then...   And...?  She stops a moment, considering.  Then...   Good things...   Im sure that right now theres nowhere Id rather be than here with you...  Kate smiles at Jack, a loving, secure smile.  Its been a while.    Ill just full yours up to the top. (handing her a  glass Happy anniversary, sweetheart.  Kate smiles, clinking her glass with Jacks.   Im out of the doghouse?   Youre so...beautiful...   My god, all this time...I never stopped loving you...   I dont think Id fight you on that one...  Kate lifts her head and looks at him expectantly.  They kiss.    Jack, still singing, donning his Dockers and short- sleeve oxford...   For the money, theyre hands down the best radial we carry...   You wont regret it...  Tommy!  Set Mr. Conlin up with four B.F. Goodrich G-Force T/As... (looking the man  over ...and give him ten percent off for having the best costume...  Just then, a black ROLLS ROYCE SILVER SERAPH pulls into the lot, its front left tire riding on the rim...    If youre into that kind of conspicuous consumption...   Sure...be careful, he looks like a tough negotiator...  Jack walks inside...   (to Estelle, into  intercom Tell Kate Ill call her back...    Im with a customer. Ill call her back.  He takes his hand away from the phone and walks back outside the store...   Why dont you let me take this one, Kenny?   Peter Lassiter...   Not exactly. Ive seen you on CNBC.  You look taller in real life...    Jack leaning back in his chair, behind the desk of his cluttered, cramped office.   ...truth is, Mintz was so busy timing his wifes breathing he didnt see that MedTech needed Global more than the other way around.  Ten days, two weeks tops, they wouldve approached you with an offer, and Id bet anything it wouldve been thirty billion, not twenty nine...  Problem was, Peter, you had a pussycat running the show. What you needed was a rottweiler.  Lassiter, sitting on the little chair across from Jack, an intrigued look on his face...   Sure. Were going to have to special order that tire. Itll be ready in about two days.  Lassiter nods, then takes a business card out of his wallet.    Kate, sound asleep in bed...  Pan across to Jack, his eyes wide open, lost in thought...    Jack wearing his Zeena suit, sitting behind his desk, distracted, as he listens to HECTOR, 40s, the   Hector...do I usually listen to your personal problems?   Look, I have some business that I have to take care of in the city so Im leaving early...  My advice to you...follow your dreams.   But youre not interested in boutique dollars...  I get it...  They walk into...   (appropriately  deferential Mr. Mintz.    I can see that, Alan.  A chuckle from Mintz.    Uh...actually, yes. Two... good ones.  Another laugh from Mintz.   I was a sales associate, at E.F. Hutton.   Thats right. And auto supply...   Uh...we actually get about sixty percent of our business from automotive service.   We did one point seven million in total revenue...   Well, Alan, I think were gonna have a banner year. Sales are up almost twenty percent in the first quarter and we just landed a major trucking company account.   Thats right. And that would make us number one in our market...  You mind if I stand?  A raised eyebrow from Mintz.  Mintz and Lassiter follow Jack with their eyes as he crosses the room to the desk, pours himself a glass of water...   Look, I know our paltry little two million in sales is about what you spend on office supplies in a year.  And I know some regional trucking company account is nothing compared to a sixty billion dollar merger...    Its okay, Alan. I get it. Im in your shoes, Im thinking exactly the same thing...but heres the thing. Business is business.  Wall Street, Main Street, its all just a bunch of people getting up in the morning, trying to figure out how the hell theyre gonna send their kids to college.  Its just people...  Jacks confidence is throwing Mintz off, but Lassiter appears intrigued...   And I know people.    Take you, for instance...   You drink about sixteen Diet Cokes a day. Youre an excellent father, but you feel guilty about the time you spend away from home. You drink bourbon, but you offer your clients scotch...  Jack looks around the office then back to Mintz.   And your wife decorated this office...  A laugh from Lassiter as Mintz sits there stewing, a caught look on his face.    Youre a little tougher, Peter.  A raised eyebrow from Lassiter, but hes game...   For one thing, you like expensive things.    Okay...you smoke Hoyo de Monterreys. Youre a scotch man, single malt, not because its trendy but because youve been doing it for forty years, and you stay with what works. You have two great loves in your life, your horses and this company. You wept openly the day the Dow hit ten thousand...  Lassiters impressed.   And youre a man who prides himself on finding talent in unusual places...    Because Im here.  On Lassiter...nodding his head. Mintz, a plastered-on smile.   Im prepared to do anything it takes to get this job. Start anywhere you need me to start. Ill park cars if I to... (into Lassiters  eyes The biggest part of judging character is knowing yourself. And I know this, I can do this job. Give me a chance, Peter, I wont let you down.  Lassiter returns Jacks gaze with equal intensity. In a moment, he turns to Mintz.   (not particularly  impressed Seven.  Really.  They turn a corner, coming into a deserted section of the corridor.  Mintz stops, turning to Jack.  Jack returns Mintzs gaze with a quizzical look.   God, you really are different, arent you...  I mean...wow...I am impressed.  Now its Mintzs turn to look quizzical.   Good for you. Why shouldnt you protect whats yours.   Oh, Im hearing you, Alan. Thats not the problem. The problem is that what you think is yours, is really mine.  And I dont care how low on the totem pole I start, I will get it back... (poking him in  the chest So do yourself a favor and dont get too attached to that view because sometime soon, maybe very soon, you and your French country antiques, your chintz sofa, and your little play pen are gonna be moving out of that office.  Jack smiles at Alan one more time, then turns...   Oh, and by the way, you try selling tires for a living.  I promise you, youd starve.  Jack heads down the corridor, whistling a happy tune, leaving Mintz standing there, bewildered.   Welcome to Xanadu...  The place is incredible...marble floors, architectural lines, high tech fixtures, elegant modern furniture... its striking but not at all homey like the Jersey house.   Pretty incredible, isnt it?   Think bigger.   This place is a perk, Kate.   A company called P.K. Lassiter and Associates Investment House uses it to attract new executives...  Kates confused.   Youre talking to their new Vice President of Mergers and Acquisitions.   Im going into arbitrage, honey.  Turns out I have a knack for it.  Ill be making two hundred grand a year plus a hefty bonus and thats just to start.  And, we can live in this apartment practically rent free for as long as we want.  Jack measures her reaction. Its not good...   We can finally afford to move back into the city. In style.  Kate just looks at him, in shock. Then...   I dont think so. This is going to be a better life for all of us, honey.  Well put Annie and Josh in private schools...   Im talking about the best schools in the country here, Kate...   This is New York City, its like the needy people capital of the world.  Those Jersey clients of yours arent a tenth as pathetic as the ones you could get here...   No, this is the center of the universe.  If I were living in Roman times, I would live in Rome, where else?  Today, America is the Roman Empire and New York is Rome itself. John Lennon.   Look, Im detecting a kind of funky tension here...We dont have to live in this apartment. I dont need this...Ill commute...Ill drive to work...  Jacks back on his heels...seeing his dream picked apart...   Kate. Youre not understanding me. Im talking about a great life.  A perfect life. Everything we pictured when we were young. The whole package. You said it yourself, life has thrown us surprises, and so we made sacrifices. But now I can finally get us back on track...  A sad chuckle from Kate.   I can do that.  I want to do that.  For all of us. I need to do that as a man...  Think about it.  No more lousy restaurants, no more clipping coupons, no more shoveling snow...   Look, youre making this into something its not. This isnt a referendum on our lives, Kate. Its a step forward...  Dont you see?  Im talking about us finally having a life other people envy.  Silence.  Kate looks him in the eye  a deep, piercing look...   Very nice. What is it?   Ah. A classic...  Annie starts PLAYING again as Jack looks at the dresser. She has 20 or so family photos lined up and down its sides...  Jack studies them...in every one Jacks face is totally contented.  Jack studies them, looking at his own face.  Annie lowers the bow, watching him...  Jack turns to her.   Please dont stop...  She smiles, then starts PLAYING again.  He turns back to the pictures...   From London to New York...?  I came back...  Then...a NOISE...  Jack turns and sees Kate walking into the doorway, standing there...She sees Jack holding the Pan Am ticket sleeve.   What are you doing?   Four ninety nine?! Its just salt for gods sake...  On the entrance to the store...the door opens, a YOUNG GIRL, 17, enters, an average suburban teenager...  She glances at a fashion magazine, picks up a package of gum...  From the POV of the cashier, we see the girl approach the counter...  On Jack, crouched down in the aisle. He grabs a bag of salt from the shelf, when...   You...!  Then...the color drains from Jacks face...   What are you doing here...  Jack moves toward Cash at the counter...   Youre not sending me back...  The girl eyes Jack curiously, then removes a dollar bill from her pocket and slides it across the counter to Cash...   Im not going back...  The girl hesitates...Cash turns to her...    Hey! Did you hear me...?!  Cash ignores Jack, watching the girl as she heads to the door, hesitates a moment, then walks out...  A look of disappointment on Cashs face as he reaches into his pocket, pulling out a little notebook...  Cash looks at Jack.   Hey, Im talking to you! I am not going back, do you understand...?!  Cash looks at him, compassion on his face.   You cant do this. You cant keep coming in and out of peoples lives, messing things up...   Ive got kids, Im going home...   (pointing at  Cash Im staying.  Cash follows him with his eyes, a proud look on Cashs face as Jack leaves...   No, honey. Go back to sleep.  She closes her eyes as Jack stands there for a moment looking at her, sadness all over his face.   Take care of yourself, Annie.  Im going back to the mother ship...  Finally, he turns to go...   These last weeks, Kate, I know that Ive done some...some unusual things.  Kate nods.   But Ive done some good things too, havent I?   I need you to remember me, Kate.  How I am right now, right this very moment.  I need you to put that image in your heart and keep it with you, no matter what happens.   Please, just promise me youll do that. You have to promise, Kate. Because if you dont, then its like it never happened and I dont think I could live with that.  Shes a bit confused but she couldnt be more in love with him.   Promise me again...   Soon...      Yeah...okay, send her up...  He drops the phone...turns back over...lets his eyes stay closed for another moment...then...  His eyes open...  He looks around...sees his shirtless torso...then his old apartment...tailored clothes on the floor.    Damnit.  Jack looks at the clock, 9:23 a.m.  He gets out of bed, throwing on pants and a pair of shoes, and leaves the room...    ...Jack walks to the door just as...  The doorbell RINGS.  He stops, then cautiously opens the door, seeing...  PAULA, wearing a long overcoat and a wide smile on her face.   Paula...  Paula opens her coat  the only thing she has on underneath is a sexy little teddy.   (momentarily   distracted Thats totally see through...    Christmas?  It cant be Christmas...  Jack stares at her, totally confused...   Is Kate here? Does Kate live here?!   Damn...damn...damn...   No...Im not...   Im sorry, no...  Jack walks off, beleaguered...    Its me, Jack...   Tell me you recognize me, Arnie.  Please...   We bowl together. Were bowlers ...we won a championship...were winners.   Yes...Jack Campbell...    Yes, thats it...yes, we went to high school together.   Yeah...I guess I just wanted you to know, we couldve been really good friends...    Hello?   Adelle?   Ill be there in twenty minutes...    Whats going on here?   You know something, Alan. Theres a much more assertive person somewhere inside of you...  Alan looks at him, confused.   But I think I like you better this way...   No.   Ill tell you exactly what were going to do.  Youre going to do whatever you have to do to find out which European company hes been talking to.  Then Im going to clean myself up, fly to Aspen, and drink egg nog with Bob Thomas.  His wife and kids will be playing in the background while I spend Christmas day convincing him that the European company is the devil and Global is the answer to his prayers, after all...  Then Im going to spend four hours skiing. Alone. On Christmas day. Completely and utterly alone. Im going to do that because that is my life, that is whats real, and there is nothing I can do to change that...  Jack leaves the office to the shocked stares of his team.    For Manhattan...Kate Reynolds...I need an address too...  Jack jots something down on a business card.  Then he hangs up the phone, thinks a moment, looks out the window, then turns to the driver...   Make a right here...   Were not going to the airport...   Im Jack Campbell...Im an old... friend of Kates. I just called.  The woman looks at him, then walks back inside...   Kate...   You look great.    I'm sorry...   Whats going on?   Paris?   Youre moving...    To Paris. Paris, France.   So youre not at a non- profit firm?   Youre not married, are you?   Not exactly...  Can we just take a minute here?  Maybe get a cup of coffee or something...?   Do you ever think about us, Kate?  About what might have happened...?  A bemused LAUGH from Kate.  Then she sees hes not laughing...   Sure. Goodbye, Kate.  He leaves...    A scratchy Zeppelin album, the song All Of My Love, fills the room. Jack, a fifth of Bushmills by his side, goes through the box Kate gave him.  He removes a worn leather jacket, feeling the soft material, then a Mondale for President button, which Jack smiles upon seeing, a couple Neil Young concert ticket stubs...  He puts the leather jacket on, then sticks the Mondale button on the lapel.  He digs back into the box, finding...  A messy, dog-eared copy of Cats Cradle...not the one Kate gave him at the airport, the one she replaced...  Jack looks at it for a moment...lost in his sadness... then...  He looks over at the clock, it reads, 8:29.    Kate!  Kate turns and sees Jack, a look of puzzlement on her face.   You cant go!   Dont get on that plane!   Please. Lets just go have a cup of coffee. Thats all Im asking for. Im sure theres another flight to Paris tonight.    We have a house in Jersey!  Kate turns to him with a look that could kill.   We have two kids, Annie and Josh...  ...Kate looks at him, half-mortified, half- interested...   ...Annies not much of a violin player but she tries really hard. Shes a little precocious but thats only because she says whats on her mind. And when she smiles...  Jack shakes his head, remembering, fighting back the tears...   And Josh...he has your eyes. He doesnt say much but we know hes smart...  ...hes always got his eyes open, always watching us... sometimes you can look at him and just know that hes learning something new... its like witnessing a miracle...  Kates expression has sifted from annoyance to curiosity.   ...the house is a mess, but its ours...  ...well, after a hundred twenty two more payments it will be...  Jack begins walking slowly toward Kate...the world of the airport going on around him, Jack not caring...   And you...youre a non- profit lawyer. Thats right, completely non-profit. But that doesnt seem to bother you...  Kate raises an eyebrow. Its something shes thought about.   And were in love. After thirteen years of marriage were still unbelievably in love...  You wont even let me touch you until Ive said it...  Jack gets closer and closer...Kates spellbound now... imagining the picture Jacks painting...   ...I sing to you...not all the time but definitely on special occasions...  Jack walks into a piece of carry-on luggage sitting by a row of passengers...    Excuse me...  We made a lot of sacrifices, dealt with our share of surprises, but we stayed together...  Jacks nearly there...   You see, youre a better person than I am...  Not in this life, and Kate knows it...   ...and it made me a better person to be around you...  Kate is perfectly still, Jacks words echoing in her ears.   Maybe it was all a dream. Maybe I went to bed one lonely night in December and imagined it all. But I swear, nothings ever felt more real to me...  Hes right in front of her. She cant take her eyes off him.   And if you get on that plane right now, itll disappear forever.  Silence. Jack and Kate in their own little world...airport business going on around them...   I know we can both go on with our lives. And wed both be fine. But Ive seen what we can be like together...And I choose us...  Jacks words resonate in her ears. He gently touches a hand to her arm...   Please, Kate, one cup of coffee. You can always go to Paris. Just please, not tonight...  She stands there, frozen, staring into Jacks eyes, searching for the answer.",
        "Cash": "Oh yeah...yeah, yee-ah!  She's    a certified winner...paper-    thin but good as gold...  Jack notices Cash talking to himself, seemingly crazy.  Jack approaches Sam Wong at the counter.   (in the b.g., to  Sam Wong    Y'all do the lotto here...?    `Cause I got me a winner...I    know, I know, Lotto keeps the    black man down... but not    me...  Jack grabs a carton of egg nog, then notices Cash handing Sam Wong his ticket.  Jack heads back toward the counter...      ...06...14...18...48...right    there.  Four numbers...that's    two hundred and thirty eight    dollar...     Merry Christmas and shit...      What're you talkin' about?      What!?  Look at the ticket...!      You're lookin' at me, you're    not even lookin' at the    ticket!  The woman with the baby puts a loaf of bread back on the shelf, starts nervously inching toward the door.      You first generation,    xenophobic, money-theistic,    hot pastrami sandwich    making...        Was I talkin' to you?!  Jack looks at the woman, the college kid, the Santa, then...      Guy in $2,000 suit gets ass    kicked tryin' to be a hero.    Film at eleven... (then...turning to  the coffee machine    What?!  Oh no, not another    lookie-loo.  You know how big    a job this is?  The patrons exchange nervous glances...Jack watches, confused.      You're double bookin' me!    You're gonna get double    billed!  Shit!  Cash throws a bottle of Perrier against the wall, it SHATTERS.  The woman reels back in terror with the baby...       Do you want to die?  Jack stares at Cash, trying his best to keep his cool...        Yes you do...      Damn, you are the real    thing...  Cash narrows his eyes...then, a smile as he puts the gun back into his pants...      C'mon, Jack, let's get outta    here...     You were lookin' at me, papa,    you shoulda been lookin' at    the ticket.  That ticket was    legit, B.  You're fake...  Cash starts out of the deli.  Jack follows...      I call all you white guys    \"Jack.\"  Jack nods...      You know you seem pretty    relaxed for a guy who just had    a gun pulled on him.       A lucky streak, huh?  Jack hands him the money.      Sound pretty sure of yourself,    don't you?  Jack nods.      So you're telling me, you've    got a gun to your head and you    don't think for one second,    what if this, what if that,    maybe I shouldn't do this, I    shoulda done that.      Okay, Jack.  Nice doing    business with you...    Cash is about to take off...      You want to talk about    regrets, you're talking to the    wrong person.  Jack casually takes the egg nog out of the bag, opens the carton...      Yeah, in most cases that'd be    true.  Jack takes a sip of the egg nog.       Wait a minute, wait a    minute... you're tryin' to    save me?  A look from Jack...      Oh man, you're serious...     This man thinks I need to be    saved!      Yeah?  What do you need?      You just said everyone needs    something.      Wow.  It must be great being    you.  You got it all.  Cash looks at Jack.  He smiles and shakes his head.       You still think this is about    me, don't you?      Oh man, I'm gonna enjoy this    one... Just remember, Jack,    you did this.  You brought    this on yourself...  And with that, Cash turns and leaves Jack alone on the street with his egg nog...      Miss me, Jack?      Its a callable asset    seized in accordance with    the acquisition by-laws    of your alt-fate    contract...      Basically, its my car    now.  Get in.  Cash reaches over and opens the door.  Jack hesitates...      Look, I dont make the    rules, Jack.  This is how    it works.  Get in.  Cash gives him a reassuring look.  Jack gets in...      Might wanna fasten your    seat belt, Jack...      This kinda thing makes a    lotta guys throw up.    Seen it happen.  So if    you get the urge, do it    out the window. (with a taunting  laugh    I dont want you marring    this exquisite leather    interior...  Cash looks over at Jack...hes really losing it, sobbing into the bag...almost hyperventilating...Cash smiles...      Look, I dont know what    youre getting so worked    up about, you did    this...you brought this    on yourself.      No?  Cmon, Jack...Ive    got everything I need, I    dont have regrets,    thats just not for me...    sound familiar?      Everyone else in that    store is a statue, they    see their lives passing    in front of their eyes,    but not you.  Youre    making a business deal...      You?  What about me?  Im    working hard for you    here, Jack.  On Christmas    too!  Now you did a good    thing last night,    intervening that way.  I    was moved...      Its a glimpse, Jacko.      Look, eventually,    everybody gets one...some    of em take a couple    seconds...     ...some of em take a lot    longer...      Figure it out.  You got    plenty of time.      As long as it takes to    figure it out.  Which, in    your case, could be    considerable.      Do I look like I need    your money.  It doesnt    work like that and I    cant tell you why.      Because you got to figure    it out for yourself.     Are you listening to me?      Look Jack, in my    experience the best way    people deal with this is    to just relax and breathe    through it...let it come    to you.  Jack faces Cash, simmering...with frustration.      Oh youre working on a    new deal now...did I    mention that?      Here...  Jack looks inside the bag, pulls out a BARBIE BICYCLE BELL.  He looks at it curiously.      Do I look like I live in    a bottle?  Cash reaches across Jack and opens the door.      Look Jack Im late.  Id    love to help you out some    more but I gotta go    handle my business... (gesturing to  the mini-van    Happy trails.  Jack looks out to the lonely street outside, then back to Cash.      Fine.  You want to know    everything, Ill tell you    everything.  But not    here.  Lets get some    air...  Jacks still a little unsure...he sees Cash open the driver side door...   Thatll be sixty five cents, little angel...  Jack registers the voice...he rises slowly, looking over to the front counter...where he sees...  Cash, dressed in a typical chain convenience store uniform, ringing up the teenager...  An excited smile from Jack at the sight of Cash...   Jack, its good to see you...  Cash reaches into the register, taking out change for ten dollars...he hands the girl $9.35...    Thank you darlin...  The girl looks at the money, realizing that Cash has given her the wrong change...   (back to Jack,  seeing the  rock salt What do you got there, rock salt?  Look at you, all domestic and shit... You really figured some things out, huh?  The girl looks at Cash talking to Jack...    Everything okay...?  She looks at him, a moment of decision, then...   (making a note  in his book  That was a character issue...  ...and for nine dollars? Thats just sad...   Cmon, Jack...  Jack throws six bucks on the counter...   You know what the word glimpse means, J? Its by nature an impermanent thing.  Jack walks determinedly toward the exit. He stops and turns at the door...",
        "Alan": "Sorry, Jack.  I told Dee and    the kids I'd be home by    dinner.  You know, it being    Christmas Eve and all.      I don't know.  Maybe...  Another LAUGH.  Even Jack lets out a good-natured chuckle.      You're right, Jack.  Sorry...    Jack approaches Alan.      Why Jack?    Past the assistants desk...    Its Jacks old office but you wouldnt know it from the decor...lots of country pine, a fabric sofa, and a play pen where the bar used to be.  Jack enters, immediately struck by the difference...   Jack, of course.  They shake hands.   Please, call me Alan. We try to cultivate a casual atmosphere around here...   You have kids, Jack?   Thats great... (gesturing to  the sofa Why dont you have a seat?  Jack nods, sits down on the plush sofa, Mintz and Lassiter take the chairs.   So, Peter mentioned that you were an avid CNBC watcher but didnt say whether you had any actual Wall Street experience?  Jacks a little taken aback by the question, not realizing he was walking into an interview...  He crosses his legs, trying to get comfortable.   A broker? Really. And now youre in the tire business?   Uh huh. The retail end, I understand.  Jack nods...   Mind if I ask what kind of sales you did last year? Ballpark...   Uh huh...one point seven. And what do you project for this year?  Jack pauses, analyzing the situation...the patronizing questions, the smirk on Mintzs face...    Any thoughts at all on that?  As Jack stares into their faces, he realizes the extent of his handicap...   Jack?  He stops, takes a moment, looking at Mintz and Lassiter then ...a confident smile.   Really. So youre projecting what, a tad over two million?  A gleam in Jacks eye.   Im not trying to knock the tire business, Jack.   Im sure you do...    What about me?   Id love to.    ...thats our war room. We did seven major deals last year, three of them hostile.   Lets cut the shit, huh Campbell? What, did you go through his wallet or something?  Jacks a little taken aback.   No matter. That circus act back there may have dazzled Lassiter momentarily but it doesnt do shit forme. Even if you get this job, which I highly doubt, let me warn you, Lassiter loses interest in his pet projects very quickly. Im in the big office because Ive proved myself to him year after year and nobody is going to come in here and start turning the old mans head. Especially not some tire salesman from New Jersey. So you watch yourself and stay away from Lassiter, and maybe, just maybe, Ill keep you on after he gets tired of you. Do we understand each other?  Jack stands there, staring at Mintz, silent, expressionless.   Do we?!  Then, a broad smile from Jack.   I dont think youre hearing me.    Thank god, Jacks here. Ill call you right back...  He hangs up the phone as all eyes in the room turn to Jack, immediately fixating on how disheveled he looks.    Jack, are you okay?   Its not good.  Bob Thomas has secretly been talking to a European drug company. Were not sure which one, Julias on it right now. Word is theyre willing to let him buy a minority stake and keep running the entire company.  The Global people are up in arms.  They say we shouldve been prepared for this.  Were in trouble here, Jack...  Jack looks at Alan for a minute.   Excuse me?   Is this another one of those Sun Tzu Art of War tricks?  A sad laugh from Jack.   So what are we gonna do, Jack?  Jack wallows for another moment in his own sadness...   Jack...?  Jack snaps out of it, turning to Alan and the rest of the group...",
        "Mintz": "Past the assistants desk...    Hes expecting you, Mr. Lassiter...  Lassiter doesnt even slow down...    Its Jacks old office but you wouldnt know it from the decor...lots of country pine, a fabric sofa, and a play pen where the bar used to be.  Jack enters, immediately struck by the difference...",
        "Josh": "Annies watching from a baby-size Laz-E-Boy lounger as...  Jack, in a robe, stands in front of a changing table, Josh laying happily on his back, playing with a set of plastic keys.  Jack takes a fresh Huggies diaper and puts it next to the baby.  He surveys Josh, scratching his chin and rubbing his hands like Indiana Jones.  Josh playfully grabs at Jacks nose.  He looks over to Annie.  Shes still staring at him like hes a Martian.  He looks at the instructions on the box of Huggies.    ...into Joshs room.  Josh is wide awake, standing up in his crib, like a prisoner in a cell.  Jack gives him the bottle, pats his head perfunctorily, and then walks out of the room...    Jack walks to Josh.  Hes sleeping soundly.  Jack gently kisses Josh on the head, careful not to wake him.",
        "Arnie": "Jeannie!  I found Jack!      You look terrible...  Jack takes in the decor  its a male leisure time fantasy  old pinball machine, wide screen TV, dart board, and kitschy 50s style bamboo bar...      Truth is I expected you.    Kate called before and    asked if I knew where you    were.  Arnie notices Jacks fascination with the room...      I know, I moved the    Barca-lounger into the    corner.  Its throwin    everybody off.  What do    you think?      You and me, buddy.  We    know how to live...  Arnie shepherds Jack onto a bar stool and pours a drink out of a bamboo bottle holder.      So Jack, you okay?  Jack doesnt respond, his eyes drawn to a softball team photo on the bar...Jack and Arnie kissing a huge trophy with the caption, Plainfield, N.J. Softball League Champs, 1994.      I mean you leave the    house on Christmas    morning, you dont tell    anyone where youre    going...  Jack looks over from the photo to Arnie...      Maybe I dont say it    enough but you moving in    next door to me...  Arnie makes a fist and gestures to his heart.  Jack nods.      Talk to me...  A moment of decision for Jack as Arnie stands there, open eyed, ready to listen.       I read somewhere that the    suicide rate doubles    during the holidays...  A raised eyebrow from Jack.       What am I saying?  You    dont need to hear    that...     All I meant was a lot of    people have a hard time    dealing with all the    forced reverie, thats    all.  Is that you?      Trouble at work?      Its not Kate, is it?  Jack pauses at the mention of Kate.  Arnies eyes widen...       You see, its like were    in each others heads...       Just keep saying it,    Jack, like a mantra.  Arnie comes out from behind the bar, taking Jack by the arm.      Cmon, I better walk ya    home.  Shes mad enough    as it is, right...?    Arnie walks Jack through his backyard...      Look, you fit the profile    exactly.  Thirties,    house, kids, financial    responsibilities.  You    start thinking...this    isnt the life I dreamt    about.  Wheres the    romance, wheres the joie    de vivre?  Suddenly,    every lingerie ad in the    Newark Star Ledger    represents a life you    cant have...      You made a choice, Jack,    a promise to your wife.    Maybe sometimes it seems    like you gave up the    world, but look what you    got...  They arrive at...the backyard of the Campbell house... cluttered with a swing set, a dog run with chewed up lawn, and a wooden sun deck in the process of being built...      Four bedrooms, two and a    half baths, and a    partially finished    basement...  Jack trips over a wayward BIG WHEEL.       Kids...  Arnie leads Jack toward the house.      Okay look, you probably    dont want to hear this    right now but remember    what you told me last    summer when I almost had    that thing with Arnie    Jr.s speech therapist.  A blank stare from Jack as they arrive at the sliding glass door...Arnie faces Jack squarely, grabbing his shoulders and looking him in the eye.      Dont screw up the best    thing in your life just    because youre a little    unsure about who you    are.  Okay?  Arnie gives Jack a comforting smie...      God, it feels so good to    finally give something    back to you...  Arnie turns Jack toward the door and slides it open.      Im gonna hug you now...  Arnie gives Jack a gentle hug...then gives him a little push toward the door...      Good thinking, Bill.    Have another drink.     Hell be lucky if he    lives through the    night...  Nick reaches into his pocket and pulls out a packet of Dutch Masters cigars.  He shows them to Jack, Jack nods politely.  Nick eagerly hands him one...  Nick lights Jacks cigar, then his own...enjoying that first puff...smiling at Jack...Jack dutifully takes a puff of the cigar...nods back at Nick...but its an effort...  Evelyn Thompson approaches, a tray of MUSHROOM PUFFS in hand...    Jesus, Jack, this is a league match, for gods sake!  Jack turns.  Arnie and the BOWLING TEAM are in the scorekeeping area watching Jack make a mockery of the sport.  Jack scowls.   Wheres your follow through?  Wheres your stance?   Youre right.  Why am I so competitive!? Compensation, I guess. Look, just focus, Jack. You can still pick up the spare...  Jack retrieves his ball, sets up, genuinely concentrating...    Okay, Pete, youre up.    Hey Jack, youre all flush.  I guess that seventy-one took a lot outta you.   She is relentless.   She said that?   Oh yeah...  What is it about you?   Whoa...whoa...wait a second, Jack.  Youre not actually gonna cheat on Kate?   Look, maybe Im not as good a consigliere as you are but you have to trust me on this one.  A little flirtations harmless but youre playing with fire here.  The Fidelity Bank and Trust is a tough creditor.  You make a deposit somewhere else, they close your account forever.    Screw the rules.  Im talking about the choice.  Jack looks at him curiously.   Cmon, Evelyn Thompsons got no class.  She doesnt marry Dr. Steve, the womans living in a trailer.   All Im saying it there isnt a guy in Union County who wouldnt give his left nut to be married to Kate...  Arnie takes one last swig of his beer and gets up...   Ill see ya later, Jack...  He leaves Jack alone, thinking...   Jesus, Bill, this thing is an antique.  Dont you even have image stabilization?  Bill stops playing and looks up at Arnie.   So Jack, its your wifes birthday, got anything to say to her?    Jacks car drives by as Arnie carries a bicycle box out to the garbage.  The car screeches to a halt in front of the driveway.    Hey, you cant park that thing here.   I dont care if youre Tim Allen with your fancy car and all your tools, you still cant park here.   Howd you know my name?   I never won anything in bowling.  Arnie peers at Jack through the window.   Wait a second...  Jack...Jack...   Of course. Jack Campbell. I went to high school with you...you played baseball, right?  Youre doing well...   You never really talked to me.  I wanted to talk to you, man...",
        "Peter": "Hello Jack.  You dont    have to stop singing on    my account...      You know you could never    satisfy me the way he    does...  The doors open to the lobby.  Mrs. Peterson walks out ahead.   (to Tony re:  Jack, annoyed    Who is this man?  Tony shrugs his shoulders.   (raising a hand  to Tony    No...      And sleep you shall.    Noblesse oblige is not    dead.  Not yet    anyway...Come, lets get    you some help.  Surely    there must be a shelter    somewhere in this city.",
        "Lassiter": "A modern Wall Street building.  The sign above the glass doors reads, P.K. Lassiter and Associates, Investment House.  The Ferrari SCREECHES to a halt.  Jack gets out, heads into the building...    ...Jack throws his keys to a nearby SECURITY GUARD with a smile on his way to the elevators...    The Manhattan skyline shines through the windows of this beautiful conference room.  SIX EXECUTIVES are seated at a huge oak table littered with coffee cups and lunch waste.  At the end of the table, ALAN MINTZ, 30s, balding, sits with a faraway look in his eyes, three empty Diet Coke cans in front of him.  Mintz is poking at a shiny gold cherub dangling from a small, plastic Christmas tree, sitting in the middle of the table.  Jack is addressing the group from the front of the room, standing in front of a computer with a huge flat screen monitor, covered with stock charts and tables...    The conference room door opens and the SIX ENERGIZED SUITS emerge, each met by an ASSISTANT handing them messages.  Jack is the last one out.  He's met in stride by ADELLE, 50s, carrying a Filofax and a pile of phone messages.      Eight forty-five on Christmas    Eve and Jack Campbell is still    at his desk.  There's a    Hallmark moment for you...  Lassiter heads to the bar like he's done it a million times.   (pouring himself  a scotch    That's because I'm a heartless    bastard who only cares about    money.       I just got a call from Terry    Haight.  Bob Thomas is    nervous...      Someone's gonna have to nurse    him through this.      I need you, tiger..      Aspen.  Jack pauses for a beat.      You're a credit to capitalism,    Jack.  Jack glances at Adelle, then looks back at Lassiter.      You suddenly having trouble    getting dates?      Then leave it in the past.    Old flames are like old tax    returns.  You keep `em in the    file cabinet for three years    and then you cut `em loose.  Jack shoots Adelle a satisfied smile, crumpling up Kate's message and tossing a perfect hook into a N.Y. Knicks hoop.    A single light remains on in the building.    Jack comes out of the elevator, walking past the lobby desk where FRANK, a security guard, sits watching the monitors.    Jack emerges from the building, walking across the large plaza, past the fountain...snow begins to fall...    Jack pulls up across the street and gets out of the van.  Running across the empty plaza toward the building entrance...    Jack bursts through the door, approaching the lobby desk where FRANK the security guard sits.  Frank spots Jack and blocks his way.    ...its desolate...  Jack walks through the plaza like a zombie, his face registering nothing.  He crosses the street, moving toward the mini-van...oblivious...when...  SCREECH...a Ferrari 456M stops within inches of Jacks torso...a VOICE from the car...      I seem to have had some kind of blow out...  Jack approaches, tapping Kenny on the shoulder.    Do I know you?    Well, Im impressed.  A smile from Jack.   I really am...  Jack savors the moment, until...   So, about my car...  Hes jarred back to reality, a little crestfallen...   This has my office address on it...  Why dont you drop it off yourself?  A smile from Jack.    Jack pulling up to the building in Lassiters Rolls...  He gets out of the car, walks to the building, feeling good, confident, stopping to gaze up at the skyscraper...he breathes in deeply, then heads inside...    Jack enters, instinctively tossing the car keys to the SECURITY GUARD...the guard looks at him like hes crazy...    Jack and Lassiter walk together...   ...were really more of a boutique operation, as you can see...    Alan, this is Jack Campbell...the one I was telling you about...  Mintz, a confident look on his face, gets up from the desk and goes to shake Jacks hand.    Lets let the man have his say...  Mintz covers his embarrassment with a smile...   He certainly has your number, Alan.    Thats easy. Youve seen my car.   Oh? And how would you know that?  Jack smiles.    Alan, why dont you show Jack around a bit...    Jack and Alan walking side by side down the hallway... EMPLOYEES passing them by, greeting Mintz, Mintz waving back...    Its a beehive of activity...  Jacks TEAM, anxiously going over reports and flow charts, working the phones, drinking coffee...  Jack enters, still reeling from his experience, taking a moment to observe the action...  Mintz spots him...",
        "Big": "Jack you ol bird dog.    Merry Christmas to ya...  Lorraine plants a big fat kiss on Jacks cheek.      I heard that.  This is    who I am, woman!     Tell her, Jack!  Youre    the only one who gets me,    for gods sake!  Jack, still holding the door open, plotting his escape.      Course you do.  Hell,    its almost 8 a.m.     Where are my two lil    pardners?  Annie!  Josh!    Giddy up, Bid Eds here!      Damned if I know...  They start to remove their coats, when...  The door flies back open...      What the hell are you    talking about?     Whats he talking about?      The Caddy?  Why dont you    take your own damn car!      Hes got a perfectly good    mini-van sitting out    there in the driveway!  Jack grabs the keys off the hook...darts back outside...    Jack approaches Big Eds from the parking lot...slowly, taking it all in...  Its like a Pep Boys with a Texas theme.  A big retail store for tires and auto parts, and a repair bay for everything from alignments to brake jobs...  Jack walks to the tire bay where HECTOR, 40s, a Guatemalan mechanic in grease-stained coveralls, stands with TOMMY the salesman.    Jack walks in...looks around...the store is teeming with activity, a post-holiday sale in progress...  Big Ed, in his signature ten gallon hat, sees Jack from behind the counter...      Jack my boy!  You are    looking mighty worse for    the wear...Hey, guess who    I played bridge with two    nights ago...?  Jack stares blankly at Big Ed...      Hell, youll never    guess.  One Sydney    Potter.  Thats Sydney    Potter, Chief Executive    Officer of BuyRite    Transport.  Only the    third largest trucking    company in the state.  I    even let the sonuvabitch    win, which wasnt easy    because the guys been    bashed in the head by    Teamsters so many times    his brains like    porridge.  Anyhoo, hes    looking for a new parts    supplier... we can handle    that kind of volume,    right?  Jack considers this briefly.    Kenny leading Jack toward the Mag Wheels section.    Jack is behind his desk, his tie loosened, on the phone...      Got a minute, Jack?      Jack, meet Sydney Potter,    BuyRite Transport, one of    Jerseys top    businessmen...  Potter extends a hand, Jack rises from his chair, trying to place the name.  Then...      My daughters no slouch    either...  A smile from Potter, then a serious look.       Cmon Jack...       Thats my boy...     Cmon, lemme show you the    rest of the ranch...  Big Ed and Potter exit the office...       Nice shootin, Jack...  ...leaving Jack there with a satisfied smile on his face.    Jack, pointing to a stack of radials, is standing with a MAN  wearing a pale blue leisure suit and a pair of high top Nike Air Jordans.    ...but hes still focused on Lassiter through the window, cant take his eyes off him...  He gets to the phone...sees the light for line two blinking ...he looks back outside, sees Kenny approach Lassiter...  ...back to the blinking phone light...he picks up the phone...  But cant bring himself to hit the blinking light. Then...    ...towards Kenny and Lassiter.    Jack leaning back in his chair, behind the desk of his cluttered, cramped office.    Jack wearing his Zeena suit, sitting behind his desk, distracted, as he listens to HECTOR, 40s, the",
        "Ed": "...impeccably decorated and obsessively neat.  Close in on the bed where JACK CAMPBELL, now 35, sans mustache and long hair, opens his eyes. A FLASH of bright morning light from the window.  Jack shields his eyes, turning his head toward the bathroom where he sees...  A WOMAN'S BACK...draped in a towel...an incredible back, neither flabby nor overly toned, beautifully curved...Jack focuses on it a moment. As the woman turns to him...  PAULA.  Beautiful, late 20s, a toothbrush in her mouth...      Jack, flat on his back in bed, fast asleep...    Close in on Jacks face, bathed in morning light...he opens his eyes...feels something strange...  Jack looks down...theres a womans head resting on his chest.  A look of confusion crosses his face...trying to remember... did he meet a woman last night...?  He turns his head to find a large MUTT sitting faithfully beside the bed, wagging his tail...  ...did she have a dog?  He looks down at the woman again, craning his neck to get a look at her face.  And then he sees her...      Jack you ol bird dog.    Merry Christmas to ya...  Lorraine plants a big fat kiss on Jacks cheek.      I heard that.  This is    who I am, woman!     Tell her, Jack!  Youre    the only one who gets me,    for gods sake!  Jack, still holding the door open, plotting his escape.      Course you do.  Hell,    its almost 8 a.m.     Where are my two lil    pardners?  Annie!  Josh!    Giddy up, Bid Eds here!      Damned if I know...  They start to remove their coats, when...  The door flies back open...      What the hell are you    talking about?     Whats he talking about?      The Caddy?  Why dont you    take your own damn car!      Hes got a perfectly good    mini-van sitting out    there in the driveway!  Jack grabs the keys off the hook...darts back outside...    Jack at the closet door, looking at a row of Hagar slacks, Docker sport coats and imitation leather shoes...  He reaches in and touches the fabric on one of the sport coats.    Kate is in bed, fast asleep.  Jack walks into the room, his face still red from the cold outside.  He looks over at Kate, sleeping happily.  He takes off his shirt and khakis, laying them neatly on the chair.  He looks over at the pair of flannel pajamas folded on the dresser.  He shakes his head, resigned, then dons the pajamas and climbs into bed...    Morning light streams into the room.  The clock reads, 7:14.  Jack opens his eyes  a burst of light hitting them from the window...like the morning light in his Manhattan loft...  He reaches across the bed...its empty...  A smile of hope from Jack as he puts his head back on the pillow...maybe it was only a day...Then...  The sound of a baby CRYING from the next room...A pained look on Jacks face as he realizes hes still in Jersey.  Now the baby is WAILING...Jack lies still a moment, hoping itll stop...it doesnt.  Then, he hears the sound of the SHOWER TURN ON in the bathroom.  He gets out of bed and walks to the bathroom...    Jack approaches Big Eds from the parking lot...slowly, taking it all in...  Its like a Pep Boys with a Texas theme.  A big retail store for tires and auto parts, and a repair bay for everything from alignments to brake jobs...  Jack walks to the tire bay where HECTOR, 40s, a Guatemalan mechanic in grease-stained coveralls, stands with TOMMY the salesman.    Jack walks in...looks around...the store is teeming with activity, a post-holiday sale in progress...  Big Ed, in his signature ten gallon hat, sees Jack from behind the counter...      Jack my boy!  You are    looking mighty worse for    the wear...Hey, guess who    I played bridge with two    nights ago...?  Jack stares blankly at Big Ed...      Hell, youll never    guess.  One Sydney    Potter.  Thats Sydney    Potter, Chief Executive    Officer of BuyRite    Transport.  Only the    third largest trucking    company in the state.  I    even let the sonuvabitch    win, which wasnt easy    because the guys been    bashed in the head by    Teamsters so many times    his brains like    porridge.  Anyhoo, hes    looking for a new parts    supplier... we can handle    that kind of volume,    right?  Jack considers this briefly.    Kenny leading Jack toward the Mag Wheels section.    Jack is behind his desk, his tie loosened, on the phone...      Got a minute, Jack?      Jack, meet Sydney Potter,    BuyRite Transport, one of    Jerseys top    businessmen...  Potter extends a hand, Jack rises from his chair, trying to place the name.  Then...      My daughters no slouch    either...  A smile from Potter, then a serious look.       Cmon Jack...       Thats my boy...     Cmon, lemme show you the    rest of the ranch...  Big Ed and Potter exit the office...       Nice shootin, Jack...  ...leaving Jack there with a satisfied smile on his face.    Jack is in bed watching CNBC...On the TV a young woman REPORTER at the anchors desk...    Lucy licking Jacks face.  Jack pushes the dog away...as...  The ALARM RINGS.  Kate pushes the button to stop it.    ...and back into the bedroom to find Kate, sitting on the bed, a wrapped present in front of her and a wide smile on her face.  Jack stops, raising an eyebrow at the gift.  He looks behind, as if to ask whether its for him, then back to Kate.    Annie is sitting on the bed watching her mother get dressed.  Kate, wearing a silky slip, walks out of her closet carrying two dresses on hangers, a red one and a sexy little black one.  Kate holds out the two dresses to Annie.      Jack, pointing to a stack of radials, is standing with a MAN  wearing a pale blue leisure suit and a pair of high top Nike Air Jordans.    ...but hes still focused on Lassiter through the window, cant take his eyes off him...  He gets to the phone...sees the light for line two blinking ...he looks back outside, sees Kenny approach Lassiter...  ...back to the blinking phone light...he picks up the phone...  But cant bring himself to hit the blinking light. Then...    ...towards Kenny and Lassiter.    Jack leaning back in his chair, behind the desk of his cluttered, cramped office.    Kate, sound asleep in bed...  Pan across to Jack, his eyes wide open, lost in thought...    Jack wearing his Zeena suit, sitting behind his desk, distracted, as he listens to HECTOR, 40s, the     Jack walks into the room...  The lights are off, Kate already in bed sleeping.  He undresses for bed, unable to take his eyes off Kate.  Finally, he lifts the covers and climbs into bed next to her, moving closer to her, putting an arm around her, drawing her in...  In her sleep, Kate nestles in Jacks embrace.  He savors the feeling, then closes his eyes as...  They lay there...side by side...together...a single person.    The morning light streams into the room.  Kate opens her eyes.  Jacks not in bed.  A look of curiosity.  Then, she hears LAUGHTER from outside.  She goes over to the window...opens the blinds... revealing...  Jack in the backyard, LAUGHING with joy, playing in the snow with Annie and Josh.  Kate watches...a satisfied smile sweeping across her face...      The clock reads, 11:17.  Kate is already in bed as Jack walks in.    The room is dark...  Jack enters, sees Kate sleeping soundly in bed.  He sits down in a chair and watches Kate asleep, a sad look in his eyes...  As he continues to watch her, to listen to her, his own eyelids appear to grow heavy...  He tries to fight the sleep...opening his eyes... focusing on her...but its no use...  Finally, he closes his eyes...falling into a deep sleep...      Snow is falling as Jacks car races up to the terminal then stops. He jumps out. An AIRPORT SECURITY GUARD sees him...    Jack looking at the board. The nine oclock to Paris - Gate 8A. Jack sprints toward the gate...    ...and gets there just as the flight is boarding. Jack looks through the crowd, spotting Kate near the front of the line, about to hand her ticket to the gate attendant.  He pushes through the throng of people, drawing some annoyed stares, finally making his way over to Kate."
    },
    "imdb_rating": "6.8",
    "description": "A modern-day Frank Capra story. Jack Campbell, a successful and talented businessman, is happily living his single life. He has everything, or so he thinks. One day he wakes up in a new life where he didn't leave his college girlfriend for a London trip. He's married to Kate, lives in New Jersey and has two kids. He, of course, desperately wants his life back for which he has worked 13 years for. He's president of P. K. Lassiter Investment House and not a tire salesman at Big Ed's. He drives a Ferrari and not a mini-van that never starts. And most importantly he doesn't wake up in the morning with kids jumping on the bed. After a bad start, day by day he's more confident in his new life and starts to see what he's been missing. Turns out money's good to have but that's not everything.—<speedy33417@yahoo.com>",
    "name": "The Family Man",
    "genres": [
        "Comedy",
        "Drama",
        "Fantasy"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYzYzMTQ4NDYtNWRkZi00NTYxLThlZDItMzI1MmU1MmU5ZWQ3XkEyXkFqcGdeQXVyNDA5Mjg5MjA@._V1_QL75_UY281_CR6,0,190,281_.jpg"
}