{
    "filename": "Dark-Knight-Rises,-The_script.txt",
    "imdb_id": "tt1345836",
    "imdb_url": "https://www.imdb.com/title/tt1345836",
    "characters": [
        "Bane",
        "Dr. Pavel (as Alon Moni Aboutboul)",
        "Foley",
        "Captain Jones",
        "CIA Op",
        "Alfred",
        "Stryver",
        "Blake",
        "Fox",
        "Special Ops Sergeant",
        "Bruce Wayne",
        "Commissioner Gordon",
        "Daggett",
        "Selina",
        "Miranda"
    ],
    "dialogues": {
        "Bane": "Who we are does not matter. What matters is our plan.  It would be extremely painful.  For you.  Of course. Dr. Pavel refused our offer in favor of yours. We had to know what he told you about us.  He would not have told us.  Him, I need healthy. You present no such problem.  Crashing this plane...       Friend. They expect one of us in the wreckage.      Calm, Doctor. Now is not time for fear...  That comes later.      Why are you here?  I'm asking you.  And you brought him down here?  You panicked. And your weakness costs three lives.  Search him. Then I will kill you.  Then show me his body.  Give me your GPS. 30.  Follow him.  Track him. Make sure both bodies will not be found. Then brick up the south tunnel.  Why else would you people be here?  Enter your password. Or I send these men to your home.  For now. How much longer does the program need?  Time to go mobile.  Speak of the devil...  ...and he shall appear.  The plan is proceeding as expected.        Do you feel in charge?  And that gives you power over me?  Your money and infrastructure have been important. Till now.  Gotham's reckoning. Come to end the borrowed time you've all been living on...  I am necessary evil.     Not as serious as yours, I fear.  Let's not stand on ceremony here, Mr. Wayne.  Peace has cost you strength. Victory has defeated you. 85.  Theatricality and deception are powerful agents...to the uninitiated.  But we are initiated, aren't we, Bruce? The League of Shadows. And you betrayed us...  Now I am the League of Shadows, here to fulfill R¯'s al Gh¯l's  You fight like a younger man. Nothing held back. No reserves. Admirable. But mistaken.  You think darkness is your ally. But you merely adopted the dark. I was born in it. Formed by it...  I didn't see the light until I was already a man. And by then it was nothing to me but blinding... 86.  The shadows betray you, because they belong to me...  I will show you where I've made my home while preparing to bring justice. Then...I will break you.  Your precious armory. Gratefully accepted. We will need it.      I wondered which would break first - your spirit...  You don't fear death. You welcome it. Your punishment is to be more severe.  Yes. But not of your body. Of your soul. 90.  Home. Where I learned the truth about despair. As will you. There is a reason that this prison is the worst hell on earth... Hope. Every man who has rotted here over the centuries has looked up to the light and imagined climbing to freedom. So simple. So easy. And, like shipwrecked men turning to sea water from uncontrollable thirst, many have died trying. I learned that there can be no true despair without hope.  So as I terrorize Gotham, I will feed its people hope to poison their souls. I will let them believe they can survive so that you can watch them clamber over each other to stay in the sun... You will watch as I torture an entire city to cause you pain you thought you could never feel again. Then, when you have truly understood the depths of your failure, we will fulfill R¯'s al  This meeting is called to order. 92.  Chair and President. I also need one ordinary member - Mr. Fox, would you care to nominate?  Where you buried your resources. The bowels of Gotham.       Turn it on.  I only need one other board member. There are eight more waiting upstairs.  Do your work. Take them to the surface. People of their status deserve to see the next era of western civilization.   Pull the core out of the reactor.  Five, by my calculations.  For the sake of your family, Dr. Pavel, I hope so. 98.  Let the games begin.  Gotham, take control of your city...  This is the instrument of your liberation...  Identify yourself to the world.  Tell the world what this is.  And who can disarm this device?  Thank you, Doctor.  The bomb is armed, the bomb is mobile, the identity of the triggerman is a mystery. One of you holds the detonator - we come not as conquerors, but as liberators to return control of this city to the people. At the first sign of interference from the outside world or of people attempting to flee, this anonymous Gothamite, this unsung hero, will trigger the bomb. For now, martial law is in effect. Return to your homes, hold your families close, and wait. Tomorrow you claim what is rightfully yours.  Behind you stands a symbol of oppression. Blackgate Prison...  Where a thousand men have languished for years. Under the Dent Act. Under the name of this  Harvey Dent. Held up to you, and over you, as a shining example of justice and good...  But they supplied you a false idol. A straw man. To placate. To stop you tearing down this corrupt city...  ...and rebuilding it the way it should have been rebuilt generations ago...  Let me tell you the truth about Harvey Dent. In the words of Gotham's Police Commissioner, James Gordon...  'The truth about Harvey Dent is simple in only one regard - it has been hidden for too long. After his devastating injuries, Harvey's mind has recovered no better than his mutilated face. He was a broken, dangerous man, not the crusader for justice that I, James Gordon, have portrayed him to be for the last eight years. Harvey's rage was indiscriminate. Psychopathic. He held my family at gunpoint, then fell to his death in the struggle over my son's life. The Batman did not murder Harvey Dent - he saved 109.  my boy. Then took the blame for Harvey's appalling crimes, so that I could, to my shame, build a lie around this fallen idol.'  'I praised the madman who tried to murder my own child.'  'The things we did in Harvey's name brought desperately needed security to our streets... But I can no longer live with my lie. It is time to trust the people of Gotham with the truth, and it is time for me to resign.' Do you accept this man's resignation?  Do you accept the resignation of all the liars?! All the corrupt?! 110.  We take Gotham from the corrupt. The rich. The oppressors of generations who've kept you down with the myth of opportunity. And we give it to you, the people. Gotham is yours - none shall interfere. Do as you please... 111.  But start by storming Blackgate and freeing the oppressed... Step forward, those who would serve...  For an army will be raised...  The powerful will be ripped from their decadent nests...  ...and cast into the cold world the rest of us have known and endured...  Courts will be convened...  The spoils will be enjoyed...  Blood will be shed...  But the police will live, until they are ready to serve true justice...  This great city will endure...  Gotham will survive.  I'm on your schedule, Captain.  Give them over for judgement. Hang them where the world will see. 125.  Bring her to me.  Impossible...  Open fire.  You came back. To die with your city.  Stay back. He is mine -  I broke you. How have you come back?  I never escaped - R¯'s al Gh¯l  Goodbye.  You'll have to imagine the fire - We both know I need to kill you now.",
        "Foley": "No one has. Not in years.  On your desk. But you should put in some more time with the Mayor -  He goes by his gut, and it continues to bother him, whatever the numbers.  Not really. She took the kids and moved to Cleveland.  Really? He's a hero.   And Gordon took SWAT in after them.  No one goes in there till we know what's down there. 28.  Somebody get the hothead out of here. And get me a DWP guy!  This is a hostage situation -  I'm not risking my men for your  Cut the fiber line - shut down the cell tower. That'll slow them down.  Back off, back off! They've got hostages! 53.  Let's roll, they've spotted the Batman!     I'm gonna do what Gordon never could.  I'm gonna take down the Batman.  Negative! Stay on the Batman!      How did you let him go?!  And you don't?! We're not letting one nut with a bad attitude and some fancy gadgets run this town down, you hear me?!        Like a rat in a trap, gentlemen...  Can we help you, officer?     Yeah, yeah - the masked man. We're on it.  Okay, Commissioner, you were right.  Your masked man kidnapped the Wayne Enterprises board. He let most of them go, but took three down into the sewers.  The Mayor won't want panic -  I'm sorry for not taking you  Foley.  Where?  Pull out! Pull 'em out!     You have ID?  How can we trust you?     Jim. He's not here -  Wait in the kitchen, honey.  Jim, you saw what they did to those Special Forces.  This is different and you know it. These guys run the city - the government's done a deal with them  You move against Bane, the triggerman's gonna hit the button - 131.  We have to keep our heads down until they can fix this. If you still had family here maybe you'd -  I'm sorry Jim. I gotta -  You don't know that's going to happen.     Dad! Check it out!  Honey, take a look!       There's only one police in this city.",
        "Captain": "How many of you are there, son? You don't have enough men to stop twelve million people leaving that island.  Why in the hell would we help you keep your hostages?  How many of you are there?  What kind of shape they're in?  Could we break them out?  What about the bomb? The satellites can't see any radiation hot spots...  But you know the truck? 121.  What about the triggerman?  We can't take that chance. Until we have the triggerman, we just track the device, smuggle men over -  Dial it back, officer. This situation is unprecedented. We can't do anything to risk millions of lives.  Which corporation?  Why?  You built the bomb?  Could you disarm it?  We'd have to let the Pentagon know.  We have no choice. Let's move away from this location, then call it in. 124.  I'll die before I talk...",
        "Jones": "How many of you are there?  What kind of shape they're in?  Could we break them out?  What about the bomb? The satellites can't see any radiation hot spots...  But you know the truck? 121.  What about the triggerman?  We can't take that chance. Until we have the triggerman, we just track the device, smuggle men over -  Dial it back, officer. This situation is unprecedented. We can't do anything to risk millions of lives.  Which corporation?  Why?  You built the bomb?  Could you disarm it?  We'd have to let the Pentagon know.  We have no choice. Let's move away from this location, then call it in. 124.  I'll die before I talk...",
        "CIA": "Dr. Pavel, I'm CIA.  You don't get to bring friends.  Why would I want them?      Get 'em on board - I'll call it in.  What are you doing in the middle of my operation? 3. The flight plan I just filed with the Agency lists me, my men, and Dr. Pavel here. But only one of you.          Wiseguy, huh? At least you can talk. Who are you?     You're a big guy -     Why not just ask him?  You have methods.  Well congratulations, you got yourselves caught. What's the next step of your master plan?  Pavel was confirmed dead - plane crash on an Agency pull-out of Uzbekistan... But it certainly looks like him - 104.  Of course not.  Commissioner Gordon? Captain Jones, Special Forces.  Men who haven't seen daylight for three months?  They'll be monitoring our",
        "Op": "Where's the DWP guy?  That was a gas explosion, kid -  Shoot the tires!  No shot!  What's going on with the lights?  It can't be...  The hell was that?!  Oh boy. You're in for a show tonight, son.             You might have the wrong animal there, sir -      How long?  To do what?",
        "Alfred": "Mr. Till, why are your people using the main stairs?  Where's Mrs. Bolton?  The East drawing room. Unlock the door, place the tray on the table, lock the door again. Nothing more. 12.  I'm sorry, Miss Tate, but I've tried. He won't see you.  Mr. Wayne is as determined to ignore important things as trivial ones.  The Dent Act is about all Gotham. Even you, Mr. Daggett. Miss Tate, always a pleasure. 13.  Miss Tate was asking to see you again.  And quite lovely, in case you were wondering.  What are you doing?  And this is your idea of raising the alarm?  She?  Perhaps you should learn to make your own bed, then. Why are you dusting for prints?  Master Wayne?  You haven't been down here in a long time...  She may be. But we have the trace on the necklace.  We should send the police before she fences the pearls.  What was she after?  Fascinating. Maybe you should exchange notes over coffee.  At this point, sir, I would set you up with a chimpanzee if I thought it would bring you back into the world.  And that's the problem. You hung up the cape and cowl, but never moved on. You won't get out there and find a life. Find someone -  I know. And then you lost them. That's part of living, sir. But you're not living - you're waiting. Hoping for things to go bad again. Remember when you left Gotham? Before all this. Before Batman. Seven years you were gone. Seven years I waited. Hoping that you wouldn't come back. Every year I took my holiday. I'd go to Florence. There's a café by the Arno... Any fine evening I would sit there and order a Fernet Branca... I had a fantasy. I liked to imagine that one day I'd look across the tables, and see you. Sitting there with your wife. Perhaps some kids. You wouldn't say anything to me, or me to you, but we'd both know...that you'd made it. That you were happy. I never wanted you to come back to Gotham. I knew there was nothing there for you but pain and tragedy, and I wanted more for you than that. I still do.  I'm sorry, Mr. Wayne doesn't take unscheduled calls. Even from police officers.  Ran it through some databases. He's a mercenary. No other known name. Never been seen or photographed without a mask. He and his men were behind a coup in West Africa that secured mining operations for our friend John Daggett.  It would seem so. I'll keep digging. 33.  The Foundation is funded from the profits of Wayne Enterprises... There have to be some.  I'll get him on the phone -     Which hospital, sir?  Just you, sir? 46.  Don't worry, Master Wayne. Takes a little time to get back into the swing of things.  You've got the wrong leg, sir.  It is terribly painful?  Happy watching, thank you, sir. 47.  Master Wayne, if you're considering going back out there you need to hear some rumors surrounding Bane.  There is a prison. In a more ancient part of the world. A pit. Where men are thrown to suffer and die. But sometimes, a man rises from the darkness. Sometimes...the pit sends something back.  Born and raised in a hell on earth.  No one knows why. Or how he escaped. But they know who trained him one he did...R¯'s al Gh¯l. Your  He plucked Bane from a dark corner of the earth and trained him in the blackest disciplines of combat, deception and endurance. Just like you.  Until he was excommunicated. And a man considered too extreme for R¯'s  That was then. And you can strap up your leg and put the mask back on. But it won't make you what you were.  Someone whose anger at death made him value all life. Even his own.  Yes, this city needs Bruce Wayne. Your resources, your knowledge...not your body. Not your life. That time has passed.  You can fail as Bruce Wayne. As Batman, you can't afford to.  No. I'm afraid that you want to. 49.  Very inconspicuous. Shall I tell the neighbors you got yourself a new leaf-blower? 64.  From the look of the television coverage, you seem to have your taste for wanton destruction back.  Shouldn't the police be gathering the evidence?  They would if you gave them to them  In your mind, perhaps. But there aren't many things you couldn't turn into a weapon.  Perhaps they would've if you haven't made a sideshow of yourself.  Wrong? 65.  You don't. You lead a bloated police force on a merry chase with some fancy new toys from Fox. What about when you come up against him. What then?  When you had something to fight for. What are you fighting for now? Not your life.  Take a good look. At his speed, his ferocity, His training. I see the power of belief. Of the fanatic. I see the League of Shadows resurgent.  By R¯'s al Gh¯l. Who leads them  Is that -?  I'll get this to Fox. But no more.  I've sewn you up and set your bones...but I won't bury you. I've buried enough members of the Wayne family.  You see only one end to your story. Leaving is all I have to make you understand: you aren't Batman anymore - you have to find another way. You used to talk about finishing. About life beyond that awful cave -  What if he had? What if she wasn't intending to make a life with you? 67.  What if, before she died, she'd written a letter? Explaining that she'd chosen Harvey Dent over you?  And what if, to spare you pain...I'd burned that letter?  Because I have to make you understand.  Because you are as precious to me as you were to your own mother and father and I swore to them that I would protect you and I haven't.  I've never lied to you. Except when I burned Rachel's letter.  I'm using the truth, Master Wayne. Maybe it's time we all stopped trying to outsmart the truth and just let it have its day. I'm sorry. 68.  No. I know what this means -  It means your hatred. It means losing the person I've cared for ever since I heard his first cries echo through this house. But it might also mean saving your life. And that is more important.       I'm so sorry. I failed you. You trusted me, and I failed you.  Si, Fernet Branca, per cortesia.",
        "Stryver": "You brought a date?  Very nice.  Oh, yes.  I count fine.  In fact, I'm counting to ten right now...  We can't have loose ends. And even in that dress, no one's going to miss you.  Cute. But they're not gonna be looking in a place like this.  He's drawing the cops off Bane...  Bane says the Batman interfered, but the task was accomplished.  He says, and I quote, they would die before talking.  Nice outfit...those heels make it tough to walk?  Not that we know of -  We told him it was urgent -  I want to see Bane! There's been a mistake! Take me to Bane! 128.  There's been a mistake! Where's Bane?!  Call Bane! I'm one of you!  Exile.  Has anyone made it?",
        "Blake": "I didn't want to bother you up here, but they're looking for you.  Congressman Gilly's wife's been calling. He hasn't made it home from the Wayne Foundation event.  Sir, I've been a cop for a year and I've only logged half a dozen arrests. When you and Dent cleaned the streets you cleaned 'em good. Pretty soon we'll be chasing overdue library books.  But here you are. Like we're still at war...  Or instinct.  Blake, sir.  It's that night. This night, eight years ago. The night Dent died.  The last confirmed sighting of the Batman. He murders those people, takes out two SWAT teams, breaks Dent's neck...then just vanishes?  Don't you want to know who we was?  Name's Jimmy. He's at St. Swithin's.  The boys home where I...I coach some ball.  Why?  The Wayne Foundation gives money for that -  He has a brother here, right?  I'd like to, if that's okay. 22.  I'm sorry.  What was he doing in the tunnels?  What kind of work are you gonna find in the sewers?  It's okay, Miss. It's okay. 26.      They went down there?  Come on, we gotta get down there -  Gas? This is a sewer!  We know what's down there, sir. The Police Commissioner!  I need to see Bruce Wayne.  And if I go get a warrant, in the investigation of Harvey Dent's murder? Would that still count as unscheduled?  Commissioner Gordon's been shot. 31.  He chased a gunman down into the sewers. When I pulled him out he was babbling about an underground army. A masked man called 'Bane'.  I did. One of them asked if he saw any giant alligators down there. He needs you. He needs the Batman.  He doesn't know or care who you are.  But we've met before. When I was a kid. At the orphanage. See, my mom died when I was small. Car accident, I don't really remember it. But a couple of years later my dad was shot over a gambling debt. I remember that just fine.  Not a lot of people who know what it feels like, do they? To be angry. In your bones. People understand, foster parents understand. For a while. Then they expect the angry kid to do what he knows he can never do. To move on. To forget.  So they stopped understanding and sent the angry kid to a boys' home - St. Swithin's. Used to be funded by the Wayne Foundation. See, I figured it out too late. You have to hide the anger. Practice smiling in the mirror. Like putting on a mask. You showed up one day in a cool car, pretty girl on your arm. 32.  We were so excited - Bruce Wayne, billionaire orphan. We made up stories about you. Legends. The other boys' stories were just that. But when I saw you I knew who you really were...  I'd seen that look on your face. Same one I taught myself.  I don't know why you took the fall for Dent's murder, but I'm still a believer in the Batman. Even if you're not.  Because the money stopped. Might be time to get some fresh air and start paying attention to the details. Some of those details might need your help.  Move it, now! We've got a situation.  That way! 51.  Get in your vehicle and stay there!     What's that?  Sir, what about the armed robbers? 55.     But he's getting away!     Are you sure that was him?  Looks like you need a lift. 74.  When you began...why the mask?  You're a loner with no family.  It was damn good to see him back.  They'll figure it out in the end.  Yeah, I've got five hundred pages of tunnel records and a flashlight. I could use some help.  You got money?  John Daggett's body was found in a dumpster an hour ago. I thought you might like to know.  Because Daggett's name is all over the permits I pulled to map the tunnels under Gotham.  MTA maintenance, sewer construction...  This could just be a coincidence.       I showed your picture to the Congressman and guess what?  Head over heels. Pressing charges, though. You've made some mistakes, Ms. Kyle.  You have an appetite. Why run? You can't hide from us with this record.  Who then? Bane? What do you know about him?  We can offer you protection...  When I spotted you, I was looking for a friend...Bruce Wayne.  Did they kill him?      So it's a training exercise.  I've been to half Daggett's cement plants, logged locations they've poured for underground construction... 97.  Honestly, Commissioner, I don't know anything about civil engineering.  Hey.  That was you outside the stock exchange, right?  When? When half the city's cops were trying to pull onto Castle Street and your truck shut them out.  Detective, now.  And as a detective...I'm not allowed to believe in coincidences  What were you doing?! What?! 99.  Commissioner, I'm at the Fourteenth Street plant with two dead witnesses and a lot of questions. Call me - Commissioner, they've got Polyisobutylene here... (Looks around.) And motor oil. They weren't making cement, they were making explosives -  Oh, God.  Patch me into Foley!  They're heading into a trap!  It's a trap! Pull everyone out! Bane's been pouring concrete laced with explosives - 100.  There's a ring around the tunnels - they're gonna blow it and trap the cops underground!  Foley?         What does that mean?  Sir, they'll kill you the second you show your face -  Bane's not gonna let that happen -  And you'll be dead. 107.      We're gonna keep moving you, till we can get you in front of a camera              These men, locked up in Blackgate for eight years, denied parole under the Dent Act. Based on a lie.  Not as much as it does now. But you betrayed everything you stood for.  Your hands look pretty filthy to me, Commissioner.  For the bus in case there's a chance to evacuate. Keep it in here - people are siphoning parked cars.     Less you know, Father. How're the boys? 117.  Yes, sir - take out the mercenaries guarding the outflow south of Ackerman Park, blow the rubble, you've got a hole big enough for ten at a time. I'm in contact with my partner - they're waiting for the day.  Men with automatic weapons who haven't seen daylight in three months.  While Gotham lives under a warlord, like in some failed state?     I was up here looking for a vantage point. Found the people who run the corporation who owns it living here.  Captain, meet Mr. Fox. Mr. Fox, I'd like you to brief the Captain.  And here's the important part.  The bomb's a time bomb.  Bane's revolution is a sham. He's watching Gotham rearrange its deckchairs while the whole ship's going down. Your appeasement plan might not be as practical as you thought.  Fox, somebody sold us out!  You shouldn't be out on the streets       You missed a spot.  No one cares who I am.  Huh. And you always seem to know where those people are. How is that?  No offense, but you got anything bigger in that belt?  But how do we -?  Okay.  What now?  Why?  Don't you need me here?  Thank you.  I might not get a chance later.  Knock on doors, spread the word - the bomb's going to blow! Get out by the South Street tunnel, or over the bridge! Do two blocks, then get back to the bus!      It's gonna blow anyway. We need this bridge open right now.  Whose orders? Bane's?  Haven't you heard the shooting? The Batman's battling it out with Bane  It's Detective -   Wait for me back at the bus.  Your orders are out of date! The situation's changed! Listen, I'm a cop like you. And I'm walking out there. Please don't shoot me.  You idiots! You sons of bitches! You're killing us!!  Father! Get the boys on the bus -  Come on! On the bus!  Protection from the blast -  You think they need to hear that in their last seconds? You think I'm going to let them die without hope? 157.  Heads down! Heads down, now! 158.  They're children! They have no peace to make - Get down! This is it!  No. What you said about structures. About shackles. I can't take it. The injustice. (Gestures at gardens.) I mean...no one's ever going to know who saved an entire city.  Blake, John.  Try my legal name.",
        "Fox": "I'll pass along your request. Next time I see him.  Let's just say that Bruce Wayne has his...eccentricities.  I was not. But it wouldn't do him any good - Mr. Wayne still retains a clear majority.  Bruce Wayne. As I live and breathe.  What brings you out of cryo-sleep Mr. Wayne?  Actually, you did that yourself. See, if you funnel the entire R and D budget for five years into a fusion project that you then mothball, your company is unlikely to thrive. 35.  A wildly sophisticated CEO, yes. Wayne Enterprises is running out of time. And Daggett is moving in.  If you're not willing to turn your machine on -  Then sit tight. Your majority keeps Daggett at arm's length while we figure out a future for the energy program with Miranda Tate - she's supported your project all the way. She's smart, and quite lovely.  We all just want what's best for you, Bruce. Show her the machine.  Anything else?  These conversations always used to end with some...unusual requests.  Let me show you some stuff, anyway. 36.  It was always shut down, officially.  After your father died, Wayne Enterprises set up fourteen different defense subsidiaries. I've spent years shuttering them and consolidating all the prototypes under one roof. My roof.  Stop them falling into the wrong hands. Besides, I thought someone might get some use out of them...  Sure I can't tempt you to something? Pneumatic crampons? Infrared lenses? Least let me get you something for that leg.  Well, then I have just the thing for an eccentric billionaire who doesn't like to walk... 37.  Defense Department project for tight-geometry urban pacification. Rotors configured for maneuvering between buildings without recirculation.  It has a long and uninteresting Wayne Enterprises designation. So I took to calling it the Bat. And yes, Mr. Wayne, it does come in black.  Works great except for the autopilot.  Software-based instability. Take a better mind than mine to fix it.  I was trying to be modest. A less busy mind. Yours, perhaps.  This is Fox.  I knew it!  Answering your own door?  I didn't need to. Page three.  It seems you made a series of large put options on the futures exchange. Verified by thumb print. The options expired at midnight last night.  Long term we may be able to prove fraud, but for now...you're completely broke. And Wayne Enterprises is about to fall into the hands of John Daggett.  Applied Sciences is shut up tight, and off the books. The energy project is a different story.  We're meeting her there in thirty-five minutes. You better get dressed. 70.  Bear with me, Miss Tate.  Keep your hands and feet inside the car at all times.  The reactor is beneath the river so that it could be instantly flooded in an event of a security breach.  I'm gonna plead the fifth on that one.  We have a board meeting to get to.  I'm afraid he has a point, Mr. Wayne.  Right away.  I don't see the need for a board meeting on the energy project -  Where are you taking us?  I won't do it.  Wayne Enterprises.  Miss Tate is fully aware of the situation.  It was built as a fusion reactor. The first of its kind. Bane turned the core into a bomb, then disconnected it from the reactor. 123.  As the device's fuel cells decay, it's becoming increasingly unstable...until the point of detonation.  And it will go off. In twenty-three days.  I don't know, But I could reconnect it to the reactor. Stabilize it.  Take Miranda -  You picked a hell of a time to go on vacation, Mr. Wayne.  That bomb goes off in twelve hours.  If you can get it there. I'll find a way to plug it back in. Can you get Miranda out? 136.  What for?  I like your girlfriend, Mr. Wayne.  They can't be using radio or cell - too much interference. Infrared doesn't have the range. It could only be micro-burst long wave...  Yes. I need the EMP cannon-guidance mount from the Bat. You remember where you parked?  She fly pretty well?  Autopilot? That's what you're there for.  Please, I just need to know what I could've done to fix it.",
        "Bruce": "",
        "Wayne": "Is that what they say about me? 14.  That's a beautiful necklace. Reminds me of the one that belonged to my mother. It can't be the same one - her pearls are in this safe - - which the manufacturer clearly explained is uncrackable.  I'm afraid I can't let you take those.            She's very persistent.  I wasn't.  Examining print dust. We've been robbed.     One of the maids, perhaps you should stop letting them in this side of the house. 16.  I'm not. She was.           Just trying to find out more about our jewel thief. I ran her prints from the photos she handled - - but she was wearing someone else's fingerprints. She's good.  We do, so I cross-referenced the address she went back to with police data on high-end B-and-E's... Selina Kyle. The databases are full of close calls, tips from fences... 19.  She's good, but the ground is shrinking beneath her feet.  She won't. She likes them too much. And they weren't what she was after.  My fingerprints. There was printer toner mixed with graphite on the safe. Gives you a good pull, and it's untraceable.  Now you're trying to set me up with a jewel thief?  There's nothing out there for me.               What can I do for you, officer?  I'm sorry to hear that -  Shouldn't you be telling this to your superior officers?  If Commissioner Gordon thinks I'm the Batman he must be in a bad way  Why did you say your boys' home used to be funded by the Wayne Foundation?      You checked that name? 'Bane' -  Now Daggett's brought them here?  Why did the Wayne Foundation stop funding boys' homes in the city?  Time to talk to Mr. Fox, I think.  No. Do we still have any cars around the place?  And I need an appointment at the hospital. About my leg.  Whichever one Jim Gordon's in.            I see you haven't lost your sense of humor...even if you have lost most of my money.  Even with -  What're my options?  I can't, Lucius.  You too, Lucius?  I'll think it over.  No, why?  I retired.  I figured you'd have shut this place down.  But all this new stuff?  Why?  It's fine the use it gets these days.  Now you're just showing off.  What's it called?  What's wrong with that?  Better mind?  I told you. I retired, Lucius.  That's good -  The Batman wasn't needed anymore. We won.  What if he doesn't exist anymore?  I'm not sure if my assistant put me on the guest list -  Miss Tate, isn't it?  True. Proceeds go to the big fat spread, not the cause. It's not about charity, it's about feeding the ego of whichever society hag laid it on.  Oh.  That's very generous of you.  Sometimes the investment doesn't pay off. Sorry. 42.  Mind if I cut in?  You don't seem very happy to see me.  Felt like some fresh air.  I have a powerful friend who deals with this kind of thing. (Admires her cat ears.) Brazen costume for a cat burglar.  Bruce Wayne, eccentric billionaire. Who's your date?  It's pronounced 'Ibeetha'. You wouldn't want these folks realizing you're a crook not a social climber.  I doubt you care what anyone in this room thinks about you.  Well, Selina Kyle, I know you came here from your walk-up in Old Town - modest place for a master jewel thief. Which means either you're saving for your retirement - or you're in deep with the wrong people.  Actually, I was born in the Regency Room.  Start fresh.  Or our achievements.  You think that justifies stealing?  Robin Hood?  Maybe you're assuming too much.  Ouch.  Sounds like you're looking forward to it. 45.  These pearls do look better on you then they did in my safe... But I still can't let you keep them.  Not likely.  I must have lost my ticket -  My wife?  Remember those 'unusual requests' I used to make?  You start with the good limb so it learns your optimum muscle patterns. Now we tighten it up.     Not bad - Not bad at all.  I'm all ears.  Bane.  Born in a prison?  Bane was a member of the League of Shadows. 48.  I didn't realize I was known for trifling with criminals.  Which was?  If this man is all the things you say he is, then this city needs me.  I tried helping as Bruce Wayne, Alfred. And I failed.  That's what you're afraid of - that if I go back out there I'll fail.  We bought all the neighbors.   I retrieved this.  They don't have the tools to analyze it.  One man's tool is another man's weapon.  Alfred. Enough. The police weren't getting it done -  Perhaps you're upset you were wrong.  You thought I didn't have it in me.  I'll fight harder, I always have.  You said he was excommunicated.  R¯'s al Gh¯l was the League of  Trades of some kind. Coded... 66.  Mine. Courtesy of Selina Kyle. Get this to Fox - he can crack the code and tell us what trades they were executing.      You'd abandon me?  Rachel died knowing we'd decided to be together. That was my life beyond this cave and I can't just move on. She didn't. She couldn't.  She was, I can't change that -  Why would you say such a thing?  You're lying.  You're lying!  How dare you use Rachel to stop me!  Sorry?! You expect to destroy my world, then shake hands?!  What does it mean, Alfred?!  Goodbye, Alfred.           Alfred?        Yes. Could you decode the trades on that drive?     The weapons - we can't let Daggett get his hands on Applied Sciences -  Miranda Tate. We need to convince the board to get behind her. Let's show her the reactor -     I thought you might like to see what your investment built. 71.  If it worked. It doesn't.  Ignition, yes. But no chain reaction.  Miranda, if it were operational, the danger to Gotham would be too great.  Someone else will work out what Dr. Pavel did. Someone else will figure out how to turn this power source into a nuclear weapon. I need you to take control of Wayne Enterprises and this reactor.  Nothing. Until we can find a way to guarantee its safety. 72.  Decommission it. Flood it.  If the world's not ready. Yes.  I'm trusting you.  I could've flooded this chamber any time in the last three years. I'm choosing to trust you, Miranda, and that's not the easiest thing for me. Please.      I understand. Ladies and gentlemen.      To protect the people closest to me.  There are always people you care about. You just don't realize how much until they're gone. (Collects himself.) The idea was to be a symbol. Batman could be anybody, that was the point.  Not everybody agrees.  Got anything on Bane's whereabouts?      Don't wait. I'll get a cab. 77.   Actually, no.  I don't think so.  Actually, they're letting me keep the house.   Vacation?  My powerful friend hopes to change your mind about leaving.  By giving you what you want.  He says it does. He wants to meet. Tonight.  He needs to find Bane. He thinks you'd know how.  No, you're not.     No. I'm on my own now.  Never needed them...     Hope you don't like me for your money.  He left. Taking everything.      You're pretty good at that.  I assumed your family was wealthy.  I've made a few myself.  Someday perhaps. Not tonight.            Why didn't you just kill me?     Where am I?         Do it for the pleasure.  Has anyone made it?  What does he say?  Bane.  Don't.  How would he know?  How?  Is Bane the child you spoke of? Was he born here?  How -?  I watched you die.  You were the mercenary. Bane is your child. Your heir.  No...    I'm not meant to die in here. 118.  You told me a child did it...  My body makes the jump.  My soul's as ready to escape as my body.  I'm not afraid. I'm angry.  And why do we fall?  Why?  I do fear death. I fear dying in here while my city burns with no one there to save it.  How?  Pretty generous, for a thief. 133.  Not yet.  It wouldn't suit you. I need your help.  For this. The 'Clean Slate'.  I admit I felt a little let down. But I still think there's more to you. In fact, I think for you - this isn't a tool, it's an escape route. You want to disappear. Start fresh.  I can give you a way off. Once you've gotten me to Lucius Fox. I need you to find out where they're holding him. Then take me in.  To save this city. 134.  Maybe you do. But tomorrow that bomb's going off.  I'm trying. But I need Fox.  How long until the core ignites?  Unless we can connect it to the reactor.  Not tonight. I'm sorry.     To get me back in the game.  I won't forget about you.  Any move I make against Bane or the bomb - the triggerman sets it off.  Could you block it?  Even without the autopilot...",
        "Commissioner": "",
        "Gordon": "Harvey Dent was needed. He was everything Gotham has been crying out for. He was...a hero. Not the hero we deserved - the hero we needed. Nothing less than a knight, shining...  But I knew Harvey Dent. I was...his friend. And it will be a very long time before someone inspires us the way he did. I believed in Harvey Dent.  Congressman.  Maybe the truth about Harvey isn't so simple, Congressman.  The truth...? 10. I have written a speech telling the truth about Harvey Dent... Maybe the time isn't right...  Maybe right now all you need to know is that there are a thousand inmates in Blackgate Prison as a direct result of the Dent Act. These are violent criminals, essential cogs in the organized crime machine that terrorized Gotham for so long. Maybe, for now, all I should say about Harvey Dent's death is this...it has not been for nothing.  The second shift reports in?  That's your department.  What's the problem, son?  That's a job for the police?  Old habits. 17.  What's your name, son?  You have something you want to ask me, Officer Blake?  What about it?  I'm not hearing a question, son.  I know exactly who he was. (Turns to Blake.) He was Batman.  Let's go see about the Congressman's wife... 18.  Manhole!  You three, down with me. You two, head down to cover the next exit -  Get the DWP down here, now!  We were in this together. Then you were gone...  Built on a lie. Our lie. Now there's evil rising from where we tried to bury it. Nobody will listen... The Batman has to come back. 39.  He must. He must.  Why?     Get more men, work a grid. I want him found.  This is good work. Lose the uniform - you're working for me now. We could use some hotter heads around here. 80.  You're a detective now, son, you're not allowed to believe in coincidence anymore.  So you think our friend is gone again?  What's happened?  No more patrols, no more hide and seek. Send every available cop down there to smoke him out. 93.  Don't apologize for believing the world's in better shape then it is...just fight to make it true.  Not you. You're telling me the Batman's gone. So you chase up the Daggett leads, any way you can.  Anything strange about the pourings?  But you know about patterns. Keep looking.  Clear the corners, rookie.  Get my coat, son. 103.  It means we're on our own. I have to get in front of a camera -  The Mayor's dead. I'm the symbol of law and order. Bane says he's giving Gotham back to the people - they need to know that I could lead.  Then he'll show his true colors.  A lie to keep a city from burning to the ground. Gotham needed a hero, someone to believe in -   There's a point. Far out there. When the structures fail you. When the rules aren't weapons anymore, they're shackles, letting the bad get ahead. Maybe one day you'll have such a moment of crisis. And in that moment, I hope you have a friend like I did. To plunge their hands into the filth so you can keep yours clean.  We don't have any choice.  Captain, glad to have you here. 120.  Dozens. I'd rather not say exactly. But the men trapped underground number almost three thousand.  They've been getting water, food.  They keep it on a truck - it must have a lead-lined roof. They move it constantly.  They've got three of them. The routes don't vary much.  No leads. It's a bluff - Bane wouldn't give control of that bomb to someone else.  Captain, things are more complicated than you think. There's somebody you need to meet. Blake?  Where the hell are they? It's not like we have a lot of time, here.  The bomb goes off tomorrow. We've got about eighteen hours to do something.  We mark that truck. Get a GPS on it, then we can start thinking about how to take it down.      Foley. Where's Foley, dammit?! 130.  You're sending your wife to the door when the city's under occupation?!  What did you do, bury your uniform in the backyard?  You forgotten all the years we went out on patrol with every gangbanger wanting to plant one as soon as our backs were turned?  Deal?! Bane's got their balls in a vice. That's not a deal -  You think he's given control of that bomb to one of 'the people'?! You think this is part of some revolution? There's one man with his finger on the button - Bane.  This only gets fixed from inside the city, Foley.  Look, I'm not asking you to walk down Grand in your dress blues. But we've got to do something before this maniac blows us all to hell.  Keep your head down? What's that gonna do tomorrow, when that thing blows?  Miss Tate, I can't ask you -  Bruce Wayne built it. 132.  Let's go.  Stay further up the block. (Points at Men.) They're gonna cross the street and try and slow the truck down. As it approaches, hit this button. If the needle hits two hundred - give me the signal and I mark the truck. Okay?  Got it.  On whose authority?  No lawyer, no witnesses. What sort of due process is this?  Crane, if you think we are going willingly out onto that ice, you've got another think coming.  Looks that way.  When what starts?  Come on, come on...  That's impossible... Come on! Cut over to Fifth!  Give me a hand! Let's get a cable on it and drag it out! Come on, we're almost there -  What're you doing?  So this is the part where you vanish, only this time you don't come back?  I never cared who you were -  But shouldn't the people know the hero who saved them?  Bruce Wayne?  'I see a beautiful city and a brilliant people rising from this abyss...'  'I see the lives for which I lay down my life, peaceful, useful, prosperous and happy...'  'I see that I hold a sanctuary in their hearts, and in the hearts of their descendants, generations hence. It is a far, far better thing that I do, than I have ever done...' 'It is a far, far better rest that I go to than I have ever known.'  Can I change your mind about quitting the force?  They know.  It was Batman. 160.",
        "Daggett": "Everyone knows Wayne's holed up in there with eight-inch nails, peeing into Mason jars.  Good of you to let me on the grounds.  Why waste your time talking to the man who threw away your investment on some save-the-world vanity project? He can't help you get your money back. But I can.            After eight years he has to pick tonight...     What about the men they arrested?          And can we get some girls in here?  You dumb bitch.  Dumb to show up here tonight.  'I want' never gets...  Where's what?  Oh, yeah - the ultimate tool for a master thief with a record. I don't have it.  The 'Clean Slate'? Type in a name and date of birth and within a couple hours that person ceases to exist in any database? Little too good to be true.  That's why I bought them. But they had nothing. It was a gangland myth.  I'd like to point out that we have a non-board member here. Highly irregular, even if it is his family name above the door...  Into the ground, sir. Anybody disagree? Check the value of your shares this morning. Gambling on crazy futures didn't just lose Mr. Wayne his seat, it's lost us all a lot of money. He needs to leave.  Let's get down to business.     How the hell did Miranda Tate get the inside track on the Wayne board?! Was she meeting with Wayne? Was she sleeping with Wayne?  Clearly you don't 'know of' anything, do you?! Where's Bane?!  Then where is the masked -  What the hell's going on?  You see me running Wayne Enterprises?! Your stock exchange hit didn't work, friend. And now you've got my construction crews working all hours around the city? How's that supposed to help my company absorb Wayne's?  You stay right there! I'm in charge!  I've paid you a small fortune -  What is this?  What are you?  You are true evil...",
        "Selina": "I like having someone around to open doors for me.  Right hand. No partials. 23.  Not so fast, handsome. You got something for me?  I don't know what you're going to do with Mr. Wayne's prints...but I'm guessing you'll need his thumb.  You don't count so good, huh?  Okay, okay -  My friend is waiting outside. Just hit 'send'... 24.   It'll liven up in a minute, trust me.  Great. Catch you later.  It would've been a lot easier to just give me what we agreed.  No. But my friend over there...?  Every cop in the city's missing him.  I don't know... You did just use his cell phone. 25.  Keep some pressure on that, sweetheart.  There's a man in there - he's bleeding!        Get out.  Now.  I told you not to try it with the assholes, Jen.  Okay, the assholes who hit.  Probably the watch.       You were supposed to be a shut-in.  Why didn't you call the police?  Yeah? Who are you pretending to be?  His wife's in Ibiza. She left her diamonds behind, though. Worried they'd get stolen. 43.    Don't condescend, Mr. Wayne. You don't know a thing about me.  You don't get to judge me because you were born in the master bedroom of Wayne Manor.  I started off doing what I had to. Once you've done what you had to they'll never let you do what you want to.  There's no fresh start in today's world. Any twelve-year-old with a cell phone could find out what you did. Everything we do is collated and quantified. Everything sticks. We are the sum of our mistakes.  The mistakes stick better. Trust me.  I take what I need to from those who have more than enough. I don't stand on the shoulders of people with less.  I'd do more to help someone than most of the people in this room. Than you.  Or maybe you're being unrealistic about what's really in your pants other than your wallet.  You think all this can last?  There's a storm coming, Mr. Wayne. You and your friends better batten down the hatches, because when it hits you're all gonna wonder how you ever thought you could live so large and leave so little to the rest of us.  I'm adaptable.             He's not a mark.  And he doesn't have a cent to his name, anyway.     Yeah, it's not much.  But it's more that you've got right now.        Let's just say that I've incurred the wrath of some people less susceptible to my charms than you.  And how would he do that?  It doesn't exist.  Why?  Tell him I'll think about it.  Mr. Wayne? I'm sorry they took all your money.      Would you mind? 88.  Don't tell me, still in love?  Girl's gonna eat.  Maybe it's not you I'm running from.        I'm not sure.  Why, honey, you wanna hold my hand?  This was someone's home.  No. It's what I thought I wanted.  You boys know you can't come into my neighborhood without asking politely.  Never steal anything from someone you can't outrun, kid.  Just tax.  You came back. I thought they'd killed you.  If you're expecting an apology -  And why would I help you?  You're gonna trust me with that? After what I did to you?  Start fresh? I can't even get off this island.  Why do you need Fox?  Who says it needs saving? Maybe I like it this way.  Get your powerful friend on the case.",
        "Miranda": "It's important, Mr. Pennyworth.  I could try explaining that a save-the-world project, vain or not, is worth investing in, whatever the return. I could try, Mr. Daggett, but you understand only money and the power you think it buys, so why waste my time, indeed?  Mr. Fox, I believe in what Mr. Wayne was trying to do...  I'm only asking for explanations because I think I can help.  He doesn't talk to you either?      Bruce Wayne at a charity ball?  Even before you became a recluse, you never came to these things...  Actually, this is my party, Mr. Wayne.  And the proceeds will go where they should, because I paid for the big fat spread myself.  You have to invest to restore balance to the world. Take our clean-energy project...  You have a practiced apathy, Mr. Wayne. But a man who doesn't care about the world doesn't spend half his fortune on a plan to save it... And isn't so wounded when it fails that he goes into hiding...  Have a good evening, Mr. Wayne.  You brought me out here to show me a rubbish dump, Mr. Fox?  This is it, isn't it?  Is Bruce Wayne really that paranoid?  No radiation, no fossil fuels. Free, clean energy for an entire city.  You've built a lot of security around a damp squib. About three years ago a Russian scientist published a paper on weaponized fusion reactions. One week later your reactor started developing problems... (Looks at Wayne.) I think this machine works.  Would it make you feel better to know that the Russian scientist died in a plane crash six months ago?  And to do what with it?  And if we can't?  Destroy the world's best chance for a sustainable future?  Bruce, if you want to save the world you have to start trusting it.  Doesn't count. You have no choice.  Nobody's answering.  Do you have keys?  Let's find a window.  Fox worked the board like you've never seen - I'm in, Daggett's out and he's not happy.  Suffering builds character.  I'll take care of your parents' legacy, Bruce.  Who's this?  Where's Alfred?  What's that?  When I was a child we had almost nothing. But on the nights we had a fire, we felt very rich indeed. 82.  Not always. Not when I was young.  An old mistake.  More than a few...  We could leave. Tonight. Take my plane. Go anywhere we wanted.  Bruce got a lot of things right. Keeping the board in the dark wasn't one of them...  Alright, stop. 96.  Lucius, you'll kill this man and yourself, and barely slow them down.  And as CEO of Wayne Enterprises, I have to take responsibility for it.  Because, Captain, we built it.  I hear you're looking for men, Commissioner.  How about me, instead?  My company built it.  And he wanted to destroy it. It was me who didn't listen. Please.  Bruce?  Do what's necessary.  I know.  But he is not the child of R¯'s al  I am. And though I am not 'ordinary', I am a citizen...  My mother named me Talia before she was killed. The way I would've been killed if not for my protector...Bane."
    },
    "imdb_rating": "8.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTk4ODQzNDY3Ml5BMl5BanBnXkFtZTcwODA0NTM4Nw@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Despite his tarnished reputation after the events of The Dark Knight (2008), in which he took the rap for Dent's crimes, Batman feels compelled to intervene to assist the city and its Police force, which is struggling to cope with Bane's plans to destroy the city.—WellardRockard",
    "name": "The Dark Knight Rises",
    "genres": [
        "Action",
        "Drama",
        "Thriller"
    ]
}