{
    "filename": "Butterfly-Effect,-The_script.txt",
    "imdb_id": "tt0289879",
    "imdb_url": "https://www.imdb.com/title/tt0289879",
    "characters": [
        "Evan at 7",
        "Tommy",
        "Mr. Miller",
        "Lenny at 13",
        "Lenny at 7",
        "Tommy at 7",
        "Kayleigh",
        "Kayleigh at 13 (as Irene Gorovaia)",
        "Jason",
        "Tommy at 13",
        "Lenny",
        "Evan",
        "Kayleigh at 7",
        "Evan at 13",
        "Andrea"
    ],
    "dialogues": {
        "Tommy": "You're such a retard!  Fat little baby, crying for mommy.  I don't think Evan gets to be in it --  I thought I was the bad guy!  I thought I was the star.  Hold your horses, man. It's here somewhere. I saw it when I was a kid.  I knew it had something to do with the army.  Let's blow the shit out of something!  What did I say about mentioning that bitch?  Just blow something up? Are you nuts? There's an art to mass destruction. Would you just paint the Mona Lisa? No. Besides, we're here already.  Here you go, buddy.  The hell you aren't. Anyone of us does it, you'll puss out and narc for sure.  Oh, for Christ's sake, just do it, Lenny.  Hurry! Let's go! Get him up, Evan! Come on!  (staring menacingly at the others    Don't ever bring that shit up again. Not ever. Not to me, not to Kayleigh, or even Lenny. The stupid fuck if he ever learns to talk again. Understand?  Ever. She don't want to talk about it, anyway. Do you Kayleigh?  There it is. Let's go.  Holy shit! Look at that fat fuck! You'd have to wipe his ass with a forklift!  Shut up, faggot. No one's talking to you!  What the fuck are you doing??  Look what you made me do!  Why don't you fucking kiss her, Prince Charming!  Drop it or I'll slit your mother's throat in her sleep.  Listen to me good, Evan. There's a million other sisters in the world. You didn't have to fuck with mine.  Yeah, you do that, Lenny.  Make one peep and I swear it'll be your last, motherfucker.  C'mon! Run!!  Lenny? Come on!  But I wanna see!      Get this \"us\" shit. As if I was gonna lay a hand on my own sister. You've done nicely for yourself, Evan. Nice friends, nice life, not to mention you're fucking my sister. Not a bad piece of ass if I say so myself.  Aw, hey now, that was a compliment.  It wasn't enough that the whole world loves you, but you had to take away the last person on earth who didn't think I was a piece of shit.  Right, Evan. I believe you just said \"sick fuck.\"  Listen to me good, Evan...  I'll save you lady!  I did what you said, man! We're pooling our student funds with Hillel House and we're going to have an Awareness Dance.  You forgot to put the toaster on the edge.  I'll get you changed. Visiting hours are almost up.  Sorry, Mrs. T. He's been out of sorts lately.  He's just going through some tough times.  I think I'll go check out the chapel.  Kayleigh! NOOOOOooooo!",
        "Miller": "Hey, Andrea. Hello little man.    You waiting for an invitation? The kids are inside.     That's right, Evan, and you get to be the star.  Shut up, moron. Now get in your costume, Evan. And you have to promise, your bestest super-duper promise, that this will be our little secret. Think you can do that?      Calm down, kid. Stand still.  Quit acting like some retard or I'll call your mother and tell her what a naughty little shit you've been.               Shut up moron. Now get in your costume Evan.  I've got an idea. Let's go downstairs, it'll look more like a dungeon down there.       You're gonna see my fist in about two seconds unless you do what I tell you.  Now in this part of the story, Robin Hood just married Maid Marian and they have to kiss and stuff like grown-ups do.  So take your clothes off Kayleigh.  Come on, like when you take a bath. Don't make a deal out of it. You too, Evan.  Let's go.  It's time for you to stand where the hell I told you.        I -- I won't.     Just shut the hell up already! Can't a man get a little goddman peace in his own home! Oh, for Christ's sake, now what?  Don't suppose you're here to sell cookies?     Now in this part of the story, Robin Hood just married Maid Marian and they have to kiss and stuff like grown-ups do.  Hey kid, don't bother with the belt.  Easy does it, Evan! Don't be a bad boy or I'll tell mommy you were naughty.  That's dangerous! You could blow your hands off!  Kayleigh! NOOOOOooooo!",
        "Kayleigh": "Mommy lives far away but she comes and visits.    Quit it, Tommy. Evan gets to be Robin Hood. I'm gonna be Maid Marian, and you're the Sheriff of Nottingham!  You are, silly. He's a bad sheriff.  You're better off anyway.    Evan, did I tell you? My mother said I might be able to visit her this summer in Orlando with her new family.      I'm sorry.  You really don't remember anything that happened?  You're so lucky.  Ouch.  It's not your fault. Mrs. Kagan called dad and blamed us for what happened to Lenny.    Okay.    He's been acting real strange lately. He won't even look me in the eyes anymore.  Did your mom say if Lenny was... okay?  Hi, Lenny.    Do you see that?  Oh my God oh my God...  God, Evan! I never thought I'd see you again. How've you been?  No, Evan. I don't know. It's been a long time. Fill me in.  I've stopped a hundred times.    No. I emancipated myself when I was fifteen.  Not if you remember my dad.      Of course.  Well, sure. I'll try to remember. Shoot.    It was a long time ago.    Is there a point to any of this?    Who are you trying to convince, Evan?! You come all the way out here to stir up my shit just because you had a bad memory!? You want me to cry on your shoulder and tell you that everything's all better now? Well fuck you, Evan! Nothing's gonna be all better! Okay?! Nothing ever gets better!  If I was so wonderful, Evan, why didn't you ever call me? Why'd you leave me here to rot?!  Don't you ever touch me again.  I'm cold. And I'm putting on my clothes.  Honey, are you all right?  Oh my God, Evan. You're bleeding! Look at you!    Those are your clothes, silly.  Well I remember he had one... but he, like, put it away after the first day. Why would that freak me out?  Such a goofus. See you tonight.  Oh my God, that was good. Where'd you learn all those new tricks?  Yeah, if you call multiple orgasms weird.  Fuck 'em.    That is the plan, right? Hell or high water?  I don't understand, where are you taking me?  I don't know what to say. It's beautiful.  Why are you doing all this for me?  Don't. He's probably watching.  It's my fault. I should have told you he was released a few weeks ago.  Please, Evan. Don't even joke. He wouldn't hurt you. He's just trying to scare you away from me.      Are you okay?  It's just... you've been acting kinda strange, you know?  I don't know. You seem... different. You make weird jokes. Your accents changed. You don't even walk the same.  I can't put my finger on it, but everything's a bit off. Even the dinner tonight. It was beautiful, but...  Wait. Something's not right. Isn't that your jacket?  Tommy.  Shut up, Tommy!  Evan, stop! You're gonna kill him!  Evan. Stop it. It's not the time.  You're acting crazy!  Oh, I thought you were my eight o'clock. Make it fast, I'm expecting someone.  If I knew you were coming I'd have cleaned the stains off the sheets.     What do you want?  Well, time is money, Evan. So you...  Well, I guess I can spare ten minutes for an old friend, right?  So how's tricks? Sorry, occupational humor.    Ha! Where's that?  What's happened to you?  I've seen some sickening shit. I don't blink twice anymore, especially in your case.  Because you're... different.  Let me ask you a question. Just a little one that's been gnawing at me for years.  On the bridge. How did you know that Tommy had your dog? That was no fucking hunch.  You're right, Evan, I don't believe you.  I'm the only person you've told? That's a great line. Does that make other girls swoon? Do they actually eat up this bullshit?  Oh? There's proof now?  Anyone with fifty bucks could tell you that.  Know what?  There's one major hole in your story.  There is no fuckin' way on this planet or any other that I was in some fuckin' sorority.  Sure you don't want your wallet?  Off to change everyone's life again, is that it? Maybe this time you'll pop up in some mansion while I wind up in Tijuana doing the donkey act.  Well, don't give up now, Slick. You've already done so much for me. Hell, why don't you go back in time and save Mrs. Halpern and her baby. Then maybe Lenny wouldn't freak out and ruin my family.  Oh, here's one! Go back when I'm seven and fuck me in front of Daddy's handicam, you know, straighten me out a bit...  We have to get you to Sunnyvale. You're having one of your famous hemorrhages.  What are you geeks looking at? Must be nice to be so goddamned perfect, huh? Fucking losers.  Let's go for a stroll.  You know how spiritual he's gotten ever since he saved Mrs. Halpern and Katie.  Is something the matter?  Sure, Evan, why not? You were the first person I really ever cared about.  That's why when I was little I never went to live with my mother.    It's crossed my mind from time to time.  Well a lot of things cross my mind. I've always been a fast thinker, Ev. I can play out the movie of our entire lives in under a second. Boom -- we fall in love -- get married -- two kids, your keen analytical insight matched to my generous nature -- kids grow old as do we, relatively stable relationships, matching burial plots, the whole bit. It took a lot longer to spit out than to imagine.  Why not? But that's not how things wound up. I'm with Lenny, Lenny's your friend. And there it ends.  When my folks split, they gave me and Tommy a choice who we wanted to live with. I couldn't stand my dad, but I knew if I lived with my mom, I'd never see you again...  What did you say to her? What happened?!",
        "Jason": "It's okay. I won't bite. You've seen pictures of me, right?  (through clenched teeth    Are you okay? You looked like you were somewhere else for a second there.  I was praying this curse would have ended with me.    You can't play God, son. It must end with me. Just by being here, you may be killing your mother.",
        "Lenny": "You put the mommy too far away. Mrs. Boswell has macaroni and glue if you wanna fix it.      Guys, slow up, would you?    Ain't gonna work this time, buddy. Look how small that fuse is! I'll get killed.  Gee, thanks friend.                 Is Tommy with you guys?  It was awful. You can't sleep 'cause everyone's screaming all night long. I never want to go back.     I can't undo the rope!             I couldn't cut the rope.  Drop it or I'll slit your mother's throat in her sleep.  Make one peep and I swear it'll be your last, motherfucker.  Maybe it went out. Should someone check it?  What are you talking about?        You knew the whole time, didn't you? When you put the blade in my hand, you knew something big was going to happen. Didn't you?!  Then you should be where I am. You should be where I am.  There's a bomb in the mailbox. Get away!  What? Hey, sorry, man. We wake you up?  Sorry, tough guy, no can do. Your mother would kill me.  'Sup, Sheila! We missed you at the party! Don't even think I'm giving you my lab notes either! Think I like getting up for \"eight thirty's\"?  Hey, there's Tommy.  Uh, we should be getting to class now.  Are you sure you even packed it?  Is this it?  What do you need it for? I don't get you lately.  What?       You alright? Should I call the doctor?  You sure about this?",
        "Evan": "But if I can just go back to the beginning of all this, I still might be able to save her.  We're gonna be late again.  We're putting up pictures for Parent's Night.  Righty-tighty, lefty-lucy.  Um... can dad come this time?  Can't he come out for one day?  But Lenny said that his dad's coming... and Tommy and Kayleigh's dad...  All the dads are gonna be there.  No.    Hey, what'd you do that for?  Come on, Lenny. It's not that bad. You can still see your mom a little.  Sure. I was gonna make a new one, anyway.  I don't like this place, Mom. It's creepy. Please can we go? I promise I won't make any more bad pictures!    My father has a bad memory, too?      These'll bring you luck, Crockett.      We're really gonna be in a movie!?  Where am I? What happened? Where did we all go?  I was just somewhere else -- how did I get here?  Kayleigh? What happened?  What's wrong with me?     Dad lives here?  Okay.  Uh-huh. Mom says I have your eyes and your --  Tommy, I'm bored shitless over here. What's up already?  So let's go. This place creeps me out.  Not necessarily.  That should buy you ten minutes at least.  You got balls, man.    Shit, Lenny. What's happened to you! We've gotta get help!  I don't know... I don't remember.  I... I blacked out.  Yes.  I'm standing next to Kayleigh, my hands are over her ears.  No, protecting her.  I see a car.    It's coming... argh! I can't!  What happened? Did it work?  Would someone just tell me already what the hell happened in the mailbox?  Are you okay?  I'm sorry Kayleigh. This was a bad idea.  It's going to be okay. Lenny'll be fine. You'll see.  I'm sorry.  Damn. Your dad did this?  What are you talking about? What you deserve is a better brother and father. All they do is make you feel like shit.  You really have no clue how beautiful you are, do you?  I can't believe Tommy's still pissed at me. He knows I'm moving away, right?  Duck, here they come.  He must be. They're letting him go, right?  Welcome home, Lenny!  Sorry?    It's cool.  Crockett!!  What's wrong with you?!  Kayleigh! Wake up!  How long was I out?  Kayleigh?! Are you okay? Where's Crockett?       I'm not sure. I might have gotten some stories mixed up. Did Pavlov condition his dogs to lick his nuts?             Whoa. Smells like patchouli and... ass.  Nice to meet you, too.  Get dressed, Thumper, you're taking me out for my birthday.  This is bigger. Seven years to the day. No blackouts.  Actually, they're for a psych project. A study on memory.  It's an experiment with flatworms and a maze. You take a flatworm and run it through the maze until he's memorized it. Then you put a new flatworm in the maze. He's clueless. Banging into walls, getting lost, whatever.  You chop up the smart flatworm and feed it to the dumb one and presto, the dumb one suddenly knows the maze inside and out.  Just by absorbing the first worm into its cellular structure, it gets all of the worm's memories.    No, I just don't want to lose my mind.       Thumper had a busy afternoon.  Charisma and eyeliner go a long way, I guess. Wanna beer?  Yeah. I've been keeping journals since I was seven.  No way, I'd be too embarrassed.  Freeze! No \"worm-boy\". No \"Mr. Worm,\" and no \"Worm-Master-General!\" Once you get a nickname like that you can't shake it. And I don't want everyone thinking I've got tapeworms coming out of my ass or something, okay?    It's like my mind refused to believe what it was seeing. Hearing Crockett make those awful screams... Just writing about it gives me the shivers.  It was like Tommy was possessed or something. There was a hate in his eyes that I couldn't really call human.  What the hell is going on?  I got him, Lenny. Help Crockett!     Oh my God! No! No!          Hey, uh, it's me. Evan.  What's that you're working on? A model?  Well, you look busy, so maybe I should make this quick. I'd totally understand if you didn't want to get into this right now, but that day at the junkyard, could you help me remember what happened? Any details?    Jesus Christ. It really happened.  What if I can get back all my lost memories with my journals.  Well, thanks for seeing me, man. I shouldn't have waited so long.      All I know is that I might be able to unblock some of my repressed memories.            (his voice slowly fades      What the hell?  Yes, hello, uh, Mrs. Kagan, this is Evan Treborn. I know. I'm sorry about that. But I really need to speak with him.  Oh, fine I guess. It's been kind of crazy lately with my mom coming up, so I haven't...  I won't let you down, Professor Carter.  Please, mom. People will talk.  Did Da -- Jason --- get good grades?  Ma? Did he ever say that he figured out a way to recall a lost memory years after he blacked it out for the first time?  No, it's just weird with him being such a brain and all, I just wondered if he was ever able to remember stuff he'd forgotten.  Sure...  What? What could he do?       Shhh! I need quiet for this.  What?     Oh, comme si, comme ca, you know...  I'm going to State now. Things are going okay. I guess. Mom's good...    So how's Tommy?  You still live with your dad?  Wow. That must've taken some courage.  Couldn't you have moved in with your mom?  Actually, Kayleigh, the reason I came back to town was to talk to you.  Remember when I was a kid I had all these blackouts?  Well, lately some of the memories have begun to come back and I'd kinda like to talk to you about one of them in particular. It'd be a big help.  When we were kids. Your dad was making a movie. Robin Hood or something?  It's just... did he... what happened in the basement?  I know, but...  No, but I think something really bad might've happened to us.  Whatever happened, it wasn't our fault. You know we couldn't have stopped it.  Look, Kayleigh. This may sound like bullshit coming from a guy who hasn't spoken to you in seven years...  But you were seven years old and there's nothing you could've done to deserve...  You can't hate yourself just because your dad's a twisted freak.     You can smell it all the way in the bathroom.         It's been said that a person's life is little more than the sum of his experiences. If that's true, then I'm not sure I know who I am anymore. I definitely never knew Kayleigh.  What time is it?  Wrong answer, fuckbag. This is the very moment of your reckoning. In the next thirty seconds you're going to open one of two doors. The first door will forever traumatize your own flesh and blood.    Let's just say you're being closely watched, George. Your other option is to get your porn off the rack and treat Kayleigh like... oh, let's say like how a loving father treats his daughter. Sound okay to you, Papa?  Listen close then, fuckbag. You screw up again and I swear I'll flat out castrate you.  One last thing.  What you need to do is discipline your son Tommy, because the kid's one sadistic pup.     Where... where are my clothes?  This is too amazing! Un-fucking-real!  Whoops. Sorry. My bad.  Hey, you were with those assholes who threw popcorn at Thumper.  And your name is... Gwen!  Hey, uh, don't go freaking out on me over this, but do you remember when your dad first got his video camera?  I dunno. Just being weird.      Thumper! What time is it, man?  Huh?      Leave me alone, asshole. I didn't lay a hand on you, okay?    You're kidding. Are these the answers?!    So it didn't feel... weird?  Yellow.  What do you think it is about us that makes us so perfect? Like, looking back, whatever gave you the nerve to sneak out and visit me after I moved away?  You think we'll always be together?  Just making sure.  Order, order. So all you rushes know what you've got to do for me?  Pledges, rushees, same difference. Now this is a one-time deal. You do all this for me and I'll never give you shit again. Promise.  You'll see.  Go on. Sit down.  Simple math. When I woke up this morning and saw your smile... I knew that I wanted to spend the rest of my life with you.    How could he get away with this? Right in front of the goddamn frat house!     Might'a been nice. Like this is gonna do any good. Maybe one of the frat guys has a gun.    Don't give me this Oprah-book club bad upbringing shit, because you turned out fine.  Fine, then. We'll let campus security deal with him.  What do you mean?  Like how?  I walk differently?  I know I've been actin strange lately. It's just that... I don't want anything to happen to us.  What?  Leave us alone you sick fuck!  What the hell are you doing?    He's a fucking maniac!  He ruined Lenny's life --  He killed Crockett -- Murdered that woman and her baby! And he's trying to kill me, Kayleigh! He's trying to fucking kill me!         How long will I be in here?  How's Kayleigh doing? She all right?  What about my journals, Mom? Did you bring the ones I asked for?  Damn it, Mom. I told you I need them all!  Sure, Mom. You're right. Just try to tell Kayleigh I'm sorry.  Let go! They're mine!  Motherfucker!      You're religious Carlos, you believe that bit about \"the Lord works in mysterious ways?\"  Because I think he sent me to your cell on purpose. For you to help me.  I ain't bullshitting. Jesus speaks to me in my dreams.  Pack of smokes says I can prove it to you.      So when I'm out, I need you to watch my face and hands closely.  Anything today?  Just tell me if anything weird happens.  Marks, scars, I dunno. Anything could happen I guess.       What did you see? What did it look like?  So you believe me?  I want to make a deal.  Look. I'm new to all this but I think I get how things work. You gotta join a gang or else end up dead meat.  Well it sure ain't gonna fucking be with no niggers or spics. So how do we do this? You gotta work your way up, and I'm the new guy. So... should I... I mean, do I suck your dicks right now?    Carlos!  We took the woods behind the junkyard just to make sure we wouldn't bump into Tommy. We hadn't seen the smoke yet.  Rot in hell you fucking animals.  Wait. Before we --  We need something to cut open the sack!  I want you to take this, Lenny. Today's your day of atonement. I know how guilty you feel about that woman and her baby --       Cut the rope.  I'll do whatever you want. You don't want me to ever see Kayleigh again, fine. Just let Crockett go. Besides, you kill him now and they'll stick you in juvy for sure. And I know you'd never leave your sister alone with your father.  Oh fuck, Lenny, no!       Christ. Help me.           Okay, doc. What's the damage? How much time have I got?  Are you sure? Not even with my father?        Well, it's nice seeing you again. But you know, people to see, things to read...  Is there anything you need? Anything I can get you?  What about the models, man? Bet I can get you a shitload of models up in here.  Okay, Lenny. Just wanted to say \"hi\".       (as if reciting a mantra  Look, Jason, I need some fast answers if I'm ever gonna fix what I've done.  But it didn't. And now I need info to make things right again and you're the only one who can give it to me.  Who's to say you can't make things better?  Bullshit. I'll send you a postcard when I've made everything perfect again.     Huh?    None taken. Hey, uh, does Kayleigh Miller still work here?  Good guess, fuckbag. Remember me now? We had a great chat once when I was seven.  One question, fuckbag. Where can I find your daughter?  Nice to see you, too. Can I come in?  I just needed to see... a friendly face.  I get it. You can drop it now.  No. Just that you need to hurt me with it. I've been where you've been.  The bottom. When you're just a piece of meat waiting for the next attack.  You wouldn't believe me. I mean, people always say, \"You wouldn't believe me\", but in this case, it's not even worth trying.  Why's that?  Different? How?  Yeah?  Do you remember when I was a kid and I had those blackouts?  I never thought you would. That's why I've never bothered to tell a soul until now, and why I never will again.  I couldn't give a shit if you believe me or not, and frankly I'm too tired to prove it to you.    Then forget that. How about... you prefer the smell of a skunk to flowers, you hate cilantro because for reasons unknown to you, it reminds you of your step-sister.  Oh! And when you orgasm, your toes go numb. I'm sure your clientele aren't privy to that one.  I just thought you should know.  That I didn't leave you there to rot.  Which is?  Don't think I'll need it where I'm going.  I'm over it. Whenever I try to help anyone it all turns to shit.     Get out. Both of you.  I'm not saying it again.    Lady, stay back! Don't go near the mailbox!  I mean it, woman! Get the hell back!     I thought I told you two to beat it.  No, it's cool. Really cool.       Where are we going?  Stop! Take me back!  Take me back, Lenny! You owe me that much.  Oh goody, nothing like spinning my chair around to a techno mix of Hava Nagila til I puke.  Forget it. What's the point of Psych now? Tomorrow I could wake up as some dirt farmer in Bangladesh.  So Tommy's really into this Jesus kick, huh?  He saved Mrs. Halpern? Please, the twisted fuck.    Kayleigh? Do you ever think about \"us?\" I mean, wonder if it could ever have been different between the two of us?  I was?  I don't get it.  I never knew that. So then you still sometimes think of us... together?    Then you think it might have worked out?  Would it make any difference if I told you that no one could possibly love anyone as much as I love you?  But you, Kayleigh and Lenny like toast. And that's really all that matters now.      Right... You started chain smoking after I blew myself up.  There must be a way to fix this.  I just need the entry about the blockbuster. Wait, shit, no arms. I never even got the chance to write it.  Mom. Don't cry. I can change this.  Come on, Mom. Just 'cause Dad was my age when he started going crazy doesn't mean that I'm nuts.  You told me that on Parents' Weekend. Remember? Wait, that wasn't me. Or you.  Don't worry. I'm gonna get you out of here.     My mom packed for me. I think she sent everything I ever owned. So we'll see.  Duly noted. Now I'm gonna ask you for one last favor.  Shhh. I need to concentrate on the blockbuster if I'm gonna destroy it.  If I hadn't blown my arms off, Mom never woulda started smoking in the first place. Now shhhh.     Yes. Now how do I destroy the blockbuster?     Well, that didn't work...  Wait! I need my belt!    Loo, loo, skip to my loo.  Back off, fuckbag!  Amazing. That word never fails to make an impression with you...  And I'll tell the Child Protective Services about your kiddie porn endeavors. One step closer and I'll shove this up your ass!  Been there, done that.  Kayleigh! NOOOOOooooo!     Oh God, Kayleigh...       Where are they?!  Where are my goddamn books?  My journals! Where are they?  But I... I need those books.  Photos?      Hey, Mom, didja remember to bring those goofy old home movies we used to make?  If anyone finds this, then I guess my plan didn't work and I'm already dead.  But I -- I can just go back to the beginning of all this, I might be able to save her.      I hate you. If you ever come near me again, I'll kill you and your whole family.  Goodbye.      I'll think I'll be alright this time. I really do.",
        "Andrea": "Okay, okay... what now?  When did you ever care about getting to school on time?  Thanks. Don't worry Evan, you'll have plenty of time.      We've been over this a hundred times. It's too dangerous for him.  Here, Ev... Finish this up for me.  I get the point, kiddo. But I'm not so bad, am I?  Good. Because I've been waiting to see your art projects all week and I'd feel terrible if all you thought about was your father not being there.  You're amazing, kiddo.  Okay have a great day I love you I'll pick you up later gotta go...  I'm sorry, but can it wait til tonight? I'm already late for work --  What is it?  I don't understand... Evan did this?  Thank you for showing it to me first. I'll... I'll take care of it. Can I have the picture?  What?  I have to go.      That's why I wanted you to come here, Evan. Dr. Redfield already has a background in memory loss.  Just tell me that Evan doesn't have Jason's illness...  Anything.  Why? What for?     Thanks, George. I really appreciate you watching him, he won't be any trouble at all.    Evan?  Evan? What are you doing with that knife?  Honey. What were you doing with that?  Thanks a lot George. Here's my work number in case there are any problems.  And the bad news?  But you must have something to go on?  But he's seven. What kind of stress can he have?  Come on, I doubt the answer's that simple.  Well, he has been pushing me to meet his father, but I've been putting it off.  How soon?...     Now your father may seem sleepy to you, but that's just because of his medicine, okay?  I'm sorry, Evan. I'm sorry.  What is it? What happened?  What happened, Evan? The truth.  Something must've happened! What set him off?    You're not making this up, are you?  What's happening to him?? Make it stop!  Evan wake up, oh please wake up!        So how was the movie?  Any exploding mailboxes?  Goodnight.  We're moving.             I'm sorry.     I can't help it. I'm just so proud of you. You've got the highest grades in all of your classes.    Why do you ask?  When he was around your age... almost exactly your age. He said he figured out a trick to remember the past.  I couldn't tell if they were real memories or just phantoms. You know, he might only have thought he actually remembered them...  And then, just before it got so bad that he had to be committed, he said that he could...  Forget it. It's nothing. He was far too sick by then.            ...I spoke to your new lawyer about the appeal. He's sure he can get you off on self-defense, so if you're patient.  I don't know. These things take time.  I found these. The others are still in storage.  Fine. You'll get them, Evan. But I think it's far more important to focus on your case right now.  I'm not gonna lose you, kiddo. Promise me you'll hang on, Ev.  Cute, Evan.  So what did you find.  What does that mean for Evan?          Looking. Good. Kiddo.  Fix?  Is Evan... different?  You're. Acting. Like your father.  How. Did you. Know that?  Just. Like. Jason.  Stop him. Stop him. Stop him...     Evan? What are you doing with that knife?  No dances, just tell me.  Go on, Evan. Introduce yourself.  He's not usually this shy."
    },
    "imdb_rating": "7.6",
    "description": "As a child, Evan Treborn was afflicted with blackouts where he would be in one place one minute and then another the next, remembering absolutely nothing in-between. Now all grown up and in college, he decides to read from an old journal he wrote to remember stuff that might have happened in the in-between, and suddenly finds himself back at a certain point in his life. He realizes that those blackouts he had were actually empty spaces of time he had to fill up later in life. Attempting to use this ability to undo unpleasant past events, Evan starts to find that every time he goes back and tries to fix things, he ends up making everything worse. How can he prevent more tragedies from happening and save the one girl he ever loved, Kayleigh (Amy Smart)?—Lenny at 13",
    "name": "The Butterfly Effect",
    "genres": [
        "Drama",
        "Sci-Fi",
        "Thriller"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BODNiZmY2MWUtMjFhMy00ZmM2LTg2MjYtNWY1OTY5NGU2MjdjL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_QL75_UY281_CR2,0,190,281_.jpg"
}