{
    "filename": "King's-Speech,-The_script.txt",
    "imdb_id": "tt1504320",
    "imdb_url": "https://www.imdb.com/title/tt1504320",
    "characters": [
        "Private Secretary",
        "Equerry",
        "Archbishop Cosmo Lang",
        "BBC Radio Announcer",
        "King George VI",
        "Laurie Logue",
        "BBC Technician",
        "Chauffeur",
        "Valentine Logue",
        "Queen Elizabeth",
        "Dr. Blandine Bentham",
        "Anthony Logue",
        "Lionel Logue",
        "Myrtle Logue",
        "Robert Wood"
    ],
    "dialogues": {
        "Private": "",
        "Secretary": "",
        "Equerry": "",
        "Laurie": "",
        "Logue": "",
        "BBC": "Ladies and Gentlemen: good afternoon. This is the BBC National and World Programmes taking you to Wembley Stadium.      Good evening, ladies and gentlemen, this is the BBC, broadcasting direct from Buckingham Palace upon the occasion of the Royal Silver Jubilee. His Majesty: King George the Fifth.  That's how a King speaks. I showed HM how to do it.  I've heard he may not even show.    His father taught him. I taught his father.  Good evening, this is the BBC National and World programme, broadcasting from Buckingham Palace. His Majesty, the King.  This concludes the BBC broadcast of the King's Speech.   (barely controlling his",
        "Technician": "",
        "Chauffeur": "",
        "Valentine": "Stand and deliver!  May we be excused?  Dad?  Time for a Shake, dad.  Othello!  Haven't finished yet, Dad. Oh! Right!  May we be excused?  Dad! Phone! For you!",
        "Queen": "I want my jewelry divided equally. Elizabeth gets first choice. She's not greedy.  Where are the others?  What sort of arrangements?  And David? Fetch him.  Lord Wigram has requested permission to order the coffin.  Nobody. Don't swear.  You're not your father.  Long live the King.",
        "Elizabeth": "Buck up, Bertie. The BBC said it wouldn't rain.  Never trust the wireless.  Why wasn't he told?  Are you there?  Pardon?    He doesn't know I'm here.  My husband's seen everyone. They were all useless. He's given up hope.  Because he hasn't seen you?  You're very sure of yourself.  Of course my husband wants to be cured! His position requires public speaking upon occasion. A torment. I fear the requirement may grow more frequent.  He can't.  Something of that nature.  Doctor...  ...I do not have a \"hubby\". We never talk about our private lives. Nor do we `pop'. You must come to us.  Perhaps you'll make an exception?  A name used during the Great War, when the Navy didn't wish the enemy to know His Royal Highness was aboard.  You will be, should you continue to be un- obliging. TKS/Seidler/09/17/08                                  9.  In which case... I should have kept my pledge. I promised my husband I'd stop seeking \"The Great Cure.\" I've wasted your time. And mine.  \"Mr. and Mrs. Darling and Nana rushed into the nursery too late. The birds were flown.\"  Tomorrow, Chapter IV, `The Flight'.  Will she be there?  Seriously?  I think I meant... is David serious?  About her!  She can.  You know perfectly well.  Neglects to tell them what must be done, how its to be done, and who's to do it.  There's no receptionist.      Comes highly recommended. Charges substantial fees in order to help the poor. Oh dear, perhaps he's a Bolshevik?!  I'm not sure he wants to see you.  Perhaps this was a mistake.  They'll see.  Bertie...  Not particularly.  Your father not dead six months, and That Woman throws, \"A garden potty.\" P-o-t-t-y. She's sleeping in your mother's bedroom. And I know perfectly well she calls me `the Dowdy Duchess\", and \"Cookie\".  I came at the invitation of the King.  I don't need to be told I behaved badly.  Distant.  That was   a very long time ago. You're stirring   with a rather large spoon, Winston.   Keep in mind, I'm also a distant relative   of Lady Macbeth.  How could you possibly?  Dear, dear, man, I refused your first two marriage proposals because, as much as I loved you, I couldn't abide the thought of living in the Royal gilded cage. Then I realized...you stuttered so beautifully...they'd leave you alone.  If I must be Queen, I will be a good Queen. The wife of a very great King indeed. You know what you must do.  \"Your Majesty\", the first time. After that, \"Ma'am\". Not Malm as in Palm, Mam as in ham. I'm informed your husband calls my husband Bertie and my husband calls your husband Lionel. I trust, however, you won't attempt to call me Liz.  Thank you, Madame Logue, but I'm waiting to be summoned.  I was told the same.  I don't wish my husband to be demeaned. What don't you like about mine?  There's only one thing can save him now: success.  A previous engagement.  Harley Street is far too public. What is my function here?  Oh dear, I may not be a `pitch in' type.  What?!  Good grief.  Are you alright, Bertie?  There's actually more?  Vowel sounds? Shouted at an open window? On a public street?  They can also be considered quite dotty. Don't even contemplate it!  They're always looking at you.  Royal scrutiny, Doctor, best get used to it.  Bertie, do make sure that's not switched on!  Mr. Prime Minister, Your Grace, how kind of you to join us.    Well done, Bertie. Well done... ...Lionel. Well done.",
        "Anthony": "",
        "Lionel": "In the lav.  \"How poor are they that have not patience! What wound did ever heal but by degrees?\"  Iago...world's greatest villain. Just wants to be bad. Sorry, no receptionist.  That's for clients. Where's Mister J?  That's not a promising start.  A bit premature.  I'm sure of anyone who wants to be cured.  He should change jobs.  Indentured servitude?  Well, have your `hubby' pop by and give his personal history. I'll make a frank appraisal.  Sorry, this is my game, played on my turf, by my rules.  I thought the appointment was for \"Johnson\"?  I'm considered the enemy?  For my method to succeed there must be mutual trust, complete honesty, and total equality. That process takes place in my consultation room. No exceptions.  Bloody hell, I buggered that.    Beware, Highwaymen, or I'll run yee through.  Oh. Beware, jolly Swagmen, I'll skewer yer gizzards.  Boys, I think we'd best go up.  Had a visit from a lady today.  You must stay, bored stupid, listening to your parents' inane conversation.  And mum.  At what I do. Twas a Lady with a capital L.  She came on behalf of her husband. Which is not the proper way. I told her I was fully booked.  She was...too high and mighty. Know what I mean.  Had a call. Wish me luck?  \"Now...\"  \"Now is the winter of our discontent Made glorious summer by this sun of York...\"  \"And all the clouds that lour'd upon our house In the deep bosom of the ocean buried. Now are our brows bound with victorious wreaths...\"  What do you suggest?  Not finished yet.  Lionel!  Bloody marvellous.  Mr. Johnson, do come in.  Glad we have something in common.  My lads build them. Make yourself comfortable.  What?  That might be difficult in this office.  Nice girl, Anna. Worried she wouldn't find a husband if she couldn't speak. Tried to convince her men will find her even more attractive as a silent partner. The perfect woman. Sorry, bad Australian joke. Why'd your wife change her mind and ask for an appointment?  What can we talk about?  Your joking. That won't work here.  You call this being forthcoming?  Only if you're interested in being cured.  Cuppa tea?  I need one.  Any idea what you're letting yourself in for?  Call me Lionel.  I prefer Lionel. My family calls me far worse. What shall I call you?  Oh please.  Much more informal.  How about Bertie?  That's what I'll call you then. We must be true equals.  Don't do that.  Sucking smoke into your lungs will kill you.  They're idiots.  Makes it official then. House rules: no smoking.  As a monarchist I thought you'd appreciate these are my digs and here I rule. No smoking. What was your earliest memory?  First recollection of the world?  Why're you here then?  Temper.  Do you stutter when you think?  One of my many faults. How about when you talk to yourself?  Come on, everyone natters to themselves once in a while, Bertie.  Shan't call you anything else.  Loads. Now: when you talk to yourself, do you stutter?  Proving your impediment isn't a permanent internal fixture.  Bet you a bob you can read flawlessly, right here, right now.  See your shilling then.  How convenient.  I'll stake you. Pay me back next time.  Correct, I haven't agreed to take you on.  `Easy money'.  Not so fast.  You proved you can't listen.  A princely bob is at stake.  I'm aware.  Bertie, you're Royal. Surely a prince's brain knows what its mouth is doing?  I want to demonstrate that when you can't hear your voice, you don't stutter, thus proving your impediment is not innate.  Flawless.  Would I lie to a prince of the realm to win twelve-pence?  Souvenir of our first and presumably last encounter.  I'm finished with your husband.  Lionel.  Certainly not. How's it going, mate?  Willie?  Why am I not surprised?  Mmmm?    \"Art thou afeard?\"  \"Be not afeard; the isle is full of noises, Sounds and sweet airs, that give delight, and hurt not. Sometimes a thousand twanging instruments Will hum about mine ears; and sometimes voices, That, if then I had waked after long sleep, Will make me sleep again: and then, in dreaming, The clouds methought would open, and show riches Ready to drop upon me; that, when I waked, I cried to dream again.\"  Must be a tradesman. Off you go, lads. Mum should be home from work.  My condolences. I didn't expect you.  No.  My wife doesn't think it's a good idea.  Myrtle.  Sore back.  That woman has style.  You look dreadful.  But you're not Royal in this room.  Not there!  Curtis bi-plane, now a Curtis mono-wing.  You don't have any money. I'll fix it. So, Bertie, what brings you here? Your father's death?  Mine lay rigid, fists clenched angrily at his sides, daring the Reaper: take me, you bastard!  I was a great disappointment.  So did I.  A clerk.  Coughed herself to death when I was young.  I remember going to the theatre with her. Not real theatre...traveling players.  Not where I lived.  What's he done?  I'm going home now.  Try singing it.  Know any songs?  Very modern.  Sing it.  Only if you sing. Goes like this... \"Way down upon the...\"  You didn't stutter.  You can with me.  I take that as a compliment. Cut some struts from the balsa. Sorry, hard to show you what to do at five paces. Would you like a cup of tea?  You were about to sing an aria concerning your brother.  Try \"Camptown Races\" then. \"The Arch of C, he said to me, doo-dah doo- dah...\" That sort of thing.  My future King? He's your future King too. Did that cause friction? Knowing he'd grow up to be King, but you wouldn't.  Two lumps or one?  Always preferable. Cover it with tissue.  Why's that?  No smoking. What's the age difference?  But for eighteen months you would've been King?!  As you said: eighteen months.  How close?  I don't, or I wouldn't ask. Did you go after the same girls?  Princess Elizabeth?  Now dope the other wing. Did David tease you?  Otherwise the paint will eat through the tissue.  Mandatory. Tell me more about your storybook childhood. What was your earliest memory?  This time I'd like an answer.  How can you remember that?  I don't understand.  And?  Anything else?  You sound angry.  Angry at me, or at your brother?  How dreadful.  What's wrong with her?  Some of them must be lovable.  Can't they fornicate privately like adults?  \"Queen Wallis of Baltimore\"?  Does sound a bit iffy.  Touch it up.  I advise you never to beg. Especially if you might be King.  I see. For reasons you cannot disclose, fearing ramifications you will not explain, you feel sufficiently anxious to embark upon a course of therapy in which you have no faith? You already owe me a shilling.  I'll continue to ask questions.    I do now.  You don't wish to be seen? Slip out the back way.  You're having second thoughts.  I ask too many questions?     Australian.  And if you decide to come, bring the Duchess. She might be helpful.  Not sure. She isn't speaking to me. Wants to go home. After the funeral then?  How're you doing, Willie?  Willie?  Well done.  To be honest, wasn't sure whether to expect you.  Something happened?  With a toothache.  You seldom stutter with me anymore. The boys are a bit untidy.  Like a verbal geisha girl?  Home.  Coming from a man who's lived all his life in castles and palaces.  Somebody does.  You could've refused. Don't you know any rude words?  Perhaps a touch more vulgar?  To prove you know how.  A public school prig could do better.  Hardly robust.  See how defecation flows trippingly from the tongue? You don't stutter when you swear.  Get angry more often. Do you know the f- word?  Oh Bertie...  Bravissimo! Now a resounding chorus of...  Sorry, pet! Won't happen again!  First time I've heard you laugh.  Which explains a lot.  Your next public appearance should be very well rehearsed.  Anyone in mind?  Your wife was the one who sought me out.  But you don't share her belief? Why come here?  Lionel.  Not to worry. They say the King can do no wrong.  And if Mr Baldwin stops them?  Does that include debasing yourself?  Your brother knew perfectly well by giving you a document without warning...  Are you insisting he didn't? In the future we can parse any document into manageable phrases. You can sing them, swear them, rehearse them til you get the rhythm and flow; that, combined with your growing confidence...  Trying to get you to   realize you need not be governed by fear.   Again, why did you seek me out? To take   polite elocution lessons so you could   attend posh tea parties?!  Now?  Outer Mongolia?  Nothing prevents.  Australia.  Caliban?  Of course. \"Be not afeard; the isle is full of noises, Sounds and sweet airs, that give delight, and hurt not.\"  \"Sometimes a thousand twanging instruments Will hum about mine ears; and sometimes voices...\"  You may leave.  First class.  Willie's a problem...not much progress. The others have been referred.  Try not to act the toff. Teach perhaps.  No! I'm not good enough!  Yes, I had a go. Thanks to your patience. I just bloody well wasn't good enough!  I too \"married the woman I love.\"  A wonderful lass. Someone I can talk to heart to heart.  That's why we're suited. I'm just an ordinary bloke.  Me too.  That relationship is now past tense.  I wanted to be a great actor. That's what I wanted.  I certainly failed!  Very snugly, into my heart! Always have, always will.  We haven't much more time together. Give it a go.  There weren't any more appointments today.  Piss off! Anna?    Johnson, isn't it? Have you an appointment?  I told you, Kings don't beg.  Its \"crow\" or \"humble pie\". Take your pick.  And?  What're friends for?  Splendid. Here's another. \"She sifted seven thick-stalked thistles through strong thick sieves.\" At home, twenty-five times, in rapid succession.  Shall we invite your wife in now?  I wasn't expecting Myrtle for several hours!  As to be expected.  I'm not going out there!  Of course. We're sensible men.  Me? You.  You're the Royal.  Oh! Hello, Lady Elizabeth! Oh! Hello, Myrtle darling! What a pleasant surprise.  Some other time, love.  Glad you had a chance to meet Myrtle.    For me to show you how to pitch in.  Piece of cake. Please assume a supine position on the floor.  Firm support is needed.  Breathe deeply...expand your chest... now your stomach...deep into the diaphragm. Splendid. How do you feel?  Well on your way to becoming a qualified political speaker. Again...  ... and hold. Now, Princess Elizabeth, be so kind as to sit on your husband's stomach.  Gently of course.  Now exhale slowly...down goes Princess Elizabeth...inhale slowly...nothing rushed, expanding your chest fully, extending the column of air til it hits the diaphragm...and...up comes Princess Elizabeth. Exhale...down goes Princess Elizabeth...inhale...up comes Princess Elizabeth. You get the idea. Doesn't have to be Princess Elizabeth of course, but I thought you'd prefer your wife to one of the staff. Now comes the fun part.  You will now shout the vowel sounds, all five of them, as loudly as possible, each to last no less than 15 seconds. There's poor coordination between your larynx and diaphragm. Princess Elizabeth, you can be the official timer.  Anyone who can stand at an open window vibrating loudly in full view of the world can learn to give a public speech.    No.  We're not fighting. Your mother isn't talking.  Boys, leave.  A Duchess, she hasn't been crowned yet.  What'd you think of her?  Why'd you come home so early?  They came for help.  When that poor chap first walked into my office, he was a slim, quiet man with tired eyes and all the outward symptoms of the person upon whom a habitual speech defect has set the sign. You saw him today; once more there was hope.  Myrtle, I love you.  Myrtle... I don't deserve a wonderful woman like you.  But why'd you come home so early?    Oh, Myrtle. My love...  A King based upon deception?  Why not paint him pink and cover him with sequins?  If you wish to call attention to his anxiety.  Just Lionel.  And now, if you don't mind, we need the premises.  So must Bertie.  I do. During waking hours we'll need the facilities. It'll be a closed set. No observers.  Wouldn't want him as a friend.  Tell me...  Do you really want to be King?  You can be a wounded King who stumbles through his Coronation. Or, as the Arch of C so archly suggests, no Coronation at all. Always a choice.  I'm simply asking questions... which you seem unable to answer.  Quite possibly. But at least I know what I want. You haven't the foggiest.  That's quite different. Let's get down to work then, shall we?  As soon as you and Elizabeth enter the West door, you'll be greeted with the hymn \"I Was Glad When They Said Unto Me.\" You won't actually be that glad, because they sing it for a great long time.  You'll then show yourself to the various sides of the Abbey as the Archbishop announces four times in a loud voice, \"Sirs, I here present unto you...\" Have you decided your name for when you become King? For when you become a different person?  Like your father?  Not Albert?  \"Sirs, I here present unto you, GEORGE,  Mmm... Kedgeree! Lovely.  I've news for you. You're coming to the Coronation.  You must.  Royal Box. You and I.  Rather thought you might.  Won't be a sec.  Bertie? Blast! Stepped on Lord Byron. Bertie...?  Ah, the Star Chamber inquisition. I wondered when that would happen. And I'd promised Myrtle a new frock.  Want to hear my side of the story?    I was there.  My son, Valentine, asked, \"Could you help that poor man?\" I replied, \"He's too old for me to manage a complete cure, but I could very nearly do it, I'm sure of that.\"  I knew I could help you. You refuse to believe?  In yourself.  A failed actor.  Father wanted me to be a doctor, but I couldn't cut flesh. So I worked in the mines, recited in pubs...  When the war came, by the time I was ready to be shipped out, the first casualties were limping home. Poor buggers, broken in bone and spirit. `Lionel, you're good with your mouth, see if you can help these poor sods.' The shell-shocked were the saddest. Most stuttered profoundly. Far worse than you. Muscle therapy helped somewhat, but I found I had to go deeper, as you might well imagine.  I think you do. They had cried out, and the universe had not listened. So they'd lost faith in their voice. My job was to make them shout in righteous anger: \"I have the right to be heard!\"  Make inquiries.  But a lot of success. No training was given.  Not in Western Australia, not at that time. I simply knew what to do. When the war was over I kept being a therapist to earn a living. When the lads were old enough, I thought, \"Alright Lionel, you've always wanted to be an actor, one last go.\" I pretended it was our trip home to Mother England, the Great Australian Pilgrimage.  Cashed in our return tickets. I had three months rent.  The plaque says, `L. Logue. Speech Specialist'. No mention of a medical degree. No mention of any degree. Some of the diggers I'd helped had come to England. They made referrals. My practice flourished. My acting, however, did not.  Lock me in the Tower.  What crime?  I'm tired.  Why not? It's a chair.  It's falling apart. People have carved their initials into it. Needs a stone to keep from blowing away.  You believe such ballocks I don't care how many royal backsides have sat on it, it's a building block with handles attached. You're just like me, an actor with tawdry stage props you choose to believe are real.  Listen to you?! By what right?  Noooo you're not! Told me so yourself. Said you didn't want it. So why should I listen to a poor stuttering bloke who can't put one word after another? Why waste my time listening to you?  Heard as what?!    Bertie, you'll make a bloody good king. And you know it.  In hushed tones the BBC commentator paints a picture for the world, as you stand at the altar divested of your robes. Trumpets echo through the Abbey. The incessant rain clears miraculously as a shaft of sun streams through the stained-glass window catching your golden tunic and bathing you in light like a mediaeval knight. And you are King!  Try again.  Turn the halts into pauses, during which you say to yourself, \"God save the King\".  Use the silence. Long pauses add solemnity to great occasions.  Take it from the top. \"In this grave hour...\"  Go on...  Get a running start, put the words all together. `Perhaps-the-most-fateful...'  Beaut.  Doo-dah, doo-dah.  Five miles long...  In your head, now: \"Bugger, bugger, bugger! Damn, damn, damn! All those bloody blighters are going to have to listen to me!\" Can you dance?  Helps relax the body. Waltz?  Thought you might. Dance with me. One, two, one-two-three- four. One, two, one- two-three-four. \"For the second time...\" one-two-three-four \"... in the lives of most of us...\" one, two, one-two-three- four \"... we are at war.\" Three, four.  You'll be ready.  Of course.  Willie! Where's your mum?  You've been waiting here, alone, all this time?  Did you?  He did.  Would you like to sing, dance, and shout rude words?  Why am I not surprised?  You're going to be splendid. And if you're not?  Bloody right.      Keep it for good luck.  My greatest honour, Bertie. One final question.  Do you believe you're King?  I always called you Bertie. Today, I call you King.",
        "Myrtle": "You'll all hang from the gallows if you don't come for tea.  Another spoiled silly?  Take your plates.  No wonder about the silly. You're so good at what you do.  Oh, Lionel, that'd get us home in grand style wouldn't it?!  We wouldn't want that.  Hard to feel sorry for that sort.  Course, Lionel. Loads and loads.  We have children...!  I should hope not!  Lionel?  Tickets? Home?  What about your...  What'll you do when we get home?  You could...  You gave it a try, Lionel.    You married a shop girl.  Using simple words and short sentences. I'm very ordinary.  Ordinary? You're a man with wild dreams, Lionel. Mine are so very small. A job, a husband, a home. Raising our sons. That's all I ever wanted.  Is that why, every day, you've spent hours with a man who's about to be King?  Yet, for as long as you could, you did what you wanted.  And failing that...  A great healer. Always...'great'. Where does a shop girl fit in?  Trouble is, Lionel, when you say that, I still believe it.  I've got the boys sorting their things. Your office will be a chore...  Milady?  You may call me \"Madam Logue\".  May I offer you a cup of tea, Ma'am?  You don't like my husband. That's what I was told.  What do you dislike about my Lionel?  I don't want my Lionel getting hurt.  Will the Yorks be staying for dinner?  You wish me to speak my mind?  Lionel...without warning, I arrive home to find the Queen in my parlour.  Lionel, don't quibble!  Does it matter!? She's the Queen and he's the King forgodsake! What're they doing here?!  Lionel...  What role are you auditioning for now? Royal saviour?! Who's going to help us?! This will bring us down, Lionel. You know it will.  You're not listening to me!  You say that, but you don't listen when I say, in so many ways, how desperately I want to go home, how I never, ever, intended to stay here. This was to be a holiday trip to see `Mother England', and you turned it into quite something else. What happened, Lionel? We went to Wembley Stadium, next thing...you'd cashed in our tickets.  Very well, I shan't talk of this ever again. I will, as always, be supportive of your endeavours.  How right you are.  Lionel...I was let go.  Inquiries were made...Mr Falkoff wouldn't say who...afterwards it was: `With your hubby treating a personage that high and mighty, you won't be needing employment with us, will you, Mrs Logue?'  They're frightened, Lionel. Of what seems so far above them. I sympathize. I'm frightened too.  A bit dry. Tried to keep it warm.  You look done in.  I've news for you. I'm not!  Stand in the rain hoping for a glimpse?  Lionel...I'd need a new dress.",
        "Robert": "",
        "Wood": ""
    },
    "imdb_rating": "8.0",
    "description": "Britain's Prince Albert must ascend the throne asKing George VI, but he has a speech impediment. Knowing that the country needs her husband to be able to communicate effectively, Elizabeth hires Lionel Logue, an Australian actor and speech therapist, to help him overcome his stammer. An extraordinary friendship develops between the two men, as Logue uses unconventional means to teach the monarch how to speak with confidence.—Jwelch5742",
    "name": "The King's Speech",
    "genres": [
        "Biography",
        "Drama",
        "History"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMzU5MjEwMTg2Nl5BMl5BanBnXkFtZTcwNzM3MTYxNA@@._V1_QL75_UY281_CR1,0,190,281_.jpg"
}