{
    "filename": "Avengers,-The_script.txt",
    "imdb_id": "tt0848228",
    "imdb_url": "https://www.imdb.com/title/tt0848228",
    "characters": [
        "Clint Barton /Hawkeye",
        "Nick Fury",
        "Natasha Romanoff /Black Widow",
        "Tony Stark /Iron Man",
        "Selvig",
        "Loki",
        "Agent Maria Hill",
        "The Other",
        "Thor",
        "Jarvis (voice)",
        "Bruce Banner /The Hulk",
        "Pepper Potts",
        "Agent Phil Coulson",
        "NASA Scientist",
        "Steve Rogers /Captain America"
    ],
    "dialogues": {
        "Nick": "",
        "Fury": "",
        "Selvig": "",
        "Loki": "",
        "The": "Screenplay by Don Macpherson                            June 21, 1995         Steed -- ?!    Brenda and I thought we'd drop in.  Mother suits action to the word, drops into his wheelchair.   Weather's turning nasty.   Oh yes I did. I want you to meet somebody.  I expect you'll like her.  Brenda coolly files her nails.  A flash of jealousy.   That's better. I much prefer a womb with view, don't you, Mrs. Peel?  A delicate CLOCK on the mantel CHIMES FOUR.  Mother wheels himself forward and hooks onto the kettle.   Shall I be mother?  He pours, presiding like a fat spider at the center of a subterranean web, known as The Ministry: a vast bureaucracy in a labyrinth of tunnels.  Catches Emma's wandering lock   I expect you're wondering where you are.  An atmosphere of a gentleman's club reigns in the subterranean bureau -- Emma takes her tea ...   Close. We're so hush-hush, even we know nothing about it. (before Emma can make sense of this) Now let's see, there's coconut cake, date and walnut; I recommend the rum baba ...   Looks like rain, Steed...   Oh, yes we are.   We've had a series of bizarre weather reports. We kept them hush-hush and sent agents into the field for data. Case number one: April 14, 3:35 P.M., Special Agent Simkins investigating mysterious fires in corn circles. A field outside the village of Little Snoring, one of the hottest days of the year. Trapped by a sudden blizzard. Found frozen to death in a giant ice cube -- like a mammoth in perma-frost.  Case two: Pilot Raymond Shaw, May 6, 11:28 A.M. Took off from a deserted airstrip near Stoke Poges, investigating bizarre atmospheric reports. A freak rainstorm downed him. Knocked unconscious by a flying fish, falling from 15,000 feet. Twenty-five inches of rain in eight minutes, over an area the size of a cricket pitch ...  ... Case three: June 2, 5:43 P.M. Defense Chief Major Courtnay. Remains discovered in a turnip field near Ashby de la Zouche. Our boffins recorded a sudden blast of heat. Scorched earth, temperature of 1000 degrees. Spontaneous combustion. Not much of him left ...  CLICK.  The lights go back on.  Emma notices - a new arrival  a tall, striking OLDER WOMAN; dark glasses.   My number two. Special assignments. She's --   All happy families here, Mrs. Peel.  Father's dark glasses turn to Emma like a hawk.  Runs her fingers over Emma's face. Gets the outline.  Emma realizes --   God, you're quick.   Have a look at these, Mrs. Peel --  He passes 'round a box of evidence related to the screen events:  Steed investigates a pair of black shoes and bowler; Emma, a fish.  The shoes have agent Simkins' name in them ...   A series of bizarre shifts in local weather patterns ...   Jungle plants in the Arctic? A lush English village transformed overnight into African scrubland? Blizzards in summer?   Something strange is happening. And whoever knows about it doesn't want us to find out.    Your mission is simple. Find out how and why these agents died.   Your research into climate engineering was state-of-the-art. Your experiments could have revolutionized our knowledge of global warming -- had they succeeded. We need your expertise.   One moment, Mrs. Peel. There's another special reason we wanted you to join our happy family; rather curious, actually ...  Mother hits the lights.  He flicks the video into slow-mo.  File thru image clarification, identikit sketches.   Eye witness reports. Strangers in the area. One description tallied in all three places. Recognize her?  Emma locks.  On the screen comes -- Emma Peel.  Steed reacts.   Think of it as special assignment, Mrs. Peel. With a twist. You're our chief suspect.   Father will be your controller. Steed here will show you the ropes.   She may not know. Theory goes she may be very ill.   Possibly. Split personality ...   Who knows? If Dr. Darling is right, you should watch out.   She may try to kill you.    Something went wrong. System malfunction. Explosion. Mrs. Peel had a narrow escape. Suspected sabotage. Nothing proven. File still open.   Still doesn't. Better safe than sorry.  She was in a dangerous game, Steed. High stakes. She may prove to be a risk.  If she is, there's only one solution.  Termination.   You.  OFF Steed's reaction.  CLASHING BLADES OVER ...     Dark.  Switches on the light.  And gasps.     Meanwhile Emma wakes up. Turns the corner.  Towards the other room, sees dead Teddy.  Reads the label on his suitcase ...      Emergency alert ...    A cyclone hit Banffshire last night. Completely unpredicted ...    Mobile HQ. In a blue funk.  Can't take chances. I'm looking after things while he's hiding out ...  Father drives like a maniac.  She senses their unease.   You're probably wondering how I can drive 'blind.' Simple. A new prototype from the boys in X division. Micro-sensors in the system read signals and road information. Converts the info into miles per hour. Ultra-sensitive.  Ultra-smart.  Father jumps a red light.  CARS SCREECH together in a huge pile-up.  Not that smart. Steed holds onto his hat.   So you say ...   It's Mother you have to convince. He's very agitated.  Wait here.  Father SCREECHES to a halt on Holland Park Avenue  Steed and Emma get out.  Father takes off ...   Welcome to mobile H.Q. Weather's turning quite nasty. Sir August was blown to smithereens. Along with half of Banffshire.  The Ministry's worried.   Too late anyway. Today's escapade was only for starters. This is no ordinary weather. It's manmade. A kind of weather bomb.   Would it be possible to use it for military purposes?   London. The World Council of Ministers meets soon on global defence. If you can control the weather, you control the world.    Steed looks around, picks the lock ... hi-tech style ...     A kind of space-age travel agency.  Steed enters.  At the reception desk, the receptionist has her back turned.  Steed sneaks in, moves behind a screen, overhears --  A man -- Bailey -- giving orders to the receptionist    Emma sees a statue of a Butler.  Which springs to life.  Summons Emma.  She follows down a path strewn with leaves.  As Emma steps on the leaves, she --  Falls down -- a giant rabbit hole.    This man -- did you see him?    You are here under observation, Mrs. Peel. You must answer Dr. Darling's questions  Pushes Dr. Darling aside.    You need treatment, Mrs. Peel.  You can't resign.   Don't open that, Mrs. Peel!  Fat chance ... she goes in ...     We want to help...!   The death of Peter Peel was a great loss. To us all ...   Peter Peel was a first class agent. A senior operative. 'X' department Special operations. He was engaged in top secret research. Top priority.  Government approved.   A cover ... for us.  I'm sorry...  A turning moment for Emma.  A life lived on a lie.   ... was written by me.  It was sabotage, Mrs. Peel.  Deadly serious, Emma walks over to him.   Quite frankly ... it could have been you.  Silence.  Emma looks away, shocked.  Steed intervenes   Her husband suspected someone very close to the operation. On the day he died, he was setting a test. To prove to himself -- to us that his wife was beyond suspicion. He had to be certain. He said he was going to give Mrs. Peel something ...  Emma keeps staring at Mother, fingers her diamond ring.   ... I want you to remember. Did Peter give you anything on-that day?    Under suspicion. Everyone died in the explosion, Mrs. Peel. You were the only survivor ...  Mother waits.  Emma turns round.  Looks fiercely at him.  Mother shifts uneasily as Emma walks past him to the airlock.   This is an official matter, Mrs. Peel. No need to take it personally. Where are you going?   The doors and walls are monitored, Mrs. Peel. This is a very secure establishment.   Pity. I was growing fond of Mrs. Peel. Unfortunately --   Mother and Father know best.  Mother wheels himself off.  Then stops; over his shoulder:   Something quick. Nothing too ... messy.  ON Steed.  CAR ROAR over as --     Steed on the phone.    At the controls, Brenda looks on.  She hands a bag of jelly babies to Mother.  Who picks out his favorites, as he gives a briefing to Father and others, sitting in passenger seats --  ORDERS BARKED OUTSIDE as --   Inside that hall are some of the Most powerful figures in the world. Tight security. Our only option.   I'll see to it personally.  Brenda glances over at Father's imperturbable face. As --    We want Mrs. Peel.   You disobeyed an order, Steed. Mrs. Peel is dangerous; she cannot be trusted.  Emma looks out the window behind her; eyes widen ... back to --   I shall summon security.  She turns, almost walks into the door as she slips away.  Emma returns as the ALARM is raised --    Mother, Brenda, et al choke on purple smoke in the bus ...     Thru the blizzard, zooming down streets, landmark buildings looming up topped in snow, feet up ... shinnying up the chain wire ...  \"THE MERRY WIDOW WALTZ,\" no longer heard as old record or ensemble arrangement but enormous, for FULL ORCHESTRA ...     which unloads a rope ladder as Emma puts on every ounce of steam ... The Man reaches for the dangling ladder -- but --    Where's Mrs. Peel?  He signals frantically for Father to trace the call, but being blind, Father just sits there.   You're getting yourself into terrible trouble, my son. Weather's turning very nasty -- and so am I.   (grabs mirror; searches his face Where?   I'm warning you for the last time, Steed: whoever's behind all this, looks like Mrs. Peel, walks like Mrs. Peel and kills like Mrs. Peel.  CLICK.  The line goes dead.     Furious.   Steed??  Find Mrs. Peel.  Brenda smiles at the thought.  Father rises, grim.     Emma in Wonderland. Welcome, Mrs. Peel.  We've been expecting you. We hope you'll enjoy your stay with us. Decontamination is almost complete.   And you've a new wardrobe. He does want you to look attractive.  He tells me you're very beautiful.  Emma pounds the glass in frustration.   Relax, Mrs. Peel. We're hundreds of feet below ground. The Ministry made it impregnable. No one can save you.    Steed   You reek of Mrs. Peel's Black Leather ...   Mother betrayed me. She was going to replace me with a younger Father.  Errand boy that's all I was. 'Find Steed...'   Dr. Darling, this is Father. We have an intruder. I repeat --  Valentine switches off the PA.    The grille pops off and Steed emerges where the guards are waiting for him --    run towards him, Steed swivels gracefully and - slams the bowler in their faces, a sartorial knuckleduster -- wham -- !  One drops -- Bam -- !  The other collapses, slump to the ground.  Steed stoops down, picks up his hat, sees --  A dent in its steel top.  For the first time, Steed loses his cool.  Genuine rage.   Congratulations. The clouds are on course ...   Not yet! They haven't heard our terms ... !  Father tries to hit the switch.  Valentine yanks her off.   But all those people -- !  Valentine strikes her hard --    Mother at the controls.  RINGS the ALARM.  Panic stations as -- SIRENS BLARE. WARNINGS RING OUT OVER TV and RADIO --   Dense cloud formation moving south- west. On course for the center of the city. A fog floating in from the river. The prediction is ... unstable chemical reaction. Enforce the curfew ... Emergency stand by ... !    About your next assignment, Mrs. Peel ...   Ahem. As I was saying, perhaps another macaroon ...    </html>",
        "Other": "Steed -- ?!    Brenda and I thought we'd drop in.  Mother suits action to the word, drops into his wheelchair.   Weather's turning nasty.   Oh yes I did. I want you to meet somebody.  I expect you'll like her.  Brenda coolly files her nails.  A flash of jealousy.   That's better. I much prefer a womb with view, don't you, Mrs. Peel?  A delicate CLOCK on the mantel CHIMES FOUR.  Mother wheels himself forward and hooks onto the kettle.   Shall I be mother?  He pours, presiding like a fat spider at the center of a subterranean web, known as The Ministry: a vast bureaucracy in a labyrinth of tunnels.  Catches Emma's wandering lock   I expect you're wondering where you are.  An atmosphere of a gentleman's club reigns in the subterranean bureau -- Emma takes her tea ...   Close. We're so hush-hush, even we know nothing about it. (before Emma can make sense of this) Now let's see, there's coconut cake, date and walnut; I recommend the rum baba ...   Looks like rain, Steed...   Oh, yes we are.   We've had a series of bizarre weather reports. We kept them hush-hush and sent agents into the field for data. Case number one: April 14, 3:35 P.M., Special Agent Simkins investigating mysterious fires in corn circles. A field outside the village of Little Snoring, one of the hottest days of the year. Trapped by a sudden blizzard. Found frozen to death in a giant ice cube -- like a mammoth in perma-frost.  Case two: Pilot Raymond Shaw, May 6, 11:28 A.M. Took off from a deserted airstrip near Stoke Poges, investigating bizarre atmospheric reports. A freak rainstorm downed him. Knocked unconscious by a flying fish, falling from 15,000 feet. Twenty-five inches of rain in eight minutes, over an area the size of a cricket pitch ...  ... Case three: June 2, 5:43 P.M. Defense Chief Major Courtnay. Remains discovered in a turnip field near Ashby de la Zouche. Our boffins recorded a sudden blast of heat. Scorched earth, temperature of 1000 degrees. Spontaneous combustion. Not much of him left ...  CLICK.  The lights go back on.  Emma notices - a new arrival  a tall, striking OLDER WOMAN; dark glasses.   My number two. Special assignments. She's --   Have a look at these, Mrs. Peel --  He passes 'round a box of evidence related to the screen events:  Steed investigates a pair of black shoes and bowler; Emma, a fish.  The shoes have agent Simkins' name in them ...   Something strange is happening. And whoever knows about it doesn't want us to find out.   Your research into climate engineering was state-of-the-art. Your experiments could have revolutionized our knowledge of global warming -- had they succeeded. We need your expertise.   Eye witness reports. Strangers in the area. One description tallied in all three places. Recognize her?  Emma locks.  On the screen comes -- Emma Peel.  Steed reacts.   Father will be your controller. Steed here will show you the ropes.   She may not know. Theory goes she may be very ill.   Possibly. Split personality ...   Who knows? If Dr. Darling is right, you should watch out.   She may try to kill you.    Something went wrong. System malfunction. Explosion. Mrs. Peel had a narrow escape. Suspected sabotage. Nothing proven. File still open.   Still doesn't. Better safe than sorry.  She was in a dangerous game, Steed. High stakes. She may prove to be a risk.  If she is, there's only one solution.  Termination.   You.  OFF Steed's reaction.  CLASHING BLADES OVER ...     Dark.  Switches on the light.  And gasps.     Meanwhile Emma wakes up. Turns the corner.  Towards the other room, sees dead Teddy.  Reads the label on his suitcase ...   Welcome to mobile H.Q. Weather's turning quite nasty. Sir August was blown to smithereens. Along with half of Banffshire.  The Ministry's worried.   Too late anyway. Today's escapade was only for starters. This is no ordinary weather. It's manmade. A kind of weather bomb.   Would it be possible to use it for military purposes?   London. The World Council of Ministers meets soon on global defence. If you can control the weather, you control the world.    Emma sees a statue of a Butler.  Which springs to life.  Summons Emma.  She follows down a path strewn with leaves.  As Emma steps on the leaves, she --  Falls down -- a giant rabbit hole.    This man -- did you see him?    You are here under observation, Mrs. Peel. You must answer Dr. Darling's questions  Pushes Dr. Darling aside.    You need treatment, Mrs. Peel.  You can't resign.   Don't open that, Mrs. Peel!  Fat chance ... she goes in ...     We want to help...!   The death of Peter Peel was a great loss. To us all ...   Peter Peel was a first class agent. A senior operative. 'X' department Special operations. He was engaged in top secret research. Top priority.  Government approved.   A cover ... for us.  I'm sorry...  A turning moment for Emma.  A life lived on a lie.   ... was written by me.  It was sabotage, Mrs. Peel.  Deadly serious, Emma walks over to him.   Quite frankly ... it could have been you.  Silence.  Emma looks away, shocked.  Steed intervenes   Her husband suspected someone very close to the operation. On the day he died, he was setting a test. To prove to himself -- to us that his wife was beyond suspicion. He had to be certain. He said he was going to give Mrs. Peel something ...  Emma keeps staring at Mother, fingers her diamond ring.   ... I want you to remember. Did Peter give you anything on-that day?    Under suspicion. Everyone died in the explosion, Mrs. Peel. You were the only survivor ...  Mother waits.  Emma turns round.  Looks fiercely at him.  Mother shifts uneasily as Emma walks past him to the airlock.   This is an official matter, Mrs. Peel. No need to take it personally. Where are you going?   The doors and walls are monitored, Mrs. Peel. This is a very secure establishment.   Pity. I was growing fond of Mrs. Peel. Unfortunately --   Mother and Father know best.  Mother wheels himself off.  Then stops; over his shoulder:   Something quick. Nothing too ... messy.  ON Steed.  CAR ROAR over as --     Steed on the phone.    At the controls, Brenda looks on.  She hands a bag of jelly babies to Mother.  Who picks out his favorites, as he gives a briefing to Father and others, sitting in passenger seats --  ORDERS BARKED OUTSIDE as --   Inside that hall are some of the Most powerful figures in the world. Tight security. Our only option.    Mother, Brenda, et al choke on purple smoke in the bus ...     which unloads a rope ladder as Emma puts on every ounce of steam ... The Man reaches for the dangling ladder -- but --    Where's Mrs. Peel?  He signals frantically for Father to trace the call, but being blind, Father just sits there.   You're getting yourself into terrible trouble, my son. Weather's turning very nasty -- and so am I.   (grabs mirror; searches his face Where?   I'm warning you for the last time, Steed: whoever's behind all this, looks like Mrs. Peel, walks like Mrs. Peel and kills like Mrs. Peel.  CLICK.  The line goes dead.     Furious.   Steed??  Find Mrs. Peel.  Brenda smiles at the thought.  Father rises, grim.     The grille pops off and Steed emerges where the guards are waiting for him --    run towards him, Steed swivels gracefully and - slams the bowler in their faces, a sartorial knuckleduster -- wham -- !  One drops -- Bam -- !  The other collapses, slump to the ground.  Steed stoops down, picks up his hat, sees --  A dent in its steel top.  For the first time, Steed loses his cool.  Genuine rage.    Mother at the controls.  RINGS the ALARM.  Panic stations as -- SIRENS BLARE. WARNINGS RING OUT OVER TV and RADIO --   Dense cloud formation moving south- west. On course for the center of the city. A fog floating in from the river. The prediction is ... unstable chemical reaction. Enforce the curfew ... Emergency stand by ... !    About your next assignment, Mrs. Peel ...   Ahem. As I was saying, perhaps another macaroon ...",
        "Thor": "No Admittance  At a control barrier Steed inserts a card.  Emma sees a light flash up: \"Security -- Top Priority Clearance Only.\"  The barrier lifts.  She looks again at Steed, reappraising him as Big Ben approaches four.  The car disappears in darkness ...",
        "Jarvis": "",
        "(voice)": "",
        "Pepper": "",
        "Potts": "",
        "NASA": "",
        "Scientist": ""
    },
    "imdb_rating": "8.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNDYxNjQyMjAtNTdiOS00NGYwLWFmNTAtNThmYjU5ZGI2YTI1XkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Loki, the adopted brother of Thor, teams-up with the Chitauri Army and uses the Tesseract's power to travel from Asgard to Midgard to plot the invasion of Earth and become a king. The director of the agency S.H.I.E.L.D., Nick Fury, sets in motion project Avengers, joining Tony Stark a.k.a. the Iron Man; Steve Rogers, a.k.a. Captain America; Bruce Banner, a.k.a. The Hulk; Thor; Natasha Romanoff, a.k.a. Black Widow; and Clint Barton, a.k.a. Hawkeye, to save the world from the powerful Loki and the alien invasion.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "name": "The Avengers",
    "genres": [
        "Action",
        "Sci-Fi"
    ]
}