{
    "filename": "Debt,-The_script.txt",
    "imdb_id": "tt1226753",
    "imdb_url": "https://www.imdb.com/title/tt1226753",
    "characters": [
        "David Peretz",
        "Sarah Gold",
        "Sarah's Husband",
        "Sarah's Son",
        "Seminar Moderator (Tel Aviv 1997)",
        "Young David",
        "Frau Bernhardt /Nurse",
        "Stephan Gold",
        "Stephan's Driver",
        "Young Rachel",
        "Young Stephan",
        "Publisher",
        "Mossad Agent",
        "Doktor Bernhardt /Dieter Vogel",
        "Rachel Singer"
    ],
    "dialogues": {
        "David": "Yes.  Yes. I was expecting you.  Let's go.                  You've cut your hair.  I'm David.  Too young.    Welcome to Metsada.    It's a ghost station...  West Berlin trains pass through East Berlin on this track, but don't stop.  The station's guarded at all times...  ...and the stairs to the platform are sealed off.  Our train driver makes an unscheduled stop on the near track.  We're just one more parcel. Once we're in West Berlin there'll be transport to Templehof airbase and a private charter.      It's my birthday.  This is it.    And...I want another drink.  Are you alright?  It's a brave thing you're doing.  But you're doing it anyway. Because you know how important it is.  You're very brave.  I'm sorry, Madam, but you'll need to meet us at the hospital.  Not possible I'm afraid. New regulations.    Not without her.  It's not over.   It's going to take time. They need to open up a new route, they need to find political help. Maybe the Americans. Two weeks... maybe three.  We work four shifts guarding him. We feed him at the end of each shift. We never leave him alone.  We can do this. We just need to stay focussed.    What happened? What's the matter?  What?  It's alright. It's alright. It's nearly over.  Stephan?  What the fuck does that mean?  So...so what does that mean?  What does that mean? What's the plan now?    Were you followed?  Could you have been...?  You're not doing this.  This isn't the mission.  We're finishing this mission. We're taking him back.  What are you doing?      Don't do that again.  We're not animals. Just remember what we are. Remember what we're not.  What are you doing?    She wants to go out.    What does a monster like you know about suffering?  A doctor. You blind children trying to change the colour of their eyes. You inject people with petrol. You...you replace people's hands and legs and you watch as they...  This isn't medicine. This is disease. This is sickness.        He's gone. What does it matter? He's gone.  Agreed.               Why do you call me?                                 *  You call me, at night, when                         * you're drunk. Why do you call me?                   *  Do you want us to fuck around                       * behind his back? Like he fucks                      * around behind yours? Is that what                   * you want?                                           *  I don't want to be your friend.                    * I'm leaving.                                *  *  It doesn't matter. Away from                       * Israel, away from this...poison.                   * I can't stand what it is doing to                  * us. Come with me. We'll go to                      * Spain. Or Italy... We can save                     * ourselves.                                         *  I'm in love with you, Rachel. I                     * want my life back so I can live                     * it with you. Come with me.                          *  I thought I did.                                   * Why can't we be happy?                             *  You look well.                                            *  I expect so.  I read about                 * him. How is he?                                  *  Have you met anyone else?                        *  I wrote you letters.                             *  Rachel...                                        *  I wanted to see you...                           *  Don't go.                                        *  I was ill for a while, Rachel.                     * I spent some time in ... in a                      * kind of hospital                                   *  Mexico                                             *  Different jobs. Some teaching.                     * Whatever I could get.                              *  I travelled a lot. The States.                     * Most of South America. North                       * Africa.... I kept moving                           * Looking for him                                    *  I would have told the truth. I                     * would have gone to the newspaper,                  * and said \"this is the Surgeon of                   * Birkenau.\" I could have finally                    * seen him face trial.                               *  We'd be free. Whatever happened                   * to us, it seemed to me we'd be                    * free.                                             *  Don't you agree? Aren't you tired                 * of lying? Isn't that what you                     * would have done - if you'd found                  * him?                                              *  *  No I never did.                                   *  *  I'm sorry.                                               *",
        "Peretz": "",
        "Sarah": "We should never forget how young they were.  My father, Stephan Gold, was the youngest Unit Commander in Mossad.  David Peretz had his twenty-ninth birthday while on the mission.  My mother was even younger. Only twenty-five.  Despite their youth they'd had the courage to confront an unimaginable evil....  ...a man whose sadistic experiments left thousands disfigured or dead, who became known by a name which defiles the annals of medicine: The Surgeon of Birkenau.  Their mission had been to return him to Israel to stand trial. Instead it ended with his death on the streets of East Berlin...  But this was not what was celebrated. It was their youth itself that became a symbol. Here were the children who had faced Israel's greatest nightmare, her greatest pain...  ...and in the simple act of  This book is dedicated to my inspiration. My mother, Rachel Singer.  Mother, I'm so very proud to be your daughter.  When are you going to stop?  The smoking.  I hope so. Do it for your grandson.  Are you sure you have to go back home tomorrow?  But we'll have breakfast before you go? I thought maybe we could take a walk on the beach? (Trying to sound casual) I'd like you to see more of him.  If you'd rather read something else, mother.....      You came.  She was wonderful.",
        "Gold": "",
        "Sarah's": "She was wonderful.",
        "Husband": "She was wonderful.  *  *",
        "Son": "",
        "Young": "David Peretz?  You were expecting me?  Would you come with me sir?  What, sir?",
        "Stephan": "Breathe.    I came. So you're the famous author I've heard so much about?      It went well?  That's good. Good, good. That's very good.  We're going to David's apartment.  I keep track of people Rachel. It's my job.  I know he came to see you yesterday.  A little of both. What did he want?  What did he tell you?  My car's waiting outside. It can take you to the airport.  You're in my room.  I'm moving in with him. You're at the end there.  What do you think of your new wife?  Pretty.  You didn't notice.  You know what I've noticed? You don't notice women. I've noticed that. How long have I known you?  Two years. All the places we've been to. You don't look at women. Before I get into that bed, is there anything you have to tell me?  Well, well...I think he just noticed.  Yes?  Now an attack from behind.  Where have you come from?  Really? Whereabouts?  What were you doing there?  He does look like a chemist.  She's not going to fucking break, David. Move.  What were you doing before this?  And what did you do in Liaison?  So, first time in the field.  Good. That's...good.    Bitte sehr.  One, two, three, four, five, six...  Usually.  The last two carriages will be around...  ...here. And they will be empty. Once that train has stopped, the guards won't be able to see this fence. And on the other side of the fence is...  ...a postal depot.  The vans come and go all day long.  That's the wrapping. Now all we need is the present.    Here you are, Mossad agent, all those years of training, the highest levels of marksmanship and krav magah, first big mission...sewing.  I never argue with an armed woman.    We're too late for all of those.        Director of Collections by forty.  Forget about it.  I've spent two years with him, and I don't know him. Nobody knows him. He's alone.  All of them.  Maybe it's not always a blessing to survive.  Vielen dank!  Identity is confirmed. We have a green light.  It's whiskey.  You're so beautiful...  We need to take him to the hospital.  He's going to be alright.          We can make it. Help me with him...    Down!       Is he dead?  Is he dead?  The Guard! The one who saw your face! Is he dead?  How did he come round? How the fuck did he come round? You gave him the full injection?  Did you give him the...  Jesus Christ!  We could have gone!    You can't talk to him.  You can't listen to him.    - I'm just telling you - we don't talk to him. We don't listen to him. He isn't there. He isn't a human being. He...  We have a date. Ten days time. The Americans are going to help.  Fuck!  It's not happening.  The Americans have pulled out. Has he been fed?  Did you feed him?  I said has he...?      You know what that means? They're going to cut us loose.  It's a fucking mess and they're backing away from it quickly as they can.  It's happening. I can feel it.  Yes they can! Because we fucked it all up! We fucked it all up and now we're on our own!  If it's them, he dies.  Move.  He's not getting away from me.  I decide what the mission is! If I say he dies, he dies.  Get out of the way!  Rachel. Rachel!  It's your shift.  I was sick of seeing his face. Go back in.  You don't give orders David. It's your shift now so you can go back in there...  Don't be stupid.  Out. We're going out.    Nothing. Not a trace. Nothing at all.  He might go to the house, might try and get a message to the wife...  So we what? We...are you going to make the phone call? Are you going to tell them how he got a fucking piece of broken bowl? Wonderful. But don't try and take me down with you. I've done nothing wrong. Remember that!    No-one's ever going to find him again.    Only four people know what happened in this room. Us, and him. And he's not talking. No one will ever hear from him again.  Nobody needs to know what happened here.  That's the truth. But that doesn't have to be the truth we take home. The truth can be anything we want it to be. The truth is Vogel tried to escape, you struggled with him and got hurt. The truth is, seconds before he got away, Rachel got the gun and shot him. The truth is we got rid of him.... got rid of the body... got rid of every trace of the Surgeon of Birkenau.  No, you know what? We have to. We have to! This is...this isn't about us. This is about Israel. This is a national humiliation! We can't be seen to fail. And in the end, Vogel rots away his life in some jungle, looking over his shoulder, waiting for the bullet...? Who's to say...?  Maybe that's a worse fate. Maybe that's...The important thing is justice... justice is seen to be done!        Rachel? Say it. It's an oath. Say it.  We don't know it's him.  If you read it...  This is a little internet story. (Grabbing the paper, reading)...\"a psychiatric patient claiming to be the Surgeon of Birkenau...\" Some crazy old man. No-one is paying this any attention. Yet.  David comes back after all this time, I want to know why. I had his apartment searched. This was on his computer...  He didn't say anything to you last night..?  Rachel..?  Because he couldn't handle it. I told him we had to deal with it and he couldn't handle it. He thought it was all going to come out and he panicked...      There's a journalist.  A Ukrainian. He's heard about it and he's going to interview Vogel.  Then it all comes apart.  We don't have the name of the hospital. You have to find out where he is.  David's taken himself out of the equation. I can't do it. You're the only one left.  We can't...      I wasn't referring to the wheelchair.  If I could go back, Rachel, I'd change it all. If I could give you back a chance to be happy, to be...  But there's one thing I would never change.  My car's waiting outside. It can take you to the airport.  Go down to her. Say goodbye to her.    Fuck him.  Hurry up.  *    It's outside Vinnycja. About a hundred and fifty miles south- west of you. What name is he going under?  When is he supposed to interview him?  This will be over soon. And when it is...           Thank God. Thank God. This is wonderful. This is...and you're okay? Rachel? You're alright, yes?  Rachel?  Well, thank God I was, but...     About David?  What?    Truth is a luxury, Rachel. Some people have to put other things first - their country, their people...their children...  Sarah's so proud of you, Rachel. You have to think about her.      Rachel...? Rachel...?  Listen to me...  Rachel, listen to me...!",
        "Stephan's": "",
        "Driver": "There's something on the tracks up here!",
        "Rachel": "Stop what?  Soon.  It's all arranged, I'm afraid...    ...Yes, thank you.  No, that's fine.    I thought he couldn't come.  Stephan.        This is ridiculous. What's so important? Tell me where we're going?  David...?    Fuck you.  He didn't tell me anything. (Off his look) He didn't! He told me where he'd been travelling, that he'd been teaching... We spoke for a few minutes and then I had to go.        Why did he do it?             Rachel.  Where do I sleep?      Argentina.  Cordoba.  My husband is an Industrial Chemist.  Before Argentina we lived in Hungary where my husband studied...  Oh...Liaison.           Good morning, doctor.  Twenty five.  Nearly two years.  Really?  Oh, good.  Argentina. We just moved here... A few months ago.  Teatro Colon.    Try this on.    Black belt in dressmaking.    Uh, at ten - study the Mishnah, at fifteen - study the Talmud. By eighteen - stand under the wedding canopy...  Uh...twenty. In your twenties you are to \"pursue your life's goals.\"  I don't know. I'm waiting to find out.  What about you, grandfather? Have you got a goal?  So what's your goal?    This is it? This is all you want?  Seriously, what do you want out of life?  Forget about what?  What about family?  All of them?    Who... told us?  (trying to conceal her  Very good.  No.  Yes.      I'm not brave. I'm terrified.         Okay.    What about your patients in Birkenau...?  Help!  He collapsed!    They're here. Stay with him. I'll go and get them...  Don't worry, he's in good hands now. He's going to be fine.  You should get your things, go to the hospital to meet him.    First shift. The girls said it was okay to come out for a smoke....  Yes.       Well, maybe I'll see you there? I finish in half an hour. Why don't you go and get me a drink ready?           I think it came from over here?    I work here. I'm on a break.                          Who?  No.  I don't know! I thought I...        You made contact?  What did he say?  I didn't say anything.  I know. I just...  Good.  Nothing. He...nothing.  He can understand us.  He can understand every word we're saying. He just spoke to me.    What did they say?  Oh God...    YES! I fed him!    They can't just leave us!  Stephan?  Stephan!  What are you doing?    About what?  Stop it!  I have to get out.  Get out of my way, please. I'm just going to go out for a few minutes. That's all I want to do.                 I take responsibility. It was my shift.  What are you talking about?  (Realizing what he  He escaped.  We can't lie about this!  David...?    Oh God! Oh God!  He's alive! He's in the Ukraine! What else is there to read?  (as if her mind was  No!      What did you tell him to do?    You could have left it alone! It's an old man in a hospital! You said - nobody will believe it! No-one will notice!  What are you talking about?  Are you insane?  I'm not...Look at me! I'm not capable of...This is insane. I can't do this.  I won't do this.      God doesn't plant car bombs.    She can never find out.  How can I?  How can I?  (turning to the Kiosk  Just a coffee.  At that moment, I don't think I was thinking about myself at all. I was thinking about my mother. I was thinking about how she had suffered in Europe.     Go to bed, Sarah.  My own party and you're the only                    * friend I have...                                    *  ... all Stephen's friends.                          * Stephen's girlfriends.  And what kind of a friend are                       * you? I call you last night and...                   *  I thought the silence was for the                   * audience, I didn't know you'd                       * really lost your voice.                             *  What?                                               *  What are you...?                                    *  I want a friend                                     *  Good. I don't know why you                         * bothered coming if your just                       * going to...                                        *  Where...whare are you going?                       *    You can't do this to me now. We                     * had our chance. We said we would                    * live with it. This is me living                     * with it.                                            *  You can start again. You don't                      * have a child. You don't have                        * anyone.                                             *  *    Here...  This should cover it.      He's at the BABENKO Hospital.  Ivan Schevchuk. He's the right age.  Tomorrow.  I'll tell you something. At that moment, when I was on the floor, I wasn't thinking about myself at all. I was thinking about my mother. And what she had suffered in Europe. I think that was what gave me the strength to get up again.  Does Stephan know you're here?                            *  *  Things became...very bad between                 * us. We try to stay civil for                     * Sarah.                                           *  No. Thank you for asking. There                  * was someone...but he left. And I                 * never heard from him again.                      * What are you doing here, David?                  *  Pity you didn't send any of them                 *  *  *  Where?                                             *  What were you doing in Mexico?                     *  Who..?                                             *  Why?                                               * What would you have done if you                    * had found him..?                                   *  And what would have happened to                    * us?                                                *  But it isn't just us.  It's                 * Sarah...                                          *  She hasn't done anything wrong.                   *  If the truth had come out she                     * would be destroyed.                         * So...no, I wouldn't have told the                 * truth.                                            * But you never found him                           *  *  There's a car for me....(Putting                  * on her coat) Did you hear about                   * Sarah's book...?                                  *  The launch is tomorrow. Perhaps                   * you could come? I don't know if                   * Stephan will be there or not,                     * but...                                            *  We can't go back.  Come tomorrow. We'll talk then?                          *          Oh, no, no. I'm Mr Schevchuk's niece. Anna Barova. I've been before, do you remember?    Yes. I've heard of you.    It isn't him. It's over.  You were wrong.  About David. You were wrong about him.  He didn't kill himself because he was afraid the story would come out.    When he came to see me, he was asking me for something.  My permission. And I didn't give it. I wouldn't let him tell the truth and he was tired of living with the lie.       I want to do something to make her proud of me.  People have to know the truth, Stephan. David was right.    Goodbye.          As she moves down another corridor. She reaches an opening on her left, which reveals a STAIRCASE winding around a central lift shaft, caged in frosted glass panels. She glances through it as she passes. And just for a second we see an ELDERLY MAN walking down the stairs. Rachel has walked on a few steps before it registers, and she stops -",
        "Publisher": "",
        "Mossad": "",
        "Agent": "David Peretz?  You were expecting me?  Would you come with me sir?  What, sir?",
        "Singer": ""
    },
    "imdb_rating": "6.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNDc1MmRjNGQtN2I4Mi00NWJiLThlNDEtNWFiNGZkZjlmNDE2XkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_QL75_UX380_CR0,6,380,562_.jpg",
    "description": "The espionage thriller begins in 1997, as shocking news reaches retired Mossad secret agents Rachel Singer (Dame Helen Mirren) and Stephan Gold (Tom Wilkinson) about their former colleague David Peretz (Ciarán Hinds). All three have been venerated for decades by their country because of the mission that they undertook back in 1965, when the trio (Jessica Chastain, Marton Csokas, and Sam Worthington) tracked down Nazi war criminal Dieter Vogel (Jesper Christensen) in East Berlin. At great risk, and at considerable personal cost, the team's mission was accomplished--or was it? The suspense builds in and across two different time periods, with startling action and surprising revelations.—Focus Features",
    "name": "The Debt",
    "genres": [
        "Drama",
        "Thriller"
    ]
}