{
    "filename": "Curious-Case-of-Benjamin-Button,-The_script.txt",
    "imdb_id": "tt0421715",
    "imdb_url": "https://www.imdb.com/title/tt0421715",
    "characters": [
        "Caroline Button",
        "Dorothy Baker (as Faune Chambers)",
        "Benjamin Button",
        "Monsieur Gateau",
        "Man at Train Station",
        "Priest Giving Last Rites",
        "Daisy",
        "Blanche Devereux",
        "Queenie",
        "Tizzy (as Mahershalalhashbaz Ali)",
        "Thomas Button",
        "Caroline",
        "Doctor at Benjamin's Birth",
        "Teddy Roosevelt",
        "Martin Gateau (as Jacob Wood)"
    ],
    "dialogues": {
        "Caroline": "The wind, Mother... They say a hurricane is on its way... You've been asleep... I was waiting to see you...  I've forgotten what the weather can be like here. I've lived with four seasons so many years now.    Do you want more medication, Mother? The doctor said you can have all you want.  A friend told me she never had a chance to say goodbye to her mother. I wanted to thank you, Mother, for bringing me into this world. For raising me so well.  I wanted to tell you how much you've meant to me. I'm going to miss you so much...  Are you afraid?  No, please go call...  I hope I haven't disappointed you, Mother.  I wished I had more to show for myself. I know you would have liked to have had grandchildren.  My life hasn't been all that... normal...  I'm either a step ahead... or a step behind...  What?  An envelope?  This one?  What do you mean?  It's dated \"April 4, 1985.\" It says, \"New Orleans.\" \"This is my last will and testament... I don't have much to leave... few possessions, no money really... I will go out of this world the same way I came in, alone and with nothing. All I have is my story... I'm writing it now while I still remember it...\"  \"My name is Benjamin...\"  Is any of this true?  Some pages seem to be torn out here...  There's an old streetcar token.  Shallow.  No, that's fine...please...  Dorothy had to go home...  \"On Sundays the families would come and visit...  Are you alright, Mother?  This man. He loved you from the first time he saw you.    He crossed out something... and then he's written... \"When...\"  I'll get the nurse...  I haven't spent as much time as I would have like with her the last few years.    Did you say something, Mother?  It seems to be getting worse.  Are you hearing me, mother?  What?  Do you want me to go on reading?  \"Things were changing quickly.\"    Is this what you're looking for?  You said you wanted this?    Did you love him, mother?    Are you upset, Mother?  Would you like some socks?  Do you want me to stop reading?  (after a beat,  He said, \"The most beautiful,\" Mother.  He said...  Oh, that's great.  Isn't that good news, Mother?  The hurricane.     It is going to miss us.  Would you like me to keep reading?    Did you Mother?  You couldn't have known.  I've never seen these... You never talked about your dancing very much...    I'll get the nurse...    \"...I listened to the sound of the house...\" I think I already read that... The next thing he wrote... he spilled something on it... It's hard to read... Something about \"sailing.\" Does that make sense?  (after a beat,  Did you ever tell him about this Benjamin?  \"That night, in the Caribbean I had a visitor...\"  \"It was one of the happiest times of my life...\"  I thought the wind had shifted away...  Mother?  He said, \"She found peace.\"      \"She flourished...\"  We named her Caroline, for my mother...  He was my father...? This Benjamin was my father?  Why didn't you ever tell me...?!  You never said a word to me...  I need to go for a minute...    \"You grew, like the doctor had said, normal and healthy...\"  I almost wish I didn't know any of this. I feel odd, reading...it...  Where did he go?  There are postcards...  They're all addressed to me... They're from all sorts of places...  They're for my birthday. 1970...I would have been two... \"Happy Birthday.\" \"I wish I could have kissed you goodnight.\" \"Happy Birthday, you're five.\" \"I wish I could have taken you to your first day of school.\" \"Happy Birthday six-year-old.\" \"I wish I could be there to teach you how to play the piano...\" \"11...\" \"...Told you not to chase some boy...\" \"13...\" \"Held you when you had a broken heart...\" \"1983.\" I was fifteen. \"I wish I could have been your father. Nothing I ever did will replace that...\"    \"... I hope you start all over again...\"  (takes up reading  You ready, Mom?  Is something wrong, Mother?  Hi...  That young man was my father?  Is there anything we need to do?  That's the last thing he wrote...  What happened to him after that last time with you, Mother?  I'm going to see what they want us to do...  It's a train schedule.  \"I'm on a train in India filled with people.\"  He started to write something else... \"I'm going...\" But he stopped...  I wish I had known him.  I'd better go and see what they're planning to do...",
        "Button": "The war to end all wars had ended.  I was told it was an especially good night to be born...             That's enough...! All of you!  I came as quickly as I could... I'm sorry I took so long, the streets are filled with people...  You are going to be alright, my dearest darling... I will not let anything happen to you...  She gave her life for me... And for that I am forever grateful...  I found a home...  \"...I didn't know I was a child. I thought I was like everyone else who lived there, an old man, in my \"golden years.\"  What's there?  I loved her very much. She was my mother.  Somedays I feel like I'm different from the day before...  How much longer do I have to live, Mother?  Some nights, I would have to sleep alone.  I didn't mind. I would listen to the house breathing. All the people sleeping. I felt safe.  It was a place of great routine... Every morning at 5:30, no matter the weather... General Winslow, U.S. Army Retired... raised the flag...  Mrs. Sybil Wagner, once a noted opera singer... well, she'd sing, Wagner...  Breakfast was served promptly at six.  Dinner was served promptly at six.  On Saturday nights I would go to Queenie's church...  Now, when I look back on it, it was kind of miraculous... But you know the saying, \"...the Lord Giveth and the Lord Taketh away...\"  There were birthdays...  And mortality was a common visitor to our house... People came and went... Death was so frequent, I was never afraid of it.  You could hear when someone left us... there was a silence in the house...  It was a wonderful place to grow up. I was with people who had put away all the inconsequences of life, left in a state of purely being...wondering about the weather...the temperature of a bath...the light at the end of the day...  For everyone that died, someone would come to take their place...  It was Thanksgiving 1930, I met the person who changed my life forever.  I would never, the rest of my                 * life, forget those blue eyes...               *  I never forgot her blue eyes...  \"...When the baby came things were different...\"  I moved into my own room in the attic... I realized, despite a house filled with people that I loved, I was alone...  I spent a lot of time by myself that year...    I remember she wore diamonds... and she always dressed in fine clothing as if she was going out. Although, she never did and nobody would ever come to visit her.  ...She taught me how to play the piano...  There were many changes going on, some you could see... some you couldn't.  Hair, had started growing, in all sorts of places...  Along with other things...  I felt like I could do anything, that I could sprout wings...  These were hard times... people were doing anything they could to find work...  I was as happy as I could be... I would do anything...  And I actually was going to be paid for something I would have done for free.  His name was Captain Mike Clark... He'd been on boats since he was seven...  He took me to meet some friends...  It was a night to remember...  It sure made me understand the value of earning a living... the things it can buy you..  It's awful wet out. Can I offer you a ride somewhere...?  My name is Thomas, Thomas Button.  (saying the name to  Would you like to stop and have a drink, Benjamin?  A Sazerac for both of us...with whiskey instead of brandy...  You don't drink do you?  How is that?  It's an... experience...  That isn't a bad thing.  True enough. I don't mean to be rude... but your hands seem awful bent... It must be quite painful?  What kind of a disease?  I'm sorry.  I'm sorry about your disease.  Your mother?  ... My wife passed away many years ago...  She died in childbirth.    Buttons. \"Button's Buttons.\" There isn't a button we don't make. Our biggest competition is B.F. Goodrich and his infernal zippers...  One more Benjamin?  What kind of work do you do?  I enjoyed talking to you...    Would you mind, if time to time, I stopped by to say hello...?    I loved the weekends when she would come and spend the night with her grandmother.  I had never thought about life or death that way before...  And one fall day... a familiar visitor came knocking on our door...  She had taught me how to play the piano.  And she taught me what it meant to miss somebody.  I had gone to a whore house, I'd had my first drink, I had said goodbye to one friend and buried another... In 1937, when I was coming to end of the 17th year of my life, I packed by bag.  ...and said goodbye...  I knew, life being what it was, I would probably never see them again...  And I went off to sea...  \"... With Captain Mike's crew on the \"Chelsea\"...\"  Captain Mike had contracted for three years with Moran Brothers Tug and Salvage... The old ship had been refitted with a diesel engine, and a new sea winch... We went around Florida and up the Atlantic seaboard...  We were a crew of seven now... Captain Mike and me... the Cookie... Prentiss Mayes from Wilmington, Delaware...  ...The Brody twins... Rick and Vic...  Who got along fine at sea... but for some reason, once they were on dry land... couldn't stand the sight of each other...  There was John Grimm, who fit his name... from Belvedere, South Dakota...  ...and Pleasant Curtis who never said a word to anyone... except to himself...  Murmansk is on the Barrent Sea, the only ice-free ocean port in the Soviet Union...  We stayed at a small hotel with the grand name, \"The Winter Palace.\"  Everybody, no matter what differences they had, the languages, the color of their skin, had one thing in common... they were drunk every single night...  Her name was Elizabeth Abbott. She was not beautiful. She was plain as paper... But she was as pretty as any picture to me...  Her husband was Walter Abbott...He was Chief Minister of the British Trade Mission in Murmansk... and he was a spy...  They were long days there...  And longer nights...  One particular night... when I was having trouble sleeping...  And she told me all the places she had been, and what she had seen...  And we talked until just before the dawn...  ...And we went back to our rooms... to our separate lives...  And every night... we would meet in the middle Of the night...  A hotel in the middle of the night can be a magical place...  A mouse stopping and running and stopping...  A radiator hissing. A sink dripping. A floor creaking. A curtain blowing.  There is something peaceful, even comforting, knowing that people you love are asleep in their beds, where nothing can harm them...  Elizabeth and I would talk through the night until just before dawn...  It was the first time a woman had ever kissed me. It's something you never forget.  It took me a long time to go to sleep.  She was the first woman who ever loved me.  Until one night...  And so, I went to war.  It wasn't the war we expected. We would tow crippled ships... scraps of metal...  across the high seas... If there was a war, we didn't see it...  There was a man assigned with us... The Chief Gunner loved the Navy, and most of all, he loved America.  His name was Dennis Smith and he was a full blooded Cherokee... His family had been in America for over five hundred years.  I worked in the kitchen...  We were towing a British freighter, that had gone dead in the water, 800 miles to Halifax for repair...  He had given me all of his pay... he hadn't spent a dime of it...  The war found us.  A transport carrying 900 men had been hit by a torpedo. We were first to arrive at the scene...  There wasn't a sound...  736 men died that day... I said my goodbyes to the Cherokee, Dennis Smith, John Grimm who was right, he was going to die there... I sent Pleasant Curtis' wife his money... I said goodbye to the twin, Vic Brody...  And to Mike Clark... Captain of the tugboat \"Chelsea.\"  I said goodbye to all the other men... who had dreams of their own... All the men who wanted to be plumbers or singers or insurance salesmen or doctors... or lawyers or Indian chiefs.  Out here, death didn't seem normal.  ...I'd never seen a hummingbird that far out to sea before...  In the spring of 1945.... when I was 26 years old... I went home...  It's a funny thing about coming home. Smells the same. Looks the same. Feels the same.  You realize what's changed, is you...  And one evening, not long after I had been back...  When I had left she was a girl... and a woman had taken her place...  \"...Everything, in that moment, had changed between us...\"  And she told me about this world that she was so attracted to... names that didn't mean a thing to me...I didn't really hear very much of what she was saying.  You only get so many chances to be with someone... I let her go... and I missed it...  I didn't need glasses anymore...  My hair had very little gray and grew like weeds...  My sense of smell was keener... my hearing more acute... I could walk further and faster...  While everybody else was aging... I was getting younger... all alone...  Hello, Benjamin... Do you remember me?  My foot was infected... I'm afraid they had to remove it... Welcome home, my friend.  I'm a man of habit.    I told him about my life... about my time at war... and he told me how he had devoted his business to making buttons for the war effort...  The war has been kind to the button industry... we had gone from making forty thousand buttons a day to making two hundred and fifty thousand... We employed ten times the number of workers... We were operating around the clock...  I don't know how much longer I have to live...  I don't have any people. I keep to myself. I -- I'm frightened. I hope you won't mind... but whenever it's possible... I would enjoy your company...          (has been telling  They were originally decorative, jewelry sewn on clothing...     The practice of buttoning originated in the 13th century... when baggy clothing was replaced with more form-fitting clothes...  Button's Buttons has been in our family for one hundred and twenty- four years. My grandfather was a tailor. He had a small shop in Richmond. After the Civil War he came to New Orleans.  My father saw the wisdom of making our own buttons. The tailor shop grew to this... And today... I can't sew a stitch.  I said, our family has been in the business for a hundred and twenty- four years.  You are my family. Benjamin, you are my son.  I am so sorry not to have told you before...  You were born the night the great war ended... Your mother died giving birth to you... I thought... I thought you were a monster... I left you on the back steps of a house... I promised your mother I'd make sure you were safe... I should never have abandoned you...     ...A great uncle, from Germany. All of the men in the family at the Lake House... 1915, three years before you were born.  Your grandfather at the summer house on Lake Pontchartrain. When I was a boy I would love to wake up before anybody else and run down to the lake to watch the day begin. It was as if I was the only one alive.  I fell in love with her the first time I saw her. Your mother's name was Caroline Murphy. She was 20. She worked in your grandfather's kitchen...She was from Dublin... Her father, your maternal grandfather, was a chimney sweep... He died in the flu epidemic of 1900... Caroline came with her mother, two sisters, and four brothers in 1903 to live in New Orleans.  I would find reasons to go to the kitchen... just to look at her...  The happiest day of my life was April 25th, 1918 the day I married your mother.  I made a mistake.  Come and take your rightful place... with your family... with me...  We can catch up for all the lost time...  I'm planning on leaving everything I have to you...  Where are you going?                 Thank you, Benjamin.  You can be mad as a mad dog at the way things went...You can swear, curse the fates, regret everything you ever did... but when it comes to the end... You have to let go...  I buried him in the Button family plot.  I had a tailor sew onto his best coat -- a button for every year of his life....fifty-five of them... all different, pearl and silver, brass and wood... in case he lost one along the way...  I went to pay a visit to the button factory.     And I went to New York.  And I met her friends...  I'd find myself saying... Goodnight, Daisy.  If you want you could say I was looking for something...  Life went on as usual.  Until one day...  Sometimes we are on a collision course and we just don't know it... Whether it's by accident or by design, there's not a thing we can do about it...  A woman in Paris was on her way to go shopping...  But she had forgotten her coat... and went back to get it... And when she had gotten her coat the phone had rung... and so she had stopped to answer it... and talked for a couple of minutes...  And while the woman was on the phone; Daisy was rehearsing for that evening's performance at the Paris Opera House...  And while she was rehearsing... the woman, off the phone now... had gone outside... to get a taxi...  Now a taxi driver... had dropped off a fare earlier... and had stopped to get a cup of coffee...  And all the while Daisy was rehearsing...  And the cab driver who had dropped off the earlier fare, and had stopped to get the cup of coffee...  had picked up the lady, who was going shopping... who had missed getting the earlier cab...  The taxi had to stop for a man crossing the street who had left for work five minutes later than he normally did... because he forgot to set his alarm...  ...While the man, late for work, was crossing the street... making the cab wait... Daisy, finished rehearsing, was taking a shower.  ...While Daisy was showering; the taxi was waiting outside a Boutique for the woman to pick up a package... which hadn't been wrapped yet because the girl who was supposed to wrap it... had broken up with her boyfriend the night before and forgot to...  When the package was done being wrapped... The woman, who was back in the cab... the taxi was blocked by a delivery truck...  All the while Daisy was getting dressed...  The Delivery truck pulled off and the taxi was able to go...  While Daisy, the first to be dressed, waited for one of her friends who had broken a shoelace...  Daisy and her friend came out of the theater...  And if only one thing had happened differently... if only the shoelace hadn't broken...  ...Or the delivery truck had moved moments earlier...  ...Or the package had been wrapped and ready... because the girl hadn't broken up with her boyfriend...  ...Or the man had set his alarm and got up five minutes earlier.  ...Or the taxi driver hadn't stopped for a cup of coffee...  ...Or the woman had remembered her coat...  ...And had gotten into an earlier cab...  Daisy and her friend would have crossed the street...  ...and the taxi would have driven by them...  But life being what it is... a series of intersecting lives and incidents... Out of anyone's control... the taxi did not go by... and the driver momentarily was distracted...  And he didn't see Daisy crossing the street...  ...and that taxi hit Daisy...  And her leg was crushed...  Her leg had been broken in five places.... and with therapy, and time, she might be able to stand...maybe even walk...  \"I stayed in Paris for awhile, just to look out for her...\"  I learned to sail on an old boat of my father's from the Lake House...  I can't lie, I did enjoy the company of a woman or two...  ...Or maybe three...  And in the spring of 1962...  She came back.  I asked her to come with me...  And you said...  And I said...  We buried her beside her beloved Mr. Weathers...        And we bought a house of our own...  We had no furniture to speak of... we would have picnics in the living room...  We slept on a mattress...  We vowed never to go to bed or wake up at the same time. We lived on that mattress...  Our neighbor, Mrs. Van Dam was a physical therapist...  We lived four blocks from a public pool...  And I think, right there and then, she realized none of us is perfect forever.  She opened a dance studio...  \"She was happier than I had ever seen her...\"  On a day like any other in the spring...  She gave birth to a five pound four ounce baby girl...  It was your first birthday. We had a party... the house was filled with people...  The fathers and mothers were there...  I sold the summer house on Lake Pontchartrain... I sold my share of Button's Buttons... I sold the sailboat... I put it all into an account for your mother... And before you would ever remember me...  I left, so that you and your mother could have a life.    \"...What I think is, it's never too late...or, in my case, too early, to be whoever you want to be...There's no time limit, start anytime you want...change or stay the same...there aren't any rules...We can make the best or worst of it...I hope you make the best...I hope you see things that startle you. Feel things you never felt before. I hope you meet people who have a different point of view. I hope you challenge yourself. I hope you stumble, and pick yourself up. I hope you live the life you wanted to...and if you haven't, I hope you start all over again.\"  \"That night...\"  I watched her go...  Until she went out of sight...  I'm the only one who isn't sleeping...  \"I figured out one thing. If you're growing older or getting younger it really doesn't make any difference. Whichever way you're going you have to make the most of what this is.\"  \"Along the way you bump into people who make a dent on your life... Some people... get struck by lightning...\"  \"Some are born to sit by a river.\"  \"Some have an ear for music...\"  \"Some are artists...\"  \"Some swim the English Channel...\"  \"Some know buttons...\"     \"Some know Shakespeare...\"  \"Some are mothers...  \"And some people can dance...\"",
        "Benjamin": "The war to end all wars had ended.  I was told it was an especially good night to be born...  She gave her life for me... And for that I am forever grateful...  I found a home...  \"...I didn't know I was a child. I thought I was like everyone else who lived there, an old man, in my \"golden years.\"  What's there?  I loved her very much. She was my mother.  Somedays I feel like I'm different from the day before...  How much longer do I have to live, Mother?  Some nights, I would have to sleep alone.  I didn't mind. I would listen to the house breathing. All the people sleeping. I felt safe.  It was a place of great routine... Every morning at 5:30, no matter the weather... General Winslow, U.S. Army Retired... raised the flag...  Mrs. Sybil Wagner, once a noted opera singer... well, she'd sing, Wagner...  Breakfast was served promptly at six.  Bis...  Graby...  Gravy.  Four...  Two...  Six.  Dinner was served promptly at six.  Tomato, brown sugar, salt, myasses...  On Saturday nights I would go to Queenie's church...  I'm seven, but I look a lot older.  Now, when I look back on it, it was kind of miraculous... But you know the saying, \"...the Lord Giveth and the Lord Taketh away...\"  There were birthdays...  And mortality was a common visitor to our house... People came and went... Death was so frequent, I was never afraid of it.  You could hear when someone left us... there was a silence in the house...  It was a wonderful place to grow up. I was with people who had put away all the inconsequences of life, left in a state of purely being...wondering about the weather...the temperature of a bath...the light at the end of the day...  For everyone that died, someone would come to take their place...  What's a madjembe?  I don't think so. This is just how I am.    What's it like living in a cage?  Why didn't you go back home?  What did you do?  You were all alone?  It had been the best day of my life.  It was Thanksgiving 1930, I met the person who changed my life forever.  *  Benjamin is just fine...                                 *  I would never, the rest of my                 * life, forget those blue eyes...               *  Why do you say that?  What does she mean \"answered her prayers?\"    I'm not supposed to use matches...  I'm younger than I look.       I never forgot her blue eyes...  \"...When the baby came things were different...\"  I moved into my own room in the attic... I realized, despite a house filled with people that I loved, I was alone...  Going away?   Where?  What about your friend?   The tall lady?  Goodbye...  I spent a lot of time by myself that year...  Until...  Hello...  I'm Benjamin...    I remember she wore diamonds... and she always dressed in fine clothing as if she was going out. Although, she never did and nobody would ever come to visit her.  ...She taught me how to play the piano...  There were many changes going on, some you could see... some you couldn't.  Hair, had started growing, in all sorts of places...  Along with other things...  I felt like I could do anything, that I could sprout wings...  ...Queenie would let me go with Mr. Daws to Bridge City..To watch the boats go up and down the river...  These were hard times... people were doing anything they could to find work...  I do...!    I was as happy as I could be... I would do anything...  Yes, Captain!  Right away, sir...!  And I actually was going to be paid for something I would have done for free.  His name was Captain Mike Clark... He'd been on boats since he was seven...  I haven't found out yet.  Not as old as I look.  It's a short story...      Never.  Not that I know of.  Never.  He took me to meet some friends...  I never met my father.  You didn't want to spend the rest of your life on a tugboat.    (looks at change he  It was a night to remember...  Is that any better?  Ohhh...!  Again?  Again?    Thank you...  You'll be here tomorrow?  It sure made me understand the value of earning a living... the things it can buy you..  That's very kind of you, Sir.  I'm Benjamin.  I'll have whatever he's having.  It's a night for firsts...  I've never been to a whore house either.  It certainly is. I'm not very experienced about a lot of things.  There's a first time for everything.  I don't really know what I have. I have some form of a disease. I have a lot of catching up to do.  I was born old.    My mother says we're all born with something...  I'm adopted.      What line of work are you in, Mr. Button?  If you'll let me pay for it, Mr. Button...    I enjoyed drinking with you...      I listened to some music.... I --  I met some people.  I think mama... I'm going to...  I loved the weekends when she would come and spend the night with her grandmother.      Ssssh... Can you swim?  Put this on...  We have to go fast...  I think he has mejembe. Captain Mike... could you take us out?  Sunday.  You're drunk every night.  A close friend... I wanted to show her the River.  What does it take to build something like that?    I had never thought about life or death that way before...  And one fall day... a familiar visitor came knocking on our door...  Would you like to go for a walk?  She had taught me how to play the piano.  And she taught me what it meant to miss somebody.     I had gone to a whore house, I'd had my first drink, I had said goodbye to one friend and buried another... In 1937, when I was coming to end of the 17th year of my life, I packed by bag.  ...and said goodbye...  I knew, life being what it was, I would probably never see them again...  Goodbye, Mother...  To sea.    I'll send you a postcard.  And I went off to sea...  \"... With Captain Mike's crew on the \"Chelsea\"...\"  Captain Mike had contracted for three years with Moran Brothers Tug and Salvage... The old ship had been refitted with a diesel engine, and a new sea winch... We went around Florida and up the Atlantic seaboard...  We were a crew of seven now... Captain Mike and me... the Cookie... Prentiss Mayes from Wilmington, Delaware...  ...The Brody twins... Rick and Vic...  Who got along fine at sea... but for some reason, once they were on dry land... couldn't stand the sight of each other...  There was John Grimm, who fit his name... from Belvedere, South Dakota...  ...and Pleasant Curtis who never said a word to anyone... except to himself...  Murmansk is on the Barrent Sea, the only ice-free ocean port in the Soviet Union...  Well Captain, you do drink a lot...  We stayed at a small hotel with the grand name, \"The Winter Palace.\"  Everybody, no matter what differences they had, the languages, the color of their skin, had one thing in common... they were drunk every single night...  Her name was Elizabeth Abbott. She was not beautiful. She was plain as paper... But she was as pretty as any picture to me...  Her husband was Walter Abbott...He was Chief Minister of the British Trade Mission in Murmansk... and he was a spy...  They were long days there...     And longer nights...  One particular night... when I was having trouble sleeping...  I'm sorry... I can't sleep...  I was going to make some tea...would you like some?  Milk...? Honey...?  Do you like flies with your tea?  Steep?  Where I'm from, they just want it to be hot.  There's no age limit... as long as you can do the work...  I didn't know I did... I usually sleep like a baby. Something kept me up.  Did he?  Die in his sleep?    I haven't really been anywhere. I mean outside different harbors.  New Orleans, Louisiana.    And she told me all the places she had been, and what she had seen...  And we talked until just before the dawn...  ...And we went back to our rooms... to our separate lives...  And every night... we would meet in the middle Of the night...  A hotel in the middle of the night can be a magical place...  A mouse stopping and running and stopping...  A radiator hissing. A sink dripping. A floor creaking. A curtain blowing.  There is something peaceful, even comforting, knowing that people you love are asleep in their beds, where nothing can harm them...  Elizabeth and I would talk through the night until just before dawn...  The wrong impression?  Why do you say that?    It was the first time a woman had ever kissed me. It's something you never forget.    No. Not many. At least none on a Sunday.  It took me a long time to go to sleep.  Do I look okay? I borrowed it from one of the men. It's his church suit.  I feel so much younger when I'm with you...  What mistakes?  Are you as cold as I am?  She was the first woman who ever loved me.  Hold it...  We saw each other every night... we always used the same room...  But each time seemed new and different...      Until one night...    I grew up cooking, sir. I'll take the job, if I'm not too old to serve.     She had left a note. She wrote, \"it was nice to have met you.\" That was it.  And so, I went to war.  It wasn't the war we expected. We would tow crippled ships... scraps of metal...  across the high seas... If there was a war, we didn't see it...  There was a man assigned with us... The Chief Gunner loved the Navy, and most of all, he loved America.  His name was Dennis Smith and he was a full blooded Cherokee... His family had been in America for over five hundred years.  I worked in the kitchen...  (trying to make  We were towing a British freighter, that had gone dead in the water, 800 miles to Halifax for repair...  He had given me all of his pay... he hadn't spent a dime of it...  The war found us.  A transport carrying 900 men had been hit by a torpedo. We were first to arrive at the scene...  There wasn't a sound...  You're going to heaven Captain Mike. You're going to heaven.  736 men died that day... I said my goodbyes to the Cherokee, Dennis Smith, John Grimm who was right, he was going to die there... I sent Pleasant Curtis' wife his money... I said goodbye to the twin, Vic Brody...  And to Mike Clark... Captain of the tugboat \"Chelsea.\"  You mind...  I said goodbye to all the other men... who had dreams of their own... All the men who wanted to be plumbers or singers or insurance salesmen or doctors... or lawyers or Indian chiefs.  Out here, death didn't seem normal.  ...I'd never seen a hummingbird that far out to sea before...  In the spring of 1945.... when I was 26 years old... I went home...  Is your mother home?    You never know what's comin' for you.  I saw a lot of things.  Where's Tizzy?  I'm so sorry...  It's a funny thing about coming home. Smells the same. Looks the same. Feels the same.  You realize what's changed, is you...  And one evening, not long after I had been back...  Daisy... it's me, Benjamin.  Just a few weeks ago...    When I had left she was a girl... and a woman had taken her place...  I can't get over you -- You are so lovely...  I feel terrible about it...  Now that I see you I feel even worse... Look at you...Daisy Fuller...  \"...Everything, in that moment, had changed between us...\"  I heard that... I'm sorry...  I don't know how it works, but I'm sure glad it happened...    Are you hungry? Would you like to get something to eat?  And she told me about this world that she was so attracted to... names that didn't mean a thing to me...I didn't really hear very much of what she was saying.  I'm enjoying listening...  I didn't know you smoked...  Yes you are...  Which part?  People should want to sleep with you... You're very desirable...  It's not that I don't want to... I just can't... not tonight....Its just not...  Go back to New York, Daisy... Be with the people you are so fond of... You can only be young once...  You only get so many chances to be with someone... I let her go... and I missed it...     I didn't need glasses anymore...  My hair had very little gray and grew like weeds...  My sense of smell was keener... my hearing more acute... I could walk further and faster...  While everybody else was aging... I was getting younger... all alone...  Of course, Mr. Button... What happened to you?  You're still drinking Sazerac with whiskey instead of brandy.    I told him about my life... about my time at war... and he told me how he had devoted his business to making buttons for the war effort...  I'm sorry to hear that, Mr. Button.  I'll do what I can, Mr. Button.  Just what holds my shirt on.  It's all very interesting.   But what do you want from me?  Our family?  My mother?  Why didn't you tell me?  I better go.  Home.    You can be mad as a mad dog at the way things went...You can swear, curse the fates, regret everything you ever did... but when it comes to the end... You have to let go...  I buried him in the Button family plot.  I had a tailor sew onto his best coat -- a button for every year of his life....fifty-five of them... all different, pearl and silver, brass and wood... in case he lost one along the way...    I went to pay a visit to the button factory.  My name is Benjamin, Benjamin... Button...  As you know, my father...  ...My father, Thomas Button... recently passed...  He asked that I take over the day to day operation of Button's Buttons.  Well, I don't know the first thing about buttons...and I don't know a thing about business...    I have decided that all of you -- his loyal employees, will have a share, depending on your length of employment, in the ownership of this factory, his legacy.  That's about it.  Mrs. Sanderson will explain how everything works and will answer any of your questions...  And I went to New York.  I'm a friend of Daisy's...  I thought I'd come visit... spend some time with you if I could...  I couldn't take my eyes off of you... you were mesmerizing...  Somebody told me about a restaurant I thought you might enjoy... I made a reservation... Just in case --  And I met her friends...  Something like that.  I came here to tell you I made a mistake before...A day doesn't go by that I don't regret it...It's not the way I felt...I should have never let you go...I came because I hoped I could be with you...  Do you love him?       I'd find myself saying... Goodnight, Daisy.  If you want you could say I was looking for something...  Life went on as usual.  Until one day...  That would be me....  Sometimes we are on a collision course and we just don't know it... Whether it's by accident or by design, there's not a thing we can do about it...  A woman in Paris was on her way to go shopping...  But she had forgotten her coat... and went back to get it... And when she had gotten her coat the phone had rung... and so she had stopped to answer it... and talked for a couple of minutes...  And while the woman was on the phone; Daisy was rehearsing for that evening's performance at the Paris Opera House...  And while she was rehearsing... the woman, off the phone now... had gone outside... to get a taxi...  Now a taxi driver... had dropped off a fare earlier... and had stopped to get a cup of coffee...  And all the while Daisy was rehearsing...  And the cab driver who had dropped off the earlier fare, and had stopped to get the cup of coffee...  had picked up the lady, who was going shopping... who had missed getting the earlier cab...  The taxi had to stop for a man crossing the street who had left for work five minutes later than he normally did... because he forgot to set his alarm...  ...While the man, late for work, was crossing the street... making the cab wait... Daisy, finished rehearsing, was taking a shower.  ...While Daisy was showering; the taxi was waiting outside a Boutique for the woman to pick up a package... which hadn't been wrapped yet because the girl who was supposed to wrap it... had broken up with her boyfriend the night before and forgot to...  When the package was done being wrapped... The woman, who was back in the cab... the taxi was blocked by a delivery truck...  All the while Daisy was getting dressed...  The Delivery truck pulled off and the taxi was able to go...  While Daisy, the first to be dressed, waited for one of her friends who had broken a shoelace...  While the taxi was stopped, waiting for a traffic light...  Daisy and her friend came out of the theater...  And if only one thing had happened differently... if only the shoelace hadn't broken...  ...Or the delivery truck had moved moments earlier...  ...Or the package had been wrapped and ready... because the girl hadn't broken up with her boyfriend...  ...Or the man had set his alarm and got up five minutes earlier.  ...Or the taxi driver hadn't stopped for a cup of coffee...  ...Or the woman had remembered her coat...  ...And had gotten into an earlier cab...  Daisy and her friend would have crossed the street...  ...and the taxi would have driven by them...  But life being what it is... a series of intersecting lives and incidents... Out of anyone's control... the taxi did not go by... and the driver momentarily was distracted...  And he didn't see Daisy crossing the street...  ...and that taxi hit Daisy...  And her leg was crushed...  Hello, Daisy...  Your friend wired me.  You would have done the same for me...  Her leg had been broken in five places.... and with therapy, and time, she might be able to stand...maybe even walk...  I'll get a room... and once you can leave you'll come home with me to New Orleans. Where you can be with people who love you.  Alright, I'll stay here in Paris... I'll help you with anything you need...  You'll change your mind.  \"I stayed in Paris for awhile, just to look out for her...\"  I learned to sail on an old boat of my father's from the Lake House...  I can't lie, I did enjoy the company of a woman or two...   ...Or maybe three...  And in the spring of 1962...  She came back.  No. I don't care where you've been -- I'm just happy you're back.  I don't want to ruin it...  Goodnight.  Are you sure?  I asked her to come with me...  We sailed into the Gulf... along the Florida coast...  Why do you say that?  Relationships have a time and a place.  What I mean is... You don't usually get more than one chance. If you miss it, it's too late... and it's gone... We're lucky... we had more than one chance.  Have you ever had a Sazerac with whiskey not brandy?  Bet you can't.  I love your wrinkles.  I don't know... I'm always looking out of my own eyes...  Will you still love me when I have pimples. When I think it's funny to make fart noises...  Will you still love me when I think all girls have cooties... Will you still love me when I wet my bed at night... Will you still love me when I'm afraid of things that aren't real...  Nothing lasts...  I've never seen anything not come to an end...  And you said...  And I said...  Goodnight, Daisy...  Queenie came to tell me she loved me... and that my mother was gone.    Queenie...?   Mama?  Hello... Anybody here?  It's Benjamin, Mrs. Carter... Where is everybody?  We buried her beside her beloved Mr. Weathers...  We are meant to lose the people we love. It's how we know how important they are to us.  And so we could have memories of our own I sold my Father's house on Blaine Street...  They come with the house...  And we bought a house of our own...  We had no furniture to speak of... we would have picnics in the living room...  We slept on a mattress...  We vowed never to go to bed or wake up at the same time. We lived on that mattress...  Our neighbor, Mrs. Van Dam was a physical therapist...  We lived four blocks from a public pool...  You're crying...  You chose something to do... something so special... so unique... there was such a short period of time that you could do it... Even if nothing had happened ... Sooner or later you would be in the same place you are now...  And I think, right there and then, she realized none of us is perfect forever.  She opened a dance studio...  You're still beautiful to watch...    Stay just like that... I want to remember what we look like right now.  \"She was happier than I had ever seen her...\"  I'm not hiding it.  What if it has...what if its like me?...  I want to be father... not a little brother... I don't want to be picked up from elementary school by my kid... I don't want anyone babysitting me...  You know, there's nothing I wouldn't do for you...  Yes.  On a day like any other in the spring...  Get me an ambulance... My wife is seven months pregnant and fell on the stairs...  She gave birth to a five pound four ounce baby girl...  You're sure there's nothing wrong with her?  Don't eat sand...  She's going to have a really attractive diaper.  I think you should find a real father for her...  She needs someone to grow old with...  She needs a father not a playmate.  You don't need another child to raise...  It was your first birthday. We had a party... the house was filled with people...  The fathers and mothers were there...  I sold the summer house on Lake Pontchartrain... I sold my share of Button's Buttons... I sold the sailboat... I put it all into an account for your mother... And before you would ever remember me...  I want you to know I love you...  I left, so that you and your mother could have a life.    \"...What I think is, it's never too late...or, in my case, too early, to be whoever you want to be...There's no time limit, start anytime you want...change or stay the same...there aren't any rules...We can make the best or worst of it...I hope you make the best...I hope you see things that startle you. Feel things you never felt before. I hope you meet people who have a different point of view. I hope you challenge yourself. I hope you stumble, and pick yourself up. I hope you live the life you wanted to...and if you haven't, I hope you start all over again.\"  I wanted to see you both.  Hello...  She's so lovely... she looks like you... Does she dance?  I suppose that would be from my side of things.  Just what you can see.  I'm at the Pontchartrain Hotel on the avenue. I have no idea what I'm going to do.  \"That night...\"     Hello?  Please...  I don't know what I'm doing here...What I expected...?  I never once stopped loving you...  Some things you don't ever forget... the feel... the taste...  ... the smell...  ... the touch...  Of someone you love...     I watched her go...  Until she went out of sight...  Do you know this song?  Daisy is a very pretty name. I'm Benjamin.  There's something about you... There's something about your eyes I remember from a long time ago...  I want some breakfast.  No I didn't...  You think I don't know what you are doing?  You are all fucking liars!  (upset, meaning     I get the feeling there's a lot of things I can't remember...  It's like there's this whole life I had and I can't remember what it was...    I can see the big river... all the boats... I can see the graveyard where mama's buried and all those other people... I can see the city... where you have your dancing place...  What if I could fly?        Benjamin... Daisy...     I'm the only one who isn't sleeping...  \"I figured out one thing. If you're growing older or getting younger it really doesn't make any difference. Whichever way you're going you have to make the most of what this is.\"  \"Along the way you bump into people who make a dent on your life... Some people... get struck by lightning...\"  \"Some are born to sit by a river.\"  \"Some have an ear for music...\"  \"Some are artists...\"  \"Some swim the English Channel...\"  \"Some know buttons...\"  \"Some know Shakespeare...\"  \"Some are mothers...  \"And some people can dance...\"",
        "Monsieur": "I made it this way... so that perhaps, the boys who were lost in the war might stand and go home again...  ... home to farm, to work, have children, to live long, full lives...  Perhaps, my own son might come home again...  I'm sorry if I offended anybody. I hope you enjoy my clock.",
        "Gateau": "I made it this way... so that perhaps, the boys who were lost in the war might stand and go home again...  ... home to farm, to work, have children, to live long, full lives...  Perhaps, my own son might come home again...  I'm sorry if I offended anybody. I hope you enjoy my clock.",
        "Daisy": "If it wasn't for hurricanes we wouldn't have a hurricane season.  1928 they stacked people like firewood to close a hole in a levee.  It all runs together... like a fingerpainting... I feel like I'm on a boat, drifting...  Hmmm. There is nothing to do, Caroline. This is what it is... I'm finding it harder to keep my eyes open... my mouth all filled with cotton...  Curious.   What comes next...  They built that train station in 1918. Your father was there the day it opened... He said a tuba band was playing...Oom-pah-pah...  Oom-pah-pah, oom-pah-pah...The finest clockmaker in all of the South built that clock...  His name was Mr. Gateau. Mr. Cake.  He was married to a Creole of Evangeline Parish and they had a son.  Did I mention, Mr. Gateau was from birth, absolutely blind.  And when their son came of age, like boys will do, he joined the army. They saw him off at the old train station.  Oh how he worked, for months he did nothing but work on the clock for the great train station.  One day a letter came...  Mr. Gateau, done for the night, went up to his bed.  And their son came home.  They buried him where the Gateau family had been buried for a hundred and seven years...  Mr. Cake went back to work on his clock... laboring to finish...  It was a morning to remember... Papa said there were people everywhere...  Even Teddy Roosevelt had come.  Mr Cake was never seen again. Some say he died of a broken heart. Some say he went to sea...  He just rowed...rowed...away...  Oh honey, you could never disappoint me.  What's normal?     A hat full of sand.    I tried to read it a hundred different times... but I couldn't bring myself...  Read it to me.    You have such a lovely voice.  That clock... Just kept going, year after year after year...  Was there just company?  Caroline...    They're in the pheasant family. They can hardly fly. It's sad don't you think? A bird, that can't fly.  She's going to have a baby, silly. That's what my mother said when I was going to have a little brother. He didn't live long though. He didn't breathe right...      Under here...  Nobody knows about this but us.  Will you light it?  Don't be chicken...  I'll tell you a secret then you tell me one... I saw mommy kissing another man. Her face was red from it.  Your turn to tell.    You are different than anybody I have ever met. Can I?    Oh, darlin', the pain...  I can do anything you can do...  What's wrong with him?  Imagine all the places they're going to see...       Look at that... time just seeped out of me...  Somebody will come and mop it up and that will be the end...  Benjamin... Benjamin...  Where are you going?  From everywhere. Write me a postcard from everywhere...    Looking for?  Of course.  Can you imagine... He sent me postcards from everywhere he went... every place he worked... Newfoundland... Baffin Bay... Liverpool... Glasgow...Narvik...  Please keep reading, sugar...  I wrote him constantly... told him everything I was doing...  ...I told him they had invited me to New York to audition for the School of American Ballet...  One of the \"corps\"... another dancing gypsy...  Oh. Then he wrote me... \"I've met somebody... and I've fallen in love...\"  \"...I've met somebody...and I've fallen in love...\" My, that was over... ...sixty years ago.  What can a girl know about love?  It must have been very cold. I'm glad he had somebody to keep him warm.  Oh, excuse me... is Queenie here...?  Benjamin...Oh my God it's you... Of course it's you...  Benjamin, how are you? It's been such a long time... There's so much I want to know... When did you come back?  I spoke to Queenie...she told me you were in the war...somewhere at sea... I was so worried about you...  You stopped writing.  ...Beautiful.  What else did he say about...  I can't get over you're home... I've been planning to come by for awhile... my grandmother, you remember Grandma Fuller... of course you remember her... she passed away...  I've been wanting to get some of her things...  I can't believe I open the door, and you're actually standing there...It must be fate... What do they call it, \"Kismet\"? I read a book about a man named Edgar Cayce, a psychic, everything is predetermined...I like to think it's fate. What do you think, Benjamin?    ...This is the picture of Old Man Kangaroo at five in the afternoon...\"  You don't look like an old man anymore...You always said you were different... I think you must be...  I would love that...  ...I danced for a man named Ballenchine...He's a famous choreographer. He said I had a perfect line. They asked Ballenchine to describe what he did. He said, \"I'm a carpenter.\" Isn't that amazing? In one of his rehearsals a dancer fell. He put it into the production. Can you imagine that in a classical ballet? A dancer intentionally falling? He isn't the only one, Agnes DeMille, Lincoln Kirstein, Richard Pleasant, Lucia Chase...There's a whole new word for dance now, it's called abstract...\"  ...They have torn up all the conventions... the straight up and down style, all the things that bound dancers...It's not about the formality of the dance...the classical structure...it's about what the dancer's feeling...there are no rules; the movement can be tense or relaxed, abrupt or flowing, carefree or somber, it may suggest love or hate, attraction or repulsion. The unexpected shifts of weight or energy -- not just to shock but to reinvent tradition...putting the familiar form to new and unexpected uses. It's so basic Just you alone with your body...  They understand America's vigor and physicality -- they understand the freshness of the American people at their most modern, at their best.    I'm old enough. I`m old enough for a lot of things....  I have to go back tomorrow... I wish I could stay...  In New York we stay up all night... I eat breakfast in a diner on Houston with red booths and watch the sun come up over the buildings... there's always something to do...  Dancers... don't need costumes or scenery.  I could imagine dancing completely naked...  Have you read \"D.H. Lawrence,\" his books were banned... The words are like making love....  In our group... you have to trust people... not be afraid... Sex... is a big part of it... A lot of the dancers... are lesbians... A woman wanted me to sleep with her....  Does that upset you?  That someone wanted to sleep with me.  Let's go back to the house... or get a room somewhere... we can put down your coat...  I'm old enough.  Do you think you are too old for me... I've been with older men...  You look so handsome in that suit... your hair...  Good news?  I'll just stay under the blankets with my mother. She said nothing would happen to me.  Benjamin?  Somebody's looking for me?...  Benjamin... What are you doing here?  I wish you would have called... You caught me by surprise.  That's so nice of you to say... These are lovely... Thank you...  I better get changed... a group of us are going to a party... would you like to come...?    I'll get you a drink...  This is my friend David... David dances with our company too... This is the man I've told you about, Benjamin...  I'll get you that drink. - -    I did what you told me to... enjoy my life... I'm only going to be young once... I had no idea you were coming. What did you think I was going to do...? You can't expect me to just drop everything, Benjamin... this is my life...  (conflicted, to  I think so. I think I do.    I was 23...I just didn't care...  ...There are some photographs I think... the zipper part of the large bag...  I was as good as I was ever going to be. For five years... I danced everywhere... London, Prague, Vienna, and I was the only American invited to dance with the Bolshoi... It was glorious...  But Benjamin was never far from my thoughts...  I'd find myself saying...  Goodnight, Benjamin...  What did he say?  Who told you?  That was very kind of you... to come all the way here, to see that I was alright.  My God, look at you. You're perfect....  I wish you hadn't. I wish you hadn't come here.  I don't want you to see me like this...  What home? Who's we? I'm not going back to New Orleans. New Orleans is your home... I don't have a home... I haven't been home for five years... I'm not going anywhere with you...  Benjamin...! I know I'm feeling sorry for myself... But it wasn't supposed to be like this...  Do you understand, I don't want to be with you... I tried to tell you that in New York... You just don't listen...  We're not little children playing under the table... Remember, when you came to New York. You didn't belong there. I didn't want to be with you then, I don't want to be with you now! I want you to leave! I'm not going anywhere with you! I want you to stay out of my life!  I was awfully cruel. He didn't understand. I couldn't have him see me that way...    I never knew that.  Every morning Monsieur Foley leaves eggs and bread and mil,. There's a cafe across the street. People sitting and drinking and talking... I lay on my bed thinking about the rest of my life... about people... about home... until I fall asleep.    Don't you want to know where I've been?  It was what I needed to do for myself.  She's still taking care of you.  You're not talking. You haven't said more than two words to me.  Sleep with me.  Yes.  Are you sure you don't want to know?...  I lived in Lyon...  ...I learned to walk again  ...I worked in a flower shop...  ...I went to American movies a lot.  You won't hurt me...  I'm so glad we didn't find one another when I was 26... I'm glad we missed...  It wasn't right...  We wouldn't have this... We wouldn't be here... It happened when it was supposed to happen...  Don't say that.    I'm going to enjoy every moment I have with you...    Bet I can stay out here longer than you can.  You barely have a line, a crease, or a wrinkle... Everyday I have more wrinkles you have less...  What does it feel like growing younger?  Will you still love me when I can't stand straight... when my skin grows old and spotted...  Will you still love me when my step gets slow... when I sleep too much... when you have to push me in a chair...  Maybe some things last...  Maybe it's something you can't see...  I'm cold, Benjamin...  Goodnight, Benjamin.    Dear Robert... some time after that...  He knew enough. He loved me as I was. I loved him for who he was. What more was needed?  Is anything wrong?  ...go back to sleep...    It's just the chlorine...  I don't like getting old.  I promise you, I'll never lose myself to self-pity again...    You have the most beautiful eyes.    Dancing is all about the line... the line of your body...after awhile... you lose the line... and you can never get it back...  I figured out if you were born in 1918... 49 years ago... I'm 43... we're almost the same age... In three years we'll meet in the middle...  I thought I was far too old... I'm pregnant...    I want to breathe on my own... Please... sit down, my darling...  (wanting her to  (eyes closed,  I thought I heard the nurse slip, and say \"he...\"  I know you're afraid.  Okay.   What's your worst fear?  Then we'll love it all the more...  I'm going to make this work... This is what I want, and I want it with you...  Would you tell a blind man he can't have children? You will be a father for as long as you can. I know the consequences. I accepted that. Your love, loving you, is worth everything to me. For the fiftieth time today I've got to go pee...  Ready?  Benjamin...  Benjamin... the baby's coming...  It doesn't change for a moment who you are. You were a gift. Sometimes the gifts we are given are not free.    I was worried you weren't coming back...  Read the rest of it, darling.  What are you talking about?  She'll learn to accept whatever happens... She loves you...  Is it that my age is starting to show...? Is that what you are telling me? Have you lost your desire for me...?  You're going to leave me, aren't you?  You can't leave me.  You can't do this to me...!  I remember your first birthday like it was yesterday.  I don't know.    I never heard from him.    Somebody left their slipper...  Are you here to pick someone up?  I'm sorry, we're closed now.  Benjamin?  You're so young.  Why did you come back?  No... He was telling me a very sad story about a mutual friend we hadn't seen in a long time... This is my friend, Benjamin... you knew him when you were... just a baby...  This is a friend of my family's... Benjamin Button... this is my husband... Robert...  I'm just closing up...  Not very well.  She's a dear sweet girl... she seems a little lost... But who isn't a little lost at 12? There's a lot of her that reminds me of you.  My husband. He's a doctor... was a widower... He's an incredibly bright, adventurous man...  He's been a terrific father... and a great partner and friend...  You're so much younger.  You ware right. She needed a father. I couldn't have raised both of you. I'm not that strong.  I never thought how it must have broken your heart, too.  Where are you staying? What are you going to do?  I have to go.  Please tell me what he says?  May I come in?  Nothing lasts.  I'm an old woman now, Benjamin.  Benjamin...  Are you sure?  Please read...  A year or so after your father passed... There was a call...          Hello?... Yes?... Speaking -- I don't understand? Where was that?  It's the last house...  I'm Daisy...  Benjamin.  You play really beautifully.  Do you remember me?   I'm Daisy.  It's good to meet you Benjamin. Do you mind if I sit with you? I would love to hear you play.  Queenie's daughter saw to it that he was taken care of...  And every day I would stop by... and make sure he was comfortable...  Let's see if we can find something else for you to do.  I know you can't.  Many times he would simply forget who and where he was at all...  What do you mean?  It's alright... It's alright to forget things...  It wasn't easy...    You're right, you can see everything sweetheart...  I think you better come down...    And I went to take care of him...  He was five, I think, when I moved in... the same age I was when I had met him...  How would you like to help me unpack?  This is the picture of old Man Kangaroo at five in the afternoon, when he got his beautiful hind legs just as Big God Ngong had promised.  The days passed...  I watched as he forgot how to talk...  That's right... Benjamin and Daisy...  ...How to walk...  I watched him sleep...  In 2002, they put a new clock on the train station wall...  In the spring of 2003...     He looked at me...  He looked into my eyes...  And he moved his fingers... and with his little thumb he held my thumb...  And as he had said... no matter what age he was... he was the same person behind his eyes... and, at that moment I knew... he knew who I was...  And then he closed his eyes like he was sleeping...  Now you do.  Goodnight, Benjamin...",
        "Blanche": "\"I am sorry to inform you that your son was killed fighting for his country, at the battle of the Marne. In the death of Sgt. Martin Gateau I lose one of my most trusted men.  When I informed members of our company he had fallen, on every face could be seen the mark of sorrow... ...we were in hope the Lord would spare him to return home together... Alas this was not to be. I send along his pants, shirt, cavalry pin, kerchief, and haircomb.\"",
        "Devereux": "\"I am sorry to inform you that your son was killed fighting for his country, at the battle of the Marne. In the death of Sgt. Martin Gateau I lose one of my most trusted men.  When I informed members of our company he had fallen, on every face could be seen the mark of sorrow... ...we were in hope the Lord would spare him to return home together... Alas this was not to be. I send along his pants, shirt, cavalry pin, kerchief, and haircomb.\"",
        "Queenie": "I guess not...  The air smells sweet...    We have to mark it somehow... You ain't no slouch yourself.  Sweeter than I shoulda been... Lost his legs you say? \"You never know what's comin' for you.\"  She got to stop doing that, or it's diapers for her... I'll be right there, Mrs. Jameson...  It sure is nice out here, Mr. Weathers...    What is that?     A fish crawl out of the river...?  God in heaven!  My Goodness, the Lord did something here...!  It's for sure nobody wanted to keep it...  Hold your water... Go see to them.     Jane Childress start her a bath... and mind your business, Mrs. Duprey... You'll be messing yourself soon enough too!  I'll be right with you, Mrs. Hollister...  You may be as ugly as an old pot... but you still a child of God...  Mercy, I'll be right there.  They're right here, Mrs. Hollister, right 'round your pretty white neck... Come on now...     You mean to say he's dying?       He is a miracle, that's for certain... just not the kind of miracle one hopes to see...  You all listen...  We have a visitor that will be staying with us for a little while... My sister had a child but couldn't see right by it... He's known as... Benjamin... Benjamin... He's not a well child... so we need to take very good care of him...  He's prematurely old... Doctor Rose said he don't have much time on this earth...       \"You never know what's comin' for you.\"  Stop bangin' that fork... It's for eating, not for playin' with... And use your napkin, please Mr. Benjamin...  Benjamin! That's dangerous... Come back here...!     Everybody feels different about themselves one way or another. We're all goin' the same way, just taking different roads to get there... You're on your own road, Benjamin.  Just be thankful you got what you're given. You already here longer than you supposed to be.  We're gonna put some life into these old sticks for you... get you walkin'...  He's got the devil on his back... trying to ride him into the grave before his time...  Let the Lord carry you... ...  Where in God's name have you been?!!     Like to scare the Holy Hell out of me! I was so worried about you...you take my breath away...    While we're giving thanks for God's blessings... I've had a miracle happen. The Lord saw fit to answer my prayers.  You are a different child... a man child. People aren't going to understand how different you are.  God hasn't said yet. Now, back to bed and behave yourself.    Welcome... we was expecting you... Could you show her upstairs?  She will be staying in Mrs. Rousseau's old room. I'll be right with you with some fresh towels... We don't usually let dogs in the house.  I guess as long as he stays out from underfoot.  Where have you been!?  Lord have mercy....you're home...  Your brother, Benjamin...      Did you learn anything worth repeating?  You seen some pain.  Some joy too?  Mr. Weathers died in his sleep one night last April. He's sleeping comfortably now in the cemetery on St. James street, God rest his soul...  There's only one or two of them left now... They all just about new... waitin' their turn like everybody else... I am so glad to have I you back. Now we got to find you some proper work and get you married right...  You're wasting your time... he's stone deaf... You'll be staying in what was Mrs. DeSeroux's room now, you're too much of a man to stay in the attic anymore.     (unforgiving,        Mrs. La Tourneau just passed away.    I never took you to be selfish. I hope I'm not wrong. I'm not usually wrong about people.  I wanted to tell you I love you and your mama's gone...  I told Mr. Hernandez about Benjamin bein' one of us. I told him if he needs a place to stay... it's alright... he can stay here... he is blood after all...  You just ate breakfast.  He doesn't believe he's already had his breakfast.",
        "Thomas": "That's enough...! All of you!  I came as quickly as I could... I'm sorry I took so long, the streets are filled with people...  You are going to be alright, my dearest darling... I will not let anything happen to you...  I'm sorry... I'm so sorry...  It's awful wet out. Can I offer you a ride somewhere...?     My name is Thomas, Thomas Button.  (saying the name to  Would you like to stop and have a drink, Benjamin?  A Sazerac for both of us...with whiskey instead of brandy...  You don't drink do you?  How is that?  It's an... experience...  That isn't a bad thing.  True enough. I don't mean to be rude... but your hands seem awful bent... It must be quite painful?  What kind of a disease?  I'm sorry.  I'm sorry about your disease.  Your mother?  ... My wife passed away many years ago...  She died in childbirth.    Buttons. \"Button's Buttons.\" There isn't a button we don't make. Our biggest competition is B.F. Goodrich and his infernal zippers...  One more Benjamin?  What kind of work do you do?  I enjoyed talking to you...    Would you mind, if time to time, I stopped by to say hello...?    Hello, Benjamin... Do you remember me?  My foot was infected... I'm afraid they had to remove it... Welcome home, my friend.  I'm a man of habit.    The war has been kind to the button industry... we had gone from making forty thousand buttons a day to making two hundred and fifty thousand... We employed ten times the number of workers... We were operating around the clock...  I don't know how much longer I have to live...  I don't have any people. I keep to myself. I -- I'm frightened. I hope you won't mind... but whenever it's possible... I would enjoy your company...    (has been telling  They were originally decorative, jewelry sewn on clothing...  The practice of buttoning originated in the 13th century... when baggy clothing was replaced with more form-fitting clothes...  Button's Buttons has been in our family for one hundred and twenty- four years. My grandfather was a tailor. He had a small shop in Richmond. After the Civil War he came to New Orleans.  My father saw the wisdom of making our own buttons. The tailor shop grew to this... And today... I can't sew a stitch.  I said, our family has been in the business for a hundred and twenty- four years.  You are my family. Benjamin, you are my son.  I am so sorry not to have told you before...  You were born the night the great war ended... Your mother died giving birth to you... I thought... I thought you were a monster... I left you on the back steps of a house... I promised your mother I'd make sure you were safe... I should never have abandoned you...  ...A great uncle, from Germany. All of the men in the family at the Lake House... 1915, three years before you were born.  Your grandfather at the summer house on Lake Pontchartrain. When I was a boy I would love to wake up before anybody else and run down to the lake to watch the day begin. It was as if I was the only one alive.  I fell in love with her the first time I saw her. Your mother's name was Caroline Murphy. She was 20. She worked in your grandfather's kitchen...She was from Dublin... Her father, your maternal grandfather, was a chimney sweep... He died in the flu epidemic of 1900... Caroline came with her mother, two sisters, and four brothers in 1903 to live in New Orleans.  I would find reasons to go to the kitchen... just to look at her...  The happiest day of my life was April 25th, 1918 the day I married your mother.  I made a mistake.  Come and take your rightful place... with your family... with me...  We can catch up for all the lost time...  I'm planning on leaving everything I have to you...  Where are you going?           Thank you, Benjamin.",
        "Teddy": "",
        "Roosevelt": ""
    },
    "imdb_rating": "7.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMzI4M2I1MTItYjdiYi00YTZhLTg0NDgtZWIzOGU5ZmM3NWZlXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "On the day that Hurricane Katrina hits New Orleans, elderly Daisy Williams (nee Fuller) is on her deathbed in a New Orleans hospital. At her side is her adult daughter, Caroline. Daisy asks Caroline to read to her aloud the diary of Daisy's lifelong friend, Benjamin Button. Benjamin's diary recounts his entire extraordinary life, the primary unusual aspect of which was his aging backwards, being diagnosed with several aging diseases at birth and thus given little chance of survival, but who does survive and gets younger with time. Abandoned by his biological father, Thomas Button, after Benjamin's biological mother died in childbirth, Benjamin was raised by Queenie, a black woman and caregiver at a seniors home. Daisy's grandmother was a resident at that home, which is where she first met Benjamin. Although separated through the years, Daisy and Benjamin remain in contact throughout their lives, reconnecting in their forties when in age they finally match up. Some of the revelations in Benjamin's diary are difficult for Caroline to read, especially as it relates to the time past this reconnection between Benjamin and Daisy, when Daisy gets older and Benjamin grows younger into his childhood years.Huggo",
    "name": "The Curious Case of Benjamin Button",
    "genres": [
        "Drama",
        "Fantasy",
        "Romance"
    ]
}