{
    "filename": "Secret-Life-of-Walter-Mitty,-The_script.txt",
    "imdb_id": "tt0359950",
    "imdb_url": "https://www.imdb.com/title/tt0359950",
    "characters": [
        "Ted Hendricks",
        "Edna Mitty",
        "Female Editor",
        "Hernando",
        "Walter's Dad",
        "Don Proctor",
        "Tim Naughton (as Jonathan C. Daly)",
        "Ted's Toner Box Associate",
        "Cheryl Melhoff",
        "Western Union Employee",
        "Walter Mitty",
        "Gary Mannheim",
        "Odessa Mitty",
        "Retirement Home Administrator",
        "Cheryl's Co-Worker"
    ],
    "dialogues": {
        "Ted": "Ted Hendricks. Vice President of Acquisitions.  Managing the acquisition. Identifying overlap. Reducing staff where we find redundancy. What's your focus been here, Gary?  Wow, okay. That's not...  No. What do you do?  Do you play an important role here?  I'm sorry. I was really getting into this song. What were you saying?    I'm not sure. But it's not at this time.  I have to see the board and start evaluations now.  I'll come by sometime this week.  How's the issue shaping up?  The photographer?  What does Quintessence mean?  Okay. Awesome.  (repeating to himself for  Who am I evaluating next?  This will only take a moment. I just wanted to inform you all, reluctantly, that this month's issue will be the last.  You are all valued employees. But as we undergo this transition we wanted to be candid with you that some of you will be--  (correcting him, a little    Most of them.  We wanted to be clear that most of you will be determined non-vital to the new partnership. The remaining few employees will carry over into the new organization. We'll be deciding which category your positions fall into over the course of the next week.  Now for some good news. We're very       Okay. So, we're very excited to play a part in publishing what will be the very last issue of Life Magazine, which has been an American Institution for 75 years and whose renowned covers have touched us all really touching ways. And for the final issue, our cover is going to be something which is... What was that word?  Our cover will probably be the most famous ever because it really has the awesome quintessence of Life. And we're all going to be a part of this historic happening. Even those of you who will, right after the happening, be asked to leave. Thank you.     Yes, sir. It's gone very smoothly. The last issue's underway. The cover? Yeah. It's amazing. It's so quintessence. It encapsulates majesty. Totally. It has some splendor, in it, too, probably. Also, I'm pretty sure it's illustrious and just really awesome. It took my breath away. And I haven't even seen it yet. We're getting it processed from practical assets now. Yes, sir. We're going to retain eleven employees. I'm going to be evaluating them over the next week.  You're vital here?  Why are you holding toys?  ...you wanted toys.  (nodding at Walter's  Yeah, you're toy.     (after being told it's  I know. Because I've been asking for it. Because it's the Quintessence fucking one that I told my boss we had. It's the cover. You seriously lost a photographer's work? At Life?  Why are you confident we'll find it?  That doesn't give me confidence, a no-answer. You're in assets, I guess?  This doesn't reflect very well on you.  During an evaluation week.  (gesturing out his cell  Don't Helmut Newton me.  Hey. We've held up publication of this issue because I told my boss that photo was fucking amazing. Okay? We've spent a hundred and nine thousand dollars because of the overage. You lost an amazing  Where is he?  Do you know what \"fired with cause\" means?  I have cause to fire you. You won't pick up another check. I can let you go without severance because-  You lost a Sean O'Connell. It was quintessence. He's a war photographer? Cubicle, you're going to tell this brave photographer, risks his life, that you, a male sitting in an office, lost--?  Do you work at one?  What are you named?  What's your name?  You're Walter Mitty?  Practical Assets.  Your pass key's not working because you've been let go. With cause.  Want to try the Four Seasons?",
        "Hendricks": "Ted Hendricks. Vice President of Acquisitions.  Managing the acquisition. Identifying overlap. Reducing staff where we find redundancy. What's your focus been here, Gary?  Wow, okay. That's not...  No. What do you do?  Do you play an important role here?  I'm sorry. I was really getting into this song. What were you saying?    I'm not sure. But it's not at this time.  I have to see the board and start evaluations now.  I'll come by sometime this week.  How's the issue shaping up?  The photographer?  What does Quintessence mean?  Okay. Awesome.  (repeating to himself for  Who am I evaluating next?  This will only take a moment. I just wanted to inform you all, reluctantly, that this month's issue will be the last.  You are all valued employees. But as we undergo this transition we wanted to be candid with you that some of you will be--  (correcting him, a little    Most of them.  We wanted to be clear that most of you will be determined non-vital to the new partnership. The remaining few employees will carry over into the new organization. We'll be deciding which category your positions fall into over the course of the next week.  Now for some good news. We're very  Okay. So, we're very excited to play a part in publishing what will be the very last issue of Life Magazine, which has been an American Institution for 75 years and whose renowned covers have touched us all really touching ways. And for the final issue, our cover is going to be something which is... What was that word?  Our cover will probably be the most famous ever because it really has the awesome quintessence of Life. And we're all going to be a part of this historic happening. Even those of you who will, right after the happening, be asked to leave. Thank you.  Yes, sir. It's gone very smoothly. The last issue's underway. The cover? Yeah. It's amazing. It's so quintessence. It encapsulates majesty. Totally. It has some splendor, in it, too, probably. Also, I'm pretty sure it's illustrious and just really awesome. It took my breath away. And I haven't even seen it yet. We're getting it processed from practical assets now. Yes, sir. We're going to retain eleven employees. I'm going to be evaluating them over the next week.  You're vital here?  Why are you holding toys?  ...you wanted toys.  (nodding at Walter's  Yeah, you're toy.  (after being told it's  I know. Because I've been asking for it. Because it's the Quintessence fucking one that I told my boss we had. It's the cover. You seriously lost a photographer's work? At Life?  Why are you confident we'll find it?  That doesn't give me confidence, a no-answer. You're in assets, I guess?  This doesn't reflect very well on you.  During an evaluation week.  (gesturing out his cell  Don't Helmut Newton me.  Hey. We've held up publication of this issue because I told my boss that photo was fucking amazing. Okay? We've spent a hundred and nine thousand dollars because of the overage. You lost an amazing  Where is he?  Do you know what \"fired with cause\" means?  I have cause to fire you. You won't pick up another check. I can let you go without severance because-  You lost a Sean O'Connell. It was quintessence. He's a war photographer? Cubicle, you're going to tell this brave photographer, risks his life, that you, a male sitting in an office, lost--?  Do you work at one?  What are you named?  What's your name?  You're Walter Mitty?  Practical Assets.  Your pass key's not working because you've been let go. With cause.  Want to try the Four Seasons?",
        "Edna": "Hi, honey.  Hi, Walter. Is it all right I'm dropping by?  Well, she's the artist...  I named her after a wonderful visit your Dad and I had to Odessa, our family's homeland, one summer, in southern Ukraine. There's a beautiful river there also named Odessa.  I named you after Walter Matthau  So the moving bill came, for my move down here. I wanted to bring it by. Thank you so much Walter.  Hi, Walter.  Oh, I'm just making some yogurt. With some banana.  It snowed today. Didn't expect that. Not much. Just a light little cover. Very pretty. Less than an inch even.  My piano got towed, Walter.  Yes. Odessa said it wasn't there. Where you said it was going to be.  She said possibly that it got towed. That that's not her space anymore.  Where are you, honey?  That's nice.  I just wanted to thank you for my Villa. Odessa told me all about it. It sounds so pleasant. Villa. That guy was a real dick.  Anyway, hon, you've really become the man of the family, and I wanted to say I love you, and Happy Birthday.  What a dick. Big man. Big warlord of the fortieth floor--  I was just discussing them. Last week. They rule over small areas of land using threats, and force bribes of livestock or klipspringers.  Yes.  In some parts of the world they carry small deer like we carry, say, quarters. To pay bribes. Also, blankets or clothing items like koofiyads.  Yes, for the warlords.  Yes?  Sean?  No. I took it. With Sean's camera.  From Sean. He came to visit.  He came to visit. To talk about you.  Yeah. He asked me some questions about you? What your work schedule was, when you left, when you came home. He said you really understood Life. He wanted to know about your work. He said you \"got Life.\"  I just sent him my recipe for Clementine cake? To his email. I packed him some when he left. He just loved it. We snacked on some during our Warlord conversation.  He's in Nepal now, I think. Photographing snow leopards. Let me think. Yes. Ship. Iceland. Mogadishu. Nepal. That's what he said.  I didn't know that. You don't talk about work that often.  I was concerned we couldn't keep it, Dear. I know it's a burden. I didn't know if we could manage. So I thought I might not see it again. I wanted a picture.  That's not a very good picture. But that's okay. She's right here.  You know, I wonder sometimes... you had to start work so early. Orange Julius. Then all through college. At Avis. Then Pizza delivery. That shitty pizza. Then at this company.  I wish maybe you had the chance, a greater chance to pursue your dreams.  What did you want to be, when you younger?  Sure you do. Everybody does.  Thanks for taking care of us, Walter.",
        "Mitty": "",
        "Female": "It's a tense environment. To be sure. There are fears of a repeat of the violence in Seattle at the WTO. And there are three thousand more protestors here today.  There's an outdoor concert scheduled just a block away from the hotel where the summit is held, which summit organizers say is a deliberate provocation, but which concert promoters and protestors say is within their freedom to assemble.",
        "Editor": "We got an email from Sean O'Connell.  Yes. He said he got the cover shot. His best. The Quintessence of Life.  Like the best ever.",
        "Hernando": "Yeah?  Yeah.  What's it of?  What's \"quintessence?\"  And you can't find it?  Wow. That's not going to go over well with the new asshole.    What's that?  What's Greenland?  Yeah, it's not that far.",
        "Walter's": "",
        "Dad": "",
        "Don": "",
        "Proctor": "",
        "Cheryl": "(can't make it out clearly    Maybe Sean has it.  Have you figured anything out?  Six billion.  Two, too, what?  Yeah. But I think there are more Starbucks, so I don't know if that's what you'd call a hot trail--  (having some fun with  ...What did you do this weekend?  My son and I went on a bike ride in Lake Valhalla. Jersey. We brought lunch. Had lunch in an actual field, of grass. We went swimming. My friend Marny lives on the lake.  I can't believe they left it in the park. How old is this?  Your sister just took off?  No kidding, man.  Braces. How old is she?  You're sure this is your sister's parking space?  (something about the idea  Thanks.  See you tomorrow.  I'm going to drop Rich at his Dad's. Thanks, Walter.  Just barely.  Okay. One, two, three.    Rich...?  Rich?  It's okay. Come here. Hey come here.  Hey, it's okay.  Hey, don't worry. You're good. Don't worry. Hey...  Don't worry, about a thing, `cause every little thing, is gonna be all right. Don't worry. About a thing...     Hey.  Did you find the Quintessence of Life?  Man, I'm sorry. How are you feeling?  (impressed about the     Honey. Hey. Come here. That was great.  That was really great. Here.  Hey. Don't worry. You're going to feel fine in five minutes. Don't worry. Hey.  Don't worry, about a thing, `cause every little thing is going to be all right. Don't worry.....    How'd the move go?  Everybody's good?  The company or the... thing.  The company's okay. The thing's tough.  Are you glad you're not there anymore?  What's the new stuff?  Yeah...  The ninth? Is that good? Two days?  Yeah, cool.  Is that your mom?  She's good.",
        "Melhoff": "",
        "Walter": "Is that like a must? Can't I just say like \"I'm employed\" or something?  My work's not really that interesting. To women. Um. Or men.  I'm a Practical Asset Manager. For a corporation.  Mostly I guess I commute to work? It's like an hour and--  It is, Todd. Yeah. Hey, when can I leave a \"wink\" for someone? To see if they \"wink\" back, or..?  Cool.  I forgot what I put there?  Oh, okay.  I sure will.  (doesn't know the guy,  Yeah. Why?  (thinks its odd this guy's  (still thinking this  ...okay thanks for asking, I guess, um, Todd was your name?  Okay. Cool.  Sounds good, Todd.  Later... Todd.  What's up, Roy?    Gary? You're Vice President of Acquisitions. Right?  ... we just got acquired. Did you know that? Roy said.  Yeah, Roy said.  Yeah, they probably have their own acquiring guy.  I'm a Practical Asset Manager.  I do. Yeah. Totally. I work in a one-on-one basis (on a one-on-one basis I mean) with all our photographers.  I was just saying I manage our film negatives from the moment they arri-  What time is that?  Okay.  Okay. Thank you. I mean \"not thank you.\" I mean like \"looking forward to it\" I should have said.  (through the closing  Awesome.    Hey, Hernando-  This 12th neg? From this last Life roll?  It's not here.  It's of something that's the Absolute Quintessence of Life. Or something.  It means like the best ever.  Um no.  Tim, did you find out anything about Negative Box 2-6? Where it was sent from?  Yeah, the guy who took this--  ...I'm getting nervous with these new guys around. Lost negative. But I'm not going to freak out. I think my work here the last nine years speaks for itself. I've made my mark.    What is this?  I think it's either a man with one sideburn. Or a candelabra. Or a Happy Days lunch box.  It's the Quintessence of Life. So I don't think it's two badminton racquets. Sean O'Connell took this just before he took another one we lost.  (looking at the out of  The negative? Yeah, I tried to reach him. He's always in Bahrain. Or a shanty town or somewhere - I got one email off.  No cell phone. He's out on a freelance. I'd really like to find him.  These are pictures from the last roll he sent in. I'm trying to draw a bead on his location by analyzing these.  Not yet. Because my trail is... water.  A Starbucks, which I don't know which one. And a man  thumb.  I've been trying to figure out the gender , as I sat here. How many people in the world?  Everyone's got two, too.  Thumbs.  Look what Sean gave me.  Because we covered, you know, so many hotspots together the last 9 years... ...boldly  You guys covered the hotspots together boldly?  As a team. Yeah. By Sean actually going to the hotspots, and by me staying here waiting for the pictures of hotspots to come back so I can boldly transfer them to magazine format.  We're moving my mom here. I went and packed her house up. What about you?  It's a sign of disdain here.  They've been targeting western journalists all summer. It's been a real hot August.  Let's just get this camera bag out of here. We can shoot the shit later, O'Connell. Over whiskeys.  I tried to leave a \"wink.\" For someone. But it didn't work.  No, it says \"unable to perform request,\" Todd. So I don't think my wink really went through. Do I have like a broken page or something?  Well, okay, something's not working. On my page.  Any what?  ...I don't have any dimensions?  I don't want to be one now. I just am one.  It's an occupation. When I became an adult I thought that would be possibly a good thing to have. Because I keep getting bills from places.    April.  Yeah. But I was working at Orange Julius to save money for college. That April. And my hands were always sore from working the Frother.  Sure.  A piece of Cheers. The first piece. Part.  Hey, Todd. I have to go. I have a piano situation I have to take care of.  Um hey, can I have my four hundred dollars back?  Rich, are you ready to push a piano down a street and get honked at by everybody in New York?  Her dad bought it for her when she was six. It's seventy-years-old.  My sister's not the responsible one in the family.  She told them no steps. I paid them for a first floor move. But she screwed up and got my mom a apartment on the 15th floor. The movers weren't equipped to get it up there. She didn't have the money for them to take it back. She had to get her braces adjusted, so she just took off.  36.  Yeah. Hey, Rich. You're pretty good on that.  I used to skateboard a little.  Maine. When I was a kid. Hey. I'll bring it in tomorrow. I don't want you to have to carry it all the way home. I got it.  You helped me move a piano. I can carry this. See you Rich. Thanks for putting your back into it.  Just, you know... helping out, man.  Yeah.  Are you sure I can't walk you home?    Hey were you able to use the Circulation computer to find that ship? That boat?  Nuuk?  ....Greenland.  Tim, what would you say is a good accomplishment of yours, like something that you'd put on an online dating page?  Seriously?  Wow...  Yeah. How did you know you can do that?  I was thinking about putting that I've never really been late coming back from lunch.  ...Yeah    Sure,  (following Tim, with his  Why did she get the cool name? She got to turn out cool.  Why did you name me Walter?  (noticing that a  (to colleague Hernando,  Mom, come on. It's nothing.  You know, the thing about Greenland... it's really not that far, man.  Greenland.  It's a country/island. Sean might be there. It's not as close as Canada but it's really not as far as it sounds. When you hear it. Look.     This looks like a chair. Here.  Have you seen this chair?  I think it's a chair. Or a pipe. A man's pipe.  Have you seen this pipe?  (showing them another    ...You're the Queen of Greenland?  That's cool... your Majesty.  Should I call you that?  Is there anything around here that a renowned photographer might be photographing?  Are you sure?  I think he was here.  Can we see that?  So are you Queen for life?  That's a good gig. They're making some changes at work. My work. They're letting most of the divisions go.  Nine years.  How'd you get to be Queen?  ...My dad sold ice cream.  That's the Musk Ox migration?  There's just three of them.  Where are they migrating?  (like it's not that big a  You're the captain of the Erkigsnek? I don't know how to pronounce that.  You're boat was photographed. In the past four days. Do you know where?  Can you guess from where?  Yeah.  Yep.  Did I just say \"yep?\" I'm sorry. I meant \"nope.\" I'm an office worker. We're trying to secure a photograph he might have, that's valuable to my company.  So he just went by us?  So there's no one here who might have had contact with him, who might know where he's going.    Can I ask you a question?  Where was your thumb like four days ago?  I can't believe I found one thumb.  Sean?  Yeah, why?  Man, I really need to contact him. We're in a transition period and--  ...Can't we just call them? I could ask him on like the boat phone.  Can I just ask him on the \"ship to shore?\" Instead of going on that old-looking helicopter?  You're leaving now?  The weather doesn't seem great. Feels like there a storm \"moving in.\" \"Brewing.\"  But you're just going to finish  Okay. I'm not going to go with you.  Is that a fjord?  I've seen pictures of fjords. But I've never actually seen a fjord. I don't think I've ever even said the word fjord out loud--  Okay.     (sort of to himself,    From your ship?  Took him where?  Can we radio them? There's something I need to discuss with--  Sean slept here?  In this Subaru Outback?  He was photographing Chilean Stevedores?    Hey. Walter.  Did you guys, were you living in this car back seat when Sean O'Connell lived in the front seat?  Sean?  Is that-- Are you saying quin--  Are you saying Quintessence? In the Spanish form? Yeah. Sean says that.  Is that Clementine cake? My mom makes-- I didn't know anyone else made that.  Clementine cake. Wow.  This is Sean's.    That's where Sean is. Tomorrow. This gibberish. I have to crack it.  I have to crack the gibberish.  ...Sean's in Iceland. We're going past there, right? Can we land there?  Can you get me there tomorrow?  Would you like some Clementine cake?  It's very good. It tastes, man, exactly like my mom's. I didn't know Chilean mom's made this. Small world.  Oh. Sorry.  Okay, I'm going to go, take my cake and.....  ...Hello?  Yeah.  ...Oh. Hey. Um, do I owe you guys money? Because your supervisor was clear I can't get my 400 dollars back. But I don't think I'm going to renew-  The last time we talked? The time you told me I have no personality?  Well, I take my work seriously. Also keeping a tidy apartment. I help my sister out paying her bills now and then. But can we not list that? None of that stuff really seems like an accomplishment.  Braces.  She hasn't asked me for rent money. For like a year. But I did pay for her braces. She's 36.  I fought a dolphin.  Yeah.  They are. I think they're probably the best mammal.  This mammal tried to protect me. And most of the other mammals I know, like the mammals at the office, they're dicks.  I'm on a ship.  Near Greenland. I tracked a thumb here. To Nuuk, Greenland. I located the thumb. Now I'm fortunately going to Iceland to correct an oversight.  It was just one.  Okay, Todd.  Do I? Because I think I'm a little worse.  So. Okay. I'm supposed to kayak in?  ....shit.  Fuck. Sorry.    What's up?  Okay. Cool.  That's awesome.  ...Your piano got towed?  I lent her money for that space.  In Iceland.  My mom's piano.  (doesn't really understand  It's a piano.  It's right out there. I just walked by it. Do you have more than one piano?  It's a piano.  It's not a car. Its a musical instrument. I should have had my musical instrument inspected? By a government.  We can't move into my mom's until tomorrow.    Don't worry about it.  Yes.  No.  I tried to join, but-- I don't really even want to be on it. I'm just trying to do this thing with someone at work.  I'm trying to do that Piña Colada thing? \"If you like Piña Coladas, and getting caught in the rain while wearing a cape--\"  Well, the guy answers a personal ad and finds out it's his wife. They have a good laugh, then they make love on the cape while drinking Piña Coladas or something, and wearing capes, I think. Anyway. I'm hoping she'll click my profile and not realize that she works in my office area. Then we can realize it and have a good laugh. Then--  No, then we can know that we picked each other out, you know, from the whole planet. Not just the cafeteria.  ... We're friends. I'd like there to be more.  I was hoping this web site (that they won't let me be on) would show her more.  I don't know. What do you think it is?  We better tell them they need to shift that over to outside the big room.  (sensing there is going to  Hey, Odessa?  You know when I asked you to pick the apartment out for Mom, you understood that she was taking her piano along.    Did you enjoy that juice drink? That you were making (for some reason) simultaneous to me talking to you about important matters? So, okay, right now the piano is hanging in the air, above a city, we can't fit it in here, and I'm not sure I can afford to move it anywhere else. So I hope you enjoyed that juice drink.  We can't. It's the only thing she really wanted to take along. I think it's really best for her. She can still play. Reading's not that easy for her now. She doesn't really have any friends in New York.  What's that move-in like. In terms of deposits and-- for Villa living? In a Villa situation?  How much should I make this deposit for today? To reserve it.   Where's that frigging Clementine cake wrapper thing...    I almost found someone I was looking for. For work. In Iceland. This is where he's going next. I just don't know where it is. Warlock. Little weird deer. Like kind of a fez-style hat.  That's what these things are. Klipspringer. Koofiyad. I just don't know what they add up to. I put them all in Google nothing comes up.      Oh. Hey.  You know we haven't really had a chance to talk yet. I know you're deciding who's vital to the transition. And I wanted to let you know what I do--  I am. Totally.  ...It's my birthday.  No... Um, my sister gave me these.  My...  His arms and legs stretch outward. Um. But that's not-- I wanted, before we have the chance to talk, I need to discuss an asset situation with you.  I've processed the digitization of every single photograph in Life's library. Two million and eleven. But we haven't been able to locate this last negative.  I'm confident we'll find it.  Yes.  I've been here nine years--  Helmut Newton didn't--  I didn't Helmut Newton you.  I didn't Helmut Newton anyone. I was saying I haven't misplaced a negative in nine years. I've handled every negative in our library and prepared them for our archive. I've overseen their digitization, catalogued each photographer's period-specific film and photo equipment. And I've managed the preservation of the original vision of each photograph. I've never mishandled a single nega-  I know where he is. Sean.  Somewhere-- I haven't pieced it together, somewhere were there are little deers and Warlocks.  Yes.   Did you call me Cubicle?  Well, yeah, but I'm not named after one.  Mom, why are you-- did you need something?  Yeah.  ...thanks, Mom.  Warlord?  (strange, his mom's using  Why did you just say that word?    (something important has  I feel funny. Why is this happening?  I need to buy a ticket, I think to Dubai. Because I'm going, actually, to Mogadishu  which I think, I'm not allowed to do from here, because it's illegally dangerous.  Here you go. Whoa, what do you have in there?  I like your trucks. I used to skateboard. Where are you guys headed?  Hey, do you guys know anyplace to stay, that's not like an arm and a leg.  Business center.  Do you know-- are there American journalists working here? What would someone want to photograph here?  Who's evacuating?    Like right now?  ...Sean?  Sean?  Sean O'Connell?  Hey. Walter Mitty. From the office.  ...Yeah. Hey. Man, I've really been trying to reach you. Hey. It's good to finally meet you. Thanks for the wallet, man, by the way. Sean, do you happen to know where that negative 12 is. 2-6? On the roll three?  You know what, we don't. I've looked in every neg box and even every camera bag and we have in the warehouse. I even double-checked the Teaneck warehouse.  I really don't.  Loan you... what?    Do you have any sense how I could get back to America if I can't afford a plane ticket right now? Totally?  I give your brother two dollars and then he'll tell me how to get back to America?  ...I can go to America for two dollars?  Hey, Todd. It's Walter. Mitty.  Hey I wanted to add a couple items?  To my Been There, Done Thats. If that's cool.  Okay. Mogadishu?  Been there.  Cheryl Mellhoff.  Walter Mitty.  Thanks.  Hey.  Almost...  ...I'm okay.  (gesturing with the Arabic  I got the board in Dubai. Hey, Rich. Here watch. The board's going to come up. You don't have to try to lift it.  You really just have to think about landing. Both feet. Same time.  No, I lost him. He said I had it though. Like he knew. He smiled. He said \"you have it.\" \"You.\" What's he talking about?     Excuse me. Can you pass key me in? I need to see Ted. My pass key isn't working. I need to let him know I verified that I have negative 12. I just didn't verify where I have it.  Yes.  Yes.  I need to speak to Ted. I found  Is there someone who took over Ted's responsibilities? On a  Yes.  I didn't lose it. I have it. The photographer told me. I just don't know where I have it.  Those are no grounds. You can't fire me for not having something that I have.  I have it. I always have had it. When you fired me, I had it. Why are you trying to hit me with Squash balls?  No one's informed me that I've been let go.  I should be sent my November check.  There's no cause to keep my salary. Ow.  I'd like to speak to your supervisor.  I demand to speak to your supervisor.  I'd like to demand to speak to your supervisor.  The Purpose of Life--  Hey, fuck you, man.            ....Mom?  Hey, did-- did a guy take a picture of your piano? Like a week ago?    Where did you get Sean's camera?  Sean O'Connell?  Me?  Do you know where--  Man, I've been desperately searching for him. For a long time. Thanks, mom.  I know. I don't want you to worry. It's not always cool and easy. ... why did you take a picture of your piano?   (meaning no one really  ...I don't even remember.    What are you?  Cool.  Thanks, man.  Grammy. Best male R &amp; B vocal performance.  You, too.  That's okay.    ...Not one?  I'm trying to locate a photographer.  The information I have (from my mom) is that he's working with a guide named Stepit. Any idea... is that enough of a clue where they might be? I know they're photographing snow leopards, and this is the snow leopard region--  I need to go there.  Didn't you just say that only that other guy can take you through there? Safely?  Yes.  This way?  Aren't you coming?  That's-- that's how you're guiding me? By pointing and saying go that way?  ...Hello.  (they know each others  Not much.  Okay. Cool.  Great, man.  It even sounds cold?  Nepal.  I don't really do a lot of, you know, swinging.  Yeah.  Oh. I don't mean that.  I meant like partying, I guess. I used to like to be at work at 8. And I have some family demands that keep me pretty busy.  Yeah.  (not in the mood for  Well, I'm not going to move and let the people who lean on me fall, because the people who lean on me are my mom and my sister.  A little.  I don't get a lot. But I guess if I had to say - mostly I just consider thoughts... for my visions for ideas and scenarios about the world.  Yeah.  ...Sean?    Cool.  Sean O'Connell?  Walter. Mitty.  I've been looking for you.  Yeah, warming up.  Hey, Sean. I really need that picture. I'm taking a lot of heat at work. Over that.  Yeah.  Why am I sitting on it?  I thought that meant inside the wrapping paper. I never opened it. Goddmanit. The wallet. I left the--  Oh, yeah... Fuck.  I-- can you believe it - I just this morning I put it in a receptacle thing.  Well, I didn't know I was throwing that out, but... yeah.  I just didn't believe in Life's Purpose anymore. So I fucking (I cannot believe it) chucked it.  No...  No.  Oh.  ...We may have to sell Mom's piano, in order to pay for the Villa. This week.  Yeah.  It's \"f\"d up. I know. But if I don't get my severance I'm going to have to forfeit that deposit, because I can't afford the room. And I won't have enough to get her another place. Another decent place.  Yeah.  Almost?  Nothing I just want everyone in the world to be Morgan Freeman. So it would just be me and Morgan Freemans, in the whole world.  You'd be you. But like a combo with him. Just a little calmer, more quiet. Gentler.  Yeah.  Los Angeles.  I'm okay. I'm going to take the train to my hotel. Try to get home tomorrow.  I love you, too.  I'm sorry.  What's a summit pass?  I'm trying to get to my hotel.  My boss, the guy who runs my company is here. Is it cool if I talked to him. Am I allowed?  There's a work situation I want to clue him in on. I was let go with cause. But there wasn't--  Sir, can I have two secs? Mr. Chatham, Can I have two secs? I'm a former employee of one of your companies. Mitty?  Just two secs? Former employee? Mitty? I was let go with cause. But I don't think that's actually what should have happened.  The Life corporation. Two secs?  Wait. No. I'm Walter Mitty! I'm a man!    (really having to yell  (meaning the young  (pleased to see Ulf even  What the fuck?  Ow, fuck, man. Hey, I have a scaled- back co-pay medical plan.  Hey.  Hey, my briefcase.  Seriously. Can I just-- I need my briefcase.  (through the megaphone, to            Horses!  I'm Walter Mitty! I'm a man!  Ulf?  Hey. Walter Mitty. How are you?  (into the mic Zach handed    I love this song. I know all the words.  Sing them out, Walter. Sing out, Man!    Rally round the family, with a pocket full of shells.  Hi, Mom.  Shit....  Oh, that's my shoulder blade.  Um, shoot, I don't have my cell phone. I think I only know like one number by heart.  Yeah.  Do you like working in Los Angeles?  You look different.  Than I pictured. I pictured you wearing an old time judge's wig. The whole time.  Hello?  Yeah, hey.  Yes I'm a Walter Mitty who did that.  I'm in Los Angeles. With pancakes. I don't know why I just said that. I'm excited.  ...for sure.  Yeah.    Do I look like you pictured?  Yeah.  What's that?  Yeah. I appreciate it. That was cool of you guys.  I don't know. I don't care. I have it.  Can you drop me off at like... where would that guy stay? Who owns my company? Mark Chatham.  Mark Chatham?  Hey. Man, I'm sorry. I was hoping I could talk to you for two secs?  I'm Walter Mitty.  I'm not a black woman, with a mustache. I'm a man who used to work for your company.  I don't know. I was in jail. We didn't get TV.  Can I just talk to you for two secs.?  There was one absent from the roll. But I have it.  Yeah. For the last issue. That's the complete roll.    That last one's pretty late. Nine days late. There was an unforeseen set of unbelievable shit that happened.  I sit way in the back. Maybe that's-  It's a pretty intense burn. It's like having Cajun eyes. Spicy eyes.  Was that a question?  I guess I was revved up.  From fighting with a piano for a month and trying to get someone at my company to evaluate my position there based on understanding what I actually do.  Not in the way that I fought the mailbox, but just in the way that I've been struggling with one.  Yes.  Yes.    Yeah.     Walter Mitty? Is there a... possibly there's a severance package for me?  I was fired for cause, but then I think I maybe gave them cause to provide me with a severance package.  Okay. Possibly there's that? For me?  I'll be right out.  All done.  Everybody's good.  How's Life?  Both.  Yeah.  I'm excited. About the new stuff.  I don't know yet. Would you have lunch with me? Somewhere not in the cafeteria. For once. Out somewhere? In the world. I was wondering that.  The ninth. Yeah.  Yeah.  Yeah.",
        "Gary": "Yeah.  The company that I'm supposed to be acquiring companies for? It just got acquired?  Okay, that's not promising for me probably.  He's probably the guy who acquired us.    ...I've been managing acquisitions. Identifying overlap. Then reducing staff where I find redundancy.  Yeah, that's not good.  Are you going to come by my...um?  Gary Mannheim. Same.",
        "Mannheim": "He's probably the guy who acquired us.    ...I've been managing acquisitions. Identifying overlap. Then reducing staff where I find redundancy.  Yeah, that's not good.  Are you going to come by my...um?  Gary Mannheim. Same.",
        "Odessa": "Does that say eHarmony? Four hundred dollars.    Then why did you give them four hundred dollars?    That's not how it goes.  Make love on a cape? While wearing capes? Because that's not what they do in the song.      What big room?  This is the big room.  Yeah.  I did not understand that.  I think when we were having that conversation I was using my blender, for a juice drink. It's quite a noisemaker.    What are you talking about?  ...Is everything okay? At work? Are you sure?  Hey. Happy birthday, Walter.  Those were your favorite toys when you were a kid. You don't remember?  But didn't we get the Villa so we can put Mom's piano in it?  So we may end up having to pay for a bigger room because it can hold a piano by selling that piano? And then having to pay for the bigger empty room for a year.  ....Did you get everything you wanted? For your birthday.  What's left?    Would I have push-back hair and freckles?  Where are you?  Are you okay? You sound tired.  I love you.",
        "Cheryl's": ""
    },
    "imdb_rating": "7.3",
    "description": "The manager of the negative-assets sector of Life magazine, Walter Mitty, has been working for 16 years for the magazine and has a tedious life, not going anywhere but to and from work. He is an escapist, daydreaming into a fantasy world many times a day. Walter has a crush on recently-hired Cheryl Melhoff but he is too shy to invite her out and he is trying to contact her via online dating. The magazine is preparing to release its last printed edition and the loathsome manager of transition Ted Hendricks is preparing an inevitable downsizing over the next few days. Walter has been the liaison between the magazine and the mysterious independent photographer Sean O'Connell, who has sent to him a package of negatives and a wallet as a gift for his work. Sean also suggests to the senior management the use of negative 25 for the cover of the last edition. However, Walter cannot find the missing negative. Walter has no means to contact Sean and finds a clue that he might be in Greenland. He decides to travel to Greenland to track Sean down in the beginning of an unbelievable adventure.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "name": "The Secret Life of Walter Mitty",
    "genres": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYmE3MTI2MmYtZDQwYS00MGY2LWJjOWEtODdiNzg5ODU0MzIwXkEyXkFqcGdeQXVyNDI3NjU1NzQ@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}