{
    "filename": "Boxtrolls,-The_script.txt",
    "imdb_id": "tt0787474",
    "imdb_url": "https://www.imdb.com/title/tt0787474",
    "characters": [
        "Fish /Wheels /Bucket (voice)",
        "Oil Can /Knickers (voice)",
        "Fragile /Sweets (voice)",
        "Clocks /Specs (voice)",
        "Winnie Portley-Rind (voice)",
        "Mr. Pickles (voice)",
        "Sir Langsdale (voice)",
        "Lord Portley-Rind (voice)",
        "Sir Broderick /Male Workman 1 /Male Workman 2 (voice)",
        "Shoe /Sparky (voice)",
        "Mr. Trout (voice)",
        "Mr. Gristle (voice)",
        "Eggs (voice)",
        "Snatcher (voice)",
        "Baby Eggs (voice)"
    ],
    "dialogues": {
        "Eggs": "Fish!  Fish?      Wake up!  OOOH! Hee hee hee.  Ha! Missed me!            Boy?     Grab hold!  This way!  No!            Carry on like everything is normal? They drag us away and we do nothing...         Ahh!   AHHHH!!  Eek.  Ehh! Oof. Eek!  Hey. Oww!  What?!  But she's lying.     Wait! I saw you last night.  And they took Fish, and... I don't know where they took him...  Ah!  Yes.  We went underground and they--  Huh?  What?   I need to find the Men in Red Hats!  The Men in Red Hats!  How do I get there?  It's not true, you know. We don't eat babies!     Fish!       Eww! You have got to help me, Fish!  Uggggh.     But.. you're all alive!?  Huh?  What are you doing with them?      It's not just us. All the others are alive too!  We saw them!    Yes!  I don't know, but The Redhats have them building something in their factory.  I TOLD you, we don't eat people!    I... I can't right now.   I- I have a speech impediment!    Hey!  It's not true is it Fish? I'm a boxtroll like you, aren't I?  He says I was... given to him.  I was given to you?  Who gave me to you?  Oh, sorry. He says a long time ago there was a kind man--  -- The one man in town who saw they weren't monsters...  ... But builders... like him.  Snatcher wanted him to build something...  And when the Redhats tried to take me away from him...  And then they...         Oh! Like Fish.  You have a father!  We can tell him I'm the Trubshaw Baby... and the boxtrolls didn't eat me. And he'll stop Snatcher!  He's a father, isn't he?  But he's the only father we have.  Please help us.  I promise!      Oh, right.   Which one is your father?  I'm Eggs?  Its a pleasure to meet you.  But which ones are the ladies?!    Even if I don't mean it!  And, it's a pleasure to meet you.  I was right!  It's a pleasure to meet you... it's a pleasure to meet you... it's a pleasure to meet youuuuu! Oooooh!       You're a liar! When I tell Winnie's father the truth, he'll-- OOF!  What?!    We'll WHAT?  You made me get out of my box!  Snatcher is here.  Winnie!  I uh...     Ahhh!  Lord Winnie's Father...  People of the upper world -- Archibald Snatcher has lied to you all!  He told you that boxtrolls are monsters -- that they steal children -- but they don't. They would never hurt anyone. I know because...  Because... I am the Trubshaw Baby!  What?!  If you won't listen to me, ask Snatcher himself.    But he's not a...       People are just mean and selfish. They're monsters.  Well, I don't want to be a boy anymore.  It was a pleasure meeting you.  And, Winnie, I really do mean it.  We have to leave the cavern.        Come on let's go. Now!      NO! I'm not a boxtroll!  I'm sorry. I... I didn't mean it. Please come out. Fish.     Get up! That thing will kill you!  You have to get up. Please!  No!  Fish! Shoe!  NO! Please!          No, no no, don't hide. Fish! Shoe! RUN! Get up, get up and run! Sparky. Sweets, run!  I don't understand.  I tried. They won't listen.  Father?  Fish, Fish, everyone! Listen! I'm a boxtroll and I stopped hiding, so you can too! Stand up for yourselves! We can fight back! Don't be afraid anymore. Sparky! Fragile! Get up! Get up and fight!  Just stand up and take a step. Please! Do it for me!  No! No! No! NOOOOOO! Fish, Shoe, Sparky...          Oh... sorry. He says they were hiding and then they heard me yelling at them...  ... We can fight back! Don't be afraid anymore. Sparky! Fragile! Get up! Get up and fight. Stand up! Fight back. Please! Do it for me!  You got out of your boxes! You did it!  My father.  You were right. Thank you.  No more hiding, right?           Whoops!  Fish, grab hold!  That's right! Pull it over there!   You think you can win and live happily ever after! They'll never accept the likes of us!  I'm nothing like you. You're the monster!  Please, Snatcher, let her go. You don't have to do this--    Cheese, hats, boxes - they don't make you. You make you.  Winnie!    Uhh.  You guys seen Fish?  Thanks!  Have you seen Fish?  Look what I found!  And now we go like this.",
        "(voice)": "",
        "Snatcher": "The unspeakable has happened. We must speak of it immediately!            Oh, I don't want money.  I want one of those.  Alright then. But prepare to say bye bye to your Brie. Cheerio to your Cheddar. Goodbye to your...    I will destroy every last boxtroll in this town!  Hear ye! Hear ye! Good citizens of Cheesebridge, the curfew is in force. Don't dawdle or the beasts will tear you limb from limb!  They will add your flesh to their rivers of blood and mountains of bones.  Child! Do you want to end up like the Trubshaw Baby?  Dragged underground and feasted upon one year ago this very night?!  Lock your windows! Bolt your doors! Hide anything that is not bolted down.  Hide your cheese. Hide your tender and delicious babies!  Beware the bloodthirsty monsters! They'll fry your eyes, gnaw on your knees, gobble your gizzards... Beware! BEWARE!   Look at all these boxes left lying about. How curious, how peculiar. I do believe... evil is afoot.    Hmm. Someone's out past curfew. Very dangerous.  All I saw was filthy boxtroll monsters.  Miss Portley-Rind. Allow me to escort you home.  Yes, how did this hat find itself aaaaall the way out here?  Hmmm. Must've died down. Suddenly!  Oh, but as a gentleman, I insist.  28.    Deepest apologies, your Lordship. But I found something out in the street that belongs to you.  Oh, don't I know it, sirs.  Fortunately, we still have our little... agreeeeement.  When I destroy every last boxtroll in this town, I shall earn my white hat... and join you in the Tasting Room.  I was told the wind had something to do with it.     Don't forget. I'm a size six-and-a- half. Order ahead.    Ladies and gents, From the long- lost land of Crackerslovakia --         Wrong, Mr. Pickles!  A boxtroll cannot CHOOSE a new life because a boxtroll does not ASPIRE to be anything more than a weak, lowly pest. But a man -- a great man! And his...  ... stooges ... can choose to change their lives. Our dreams are in our grasp!  Let us be dream-graspers, fate- snatchers, destiny-takers! Let us grasp our dreams and shove them down everyone's throat! Am I not right?   Now, gentlemen. What better way to dream than to walk in the shoes of those to whom we aspire? Mr. Pickles, fetch the--  Cheese.     Men, don your white hats.  (tucking a napkin into his  Marvelous! Then let us begin.      I say, old chaps, it's quite, um...  Yes! Those things! Etcetera etcetera, big words, chummy banter...    What?           Thisss is where I belong!    I belong up there!  In the tasting room, supping on the choicest cheeses... Everyone in town bowing down to me, like a gentleman, a lord with a white hat!  It's a time-honored tradition.    Stand back peasants! You don't touch your King!  King Archibald Snatcher. Yes, I shall be king too, why not?  HE won't let me! That pompous Portley-Rind and his gaggle of giggling sycophants.  Father always said if you worked hard, you'd get a white hat! And what did he ever get! NOTHING!  I've worked my hump off for this town!  Wading through wet garbage in the middle of the night, crawling after monsters! What has Portley-Rind ever done. Eat some cheese, run the government, NOTHING!  What has Portley-Rind ever done. Eat some cheese, run the government, NOTHING!      You.   I'll make those brie stuffed pigs bow down to me! I'm going to be somebody!     Ah yes... right. Open the workshop Mr. Trout!          Huh? Where is the beast?  It can't be. It's not possible. It's not right!    Mr. Trout!  TEN YEARS and NOW you show up?!  You'll find out soon enough!  SHOOT MR. PICKLES! Shoot!  Yes, well, I need them. They're my ticket to a white hat, Trubshaw Baby!    Does your.. does your father know you're here?  Looks like the Boxtrolls have a new victim, miss. And her name is YOU.     They're getting away Mr. Gristle!      Come on! I'm being reasonable. I can be unreasonable.  Maybe if I hold on to your son...  You really think Portley-Rind will help a nobody like YOU? In this town, you want help, you've got to help yourself! That's what a man does!  He'll THANK ME! Because all your little boxtroll friends are going to die - tonight.  That will make me the most respected man in this town.    They'll parade me into the tasting room on their shoulders!  And I'm not going to let that be ruined by some little boxtroll sewer rat.     Oooh! Vatch your hands, monsieur!     You have me. I am not a true red head.  Zees parties are so confusing. No?  How's that for an entrance!  My, my, what a surprise. Don't look like your little friends wanna run, does it? How strange, how peculiar. No, wait, it's exactly as I expected!   Time to earn my white hat!  Give up, Trubshaw! Boxtrolls lost looooong time ago. These miserable pests will never be a match for a man with dream!      (humming... then in normal    He was once. Won't get much out of him now, though. A decade hanging upside down scrambled his noodles good.    Yell all you want, boy. They ain't gonna run. You can't change nature.    Well, good speech.       Hear ye! Hear ye! Good citizens of Cheesebridge, come out of your homes! The curfew has been lifted!  Fear not, the monsters have been vanquished! Your streets are SAFE!  Join me! Your purger of pests! Your white knight who has taken back the night!  Lord Portley-Riiiiind!  I come bearing the most delightful news.    Flattened to extinction. Every last, slimy one of them.  Your lordship, I said I would not rest until I caught every last boxtroll and I am a man of my word.  With this boxtroll, I will end their reign of terror.    No. Methinks a deed of this magnitude deserves something a bit more... significant.  I want YOUR hat.     Do the honors.    Mr. Trout! Lower the beast down.  With this hat, I, Archibald Penelope Snatcher...  (repeating after Portley-  Proudly swear to uphold the dignity of the White Hat.    I... I am befuddled as your lordship! I... I crushed them myself!     Wow, good speech.  (taunting in Frou Frou's    Loooord POORTLEY-RIIIIND! Come out, come out, come out!  Whoah whoa.  Get your grimy paws off of my machine!  You vile little brat!  You ungrateful stooges!  Mine!    Stop destroying my indestructible machine!    (with effort, strangling            Men, don your White Hatsh...     Yesh... rich bouquet, cheesy cheese-like... OW!  You bit me... wif yor... MOUTH?!  I have made me, boy.  This is my dessshhtiny."
    },
    "imdb_rating": "6.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTQxODA5MDkyNV5BMl5BanBnXkFtZTgwMDMyNjkzMjE@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "THE BOXTROLLS are a community of quirky, mischievous creatures who have lovingly raised an orphaned human boy named Eggs in the amazing cavernous home they've built beneath the streets of a city called Cheesebridge. The story is about a young orphaned boy raised by underground cave-dwelling trash collectors who tries to save his friends from an evil exterminator, the town's villain, Archibald Snatcher. When Snatcher comes up with a plot to get rid of the Boxtrolls. Eggs decides to venture above ground and \"into the light,\" where he meets and teams up with fabulously feisty Winnie. Together, they devise a daring plan to save The BoxTrolls family. The film is based upon the children's novel 'Here Be Monsters' by Alan Snow.",
    "name": "The Boxtrolls",
    "genres": [
        "Animation",
        "Adventure",
        "Comedy"
    ]
}