{
    "filename": "Battle-of-Shaker-Heights,-The_script.txt",
    "imdb_id": "tt0357470",
    "imdb_url": "https://www.imdb.com/title/tt0357470",
    "characters": [
        "Todd /German Soldier (as Dale Simonton)",
        "Eve",
        "German Officer /Mr. Thomas",
        "Xiou-Xiou Ling",
        "Bart Bowland",
        "Sarah",
        "Abe",
        "Kelly Ernswiler (as Shia La Beouf)",
        "Tabby",
        "Lance",
        "Miner Weber",
        "Principal Holmstead",
        "Maurice /German Soldier",
        "Harrison",
        "Mr. Norway"
    ],
    "dialogues": {
        "Eve": "Now you try.    Mao, what did we say about the eyes?  That's right. And didn't I tell you to put in more cacti?  Oh boy. I'm not having this battle with you again.  Well, you can always chip in here. We're ordering pizza later.  Sweetie, you know what we said about paying for the war things. Nothing's changed.  Don't be dramatic.  You're just going to have to find a way to pay for it yourself then, I guess. No - not that way - the sky should be stormier. Angry clouds.  More brown, less blue.  Oh, Kelly, you're home. Good. I need you to go to the art supply store for me.  He was going to but he had to go lead a meeting at Care House.  I'll make it up to you.  When are you going to give me a break?  You're right. You have every reason to crawl into the corner and give up. But please just get me some paints first.  We need burnt sienna, cadmium red, and midnight blue. Two tubes of blue. What happened to your face?    -- And if we don't sell them there, we'll set up on the corner of Stevens and Lane, by the gas station. That's a good location.  Are you listening to me?  The same as always.  Kelly. Want dinner?  One day, we're all going to be happy.         Hey you two. I'll try not to act surprised. It might spoil the moment.  Keller, I think I'm missing some art supplies. Have you seen them around the house?  I don't know what to do with him.  When are you going to let me give you your own show? We could do it for real.  Kelly!  What a nice surprise. It's so nice to finally meet you.  A little is right. But I work it as much as I can.  So, what have you boys been up to?  Charlie at the Old Soldiers' Home?  You boys should swing by Care House. There are some Vets there.  Oh. Well - okay.  I should go. But you boys should come over to our house some time. I know your family must get tired of him.  Well, you're going to have to. Your father's at the hospital.  They think he has stomach cancer.  Why would you say something like that?  \"Seems to fit.\" Do you understand what I just said?  Kelly -      Oh Kelly. What happened?  Jesus. Let me see that.  I'm going over to see dad.  And you need to come.  At this point that's not an option.  It's never a good time.        The man I love is dying.  If I made a mistake, if you felt left out, I'm sorry. But I can only deal with one thing at a time.     Kelly, is that you?  He looks just like you.  That's amazing. Art playing a part in war.  I have.",
        "Ling": "",
        "Bart": "Kelly?  I mean - that's Irish, right?  Dude, you made him write to his mother? Who are you, Dr. Phil?  Might as well. There's only an hour left anyway.  That Willys yours?  Real funny, Ernswiler. You might still get your chance to die today.  Character building? Those crazy guys from Ann Arbor tied them to a dock.  D-Day at Kenosha was nothing. At Guadalcanal Chillicothe there was a guy who actually injected himself with malaria.  Where do you live, anyway?  That explains the death wish. Me too. What street?    Langely Prep.  Well, I got kicked out of Shaker Heights High because my birdhouse came unglued in honors woodshop.  No matter. We're all soldiers here.  You should come over some time. Service our lawnmower.  How bourgeois. Cheerio then.  Kelly. Hey.  Just a couple days a month, to get a heads-up on the latest stuff. What are you doing?  Is that all? Don't bother. I have a couple extras at home. I could give you one if you want.  My dad's real into hoarding.  Grant's field flask.  Forget him.  (laughing in sympathy and amusement  Jesus, she must think you're really screwed up. Are you?    Stonewall Jackson's.  Can you imagine that? Losing your leg and getting back up on your horse? Unbelievable. What balls.  He's got so much crap crammed in here he doesn't even notice when it's missing. I saw a backpack in here somewhere.  I thought he had a couple.  Trust me, you shouldn't. Where'd your old one go?  How?  You let someone take it?  Sounds like your mouth gets you into trouble a lot.  Tabby, this is Kelly.  Shut up.  Very funny. We're paying attention to you, are you happy now?    The fiancé.  Listen, I'm going to the flea market on Saturday. I have a line on a couple dealers. You could get a backpack there.  Especially if you know who to talk to.  Or your sister's sandbox.  No, that's quite all right. Actually, I'm in the market for medals.  Are you sure?  Yeah. How much?  General Ulysses S. Grant's field flask, my friend.  Throw in one of those backpacks and we'll call it even.  Exactly. That's why the resale value is so high.  Don't be so naïve. We all have our skeletons. Some of them just pay more than others.  Don't ask, don't tell. The army gets everything right, don't they?  Anything military?  What do you want for the box?  Fifteen.  Not at Dartmouth. Where are you going to go to school?  Ah, you have that luxury.    Are you crazy? My life sucks. Everyone's always telling me what to do. You can't fight it. Go with the flow.  She got to go where she wanted. Sarah Lawrence. Six years. She's almost done with grad school. Yale.    It was a joke. Joke?  What happened to your face?  Same guy?  What are you going to do about it?  Of course not. But there are alternatives  Haven't you ever heard of the 193rd Special Operations Wing?  Well do you want to get this guy or what?  All right. Let's get the fuck out of here, then.    Once we've gathered the intelligence, the plan will reveal itself.  No, it limits our scope - what's the objective?  Easy enough. 'Nam's probably our go- to war for that sort of thing. I have the declassified briefs from the Phoenix Project around here somewhere.  Of course we'll drop what we're doing because what you're doing must be more important.  I'll find those reports.  Christ Kelly, I let you go out on a little supply line assist and you're gone for days. Come on.  Enough with the mind pollution, Hanoi Hannah.  So, you have a thing for my sister?  Everybody does.  Oh really, like what?  You don't wear women's clothes when you're alone, do you?  Let me see. Don't be a farb, give them up.  The coast is clear.  Let me prepare to deploy.  We've planned for every contingency using the tried and true techniques of the last great world power.  Stay low. On my signal.  What an asshole. His mom gave me cookies, though.  Don't ask stupid questions. Let's go home and listen.     It was a five-watt FM bug, so we should be in range -  Be patient. It's voice activated, so we'll get everything. Trust me. It's going to be great.  We reconnoiter tomorrow at nineteen hundred hours.     It's really too perfect, actually.  I can't describe. Just hit play. It's all cued up.  Exactly.  I have a few notes jotted down.      She dots her I's with hearts. And her L's are loopier. The L is very important.  Sometimes collateral damage can't be avoided.      Do you have everything?  We can't afford any errors.  I wish I could be there to see it.  It's a day that will live in infamy.  I don't hear you coming up with anything.    You're kidding me.  To Operation Mincemeat.  How does it feel to give better than you get?  You want some more?  That's my boy.      You do?       My dad has this friend who's a director. He's shooting a documentary for the History Channel.  He needs some guys to do a reenactment of some European theater battles for him.  I haven't asked you yet.  Well, if you want to. Next weekend. But you have to take it seriously.  From what I've seen, you play fast and loose with your characterizations. This has got to be straight up.  Like back in the dining room?      I'm just saying. I know the difference between fantasy and reality.  I don't know.  Why didn't you tell me your dad was a burn-out?  I tracked you down. There's someone I'd like you to meet.  I met him when my mom made me go around caroling with the Youth Group.  Does it matter?  I don't know. You tell me.  I told you not to play him for money.  Exactly. You should know better. What do you want.  That woman's calling you.  Likewise. So, doing a little business?  Not at all. But I'd love to, anyway.  What's your problem? She's pretty cute.  Don't you want your soda?      So filming's on Saturday. Can you make it?  Good. It's gonna be really cool. He's got an explosives expert coming.  What's up?  Maybe you should talk to my dad about it.  Of course. He loves you. He was talking the other day about helping you out. Want to go to Dartmouth?  He was. If you applied for Spring Semester, he could \"pull some strings.\"  Yeah, probably not.  That's bullshit.  Tell that to my family. They're like your fucking fan club.  Even Tabby likes you.  Well, she's inviting you to the wedding.  But you probably won't enjoy that much, will you?  Good, I'll call mom's nephew Fletcher and tell him to expect a little action.  He's twelve. Let me give some advice. He's very into sharks at the moment.        Not tonight, ma.  No where.  I ought to fucking kill you.  You had to do it.  You just do whatever the fuck you want. And consequences don't matter, do they?  What the fuck do you think she's going to do, run off with you?  You're a seventeen-year-old bag boy. She's a Yale grad student. Talk about living in a fucking fantasy world.    He should be here any minute. Calm down.  What the fuck are you doing?  I uninvited you.  Why are you wearing that?    Because you know why. Just go home.  Hey.  Yeah. The have this intensive summer orientation thing.  Well, it's optional, but dad thinks it would be \"a good way to meet people.\"  He usually is.  Thanks.  Everything you'd let me bring.",
        "Bowland": "",
        "Sarah": "So how'd your battle go today? I still don't understand how you could reenact the Battle of the Bulge in seventy-two degree weather. Didn't all those guys freeze to death?  That's gross.  Then why do you do it?  Really? Maybe I should try it.  Stop it!  Sorry I asked.  I'll accidentally drop a couple pints of milk and meet you over there.  The frozen food woman came in with her kids. They must eat out of those little cardboard trays every night. One of the kids looked like cardboard.  No.  Sorry about that.  Why do you mess with him?  Sounds dangerous.  Have you been drinking?  What presentation?  Okay. Um.  It's nothing. I -  I have an extra ticket to Aerosmith this weekend.  Oh. Yeah, I figured. Okay. I'll see you in the dairy section, though.  I forgot to tell you this box was booby-trapped.  The concert was lame. The opening act singer ripped his leather pants during a stupid dance routine and stormed off stage. Are you okay?  Lance?  Sure. I understand.  Um, I don't have a perfect life, if that's what you're asking.  Fuck you.  Hey.  I've got a summer internship at an ad agency.  It's all right, I guess.  When are you going to get a real job?  You can't be a stock boy your whole life.  Well, it was good seeing you.  What?  If you think it would be more fun.  I spent my summers with my grandma in the Catskills. She didn't give me any spending money. So I played the bones for ice cream.",
        "Abe": "Sergeant Keller! How was the war? Did we win?  As usual, your cynicism is refreshing.    Now Keller, who needs that sandwich more - you or the daughter of a crack addict trying to make a new life?  That went well.  Keller. There's a meteor shower.  Oh, you mean Emmett? They didn't have an empty bed for him at Care House.  He just needs a place to sleep for the night.  I've been straight for four years, almost five. A third of your life.  I hate to tell you this, but I'm not your problem anymore.  Let me know. I can wait.    Did you make this with more chili pepper than usual?  That sounds nice.       Hey. Kelly.  Not bad.  Did you get punched?  I know the feeling. Come on in and watch some television. Don't worry, this one's bolted to the wall. As you can see, my reputation precedes me.  Any battles this weekend?  Busy, busy.  Answer me this: how come no one ever reenacts the Vietnam War?  I guess it would.  Folks dressed up like your mom and me. People reenacting fleeing to Canada, burning draft cards. I guess that would ruin the spirit of the thing, now wouldn't it?  I bet you could.",
        "Tabby": "All these little old ladies are looking for him in Arizona. He took their retirement money and bought defective bazookas with it.  Finally, my life is complete. Fait accompli.  Sloppy joe? Sloppy no.  I have to go take a shower. Will you call me when Miner gets here?  Oh, hello. What happened to you?  You paint?  How so?  Oh you're not one of those oil snobs are you?  Jejune? You're jejune. How old are you anyway?  And you paint?  That explains it.  Infantas are Spanish. Michelangelo was Italian.  Well - Kelly. Nice talking to you.  Hey. I have some stretcher bars out in the car. Can somebody help me bring them in?         That's the Cleveland waterfront.  It's the light. I was playing with diffusion.  Very funny, wiseass.  It is.  Farmer?    No. Definitely not. Thank god.  You said your mom was a painter?  What do you mean?  Like Andy Warhol's Factory.  Wow. So you really grew up with it. What does, did, your dad do?  \"Tragedy struck?\"  Well, just wait. Those burnout types always have a triumphant comeback tour.  Have fun, boys.    Are you?  I don't think I have room for a playpen in here.      Kelly?  You did.  Well you're here now. Go ahead. Set your canvas up. Use one of the ones in the corner.  Brushes are in the jar. Paint's in the drawer.  Well then.  No.  Just don't talk.    Kelly. This is Kelly -  Kelly's a friend of Bart's. He paints.  I'm not at a good stopping point.  I really shouldn't.  We will. I promise.  Maybe. Probably.  Like what?  Just because he didn't want to picture you as a pupa?  He wants to be with me. What's so bad about that?  Well, that's sweet -  Hey, I can take care of myself.  At the end of the month. But don't ask me about it. It makes me nervous.  No.  What are you painting?  How?  Do you have any idea what you're talking about?  Well, some people actually say what they really think.  It doesn't matter. It's called being yourself.  Not boring. Scary and wonderful and exciting.  I can't deal with that stuff, ma. I don't care who sits next to whom. I should have eloped.  He talks about art.     Miner and I broke up.  Yeah.  You did, huh?  I don't need any more bullshit right now.  I'm not as complicated as you think.  Oh.  There's more to it than that.  Thanks.  You like me, don't you?  No, I mean -- you like me.  Well, do something.     Kelly?  Hey.  We talked.  I'm really sorry.  Oh, Kelly.",
        "Lance": "What the fuck are you looking at, GI Jane?  No really, what makes you think you can look at me?  That's pretty funny. You got dental insurance?  What? What?  You upset Bridget.  You need to apologize.  Why are you fucking with me? You little fucker. Want to play, fuckface?  Let's see what Beetle Bailey's got in his knapsack.  Hey fuckface. Like my new hat? I just joined the Boy Scouts.  You're a regular Howie Mandel.  Okay babe. One day you and me will be alone. And won't that be nice?          Smile worker bee. I'll be your boss some day.    You're right. But I was thinking it. Instead I just told her to add more vinegar next time, and -  But baby, my birthday's coming up.  Come on. A little action. A little prime time action.  That's the point. That's what makes it sexxxy. Dangerous.         Nothing, you bad girl.  See you soon, my naughty baby.  It's my birthday! I'm going to get a present.  Damn it, fuckface. What're you smiling about? You wish you were me.  Mr. Palmer? May I be excused?  Daddy's here for the Easter egg hunt.  Ooh, push my buttons.  Oh yeah. Oh yeah. You little minx.  Bridgie? Come on, daddy's sick. He needs his medicine.  I brought our friend along. He's happy to see you.  What the fuck are you all looking at?  What, they re-assign you to the bicycle brigade?  Too bad, cause I'm not. Remember that little show I put on for the school?  Oh, come on. Pants down? Doll? Hard on?  And did you hear me and Bridget aren't going out anymore because of it?  Yeah well, let's get this over with.  Did you call me a homo?  No time like the present.  Get off me.",
        "Miner": "Miner Webber.  Quite all right. So, what do we have here, a little painting class?  Oh? What's your real job?  That's quite an image.  What?  Whatever it takes to get you through the day.  I have the afternoon off. Come away with me.  Oh, come on. They'll still be here. I know you'll still be here.  But everyone will be coming soon. And it will get all crazy, and we won't have any time to ourselves.  Like tonight? We can practice honeymoon suite.",
        "Weber": "",
        "Principal": "Kelly! I told some of your teachers about your presentation. We're all really looking forward to it.",
        "Holmstead": "What gives you the idea that you can or ought to question the curriculum?  Or question your teacher?  Kelly, you're a very bright boy. But you're making some serious mistakes.  This anger must be masking a lot of hurt.  I see you're not going to college next year. What are your plans?  How do I get through to you?  I think we can come up with a punishment which might actually be more of an opportunity for you to realize your true potential.  For those of you who haven't had the chance to get to know Kelly, you should know he has a very interesting hobby. He takes part in reenactments of World War II battles right here in Ohio.  He has an unusual first-hand knowledge of history. We recently discovered that this extends beyond World War II to the Civil War, which he is going to discuss with you today. Kelly?",
        "Harrison": "German's a Cold War language. You can't get any kind of State Department position without more diverse linguistic training than that. You'll take Chinese.  Are we on the same page?  But have you ever noticed how in movies they always bite the grenade before they throw it?  You come from a creative family, do you?  Here, Kelly, try a bit of these leeks. Minnie has a way with the white sauce.  Don't sit any of Mathilda's sisters next to me if you can help it. Oh, hello. So nice to see you. Thank you for coming.    Is that everything?  Give me a break.",
        "Norway": ""
    },
    "imdb_rating": "6.0",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTQwMzI0Mzk1NF5BMl5BanBnXkFtZTYwMDIzMDk2._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "A young war reenactor makes a friend on the battlefield who helps him use strategy to take on his high school enemy. Driven by newfound confidence, he seduces the friend's fetching older sister and risks the friendship. Reality intervenes when the illness of his ex-addict father forces the anger his irony masks to the surface and he has to decide if staying in a fantasy world is worth the consequences.—Anonymous",
    "name": "The Battle of Shaker Heights",
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ]
}