{
    "filename": "Imaginarium-of-Doctor-Parnassus,-The_script.txt",
    "imdb_id": "tt1054606",
    "imdb_url": "https://www.imdb.com/title/tt1054606",
    "characters": [
        "Martin",
        "Martin's Girlfriend",
        "Valentina",
        "Dad",
        "Uncle Bob (as Simon Daye)",
        "Mum",
        "Linda",
        "Percy",
        "Doctor Parnassus",
        "Anton",
        "Policeman",
        "Friend of Martin",
        "Diego",
        "Aunty Flo",
        "Face Changed Martin"
    ],
    "dialogues": {
        "Martin": "What the...!    Thas a nice pair of jugs.  No. I wan you... I wan you...  Come here you little sexpot!  Come back! You bitch!  Mum...Mum!...  Please... I'll never...! Never again!. Honest!... From now on... I swear!.. Not a drop!  Marty!? Marty, where are you? Oi! Leave off..it's them..they've got our mate back there.",
        "Martin's": "",
        "Girlfriend": "",
        "Valentina": "Stop! Get off the stage!  Get off the stage!    I had to get away.  Self defence.  When I was three!    (trying to get ANTON'S  Ladies and Gentlemen, let Dr. Parnassus be your guide...  Beauty, Truth, Wisdom, Justice... without imagination all are dead.  (startled, guiltily hiding  Who's that? Who's there?    He's not here is he? He's inside getting pissed.    Hey! That's mine!  Give it me!    Shut up.  I'm not pretending. Anyway... I'm under age.    Percy? How old will I be on Wednesday?  See? Parnassus says so too. Are you saying he's ridiculous?    He takes advantage.  Puhlease.  Parnassus is a pain. Okay he's extraordinary but I'm not. I don't want to be like him. I want to be like other people. Like them.  You know... normal. Ordinary. You're so lucky.          I go to all this trouble and you leave it.  Are you ill?  Now what?    Percy liked the soup.  That's normal isn't it?  You know it doesn't agree with you.    You think you're so clever and that everybody else is an idiot! You can't stop me growing up just by lying about my birthday! It's ridiculous!  Is this going to take long?  Father!...  What do you mean `at what price'?  Typical! You insist I listen to a story and then you don't finish it!    A rope! Get a rope!  Try again!  Hurry up.  You've done it! Brilliant!  Thank God.  Put him in the big trunk.  Don't argue.  He thought he was dead.  So, what do you suggest, we leave him on the side of the road?  Is he okay?    (to PARNASSUS who is in  My God... that's exciting.  Why not?    Father?  He says you must work... to focus your mind. You can help out front.. sell tickets. Ah, here we are... Try this. You can be `Justice'.  Just like the rest of us.  No face. No name. The mystery thickens. I'm going to have to give you a name...  ... until you remember who you are, I dub thee Saint George. You can save me from the dragon. George.  You've met Parnassus.  Hi, Anton.... what?    Oh no!  You can't go on. You're drunk.  (to Percy  Where's George?     (suddenly defensive of her  Wow! You took all that?  Anton!      Yes.  Charity work? I knew you were a good person.  Percy!  Anton, that's enough.  Anton...  Father! Father!  What were you thinking? Look what you've done. Get out of the way! Tony.    Thank God it's only cuts and bruises. I thought we'd lost you.  I don't know what's wrong with him, but if it's about the show...I don't care. I'm tired of it...let the police arrest us. I'm sick of living like this....  What are you doing? Didn't you do enough damage last night? Anton... I'm the one who wants to run away! Are you trying to wreck my birthday, or what?  Please. We need you.  How much money have you got?      (distressed but basically  (sotto voce to the DR.  Father?  Who was that?  I overheard you... He wasn't asking the way.  I want to know what's going on.  Yes, now! I want to know the truth!  What are you hiding?  It's something to do with that bloody rambling story you were telling me the night we found Tony isn't it?  So tell me.    What price?  Tell me...  Say it.  What?    But... didn't...  I don't believe this! It can't be true. It's just another of your wretched stories... A cruel story!  Why do you say these things?  By playing games with the devil!?  No!  All my life you've made me play `Beauty', `Truth', `Justice'... filled my head with dreams and high ideals. All that crap! While... all the time...! The devil was right! You're arrogant! Vain and arrogant! I'm just another one of your stupid wagers!... You're beneath contempt.  Tony...oh, Tony..      This stupid theatre...!... That's all I've ever known...! I've always believed it was something precious, but it's not... it's a lie...I hate it!  Maybe.  No! Tony, don't get in! Get away!  No we won't. This is the way.  Just like my father. Leave me alone. I don't care anymore. I want a new life.  Tony, help me, she's heavy.  You did it! You made the right choice!  Anton!?    Anton!!!  Forgive me, Anton. I was wrong.  Noooo!  Father! No!  NO..NO NO... Please.. father..it's all my fault. What have I done?...         ...a selfish bitch, everyone I love dies...I'm...  Father...? Where have you been?... All these years... I thought you were dead.  Come in.  Billy, this is your grandad. Say hello to your grandad. I think he looks a little like you.  He's only five. And he's very shy. Would you like some tea?  Okay, you look after Imogen.  She's eight months, and, so far, fortunately, doesn't look in the least like you.  This is all I ever wanted... I know it's not what you wanted for me, but...well... there you go... I'm happy.  We're both happy.",
        "Dad": "They won't let you, darling.  Leave her alone!  (to the DR. PARNASSUS,    And you can wipe that silly expression off your face, you little poof.  And where's your gamer? He's lost his bloody gamer! Another fifty quid down the drain. You're not getting another one! Bloody kids! Why do we bother?",
        "Mum": "Stop going on, Linda! You're not old enough!    Is he insulting us?       Diego! Where have you been? I've been worried sick!",
        "Linda": "But I want to!!! I want to!!!     It's not fair.    I want my brother! I want my little brother!",
        "Percy": "Take a ticket and join the queue! Only five quid a go! There's no greater bargain on planet earth!   (shaking his empty  (indicating ticket  I thought so.    You're going to have to tell her.    Twelve.  ... And as the waters rose... the people's need for stories grew. Stories that would feed a great hunger. A hunger for more than just understanding...  Don't be a fool! You can't die! You're immortal! You'll just end up broken, in the eternity ward, and I'll be stuck looking after you! Forever!  Swing in!  Come on, don't hang about! We're getting soaked up here!  Well, he was.  The boss said leave him.    Hey, you!  I suppose somebody saves your life everyday of the week.  Too much like routine to bother with a thank you.  Percival St. Antoine della Touraine et Sansepolcro da Piemonte the Third. If that proves too difficult, you may call me Percy.  Geographically, in the Northern Hemisphere. Socially, on the margins. Narratively, with some way to go. And your name is...  That's handy.  Any credit cards?  ...with your name on them.  Don't look at us.    They'll know who you are.  Pity.. I speak Russian.  Well, we didn't and he isn't.  (handing Parnassus the  Actually, I saw that trick performed many years ago at....  No he's not.  No he hasn't.  What proposal?  Let's close up quick while the going's good.  There isn't a next show.  We've done all the shows we're doing here this evening.  Five souls.. two days, eh!?  I told you didn't I?  That he was a wrong-un.  No... but they sure as hell like being economical with the truth.  You won't feel a thing.  You may breathe normally.  So what was he doing dangling under a bridge from his neck?    He's in love with Valentina?  It happens.  While you're at it, don't forget the other one.  The viper, the scorpion, the amnesiac boa constrictor. Tony.  Really?    She'd be better off with Anton.  That's even worse than the other ideas you've had today.  Get a midget.  Better luck next time.  Do me a favour. Take a long walk off a short pier.  Bugger off!  Change the show!? Who the fizzing hell do you think you are?......  What about the filth?  The filth. The police.  That'll be the day.        Maybe you were holding them upside down.  That cards! The bloody Tarot cards!  Comes to the same thing.  Why not?  You had some of those when we rescued you.         Telling the truth... Always a bad idea.  About bloody time!    How long's a piece of string? Don't ask daft questions.  Problematical my arse! Come on... I know it's against the grain...  Yeah, it goes just before the fall.  Come on... I know it's against the grain...",
        "Doctor": "You hit him.  You're out of control. Ever since your mother died...  I don't want to talk about it!  We don't accept drunks!  People must be in their right minds when they make the choice.  Gone. Will we miss him? I don't think so.  (to the POLICEMAN condescendingly  (descending from his glass    There must be something!             ...at what price....  Hanging?  The hanged man!  These marks... I recognize them.      Tell me you've come with a proposition. Tell me what I want to hear!  He's from Mr Nick.  He's come with a proposal.  All is not lost.  (looking at the card, then     We can talk here. Sit down, sit down.    The message.  The message! What's the message? From Mr Nick. What does he want?  Problem? What problem?  What!?  You've lost your memory?          Can he remember! Can you remember?  Bloody useless! Mr Nick sends an emissary and he can't bloody remember! It's a bloody disaster!  I am not drunk! I'm under considerable stress.  No! No understudy! The audience won't tolerate an understudy! There's only one Doctor Parnassus, and I am he!  Strong coffee? Brilliant! This is why fate has brought us together. Don't worry about remembering... It's all the same to a man on a galloping horse!      What do you want? I'll do anything.  You're man's lost his memory! He's bloody hopeless!  What?  For God's sake! Tell me what you want!  On Valentina?  You bastard!  What! Impossible!..you've seen the business we're doing.  Wait!  George... We'd like to know who you really are.  I may be able to help.  Hold this piece of wire.  I'm going to put the tips of my fingers on the top of your head.  I want you to relax and try as far as possible to think of nothing.  Hold your breath.  Very good, very good. Yes... Yes, I see... I see... Very interesting.  Alas, this technique has its limitations.    Anthony Shepherd.  And... you used to do good works. Something to do with charity I think.    He's ambitious, energetic... a man of destiny.  What are you doing? Please concentrate. We've got a tremendous amount of work to do tonight. A great deal depends on it.    What sort of \"different\" way do you suggest?    Shhh!  Our time's nearly up... This could be what we need.  (ignoring him and with a    What?    Valentina... my darling girl. We must do another show! Now! Quickly! Get ready to move out!  Somebody asking the way. Where's Tony?  Please! Get everybody together. Another show! Tony! Percy!    The truth?  There are more important things, at this moment!  Yes.  What I told you was... the truth. I really am thousands of years old. I have been immortal. I have been mortal. And I have had many dealings with the devil. Too many.  Remember the woman I was telling you about?.. the one I was so desperately in love with.. so in love that I made a deal with the devil? That was your mother... ...she was so beautiful, so enchanting...so...  ... so young. She was everything I had ever dreamed of. I made a choice. I bargained away my immortality. I regained my youth... and I won her. I did! I won her...!  ...but at a price...  You fool! You monstrous fool!    You should be dead.  What are you doing?    Yes! Yes! Of course! Of course! Thank God! Thank God!  Valentina!     Where are you?    Valentina!!!!!!",
        "Parnassus": "You hit him.  You're out of control. Ever since your mother died...  I don't want to talk about it!  We don't accept drunks!  People must be in their right minds when they make the choice.  `Playing'? We don't `play'! What we do is deadly serious!  Gone. Will we miss him? I don't think so.  (to the POLICEMAN condescendingly  Excuse me! Excuse me! Would you mind...  Please! This is The Imaginarium! It requires respect, concentration... Kindly go elsewhere and take your detritus with you?     (delighted with Anton's  I didn't.  Hooplah!  (descending from his glass  Ah, the fuzz.    With pleasure.    What can I do?...  There must be something!             I'm not hungry.      What was I thinking of!    Immortality's a curse! Any fool can tell you that!    Listen to me!  Shut up! Shut up and listen to me! Listen to me! I need to tell you something, before it's too late!  One dark winter's night... Many years ago...?   Many centuries ago, as a matter of fact...  ... I was visited... by someone I had hoped never to meet.  ... Having captured the wind and tamed the storm ... the Chief Steward, laying down to take his rest, had a disturbing dream... He dreamt that a hooded rider was approaching across the snow-swept plain.  A rider who would challenge the very foundations of the world...  ... The Steward woke and remembered his dream. What manner of man had he dreamt of, and what did it signify?  We tell the eternal story.  The story that sustains the universe. The story without which there is nothing.  You make it sound so simple.      Stop!  A sign! A message! That bird was a messenger... from distant places we know not of! Other places! The point is, you're wrong! And I'm wrong! It doesn't have to be us here! Somewhere in the world, at any given time... someone is telling a story! Sustaining the universe! Right now, it's happening.  That's why we're still here. You can't stop stories being told somewhere! You can't be everywhere!    And so I made a wager with the devil.  Whichever of us won ten converts first, would win the bet... My argument was the importance of the story, the power of the imagination... His, the power of material things, the supremacy of stuff... Naturally... I won.  My prize... ... was ever-lasting life.  Everlasting torment... Everlasting... Everlasting... Times changed. No one wanted our tales any longer.  It seemed as though the Devil, after all... had triumphed... And then... one day....  From the very first moment I saw her, I was head-over-heels in love. She was beautiful, enchanting, delightful, young... But I... I was several thousand years old! How could I woo her? What could I do?  At times like these... the devil is never far away.  The devil granted me mortality again...and youth and great powers. I won my bride. I was in love. But at what price...    ...at what price....  We've stopped.  (turning back to his Tarot  Go and see!  Why are you fishing dead people out of the river? He's dead. Leave him. Let's go. Before the police turn up.  Dammit! I told you to leave him. He was dead.  Hanging?  The hanged man!  These marks... I recognize them.      Tell me you've come with a proposition. Tell me what I want to hear!  Thank God! Thank God! Thank God for that!  He's from Mr Nick.  He's come with a proposal.  All is not lost.  (looking at the card, then     We can talk here. Sit down, sit down.    The message.  The message! What's the message? From Mr Nick. What does he want?  Problem? What problem?  What!?  You've lost your memory?          Can he remember! Can you remember?  Bloody useless! Mr Nick sends an emissary and he can't bloody remember! It's a bloody disaster!  I am not drunk! I'm under considerable stress.  No! No understudy! The audience won't tolerate an understudy! There's only one Doctor Parnassus, and I am he!  Strong coffee? Brilliant! This is why fate has brought us together. Don't worry about remembering... It's all the same to a man on a galloping horse!      What do you want? I'll do anything.  You're man's lost his memory! He's bloody hopeless!  What?  For God's sake! Tell me what you want!  On Valentina?  You bastard!  I'll kill you!  What! Impossible!..you've seen the business we're doing.  Wait!  Shh! I'm trying to think.  What?  Trust in providence, Percy. Remember the hanging man. The cards don't lie.  George... We'd like to know who you really are.  I may be able to help.  Hold this piece of wire.  I'm going to put the tips of my fingers on the top of your head.  I want you to relax and try as far as possible to think of nothing.  Hold your breath.  Very good, very good. Yes... Yes, I see... I see... Very interesting.  Alas, this technique has its limitations.    Anthony Shepherd.  And... you used to do good works. Something to do with charity I think.    What's eating Anton?    The little snake! I'll skin him alive!  Quite another kettle of fish.  He's ambitious, energetic... a man of destiny.  I think he might. Valentina sees good in him.  Perhaps I should offer her hand to whoever helps most in winning the next five souls.    What are you doing? Please concentrate. We've got a tremendous amount of work to do tonight. A great deal depends on it.            What sort of \"different\" way do you suggest?    Shhh!  Our time's nearly up... This could be what we need.  Well then... For God's sake let's do it!!!  Anton!   Where are you going?  (ignoring him and with a      What?      Who is it?      And the girl..from the pub.  You're joking... toying with me. Like a cat with a mouse... As is your privilege.  Valentina... my darling girl. We must do another show! Now! Quickly! Get ready to move out!  Somebody asking the way. Where's Tony?  Please! Get everybody together. Another show! Tony! Percy!    The truth?  There are more important things, at this moment!  Yes.  What I told you was... the truth. I really am thousands of years old. I have been immortal. I have been mortal. And I have had many dealings with the devil. Too many.  Remember the woman I was telling you about?.. the one I was so desperately in love with.. so in love that I made a deal with the devil? That was your mother... ...she was so beautiful, so enchanting...so...  ... so young. She was everything I had ever dreamed of. I made a choice. I bargained away my immortality. I regained my youth... and I won her. I did! I won her...!  ...but at a price...    I... The price of my obsession... I can't say it.  You.  I was mortal again... on condition that... any children I fathered... would, on their sixteenth birthday... belong to him.  Your mother never knew. She died before I had to tell her.  If only...  It's true. Every word. But all is not lost.    With one more show. The day isn't over.  Valentina.  Valentina! That's not true! It's not like that! Wait! Come back! Valentina!  Valentina... She's... she's gone...  You fool! You monstrous fool!    You should be dead.  What are you doing?    Yes! Yes! Of course! Of course! Thank God! Thank God!  What?  (trying to go into a    No! I can't do it!  My mind... I can't concentrate... I'm too upset...    It's no good!  Valentina!     Where are you?       Valentina! My darling daughter! There you are!    I create the opportunities. Is it my fault if your not up to it?  Valentina!!!!!!          Give us a moment, please.  Here's your tube... Here's mine. But mine's just a cheap counterfeit... Look, it breaks... But here's another...  You're not amused?  Choose.  Choose!  Are you sure you made the right choice?  Let's find out.    What else could I do, Valentina? What else could I have done... What other choice could I have made?... Damn!... It was the right choice... Of course it was... Of course... But where are you?  Where's my beautiful daughter? Where's my darling? How long must I suffer?  No, no, no... No more choices, please... No more choices...!!!  Percy!  Where have you been?  How long have you been here?  Thank God I found you. I need your advice. I've got a problematical choice to make.    Valentina...?  So did I. But you... I...  Beautifully made. It'll last for years if properly looked after.  I'm afraid we can't guarantee that.",
        "Anton": "Ladies and Gentlemen... Step up! Step up!... I, Mercury, the messenger of the gods, invite you... tonight, for one night only... at this very venue... to enter the mind, the very great mind, of Doctor Parnassus!  Doctor Parnassus... as old as time... yes, ladies and gentlemen, more than a thousand years old ... he has the power to empower your mind. A secret learned in the mystic East. Let Doctor Parnassus open your imagination. Let him guide and transport you to worlds and possibilities you never dreamt of... If you dare. But... Beware... there are dangers. You will have to choose. Will your soul fly?... Or will it be dashed on the rocks of darkness? The choice is yours and yours alone. Transcend the heights on Beauty's wing.    ... scour the squalid depths with Putrid's brother, Stench!  You choose... Fulfilment, grace and light or... Waste, filth and darkness. No prizes for guessing what you'll do.  (not in character.. he  We c-couldn't stop him.  I know. I'm s-sorry.  Step up! Step up! For one night only! The Imaginarium of Dr. Parnassus! Not to be missed!  Test your imagination! Envisage the sublime. Let Doctor Parnassus be your guide. Discover the heights of Wisdom...  ... Or, if you will, visit the doldrums with all that's vile and stinks.  The world is full of wonders, beauty, enchantment, for those with eyes to see...  What?  What g-g-game?  I d-d-don't know what you're t-t- talking about.    I'm n-not supposed to be here.  That's the p-point. It's up to you.  Look at that moon. I've n-never seen it so b-big. And the stars...It's so c-clear.    I c-c-can't call you Val, P- Parnassus d-doesn't like it.  Are you happy?     What?  Why d-do you always have to p- pretend to be so b-brutal?    Don't be ridiculous.  No...  He knows I worship him....  I don't mind. He's extraordinary... Like you.  You are.  Incredible! I saw somebody d- dancing in the air.. under the b- bridge..  It's true! There was a sh-shadow on the water, when the lightning flashed...        Arghhh!!!!  Argggg!!!  No! That won't work. And anyway, you d-don't know where he's b-been. Let me...  He's alive!  What on earth is this?  B-but...  I d-don't like it. It's none of our b-business.  Might be for you.  He was hanging under the b-bridge.  We found these in his p-pockets.  With his hands t-tied behind his b- back?  S-somebody was trying to k-kill him.  We c-can't let him stay with us.  We d-don't know what this is about, who he is, what he m-might have done...  We c-can't do it. We...  The show. We c-can't do it. It's your father...      Thank G-God... N-not a single customer!    Lying through your t-teeth can do that to you.  What tomorrow? We're gone.    P-please...I'm sorry about last night. I behaved like an idiot.  You must admit... even idiots have their qualities.    I found it.  Oh. You're a musician n-now.    Alright.  It's g-gone.  Ah, there it is.    Sleep no more. Procrastinate no longer. Embrace this once in a life- time opportunity. Let the mind of Doctor Parnassus be the portal to the infinite world of your imagination.  As old as the universe itself, the great Doctor, versed in every mystic practice known to man, and many more besides, will guide you to your destiny.  T-taking you to the heart of your imagination!  You won't regret it!  N-not at the same time!  Your imagination is a very special place. Doctor Parnassus will make it flower.    The stronger imagination will overcome the weaker and then there's n-no knowing what might happen.  D-don't be afraid, d-dear lady. You'll be safe with me.  Have no fear.  Only b-because she d-doesn't realize...  It's alright! It's alright!  L-leave me alone.    I was screaming as well.   It was t- terrifying...    You think it's some k-kind of scam, d-don't you?  No... But I d-don't expect you to g- get it... N-not in a million years.  He d-doesn't want to rule the world d-does he?... He wants the world to rule itself!     I thought you were the c-clever one.      Stop it! L-leave him alone!  Stand b-back! I'm warning you!  Relax. Smell the flowers.  Shut up!  You're a l-liar. You've been lying to us all along. Who are you? Who were those thugs?  No?  You stole their money.  That's what they said.  So why were they trying to k-kill you? \"Again!\" is what they said.  (answering his own  The marks on your face...  They scrawled something on your forehead. Symbols... Signs...  Yes, what's that about?  What's happened?  Ah, there you are, Tony. Here's something m-might interest you. 'Missing: D-disgraced head of children's charity'.  N-not a bad p-picture, Tony. Listen to this Valentina... it's about Tony's b-beautiful world..  ...Anthony Shepherd, who was arrested last week on charges of...    Don't d-do it. Don't g-go on. Not with him! He's all lies.  Valentina!  All of this is false! It's nothing to do with you! It's all him. It's his imagination!  It's all rotten! A naked lie! You've got to understand!  Look at this...  ...`Tony Liar'..      Valentina!..help me. Please.  I know... I'm not a child.  I love you, Valentina.  Hello Doctor.",
        "Policeman": "I want you freaks out of here. Now. If I ever see you in this parish again I'll do you.  What's the trouble?  What did you say?    Alright, I think it's time to move on, folks.",
        "Diego": "Help! It doesn't work! It's broken!  The game!  The game! The video game! The one we're in!  Help me!  What?  What am I going to do?",
        "Aunty": "Ow! Bloody hell!  He's spoilt our evening.",
        "Flo": "Ow! Bloody hell!  He's spoilt our evening."
    },
    "imdb_rating": "6.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTY4Njg4NTA3Nl5BMl5BanBnXkFtZTcwNzYxMzg5Mg@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "In London, the sideshow troupe of Doctor Parnassus promises the audience a journey to the \"Imaginarium\", an imaginary world commanded by the mind of Doctor Parnassus, where dreams come true. In the stories that Doctor Parnassus tells to his daughter Valentina, the midget Percy, and his assistant Anton, he claims to have lived for more than one thousand years; However, when he fell in love with a mortal woman, he made a deal with the devil (Mr. Nick), trading his immortality for youth. As part of the bargain, he promised his son or daughter to Mr. Nick on their sixteenth birthday. Valentina is now almost to the doomed age and Doctor Parnassus makes a new bet with Mr. Nick, whoever seduces five souls in the Imaginarium will have Valentina as a prize. Meanwhile the troupe rescues Tony, a young man that was hanged on a bridge by the Russians. Tony was chased until he finds and joins the group. Tony and Valentina fall in love with each other and the jealous Anton discovers that his competition may be a liar.—RubyRed, Seattle, Washington USA",
    "name": "The Imaginarium of Doctor Parnassus",
    "genres": [
        "Adventure",
        "Comedy",
        "Fantasy"
    ]
}