{
    "filename": "Hangover,-The_script.txt",
    "imdb_id": "tt1119646",
    "imdb_url": "https://www.imdb.com/title/tt1119646",
    "characters": [
        "Alan",
        "Sid",
        "Mike Tyson",
        "Doug",
        "Jade",
        "Officer Garden",
        "Eddie",
        "Officer Franklin",
        "Melissa",
        "Tracy",
        "Stu",
        "Mr. Chow",
        "Leonard",
        "Phil",
        "Black Doug"
    ],
    "dialogues": {
        "Alan": "Enh, we've moved past the pressure stage...it's more like aggravated assault stage now? Like at the last wedding we went to, she threw a camera at my head, called me a closet fag, then ran out crying.  But we talked, and everything's cool now.  Great idea, Stu. Thanks.  Isn't custard like a trillion calories--?  Is this gonna do better than the hip-hop label you started, Vick? Or the topless sushi bar? Or the mobile tattoo parlor--?  What?  I am so not getting paid back.  So, you ready for Sunday?  Tracy's dad still hate you?  Any closer to figuring out why?  Ahhh yeah, I wasn't going to tell anyone about that--    Oh, it's a family heirloom. My grandmother smuggled it through the Holocaust, actually. I was going to propose to Beck this weekend.  We've only had two shots, man!  Seriously, man, we're your friends.  Just give me ten more minutes, Beck...  Wet. Water. Jesus, what's--?!  What did we do last night?  I can't taste anything.  Hey... Are we missing something?  No. That's not it... There's something else...  Doug. Guys, where's Doug?  You calling the room?  Ummm...shouldn't we look for him? Check-out is in like ten minutes.  What an asshole. Stu, check the pool and the casino, I'll check the room and the gym. Maybe he's working out or something...  And Vick, if you could keep a close eye on the buffet, that'd be really helpful. Thanks, man.  Doug...? Doug...? Wake up, man.  That's weird...  I hate you all...  No, I assume you didn't either?  Dude. It's 120 degrees outside.  Great. So we've officially lost Doug. His wedding is in what, 22 hours?  Okay, so last night...  Right, that was like, 6ish...?  Yeah. Then...we played craps at the Hard Rock...maybe?  I'm pretty much blank after The Hard Rock.  So that was what, 10ish?  Okay. So we only have a 13 hour window where we could've lost him.  ATM receipt from the Rio at 10:37-- For 600 dollars?!  Here's a receipt from Sbarro. The meal was comped for some reason--  Someone could've given that to us.  I think we should call Tracy.  What if Doug called her? She might know where he is.  But shouldn't we at least tell her we're gonna be getting home late?  I think I'm beginning to see why you're always single.  Jesus, what is it?  Sweet mother of mercy...  I'm sure there's a perfectly logical explanation for this...  Yeah, maybe there isn't.  Oh god, that doesn't mean you're gay.  So what, he's a great-looking dude--  Yeah, I think we'd all remember.  Wait -- I was there that weekend. Did you have gay feelings for me?  What?! I was a good-looking kid!  All right, we're scaring the children. Let's go.  Oh my God.  Oh...my...God.    That was us, dude.  Yeah, there's no bed in Doug's room.  Yeah, Stu, I really do.  Seriously: what am I gonna tell Becky? For 14 years she's been begging me to get married...  Wait, is that homeless guy wearing Doug's shirt?  What if they don't remember us--?    W-Who's...Chastity?  I am never...ever...drinking again.  We got a unicorn?!  A-And how much did that cost?  I'm gonna kill you!  I don't suppose you have any sort of return policy, do you?  What.  Oh, hey Becky! Hi!  No! I-I have no idea--!    Nothing! Baby, nothing, the GUYS    I know, baby! I know--  Yes. I will. I promise.  Yes, no, I love you too!    I paid 7 grand for Sbarro?!  Let go of what, exactly, Vick?! The fact that I married a complete stranger last night? Or that my girlfriend's about to leave me? Or that I'm broke? Which one?!  I know you think it's like terminally uncool to be in a committed relationship, Vick, but I actually love Becky, okay? I-I honestly don't know what I'd do without her...I really don't...    I was going to propose to her this weekend, you jackass!  I swear to God, Vick, if you say one more word to me, I will destroy you.  Vick, don't be a dick--!  Why'd you do that?!  Do you think we stole something from them last night?!    \"No cops?!\" Who are you, Fitty Cent?!  Every little thing?! We were just assaulted by the Yakuza!  They knew your name, Vick! Which means they probably know who Stu and I are, too!  No messages.  What...what am I supposed to do?  Why me?!  Listen to me. Just...did we, or did we not, have sex last night?  Wait-- we didn't use a condom?!  Can someone...please open a window?  You work here?  Look, I don't know how to tell you this, but--  The Holocaust, man.  I have besmirched my people.  Please...don't.  The entire club CHEERS! Chastity holds up her wedding ring and dances around, WOO HOO! Alan waves meekly. Thanks.  Twenties?  Look, I don't know how to say this, but my friends and I were very drunk last night. We would never come to a place like this--  Guys?  What the hell are you doing?!  We don't have time for this! We gotta find Doug!  What?  You are so goddamn selfish, Vick. You really are. Stu, let's go.  Dude: Doug is missing! We have less than 18 hours til his wedding! We do not have time for this!  Vick--!  No, look-- I am like totally against this, morally and politically. Plus Becky specifically asked me not to--  as Chastity works a wildly erotic lapdance on him. She crawls onto his lap, she whips him with her long hair, she puts her tongue in his ear. Next to him, no longer getting lapdances, Vick and Stu just sit, staring at Chastity, entranced.  Whoa, whoa, I'm smelling the roses--  That was...a little fun.  Whatever we did, we're so sorry!  Nothing?  Oh my god--  Officers, I swear, we have no memory of that ever occurring--  We have a very important wedding--!  You do?!  Oh, thank you, Officers!  Did you have to be such a dick?!  Yeah, four hours later! If we'd just cooperated with them--  What are we gonna do now? We've got zero leads on where Doug is!     I said I knew I shouldn't have come this weekend, Vick!  Yeah, that's right. I only came because Doug insisted.  I don't -- I just think I'm better than you, Vick! And trust me, it's not that hard! You haven't changed one bit since high school! Jesus, you're 28 years old and you still talk back to cops?! Really?!  And you're still the one getting us in trouble! Only then it was hiding your weed in our locker, and now you've got us partying with wanted felons! It's not cute anymore, man! We're too old for this!  And all your stupid get-rich-quick schemes?! Girl-nasium?! Custard?! In Los Angeles?! Are you joking?!  When's the last time you had a real job, man?! When's the last time you had a girlfriend?! Hell, when's the last time you picked up the check?!  Those \"things,\" Vick, are what grown men do!  Stu...? Is that true?  I've...always...hated you...  Hey -- how'd you start Vick's car?  And Vick's daddy taught him how to get really drunk at his kid's soccer games and then piss himself.  Don't answer it.                 Answer it.  What if it's Doug?  We have tell her we lost Doug.  No, just tell her the truth! Honesty is always the best policy!  Why do I have to be the one that fell over drunk?!  Perfect. We just told Tracy we'd have Doug home in 13 hours, and we still have no idea where he is...  It's like a map of last night!  Nice clue, Stuey! I can't believe we're actually gonna pull this off!  Lots of people have hats like that.  The Golden Pony. That's us.  Then why is your underwear nailed to the wall?    Stay very close to me.  Some of my best friends are gay.  Not...not really? I live in Connecticut, man, we don't even have black people yet.  I don't know! I don't know why I insisted!  So what did happen last night?  Really? Doug did?  And our Doug was with us?  Wait, so we left with Doug at 4:45, we got back to the hotel at 5:00, and Doug was gone by 5:30 when Chastity met back up with us?  After all this?! He's in the room?!  That was cool of Roger to give you all the tapes of your performance.    This has officially been the craziest weekend of my life. Thanks for all your help. You were awesome.  I'm sorry about all this, Chastity.  Beg pardon?  Okay, well, I'm sorry, Jennifer.  Where you from?  Oh yeah?  You fly out every week?  Kid?  No kids. Same girlfriend for 14 years. Becky.    Becky is great.  She has low blood sugar.  Jesus, guys! This is the girl I'm going to marry! If, you know...she forgives me for cheating on her...  Of course I'm going to tell her! I could never keep something like that from her.  Well, then that's just the price I'm going to have to pay.  Listen, Mr. Lang, whatever we did last night, we are incredibly sorry-  What's going on, Vick?  Jesus, Vick...  M-M-Mr. Lang?  H-How much does Vick owe?  200 thousand dollars?!  How the hell could you blow that kind of money?!  Jesus, Stu, wake up! There is no custard store! Vick was just trying to rip us off to pay back Jimmy Lang!  Look, I'm glad we're all sharing, but we've got three hours to come up with 200 grand, or else...  I'd offer to take a loan out, but it's 3 o'clock in the morning, I'm pretty sure my bank is closed.  So that just leaves 180 grand...  The guys erupt in CHEERS around him, YAAA! The dealer slides over a large pile of CHIPS.  looking lost. Then they take their large stack of chips and quietly leave. No one knows how to play Pai Gow poker.  Just over 100 grand.  It's not red...  It's green.  No...It might get a little dangerous. I wouldn't want...  Thanks for all your help.  Yeah, probably not...  Yep, just driving out to the middle of desert to meet some mobsters, what could possibly go wrong...?  I think we should tell Mr. Lang that we couldn't get the money, but that, if he's amenable, we could create a payment calendar--  Yes, good! What an airtight plan--!  This is the dumbest plan ever.  I can't believe this is how we're going to die...  Jesus, what'd they do to him?  Oh my God: it's the other Doug! Roger's friend, the cake designer!  Oh my God Oh my God Oh my God...  I'm being shot at! I'm being shot at!  Oh my god, is he okay?!  Yeah, I was just thinking that!  Now can we call Tracy?  Who wants to make the call?  What?! No! I beat you by a mile!  Well, I'll be damned...  Tracy, it's Alan! Hey, Vick is just joking around! We've got Doug right here!  I know, Vick is such a prick! We'll see you at the wedding! Bye!  I know where Doug is!  Remember when we saw Doug's bed impaled on the griffin thing?!  No: the windows don't open, remember?!  And that's why we've been seeing Doug's clothes all over Vegas! He was trying to signal someone!  And it totally jives with the timeline, right?! We brought Doug back to the hotel at 5:00, he was passed out...  The Patron, man! It reminded me of our first drink of the night!  After Doug passed out, we must've taken him up there in his bed as a prank, so he'd wake up on the roof or whatever? Then we forgot him.  Only one way to find out...      No flights to LA with empty seats!  Totally understandable, man. Whenever you're ready...  stride inside! Their tuxes are wrinkled, their hair is a mess, and the groom is bright pink -- but they're here.  I never had a doubt.  Yeah. Like a decade or two--  I-I'm so sorry, I can explain--  Jennifer?  She's my wife.  We don't make each other happy anymore, Beck. And we can keep not making each other happy for another 14 years -- hell, maybe even another 50 years -- but let's not. Let's find people who make our hearts race. Let's be excited and fun and alive again...  I'm sorry, Beck. I really am. Can I buy you a free drink?  Let's start with dinner, and see where it goes...?  standing on the cliffs overlooking the Pacific, drinks in hand, as the wedding reception rages on behind them.  Damn straight you will!  We really are sorry, man.  To Doug and Tracy.",
        "Sid": "on top of his dirty clothing, fruitlessly trying to create the appearance of a bag full of money. He's using some $20 bills, but also some $5's and $1's.",
        "Mike": "",
        "Tyson": "",
        "Doug": "No, dude, show `em.    Hey so Alan, are you and Becky still together?  She still pressuring you to get married?     What is it?  Yeah, man, count me in.     Yeah. I thought I'd be nervous, but I'm actually just really psyched.  Oh yeah.  Enh, I think he wanted more for his girl. I mean, I'm a teacher who makes 45 grand a year, and he's a titan of industry who makes 45 grand a day, you know? I sort of get it... Also, I'm banging his daughter. I'm not sure you ever get past that.  You got floss?  Holy Christ!  It's Alan's. For Becky.  Well: now we have two things to celebrate!  Yeah, what happened, Stuey?! You used to be able to drink us all under the table!  What? No!    Little toast: to Tracy, the coolest, kindest, most beautiful woman I've ever met. I can't believe she let me come this weekend -- much less agreed to spend the rest of her life with me. I think both will prove to be massive errors of judgement on her part.  And to being here, with my best friends in the world. There's nowhere else I'd rather be.  That said, let's not get too stupid tonight, okay? I'm getting married in 36 hours. No, no. / We'll be good. / Totally, dude.  I'm serious, dudes! Nothing above the neck -- no piercings, no weird haircuts, no facial tattoos. I gotta look decent on Sunday.  Vick: you shaved Alan's eyebrows off the night before graduation!  Well then...to a night we'll never forget.  Two GAY MEN in identical tank tops pass by, holding hands.     Alan waves at them, shut the hell up! But Becky has heard.  It's some black dude. Vick, Stu, and Alan look confused.    He sees what's going down, and, his hands tied behind his back, takes off sprinting towards Vegas!      And he looks furious. The guys run to him, overjoyed!    Don't...even...talk to me.  stride inside! Their tuxes are wrinkled, their hair is a mess, and the groom is bright pink -- but they're here.  It's a long story. All I can say is I'm so sorry. And I promise, for as long as we're married, I will never ever put you through something like this again. Can... Can you forgive me?  at the reception. The entire wedding party is applauding.  To me and Tracy -- and to being here, with my three former best friends in the world...  There's nowhere else I'd rather be right now.  That said, let's not get too stupid tonight, okay? I'm going on my honeymoon in 24 hours...",
        "Jade": "",
        "Officer": "Where were you last night at 3am?  Okay, how about at 2am?  You think this is cute, son?! You think this is a game?!  What do you know about Jimmy Lang?  Jimmy Lang runs the infamous Shiang- Xi crime organization, and is wanted in seven states for money laundering, drug smuggling, racketeering and murder.  Is that right?  Okay. Maybe a night in jail will jostle something loose.  You actually expect me to believe that dung?  If I find out you're lying to me, son, I will take all of you down, is that clear?  You boys wouldn't last three hours in prison.  Get outta here.  If you know what's good for you, you'll get the hell out of Vegas.",
        "Garden": "",
        "Eddie": "",
        "Franklin": "",
        "Melissa": "",
        "Tracy": "No, but I'm sure he's--  Hello?  Hey Vick!    Stu, it's Tracy!  Oh, nothing, just here with my family...  Yeah...? Hey, you wouldn't happen to know where Doug is, would you? He said he'd be home by 5 for this dinner, and now it's almost 9:00. I tried his cell, but he didn't answer...       Oh God, is Alan all right?  Can I talk to Doug?  Where is he?  They've done something stupid.    Dad, I don't want to hear it. I trust Doug absolutely.  Any word from Doug?  I'm sure everything's fine. They're all smart, capable adults...  No, but I'm sure he's--  Hello?  Hey Vick!       walking down the aisle, arm-in-arm, as Mozart plays. Tracy looks tentative. Her father frowns, not at all happy...  reaches the altar, then turns to her dad. His face is a mess of emotions. They hug.  I love you, Daddy.  Where were you? And why are you pink?  at the reception. The entire wedding party is applauding.",
        "Stu": "Dude this is already the best weekend ever!  Oh, did I show you pictures of my kids?!  Haylee is two, and Kaitlin is already four! Can you believe it?!  Jesus, dude, those are my children--  Yeah, you're good.  Maybe you could wear a helmet to Doug's wedding.  Me too, man! I love pudding!  Dude! I can't believe I get to party all night, and then, tomorrow ...I get to sleep in! It's almost too much! And FYI, if anyone gets really drunk and craps themself, just let me know, I can have you cleaned up and partying again in under three minutes. No joke. I am a master of stool removal...  This is bigger than my house.  Anyone got any nipple lube--? Jesus would you look at the size of that thing?!  Jesus, who made this thing? Diddy?  Dude, it's for Becky! Alan's finally going to propose!  Thish is so great! I love you guys!  Dude, I'm a dad! I don't have time to get plastered anymore! It blows! Am I a bad dad for saying that?  Because my dad was a bad dad.  Have I showed you guys pictures of my kids yet--?  Oh yeah! That was hilarious! And remember when I blacked out at Homecoming and you wrote on my face with permanent marker?! That was awesome! What'd you write again? \"Respect me!\"  Ahh, good times, man. Good times...  Yeah, we've totally grown up since then.  Yo.  What?  Dude...I have a mullet.  Whoa, did you sleep in the tub?  Check it out: Alan slept in the tub.  Yeah, and it might be time for some manscaping, bro. Your bush looks like Yanni.  Dude, why is my ass killing me...?  This might be the worst hangover anyone has ever had, ever.  Yes: I left my hat in the room -- thank you, Alan.  Yeah. He's not here.  Good morning, this is Stu?    This is Doug's phone.  Yeah, and we told Tracy we'd have Doug back to LA by five.  No, no. It's cool, I'm a dad. It's totally cool...    Hey guys. DOUG! DOUG--!  You find Doug?  Maybe he went for a jog?  Or shopping?  Okay, honestly? I don't even remember going to dinner.  Was Doug still with us?  Hey! Look, we were at the Flamingo.  We drove last night?    Yeah, I'm with Alan on this one.    You don't have to look up my butt, just at it. Something is terribly, terribly wrong...  I-I-I don't know?! What do you think it means?!  Really?! What?!  Oh my God, guys: what if I'm gay?!    And once, I caught myself gazing at a topless photo of David Beckham!  And then I had those weird feelings for Vick that time in middle school, remember?!  Yeah, that weekend we were all camping -- I told you this.  I didn't?  Yeah. I had weird feelings for you that weekend. Like really hot, really gay feelings. But then they went away.  Wait, what?  Wait -- so have either of you tested the waters?  How am I going to tell my wife?  Jesus, what kind of father am I?      What's the big--? Oh! OH! OH!  Maybe it's not a wedding ring?  This is worse than my underwear!  Check it out, some idiot threw his bed out the window last night.  Really?      You okay, Vick?  Naaah.  Jesus, she is stacked.    No way! Awesome!    I want a shield!    Hey, how's Becky doing, man?!  Look on the bright side, Alan. Vick found a great clue.  That's another hour of last night that we can account for. Isn't that great?  Great -- where was the feast?  I ain't mad atcha, dude...  Guys, come on, let's not use our angry words--  Who are these guys?!  Maybe they just wanted to talk!  Oh my god I am such a bad dad!  Yeah, Vick, what's going on?  If anything ever happened to my family, Vick...  Come on, let's toss the place.  Hey, check it out, Vick! I invested 30 grand in your custard store last night!  Hey, you wanna come in here a sec?!  You think she's what those Guamian dudes wanted?  Wake her up, man!  She seems really cool.  Yeah, are you Chastity Mervish now--?  They don't open.  Dude, I think your wife's mad at you.  Work friends?  Dude.  Don't be so hard on yourself, dude--  and downing them. PULL BACK to see that they are sitting in    I think I know why he married her.  Is it weird that we're sitting this close watching?  I really shouldn't be here. I have daughters.  How can she do that without dislocating her hip?  Did she just do that in heels?!  Did you see them trample those tiny Japanese businessmen?! I think they killed like four of them!     Honestly, man, I will confess to anything you want!  Who is he?  Did we kill someone last night--?!  We're in a lot of trouble, aren't we.  Oh no, sir, please don't!  It was really nice meeting you--!  Why hasn't he called? It's 8:30.  Do you think he's okay--?  I mean, we were hanging out with mobsters last night, man! They kill people for looking at `em weird--!  Or what if we like drove Doug out to the desert and left him, just as like a funny prank--?!  Okay, let's all take a breath--  Look, we're all tired and hungry--  Wait, what--?  Hey, no! Time out! We all need a time out--!  Good call on happy hour, Chastity. These tacos kick ass.  Guys, come on! For Doug?  \"Number blocked.\"    It's Tracy!  Why is she calling me?!  Hey, Trace! W-What's going on?  Wow, that sounds amazing!  Ummmm........Hang on. She wants to know where Doug is!    Yeah, um, hang on. She still wants to know!  Listen, Tracy, Alan fell on a  H-He was drunk. And the doctor -- a different doctor, not the one he fell on -- he said we couldn't move him until the wedding--  But we're going to have the wedding at your home--  Oh my God, guys! Look!  Where do you want to start?!  Hey: is that guy wearing Doug's hat?!  The first bar written on it is \"GhostBar.\"  All right, this is the last place we went, \"Chaps.\"  You sure we came here...?  Maybe I'll just wait in the car--  Yeah, I don't think we came here...  Those could be anybody's. Thousands of people go to Colorado State--    R-Roger?    Is that true?    Did we...you know...do anything?  Was I...the boy or the girl?  I'm really not sure we can be friends anymore...  No! That's cool, I don't need to see it--  I'm a Dad, I-I don't get to the gym as much as I'd like...  Annnnd that would explain the searing ass pain.  That doesn't make any sense.  He was passed out, how far could he have gone--?  They're sure it's him?!  Oh thank God he's okay...  I know, if I actually was gay, I'd totally date Roger first. What a gentle soul.  We like you way better.  Chastity tries to stymie her laugh.  Becky collects teapots.  She has low fun sugar.  Uh-oh.  Not good.  How could you do this to us, man? We're your best friends...  Oh my God...  Was it for the custard store?  Is that true, Vick?  Were any of your deals...real?  Dude, I manage an Applebee's, that money meant something to me...  Come on, Vick--  Come on, man, we've been bro's since third grade, it's gonna take a lot more than money to ruin our friendship.  What I don't understand is why you didn't just ask me for the money. I would've given you every last cent I had, man...  I love you, man.  Also, I banged your sister sophomore year.  Sorry. Just seemed like a good time to tell you.  She had just broken up with that guy from Central, we were playing \"I Never\" at Tim Donahee's pool, one thing lead to another--  I think I can get a 20 grand cash advance on my credit card...  The guys jump up, slapping ten, YELLING! Stu points at a table full of OLD LADIES nearby: in your face!  looking lost. Then they take their large stack of chips and quietly leave. No one knows how to play Pai Gow poker.  Time check!  Chip check!  Faster! Come on chip check!  I stopped counting at six! I can hear my heart beating in my head!  You sure we don't want red?! What if the ball lands on red--!  I can't watch! My   heart's gonna explode! Can your   heart even explode?! Because   I think my heart is gonna explode!   I can't watch!  It's red, isn't it?! I knew it! Tell me it's not red!  So what's our plan?  Here they come.  Yeah?    The gun flies free and they wrestle for it! Dust flies!  I can't believe you just saved my life!  He's gonna be really upset!  That was you!  Vick, who won?!  Yeah, we threw it out the window.  I don't get it.  I-I still don't get it--  Not...to me...so much?    You think he's still up there?!  Oh my god, I'm so glad you're okay!  Yeah, you have every right to be upset! We validate your anger!  Well, we can't drive! It's 350 miles to LA and the wedding starts at 10, which is in--    You gotta admit, it's a pretty funny prank... I mean, up until the part when we forgot all about you.  He's still not talking to us.  stride inside! Their tuxes are wrinkled, their hair is a mess, and the groom is bright pink -- but they're here.  You think Doug's ever going to talk to us again?  Uh-oh.  as he hurries off through the crowd. After a moment, he  Oh, I missed you guys so much!  standing on the cliffs overlooking the Pacific, drinks in hand, as the wedding reception rages on behind them.  We'll tell you the whole story when you get back from your honeymoon.  To Doug and Tracy.",
        "Chow": "",
        "Leonard": "",
        "Phil": "",
        "Black": "The guys erupt in CHEERS around him, YAAA! The dealer slides over a large pile of CHIPS.  at a roulette table. The guys sweat, tense. Stu is insane.    He sees what's going down, and, his hands tied behind his back, takes off sprinting towards Vegas!"
    },
    "imdb_rating": "7.7",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNGQwZjg5YmYtY2VkNC00NzliLTljYTctNzI5NmU3MjE2ODQzXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Angelenos Doug Billings and Tracy Garner are about to get married. Two days before the wedding, the four men in the wedding party - Doug, Doug's two best buddies Phil Wenneck and Stu Price, and Tracy's brother Alan Garner - hop into Tracy's father's beloved Mercedes convertible for a 24-hour stag party to Las Vegas. Phil, a married high school teacher, has the same maturity level as his students when he's with his pals. Stu, a dentist, is worried about everything, especially what his controlling girlfriend Melissa thinks. Because she disapproves of traditional male bonding rituals, Stu has to lie to her about the stag, he telling her that they are going on a wine tasting tour in the Napa Valley. Regardless, he intends on eventually marrying her, against the advice and wishes of his friends. And Alan seems to be unaware of what are considered the social graces of the western world. The morning after their arrival in Las Vegas, they awaken in their hotel suite each with the worst hangover. None remembers what happened in the past twelve or so hours. The suite is in shambles. And certain things are in the suite that shouldn't be, and certain things that should be in the suite are missing. Probably the most important in the latter category is Doug. As Phil, Stu and Alan try to find Doug using only what little pieces of information they have at hand, they go on a journey of discovery of how certain things got into the suite and what happened to the missing items. However they are on a race for time as if they can't find Doug in the next few hours, they are going to have to explain to Tracy why they are not yet back in Los Angeles. And even worse, they may not find Doug at all before the wedding.—Huggo",
    "name": "The Hangover",
    "genres": [
        "Comedy"
    ]
}