{
    "filename": "Losers,-The_script.txt",
    "imdb_id": "tt0480255",
    "imdb_url": "https://www.imdb.com/title/tt0480255",
    "characters": [
        "Vikram",
        "Roque",
        "Jolene",
        "Cougar (as Oscar Jaenada)",
        "Aisha (as Zoë Saldana)",
        "Jensen",
        "Pooch",
        "Max",
        "Fadhil",
        "Wade",
        "Clay",
        "Goliath Guard"
    ],
    "dialogues": {
        "Vikram": "",
        "Roque": "It's Liar's Poker, Jensen, how in the hell is the man gonna cheat you at Liar's Poker?  Cards.  Your mama had that feeling too. 3.  Raise you.  Yup.  Exactly how many knives do you have, anyway?    For that we had to put on a blindfold and turn around three times?  I got eyes on Fadhil.  Maintain position? Colonel-  Then contact the plane directly-  Five against a fortress, and we've got maybe six minutes before an airstrike sets the world on fire.  So, I'll drive.    What kind of blast radius we looking at?   Relax, Pooch, we're not going to be court-martialed - if anything, we're going to die of thirst wandering the desert, right Colonel?    Ah, shit...  Shut up.  Shut up...    You placed the bet.  Well, that was stupid of me, wasn't it?  That makes, what, three in a row?  You know where you're messing up? You're putting all our money on the dogs with the best odds.  Never play a longshot, you're never gonna win.  We're at a dogtrack at 10 a.m. - could this get any more sleazy?  You're not drinking?  Then what?  I can't take much more of this.  I'm serious. Grinding out lunch money on five dollar sports bets, wincing everytime some overly Aqua- netted cow stares at my face for more than two seconds- I'm at the point where I'm thinking we ought to try to reach out to the Company...  Due respect, you're nobody's Colonel anymore.  Like the others? Least I still talk to them. You pushed them away. \"Max this, Max that\" - we never even saw the guy, Clay-      No, it's a stellar plan - we can use this as our base of ops! (gestures to the  I was there too. I remember. But he won. We lost. Maybe it's time for a new game. 23.  So this is what your girl came up with, huh? 34.  You sure you're thinking clear on this?  I know you. When you slip, it's always cause of a woman.    Carla's husband wasn't the one who  What about Emma?  Because she put a bomb in your car.  And now this chick, first time you meet her, burns down our hotel. Also, she kills people for a living. These are not good signs...  You better be. Or we're done.  How long you been back there?      For now.  Country turned her back on us, and God can screw. This one's for us.  What about their ride?  Shut up, Jensen.  Stop talking or I'll break your neck for real.  Which brings us to our next question...  What's your angle in this?  I'm gonna shoot her, Clay.  Yes, I am.  Right now.  She's coming with us. And if anything feels like a set-up, I put a bullet in her skull. Sound fair? 49.  You're Muslim?  I don't like this.  What if it doesn't? What if we never get face to face with him. Are you gonna be able to live with that? Ever?  Great. The super evil bad guy is in bed with the world's largest oil company. That's just fabulous.   What?  Did you know?      This is conspiracy theory bullshit-  And do what - go after this non- existent hard drive?  That's your plan?  Why risk our lives again when we already have something to trade?  I want to at least discuss it before signing up for another suicide mission on the say-so of some flunky-  So you want to take down Goliath now? Then who? McDonald's? American Airlines? Microsoft?  I want my life back! This is supposed to be us getting clear - not saving the world!    We're not the goddamn good guys anymore! I love you guys, but I had a life before this shit, and I sure as hell am not going to risk getting it back because you came down with a case of the Dudley Damn Do-Rights! 65.  I will raise whatever the hell I want - you got a death wish because you got beat by a voice on a radio-  I'm gonna cut your head off...  She doesn't get a vote-  Well, that's just great.  Sorry I threatened to cut your head off.    What are we up against?  Thought you guys'd be back at the hotel.  Me neither. Grabbed a coffee from the machine - you want one?  Life insurance?  What's the biggest payout? 85.  Pretty much what we're gonna be risking. What are you doing up?  The hell you need a satellite for?  Military neighborhood...    I hear you, man.   Uh-uh. No way.  Shit, she's got back-up!  Go, go, go!  Here they come... 90.  Pooch...  So we just run again?  There's something we can do.  Three years is enough. If there's a drive at that port that we can use to get clear-  So figure out a way around them; you're good at that shit, Clay!  We run now, we're gonna be running forever. This is our one chance to get our lives back... To steal them back. And I'm prepared to do anything to any one to make that happen.  Never play a longshot, you're never gonna win.  Last thing they'll expect...  I'm ready.  Open the door before we kill you.  You can't settle for stealing the drive, you gotta blow up Goliath's shit too.  Clay.  I think you should see this.  No. Not Aisha.  You know, for a revenge driven conspiracy nut, you're pretty fucking gullible...  After the truck. I got tired of waiting for you to save us, so I up and saved myself. Reached out like I said and cut a deal - I set this up, I go free.  You gave me no choice. It was always gonna end like this, Clay. Us captured or dead. It was always a dead end. You made sure of it.  Not bullshit. You were gonna keep planning missions and ways to hit Max until it got us all killed.  Yes, Clay. Yes. Only difference with this situation is at least I get to walk away.  Don't you get it yet? There is no drive. There never was...  Fennel made it up to save himself. When I told Wade, he planted the info at Goliath to lead you here.  You really thought there was a happy ending coming? Pooch was gonna get his family back, we were gonna get to be soldiers again?  We lost the moment we went off mission. This is just the logical conclusion of that playing out. You didn't want to hear it. 103.  You just wanted your revenge. Your face-to-face with the big bad wolf. I'm sorry, buddy, but it's the way of the world...  Guys like us don't beat guys like him.  Wait.  I'm sorry it had to end this way.  Clay doesn't take risks. It's why I'm here and he's not.  They were good guys.  Declan, start the plane...     Fine, just get us in the air!  I'm out!  Gotta admit, I always wondered how this would play out.  It's a distinct possibility...  You don't have a knife?  Bit of as longshot for you...  Now I really am gonna cut your head off...",
        "Jolene": "",
        "Jensen": "And get cheated again?  --the Pooch may refer to himself in the third person--  The Pooch can rest easy, I was referring to Cougar.  Got a feeling about this one, Roque.  This even me up?    I'm shocked. Shocked, I say.  Dropkick, this is Pinball, confirmed eyes on, target is designated.  Roger, we'll break out the earplugs.  So who wants to get a game? We got eight minutes-      Can't, they're jamming us-   Negative, we're screwed! There's nothing we can do... 8.  I think we're in the clear-  Yeah, that was great, wasn't it? My favorite part was when we were completely on fire. What was yours?    Guys... This is bad...  I'm not good with bombs, man-  Oh, shit. Oh, shit...  It's a remote detonator--enough for them to get clear, maybe ten  I told you, I'm not good with bombs! How are those bars coming?  Hail, hail, the gang's all here! Colonel. Roque. Pooch. Silent Bob. Hottie. I'm gonna need a moment alone with the boys if you don't mind, but I'd like to reserve the right to awkwardly hit on you later?  Besides a pants-busting crush? Her intel checks out. The cargo will be arriving here in two days.  Grew up in Afghanistan, Mom was a local, Dad was white devil... oh, and CIA's got a kill order out on her. 37.  As does Hamas, Sien Fein, MOSAAD-- pretty much everyone with the exception of PETA wants this chick amscrayed.  Last CIA email flagged with her name says she was digging for information about a special project...  \"Codename: MAX\".   -have been planted for us to find?  CIA timestamp, digital watermark... Someone would've had to go to a lot of trouble, and I mean a lot, to fool me.  Hell yeah. Cougs?  Hot damn! Back with the Colonel, doing another bid for God and  Start where?   Roger that Cav 415, we have a report of a civilian vehicle breakdown on U.S. 70, sector nine, grid four. Please assist as required.  Base One, this is Cavalier 415! We have been in a collision with a civilian vehicle! Carvey's dead an' Freeman's hurt bad! He's messed up his neck! He can't move! Oh god, it's horrible! We need medevac immediate! HE'S GOT KIDS, BASE  Robert De Niro who?  Classic loss of identity. Clay defined himself by his place in the military structure. 44.  It was his way of measuring the good he did in the world. Without it, he's just another loser like the rest of us.  You know there's a website where you can download MP3's of donkeys farting? How cool is that?  Lot of work to bum a ride.  You shut up, Roque. You're dead, I'm the spinal injury - Spinal injury can talk, dead can't.  Seriously, you have to get more into your role! Dead guy! No talking! Dead guy! 45.  Y-you ever treat anyone who'd been gut shot...  Means you know what's coming to you if try to play hero. Now, lose the radio mic, Bones.  We're all set here. Ready to take a giant step for... well, for guys who steal stuff, I guess.  Beautiful. Let 'em chase that.  So, you grew up in the Hindu Kush, huh? That must've been rough.  Got any hobbies?  I'm gonna go somewhere else now.  Like Belushi. Target is westbound. Heading for the bridge...  Goliath the oil company?  Nah, I can bypass no problem.  Voila! Ten million dollars of horse, comin' up!  Huh?    Okay. Okay. Nukes. That's a nuke. Who makes nukes? Department of Defense. DOD Mainframe. I gotta hack the      Hold position!  Almost... Almost... Shit!  Computer crashed!  Yes, cause this is the time for  60.  I told you, I'm not good at bombs!  Opening it without the code must have triggered the timer...    Yeah, what would an oil company want with the Middle East?  Come on, dude, they'd be morons to keep records of shit like this-  Goliath. Cougs?  Don'tcha hate it when Mom and Dad fight?      Yo! Package for Henderson! 76.  No can do, chica, gotta put it in his hands. He's gotta sign.  Babydoll, I'm on the clock here!        Richard Hertz from Internal Security.  Ladies... hi.  Liking the angle of the dangle?   Good afternoon, Mr. Henderson, Richard Hertz from Internal Security. If you'd be kind enough to make your way down to the lobby?  It's a matter of a somewhat sensitive nature involving an 78.  individual exposing himself to women in the elevators--best discussed in person. If you'd just head on down...  Hi, I'm Skippy from tech support. Is Henderson around? I'm supposed to install a firewall on his system-  Oooooh - no can do. Upstairs breathing down my neck. They want security upgraded for the senior managers all of a sudden.  Five minutes and I'll be out of your hair!  According to this, the drive exists, Clay.  Abso-tootly.  No, somewhere off-site. It's gotta be a remote location, stand-alone. I'm checking their security logs-- wherever they've detailed the most guys is probably where it'll be...    Whoa! Take it easy. You're the-  Get me out of here, Clay... 80.  I'm warning you, man, I'm a lethal weapon...  It was this secret government project. They did stuff to me. Spooky stuff. Anal stuff. Turned me into a dangerous Telekinetic.  As the old saying goes - you don't start none... there won't be none.  Bang.  Boom.  Face down, or I'll make your hearts stop beating with my mind.  Thanks, Coug...     Everything on Goliath - security, personnel history, the works.  Port of New York, baby. Total stand alone facility, and they're spending 30K a day on onsite security - you don't drop that kinda green to just guard oil. 83.  Let me check, I--oh, shit...  They've hired Par-Sec.  Paradigm Security Services. Ex- Special Forces.  Our drive is being guarded by military trained, trigger repressed, blood thirsty, stone cold killers... Am I the only one who's thinking maybe we just chill out and go to Six Flags? 84.  You won't believe how detailed these files are. Every Goliath executive they've ever insured, their policies, their payouts-  Yeah.      We're going to need to drive fast...  You think she's gonna kill him?  Yeah, I think so too...  Freeze! 88.  She's his daughter, Clay! The guy in the basement's daughter and she's got a gun and it's pointed...  ...at my dick! Her gun is pointed at my dick!  I know it makes no sense, but actually yes. Aisha watches them. CLOSE ON THEIR EYES. Nobody moves.  My dick remains unshot!  I think Cougar's got a plan! Coug, do you have a plan?  He's got a plan!  Hey, fallen comrade here! Blood flowing out of his body... Precious, precious blood...  What's that for?  Yeah, cause gettin' shot is awesome, I'm totally up for doing it again...  And the crowd goes wild...  What's the password?  Drive should be in the Computer Room, two skylights over.  I'm above the computer room, maybe thirty seconds from the drive...  Shouldn't have gone after the hat... 106.  Can you stand?  Oh, so we're Mr. Grumpy now? You're not the only one who's been shot recently, you know!  Clay?  There was no drive, Clay- 107.  There was no drive and Roque's gone and Par-Sec's regrouping and Pooch could bleed out-  Okay, excellent, very tribal--We need to go.  Sounds less painful that way...  Me and legless Pooch are on it! Where the hell is she going?  What, it's a cool name! It makes you sound like a pirate!  Fine, let's go kill Wade...  Yoo-hoo! Wade!  Come out and plaaaayyy-    I think I just found our way out of here...  Not to rain on everyone's we killed all the bad guys parade, but we should probably get gone - legless Pooch has a Learjet all gassed up for us in the Hangar.  It's a cool name-",
        "Pooch": "The Pooch don't cheat. The Pooch may lie, the Pooch may steal-- 2.  --but the Pooch will not cheat.    Oh, shit, I'm definitely in then.  Cougar - your bet.    You'd rather take on fifty mujas with AK's?  Call me Michelangelo.  I guess we're going with the fifty mujas with AK's option after all!  Jesus, you stop for coffee in there?  Uh, Coug?  Exfil incoming. How are we gonna explain the kids, Colonel?  Colonel?  The kids. What do we tell 'em? 13.  Cute little buggers. Hope they can make it to our court-martial. 14.  So, how we getting back? Hitchhike? Magic carpet? I say magic carpet...  Auto-rotate, go with it, you can still put her down if you-  Wade left his suitcase. 17.  Hurry... 18.  Hurry...  Damn. We missed you too.  So what's this I hear about Clay gettin' us killed over a girl?  Jesus, Lady! Ten outta ten for stealth and shit, but next time could you just knock?  Why?  They want to wet her cause she's lookin' into Max. That sounds familiar...  I'm in.    Appreciate it.  Sleeping like babies.  What do you think's up with that \"don't call me Colonel\" stuff?  You heard of car-jacked? You've just been chopper-jacked, my man. 46.  When he says it out loud, it does sound kinda ridiculous...  Time to move. 47.  ...no, what you want is a gas turbine generator running a force- fed rectifier unit, hook it up to the fuel tank...  It's taken care of - we lined the hull with half inch steel plate. 48.  I'm with Roque, man. Agency thinks we're dead. We show up alive and kickin', start waving our dicks around in public, they're gonna make it their business to bury us. They'll call us terrorists, all  Hell, let's just say it out loud... We do this, we're declaring war on the Central Intelligence Agency. 50.  You want me to go ask Fennel the combination?  Is that...?  Is that...?  What if that sets it off?  I got wires - red, blue, green, white, yellow-  There's also pink-  Are you kidding me?  Okay, someone pick a color!  You think?  What was the target?   I say we hit Goliath. Jensen?    So what do we do about the nuke? Did I just actually say that?  We're not going anywhere until you two squash this shit.  Good. Roque?  Roque? 75.  Verrrry good. Now don't you two feel better?  I don't give a shit, I do.  Now, let's go watch Jensen single- handedly knock over the largest oil company on the planet...  Basically guys like Cougar but without the warm and cuddly side.  Couldn't sleep.  No thanks.  Jensen hacked a satellite for me earlier.  When we first went over in 2001, Jolene and my oldest Tina wanted to do the yellow ribbon thing, right? Only problem was there was no yellow ribbon to be found - all the stores had been cleaned out.  No doubt. And Tina's four at the time, and what she can't understand is why the ribbon's gotta be yellow. So Jolene sings her the song, right? To show her where the idea comes from. And when she's all done, Tina, four years old, looks my wife dead in her eye and says \"that's the dumbest song I ever heard.\" So my wife and my four year old ended up tying a frilly purple ribbon round the old oak tree in our yard to bring Daddy home... 86.  Yeah...  Jolene dated a guy last summer. Didn't turn into anything and I sure as hell can't blame her, but that man was in my house, Roque. I know you're not a hundred percent on this op, but if it can get me back to them...   Uh-uh. No way.  Think that got her?   Stop yelling at the sniper!  She burned us, Clay.  The whole op is compromised-  So we split up again. Right?  Right? 94.    48 hours, but Aisha knows that-  Twelve hours from now? You mean-- you want us to go in blind?  Yeah, cause it's dumb.  Last time we went in blind on an op, we lost everything...  So let's go get it back.  The Pooch is good.  Guys, we got a problem...  Wade's here.  No. I say we roll.  Wade's headed your way - last chance to get the duck out of Fodge... 100.  Jensen, you get it? Jensen?  Get on with it... 105.  I've been shot in both legs, what kind of dumbass question is that?  This is stupid question day, isn't it? It's stupid question day and someone forgot to tell me...  Way it always goes. 109.  Guess we should just head home. Oh, wait, that's right. We don't have homes.  Next time, remind me - car crash first, then get shot...  You call me legless Pooch again, you're gonna be Headless Jensen.",
        "Max": "Well, that was stupid.  Very stupid, Colonel... Franklin... Clay.  And you think I didn't know that? Not the sharpest of knives in the drawer, are you? We locked coordinates the moment you painted; delivery will occur on schedule. Max out.  Understood, Cobra One. Kill Bandit.  And again.  Tell me - is this a moral issue or a financial issue?    Okay, here's what I'm hearing. I'm hearing \"No.\" I'm hearing \"Leave,\" and I'm hearing \"I'm sorry.\" Is that what I'm hearing?  Right. Okay, so that is what I'm hearing. Now, I want you to listen. Listen carefully because I want you to hear this. Wade? 32.  What the hell was that?  A \"hit him in the face\" nod, not a \"throw him out the window\" nod.  At most--at most that was a \"break his fingers\" nod.  I mean Jesus, Wade, the man was scientific genius. Granted his weight signaled that he had certain impulse control issues, but that's no reason to throw his fat ass out a fifty story window.   I think I speak for everyone here when I say that your actions were excessive and, yes, more than just a little wasteful...  ...then again, it seemed to have had the desired effect - toss Short Round out next. 33.  The hell you say. I need one to test and one to use.  Of course one to test - you think I trust you?  You will have much money.  Call our people at Goliath, tell them we'll have a special package arriving on the 17th.  It used to be so simple. A post 9/11 world... 39.  As a country we spoke with one voice, moved with one purpose. We had a wicked boner for doing the right thing, and now look at us!  90 percent of the globe is tooling up to whack us and we're too busy losing our nerve to notice. It's Us versus Them and right now my money would be on them...  Wasn't it Thomas Jefferson who once said the tree of freedom must be watered with etcetera, etcetera? We need to wake people up, Wade. We need to hit them in the face, angry up the blood, give them their balls back.  We need to give them a ten megaton reality check.  Boom Boom Boom Boom... 40.  I think it's safe to say it works!  Jeez, talk about hard to impress...  Kinda... Sorta...  You know the drill, they don't like to know how the sausages get made. What do you care?  The money's coming from our Afghanistan operation. And what the Company doesn't know won't hurt them.  We're gonna saving our country, Wade. The United States of America will benefit greatly from what we're doing.  Jesus, fine - we're saving North America, does that make you happy? Just get it done.  Wonderful guy, salt of the earth, he'll be missed--who took my bomb, Wade?  Because I've been such a fan of how things have gone up till now?  Who the hell are these people?  I also had several African nations overthrown three years ago, I'm a  Shit.  Okay, they need to get dead. Get me a six man fire team ready in twelve hours. 68.  What's the plan? The plan is - get me a six man fire team ready in twelve hours.  Are we now clear on the plan or do you want to try a third go-around?  Because what I'm going to need you to do is get me a six man fire team ready in twelve hours. You get that, right?  And Wade?  We're gonna need a new bomb.  That's a lot of a paper routes...  Not even close.  Won't give it to us willingly... You get that six man team together like I asked?  Change of plans. Kill them.  Or fire them, whichever's easier.  Fine, fine, I'm not a detail guy. What I need- wait. Did you give them intel on Clay's people?  Aaaand we're back to killing them.  Touchy, touchy. Jeez, what are you related to them?  By blood?  It's not what we're doing, it's what Clay is going to do for us...    By your boys?       Why, Mr. Wade... methinks you have a secret. Okay. Put a fire team together.  So? 91.   We know exactly where they're going, Wade. Port of New York, for their big final awesome stand against the forces of evil where they die.  Jesus, always with the money! So impersonal! How are you? How have you been?  Can't complain. I'm thinking of getting satellite radio in my car...  Hey, I'm all about the bombs, baby.  Time to go make a withdrawal... 92.  I've got to go get your money.  God, are you short.  Get it done.  How much do you weigh? Seriously.  Where the hell is my bomb?  For a guy who's all about transcending materialism, you talk about money so much! 93.  Fine...  We good?  Who is this?  Where's Wade?  Clay.  Colonel, yes. Well done.  I understand you've always wanted to meet face to face. I'm sure that could be arranged...  Stretch. That's a good one.  Yeah, no, I get it...  You gentlemen consider yourselves to be soldiers or businessmen?",
        "Fadhil": "",
        "Wade": "\"Max\" is catch-all for exactly what you've been accused of. Terminology's been around since the 50's.  I believe you.  You gave me the nod.  I thought that's what you wanted.  Sorry...  The Company's with you on this?  I don't. Just want to make sure everyone gets paid.  Unless they're within the blast radius. 41.  I was born in Quebec.  Ten men ride with the package and another ten ride chase.  Let's go.  Form a defensive perimeter around the truck!  Masks on! Secure the package!  Cavalry's here!  Move! Point cover! Go, go!  That's gonna be a quick trial...  You're not gonna like it...  Colonel Clay and his unit. You had them killed three years ago?  The Jamal al-Fadhil situation?  Yeah.  So what's the plan?  Okay.   I get it.  No problem. 69.  I look at that entire incident as your standard \"getting to know\" each other business orientation.  Fair enough, Doc. Can we now move past the verbal aggression and get into some business?  That's going to be difficult.  He wants one billion in cash. 70.  Can we swing it?  The Company?  Yeah.  Kill them?  Honestly? Firing them.  Well, yeah.    Actually, one of them, yes.   A brother-in-law, I said I'd kill him, what are we doing?  And that is?  They're not \"my boys\". I don't like this. I say we grab Clay and kill the rest.  I can.  You're sure? You're not going to call me in two hours and have me kill them?  I'm on it...  They got away.  Hello, Clay. Been awhile. Roque.  Oh, we're not gonna kill you. Someone's gotta get away with the cash. Your crew? I'm definitely wasting them. But you?  You're about to steal a billion dollars from the Central Intelligence Agency.  It's for our replacement nuke. When a billion goes missing, people tend to ask who took it. Max really does love to frame you...  Take him away. Drop him in Newark. I'll see you at Turner Airfield. 104.  Your friends jack-rabbitted. Should we be worried?  You're sure?  Can I ask you something? Why'd you stick with those losers for so long?  No such thing. I'll go call Max. 110.",
        "Clay": "It's time...  Authenticate and backtrace.  We don't get to pick what needs to be done.  Quaeda-wannabe name of Fadhil is running a terrorist assembly line out around the Khyber Pass--  We find it, we paint it for a laser targeted bomb. No muss, no fuss.  Paint it.  Call it in.  Mission Controller is Agency, Codename Max, repeat, Codename Max, so get him on the horn and-  Cougar? 7.  Dropkick, this is Pinball, targeting equipment has suffered system failure, am calling an abort.  Who is this? This is a secure  Max? There are children on site-  Shit! Jensen, call the General at the Firebase, get him to abort-  There's something we can do.  So?  Pooch and Jensen, get a truck for the kids, the rest of us will be out in five-  -out in four. On me! 9.   Get 'em out.  You're American?    Max is rogue?  Fadhil.  I can get you out- 11.  Lieutenant, you're to evac these civvies to the Firebase immediately-  You really want to leave twenty three kids in the desert to die?  Then it's them.     He set up the Operation-  I talked to him! 16.  What?  What are you talking-  We didn't kill those kids, Wade.   Jensen?  I don't care--Roque, Pooch, get those bars off!  Time?   We lost again.  You gave me the money. 20.  Four.  Yeah, I've just gone crazy with that approach.  Maybe if we were drinking.  We'll stay two more days, try to get some of the cash back.  Miami. Jai-Alai.  We're on the run. It occasionally  All we did was say the word \"Max\" and they blew up a building. CIA even gets a whiff of where we're at, they'll call in an airstrike.  Until we figure out how we can take Max down and get clear, we lay low.  Anytime you want to move along you go right ahead- 22.  We heard his voice. Guy with a voice is a guy with a throat. And if he's got a throat...   Go.  Meaty.  Want a bite?  Why not?  Okay. 24.   I know you?  Do I not look relaxed?  No, I specifically requested the only hotel room in the world that doesn't have a bathroom.  Convention.  ...Air conditioners.  You'd be surprised.  You were about to tell me how much you enjoy spending time at the dog track...  Uh-huh...  You're not going to.  Noticed. What do you want?  You want to clarify that?  I'm listening.  How'd you find me?  How'd you know I was alive?  Who else knows?  So what's to stop me from putting a bullet in your head?  Max is up to something big, isn't he? Agency wouldn't have sent you otherwise. 28.  Okay.  Okay.  Right.  Is this a riddle?  What a brilliant plan, and oh, so simple too. What's the cargo?  Right. So you want me to steal some super secret cargo known only to you and the bad guy, and I'm supposed to do this because you know the name Max and look good in a pair of jeans? Sorry, sister. 29.  Bye...  How do I know I can trust you?  I mostly Google porn. Then?  Show-off. Then? 30.  We're not mercenaries.  Better than a ball pit...  Name one time that-  Carla wasn't the problem, Carla's husband was the problem-  Okay. Yes. She shot me. But only in the leg.  Emma doesn't count, we never slept together.  I admit, that took some of the romance out of the relationship. 35.  I'm clear, Roque.  She was volatile. Aisha, meet Pooch, Roque, and Cougar.  What do you have on her?  What else?  I say we go with her. Pooch?  Jensen? 38.  And anyone who calls me \"Colonel\" better be ready to take a beating or an order. We ain't soldiers anymore.  Sleep. We start tomorrow.  We're going bird hunting.  Go.  Make the call. 43.  Flip it.  All right, everyone get into character...  Here we go...  Where's my wild goose?  Hit it.  Roque...  No, you're not.  No.  See?  I picked up on that.  What do you think we are now?  Best case scenario, this gets us face to face with Max-  Are we wired?  Take em'. 52.  I don't think so.  Gasoline. Muzzle flash. Think about it.  Things'll kill you.  Good boys. Now, let's see what kind of cargo you got in there.  I'm already dead, remember?  Yeah. 58.  Yeah. Jensen, you're up.  The bomb.  Get better.  Then we die thirty seconds early - do it. 59.   Do you have time to reboot?  Fennel.  Elaborate.  Where?  So this hard drive - it contains evidence of what Max has been doing?  Can you get us this drive?  I say we hit Goliath headquarters.  We find out if it exists. If it does, we steal it and trade it for immunity.  You got a better one? 64.  Max gives us back our lives or we upload the data to the net, show the American people what's being done in their names.  You want to give it back to him?  It's not happening.  You don't want Max to pay?  Don't raise your voice at me-  Aisha?  You want your life back, you're gonna have to steal it. We hit them in two days.  I was just going over the plan.  You want to go over the plan?  Let's go over the plan...    Why do you want Max dead?  No.  Fine. It's hot. There's lots of sand. Your turn.  The guys got sick of it.  Of hearing about Max. Of hearing me say we had to do something when there wasn't anything to do. They wanted to be around their families. Jensen has a sister. Pooch has a wife and daughters.  Would you? The people you loved the most, would you put them in that kind of danger?  He's got me.  Enough hate to get us both through the day. He stuck with me when no one else would. And I ain't the easiest guy to stick with.  You think.  Why? 74.  And you think that's a weakness.  We're not in the jungle.  Pooch, we're on a schedule here-  Sorry I hit you.    You're sure?  Is it in the building?    Where's the drive being kept?  What's \"oh, shit\"?    Goliath must have brought them in after we hit their truck...  Comb that drive for every last scrap of info. We're on a plane for New York tomorrow...  Oh, hi.  You really want to know about Afghanistan?  Max's true target. Yeah.  He knew we were off mission. He knew Max wanted him dead...  Excuse me?  He begged to die--why are you asking me this?  Wait. 89.  She ain't that lucky. Jensen, status!  Somebody shoot something!    I know.      There's nothing else we can do...  Excuse me?  What part of \"he knows we're coming for it\" do you not get? They're gonna be waiting for us. Par-Sec is gonna waiting for us... 95.  Pooch, what's the minimum time to scout the patrols, get an accurate head count on-site at the Port?  So we hit them in twelve.  Jensen's already got the layout, and Cougar can spot on site. Right? 96.  Jensen?  Pooch?  So?     You ready?  Roque? 97.    Cougar, squelch if you're in position.  Jensen, we're coming. You ready? 98.  Roque and I will set the charges here but we won't detonate until you have the drive.  What can I say, I hold a grudge. Get gone.  Be ready to move the second Cougar hits the fire alarm... 99.  Are you kidding me?  Something's not right. Something...  What?  You think... Aisha?  When...?  Traitor... 102.    No...  We all could have walked... used the drive...  Kill me now... Maybe you live through this.  You're going to die very badly.   Roque.  Kind of in the middle of something here, Jensen-    Can you stand?  Let's go.  They won. We lost. Way it goes.  Hi, Wade!  Cougar and I are going after that plane. The rest of you, get Wade.  I'm out.  Get me closer...  Aisha thinks you kill me.  Don't need one.     Rifle...  Outstanding.  Hello?  Not by a longshot. You're not having a real great day, Max.  Just a voice on the phone.  Working on the engines. 116.  It's Colonel.  Thank you.  I don't think the guys you're about to stiff for a billion dollars are going to allow that to happen.  We win. You lose. Goodbye.  Lear jet?  That why you slept with me? 117.  You coming?  Good cause there's no way I could walk it...",
        "Goliath": "Jensen, by a MIRRORED SKYLIGHT (so you can't see down into the room). Attaching a HARNESS to his waist...",
        "Guard": "\"Skippy\"?  Show me some ID. Real easy.  Please- d-don't shoot...  On your knees.  That's a nice hat.  Don't really care of there's a hole in it. One wash, good as... What are you smiling at?"
    },
    "imdb_rating": "6.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjU3MTU0NDI4Nl5BMl5BanBnXkFtZTcwMTE0NDMyMw@@._V1_QL75_UX380_CR0,12,380,562_.jpg",
    "description": "A tale of double cross and revenge, centered upon the members of an elite U.S. Special Forces unit sent into the Bolivian jungle on a search and destroy mission. The team-Clay, Jensen, Roque, Pooch and Cougar -find themselves the target of a lethal betrayal instigated from inside by a powerful enemy known only as Max. Presumed dead, the group makes plans to even the score when they're joined by the mysterious Aisha, a beautiful operative with her own agenda. Working together, they must remain deep undercover while tracking the heavily-guarded Max, a ruthless man bent on embroiling the world in a new high-tech global war.—Warner Bros. Pictures",
    "name": "The Losers",
    "genres": [
        "Action",
        "Adventure",
        "Comedy"
    ]
}