{
    "filename": "Thirteen-Days_script.txt",
    "imdb_id": "tt0146309",
    "imdb_url": "https://www.imdb.com/title/tt0146309",
    "characters": [
        "Arthur Lundahl",
        "Kenny O'Donnell",
        "Evelyn Lincoln",
        "Kevin O'Donnell",
        "Mark O'Donnell",
        "Jacqueline Kennedy",
        "John F. Kennedy",
        "Floyd",
        "McGeorge Bundy",
        "Kenny O'Donnell, Jr.",
        "Kenny's Assistant #1",
        "U-2 Pilot",
        "Kathy O'Donnell",
        "Helen O'Donnell",
        "NPIC Photo Interpreter"
    ],
    "dialogues": {
        "Arthur": "",
        "Lundahl": "They appear to be the SS-4: range of a thousand miles, three-megaton nuclear warhead.   Gentlemen, as most of you now know a U-2 over Cuba on Sunday morning took a series of disturbing photographs.   Our analysis at NPIC indicates the Soviet Union has followed its conventional weapons build-up in Cuba with the introduction of surface-to surface medium-range ballistic missiles, or MRBMs.  Our official estimate at this time is that this missile system is the SS-4 Sandal.  We do not believe these missiles are as yet operational.  A bulldozer TEARS through the undergrowth.  FILLING THE SCREEN.  A 70-foot long MISSILE TRANSPORTER creeps along in the bulldozer's wake like a vast hearse with its shrouded cargo.   IRONBARK reports the SS-4 can deliver a 3-megaton nuclear weapon 1000 miles.  So far we have identified 32 missiles served by around 3400 men, undoubtedly all Soviet personnel.  Our cities and military installations in the Southeast, as far north as Washington, are in range of these weapons, and in the event of a launch, would only have five minutes of warning.   Yes, Mr. President.  These are nuclear missiles.  The men come to grips with their own fears, own anger.   General Taylor can answer that question better than I can.  General Taylor drops a memo on the table WHICH BECOMES:   Mr. President...  Lundahl stands there at the end of the table, gray.  He almost can't say it, can't look the President in the face.   This morning's photography is in.  It appears the Soviets have commenced a crash program to ready the missiles.   The first missiles became operational last night.  With a barrage of shouted orders in Russian, and a whine of the ERECTOR's engines, THE MISSILE BEGINS TO RISE.   We expect they'll all be operational in 36 hours: Monday morning.  It stops, vertical.   That may not be as easy as we thought either.  We've gotten confirmation that the Soviets have also deployed battlefield nuclear weapons to Cuba.  A pall falls over the room as LeMay explains.",
        "Kenny": "Hi, hon.  They kiss in passing.  Daughter KATHY, 12, races by in angry pursuit of her twin, KEVIN, 12.   Kids are supposed to get detention.  Kenny dumps the bundle with Mark in a big pile of dirty laundry.   Secretary of Defense...   Wrong, and you get to wax my car.  KENNY JR. smirk at Kevin.   Rusk is State, moron.  Robert McNamara.   Nope.  Attorney General?  A PHONE RINGS as the kids cry out en masse.   All right, wise guys, Assistant Secretary of State for Latin America...    A long, narrow affair, window at the back looking out into the Rose Garden.  Kenny dumps his briefcase on the desk, shucks off his coat, removes a folder from his briefcase, turns and heads back out...   Morning, Floyd.   Top o' the morning, Mr. President.  The figure lowers the paper.  It is PRESIDENT JOHN F. KENNEDY.  He's wearing boxers and a tank top.  Unshaven.  Bed-head.  Kenny O'Donnell, former ward-pol and long-time Kennedy man, is his Chief of Staff...   Bayh's going to lose, but it's good groundwork for us for '64.  Kenny steals a piece of buttered toast off the President's plate.  The President spares him a glance.   No you weren't.   Today, for your information, is Pulaski Day.  We're going to Buffalo...   Who else you got?   Got the touch?   Everyone likes a good kid...  And like that, a congressional candidate is made...  Kenny accelerates, leaving the Pols behind.  Suddenly, outside the windows, the crowd swells forward with a collective ROAR.   Busy.  But you've got his heart.   I said his heart, not his attention.   Well.  There is a new civil rights initiative he wants to talk about.   We're giving the Brits Polaris instead. But a story'll just aggravate things.  Scotty stares at Kenny, determined.  Kenny looks away.  And his eye catches a tall, willowy BEAUTIFUL WOMAN.  She is talking, excited, embarrassed, to two more SECRET SERVICE AGENTS.  What they're saying is lost in the noise.  Scotty follows Kenny's gaze.  Then the two men share a look, a silent understanding.  Kenny glances at the Secret Service guy holding the car door, tilts his head at the woman.   Not today.  He's got tight schedule.  The Agent nods, heads for the other Agents and the Beautiful Woman.  Scotty acts like nothing has happened.   Forget it, Scotty.   All right, you're in.  Half hour.  Reston's won.  But so has Kenny, and he's made Scotty feel tough in the bargain.  People like Kenny.    Briefcase and coat in hand, Kenny enters his office - and finds THREE MEN.  Standing there.  Thin-haired, bespectacled, academic-looking MCGEORGE BUNDY, 43, the National Security Advisor.  The two men in the background: PHOTO INTERPRETERS.  Kenny hangs up his coat, sees the Interpreters' large black display cases.  And suddenly the world is slightly off kilter.   Hey, Mac.  You're up bright and early.   Morning, Floyd.   What's it about?   Just Cuba?  Okay, I got work to do, see you guys downstairs.    Kenny's office is a raging beehive of activity.  Kenny works the phone as ASSISTANTS come and go with files.    Listen to me, you worthless piece of disloyal shit.  You will pull Daly's man on the circuit.  You owe your goddamn job to this administration.  There is a word you need to learn.  It is the only word in politics.  Loyalty. LOYALTY you motherfucking piece of shit!  As Kenny THROWS the phone down at the receiver, and the PRIVATE DOOR to the Oval Office suddenly opens.  Kenny glances up.  President Kennedy stands there in the doorway. Kenny thinks he's reacting to the tirade.   What're you looking at?  This isn't the blessed order of St. Mary the Meek.  Kenny stops.   Excuse us.  The Assistants leave, shutting the door after them.  Kenny rises.   Not as far as the election goes.  The President lets Kenny by into...   We hit a Nazi buzz bomb field in '45.  It looks like a rocket base...  He puts his hand out to touch the image, then turns and looks to the President, knowing what they must be.   Jesus Christ in Heaven...    Kenny carries the phone with him as he paces hard from his desk to his window.   The principals are assembling in an hour.  See you then.  Kenny hangs up.  The President enters.  A beat.  And in that beat, there's a void.  The two men are off their emotional stride, trying to grope their way out of shock.   Should be here any minute.   Who gives a shit about the midterms now? The Soviets are putting nuclear weapons ninety miles away from us.   Jesus.  I feel like we've caught the Jap carriers steaming for Pearl Harbor.   Lyndon.  Adlai.  The silver-haired war hero and politically savvy Chairman of The Joint Chiefs of Staff, GENERAL MAXWELL TAYLOR, 50s, shakes the President's hand.   Ted.   If we hit 'em, kill a lot of Russians, they'll move against Berlin.  They attack Berlin, that's NATO... and we're at war.  The guys stop again.  The autumn day is bright, warm, alive. The air, the distant city sounds derail the relentless train of logic for a beat.  And in their faces we see that all three men, for the first time, feel the enormity of war, its shadow over everything.  It's only a couple of steps away. Steps that they're seriously contemplating.   There've got to be alternatives to just going out and bombing them.   The other thing is...   They're going to be pressing for a military solution soon.  We can't afford to let them ram their agenda down our throats.  We need to come with options other than air strikes so we have some sort of choice here.    It's too politicized with you in there, anyway.  They need to be able to stick their necks out.   EXCOM.  Has a ring to it.  Like F-Troop.  The President stops.  Bobby and Kenny stop, too.   Then we need to do a few things right away.  No Pierre.  He knows, the press knows. You're going to have to keep up your schedule - your movements are followed too closely.  And we need to get these guys out of the White House.  George Ball's got a conference room at State.  Reconvene over there this afternoon, come back here tonight.  Bobby nods.   Way it's going, the Democratic Party. DNC strategy session.  If you can call it that.  Scotty chuckles.  Kenny moves off, leading him away.  Kenny's assistant runs up behind him, holding out a slip of paper.   Tell you what.  We're in Connecticut tomorrow for Ribicoff.  I'll get you up front with him during the flight.   What is it?  The Assistant eyes Scotty, holds his tongue.  Kenny takes the slips.   I ask for a lot of 'em.  Whose is it?   Gotta go, Scotty.  See you tomorrow.   Jesus Christ Almighty...  They burst out laughing.  An absurd, tension draining moment. They shoot their drinks, Kenny refills.   Call me Irish, but I don't believe in cooler heads prevailing.   There is no expert on this subject, no wise old man.  The President stares Kenny in the face, understanding.   Then let's bomb the shit out of them. Everyone wants to, even you, even me.  It sure would feel good.  The President sees what Kenny's saying: it'd be an emotional response, not necessarily the intelligent one.   He's right.  And things are happening too fast.  It smells like the Bay of Pigs all over again.  Bobby picks up some reconnaissance photos on the coffee table.   He was.   Why don't you ask him yourself?  You can have him on the way home.   Cheer up, you've neutralized the entire White House Press Corps for a day.    As the meeting next door disperses, the President rummages through Kenny's jacket which hangs on Kenny's chair.  Kenny, bemused, holds out the package of cigarettes the President is looking for.   I was hoping LeMay pushed you.  I wouldn't mind going a few rounds with him.  The President glances up, takes the proffered smokes.   They're planning to shave you bald next time you fall asleep on the bus.  Sorry, Pierre, Gromyko just arrived.    The Press Corps throngs Kenny's tiny office, pushing and shoving for a vantage at the side door to the Oval Office, waiting for the Gromyko photo-op.  Kenny stands shoulder-to shoulder with Reston and Sorensen near the door.   Come on, Scotty.  This meeting's been on the books for months.  It's just a friendly talk on U.S.-Soviet relations.  Fortunately, the conversation is cut short as a dozen FLASHBULBS suddenly go off on a dozen cameras as the reporters crush in on the Oval Office, and Reston is swept forward.    over the reporters.  The President, unsmiling, enters the room beside Soviet Foreign Minister, ANDREI GROMYKO.  Gromyko pauses for the photos: grim, dark haired, saturnine.   We go into this split, the Russians will know it.  And they'll use it against us.  The prospect disturbs the three men.   You don't show for Chicago, everyone'll know there's something going on.   No way.  The President spins on him, unsure he heard correctly.   I'm not calling and cancelling on Daly. You call and cancel on Daly.   Damn right I'm scared.  The President pauses, looks at Bobby.  Bobby shakes his head: don't look at me.   What are you telling them?    Tell 'em you've looked into it, and all it is is an exercise.  And Pierre --  The President may have a cold tomorrow.  Kenny stares at him, and the light dawns on Pierre. Something big is going on and he's been cut out of it.  He stalks off.   Well, you know how Bobby has it in for the State of Mississippi.   Cuba?  You're fucking crazy.  We are not invading Cuba.  Nobody gives a rat's ass about Cuba.  Not now, not ever. If you print something like that, all you're going to do is inflame the situation.  Nobody talks to assholes who inflame situations.  Assholes like that can find themselves cut out of the loop.  Reston is taken aback.  Stung silence for a beat.  Kenny's response is far louder than any \"yes.\"  Now Kenny realizes it.    Kenny enters his hotel room.  An Assistant waits with the phone, hands it straight to Kenny.    Tell Pierre I need to talk to him.  Bobby?   We have to try the blockades.  It probably won't work.  It may just be delaying the inevitable.  But we can't just go to war without trying not to.   As the town's most popular playboy, the President felt my presence would be sorely missed.  So in the interests of National Security...  Kenny shrugs.  Adlai takes a long drink, closes his eyes.   We're not going to make it to Monday. I'll try to lean on Reston, but you're going to have to call Orville Dryfoos. This is the sort of decision the publisher makes himself.    Bobby barges into Kenny's office.  Kenny, knowing his unique entry, doesn't bother to look up.   Acheson called, DeGaulle's with us; haven't heard from anyone else yet.  Kenny finally looks up.  Bobby's grim.  And an icicle forms in Kenny's gut as Bobby relays.   You'd worry that something was wrong if Congress offered you unconditional support.    Specks of shaving cream still on his face, Kenny paces, reads the inky carbon as Bobby, Bundy and Sorensen read copies.   This is all rhetoric.  They don't know how to respond yet.  Kenny looks up.  The President enters from the Oval Office.   -- run the blockade.  They'll run the blockade.  ADMIRAL GEORGE ANDERSON, 50s, dapper, the Chief of Naval Operations, nods from the far end of the table.   I don't like what's happening.   All right.  'Cause you get armed boarders climbing into Soviet ships, shots being fired across bows...   What about these low-level flights? They're starting in what?  An hour?  Do you realize what you're letting yourself in for?   Fair enough.  But Castro's on alert and we're flying attack planes over their sites, on the deck.  There's no way for them to know they're carrying cameras, not bombs.  They're going to be shot at, plain and simple.  Kenny's right, and the President looks away in frustration.   I'm your political advisor, and I'm giving you political analysis here. This is a setup.  The Chiefs want to go in.  It's the only way they can redeem themselves for the Bay of Pigs.  They have to go in, and they have to do it right.  It's that simple.   They're boxing us in with these rules of engagement.  If you agree to 'em, and one of our planes gets knocked down or one of the ships won't stop for inspection, the Chiefs will have us by the balls and will force us to start shooting.  They want a war, and they're arranging things to get one.  If you don't want one, we have to do something about it.  The President understands.  He shakes his head, paces away.   Maybe it's harder for them to say it than they let on. At the very least, they believe it's in our best interest.  And at the end of the day, they may end up being right.  The President turns away, considers.  Then turns back.   That's going to be tough.  You know how these guys are about their chains of command...   Ma'am, would you mind helping me out with a few special calls?    Kenny, sitting on his desk, taps his fingers, looks at the phone.  He's kept Ecker on hold long enough - and picks up.   Commander, my name is Ken O'Donnell. Special Assistant to the President.   The President has instructed me to pass along an order to you.  You are not to get shot down.  Did he hear right?     I don't think you understand me correctly.  You are not to get shot down under any circumstances.  Whatever happens up there, you were not shot at. Mechanical failures are fine; crashing into mountains, fine.  But you and your men are not to be shot at, fired at, launched upon.    Kenny stands, drops the hard nose bullshit.   Commander, if you are fired upon, the President will be forced to attack the sites that fire on you.  He doesn't want to have to do that.  It's very important that he doesn't, or things could go very badly out of control.    Kenny nods to himself, feeling.  He's done it himself.   If the President protects you, Commander, he may have to do it with the Bomb.   I've known the man for fifteen years. The problem is, he will protect you.  So I'm asking: don't make him protect you. Don't get shot at.  Ecker down, deeply affected.  Suddenly, A BELL RINGS.  A TELETYPE goes off.  Ecker knows it's for him.  His orders.    Kenny paces by the phone.  It rings.  He picks up, listens, reacts.  Relief.  And we know the planes have made it back.    In Kenny's credenza, a small black and white T.V. plays. WALTER CRONKITE narrates on the television as a train laden with TANKS on flatbeds pulls out of a station.   Yeah?    Kenny, grinning, ducks back into his office, closes the door after the Assistant leaves.  He picks up the phone.   Hello?    Kenny thinks fast.  Oh shit.   The Chiefs must want to talk to you.  Listen to me, Commander, they'll want to know if you were fired on.  Were you?   Commander.  Do not, under any circumstances, tell the Chiefs.    Kenny rubs his eyes, listens to his phone and the WOMAN'S VOICE at the other end.  It's his wife.   I don't know, Helen.  I want you to keep the kids close tomorrow.  Leave the T.V. on, sleep with it on in the bedroom until I tell you you can turn it off.   Nothing.  Nothing you don't know about. Tomorrow's the big day.  Just have the car ready to go if I call or if the Civil Defense Warning comes on.   I'll be evacuated with the President.  A long silence on the other end of the line.   I'll find you.  But we're not going to let it come to that.  I promise.   Helen just asked me what sort of arrangements we have for the families.     How long will it take to get someone up?   No.  No, I'll let her sleep.  Let 'em sleep.  Kenny says it with a certain finality.  The Police Officer nods, and Kenny wanders out through the gates, shouldering the weight of the world.   They're right.  This is intentional.  He glances around the room.  All of EXCOM is looking at him. Bobby stares at Kenny, too shocked to feel betrayed.   Khruschev's stopped the 20 ships which are carrying contraband, and he's letting the ones which aren't go through, hoping for an incident.  I think we should let them go.  Bobby relaxes.  Around the table there are nods.   Then we deal with it tomorrow.  But today he's stopped most of them.  He's done something smart here.  We gave him an ultimatum, and he's agreed to most of it, preserving just enough room to save face.  We need to do something just as smart now.  Bobby's nodding, following the argument.  Kenny looks around the room for support.   Give it a rest.  You were thinking the same thing, just didn't have the guts to take the heat.  Bobby likes getting under Kenny's skin.  Bobby aims a punch at his head which Kenny knocks away.  The President changes gear, serious.   Have to hope it's a signal that he'll back down on the real issue too.   Then let's move the quarantine line.  It's a simple suggestion.  The President considers him a beat, and then McNamara emerges from the White House, heads for them.  The three friends assume their more reserved, political faces as he comes up.   Moving the line.  Stroke of genius.   The Chiefs are looking for a provocation out there.  The President's going to come under enormous pressure.  You have to keep 'em on a short leash, Bob.  McNamara spares Kenny a short, nasty look.   Listen to me, goddamn it.  We're talking about a possible nuclear war.  You dropped the ball on Bay of Pigs --   You were in the room.  It was your purview.  It was your job to make sure Bissel wasn't fucking us over and you didn't do it.  You've got the most important job in the world right now. You're the smartest guy the President has.  Besides me.  That gets an amused snort from McNamara, breaking the tension.   You need to be the best you've ever been.  McNamara enters the elevator.  He turns, stands there facing Kenny for a dramatic beat.  Then the doors close.    WALTER CRONKITE, on the B&amp;W T.V. screen, sits in front of a map showing Cuba and the blockade line.   Find out how close our exercises are coming to their cruise missiles.  I'm calling you back in five, and you will have an answer for me or I will come down there and beat the shit out of you.  Then you can press charges, and I'll get a Presidential pardon.  He hangs up, hears SHOUTING from the Oval Office.  He goes to the door, enters --   Jesus...   We can't do that, Bobby.   And we can't purge the Chiefs.  Our invasion talk will look like a bluff. Or even that there's been an attempted coup.  Bobby is disgusted, but knows they're right.   We've got Khruschev's attention with the blockade.  If we want a political solution.  I think it's time to turn up the diplomatic heat.  Cause if we let this go on too long, we're going to find ourselves in a war.  Bobby looks at the President, meaningful.  The President turns to Kenny.   I think it's a bad idea.  Bundy turns back to him.   Then they should speak up.   Yes it is.   -- You listen to me.  Nobody, nobody, talks about my friends that way.  You're fucking here right now because of the Kennedys.  They may be wrong.  They make mistakes.  But they're not weak. The weak ones are these 'people' who can't speak their own minds.   No, they just lack 'moral toughness.' And you think I'll play your Judas.  You WASPS and blue-bloods never understood us, thinking we want into your club. Well we got our own club now.  And you guys don't realize fighting with each other is our way.  Nobody plays us off each other.  And nobody ever gets between us...   Oh, just a bunch of crap about withdrawing our Jupiter missiles in Turkey if the Soviets'll do the same in Cuba.  The President's eyes flick over to him in the mirror.   If we made a trade, we'd be giving in to extortion, and NATO would never trust us again.  We'll get clobbered in world opinion.   Then somebody'd better deny it publicly.  The President turns around, heads over to the T.V.  Kenny folds his arms, disgusted.   Yeah, a good political solution.    Kenny, phone to his ear, suffers as Bobby harangues him.   You can't take him out this late in the game.   Then talk to your brother, goddamn it. The two of you don't need any advice to get into trouble.   Something your father would've come up with.  Silence.  Terrible silence.  That paralyzes Bobby.  Kenny stares at him.  He means it, but regrets it, too.   -- I'm just trying to make a point. This idea is that fucking bad.  But Bobby gets it.  Kenny shifts gears, lets it go.   Adlai can handle Zorin.  He knows the inning and the score.    Kenny turns to gaze at his little T.V. in the credenza, U.N. coverage continuing, as if he could see Adlai there.   Adlai, it's Kenny.  How're you doing?    Kenny rises from his chair, paces toward the T.V.  He pauses.   The President told me to pass the word to you: stick it to them.    Kenny is watching exactly the same performance.  Zorin is masterful.  Kenny knows it.  And when he talks to Adlai, it's with the fatalism of a coach knowing he's putting his third string quarterback in against the all-Pro linebacker.   Adlai.  The world has to know we're right.  If we're going to have a chance at a political solution, we need international pressure.  You got to be tough, Adlai.  You need to find it, old friend.   Yeah.  Yeah.   Zorin must not have gotten instructions. Somebody in their Foreign Ministry's blown it big-time.  Bundy steps forward, holding the phone.     Dangle a settlement, tie us down in negotiations, we come up short...   That may be why Khruschev's introducing this guy.  We've been burned by his usual players in the formal channels, so he brings in an honest broker.   Who's he talking for?  Is it Khruschev, or is this more bullshit?  Kenny stands, runs his hands through his hair, aggravated.   How do you become the KGB top spy in the United States?   Politics is politics.  Walter.  Khruschev is the Moscow Party Boss under Stalin.  Give me their career chronologies!  Walter pushes a typed dateline of Khruschev's major career moves, and one of the Agents hands Kenny a list of Fomin's postings.  He lays them side by side.  And for every step of Khruschev's, there's a step for Fomin.  Not only that, but the DATES ARE IDENTICAL or nearly so.   Every time Khruschev moves up, Fomin does within a year...  Khruschev was the administrator in charge of preparing Moscow's defenses during the war.  And Fomin... was here in the U.S.  Kenny's face falls.  But a YOUNG FBI AGENT cuts in.   They know each other.  They're war buddies.   Hello?   They know each other!  Khruschev and Feklisov aka Fomin were war buddies!   Don't take it to court, but we've got good circumstantial evidence...  Walter agrees.  My gut's telling me Khruschev's turning to a trusted old friend to carry his message.   It's ten pages of sentimental fluff, but he's saying right here.  He'll remove the missiles in return for a no-invasion pledge.  It looks like Fomin's overture was genuine.  The President turns to McCone.   Hi.  Helen rises, her own care-worn face turned to his.  For a silent moment they gaze at each other, searching in the lines of each others' face for the changes of a long separation. They see them.  But they've been married a long time, and the awkwardness passes.   -- we got a back channel communication from Khruschev this evening feeling us out about a deal.  He confirmed it just a little while ago in a letter to the President.  I think we've won.     Helen and I went out for breakfast. EXCOM's not supposed to convene til eight.   What does the letter say?   Jesus Christ...  Bobby gives him a look: told you things got worse.   We can't sell out one of our friends for our own safety.  NATO wouldn't trust us anymore, and they'd be right not to.  The President sighs in the face of the stern advice.  He nods, expecting as much.  Bobby still can't look at anyone.    Kenny, at the other end of the line, stares out the window at the fall day.  It seems so mild, so unlike war.  And it takes him a beat before he realizes Anderson's on the line.   Major, my name is Kenneth O'Donnell. Special Assistant to the President.  Kenny takes a breath, ready to start the shuck-and-jive... but for some reason doesn't.   Major, a few days ago the President ordered me to help him keep control of what's going on out there.  I've been browbeating pilots, navy guys left and right to make sure you don't get us here in Washington into trouble.  But you know what?  We're pretty damn good at getting ourselves into trouble.  So instead of riding your ass, I'm just going to tell you what's going on, and let you figure out how best to help us out up here.     Last night, we looked like we were going to cut a deal to get us all out of this mess.  Today, the Soviets are reneging. We're going to try to salvage the situation, but a lot of things are going wrong today.  It's making everyone nervous, and it will be very hard to avoid going to war.  Don't get shot down, Major.  Beyond that, whatever else you can do to help us, I'd really appreciate it.    Kenny nods to himself, deeply touched by the man's faith.   Thank you, Major.   It could be a mistake.  McCone gives him a get-serious look.  But Kenny presses on.   We need to be positive before we react.  Bundy enters the room.  Everyone looks up.  He stands there in the doorway, his face tight.  Kenny sags in his chair.  Bundy, of course, has more bad news, and they all know it.  A hopeless beat.  The President just stares at Bundy, unable to ask.  Bundy nods, affirming what everyone is thinking.    Alone in his office, shattered, Kenny stares out the window, viewing the distant Ellipse through a gap in the trees.  Kids are out there playing football.  He glances at his watch, and grabs his jacket.   Hey, sport.  You winning?   Yeah, Kev.  Everything's gonna be fine.  But Kevin knows.  Together they know.  The end of the world is at hand.   I, uh...  Suddenly a car HONKS.  Kenny turns around.  Bobby is leaning out the rear passenger window of his limo.  And he sees what Kenny is doing.  He doesn't want to cut in, but has to.   Get back out there, kid.  Remember to hit 'em hard.   Back to work.  Kevin puts his helmet back on his head.  Kenny watches as Kevin jogs off to rejoin his team.  Kenny turns his back on his son, and strides for Bobby's limo, dying inside.   If we're going to make a deal, we're going to have to do it fast.  This is only getting out of control.  The only reason we're not at war this very minute is he's been able to stretch, bend and break his own rules.  He won't be able to keep it up forever.  Bobby jams the last bit of sandwich in his mouth.  A beat. Kenny looks him in the eye.   And Jack wants to trade the missiles in Turkey.   -- Jesus, Mary and Joseph.  I told you how stupid it was to float the Lippman article!  But you wouldn't listen to me. What if there hasn't been a coup at all? What if it's you two who invited that second letter by raising the possibility of a trade?  Bobby is speechless with rage.   And if the two of you are thinking this trade is your ace in the hole, you're so wrong.  It's a deuce.  Bobby's beyond furious.  They catch their rising voices.   And it's not just me who thinks that. Everyone on this so-called EXCOM is telling you exactly the same thing: make the trade, and they're going to force us into trade after trade until finally they demand something we won't trade like Berlin, and we do end up in a war.  Not to mention, that long before that happens, this government will be politically dead.  Bobby simmers for a long beat, thinking.  And boy, does this guy hate admitting he's wrong.   So now you've got to talk him out of it. And then we've got to figure out an acceptable political solution.   I agree.  If there has been a coup, and there's a hard-line government in power now, then it doesn't matter what we say. The end of the day we'll either agree to their terms, they'll agree to ours, or we'll go to war.  But what if there hasn't been a coup?  What if... what if what is happening is a series of accidents?   No.  The letter is an intentional, but it's having an effect far greater than its authors intended.  What if our Jupiter missiles are just a last minute haggle to salvage something? Maybe a bone Khruschev is throwing to the hard line, not really caring if we reject it or not?  And then these accidents have happened.   Exactly.  If they're sane and human like we are, then maybe we just refuse, and they'll let it slide, like we've been letting things slide.   No.  We don't reject it...  It hits Bobby like a lightning bolt.   And we do it under the table so we can disavow any knowledge of it.   Six months from now, I'm not going to care.  Are you?  We'll deal with it.   And if this is a move to appease the hard line, then it may just be the bone he needs to regain control of his own house.  Most EXCOM is nodding, agreeing.  McCone shakes his head in disgust.  Taylor sits in silence.   Hey, Joe.  Listen, I'll take care of him.  Go ahead in, grab some coffee. We'll be back pretty quick.   What's the matter with you?  Forget how to open a car door?   Jesus, you rich people.  Kenny starts up the engine.  Bobby smiles a twisted smile. As the car pulls away, the two men sit in silence, neither willing to admit how glad the other is there.   There's nobody else I'd rather have going in there.  Bobby looks at him.   Nobody else I'd trust Helen and the kids' lives to.  Kenny means it.  He looks away.  Bobby shifts, awkward.   Because we knew we could do a better job than everyone else.  And Bobby, in the silence and closeness of the car, turns on Kenny - anguished, knowing his life is at its climax.   You're right about the smart part, but ruthless, well...  That breaks the tension as they arrive at the scene:   Smoke.   I'll whistle up some luck for you.  And before Kenny's eyes, all of Bobby's doubt vanishes.  In its place, a severe confidence.  A grandeur Kenny has never seen.  It makes Kenny pause.  He beholds his best friend become a man of the ages.  And then Bobby SMOOTHLY opens the door.   The friend.  Kenny breaks the gaze.  He begins to whistle again.  The CAMERA drifts away, finding the far DOOR to the inner office, Kenny's tune stronger, carrying with it hope...   All he had was his character.  The President and Bobby nod at the justice of that remark.   -- he kept the peace.  Kenny looks at the President.  The President feels it, and gazes back to him.  The three of them stare out at the glittering city.  The grandness of the world lies before them, and they are deciding its fate, and are humbled by the awfulness of it. The silence is beyond power.  And for a long moment, they know not to disturb it.  There is nothing left to say.  The President, at last, finishes his drink.   No.  I'm glad I'm home.  And she knows the worst.   If the sun rises in the morning, it is only because of men of goodwill.  And that's all there is between us and the Devil.  They take each other in their arms, the wisdom of the atomic age so simple, so tenuous, every human life hanging by such a thread... yet a thread so powerful.  The CAMERA RISES FROM THEM, finding the OPEN WINDOW and the DARKNESS.   Yeah?   Don't you understand?  McNamara and Bundy look at him funny.   The sun came up today.   It shouldn't have.  But it did.   Every day the sun comes up... says something about us.   Something... amazing.  They just stare at him.  And with secret smiles, superior smiles, they nod.   You know...  The President looks at him in the mirror.   ...this was what we're here for.  The President smiles an ever-so-faint smile.  Kenny turns and leaves the room, vanishing, and as we HOLD on the empty doorway, the simple, whistled melody of O'DONNELL ABOO drifts from the hallway beyond, becoming our END MUSIC.",
        "O'Donnell": "A simple CAMERA, snapping away furiously in the hands of a giggling MARK O'DONNELL, 4.  He's straddling and in the face of his dad, KENNY O'DONNELL, 30's, tough, Boston-Irish, with a prodigious case of morning hair.  Kenny awakens, red-eyed.    Kenny, with Mark in the bundle on his shoulder, meets his wife HELEN going the other way in the hall with LITTLE HELEN, 1, in her arms.    A kitchen out of the late 1950's.  Kenny drinks coffee, ties a tie, rifles through a briefcase at the kitchen table.  The horde of kids, ages 2-14, breakfast on an array of period food.  Kenny grills the kids while he goes over papers.    A black Lincoln pulls away from the modest white house on a tidy Washington D.C. residential street.    A long, black car stops at the end of Kenny's driveway.  The door opens, and Kenny steps out.  He says an inaudible goodnight to the driver, and the car pulls off.  He turns, facing the white two-story house with the neat front yard, the lights out.  And he smiles.  Home at last.    A screen door squeaks open.  Kenny steps out into the darkness of the back yard.  And there, in her robe, sitting startled on a lawn chair, lit only by the dim glow of the kitchen window, is Helen.  Kenny stands there tired, his coat slung over his shoulder.    Kenny's limo pulls away, leaving Kenny, coat in hand, at the bottom of his driveway.  He watches it go, silently urging it to return for him with some call from the President telling him he's desperately needed.  But it doesn't.  He turns to his house.  The lights are all out.  He notices he's CLUTCHING the handle of his briefcase.  His knuckles are white.  With conscious effort, he unfolds his hand, letting the briefcase drop on the driveway.  He stands alone, stripped of his friends, his family, his job... and in that moment, mute, impotent in the shadow of Armageddon, Kenny is our Everyman of the Nuclear Age.    Helen stands in the kitchen, a ghostly white figure in her robe, the windows open and curtain flapping as she breathes the air.  Kenny enters.  He stands in the doorway.    The RED DOME OF NUCLEAR FIRE rising over Washington.  It roils the air in its expanding, blood-red glory.  It is the sun.  The dawn in the East.    Kenny snatches the RED PHONE from its hook.",
        "Evelyn": "",
        "Lincoln": "",
        "Kevin": "Dean Rusk!   Hey!  Dad!  Kenny manages a smile as Kevin trots over.  Kevin pulls his helmet off.  They stand there a long beat, Kenny desperate to take him up, abandon his post... but he doesn't.   Yeah.  But Kevin sees the turmoil in his father's face.   Is everything going to be okay, Dad?  Kenny's forced smile is answer enough.   I guess you won't be coming home tonight.   What about you?  Where are you going?",
        "Mark": "McNamara stares out at the bewildering tangle of symbols, living men behind each one.  Each tangle of red and blue symbols a powderkeg.  A G-dlike view indeed.  And it is far more than any one mere man could keep control of. And he begins to realize it.",
        "Jacqueline": "",
        "Kennedy": "",
        "Floyd": "",
        "McGeorge": "",
        "Bundy": "No, Ken.  I need to see him now...   Cuba.  Bundy is tense.  But Kenny relaxes.   On Sunday morning, one of our U-2s took these pictures.  The Soviets are putting medium range ballistic missiles into Cuba.  Shock.  Silence.  Kenny glances to the other men.   Sir.  We need to consider... if we decide to act, there's a good chance we'll end up in a general war.  The room falls silent.  The President leans back in his chair, studying the circle of men around the table, weighing them.  Kenny and the others watch him in silence.  A long, dramatic pause.  A course that will change history is about to be chosen.  The President leans forward, folds his hands on the table.  Fated.  Grave.   You want to be clear, Mr. President, that we have definitely decided against a political track.  The President folds the note away, glances at Bobby.  A beat, the President looks from Bobby to Acheson.   We have time.   Bombing them...   I just checked myself.  They're being issued identity cards. Call comes, and evacuation officers meet them at pre-arranged departure areas. They go by helicopter to Mount Weather. We meet them there.  Bobby looks at his coffee, then up at Kenny.  He gently shakes his head.  It's all a sham.   What did you think of Lippman's column this morning?   Thank God.  Look, everyone is furious about it.  We trade away our missiles in Turkey and we're fucked politically.  Kenny grinds his jaw, but doesn't say anything.  He agrees. Bundy steps up to him, confiding.   You gotta stop 'em.  We know it's Jack and Bobby's idea - they leaked it to Lippman.  The military guys are going ape, and they're not alone.   Christ, Ken, you know it's not that easy.   No it isn't.  They don't trust the people that feel this way.  But these people are right.  And the Kennedys are wrong.  We need you to tell 'em, Kenny.  They'll listen to you.  Kenny prickles, intense, but Bundy presses on, too wrapped up in his own thinking to notice.   Jack and Bobby are good men.  But it takes a certain character, moral toughness to stand up to --   You know I don't mean they're weak.  Kenny gets in his face, intimidating.   Come on, Adlai!  They all crowd the T.V. as if it were a title fight.  Except for Bobby.  Kenny glances over at him.  He has the phone pinned between his ear and shoulder.  Kenny looks back to the  Mr. President...  Kenny and the President turn to see what they already have heard in those two words: concern.  The room falls quiet.   All the trademarks of a back-channel overture.  Kenny eyes Bundy, makes him uncomfortable.  The President sizes Scali up.    Kenny, jogging down the hall, hears form an open door.   Kenny!  Kenny goes over to the threshold.  Inside the office Bundy stands up from behind his desk, grave.  And Kenny knows.   A U-2 on a routine air-sampling mission over Siberia got lost and penetrated Soviet airspace.  The Soviets scrambled MIGs in pursuit, thinking it was a bomber.  It got out okay.  Somebody forgot to cancel the mission.   We've been talking.  We can play this big in '64.  It's the foreign policy trophy we've been waiting.  Kenny sickens.  He tries to listen, but it all begins to blur.   I think we can ride it all the way home next election.  Bet you're way ahead of us, eh?  Bundy slaps Kenny on the back.  Kenny is pale.  Is what they're saying possible?  But Bundy and McCone are too wrapped up in their schemes to notice Kenny's distress.   Understand what?  Kenny just looks at them, eyes filled with sorrow.  They begin to feel uncomfortable.   Yeah.   Says what, Kenny?  Kenny looks back at them.   See you later, Kenny.  Kenny watches them, heads bowed in discussion, disappear into the labyrinth of the West Wing.  Kenny turns his back on them.",
        "Pilot": "Uhhh... yup.  Think so.  Suddenly, the door opens and a pale DUTY SERGEANT enters.   Flameout flameout!   Shit!  Me too!   Oh, God damn.  Got it restarted.   Yeah.  Yeah.  Me too.  Goddamn fuel.   Sir, I don't think she's gonna hold up for the run.   Failure.  All cameras.  Sonofabitch. Film must not have fed.   Jesus!  Shit!  Oh shit!  I just shot it all, boss.  Activator jammed open, its exposing everything now.",
        "Kathy": "",
        "Helen": "Mark, get off your father!  Kenny sits up to the morning bedlam of the O'Donnell house.  KIDS screech, doors bang all over.  Kenny pushes Mark over, rolls out of bed, snatches up the corners of the blanket and hoists Mark over his shoulder in a screaming, kicking bundle.   Don't forget, Mrs. Higgins wants to talk to you this afternoon about Kevin.  You need to do something about this.   Got time for pancakes?   When are you going to be home?   What's happened?   What happens to you?  I'm not leaving without you.   Great.  So while you're under a rock somewhere with the President, what am I supposed to do with your five children?  And to that, there is no answer.  A beat, and it's all Kenny can promise:   Hi, O'Donnell.  You look old.  Kenny drops his coat on a table as Helen comes up and folds herself into his arms.   This job's going to kill you.  If I don't first.  They kiss, comfortable.  But not too long, and he lets her go.  She looks at him again, sees he's suppressing a smile.   If you're home it means either Jack and Bobby have finally figured out what a con man you are and fired you, or --   A thing like this... who could even think of winning?   I saw you out there.  You want him to call you back, need you.   How long do we have?  Kenny's voice breaks."
    },
    "imdb_rating": "7.3",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZDM5NzBkZWMtZDY2Ny00OGMxLTgzMDUtZDZkNzRhM2M5MDIxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "In October 1962, President John F. Kennedy (Greenwood) learns about the Soviet Union's plan of placing nuclear weapons in Cuba. These weapons could wipe out most of the eastern and southern United States in minutes if they become operational. Kennedy and his advisors must come up with a plan of action against the Soviets.",
    "name": "Thirteen Days",
    "genres": [
        "Drama",
        "History",
        "Thriller"
    ]
}