{
    "filename": "This-is-40_script.txt",
    "imdb_id": "tt1758830",
    "imdb_url": "https://www.imdb.com/title/tt1758830",
    "characters": [
        "School Playdate Parent",
        "School Playmate Child",
        "Desi",
        "Older Pregnant Parent",
        "Debbie",
        "Male Boutique Customer",
        "Barb",
        "Graham Parker Solo Band",
        "Sadie",
        "Barry",
        "Jason",
        "Charlotte",
        "Jodi",
        "Graham Parker",
        "Pete"
    ],
    "dialogues": {
        "Desi": "Jodi? Oh, Jodi's my new BFF. She's like a little kitty cat. Sometimes she comes and rubs up against my leg.  She loves me.  Maybe some deep oranges and browns and maybe dark greens? That would really play up your features.  Uh, yeah.  Well, I mean, it's not a fucking Porsche, but it'll do for now.  Yeah, sure. I'm sorry.  Good?  You know, I actually made this one myself.  Yeah. I did the tiger on a piece of paper separately, and then I transferred it to the t-shirt.  I drew it on a piece of paper, and then I transferred the drawing to the t-shirt.  Really?  My boobs? Yeah... Do you want to touch them?  Touch `em!  No. There's some meat in there.  By the time I'm forty, these are going to go National Geographic on me.  You want coffee? This place has coffee. They have all kinds of drinks.  What sport do you guys play?  Oh, I like hockey.  Do you guys still have all of your teeth?  Do I look sexy?  I want to party with these winners, come on Deb.  No, he was wearing a tie.  When I kissed him, I felt his little tiny teeth nubs with my tongue.  It was like kissing a baby. French kissing a baby.  Are you guys missing money?  Wait. Do you think I took it?  It's not me.  Yes, you're right. Look. I... am an escort. I get paid to go out on dates.  But only three to five times a year. Ten times max. But it's not technically \"prostitution\" because I don't have to sleep with them.  But I always do. That's why I only do it four to eight times a year, fifteen times max.  One year I did it twenty.  It's safe. I only do it ten to thirty times a year.  It's Jodi.  Yeah. She's a pilled-out whore.  You're pregnant.  You didn't tell Pete yet? Why not?  Go home and suck his dick and tell him then and he will love it.  He'll be so excited. Or even better yet, you should tell him while you're sucking his dick. \"I'm pregnant.\"  Hi, Larry.  Did you guys come together? Are you a couple?  Sorry, the mustache is a little--  I just assumed.  What is the different between a gay man's mustache and a straight man's mustache?  Excuse me.  So what's your sun sign?  That's not good.  Not for me, that's not good. Sexually we are completely incompatible.  What's yours?  Really?  That's really strange. Well, Taurus and Cancers are sort of soul mates of the Zodiac. We're like perfectly compatible. I balance what you lack, and you make up for what I lack. And a quiet Cancer almost always has a huge penis.  Really?  I want to be a twelve.  I don't want to be lazy.  I won't be lazy.  Wow.  Bodies By Jason.  Bodies By Jason.  Jason.    Yeah.  Hey, Pete. Great party!",
        "Debbie": "Oh Pete! Oh my god! This is crazy!  What?  What? What did you do? Wait. Stop.  You just took a Viagra to have sex with me?  Because you can't get hard without a Viagra? Is it because you don't think I'm sexy?  That is the worst birthday present you could ever give someone.  I don't want a turbo penis. I like your medium soft one.  Where did you get this?  What? You got it from Barry?  We are young people. We don't need medication to have sex.  I am not forty! And I don't want to have a husband who has to take Viagra to get a hard-on.  Fuck forty! Forty can suck my dick.  Hey. Don't eat that cupcake.  The one you just put into the sink. I saw you were hiding that.  Yeah.  You're still going to eat it.  Just put it in the trash.  Anything?  Just hang out with you guys.  I'm turning thirty-eight.  No. I don't think it's weird at all. Because you're turning forty and I'm turning thirty-eight.  You don't get it. You don't understand how it works. I don't want to shop at old lady stores. I don't want to go to J. Jill and Chicos and Ann Taylor Loft. I'm not ready yet. I need two more years.  What did you get me for my birthday?  What do you mean? You're supposed to get me a surprise gift. This is a big birthday. I'm turning forty!  I am going to work out. I'll be back in about an hour.  No. That's no surprise.  I don't know. I think maybe he just isn't attracted to me anymore.  But everyone gives you a boner.  Maybe things are just getting stale. That's why maybe I work out really hard. Maybe he'll be able to get a boner again.  She's numb down there.   I think you need a family. Don't you want a family?   Clooney it?    He doesn't seem happy.  No. He's lonely.  See, I think he has sad eyes.  I bet George Clooney is really lonely. Just him and his pig.  I wouldn't.  Do you think?  This music doesn't make people happy.  Look how angry you get while listening to this. It's my birthday. You don't control the radio on my birthday. I control the radio on my birthday.  Sadie, how many times have you watched Lost this week?  That's really bad, Sadie. You're not allowed to do that.  Be nice to your sister. You guys are going to cherish each other one day.  I know, just five minutes. I think Desi and Jodi are fighting.   Pete and Debbie enter and we see their two employees, JODI and a new, gorgeous employee, DESI, who is up on a ladder.   Hi. How's Jodi treating you?  Huh.  Can you do inventory so that we can do the sidewalk sale? And you really need to pay attention to the numbers because we have twelve thousand dollars unaccounted for.  She's not stealing. She's our best employee. She made nine grand last month.  You brought in twenty-two hundred.  Well, that's not that good. I mean, I'm not comparing you, but you're not as good.  What?  What? Why are you looking?  Maybe she's wearing dark underwear.  Stop looking.  Woo! Where's daddy?  Pete!  What are you doing?  We're all downstairs waiting for you. You've been up here for a really long time now.  Charlotte just did her first flip on the trampoline, and she landed on her feet. She was really proud of herself.   And you missed it.   It's just that this is the fourth time you've gone to the bathroom today.   Why is your instinct to escape?   How come I don't smell anything?   Let me see then.   Let me see!   You're not going to let me see because you're not taking a poop.    You're flushing as you go? Who takes a half hour to go to the bathroom?  It's just not my kind of music.  I like Lady Gaga.  What?  It's not! It's fun, and it's about release and sex and power.  This is a job. This is not a hobby. Can't you love him just as a hobby? And sign a fifteen-year-old hot girl so we can eat?    Sadie. Sadie, what are you listening to?  Okay, this is music that makes people happy. And this is what people buy. Right, girls?  Why did you take it off?  It just doesn't make people happy.  You're the only one in the room who's happy.    Can you go get a lunch box or something?  Shhh!  Hi, any day now, huh?  That would be great, I'll call you.  \"No\" what?  What? She's sweet.  Oh. We are on time.  Oh. Okay.  I come to--  Hi, Grandma Molly.  Yeah.  The happiest period in people's lives is from age forty to sixty. So this is it. We're in it, right now.  Says a lot of people, most people.  We have everything we need right now to be completely happy. We're going to blink and be ninety.   So, let's just choose to be happy.   Your eyes are kind of glazing over.   Some of these I wrote for you. So, we have to exercise every day. Spend more time alone together. We have to go to the therapist every week.   No stressing over tiny things.   We have to get more involved in school. Have more patience with the kids. And we need to work on our anger.   No, I said both of us.   Okay. No more smoking.   I don't want to make this about a fight, I want to just be positive.   Okay, and then no more holding on to resentments. We have to just let that go.   Well, I don't do that, but I will continue not to do that. What did you write?   And you're going to eat better?   And then I'll smoke that day.   It is the same thing.   And the other thing is your dad stuff.  The not letting him guilt trip you all the time, because that puts a lot of pressure on you, and the whole family feels it. He's a grown man, and he's not our responsibility. And you're not giving him money anymore, right?  Can you please put that down?  A lot of people are RSVP-ing to your birthday party.  No.  No.  Did Jodi tell you she thinks Desi's stealing?  Yes.  Twelve thousand dollars.  Well, I don't know. That's what Jodi said.  It is. Don't put that kind of pressure on me.  Are you nervous about money? Are we okay?  Oh, yeah. For sure. We can't fire her. We're barely breaking even with her.  Look at this, she's making out with somebody.  Is she screwing him??  Look at the position of her skirt.  At least she's getting some.  Yes.  It's not about credit. We need to have more passion. Like this.  It looks like passion to me.  Oh my god. Don't do that!  Don't fart in the bed!  This is why we never have sex. That's disgusting. You're gross.    I grind all night.  Turn it up!  Turn it up!  I don't know.  Yes.  Oh. It's 1974.  No. That's funny.  I'm not going to \"go\" with 1974, it is 1974.  I lie about my age, okay?  Okay? Okay? Okay?!  Oh my gosh.  What are you doing?  You want a blow job?  I really want a cigarette right now.    Stop it!  Forget it.  Hi, I'm looking for my dad, an older man?  Oh, he's not with Sony anymore. He went out on his own. Now he's able to focus on the artists that he's really passionate about.  She just got her period.  It would be nice to see more of each other.  That would be nice. Do you have a good day?  I know, I wasn't. I'm glad we're here. I think this is a good start and that if we can spend more time together, it would be nice.  He's handsome. He's thirteen?  Daddy and I are making some changes so that we can be happier and healthier, and we're starting with this meal that I prepared.  Doesn't it look good?  No, baked tofu. It's actually really tasty. And the lettuce is so fresh and tasty that you forget how good lettuce tastes on its own without dressing.  And another thing we've decided is to cut back on all of the electronics we use. What we're going to do is get rid of the wi-fi and only use the computer from eight to eight-thirty at night.  We're going to have a hard line in the kitchen.  You don't spend enough time with the family when you're constantly on your iPhone and your computer. You're only here five more years.   No, but you won't be living with us. And you should get to know your little sister.   Yeah. You can build things. You can build a fort.   Yeah, build a fort. Play with your friends.   When I was a kid we used to build tree houses and play with sticks.  Play Kick the Can.  It's fun.  You don't need technology.  Charlotte, put that down.  Nobody said you were bad.  She is up to no good. She's not allowed to come over here anymore.  This isn't turning out the way I wanted it to.  No computer.  I know. She's tough.   Pete and Debbie drive down the Pacific Coast Highway.   This is the best birthday present.    I know!  I mean I can't take it. With the hormones, and the crying, and \"do my homework\"...  Them's lil' bitches! Bugging us for shit all the time. And they never appreciate anything.    I miss them already. Should we go home?  Why do we fight?   It makes no sense.   But you're such a dick sometimes.   Thank you for admitting that.   I do want to kill you.   I don't know... poison you. I'd poison your cupcakes that you pretend not to eat everyday. And just put enough in to slowly weaken you.   I would enjoy our last few months together.   Because you'd be so weak and sweet, and I could take care of you but while killing you.  Have you ever thought about killing me?  Really?  How would you do it?  A wood chipper?  Yeah.  Wow. That's a bad plan. The cupcakes is a way better plan.  Aw. I love you.  What?  What?  Should we do it?  Just get all of it. You deserve it. You really do.  Yes, and I just realized that right now. Go get the cookie!  Should we watch porn when we eat the cookie?  I don't think we need twenty-four hours of porn.  I think that's too much porn.  How much are we supposed to eat?  Plus, it's old. It probably has lost some of its-  We should have sex. More.  It's true.  You do.  I'm going to deep throat this eclair.  That was nice.  Are you okay? What's the matter?    Not in kids over six years old. We're going to the Eastern doctor.  Are you kidding right now?  Sugar, wheat and dairy. Okay.  Why don't you go on the table?  Why don't you go on the table? It looks like you need to get on the table.  Pete!  What are you doing?  Why?  What are you doing with your phone?  Can we just keep like a small shred of mystery in our relationship?  I do not want to investigate your anus.  It's a hemorrhoid.   Debbie talks to Jodi while they fold clothes and watch Desi.   Where did she get those clothes? Those are expensive.  Everything that goes in is dicks?  Don't say that.  I'm going to go talk to her.  Hey Desi. Is that your new Acura out front?  It's so nice. Do you love it?  Hey Desi, would you mind wearing some of the clothes we have in the store?  Did you?  Wow. So you stenciled on the tiger?  You have an amazing body.  Yes. Are those real?  Really?  Okay.  Wow. Jesus. I mean they really are amazing. That's firm, for real. They're like a memory mattress. Like Tempurpedic, you know? They look amazing. My kids just sucked the meat right out of mine.  Since I had kids, my boobs are just gone. They didn't even say goodbye. They just left.  I feel bad about myself right now.  Yeah, really quick.  I'm getting rid of everything in the house that has gluten or sugar.  Gluten's really bad for you.   Don't you watch Dr. Oz?   Remember the rules? Eight to eight- thirty?   Hi Wendy. Why don't you guys go play? You could go build a fort!   Have you ever built a fort, Wendy?   But don't you want to live long enough to see your kids grow up?   But that's really not good for the kids.    Yeah. Well, I guess I'm not the cool one. But the rules are just different in our house.  Don't sass me.  Wendy, can you go stand in the other room, please?  Give me your iPhone now.  Okay, if you don't give me your phone right now, then I'm going to have to take away your phone and your computer.  That's it.  No phone, no computer.  You go to your room right now.      We spend enough time together.  It's quality time.  What else did they say?  I know Joseph.  What?  That is not nice.  Who made him the judge of hot?  What a little fuckhead. I'll kill him.  That is cool. That's taking the high road.  I wonder what that means.  Aww. She's a good girl. She was polite, and she stood up for herself.  Shit. I thought she was coming in.  If she caught us, she would kill us.  What financial problems?  I thought we weren't supposed to hear for three weeks?  You heard.  How much have we lent him?  Did you say \"eight thousand\" or \"eighty thousand\"?  On the house?  Does Pete know that?  What are you going to do?  No, you said it was impossible.  Yeah.  You said that my fibroid was like a giant boulder, like the one from the Indiana Jones movies blocking up my uterus.  It's okay.  That's great.  What?  No.  That's good news. Another baby, at forty.  I am thrilled. And Pete is going to be so happy.  What a relief. I can finally relax now, you know? I'm so happy, I really am. It's good.  She's so cute. She's so tall.  Do you ever wish we had a bigger family?  Never?  Hey!  I'm Sadie's mom.  Sadie, the one you chat with on the internet?  Well, it was you, I saw your picture. Did you make a \"Hot\" list and not put Sadie on the \"Hot\" list?  You know what I'm going to do? I'm going to make my own \"Hot\" list, and you know what? You're on the \"Not Hot\" list. How does that feel?  Maybe you shouldn't be so comfortable with yourself. You know why? You look like a miniature Tom Petty. How's that feel? Huh? You think that haircut's cool? It's not. It looks like you put your Justin Bieber wig on backwards. You still comfortable with yourself? Why are you wearing a tank top? Huh? So you can show off your bald pits, you little hairless wonder? Cool tank top, man. So next time you think about writing something nasty on my daughter's Facebook page, just remember me. Remember me. I will come down here, and I will fuck you up.  Wait a minute. Hey. Are you crying?  I'm sorry. I'm not in my right head.  What did you say?  I'm not going through menopause! I'm not going to go through menopause for twenty years. I'm pregnant you little bitch. God damn it!  I'm going out to coffee with Desi to find out if she's stealing from us.  I don't know. Figure it out.  I just wanted to talk. Maybe we could go to a coffee house or something?  Who do you guys play for?  You guys are all from Philadelphia?  So, should we go to the quiet area?  We kind of have to have a little business meeting tonight.    Thank you.  You want me to come to the hotel?   Well, what would we do there?   Like, sex?   So you would do sex with me?   Are you hitting on me?   I'm sorry. I'm married, I have two kids, and I'm pregnant.   I'm sorry I didn't tell you. I'm just really enjoying you being so nice to me.    Thank you.  Why did you put that guy's teeth in your mouth? That's so gross. He was dirty.  That's true.  You did?  Can I ask you something stupid? Do you know why we're missing money at the store?  Like twelve thousand dollars.  Well, no. I did, but now I don't.  Then, why do you live in such a nice apartment and have such a fancy car?  Well, that's good.  Huh.  As long as you think it's safe.  So, who do you think is stealing money?  No.  Since you told me, I want to tell you something.  How did you know?  Wow. Maybe you should tell Pete.  I don't know. I just want him to want me. I don't want him to want me because I'm pregnant.  You think?  What are you doing?  What time do you have to go to work?  Want to be late?  Do you see me? Standing here in front of you? Half-naked?  And does that make you feel anything?  No, I'm not trying to start a fight with you. I'm trying to fuck you!  Whatever.  You know what your problem is? You're never in the moment, you're never present. You're never in your body.  You can't just walk away.  How's the record company going, Pete?  What have you heard?  Then why are you giving Larry money?  I know everything. I talked to the accountant.  Fine. It makes me feel sad when you are dishonest.  Okay. It makes me sad when it's so easy to trick you into lying because you're such a lying shitbag.  That's not a judgment. That's just a fact.  Well, it hurts me inside and triggers me that you're such a dishonest shit that you're lending your father money without telling me, while your record company is going bankrupt and we're on the verge of losing our fucking house!  What else are you lying about?  What are we even doing? This is not making me happy. You're not happy. You don't like me. I can feel that. I'm not blind. Jesus. We're like business associates. We're like brother and sister. There's no passion there.   I don't even know what that means.   What's wrong with Art Garfunkel? He has a beautiful voice.   What the hell are you talking about?   That's because Simon writes the fucking songs! He's the better one.   Would we even still be together if I didn't get pregnant fourteen years ago?  Would we?  Okay.  You know what? I don't even want to have a party here. You need to cancel it.  You have never been nice to her and now she's getting aggressive with you. I told you this would happen.  What do you think you're going to be like when you grow up?  Do you think you want kids?  Just one? Why?  Does it make you sad when you fight?  I love you.  You just admitted it.  You stole twelve thousand dollars from me, Jodi, and I need you to pay me back.  You babysat my kids while you were on Oxycontin.  Oxyconton?  What's oxykitten?  Jodi. You put me in danger. Me and my family.  Are you high right now?  I need to go.  Are you serious? I didn't. I would never. To a child? Your son has been defiling my daughter's Facebook page now for months.  He didn't say that.  You're just really scaring me.   Now you know what we're dealing with.  Why not?  Can you become a vegetarian tomorrow?  Yes, we have. We're supposed to keep an eye on you.  You were really sweet on your iChat. We were really proud of you.   That is not how we talk to each other in this house.   Okay.    Are you still upset about Lost?  She's becoming just like us.  Do you think there's anything we can do to turn it around?  Where did she learn that kind of language? We don't talk like that.  J.J. Abrams. He's ruining our daughter. That fucking geek.  All of a sudden we're like a magnet for negativity. Why do people keep attacking us? What did we do? We're just doing our best.  I think we're under enough pressure. Let's just let it go this time.  We can give each other a break.  We're not even mad at each other. We're mad at them.  Let's just take away our parents' power by loving them.  Yes.  I kind of feel better already, do you?  I love you.  It's not us, it's them.  I am so glad you're here. I need a buffer in case it gets weird.  Here, grab these napkins.  Pete wouldn't know what to do with that.  They look like pedophiles.  Hey, Pete!  Jason's here.  Hello.  Remember my husband, Pete?  Larry, this is my father.  Why didn't she come?  Hey guys.  What do you mean?  He is my biological father.  He and my mom had a baby and that was me.  Yes, well, that would make him your grandpa. Do you want him to be?  I wanted to make a toast. Thank you guys so much for coming... Pete's turning forty.  And we're ready to start this new phase of our lives with open hearts. Ready to just choose joy and forgive everybody, so thank you all for coming.  And live without resentments.  Well, you and my dad and others.  My parents divorced when I was really young and we don't spend that much time together and I'd like to work on that. Just like we'd like to work on how you have financial issues.  Are you really doing this right now?   Are you really about to hit up my dad for money?   You can't buy forgiveness, right Pete?   No. It's not good to borrow money from family members because it causes resentment, remember?   You have never once stopped asking us for money.   You know what? I would rather have my dad than your dad, because he doesn't drive me crazy. You know the best quality my father has? He asks for nothing. I don't know what the fuck he's thinking right now. Look at that. Nothing. I don't even know him. And I turned out perfectly fine without his input.   Don't play the Jew card, Larry.   Seriously, it's used up.   Can you be quiet? You just threw me under the bus.  I'm not ripping into your dad. I'm just saying to him what you say to me.  I am not a ball buster. You make me one! I am a fun girl! I am fun- loving! I am a good time Sally! I dance hip-hop. I cannot believe I've wasted my whole life busting the balls of people who have no balls. I am the only one here who has any balls.  What?  No, they're Barb's.  I'm not a smoker.  I wasn't smoking.  Since when do you care? You don't want another baby.  Sadie.   Shut up, Sadie!   Okay, Sadie. Shut up.   Okay, stop saying shut up!   Will you stop eating cupcakes, please! Stop eating cupcakes. Stop eating cupcakes!!   Debbie storms off back towards the foyer. Larry pops out from the living room, stopping Debbie in the foyer. Claire and the triplets are right behind him.   Well, I guess we're stuck together forever, then, right?  You don't even want a baby.  I should put that on a Hallmark card. That's beautiful.  I'm not forty.  How do you know?  That's not what she said.  I don't even know you. You can't just come into my house and reminisce.  Hey, wait a minute. You did leave. And you didn't come back.  So I ruined your life? I was eight.  You never said that before.  You sound just like Sadie.  The big one.  I know. It's weird. Where the hell is Pete?  Sure. Hi, Joseph.  Do you want a piece of cake?  So cute.  Dad? Excuse me. I'm going to go look for Pete. Would you mind staying with the girls for just a little bit?  If you don't mind. You don't have to.  That would be nice. Thank you.   Debbie drives around the neighborhood with Larry in the passenger seat.   Shh. Larry, please.   They drive near the scene of Pete's accident and overhear.    Debbie sees the punch and gasps, realizing it's Pete.     Debbie watches Pete fall to the ground. She opens the car door and starts to run over toward him.   What are you doing?  It wasn't a good party.  Is he okay?  Do you mean that in a good way?  Thanks.  He worries about you. It puts a lot of pressure on him.  You can talk to Claire.  No, she won't, Larry, she loves you.  Are you apologizing?  Thanks.  Okay.  What?    I only have a hundred.  I really liked our lives so much better before we tried to change everything. I'm sorry.  Are you mad that I'm pregnant?   You don't feel trapped?   I don't feel trapped.   No.   I never feel trapped by you. I'm so happy to be with you. I love you so much. You're my favorite person in the whole world. god damn it, why am I crying like this? Something is wrong with me.   Oh, yeah. Shit. I was just outside telling your dad that I liked him. What if he thinks I like him now?   I don't want him to think I like him that much.     We'll sell the house.   We kind of do.   We'll make new memories in a new house.   Is there anything you want to do for your birthday? It's been the worst birthday ever.   What?   Yeah.    How do we break you out of here?  Can you?  Let's get out of here, McMurphy.  I like this song.  Yeah. Why?  Why don't you sign him?  Why not? You're the best.",
        "Barb": "Coming.  You guys just go on without me. I'm just gonna... fuck.  Why do you need to have sex, Deb? Sex is the number one thing people fight about.  You stop having sex, there will be no more fights. I am living proof. I have no sex, and I am the happiest I've ever been.   I'm enjoying our non-sex period, that's all I'm saying.   Well, I wouldn't know, because I don't have any feeling down there anymore. I have nerve damage from my C-section so everything is just kinda-   I could sit down hard on a fire hydrant, and I wouldn't even know that I was sitting. I could get stung by a hornet down there, and I would not feel it. You could put anything in there, and I would not know what the object was. I used to pee in a nice stream, and now it just kind of goes like a shower head.   I would. I wouldn't feel it but-  Well, I'm ready to buff.  You're comfortable with that around your husband?  Wow, what kind?  I'm going to light the candles. Get it going.  Deb, you can't smoke, you're pregnant. You've been doing so well.  I'm sorry. I'm so sorry. It just slipped out.  Your dad's still here.  They are so cute.  He looks exactly like Tom Petty.",
        "Sadie": "Pete sneaks down the hallway. He kisses SADIE  as he wakes her. She wants to be left alone.    Your breath smells weird.  You can't handle Lost. It's too violent, and you won't understand.  Because you're eight.  Shark Week is fake.  All of it is reenactments.  That's scary! You shouldn't be allowed to watch that.  It's going to give you nightmares.  Mom!!   Sadie tears apart her closet looking for clothes.   Mom! Why can't I get new clothes?! Nothing fits me!! God damn it!!  I've only watched eleven. I have eight more and then I'm done.  A hundred and fourteen?  It's not melting my brain, it's blowing my mind.  My relationship with Lost is not your business. It's extremely personal.  Stop it!  Stop it! Stop!  I think he went to poop.   Pete and Debbie walk in mid-argument. Sadie is listening to a song on her iPhone.   This is bumming me out. This isn't fun.  Charlotte! I've got a test!  Charlotte, I'm going to kill you!   Charlotte jumps around in front of Sadie's door. Sadie sits on her bed quietly doing homework.   Charlotte. I'm doing my homework.  Charlotte. How many times do I have to tell you--  Close the door.  Charlotte, where is my backpack?  Mom, I can't be late for school, I have a test!  This isn't funny, Mom. I need to go.  That's not going to help.  I didn't!  She's faking!    How are we going to go on the computer?  You can't do this. You can't take away the wi-fi.  So you won't see me after five years?   I don't want to be friends with her now. I'll be friends with her when she's twenty and a normal person.   What?   Make a fort?! Outside? And do what in the fort?    Nobody plays with sticks.  Nobody does that crap. It's 2012.  I don't need to be monitored all the time on the computer. I don't do anything bad.  I don't do things I'm not supposed to. I don't illegally download music. I don't look at porn like Wendy.  I'm not hungry.  I need to use it for my homework.  Mom! Charlotte's crying. She's got an ear infection again.  Hey, Mom. We were wondering if we could use the computer to iChat.   Yeah, but I have a friend over.   Wendy's mom lets her go on whenever she wants.  But I get better grades than Wendy.  Your rules are ridiculous.  I'm only sassing you because you're throwing out all the food in our house and I'm freaking starving. You're being stupid.    I have all my contacts in there.  Jesus Christ--  I need my computer to do homework.  This is B.S. This is a bunch of F- ing S. You're acting like a B.  Can you please stop licking your fingers?  Do you know how many germs are on your hands? And you're putting them into your mouth. It's gross. Stop.  I'm going to kill you!   Charlotte walks by Sadie's room. She puts the note up on the door. It reads, \"I'm sorry you think I'm gross. You are right. Love, Charlotte.\"    Stop, Dad.  You guys have been reading my texts?  Joseph told me that you flipped out on him and his mom and that you guys are nuts, and I agree.   You're the ones who are disrespectful. Reading my texts is like reading my diary.   Fuck you!   You guys talk to each other like that all the time! And to Joseph and his mom. You made Joseph cry.   Shut up, Charlotte. You guys so desperately want me to be perfect and to make no mistakes. Well, you two are fucking insane.   All you do is fight. Or you don't fight, which is even worse because it looks like you hate each other for weeks. You obsess over every little thing I do, and you don't trust in me or believe in me. Well, I'm fucking sick of it! Yeah, I said \"fuck.\" Fuck fuck fuck. Ground me forever I don't care. I don't care about anything. I hate everything, everyone's going crazy, I don't care if I have no friends.  Of course I'm upset about Lost! You guys took away my shit before I could watch the last two episodes! I don't know what the fuck happens!   Sadie does her homework on her bed. Charlotte brings in Sadie's electronics and puts them down in a pile beside her.   Where did you find these?  Thank you.   The shades are closed and the room is dark. Sadie watches the end of the last episode of Lost on a laptop. Pete enters.       Jack, Kate, Sawyer...  Jin, Sun...  Walt, Juliet. All those people.  I don't make fun of your stupid Mad Men.  That's because Mad Men sucks.  A bunch of people smoking in an office, it's stupid.  Mom. Who is Oliver?  Oh, so you're our grandpa.  Mom?  Mom! What are you doing?  You're smoking? In the front yard?  Mom! Since when have you been a smoker?  I thought you said smokers die.  I saw you.  No f-ing way. I don't want another sister.  We're not going to have an Asian baby.   They're not Asian.   Shut up, Charlotte.   Shut up, Charlotte!   Shut up, Charlotte!     Where's Dad going?  Mom, is it okay if Joseph hangs out here for a while?  Then you shake it. And then a restaurant comes up.  I'm going to let you watch Lost. Come on.  I'll cover your eyes if it gets too scary.  See, it's not sad, it's happy because they helped each other achieve their destiny.",
        "Barry": "Hey, thanks for letting me join this team.  I know, I know.  I mean that was idiotic. You have to understand. That's like the one thing you don't do is tell her you used Viagra. I think that's even on the warning label.  Don't worry about it. You just gotta ride that out.  I have given it a fair amount of thought.  Absolutely. It has got to be peaceful. I mean this is the mother of your children.  Then you move on. Then you're a widower.  They love widowers. It's like the polar opposite of divorced guys.  It's like, oh, that poor widower. You know. If I could only--  ...make him happy.  ...cocksuck away his sadness.    So that's the girl who works for you.  Seems nice. My wife would never let me have a hot employee like that.  Everyone that works for us looks like they've been in some kind of horrible accident.  You think our wives are looking at us right now?  What do you do in Chino, Oliver?  My mom used to talk to me like I had scoliosis because I'm a little hunchy, but that's a different thing.    That's right. You can't use it up, it goes forever.",
        "Jason": "Come on.  You've got to keep up with us, sweetheart. That's why your body looks like your body and her body looks like her body. Before, after. Before, after.  So why on earth is Pete taking Viagra? What's going on?  That is ridiculous. If you were my girlfriend, I would not need a Viagra. I would need an anti-Viagra pill. To try not to get a boner.  Don't sell yourself short like that. You give me a boner. Barb doesn't give me a boner.  I knew it. I knew you were not having sex. I can see it on your face. It's all puckered and pained.   Don't you miss it?   That is the saddest thing I've ever heard.   No, I think I want to Clooney it.   Yup.  Yeah, he is.  No, he's not.  Aw, you sweet little thing. He's doing sad, lonely eyes. To get the next lady. I can do it too, watch.  You'd fuck him.  So would you.  You'd fuck him with your numb vagina. Yes, you would. Ocean's thirteen inches, that's what you'd find out.  Peter, hi.  Great, you look well. How do you like what I've been doing to your girl? How do you like Debbie's after body?  Come on, show `em. Look at this. It's beautiful. Look at that after- ass. Now it starts here, but it used to start here. And I brought it up. You're welcome.  Yes, well, but not just physical. Spiritual. I'm sort of a guide.  Who's that in the pool?  Oh, hi. I did not see you there.  No, we didn't come together. Absolutely not.  That's fair.  The smell.  Oh, boy.  No, sir.  That's such a shame. That's as bad as it gets.  I'm a Cancer.  Is that good?    You are a beautiful woman, but you are not totally maxed out. I would say honestly, you're a six. Six and a half. I could make you an eleven.  When I found Deb, she was a seven. And now she's a twelve.  You can't be lazy.  Look at me. You cannot be lazy.  Do you know how she got her body? Bodies By Jason.  Say it.  Say it again.  And now just say Jason.  Again?  That sounds right, doesn't it?",
        "Charlotte": "Pete lifts a sleeping CHARLOTTE  out of bed and walks her downstairs. It looks ridiculous because she is too tall to hold her like she is a baby.    Can I watch Lost?  If I don't understand it, why can't I handle it?  I can handle it. I've seen a shark eat a guy on Shark Week.  No, it's not.  I know but they--  --they show the reenactments but they actually happened.  I can handle a nightmare. You're a nightmare every day for me.   Charlotte plays the theme from The Office on her keyboard.   Sadie's watching Lost.  I don't understand the words.  Well, we don't want one.  I'm coming! I'm coming!  No.  No.  She's evil.   As they walk into class, the teacher pulls Debbie aside.     Okay, watch this. There's a haunted cow back here, and I'm pretty sure it does not have milk!  Did you see that? They took me away!  You're no fun. You never want to play.    You're so mean since your body got weird.  Hello?  Why are you locking the door? Mom!  What's going on in there?  Mom, let me in!  Sadie hurt me!      I don't want to hang out with her when I'm in my twenties.   No technology!  What's porn?   Charlotte is crying really hard.   I just want to rip my ear off, it hurts so much.  Can I go show them my crystals before they leave?   Charlotte plays piano in her room alone. Through the wall, she can hear Debbie and Pete fighting.    I'm sick of everybody fighting.   Charlotte writes a note at her desk.     Debbie rests next to Charlotte in bed.   I don't know.  Just one.  Because if I have two then the one will fight with the other one.  I don't want anyone to fight.  Why isn't anybody talking? Why is it so quiet?  How many of those are you going to eat?  I'm going to tell Mom on you.  I'm not going to eat that chicken.  Because I feel like I'm going to be a vegetarian.  No.  Joseph has a crush on you. You like a boy who cries.   I hope I never get my period if this is what happens.  I stole them.  No big deal.  Is he your dad?  What does that mean?  Yes. Then we get another grandpa. Come on!  Mom, you're smoking?  You're pregnant?  I don't want her as a sister.  I want an Asian baby.   Yes, we are!   We'll buy one.   You shut up!   Shut up!   Is it scary?  Great. I'm going to have some freaky ass nightmares.",
        "Jodi": "You're a ball of shit.  I think it's probably Desi. She's been having a really hard time using these simple computers.  It's because she's stupid. I think she might be stealing.  Well, how much did I make?  That's not bad.  I didn't know what to do.  Where do you think? I don't want this to sound harsh, but everything that comes out of her mouth is a lie. Everything that comes into it is a dick.  A dick.  I'm sorry, I'm just being protective of the store.  Why the fuck would you believe Desi?  Did I?  Can you at least give me a referral?  Oxycotton.  Oxykitten.  Meow.  It was a cry for help. Help. Help. Why don't you help me? Just help. Help. Why don't you help me?    Is that about me? Is that the cops? Is this a set-up?  Okay, see you later. Fuck you, Debbie. Fuck. You.",
        "Graham": "It isn't.  Hey guys, how are you?  Yeah. Jewish Journal guy loves the record.  Got a bit of a problem. Touch of gout.  Yeah, my whole family, they all had gout.  My auntie Queenie, she had a foot like the size of a small pig. I've got a photo of it.  A couple of bunions as well.  I've got to go to the podiatrist, and I hope he can shoot me up with something.  Rock and Roll, baby.  Pete! How are you, man?  Happy? How's it looking?  Ah, so you were expecting it to sell. They never sell anymore. They used to sell. But now they don't. I'm not a sexy sixteen-year-old girl.  No, I'm going to be fine. My overheads are so low. I just got a song in Glee.  Guy in the wheelchair is going to sing it to the Asian girl, I believe. I don't know, I've never seen the show, but that's what I'm told. Secret is, make sure you have a small nut. That's the key to life.  Billie!  Inspired, huh? That inspires me.  Let's get a drink.",
        "Parker": "",
        "Pete": "Oh my god. So incredible. Want to know a secret? I took a Viagra.  I took a Viagra. Those things totally work. This is awesome. Why don't I use this every day?  What's the matter?  I thought it would make it better. It was better. It takes some of the pressure off.  I thought you'd think it was fun for me to supersize it for once.  I was just trying to go turbo for your birthday.  My hard-ons are still in analog. This shit's digital.  Look, I can get it up. Just not that far up.  I got it from Barry.  Why do you care? This is my dick we're talking about, not yours.  I only took it because it's your birthday. I thought you'd like it. Happy fucking fortieth birthday.  I don't have to take it every time, but once in a while...  Wake up, wake up. Time to get up.  We're ready!  Make a wish!  What?  This cupcake? You think I'm going to eat this cupcake?  I so don't want this cupcake. Look.  I'm going to eat this cupcake?  What would you like to do today? Your choice.  Yeah, anything.  Don't you want to get a massage? Or do something fun? Forty's huge.  Okay. Thirty-eight. We'll move on. Isn't it weird that our birthday is the same week and that we're going to have a party, and it's just for me?  Come on. Do you really want to be one of those ladies who's just so insecure about their age and they lie and then they've got to remember.  That is so insane, it kind of makes sense.  I thought you said that we shouldn't get each other gifts this year?  Hey, did your father call to wish you a happy birthday?  It's not really a team, it's just a bunch of guys who get together and ride.  Bike lane, asshole! It's always the guy in the fucking Infiniti.  We're in one of those phases where everything the other person says just annoys the shit out of each other. All the time. It's a blast.  This sounds terrible but do you ever wonder what it would be like if, say, you were separated by something bigger, like death. Like her death?  Not in a painful way. Just quietly slid into death. Like a gas leak.  I'd want it to be a peaceful -- just like, drift, into a coma, from which she never awakens.  That's just it. People love widowers.  It's the best.  Somehow...  Somehow ease his pain.  Did you know that the Pixies did this song about a Salvador Dali short film called \"Un Chien Andalou\"?  This song kicks off Doolittle, one of the best albums of the last thirty years. An important record.  How many are there?  Are you kidding me? You can't watch over a hundred episodes of a show in five weeks. It'll melt your brain.  It's your birthday, you don't need to go to the store.  All right, five minutes. But then I'm pulling you out.    I don't think she's wearing underwear.  It's all dark up there.  I didn't mean to look, I just said, `Hey- woah!' There it was.  Yeah. Maybe she has underwear that has a picture of a vagina painted on it.  Going to the bathroom.  Oh, I'm almost done. I'll be down in a second.  Oh, that's great.   She'll do it again.   Give me a break.   It's not my instinct to escape from you. It is my instinct to come into the bathroom when I need to go to the bathroom.   It's because I shoved an Altoid up my ass before I came in here.   What?   No, I'm not going to let you see.   I've been flushing as I go.    Don't press Enter! I'm not sure I want to make that move!  You know, when I started this label, my dream was to work with musicians and bands whose music I just admired so much. The person that I thought, \"My god, wouldn't it be incredible to work with\" was Graham Parker. Tonight we have him. Solo. Because we couldn't afford to fly in The Rumour.  Really. What is your kind of music?  Oh, god, of course you do.  Shallow dance music.  You know, you don't have to like it. It's really not for you, that's fine.  Graham Parker and The Rumour had two albums in the Rolling Stone Top 500 Best Albums of All Time. Two of `em. If I can just sell ten thousand records to his hardcore fan base, we're golden.  Now, something that really rocks.  This is called good music. From somebody's heart.  Just listen to these words, okay?  This is lyrics, this is poetry. This is what is going to survive in a hundred years.  It makes me happy. I can dance to it.  Sometimes, I wish just one of you had a dick.  Yeah, I'm ready to help. Just tell me what to do.  For me or for them?   Pete paces around his office on the phone.    Oh, god. I can't tell Debbie.  She knows it's bad, but she has no idea just how bad.  No. Debbie's not really into selling the house.  Okay. Bye.  Paul McCartney.   You know what, enough of who fucked who and who finished what.    Look. It's a retro label. That's our niche. That's our market. It costs money to break new bands, I can't do that.  Everyone turned down Arcade Fire.  We don't have the money to market a new band. We just need to make Graham seem relevant. Who is he talking to?  The Jewish Journal?  What is he wearing?  Why?  Look. The Paul Westerberg record did okay. Frank Black did all right. The Haircut 100, not so much. We have to break this record. Otherwise, we're not here next year.  Great!  Gout?  Jesus.  Yeah, well, let's get you to the podiatrist.   Pete and Debbie are talking. Debbie holds a list of changes she wants to make.   Says who?  Huh.  What?   Yeah.   No, I'm just processing it all.   That's a little pricey.   Yeah, that's good. You should do that.   Yeah, I think it would be good if you could take care of your anger.   That's what I said. Our anger.    Yeah, you've got to cut that out.   Sorry.   So, you're saying that if we're arguing and I apologize, you'll let it go and not throw it back in my face later?   All of that. That's plenty. That's a lot.   Oh, yeah. I've been doing a decent job, but I don't think there's anything wrong with having some fries every now and again.   That's not the same thing.   I like fries.    No, I haven't been giving him money for years, I told you.  You sure you don't want to just do a joint birthday party?  We always used to.  Are you serious?  How much?  Oh, god. And Desi's taking it?  We really need the store to work.  That's not what I mean.  Yeah. Maybe we just suck it up because she's clearly earning so much more than any other employee we have.  That's why we have to keep her.  That might be like a dry hump.  That's too grainy to know for sure. Oh my god, this is the middle of the day. Customers could be in there.  What did you say? \"At least she's getting some\"?  What are you talking about? We had sex the other night. You have to give me a little credit for that.  That's not passion.  What--  What is she doing?  What am I doing?  I'm not, it's the springs.  I don't know what you're talking about.  No, that's great.  Your face is close to my face.  Do you have to breathe right on my neck?  Getting ready to go for my ride.  Yeah. Why?  Well, happy to help.  Mom's busy!  Mommy can't talk right now!  Put on your shoes. We'll meet you in the car.  Hit her back!  Go downstairs.    God damn it!  No. Don't forget it. Don't forget it. Don't. Oh, god.  That's loud.  Yeah, I'm growing it out.  How's business?  I know how you feel. You know my business is going through some growing pains right now.  Look, I wanted to talk to you about scaling back a little bit. You know, Deb and I are thinking about selling the house.  Yeah. In the meantime, I'm going to have to make some changes. Going to have to cut back.  With you.  I can't lend you any more money.  What about Claire? Why can't she get a job?  Well you've got to figure something out because I can't do it.  Why would you have three kids, anyway? I mean, you're sixty years old. You have no money.  What?  Oh, Jesus Christ.  Really.  So how much do I owe you for saving my life?  I think it looks great.  What is that, grilled cheeses?  Yeah, dressing always gets in the way of the natural taste of the lettuce.  Yeah, we'll supervise that.  You've got the perfect friend right here.   You're on your computer too much as it is. You need to get outside more.   You and Charlotte can have a lemonade stand.  Look for dead bodies.  Get a tire and then take a stick and run down the street with it.  No, she said \"corn.\"  Listen to your mom.  She's outplaying us.   Pete and Debbie drive down the Pacific Coast Highway.   It's good to get away, you know? We haven't been to Laguna without the kids in years.    If we're happy, they're happy.  Them's little bitches.  God no. They're selfish assholes.  I know.  Nah.  I don't know, it makes no sense at all.   When we get in a fight, look in my eyes. Let's remember this moment right now and know that we never have to fight.   I know, I am a dick sometimes. People think I'm so nice, but I'm such a dick.   And you get so mad at me. I feel like you want to kill me.   How would you do it?   I love it.   Me too.    See? You know what I love about us? You can still surprise me. I figured for sure you'd knock me out with one fell swoop. But you would extend it over a series of months.  Oh, yeah.  Sure.  Wood chipper.  Did you see Fargo?  It is. You know what? I won't murder you.  I love you too... Hey. You know what I brought?  A medical marijuana cookie. Ben gave it to me last Christmas.  Chocolate chip koo-kie.  Let's eat the cookie, and then we'll order a bunch of cheeseburgers. Let's order the entire room service menu.  Wouldn't you rather have me around for less years and I'm incredibly happy than longer and miserable?  Should we get a block of porn?  Yeah, but you know, two porns cost about as much as a block.  We don't have to watch it all, but for the value it makes sense.  I don't know. I think like six or seven cookies, right?  Potency?  I mean, girls have it so easy. You just show up with your sexual organs and you're good to go. All the pressure is on the guy.  And I look at guys, like I look at a guy like Prince, and you know that guy fucks. I know I don't fuck like Prince. Prince can fuck. I fuck more like David Schwimmer.  I fuck like Ross from Friends.  How does he do it? The floating spoon.  Check it out. My dick and balls. I'm going to eat my own dick!  I ate my dick!  I think this room has rodents. I just saw it!  Have you seen my starfish? Where did I put my starfish?  I want to make out with you so bad.  That was nice.    Oh, come on. You can't blame it on our doctor. Ear infections are common in little kids.  If she's in this much pain, we should call a real doctor.  Okay.    Oh, she can eat fr-r-ruits.  Any kind of fr-r-ruits?  It isn't like there are safe fr-r- ruits and then unsafe fr-r-ruits.  What about F-r-r-rench f-r-r-ries? Can we do something like that?  I'm okay.  No.  I don't want to get on the table.  I need you to look at something. In my butt.  I think I've got something in there, and I'm not limber enough to see. I need you to look at it. I might have like an anal fissure or a hemorrhoid or a worm or something.  Trying to take pictures of it, so I can compare it to something on Google.  Look, I saw you have two babies, okay? Seriously, I need you to get all up in that.  It's payback time.  Thank you. Now erase that from your memory.  We expected more. I mean, I know it's a bad market but that's still way under what we were looking for.  I doubt it. I don't know.  She has unrealistic expectations.  Some kid named Joseph--  You do? He's making a \"Hot or Not\" list.  So, Sadie said, \"That's so   lame and immature that you're doing   that.\" And then Joseph says, \"Yo,   girl. We're just having some fun   so don't be a bitch, yo.\"  So, then Sadie said, \"Don't call me a bitch.\" And Joseph said, \"I didn't call you a bitch, I said don't act like a bitch. And by the way you're in the `Not Hot' column.\"  Do you realize what that could do to her self-esteem?  So then Sadie said, \"You're in the jackass column. I've got to go. I'm bored of you.\"  For some reason, there's an emoticon of a panda doing push-ups.  I don't think it means anything, I think it's just adorable.  That's pretty cool.  What?  Oh my god, that scared me to death.  I've got to make a call.    Wait a minute. There are no zeros after that?  How is that even possible?  We're fucked! Here's the deal. I want you to meet me tomorrow morning at eight o'clock. I want a list of at least thirty ideas of what we can do to change this.  We have to change this. I started a record label because I couldn't get a job, so I have no other options.  What are you doing?  If you spent a little bit more time focusing on Graham Parker instead of drawing album covers, I wouldn't be in this predicament.  You're supposed to help me with him!  You're supposed to call the companies, you're supposed to get people to the show!  What should we do? I'm out of ideas.  With what? I can't afford it.  What did you call me?  Don't talk to me about responsibilities. I have a life. I have a family. I can't afford to sit in my apartment getting high, jerking off, and then going to Tommy's Chili Burgers at three in the morning.  I have everything to lose here. Everything.  If you want to sign a band, you have to look like you're the real deal.  You know what? Fine. Fly in The Rumour. Put it on my AmEx.   Pete takes a framed item off of his wall.    Hey, why are you in a bathrobe? It's the middle of the afternoon.  Something that might help both of our situations.  This is a drawing by John Lennon. I got it ten years ago for five thousand dollars. I don't know how much it's worth now. Could be five, could be twenty.   It's not for you to hang up. It's for you to sell. That way I can give it to you and you can make some money, and Debbie doesn't know that I'm giving you anything.   Just sell it online. Do some research, make some calls. Or is that too hard to do with your high blood pressure?   It's incredible. John Lennon drew it.   Don't take less than sixty-five hundred for that. It's very valuable. It's important to me. I want you to sell it so I can help you.   I'll see you at my party.  No. Don't buy wine with my money and give it to me at my party.  I love you. Bye.  I know. How did that happen?  No, never for a second. Never.  Never. I love what we have. One? A breeze. Two? Brutal. Three? Put a bullet in my head.  I think about that gray-haired pregnant lady from school and I just feel bad for her. And I feel bad for the kid. Can you imagine? All the other little kids, \"Where's your mommy?\" \"Oh, she's the one sitting in that scooter eating a soft cracker.\" Kids don't want to have old parents. You know, it would also be nice for us to spend some time apart. Kind of rediscover who we are individually. It would be so great to not see you for like a chunk of time so that I could really just miss you. Remember when we used to miss each other?  I've got the Graham Parker concert. Who's gonna watch the kids?  Thank you so much for coming, this is so exciting! For the first time in over thirty years, Graham Parker and The Rumour.    What's press turnout like?  Nobody is here?  Yeah, Billie Joe, I emailed him. He's a fan.  No, he says he doesn't want to do any press, he's just watching the show.     Well, the first numbers came in.  About half of your last record.  But I wanted to sell it. It's such a good record. I feel like I let you down.  Graham, I don't have small nuts, all right? I have big nuts. And I need to provide for them.  No. I'm fine. You guys go. Congratulations on Glee.  I'm returning some emails.  Like ten minutes ago.    Yeah.  Come on. Are you trying to start a fight?  Oh god, you know what? Today of all days you need to give me a break, all right?  I didn't realize it was intentional! I didn't say anything because I didn't want you to be embarrassed. I thought I was being gallant.  All right, fine, I'm an asshole.  That's not true. I am in the moment. You know how I know? I want to get the fuck out of the moment. I swear, I can't win with you.    What? Not great. I'm still waiting for numbers to come in.  A couple numbers have trickled in. It's lower than we expected.  What?  All right, you know what? I don't want to get into some nasty fight. So can we please talk to each other like the therapist told us to talk to each other?  I understand it makes you feel bad when I am dishonest with you.  It hurts my feelings when you treat me with contempt and corner me and try and trick me into lying.  You can't do that. The therapist said you're not allowed to judge me.  Fair enough. Sometimes I withhold truth, that is true. But it's only because I'm scared to death of your crazy-assed illogical overreactions.  I've taken Viagra for two years. I ate six muffins downstairs a while ago and my cholesterol level is 305. My heart could explode at any second. These might be my very last words.  And I gave Charlotte antibiotics when you weren't looking. That's why her ear got better. So, go fuck your witch doctor.   We're not like brother and sister. You know what we're like? We're like Simon and Garfunkel, and somehow you turned me into Garfunkel.   Art Garfunkel.   He's got an amazing voice. He could put a harmony to anything, but what I'm saying is that you turned me into him.   Simon controls him.   You know what? I see the way you look at our kids. You have so much love and compassion for them. You never look at me like that. Ever.    I'm not going to go down that road.  No, I'm not. I already paid for the catering, I put down deposits, and I`m not going to call everybody back in two days when change your mind.  Hey! Sadie, enough! She isn't hurting anyone. If you want to say something, keep your mouth shut.  It's the sounds of silence.    It was long ago and it was far away, it was so much better than it is today.  As many as I want.  Try it. See what you get for Christmas. Nothing. Snitches wind up in ditches. Remember that.  Hey.    Sorry. Hello, Joseph.  I hear our kids have been chatting online.  Excuse me?  Okay, why don't you back the fuck off, because that's my lovely, sweet wife you're talking about.  Yeah, you need to back off because your kid is an animal. Why don't you put him on a leash?  If he insults my daughter again, I'm going to hit him with my car. Got it? In fact, if you insult my wife again, you know what I'm going to do? I'm going to show up at your house when you're sleeping, and I'll take your iPad and your iPod or your iMac and I'll shove them up your fucking iCunt. I've got nothing to lose. Your kid is the problem. My kid is a fucking angel. I don't have time for this shit.  So I'm keeping it together. But if I wasn't at school right now...  I didn't touch you.  I didn't. I got right below your shoulder.  You're insane.  I poked you on the shoulder.  I touched your shirt.  Your shoulder, your shoulder.  Hello! There are children around.  Absolutely.  Who's Tom Petty?  That's ridiculous. Who talks like that?  What I said was that we need to keep an extra eye on our kids because with all the technological advances, they need to learn to use them responsibly.  A what?   No, we haven't.  How did you find out?  Don't be disrespectful.   Yeah, we were going to give you your computer and phone back.   Okay, there's the first official \"Fuck you.\"   Our kids are crazy. And it's our fault.  Sadie's thirteen. She might be a lost cause.  I have no fucking idea... Do you think Sadie is this crazy because of us? Or is it hormones and Lost.  I feel bad for us.  Should we talk about our fight?  Yeah.  Great. Thank you. And I'm sorry about my dad. You're right. I'm sorry that he's just an endless mooch. The truth is, this isn't about us. It's about our parents.  Exactly.  Can we do that?  Thank god.  I do.  I love you too.  Totally.  What are you doing? We need to get ready for the party.  We don't have time for this right now. We have a lot of people coming over--  What?  I don't care about the show right now-  Okay? I need you to just get in the shower. Get dressed. Let's just put it on hold.  Don't think about Lost today. Tomorrow: Lost. All day. I can't wait to hear about it. Jack? No way. Really? Right now, shower.  First of all, I don't get worked up over Mad Men.  What Don Draper has gone through beats whatever Jack is running from on some island.  You're getting me off topic. Please get dressed.    Yeah, that's her.  Oh, definitely.  Hey, how's it going?  You guys should talk. I think you'll get along. Come here, honey, I have to tell you something.    Thank you so much.  Oh, wow. You know, I hope it hasn't expired.  No, I know. Thank you so much.  Dad, you want a drink?  White wine? Okay, heavy stuff.  Weird.  I think she just meant generally. You know? Put the past behind us.  I don't think anyone's looking for handouts... We'd pay him back.   Yeah.    It's true. Family helps family. Look, I don't expect you to fully understand. Your dad left. You're broken inside. It's not your fault you can't feel love. There's something that you can't -- this is coming out wrong.   Great. What a big surprise. Bye Oliver. See you later. See you in another seven years. Make sure to say goodbye to the grandkids, who you met today. You know, nothing I do is right because of you? Nothing. No matter how hard I try, I'm just the asshole here, but you know what I realized? It's you. You're the asshole.  No. We agreed to let go and forgive, but then you started ripping into my dad like a crazy person.  Don't be such a ball buster.    You have no idea what I want.   Since when are you pregnant? When did you find out?   Weren't we always?  Of course I do. I never said that. Look, I didn't want one if I could choose.  Best birthday ever!  Fuck you, you Twilight pimply-ass motherfuckers!  Go around!  Watch it!  Yeah. The best!  You opened your door on me.  I was right there! You are supposed to look before you open your door. I was in the fucking bike path.  Pay attention!  You're supposed to look to see if a biker is coming through. You're supposed to look!  No one is ever looking out for me!  Why?  Fuck you!  Why don't you pay for my bike -- and my face, you fucking prick!    \"Range Rover of Sunland.\"  Ow.  No. I'm sorry. I don't want to keep anything from you. I love you. You're my wife. I just didn't want to let you down.   No. I'm not mad. I'm thrilled.   Sometimes I feel like I trapped you.   Really?   You should, because I've trapped you. You can't go anywhere. I'm going to get you pregnant every ten years for the rest of your life. You can never leave me. Ever.   You're pregnant.   No, he won't think that.    It'll never happen.   I have no idea. How are we going to afford it?   We don't have to.   We kind of do.   I love you.   There is one thing, but I don't think you'll like it.   I wouldn't mind going to see some music. Would you want to do that?   Really? I don't believe you, but you're sweet for saying that.  I can just leave on my own volition. It's not a mental institution.  It's not like One Flew Over the Cuckoo's Nest. Please don't put a pillow over my face.  You got it, Chief. Will you carry me?  Really?  Ryan Adams? No, he wouldn't sign with me.  Well, he is in between labels. Let's go try and talk to him after the show."
    },
    "imdb_rating": "6.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BNzQxMDQ1NjA4N15BMl5BanBnXkFtZTcwNTE5MjQ3OA@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Pete (Paul Rudd) and Debbie (Leslie Mann) are turning 40. But instead of celebrating, they're mired in a mid-life crisis with unruly kids, debt and unhappiness mounding. Pete's record label is failing and Debbie is unable to come to terms with her aging body. As Pete's 40th birthday party arrives, Pete and Debbie are going to have to rely on family, friends, employees, fitness trainers, aging rockers and ultimately each other to come to terms with life at age 40.napierslogs",
    "name": "This Is 40",
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ]
}