{
    "filename": "Thor-Ragnarok_script.txt",
    "imdb_id": "tt3501632",
    "imdb_url": "https://www.imdb.com/title/tt3501632",
    "characters": [
        "Volstagg",
        "Bruce Banner /Hulk",
        "Heimdall",
        "Loki",
        "Hela",
        "Thor",
        "Surtur (voice)",
        "Topaz",
        "Valkyrie",
        "Odin",
        "Skurge",
        "Doctor Strange",
        "Grandmaster",
        "Hogun",
        "Korg (voice)"
    ],
    "dialogues": {
        "Volstagg": "Who are you!? What have you done with Thor?",
        "Heimdall": "Excuse me.  Sorry about that. These bloody things are everywhere. Come on.  You'll be safe here.  I see you. But you are far away.  Come see for yourself.  I'm providing refuge in a stronghold build by our ancestors. But if the garrison falls our only escape will is Bi-Frost.  We won't last long if we stay.  She draws her power from Asgard and grows stronger everyday.  Come on.  Hela is ravenous. If I let her leave, she'll consume the Nine Realms and all the cosmos.  We need you.  You're on a planet surrounded by doorways. Go through one.  The big one!  Asgard. She's here.  We must keep moving! Go to the Bifrost!  Go back!  We must cross now! To Bi-Frost!  Welcome home. I saw you coming.  You saved us from extinction. Asgard is not a place, it's a people.  So, King of Asgard.  Where to?",
        "Loki": "Oh, brother. This is it.    I take my leave.  I'm sorry.  Sorry for all I've done.  I'm sorry I tried to rule Earth.  I'm sorry about that thing with the Tesseract. I just couldn't help myself.  I'm a trickster.  Sorry about that time I turned you into a frog.  Tell my story.  Build a statue for me.  With my helmet on, with the big bendy horns.  I didn't do it for him.  Alright, I yield!  You had one job!    Just the one.  You just couldn't stay away, could you? Everything was fine without you. Asgard was prospering You've ruined everything. Ask them.  You had what you wanted, you had the independence you asked for!  Ow-ow-ow! Alright! I know exactly where he is.  I swear, I left him right here.  How was I supposed to know? Can't see into the future. I'm not a witch.  Hey.  I'm honored.  This... isn't me.  ...I have been falling...for thirty minutes!  Handle me?     Who are you?  ..you think you're some kind of sorcerer? Don't think for one minute, you second-rate...  Brother.  Perhaps we can reach an arrangement.  Beg your pardon?  Bring us back!  There was a wormhole in space and time beneath me. At that moment, I let go.  Excuse me one second.  What?   You're alive?  What are you doing here?  I didn't get a chair.  I can't.  I've made friends with this man. He's called the Grandmaster.  I've gained his favor.. The Bi- Frost brought me out here weeks ago.  I've never met this man in my life.  Adopted.  -for those that have died the    -for those that have died the glorious death.                  glorious death. Reveal Loki standing across the cell.   Thor gives him a hard look.  It hurts, doesn't it? Being lied to. Being told you're one thing and then learning it's all a fiction.  You didn't think I'd really come and see you, did you? This place is disgusting.  Does this mean you don't want my help?  Look, I couldn't jeopardize my position with Grandmaster, it took me time to win his trust. He's a lunatic, but he can be amenable.  What I'm telling you is, you could join me at the Grandmaster's side. Perhaps, in time, an accident befalls the Grandmaster, and then...  You're not seriously thinking of going back, are you? Our sister destroyed your hammer like a piece of glass. She's stronger than both of us. She's stronger than you. You don't stand a chance. Do you understand what I'm saying to you?  Fine. I guess I'll just have to go it alone. Like I've always done. Would you say something?  Say something!  You know, I haven't seen this Beloved Champion he talks of, but I've heard he's astonishingly savage. I've placed a large wager against you tomorrow. Don't let me down.  I have to get off this planet.  Yes! That's how it feels! I'm just a huge fan of the sport.  Grandmaster, I-  My dear friend, if you were to give me twelve hours I could bring them both back to you.  I could do it in one.  What have you done!?  It's Loki. And you will answer to the Grandmaster.  Why would you help my brother escape with that green fool?  You're a Valkyrie. I thought the Valkyrie all died gruesome deaths?  Terribly sorry. Must be a very painful memory...  Surprise.   Hello, Bruce.  It varies from moment to moment.  I don't mean to impose, but the Grandmaster has a great many ships. I may eve have stolen the access codes to his security system.  Heavens, no. I've run out of favor with the Grandmaster.  And in exchange for codes and access to a ship I'm asking for safe passage...through the anus.  Yes, brother. I can.  Why not set the beast loose?  I disagree. Open communication was never our family's forte.  Hi!  Odin brought us together, it's almost poetic that his death should split us apart. We might as well be strangers now. \"Two sons of the crown\" set adrift.  Here's the thing. I'm probably better off staying here on Sakaar.  ...Did you just agree with me?  Do you truly think so little of me?  It's probably for the best that we never see one another again.  What?  No.  I hate it.  It's humiliating.  No.  We are not doing \"Get Help.\"  I still hate it. It's humiliating.    Though I feel it won't make much of a difference...  I know I've betrayed you many times before, but this time it's truly nothing personal. The reward for your capture will set me up nicely.  Easier to let it burn.  Thank you.  You do seem like you're in desperate need of leadership.  Your savior is here!  Did you miss me?    Everybody on that ship, now.  Of course you did.  You're missing an eye.  Hit her with a lightning blast.  I'm not doing \"Get help.\"    This is madness.  With the Eternal Flame, you are reborn.  It suits you.  Maybe not.  Do we have to hug now?  Do you really think it's a good idea to go back to Earth?  Let me rephrase: Do you really think it's a good idea to bring me back to Earth?",
        "Hela": "So he's gone? That's a shame. I would've liked to have seen that.  Really, you don't look like him.  You sound like him.  Kneel.  Kneel...before your Queen.  Darling, you have no idea what's possible.       I'm Hela.  You look like a smart boy with good survival instincts. How would you like a job?  It's come to my attention that you don't know who I am.     I am Hela, Odin's first born, Commander of the legions of Asgard, the rightful heir to the throne, and the Goddess of Death.  My father is dead. As are the princes. You're welcome. We were once the seat of absolute power in the Cosmos. Our supremacy was unchallenged, yet Odin stopped at Nine Realms. Our destiny is to rule over all others. And I am here to restore that power. Kneel before me...and rise into the ranks of my great conquest.  Whoever I am? Did you listen to a word I said?  I thought you'd be happy to see me.  Fine.  Oh, I've missed this. Still, it's a shame. Good soldiers dying for nothing...all because they couldn't see the future. Sad. Oh! Look, still alive.  Change of heart?  Let's go see my palace.  Does no one remember me? Has no one been taught our history? Look at these lies. Goblets and garden parties? Peace treaties?  Odin... proud to have it... ashamed of how he got it.  We were unstoppable. I was his weapon in the conquest that built Asgard's empire. One by one, the realms became ours.  But then, simply because my ambition outgrew his...he banished me, caged me, locked me away like an animal. Before that, Asgard's warriors were honored, their bodies buried as heroes beneath this very place.  Fake.  Most of the stuff in here is fake.  Or weak.  Smaller than I thought it would be.  That's not bad? But this... The Eternal Flame.  Want to see what true power looks like?  Fenris. My darling, what have they done to you?  With the Eternal Flame, you are reborn!  I've missed you. I've missed you all.  What is that noise?  Tell me about yourself, Skurge.    Recognition. When I was young every great King had an executioner. Not just to execute people, but also to execute their vision. But mainly to execute people. Still a great honor. I was Odin's executioner.  And you will be my executioner. Let's begin our conquest.  Skurge, where's the sword?  That sword is the key to opening the Bi-Frost.  These people you mentioned, the ones who aren't falling into line. Round them up.          leaning against FENRIS, her GIANT WOLF.  You.  Well?   Executioner?  You're still alive.  It seems our father's solution to every problem was to cover it up.  You see, you never knew him, not at his best. Odin and I drowned entire civilizations in blood and tears. Where do you think all this gold came from? And then one day he decided to become a benevolent king.  To foster peace, to protect life. To have you.  Okay, get up. You're in my seat.  But must always be ready for it.  To be honest, I expected more.  Here's the difference between us. I'm Odin's firstborn, the rightful heir, the savior of Asgard. And you're nothing.  So simple.     Even a blind man could see it.  Now you remind me of Dad.  You see? No one's going anywhere. I'll get that sword even if I have to kill every single one of them to do it.  That little shit.  A valiant effort, but you never stood a chance.  You see?   I'm not a queen, or a monster.  I'm the Goddess of Death.  What were you the God of again?  Tell me brother, what were you the God of again...?       Whatever game you're playing, it won't work. You can't defeat me.  No...NO!",
        "Thor": "Now I know what you're thinking. Oh no! Thor's in a cage. How did this happen? Well, sometimes you have to get captured just to get a straight answer out of somebody. It's a long story but basically I'm a bit of a hero. See, I spent some time on earth, fought some robots, saved the planet a couple of times. Then I went searching through the cosmos for some magic, colorful Infinity Stone things... didn't find any. That's when I came across a path of death and destruction which led me all the way here into this cage... where I met you.  How much longer do you think we'll be here?  Surtur. Son of a bitch...you're still alive! I thought my father killed you, like, half a million years ago.  You know, it's funny you should mention that because I've been having these terrible dreams of late. Asgard up in flames, falling to ruins, and you Surtur are at the center of all of them.  Hang on.   Hang on.  I'll be back around shortly. I really feel like we were connecting there.  Okay, so, Ragnarok. Tell me about that. Walk me through it.  Oh, hang on. Give it a second.  I swear I'm not even moving, it's just doing this on its own. I'm really sorry. Okay, let me get this straight. You're going to put your crown into the Eternal Flame, and then you'll suddenly grow as big as a house--  The Eternal Flame that Odin keeps locked away on Asgard?  Okay, so where is it? This crown?  Oh, that's a crown? I thought it was a big eyebrow.  Anyway, it sounds like all I have to do to stop Ragnarok is rip that thing off your head.  That's intense. To be honest, seeing you grow really big and set fire to a planet would be quite the spectacle. But it looks like I'm going to have to go with option B where I bust out of these chains, knock that tiara off your head, and stash it away in Asgard's vault.  Because that's what heroes do.  Wait, sorry. I didn't time that right. And, now!  I make grave mistakes all the time. Everything seems to work out.  Heimdall. I know it's been a while, but I could use a fast exit!  ...Heimdall?  Heimdall, come on.  Stay. I'm running short on--  -options.  Heimdall?  Who are you?  Right.   Where's Heimdall?  Traitor?  Sure.  What the hell is that?  You fool, you didn't listen!  Lady Sif!     Get help!  It's all right.   Hold on.  They'd be lucky to have you.  I know.  So mischievous.  It was a wonderful joke.  You are the savior of Asgard.  I will.  We will build a big statue for you.  I will tell Father what you did here today.  Noooooo!!!  Father.  It's an interesting play.    What's it called?  Indeed they should. I like that statue. A lot better looking than he was when he was alive, though. A little less weasely. Less greasy maybe.  You know what this is?  Do me a favor. Lock this in a vault so it doesn't turn into a giant monster and destroy the whole planet.  Nope. I've been having this reocurring dream lately.  Every night I see Asgard fall into ruins...  Possibly... but then I decide to go out there and investigate. And what do I find, but the Nine Realms completely in chaos. Enemies of Asgard assembling, plotting our demise, all while you, Odin, the protector of those Nine Realms, are sitting here in your bathrobe, eating grapes.  Of course, the freedom to be massacred.  Watching theatre.  You really going to make me do it?  You know that nothing will stop Mjolnir as it returns to my hand.  Not even your face.  Then I'll see you on the other side...brother.  Where's Odin?  Where's father?    Did you kill him?  Right here on the sidewalk? Or right there, where the building that's being demolished? Great planning.  Then why do you dress like one?  I can't believe you're alive. I saw you die. I mourned you, I cried for you.  Sure. Start figuring out where he is.  She didn't dump me, you know.       I dumped her. It was a mutual dumping.  What's this, what are you doing!?  Loki?  So earth has wizards now?  Alright wizard, who are you?   Why should I care?  I don't drink tea.  Not tea.  He's a worthy inclusion.   We're looking for my father.   Promptly.   If you knew where he was, why didn't you call me?   No, I don't have a phone, but you could have sent an electronic letter. It's called an email.   No. What for? Anyway, my father is no longer in exile. So if you could tell me where he is, I can take him home.  Will you stop doing that?  Let me explain something, my hair is not to be meddled wi-!  We could have just walked.  All right.  Yes.  Sorry  I suppose I'll need my brother back.  Yeah of course. Thank you very much for your help.  Loki.  Father?  Father, it's us.  I know.    We've come to take you home.  Loki, lift your magic.  I know that we failed you, but we can make this right.  No, I've stopped Ragnarok.    I put an end to Surtur.  Father, who are you talking about?  ...what?  Whatever she is, we can stop her. We can face her together.  This was your doing.  You must be Hela.   I'm Thor, son of Odin.  I don't think so.  It's not possible.       No!!  Loki!  I'm just passing through.  Thank you.  Hey!   Where are you taking me?  Answer me! Hey! I am Thor, son of Odin. I need to get back to Asgard.  What...the hell?  A what?  Just wait a damn minute.    I'm not for sale.  You'll pay for this!  I am the God of THUNDER!!!  Hi.  Oh, my god!    We're not friends, and I don't give a shit about your games! I'm going back to Asgard!  Loki!? Loki! Over here!  Loki!  Yes, of course I'm alive.  What do you mean, what am I doing? I'm stuck in this stupid chair. Where's your chair?  Get me out of this one.  What?  Oh, he's crazy!  Weeks ago?     I just got here.  God of Thunder.    Tell him.  He's my brother.  You take this thing out of my neck and I'll show you.  Asgard.  Fine. Then point me in the direction of whoever's ass I have to kick.  Loki!  You're a Kronan, aren't you?  How'd you end up in here?  How did you...  This doesn't make any sense.  Has anyone here fought the Grandmaster's Champion?  What about you? You're made of rocks.  Yes I am. Fight him, win, and get the hell out of this place.  Odin, I bid you take your place in the halls of Valhalla... Where the brave shall live forever. Nor shall we mourn but rejoice-  -for those that have died the    -for those that have died the glorious death.                  glorious death. Reveal Loki standing across the cell.   Thor gives him a hard look.  What would you like me to say? You faked your own death, you stole the throne, stripped Odin of his power, stranded him on Earth... -to die, releasing the Goddess of Death.  Have I said enough, or do you do you want me to go further back than the past two days?  No.  I really wish I had my hammer.  Quite unique. It was made from this special metal from the heart of a dying star. And when I spun it really, really fast it gave me the ability to fly.  No, I didn't ride the hammer.  No. I used to spin it really fast, and it would pull me off the...  The ground. It would pull me off the ground, up into the air, and I would fly. Every time I threw it, it would always come back to me.  That's a nice way of putting it.  See her, the one that put me in here.  Asgardian?  Hey!   Hey!  Do not zap me with that thing. I just wanna talk. Asgard is in danger.  My God, you're a Valkyrie. I used to wanna be a Valkyrie when I was younger...until I found out that you were all women. There's nothing wrong with women, of course. I love women. Sometimes a little too much. Not in a creepy way, just more of a respectful appreciation. I think it's great that there is an elite force of women warriors. It's about time.  Please, help me.     I need your help.  Fine, then you must be a traitor or a coward because the Valkyrie are sworn to protect the throne.  By Odin's beard, you shall not cut my hair... lest you feel the wrath of the might Thor.  Please. Please, kind sir, do not cut my hair! No!  Yes!  Hey! We know each other. He's a friend from work. Where have you been? Everybody thought you were dead. So much has happened since I last saw you. I lost my hammer. Like, yesterday, so that's still pretty fresh. Loki! Loki's alive. Can you believe it? He's up there. Loki! Look who it is!  Banner, I never thought I would say this, but I'm happy to see you.  Banner.    Hey, Banner!  What are you doing?    It's me.  Banner, we're friends. This is crazy. I don't want to hurt you!  Hey, big guy. The sun's getting real low.  That's it. The sun's going down. I won't hurt you anymore. No one will.  All right. Screw it.  I know you're in there, Banner. I'll get you out!  What's the matter with you? You're embarrassing me! I told them we were friends!  Are we cool?  It's Hulk in a hot tub. How long have you been like that?  Like this.     Big, green, ...stupid.  How'd you get here?  You mean cheating?  Were they wearing one of these when you won? How'd you arrive here?  Yes.   Where is the Quinjet now?  That's naked. He's very naked. It's in my brain now.  Yes! I'm getting us out of here. This is a terrible, awful place. You're gonna love Asgard. It's big. It's golden. Shiny.  No, no, no. My people need me to get back to Asgard. We must prevent Ragnarok.  The prophesied death of my home world, the end of days, it's the end of- If you help me get back to Asgard, I can help you get back to Earth.  Earth loves Hulk. They love you. You're of the Avengers. One of the team, one of our friends. This is what friends do. They support each other.  I'm not Banner's friend. I prefer you.  I don't even like Banner. \"I'm into numbers and science and stuff.\"  Fine. Stay here. Stupid place. It's hideous, by the way. The red, the white. Just pick a color.  You didn't smash anything. I won that fight  Yeah, sure, sure.  What?  Moron!   You big child.  I am going.  That's great. Have fun.  A57               Heimdall, I know you can see me.                           A57    I need you to help me. Help me see.  What's going on here?  You're talking about evacuating Asgard?  I'm working on it, but I don't even really know where the hell I am.  Which one?   After slashing through the Butchers, Heimdall moves towards the house where he hid the family... and then abruptly stops.  Heimdall turns slightly.       He sees something.  BINOCULARS POV: Heimdall looking right at us, the Bi-Frost sword visible in his hand.  Reveal Skurge on a palace tower balcony, surveilling the city with Asgardian E-noculars. Skurge lowers the E-noculars.  There is conflict on his face. He knows that he should report this to Hela immediately...yet he doesn't spring into action.  Shut up.     I'm not sad, you idiot. I'm pissed off! Angry. I lost my father. I lost my hammer.  You're not even listening.  You're being a really bad friend.  You know what we call you?  We call you the stupid Avenger.  What, are you crazy?  You know what? Earth does hate you.  I'm sorry I said those things. You're not the stupid Avenger. Nobody calls you the stupid Avenger.  You just can't go around throwing shields at people. Could have killed me.  I know. We're the same, you and I. We're just a couple of hot-headed fools.  We're kind of both like fire.  Hulk, I need you to do something for me.  We need to talk.    Asgard is in danger and people are dying. We need to get back there. I need your help...wow.  Odin is dead.  Hela, the Goddess of Death has invaded Asgard.  I'm going to stop her.  Nope. I'm putting together a team. It's me, you, and the big guy.  It's me and you.  Wait. Just listen. The Valkyrie are legend, elite warriors of Asgard. You are sworn to defend the throne.  What's that supposed to mean?  I agree.  I agree. That's why I turned down the throne. But this isn't about the crown. This is about the people. They're dying and they're you're people, too.    Good. Great.  Thank you.  For this.  Didn't see that did you?  There... that's better. You know, go ahead. Stay here and get drunk and enslave people for that lunatic. Keep drinking. Keep hiding. But me...  I choose to run toward my problems and not away from them. Because that's what...  Because that's what heroes do.  All right.     Come on.  Thor.  Thor, son of Odin.  God of Thunder.  Strongest Avenger.  Strongest Avenger!  Damn you, Stark. Point Break.  No, no, no!  Stop! Stop breaking everything!  Banner. Hey, hey, hey. You all right, Banner? Sun's going down. Sun's going down. That's it, breathe. I won't hurt you. Sun's going down.  Yeah.  Some creepy old man cut it off.  Thanks.  Nat is good, I'm sure.  Sokovia?  Banner, listen.  Sokovia. Ultron.     That was two years ago.  I'm afraid so.  Banner, there's something you should know...    Yeah, about that.  He kind of runs the place. You actually lived in his house.  Yeah. Quite a lot's happened. You and I had a fight recently.  No, I won. Easily.  Well, it's true.  Seductive GOD of Thunder.    We need to move.  No, no, no. Don't freak out. You're okay. Put these on.  I know, come on.  No, he's not here. But listen. Just stay calm, okay? The sun's going down. The sun's getting really low. Sun's going down.  The sun's going down. It's getting really low. The sun's going down. It's getting real low.  I just need you to stay calm.  It's just a planet.   You've been on a planet before.  Now you've been on two. That's a good thing. It's a new experience.  Alright, well, you're back now, that's all that matters.   We're not stranded, I'm gonna figure out a way to get us home.   Not your home, though.   Asgard.   Listen, my people are in great danger. You and I, we have to fight this really powerful being who also happens to be my sister.   No, she's an evil being.   No, no. I'm putting together the team. The Hulk is the fire.  What?   No!  No! I don't even like the Hulk. He's all like... \"smash, smash, smash.\" I prefer you.  But if I'm being honest, when it comes to fighting evil beings, he is very powerful and useful.  Is he though?  Fine, you don't have to fight anyone. But we're in danger here, so we have to move.  I need a disguise.    I'm a fugitive.  You are the disguise.  What?  No, no you're not Tony.    You're Bruce Banner.  Because you were naked.  What are you doing?    Stop doing that!  Why are you being so weird?  Hey. It's okay. You're good. Calm down. Come on. Listen, we're gonna go to Asgard and you're not gonna have to think about the Hulk ever again. All right?  This is bad. Banner!     Banner!  Hi.  I was gonna do that.  That's good. What are you doing here?  I got sidetracked.  It's my disguise.     He's a friend.  I was thinking that you drink too much, and that probably was going to kill you.  Good.  Yeah, it's called the Revengers.  Because I'm getting revenge. You're getting revenge. Do you want revenge?  Okay.  Just had to be sure.  Is that... a Dragonfang?  My God. This is the famed sword of the Valkyrie.  Nope. We're going through that one.  For the record, I didn't know it was called that when I picked it.  She's right. We need one that can withstand the geodetic strain from the singularity.    We need a ship.                 Need a ship.   You're telling us you can get us access into the garage without setting off any alarms?  Yes, me too. On many, many occasions. There was one time when we were children, he transformed himself into a snake, and he knows that I love snakes. So, I went to pick up the snake to admire it and he transformed back into himself and he was like, \"Yeah, it's me!\" And he stabbed me. We were eight at the time.  Shut up.  No, there's no beast. He's just being stupid. We're going to start a revolution.  I'll explain later.  I'll explain later.  Hey, so listen, we should talk.  You have no idea. I've had quite the revelation since we spoke last.  Hello!  Thought you didn't want to talk about it?  That's exactly what I was thinking.  This place is perfect for you. It's savage, chaotic, lawless. Brother, you're going to do GREAT here.  Loki, I thought the world of you. I thought we were gonna fight side by side forever. But, at the end of the day, you're you, I'm me...  I don't know, maybe there's still good in you, but let's be honest, our paths diverged a long time ago.  That's what you always wanted.  Hey, let's do \"Get Help.\"  \"Get Help.\"  Come on, you love it.  It's great. IT works every time.  Do you have a better plan?  We're doing it.  Get help! Please! My brother, he's dying.  Get help! Help him!  Classic.  Not for me, it's not.  Which one's the ship she told us to get?  Oh, Loki.  Never one for sentiment, were you?  I agree.  Oh brother, you're becoming predictable. I trust you, you betray me. Round and round in circles we go.  See, Loki, life is about, it's about growth. It's about change. But you seem to just wanna stay the same. I guess what I'm trying to say is that you'll always be the God of Mischief, but you could be more. I'll just put this over here for you.  Anyway, I got places to be so good luck.  All right, I can figure this out. It's just another spaceship.  Yes, we should. Where are the guns on this ship?   Yeah. Don't touch anything.  No!  Get inside!  I should probably go and help.  Here, take the wheel.  You're a scientist.   Use one of your PhDs.  Okay, drop me off at the palace and I'll draw her away.  The people trapped down there are all that matters. While I'm dealing with Hela, I need you two to help get everyone off Asgard.  I have a man on the ground.  Now the ship has guns.  I found this in the armory.  Sister.  I love what you've done with the place. Redecorating, I see.  Or to cast it out. He told you you were worthy.   He said the same thing to me.  I understand why you're angry. And you are my sister, and technically have a claim to the throne. And believe me, I would love for someone else to rule. But it can't be you. You're just...the worst.    She's too strong.   Without my hammer I cannot--  It's too late. She's already taken Asgard.  I'm not as strong as you.  You're late.  I think we should disband the Revengers.  I just hit her with the biggest lightning blast in the history of lightning. It did nothing.  It won't end there. The longer Hela's on Asgard the more powerful she grows. She'll hunt us down. We need to stop her here and now.  Asgard's not a place, it's a people. This was never about stopping Ragnarok...it was about causing Ragnarok. Go to the vault. Surtur's crown. It's the only way.  Shall we?   HELA!   Enough!  You want Asgard? It's yours.  No, but he can.  We're fulfilling the prophecy.  So do I, but we have no choice.  We need to let him finish... No!  Hulk no!   Stop it you moron!!  Hulk, just for once in your life, don't smash!  What have I done?  Perhaps you're not so bad after all, brother.  Thank you, Loki.  And if you were here, I might even give you a hug.  I'm not sure. Any suggestions? Miek, what's your home planet?  Earth it is.  Sure!   They love me there.  Probably not. But don't worry, brother...I've got a feeling that everything's going to work out.",
        "Surtur": "Thor, Son of Odin.  I cannot die. Not until I fulfill my destiny and lay waste to your home.  Then you have seen Ragnarok, the fall of Asgard. The great prophecy--  My time has come. When my crown is reunited with the Eternal Flame, I shall be restored to my full might. I will tower over the mountains and bury my sword deep in Asgard's--  A mountain!  Odin is not on Asgard. And your absence has left the throne defenseless.  This is my Crown, the source of my power.  It's a crown.  But Ragnarok has   already begun. You cannot stop it.    I am Asgard's doom, and so are   you. All will suffer, all will   burn.  You cannot stop Ragnarok. Why fight it?  You have made a grave mistake, Odinson.    Tremble before me Asgard, for I am your reckoning!  Surtur destroys Asgard, he destroys Hela so that our people can live.       I am Asgard's doom!!",
        "(voice)": "",
        "Topaz": "Trash.  Booze hag.  You say that every time she's here.  Tell her she's dreaming.  We located your cousin.  Burnt toast.  Here you go.  Don't know. But the Arena's mainframe for the Obedience Disks have been deactivated and the slaves have armed themselves.  Mainframe?  Sorry, the \"prisoners with jobs\" have armed themselves.",
        "Valkyrie": "And no one escapes this place. So you're gonna die anyway.  What's going on? What do you...?  You're so thick-headed that you can't tell when someone's hiding all the way across the universe and wants to be left alone?  No, you want to talk to me.  All right. Here's the deal. I'll listen to you till this is empty.  Finished. Bye.  If Hela's back then Asgard is already lost.  Alone?  I think it's only you.  I'm not getting dragged into another one of Odin's family squabbles.  Your sister. Her power comes from Asgard, same as yours.  When it grew beyond Odin's control, she massacred everyone in the palace and tried to seize the throne. When she tried to escape her banishment, he sent the Valkyrie in to fight her back. I only survived because... Look, I already faced her once back when I believed in the throne, and it cost me everything. THAT'S what's wrong with Asgard. The throne, the secrets, the whole golden sham.  Don't get familiar.  Forget it.     I have.  Okay.  Great.  For what?  I can do it in two.  I don't answer to you, lackey.  I don't help anyone.  Choose your next words wisely.  Hi.  Yeah, well, I did it first.  What are you doing here?   I thought you were leaving.  What's with the...  But I can see your face.  Who is this guy?  I feel like I know you.  Look, I've spent years in a haze trying to forget my past. Sakaaar seemed like the best place to drink and forget and to die one day.  I don't plan to stop drinking, but I don't want to forget. I can't turn away anymore. So, if I'm donna to die, well... it may as well be driving my sword through the heart of that murderous hag.  Yeah. So I'm saying that I wanna be on the team. Has it got a name?  Revengers?  Also, I've got a peace offering.      It is.  Sakaar and Asgard are about as far apart as any two known systems. Our best bet is a wormhole just outside the city limits.  Refuel on Xandar and be back in Asgard in around 18 months.  The Devil's Anus?  We need another ship.   That would tear mine to pieces.  And we need one with cup holders, because we're gonna die. So, drinks!  I feel like I know you, too. It's weird.  There are one or two ships, absolute top-of-the-line models--  And suddenly you're overcome with an urge to do the right thing.  He did try to kill me.  If we're boosting a ship, we're gonna need to draw some guards away from the palace.  You guys have a beast?  Who's this guy again?  I'm looking for Korg.  The Lord of Thunder sends his best.  Open the doors.  I hope that you're tougher than you look.  There aren't any. It's a leisure vessel.  Grandmaster uses it for his good times, orgies and stuff.  In a minute!  Guys, we're coming up on the Devil's Anus!  Here we go!    Here, up here in the mountains.  Heat signatures. People clustered together. Hela's coming for them.  And get yourself killed?  I'll take it from here.  \"Your majesty.\" Don't die.    You know what I mean.  This stupid dog won't die!  What the hell are you talking about?  This isn't over.  We need to hold her off until everybody's on board.  What's our move?  After you.  The people are safe.     That's all that matters.  I hate this prophecy.  Hulk! Let's go.  Your throne.",
        "Odin": "And so Loki died of his wounds, giving his life for ours. He fought back those disgusting dark elves. He brought peace to the realm.  Loki, my boy...`Twas many moons ago I found you on a frost-bitten battlefield.  On that day, I did not yet see in you Asgard's savior. No. You were merely a little blue baby icicle... that melted this old fool's heart.  Bravo!    Bravo! Well done.   Bravo.  Oh, shit. My son! Thor has returned! Greetings my boy.  The Tragedy of Loki of Asgard. The people wanted to commemorate him.  The skull of Surtur? That's a formidable weapon.  So it's back to Midgard for you, is it?  That's just a silly dream... Signs of an overactive imagination.  Well, it is best to respect our neighbors' freedom.  Yes, besides, I have been rather busy myself.  Board meetings, and security council meetings...  Do what?  You've gone quite mad.     You'll be executed for this!  Look at this place. It's beautiful.  My sons.   I've been waiting for you.  Home, yes. Your mother, she calls me. Do you hear it?  Took me quite a while to break free from your spell. Frigga would have been proud.  Come and sit with me. I don't have much time.  I failed you. It is upon us...Ragnarok.  No. It has already begun. She's coming. My life was all that held her back, but my time has come. I cannot keep her away any longer.  The Goddess of Death.     Hela.   My first born. Your sister.  Her violent appetites grew beyond my control. I couldn't stop her, so I imprisoned her. Locked her away. She draws her strength from Asgard...and once she gets there, her powers will be limitless.    I love you my sons.  Look at that.  Remember this place. Home.   A moment as the brothers separately mourn for Odin.  The sky above DARKENS and THE WIND PICKS UP.  Thor stands and turns toward Loki, his eyes burning with rage. Loki takes a step back.          Even when you had two eyes you were only seeing half the picture.  Are you Thor, God of Hammers?  That hammer helped you control your power, focus it. But it was never the source of your strength.  Asgard is not a place. Never has been. This could be Asgard. It is wherever our people stand. And right now those people need you.  No.   You're stronger.",
        "Skurge": "Heimdall was an idiot. This job should have made him rich. Now, the job ain't easy, but it does have its benefits. The Bi-Frost gives me access to everything the Nine Realms have to offer. I mean it's all mine for the taking. Behold...my stuff.  I'm particularly fond of these. I pulled `em out of a place on Midgard called Texas. I even named them. Des and Troy. You see, when you put them together...they destroy.  You girls are in for a treat.  Girls! Well well, look who decided to pop in. Thanks for scaring away my company and drenching my workplace in brains.  Don't you remember? I'm Skurge. We fought together on Vanaheim.  That traitor. No one knows, he's a fugitive of the throne.  Yeah, you see, Odin charged Heimdall with negligence of duty, but he disappeared before the trial. Hard to catch a guy who can see everything in the Universe.  Hold on. I'm supposed to announce your arrival.  Behold!   Thor..Odinson.  I'm just a janitor.  Odin's treasures.  The common folk aren't exactly falling in line. There's a resistance trying to knock down the front gates.  Well, me dad was a stonemason, me mum was-  I just want a chance to prove myself.  leaning against FENRIS, her GIANT WOLF.  Asgardians, some misguided soul has stolen the Bifrost sword. Tell us where it is, or there will be consequences. Bad ones.  Well?    Heimdall!    The sword!  For Asgard.",
        "Doctor": "",
        "Strange": "Thor Odinson.  God of Thunder.  You can put down the umbrella.  The preferred term is \"Master of the Mystic Arts.\"  My name is Doctor Stephen Strange and I have some questions for you. Take a seat.  Tea?  What do you drink?  So I keep a watch list of individuals and beings from other realms that may be a threat to this world. Your adopted brother Loki is one of these beings.   Then why bring him here?   So. If you were to tell you where Odin was, all parties concerned would promptly return to Asgard?   Great.   Then I'll help you.   I have to tell you, he was adamant that he not be disturbed. Your father said he had chosen to remain in exile. And you don't have a phone.   Yeah, do you have a computer?   Gladly.   He's in Norway.  I'm just seeing whether this incantation requires any Asgardian modifications.  Nope.  Oh, we don't need that.  I need just one strand of your hair.    Don't forget your umbrella.  Yeah, right.    Good luck.  Bye-bye.",
        "Grandmaster": "He's wonderful. It is a he?  Yeah. I love when you come to visit 142, you bring me the best stuff. Whenever we get to talking, Topaz, about Scrapper 142...what do I always say? \"She is the...\" and it starts with a B.  No, not trash. Were you waiting just to call her that? It doesn't start with a \"B.\"  I'm so sorry. No, \"best.\" I was thinking about \"best.\" Because I always say you're the best. She brought me my precious beloved Champion, you know.  What have you brought today?    Tell me.  I need to go closer. I want a closer look at this. Can you take us closer? Thank you.  Pay this lady.  Man.   He is a fighter.  For heaven's sake, transfer the units.  Here's what I wanna know.    Who are you?  Wow. I didn't hear any thunder, but out of your fingers, was that like...sparkles?  Oh good! Yeah, come on. I think you're gonna like this.  There he is. Hey, cuz. We almost couldn't find you. What, have you been hiding?  So...  Carlo... I pardon you.  You're officially pardoned...from life.  I'm stepping in it. I'm stepping in it. Look out!  What does it smell like?  What happened to my manners? I haven't properly introduced myself. Come on. Follow me.  My name is Grandmaster. I preside over a little harlequinade called the Contest of Champions. People come from far and wide to unwillingly participate in it. And you, my friend, might just be part of the new cast. What do you say to that?     What are you whispering about?  Time works real different around these parts.  On any other world, I'd be like, millions of years old. But here on Sakaar...  In any case, you know this... You call yourself Lord of Thunder?  Is he any kind of a fighter?  Now listen to that. He's threatening me. Hey, Sparkles, here's the deal. If you wanna get back to Ass-place, Assberg...  Any contender who defeats my champion, their freedom they shall win.  That's what I call, contender! Direction would be this way, Lord.  Wow! Look at all of you. What a show, WHAT-A-NIGHT! Who's having fun? Please, I'm your host. Big round of applause for all of our undercard competitors... who died so gruesomely. Good sports. What a show! What a night! This is what you've come for and so have I. And now, without further ado... it's main event time!! Making his first appearance, though he looks quite promising, got a couple of tricks up his sleeve. I'll say no more, see what you think. Ladies and gentlemen... I give to you...Lord of Thunder!  Watch out for his fingers. They make sparks.  Okay, this is it. Let's get ready to welcome this guy. Here he comes. He is a creature. What can we say about him? Well, he's unique. There's none like him. I feel a special connection with him.  He's undefeated. HE'S THE  Hey, hey, hey! Where are you going?  Here we go.  What?       It's bad news, bad news today.  Sakaar, hear ye. Attention please. I have some bad news. My beloved, exalted Champion has turned up missing. Take to the streets. Celebrate my champion.  It seems that that criminally seductive Lord of Thunder has stolen him away.     I'm upset! I'm very upset. You know what I like about being upset? Blame. Right now, that's the mindset that I'm in. And you know who I'm blaming?  Hey! Don't interrupt me!  Why are you handing me the melt stick? He was interrupting. That's not a capital violation. My precious champion has come up missing and its all because of that Lord of Thunder. It's all because of him. YOUR brother. Whatever the story is. Adopted, or complicated. I'm sure there's a big history. And YOUR contender.  You know what? I woke up this morning thinking about a public execution. But for now, I'll settle for this sweet little \"who's gonna get him first?\" So you're on the clock.             Revolution? How did this happen?  Oh! I don't like that word!  No. Why would I not like \"mainframe?\" No, the \"S\" word.  Okay, that's better.                  Loyal Sakaarians, Lord of Thunder has stolen my ship and my favorite champion. Sakaarians, take to the skies. Bring him down. Do not let him leave this planet.  It's MY BIRTHDAY! It's MY BIRTHDAY! It's MY BIRTHDAY.",
        "Hogun": "Whoever you are... whatever you've done, surrender now! Or we will show you know mercy.  This is your last warning!  Go back to whatever cave you crept out of you evil demoness!",
        "Korg": "Hey! Take it easy man! Over here. The pile of rocks waving at you. Yeah I'm actually a thing, I'm a being. Allow me to introduce myself, my name is Korg. I'm kind of like the leader in here. I'm made of rocks, as you can see, but don't let that intimidate you. You don't need to be afraid unless you're made of scissors. Just a little rock-paper-scissor joke for you. This is my very good friend over here, Miek. He's an insect and has knives for hands.  That I am.  Well, I tried to start a revolution but didn't print enough pamphlets, so hardly anyone turned up.  Except for my mom and her boyfriiend, who I hate. As punishment, I was forced to be in here and become a gladiator. Bit of a promotional disaster. But I'm actually organizing another revolution. I don't know if you'd be interested in something like that. Do you reckon you'd be interested?  Yeah, no. This whole thing is a circle. But not a real circle, more like a freaky circle.  No, nothing makes sense here. The only thing that does make sense, is that nothing makes sense.  Doug has. Doug! Oh, right, Doug's dead. That's right. Everyone who fights the Grandmaster's champion perishes.  Perishable rocks. There you go. Another one gone. Yeah, no, I just do the smaller fights, warm up the crowd and whatnot. Wait. You're not gonna face him, are you?  That's exactly what Doug used to say. See you later, new Doug.  Piss off, ghost! He's freaking gone.  Yuck! There's Still someone's hair and blood all over this. Guys, can you clean up the weapons once you finish your fight? Disgusting slobs. Thor...wanna use a big wooden fork?  Yeah, not really useful unless you're fighting off three vampires that were huddled together.  Hammer?  You rode a hammer?  The hammer rode you on your back?  Oh my God.     The hammer pulled you off?  Sounds like you had a pretty special and intimate relationship wiht this hammer and that losing it was almost comparable to losing a loved one.  Yeah, Scrapper 142. She's strong. And she drinks a lot.  Gotta watch out for those Asgardians, man. They are hard to perish.  Thunder! Thunder! Thunder!  Another day, another Doug.  Is that some sort of protoplasm, all the stuff that's coming out of you? Or are they eggs? Looks like eggs.  Who's asking? I know you're asking. Is anyone else asking, or is it just you?  My revolution has begun...  There she is. Our ticket out of here. Hey, what's this?  Hey man, we're about to jump on that ginormous spaceship. You wanna come?  Why thank you.  Hey man.   I'm Korg.   This is Miek.  We're going to jump on that spaceship and get out of here. Want to come?  The damage is not too bad. As long as the foundations are strong, we can rebuild this place. It will become a haven for all people and aliens of the universe...  Nope, those foundations are gone. Sorry.  Oh, Miek's dead. I accidentally stepped on him on the bridge, I've just felt so guilty I've been carrying him around all day...  Miek, you're alive! He's alive everyone! What was your question?"
    },
    "imdb_rating": "7.9",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjMyNDkzMzI1OF5BMl5BanBnXkFtZTgwODcxODg5MjI@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Imprisoned on the other side of the universe, the mighty Thor (Chris Hemsworth) finds himself in a deadly gladiatorial contest that puts him against The Incredible Hulk (Mark Ruffalo), his former ally and fellow Avenger. Thor's quest for survival leads him in a race against time to prevent the all-powerful Hela (Cate Blanchett) from destroying his home world and the Asgardian civilization.—Asger Jonasen aagaard",
    "name": "Thor: Ragnarok",
    "genres": [
        "Action",
        "Adventure",
        "Comedy"
    ]
}