{
    "filename": "Thunderbirds_script.txt",
    "imdb_id": "tt0167456",
    "imdb_url": "https://www.imdb.com/title/tt0167456",
    "characters": [
        "Mullion",
        "Know It All Kid",
        "Excited Kid",
        "Gordon Tracy",
        "Jeff Tracy",
        "Headmaster",
        "Virgil Tracy",
        "Lady Penelope",
        "Parker",
        "Scott Tracy",
        "Fermat",
        "Teacher",
        "Lisa Lowe",
        "News Anchor",
        "Alan Tracy"
    ],
    "dialogues": {
        "Mullion": "Come on! Come on!   The island is in sight.   Sir? Sir, armed and ready. Shall I target the main structure?   (trying to move and realizing that he can't) This is ridiculous.   We made land.   Get up.   Yes, sir.  The kids lift their heads back up into the vents   Someone's there. (Mullion walks over to the ceiling, he is standing directly below where they are. The kids are trying to leave the vents when his hand shoots up through the ceiling and grabs Alan's ankle. He lets go after Tintin bites his hand and he gasps in pain.  The children are now talking loudly and everyone in the Command and Control room can hear them.   (The guards walk out of the elevator and see Tintin pointing the Firefly at them) Retreat! (They fall over and have trouble getting up due to the slipperiness of the stuff fired at them   Get 'em!   Transom, fire up Thunderbird 1. And set it on broil!  The kids look behind them while they are falling down the tunnel and see the flames coming from Thunderbird 1 behind them. Tintin screams even louder. The tunnel opens up and leads to the ocean.  Back in Command and Control   Of course not, the little brats went up like firecrackers. Pop, pop, pop! (laughs at Brains and Brains moves to punch him.   Yes, sir. Scene switches to the children trying to get onto the beach, they are getting knocked over by a couple of waves. Fermat is coughing and spluttering.   Ready for launch. We'll use this to get into the vaults.   I didn't realize we'd be getting points for style. We're robbing banks, remember.   The Hood uses his power on Mullion and Mullion gasps.   (Looks over toward Thunderbird 2 and speaks into headset) Transom, initiate pre-flight diagnostics.  An alarm suddenly goes off in Thunderbird 2.   What's going on?    What's wrong with it?   Aaargh!   No way. They're dead. No one could live through something like that.   Come on! Those brats are in here somewhere.   Scene change to the kids at the satellite transmitter.   Come on!  The kids fall down a ditch screaming and into a river.   There! Come on!  Tintin looks up and sees a bees hive.   Straight ahead.  Tintin uses a limb to hit the bee hive at Mullion and the other two guards. Mullion falls off the car and into a puddle while being stung by bees. The scene cuts back to Alan and Fermat in the junkyard attaching something to the back of the hoversled so that all three of them can fit on it.   Go! Go!   Come on! Faster!   (Grabs Fermat away from Brains and has him sit down on a container) Cool off, kid! (he laughs evilly as he walks out of the fridge and closes the door on the way out Scene switch to Park and Lady Penelope approaching Tracy Island.    I must warn you that I know judo, krai magna, and tae kwon do.    You've broken my nose.   You're coming with me. (Grabs Alan's arms and throws Lady Penelope over his shoulder   You need to cool off, milady.   Under an hour. Bank of London, here we come!  Scene changes back to the fridge.    ETA, one minute.  Scene switches to Lady Penelope in Thunderbird 1 talking to Parker on her cell phone.   Look at all this gold!   Don't move. (Parker motions for the kids to run forward but Transom blocks them. Parker puts his hands up as if to punch her   I've been waiting to get my hands on you brats.",
        "Excited": "It's the Thunderbirds. They're gonna be on TV. Let's go! They're gonna be on TV.   In Russia, at an oil rig fire.",
        "Kid": "It's the Thunderbirds. They're gonna be on TV. Let's go! They're gonna be on TV.   In Russia, at an oil rig fire.   Ooh, I wish I could be a Thunderbird one day. Thunderturd!  The boys in the room \"ooohh\" and look at Alan for a response",
        "Gordon": "Try and keep up!   Unless he's blown up this school, like the last one!   Check retros. Go.    You got it, Dad. Reverse main thrusters on my mark. Three, two, one.   We're locked on.   The locking mechanism's jammed!   We're okay.   Come on, Dad. The situation's hopeless.    Alan? He's just a kid!",
        "Tracy": "I was just...   Thunderbird 2 this is Thunderbird 1. I have visual, south column, they're trapped on an inspection platform.   FAB. We'll take it from here.   Open 'em up. Here we go. Rescue platform's on its way.   I could sure use a pizza. You know a place that delivers?",
        "Jeff": "FAB. We'll take it from here.   Scott, get out. That tower's coming down.   Thunderbird 1 any damage?   This approach angle's no good. Gonna have to swing her around.   Scotty, I was watching for wind shear when you were still wearing diapers.    Whoa! Hold on!   Virgil, how's it going?   Alright, let's haul them out.   Okay, let's bring 'em home.   Whoa sorry, boys. Hold on tight. Here we go.   How you doing, son?   Thunderbird 1, commence knockdown procedure.    Bull's-eye! Outstanding shot. All right boys, let's take these babies home.    Mission complete. Thunderbird 1 we are good to go.   Brains, I noticed a build-up of vibration on Thunderbird 2, followed by illumination of the number 5 engine out light.   Alan! Let me look at you. He hold Alan at arm's length and then looks him over. He then looks over and sees his older sons approaching. Ah oh look out.   Onaha, it smells delicious. I am starved.    Saving lives is a dangerous business. But it's what we do.   Whoa, whoa, whoa, enough shop talk. I want to hear about school.   No short cuts, Alan. No school, no rockets. Say, why aren't you wearing your retainer?    Okay, that's enough. Pass the salad.    Kyrano, have you seen Lady P?   Of course.   Any suspects?   Tintin!   Did you know Alan's home?  When are those two going to get along?    What sort of thing?   Alan and Tintin? I didn't see that one coming.   Have a safe flight home, Penny.   (his face appears on a monitor in Thunderbird 1) Alan, my office. Now. (Thunderbird 1 shuts down   You're damn right you shouldn't have been in there!   Under control? Do you have any idea of the importance of secrecy in our operation? You fired up a Thunderbird without activating the anti-detection shield. You put everyone in danger when you act selfishly. You want to be part of the team, you have to play by the rules. You understand? (Alan just looks at him) Do you?   I've heard enough. You're grounded for the rest of spring break.   Bottom line, Alan. You need to grow up.   Hey, John. I was just about to turn in. What can I do for you?   30 minutes or it's free, right? Anything else on your mind?  Alan's home for spring break.   Teenagers.   Thanks, John. Keep an eye on that typhoon for us. And, uh, I'll call Vladivostok, see if they need help with that fire.   How bad, Brains?   Meteor?   Thunderbirds are go.  Scene change to inside Thunderbird 3.   Go to maximum thrust.  Scene switches to the submarine.   Hold on, John. We're coming in. Gordon, prepare for immediate docking.   Easy. Watch the roll.  Nice work    Emergency packs boys. Let's move!    We're in. Let's go!  Jeff, Scott, Virgil, and Gordon are now in the damaged Thunderbird 5 with John.   John! Scott, tackle that fire.   Easy, you're hurt. Virgil, take care of your brother. Gordon, give me a damage assessment.  Scene switch to back on the island. The kids are running through the jungle while heading toward the vents and the Hood and his crew are heading toward Command and Control.   Attempt manual override.   Back to Thunderbird 3 now. (turns to help an injured John) John, we gotta move.   Okay, you have our attention. Who are you? What do you want?   Why the Thunderbirds?   An eye for an eye?   Wait! (Video link cuts dead and then the scene cuts to Thunderbird 5.) Scott, status report.   Alright, wire the oxygen scrubber to the emergency batteries. Clean the air.    Scott? Gordon? You all right?   You don't say.  Scene switches back to Mullion and two other guards searching the jungle for Alan, Tintin, and Fermat.   Alan, where are you? Are you safe?    We're standing by.   Alan, what's happening?   That's a negative! It's too dangerous. Follow emergency procedure. Wait for Lady Penelope at the rendezvous point. Alan can you read me? (the screen begins to break up   Alan we're losing you! Alan!   Phew! Somebody roll down a window. It's getting a little hot in here.   Stop it!   No, it's not. There's still time. We've got people on the ground working for us.   He's a Tracy.  Scene switches quickly to Alan running through the forest and then to Lady Penelope and Parker walking up to the Tracy house   Don't go to sleep. John, look at me. Keep your eyes open.  Scene switches back to the fridge where Mullion and Transom are taking Alan, Lady Penelope, and Parker.   I think that's the first time you've ever called me by my first name, Brains. Thanks for waking me.   Alan! Well done.   FAB, Brains.    Looks like we're good to go.   We're fine. We still have a job to do. Where's The Hood?  Negative. I'm sorry it's too risky.    Okay, Alan. We'll meet you there. Thunderbirds are go!   Okay, boys, we are outta here.   Gordon, heat 'em up.  Thunderbird 2 lands in a park near the London Eye and causes panic.   Ride it out, boys! Scene changes to Alan, Tintin, and Fermat in Thunderbird 2.    Brains, come in, what's the situation?    Where's Thunderbird 1?   FAB. We're right behind 'em.  Scene changes to Mullion, Transom, and the Hood in the Bank of London.   Hey don't get cocky after one mission. We still have a dangerous situation. I need you boys to close down this accident scene. Tintin, go get Fermat. Meet us at Thunderbird 1. Alan, you come with me.   We got to get to the Bank of London fast.   I know, she may need help.  Scene changes to The Hood inspecting a diamond at the Bank of London.   No. See, you can't save everyone, Alan. It doesn't matter how hard you try or how brave you are. It doesn't even matter if it's someone you love, someone you'd give your life in a second to save. You just can't save everyone.   She was a lot like you. Come on, we've got a job to do.  Scene switches to Lady Penelope being handcuffed at the Bank of London.   Good timing, Parker.   Come with us.   Alan, you guys stay here with Parker. I'm gonna go find Lady Penelope.   Penny!   I didn't make you what you are.   Leave my son out of this- (the Hood uses his powers to throw Jeff into the cage that Lady Penelope is handcuffed in   No!   Alan!  The Hood looks dazed but then uses his powers to fly up to the catwalk above the Mole. The scene then switches to Tintin being chased by Transom running into a cage.   Alan, stay back.  Let him go.   Let him go, please.   Please! Let him go! (the Hood tightens his hold of Alan and then releases him    Alan, get out. Run!   Neither can you! (Alan begins to climb up the Mole to reach the Hood) Alan, no! Look out! (The Hood starts the Mole with his powers and Alan has to jump and grab the railing of the catwalk) Alan!   It's a Tracy secret.   Gather around everybody. I have an announcement to make. Tonight is a special night. We're all together because of three very special people. Fermat, Tintin, Alan. The world needs Thunderbirds and the Thunderbirds need you. (gives each of them International Rescue pins   Congratulations, Alan. No short cuts. You earned it. You all did.    Yes, Madam President. I see. Of course, straightaway. Boys. Sorry, Penny. Duty calls.   Thunderbirds are go! Scene switches to Lady Penelope and Parker in a pink pedal boat",
        "Headmaster": "Mr. Tracy!   Tracy! (after finding Alan in the sea of boys he continues) There's someone here for you.  Lady Penelope Creighton-Ward, at your service. Alan darling, your father's been unexpectedly detained. And he's asked me to pick you up. Is that all right?",
        "Virgil": "Open 'em up. Here we go. Rescue platform's on its way.   It's looking good, Dad.   Okay, I've got a visual. Hold it there. Targets locked. Firing rescue lines. (Directed toward the crew members who he just fired the rescue lines toward) Come on, guys, hook 'em up. We gotta get you out of here.   Hold on guys   Never better   OK, lock it up. Let's go. Let's move it. Hey, we need some help over here.    Hey Sprout! ruffles his hair   No kidding.   Yeah and don't you have homework to do or something?   Man, I haven't seen that much fire since that volcano in Fiji.   No, no, Istanbul was the earthquake.   Roll index angle minus two degrees.    How long will that give us?  Re-entry into Earth's atmosphere in 37 minutes.   Okay let's clean it up guys.   Hey, Scott.   (As all four of Alan's brothers walk over to ruffle his hair and congratulate him) Hey, way to go, sprout!",
        "Lady": "Fantastic. Now, will any of these gorgeous young things be joining you?  All of the boys raise their hands and shout for Alan to choose them.  Quite right.   Alan, shh! I am an undercover agent, so please try to be discreet. (camera pans over to Lady Penelope's pink car with Parker, her butler waiting by the open door.) Here we are.   Try not to run over any children, Parker.    Come on, Parker, chop chop!  Lady Penelope's begins to fly   Oh, look, Parker. Pink is the new black this season.    And hemlines are going up.   Oh and apparently England won the football last night.   Calm down, Parker.   Now, that's showing off.   Parker.   Scene changes to Alan and Fermat about to enter Thunderbird 1's silo.   I'll be right there. It seems the fire at the oil rig was no accident.   Not yet, but I'll keep you posted.    My pleasure. Any excuse to visit paradise.    Hello, Tintin.   When Tintin decides the time is right. Girls always fire ahead of boys with that sort of thing.   Romance.   No, you wouldn't.   Thanks, Jeff.  Scene switches to Fermat and Alan playing around in Thunderbird 1 like they are really about to fly it into a mission.   Parker?   We have an emergency.  Scene switch to Lady Penelope's bathroom   What a charming fellow.  Someone knocks on the door.   Come in.  Parker enters Lady Penelope's bathroom, with tea, where she is up to her shoulders in bubble bath.   Have a look at this, Parker. (There is a computer monitor near her feet.) He, and this woman, poor girl, both work for this man, known as The Hood.    Quite right, Parker. Real name: Trangh Belagant. Assumed dead when  his illegal diamond mine collapsed in the jungles of the Malaya. Oh, perfect, Parker. The Thunderbirds rescued over 500 mine workers, including Mr. Belagant's brother.   How's my schedule, Parker?   I suppose that's urgent.   The Thunderbirds haven't responded?    I think it's time to send the emergency signal, Parker.   Any word?   Right. You will have to tell Lord Marlborough that I've broken my shooting arm. We  shall send the Institute for the Blind a dozen guide dogs. And bring the car around.   The Thunderbirds appear to be in a spot of trouble. And I don't like that. Let's go, Parker.  They get in the car and it takes off flying toward Tracy Island. Scene switches to Mullion and the Hood in the Thunderbirds hanger.   Isn't life fun, sometimes?   This doesn't look good, Parker.   That bougainvillea is absolutely parched, and someone should do something about  that hideous hammock.  And I know Parker.   One tries so hard in life to sort things out on an intellectual-slash-conversational level. sometimes it's just not possible.  Lady Penelope continues to fight Transom and Parker continues to fight Mullion, the Hood is watching them.   Parker, have a bit of a lie-down.   Flattery will get you nowhere. (after she blocks the metal bar that Transom was trying to hit her with) Ow! Have you any idea what a manicure costs these days?   That's not saying much, then, is it?   Don't try your parlor games on me you sad, little man. You've committed a serious crime trespassing on this island. And in about (looks at Parker's watch) four seconds, I'm going to get quite cross with you. (the Hood uses his powers to stop her foot which was about to come up and kick him.   Put me down! This outfit is couture.   Scene switches to Thunderbird 5.   Big oaf! (The fridge door closes leaving them trapped) Right, that's quite enough losing for one day.   Parker, I have an idea.   Brains, how long do Jeff and the boys have?   Here we go.   Come on, Parker. Let's give the bad guys a good thrashing!  Scene switches back to Thunderbird 2 launching Stage three.  Scene changes back to the fridge.   I love it when your checkered past comes in handy Parker.   Will this suffice, Parker?   I didn't actually need it, anyway.    (Using the video phone to talk with Thunderbird 5) Thunderbird 5 come in.  Thunderbird 5 come in.   Thunderbird 5 come in.   London.   Don't boys just love their toys? Complete.   And off we go!  Scene switches to Thunderbird 2 entering London.   Boys, Thunderbird 2 is in final approach to London.   Let's get her down, boys.   Textbook, boys.  Scene switches to the Mole   Parker, meet me at the Bank of London.    Don't be rude. I can't tell you what a pleasure it would be to use my little finger to pull this big trigger. Now, don't move!   That's not cricket.   How ghastly.  Scene changes to Alan and Jeff in Thunderbird 1.   Shame on you. I always despise a man who delegates the important jobs. (sees the look Mullion is giving her) Oh, dream on, sad act. (Mullion chuckles and walks away.  Scene switches to Jeff, Alan, Tintin, and Fermat about to enter the Bank of London when Parker pulls up.  Jeff!   Alan no! (The Hood uses his powers to throw Alan off to the side where he slams into a wall   Let him go.   Alan! Are you all right?   What did you put in these margaritas?   Of course it does. And quite right too.   Scene switches to all five Tracy boys lined up in their uniforms about to go on a rescue mission. The older four are looking at Alan.   Fast as you can, Parker.",
        "Penelope": "Fantastic. Now, will any of these gorgeous young things be joining you?  All of the boys raise their hands and shout for Alan to choose them.  Quite right.   Alan, shh! I am an undercover agent, so please try to be discreet. (camera pans over to Lady Penelope's pink car with Parker, her butler waiting by the open door.) Here we are.   Try not to run over any children, Parker.    Come on, Parker, chop chop!  Lady Penelope's begins to fly   Oh, look, Parker. Pink is the new black this season.    And hemlines are going up.   Oh and apparently England won the football last night.   Calm down, Parker.   Now, that's showing off.   Parker.   Scene changes to Alan and Fermat about to enter Thunderbird 1's silo.   I'll be right there. It seems the fire at the oil rig was no accident.   Not yet, but I'll keep you posted.    My pleasure. Any excuse to visit paradise.    Hello, Tintin.   When Tintin decides the time is right. Girls always fire ahead of boys with that sort of thing.   Romance.   No, you wouldn't.   Thanks, Jeff.  Scene switches to Fermat and Alan playing around in Thunderbird 1 like they are really about to fly it into a mission.   Parker?   We have an emergency.  Scene switch to Lady Penelope's bathroom   What a charming fellow.  Someone knocks on the door.   Come in.  Parker enters Lady Penelope's bathroom, with tea, where she is up to her shoulders in bubble bath.   Have a look at this, Parker. (There is a computer monitor near her feet.) He, and this woman, poor girl, both work for this man, known as The Hood.    Quite right, Parker. Real name: Trangh Belagant. Assumed dead when  his illegal diamond mine collapsed in the jungles of the Malaya. Oh, perfect, Parker. The Thunderbirds rescued over 500 mine workers, including Mr. Belagant's brother.   How's my schedule, Parker?   I suppose that's urgent.   The Thunderbirds haven't responded?    I think it's time to send the emergency signal, Parker.   Any word?   Right. You will have to tell Lord Marlborough that I've broken my shooting arm. We  shall send the Institute for the Blind a dozen guide dogs. And bring the car around.   The Thunderbirds appear to be in a spot of trouble. And I don't like that. Let's go, Parker.  They get in the car and it takes off flying toward Tracy Island. Scene switches to Mullion and the Hood in the Thunderbirds hanger.   Isn't life fun, sometimes?   This doesn't look good, Parker.   That bougainvillea is absolutely parched, and someone should do something about  that hideous hammock.  And I know Parker.   One tries so hard in life to sort things out on an intellectual-slash-conversational level. sometimes it's just not possible.  Lady Penelope continues to fight Transom and Parker continues to fight Mullion, the Hood is watching them.   Parker, have a bit of a lie-down.   Flattery will get you nowhere. (after she blocks the metal bar that Transom was trying to hit her with) Ow! Have you any idea what a manicure costs these days?   That's not saying much, then, is it?   Don't try your parlor games on me you sad, little man. You've committed a serious crime trespassing on this island. And in about (looks at Parker's watch) four seconds, I'm going to get quite cross with you. (the Hood uses his powers to stop her foot which was about to come up and kick him.   Put me down! This outfit is couture.   Scene switches to Thunderbird 5.   Big oaf! (The fridge door closes leaving them trapped) Right, that's quite enough losing for one day.   Parker, I have an idea.   Brains, how long do Jeff and the boys have?   Here we go.   Come on, Parker. Let's give the bad guys a good thrashing!  Scene switches back to Thunderbird 2 launching Stage three.  Scene changes back to the fridge.   I love it when your checkered past comes in handy Parker.   Will this suffice, Parker?   I didn't actually need it, anyway.    (Using the video phone to talk with Thunderbird 5) Thunderbird 5 come in.  Thunderbird 5 come in.   Thunderbird 5 come in.   London.   Don't boys just love their toys? Complete.   And off we go!  Scene switches to Thunderbird 2 entering London.   Boys, Thunderbird 2 is in final approach to London.   Let's get her down, boys.   Textbook, boys.  Scene switches to the Mole   Parker, meet me at the Bank of London.    Don't be rude. I can't tell you what a pleasure it would be to use my little finger to pull this big trigger. Now, don't move!   That's not cricket.   How ghastly.  Scene changes to Alan and Jeff in Thunderbird 1.   Shame on you. I always despise a man who delegates the important jobs. (sees the look Mullion is giving her) Oh, dream on, sad act. (Mullion chuckles and walks away.  Scene switches to Jeff, Alan, Tintin, and Fermat about to enter the Bank of London when Parker pulls up.  Jeff!   Alan no! (The Hood uses his powers to throw Alan off to the side where he slams into a wall   Let him go.   Alan! Are you all right?   What did you put in these margaritas?   Of course it does. And quite right too.   Scene switches to all five Tracy boys lined up in their uniforms about to go on a rescue mission. The older four are looking at Alan.   Fast as you can, Parker.",
        "Parker": "Good afternoon, Master Hackenbacker.    Less of that attitude, or I shall be obliged to deliver the Parker Haymaker.    Very good, milady.   I'm very glad to hear it, milady.   That is good news, milady.   Yes! Eng-er-land! (his hands go off the steering wheel and the car begins to move to one side  Yes, milady. Sorry, milady.   Pardon me, milady. Approaching Tracy Island. And radar indicates we have some company.  Thunderbird 1 and 2 pull up next to Lady Penelope's flying car and Scott waves at Alan before Alan turns to look at Thunderbird 2 where his father salutes at him. Thunderbird 1 then does a barrel roll around Thunderbird 2 before they both jet off toward the island, leaving Lady Penelope's car behind.   Milady?   Sounds like an alias, milady.   Milady, that's Mr. Tracy's loyal manservant, Kyrano.   You have clay pigeon shooting with Lord Marlborough, a benefit gala for the Institute of the Blind, and incidentally there's a typhoon bearing down on Singapore.   Yes, milady. There was also a bridge collapsed in Buenos Aires and a volcanic eruption in Jakarta.   No, milady. And the media is awash in speculation vis-à-vis their whereabouts. Parker turns on the news.   I fear you're not wrong, milady.   Nothing, milady.   Yes, milady.   Tracy Island approaching, milady. Switching to aqua mode.   Rib-tickling, milady.  Scene switches to Transom and The Hood in Command and Control getting an alarm that an aircraft is approaching Tracy Island.   No, milady.   Milady.   Yes, that was very much the intention of the maneuver.   (after Mullion threw him against a metal cabinet) Shall I bring the car around, milady?    Excuse me, milady. (punches him and after that has no effect he picks up a frying pan and hits Mullion  Transom goes back to fighting Lady Penelope and Mullion is fighting Parker.   Coming through, milady.  The camera quickly pans a little bit outside to show Alan hidden behind some shrubs watching the fight.   (After the Hood uses his powers to throw a sofa at them) Duck, milady!   Really, sir, don't mind me. This isn't the first time my head's been pulverized. And it's never done any real harm before. (The Hood once again uses his powers on them and they cry out in pain louder this time   Excellent, milady.   In position, milady.   Good shot, milady.   (trying to figure out how to open the door) This seems to be a six-lever mortise, milady.   Thank you, milady. Unfortunately, I fear I shall need a piece of wire to access the mechanism. (Lady Penelope's hand goes up shirt to get her bra wire and everyone turns around   Most certainly, milady.   Of course not, milady. (Parker gets the door open   Yes, milady.'  Alan, Tintin, and Fermat run to Thunderbird 2. Scene switches to Thunderbird 3 re-entering Earth's atmosphere.   Good afternoon Mr. Tracy.   My pleasure, Mr. Tracy.  Scene switches to The Hood talking to Mullion and Transom.   Master Tracy!   Alright, that's enough of that.   No, sorry. I can't hit a lady.   And I've been waiting to get my hands on you.  They brawl for a few seconds before Mullion lands a good punch on Parker.   Ow, now that was a punch.   What did you have in mind, Master Hackenbacker?    I concur.   Scene changes to Jeff running into the room that Lady Penelope is being held captive in   (To Lady Penelope as she climbs in the car) Now, that was definitely showing off.  Scene changes to back at Tracy Island. Scott, Virgil, John, and Gordon are playing in the pool. Jeff is grilling with Lady Penelope standing next to him. Fermat is getting swimming lessons from his dad and Alan is watching.  I'm not usually an emotional man, but sometimes even the toughest nut must crack.   Certainly, milady.  Credits Roll with music by Busted playing in the background",
        "Scott": "Thunderbird 2 this is Thunderbird 1. I have visual, south column, they're trapped on an inspection platform.   Got it.  A blast of fire hits Thunderbird 1 and sends it a little farther away from the accident zone.   Negative, Dad.  Watch the wind shear Thunderbird 2.    Who needs the diapers now, Dad?   FAB, Thunderbird 2. (after pressing a bunch of buttons on his control panel) Lining up target. Fire!    ruffles his hair Hey Buddy!   So I'm getting the reading telling me that the wind is blowing 60 knots, right up my keister.   Well that's the first thing I did, Sprout! It's not my first day in a Thunderbird you know.   Yeah, keep Alan away from the ships, he's a hazard.   That wasn't Fiji that was Istanbul.   Yeah well, nothing compares to Argentina.    Tunnel hatch secured.   We got a warning light on our EPS system.   No, that's negative!  Scene switches back to Alan, Tintin, and Fermat in the vents.    You'll never get away with it.   CO2 levels are rising.   The heat exchanger has blown.   Oxygen's out in 30 so we won't feel it.   There they are!   Get him!",
        "Fermat": "Alan. Alan!  Alan's head jerks back from the window and to the teacher who is now standing in front of him.   Alan!  Both boys turn around to see the headmaster approaching them while walking by with the teacher from before   You gotta be more careful Alan.  Because technically you're not a Thunderbirds yet. And if your identity was discovered, it would a d-d-di- it could be very bad.   Wanna watch?   What do they do now?   Commencing reverse thrust.   Sure beats the bus!   Hi, Parker.   Whoa!   Yeah! the boys high five   Whoa!  But! I'm not done!  Okay.  After dinner   We're not supposed to go in there. We could get in trouble.   Where'd you get the access code for Thunderbird 1 anyway?   Right. Hydraulic systems are green.    FAB, Alan.   No wait, Alan! That's the(Thunderbird 1 begins to start up and Fermat shouts) Wrong switch!    It just did. The boys walk out of Thunderbird 1 and are walking toward the silo door. Fermat is running his hand on the nosecone of Thunderbird 1.  We're so b-b-busted.  Fermat's hand touches the goo that Mullion fired at Thunderbird 1 earlier.   Look at this.   Looks like some sort of, gallium-electrolyte compound.   Morning, Dad.   The neural-net control system?   Dad?  The neural-net control system short circuits.   There's something I want to talk to you about.   N-no! No. Alan and I found some sort of gallium compound on the nosecone of Thunderbird 1.   That'd be g-g-g-swell! Scene skips to Alan skipping rocks at the beach. The camera follows one rock and it leads to a telescope coming out of the water. The telescope is connected to the Hood's submarine.   Alan! Tintin! Thunderbird 5 has been hit! Thunderbird 5 has been hit! Thunderbird 5 has been hit!   Run!  The kids run and hide behind some trees and shrubs. Scene then switches to inside the submarine.  No! That compound we found could have some sort of transmitting capability.    My dad's in the control room, but how do we get there now?   Watch out for the guards.   Okay, this one.  Scene switches to Thunderbird 5.   They've got m-my dad.   Every family has a black sh-sh- a black sh- (Sneezes and everyone in the Command and Control room looks around, while Brains pretends that it was him that sneezed.   This room's murder with my allergies.  The kids stick their heads back out the vent and look at what is going on in the Command and Control room.   Go! Go!  The children reach the door that leads to Thunderbird 3's silo just as it closes.   (After the door closes before they can get through it) No!   If we can get to the Thunderbird 1's silo, we can escape through the service tunnel. But we need a plan, Alan.   Alan! This equipment is only to be used in an emergency. (Alan and Tintin give him looks) I guess this qualifies.   Uh, no.   I took microbiology, not driver's ed. Set the pressure to maximum.   Coming!   I had an-n-n idea.   No!  Ow. What are we gonna do, Alan?   How about a little warning next time you pull a stunt like that?   I could have drowned.   I repeat, I could have drowned.  Scene switches to the boys ringing out their shirts, they are both in their boxers.   Thank you.   Data from Tracy Island is sent to Thunderbird 5 via satellite, right?   So, there's a miniscule possibility that if we reach the satellite station, we could   No, we could hack in to it and give control back to Thunderbird 5.   But that's f-f- off limits.  Actually, he's not going anywhere for now.   Alan, my friend, what you don't know, can't hurt you.  Scene switches to Lady Penelope's Country Mansion in England, where Parker is out cleaning a car when the car phone rings.   What do you mean, Alan?   Don't be silly, Alan. Everything can be explained by science.   My Achilles heel is actually my Achilles heel. It's got a blister the size of a basketball. Tintin! Can we s-s-   Yes!   Okay.  Alan, don't you think Tintin is blossoming?    Come on, Alan. You've a c-crush on her.    Five isn't going to do it!   (Sees scorpion when he stands up next to Alan) Whoa   .025 milligrams of its venom is fatal.    Watch out!   You think?   Not girls!  Scene cuts to Thunderbird 5 where there is an alarm and then an explosion near Scott and Gordon.   Don't rush me Alan. This is very d-delicate equipment. Which is now b-b-broken.   Yea- Maybe, but I'll need something to solder with.   Perfect.   What'd he say?   I got it, yes! Y-y-you the man, Fermat! Okay, first step is to establish contact with Thunderbird 5.  Scene switch to Thunderbird 5   Okay, we're almost there.  Scene switches to Command and Control room with Transom and Brains.    They're onto us! We're being jammed!    I'll try.   It's not going to work Alan. The signal's too weak for data transmission.   No!   It is now.   You don't have to be such a tough guy Alan. I'm worried about my dad too.    Even worse, they know exactly  Tires screech and Mullion and the guards appear.   Where we are! Mullion and the other guards watch the kids running down the hillside for a second.   Great, more water.   It's gonna make this thing hard to control you know.   You really must be careful not to exceed four bars of boost or else   It's a hoversled.    Here.  Actually, I agree with Tintin. I don't think this is s-s-safe.   Just because I s-s-stutter doesn't mean that I'm wrong. If we're a team, we should make decisions as a team.   Alan! You're going too fast!   Oh, no! Not the fridge!  Fridge door opens to reveal Kyrano, Onaha, and Brains.   Not b-bad, actually.   We make quite a pair. It's hard for me to t-t-talk. It's hard for you to l-l-listen.   Quick! They're getting away   Hat.  Scene switches to everyone running into the Command and Control room   Get in there quick, Fermat, and save my family. Then we'll get The Hood. Good luck!    Looks like they slipped a backdoor key into the access codes.   90 seconds and counting    I'm in!  Okay, I just need someone on their end to confirm the access protocol.'   45 seconds until re-entry.   Mr. Tracy, confirm access protocol.    N-n- I guess!  Scene switches to Alan, Fermat, Tintin, and Lady Penelope in Thunderbird 1 with Alan and Fermat at the controls.    Flight controls are green.  Hydraulic systems are good.    Stand by. We're going to maximum thrust.    Right.     You're going too fast.   What are we gonna do, Alan?   Me?! Fly alone?!   FAB, Alan.   Scene switches to Thunderbird 3 flying to London.   I can't get a clear fix on the target. I might hit the passengers.   What you mean swim?!   Just look out your window.   Come on, Tintin, come on!   FAB, Alan. Commencing reverse thrust.    Nothing to it, really.   Look out, Parker!   Parker, can we wrap this up?   Strategically speaking, the best odds of success lie with the Parker Haymaker.   Mr. Tracy!",
        "Teacher": "So, gentlemen, we all know that A2 plus B2 equals... C2, that's right. But what happens when we bring in Leonardo Da Vinci's E, F and... (Teacher notices Alan looking out window and not paying attention to the lesson) Mr. Tracy!   How kind of you to come back from outer space, Alan. I trust re-entry wasn't too rough?  Here on Earth we've been discussing the Pythagorean theorem. Did any of that happen to sink in?   Apparently not (she picks up his notebook which he has been doodling in) \"Thunderbirds are go.\" Well, I hope you aren't going anywhere special over spring break, Alan. Because I expect a 10,000 word paper on my desk the day you get back. That should keep you busy.  Bells rings dismissing the students and Alan and Fermat walk out to their lockers.",
        "Lisa": "We are told this super-rig is now in danger of total collapse. And there is real concern for the lives of six men who remain trapped on board. An emergency call went out to the Thunderbirds just a few minutes ago. They should be here any moment now.  And here they are!  The boys watching the TV begin to cheer  As you can see the fire has been extinguished. The rocket fired from Thunderbird 1 has robbed it of the oxygen it needed to burn. Amazing! The Thunderbirds have done it again, Chuck! '  The boys watching the TV with Alan and Fermat begin cheering.    Chuck, disaster after disaster around the world today and still no sight of the Thunderbirds. Typhoon Jago hit land in Singapore just one hour ago and thousands have been left homeless by a volcano in Jakarta. Only the Thunderbirds have the incredible machines   Lisa Lowe. Back to you, Chuck.  Parker hits the top of the tea pot and a light pops out and begins to blink and beep. Back on Tracy Island a similar light begins to flash and bleep but Brains is unable to get up to get to it because he is tied up.  Scene switch to the kids walking through the jungle.   Chuck, I'm here in Jubilee Gardens where Thunderbird 2 has made an impromptu landing, causing total panic in Central London. As far as we know there has been no emergency call from this area so it's unclear why Thunderbird 2 would be active here at all. I don't know if you can see this Chuck but Thunderbird 2 seems to be unloading some kind of machine.   Scene changes to inside the Mole with Transom, Mullion, and The Hood.",
        "Lowe": "We are told this super-rig is now in danger of total collapse. And there is real concern for the lives of six men who remain trapped on board. An emergency call went out to the Thunderbirds just a few minutes ago. They should be here any moment now.  And here they are!  The boys watching the TV begin to cheer  As you can see the fire has been extinguished. The rocket fired from Thunderbird 1 has robbed it of the oxygen it needed to burn. Amazing! The Thunderbirds have done it again, Chuck! '  The boys watching the TV with Alan and Fermat begin cheering.    Chuck, disaster after disaster around the world today and still no sight of the Thunderbirds. Typhoon Jago hit land in Singapore just one hour ago and thousands have been left homeless by a volcano in Jakarta. Only the Thunderbirds have the incredible machines   Lisa Lowe. Back to you, Chuck.  Parker hits the top of the tea pot and a light pops out and begins to blink and beep. Back on Tracy Island a similar light begins to flash and bleep but Brains is unable to get up to get to it because he is tied up.  Scene switch to the kids walking through the jungle.   Chuck, I'm here in Jubilee Gardens where Thunderbird 2 has made an impromptu landing, causing total panic in Central London. As far as we know there has been no emergency call from this area so it's unclear why Thunderbird 2 would be active here at all. I don't know if you can see this Chuck but Thunderbird 2 seems to be unloading some kind of machine.   Scene changes to inside the Mole with Transom, Mullion, and The Hood.",
        "News": "",
        "Anchor": "",
        "Alan": "I was just...   \"That should keep you busy. Yeah, well you can take your 10,000 words and stick them right up your...\"   Headmaster.   Miss Garrett.  Why can't I tell 'em I'm a Thunderbird Fermat?   I know, I know.   Whoa! Whoa! Whoa! Where are they?   Great! I'm stuck at school and my brothers are on another cool mission.   Yeah!  Boys go into a crowded room with a TV on the news channel   Come on, come on! Swing around. You can't get close enough, taking that approach angle.   Come on, Dad.  A blast of fire comes toward Thunderbird 2   Probably drop the rescue platform from Thunderbird 2.   Man they gotta get 'em out fast. That rig's gonna blow.   Come on, Virgil.   That's another good one, diaper boy.   All the boys look at the Know It All Kid and laugh   Definitely!   Just Fermat.  Lady Penelope, why are you in America? Are you on a mission for my father?    Hi, Nosey.   Okay, bring it on, big guy.  They are all in the car and Parker is driving away   All right!    Whoa!  I wish that was me.   Dad!  So Dad, I saw the mission on TV. It looked dangerous.   Do you think the fire was caused by thermal up draughts? I mean that would explain the-- (Jeff cuts him off   School's boring. Plus I've been thinking, maybe I could be home-educated now. That way, I could sit in on missions from time to time. What do you think?   Did you try readjust the flaps?   Dad, I'm not really hungry. Come on, Fermat. Let's go.   Ah, you worry too much.   Fermat, my friend, what you don't know, can't hurt you.  Scene changes back to Lady Penelope and Jeff by the pool   Thanks for bringing Alan home.   Okay, Fermat. Run pre-flight checks.    Commence main engine sequence.   Couldn't hurt to just fire up the instruments.    Oh God. (There is loud beeping coming from the control panel and the boys can't shut down Thunderbird 1) Oh, could this day get any worse?  Scene briefly changes to Jeff getting an alert in his office.    I can't believe it.   What is it?   We gotta get out of here.  Scene changes to Alan walking into his dad's office.   Dad, I know you're mad. I shouldn't have been in the ship, but if you just give me a minute to explain-   But, nothing happened Dad. I had it under control.   Yeah, I understand. I understand you don't want me to be a Thunderbird. You don't want me to do anything. You won't even listen to me when I'm trying to tell you something important!   But, Dad!   Then let me. (he stalks toward the door before whispering,) Please!  Jeff is starting at two old family photos on his desk when the video phone rings.   Okay, Okay, Okay, Okay, Okay don't panic. Don't panic.  The children look toward the beach when they hear a noise and see the submarine beginning to surface.   On the other hand.  Run!  The kids run and hide behind some trees and shrubs. Scene then switches to inside the submarine.  How'd they find the island? Do you think it was what I did in Thunderbird 1? Do you think I ruined everything?   The vents. Let's go! We have to get a message to my dad.  Scene switch to Thunderbird 5    Come on, hurry!  Inside the Tracy house Transom has found the closed door to Command and Control center. Using an electronic device she finds out what type of door it is.   Get in, get in.  Scene switches to Brains sitting nervously in the Command and Control room, whistling nervously to himself and reading a magazine upside down. On the other side of the door there is muffled banging from where Mullion is trying to break open the door.    Just keep going straight ahead.   That's it.   They've taken over.   Who's the bald freak?   Whoa.   No, jump! We can get through to the silos.  The children scream as they fall down a tunnel leading to the silos. And the scene switches to the Command and Control room.   Hold on!   This way. (They run toward the still closing Thunderbird 1 silo door.    I'll use the Thunderizer on the door.   guards are in the elevator heading down to come get them   You guys get the goons with the Firefly!   Yeah.   That's it. Time to thunderize. (After the door has a hole cut in it.) Yes!    Come on, let's go!   Where's Fermat?   Fermat!   Hurry up. (the children are now in Thunderbird 1's silo) What were you doing back there,  Fermat?   Just try and keep up, okay? I'll open the tunnel. We gotta keep moving. (Alan types in a pass code   Go back. Yell when you see them coming. (tries another pass code  Alan turns away from the door for a moment and the camera can see The Hood on the other side of the door. Alan turns back and sees him.   We can't go this way. He's there.  The Hood uses his powers to open the door and Mullion and the other guards appear at the other doorway, leaving the children trapped.   I don't know. I'm thinking, okay? (Alan looks at the control panel behind the Hood and sees a button that will open part of the floor under Thunderbird 1. Keep backing up. I've got an idea. (Alan takes his rock launcher from the pouch it is in on the back of his pants. and fires it at the button, but misses.   It's not you I'm aiming at. (Alan fires another rock and this time hits the button and the floor drops out from underneath Tintin, Fermat, and Alan. Tintin, Fermat, and Alan scream as they fall.   Relax, Fermat. It's just a little water.    You mean you can't swim?!   I said I was sorry, Fermat. Just put this behind us, Okay? We gotta watch each other's backs. Nice drawers.   No, c'mon Tintin, stay there.   Right.   Blow it up!   Good thinking, Fermat. Alright, let's do it. (Alan starts drawing the plan in the sand) Here's the plan. We're here, right?. So, we go along the shore around the base of the mountain to the access road, here. And then up to the transmitter. So what do you think?    I'm in. (All three of them put their hands together) We gotta get up there fast! All our folks are in trouble and if The Hood gets off the island   The guidance processor for Thunderbird 2. You can't take off without it. Fermat you're a genius. How'd you get this?   I'm telling you, Fermat, it was like The Hood was inside my head back there.    Maybe he can read minds or control minds or something.   I'm just trying to figure out his weakness. Everybody has an Achilles heel, right?    No more cheeseburgers for you, Fermat.  Scene change back to Lady Penelope's house.   Blossoming?! What's that supposed to mean?   You've got to be kidding. I mean, she's. She's not that bad, I guess.   What is it?   Is that dangerous?   So, dangerous is in fact an understatement.   Tintin uses powers just like her uncle, The Hood, to lift the scorpion off of Alan's shoulder and lets it fall to the ground.   Tintin, what was that?   Hey! She has the same powers as her uncle, The Hood.   Must run in the family. Did you do that?    Still think everything can be explained by science?   How we doing Fermat?   Can you fix it?   We're in the middle of nowhere Fermat, where are you going to find something like that. (Tintin and Fermat see Alan's retainer and share a look) What?  Alan yells as Tintin and Fermat pull out the metal part of Alan's retainer.   Ow!   I'm gonna kill you.   Dad?   I'm at the satellite relay station with Fermat and Tintin. Fermat's gonna hack into the main computer system and give control of Thunderbird 5 back to you.    Can you finish?   Hang in there Dad, one more minute, okay?   Dad, can you hear me? They're jamming the signal. We're going to lose you. Don't worry, I'll take care of everything, okay?   Dad!   Dad!  Alan throws the video phone   Useless!   No, it's okay. I'm fine.   But The Hood knows we're alive now. We have to go.  Tintin, can you slow 'em down?   Then do it. And meet us at the junk yard. Come on, Fermat.  Scene changes to Alan and Fermat discovering a hoversled in the junkyard.   This'll get us out of here.  Scene change to Mullion hunting Tintin down in the forest.   No problem.   I said no problem.   It's our ticket out, unless you've got a better idea.   Great plan. Let's sit and wait to get caught. I say we do something. Now! Right, Fermat?   You don't think anything is s s-safe.    Do you guys want to sit here and take a vote? Or do you want to get out of here? Cuz I'm going.   I need more speed to get above the trees. Hang on!  Tintin and Fermat fall off the hoversled screaming and at Mullion's feet.   What'd I tell you guys? (looks down and sees Fermat and Tintin being captured.) Oh, no.  Scene switches to Mullion walking Tintin and Fermat to a door in the Tracy house.   Lady P!  Scene switches to Thunderbird 5   He's weak. Using his power makes him weak. (The Hood, having heard something looks over toward where Alan   Stop! Stop! I'll give it to you. (throws the guidance processor toward the pool) Fetch! (the Hood uses his powers to bring it over to him before it can hit the water   So, how does it feel to be right all the time?   I'm so sorry, Fermat.  We've got to be quick. The Hood's getting away.   Yes!   Okay, everyone get to the control room.    How long have they got before re-entry?    Good job, Fermat.   Dad, come on are we coming through?    Dad, come on!   Dad!   How long have they got?   Dad!   Dad, are you all right?   He's got the Mole on board.   Let me go after The Hood. He'll destroy everything you've built everything the Thunderbirds stand for.   I can do this. You know I can. What am I saying? (Puts his arms around Tintin and Fermat) We can do this.    Yep.   You ready, Fermat?   Right. Set primary fuel pumps. Main engine start.   Roger, Brains.    I know The Hood's weakness, Fermat. I can stop him if we get there in time.    Initiate landing, Fermat.   Retros at 75 flaps to 16.   Thanks. Retros to 90.  Thunderbird 1 lands.   The Hood's getting away.   We're the Thunderbirds. Our duty is to save those people. Brains, we're going into the accident zone.   Brains, the monorail is down. Repeat, the monorail is down. I'm going underwater in Thunderbird 4. You have the bridge.   Fermat, the Thunderbirds need you right now. I need you.   Fermat, deploying Thunderbird 4 in three, two, one, Thunderbird 4 is go. I can see the monorail.  People are panicking in the monorail and a little girl is crying for her mommy.  Don't panic, guys.    Fermat, I'll hold the monorail in place. Can you get a line on that stanchion and lift it up?   How are we doing on that line Fermat?    Come on. Come on, Tintin. You can do this. (Tintin successfully connects the rope to the stanchion and swims toward Thunderbird 4's airlock) Opening the airlock.    OK, Fermat, we need a lift.   That was amazing, Tintin.   Nice job, Fermat.   (To Tintin who is helping him lift the monorail out of the water with Thunderbird 4) Easy does it.  Thunderbird 3 has landed and Jeff, Scott, John, Virgil, and Gordon are running over to the river bank to look for Alan in Thunderbird 4.   (After he and Tintin have gotten out of Thunderbird 4) Glad you could finally join us.  Lady Penelope went after The Hood.    Hey, Dad. That stuff The Hood said, about you leaving him to die. He was lying, right?   What was Mom like?   But what about The Hood? (Alan points behind Parker) Look out, Parker! (When Parker turns away Alan runs after his dad.   Dad! (Alan runs toward the closing cage door and reaches it right as it slams shut) Dad! Dad!   Well, we're not. I'm Jeff Tracy's son.    He's getting weaker. He can't last much longer.   I don't want to save your life. (the Hood lets his other hand go, but Alan grabs it) But it's what we do.  Scene switches to The Hood, Mullion, and Transom being led to a police car outside the Bank of London when Thunderbirds 1,2, and 3 fly above them.   Good job, Ferm.   He's getting there. Whoa, Tintin! You're just really, um, blossoming."
    },
    "imdb_rating": "4.3",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTU2NDA1NTkyN15BMl5BanBnXkFtZTYwNzAzODg2._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "The year is 2010. Teenager Alan Tracy, sent off to a distant boarding school, is the youngest of the sons of Jeff Tracy, a retired American astronaut. Jeff, a widower, has formed International Rescue, and raised his sons to act as a secret, volunteer organization which uses highly advanced technology to save lives worldwide. Jeff and his older sons John, Virgil, Scott, and Gordon, who like Alan were named after the Mercury Seven astronauts are joined in this effort by Lady Penelope and her butler/chauffeur Parker. Their futuristic hardware is largely developed by a genius scientist known as Brains, who lives at the International Rescue base on Tracy Island, somewhere in the Pacific.—Anthony Pereyra {hypersonic91@yahoo.com}",
    "name": "Thunderbirds",
    "genres": [
        "Action",
        "Adventure",
        "Comedy"
    ]
}