{
    "filename": "Tombstone_script.txt",
    "imdb_id": "tt0108358",
    "imdb_url": "https://www.imdb.com/title/tt0108358",
    "characters": [
        "Mattie Earp",
        "Johnny Ringo",
        "Billy Breckinridge",
        "Billy Clanton",
        "Henry Hooker",
        "Wyatt Earp",
        "Behan",
        "Doc Holliday",
        "Ike Clanton",
        "Josephine Marcus",
        "Louisa Earp",
        "Curly Bill Brocius",
        "Virgil Earp",
        "Allie Earp",
        "Morgan Earp"
    ],
    "dialogues": {
        "Mattie": "Wyatt, I couldn't find a single Store that had laudanum any-  Oh, he can go all right.  Rather ride than eat.  You're a lifesaver!  Don't worry, I just get headaches sometimes.  I think I'll just lie down awhile  Long as I live I'll never Get used to that sound.  You get lonely?  I hope they're good.    Oh, all right.  No, no, I don't want to keep you.  Just go.  It's all right.  Wyatt, Really.  Work well.  I know what I'm doing.  Where have You been?  I don't know.  I'm all right.  Sure I'm sure.  What is this?  Wyatt, what're you talkin' about?  Thought you swore you'd never Carry that thing again.    Admit what, I'm an opium fiend? No, Wyatt, I just said I need it. I need something to keep me warm At night.  You know nothing.  What you don't Know would fill a book.  Jesus, I Feel like it's when you're around I need it most.  You're never Yourself, you never relax.  Never. Everything's so stiff and dead. You always have to keep a rein on Everything, ever yourself.  Oh, You smile sometimes, I've even Seen you laugh.  But there's no Light in your smile for me, Wyatt, nothing to keep me warm. And I get cold, Wyatt.  I get so cold. What's between you and that Jew woman?  Will you go to her and tell her Right in front of me she's Nothing to you?  Right out loud so I can hear?  Tell her she's Nothing, tell her she's nobody, Just dirt?  Will you do that?  Until you can do that we've got Nothing to talk about, Wyatt. Nothing.  Now leave me alone.",
        "Earp": "",
        "Johnny": "",
        "Ringo": "That's not what he said, you Ignorant wretch.  Your spanish is Worse than your English.  Come on, Let's get it over with.  You first.  He was quoting the bible, Revelations: \"Behold a pale horse And the one that sat on him was Death and Hell followed with him.\"  I already did it.    You retired, too?  Yeah, you look it.  Age quod agis.    I want your blood and I want you Souls and I want them both right now.    Wretched slugs, don't any of you Have the guts to play for blood?  All right, lunger.  Have at it.  Here it come: one-two-  I want them spitting blood!  There's no God, there's no devil, I hate the God damn world!  I want To die!    Curly Bill?  He killed Curly Bill?  He's just a man.  You see my face, don't you?  Everybody get this through their Heads.  Wyatt Earp dies.  I'm Running the show now and I'm Telling you, Earp dies.  His men Too.  They all die.  Understand? We're gonna kill 'em.  For what They did to Curly Bill we're Gonna ride 'em into the ground And slaughter 'em like rabbits. 'Cause this is my time, children. This is where I get woolly.  You heard me, Behan.  No, you don't understand.  Who cares?  Separate the wheat From the chaff.  Sure, why not?  I told you it was time to get Woolly.  Now gather 'round, Children, gather 'round.  And Raise your right hands.  Let him go.  Who cares?  Hooker's got around 15 or 16 Hands.  We could take 'em right Enough but it might be a mess. Keep the place bottled up for Now, see if we can figure a way To flush 'em.  Well hello, Sherm.  Yeah, kinda, wanted to see if you'd join back up with us.  You're a Cowboy, you're a Brother.  Come back, no hard Feelings.  Isn't there anything I can say That'll change your mind?  You're Gonna stay with your new friends?  You're the boss.  One thing, though.  How you gonna get back to 'em?  Only three.  They left somebody Behind.  Let's go take a look.  Who's in there?  Drag him out here, let's have a look.  All right, Hooker.  I'll be back In about an hour.  We'll see how Brave you are then.  Soon as I'm through with Wyatt, Swarm down with the whole bunch And finish off Creek Johnson and Texas Jack.  Well, didn't think you had it in you. Shall we?  My fight's not with you, Holliday.  I was kidding about that.  All right, lunger.  Let's do it.",
        "Billy": "He said to turn loose of him.  He's bluffin'!  Let's rush him!  Hell, he can't hit nothin'.  He's So drunk he's probably seein' Double.  Beauty, ain't he?  Where do you think?  I stole him.  Come and get him.  Probably already scared them to death.  More cartridges!  Somebody load my gun...  I'm sorry, sir, but we got to Have some law.",
        "Breckinridge": "",
        "Clanton": "Tell 'em to get on their knees.  Hey, somebody get that stick on His knees.  They call me Old Man Clanton.  I'm What you might call the founder Of the feast.  Now maybe you ain't Heard, but we skylark through Your dingy little country just About any time we damn well Please and big-hat, crummy- Lookin' free-holes stumblin' Around in the dark ain't allowed. Messican po-lice, huh?  Think You're bad medicine, don't you? Hell, I've let stronger stuff run Down my leg.  So next time we come Better step aside.  Get in our Hair again, we'll saw your prods Off with butter knives and stuff 'em in your gobs.  Ain't kiddin' neither.  You been told.  Now git.  Ain't that sweet?  That's why I Stay out here.  Thank you, God.",
        "Henry": "",
        "Hooker": "Armed with a borrowed pistol and carbine, Wyatt gallops through the desert on one of his other big blacks, eyes scanning the tracks beneath him.  He rides up and stops at a well near a large ranch house.  He dismounts, studying tracks as rancher HENRY HOOKER rides up, strong, noble-looking, like something from a Frederic Remington canvas.  Wyatt nods. Hooker nods back.   That's right.  And I'm Hooker.  Look, Mister, it's fine for you Boomers to court trouble, you're Just passin' through.  Us Cattlemen gotta live here.  Best I Can do's point you up to the cut. That's their roost.   Wyatt's group rides over the hill overlooking the ranch house Vermillion keeping Doc in the saddle.  Hooker and 3 of his hands rides out to them:   You can put up at my ranch if you want.   Doc lies in bed, semi-conscious, white as a sheet, drenched in sweat.  The others look on, worried.  Hooker shakes his head:   I'm no doctor but he looks pretty bad.   The stage is stopped out front.  The driver waters the horses and the actors mill around silently.  Wyatt and Hooker walk out:   Had a holdup.  Came her to water Their horses before pushin' on.   Wyatt and his men are on the porch, listening to Hooker:   ...brought 'em in draped over their saddles.  Little Billy Breakenridge.  Sister Boy.  He done It.  So I guess the law's finally Arrived in southeast Arizona.   Wyatt stands on the front porch, looking through the front door to the back bedroom where Doc lies unconscious while Hooker and the others look on:   Don't have to bother about that. Took a vote.  Cowboys or not, you Can stay here as long as you want. Anyway maybe you done enough.  I Mean you whittled 'em down Considerable, now there's talk of Sendin' the Army in here.  Ask me, You done enough.   McMasters rides up with the 3rd Cowboy.  Riding through camp, all his former comrades flares at him with pure hate.  Only Ringo smiles, stepping up as McMasters dismounts.    The 3rd Cowboy rides up to the ranch house, dumps a large SOMETHING in front, and gallops back to just within earshot as Wyatt and his men run up.  The object is a human corpse and though we can't see what was done to it, the expressions on their faces are plain enough.    It's late and the last rays of the sun come through the window, falling on the bed where Doc lies, awake but looking like hell.  Wyatt sits next to him, staring at the floor. After a moment:    It's late, almost sunset.  Wyatt steps onto the porch where Hooker and the others wait.  He glances back into the house, looking at the unconscious Doc through the open bedroom door.   Don't worry.  They want him They'll have to go over us first.   Ringo waits atop the hill with Ike and the 3rd Cowboy watching as Wyatt's group rides out:    Ringo and the others ride up.  Hooker steps up with several hands.   What're you doin' here?  It's Holliday.  He's sick.  Imagine He's dyin'.  I looked the other way when you Did a lot of foul things but I Ain't lettin' you torment a dyin' Man.  Not as long as he's under my Roof.  I draw the line there.  I'll be here.",
        "Wyatt": "Forget it.  I said forget it, answer's no, I Don't want the job and that's Final.  I'm going to Tombstone and Nothin' short of dyin's gonn Stop me.  Good day.  No Marshal, you don't understand. I'm through with lawing, I'm Through with the whole Proposition.  Forever.  I did my Duty, now I'd like to get on with My life.  That is if you don't Mind.  Jesus.  Good day now.  Already got a guilty conscience, Might as well have the money too.  Hey!  Virgil!  My God!  Morgan!  Hey, Boy!  You look great!  Both of you!     Mattie, they're here!  Folks this Is Celia Ann but you can call her Mattie.  Or even Mrs.  Earp if you Prefer.  Boy, I sure been dreamin' about This.  God!  Since forever!  Wait!  There, look at that!  God Almighty  Don't talk, just...yeah.  All right, now let's go make our fortune.  Hope so.  Clean up with this boy.  Come up to the fire, honey.  They're just lonely is all.  Hell, I howl myself sometimes.  Look at that.  Busted.  Brand new Money Ward, too.  33 years old And I don't even have a decent Watch.  'Bout time I started Lookin' out for myself.  We're gonna do it, boys.  Gonna Get ours.  Feel it in my bones. All we have to do is keep our Eyes on that brass ring.  Maybe, yeah.  Hell, I don't know.  Got me.  Somethin'.  Nothin'.  I Don't know.  Really?  What about hell?  They got A sign or what?  Well that's your problem.  Hey Virge, see anything of Doc while You were in Prescott?  I miss Doc.  I miss that ol' rip.  He makes me laugh.  Just this minute.  I'm Wyatt Earp, These're my brothers-  Gave all that up.  Going into business.  Guess we'll take all three.  ...and easy on the grain, I don't want 'em too fidgety.  Lotta law around here.  Just met the Sheriff.  Just like any other hard cases. Gotta know how to handle 'em.  What about all these saloons?  Let me have one of those cigars. Kinda nice in here.  You run it?  Well, excuse me for askin', Milt, But isn't it kinda dead in here?  Why don't you get rid of him and Get yourself straight dealer?  Just wanted to let you know You're sitting in my chair.  Yeah.  It's a fact.  Don't need to go heeled to get The bulge on a dub like you.  Yeah.  It's a fact.  Damn right you're scared.  I can See it in your eyes.  Go ahead.  Skin it.  Skin that Smoke wagon and see what happens.  I'm getting tired of your gas. Jerk that pistol and go to work.  I said throw down, boy.  You gonna do something or just Stand there and bleed?  No, I didn't think so.  Here, Milt.  Keepsake, hang it over the Bar.  All right, youngster.  Out You go...  And don't come back.  Ever.  See how easy that was?  Well we're off and running.  Just Acquired us a quarter-interest in The game at the Oriental.  So to speak.  Doc!  How the hell are you?  Didn't you always say gambling's An honest trade?  Depends how you look at it.  I Mean it's not like anybody's Holding a gun to their heads.  Sheriff Behan, Doc Holliday.  Fine, fine.  But I was thinkin', You know what this town really Needs is a race track.  I know him.  That's Creek Johnson.  Jack...  What was that all about?  Not a prayer.  Nice meetin' you.  But who was the Devil?  I'll be damned...  Comin' to the Oriental, Virge?    Honey, I gotta start makin' money.  Well I guess I don't have to go Right now.  I guess I could stay a little while.  No really, I can stay a while.  All right, well, good night.  I'm your man... You win again.  Well played, sir. You are on fire.  Awful lot of money.  You're the doctor. sad news, friend.  So now we're in the mining Business.  Turning into regular Tycoons.  Gonna call this one the Mattie Blaylock.  Mattie'll get a Kick out of that, it's her maiden Name.  Just his style, Morg.  Doesn't Mean anything.  Well yeah.  Pretty much.  I mean I Was no angel when we met but People change Doc.  I mean sooner Or later you gotta grow up.  \"She\"?  I don't know.  Probably ignore her.  I'd ignore her.  People can Change, Doc.  Oh, hell...  Satisfied?  Getting drunk, Doc.  I'm retired.  I heard you the first time.    Curly Bill, huh?  Who was that Other idiot?  Yeah, and dangerous.  Why don't you just leave it alone?  None of my business, Fred.  Maybe I ought to go out there.  Go wake up Virgil. Hey Milt, lend me a sidearm, will you?  Put his clothes out.  He just killed a man.  Well I'm not so go home.  You.  Come here a second.  You die first, get it?  The others Might get me in a rush but before That I'm gonna make your head Into a canoe.  Understand?  Come on, you...  There.  He'll keep till morning  I know, I need a keeper.  ...but he says did I actually see it happen and I said, no, when I arrived Fred'd already been shot. So the judge said, can't have a Murder without a witness-case Dismissed.  Can you beat it?  After All that.  Oh hell, who cares, None of my business anyways.  You tell 'em, Virge.  You know, I was thinkin', maybe We ought to open our own place. That's the real money.  Build it Up, milk it for all it's worth, Then sell it off for a bundle and Breeze out of this burg with more Money than Croesus and ready to Live like kings.  Let's you and me Take a walk around town, Virge, See if we can scout us out a Couple of nice lots.  Pretty fun too, isn't it?  Cat got your tongue?  Wait a minute, Virgil!  Where you goin'?  Virgil, please.  Don't do this to me.  Nothing to do with me?  I'm your Brother for Christ's sake.  God, I Don't believe this. Talk to him, will you?  Or hit him. Oh no, don't tell me...  Listen to me, both of you.  This Is no good.  This is trouble we Don't need.  For the first time in Our lives we got a chance to stop Wandering and finally be a Family.  Do this and you throw it All away.  You saw what happened To Fred White.  Yeah?  All right, say you're right, say You don't get yourself killed. There's something else. It's too late for Virge, he Already rolled his bone.  But it's Not too late for you, Morg.  All the years I worked the Cowtowns, I was only ever mixed Up in one shooting.  Just one.  A Man got killed.  Wasn't my fault, Just doin' my job.  I don't even Know if it was my bullet that Dropped him, but... I don't kno, It's sort of hard to explain.  At First I just felt funny, you Know, kind of clammy inside.  But When it finally sunk in what I'd Done... Believe me, boy, you Don't ever want to feel that way. Not ever. Didn't even make a dent, did I? You're both makin' a big mistake.  This Hooker's ranch?  You seen anything of a man on Horseback leading a black Stallion?  Well you must've seen somethin', The trail runs right by your Waterhole. Oh, I see.  So it must've been a Cowboy, right?  Really got you People treed, don't they?  McMasters, isn't it?  Listen, you Seen a black stallion with-  I'm not a lawman, I'm just a Private citizen getting' my Property back  So what about you Cowboys anyway?  Yeah, but some of the things they Say your brothers've done...  Where'd you get that horse?  I asked where you got him.  Look, I don't want any trouble With you but that's my horse and I mean to have him back.  One way Or another.  Look kid, I know what it's like, I was a kid, too.  Even stole a Horse once.  But you can't--  Make you a deal.  My brother took Over the Marshal's office in Tombstone.  Got it in his head He's gonna make the place safe For widows and orphans.  You and Your boys stay out of his way, I'll make sure he stays out of yours.  They were all gonna jump me back There.  What ever happened to one Against one?  And how come you call yourselves Cowboys?  Cowhands ride for the brand.    Maybe I jumped the gun.  Maybe Those Cowboys aren't near as bad As they're painted.  You know I Was thinkin', there's a lot of Money in the cattle business...  Business is business.  Don't have To love 'em to work with 'em.  Not If there's money in it.  Oh, hell...  We've never actually met.  My Name's-  I know what it means.  Easy now... That mare's in season.  They know.  It's the scent.  We Better split 'em up.  Yeah, I'm an oak all right.  You're not that crazy, are you?  You know you almost got us both Killed back there?  You'd die for fun?  I laugh sometimes  Am I happy?  I don't know.  Happy As the next man, I guess.  I don't Laugh all day long like an idiot, If that's what you mean.  I'm not touchy, I just, it's a Silly question, that's all.  Am I Happy?  Are you happy?  What about her?  Where do you get these questions?  I don't know, make some money, Have some kids, you know.  How would you know?  Well I ought to know my own mind And I'm tellin' you what suits me Is a family and kids.  That suits Me right down to the ground.  In Fact, that's my idea of heaven. All right, what's your idea of heaven?  You mean Behan? Then why are you with him?  The way you talk.  Never heard a Woman talk like that.  Well you're different, no arguing That.  But you're a lady all right. I'll take my oath on it.  I don't know, doesn't make any Sense.  I almost can't look at You.  Like it hurts.  God...  Then let's make sure we get our Money's worth  Fortuitous even.  Easy to fix.  Wyatt Berry Stapp Earp.  Josie... No, I'm gonna call you Sadie.  Well you'll always be Sadie to me.  Getting late.  We better get back.  Look, it's too much of a tangle. I already cast my lot.  I can't go Back and I can't sneak, feel back Enough as it is.  I didn't mean it that way.  I can't, I'm sorry.  Forgive me.   Mattie lies in bed, lost in an opium dream.  She snaps out of it and sits up as Wyatt enters and gives her a kiss, glancing at the half-empty laudanum bottle on the nightstand.   That the bottle Lou gave you? Better go easy on that stuff.  Out ridin'.  So... how you doin'?  Really?  You sure?  Well, I was thinking, we've Already made a pile of money. Maybe we should just pull up Stakes and move on.  And we could Stay on the move, you know?  Just Keep going, see the world.  Live On room service the rest of our Lives.  How'd that be?  Just thinkin' out loud.  Forget it.  I know.  And nobody can make him.  Been hittin' it awful hard, Doc.    Sorry, sorry...  Nice voice.  Virgil, don't!  Take it easy!  Ike, Just go home and forget it, will you?  Get a doctor!  Virgil, give me a hand.  What the hell's going on?  Just stay calm, use your head. It'll be all right.  Just the Same, though... Guess you better swear me in.   In tight on a brass-mounted wooden case.  It opens to reveal a gleaming Colt .45 with an extra long barrel, the gold shield inlaid on the burr walnut grips engraved with, \"To Wyatt Earp, Peacemaker...\"  This is the Buntline Special, Wyatt Earp's legendary sidearm.  Wyatt takes it from the case and puts it in his coat pocket as Mattie looks on.   Yeah, well, I swore a lot of things.  Easy, Virge, they're just tryin' To egg us on.  Don't worry, Doc, it's not your problem. You don't have to mix up in this.  Wait till the liquor wears off. Once they start getting headaches They'll lose interest.  You'll never make that stick.  Virge, that's a misdemeanor.  You Go down there to arrest 'em, Something goes wrong, maybe this Time somebody gets his head Broke, suddenly it's a mess and It won't end there, you'll have Cowboys comin' around lookin' for Trouble from here to Christmas. You gonna risk all that over a Misdemeanor?    Well... Come on, boys.  Virge, you're makin' the arrest. You make contact, I'll back you Up.  Morgan'll back me up, Doc'll Keep an eye out for trouble.  And Keep your hands on your guns. They even look like they're gonna Start something, buffalo 'em. Right over the head.    Oh, great.  Disarmed my ass...  Oh, my God...  This fight's commenced.  Get to Fightin' or get away!  Behind us!  I don't think I'll let you arrest Us today, Behan.  Maybe tomorrow.  Guess we did our good deed for today.  I'm sorry.  If there was any other-  How you doin', boy?  I know, kid.  I know.  Me too.   Mattie irons shirts in the adjoining bedroom while Wyatt finishes shaving in the dressing room, wiping foam from his face, looking in the cabinet for a towel.  Opening the bottom drawer, a nest of small brown bottles clatters onto the floor. Laudanum bottles, all empty.  Mattie looks up as Wyatt comes out, bottle in hand:   Mattie.  What about this?  'Least you admit it.  Look, Mattie, I know you're-  All right, look.  I can make it Right, I can make this up to you, Mattie.  I can, I swear.  I'm the one made a mess.  Made a Right fair mess of the whole thing.  All they ever did was make fun of him.  Don't want any more trouble, Ringo.  I'm not gonna fight you, there's No money in it.  Sober up.  Come On, boys.  Bundle up, Virge.  Cold out there.  That didn't sound like thunder.  Virgil?  It's all my fault.  If I hadn't been So damn smart, if I'd just... Oh God, Virge, I'm so sorry.  Virgil, what am I going to do?  No?  Brothers to the bone, right?  Morgan, are you crazy?  They're Out gunning for us!  What the Hell're you doin'?  Morg, use your head.  I know, I was wrong.  But Morg, Look, we got to get out.  I just got it fixed.  No, no!  Get the doctor!  Jesus Christ!  Oh, no, get her out of her!  Jesus!  Somebody shut that dog up!  Will somebody get the damn dog out-  Easy Morg, don't think about that now.  Morgan?  Morgan!  No, no, get away, get away from me...  Whore!  Filthy whore!  Get away From me!  I want you to know it's over. We're leaving and we're not Coming back.  Carthage, really?  I'm from Monmouth.  If the Lord is my friend.  Know why you're here?  They're nothing.  They're nobody. I want the Cowboys.  All of 'em.  I Mean to break 'em up, drive 'em Out of the territory.    Got a sheaf of federal warrants. Being in the Territories it's up To our discretion how they're Served.  That means we got the Cowboys without quarter.  The Black flag, brother.  No Prisoners, no mercy, amen.  The minute we start we'll be Going against local and county Law.  If we fail the U.S. Government won't be able to lift A finger to help us.  Nevertheless I want you to understand we carry The full force and authority of The law of this land.  Raise your right hands.  Do you Solemnly swear to uphold the laws And constitution of the United States of America and to protect her citizens to the best of your Ability, even at the cost of your Own life?  All right, let's wring 'em out!  United States Marshals!  Reach!  One more word and I'll blind you. Get over there!  All right, run 'em off.  All right, breed.  Dig in.    Drop his horse.  A human life.  Twelve dollars.  Look at him.  That's how you'll All end up if you don't get it Through your head: it's over, The Cowboys're finished.  Forever. So tell the others and get out of The Territory 'cause next time I Leave no one alive.  Understand? No one.  You been warned. All right, burn it!  Everything!  Leave that trash where it lays.  I know that cut.  You mean there's A waterhole near there?  We'll see about that.  Wait... wait... steady...  Now!  Lay on!  Come on!  So he can tell the story.   Doc sits by the fire, shaking and shivering and sweating. Vermillion comes up and tries to cover him with a blanket, but:   There's no reasoning with him.  They're wise by now.  Which is Next, Iron Springs?  Yeah, let's Try there, Iron Springs.  We'll go around that way, come up on foot.  No.  No.  No...  No...  No...  No!  No!  No...  No...  I don't know.  It all happened so Fast.  If I'd had a chance to Think about it I guess I probably Would've been scared but... Swear To God, Doc, I just don't know.  Sure...  Mounts're getting jaded.  We're Gonna have to find a place to Rest 'em up.  Doc...  Grab him.  Horse're pretty well fagged and We got a sick man with us.  Sorry about your friend. And I'm sorry about...  You did.  Well... thank you.  Wait!  Goodbye.  Damn... Damn!  See how she breezed out of here. Like she had wings.  Funny thing But I can't really remember how She looked.  I can remember parts Of her clear as crystal, her Mouth, her walk, how she shut her Eyes when she laughed, little Bits and pieces, but not the Whole package.  Can't put it Together for some reason.  Cards in spades.  I'm in love with Every second of her life.  Hell, I'll probably love her when I'm dust.  We should get moving.  I don't like it.  You tell Ringo... just tell him I'll be there.  I made a promise.  But I'd do it, I'd get that one Into him.  So help me God, I would.  What makes a man like Ringo, Doc? What makes him do the things he does?  So what does he want?  Revenge?  For what?  Remember how I said it all Happened so fast with Curly Bill I didn't have time to think about it? Well I've had plenty of time To think about this.  I spent most Of my life since I was born not Knowing what I want out of life, Just chasin' my tail.  But now, For the first time I know exactly What I want.  And who.  And that's The damnable misery of it. I can't beat him, can I?  That's all right, Doc.  Don't worry.  They're not givin' you any safe Conduct.  Soon as the shooting Starts kick east for the New Mexico line.  Well...  I know.  Me neither.  Dear God, this is the last Battle.  I worked it out in my Head every which way and I know There's no way I'm comin' through This alive.  You've preserved me This far so I only ask one more Favor: just let me live long Enough to kill that man.  Thy will Be done and there's an amen to it.  What happened?  All right, what's it to be?  New Mexico's that way.  So're the Cowboys.  They're up That road right now, waiting to Jump us.  How you feelin', Doc?    All right, Doc...  All I ever wanted was to live a Normal life.  That's great coming from you.  Then what do I do?  All right.  Then what?  Did you ever see the sun come up Over the Rockies?  It hits all of A sudden and below there's California and you swear you're Looking at heaven.  I have nothing left.  I have Nothing to give you.  I have no Pride, no dignity, no money.  I Don't even know how we'll make a Living.  But I promise I'll love You every second of your life.  There.  It'll come up over that ridge.  Get ready, here it comes!  Here it comes!",
        "Behan": "Newcomers, eh?  Names John Behan, I'm Cochise County Sheriff.  Just Hit town?  Wyatt Earp...Dodge City, right?  Well I'm the man to see.  Besides Sheriff I'm also tax collector, Captain of the Fire Brigade, and Chairman of the Non-partisan Anti- Chinese league.  A man of many Parts.  Got a place to stay yet?  I Also sit on the Townlot Commission.  Got a couple of Lovely cottages coming up for Rent.  Here, let me show you...  The one next door and the one Across the street are vacant too. Same rent and I'll throw in a Good cleaning.  Believe me, you Won't find a better deal within Town limits.  So how's Tombstone treating you?  Actually, you know, that's not a Bad idea, send a signal we're Growing up.  See how everyone dresses?  Awfully Toney for a mining camp.  No, the Die's cast, we're growing, be as Big as San Francisco in a few Years.  And just as sophisticated.  That must be the theatrical Troupe.  There's a show tonight at Schieffelin Hall.  That's Wyatt Earp.  Made quite a Name for himself as a peace Officer in Kansas.  Yes, very.  And very married.  Have you been out in the street? Somebody's got to do something.  It's not County business, it's a Town matter.  Well I guess you can see, never a Dull moment.  Maybe you should Stay around to see what happens Next.  Who know?  You might find a Future here.  What d'you think of the singer?  That's not what I meant.  I saw that look on your face just now. What's between you and Wyatt?  I'm terribly afraid this looks Like the end of the Earp brothers.  They're on their way over here.  You don't have to worry about a Thing.  I just went down there and Disarmed them.  Come on!  All right.  You're all under Arrest.  Listen, I want to talk to you.    You whore!  You filthy whore!  Look, I don't want to take Advantage of an injured man but You better-  Easy.  I just wanted to tell you Things're about to start changing Around here.  Lots of so-called Hard cases and tough-nuts swagger Around this town but none of 'em's got a clue about the real play.  None of 'em.  You will after tonight.  Bet on it.  Are you crazy?  It's front page News all over the country.  It's Getting out of hand, Ringo.  If Things don't settle down soon-  Ringo, you don't understand-  What're you doing here, Billy?  Robbery.  2 men stuck 'em up and Killed a passenger.  One of 'em Rode a Mexican saddle, the other Had a Mother Hubbard.  Billy Grounds and Zwing Hunt.  Where're you going?  Get back here!  It's too much!  It's completely Out of hand!  Governor Gosper's Talking about asking the President to send in the Army! Listen Ringo, you've got to get This over with and you've got to Do it now.  One way or another.  Aren't we giving them safe conduct?  Well I guess Ringo did it.  What?  Oh, no...  Me too!",
        "Doc": "500? Sly boots, must be a peach of a hand.  Bless you, darling Darling!  Are you mad?  You're not Wearing a bustle.  How lewd!  Ed Bailey, you look like you're Just ready to burst.  Well call me A fool but I guess I'll just have To call.  Cover your ears, darling.  Isn't that a daisy?  Now Ed, are we cross?  Why Ed, what an ugly thing to Say!  Does this mean you're not my Friend anymore?  You know, Ed, if I thought you weren't my friend I Don't think I could bear it.  There, now we can be friends Again.  But remember, Ed, Friendship is trust-so please Don't hurt me.  Does it hurt?  A lot?  Good.  Well, good evening then.  I calculate that's the end of This town.  And let's don't bother About the luggage, darling.  My sweet clever Magyar, so that's Why you're not wearing a bustle.  Perfect, Wyatt.  Simply perfect.  Since when is faro a business?  I said poker's an honest trade. Only suckers buck the tiger.  The Odds are all with the house.  That's what I love about Wyatt. He can talk himself into anything.  Oh sorry, Johnny, I forgot all About you.  You can go now.  Just Leave the shotgun.  Forgive me if I don't shake hands.  Little ahead of yourselves, Aren't you?  This is just a mining Camp.  I can hardly wait.      Well, an enchanted moment  Kate, you know the Earps.  Very instructive  You may indeed.  If you get lucky.  And what a maiden, pure as the Driven snow, I'm sure.  So tell me, Wyatt.  I'm curious. Do you actually consider youself A married man?  Forsaking all Others?  I see.  And what would you do if \"she\" walked in her right now?  You know damn well who I mean. That dusky-hued lady Satan.  Ignore her?  I'll remember you said that.  I stand corrected.  Wyatt.  You're An oak.    Well he hems, he haws, he talks Out of both sides of his Mouth-but all on a very high Plane, just like Hamlet.  That's the rumor.  Not me.  I'm in my prime.  And you must be Ringo.  Look, Darling, Johnny Ringo.  The Deadliest pistoleer since Wild Bill, they say.  What do you Think, darling?  Should I hate him?  Yes, but there's just something About him.  Something around The eyes, I don't know, reminds me Of... me.  No.  I'm sure of it, I Hate him.  In vino veritas.  Credat Judaeus Apella.    Evidently Mr. Ringo's an educated Man.  Now I really hate him.  Enough?  Never.  What?  I see, well this happens to be a Nocturne.  You know, Frederic-fucking-Chopin.  You will or you won't.  Don't look To me.  I'm going to sleep.  I have two guns.  One for each of you.  Wyatt!  Just in time.  Pull up a chair.  Nonsense, I have not yet begun to Defile myself.  I won't be pawed at, thank you Very much  Why, Ike, whatever do you mean?  Maybe poker's not your game, Ike. I know, let's have a spelling Contest!  Well that certainly was a bust.  I Want my money back.  Come, Darling, let's seek our Entertainment elsewhere.  Nothing.  Not a thing.  I'm right As the mail.   Later.  Doc sits up in bed, revived but looking like death warmed over, mouth gaping open, eyes swimming with every breath.  DR. GOODFELLOW stands by the bed, putting on his jacket.   So what does that mean?  Well, that sounds inviting.  Better.  We must talk, darling.  It appears We have to... redefine the nature Of our association.  Not exactly...  Yes, I know.  You are a good woman.  Then again, you may be the Antichrist.  What the hell's going on?  I've Had five people walk up to me Saying the Clantons and McLaurys Are gunning for me.  That's a hell of a thing for you To say to me.  You're a daisy if you do!  You call that shooting?  That's just my game.  On three?  You call it.  Can't you see why he did it?  And so she walked out of our Lives forever.  Oh... All right.  You know why I'm here.  My Hypocrisy only goes so far.  Say something witty.  It appears he missed an excellent Chance to keep his mouth shut.  They saw us.  Here they come.  Don't touch me!  Not half as bad as I feel.  Wyatt Earp is my friend.    Look!  Wyatt!  Come on!  Wyatt, my God!  You're shot to pieces!    I'm telling you, there isn't a Mark on him.  I'm a man without fear, Wyatt.  I Literally don't care if I live or Die.  But even I can't fight human Instinct.  Somebody suddenly Starts shooting at me, I duck. But you... what on earth were You thinking about?  Down at the creek.  Walking on water.  Don't touch me, God damn it!  Just Don't touch me!  Come on...  A man like Ringo's got a great Empty hole right through the Middle of him and no matter what He does he can't ever fill it.  He Can't kill enough or steal enough Or inflict enough pain to ever Fill it.  And it drives him mad. Sick mad.  Cold and dirty.  What does he want?  He wants revenge.  Being born.  No, wait, I'll go with you...  I'm sorry.  I'm sorry, Wyatt.  God, I'm so sorry.  Never got to wear one of those.  Why Johnny Ringo, you look like Somebody just walked over your grave. Oh, I wasn't quite as sick as I Made out.  I beg to differ.  We started a Fight we never got to finish. Play for blood, remember?  I wasn't. And this time it's legal.  Say when.  Come on!  Come on!  Oh Johnny.  You're no daisy, no Daisy at all.  Poor soul, he was so high-strung. Afraid the strain was more than He could bear.  Let's go!  My horse is over here.  I just wanted to see what it felt Like.  Here...  Well hell, Wyatt.  Wyatt, I want You to meet Father Feeney.  Father Feeney's just been initiating me Into the mysteries of the great And ancient Church of Rome.  You See, it appears my hypocrisy Knows no bounds.  Rather an obvious question under The circumstances, don't you Agree?  A better one might be how Do you feel?  I imagine it would, yes.  So now We can add self-pity to your list Of frailties.  You think I'm kidding.  You're the Most fallible, wrong-headed, self- Deluding, just generally Benighted jackass I've ever Known.  Yet, withal, even at your Worst, you're the only human Being in my entire life who ever Gave me hope.  When will you wake up?  You Wouldn't know a normal life if it Bit you in the ass.  I played the cards I was dealt, Wyatt.  Your problem is you're Always trying to play someone Else's.  Allow me to tell you the Truth and thus set you free: There is no happiness, Wyatt There is no normal life.  There's Only life, that's all.  Just life. The rest is relative.  First you can grab that black- Haired woman and make her your own.  Run.  Take that girl and start Running.  Run and don't look back. All your life you been running And looking back and just barely Existing and calling it getting By.  This time run and don't look Back and call it living.  Live Every second, live it right up to The hilt.  Live, Wyatt... Live for me.  Wyatt, please, if you were ever My friend, if you ever had even The smallest feeling for me, Leave.  Leave now.  Please.  Never mind, Wyatt.  I know.  Just go.  Now let's see, Father.  What was That monkey show you were talking about?  That's it.  Better start that ball rolling.  I'll be damned... This is funny.",
        "Holliday": "",
        "Ike": "Listen, Mr. Kansas Law-dog.  Law Don't go around her.  Savvy?  Yeah, that's good, Mr. Law-dog, 'cause law don't go around here.  Turn loose of him.  Swear to God, Mister, step aside Or we'll tear you apart.  Hey, law-dog.  The hell you doin' here?  Don't sweet-talk him, make a move.  Come on, Curly!  Don't let him-  Your outfit?  I'm next in line.  Son of a bitch!  That's twelve Straight hands!  Nobody's that lucky.    You takin' his part?  I'm the one Was cheated. God damn pimps, You're all in it together.  Get your God damn hands off me! Don't you ever put your hands on One of us!  Don't you ever try to Man-handle a Cowboy!  We'll out Your God damn pimp's heart out! Understand, pimp?  I ain't forgettin' nothin.  What's wrong with him?  Bastards think they can cheat me?  And I don't take no mouth from Any bartenders neither.  There, See?  Give somebody a rap on the beezer, get some God damn respect Around here.  Now you tell the Earps and Doc Holliday if I see 'em on the street, I'm gonna send 'em all to hell on a shutter.  You tell 'em that.  I want to send a telegram.    No, no, please!  I don't have a gun!  Get ready.  Soon as Ringo's done We're gonna take care of the others.  Sure we are.  All the way to hell.  All right, get ready...  Kill 'em!  Kill 'em!  It's only Four men!  Why don't you kill 'em?",
        "Josephine": "Interesting little scene.  I Wonder who that tall man was.  Oh, I want one.  The man dealing faro.  Who is he?  A peace officer... Impressive man  Oh, so that's it...  Maybe even my destiny.  Well, hello.  Wyatt Earp, I know.  I was Beginning to think we'd never Meet.  This is fortuitous.  That Means lucky.  What is it?  Oh... Now she's starting.  How do they know?  I have a better idea, let's run It out of them!  That was lovely!  Fun though, wasn't it?  Wouldn't you?  You're laughing!  I Was sure you never laughed.  Yes, but how often?  Tell me, are You happy?  You're a little touchy about it.  Of course, I'm always happy. Unless I'm bored.  That blonde Woman, is that your wife?  Nothing... Tell me, what do you Want out of life?  Just answer.  Doesn't suit you.  Just doesn't, that's all.  Room service.  See?  You're laughing again.  But That's what I want.  Go places and Move and never look back and just Have fun.  Forever.  That's my idea Of heaven.  Need someone to share It with, though.  Well he's handsome and he's Charming.  He's all right.  For Now.  Don't say it, I know, I'm Rotten.  I can't help it.  I've Tried to be good but it's too Boring.  Oh look, I haven't got time to be Proper, I want to live.  I'm a woman, I like men.  If that's Unladylike then I guess I'm not a Lady.  At least I'm honest.  What's wrong?  I know, me too.  What should we do About it?  You know this is adultery.  You Burn in hell for that.  I must say this certainly has Been an unexpected little Windfall.  And I don't even know your full name.  And I'm Josephine Sarah Marcus. My friends call me Josie.  I hate Sadie.  Always?  So I assume we're regarding this As just a kind of interlude.  You feel bad about this?  About me?  You know you don't have to sneak. You could stay with me.  I know Things, Wyatt.  Sweet things.  I Could make you so happy.  I want to remember exactly how I Looked on this day so I want you To take a picture of me...  ...all of me.  Because I'm wonderful.  Absolutely nothing.  Not now.  I don't have time.  My man?  You told Wyatt you'd Disarmed those men.  Do you Actually believe after that I Could see you as my man?  You're Just a dirty little fixer.   Josephine sits by the window, reading Swinburne.  A KNOCK at the door.  She answers it.  Behan enters.  She bristles, but:   I don't understand.  Please, I know it's awful me Coming here, but listen, I can't Say why, but I think something is-  No!  Look out!  Wyatt...  We're headed for a booking in Denver.  They tried to take my Watch.  He cursed them for cowards And they shot him.  He may've been Vain and an actor but he was Better than all of you.  And Gentler and braver.  I don't Understand any of this, I only Know it's ugly.  You're all ugly And he was beautiful, he tried to Put something fine into your ugly World and you killed him for it. Anyway the ones who did it are headed north.  Not that you care.  I forgave you the moment you said it.  I have to go.  I know, it's-  Wyatt!  My God...  Don't worry, Wyatt.  My family's rich.",
        "Marcus": "",
        "Louisa": "Don't you love their hair?  They All have the same hair.  Mattie hon', did you say you Needed some laudanum?  I have a Bottle right here.  Just be Careful.  It's full of hop.  Stop...  It looks like a woman.",
        "Virgil": "Wyatt, you remember Allie  But she doted on the frowner  Mrs. Earp?  Land O' love, it finally happened!  Mattie it's a Pleasure!  Look at him go, will ya?  I tell You, that's the real Wyatt, born In the saddle.  Try to be a lady, will you?  Mighty fine.  Wonder where he Found her.  Same place we found Ours probably  Well here we are a family again. Been so long plain forgot how Good it feels.  Want to thank you For that, Wyatt.  All your doin'.  Oh, God, here he goes...  Hit a streak when we left.  Him And Kate.  I don't  The Cowboys, yeah.  I heard of 'em.  Look pretty rough.  Doesn't anybody raise a stink? The hell kinda town is this?  Acquired?  What kinda town is this?  Her maiden name was Sullivan.  All right, look out!  Break it up. Go home, all of you, go home now...  Keep your eye on that brass ring. Don't let anything side-track you.  Come on Mayor, he already told You no.  I'm busy.  We're all busy.  Sorry, Mayor, but you're really barkin' Up the wrong tree.  I can't hardly believe it.  It's Working out just like you said, Wyatt.  We're lootin' this burg Six ways through Sunday.  Kinda, actually, yeah.  I gotta admit.  What're you up to today, son?   In tight on a gleaming silver shield, \"Town Marshal, Tombstone, A.T.\"  PULL BACK to reveal it pinned to Virgil's breast.  He sits by his parlor hearth with Morgan at his side. Wyatt sits opposite with his head in his hands.   I couldn't help it, Wyatt.  I Looked at that woman and it was Just like somebody slapping me in The face.  I mean these people're Afraid to even walk down the Street and I'm trying to make Money off it like some kind of God damn vulture.  That's not me, That's somebody I don't even know.  It's got nothin' to do with you, Wyatt.  It's-  Nothin' to it.  Wait a minute, you thinkin' of Getting in bed with the Cowboys?  You are the one, Wyatt.  You sure are.  Come on, boys, take it easy.    Nobody's in anything, Clanton, You're drunk.  Go home and sleep It off.  Don't you threaten me, you Little-  Billy Clanton, Wes Fuller, and Billy Claiborne.  Now there's six Of 'em.  This is like a bad dream.  Here they are again.  Look at 'em.  What the hell're we gonna do?  Wyatt, they're threatening our lives.  They're carrying guns in town.    Wyatt, I know what I'm doin'.  You did?  Great, thanks.  Come on, boys.  We've come to arrest you.  Throw Up your arms!  Hold!  I don't want that!  Getting warmer.  Guess spring's comin'.  What d'you want, Ringo?  Gonna be one of those nights.   Allie and Louisa sip tea by a blazing fire in the hearth, warming themselves against the storm's cold.  Mattie sits nearby, sewing.   Getting late.  Guess I'll turn in.  Wyatt...  Wyatt!  No, no, don't worry, honey.  I Still got one arm left to hug you with.  For God's sake, just leave me alone.",
        "Allie": "Good God, well he better.  Can he then?    Neither do I.  This is so much fun!  We haven't Been to a show since years.  Not tonight! Tonight me and my Old man're gonna have some fun. Get moving, old man!  God, it's a cold night.  Come up To the fire, Mattie.  Now who in... It's another woman.  Oh, no, no, no, NO!  Look, Wyatt, I don't want to talk Right now.  He doesn't want to talk now.",
        "Morgan": "Well how do we look?  Give him some good exercise?  Sure Some stud.  Some string in fact. What're you gonna do, race 'em?  Come up, Lou.  Come up here, girl.    Well what do you think happens When you die?  I read this book, book on Spiritualism...  ...said a lot of people, when they're dyin', they see this light, like in a tunnel.  They say it's the light leading you to heaven.  Hey, Wyatt, God damn it, I'm serious!  Wyatt, meet Fred White, he's town marshal.  Going into business for Ourselves.  Wyatt just got us a Faro game.  It's that woman from the coach!  Hey Doc!  Come on now.  Now that wounds me.  Little tin Swain walkin' off with that black Beauty.  I mean I'm a married man And all but still, it ain't right.  Boy, I love this game.  When we're Finally set we gotta each have a Billiard room in our houses.  Like you said, Wyatt.  We're Brothers.  Gotta back your Brother's play.  Just did like I Figured you would.  Come on, we're not about pickin' Fights.  Just gonna keep a little Order, that's all.  Like you said, just gotta know How to handle 'em.  Old Fred Wasn't up to it.  We know that We're doin', Wyatt.  What're you talkin' about?  Doc won't quit, been up 36 hours. Clanton came in an hour ago, they Switched over to poker.  Tried to Get him to bed but he just won't Let go.  What're you doin' out of bed, Doc?  I'm hit.   Morgan lies in bed, his shoulder in bandages.  Wyatt sits by him   Fine.  Better.  You were right.  It's nothin' like I thought.  I almost wish...  You don't talk that way to a Female human being!  Not ever!  Dropped him, that was it.  Sorry If I made a worse mess for you.  Hello, Billy.  I say hello, Deputy.  That thunder's sure somethin'.  Get down, boy.  What's it look like?  They want a Piece of me they can come and get It, I'm not crawlin' into my hole.  I am usin' it, Wyatt.  Been Wonderin' how the hell we got in This tangle.  You know they hit Clum's house, too?  Shot up his wife. His wife.  Who ever heard of That?  Men sneakin' around in the Dark, back-shootin', scarin' Women?  They're bugs, Wyatt.  You Know all your smart talk about Live and let live?  Ain't no live And let live with bugs.  Listen to yourself, Wyatt.  Lie Down and crawl or you might get Hurt?  What kinda talk is that? That's Virgil lyin' over there, Wyatt.  Our own brother.  Ruined For life.  No sir, I ain't going No place.  You want to go, fine. I'm stayin' right here and have It out with those bastards.  How much you wanna bet?  You're on.  You were right, Wyatt.  They got Me good.  Don't let 'em get you Too.  Remember about the light you're Supposed to see when you're dyin'?  Isn't true.  I can't see a damn thing."
    },
    "imdb_rating": "7.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BODRkYzA4MGItODE2MC00ZjkwLWI2NDEtYzU1NzFiZGU1YzA0XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "After success cleaning up Dodge City, Wyatt Earp moves to Tombstone, Arizona, and wishes to get rich in obscurity. He meets his brothers there, as well as his old friend Doc Holliday. A band of outlaws that call themselves The Cowboys are causing problems in the region with various acts of random violence, and inevitably come into confrontation with Holliday and the Earps, which leads to a shoot-out at the O.K. Corral.—Ed Sutton <esutton@mindspring.com>",
    "name": "Tombstone",
    "genres": [
        "Biography",
        "Drama",
        "History"
    ]
}