{
    "filename": "Total-Recall_script.txt",
    "imdb_id": "tt0100802",
    "imdb_url": "https://www.imdb.com/title/tt0100802",
    "characters": [
        "Benny",
        "Melina",
        "George /Kuato",
        "Dr. Lull",
        "Bartender",
        "Tiffany",
        "Richter",
        "Dr. Edgemar",
        "Ernie",
        "Lori",
        "McClane",
        "Tony",
        "Cohaagen",
        "Quaid",
        "Helm"
    ],
    "dialogues": {
        "Benny": "",
        "Melina": "Last Chance Air Station  You bastard!        All right, I'll say it for you.    Oh, the usual one.  \"Must return immediately to Earth... the wife needs me...\"  What are you here for?!  \"Whoever you were\"???  [And I thought...]  (ignoring the  I'm not trusting you again.  That you was a liar.  Who you are now I don't even know.      Yes, Mr. Quail, I'm afraid it's all true.    Please, Mr. Quail... try to cooperate.  You're having a schizophrenic embolism.  Watch out, Charles!  There's more of them in the hall!    They kidnapped me.  Said they'd kill you if I didn't cooperate.  I told them I didn't care, but then when I realized they meant it...  We were together before.  Go, Bennie, for God's sake!  What?  You better have two aces, Bennie. There's a second cruiser -- and it's gaining --  No.  But we still believe in a free Mars.  You - when you were Charles Hauser with E.I.O - infiltrated our group.  I guess Cohaagen didn't trust you any more when you and  ...so he had your memory wiped and fixed you up with a new identity.  I don't know.    A bit of Martian Wisdom. We're not all stupid colonists.  He's doing it!  Clearing everyone out!  It's been rumored for months...  I though you believed in our cause?  Ssssh...there are skills on mars that Earth has forgotten.  This is for our cause!  That's interplanetary robbery!      Are you okay?... Charles? Doug?  Whoever?  But why?  The Oracle... what did you learn?  What are we doing, Charles? For God's sake, tell us.        And Cohaagen's going to own it all!  No wonder he wanted you to... penetrate... out group.  So what can we do?  But who'll work the machine? Do you know how?  But Cohaagen wiped your memory!!!    You bastard.  But what about the Martian people?  Out cause?  I thought you believed in it.  We got in with this thing, but we'll never get back out.  Remind me not to slip.    Great stuff, but how do we get up?  Those shuttles are starting up any minute.  If you know how to work this thing, you better do it now.  Don't you know how?  Don't wait!  (looking toward  It's happening.",
        "George": "",
        "/Kuato": "",
        "Dr.": "",
        "Lull": "It the Pope Martian?  Now, just relax, kid.  This ain't gonna hurt.  Just a controlled drip of Narkadine. When you're under, I'll just ask ya a few questions, nothin' real personal, just full details of yer private life so's we can tailor the wish-fulfillment program to your needs.    (continuing;    Okay -- you will, Dougle!  I want ya to start counting backwards from a hundred for me.  Okay, Ernie, the trip to Mars; number sixty-two... and throw in that blonde... We'll give him a real good time.  Dougie?  This Sophie Lull. Can ya hear me?  Good! ... I'm gonna ask ya a few more questions now.  Ya think you'll be able to answer 'em?  Attaboy!  To begin with, I wanna ask ya; -- You sex life.  How many orgasms a week? Yes?  (filtered; (not too    (bends over  Tell McClane what you told us.  The Narkadine cracked a memory cap.  Mars -- He's really been there. Forced suppression?     (shaking her   Why don't we just wipe out the memory of his visit here? Yes.  Good.  I'll destroy his file and cancel his fee. I have a feeling that the longer he doesn't know who he is, where he's been, where he's going and who we are, the better off we'll all be.  I'm taking a holiday. A real one.",
        "Bartender": "You've found her.",
        "Tiffany": "",
        "Richter": "",
        "Edgemar": "Hello, Mr. Quail.  May I come in?  I won't be offended if you prefer to keep the gun you're holding trained on me.  My card, Mr. Quail.  As I said... this is going to be very difficult -- for both of us.  Mr. Quail... I'm afraid you're not really standing here at this moment.  I said, you're not really here.  Neither am I.  We're both in the Memory Studio -- in the offices of Rekall, Inc. On Earth.  No, not quite.  We didn't give you this.  You're creating it yourself -- Remember the option we offered you?  Intelligence agent? Something inside you liked that idea, fastened on it. What you're experiencing now is a free-form delusion that you yourself are fabricating.  This is not -- shit, Mr. Quail. It's the truth. I know it's very hard for you to accept, but you're having a schizophrenic reaction... we can't snap you out of the Narkadine.  You're in a world of your own fantasy.  I've been artificially implanted -- like the first part of your fantasy.  I'm actually monitoring your dream at a psychoprobe console. This is a last resort.  When somebody gets stuck in their own fantasy, we send in someone after them.  A specialist, like myself.  I was afraid you'd think that. I'm sorry to have to do this, but you really are stuck. Doctor Noel, would you come in now please?  Just do exactly as we tell you.  If we can't get you out now... you may never come out of it. Your wife calls every day --    But there will by consequences inside your mind.  Consequences that won't hurt me... but could be fatal to you. If you shoot me, you'll wipe me out of your fantasy -- I can't come back again.  Because to you, I'll be dead.  I can't help you get back to reality. You'll be stuck in permanent psychosis.     You're going to lower the gun, Mr. Quail.  You're going to hand it to me --    You're going to do exactly what I tell you --",
        "Ernie": "Sixty-two... and... the blonde...  Boy, is this one wild.  He won't want to come back.  With spontaneous breakthrough. Holy shit.  What do we do?  Graft a false memory pattern over the real memory of the same thing?",
        "Lori": "",
        "McClane": "",
        "Tony": "",
        "Cohaagen": "We're dealing with a bunch of extremists and unrepresentative lunatics.  Mars is a happy and prosperous protectorate of Earth... and will remain so.  I have no further comment.    There must be something -- some place he would go, some friend he would run to.  Again?!        What do you think I am?  A barbarian?  We're not living in the twentieth century!    I take it, then, you've failed to get him again.    With him... ...on the lose, I'm not taking any more chances. Operation Sphinx will flush him out.  The air supply is off under the domes?  Any trouble with the rabble?  How the hell did they get in?  Up the fusion core??  Seal all upper levels.  Forget them.  We'll pick up Quail once the shuttles have left for Earth.  We'll tell him the computer's worked out the operational details so we don't really need him.  We're just doing him a favor.  We offer him rewards.  We'll torture him.  You don't think I got this far by being a nice guy?  Seal the breach!  Repressurize!  Wait!  If you activate the mechanism you'll die...there were glimpses of it in your memory.    It's not too late.  Join us again.  U've a lot to offer. A whole world.",
        "Quaid": "",
        "Helm": ""
    },
    "imdb_rating": "7.5",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYzU1YmJjMGEtMjY4Yy00MTFlLWE3NTUtNzI3YjkwZTMxZjZmXkEyXkFqcGdeQXVyNDc2NjEyMw@@._V1_QL75_UX380_CR0,1,380,562_.jpg",
    "description": "Douglas Quaid is haunted by a recurring dream about a journey to Mars. He hopes to find out more about this dream and buys a holiday at Rekall Inc. where they sell implanted memories. But something goes wrong with the memory implantation and he remembers being a secret agent fighting against the evil Mars administrator Cohaagen. Now the story really begins and it's a rollercoaster ride until the massive end of the movie.—Harald Mayr <marvin@bike.augusta.de>",
    "name": "Total Recall",
    "genres": [
        "Action",
        "Adventure",
        "Sci-Fi"
    ]
}