{
    "filename": "True-Lies_script.txt",
    "imdb_id": "tt0111503",
    "imdb_url": "https://www.imdb.com/title/tt0111503",
    "characters": [
        "Juno Skinner",
        "Albert Gibson",
        "Helen Tasker",
        "Simon",
        "Faisil",
        "Dana Tasker",
        "Allison",
        "Salim Abu Aziz",
        "Boathouse Guard (as Deiter Rauter)",
        "Colonel",
        "Spencer Trilby",
        "Jamal Khaled",
        "Harry Tasker",
        "Janice",
        "Charlene"
    ],
    "dialogues": {
        "Juno": "Very good.  It's sixth century B.C.  Do you like the period?  Well.  And I thought this was going to be just another bunch of boring bankers and oil billionaires.  Call me, if you'd like to see some of my other pieces.    Harry!  I thought I might see you again.  I just didn't  except you to call so soon.  I agree.  So your clients want something for the lobby of their new corporate headquarters?  So what did these... people... say about me exactly?  Those wimps.  It's because I use                       * my diplomatic contacts to export cultural treasures from countries which tell them to take a hike. I told you to move those crates an hour ago.  Come on guys, let's get going.  You see, a lot of these pieces are from ancient Persia. Unfortunately, ancient Persia is twenty feet under the sand of                          * Iran, Iraq and Syria.  Not the most popular places lately.  So I've had to become an expert in international diplomacy.  Well, do you see anything you like, Mr. Renquist?       It's a good thing you pay me well.  No.  He checked out okay--  What do you want me to do?  How?      Hello, Harry.  Do you like my tomb?  The museum                       * financing fell out, so I thought                       * your clients might be interested.  Especially in this light.  This is the only light they had then,                       * so I like to study it this way. I love this place.  I love all ruins.  I've always been a collector at heart.  When I see something I want, I have to have it.  Yes, I do.  Look at this.  People who dies twenty centuries ago.  They breathed and loved and wept, just like us.  And now their ideals, their religions, their social orders... are gone like mist.  What did any of it matter?  I only hope they lived well. That they got what they wanted.  Getting what you want is the only important thing.  Yes what?    Who's your little friend?    No, my dear, he is a federal agent.  He killed two of my colleagues the other night.  Something before take-off?  She was telling the truth, wasn't she Harry?  She really doesn't know.  Interesting.  His wife.  Incredible, aren't they?  Warrior figures from the Persian Empire of Darius the First, around 500 BC.  I call them \"The Four Horsemen\".  They're absolutely priceless.  Here you go, dear.  This is Samir.  See if you can guess his specialty.  Not exactly.  Samir is just going to ask Harry a few questions.  See, we're not even sure which agency Harry works for.  Now, Samir is absolutely first class, but on the other hand we have Harry, here, who has managed to lie convincingly to the woman he loves for 15 years.  So it will be interesting to see how long he can resist.  Because they're very well-funded raving psychotics, and I'm getting a lot of money.  You think I care about their                           * cause?  Or yours?  Not at all.                         * See, America is on top now .  .                        * .  but so was Rome, once.  All                         * civilizations crumble.  One nation succeeding over another. What does it mean in the long run?  The only important thing is to live well.  And...  living                          * well takes money.                                      *    Sure.  Say that now.  Thanks for everything, Harry.  It was good while it lasted.  Now just keep your knees together, and you'll be fine.  Hold that thought.  My condolences to the window.                          *  Let's go, Suzy Homemaker.  Like one?  Shit!",
        "Skinner": "",
        "Albert": "",
        "Gibson": "",
        "Helen": "Okay.  Me too.  How'd it go at the trade show? You make all the other salesmen jealous?    The plumber came yesterday.  He said they have to dig under the slab or something and it's going to be six hundred dollars to fix.  It's not okay.  It's extortion.  I slept with him and he knocked off a hundred bucks.  I mean, it's not like he's saving the world or anything.  He's a sales rep for Chrissakes. Whenever I can't get to sleep I ask him to tell me about his day. Six seconds and I'm out.  But he acts like he's curing cancer or something.  Are you kidding?  Harry had to go out of town.  Yeah.  You know Harry.  I won't let you down, Brad.  * *  You bitch.  Harry only has two moods: busy...                      * and asleep.  I need you to talk to Dana.  The vice principle called and she cut class again this afternoon.    Hi, Charlene?  It's Helen.  Is he there?  Sorry to bother you in a meeting, but you have to promise me that                        * you'll be home at eight.  I don't                      * want Dana and I sitting here by ourselves like we were last year. You promise?  Yeah, Gib.  I know Harry.  Where are you going?  No you're not.  You're going to stay here until your father gets home and have cake!  That's not true, honey--  Dana!  Come back here!  It's okay, don't bother, Harry.  Yeah.  It was great.  Let's go to bed, Harry.  There's only one present you have to open tonight.  Don't move.  I'll be right back.  I'll just be a second.  So what happened tonight at the office?    (putting on black  My husband the hero.  I'll be right there, honey.  Just a minute.  Just a second.  Happy Birthday, Harry.        Simon?  Ohmygod.  Hello, Simon? It's all right.  There's no one around.    You mean right now? I guess so.  Okay.  I'll be right there. Yes.  I can't wait.  Bye.  Can you cover me for an hour?  Will you shutup.  I should never have told you about him.  So.  You came by to see me today?  They must've just missed me.  Yeah.  It was a rush thing.  They needed some documents down at the court house.  I barely made it.  Oh, sure.  Fine. I'll get some more gravy.  Hello?  Yes.  Go ahead.     Yes.  I suppose so.  Where?  I can't, honey.  I promised Allison I'd go shopping with her. Sorry.          I kept looking back, like you taught me.  I didn't see anyone.  I understand.  Where were you?  On a... uh,                           * mission?  Worse than Cairo?                                      *     Yes.  That was you?!  Tell me what happened?  You can trust me completely.  Right, of course.  I was worried when I didn't hear from you that night.  Were they trying to kill you?                          *  And you chased one?  You can't?                                             *  What is it you want me to do?  You'll call me then?  Dinner's in the warmer.  Tell your father I may be late.  Out.    What's happened?  What is it you need me to do?  I'm married!  We're going to Paris?  I don't know.  I have to think...  Okay.  I'll do it.  It's just that... it's been sixteen years since anyone but Harry did that, I--  NO!  Stop! Get off me RIGHT NOW!  Kettleman, Barnes and McGrath. I'm a legal secretary.  He said he was an American agent.  I don't know anything about a faction.  I just met Simon...  or whatever his name is...  a couple of weeks ago.  I barely know him.  About two weeks ago I was at the mall, having coffee...         I should have gone to the police, I suppose.  I don't know.  I guess... I wanted to see what would happen.  Three days later, he called me. He told me to meet him at Overlook Park.  Helen.  I just glances inside.  He needed my help.  No.  Well, maybe a little.  No!  Never!  I wasn't cheating!  Harry?  What can I say about Harry?  He's a sales rep for a computer company.  (she sighs, nodding  That's none of your goddamn business!  What kind of questions are these?  My husband is a good man.  He wanted me to go with him on a mission, to pose as him wife.  Yes.  I don't know.  I guess I needed something...  I needed to feel alive.  I wanted to do something...  outrageous. And... I don't know... it felt good to be needed.  To be trusted.  To be special.  There's so much I wanted to do in this life, and it's like I haven't done any of it.  And the sand's running out of the hourglass.  I want to be able to look back and say:  See!  I did that.  It was wild and it was reckless and outrageous and I fucking did it! And I frankly don't give a shit if you understand this or not.  No.    Let me out of her!  Right now!  (she swings again,   What?    I love him.  I have always loved him and I will always love him. Can I go home, please?  Oh, gee thanks.  Mmmm, let me see--  What do you think?  Of course yes!  What's involved?  My husband can't know about this.  I think so.      Where are you off to young lady?     Hello?  Oh.  Yes?  What?  (thinking for a second,  Allison is sick in bed.  I have to go over there, honey.  Do you have an envelope for Doris?  Do I have to... you know-- ?  I'm Michelle.  Carla's sick.  She thought you might like me, so --    I thought you only liked to watch.  Harry-- ?!  He's got nothing to do with this. It's me you want, right?  Harry, be quiet.  Let me handle this.  Listen, you don't need him, he's nothing.  He's a sales rep for a computer company, really--  That was unnecessary.  What were you doing there?  You know her?  I'm Helen Tasker.  Harry's my husband.  And you are?  Look, Harry's not part of this. He's just a sales rep.  No, you don't understand, we've been married for 15 years--  Harry, what's the matter with you?  Tell them the truth.  We're married, we have a daughter--  Oh yeah?  Oh yeah?  Then where did I get this?  Oooowww!!  That hurt.  You biii--  N-no.  How can Harry do that?  He's a salesman for chrissakes.  You bastard!!  You lying son of a bitch!!  Don't call me honey!  You don't ever get to call me honey again. You understand?!  You pig!  You bugged me?!!    Something you obviously have a hard time doing!  What did he give you?  It makes you tell the truth?  Is it working yet?  Are we going to die?  I'd say it's working.  Okay, okay.  I get it.  How long                       * have you been a spy, Harry?  My God.  Have you had to...  have sex with other women in the line of duty?  What about Juno?  Did you pork her Harry?    What is it?  Harry... snap out of it!  Tell me something before this stuff wears off and you start lying again.  Do you still love me?  As much as you used to?  *  I married Rambo.                                       *  If we're on an island, why are they using trucks?  So there's no border, no customs.                      * They can just drive anywhere they                      * want .  .  .  there's nothing to                       * stop them .  .  .  What are you going to do?  Oh shit.  Oh my God.  Harry.    You... bitch!!  That was some kiss.                                    *    ... you should have seen your father, standing there all covered with spaghetti sauce.  He looked like such a dope.  (calmly, signalling  Not yet.  But we'll find him.",
        "Tasker": "",
        "Simon": "Helen?  It's Simon.  Is it safe to talk?  I can't talk long.  Can you meet me for lunch tomorrow?  I must see you.  The same place.  One o'clock.  I have to go now.  See you tomorrow.  Remember, I need you.  Are you sure you weren't followed?  Okay.  It's just, things are a bit hot for me right now.  If I get a signal... I may have to leave suddenly.  It's my job to risk my life, but not yours.  I feel bad about bringing you into this, but you're the only one I can trust.  Ssshhh!  We say Op.  Covert                            * operation.  And this one got a little rough.  Cairo was a day at the beach next                      * to this.     Did you read the papers yesterday?  Sometimes a story is a mask for a covert operation.  See-- two men killed in a restroom, and two unidentified men in a running                          * shootout, ending at the                                * Marriot...  You recognized my style.  See, you're very good.  You're a natural at this.  I'm sorry, I can't.  I know.  But it would compromise your safety too much to know certain things.  It's strange.  I knew I was in a woman's thoughts when I was shooting it out with those assassins.  Three of them.  Hardly worth                           * talking about.  Two won't bother                       * me again.  Something came over me, I just had nail him, no matter what the                       * risk.  It was pretty hairy.  I thought he had me, a couple of                         * times.  But I really can't take credit .  .  .  No.  It's the training.  It                            * shapes you into a lethal                               * instrument.  You react without                         * thinking.                                              *  Not here.  I'll call you and we'll rendezvous again. We have to leave separately, so we aren't seen together.  For your safety.  Yes.  Now go.  It's a great little bar, Amanda, you'd love it.  Beirut's a great place if you know the city.                            * Listen, this isn't a secure line. I'll tell you all about it when I get back tomorrow... if I live. Scared?  Never!  Except of you--  --I have to go, baby.  A guy's coming toward me--  It wants you too.  Feel it vibrate?  How about a little spin?  You gotta jump in.  That's rule number one.  It takes a little practice, but there's no way around it.  See, it's not just the car, it's a total image.  An identity you have to go for.  This isn't some high-tech sports car...  it doesn't even handle that great. But that's not the idea, is it.  What're we talking about here? Pussy, right?  Well then this is a vital piece of equipment.  Used properly, it can change your life.  See, you cruise.  No racing.  This ain't a Ferrari.  You check out the scenery, let the scenery check you out.  You got to take it slow.  Old cars are like good women... they heat up fast.  Let's face it, Harry, the Vette gets 'em wet.  But it's not enough.  If you want to really close escrow, you gotta have an angle.  It's killer.  Look at me-- I'm not that much to look at.  No really.  I can be honest.  But I got 'em lining up, and not just skanks, either.  Some are.  Sorry.  Trade secret.  Okay, just ask yourself.  What do women really want?  You take these bored housewives, married to the same guy for years.  Stuck in a rut.  They need some release.  The promise of adventure.  A hint of danger.  I create that for them.  Well, think of it as playing a role.  It's fantasy.  You have to work on their dreams.  Get them out of their daily suburban grind for a few hours.  Doesn't matter.  I like change. You know, constant turnover.  As soon as I close the deal, it's one of two more times, then adios.  Exactly.  The trick is, you gotta pick your target.  They have to be nice little housewife types. School-teachers.  But, I'm telling you, you get their pilot lit, these babes, they can suck- start a leaf-blower.  Dickless.  If they took care of                        * business, I'd be out of business, know what I mean?  I always have a couple on the hook.  You know.  There's one right now, I've got her panting like a dog.  It's great.  Some kinda legal secretary of something.  Married to some boring jerk.  And she could be so hot, if she wanted to be.  She's like a dying plant that just needs a little water.  Red hot.  Her thighs steam.    See.  You and this car were meant for each other.  Why fight it? Sure, I have a couple other buyers lined up, but I like your style.  Whattya say?  Should we start on the paperwork?  Because it's you.  Nothing from Simon?  Helen.  I need your help.  Can you meet me tonight?  It's serious.  That's all I can                        * say.  Just meet on K Street under                      * the Key Bridge.  At eight sharp.                       *     Now don't be alarmed... but if I'm spotter, it would be best if they don't see you.  You should keep your head down until we're out of the city.  My place in the city is too hot right now.  So is the penthouse in New York.  But this place is secure.     To our assignment.  Helen, I want you to be my wife.    Helen, there's a double agent in my outfit... I don't know who. There's no one I can trust. Except you.  Can you get away? Just for two days.  Here.  Sit down.  Be comfortable.  You are incredibly brave.  I have to remind myself the fear you must be feeling.  I've lived like this for years, so I'm used to it.  Every day when I get up, I think it might be my last.  But it makes you appreciate life. And the moment.  Because that may be all you have.  To pull this cover story off, we have to look exactly like two people who are intimate with each other.  The enemy can spot a fake easily.  You see what I mean?  That reaction would give us away in a second.  Try to relax.  Relax.  There, that's better. Let yourself slip into the role.  There you go.  That's right...  If not for me, do it for democracy.            Thank you.  You saved my life. What's your name?  You can call me Simon. You're very brave to do this... You opened it.       Yeeaoowww!!  Wait!  You got the wrong guy.  My name's Simon.  Look, just let me go.  There's no need to kill me. I haven't seen your--  -- face.  Shit!  Shit!!  It's you!  Hey, you still interested in that Vette at all?  No... I sell cars.  That's all! Not even foreign cars.  Nothing international, I swear.  I'm no terrorist.  Everything I said was a lie... you have to believe me. I'm actually a complete coward. If I ever even saw a gun I'd--  -- faint.  Aahhh!  Don't kill me. I'm not a spy.  I'm nothing.  I'm navel lint.  I have to lie to women to get laid.  And I don't score much.  It's pathetic. See, look... would a spy pee himself?  No.  Soon as I turn you'll shoot me.  Please don't.  You can have the car for free--",
        "Faisil": "Affirmatory.  We are in.                               *  These are encrypted files, guys. This is going to take me a few minutes.  Okay, files are unlocked.  I'm in. I'm down, baby.  I got my hand up her dress and I'm going for the gold.  I'm--  This is GREAT!!  I never get to shoot!  It's a scale really, with \"perfect mission\" on one end and \"total pooch-screw\" on the other and we're more about here--  Yes.  Sorry, sir.  Uh... here's what we got.  Jamal Khaled.  We think he's dirty so we raid his financial files...  Check it out...  One hundred million in wire transfers from the COMMERCE BANK                       *  And we know that a week ago four                       * MIRV warheads were smuggled out                        * of the former Soviet Republic of                       * Kazakhstan .  .  .  (handing Harry a  And this is a little above market-                     * rate for the horizontal bop, even                      * for a total biscuit like her.  Uh huh.  Right here in river city.  She lives in Rome, but she does stuff here the Smithsonian and has a lot of diplomatic connections, so she has offices                        * here.                                                  *  And the second you left there, we started getting calls to the                           * ghost numbers.  They were checking out the Renquist front.  Now he's formed his own splinter faction called CRIMSON JIHAD.  They call him \"The Sand Spider\".                       *      Seven here.  Roger, One.  Rolling.  We've lost the signal.  It's an island in the Keys, out                        * past Marathon.                                         *",
        "Dana": "Hey, thanks dad.  I never had one of these.  Really lame.  Hey, Gib.  What up?  (yelling over the  He lies!  I was there!  I was in the nurse's office, cause I had a headache.  Great!  You're going to believe that fat dweeb Mr. Hardy over your own daughter.  Yeah, Dad.  Okay, Dad.  I'm not a pumpkin!  Okay?!!  Do I look even remotely like a pumpkin?! I'm not a muffin, or a cupcake or a honeybear either! And you don't understand anything Dad...  See.  Out.  If Dad doesn't care enough about us to be here on his birthday, then why should I care? I'm going to a movie.  Mom, wake up!  Dad barely knows we exist.  It is true!  He doesn't know anything about me.  He still thinks I'm like ten years old or something.  As long as I just smile and say yes to whatever he says, like his good little fantasy daughter, he thinks everything's fine.  But it's not fine.  Nothing's fine.  Oh my God!  I think that's my dad!  Fine.  I'm done.  Where are you going?  Oh my Gooooood.  Yeah, right.  Why?  So I can wind up like you? What's the point?  I've been waiting so long To be where I'm going In the sunshine of your looooove  Dad, how come you know the words?  Unbelievable!  Trent told me he wrote it.  He's history.  I'm done.  (pointing toward her  I have to go to the bathroom.  (terrified, but  Don't come any closer.  I'll drop it!  I swear to God.  No way you whacko.  I'm done.",
        "Allison": "So I guess you didn't get away                         * for the weekend after all?                             *  I'm shocked.  Oh... Eric and I drove up to this                      * little romantic inn, and...                            * pretty much lapped champagne out of each other's navels for two days.  Girlfriend, you got a man.  You                        * just have to take control .  . .  set up the right mood.                              *  Then you better do something to                        * jumpstart that man's motor.  You know... wake up the sleeping giant of his passion.  Helen! It's your mystery man.  Just an hour?  You should tell this stud to take more time.",
        "Colonel": "",
        "Spencer": "",
        "Trilby": "Jesus, Harry!  You guys really screwed the pooch last night. Please tell me how I can look at this, that it's not a total pooch- screw.  Faisil.  You're new on Harry's team, aren't you?  So what makes you think that the slack I cut him in any way translates to you?!  So far this is not blowing my skirt up, gentleman.  Do you have                      * anything remotely substantial?                         * Don't be pumping beets up my ass                       * here.  Do you have hard data?                          *  Then perhaps you better get some                       * ... before somebody parks a car                        * in front of the White House with a nuclear weapon in the trunk!  Why?  This is impressive, gentlemen. Of course, it would have been even more impressive if you actually knew where he was.  Yes.  You will. Harry, I still want you in charge, even though your cover is blown.  Just keep a low profile. I generally prefer it when my covert operations don't make the front page.  Harry, this report on last night's operation is the thinnest piece of crap I've ever seen from you.  I'm sure you won't mind giving me a little more detail on why all these assets were deployed.  Harry.  Is there anything you want to tell me?  Harry?  You know we never fire anybody.",
        "Jamal": "",
        "Khaled": "",
        "Harry": "Honey, I'm home.  Switching to sub-vocal.  Gib, you copy?    There's Daddy Petrobucks.  Modem in place.  Transmitting... now.    (indicating the bas-  Renquist.  Harry Renquist.  This is Persian, if I'm not mistaken.    Do you dance, Ms. Skinner?  Unfortunately, Juno, I have a plane to catch.  I'd like that.  Here's my invitation.                                  *  In the helicopter.  What?  Let's go.  We can still make our flight.  Empty.  Go.  What's this for?  Got it.  Nice touch.  Okay, pick me up at eight.  The de-brief is at ten hundred.  What a team.  See you at eight.  Fine, honey.  Stay asleep.  You better hurry.  You're going to be late for school.  Dana, don't forget to feed Gizmo!                      *  I'm late.  Yeah.  You should have seen it. We were the hit of the show with the new model ordering system, the one for the 680... how you can write up an order and the second the customer's name goes into the computer, it starts checking their credit, and if they've ordered anything in the past, and if they get a discount...    Yeah, it was wild.  Uh huh.  Okay.  What did you tell him?  Good thinking, honey.  Thanks dear.  Son of a bitch!  Dana!!  She knows not to steal.  I've taught her better than that.  Morning, Charlene.  Don't be ridiculous.  She's only -- how old is she?  Right.  She's only fourteen.  No way.  Not Dana.  Will you just open the door!                           *  I thought you moved out.  Harry Tasker.  One zero zero two four.  You better watch it.  She might file on you for sexual harassment.  Come on, Fize.  We're late for our butt-grinding.  Total is a strong word--  We think Khaled's group has                            * bought the nukes and is bringing                       * them to U.S.  soil.                                    *  Not what  you'd call rock hard.                        *  What'ya got?  It doesn't mean anything.  She buys antiquities for Khaled.  Alright, I want a complete workup on her.  Do we know where she is?  You're kidding.  I'll handle it.  Dana, Mr. Hardy called.  Why weren't you in class today?  You seem fine now.  I'm not sure what to believe anymore, young lady.  You never used to lie to me.  But lately you don't seem to know the difference between right and wrong.  Dana, are you listening to me?  You know you can always talk to me.  Right?  Whatever is going on in your life, your mom and I'll understand.  You'd tell me if there was something wrong, wouldn't you, pumpkin?  Hi, I'm Harry Renquist.  I own a--  --corporate art consulting company in San Francisco.  I have an appointment with Ms. Skinner--  Well, what's the point of waiting?  That's right.  They want something...  dramatic.  I spoke to a number of people who said you're the one to see.  Let's see... that you can read ancient Sanskrit without having to sound out the words.  And that other dealers and archeologists don't like you much.  She's importing stuff from all over the mid-east.  Okay.  Let's step up the surveillance on her.  Put on two more guys.  Hi honey.  What's going on?                            *     Hello?  Oh, Juno, hi. Well sure.  I can be there in twenty minutes.  What?  It's on the way.  She says she's got something for me.  Hello?  It's certainly... dramatic.  Is that why you got into this business?  And you have a reputation as someone who gets what she wants.  Yes.  Uh, yes, it is important.  Uh, it looks like I have to run. I'll call you tomorrow.  Your proposal is very interesting.  Station wagon?  No.  We need this lead.                                * Unit Seven.                                            *  *  See, that's the problem with terrorists.  They're really inconsiderate when it comes to people's schedules.  Test two three. Pull over here.  (apparently mumbling to         Get back to the car!  Federal Officer in pursuit of suspect!  Sorry.  Westbound in the park... suspect is on a motorcycle... he's going to  come out on Franklin.  Hang on--  I want you on 14th in case he turns south.  And I need Seven on the north side to box him in.  And make it fast.  My horse is getting tired.  Can you just press the top floor, please.  What the hell were you thinking? We had the guy and you let him get away.  What kind of  cop are you?  Look, I know you're upset.  I'm really sorry, honey.  I raced home as quick--  I'm sorry.  Thank you for the party.  Come on to bed, you don't have to brush your teeth.  I couldn't believe it.  I go back to get this report I need, right, and the phone is ringing, so like a bonehead I answer it--  It's the big client in Japan, and it's the middle of the morning there and their whole system is crashed... this guy's having a meltdown--  Well I pull out the manual on their setup, which is the new 680 server...  ...and I'm troubleshooting it with them over the phone... talking to a translator, right, who's getting half of it wrong... it was unbelievable...  really wild.         Look at the way the little punk is driving.  He's all over the place.  Look-- he hasn't signalled once.         Son of a bitch!  That's him.  Abu Kaleem Malik.  We'll get him.  Look, uh... I've got to talk to Helen about this thing with Dana. I'm just going to run in and see if she can get away for lunch.  Just hang a minute.  No.  No, I'd like to surprise her.  Thanks, I know where her desk is.    She's having an affair.  It can't be.  Not Helen.  It can't be.     Put a tap on her phone.  Helen's phone.  Her office line and the line at my house.  Yeah, and we do it twenty times a day.  Don't give me that crap. Just put on the taps.  Now.  How was school today?  I was in the area, and I thought you might like to have lunch.  They said you had to run out.  So, a little excitement in an otherwise dull day.  Did is work out okay?  I thought we might have lunch tomorrow.  No problem.  Just have is back in two hours.                        *  There she is.  Give me audio.  Yeah, but for who?                                     *     Absolutely.  Keep talking.  And you've got one.  So what's your angle?    So you're basically lying your ass off the whole time?  I couldn't do it.  Isn't that hard to keep up, in the long run?  Use 'em and lose 'em.  What about the husbands?  Those idiots.  You working on someone right now?  What does she do?  But with you, she gets to be hot, right?  Sooooo... she's pretty good in bed, then?  Let me think about it.  Hold it a day for me?  Give me the page.  It skips from page nine to eleven.  Where's page ten?   Shit!  It's almost eight.                              *  She's still at my house.                               *  Unit Two?  Unit Seven?  Immediate roll.  Acquire subject at K Street and Key Bridge.                            * Vehicle is red-and-white                               * convertible.  You have six minutes.  Whatya going to do?   Tell?  You tell on me, I tell on you.  What about that time you trashed a six-week operation because you were busy getting a blow-job?  Roger's two.     Roger, two.  One to Condor, do you have visual?      Sit down.  How long have you been a member of his faction?  How did you meet him?  What did happen?  Why did you continue to see him?  Not because you were attracted to him?  You weren't attracted to him at all?  Tell me about your husband, Mrs Tasker.    You're in a lot of trouble, Mrs. Tasker, so I suggest you cooperate.  If we want to know the most intimate details of your life, you'd better tell us.  Let me handle this part.  Do you mind? Why did you go to Carlos' hideout?  And you agreed?    What did you need?  This Simon.  Did you sleep with him?  You didn't have sexual relations with him?  Answer the question--    Do you still love your husband?  Louder please.  (leaning forward to the  (like: isn't it   Yes or no.  You will be contacted with the assignment.  No one must know!  Especially him.  You must appear to live your life normally, conveying nothing.  The security of this nation depends on it.  Can you do that?  Think carefully.  You will be lying to the man you love.  The person who trusts you the most.  The code name of your contact will be Boris.  Your code name will be--  No.  Doris.  You son of a bitch.  Did you really think you could elude us forever, Carlos?  Beat it.  We should pick up visual at the next light.  Morning, boss.  Absolutely.  But can it wait? I'm on a critical surveillance right now.    In her Walkman.  It's the one thing I knew she'd be taking.  There are going to be some changes Dana.  You're going to start following some rules.  And I'm going to be there to see that you do.  You're going to stay in school. Do you understand?  Did I tell you about the time we first met?  You were quite young at the time. All wet and still attached to your mom by a cord.  You opened your eyes and looked right at me. And I knew then I would always love you with all my heart.  Somewhere along the way I got lost, honey.  I forgot about what was really important.  I'm sorry pump-- I mean--  Dana, regarding this singing--    I've been waiting so long To be where I'm going In the sunshine of your looooove  Honey that song came out in 1968, when I was exactly your age.  So last night was pretty exciting, huh?  Sure, hon.  Why not?  You think I can afford a suite like that on my salary? Is Jean-Claude done yet?                               *  Let me do the talking.  You are                        * very pretty.  You may start by                         * unzipping your dress.  No no.  Do it slowly.  Very slowly.  Now slip the dress down...                             * slowly.  Now slide the nylons off one by one.  That's good.  Now the panties.                         *  Now turn, cheri, in the moonlight.  Let your body flow like water.  Now dance for me.  Go on.  Let your hands be a lover's hands on your own skin as you move. Yes, that's it.  Now, lie on the bed and close your eyes.  Keep them closed.  Do not open them.    You wouldn't believe me.  Juno.  I wish I could say it's a pleasure to see you again.  Look, Juno, this is just some whacko hooker I met in the bar.  (looking at Helen  Can you give me a clue?  It could be a water heater for all I know.  This is a Soviet MIRV-Six, from an SS-22N launch vehicle.  The warhead contains 14.5 kilos of enriched uranium, with a plutonium trigger.  The nominal yield is 10 kilotons. Release her and I'll cooperate.  What can I say?  I'm a spy.  I'm sorry, honey.  ...and I can verify that they have the arming box and all                            * equipment necessary to detonate the four warheads.  This is absolutely the real thing, gentlemen.  Oral hygiene?  You know, you should swab that with alcohol.  I might get an infection.  I'm looking forward to it.                             *  Why are you helping these raving psychotics.  You're damaged goods, lady.  There is no us, you psychotic bitch.  There was nothing.  I swear.    Yes.  Ask me a question I would normally lie to.  Yup.                                                   *  They'll either torture us to death, shoot us in the head, or leave us until the bomb goes off.  17 years.  I don't take those assignments.  She's really a fox, isn't she?  No. But I wanted to.  Looks that way.  Yes.  I'm going to kill you pretty soon.  Because I picked the lock on these handcuffs...  Don't move.    Go it, baby.  What?  Yes.  No. Much more.  They found the bodies.  Come on--  Let's go.  In ninety minutes a pillar of                          * holy fire will rise at this place                      * as a sign to out enemies.                              * It is done...  Now no man can stop us.  We are set on our course.  No force can stop us... ... we're cool, we're badass, blah blah.  We must be in the Florida Keys .                       * .  .  the Overseas Highway                             * connects the islands to the mainland.  Just us.  (shrugs, like: what do  Wait here.  If you have to use this, use it.  Don't choke. Okay?    dives down.  An instant later a sheet of fire sweeps across the surface above him.  Harry kicks hard, trying to swim beyond the inferno above him so he can surface.      Let's go.  I'll brief you in the air.      Here they come.      Negative, Mike Three Five. That's a negative. Probably not.  Good shooting, Mike Three Five. I need you to stay on station. Okay.  You see that limo?  Any minute now.  *  My Dana!?  I need to borrow this thing for a few minutes.  If I break it they can take it out of my pay.  Sorry.  Tell Helen what's going on.  Tell her I love her.  And ask the pilot where the button for the 20mm cannon is-- never mind.  I found it.    Don't touch the stick, baby.  Hi, pumpkin.  I told the guy--- I told the guy, this isn't even my order.  I seem to remember something about a history project that's due tomorrow.  Dance?",
        "Janice": "Gentlemen, please idenitify yourselves to the scanner.  Thank you.  You are cleared.  Ten, Mr. Gibson.  Yes sir.  Yes, sir.",
        "Charlene": "Harry's in a sales meeting, Mrs. Tasker.  Let me try him in there. Hold please."
    },
    "imdb_rating": "7.3",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYzg5YmUyNGMtMThiNS00MjA2LTgwZDctNDlhM2RkZDNmZmRkXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_QL75_UX380_CR0,2,380,562_.jpg",
    "description": "Harry Tasker (Arnold Schwarzenegger) leads a double life. At work he is a government agent with a license to do just about anything, while at home he pretends to be a dull computer salesman. He is on the trail of stolen nuclear weapons that are in the hands of fanatic terrorists when something more important comes up. Harry finds his wife is seeing another man (Bill Paxton) because she needs some adventure in her life. Harry decides to give it to her, juggling pursuit of terrorists on one hand and an adventure for his wife on the other while showing he can Tango all at once.—John Vogel <jlvogel@comcast.net>",
    "name": "True Lies",
    "genres": [
        "Action",
        "Comedy",
        "Thriller"
    ]
}