{
    "filename": "Unbreakable_script.txt",
    "imdb_id": "tt0217869",
    "imdb_url": "https://www.imdb.com/title/tt0217869",
    "characters": [
        "David Dunn Age 20 (as David Duffield)",
        "Audrey Dunn (as Robin Wright Penn)",
        "Elijah's Mother",
        "Joseph Dunn",
        "Babysitter",
        "School Nurse",
        "Comic Book Clerk",
        "Elijah Age 13",
        "Audrey Inverso Age 20",
        "Orange Suit Man",
        "ER Doctor",
        "David Dunn",
        "Kelly",
        "Dr. Mathison",
        "Elijah Price"
    ],
    "dialogues": {
        "Elijah's": "No more sitting in this room. I've let it go on long enough.   You can't do anything about that. You might fall between that chair and this television. If that's what God has planned for you, that's what's going to happen. You can't hide from it in your room.  Elijah just sits staring at the dark television screen.   ...You make this decision now to be afraid...  And you'll never turn back your whole life. You'll always be afraid.  Elijah's eyes move from the television to his mother. He sees the emotion in her face. Neither says anything for a while. Beat.   ...I got a present for you.   Forget why. Do you want it or not?  Elijah thinks it over. He nods, \"Yes.\"   Well, go get it then.   On a bench, across the street.  Elijah looks at his mother with disbelief.   You calling me a liar?  She points to the window. Beat. Elijah gets up and moves to the only window in the room.  The view from his room looks out over a narrow street. On the other side of the street is a public playground. A handful of children are playing on it.  There are three benches to one side of the swings. On one of them is a THIN PACKAGE wrapped in brown paper with a bow on it.  Elijah looks to his mom who has joined him at the window.   Then you better get out there soon.   I bought a whole bunch. They'll be one of these waiting for you, every time you want to come out here.  Beat.   They said this one has a surprise ending.  Elijah looks to his mother. His intelligent piercing eyes take her in for a moment.  He looks back down at his lap. He opens the first page...     I am. I'm helping him with the sale.   He's spoken of you. He says you're becoming friends.   I'm very proud of him.  He's been through a lot in his life. A lot of ups and downs, a lot of bad spells. A couple I'd thought had broken him... I mean emotionally.  They were bad... But he made it. Yes he did.   Yes he is.  They both watch Elijah from across the room.   I'll tell him you're here.  David watches as Elijah's mother walks across the store and waits for Elijah to finish talking.  David turns back to the framed sketch. He looks at it with his hands in his pockets. Beat.  David's stare turns into a gaze. His gaze turns into stillness.  THE SKETCH is of a withered man with large tense eyes. He sits in the shadows. He's seated in some type of machine. There are lots of buttons and levers on the machine. The machine has wheels.  David turns from the sketch. He looks across the room to Elijah seated in his wheelchair. Elijah's large eyes stay focused on the customer's as he finishes negotiating.  David turns back to the sketch. He looks at it with growing confusion. The more you look at drawing, the more the machine the man is seated in looks like a wheelchair.  David looks back across the store. Elijah and his mother are talking. Elijah has spotted David.  Beat. Elijah starts across the crowded store towards David. He wheels up to him.",
        "Mother": "We'll play the water pistol game next.  Elijah nods, \"Yes\" happily.  The mother closes the cubicle door. Elijah is left alone amongst the line of women. They stare at him blankly. Their eyes moves over his leg brace. Elijah doesn't like it. He moves away from the line.  A CRESCENDO OF CHEERS RISES IN THE AIR FROM SOMEWHERE IN THE FAIR. Elijah follows the voices. He carries the stuffed animals through the crowds of people. CLICK. CLICK. CLICK. His metal brace sounds as he walks.  For a moment, he sees nothing but bodies all around him.  He emerges amongst a huddle of teenagers who wait at a turnstile.  A man in a red and white striped coat takes their tickets and waves them in.  Elijah looks up and sees the sign above the turnstile... \"The Hurricane.\"  He watches the teenagers giggle as they each into a grey cup-like seat. They pull the metal bars down in front of them.  The man in the red and white stripes leaves the turnstile.  Elijah stares up at the multi-colored sign. Beat. He moves quickly. Ducks under the turnstile and climbs onto the platform.  Elijah finds and empty circular seat. He slips inside the gray metal compartment and sits. He pulls down the rusted metal bar in front of him.  He looks around at all the excited faces. His eyes fill with excitement too.  His small hands feel the cold metal of the interior of the compartment. His expression changes.  Elijah looks to the stuffed animals in his arms. He presses them to check their softness. He places the stuffed animals on either side of him on the seat. He's wedged in between them. Feels good.  He reaches out and touches the hard rusted metal bar in front of him. Elijah looks a little anxious. Beat.  He pulls off his sweater and wraps it around the bar. It goes around twice before he ties the arms together. He checks its softness.  Elijah looks around the customized cup-like compartment he sits in. He smiles an eight year old smile of pride.    He searches around and finds her walking in the waves of people. He hears her calling.   Elijah...  She moves in his direction by chance. She finds herself at the entrance to The Hurricane ride. She looks up at the sign above the turnstile. Her worried eyes immediately start searching the young faces in the gray circular compartments.  Her eyes meet Elijah's. He waves. Her face goes very still.  A HUGE ROAR OF MACHINERY as the ride starts up.  Elijah yells to his mother as the platform starts running.    THE SOUND OF MACHINERY GRINDING IS HEARD as the ride changes directions suddenly.  Elijah's hands rip away from the bar as he gets thrown to the side of the compartment. His shoulder and arm takes the brunt of the impact. WE HEAR    His bones... He's not well...   Elijah baby...  Then her face appears as she finds the cup-like seat Elijah is in. She begins to scream.  Elijah lays on the bottom of the compartment. One arm is clutching his chest. The other is curved horrifically like an \"s\". His mouth is open. His eyes are bulging. The last thing we HERE ARE THE SHORT DESPERATE BREATHS of an eight year old child about to black out from the pain.   No more sitting in this room. I've let it go on long enough.   You can't do anything about that. You might fall between that chair and this television. If that's what God has planned for you, that's what's going to happen. You can't hide from it in your room.  Elijah just sits staring at the dark television screen.   ...You make this decision now to be afraid...  And you'll never turn back your whole life. You'll always be afraid.  Elijah's eyes move from the television to his mother. He sees the emotion in her face. Neither says anything for a while. Beat.   ...I got a present for you.   Forget why. Do you want it or not?  Elijah thinks it over. He nods, \"Yes.\"   Well, go get it then.   On a bench, across the street.  Elijah looks at his mother with disbelief.   You calling me a liar?  She points to the window. Beat. Elijah gets up and moves to the only window in the room.  The view from his room looks out over a narrow street. On the other side of the street is a public playground. A handful of children are playing on it.  There are three benches to one side of the swings. On one of them is a THIN PACKAGE wrapped in brown paper with a bow on it.  Elijah looks to his mom who has joined him at the window.   Then you better get out there soon.   I bought a whole bunch. They'll be one of these waiting for you, every time you want to come out here.  Beat.   They said this one has a surprise ending.  Elijah looks to his mother. His intelligent piercing eyes take her in for a moment.  He looks back down at his lap. He opens the first page...   I am. I'm helping him with the sale.   He's spoken of you. He says you're becoming friends.   I'm very proud of him.  He's been through a lot in his life. A lot of ups and downs, a lot of bad spells. A couple I'd thought had broken him... I mean emotionally.  They were bad... But he made it. Yes he did.   Yes he is.  They both watch Elijah from across the room.   I'll tell him you're here.  David watches as Elijah's mother walks across the store and waits for Elijah to finish talking.  David turns back to the framed sketch. He looks at it with his hands in his pockets. Beat.  David's stare turns into a gaze. His gaze turns into stillness.  THE SKETCH is of a withered man with large tense eyes. He sits in the shadows. He's seated in some type of machine. There are lots of buttons and levers on the machine. The machine has wheels.  David turns from the sketch. He looks across the room to Elijah seated in his wheelchair. Elijah's large eyes stay focused on the customer's as he finishes negotiating.  David turns back to the sketch. He looks at it with growing confusion. The more you look at drawing, the more the machine the man is seated in looks like a wheelchair.  David looks back across the store. Elijah and his mother are talking. Elijah has spotted David.  Beat. Elijah starts across the crowded store towards David. He wheels up to him.",
        "Joseph": "",
        "Dunn": "",
        "Babysitter": "",
        "School": "Jeremy is seated in a chair with abrasions and cuts on his face. He sits next to a smaller boy with a thermometer in his mouth.  They're both looking at the glass window of the nurse's private office. There are tow people inside talking. David and A WHITE HAIRED NURSE.  The THERMOMETER BOY pulls the thermometer out of his mouth.",
        "Nurse": "Jeremy is seated in a chair with abrasions and cuts on his face. He sits next to a smaller boy with a thermometer in his mouth.  They're both looking at the glass window of the nurse's private office. There are tow people inside talking. David and A WHITE HAIRED NURSE.  The THERMOMETER BOY pulls the thermometer out of his mouth.     ...No, he insisted we only call you.  Though it took us a while to track down your number. It's not on file here.   What stuff is that?   It's more emotional damage. It wasn't very serious physically.  David nods.   Nothing like when I sent you to the hospital.  David stares at the white haired nurse.   My office was on the other side of the building back then.  You don't remember me do you?  David nods, \"no.\"   I had red hair.  David stares at the woman. He doesn't recognize her.   I think you were a little younger than Jeremy when it happened.  Did you know we changed the conduct rules of the pool because of you?  David nods, \"no\" slowly.   The kids still talk about it like some ghost story...\"Did you know there was a kid that almost drowned in the pool? He got pneumonia and almost died.\"  The nurse shakes her head.   We let them tell it... It helps keep them safe.  Beat.   Are you still phobic of water?  David seems lost in his thoughts. He looks up at the nurse.",
        "ER": "Women's casual wear department. J.C. Penny.  Legend \"1961\"  An African-American man carrying two J.C. Penny shopping bags is ushered past the department store managers and security guards on walkies that have gathered at the entrance to the woman's dressing rooms.    A bed has been formed by a chair and three benches.  A STRIKING AFRICAN-AMERICAN WOMAN in her twenties lays across it. Her face and clothes are covered in sweat. Her skirt is stained.  She holds something wrapped in a soft sweatshirt on her chest. We can't see it, but WE HEAR THE BABY CRYING.  She's just given birth.  There are three frazzled saleswomen in the dressing room with her. They watch her with quiet smiles.  A fourth SALESWOMAN arrives ushering in the man with the shopping bags.     Nothing. It was very quick. The baby just wanted to come right out. There was no problems.   Jesus Christ, no.  The BABY SCREAMS.  The doctor whispers something to himself, we can't hear. He looks up to the saleswoman who brought him in.     Last call track three, Amtrak Clocker making it's final stop at Philadelphia's thirtieth street station. First two passenger cars only. First two cars only.  A face inside the train watches the stream of passengers emerging from the escalators. DAVID DUNNE, a man in his early forties, rest his temple against the glass and quietly observes the movement outside.  The train starts to pull out.    David sits with his coat on his lap. He's wearing a tie. He doesn't look very comfortable in it.  He feels a stare. He looks up to find a girl, six or seven years old, peering at him from over the seat in front of him. She just gazes at him blankly.  He gives her a small forced smile. She doesn't react. David returns his head to the window.  His eyes begin to shut with the lulling movement of the train.     A boy, age ten, sits on his head on the family couch and watches television upside down. His floppy brown hair spreads out in a circle in front of his red face. He changes channels with a remote control.  He moves past the upside down cartoons and the upside down talk shows. He stops on an upside down picture of a crashed train. Beat.  His knees come forward as he flips over. He tumbles slowly off the couch and onto the carpet. JEREMY DUNNE gazes at the television screen... A LIVE AERIAL VIEW OF A TRAIN WRECK SMOULDERING BELOW IS SEEN. Two trains are tangled like snakes.  Jeremy gets up and moves to a small table with a phone. Next to the phone is a notepad. On it is written...  \"Dad - Amtrak 177 - 3:40pm.\"  Jeremy looks at the television. At the bottom of the screen in red block letters that move from right to left are words and numbers...\"The 3:40 Amtrak 177 has derailed... Amtrak Emergency number is 1-800-777-4322... The 3:40 Amtrak 177 has derailed...Amtrak\"  Jeremy doesn't take his eyes off the screen. He makes a small desperate noise that no one hears.    An elderly woman can't hold back any longer and SCREAMS. An embarrassed, tortured helpless scream.  MEGAN DUNNE continues applying pressure to her arm which is being pushed back as far as it will go.  She counts to three and eases off. She lays her arm back in her lap.  WE ARE IN A PHYSICAL THERAPY CENTER. About a dozen people are on specialized weight machines.  The elderly woman is seated on an exercise table and breathes slowly.       David moves through the depressing milky corridors of the hospital. He opens a set of double doors.  A room crammed with cameras and photographers explodes with movement.   I told you!  Jeremy Dunne pushes forward through the mob of people and cameras. He bursts out and runs to David. He wraps his arms around David's waist. David just stands there, aware that the cameras are catching it all. He's overwhelmed.  Hospital staff and a couple police officers push the media back.  Jeremy tugs David to lean down. He does.   They thought everybody on the train died.  David looks at his son's face. Wipes the tears on his cheek.   I told them they were wrong.  A woman moves to them. David stands up and faces Megan Dunne.   Mom even cried.  David looks at Megan's eyes.   A lot.  Megan looks away.   Let's go home.  Megan nods. They move to the exit. The pack of cameras and reporters burst to life as they leave the building. They jockey for position to get a last glimpse of David Dunne.   I want to sleep here tonight.   I won't make any noise.   We'll play the water pistol game next.  Elijah nods, \"Yes\" happily.  The mother closes the cubicle door. Elijah is left alone amongst the line of women. They stare at him blankly. Their eyes moves over his leg brace. Elijah doesn't like it. He moves away from the line.  A CRESCENDO OF CHEERS RISES IN THE AIR FROM SOMEWHERE IN THE FAIR. Elijah follows the voices. He carries the stuffed animals through the crowds of people. CLICK. CLICK. CLICK. His metal brace sounds as he walks.  For a moment, he sees nothing but bodies all around him.  He emerges amongst a huddle of teenagers who wait at a turnstile.  A man in a red and white striped coat takes their tickets and waves them in.  Elijah looks up and sees the sign above the turnstile... \"The Hurricane.\"  He watches the teenagers giggle as they each into a grey cup-like seat. They pull the metal bars down in front of them.  The man in the red and white stripes leaves the turnstile.  Elijah stares up at the multi-colored sign. Beat. He moves quickly. Ducks under the turnstile and climbs onto the platform.  Elijah finds and empty circular seat. He slips inside the gray metal compartment and sits. He pulls down the rusted metal bar in front of him.  He looks around at all the excited faces. His eyes fill with excitement too.  His small hands feel the cold metal of the interior of the compartment. His expression changes.  Elijah looks to the stuffed animals in his arms. He presses them to check their softness. He places the stuffed animals on either side of him on the seat. He's wedged in between them. Feels good.  He reaches out and touches the hard rusted metal bar in front of him. Elijah looks a little anxious. Beat.  He pulls off his sweater and wraps it around the bar. It goes around twice before he ties the arms together. He checks its softness.  Elijah looks around the customized cup-like compartment he sits in. He smiles an eight year old smile of pride.    He searches around and finds her walking in the waves of people. He hears her calling.   Elijah...  She moves in his direction by chance. She finds herself at the entrance to The Hurricane ride. She looks up at the sign above the turnstile. Her worried eyes immediately start searching the young faces in the gray circular compartments.  Her eyes meet Elijah's. He waves. Her face goes very still.  A HUGE ROAR OF MACHINERY as the ride starts up.  Elijah yells to his mother as the platform starts running.    The platform spins. He sees a glimpse of his mother and the red and white striped man. She's pointing at Elijah.  The platform turns... Elijah sees a flash of the red and white striped man's angered face as he yells at the frantic woman next to him.  And then the ride speeds up.  The gray circular seats start to spin on their own. The teenagers CHEER.  Elijah's eyes fill with joy as the wind plays against his face.  Suddenly the ride changes directions. The cup-like seats get jerked. Everyone grabs the metal bars to hold on.  Elijah laughs as he smashes into the stuffed animal on his right. It cushions him and then falls to the floor of the compartment along with the other stuffed animal.  Elijah's expression becomes tense as his compartment spins. His hands slide over the rusted metal bar as the sweater unravels.  Elijah looks around... a sudden panic enters his eyes.    THE SOUND OF MACHINERY GRINDING IS HEARD as the ride changes directions suddenly.  Elijah's hands rip away from the bar as he gets thrown to the side of the compartment. His shoulder and arm takes the brunt of the impact. WE HEAR   The ride spins its passengers. Elijah's small face looks up at the swirling clouds in a mixture of agony and terror.  The ride changes directions.  Elijah is thrust forward. He hits the rusted metal bar square against his chest.   Elijah is facing directly up at the sky. The clouds now move slowly over him.     His bones... He's not well...     Elijah baby...  Then her face appears as she finds the cup-like seat Elijah is in. She begins to scream.  Elijah lays on the bottom of the compartment. One arm is clutching his chest. The other is curved horrifically like an \"s\". His mouth is open. His eyes are bulging. The last thing we HERE ARE THE SHORT DESPERATE BREATHS of an eight year old child about to black out from the pain.    WE EMERGE FROM BLACK to find news vans and reporters lining the street across from a church. They have been cordoned off by a handful of police. Mourners are recorded as they emerge from their cars and enter the church.  David is among the arriving crowd.    A PRIEST stands before a podium.    David and the priest who conducted the mass are alone in the mass preparation room. The priest looks in his fifties, eyes tired, blood shot.    No cameras greet his exit. No people anywhere.  David walks across the now empty parking lot. His car is the only one left.  He walks to the driver's side. Pulls out his keys. That's as far as he gets.  His eyes catch sight of the GRAY ENVELOPE tucked under the windshield wiper of his car.  David moves forward and gently pulls it out. His name is typed on the front. He turns it over. Two embossed words on the back.   \"Limited Edition\"  He opens the envelope. One line, handwritten, gazes at him from the gray index card.  The line reads...   Nothing else is written.  David Dunne looks around the empty parking lot quietly.    A poorly lit changing room. A row of metallic lockers sits against one wall. A bench splits the room. A brown folding table with Dunkin Donuts boxes and bagels on it is crammed in the corner. A puke colored concrete floor sets the tone.  David and three other large men are changing out of their street clothes. They all put on the same yellow short sleeve shirts. The same two words are written on all their backs...  \"Stadium Security\"  This ritual goes on without a word.    David knocks on the door as he steps into the cramped reception room to the personnel office.  The SECRETARY, an ancient woman with thick flabby arms never stops typing and never looks up as she talks.    Rain falls in sheets in the stadium.  David stands at the entrance to a tunnel that empties out onto the field. He stands in an imposing dark green rain poncho and hood. The poncho almost touches the ground. The word 'security' on the back has almost faded away. We can barely see David's face under the hood.  There is a football game in progress on the enormous field. The players seem unusually small. There is no one in the stands. About four hundred people are on the sidelines of the field watching the players. A soggy limping banner stretched behind them declares, \"The Pennslvania Elementary School Championships.\"  David's eyes scan the tiny figures on the field. His eyes come rest on a surge of activity on the sidelines. Beat.  David steps out into the rain.    A handful of red faced fathers are yelling at each other. They're in each other's rain soaked faces. The scene feels on the verge of physical violence.  David and another security guard jog over. David steps in the middle of the tight circle. The men stop yelling in the presence of stadium security. Everyone just stands in the rain glaring at each other. Beat.   Yeah Jerry why don't you think about the fat ass turtles... Like your fat ass son on the field jeopardizing the rest of our chances at a fucking championship.  David tenses. Everyone looks to JERRY. A bald man who stands just a foot away. Jerry nods to himself. Looks like he's going to say something. Instead he lunges forward and smashes a HEADBUTT to the man who spoke to him.  David tackles Jerry hard and fast. He drives him into the ground.  Blood starts rushing out of the nose of the dazed father who took the headbutt.  The other fathers start yelling and pushing each other. The remaining security guard calls on his walkie for assistance.  David keeps Jerry immobilized in a powerful arm and head lock that holds the man's enraged face hard into the wet surface of the field.  David's eyes are not on Jerry. They gaze out onto the field where twenty two elementary school boys have stopped playing and are standing frozen, helmets off, rain washing over their faces. They watch in horror as their parents attack each other on the sidelines.    David is the last one left. He's showered and back in his street clothes. He sits in the dimly lit room on the bench, lost in his thoughts when the door opens.  He turns to find a somewhat pregnant looking man with a tie step in. This is   WE EMERGE in a cramped sparse bedroom.   No more sitting in this room. I've let it go on long enough.   You can't do anything about that. You might fall between that chair and this television. If that's what God has planned for you, that's what's going to happen. You can't hide from it in your room.  Elijah just sits staring at the dark television screen.   ...You make this decision now to be afraid...  And you'll never turn back your whole life. You'll always be afraid.  Elijah's eyes move from the television to his mother. He sees the emotion in her face. Neither says anything for a while. Beat.   ...I got a present for you.   Forget why. Do you want it or not?  Elijah thinks it over. He nods, \"Yes.\"   Well, go get it then.   On a bench, across the street.  Elijah looks at his mother with disbelief.   You calling me a liar?  She points to the window. Beat. Elijah gets up and moves to the only window in the room.  The view from his room looks out over a narrow street. On the other side of the street is a public playground. A handful of children are playing on it.  There are three benches to one side of the swings. On one of them is a THIN PACKAGE wrapped in brown paper with a bow on it.  Elijah looks to his mom who has joined him at the window.   Then you better get out there soon.    Elijah walks across the playground. He's very wary of the other children running about him.  He walks towards the bench with the present on it. Takes a seat. Puts the package on his lap. It's flat. The edges of the bend down over his thin legs.  He undoes the white bow. He peels off the clear tape holding the brown paper together. He unfolds the paper. Beat.  Elijah stares down at the single comic book in his lap.  He feels the shadow of his mother. She takes a seat next to him.   I bought a whole bunch. They'll be one of these waiting for you, every time you want to come out here.  Beat.   They said this one has a surprise ending.  Elijah looks to his mother. His intelligent piercing eyes take her in for a moment.  He looks back down at his lap. He opens the first page...    Three chairs have been placed on the walkway in front of the bay window of the store. The words, \"Limited Edition\" are etched in the window.  David, Jeremy and Elijah are seated watching the people stroll by. Elijah's cane is on his lap.  Jeremy sips a drink in a paper cup.   Dad's been injured.  Beat.   He couldn't play football anymore.  Beat. Elijah looks shaken.    David and Jeremy enter the store. Elijah leans on a walking stick before one of the framed sketches. He gazes at it quietly.   You thought my dad was a real-    There's just enough room to stand and look around. David reaches up and pulls a small travel bag out of the way. David stretches as he feels on the top shelf.  His hand comes down with something wrapped in a t-shirt. He unwraps it. It's a handgun.  He stares at it for a beat before wrapping it back up and replacing it to the highest shelf.  He stretches even more. Reaches farther back. WE HEAR SOMETHING SLIDE ON THE   Sunday afternoon. The cavernous stadium opens up into a picture perfect blue sky. The Philadelphia Eagles pro football players are in uniform and doing stretches on the field. The opposing team warms up on the other end of the field.  The sixty thousand seats are already half filled as fans stream in on every level of the stadium.    A line of ticket holders snakes towards two turnstiles where stadium crew are ripping tickets.  David Dunne stands to one side with two other security guards.  The fans moving through the turnstiles are clad in all types of Eagles paraphernalia. A group of girls carries a homemade banner that David reads as he tilts his head sideways. \"We sleep with quarterbacks,\" is written in block letters.  David stares at a woman carrying a newborn infant in her arms. The baby is wearing an eagles uniform.  The WALKIE TALKIE on David's hip bursts to life. He pulls it off his hip an listens.    David finds Elijah waiting to the side as the crowds funnel through the gate. Elijah offers his hand as he walks up. David doesn't take it.    The line of fans outside the gate has tripled in size and intensity.  David and Elijah move along the line towards the turnstiles.    AN UNLIT arched concrete passageway. The SUNLIGHT from the stadium streams in causing long shadows.  Elijah stands waiting in the ground tunnel by himself.     We are inside a customized car. The dashboard is covered in some sort of thin foam padding. The steering wheel and gear shift have the same padding. Every corner and hard surface has been safe guarded. Elijah sits behind the wheel of his car in the parking lot of the stadium. He sits as thoughts crash at his head. Beat.  He finally reaches for the keys and starts up the car. He looks into the rearview mirror and sees the man in the GREEN ARMY JACKET pass behind his car.  Elijah quickly turns and sees the man moving through the parked cars heading out of the parking lot.  Elijah takes a deep breath and turns off the engine.    Elijah's walking stick makes RHYTHMIC CLICKS on the concrete parking lot.  The figure in the army jacket seems to move farther away with every step.  Elijah starts breathing harder. He pushes himself to move faster. He avoids the hard chrome bumpers and tailpipes that jut out from the cars as he quickens his pace through the lot.  He gains on the army jacket.   Was it sold out?  David nods, \"No.\"   Are you going to tell?  David nods, \"No.\"   You want yo play the last downs? We got a big guy like you. You can play on opposite sides.  David looks to the fields to see a very muscular college age man in sweats who stands with the other children.   He's Potter's cousin. He's the starting corner back for Temple University.  David stares at his son.   He going pro in the draft. They say he can run the fifty-   Just play one set of downs. I told them you were great.   Just one-   What things?   I'll help you.   I can't play! I'm working out with my dad!  Jeremy turns back to his father and takes his hand. David looks down at his son who waits patiently.   You think you could beat up Mike Tyson? I mean before he started wiggin out and eating people's ears?   What if you worked out everyday for six months? You think you could beat him then?   What if you only ate foods that were good for you and you worked out everyday for a year?  Jeremy is breathing hard as he puts the safety collars on the barbell and comes around to David's end of the bench. David lays back.   How much can you lift?  David looks back at the weights.   I'll take it off. I'll help you right.  He slips off the safety collar.   You think you could have beaten up Bruce Lee?  David hears the SOUND OF THE WEIGHTS SLIDING OFF THE BAR BEHIND HIM.   I mean if you knew karate?   What if he wasn't aloud to kick and you were really mad at him?  Jeremy is breathing hard again as he finishes with the weights and comes around to David.  David lays back.   I lied.  Beat.   How much is it?   Let's put more.  Beat.   More?  Beat. David nods, \"Yes.\"   Get mom.  David nods, \"yes\" before starting his deep breathing. He takes one last breath. CLINK the weights comes off the rest. His arms are trembling immediately now. His face is locked in a grimace as he brings the bar down to his chest and back up again two times before dropping it onto the armrest.  He slowly sits up.   All of it.   How much is it?  David doesn't react.   How much is it dad?  It takes a second for David to register the question. He looks to his son. Beat.    David walks into the darkened child's bedroom. The lump on the bed turns when he hears movement. He smiles when he sees David.   I'm sleeping in my room.   I'm not scared.   Do you know why?  David nods, \"No.\"   I know now.   You're secret identity.  That man was right.  Beat. David just stares at his son. Jeremy's eyes start to close.   You could have lifted more.  ...Don't worry, I won't tell anyone.  Jeremy Dunne falls asleep. David Dunne stands in the darkness of his son's room. Posters of comic book heroes don the walls around him.      A CO-WORKER finds Megan working with an elderly gentleman who's laboring on a stationary bike.    David Dunne stands in security uniform by a set of double doors that leads into the players locker room.  Three walls of the locker room are lined with shiny lockers. One side of the room has benches and massage tables. The far end of the room has work out equipment.  About twenty players and trainers are scattered throughout the spacious room lost in their own pre-game rituals.  David watches as a massive muscular player takes a seat on the massage table and removes his dress shirt. His body is covered in old bruises. He lays down, wincing a bit from the pain. A trainer begins to massage him.  David just stares at the battered athlete. His gaze moves across the room. Beat.  David stares at something in the crowded room then he starts towards it.  He moves through the room of players and trainers. He moves to the one area of the large room not occupied by anyone.  David comes to a step at the foot of an Olympic bench press. Racks and racks of free weights sit behind the press.  David looks down at the thick silver bar. Three large black plates are on either side. Six in all.  David looks back and glances at the double doors where he should be standing. Beat. He looks to the twenty or so players and trainers in the room. Some of the players have headphones on. Some are staring into space. A couple are on cell phones...  No one notices David Dunne as he reaches for a forty-five pound black plate off the weight rack.  The huge disc slides onto the bar with almost NO SOUND...  A matching forty-five pound disc goes on the other side...  And then David adds another. He matches it on the other side...  THE BENCH CREAKS just the slightest bit as David takes a seat.  No one notices the security guard lay back on the bench.  David's hands take hold of the shiny bar.  He closes his eyes...  David's arms become tense. He pushes against the weight. It doesn't move.  His face turns deep red. He opens his eyes and stares at the bar as he keeps training. His face and arms are shaking... He keeps staring... focusing.  And then, without any fanfare, the bar lifts off the arm rest.  The weight hovers over David. He lowers it to his chest for a second time. His arms aren't shaking anymore. He pushes the weights back up.  He carefully brings the bar back to the arm rest. It touches down with the smallest of CLINKS.  David's fingers uncurl from the bar.  David lets out two slow soft breaths as he counts the thick black discs.    Megan and Elijah are in the far corner of the room. They're separated from the other clients. Megan is seated on an exercise machine. Elijah is in his wheel chair facing her.    Eleven football players in white and green battle eleven football players in blue and gray on the field. A sold out stadium watches the event.  David stands at the lip of a tunnel that opens out onto the upper section of the second level. Waves of people move from their seats through the tunnel to the bathrooms and concession stands and back again.  David stares to the side away from the movement, his shoulder leaned up against the wall. He looks over at the constant movement of spectators through the tunnel.  Beat. His shoulder leaves the wall. He STEPS OUT into the stream of people. Shoulders and arms bump into him and brush by him as they move.  David's eyes are looking down - his expression still - like he's listening.  He continues into the dead center of the tunnel. He's in the heaviest part of the movement now. Fans continue to brush against him as they pass.  And then it happens... A stocky woman bumps into him.        Elijah and Megan sit very still.    David lets the waves of people move by him in the tunnel.  A MAN WITH GRAY EYES and wearing a dark blue sweat shirt carries a cardboard tray of nachos and drinks. He brushes David's arm as he passes.        Jeremy is seated in a chair with abrasions and cuts on his face. He sits next to a smaller boy with a thermometer in his mouth.  They're both looking at the glass window of the nurse's private office. There are tow people inside talking. David and A WHITE HAIRED NURSE.  The THERMOMETER BOY pulls the thermometer out of his mouth.   Is that your dad?  Jeremy nods \"Yes.\"   I bet my dad can beat up you dad.  Jeremy turns to the thermometer boy.   I don't think so.      David and Jeremy are seated on a bench at a Septa bus stop. No one else is waiting with them.  Jeremy talks without making eye contact with his dad.   It was Potter and another guy I play football with. They were messing with this Chinese girl. She's kind of fat. She doesn't talk to anybody.  I tried to make them stop. They kept pushing me down and wouldn't let me get up.  Beat. Jeremy's VOICE STARTS TO TREMBLE SOFTLY.   I thought maybe cause you were my dad, I thought I might be like you.  Jeremy finally looks up. Tears in his eyes.   I'm not like you.  David moves closer to Jeremy on the bench.   Why do you keep saying that?   You don't believe. I'll show you... You can't get hurt.   -You won't get hurt...   -I'll show you.  David starts moving a little to his right. Jeremy follows him with the barrel of the handgun. David stops moving.   -You're lying.   -I'll just shoot him once.   -Don't be scared.   -Why?  Jeremy's hands are trembling. He starts to close his eyes as he raises the gun level with David's chest.   ...You didn't have to yell.  The Dunne family sits in silence on the floor of their kitchen.    People move up and down the streets outside the storefronts. David is one of them. He waits to cross the street. He sees movement inside the Limited Edition window.    Elijah opens the door. It takes him a bit, because of the wheelchair.  David stares at Elijah's damaged condition. Beat.    David exits the Limited Edition and moves down the street lost in this thoughts. He bumps a man in a jacket and tie walking in the opposite direction.          A superhero action figure and a plastic villain do battle on Jeremy's desk.  David sits dressed up in a white shirt and dress pants. He holds the villain. Jeremy holds the superhero.  Megan enters the room in a beautiful brown dress.       Is she all right?   Are you injured?  Beat. David looks at Megan who lays shivering in the grass. He looks back at the driver.   Hold on. I got a C.B. in the truck.  The driver moves back to his truck.  David takes Megan's hand in his and waits in the grass by the sight of their car on fire.                What's your name? I think you drank too much.           An exercise bike in the corner of the bedroom has been turned into a clothes hanger long ago. The t.v. across the bed has framed family photos displayed on top of it.  David's shadow passes over them as he moves towards the open bathroom on the other side of the bedroom.  A woman is tied to the bathroom door handle. She sits on the tiled floor slumped against the door. Her eyes stare blankly at the ground. She has considerable bruises on her face and arms.  David stands before her.    David's body is tangled in the pool cover. His legs and arms thrash against the constricting black tarp. He's drowning.     The last of the tarp slides out from under the sandbags that old it in place around the edge of the pool.  The rain keeps falling.  The tarp moves like it's alive underwater. It shifts and wraps David tighter with every movement.    David's only free hand reaches for the light. It catches the silver pole.  The tangled mass of David and the tarp are pulled slowly towards the edge of the pool. David's head and shoulders emerge from the darkness. He takes hold of the pool's edge.  Huge desperate breaths as he pulls his body out from the water and the grasp of the tarp. He hauls himself onto the ground.  He sits hunched over in a dark mass, his head down under his hood. The rain poncho covering him like a blanket. Beat.  He rises to his feet. The water rushes off of him. His breathing is slowing, calming.  He stands in a silhouette from the light of the house. He turns and looks to the two small figures standing near the edge of the pool.  The children from the bathroom stand still in the rain. They're holding an aluminum pole with a brush head for cleaning the pool. They stare up at the hooded figure.  No one says anything.    The man in the orange one-piece uniform stands over the woman tied to the door handle of the bathroom. His back is to us. He's drinking from a beer bottle as he looks down at her.  He doesn't notice the third presence come into the room. He doesn't hear him move closer. Right behind him.  The man in orange takes another sip of his beer, not realizing an arm is reaching over him... He doesn't get to swallow the sip in his mouth.  David Dunne's powerful arm wraps around the man's thick neck. David's hands clamp together like and iron vise. He squeezes.  The man's beer bottle crashes to the ground as his neck begins to get crushed.  David yanks back hard, pulls the man off balance. The man's legs push back violently, sending both of them backwards across the room. They come to a hard stop as David's back gets RAMMED INTO THE BEDROOM WALL.  The huge man in orange pulls away and then SLAMS DAVID harder against the wall. David's arm remains locked around his throat.  The man becomes frantic. His face turning dark red. He clutches at David's arm. He spins, taking David with him into another wall. The IMPACT IS TREMENDOUS. The room shakes. David holds on. His face bent low and hidden under his hood.  And then the man in orange throws a powerful elbow back. It lands hard right in David's side. David groans. The huge man delivers another one. Savage, desperate blows. WE HEAR THE IMPACT OF EACH ONE WITH DAVID'S BODY. And David never lets go.  The elbows slow and then stop. The legs of the man in orange start to buckle.  David pulls him back onto his heels. He turns him in a half circle. All of his tremendous weight is hanging from David's arm now. David LETS OUT A YELL AS HE APPLIES ALL HIS STRENGTH. The man's legs stop kicking.  David keeps turning him. The man's body goes completely limp. David's just dragging two hundred and seventy-five pounds of weight in a circle over the carpet now.  David slowly comes to a stop. He stands there with his arm wrapped around the man's neck....The man's limbs dangle down to the ground. Beat.  David's hands let go of each other. His arm slips out from under the man's jaw. The man in orange crumples to the ground like a rag doll. The only SOUND IN THE ROOM IS DAVID'S HEAVY BREATHING. Beat.  He moves to the woman slumped against the door. He starts to untie the phone cords that bind her wrists to the handle. He whispers to her.    David enters the quiet of Jeremy's room. Jeremy lays sound asleep. David stares down at the shadowy figure of his son.  He pulls the blanket over the boy's small shoulder.   I am. I'm helping him with the sale.   He's spoken of you. He says you're becoming friends.   I'm very proud of him.  He's been through a lot in his life. A lot of ups and downs, a lot of bad spells. A couple I'd thought had broken him... I mean emotionally.  They were bad... But he made it. Yes he did.   Yes he is.  They both watch Elijah from across the room.   I'll tell him you're here.  David watches as Elijah's mother walks across the store and waits for Elijah to finish talking.  David turns back to the framed sketch. He looks at it with his hands in his pockets. Beat.  David's stare turns into a gaze. His gaze turns into stillness.  THE SKETCH is of a withered man with large tense eyes. He sits in the shadows. He's seated in some type of machine. There are lots of buttons and levers on the machine. The machine has wheels.  David turns from the sketch. He looks across the room to Elijah seated in his wheelchair. Elijah's large eyes stay focused on the customer's as he finishes negotiating.  David turns back to the sketch. He looks at it with growing confusion. The more you look at drawing, the more the machine the man is seated in looks like a wheelchair.  David looks back across the store. Elijah and his mother are talking. Elijah has spotted David.  Beat. Elijah starts across the crowded store towards David. He wheels up to him.       I've worked here twenty-five years. I know all its secrets.   Like if there was ever a fire on floors one, two, or three... Everyone in this hotel would be burned alive.      Passengers aren't allowed in there.  Elijah doesn't answer and doesn't turn around as he exits train 177.",
        "Doctor": "",
        "David": "Someone left these. You want one?  The woman looks over the one being offered and then points to the Sports Illustrated peeking out of the seat pocket.  David pulls the magazine out and gives it to her.   You like sports?   What a coincidence? I'm a male synchronized swimmer and I'm looking for representation.   But I'm afraid of water, so that's been holding my career back a little bit.  The woman laughs.   You represent someone in Philadelphia?   Not really.   I'm David Dunne.  The woman looks up.   How long are you staying in Philly?  KELLY looks up from her Sports Illustrated. Her striking blue eyes gaze at David. Beat.  She holds up her hand. Taps the diamond ring on her finger.   Great.  Beat.   What are you talking about?  An awkward silence.   I think you got the wrong idea.  The woman stares at David. She looks down. Beat. Closes the magazine.     Okay.  He FLASHES A LIGHT in David's eyes.   Fine.  David stares across as the scene with the other patients becomes more frantic and disturbing.   Against a window.   Yes. Where are the rest of the passengers?   No.   No.  David watches the other patient.   Yes... Why are you looking at me like that?  Beat.   I don't think I got the job in New York.   I'm still going to New York. Just not this second.   I know.  Beat.   How about in the meantime, you don't sleep in the guestroom anymore?  You sleep in our room. I'll sleep down here.  Beat.   Jeremy, why don't you go sleep with your mom?   I think it's be better if I was alone.   How about your room then? If you get scared like before, you can come back in here?  Beat. Jeremy doesn't answer because he's asleep. David rubs his forehead and gets up. He turns on the t.v., low volume, as he moves into the bathroom.   I used to play football in college. In my first year as quarterback, we went on this winning streak. It just went on and on. It didn't matter who we played... I'd always win.  You get superstitious when something like that happens. You give things meaning. Like you wear the same color socks each game or you listen to the same B.B. King song before you leave the apartment. I wouldn't even untie the shoelaces on my cleats. I'd just slip them on and off so nothing would change... I gave things meaning that had no meaning.  I'm here to make sure I'm not making shoelaces into something they're not again.  I was the only person to survive that accident. The only one... It feels like it means something.  Beat.   Okay.  Beat. The priest turns to David.   What do you mean?   The metal of the watch I was wearing was crushed like a sledge hammer hit it.  Beat. The priest's eyes fill with emotion.   Is Noel in?   Oh.   Wow.   That's a sad story.  Do you think you could ask Noel something for me?  The ancient secretary's right hand immediately picks up a pen and positions it over a blank pad. Her left hand keeps typing. She never looks up.   Ask if he can check how many sick days I've taken since I've worked here?  Beat.   Yes.   You know what I think about to calm down? I think about those big fat, hundred and twenty pound turtles that live in the islands. Those suckers never get angry, never get in fights and live longer than all of us and all they do all is sit on the beach and hump other turtles.  Why don't we take a second and think about the turtles?  Nobody moves. Rain washes over the agitated faces. A father breaks the moment.   Hey Noel.  Beat. He just stares.   What?   He's asleep.   I wanted to ask you a question. It'll sound strange, but just think about it for a second.  Megan nods, \"Yes.\"   When's the last time I was sick? You remember?  Megan tries to mask her reaction to the oddness of the question. Beat.   I haven't been sick this year. I know that.   Do you remember me getting sick?   Megan, do you <u>ever</u> remember me getting sick?  Beat.   In the three years we've been in this house?... In the old apartment?... Before Jeremy was born?... Before we were married?  Beat.   That's strange isn't it? Not remembering one fever... Or a cold... Or a sore throat. What do you think that means?   Yes.   No that's it.  David seems lost in his thoughts.   Yeah. I know.  There's silence for a bit.   When was the last time I wore pink?   Oh shit...   Goodnight Megan.  Megan looks back at her husband. Just for a moment. Then she looks down.   I don't know for sure.  ...I don't think so.  David and Elijah quietly look at each other. Beat.   Seventy-five percent.   Skeptical about what?   In college. A car accident.   You assumed wrong.  Elijah closes his eyes. When his eyes open, the life force in them has diminished. Beat.   I think you skipped a couple steps.  Elijah turns.   You forgot the \"Now I'm going to tell you what the hell is going on\" step. See usually that comes before the, \"It's over\" Step. And it always, always comes before the \"You can go\" Step.  What is over?   What was your idea Elijah?  Beat.   Jeremy don't take another sip of that drink.  Jeremy looks down at the paper cup in his hands.   Throw it in the trashcan near the door and wait for me outside. Do it now please.  David waits for Jeremy to exit the store. Beat.   At the church... You were following me weren't you?   What's this about? This is obviously some scam. Is this where you tell me one of those pictures is like an investment?   I see guys like you all the time in my work. You find someone you think is emotionally vulnerable and you tell them a fantastic story, utterly convincing... and somewhere in there, you slip it in... 'I just need your credit card number','I just need a small down payment.'  David shakes his head. He smiles out of frustration. Beat.   Did you know that this morning was the first morning I can remember, that I didn't open my eyes and feel that sadness... Do you know what I'm talking about? That little bit of sadness?  I thought the person that wrote that note had an answer for me. For why I survived that train. For why my life feels so out of balance...  But I guess that's what you were counting on.  Elijah stares carefully at David. Beat. David glances over to the entrance. Jeremy watched through the window concerned.   I'm going to leave now.  Good luck with your sale.  Elijah watches David walk towards the front door.   I work at the stadium as a security guard.  Beat. David closes the door behind him. Elijah watches through the window as Jeremy takes David's hand as they cross the street.  Elijah gazes out the window in a bit of a daze.    David sits up in bed staring at a torn section of newspaper in his hands.  Jeremy is asleep horizontally with his legs over David's legs.  David doesn't blink as he gazes at the headline silently...   Hi.  Megan nods. Beat.   Oh.  Beat.   What's he look like?   Send him packing. I'm not walking all the way over there.   Hold up Jenkins...   It's for last week's game.   What do you want?   We're not proceeding anywhere together.   One more time. What is it you want?  Beat.   Are you for real?   I got this job because my college coach called the guy who manages the stadium. There's no hidden meaning to it.  David's walkie makes NOIES on his hip.   They need me at the gate.  David stares at Elijah leaning on his walking stick.   Did you really want to see the game? I can get you in.   It gets heaviest ten minutes before kickoff.  David bumps a guy in line wearing an army jacket. David looks backs at him and continues walking.  David moves to a security guard near the turnstiles.   Why don't we pat down?  David walks to his post near the gate and faces the crowd. Elijah moves next to him.   Just give me a minute.   That guy in green. Sometimes people carry weapons in here. Then they drink too much. They're team isn't doing so well, bad things happen... We do random pat downs of the crowd to discourage people from carrying.  If he's carrying, he'll step out of line.  Elijah observes as a security team pats down random males as they move through the turnstiles.  The GREEN ARMY JACKETED MAN moves forward in the line. His face is blank as he watches the pat down ahead of him. He's twenty people from the turnsstile.  David eyes him. Fifteen people away... Ten...  The man coughs and steps out of the line. Elijah watches the green army jacket melt into the thick part of the crowd and disappear as it moves away from the stadium.   I got you a seat in the seven hundred level.  It's nose-bleed territory, but at least you won't get spit on.   Probably the army jacket. Those guys carry hunting knives and stuff for show.   I thought he was carrying something.   I got this picture of a silver handled gun tucked in his pants.  Like on t.v.  Elijah stares at David. THE STADIUM CHEERS BOUNCE OFF THE GRAY WALLS.   Like what?   Yes.   I don't know what you're asking?   Listen. I got to be on the sidelines during the game... You can get to your seat by taking the stairwell at-   Okay, I don't want to play this game anymore.   The guy might not have been carrying anything.   I have to go now.   Quick.   Yes. My wife Megan. She was in the car with me.  David turns and starts down the hall. David talks back over his shoulder.   Have a good life Elijah and try to buy your tickets at an authorized sales location.  Elijah watches as the silhouetted figure of David Dunne jogs down the darkness of the tunnel.   You know how mad your mom would be if she knew you were playing football?  Jeremy nods.   In under six seconds.  I've heard.  David watches the cornerback being surrounded by kids. He's letting a couple of the kids feel his flexed bicep.   I'm going to go in.   Why'd you do that?   Jeremy.  I'm going in. I have to do some things.   I'm going to work out.   There's nothing to do.  Jeremy turns back to the children and waves.   Why don't you rest now? I'll take it from here. You've been a big help.  Jeremy goes to the opposite side of the bar and starts to put on another weight.   No.   No.   No.  David takes hold of the barbell. Beat. He takes a deep breath.  The weight comes off the armrests of the bench. David lowers it to his chest and pushes it back up. He does just one more rep with serious strain. He puts the weight back on the armrest and sits up.   How much did you put on there?  David twists around and looks back at the barbell. He counts up the black metal circles. He turns back to Jeremy.   You put too much. That's two hundred and fifty pounds.   That's the most I've ever lifted.  That could have been dangerous Jeremy. Why don't you go upstairs and let me finish up?  Jeremy starts back to the barbell.   No.   No Jeremy.   No.  David takes hold of the bar. Lifts it off the armrest. Brings it down. His arms are straining hard again. He raises it and lowers it two time; it takes a sizable effort. The weights bang down onto the armrest.  David sits up.   How much did you take off?   You added?  Jeremy nods, \"Yes\" slowly.  David turns completely around and looks at the barbell. He counts the black discs on the steel bar. Beat.  Nobody says anything for a long time.   Two hundred and seventy.  David just stares at the black steel circles on the metal bar. Jeremy comes and sits on the bench next to his father. They both stare at the weight. Beat.   Okay.   Why don't you move back a bit? Just to be safe.  Jeremy moves back to the bottom of the stairs leading up to the house. He waits.  Another deep breath as David heaves. The weight CLINKS as it comes off the arm rest. David is full out straining now as he lowers and raises it. His arms begin to tremble as he lifts it for the second time. BANG the weight lands back safely onto the rest.  David sits up. He looks at his son whose eyes are wide. Beat.   You should never try anything like this. You know that right?  Jeremy nods, \"Yes.\"   What do you do if something happens?   How many did you put on that time?   There's no more left?  Jeremy nods, \"no\" in a slight daze. Beat. David looks around his basement.   What else can we use?   About three hundred and forty.  David turns and looks at his son. Jeremy's mouth is slightly open. He gazes at his dad. Awe in his tiny eyes.   Yeah, hello.   Megan?   Yeah? Megan where are you calling from?   I remember you.   Yeah it might be nice.  We hear A SOUND ON THE OTHER END OF THE PHONE. A SOUND MUCH LIKE AN EXHALE.   ...When you work with clients on machines, do they sometimes just jump up a level or two? Do something they didn't know they were capable of?   What do I do when I'm around someone I know?   Hello.  CLAIRE smiles as she stares at David. She turns to Megan.   David.   Okay.  David is not paying attention to the girl. He watches as his wife takes off her coat and heads to the guest room. She turns before entering the room. David and his wife make eye contact.   Thank you.  David opens the front door for her.   His room?  The baby sitter nods with a smile as she walks out the front door.   I see.   That's great.   Know what?   Jeremy.  Jeremy opens his eyes.   There are big guys in almost every gym who can lift that much.  Beat. Jeremy's eyes start to shut.   Four ten... four forty-five...  Five hundred.  Beat. David sits up in a daze.  He finds the entire room of athletes and trainers staring at him. Some of the players have stood up. Everyone stares as David Dunne with the same quiet disbelief in their eyes.   We've had some problems with drug selling in this stadium.  Would you mind if I checked the pockets of your sweatshirt?  The gray eyed man stands eerily still with his nachos and drinks. The two men just stare at each other, evaluating the situation. People move in both directions around them, unaware.  The gray eyes man holds his tray of food to the side and raises his arms slowly.  David steps forward and reaches into his pockets. Beat. David pulls his hands out from the pockets. They're empty.  The gray eyes man brings his arms down. Beat.  The walkie on David's hip COMES TO LIFE. David reaches down and pulls it off his belt without removing his eyes from the man in front of him. David brings the walkie to his mouth.   Yeah?   When?   Megan handles that type of stuff.   Jeremy's stuff.  David feels uncomfortable as the nurse just stares at him. Beat. David rises from his seat.   So do I need to put any smelly ointments on him or anything?  The white haired nurse nods, \"no.\"   What was that?   Yes I am.   You are like me. We both can get hurt. I'm just an ordinary man.  I'm not what you think I am.  Jeremy just stares at his father. Beat.   He's dealing with a lot of things.  I think he needs to find answers himself.  Beat.   Would you like to try going-   -out again.  Beat. David smiles.   But if we see another mother from Jeremy's school, me name is Juan. I always wanted to be a Juan.  Megan smiles softly back. Beat.   Jesus.  Megan sees David's shocked expression.   Jeremy what the hell are you doing?  Megan suddenly realizes David is looking over her shoulder.  Megan turns around. She SCREAMS.  Jeremy is standing in the doorway to the kitchen. He's crying hard. In his outstretched hands is the HAND GUN FROM DAVID'S CLOSET. It's pointed directly at David.   -Jeremy did you load that gun?  Jeremy nods, \"Yes.\" Crying harder now.   -Elijah was wrong.   -You know the story about the kid who almost drowned in the pool?  Jeremy stops moving.   -That was me they were talking about. I almost died. That was me.   -I'm not. I just didn't connect it.   -Jeremy listen to what-  Jeremy starts pressing the trigger. The hammer clicks back.   -Jeremy if you pull that trigger I'm going to leave! I'm going to go to New York.  Jeremy freezes. David flashes a desperate glance at Megan then back to Jeremy.   You're right... If you shoot me, that bullet is going to bounce off me and I won't get hurt... but then I'm going to go upstairs and pack. And then leave to New York.  Beat.   Jeremy!  Jeremy's eyes open.   You're about to get into big trouble! I'm your father and I'm telling you to put that gun down right now God damn it!  One!...  Two!...  Jeremy puts the gun down on the floor in front of him and stands up.  Megan leans against the refrigerator and slides down to a sitting position on the tiled floor.  David walks over and picks up the gun. He unloads the bullets in his hand. David bends down very slowly and takes a seat on the kitchen floor.  Jeremy is the last to sit down. He takes a seat in the doorway of the kitchen. Beat. He wipes his eyes with the back of his hand. Beat.   I must have felt some lump in his back when I bumped him. Most guns have a black or silver handle. I had a fifty-fifty shot at the color.   Stop messing with my life Elijah. My son almost shot me last night. He wanted to prove you were right.   You have a problem, Elijah. My wife is right. Somewhere along the line one of your bones broke and your mind just broke with it.  Beat.   No. And I have been sick. I spent a week in a hospital when I was a boy recovering from pneumonia and almost drowning.   Two skinny eight year old kids were playing around the pool. They were dunking me. I swallowed water. They didn't know it and they almost killed me.  Heroes don't get killed like that. Normal people do.  Beat. Elijah seems shaken for the first time. David stares at him coldly.   I don't want to see you again okay.  Now I'm finished.  David turns and starts for the entrance. The BELL OF THE DOOR CLANGS as David Dunne leaves the store.   But I put cologne on.  Megan smiles.   ...I think rust.   As a color, not as rust. You know, a rust colored paint or wood?  Megan leans slightly closer.   My turn. What's your favorite song?   What was that?   Soft and Wet. That's very interesting.   That's not the game.  Megan moves her stool closer. They're only a foot or so apart.   I'm not sure.   What about the game?   I had a nightmare one night and I didn't wake you up so you could tell me it was okay.  I think that was the first time.  Does that count?   Yes.  Megan's face tenses. She's on the verge of getting upset.   I don't know Megan.   I know.  Husband and wife sit close together in the corner of the bar on their second date.   Who called through?  Megan tries to hide her smile.   Megan...  She doesn't answer. Her body is twitching as it sits pinned behind the wheel.  David pulls at the handle of the mangled door. It's wedged tight. It won't move.  The heat from the fire is tremendous.  David's powerful arms keep pulling with all their strength.   Megan?  He just stares at her. She doesn't respond.  A LIGHT WASHES OVER THEM. David turns to see a truck approaching up the road. David waves frantically. The truck slows.  David turns back to Megan. Her eyes are open.  Tears fall from David's face as he moves the hair out of her eyes. She looks at David.   Me too.  The driver of the truck slips and slides his way over to David.   I think her leg is fractured.   My shoulder's hurt.  The driver nods.   Elijah?  Beat.   What am I supposed to do?  Elijah closes his eyes. His face fills with strength.   You need to leave now.   Where is he?  The woman doesn't answer, but a SOUND COMES FROM THE SCREEN DOOR nearby. The curtains draping the screen door move with the wind from outside.  David crosses the room and pushes aside the curtain. It leads to a small balcony. An empty lawn chair is the only thing on it.  David steps onto the balcony and looks down.  The rain still pours down unmercifully. It comes down on a black tarp that covers a pool in the backyard.  David turns to go back inside.   It's over now.  Your children are fine. They're getting help.  He unties her wrists. Her arms stay above her head where they were.   I'm going to go now.  He stares at the woman whose eyes stare blankly at him. She sits unnaturally still against the door with her arms above her head. The mascara that has run down her face and dried, has tracks where countless tears have rolled down.  David moves his hand near her mouth and nose. He checks for the feeling of breath against his hand. Beat.  He rises up. Removes his hood. David Dunne stands silently in the master bedroom of someone's house and gazes at the dead woman frozen in a slumped position against her bathroom door.    David sits on the edge of the empty bed in the darkness of his room.  He doesn't makes a sound. He doesn't move an inch. He is so still, he seems to disappear into the shadows of the room.   I had a bad dream.  David tucks his head in close to hers and closes his eyes.  Megan lays stunned in her husband's arms. Beat.   He doesn't look very threatening.   Are you Elijah's mother?  The woman turns and looks at David for the first time.   It's a pleasure to meet you. I'm David Dunne.   We are.  David looks across the store at Elijah talking with the customers.   He's doing well today.   He's kind of a miracle.",
        "Kelly": "I'm married.   Sorry.   I'm going to find another seat.  Kelly gets up. She balances herself against a headrest as the train rumbles. She starts to the back of the car.  David sits alone. He looks like he's drowning, but there's no water.  He feels a stare. He glances up. The little girl spies on him from between the seats.  David leans towards the window to avoid eye contact. His hand reaches into his coat and slides out his wedding band. He puts it back on.  His temple touches the glass. The vibration of the train begins to lull his eyes closed... Beat.  David's head bounces lightly against the window.  The shaking of the glass never allows David's eyes to completely close.  He sits up when he realizes the shaking is getting stronger.  He looks out the window. The scenery blurs as it flies by. Beat.  David turns. Some of the other passengers start to react as they realize the train is picking up speed.  The normal bumps of the tracks become amplified.  The WORRIED VOICES OF THE TRAVELERS START FILL THE CABIN.  The train goes faster.",
        "Dr.": "You okay?  The woman nods, \"Yes.\" Sweat trickles down her face. THE BABY'S PIERCING CRIES  Is there a name yet?  Beat. The woman smiles for the first time.   What happened during the delivery?  His hard stare unsettles the women. The OLDER SALESWOMAN speaks up.   Did you drop him?  Everyone becomes very still. The mother looks like she stopped breathing. THE  Did you drop this baby?  Beat.   Please inform the ambulance we have a situation...  Dr. Mathison turns back to the mother. Beat.   I've never seen this... It appears your infant sustained some fractures while in your uterus.  His arms and legs are broken.",
        "Mathison": "You okay?  The woman nods, \"Yes.\" Sweat trickles down her face. THE BABY'S PIERCING CRIES  Is there a name yet?  Beat. The woman smiles for the first time.   What happened during the delivery?  His hard stare unsettles the women. The OLDER SALESWOMAN speaks up.   Did you drop him?  Everyone becomes very still. The mother looks like she stopped breathing. THE  Did you drop this baby?  Beat.   Please inform the ambulance we have a situation...  Dr. Mathison turns back to the mother. Beat.   I've never seen this... It appears your infant sustained some fractures while in your uterus.  His arms and legs are broken.",
        "Elijah": "I won't get hurt momma! I'm safe!    The ride spins its passengers. Elijah's small face looks up at the swirling clouds in a mixture of agony and terror.  The ride changes directions.  Elijah is thrust forward. He hits the rusted metal bar square against his chest.  No more sitting in this room. I've let it go on long enough.   I'm not going out anymore. I'm not getting hurt again. This was the last time. I told you.   You can't do anything about that. You might fall between that chair and this television. If that's what God has planned for you, that's what's going to happen. You can't hide from it in your room.  Elijah just sits staring at the dark television screen.   They call me Mr. Glass at school. Cause I break like glass.  Elijah's face is tense. Unyielding. Beat.  Elijah's mother says the next words in almost a whisper.   ...You make this decision now to be afraid...  And you'll never turn back your whole life. You'll always be afraid.  Elijah's eyes move from the television to his mother. He sees the emotion in her face. Neither says anything for a while. Beat.   ...I got a present for you.   Why?   Forget why. Do you want it or not?  Elijah thinks it over. He nods, \"Yes.\"   Well, go get it then.   Where is it?   On a bench, across the street.  Elijah looks at his mother with disbelief.   You calling me a liar?  She points to the window. Beat. Elijah gets up and moves to the only window in the room.  The view from his room looks out over a narrow street. On the other side of the street is a public playground. A handful of children are playing on it.  There are three benches to one side of the swings. On one of them is a THIN PACKAGE wrapped in brown paper with a bow on it.  Elijah looks to his mom who has joined him at the window.   Someone's gonna take it.  Beat.   Then you better get out there soon.   I bought a whole bunch. They'll be one of these waiting for you, every time you want to come out here.  Beat.   They said this one has a surprise ending.  Elijah looks to his mother. His intelligent piercing eyes take her in for a moment.  He looks back down at his lap. He opens the first page...   It's a classic depiction of good versus evil. Notice the square jaw of Slayer - common in most comic book heroes. And the slightly disproportionate size of Jaguaro's body to his head. This again is common, but only in villains... The thing to notice about this piece... The thing that makes it very, very special... is its realistic depiction of its figures. When the characters eventually made it into the magazine they were exaggerated... as always happens.  This is vintage.  The business man rubs his face. Gazes at the sketch. Beat.   You've made a considerably wise decision.  Elijah starts to the back of the store which we now see is some type of art gallery where all the framed pictures are images and sketches from comic books.   Once again please?   How old is Jeb?   No.  Elijah starts back to the businessman shaking his head strongly.   No, no, no, no no... You need to go now.   Do you see any Telletubbies around here?... Do you see a slender plastic tag clipped to my shirt with my name printed on it?... Do you see a little Asian child with a blank expression sitting outside in a mechanical helicopter that shakes when you put a quarter in it?... No?... Well that's what you see at a toy store? Any you must think this is a toy store, cause you're in here shopping for an infant named Jeb. One of us has made a gross error and wasted the other person's valuable time...  Elijah's eyes pierce through the shaken man.   This is an art gallery my friend. This is piece of art...  Elijah points at the sketch.   This is one of seventeen original drawings by Fritz Champion remaining in the world. It's value will triple every year... This piece is to be treasured. To be cherished... To be coveted by every single one of your banker friends that think they're better than you.  The business man stares at the sketch with large eyes. Beat.   I'm listening.   What about Jeb?   Will it be near a window?   Come back in three days. I'll think about it.  Elijah starts to the back. He passes the front door as two customers walk in. Elijah talks over his shoulder to them.   We're by appointment only.   Congratulations, you have a mailbox... The sale isn't for two weeks.   You've never been sick?   Well if this ain't a riddle worthy of the Riddler?   So let's get some of the usual questions out of the way. Why am I using a cane? Raise your hand if you were thinking that.  Jeremy raises his hand.   I fractured my leg. It's the fifth time I've done that particular bone. It didn't really heal well this time.   Raise your hand is you're wondering who the hell breaks the same bone five times?  Jeremy and David raise their hands.   I have something called Osteogenesis Imperfecta. It's a genetic disorder. I don't make this particular type of protein very well and it makes my bones very low in density, very easy to break. I've had fifty-four breaks in my life. I have the tamest version of the disorder... Type one.  There are type two, type three, and type four. Type four's don't make it very long...  That ends our lecture on the medical anomaly known as Elijah Price.  Elijah stares at his two rapt listeners.   How certain are you that you haven't been sick in your life?   Seventy-five percent? That's not nearly good enough for me. I'm extremely skeptical.   Your answer to my question. It's one thing to have never been injured in your life, but to state that you've never taken ill, well that's a whole new level.   What's he talking about?   Was it serious?  David nods.   I assumed because of the train.   It's over.  You can go now.  Elijah uses his cane to get up and walk back through the doors of the store.   The life of an idea that has lived too long in my head.  David stares at Elijah impatiently.   There are probably only four or five individuals in the world who can claim more knowledge of comics than myself. I've spent a third of my life in a hospital bed with nothing else to do but read. I have studied the form intimately. I have seen the patterns in them... The references to social and cultural events and the atmosphere that surrounded them. I've come to believe that comics are our last link to the ancient way of passing on history.   The Egyptians drew pictures on walls about battles, and events. Countries all around the world still pass on knowledge through pictorial forms.  I believe that comics, just at their core now... have a truth. They are depicting what someone, somewhere felt or experienced. Then of course that core got chewed up in the commercial machine and gets jazzed up, made titillating - cartooned for the sale rack.  Elijah gazes at David.   This city has had its share of disasters. Well publicized ones. It was around the time of that plane crash, when it first entered my head. And there it stayed, as I waited and watched the news over the years...  And then one day I see a news report on a train accident and its sole survivor who was miraculously unharmed.  And just like that, an idea blossoms into the flower of possible reality.   If there is someone like me in the world, and I'm at one end of the spectrum... Couldn't there be someone the opposite of me, at the other end?  A person who can't be hurt like the rest of us. A kind of person they were talking about in those stories.  Elijah points at the framed comic sketches.   A person they believed was put here to protect the rest of us. Guard us.   Technically no. I gambled that you would attend the church service. I just waited for you.  David glares at Elijah.   You've misunderstood.   What type of job do you have David?  David opens the door. He looks back at Elijah.   You mentioned you've met 'guys like me' in your work.  What type of job would that be?  Beat.   They said I couldn't get in with my ticket.  Elijah offers him the ticket. David inspects it.   I've come to understand that...  An ill advised purchase in the parking lot.  David hands Elijah back the ticket.   Not money.  But I appreciate your healthy cynicism in the manner. It will be wise for both of us to proceed with greatest caution.   We've already begun.  David looks around.   Why is it, do you think, that of all the professions in the world... you chose protection?   You could have poured coffee in Starbucks, you could have learned to install track lighting in office buildings, you could have told people their horoscopes on the internet... You could have been one of ten thousand things... but in the end, you chose to protect people. You made that decision... and I find that very, very interesting.  Now all I need is your credit card number.  Beat. Elijah smiles.   That last part was a joke.  David fights it. But he smiles anyway. Beat.   Is there a problem?   How did you know that man you bumped was carrying a weapon?   You thought he was carrying a knife?  Beat.   But not a knife?   You have good instincts when it comes to things like that?   Telling when people have done something wrong?  Beat.   Have you ever tried to develop it?   You're skill.  Beat.   Characters in comic books are often attributed special powers. X-ray vision, things of that sort.  David exhales slowly as he stares at Elijah.   It's an exaggeration of the truth. Maybe it's based on something as simple as instinct. Like being able to touch someone and tell whether they've done something wrong... Or the level of what they've done wrong.   Or he might have been carrying a silver handled gun tucked in his pants.  David's WALKIE ERUPTS WITH NOISE.   One last question.  Beat.   The car accident you were in... Was there anyone else involved?  The two men stand very still in the tunnel.   Hold up for a second!  The man in the army jacket turns as he reaches a subway entrance that marks the end of the parking lot. He looks back at Elijah for a beat. Doesn't like what he sees. He disappears into the subway entrance.  Elijah quickens into a jog now. He hasn't done this in a while and it's painful. He makes it with great strain to the subway.  He looks into the entrance...  A steep flight of stairs leads to the subway floor. The tail of the army jacket is glimpsed before it disappears.  Elijah breathes hard as he takes hold of the railing.   I just want to ask you something!  Elijah's VOICE ECHOES down the stairs. No response.  Elijah starts his descent.   They call me Mr. Glass.  Beat.   Kids.  Elijah just keeps staring.   How long have you been married?  Megan is taken off guard by the question. She stares at Elijah. Beat.   How did you get together?  Elijah smiles warmly. Megan smiles softly back.   Now you're going to have to tell me more.   How so?   You and my mother would have a special connection.   ...And everyone lived happily ever after.  Beat.   What part of David's body was injured?  Beat. Megan's eyes become utterly still.   There have been three major disasters in this city over the last four years. I've followed each one of them... A Seven-three-seven crashes on take off. One hundred and seventy-two die. No survivors... A hotel fire downtown. Two hundred and eleven die. No survivors... And am Amtrak train derails seven and half miles outside of the city. One hundred and thirty one die. One survivor. He is unharmed.  I've spoken with your husband about his survival. I suggested a rather unbelievable explanation. Since then, I've come to believe, that my explanation, however unbelievable, is in fact, true.   It's a mediocre time Mrs. Dunne. People are starting to lose hope. It's hard for many to believe that extraordinary things live inside themselves as well as others... I hope you can keep an open mind?  Beat.   I own a comic book museum. It's called the Limited Edition.   I believe comic books are based loosely on reality - I believe there are real life equivalents of the heroes in those books that walk the earth - I believe your husband is one of those individuals.  Beat. Megan becomes utterly still.   I'm glad you brought up fate Mrs. Dunne. I'm becoming a strong believer in it... See, David refuses to speak with me any longer... And when I saw your name on my insurance list of approved physical therapists... It was like fate had intervened...  We were meant to speak to each other.   Joined a rugby league. Turned out to be a bad idea.  Come here I want to show you something.  Elijah wheels over to one of the framed sketches on the wall. It's a charcoal drawing of a muscular figure shielding himself from a blow about to be delivered. A huge ominous shadow is covering him, as if something unspeakable and evil is just out of frame.   Look at this. I just noticed this today.  David steps in close and studies the drawing.   This is from the Sentryman series. A color version of this was actually used in the second issue.  Elijah points up to the drawing's face.   Look at this eyes. What do you see?  David looks right at the intense eyes of the drawing.   It's fear.  He was scared. They were being honest in the beginning you see. They let him be human.  They turned him into a garden variety hero later... Then he was brave all the time.  Elijah turns to David.   I followed the guy in the army jacket.  David becomes still as his words register.   He had a silver handled gun tucked in the back of his pants.  Were you really injured in that car accident in college?  David looks unsteady all of the sudden.   Because I think you faked it. I think you took the opportunity to end your career - no questions asked.  And I think you did it, of all things, for a women...  Not only do you have the physical traits of a hero, down somewhere in there, you have the moral code of one too. You were ready to sacrifice everything for what's right. Where can you find that these days?  Only thing you didn't realize is that you were giving up a part of yourself when you gave up football. The physical part. And you need that part desperately to feel balance again...  You can have it back now.  This was all just make believe before. What if there was someone the opposite of me? What if?...  I now believe you are the genuine article Mr. David Dunne. The kind of person we knew existed, from our history.  Elijah points to the room full of pictures.   It's time for someone like you.  Bad is winning. I can feel it.  Elijah looks at David with deep admiration. His voice cracked a little at the end of his words. Beat.  David doesn't take his hands out of his pockets.   That's not what I witnessed David.   I never said you couldn't be killed. I never said that.   Are you finished?   How much is this one?     ...David. It's Elijah. It was so obvious. It's referred to over and over. That's the key you see. The repetition across time. That means at some point it was all based on common thought, a common event - a fact.  It was this one issue that brought it back for me... Century Comics One-Seventeen. That's where this group, the Coalition of Evil, tried to ascertain the weakness of every superhero.   ...Because they all have one.  Just like you.  The cells that make up your muscles and your bones react to forces that act upon it, slightly different from than mine. That's clear... Your cells react to bacteria and viruses slightly differently than mine... That's also clear...But for some reason, you and I react the exact same way to water. We swallow it, we choke. We swallow too much of it, we drown. However unreal it may seem, we are connected, you and I, we are on the same curve... just on opposite ends.   The point of all this is, we now know something we didn't... You have a weakness... Water. It's your krpytonite.  You hearing me David? Call me back... I got rugby practice in an hour.    Hello.   David?  Nothing is said on the other line for a couple of beats. WE HEAR THE ECHOED DIN  David, it's okay to be afraid. Because this part won't be like a comic book... Real life doesn't fit into little boxes that were drawn for it.  David stands in a quiet corner and watches the faces of passengers arriving and departing late night trains. Even at the late hour, there is heavy traffic throughout the station.   Go to where people are... You won't have to look very long.  David stares out at the midnight travelers. Beat. He starts towards them.  He passed the towering black statue standing at the far end of the station. It watches over the whole building. It's in the form of an angel lifting a soldier to heaven.  David moves through the first group of people - a crisscross of arriving passengers from tracks one and two. They brush by him and lightly bump him as they move.   I am. I'm helping him with the sale.   He's spoken of you. He says you're becoming friends.   I'm very proud of him.  He's been through a lot in his life. A lot of ups and downs, a lot of bad spells. A couple I'd thought had broken him... I mean emotionally.  They were bad... But he made it. Yes he did.   Yes he is.  They both watch Elijah from across the room.   I'll tell him you're here.  David watches as Elijah's mother walks across the store and waits for Elijah to finish talking.  David turns back to the framed sketch. He looks at it with his hands in his pockets. Beat.  David's stare turns into a gaze. His gaze turns into stillness.  THE SKETCH is of a withered man with large tense eyes. He sits in the shadows. He's seated in some type of machine. There are lots of buttons and levers on the machine. The machine has wheels.  David turns from the sketch. He looks across the room to Elijah seated in his wheelchair. Elijah's large eyes stay focused on the customer's as he finishes negotiating.  David turns back to the sketch. He looks at it with growing confusion. The more you look at drawing, the more the machine the man is seated in looks like a wheelchair.  David looks back across the store. Elijah and his mother are talking. Elijah has spotted David.  Beat. Elijah starts across the crowded store towards David. He wheels up to him.   Did you see this?  Elijah has a newspaper on his lap. He holds it up.  There's a drawing on the front page. It's a hooded figure shielding two huddled children behind him.   It has begun.  David stares quietly at the sketch of himself.   When I saw it this morning. I felt a part of the world again.  Elijah looks down at the newspaper.  David hesitates and then reaches forward.  He reaches past the paper... And TOUCHES ELIJAH'S ARM.    A plane just crashed.     Secrets?      I almost gave up hope. There were so many times I questioned myself. I've made so many sacrifices but it's all been worth it.  There are millions and millions or mediocre people in the world David. Isn't it great that we aren't one of them?  David looks like he stopped breathing as he backs up in the store.  Customers step between him and Elijah. Elijah becomes obscured and then blocked from view.",
        "Price": ""
    },
    "imdb_rating": "7.3",
    "description": "David Dunn (Willis) is taking a train from New York City back home to Philadelphia after a job interview that didn't go well when his car jumps the tracks and collides with an oncoming engine, with David the only survivor among the 131 passengers on board. Astoundingly, David is not only alive, he hardly seems to have been touched. As David wonders what has happened to him and why he was able to walk away, he encounters a mysterious stranger, Elijah Prince (Samuel L. Jackson), who explains to David that there are a certain number of people who are \"unbreakable\" -- they have remarkable endurance and courage, a predisposition toward dangerous behavior, and feel invincible but also have strange premonitions of terrible events. Is David \"unbreakable\"? And if he is, what are the physical and psychological ramifications of this knowledge?",
    "name": "Unbreakable",
    "genres": [
        "Drama",
        "Mystery",
        "Sci-Fi"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMDIwMjAxNzktNmEzYS00ZDY5LWEyZjktM2Y0MmUzZDkyYmZkXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}