{
    "filename": "V-for-Vendetta_script.txt",
    "imdb_id": "tt0434409",
    "imdb_url": "https://www.imdb.com/title/tt0434409",
    "characters": [
        "Guy Fawkes Lover (as Emma Field Rayner)",
        "Delia Surridge",
        "Valerie",
        "Deitrich",
        "Lilliman",
        "Guy Fawkes",
        "Evey",
        "Dascomb",
        "Finch",
        "Creedy",
        "Lewis Prothero",
        "Adam Sutler",
        "V",
        "Dominic",
        "Etheridge"
    ],
    "dialogues": {
        "Delia": "Do you have a motive?  I mean, was anything taken?  Well...  He's incredibly powerful.  This man's sternum was split like dry wood from the base all the way up to the manubrium.  And he's resourceful.  On that table behind you is a breakdown of all the chemicals found in Prothero's blood stream.  There were hundreds of different chemicals in him.  From trinitrotoluene to estrogen to motor oil.  The Leader finally authorized an uplink for you?  He must be getting nervous.  Yes -- Yes, of course.   Dr. Surridge sits somberly in the dark, street light filtering in from the open curtains.  Her eyes fixed on the violet carson as she slowly turns it over in her hands, fingers tracing the soft petals.  After a moment, she stands, letting it fall from her lap.    The covers pulled protectively up around her, Delia rests in a light, uneasy sleep.  Suddenly, an eye pops open as she awakens, catching a familiar scent.  She slowly sits up and inhales.   Roses.  It's you, isn't it?  You've come to kill me.  Oh thank god.  Thank god.   V floats on the edge of the room's shadows, a dark angel.   No, no.  I thought I would be, but I'm not.  I'm --  Relieved.  Oh god, all these years.  All this waiting.  And somehow I always knew you'd come back.  When I saw you that night -- the night you escaped, you were standing against the flames and you looked straight at me.  I knew then that one day you'd come looking for me, that you'd find me.  What -- what happened at Larkhill. What we did -- What I did.  That terrible knowledge, it's been with me so long.  That I could do things like that.  For years, I blamed it on the government, on the authority I could never stand up to.  But living so long with the knowledge of what I did has made me understand otherwise.  I alone was accountable.  There is something wrong with us. With all of mankind.  With me. Something evil that made me enjoy what I did.  Some hideous flaw.  We deserve to be culled.  We deserve it.   V hovers ghostly at Delia's bedside.   It's funny, I was given one of your roses today.  I wasn't sure you were the terrorist until I saw it.  What a strange coincidence.  That I should be given it today.  Then you are going to kill me now?  Is there any pain?  Thank you.  Can I -- Can I see your face again?  It's beautiful...   Finch's car bucks up onto the sidewalk.  Finch and Dominic tear out of the car and barrel into the house.    At the top of the stairs, they find the dead Derek.  Finch rushes past him for the bedroom.    Evey rushes around a corner to see a crime scene bathed in siren light.  She pushes up to the police barricade as the M.E.'s load a draped body into their van.    From the corner of the room, Finch sits, watching as the M.E.'s wheel out Delia's body.  Dominic squeezes past the gurney and crosses toward Finch.   May 23rd...  Prothero has hand picked my subjects.  Four dozen of them, none of which will be any use to me if I don't get to work soon.  They're so weak and pathetic I find myself hating them.  They don't fight or struggle.  Just stare at you with weak eyes.  June 9th: Of the original four dozen, over 75% are now deceased. Strangely, no clear patterns have emerged as of yet.  Batch 5 seems to have no common discernible effect on any specific group though the men seem slightly more resilient than the women.  I'm hoping the survivors will provide more answers or my time here will have gone to waste.  June 18: And only five left now. Two men and three women.  Which tends to contradict my entry on the 9th.  The man in room five is a fascinating case.  Physically, there doesn't seem to be anything wrong with him.  No cellular anomalies, nothing.  Batch five, however, seems to have brought on some kind of psychotic breakdown.  He's quite insane.  He has this way of looking through you.  Reverend Lilliman won't go near him.  He claims that it is the devil in room five.  I see him cross himself whenever he passes his door.  Still, there's something about him...  I'm glad Prothero let room five have a go at the gardening project. He is quite proficient.  Prothero was reluctant to allow an inmate access to the tool and chemical supply at first but now the fat toad is delighted.  The crop has almost doubled.  He also grows roses.  Beautiful roses.  December 24th: I was in the mess. It was about half past ten when we heard the first explosion.  The ones at the front ran straight into the gas.  It was horrible.  A few of us made it out through the rear door.  You could hear men screaming everywhere.  I hate the sound of men screaming.  In the center of the camp, everything was on fire.  Everyone running in all directions.  We had hardly enough time to get our bearings when the ovens exploded.  It was the man in room rive.  I couldn't have known.  The chemical supplies, grease solvents, ammonia, fertilizer.  He'd been making things with them.  Mustard gas...  And napalm.  And in the yard, I saw him.  He had the flames behind him.  He was naked.  He looked at me...  As if I were an insect.  Oh god. As if I were something mounted on a slide.  He looked at me.",
        "Surridge": "Dr. Surridge sits somberly in the dark, street light filtering in from the open curtains.  Her eyes fixed on the violet carson as she slowly turns it over in her hands, fingers tracing the soft petals.  After a moment, she stands, letting it fall from her lap.    The covers pulled protectively up around her, Delia rests in a light, uneasy sleep.  Suddenly, an eye pops open as she awakens, catching a familiar scent.  She slowly sits up and inhales.    V floats on the edge of the room's shadows, a dark angel.    V hovers ghostly at Delia's bedside.    Finch's car bucks up onto the sidewalk.  Finch and Dominic tear out of the car and barrel into the house.    At the top of the stairs, they find the dead Derek.  Finch rushes past him for the bedroom.    Evey rushes around a corner to see a crime scene bathed in siren light.  She pushes up to the police barricade as the M.E.'s load a draped body into their van.    From the corner of the room, Finch sits, watching as the M.E.'s wheel out Delia's body.  Dominic squeezes past the gurney and crosses toward Finch.",
        "Valerie": "I was born in a rainy burg in Nottingham in 1975.  I passed my eleven plus and went to girl's grammar.  I met my first girlfriend at school.  Her name was Sara.  Her wrists.  Her wrists were beautiful.  I sat in biology class staring at the pickled rabbit fetus while Mr. Herd said it was an adolescent phase that people outgrew.  Sara did.  I didn't.  In 1994, I stopped pretending and took a girl called Christine home to meet my parents.  A week later I moved to London to go to college and study drama.  My mother said I broke her heart.  But it was my integrity that was important.  Is that so selfish?  It sells for so little but it's all we have left in this place...  It is the very last inch of us...  But within that inch we are free.  London.  I was happy in London.  I played Dandini in Cinderella.  The world was strange and rustling with invisible crowds behind the hot lights and all that breathless glamour.  Work improved.  I got small film roles, then bigger ones.  In 2006, I starred in \"The Salt Flats.\"  That's where I met Ruth. We fell in love.  Every Valentine's Day she sent me roses and, oh god, we had so much. Those were the best three years of my life.  In 2010, they came.  And after that there were no more roses...  Not for anybody.  After the takeover, they started rounding up the gays.  They took Ruth while she was out looking for food.  Why are they so frightened of us?  They burned her face with cigarettes and made her give them my name.  She signed a statement saying I'd seduced her.  I didn't blame her.  God, I loved her but I didn't blame her.  But she did.  She killed herself in her cell. She couldn't live with betraying me, with giving up that last inch. Oh, Ruth.  They came for me.  They shaved off my hair.  They held my head down a toilet and told lesbian jokes. They brought me here and pumped me full of chemicals.  I can't feel my tongue.  I can't speak.  It is strange that my life should end in such a terrible place but for three years I had roses and apologized to nobody.  I shall die here.  Every inch of me shall perish...  Except one.  An inch.  It is small and fragile and it's the only thing in the world that's worth having.  We must never lose it or sell it or give it away.  We must never let them take it from us.  I don't know who you are but I hope you escape this place.  I hope that the world turns and things get better and that one day people have roses again.  I don't know who you are but I love you.  I love you.  Valerie.   It is a shrine.  The walls are covered with movie posters and reviews and pictures of an actresses named Valerie Page.  We recognize her as the woman chosen for the medical block just before V.  Everywhere there are flower boxes filled with blooming roses; violet carsons.",
        "Deitrich": "",
        "Lilliman": "Ah, there they go.  My happy and contented flock.  Spiritually refreshed and ready to face the world again.  Did you enjoy the sermon today, Dennis?  Hmm, yes.  A trifle purple, I thought.  Still, Fate wanted it included and who are we to question the will of the almighty, miserable sinners that we are?  And speaking of sin, I wonder which of the seven deadlies the good lord will see fit to tempt me with today.  I was thinking of something a little less ethereal.  Has the young lady arrived?  Oh dear.  Oh dear.  Not too old, I trust?  Fifteen, hmm.  Ah well, if Job could bear his disappointments, I suppose I must have the good grace to bear mine. Show her in when she arrives.  Oh my!  And to think I doubted your loveliness for even an instant. Mea culpa, my child, mea culpa. You are a vision.  An angel.  Of course, \"hate the sin, love the sinner.\"  I always say.  Take your dress off, please.  You -- You filthy whore!  I'll kill you, you fucking sow.  What's this?  Who --  Dennis?",
        "Guy": "",
        "Fawkes": "",
        "Evey": "\"Remember, remember, the fifth of November, the gunpowder treason and plot.  I know of now reason why the gunpowder treason should ever be forgot.\"  Those were almost the very first words he spoke to me and, in a way, that is where this story began, four hundred years ago, in a cellar beneath the Houses of Parliament.  In 1605, Guy Fawkes attempted to blow up the Houses of Parliament.  He was caught in the cellars with enough gunpowder to level most of London.  Sometimes I wonder where we would be if he hadn't failed.  I wonder if it would have mattered.  I suppose the answer is in the rhyme.  More than the man, what we must remember is the plot itself.  For in the plot we find more than just a man, we find the idea of that man, the spirit of that man, and that is what we must never forget.  This, then, is the story of that idea, of that spirit that began with an anarchist's plot four hundred years ago.  I was born near the end of the millennium, the year 1997.  My father used to say that people were so afraid that the world was going to end that they were willing it to happen.  I don't remember much of the century's turn.  I don't remember the market crash or the plague or any of the Trafalgar riots.  I've read about them since but I don't recall how any of them impacted my life except for the fear.  They would hide it from me, like a secret between them.  But I could feel it.  Of the chaos that seemed to swallow the beginning of the 21st century, there is one thing I do remember.  Very clearly, I can remember that sound.  And I remember those boots, black leather that gleamed bright in the morning sun.  I had never seen such boots.  All moving in perfect unison.  It must have seemed so easy to them.  They offered such a simple deal; give up control and we will restore order.  At first, the arrests were political.  Dissidents.  Radicals. Liberals.  When my parents were younger, they had been activists.  They had marched with Labor in the great train strike.  Mommy?  Mommy!  Daddy!  I never saw them again.  Overnight, my life, my entire world was erased.  It was done so quickly and violently, so completely, that it began to seem that it had never even existed.  The homosexuals were next.  What God had started with AIDS had to be finished by man.  It was God's work.  That's what we were told.  But once they were gone, there was someone else.  Someone different.  Someone dangerous.  There were those who understood what was happening, who knew it was wrong but who kept silent.  And in the vacuum of that silence, order was imposed.  Order that was like those boots, order that required rigorous discipline.  Order that is exactly the same, where each single step falls with every step.  The order of the many shaped into one.  Somehow in my heart, I knew it wouldn't last.  What they thought they had crushed, the spirit they believed trampled and ground beneath the marching of their boots, rose up, rose as if from a four hundred year old grave, rose to remind us all that day.   There is a radio on a small makeup table.    She packs tissue paper into the toes of a pair of high heels that are too big for her.    Evey coats her lips with a lascivious red.  She stares into the mirror, her makeup like a mask over her own face.   I don't know what brought us together that night.  I had never been to that part of Westminster but ever since I've known him, I've stopped believing in coincidence.  Excuse me?  Uh... excuse me, Mister?  Would you like... uh, would you like to sleep with me?  I mean, for money.  Oh god, I'm sorry.  Yes, no, I mean for money.  But I know what you want and I'll do it.  Anything you want, mister.  Please, I need the money.  I know I'm young but I promise I know what I'm doing.  Christ, you're a Fingerman.  Oh god, please.  It's my first time.  Please don't hurt me.  Oh no!  Please, don't!  Who -- Who are you?  Evey.  Why did you do that?  Why did you... help me?  For what?  Music?  Is that why you're wearing a mask?  Uh... November fourth.  I don't know.  To your music?  I can't hear anything.  Oh my...  It's beautiful...  Wait.  I've lost you.  Oh...  A jukebox?  Where did you get it?  Oh, it's beautiful.  I've never heard anything like it.  This place is amazing.  Stay here... with you?  I... I don't even know your name.  V?  V... I like that.  V, v, v, v, v.  Oh, V, you scared me.  I was reading the inscription. What is it?  Yes, I suppose you have.  This place is the only universe I have right now.  I don't know.  I'm so grateful to you -- I just feel I should help you, you know, the way you're helping me.  I mean, that's the deal, isn't it?  I think I do.  Part of me wants to stay here forever and never have to face what's going on outside.  But that's not right.  Is it?  That's not taking responsibility.  Not conquering my universe.  I want to help you, V.  I want to do something.  Can we make a deal?  Good.  That's that, then.  V, you said that Latin thing was a quote.  Who said it?  Uh... thank you.  Listen -- I was kind of hoping --  No --   V, what are you doing?  Oh no.  You can't kill him!  Oh god, V.  I can't -- I can't --  No... I made a mistake.  I have to find someone.  Oh no... V?  You've made a mistake.  Please.  I haven't done anything --  No, please, I didn't do anything.  No.  No, I --  Oh god, I don't --  No --  I don't know.  They were going to rape me, kill me --  Please.  I didn't do anything.  I read her letter.  Hid it.  Slept. Woke.  They questioned me.  And I read her letter again.  Over and over...  Her name was Valerie.  No.  No, that isn't true --  No, wait!  I had come to know every inch of those four walls in that dark hell and they knew every inch of me. Every inch...  Except one.  No.  Thank you but I'd rather die behind the chemical sheds.  What?  You...  You did this... to me.  You did this to me!  You -- You hit me and -- and cut my hair.  It was you.  It was just you all this time.  You tortured me.  You tortured me --  Oh god, why?  Love?  Set me free?  Don't you realize?  Don't you realize what you did to me?  You nearly drove me mad!  I hate you.  I hate you!  Set me free?  You put me in a prison to set me free?!  Shut up!  I don't want to hear it. I wasn't in a prison.  I was happy! I was happy here --  That's warped!  That's evil and it's wrong!  What gives you the right to judge?  Who are you to say what's not good enough?!  Shut up!  You're mad!  I don't want to hear it!  I can't feel anything!  There's nothing left to feel!  Don't you understand?  I don't know what -- Oh god -- I can't breathe --  What are you doing to me?  I can't breathe --  I feel -- I feel like I'm going to burst.  Oh god -- I felt --  Like an angel --  Oh god, V, I'm so scared.  What's happening to me?  The roof?  Outside?  I -- I don't want to be blindfolded.  Everything's so -- different.  That was beautiful.  I've wanted to do this for a long time.  Thank you, V.  Thank you for everything you've done for me.  It was a good backdrop.  I believed it.  I really did.  It's still a bit hard for me to accept that it wasn't real.  That it was just you. Especially the letter.  It is a beautiful letter, V.  Every time I read it I could feel Valerie, almost like she was holding me.  I believed in her most of all.  I believed that she loved me and I loved her back.  I feel a bit foolish telling you this.  I know that you must have written it and thought you should have it back.  What?  Valerie?  She's beautiful.  Roses.  You grew them for her.  They're beautiful.  Two days before the first day we met.  You're planning something, aren't you, V?  What are you going to do?  I've never been here before.  Oh, V, it's lovely.  Where on earth did you find it?  What's in these packages?  What are you going to do with all of it?  Where does this train go?  Whitehall... V, that's the New Government Building.  But the underground has been shut down for years.  How are you going to make it run without any power?  Oh, V, turn it off, please.  What is that, V?   V, what's going to happen?  Is it going to be violent?  But why?  Why must is be violent?  What is the other face, V?  Yes, V?  Of course.  Tell me.  It would be my pleasure.  All it takes is a little practice.  V?  What are you going to do?  You're coming back though, aren't you?  V, I won't let you leave unless you promise me that you will come back.  Just promise.   You came back.   Oh god, what happened?  You need a doctor.  No, don't say that!  Yes, they need you, V.  What?  I don't understand.  I promise.  V, you are not going anywhere!  You're not going to die, V!  I won't let you die!   I remember... I remember staring at the mask, at that smile.  Part of me couldn't believe he was dead and maybe that was why.  The smile was still the same. It made me want to tear it off so I could see the face, so I could see that he was dead.  But I had promised.  I began to try to imagine his face. Of course, I had long pictured my father behind that smile but I knew in my heart that V was not my father.  Yet every time I pictured another face, any face, something was lost, something important was somehow diminished.  V was more than a face.  V was V.  And then, quite suddenly, quite naturally, I realized whose face must be beneath that mask.  It was the only face that mattered.  I won't let you die.  Goodbye, my love.  \"Ave Atque vale.\"  I looked it up the next morning.  \"Hail and farewell.\"  They will, my love.  They will.  \"Remember, remember, the fifth of November!\"  I have come here tonight to keep a promise.  A promise that is over four hundred years old.  Tonight I am here to give you your freedom!  Since mankind's dawn a handful of oppressors have accepted the responsibility over our lives, responsibility that we should have accepted ourselves.  By doing so, they took our power.  By doing nothing, we gave it away.  Tonight, our world will change. Our leaders will be gone and we must choose what comes next.  A return to the chains of others or lives of our own.  A world of the past or one of the future.  Let us choose carefully, London, and when we do, let us mark well and remember, remember this fifth of November!  Yes, my love.  Yes it is.  I know that there is only one way to repay him for what he did.  And I know that that way is going to take a lot of hard work.  I know this like I know the sun will rise tomorrow and beneath that new sun, our work will begin.",
        "Dascomb": "The time has come, London, to return to a bygone age, an age of tradition, an age of values that have been disparaged and all but forgotten.  What this country needs is a leader!  A true leader to remind us of that age.  A righteous leader with the strength of his moral convictions to do what must be done.  I give you that man!  I give you our leader!  Adam Susan!  Would someone get his lordship his bloody tea?  Lewis, they want this report on the first hour --  It's not our job to believe it, Lewis.  Our job is to tell the people --  They will if it's you that's telling it to them.  Now let's try it again.  Finch!  Do you know what this is all about?  What?  Oh come on.  He's long gone.  He has to be.  He did what he came to do and it's over.  Isn't it?  Now Adam, there is no one better than Finch and you know it.  It's not Finch's fault, Adam.  He's gone, Adam.  It's over.  For god's sake, Adam, it's a stupid variety show.  You can't be serious --  All of London's waiting.  Ready, two.  And here we go --",
        "Finch": "Thanks to Etheridge, we found the launch for the fireworks.  These appear to be individually weighted flares and we have found traces of the same chemicals at both of the detonation sites which leads us to conclude that, despite a level of sophistication, these devices are all home-made with over the counter chemicals, making them impossible to trace.  Whoever he is, Leader, he's good.  Hmm.  It's a rose.  A violet carson, I believe.  Strange.  I didn't think they still existed.  Now?  Send the rose to the lab.  Also, scrape a sample of this paint and have it analyzed as well.  I'll be back as soon as I can.  Yes, sir.  Well, I...  You think he's an insider?  Perfectly.  England prevails.  I want those tapes from the Ear in my office tonight, Dominic.  Any word from your superior, Mr. Creedy?  Quite.   Finch sits at his desk, staring into the silence of his notepad.  He has doodled a little \"V\" with a circle around it.  He looks up as Dominic enters, holding up a portable cassette player.   Background noise?  What music did he play?  Da, da, da, dum.  That's code. Morse code.  For the letter \"V\".  Anything on the girl yet?  What is it?  He made him eat a host.  And then just Beethoven's fifth.  We have got the initial path report back.  The host was full of cyanide.  And do you know what?  When it reached his abdomen, it was still cyanide.  Just lives.  I know it's too early for your profile but do you have any initial impressions?  Bloody hell.  Perhaps Fate will make something more of all this.  I certainly can't.  Quite.  Government directed terrorism never sews healthy ideas into the public.  Oh, that reminds me.  Can you tell us anything about this?  We found one in the carriage with Prothero and this one in the Bishop's quarters.  A violet carson.  I heard that strain had died off. Thought a botanist might shed some light on it.  Delia?  Magic.  I'll drop by tomorrow then.   Finch turns as Dominic bursts in.   A connection?  What about codename V?  Five is the letter V.  Brilliant, Dominic.  All we need is Larkhill's employment records.   Dominic hangs over Finch's shoulder as Larkhill's employment record comes up.  Finch's mouth falls open.   Oh my god.  Oh bloody hell.  Oh no.  Delia?  Get an ambulance.  That's the last entry until six months later when Dr. Surridge is back in London.  There is no mention of the man in room five again.  End of story.  Except that it wasn't the end of the story.  Between 2009 and 2012, over forty men and women who were previously stationed at Larkhill met with what were believed to be accidental deaths.  Eventually, only three remained.  The three he'd been saving until last.  Everyone who worked at Larkhill. Everyone who could have identified him.  You see there are two possible motives here.  Not one.  The first is revenge.  He escapes from Larkhill and vows to get even with his tormentors.  The whole exercise an elaborate, chilling vendetta.  That's the explanation that I find most reassuring, funnily enough. Because that means he's finished. It's over now.  The second motive is more sinister. Like I said, everyone who could have identified him is dead.  What if he's just been clearing the ground?  What if he's planning something else?  You see, the diary we found was in full view.  We didn't have to search for it.  He left it there. He wanted us to find it.  He wanted us to know the story.  Or...  For all we know, the diary could be a complete and utter fake. Codename V could have written it himself.  He's playing games with us.  He might never have been at Larkhill at all.  Do you see?  It could all be another smoke screen, a false trail, another cover story --  Yes, Leader.  No, Leader.  Not yet.  No, but I can guess.  \"Remember, remember, the fifth of November.\"  Not for us.  What are you saying?  Are you asking for my resignation?   Finch sits alone in his modest apartment, reading a book. The book is Koesterler's, \"The Roots of Coincidence.\"  An old CD player is playing music, a Bach piano concerto.    Dominic is chewing on a hamburger, engrossed in Storm Saxon. Across the room, Finch is reading the \"Roots of Coincidence.\"   I don't know how you stand that tripe.  Don't you see, Dominic?  I'm V.   The door bursts open as Creedy and a group of heavily armed Fingermen muscle in.    Finch glares at Creedy.   Why don't you just shoot me, Creedy?  Wouldn't that make everything a lot simpler?  He has to be at Jordan tower.  Come on!   The car races wildly towards Jordan tower as Finch and Dominic listen to the broadcast on the radio.    Finch can see the forces gathering outside Jordan tower.   But I thought I was the terrorist.  Since I'm not in jail and since you have another, even more convenient suspect.  I'm guessing the charges have been dropped.  I am careful, sir.  Always.  That is why I suggest that a search of this building begin immediately.  With all due respect, I disagree and I believe that he is presently trying to get out of this building disguised as one of us.  No sir, I'm trying to run an investigation --   A recording of VTV plays on the small television.   Play it again.  I don't know.  For twenty seven years, I've been at this job. Twenty seven years, I've done what I've been told to do.  Maybe that's all there is to it.  I'm just a dumb old dog.  A dumb old dog that only knows one trick.  Maybe.  And maybe I'm not ready for a revolution.  We will.  It's on the tape.  I know it.  I can feel it.  He did this for a reason.  He needs something.  The line of the Queen?  Maybe it's a line from Shakespeare. Or a book.  I don't know.  But right here.  He's talking to someone.  Someone specific. Someone who knows what he wants.   There are stacks of printout everywhere.    Finch looks through the blinds at the morning sun.  He has been up all night.  He checks his watch: 6:00am.   Eighteen hours.  Dominic!  Dominic, go home.  Forget it.  There's no more time. You go home and get some rest. You're going to need it tonight.  Yes, he does.   Finch sits alone, palms pressed to his bleary eyes.   Give it up, old man.  You're not even sure you want to stop him.  Christ!  That's it!  It's got to be it!  Oh my god.  Is the Leader in?  Perfect.  Leader, I need as many men the Captain can spare and I need them right now.  To capture codename V.  He's underground.  The old subway. I know exactly what he's going to do.  If we move quickly, we can be there, waiting for him.  Leader, every second we delay...  No... no sir.  I don't think that will be necessary.  This... this is a mistake.  Leader, we have to get out of here!  It was a mistake.  This is what he wants.  He knows us, Leader.  He knows us too well.  We have to get out of here before it's too late --  Don't move!  Drop the knife.  No, Mr. Susan.  No, I'm not.  I'm a man who does his job and does what he's told.  For twenty seven years, that's all I've been.  I've read Delia's diary over and over all year.  It sickens me but I am unable to judge her.  I am as guilty as she.  I have no excuse.  I did what I was told to do.  My job was to find you and catch you.  I've done my job.  I've done it for the last time.  I'm tired of it.  I'm tired of it all.  Kill him yourself if you can.  Thank you, V.  And goodbye.",
        "Creedy": "Mr. Almond doesn't seem to be answering his page, sir.  I'm sure he's in the field.  What's all this, then, Harper?  I get a radio that a man's down and in need of assistance?  Are you flat broke already?  What I wouldn't give for a piece of that.  Aye.  This nonsense has put a serious strain on my drinking.  I think I was actually sober today.  Well, it's good to know when the shit hits the fan who your real friends are.  You look lost.  Can I buy you a drink?  Well I didn't like the looks of you anyway --  Bloody hell!  It's him!  We got him!  Yes, sir.  I, uh, appreciate your faith in me.  Oh god, yes!  Oh, don't stop.  I can't --  He asked me... if I loved my country.  Oh god...  Then he asked me to do something... oh, oh...  Helen, I can't.  I can't tell you.  My god?!  How did you know that?  No way.  I can't tell you that.  Helen, please.  It was... Fi... Fi... FINCH!  Everything's set, sir.  No worries.  Tonight.  I'm here to arrest Mr. Finch for acts of treason and terrorism.  If I were you, boy, I'd shut my hole unless you want to start explaining why you didn't say nothing about Mr. Finch's secret identity.  Yeah, I suppose it would.  Bloody fuckin' hell.  Don't just stand there!  Follow them!  But how does he know?  Do you know what I want?  I want you just like this... Bent over that black leather chair...   Where we see a tiny microphone hidden in the ceiling light above the bed.  Helen moans as we drift down, glimpsing Helen, her arms reaching for the edges of the bed, her back arching up towards Creedy, behind her, smiling.   What about Conrad?  Use the Finger?  You mean like this?  But you like it?  That I am, misses.  But I'm the pig that's gonna be running this country.",
        "Lewis": "",
        "Prothero": "Good morning, London.  This is the voice of Fate -- Damn.  Good morning -- ack.  Good morning Lond-- Goddammit!  Where is my bloody tea?!  I know.  I know.  Damned inconvenient this entire affair. Fine.  Let's try again.  Good morning, London.  It is 6 am, the fifth of November 2019 and this is the voice of Fate.  The new day brings good news and bright prospects from overseas, where negotiations with New China are moving in a positive direction. Last night's scheduled demolition of two deteriorating landmarks went off without a hitch.  Spokesman for the Interior ministry said both structures were severely damaged and judged to be a danger to the unsuspecting public.  Plans for new landmarks are well underway.  Do you believe this crap, Dascombe?  \"Exactly what they tell us.\"  I Know but do you think that people will believe it?  ... plans for new landmarks are already well underway.  \"Remember, remember, the fifth of November...\"  Do you suppose that's why he did it?  Guy Fawkes.  He tried to blow up Parliament.  Don't they teach history in school anymore?  Yes, of course.  My mistake.  I love trains.  I remember riding the underground with my father. Shame they shut them all down.  Get off of me!  I have a lighter... somewhere...  I found it!  Oh god.  Who are you?  What do you want? Money?  Is that it?  Wait, wait.  You're, you're the one that blew the Bailey.  You're making a mistake.  I'm nobody --  Oh god, what do you want?  What -- What did you call me?  I don't know what you're talking about.   Prothero admires his uniform in the mirror.   Her.  You.  You!  You're him, aren't you?  Oh my god!  What are you going to do?  Oh no, no!  Please I was just doing what I was told!  Please, don't make me do this...  I'll see you in hell.  Fi... Fi... Fi...  Five.  Room five.  Next.",
        "Adam": "",
        "Sutler": "",
        "V": "\"Remember, remember, the fifth of November, the gunpowder treason and plot.  I know of now reason why the gunpowder treason should ever be forgot.\"  Those were almost the very first words he spoke to me and, in a way, that is where this story began, four hundred years ago, in a cellar beneath the Houses of Parliament.  In 1605, Guy Fawkes attempted to blow up the Houses of Parliament.  He was caught in the cellars with enough gunpowder to level most of London.  Sometimes I wonder where we would be if he hadn't failed.  I wonder if it would have mattered.  I suppose the answer is in the rhyme.  More than the man, what we must remember is the plot itself.  For in the plot we find more than just a man, we find the idea of that man, the spirit of that man, and that is what we must never forget.  This, then, is the story of that idea, of that spirit that began with an anarchist's plot four hundred years ago.  I was born near the end of the millennium, the year 1997.  My father used to say that people were so afraid that the world was going to end that they were willing it to happen.  I don't remember much of the century's turn.  I don't remember the market crash or the plague or any of the Trafalgar riots.  I've read about them since but I don't recall how any of them impacted my life except for the fear.  They would hide it from me, like a secret between them.  But I could feel it.  Of the chaos that seemed to swallow the beginning of the 21st century, there is one thing I do remember.  Very clearly, I can remember that sound.  And I remember those boots, black leather that gleamed bright in the morning sun.  I had never seen such boots.  All moving in perfect unison.  It must have seemed so easy to them.  They offered such a simple deal; give up control and we will restore order.  At first, the arrests were political.  Dissidents.  Radicals. Liberals.  When my parents were younger, they had been activists.  They had marched with Labor in the great train strike.  Mommy?  Mommy!  Daddy!  I never saw them again.  Overnight, my life, my entire world was erased.  It was done so quickly and violently, so completely, that it began to seem that it had never even existed.  The homosexuals were next.  What God had started with AIDS had to be finished by man.  It was God's work.  That's what we were told.  But once they were gone, there was someone else.  Someone different.  Someone dangerous.  There were those who understood what was happening, who knew it was wrong but who kept silent.  And in the vacuum of that silence, order was imposed.  Order that was like those boots, order that required rigorous discipline.  Order that is exactly the same, where each single step falls with every step.  The order of the many shaped into one.  Somehow in my heart, I knew it wouldn't last.  What they thought they had crushed, the spirit they believed trampled and ground beneath the marching of their boots, rose up, rose as if from a four hundred year old grave, rose to remind us all that day.   There is a radio on a small makeup table.    She packs tissue paper into the toes of a pair of high heels that are too big for her.    Evey coats her lips with a lascivious red.  She stares into the mirror, her makeup like a mask over her own face.   I don't know what brought us together that night.  I had never been to that part of Westminster but ever since I've known him, I've stopped believing in coincidence.  Excuse me?  Uh... excuse me, Mister?  Would you like... uh, would you like to sleep with me?  I mean, for money.  Oh god, I'm sorry.  Yes, no, I mean for money.  But I know what you want and I'll do it.  Anything you want, mister.  Please, I need the money.  I know I'm young but I promise I know what I'm doing.  Christ, you're a Fingerman.  Oh god, please.  It's my first time.  Please don't hurt me.  Oh no!  Please, don't!  \"The multiplying villainies of nature do swarm upon him.\"  \"And fortune, on his damned quarrel, smiling, showed like a rebel's whore.\"  \"Disdaining fortune with his brandished steel, which smoked with bloody execution.\"  Good evening.  Who -- Who are you?  Me?  I imagine all manner of names shall be heaped upon my humble visage but, for now, let us simply say I am the villain.  And you would be?  Evey.  Of course.  Why did you do that?  Why did you... help me?  Why indeed?  Almost time.  For what?  For the music.  Music?  Yes, music.  My music.  You see. Evey, I am a performer.  Is that why you're wearing a mask?  We all wear masks.  Life creates them and forces us to find the one that fits.  Do you know what day it is?  Uh... November fourth.  Not for long.  \"Remember, remember, the fifth of November, the gunpowder treason and plot.  I know of no reason why the gunpowder treason should ever be forgot.\"  Tell me, Evey, what good is an actor that plays his part to an empty theatre?  I don't know.  Nor do I.  That's why you are here. I need you, Evey.  I need someone to listen.  To your music?  Yes.  Yes, to my music.  Can you hear it?  It's already begun.  I can't hear anything.  At first, you have to listen very carefully...  Ahh, yes.  There it is.  Beautiful, is it not?  Oh my...  It's beautiful...  Thank you.   A massive modern building that is the seat of the new government.  A long, black car pulls up to the entrance.  Adam Susan gets out, wearing a long black trenchcoat over his pajamas.  He is the Leader and he looks older, heavier, and meaner.  He hurries past the heavily armed guards, barely acknowledging the snap and cock of their Nazi-like salute.   Wait.  I've lost you.  No, you haven't.  Oh...  A jukebox?  Where did you get it?  I saved it.  Like everything here.  Oh, it's beautiful.  I've never heard anything like it.  Of course not.  You grew up in their world.  Art is created by individuals and there are no individuals in a world where you are told what to think.  This place is amazing.  You're welcome to stay.  Stay here... with you?  Yes.  If you like.  I... I don't even know your name.  I don't have a name.  But you can call me V.  V?  V... I like that.  I've come to offer you a choice. Commander Prothero.  Commander Prothero.  That was your title at Larkhill. You remember Larkhill, don't you, Commander?  Where they sent the undesirables.  Maybe I can help your memory. Let's see.  Larkhill opened in the summer of 2009.  You were appointed it commander.  You wore a uniform in those days.  You looked very good in it.  You were a man of many responsibilities.  You made sure Larkhill made all its quotas, especially the oven quotas even though they required an excessive amount of maintenance.   We see a detail of black and Indian men, shoveling mounds of black ash from a series of furnace like ovens.  As the shovels lift, we see blackened bones and burnt skulls.   But there was one task you took to with exceptional relish.  Remember the medical block, Commander?  I believe you called it the funny farm.  You were the one that selected the prisoners.  You hand picked each one.  You gave us a choice, remember, Commander?  You said we could cooperate with the doctors or...  Hold out your hand.  Of course you were.  Now I'm telling you to make a choice. Either you stick that syringe into your neck or --  I can kill you right now.  Crying doesn't help, Commander.  I remember there was a woman who had been screaming for two days.  You winked at the doctor and laughed, \"All in the name of science.\"  It's a difficult choice, isn't it? Certain death versus something that might be... worse.  But you never know.  There is still a chance. You could survive.  Look at me. Now, time's up, Commander.  Choose.  Yes.  I'm quite sure you will.  V, v, v, v, v.  I hear your summons, my lady.  And obey.  Oh, V, you scared me.  I was reading the inscription. What is it?  A Latin quotation.  A motto.  \"Vi veri veniversum vivus vici.\"  \"By the power of truth, I, while living, have conquered the universe.\"  Yes, I suppose you have.  This place is the only universe I have right now.  Does that bother you?  I don't know.  I'm so grateful to you -- I just feel I should help you, you know, the way you're helping me.  I mean, that's the deal, isn't it?  No deals, Evey.  Not unless you want them.  I think I do.  Part of me wants to stay here forever and never have to face what's going on outside.  But that's not right.  Is it?  That's not taking responsibility.  Not conquering my universe.  I want to help you, V.  I want to do something.  Can we make a deal?  Yes.  I think we can make a deal if you like.  I think I know a way you could help me very soon indeed.  Good.  That's that, then.  V, you said that Latin thing was a quote.  Who said it?  Nobody you'd have heard of.  A German gentleman named Dr. John Faust.  He made a deal too.  Uh... thank you.  Listen -- I was kind of hoping --  No --  Please allow me to introduce myself...  I'm a man of wealth and taste.  Shh.  It isn't polite to disturb the dead on their journey.  A courtesy I'll most respectfully extend to his grace.    Lilliman swallows audibly.   V, what are you doing?  Vi veri veniversum vivus vici, Evey.  Oh no.  You can't kill him!  Death has followed his grace the whole of his career.  Is it any coincidence it has finally followed him here?  Oh god, V.  I can't -- I can't --  Let us pray.  ... And I saw a black shape against the flames.  Oh god.  It's you. The man from room five.  You've come --  To collect what's mine.  I beg you!  I don't want to die! Please have mercy!  \"There is more behind and inside of V than any of us had suspected. Not who, but what: what is she?\"  Yes.  Are you afraid?  No... I made a mistake.  I have to find someone.  There are no coincidences, Delia. Only the illusion of coincidence.  I have another rose.  This one is for you.  I killed you ten minutes ago. While you slept.  No.  No pain.  Yes, look.  Look and tell me what you see.  Oh no... V?   Two inmate orderlies are hefting sacked cadavers from a cart into an incinerator.   You've made a mistake.  Please.  I haven't done anything --  No, please, I didn't do anything.  No.  No, I --  Oh god, I don't --  No --  I don't know.  They were going to rape me, kill me --  Please.  I didn't do anything.        I read her letter.  Hid it.  Slept. Woke.  They questioned me.  And I read her letter again.  Over and over...  Her name was Valerie.  I was born in a rainy burg in Nottingham in 1975.  I passed my eleven plus and went to girl's grammar.  I met my first girlfriend at school.  Her name was Sara.  Her wrists.  Her wrists were beautiful.  I sat in biology class staring at the pickled rabbit fetus while Mr. Herd said it was an adolescent phase that people outgrew.  Sara did.  I didn't.   Two teenage girls stand in front of a middle aged couple. They are holding hands.   In 1994, I stopped pretending and took a girl called Christine home to meet my parents.  A week later I moved to London to go to college and study drama.  My mother said I broke her heart.  But it was my integrity that was important.  Is that so selfish?  It sells for so little but it's all we have left in this place...  It is the very last inch of us...  But within that inch we are free.  No.  No, that isn't true --  No, wait!  London.  I was happy in London.  I played Dandini in Cinderella.  The world was strange and rustling with invisible crowds behind the hot lights and all that breathless glamour.  Work improved.  I got small film roles, then bigger ones.  In 2006, I starred in \"The Salt Flats.\"  That's where I met Ruth. We fell in love.  Every Valentine's Day she sent me roses and, oh god, we had so much. Those were the best three years of my life.  In 2010, they came.  And after that there were no more roses...  Not for anybody.  After the takeover, they started rounding up the gays.  They took Ruth while she was out looking for food.  Why are they so frightened of us?  They burned her face with cigarettes and made her give them my name.  She signed a statement saying I'd seduced her.  I didn't blame her.  God, I loved her but I didn't blame her.  But she did.  She killed herself in her cell. She couldn't live with betraying me, with giving up that last inch. Oh, Ruth.  They came for me.  They shaved off my hair.  They held my head down a toilet and told lesbian jokes. They brought me here and pumped me full of chemicals.  I can't feel my tongue.  I can't speak.  It is strange that my life should end in such a terrible place but for three years I had roses and apologized to nobody.  I shall die here.  Every inch of me shall perish...  Except one.  An inch.  It is small and fragile and it's the only thing in the world that's worth having.  We must never lose it or sell it or give it away.  We must never let them take it from us.  I don't know who you are but I hope you escape this place.  I hope that the world turns and things get better and that one day people have roses again.  I don't know who you are but I love you.  I love you.  Valerie.  I had come to know every inch of those four walls in that dark hell and they knew every inch of me. Every inch...  Except one.  No.  Thank you but I'd rather die behind the chemical sheds.  What?  Welcome home, Evey.  You...  You did this... to me.  You did this to me!  You -- You hit me and -- and cut my hair.  It was you.  It was just you all this time.  You tortured me.  You tortured me --  Oh god, why?  Because I love you, Evey.  Because I wanted to set you free.  Love?  Set me free?  Don't you realize?  Don't you realize what you did to me?  You nearly drove me mad!  I hate you.  I hate you!  Set me free?  You put me in a prison to set me free?!  You were already in a prison. You've been in a prison all your life.  Shut up!  I don't want to hear it. I wasn't in a prison.  I was happy! I was happy here --  Happiness is the most insidious prison of all, Evey.  That's warped!  That's evil and it's wrong!  What gives you the right to judge?  Who are you to say what's not good enough?!  You were born in a prison, Evey.  I didn't put you there.  I just showed you the bars.  You've been in a prison so long, you no longer believe there's an outside world.  Shut up!  You're mad!  I don't want to hear it!  That's because you're afraid, Evey. You're afraid because you can feel freedom closing in on you.  You're afraid because freedom is terrifying.  I can't feel anything!  There's nothing left to feel!  Don't you understand?  Don't back away from it, Evey. Part of you understands the truth even as part pretends not to.  Woman, this is the most important moment in your life.  Don't run from it.  I don't know what -- Oh god -- I can't breathe --  Good.  You're almost there.  Go closer.  Feel the shape of it.  What are you doing to me?  I can't breathe --  You were in a cell.  They offered you a choice between the death of your principles and the death of your body.  I feel -- I feel like I'm going to burst.  You said you'd rather die.  You faced the fear of your own death and you were calm.  Try to feel now what you felt then.  Oh god -- I felt --  Like an angel --  Oh god, V, I'm so scared.  What's happening to me?  The door of the cage is open, Evey. All that you feel is the wind from outside.  Don't be afraid.  Try to walk.  The lift will take us to the roof.  The roof?  Outside?  I -- I don't want to be blindfolded.  No, Evey.  No more blindfolds.  Do you feel it?  Everything's so -- different.  I know.  Five years ago, I too stared beneath a night like this. Naked under a roaring sky.  The night is yours, Evey.  Seize it.  Encircle it within your arms.  Bury it in your heart up to the hilt.  Become transfixed and transfigured --   Forever.   Finch gets out of a police car and looks up the black face of the modern building.  He sighs and taps his pipe against the heel of his shoe.    A dark November sky hangs like a shroud over the building.    The Leader stands at the window.   That was beautiful.  I've wanted to do this for a long time.  Thank you, V.  Thank you for everything you've done for me.  You did it all yourself, Evey.  I just provided the backdrop but the drama was all your own.  It was a good backdrop.  I believed it.  I really did.  It's still a bit hard for me to accept that it wasn't real.  That it was just you. Especially the letter.  It is a beautiful letter, V.  Every time I read it I could feel Valerie, almost like she was holding me.  I believed in her most of all.  I believed that she loved me and I loved her back.  I feel a bit foolish telling you this.  I know that you must have written it and thought you should have it back.  But I didn't write that letter, Evey.  What?  Come with me.   It is a shrine.  The walls are covered with movie posters and reviews and pictures of an actresses named Valerie Page.  We recognize her as the woman chosen for the medical block just before V.  Everywhere there are flower boxes filled with blooming roses; violet carsons.   Valerie?  Yes.  Valerie Page.  She was the woman in room four.  She's beautiful.  She wrote the letter just before she died.  I delivered it to you as it was delivered to me.  The words you wept over were the same words that transformed me.  Roses.  You grew them for her.  Yes.  They're beautiful.  Evey, do you know what day it is?  Two days before the first day we met.  You remembered.  You're planning something, aren't you, V?  You know me too well now.  What are you going to do?  I'm going to fulfill an old promise.  I'll show you.  I've never been here before.  Yes.  It is the deepest part of my home.  Once you know it, I should think you'll know everything.   Parked beside the concrete platform is a beautiful antique train car.   Oh, V, it's lovely.  Where on earth did you find it?  In a way, I suppose it really found me.  What's in these packages?  Gelignite.  Careful.  What are you going to do with all of it?  I told you.  I'm going to finish what was started four hundred years ago.  Where does this train go?  This is the old Victoria line but it is blocked, blocked somewhere between Whitehall and St. James.  Whitehall... V, that's the New Government Building.  But the underground has been shut down for years.  How are you going to make it run without any power?  I just thought I might ask them to turn it on for me.  Good evening, London.  I thought it was time we had a little talk.  Are you sitting comfortably?  Good. Then I'll begin.  Right now, I imagine there are hundreds of soldiers rushing here to kill me because someone does not want us to talk.   A family watching television.  In the background, two children are squabbling.   They are afraid that I am going to say the things that are not supposed to be said.  They are afraid that I am going to say the truth.  The truth is that there is something terribly wrong with this country, isn't there?  If you look about, you witness cruelty, injustice and despotism.  But what do you do about it?  What can you do?  You are but a single individual. How can you possible make any difference?  Individuals have no power in this modern world. That is what you've been taught because that is what they need you to believe.  But it is not true.  This is why they are afraid and the reason that I am here; to remind you that it is individuals who always hold the power.  The real power.  Individuals like me.  And individuals like you.  I have come to offer you a deal. If you accept, I will give you a different world.  A world without curfews, without soldiers and surveillance systems.  A world that is not run by other men but that is run by you.  I am offering you a second chance.  Four hundred years ago, a great citizen made a most significant contribution to our common culture. It was a contribution forged in secrecy and stealth although it is best remembered in noise and bright light.   A crowd has gathered, watching through the window.   To commemorate that glorious night at precisely the stroke of midnight, the edifice of their world will erupt with enough sound and fury to shake the earth.  All I ask is that you join me at the gates to watch as the past is erased, the pathway cleared so that together we can start toward a new day.  But, you ask, who am I to make such promises?  A fair question but hardly necessary as you know me already.  To know me any more you need only look to a mirror.  Truth be told, this wasn't even my idea, was it?  If you think back, you'll remember that night, whispering in your lover's arms.  I became a part of your plan just as you have now become part of mine. Give me the line of the queen and I'll give you your secret dream.  On the twelfth stroke of the fifth day of the eleventh month, I hope we shall all meet again.   The crowd is much larger.   Until then, I bid you goodnight.  ... if you give me the line of the queen, I'll give you your secret dream.  ... This wasn't even my idea, was it?  If you think back, you'll --  Remember that night, whispering in your lover's arms.  ... now you've become a part of mine.  Give me the line of the Queen and I'll give you your secret dream.   The same family, the same squabbling children watching as a \"Special Bulletin\" interrupts a laugh track.    No one is watching.   Oh, V, turn it off, please.  Of course, my dear.  What is that, V?  That, Evey, is what I have been waiting for.   Conrad pulls his car into his reserved space.    The Leader closes the door behind them.    The Leader takes hold of Helen by her shoulders.    A hanging light suddenly sizzles to life.  V looks up, smiling.    The Leader stares hard at Helen.    Helen and Conrad get out of the elevator, standing beneath the rows of new party flags that line the lobby.    The Leader's Lieutenant looks up from his desk and sees Finch rushing towards him.      Yes.  V, what's going to happen?  Change, Evey.  That's all.  Just change.  Is it going to be violent?  Yes, I suppose it will.  But why?  Why must is be violent?  Because, Evey, that is the nature of change.  She is a temperamental creature that appears in earnest rarely but, when she does, she will wear one of two faces.  The first face is the destroyer.  It is lamentable but all true change begins with death.  What is the other face, V?  The other face?  She is the true face of change.  The face of the creator.  She is the one that remakes the world.  Evey?  Yes, V?  May I ask you for a favor?  Of course.  It is a small thing but it would mean a great deal to me.  Tell me.  I've never danced before.  I've thought about it many times, here in this room, listening to the music.  But I've always been alone.  It would be my pleasure.  Thank you, Evey.  You are an excellent dancer.  All it takes is a little practice.  Alas, I have run out of time.  V?  What are you going to do?  Don't you remember?  I have a date tonight, Evey.  You're coming back though, aren't you?  V, I won't let you leave unless you promise me that you will come back.  Of course, I'll be back.  You don't think you can be rid of me now, do you?  Just promise.  I promise.  Good evening citizens of London. This is the voice of Fate.  Your fate...  Tonight, the face of London is going to change and I am going to offer you the chance to change with her.  Your Leader is finished.  He will not leave these tunnels alive.  At midnight tonight, the Head will be destroyed and a new era will begin.  You must now decide if you are going to be a part of that era.  You can choose to stay here and die with your Leader or you can choose to be free.  The decision is yours and yours alone.  Some of you have wives.  Some of you have families.  All of you have lives.  Consider each of them as you ask yourself, are they a part of the past, or are they a part of the future?  You are going to die as you ruled --  Alone.  You, most of all, should know, Leader.  You created me.  Without you, I would never be.  More than life, Leader, you gave me purpose.  \"He that killeth with the sword, shall be killed with the sword.\"    Goodbye, Mr. Finch.  The real question is, are you?  No.  But I don't have to.  You see?  You cannot kill me. There is no flesh and blood within this cloak to kill.  There is only an idea.  And ideas are bulletproof.    Scarlet footprints trail behind V as he struggles down the stairs.   You came back.    Running to him, she falls to his side.  His clothes are slick with blood.   Oh god, what happened?  Evey...  You need a doctor.  It's too late for that...  No, don't say that!  Evey, listen to me.  I've not long and there are things that must be said.  I have done that which I came to do.  Now, it is time for me to rest and with me the past will, at last, find peace.  But the world, the world is not saved... Do not think that, when the fires die and the smoke clears, there is no miracle... there is only a path... upon which they must learn to rule themselves.  Yes, they need you, V.  Not me, Evey, not me.  I told you I am the villain.  The destroyer... But yes, they will need help...  I kept my promise to you, Evey... Now you must promise me.  What?  Promise me... you will discover the face under this mask... but you will never look beneath it.  I don't understand.  Promise me.  Please...  I promise.  Sweet Eve.  Wherever I shall go, I shall always love you.  V, you are not going anywhere!  Midnight... Midnight.  Eve... Make them remember...  You're not going to die, V!  Let me be there, Evey, when it begins... Please, let me hear the music, one last time... my music...  I won't let you die!  I know you won't... I know...     My love... Ave Atque vale...  I remember... I remember staring at the mask, at that smile.  Part of me couldn't believe he was dead and maybe that was why.  The smile was still the same. It made me want to tear it off so I could see the face, so I could see that he was dead.  But I had promised.  You will discover the face under this mask but you will never look beneath it.  I began to try to imagine his face. Of course, I had long pictured my father behind that smile but I knew in my heart that V was not my father.  Yet every time I pictured another face, any face, something was lost, something important was somehow diminished.  V was more than a face.  V was V.  And then, quite suddenly, quite naturally, I realized whose face must be beneath that mask.  It was the only face that mattered.  I won't let you die.  I know you won't... I know.  Goodbye, my love.  \"Ave Atque vale.\"  I looked it up the next morning.  \"Hail and farewell.\"  \"Make them remember...\"  They will, my love.  They will.  \"Remember, remember, the fifth of November!\"  I have come here tonight to keep a promise.  A promise that is over four hundred years old.  Tonight I am here to give you your freedom!  Since mankind's dawn a handful of oppressors have accepted the responsibility over our lives, responsibility that we should have accepted ourselves.  By doing so, they took our power.  By doing nothing, we gave it away.  Tonight, our world will change. Our leaders will be gone and we must choose what comes next.  A return to the chains of others or lives of our own.  A world of the past or one of the future.  Let us choose carefully, London, and when we do, let us mark well and remember, remember this fifth of November!  Let me be there, Evey, when it begins...  Please let me hear the music... one last time... my music.  At first, you have to listen carefully.  Ah, yes.  There it is.  Beautiful, is it not?  Yes, my love.  Yes it is.   The entire building opens like a time-lapsed rose blooming with brilliant orange petals of flame.   I know that there is only one way to repay him for what he did.  And I know that that way is going to take a lot of hard work.  I know this like I know the sun will rise tomorrow and beneath that new sun, our work will begin.",
        "Dominic": "What do you make of this, Mr. Finch?  Strange?  No prints yet, sir.  Just like Prothero.  Yes, sir.  They're on top of it.  Sorry it took so long.  The boys had a devil of a time trying to filter out the background noise.  The perpetrator apparently turned on the Bishop's stereo. Subsequently, a great deal of the tape is useless.  Beethoven.  The fifth, I believe.  Sir?  No.  The agency said somebody claiming to be Lilliman's valet canceled his Sunday appointment.  23rd Psalm.  It goes on like that for a while. Fairly incoherent except we could make out a few words in this part. Transubstantiation.  That miracle business when the wafer transform into the body of Christ.  Yes, listen to this part.  There's a couple of funny human noises...  I got it!  Larkhill Resettlement Camp. Prothero's and Lilliman's employment records show they both help positions there at similar times.  Most of Larkhill's records were destroyed for security reasons but I did uncover an old standard procedures and operations manual.  In special case studies, medical research groups used roman numerals to identify test inmates.  He's killed them all?  It's not possible.  I'm sorry, sir.  You knew the doctor pretty well?  We found this on her bureau, sir. It's Dr. Surridge's journal.  It covers her years at Larkhill.  It might contain the whole story.  Es gooh.  Finch?  Finch, what's wrong?  What the hell?  Creedy?  What the hell's going on?  You can't be serious.  Holy Christ!  Creedy, you stupid ape!  If Finch is V then tell me who is that?  Come on, Finch.  We've seen it fifty times.  I mean, after what they done to you, I don't know why we're even trying to stop him.  That ain't it, Finch.  It's more than that.  I know you.  It's something personal with this one.  Well, we got less than thirty hours to stop it.  How?  What?  But what does that mean?  But I've still got over three hundred lines from The Fairy Queen.  He's got us, doesn't he, Finch?",
        "Etheridge": "We were able to triangulate the origin of the fireworks.  We also are currently monitoring a lot of phone surveillance indicating a high percentage of conversation concerned with the explosions.  All suspect or significant transcripts are being forwarded to Mr. Almond.  Vanished."
    },
    "imdb_rating": "8.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BOTI5ODc3NzExNV5BMl5BanBnXkFtZTcwNzYxNzQzMw@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "In the distant future, Evey Hammond is an average citizen of the United Kingdom, which is under the rule of the fascist and tyrannical Norsefire Party. She is an employee of the state-run British Television Network, but soon, she becomes the number one enemy of the state together with an enigmatic and larger-than-life freedom fighter known only by the letter \"V\". V informs Evey that she must hide in his underground lair for at least one year, and while she is reluctant to the idea at first, a bond soon forms between the two individuals. In the meanwhile, the mysterious past of V is gradually revealed to the police inspector tasked with capturing him, Eric Finch, and it is not long until he starts questioning everything his government stands for.goddangwatir",
    "name": "V for Vendetta",
    "genres": [
        "Action",
        "Drama",
        "Sci-Fi"
    ]
}