{
    "filename": "Valkyrie_script.txt",
    "imdb_id": "tt0985699",
    "imdb_url": "https://www.imdb.com/title/tt0985699",
    "characters": [
        "Erwin von Witzleben",
        "General Friedrich Olbricht",
        "Nina von Stauffenberg",
        "Ludwig Beck",
        "Lieutenant Werner von Haeften",
        "Colonel Mertz von Quirnheim",
        "Colonel Claus von Stauffenberg",
        "Field Marshal Wilhelm Keitel",
        "Colonel Heinz Brandt",
        "Major Otto Ernst Remer",
        "Adolf Hitler",
        "General Erich Fellgiebel",
        "General Friedrich Fromm",
        "Dr. Carl Goerdeler (as Kevin R. McNally)",
        "Major-General Henning von Tresckow"
    ],
    "dialogues": {
        "Ludwig": "",
        "Beck": "I apologize for this unfortunate... spectacle. On behalf of everyone, welc-    Can we get to him?  We don't seem to have a choice. Without Fromm there is no Valkyrie. Get him.  Out of the question. It won't work. We need you here in Berlin.  Orders are not enough. They need a man to follow. The right man.  Three very crucial hours.  I'll tell the others-  I'm afraid whatever the outcome, I won't be there to see it.  Beck.  Himmler is not in the briefing.  Carl.  Carl, if I may have a word with you in private.  Very well. There's no need to vote.  I consider you a friend. And I look forward to the day when we can once again live as free men. But you've become a liability.  I'm sorry it has to be this way.  Fellgiebel informed me this evening... Himmler's issued an order for your arrest. You'll have to leave Germany. Tonight. When we've succeeded with the central solution you'll return as Chancellor. Until then-  Disappear, Carl. Avoid contact with anyone.  No more indecision. From now on, Stauffenberg has discretion.  Have you made your peace with God, then?  Then you have nothing to fear.  By history?  In the end, we answer only to ourselves.  Did you reach your wife?  Ebingen is a long way from Bamberg. They're safe. You've seen to that. To think... You came to us a wounded soldier from Africa. Now... Now you are both the architect and the assassin. I'm still trying to understand how this came to be.  What's that?  Gentlemen, may I introduce Chief Helldorf. He's guaranteed the full support of the Berlin Police.  We can begin.  Hitler has scheduled a military briefing for today at one o'clock. Stauffenberg will strike regardless of who else is present.  Once in position, he will signal us once to alert the troops and again after the flash...  Assuming Fromm refuses to join us, Olbricht will take Command of the Reserve Army and initiate Operation Valkyrie.  Then he'll notify all district commanders between Paris and Berlin that the SS is attempting to seize power. The Reserve Army will arrest all SS, Gestapo and Nazi officials.  When the time is right, Witzleben and I will arrive at the War Ministry and assume the roles of Commander of the Armed Forces and Head of State, respectively.  With Berlin secured, Goerdeler will return and address the nation as our new Chancellor. Then, God willing, we can negotiate a truce with the Allies and spare Europe from total destruction.  Gentlemen, this is the most important day of your lives. Long live sacred Germany.  This has to be seen as a movement of the people.  You're certain he's dead.  Acts of vengeance will not be tolerated. We represent a different form of government. We represent what is good and just in Germany.  I'd like a pistol, please.  For personal reasons.  I'm thinking of earlier times...",
        "Adolf": "",
        "Hitler": "My comrades. Once again - I don't know how many times it has been now - an attempt has been made on my life. I speak to you tonight for two reasons. First, so that you can hear my voice and know that I am unhurt. And second, so that you may know the details of a crime without parallel in German history...          We have arrived in the sanctum sanatorium of Nazi Germany on the day after the Normandy invasion. But you would never know the tide of the war had just turned against Germany. A series of situation maps are scattered before them, ignored.  Only Speer seems to be reserved, smiling politely but clearly tuned into the present reality. Looking closer at Goering we see he is wearing heavy make-up - adding to the already surreal nature of the scene.  It is also the first time we are allowed a clear, unobstructed view of Hitler.   May I say, I am honored to meet a hero who has sacrificed so much for Germany. If only more of my officers were like you.  Let this man stand as an example to all of you. He is the ideal German officer.  Hmmm? Oh yes, Normandy. That will no longer be necessary. General Goering has assured me that Normandy is under control.      And the men fall out, nowhere to go so they just light up and shoot the shit. Hagen approaches Remer.       Then listen to me very carefully...  My comrades. Once again - I don't know how many times it has been now - an attempt has been made on my life.  I speak to you tonight for two reasons. First, so that you can hear my voice and know that I am unhurt. And second, so that you may know the details of a crime without parallel in German history...  A small clique of ambitious, dishonorable, stupid officers have conspired to eliminate me. Except for a few bruises and burns, I was completely untouched.  I see in this the hand of Providence... directing me to complete my work."
    },
    "imdb_rating": "7.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTg3Njc2ODEyN15BMl5BanBnXkFtZTcwNTAwMzc3NA@@._V1_QL75_UX380_CR0,16,380,562_.jpg",
    "description": "In Nazi Germany during World War II, as the tide turned in favor of the Allies, a cadre of senior German officers and politicians desperately plot to topple the Nazi regime before the nation is crushed in a nearly inevitable defeat. To this end, Colonel Claus von Stauffenberg, an Army officer convinced he must save Germany from Adolf Hitler, is recruited to mastermind a real plan. To do so, he arranges for the internal emergency measure, Operation: Valkyrie, to be changed to enable his fellows to seize control of Berlin after the assassination of Der Führer. However, even as the plan is put into action, a combination of bad luck and human failings conspire on their own to create a tragedy that would prolong the greater one gripping Europe.—Kenneth Chisholm (kchishol@rogers.com)",
    "name": "Valkyrie",
    "genres": [
        "Drama",
        "History",
        "Thriller"
    ]
}