{
    "filename": "Wag-the-Dog_script.txt",
    "imdb_id": "tt0120885",
    "imdb_url": "https://www.imdb.com/title/tt0120885",
    "characters": [
        "Winifred Ames",
        "Fad King",
        "Conrad Brean",
        "Amy Cain",
        "Grace",
        "Director",
        "Sgt. William Schumann",
        "Liz Butsky",
        "President",
        "Johnny Dean",
        "John Levy",
        "Tracy Lime",
        "A.D.",
        "Pet Wrangler",
        "Stanley Motss"
    ],
    "dialogues": {
        "Winifred": "",
        "Ames": "We're going to...  Thank you, that'll be all.  John Levy, Staff, and Amy Cain, Press Off....  When it broke, he said one word:  get me Ronnie Brean.           ...did he <u>have</u> the flu...?  Three minutes.  It couldn't have been over three minutes, the Secret Service...  We are virtually certain it isn't...  Don't you want to know if it's true?  Front page.  Washington Post.  Tomorrow.  When do we bring'em back?  It won't hold.  It won't even hold the one day, Ronnie --  We're going to have to explain away the...       Car and a driver, Mr. Brean, the Westgate, Now, please...    What crisis?    It won't hold.   It won't hold, Ronnie, it won't prove out.  What would do that...?        What is it...   It's the rough-cut, the other side's new commercial.     Twenty thousand dollars.    I'm coming with you.  I'll see you at National.     Tell, tell, tell me again.  Tell me again.    We can't <u>afford</u> a war.  I'm not sure we can afford to have the \"appearance\" of a war.  But, but, but, \"they\" would find out.  ...the...  Yes  ...but...    Why?  ...they sound what?  Hold on, hold on, hold on:  <u>Who</u>?     <u>Albania</u>...  Why?  ...<u>nothing</u>...  What did Albania ever do to us?     Top people.  Albanian Desk.  Well, <u>I</u> don't know either, but we <u>probably</u> have one.  Albanian Dusk, C.I.A., N.S.A. roust'em outta bed, sirens blaring....                Waal, Mr. Moss, I wouldn't....      Alright, well, alright:  geopolitically...  You know what?  This is good.  This is terrific, and I'll tell you why:  it's <u>cost effective</u>.  This is....  No, this is great.         ...\"Terrorism,\" and an attempt to infiltrate...          The thing with the Yellow Ribbon...  The hostages, but that was a naturally-occuring...  ...the Yellow Ribbon, but who, who'd profit from <u>that</u>...                 Well, we paid for it, we got the guys on a retainer.  What can it hurt.  I think I should check with the President -- to see what kind of animal he...               Miss, we are going to ask you to sign this little sheet of <u>paper</u>...  This does not have to do with your Deal.  This is for your Security Clearance.    And...she's not an Illegal Immigrant?  Is she?  Can I see her \"chart?\"  Because...      ...can we see the Kitten...?         ...I just hope...            ... they're checking the ratings...uh...  Well, at least we're not seeing the Girlscouts...                ...what's the Long View?  Yes.  That's true.  But...        Telexes to the major...    New York Times, Wash Post, Detroit Register, San Diego BEE, all in emission.  <u>No</u> mention of the Girlscout. None.  I <u>live</u> for midnight, when I can tear another of those suckers off.  Watcha got for me?  We're bring'n im in tomorrow, five AM.  Press thought \"no,\" whaddaya think...?      No rain.    ...this's <u>good</u>...  Is she saying this in Albanian...?   Our adopted land...  ...uh huh...     Catching up on his reading.  Asked about you, sends his thanks.  Speaking of thanks... we puttem back in, what does your fellow Moss want?  Maybe he's just a <u>patriot</u>.  How long you been up, you need a nap.  <u>Nashville</u>...?  You're tired, Ronnie.    ...this is magnificent.  8 days and we bring it back home....     Waal, I gotta tell you.  I've been inside the Beltway fourteen years, and I feel like I Just Got My Feet Wet.  And if you <u>think</u> about it:  if you <u>think</u> about it, what <u>Is</u> war...?  What <u>is</u> war?  I mean, aside from the <u>killing</u>, and, all... <u>that</u> isn't so pleasant, ... you in the Service...?             You missed your <u>plane</u>?  My <u>life</u> is over. My <u>life</u> is over.  What have you <u>done</u> to me?  What have I done? Fourteen years of Public Service...  ...fourteen years...  Brazen it through?  Brazen it <u>through</u>?  They're going to hang us out to dry like the <u>laundry</u> --- do you know what we've <u>ddd</u>...  Do you know what we've <u>done</u>, for Godsake?  Do you know what you've....      I'd like to mention a few <u>names</u>, who...  I was acting as a Private Citizen.  Nothing that I've done should be construed as reflecting on the orders or intentions of anyone with whom you may have reason to believe I am connected with. Or in whose <u>employ</u>...  And I take this <u>opportunity</u> to suggest that, equally, I admit to <u>nothing</u>, and that I would like my lawyer present.  As are we all, and I'd like to take this opportunity to suggest that the Security of the country would be ill- served by any, any...any...    And I'd like to point out that I've been on prescription <u>medication</u>, the side-effects of which...              Yes... Hello...? <u>What</u>...?  <u>What</u>...?  We're breaking up, I'll call you from the studio.       What does he <u>mean</u> The Situation has Been Resolved?  What are we gonna <u>do</u> about it...?  What are we going to do?  Oh, God...  Oh, Lord....           A new <u>take</u> on the...  Well, sir, we're coming back, we'd like you to try it out, this evening...   ...this is a snappy song....   All we have to do now is sell it to the President.    He thinks it's too...  Mr. President, this is St...    You <u>need</u> this Schumann fellow?  No.  No...Pentagon says, Army's got'em, they got'm in ...\"Custody\"...  Fine.       It's the Pride of a Job Well Done, Stanley, yes, but it's <u>more</u> than that.  It's the gratitude of your <u>party</u>, and of your <u>President</u>...  Indeed it is.             ...The Albanian Campaign...  We've got to put that, into the Inaugural.  \"I have here, a ribbon.  You haven't seen it before, and you will not see it too often <u>now</u>.  For it is the Proud Possession of a few, a very few Men and Women... it is the Ribbon of the Albanian Campaign....\"  Well, you know, \"The Whole Thing's Theatre...\"    Sergeant Schumann?  My name is Ames.  <u>Welcome</u>.  Uh...Didn't we <u>do</u> this?      Wait wait wait wait wait wait wait wait wait... What did he...what...what's the trouble?  What did he <u>do</u>...?        Much more...uh, he have much more time to \"serve?\"    Yeeaahhh...  Ohmigod ... ohmigod... ohmigod...  And?  NO.  I don't wanna know. What do you <u>mean</u> \"and...\"?  What happens if he doesn't have his medication?    Oh Lord.  What have you <u>done</u> to me?  What have you <u>done</u> to me...?  ...what have you <u>done</u> to me...  ...what are we going to do...?  Well, get on the phone, and <u>get</u> it...    No, no, he didn't mean anything at all...  No.  No.  He didn't mean anything by it at <u>all</u>...  We're just, actually, we're <u>friends</u> of... can we get another <u>pill</u> into him...      Is he dead? Is he dead?  ARE YOU DEAD?  WAKE <u>UP</u>.  You stupid, nun- raping sonofoabitch.... wake <u>up</u>...  WAKE UP.  Do you want to spend the rest of your life in JAIL?  WAKE <u>UP</u>! Do You Know Who I <u>AM</u>???  I'm <u>talking</u> to you...  Oh.  Hell.  And what do we do now?  What do we do <u>now</u>? Boy Producer? Mister Win-an-Emmy, Social Conscience, <u>Whaleshit</u>, save- the-rainforest, Liberal hire-a-convict <u>shithead</u>? Mister Affirmative-Action Peacnik.  Commie... <u>shithead</u>....?        <u>IT DESTROYED THE ELECTORAL PROCESS</u>.  ...where?  ...his Triumphal Plane.  Shot Down.   You can't tell this story.  He's not kidding you. You can't tell this story.  <u>You</u> knew that. The pay off was, you get to be Ambassador, or...  How do we explain <u>that</u>?  ...how do we explain that?  With the World Watching.  But how do we explain the fact he was in prison?      I'm concerned about the driver of the rig.  ...the Harvester...  Well, he doesn't have his Green Card. He Doesn't have his Greencard.    ... you want Schumann saved by an Illegal Alien...?    So-close-and-yet-so-far.  What are you talking about?  He's <u>dead</u>. He's <u>dead</u>. The Fella Killed Old Shoe.     Could we have you in here, please...7",
        "Fad": "It's a, it's a... It <u>can't</u> be a ribbon...  It can't be a ribbon cause AIDS had a ribbon, cause the Yellow Ribbon thing had a ribbon, cause...  Keep Talking....    They look stupid.  We had Davy Crockett hats, but you could <u>crush</u>'em ... you could <u>crush</u>'em, see, when you felt stupid. Crush'em, put em in your Pocket.  You can't put a Mountie hat in your...  ...what am I <u>doing</u>?  Do you see me working...? Here's what you want to do, you want to come out of the box, an item, someone 'ready <u>has</u>, but <u>then</u> you sell it to'em.  Torn <u>jeans</u>, uh ... faded Levi Jackets, uh... uh...  I gotta get something, I gotta get ...shoes?  Ties? Hats...?  ...what is this?  I go with this here...  Shoes, Hats....  Black...  Well, <u>that</u> ain't very butch, is it?  ...I meant the Leopard Skin...  Thank God this is America.        Kid comes to School.  Teacher:  You're late for Geography Class.  Kid:  I din' get my breakfast. Teacher:  siddown, where's the Canadian Border.  Kid: In bed wit My Mom.  That's why I missed my breakfast...  Does it <u>have</u> to be Albania?  Because, lookit: I can get my hands on a lot of walking-around-cash, I think, if it's <u>Italy</u>...Look at the tie-in here:  <u>The</u> <u>Boot</u>, \"Givvem the <u>Boot</u>,\"... If we were to go Wide with a <u>shoe</u> as the fad.  A \"Shoe-fad\"...  Here's what it offers us...  Well, let's not be too sure, why is that?      The Canada Thing was a shuck.  A <u>shuck</u> -- wasted a day. What can you do with Canada?  Bears, mapleleafs, \"sugar -on-Snow.\"  Lays there on the plate like a lox.   It's like those Japanese in the Caves on Okinawa... didn't believe the War was Over.     Yeah, I need a list, people in Military Special Pro...      All part of the Service we Render.  When do you bring'em back?  Schumann.  Where is he?  See y'at the Finish Line.",
        "King": "Good morning:  With the election eleven days away the world slept, expecting news from the President on <u>Trade</u> and his visit to China, another <u>sort</u> of news, however, has emerged from the Presidential Quarter.  Chris Andrews, station KCRT, Santa Fe Reports:            Seventeen percent.          Sexual relations with a girl thirteen years old.       It's a, it's a... It <u>can't</u> be a ribbon...  It can't be a ribbon cause AIDS had a ribbon, cause the Yellow Ribbon thing had a ribbon, cause...  Keep Talking....    They look stupid.  We had Davy Crockett hats, but you could <u>crush</u>'em ... you could <u>crush</u>'em, see, when you felt stupid. Crush'em, put em in your Pocket.  You can't put a Mountie hat in your...  ...what am I <u>doing</u>?  Do you see me working...? Here's what you want to do, you want to come out of the box, an item, someone 'ready <u>has</u>, but <u>then</u> you sell it to'em.  Torn <u>jeans</u>, uh ... faded Levi Jackets, uh... uh...   I gotta get something, I gotta get ...shoes?  Ties? Hats...?  ...what is this?  I go with this here...  Shoes, Hats....  Black...  Well, <u>that</u> ain't very butch, is it?  ...I meant the Leopard Skin...  Thank God this is America.          Kid comes to School.  Teacher:  You're late for Geography Class.  Kid:  I din' get my breakfast. Teacher:  siddown, where's the Canadian Border.  Kid: In bed wit My Mom.  That's why I missed my breakfast...  Does it <u>have</u> to be Albania?  Because, lookit: I can get my hands on a lot of walking-around-cash, I think, if it's <u>Italy</u>...Look at the tie-in here:  <u>The</u> <u>Boot</u>, \"Givvem the <u>Boot</u>,\"... If we were to go Wide with a <u>shoe</u> as the fad.  A \"Shoe-fad\"...  Here's what it offers us...  Well, let's not be too sure, why is that?                                 The Canada Thing was a shuck.  A <u>shuck</u> -- wasted a day. What can you do with Canada?  Bears, mapleleafs, \"sugar -on-Snow.\"  Lays there on the plate like a lox.     It's like those Japanese in the Caves on Okinawa... didn't believe the War was Over.     Yeah, I need a list, people in Military Special Pro...                         All part of the Service we Render.  When do you bring'em back?  Schumann.  Where is he?  See y'at the Finish Line.                A slight, a slight, well, no, we're gonna <u>deal</u> with it, we just, I need a little readjustment...we need to re<u>think</u>...",
        "Conrad": "",
        "Brean": "Alright.  Look here, any of you kids hear in this room:  what you hear here, what you say here, what you <u>do</u> here, f'it got out, you leaked it. Tell'em what they need to know.          1.)  Statutory Rape. 2.)  The President's long-documented mental problems 3.)  Brought about by reaction to Drugs to control flu...?      This ain't the illegal immigrant Nanny.    Okay.  And she's alleging...?     Who's got the story?  What difference does it make if it's true? It's a <u>story</u>, and, it <u>breaks</u> they're gonna have to <u>run</u> with it -- How long've we got til it breaks?  Well, yeah.  Now.  That's not good.  <u>Okay</u>: <u>Okay</u>.  We'll set up the War Room <u>Here</u>...  Thank you.  Now:  where is he?  When's he coming back...?      ...you the Press Office?    You gotta give me a day.  I need a day. He's sick, get it out <u>now</u>.  Get him on the phone'n tell him how sick he is.  We got to get it out before the story breaks, so we aren't quote, responding to it. Issue is as a bulletin.  He's got some rare strain of...  All I need is the one day.  Yes -- It will... Now:  why is the President in China?  You're goddamn right.  And it's got nothing to do with the B-2 Bomber.  That's what I'm telling you. The two things:  the two things:  Rare strain of flu, No Cause to Be Alarmed.  And the B-2 Bomber... Clear me a space.  Get me a copy, go rob one, get it off the computer, Wash Post, N.Y. <u>TIMES</u>,  Naw, we can't play this one catch-up.  That's how long since you stopped beating the wife.  We have to...  They caught him in the closet with a Girlscout.  Side- effects of a pill ain't gone trump that.  You have to keep'em guessing for Two weeks.  You  don't have to Cure Cancer, Pal, you just have to give them something more interesting than...  Well, that's what we're <u>doing</u> here...       Okay, look, who's takin' the press conference today?  What do <u>you</u> think?  What I need from you:  I need a base of operations.  Some place in the District.  I need some clean <u>money</u> ...  And, to hold it together, I need two days.  There <u>is</u> no B-2 Bomber:  here's what you do ahout that:  whoever is leaking stuff to that geek at the Post, lets it slip, \"Geez, I hope this doesn't screw up the B-2 Program...\" \"What B-2 Program, and why should it screw it up?\"  \"If the president moves to deploy the B-2 before it is fully tested.\"  \"Deploy the B-2, <u>Why</u>?\"  \"In the Crisis.\"  I'm working on it.  Same time, you call Billy Scott at Joint Chiefs, and pour him onna plane <u>right now</u> to Seattle, y'got that...?  All flustered and worried. To talk to the <u>Boeing</u> people.    Where'd you go to school, Kid.  Wellesly?  Then show a little spunk.  There <u>Is</u> no B-2 Bomber, General Scott, the best of your knowledge, is not in Seattle to talk with Boeing...  One day, Two days?  <u>Course</u> it's gonna hhhh....   We don't need it to prove out.  We need it to <u>distract</u> them for two weeks til the election.    I'm working on it.      Gimme twenty thousand dollars.  I'll be back within the hour.  Now,   What is it?  That's <u>our</u> commercial. I've seen it.  That's <u>our</u> commercial.    What is this?            ....we landing?    We aren't going to have a war.  We're going to have the \"appearance\" of a war.  What's it gonna cost?  Who would find out?  The American \"people\"?  Who's gonna tell'em.  What did they find out about the Gulf War?  One shot: one bomb, falling though the roof, building coulda been made of <u>Legos</u>.    ...that's the general idea.  Why <u>not</u>, what've they ever done for <u>us</u>...?  Also:  they sound... Ah, you see, this is why we have to mobilize the B-2 <u>Bomber</u>...  <u>Shifty</u>.  Who knows anything <u>about</u> em...  Well, I'm gonna hold on, but you went to win this election, you better change the subject.  You wanna change this subject, you better have a War.  What do you need?  It's gotta be <u>quick</u>, it's gotta be <u>dramatic</u>, you got to have an <u>enemy</u>.  Okay?  What do you need in an enemy?  Somebody you fear.  Who do you fear? Som'b'y you don't know.  Well, I'm <u>working</u> on it....     Yes.  What do you know about them?  Precisely.  What did they ever do <u>for</u> us...? You see, this is why we have to mobilize the B-2 Bomber.  Here's what you got to do: Get your Press Office, Right now.  To deny;  There <u>is</u> no report of Albanian Activity.  They have to deny it. Now, get the C.I.A.           Well, I don't know, a lot of these early reports are inflated.  ...who understands Human Nature?     ...how can any of us know?  I'm sure that's the worst of it.  Well, it ain't over til it's over...    How's he doing?        We have some mutual friends in Washington.      I'm here, Mr. Moss, because you've shown yourself a great supporter of the Party.   What one has to do, Mr. Moss.  Is to fight a holding action.  If we can hold the break-in-the-dam for ten days, til the election, we...               String a few together.  All I need's eleven,  What do you think would hold it off?     I'm gonna <u>tell</u> you why...    Here's the Short Course:  Fifty-Four, Forty or Fight. What does <u>that</u> mean?  Remember the Maine...  Tippecanoe and Tyler, Too!  We remember the slogans, we can't even remember the fucking <u>wars</u>.  Y'know why.  Cause it's <u>show business</u>. That's why I'm here.  Naked girl, covered in Napalm. Five marines Raising the Flag, Mount Suribachi. Churchill, V for Victory, Y'remember the Picture, fifty years from now, they'll have forgotten  the war.  Gulf War?  Smart Bomb, falling through the roof.  2500 missions a day, 100 days, <u>One Shot</u> of One Bomb.  The American people bought that war. M'I getting through to you?  War in the Balkans, don't mean nothing, till some G.I. flyer, went down, Eating Snakes for Ten days. N'then It's show business, Mister Moss.  That's why I'm here.  It's like being a producer, Mr. Moss.  The Things in Trouble.  Somebody's got to wade in, save the thing. You get the Actors get up there, and strut and <u>Posture</u>.  But somebody, knows what's what, got to jump in and Save the Thing.  Why not?   Who?  \"They Got To Know?\"  <u>Stan</u>...?  Get with it.  Who Killed Kennedy...?  I read the first draft of the Warren Report, said he was killed by a Drunk <u>Driver</u>.  You watched the Gulf War.  What did you see?  Day after day, the one \"Smart Bomb\" falling into a building. The <u>truth</u>, I was in the building when they <u>shot</u> that shot, they shot it in a studio, Falls Church Virginia, 1/10th scale model of a building.  How the fuck do <u>we</u> know.  You take my point?  It's not \"war.\"  It is a <u>Pageant</u>.  It's a <u>Pageant</u>... Like the Oscars... why we came to <u>you</u>...  N'it's a crying shame.  But you <u>staged</u> the Oscars...  And <u>if</u> you never won an Oscar, How'd you like an ambassadorship...  Well, no, well, you couldn't <u>tell</u> any...  ...that's what it is.  It's Miss America, N'you're Bert Parks.  Because.  I'm sure they do.  \"Freedom.\"  ...who is this guy...?  We don't need an Act Two.  We've just got to hold their interest for ten more days, till the Election.  It's a teaser, absolutely right,          W...what?  \"Back End\" ... count on it.  It's like that thing with the Yellow Ribbon...  The Hostages...?   In the yellow ribbon.      I gotta protect the Canadian Horder,              ...what is this?       Three-o-three...         We're locked into Albania.           Eh, Trudy, could I <u>talk</u> to you for a moment...?  You know, this project is a... \"Funny\" kind of...        ...someone would come to your house and kill you. <u>Hello</u>... we're about to start shooting...       We'll be back tonight.  Waal, that's where you <u>want</u> em...      Innit?                              ...take a long view.  Your guy gets four more years in Washington...  ...it's only Nine More Days.        ...what the hell's <u>this</u> all about, d'you think?               Eight Days To Go  Big Bird touches down <u>when</u>?  Anything at the Airport?         And carrying. The National Flower of Albania, something..... Now Is it some Festival?  Some <u>Harvest</u> Festival, something...  ...got to be <u>something</u>.  She gives him the sacred... And tells him:  this is the Traditional Harvest Offering, given to the Man who Ties the First Sheaf, the last sheaf, whatever the fuck it is...  Stanley Moss, Ladeesngennlmen... And she says...       ...but to the Old World; you are stilling the forces of hatred and of War which have, since I was a child...  Now, the Old Lady starts to <u>Weep</u>, Big Bird shrugs off his secret <u>Service</u>, goes to her, and covers her with his own coat.      How is Big Bird holding up, by the way?  Knock on wood.  <u>I</u> dunno.... Ambassador to <u>Togo</u>, somethin', <u>I</u> dunno... he...  Yeah...what was I talking about...?      We're gonna do the <u>Team Song</u>.  Y'wanna follow the Cattle Drive?  Sleep in the Winter. What does <u>Moss</u> want...?  Matchmaker comes to the Levinsky Family.  Mr. Levinsky, Mrs. Levinsky, would you entertain an offer of marriage for your son Saul, from Princess Margaret of Great Britain.  Well, they think, she isn't Jewish, but she's well to-do, a nice old family.  Alright, yes, they say.  We would consider such an offer.  Wonderful, matchmaker says, My Job is Half Done. Now, Look:  I got the <u>file</u>, from the L.A. contingent, I got the day-by-day, of how...  ...Stanley Moss...     None of these are ours.  <u>None</u> of em are ours.... ....that's <u>real politik</u>, Buddy.         Feel free to talk to me.     ...I just missed my plane.  Well, keep your <u>wits</u> about you, and let's see if we can't...  ...brazen-it-through...   My name is Ronald Brean.  Nobody whose name you want me to say, Mr. Young, I promise you.  S'only got to hold for another few days.  What <u>are</u> you interested in?    I'm doing my job, Too. Would you give me a... do you think you could call off your Dogs for a minute.    I have a question for you.  Why do people go to war?  Why do they go to War?  Would you go to War to do that?  Well, I have, too.  Would you do it <u>again</u>...?  In't that why you're here?  I guess <u>so</u>.  N'if you go to war again, who is it going to be against?  Your \"ability to fight a Two-ocean War\" against who?  Sweden and <u>Togo</u>? Who you sitting here to Go To War Against?  That time has <u>passed</u>.  It's <u>passed</u>.  It's <u>over</u>.  The War of the Future is <u>Nuclear Terrorism</u>.  It is and it will be against a Small Group of Dissidents who, unbeknownst, perhaps, to their own <u>governments</u>, have blah blah blah. And to go to <u>that</u> war, you've got to be <u>prepared</u>.  You have to be alert, and the <u>public</u> has to be alert. Cause that is the war of the <u>future</u>, and if you're not gearing up, to fight <u>that</u> war, <u>eventually</u> the axe will fall.  N'you're gonna be out in the street. And you can call this a \"drill,\" or you can call it \"job security,\" or you can call it anything you like. But I got one for you:  you said, \"Go to War to protect your Way of Life,\"  well, Chuck, <u>this</u> is your way of life.  Innit?  And if there ain't no war, you can punch out, go home, and take up Oil Painting.  And there <u>ain't</u> no war but ours.        ...the young girl in the video, the Albanian Girl....    ...she's running, it's some sacred... some ancestral <u>land</u>, cloven by the Brook named.... give it to Moss,  <u>Thank</u> you.              Uh huh.     President's speech.  No, no, no, no, no <u>after</u> the airport.  He just got Hip to us. He just ended the War.      The War is Over.  Senator Nole just ended the War.  Yep.  Well, we started it, he Ended it...  The C.I.A.  ...those limp-dick ... <u>turncoat</u>... I <u>thought</u> they let us out of there too easy.....     I saw it on TV.    Hello...?     This's Fantastic...  What're you gonna do with Morse Code?  Yeah...?    Hello?    He can't respond to the Allegations. I don't care <u>how</u> many girlscouts are picketing the ... look, look, look, we're coming home with <u>Gold</u>.  Eh? Tell him to hold firm for <u>two hours</u>... coming home with Gold.     I think it's fine?  No, it's... I'll, yes, I'm holding, but... No, it's ...      In the Folk Music Section.  We'll be in in...       ...this the Guy.  Where is he now?  ...we get our hands on him?  What's the thing with Morse Code...    Who said, \"I care not who writes a country's laws, so long as I can write its songs...\"?  Stanley Moss, folks...  No, I'm telling you, this guy, <u>this</u> guy is <u>aces</u>, this guy is the Kitty's Sleepwear, <u>this</u> guy, they should of given him <u>every</u> Oscar.  <u>Every</u> Oscar.  This is the...        Tonight, you remember some <u>song</u>, from your <u>folksong</u> days, something about a Good Old Shoe...  You're with him tonight, watching the President's Speech, when the President...  <u>Lure</u> him.  Well, darlin' <u>I</u> ain't your confessor.  Tell him you've got some info on the President's sex scandal, it's on your conscience, believe me, he'll drop what he's doing.  Okay;  <u>Now</u>:  Folks, folks, folks, this is a shitty business, and it needs no Ghost Come From the Grave to tell us that.  But in Six Days, Lord willing n'Jesus Tarries, I am going to take you beauties into the second term. .....wait til you hear the speech tonight.  The 3-0-3 Speech... where's the Fad King, by the way...  When you... What?  I'm busy.    <u>Hello</u>. What?  What do you mean he won't do it? He won't do <u>what</u>? He won't do the sp... It's what?  It's <u>corny</u>?  <u>Corny</u>?  Is that the word?  Of <u>course</u> it's corny.  We wouldn't have him <u>say</u> the flippin' thing it wasn't corny.  Put... listen, it's not a question, we're locked <u>in</u> to this speech.  NO We're, Are You Listening?  LOCKED IN.  We're, we're playing way <u>past</u> it, we're <u>past</u> it -- it's the set-up for...he has <u>got</u> to say the speech. Tell Ames to meet me at the West Gate in...    First of all, we're locked <u>in</u> to it, <u>secondly</u>:    Ronnie says we don't need'em for another four days. ...s'there a problem?  How's your wife?        Not bad for government work. Having a good time.       Mmm...  Mmm.  Hey, our job ends at the Finish Line.  Just for the Symmetry of the thing...?  If they can give Kissenger the Peace Prize, I wouldn't be surprised to wake up and find I'd won the Preakness.  Yes, but there wasn't a War.         Ya got to hand it to the Fad King.  Yeah, well, that's why we're flinging them away...      What about it?  Well, well, well, well, wait a minute, we got 86 percent.  We bring'em back <u>tomorrow</u>, the charts go up, they don't go <u>down</u>...   I don't wanna tell them their business, but why not wait to give it to him <u>after</u> the election.  When he's gonna need some help....    <u>King</u>...    Out in Oklahoma.  Inaugural Speech, press corp's gonna be jealous of giving up that one...  Hell of a Ride, Stanley...                  I would be, I could remember how all the pieces move...                    Ain't <u>that</u> the truth.  What am <u>I</u> gonna do?  I'm gonna \"Fade Away.\" What are you gonna do?      We pick up Schumann.  Sneak him back inside the Beltway. And we plan his homecoming.  Zt's gone be Neil Armstrong, Dr. Livingston, and <u>Lindy</u>...They're gonna forget, they're gonna forget, they're gonna forget that there <u>is</u> an election...The Pres's gonna have to say, one of his speeches, \"Don't forget to Vote...\"       Medal.  Medal and Ribbon.  The Albanian Campaign.  That's not bad at all.  Napoleon said, fellow won't sell you his life, but he will trade it to you for a little piece of ribbon.  We <u>were</u> the Albanian campaign, John -- <u>We Were There</u>.  Well, c'n we get him back home?   They should be.  Most valuable animal since Sea Biscuit.  <u>Isn't</u> he...  You've <u>got</u> something, there...      ...a masterpiece...       Whaddaya think?     Never quit a winner.  They insist they wanna go with meeting him at the airport.  I told'em they're wrong, I can't convince'em. They're concerned that the last kid had the <u>Wheat</u>. Variations include, the kid is a <u>boy</u>, the kid is <u>twins</u>, it's a little <u>dog</u> ... they rub meat on Schumann's cuff, the dog runs to him...     Key to the manacles...      ...how ya doing?  Yeah, well -- it's only one word difference.      Yeah, Captain, uh, yeah, Captain, uh, y'better get us back to Washington.    How are'ya...         Wilfred.  All Combat takes place at night, in the Rain, and at the Junction of four Map Segments...  Speaking of that... We're gonna need a whole lot <u>more</u> of this....    Cause I don't think <u>this</u> dog is gonna hunt....  Yeah, well, perhaps... Speaking of which:  I have a <u>prescription</u> here, I'm going to give you the <u>number</u>, I need you standing by with a <u>crate</u> of the stuff.... it's ... what is it?      Uh huh...  Uh huh...  What <u>kind</u> of stuff? Hello...?         \"Hush little baby, don't say a Word...Pappa's gonna buy you a Mockingbird, if that Mocking bird don't sing, Poppa's gonna buy you a diamond ring...\"  ...kid complains, kid cries, gets more junk, junk don't work, kid cries, gets <u>more</u> junk.  End of the song, house full of worthless junk, the kid's still crying. Story of America...  I think we were experiencing a Little Technical Difficulty.      News.  Like a Wedding Cake.  Tons and tons of sticky sugar, Barbie and Ken on top... Can't ya Talk, you sonofabitches...?  Eh?  I'm like the Rest of America.  I don't <u>care</u> -- I'm just <u>addicted to it</u>...     Wake up.  Courage, Mom.     Y'know what else bothers me?  \"Shh lil baby, don' saya word, papa's gon buy you a mocking bird...\" The baby don'say a word, WHAT THE FUCK IS THE  Uh huh...why?  We have no home.  We're vagrants.  N'each man's hand's against us.  We killed Old Shoe... We killed the Schuster...spend our life in a packingcrate...Where are you <u>going</u>...?    I'm tired.  He's supposed to be flying in from Europe.   You can't tell this story.  Some'b'y'll have you killed.  And what the fuck story are you gonna tell?  The guy is a <u>nutcase</u>.  He raped a <u>Nun</u>...  He's doped to the <u>Gills</u> ...  ... and he spent the last twelve years in a Milit&amp;ry Prison...      No, I'm fine... I got it together....  You got a dime....?           What about him?  Well, what do you want to do about it? What do you...  They'll be here in ten minutes.             ...coffee...?     Hell of a show.  Hell of a job, Stan.  Naw, naw, we own the airways...  ...events.  No.  You're right.  A proud tradition.  What're you doing?  No, I don't think you can <u>do</u> that.  No, I don't think you can <u>do</u> that, Stanley...  Stanley.  Stanley... you knew the... Stanley. You knew the deal when you signed <u>on</u>.  No, the deal <u>isn't</u> changed.  The Deal <u>isn't</u> changed. You can't ... what is it?  Money?  <u>Money</u>?  You want Money?  But you always knew you couldn't <u>take</u> the credit....    Stanley, no fooling... no fooling... you're playing with your <u>life</u> here...  Stanley, you can't do this....",
        "Amy": "",
        "Cain": "It can be documented that he displayed the...  There was a group of Girlscouts here from Indiana last month.  One of them expressed an interest in a Frederick Remington bust.  The president took her into the oval Office, for a period...   ...why?  ...Yes.    What's more interesting than boffing the girlscout?  Is there a press conference today?  But there isn't a B-2 bomber.  Dartmouth   ...getting the speech for the White House...? Good.  Good.  Because he's....",
        "Grace": "I have the White House on the Line.  ...good title for a movie....  Isn't Johnny Green in the...   Public Domain.  We-are-mobilizing-to-defend-<u>her</u>.  No problem.  Here's the...  Good.  Good.     We got the Albanian Girl, with a cat, with a kitten, with a <u>dog</u>...    The Pet wrangler has <u>also</u> got a...  Better.  Yes.",
        "Director": "Alright, now we're gonna...  Just, uh, just hold the bag when you run.  We ready out there...?",
        "Liz": "Why can't it be a ribbon?    Uh...uh... Mounties.  The Mounties Guard The Border. uh... those Mountie Hats.  We had Davy Crockett hats... They made a fortune.  The special hats of the Special Anti-terrorist detachment of the Border Patrol.    Oh huh...  I'm just talking about the Hats.  A beret.  Cause you can crush it and put it in your pocket.  Leopard Skin...  ...their Leopard Skin Berets....  It's a <u>beret</u>...    British Regiments drape their drums in Leopard Skins.  I need a ruling on the Hats.  I say a Leopard-skin, and...   ...wanted to go with Roman Numerals... but there isn't a Roman Numeral for Zero, so, you can't really do THREE OH THREE, in Roman...  ...and I wanted to ask you if you thought it made sense that the uniforms of the <u>Freedom</u> fighters were <u>starched</u>. I know that, <u>traditionally</u>,     ...anybcdy know Latin.   I need a Latin Motto, anybody know n'y <u>Latin</u>...?",
        "Butsky": "",
        "President": "My fellow Americans.  I apologize for the need for <u>secrecy</u>.  I assure you that had it not been necessary to ensure the safety of our men and women in the Combat Arms.  The Republic of Albania, long a staging ground for terrorists around the World, is in the procesa of mounting ... <u>actions</u> directed against the people of the United States.  In consultation with my advisors, I have elected to take the following precautionary measures:    That a state of war has existed, between the United States, and...           ...between the United States and Republic of Albania, and that the Congress Authorize any and all measures consonant with a swift and painless, and <u>victorious</u> conclusion of that War.                           Thank you, would you be seated, please. Ladies and Gentlemen... I thank.  A merciful God.  And I am sure each and every one of us will thank that Supreme Power, whatever we conceive that power to be -- that peace is at hand.   ...That peace is at hand...    The threat of Nuc1ear Terrorism has been quelled.  We are in <u>contaot</u> with the Albanian Premier, who assures me, and this government <u>credits</u> his assurances, that his country does not wish us ill, and <u>has</u> not.  That the threat which we perceived was not of his wish, or of his making.   From whence did it come?  Our information states it came from a small group of armed, dissidents.  Of Armed and Violent Dissidents...    But that group has been, in the main, subdued.  Now: How did we come by this information?  And.  Who subdued that group?   It falls to me to <u>reveal</u> to you a <u>secret</u>. To reveal the existence of a secret group of warriors. Men, yes, and <u>women</u>, trained and pledged their <u>strength</u>, their <u>skills</u>, and, if called upon, their <u>lives</u>, in the service of their fellow Americans. A group so secret, its very existence has been known to just a few, and known not by a Name, but by a Designation Number, Three-Oh-Three...       And I can only say, to those family members, <u>of</u> group 303, which members are, I know, as I speak, gathering to comfort you, the parents of the missing man, I can only say,  ....and the Albanian Government <u>joins</u> with me, that no, I repeat, <u>No</u> effort will be apared, to find...      You will see his sweater is <u>worn</u>...it has been unraveled in places, and those places form dashes and dots.    Dashes and Dots.  And those dots spell out a message in the Morse Code. And that message is, \"Courage, Mom...\"     ...a proclamation of a Day of National <u>Rejoining</u>...    My fellow Americans.  ...he is down <u>safely</u>, though the flight crew perished in the crash.  He will be transhipped, we are informed he has sustained <u>minor</u> injuries, which will require his being medicated for some time, but, I am assured...",
        "Johnny": "It's tough to rhyme.  Albania, Albania, Albania, James bond Villains.  Jim Belushi...?  They guard our, <u>you</u> know ... \"borders,\" night and day...        I got it!  Naaa.  Fuck that.  <u>Fuck</u> that...    Y'like it?  Wait'll you get to the <u>bridge</u>...    Just try it.",
        "Dean": "",
        "John": "<u>BORDERS</u>...\"   It's tough to rhyme.  Albania, Albania, Albania, James bond Villains.  Jim Belushi...?  They guard our, <u>you</u> know ... \"borders,\" night and day...        I got it!  Naaa.  Fuck that.  <u>Fuck</u> that...    Y'like it?  Wait'll you get to the <u>bridge</u>...    Just try it.",
        "Levy": "China.  Touchdown, Andrews, fourteen hundred, today.  Trade Re1ations.  There <u>is</u> no B-2 Bomber,  How much...?             There, uh, I'm not aware of the situation to which you refer.  Mr. Sklansky, Mr. Sklansky, I am I am unaware of any, um, \"situation...\"  The B-2 Bomber? The B-2 Bomber...?  There <u>is</u> no B-2 Bomber.  Mrs. Rose...  Uh...Mrs. Rose, there, to the best of my knowledge, there <u>is</u> no...",
        "Tracy": "",
        "Lime": "",
        "A.D.": "...we're going for a direct buy-out.  Okay, settle, people.  Settle... we're gonna try one...",
        "Pet": "Lhasa Apso.  What you have here is a cross-breed, between a dog which was substantially a...",
        "Wrangler": "Lhasa Apso.  What you have here is a cross-breed, between a dog which was substantially a...",
        "Stanley": "",
        "Motss": ""
    },
    "imdb_rating": "7.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMzRkZDVkMDItYjk3Mi00NDkyLThmODUtYzhkN2EwZmE2ZTljXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UX380_CR0,17,380,562_.jpg",
    "description": "After being caught in a scandalous situation days before the election, the president does not seem to have much of a chance of being re-elected. One of his advisers contacts a top Hollywood producer in order to manufacture a war in Albania that the president can heroically end, all through mass media.—Christy",
    "name": "Wag the Dog",
    "genres": [
        "Comedy",
        "Drama"
    ]
}