{
    "filename": "War-Horse_script.txt",
    "imdb_id": "tt1568911",
    "imdb_url": "https://www.imdb.com/title/tt1568911",
    "characters": [
        "Albert Narracott",
        "Michael",
        "Gunther",
        "Sgt. Fry",
        "Maj. Jamie Stewart",
        "Capt. Nicholls",
        "Grandfather",
        "Lyons",
        "Emilie",
        "Andrew Easton",
        "David Lyons",
        "Rose Narracott",
        "Ted Narracott",
        "Lt. Charlie Waverly",
        "Geordie Soldier"
    ],
    "dialogues": {
        "Albert": "That's Mooney's colt!  You bought him?  No. 9.  No. No, please don't take him back.  I'll train him.  Please, Mum. Please let me. I can do it.  Right. Let's make a start then.  It's oats. Very tasty, that is. It's beef and gravy to us!  Come on...  I bet you're missing your mother. Look at you... first time without your mum. First time away from home. But you're not alone, are you. In fact. Cos I'm `ere...  It's alright. It's alright. 11.  I'm gonna call you Joey. Understand? Joey. That's you. And I'm Albert. It's alright, You're mine now. You're mine.  Whoa. I want you to stay there, Joey. Stay. That's it. Good boy. That's it, you've got it.  Right, come on, Joey. Back you go. Come on. Back you go. 12.  You're all right. That's it. Good boy. Right. You've gotta stay there, understand?  That's it. Good boy. You've got it. Good boy.  Come now, Joey. Come on.  You can come now, Joey.  No, I read it in a story. It's how the Indians used to summon their horses.  Now, Joey, when I whistle, you've gotta come, understand?  He's not a dog. He's just puzzling it through. 13.  What if he doesn't?  No, please. Sir, you can't do that.  You can't harness him.  No, you can't. Look, you're scaring him, Dad. You're scaring him. He... He can't take a plow!  He won't be able to do it - he's too young - he's not even been backed yet....  It's alright, boy. It's alright. It's alright. It's alright.  Dad?  Dad. Stop.  You were right what you said, Dad. \"He'll do it,\" you told Lyons, \"He'll plow that field.\" And he will! You'll see. He'll show you. We'll show you. We'll get it done.  How are you today, Joey? I don't know much about life, boy, but I do know that there are big days and there are small days. And most days are small days, and, well, they don't matter much to anyone - but this - well, this is a big one. This is our big day. Well, it's cold out there. So I'm going to take this off -  Well, if it's tough for you - it should be tough for me, too... 18.  Now, I'm gonna teach you how to plow and you're gonna learn. Is that understood? And then we can be together, which is how I believe things are meant to be.  Boy. Steady, boy. Here we go. Here we go.  Easy, easy... Look at me, Joey. See? See? You've just gotta put your nose through.  That's it. See? You've got it. You've got it. Good boy. There...  See Joey - I got the collar, too!  Come on, boy. Walk on. That's it. Walk on! Walk on, Joey. Come on, boy, walk on.  Walk on, Joey! Walk on! Come on, Joey, walk on. Walk on, boy.  Walk on. Come on, walk on.  Good boy. Good lad. Good lad. Now walk on. Good boy.  Do you know - I believe we can do it, Joey. I knew when I first saw you that you'd be the best of us. That's why he bought you. He knows you've all the courage he never had. I knew when I first saw you that you'd be the one who'd save us.  Whoa. Whoa.  Now, boy! You've got to do it, Joey. You don't know, so I'm gonna have to do the knowing for you when the rest of our lives depend on this! So get set to pull - and pull straight! And pull hard!  Now, boy! Go!  Walk on, Joey! Walk on! That's it! Good boy, Joey! Good boy!  Whoa, Joey! Whoa, Joey! Joey! Joey, whoa whoa whoa! Joey, stop! You'll break the blade - 24.  And where's Dad?  Stumbling about, I suppose.    Well, he don't talk to me about it.  Not dad's?      I'm not stealing it. I'll give it back to him, someday.  Come on, boy, let's show her how to fly! 30.  Well...you're clearly not gonna be a jumper.  We can try planting something else, or we could hire ourselves out to Uncle Bob.  How else we gonna pay Mr. Lyons' rent? 31.  Look smart, Joey lad, it's the Tavistock Fair!  What has he done with him?  You can't! You can't, he's mine! I trained him! 34.  You can't have him. He's my horse, sir.     Well, if Joey's going, I'm going, too. I'm volunteering.  Albert, sir.  Nineteen, sir.  No sir. But, but I look nineteen and I'm bigger than most nineteen-year- olds, sir! And I'm strong, sir! And I...I'm not afraid of anything.  It's all right, boy...  Joey...  This isn't the end. This isn't the end, my brother... I, Albert Narracott, solemnly swear we will be together again. Wherever you are, I will find you. And I will bring you home! 37.  Well, who'd be sending me a parcel over there?  It's a sketchbook...  That's Captain Nicholls' sketchbook! See that? That's a picture of Joey!    All right. \"Dear Albert Narracott. 52.  Captain Nicholls, who died...Captain Nicholls, who died in action today left you this. Yours, Sergeant Sam Perkins.  He was riding Joey when he died.  \"In action,\" it says.  That's my business.    Remember that day me and Joey raced you in your car?  Who was that girl you were with?  There was. Don't you remember? 78.  You know what it reminds me of out there? 79.  That bloody impossible lower field the day me and Joey plowed it. Best day of my life that was and you were there.    It's good. Andrew, it's good. Andrew! Nobody's retreating today. Andrew! Andrew! Nobody. Is retreating. Today. 81.  You'll be all right here. You'll be safe. Someone'll come for ya.  It's all right. It's all right. We're Devon boys, yeah?  We made it. We made it.  Andrew, this way out!  What is it? 98.  What kind of an horse?  Miraculous horse...  Joey?    Narracott, Private Albert Narracott, sir.  He's not random at all, sir! He's my horse, I raised him, in Devon. Sir, look at his legs! He's got four white socks, he's brown all over - (points to his own  You see, sir? He's not random at all.  Thank you, sir.  I don't understand, sir.  Does the Major know?  Sir, I'll give you all your money. Everything you paid when we get back to England. I'll give you twice -  Oh, but you're wrong, sir, I know everything!  Don't be worried, boy, when I go. I won't worry over you none. Hey, I found you, didn't I, and you found me.  And we'll both... we'll both know that we made it through. Now go on.  We're the lucky ones. Always have been. Lucky since the day I met you.  God be with you, sir.  It's my father's. It's his regimental pennant. How did you come by this, sir?  Thank you ever so much for this, sir... 108.  What was her name?",
        "Narracott": "What have you done?  You were supposed to buy a plow horse.  What'd you pay for him?  How much, Ted Narracott?  Thirty guineas!  He's not worth ten! Are you out of your mind? What about the rent?  How the hell are we gonna pull anything with that? Ted - you have to take him back. You have to take him back right now now.  You have to get down on your knees and beg for our money back.  And how are you gonna train a horse with that leg?  No, you stay out of this, Albie. You don't know nothing about horses.  Right. Well... you've got one month to break him in or I'm taking him back myself. (She turns to the house, but then... How did you get to thirty - what other fool bid you up that high?  We're gonna lose everything. After all we've been through - we're gonna lose it all. 10.  Well, you better. Go on - get started. See if a child can undo what your fool of a father's done to this family of ours.  Albie.  Please, sir. Please.  Harold the goose attacks Lyons and his men. They quickly pile into his car and drive off. Ted stands in the kitchen immobile with upset.  Ted!  I knew this would happen soon as I laid eyes on him....  Ted. No. Ted, no!  You shoot that horse we have nothing. 17.   Here, here. Some days are best forgotten. Today ain't one of them. Come on.  You'll likelier lose an eye, Mr. Lyons, if you carry on prating at me how to manage my son! Or my plow, or my horse, or my field, or my farm!  Come on, Albie! Push on through!  Here. It's his campaign pennant. He were Sergeant, Seventh Battalion, Imperial Yeomanry.  Albert and Joey are now in a meadow. They trot past the field he plowed, now packed with a strong and sturdy crop, which Ted tends to. The sun is breaking through and Joey starts to run across the field and up a small incline. As both Joey and Albert gain confidence they pick up speed. Albert pushes Joey on, they are going faster and faster, Albert yells with the exhilaration of it all. Joey races flat out across the countryside. Albert hanging on for dear life. Albert and Joey pull up beside a sleek red car. It's Lyons' car, being driven by David Lyons, every inch the expensively- tailored rural gentry.        Shoo, Harold. Shoo, shoo, shoo!  What we gonna do?",
        "Michael": "It won't work - they're cavalry  You won't get the harness on.  Gunther! It's hopeless - we can't help them.  It's all right, Gunther.  Father signed me in. He knew my age -and so do they. 54.  Mother obviously never taught you how to fold a shirt.  Then what?  Gunther, it will be fine. And when all the machines break down and they call up the horses, I'll see you at the front. We'll be together again.  Gunther...  I'm hungry. Did you bring food?  Will Father be ashamed?  And us? What about us?  I was ready to go. I was proud to go. (after a beat, in a very  The food in Italy is good.  What about the women? 57.  Because...they've eaten too much of the food?  I don't feel so young. Not anymore.  Michael.  What?  Night night, Gunther.  Okay. 58.",
        "Gunther": "Sir - perhaps we could use some of them with the ambulances - to get the injured men off the field.  I'd like to try, sir. 50.  Let's try.  Come on, Michael.  Whoa, whoa. Easy, now, easy now, Englishman... Whoa, whoa, whoa. Easy now, easy.  Well, well, look at you. Whoever taught you this has just saved your life.  They're pushing through?  Yes, sir. Perhaps I can keep my brother here with me, he's also very good with horses.  You are not going. I'll tell them you are only fourteen, that you're a boy.  Of course she did. I just wasn't listening. But you need to listen now! I promised her, I made her a solemn promise, that you would be safe with me. With me, Michael!!  They'll never make a head count. There are too many of us. You can stay here - slip underneath the bed - until they move out.  I'm giving this to you. For luck.  To keep you safe. 55.  I'm sorry.  He will pretend to be. Maybe at first he will be. But in the end, he will be glad.  Yes.  Not as good as the food.  You are too young for war. And you're too young for women!  Go to sleep - we have a big night of riding ahead. Goodnight, Michael.  Go, go, go...  Yes, sir.  A promise.",
        "Sgt.": "That is our target - the German 11th Division - at the moment bivouacked three miles to the east of the Menin Road. We have been watching them and they have pitched tents for the night and lit cooking fires. Knock them out - and we could slide in behind the German lines and come at them from the South at Geluveld.  About six hundred. Infantry.  And we have surprise on our side. But the sooner we move, the better - we have no assurance they'll still be there tomorrow morning.  The grass to the left is taller than we are - it's perfect cover.",
        "Fry": "Ladies, if you please.  All right, back off. Back off.  All right, break it up. Clear off, the lot of ya.  Gentlemen! Gentlemen! It falls on me to give you some important news. At eleven o'clock today, in two minutes time - the War will come to an end.  The King and Queen thank you for your service. We have been victorious - even if at a higher price than many of us might have imagined. 102.  When the bells ring out - and they will in a moment, for the first time for four years - let us remember our brothers fallen in the field. And thank God for the end of this struggle and victory.  That is a complete and bloody outrage. It's the lad's horse, sir, from Devon. He raised him up from a pup, he did. Trained him right up to the day when the army came to town.  Come on, Narracott! Get a move on. We don't want to miss the show.  It's the butcher from Cambrai. He's been bidding for the best all morning.  Let me handle this, private. ) Fifteen, and let that be an end to it.  Seventeen.  Twenty Five.  Twenty seven.  Twenty nine.",
        "Capt.": "",
        "Nicholls": "And how much are you charging, sir - for this strong, decent, and very fine animal?!  I'll give you twenty and not a penny more.  I don't even know how he rides.  Thank you.  I'm afraid it's too late, lad. I've just paid thirty guineas for him.  I'm sorry.  I see. What's your name, lad?  And how old are you, Albert?  35.  I don't doubt your qualifications, Albert, but the law is very clear about the proper age for soldiering, and your father's done what he had to do. You know that. Thirty guineas isn't nearly enough to purchase a horse as fine as your Joey, I know that. But it's all I've got. Will you lease him to me, Albert, to be my own mount? (he removes his cap,  Now say goodbye.  Let him be, Perkins.  Gently, Perkins. I don't want to sour him. 38.  Who?  I wouldn't be so sure. I think he's got potential. He's certainly got the bit between his teeth.  This is what quiet confidence looks like.  Draw...swords!  Give...point!  Charge!!!! 41.  Come on, Joey. I know you've got it. Come on, boy! Come on!  Come on, boy!  Nice of you to turn up.  He has everything. 42.  I'm writing a letter.  It's to the boy who owned Joey. I want to show him how wonderful he's looking.  Yes. Before that...  Of course.  Charlie. 43.  I'm not sure it's going to make a lot of difference to the Germans.  Or, alternatively, think - \"I fancy that cap\" and kill you first of all.  Numbers?  Twice our size...  Thank you, Singh. Jamie!  They have no idea we're coming.  No. I understand the surprise is everything. But if it must be done, let's do it quickly.  Are you alright, Charlie?  Thank you, Standley. Hey, Joey. My bonny boy. You're all right, aren't you, Joey? Hey?  Good luck, my friends.",
        "Grandfather": "The wind plays tricks with the noise - it's moving away from us.  Here. There is no wind here. But over there - a wind so strong it will lift you off the ground...    The truth is -  - you should speak to your elders with respect.  (standing, putting his hands on his hips Now - who is the one telling lies!  In the windmill?  Yeah.  They must belong to someone. Horses like this don't just appear from a fairy-tale.  Emilie... Emilie...  Emilie. Look at me. You cannot ride.  Yes. That's right. So it is settled?  Good girl.  But it's - Over my dead body!  You'll kill yourself.  Oh please, come off the ladd--  Find somewhere to hide them. And do it quickly!!!  My name is Bonnard - this is my land. Why are you here?  They are taking everything. Where are the horses?  Leave it if you don't know what it's for.  I make jam. We have no animals.  Yes.  The wind. It plays tricks in the attic.  An old house creaks. Go - close the shutters.  If you or any of your friends harm her, as old as I am, I will kill you.  Yes. Yes. It was your parents who were brave. I make jams.  Maybe there are different ways to be brave. Did you know the French have the best carrier pigeons? And this could be the difference in the war - our messages getting through. 68.  They are released at the front and told to go home - this is all they know. But to get there they must fly over a war. Can you imagine such a thing? Here you are flying over so much pain and terror - and you know you can never look down. You have to look forward or you'll never get home. I ask you - what could be braver than that?  A present.    Anything you say, my sweet one. Anything-you-say! You are, of course, the boss. It's just an old thing I found - don't worry yourself - leave it, I'll put it back.  It was your mother's. I hid it, so as not to encourage you. Emilie, I want you to ride very slowly, very carefully. And promise me you won't go far --  To the top of the hill and straight back again.  Slowly...slowly...  Emilie!  Emilie!  She is my granddaughter! Emilie, stop! Don't hurt her, please! Don't hurt her.  Please, take the bigger one and leave the smaller one. You are breaking my granddaughter's heart.    It will never be over!  And sir, if you bid against me, I will sell the coat on my back and bid to one hundred and ten. And if you bid against me again, I will sell my farm and bid to a thousand. 106.  You don't know anything about him.  Yes, you found him! I heard you found a horse in the wire between the armies -  When I heard about the miracle horse, I traveled three days because I knew whose horse it was. My granddaughter's. She saved his life! He was everything to her.  The war has taken everything from everyone. He is all that I have left of her. 107.  Do you know what this is?  You may have this.   ... And this.  No no, not necessary. He belongs to you. That is, of course, what my little girl would have wanted. And she was the boss.  Emilie.  Her name is Emilie.",
        "Lyons": "Two guineas.  Five guineas.  Seven.  Ten guineas.  Just let him go, dad, I don't care for him, he's too... jumpy.  Shall we say - twenty five?  Quite a beast, there. But what you gonna do with him - on a working farm? I hope you got the rent, Ted. I'll be around for it when it comes due.  There's only fifteen here.  You know by rights I could take this farm back today, don't you? And I'm a great believer in my rights.  If you drank less beer and bought fewer horses you might be able to look your landlord in the eye, Narracott. 14.  Bottom field's rock hard. Only stones down there.  How you going to plow it? Not with that fancy animal of yours?  You'll not get that one in a harness, let alone pulling a plow. Even drunk on a Tuesday night, you know that. And I can't wait for the money - there's a war coming.  Very well - if that fancy plows that field I'll give you till October to set things straight.  I'll take the horse on the day he fails. 15.  And I'll take your father's farm and give it to working men who can hold their pints and hold their heads high in decent company.  Now, now, now, lad. What - are you bladdered as well?! Ted Narracott - I got you down in my book!  Ted too squeamish to watch, is he?  Well, you've raised him up a true Narracott, Ted, picture of his father, he is: not a dollop of ordinary sense but that thick stubbornness that'll lead him to insist on the impossible.  Wasn't a farmer in Devon didn't admire you, myself among `em, leaving your brothers that fine farm and setting yourself at this stoney patch of unpromising ground. You've fettle enough for twenty men, but with a gimpy leg and the drinking - for the pain, isn't it, that you drink? 20.  - yeah, none of us could have anticipated an ending better than this. Makes me question the wisdom of the charity that urged me to rent you this place, not only looking at you, me old pal, but that pretty little wife of yours, thought you were a spark, she did.    And now your son's sinking into the selfsame bog that's swallowing you.  You'd be better off startin' at the top of the hill and goin' down! Gravity's the only friend you're gonna have today, young lad.  Bravo! You've reached the top of the hill! Off you go again, boy! You'll make even better time comin' down!!  Look look look! The plow hasn't even cut yet! 22.  You've got no chance, lad. He'll not turn over half an acre. Give it up now. You've done well. You've tried hard. You're more of a man than your father.    I'll be over Thursday. Give you a day to close it up. 23.  I'd not let a child of mine slip in the mud alongside a plow blade. He could lose a foot!",
        "Emilie": "Grandpére.  It's closer today.  I can hear it, Grandpére, and there is no wind. You shouldn't lie to me.  You lie about everything. You say you aren't worried but it's clear you are. I know the war is approaching but you say, \"Oh, it's just a trick of the wind.\" 60.  You started lying when Mama and Papa went away.  They're dead. But you won't say so. Do you think I'll die if you tell me the truth?  If you tell me the truth about the war, I will tell you the truth about the big horses I've been keeping in the windmill.  Yes. They were standing in the windmill waiting for Don Quixote. This is François  and this is Claude . 61.  I named them after two boys who broke my heart last Summer.  Yes - I know, Grandpére. They are not unicorns - so I will be fair and wait -- one day.  And if no one comes to get them by night-time, then they belong to me.  Mother used to tell me how my bones would give way with the slightest bump or fall.  It will only be settled when I decide which one to ride first.  At least I won't have long to wait. 62.     Eyes on me. No talking.  Today we learn to jump. Did you know the French cleared one meter eighty- five at the Paris Olympics to win the gold medal? Today we will beat that record.  This is your jump. When I call you....be very brave and leap over it. 63.  Leap over it! Watch me.  And now it's your --  He doesn't think we can do it. But we will show him, won't we?   No need to be afraid. (Emilie looking down at how far off the ground  Only if you get in my way to make me fall.  What horses?  We use it to replace the mattress stuffings.    Tell me what happened to them. To my mother and father.  You said you would tell me how they died. On my birthday. And tomorrow's my birthday! They died fighting, didn't they? But when the soldiers  - you do nothing. You are a coward, aren't you?  And you've never done a brave thing in your life?  I don't want to hear about the birds.  What is that?  I hope you have not bought me a disgusting dress that I then have to wear like last year.  Yes. I looked like an ugly nun. 69.  Give me your hand.  Grandpére, we have no money. When the war is over, then you can buy me jewels and carriages.  Of course. Okay, I promise.  I promise. 70.  My hero.  No! Let go of me! No! 71.  You don't need them! There are so many others!",
        "Andrew": "I thought you needed a plow horse, Mister Narracott.  You were great, Mr N. Gave him a run for his money.  Hey, look at him, Albie. He's playing \"Grandma's Footsteps.\"  Good boy. Good. Now call him. Whistle.  Don't think he fancies your owls.  My dad had a dog who stayed when you called him. He used to run up behind you when you weren't looking, and uh...  Brilliant. Look at you.  Yet he will, I say.  Albie, we're all with ya!  Walk on! Walk on! Walk on! Walk on, Joey!    Will you look at you?  Get it done, Albie! Get it done! 25.  Maybe it's a drill, Albie. Maybe it's a drill like last time. 77.  You did that? You fell on your bum?  What?  And this here is the worst day of my life, about to begin, and you're here cheering me on. Us two, always. And him.   Albie.  Albie...",
        "Easton": "Forget it, Ted. He's half thoroughbred and not got a day's work in him. (points to a plow horse next to  Don't be daft. You need something solid to plow a field.  I thought you needed a plow horse, Mister Narracott.  Ted Narracott - it's completely the wrong animal.  Oh for the love of...!  Stop it - he's your landlord - you can't be picking fights with him.  You haven't got the money. Let's go home - let's have a pint.  That's top price for a workin' animal. Ted! Save it for the shire!  Well, he's got you there. Nice try, Ted. 7.  What have you done, Ted? What have you done?  You're a fool, Ted. And our Rosie'll never forgive you.  Too large, too rocky, matted with grass roots. Even a sturdy plow horse'd never manage it alone. 19.  You'd swear he'd sprout wings and fly if Albert had told you so.  It's a fine thing, loyal to your mate. Even if he is a bit barmy. A team of two might manage, given a month and good weather.  `Course he's watching.  Come on now, Mr. Lyons, that's a bit rough, isn't it?  Hello the farm!  I was at the post office and while I was there, Mrs. Allen said a parcel had come for Albert, from the, from the, from over there - and I thought I could go up that way in the morning. And - here it is.",
        "David": "Just let him go, dad, I don't care for him, he's too... jumpy.  Um, I'm the only boy that drives in the village. No one else drives but me.  That's right and this is my dad's car. You're lucky that you're in it. I'm not normally allowed to drive it `cause it's so -  Love letter?  I hear you and your mate were doing bird imitations again. You gonna write a letter to your horse?  After you find your horse, I've lost my needle in a haystack, and I could use some help.  Anything valuable. Anyone who comes back gets to share it out.  I remember you somersaulting through the air.  There was a girl?  It was just some girl, I suppose. I don't recall which one. I do remember you falling on your bum in a ditch.  You see? Always entertaining, Narracott, I'll give you that.  Hold your nerve, boys. Remember, it's not far to go. There's a way through.  Run fast, keep your wits about you, keep your eyes open and God and the King will keep an eye on you. Company will fix bayonets! Fix bayonets!  Once you're in no man's land, go to the flanks. Stay on the flanks.  Come on, boys, come on. To the ladder!  You, too, Narracott. And you, too. 80.  Come on, on your ladders, boy. On your ladders. In you go, in you go. That's it.  I'm shot! No!  Just leave me. Leave me!  Albert. Albert, listen...  Yeah... 82.  The gas got him - we had to wait till morning.",
        "Rose": "Well, I might hate you more - but I'll never love you less.",
        "Ted": "",
        "Geordie": "Stand to, stand to -  There's something moving.  It looks like a cow.  Lads, we should call him.  Oh sod it...  It's a white flag, ent it? You see the white flag!? I'm just after tending to this here horse, is all!  The Lord is my shepherd, I shall not want, he leadeth me into green pastures, he lay me down beside the still waters...  Poor beastie. Poor babbie. It's alright. It's alright. Don't buck and wriggle so, you're only shredding yourself.  You'll blind yourself. 90.  Bugger me worthless - I didn't think to bring gloves or something to cut   Yeah, yeah I... Ummm, thanks. Cheers. Cheers...  Thanks.  You speak good English.  Pity you didn't bring a second pair. Then I could cut the wire here -  Say no more, I'm right behind you.  And you understand what's happening, do you not, O Best Beloved? That you must lay so very nice and still. There's a lad, you're a remarkable horse, you are, helping us help you. There's a lad. There's a remarkable lad.  So how's things in yonder trench?  Well, if ever you need any more rats, we can always send ours over. `Cause we've more than we need, strictly speaking. Besides, they scare off all the pretty girls.  Big strapping German girls, eh? Kind what gives robust massages?  Look at that horse! Look at the muscles he's got, them long legs. They're made for running, horses. Runnin' away from danger.  Yet we taught `em opposite. Running into the fray.  Yeah. War horse. And there he is. What a strange beast you've become.  I take him back with me, yeah?  In a pig's eye. He's English, plain to see.  Because he's so smart. And you're none too clean yourself. 94.  No, thanks, pet. Must be careful not to start a war.  Do you have a coin of any sort?  Yeah.  All right, Fritz - you're on.  Peter - I'm Colin.  Heads.  Gone quiet, hasn't it?  I'm a terrible shot, Pete, don't believe I'll ever hit the target.  I will.  And you take care of your own strange self.  Thanks.  I'll use `em back in the garden in South Shields. You keep your head down, now, Pete me lad!  We need a vet, sir.  He's cut all over, but this leg here's got the worst of it.  Please, sir -  Please, sir, this horse can pull through anything.   He was alive, y'see, sir, where nothing survives, so to me and me mates, to the men, sir, he's - Well, we have high hopes for him -  Oh, but I can't.  Wait! You can't see `cause of the mud. 101.  Four white socks!  We've all clubbed together. It's everything we have. There's twenty-nine pounds there. Buy him back. 103.  The Major put in ten.  Mum's the word where the Major's concerned. Your friend on the crutches over there -  - even asked the Major to say that Joey was his, an officer's horse, so that he could go back with the others.  You're alright. Nobody's gonna bid more than fifteen for a thoroughbred. They want work horses.  No, I found him, he raised him -  Where is your granddaughter?",
        "Soldier": "Kavallerie!  Hei! In die windmühle!  Food for the soldiers at the front. Everyone must give their share. 65.  What is it?  A pot is a pot. We'll find some use for it. Sir, where's the livestock?  But there's fresh hay in your barn.  Her grandfather? 66.  Where are her parents?  What is that?  She's sickly, no?  You know, I was going to give you back your pot. But now I'm going to keep it. For soup. 67.  Halt! Halt! Stop!  Yes, sir.  Yes, sir!  Get down!  Gas! Gas! Gas!  Stand to, stand to -  There's something moving.  What the hell is it?  It looks like a cow.  What the hell would a cow be doing out there?  That definitely isn't a cow.   Well, what is it? 87.  Lads, we should call him.  How do you call a horse?  Oh sod it...  Listen to him, sir. We can't leave him.  Go on. Do it again."
    },
    "imdb_rating": "7.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjExNzkxOTYyNl5BMl5BanBnXkFtZTcwODA0MjU4Ng@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "On the outbreak of the First World War, Albert's beloved horse 'Joey' is sold to the Cavalry by his Father. After being sent to France, in a bid to survive, Joey has an unexpected journey across war torn Europe. Albert enlists in the British Army, and is wounded during the Battle of the Somme. Whilst recovering in Hospital, he learns of a Horse, found in no mans land.",
    "name": "War Horse",
    "genres": [
        "Action",
        "Adventure",
        "Drama"
    ]
}