{
    "filename": "Warrior_script.txt",
    "imdb_id": "tt1291584",
    "imdb_url": "https://www.imdb.com/title/tt1291584",
    "characters": [
        "Brendan Conlon",
        "Paddy Conlon",
        "Tommy Conlon",
        "Fenroy (as Fernando Funan Chien)",
        "Principal Zito",
        "Frank Campana",
        "Tito",
        "Mark Bradford",
        "Stephon",
        "Sam Sheridan",
        "Warden Perez",
        "Pilar Fernandez",
        "Colt Boyd",
        "Bryan Callen",
        "Tess Conlon"
    ],
    "dialogues": {
        "Brendan": "Well, I'm not sure, but I think Daddy is now a princess.  It's her birthday. 7.       I'm on it.  Where's the rest of that skirt?  Listen, if any guys give you a hassle in that joint tonight you give me a call, okay? 8.  I told you, most nights I sit on the stool and grade papers, but every now and then I need some action.  Promises, promises.  Whoa whoa whoa! There's a lesson in this too, OK? Listen up. So we have a body at rest, and you have the bat which needs--  Acceleration, right. If you have enough acceleration, you have might have a chance to break the body at rest. OK. Go ahead.  There we go. Alright Tito, well done. Remind not to mess with you. Sit down everybody. Dial it down.  So, have we got it?  Alright. The third law-- 11.    For example, if KC does not stop the action of sending texts in class...  ...and tell her posse outside to beat it...  ...then my reaction might be to send her down to Principal Zito's office. Thus setting our world back in proper balance.  Alright, before you go, I have your tests from last week.  Brendan. 15.  I teach Physics.  You said that three times already. I get that. But I'm asking you if there's something else you can do. Not the bank, you. Can you shift things around, restructure--  Because you advised us to do that.  We had that conversation. I was paying medical bills. Is that in your file?  Heart.  So my option is I've got no options? You're not even gonna try to help me?  90 days is not enough. My wife and I have three jobs between us and that doesn't cut it. So, what do you suggest?  That's not how I do things.     Listen kiddo, I need you put Mommy back on, OK? I love you. Hey. I'm just pulling in. Huh? Oh, they've got this open mic night thing. Should be a quiet one. Sleep well. You too. Bye. 19.          I'm not bouncing at a club.  I went in to apply. They were only paying nine bucks an hour. Then I saw a sign for this other thing.  They're putting us out of the house in three months, we're running out  We're not giving up the house. This is our home. We're not going  Take your seats.  Now, please. 26.  C'mon, it's not as bad as it looks.  I need the money, Joe.  Actually, I used to be one of those animals.  I fought for a living. Guess I forgot to put that down on my application.  Look, I'm sorry, Joe. It's just--  It was the parking lot of a strip club.  What are we gonna do?        How the hell are we gonna pay for an attorney?  That was nice. 29.  Next semester?  Look, Tess. They have these smoker fights all over. There's one in Lancaster next week. There's two in Dover the week after. Wilmington. Camden. Baltimore. It could keep us afloat.  Some of them pay a little more than that. I would have had to bounce for a month to make what I made in two hours last night.  And these guys, they're not real fighters. They're just guys who have seen too much UFC on TV. If you have a better solution, I'm all ears.  It'll be fine. I'll just leave the house as usual, except now I'll be going to the gym. 30.  Liking the place, Frank.  Amazing, man.  Good. Good. I had another little one. Rosie.  It's alright.  It's all good. She's good now.  Yeah. Well, I've got a little problem. The guys at the bank want to take my house away. That's kind of why I came to see you, actually.  I didn't come here for a loan, Frank. I was hoping you'd train me.  I want to get back in the cage.  I just won an event the other night.  Ish.  I've got loads of time. Time's not an issue. The parking lot thing kinda got me suspended. I need to keep working the smokers.  No. I was unconscious.  It's not gonna happen. Come on. Whattya say, Frank?  That's all I need.  I appreciate it.        What're you doing here?  Something wrong with your hands?  If there's nothing wrong with your hands then there's no reason for you not to phone. That's the deal. 37.  Phone or mail, Pop. Non negotiable.  I'm going inside.  Well, that's great, Pop. But it doesn't change anything.  You listen to me. You take your have-a-heart bullshit and you run it down the road. Run it out on someone who doesn't know you like I do.  You got two lines of communication, the telephone and the post office. Just because you decide it's a special day, it doesn't make it one for me. I got a wife and kids inside and they're waiting for me, so I don't have time for whatever this is. 38.  Why is that, Pop? Why is that? Do you remember having anything to do with that?  That shit you pulled. Never again. And all the shit I saw growing up? That doesn't happen here.  Take care of yourself.  Tommy's in Pittsburgh?  He came to see you?  You and Tommy are training together? 39.  Tommy Conlon.  I know what her name is.  I thought you came to break bread over a thousand days?  Did he say if he wants to see me?  Wow, look at you. Mister inside man.  You and Tommy training together like nothing ever happened. This is unbelievable. Now I know what you're really doing here.  You came to gloat.  Well, there you go. You got your son back.  You got your son back.  You know, part of the reason I stuck around was `cause I thought I'd finally get you all to myself. But you didn't have any interest in training me. Tommy was the one.  Forget it. You were always a front runner. You never had any interest in underdogs. But I was your son.  Am I?  Yeah. Alright. I forgive you. But I do not trust you. Tell Tommy this is where I am if he wants to see me.  Goodnight, Pop. 41.  Just some nice old man.     You gonna be OK? Wanna grab a bite?  Coach! Hey, I know this isn't a great time. And it's too bad about Marco. But what about me?  It's a grand prix tournament. Which means anything can happen. You know that as well as I do.  They'll have to kill me to get me out of that cage.  Frank, I need this. You're real tight with those guys. You call them, they'll listen to you. 49.  That's not gonna happen.    I love my coach!     Hey Frank. That's unbelievable. I can't thank you enough. I don't know what to say. Alright, listen, I've gotta call you back. Alright, bye. 50.  I'm in. I'm going.  It's a lot of money, Tess.  You don't think I can do it.  I'm not gonna get killed.  Tess, I can promise you this: if I don't try, they're gonna take the house. How's that for a promise?  So, I'm gonna go, OK? But I'd really love it if you'd be with me on this.  Been looking all over for you. How's it going?  I was thinking maybe we could grab a coffee.  You don't want to go sit down somewhere?  Shit, Tommy. How was I supposed to know I was never gonna see you guys again?  She wasn't some girl. I married her. She's my wife.   That's Tess. And that's Emily and Rosie. They're your nieces, Tommy.  I know you don't know them. Of course you don't know them.  Because that's my family.  I'm your brother, man.  What? 57.  I wasn't in the Corps.  Jesus, Tommy. I was a 16 year old kid. What the hell did I know?  She's my wife, Tommy. So that's it? I stay with Tess and I never get to see you guys again? Not a single phone call? Nothing?  God, man, I don't understand this. You won't forgive me, but you'll forgive Pop?  That's got nothing to do with forgiveness. I've got a family to protect. Everything I do is for them.  But I forgave Pop. Just like I forgave you and Mom. 58.  Yeah.  I fell in love, Tommy. What the hell was I supposed to do?  You're not the only one who suffered, Tommy. I didn't even know she was sick. I never even got the chance to say goodbye to my own mother. You had no right to keep that from me! That was not your decision to make!     I can do this.                                     I'd doing this!  I'm doing it!        I'm gonna fight him.   Where's Pop? 96.   Angle out, hit, and move.    Tap, Tommy!  Tap! 99.  I popped his shoulder.  I heard it tear.  Josh! 100.  Tommy! What are you doing?  What are you that crazy?  What are you doing? It's over!  It's over, Tommy. C'mon. We don't have to do this.        I'm sorry, Tommy! I'm sorry!  Tap, Tommy! Tap!  I love you, Tommy! I love you!   103.",
        "Conlon": "",
        "Paddy": "Tommy?  What're you doing here?   Yeah, she's hanging in there.  She did. But that's not for me anymore, Tommy.  C'mon, let's go inside.     Appreciate that.  No more women for me, Tommy.  Here you go.  I told you, I'm off it. I'm coming up on a thousand days.  No.       Remember Tess? They've got two beautiful little girls.  I know.  When I got sober I hired a man to find you. 5.  Just the 12.  Just that your mother died in Tacoma. And you were in the Marines. That was all. That was enough.  I'm sorry, Tommy.     Who?  What business you got with Tommy? 18.  Conlon. Name's Conlon. And anything you want to know about Tommy, you gotta ask him yourself.  Like I said, anything you want to know about Tommy, you gotta ask him yourself.  He doesn't live here.  You wanted to talk?  That right?  Colt Boyd? I didn't tell him anything, Tommy.  What about Colt Boyd?  Ah, the devil you know.  The devil you know is better than the devil you don't.  Chasing Theogenes. It'll be kinda like old times. 24.  Alright. Alright. But you get something through your skull, too. You called me. So don't go threatening to walk every five minutes. And since this is about training, you dump whatever it is you need to dump as far as those pills are concerned. I don't want to see `em.  In fact, hand `em over right now. I know they're on you, Tommy. You sounded like a goddamn maraca coming through the door.  That's not gonna do. When you came through that door it was chhh-chhh-chhh.  Three.   And another thing, you don't eat crap like this. This is for losers and old men. And we're gonna have to bunk up. If we're gonna do this right, you gotta stay at the house. 25.  I watch your diet, we follow the old regimen. You copy?  Copy.    Look what I found in that disaster of a basement. Whattya say we sit down and update this sometime? You can fill me in on how close you got to that record.  Did you continue wrestling after you left with your mother? C'mon, Tommy. Tell me something.  OK. Hurt my knees coming up and down those stairs anyway. 31.  Coffee pot's on til 0-500, then I dump it.  Hey, Brendan. It's me, Pop.  I have some news for you.  Yeah, I forgot--  Hey Brendan, have you ever seen my hands so steady? Have you?  I've got a thousand days. A thousand days sober today.  What do you mean it doesn't change anything? Have a heart, Brendan.  C'mon, Brendan. I thought maybe we could break bread. Open some lines of communication.  I know you got a wife and kids in there. I got a grand-daughter I haven't seen in three years and another I haven't even ever met.  Tommy's back.  He's in the `Burgh.  He came to see me.  He's over at the house. We're doing a little training at Fitzy's. Remember Fitzy's? It ain't Fitzy's anymore.  Riordan. He's using your mother's maiden name now.  I thought you'd want to know he's back. That's why I drove all the way over here.  That too.  He doesn't say much. He's just not that happy kid he was.  What's that?  I did not come to gloat. I came to get my son back. 40.  I'm talking about you, Bren--  Ah, Brendan. I was a drunk. I mean, you know. I'm sorry.  You are my son.  Yeah, you are. I'm just asking you to find just a little space in your heart to forgive me.  Alright. But they're not different things. You've gotta trust to  My God, is that Emily? Boy, she's grown, Brendan. Is that Rosie?  Tommy!  Hello? Brendan.   Go get `em, son.  You can do it, Brendan.  That's it, Brendan!  Way to go, Brendan!  OK, son.  Can't sleep, huh?  I know that other thing's bothering the hell out of you, but I'm proud of you. What you did for that kid in the tank? That was really something.  No. What'd you do?  That's why you go by Riordan. That's why the press can't find your service records. 79.  What the hell happened over there, Tommy?  Come on, kiddo. I've been there. I've done it. I've seen it. You can trust me. I'll understand.  I'm really trying here, Tommy.  God pity `em! All shall perish except me! You bastards! Stop the ship, you bastards!  Ishmael! God pity `em! Stop the ship! Please stop the ship! Somebody help `em!  Ahab! You Godless sonofabitch!  You stop the ship, you Godless sonofabitch! 81.  Captain. Oh captain. Stop the ship. For the love of God. We're lost.  Please stop the ship.  We're lost. We're all lost, Tommy. We'll never make it back.",
        "Tommy": "I was just passing through. Figured why not have a belt with the old man. 2.  She looks good.  Well, you always did take good care of her. Paddy Conlon. Man of priorities.  Got a little something for ya. Mom always said never go anywhere empty handed.  What? You change brands?  I like what you've done with the place. 3.  There's not much of a woman's touch around here.  Yeah? Must be hard to find a girl who can take a punch nowadays.  Coffee? You haven't seen a guy in 14 years and you're not gonna have a drink with him?  C'mon, just one drink.    So you found God, huh? That's awesome. Mom kept calling for him, but he wasn't around. I guess Jesus was down at the mill forgiving all the drunks. Who knew?  So, you gonna ask about her, or you just gonna sit there all sober?  Oh, you know? What do you know? Do you know it wasn't enough just to drive west to get away from you? When we hit the water we drove north, too.   Is that one of the 12 steps? Or does a guy like you get 24?  Did your guy tell you what you needed to know?  That's too bad. You could've gotten some good details.  You could've heard about her coughing up blood in a shit box with no heat. Having me rub her down with holy water, because she didn't have no insurance. All the while waiting for your pal Jesus to save her. Did your man tell you that?  It's good to know you're sorry, Pop. Goes a long way.  I think I liked you better when you were a drunk. 6.  Fitzy still own this?  How's it work here?  Sure.  Yo, I'll fight him.    Yeah.  Tommy.  Sure, no problem.  You owe me two hundred bucks.      Yeah. I'm gonna start fighting.  Don't play babe in the woods with me. I know that guy from the gym came to see you.  We wouldn't be sitting here now if you did. 23.  Alright. Look. There's this tournament. A big tournament. Top sixteen middleweights in the world. Single elimination. Winner take all for a lot of money. I'm gonna do that. But if I'm doin' it, then I'm gonna need a trainer. Now that much you were good at.  No, no, no. This doesn't mean anything.  I'm serious. We train. That's it. I don't wanna hear a word about anything but training, you understand? You wanna tell your war stories, you can take `em down to the VFW. You can take `em to a meeting, or church, or wherever the hell it is you go nowadays.  What about him? I told him I don't train with people I don't know.  Excuse me?        Yeah, I'll tell ya something. You can take that thing back to where you found it. And you can leave the coffee in the pot. I can pour that myself. I can wake myself up, too.      Pilar. It's Tommy.  Good good. How you doin'?  How're things? Kids are good?  How's little man? 43.  You know, Pilar, I haven't forgotten for one minute what I promised you. What I promised Manny. I've got an opportunity coming up to help you guys out. To take care of you guys.   I'm takin' a walk.         It's going.  I don't drink coffee. Whattya want?  I'm good right here. 56.  You were briefed. You had the information. You chose the old man and the girl.  Don't know `em.  Why am I looking at pictures of people I don't know?  And who are you exactly?  You were in the Corps?  I said I didn't know you were in the Corps.  Then you ain't no brother to me. My brother was in the Corps.  I don't know what you know. Why don't you go ask your girlfriend about it?  Shit. He's just some old vet I train with. He means nothing to me. From what I hear he means nothing to you, either, so you got balls talking about forgiveness.    I'm not surprised you made the tournament, Brendan. You got some stones.  You were supposed to stick to the plan. You were supposed to come with us. Mom needed you. I needed you. You were my big brother and you bailed on me.  Hey, I'm glad you stayed and everything worked out for you, Brendan. See, you leave, you get the opposite. You leave, you get to bury people.  You know what? You walk around with your pictures in your wallet and you're all, I forgive you, I forgive Pop. I forgive everyone. But you know what? You're full of shit. 59.  Are we done, Brendan? Are we finished?                        How about deserting my unit? Is that really something, too? Yeah. I was on my way outta country when I came across those guys. What was I supposed to do, let `em drown?  What'd I do? I took off.  That is none of your business.  Spare me the compassionate father routine, Pop. The suit don't fit.  You're trying? Now? Where were you when it mattered? I needed this guy back when I was a kid. I don't need you now. It's too late now. Everything's already happened. You and Brendan don't seem to understand that. Let me explain something to you: the only thing I have in common with Brendan Conlon is that we have absolutely no use for you.  Look at you. Yeah, I was right. I think I liked you better when you were a drunk. At least you had some balls then. Not like now. Tip toeing around like some beggar with your cup out. Take it somewhere else, old man.  In fact, you know what? Here's a cup. Why don't you take this and go buy some more of your shitty tapes? 80.  Go back to the room and listen to some more fish stories no one gives a shit about. Go on, get outta here. Get the fuck outta here!                           Shut up! C'mon.",
        "Principal": "",
        "Zito": "Are you being literal or figurative? Because literally it looks bad. And figuratively it looks even worse. The superintendent's coming by in a few minutes. So gimme a little help here, Brendan. Can you explain to me what the hell you were doing?  Yeah, but we can't have this. This isn't moonlighting at Applebee's for Christ's sake.  Shit, Brendan. Leaving everything else aside, which we can't, are you out of your mind? You're gonna get yourself killed. I mean, you're a goddamn teacher. 27.  You've got no business in the ring with those animals.  Yeah, I guess you did.  Listen, the school district's not going to tolerate school teachers cockfighting in strip clubs.  Wherever it was, you can't be doing it, alright? I mean this is a serious--shit, he's here.  This is a serious problem. Guy hasn't been inside a school since 9-11.  You say yes, sir. And you say no, sir. And you say it'll never happen again, sir. And then we just pray to God he's in a good mood. 28.   Sonofabitch.     You realize you're supposed to seek my wise counsel when school's actually in session, right?  Let me get this straight. You want to use the auditorium to watch a suspended teacher engage in the activity he was suspended for? Am I hearing this correctly? I gotta talk to your parents. You guys might need to be in summer school after all.  It's never gonna happen.  Look, I appreciate that you guys love your teacher. I really do. But there is nothing I can do for you.     Move! You gotta move! 69.     C'mon, Brendan, get outta there!        He tapped him out! He tapped him out! He did it! He did it! He did it!",
        "Frank": "Let the music sink in to you. This is Beethoven. Breathe. Breathe. 33.  Do I know you? I think I know you.  Long time, brother.  Thank you, brother.  You see this beast? Marco Santos? I'm training him for Sparta.  Come on back.     You look good, brother. How're the girls?  I know. Johnny C. told me she was in the hospital for a bit. I was gonna call, but then time went by. I don't know. I'm a piece of shit. I should have called.  No, Brendan. I'm sorry. 34.  It's great to see you, man. So everything's going good?  I've got most of my dough tied up in this joint, but how much do you need?  Train you for what?  You're serious?  Ah, you won an event.  That's what this is. Let me guess, it was in a parking lot. DJ from the local radio station. Couple of ring card girls you wouldn't bang on a dare. Am I right? 35.  Ish. Brendan. I love you. I do. But why would I train you? When you were in shape and on the right side of 30 you were barely a .500 fighter. You never listened to me. You never listened to anyone. These guys are animals. I mean, you're a teacher, right? What're you gonna do? You're gonna come down here for a couple days a week after detention? You're gonna skip out of the girl's volleyball game early?  Tess know about this?  Yeah? `Cause the last time you fought, I got read the riot act sitting in a hospital waiting room. You remember that?  She's not gonna come down here with the two puppies, screaming at Frank?  What do I say? What am I gonna say to you? No? I mean, all my time is wrapped up with Marco. You come down, I'll throw you in the rotation, you spar with these guys, no problem. But I can't promise you much more than that, Brendan. 36.  Let me know when you're coming down.  Now?  You've gotta relax and stay calm in there. The cage is your home. You set the pace.  You set the rhythm. Feel the Beethoven. Be smarter than him. More patient. Wait for him to make a mistake. And when he does, that's your moment.  No he did not tap you! Physics teacher! That's the best in the world there, son.  Nah. I'm gonna head home. I gotta call the boys and break the news. I'll call you tomorrow.  You talking about Sparta? Brendan, please. You got a better chance of starting a boy band. I'll talk to you tomorrow.  That's what I'm afraid of.  You realize what you're asking me to do here, Brendan? We go down to AC and you get tapped out in five seconds, how does that benefit either one of us?  Not gonna happen. Wish I had a nickel for every time I heard that.  I'll make a call.  Hey. Where'd you go? You can't leave me like that. They wanna talk to you, not me.  You can do this.  I want to hear you say it.  Then let's go do this.  You asked for it. 68.  Have some fun, baby.  Get out of there! Get out of there!  Beautiful! Beautiful! He doesn't know what hit him!   Take him down!     You've got a visitor. Second row, 10 o'clock.  You alright with that?  I want you to look right at him when he comes in here. Don't take your eyes off him.  I'm proud of you brother. This is your cage.  Sit down. Breathe.  Look at me! Look at me! Why are we here, Brendan? Why are we here? Are we here to win this fight? You tell me, `cause if we're not, I'll throw in the towel right now. We'll get Tess and we will go home. You don't knock him out, you lose the fight. Understand me? You don't knock him out, you don't have a home.  Crank it! Crank it!  One more time.  C'mon, Josh!  Sit down. Look at me. Look at me, Brendan! Let it go! Breathe. 97.  Beethoven. He's coming hard, just like we planned. I want you to angle out, hit, and move.  Good. Breathe. Relax. He's not your brother, right? He's just a guy who's in the way.  I'm taking a little more time for the cheap shot! Do your job, Josh!  Switch! Switch!  Relax, breathe.  You popped his shoulder? Good. I want you to pop his other shoulder.  Hey! Hey! No Josh! Look at me! You got two rounds left! You need both rounds! Go in there, kick him in the head, take him down, and finish him!  Finish him! You finish him!",
        "Campana": "",
        "Tito": "Acceleration.  My brother said he was at the strip club and saw Mr. C fighting MMA---  Yo, Mr. C. My brother was at the titty bar last night and said you was choking brothers out. What's up? Is it true?  What do you say?  Yeah. We'll get the whole school to sign it.",
        "Mark": "",
        "Bradford": "What's that?  Who's \"Mad Dog\" Grimes?  Wait, rewind that. 32.  AV, I need to see the tape!  The tape.  Freeze.  That's him. That's him.      ...the bridge just crumbled. The Amtrack was upside down. Water was coming in from everywhere. The water pressure was too much. We couldn't get the back hatch open.    We were all drowning, man. It was a death trap.  I couldn't have had more than another minute. Suddenly the back ramp gets ripped off, and there he was. Before I could get out and thank him, he was gone. He just vanished like a ghost.   You saved my life, brother. Anybody seeing this at Sparta, anybody out in Pittsburgh, reach out to Tommy Riordan. Tell him Mark said thank you. 55.",
        "Stephon": "How many laws this dude got?  Mixed Martial Arts. Like, different styles of fighting.  Yeah, Mr. C. I mean, did you really work on some fools or something?  We want to use the auditorium this weekend to watch Mr. C in Sparta.  What if we get a petition?",
        "Sam": "",
        "Sheridan": "Thank you, J.J. And here's something fans never thought they'd see: Koba is here! The legend arriving to fight on U.S. soil for the very first time...  Five million dollars, Bryan. Five million dollars. J.J. Riley put his money where his mouth is and put up the biggest purse this sport has ever seen.  It looks as though the moment of truth has arrived, because here comes Tommy Riordan.  I wish I knew, Bryan. I wish I knew who he was, and I've gotta say the fact that I don't know is strange. In an internet age where there are no secrets, this guy is a complete mystery. I can't find out anything about him. Tommy Riordan is officially Google proof.  The only reason that Tommy is even in this tournament is because of a video showing him beating up Mad Dog Grimes in the gym.  Tommy Riordan is a genuine war hero, I'm not taking anything away from the guy. He's a very, very tough guy, Bryan, but the tank don't hit back. We've seen YouTube sensations fail on the big stage before.  Yeah, he's the real deal. Very tough guy. Very high caliber fighter. Tommy Riordan came out of nowhere, and I imagine he's going to disappear just as quickly. 64.  Great story, but I think your boy is about to be exposed as a YouTube sensation.  Barbosa's gonna be looking for a take down.  Francisco Barbosa is out cold, and he is out of this tournament, Bryan.  J.J. Riley had less than 48 hours to fill Marco Santos' spot, and he basically had to rely on the word of Frank Campana. 66.  This is Beethoven, Bryan. This is Ode to Joy.  You want to talk about renaissance men, you gotta talk about Frank Campana. Very unorthodox trainer, and one of the best in the game. He's well known for using classical music to train his fighters to remain calm, to remain patient, and to remain composed under pressure.  C'mon, give the guy a break. At least we've seen him fight before. He was in the UFC. We remember him.  Midnight Le getting ready to climb into the cage and go to work.  Brendan retired from fighting some years ago, he's actually a high school Physics teacher now, and Midnight had some fun with that at the press conference.  Midnight is all over Brendan.  The end is near. Can he make it to the end of the round is the question. 70.  He's got a Kimura locked in.  I don't think he's got anywhere to go!  It just did, Bryan.  This is what makes Mixed Martial Arts so great. There's so many ways to lose. One tiny miscalculation at any time and that's it.  Great show of sportsmanship from the teacher.  Midnight Le is shocked. He thought he had a free pass into the second round, but instead he's going home. He dominated the fight the entire way, but fell prey to a very technical finish.  You call it a fluke. I call it a guy maintaining composure and waiting for his opportunity.  I hope you got a receipt for your goldfish.  Wow. Once again, Koba does not break a sweat.  It's certainly possible, Bryan. Koba moving on to tomorrow night.  Mad Dog said he had a message for Tommy Riordan and there it is right there.  Here comes the underdog, Brendan Conlon.  Halfway through round three now and the beating continues.  He doesn't seem to want anything to do with all this adulation, Bryan. He's just here to fight.  Once again, no walk out music.  It sounds like VJ Day in Times Square, Bryan. I've never seen anything like it! 83.  It's been a very long, very miserable few months for Mad Dog to say the least.  Let's see what Tommy has to say about that.  Someone has to stop this.  Mad Dog Grimes has been poleaxed. He is not moving. 85.  Brendan Conlon came into this tournament as a 1000 to 1 underdog, and now here he is in the final four. The crowd's showing their appreciation. They're giving him quite the reception.  Koba is so intimidating. His reputation is larger than life.  Frank Campana has to think seriously about stopping this.  Uh oh, Brendan's going for ride!  Everyone has gotta be concerned about Brendan Conlon's bravery getting him into trouble here.  Brendan's giving back, Bryan. There are signs of life in Brendan Conlon. He's starting to mix it up!  Conlon standing and trading with the Russian! I've never seen this!  He's deep on that knee bar! 91.  Oh my God, that's a deep omoplata!",
        "Warden": "",
        "Perez": "",
        "Pilar": "Bueno?  Tommy! Dios mio! I can't believe it! How are you?  OK. You know me, Tommy. I was getting really worried about you.  They're good. Maria's getting so big. She looks more like Manny every day.  He's good. He's a good kid, Tommy. Takes care of his sister. He's a great kid. Everyone's good.  Whatever you can do, Tommy. I know Manny would really appreciate it. You worry too much. It's OK. We're hanging in there.   Bombs started dropping. They were coming from U.S. planes. Tommy and Manny were waving their flags to let them know they were Americans, but they didn't stop. Everyone died. Everyone except Tommy. You know, my Manny used to say Tommy was the brother he never had.",
        "Fernandez": "",
        "Colt": "We got a tournament coming up. You gonna kill every guy in the `Burgh? Fenroy. Get me some ice. And call that Puerto Rican kid, the one that fights outa the Bottoms. If he's here in 20 minutes, he gets 200 bucks.  Do me a favor guy, go back to your bag. We don't need anybody else getting hurt. G'head. Take a walk.  Then go through the list. Get me Joe Bones.  You ever fought before?    What's your name?  You get tuned up in here, it's on you, Tommy.  Come on in. 14.  How you doin,' sir? I'm looking for Tommy Riordan.  Tommy Riordan? My name's Colt Boyd.  None yet. That's why I'm here. I manage fighters.  Tommy's been working out at my gym. He put a beating on the number one middleweight contender in the world today. I want to know more about the guy. Maybe help him out. I have a lot of contacts, Mr. Riordan.  I'm just looking for some general information here.  Look, I don't mean to interrupt your night. He put this address down when he signed up at the gym.         Tommy? Got some news for ya. I got you into Sparta. Took some doing, but I made it happen..  Thank you and 10 percent is customary. 42.                           Stop it! Stop the fight!",
        "Boyd": "We got a tournament coming up. You gonna kill every guy in the `Burgh? Fenroy. Get me some ice. And call that Puerto Rican kid, the one that fights outa the Bottoms. If he's here in 20 minutes, he gets 200 bucks.  Do me a favor guy, go back to your bag. We don't need anybody else getting hurt. G'head. Take a walk.  Then go through the list. Get me Joe Bones.  You ever fought before?    What's your name?  You get tuned up in here, it's on you, Tommy.  Come on in. 14.  How you doin,' sir? I'm looking for Tommy Riordan.  Tommy Riordan? My name's Colt Boyd.  None yet. That's why I'm here. I manage fighters.  Tommy's been working out at my gym. He put a beating on the number one middleweight contender in the world today. I want to know more about the guy. Maybe help him out. I have a lot of contacts, Mr. Riordan.  I'm just looking for some general information here.  Look, I don't mean to interrupt your night. He put this address down when he signed up at the gym.  Tommy? Got some news for ya. I got you into Sparta. Took some doing, but I made it happen..  Thank you and 10 percent is customary. 42.  Stop it! Stop the fight!",
        "Bryan": "",
        "Callen": "Fourth of July weekend doesn't officially start until tomorrow...  ...but fight fans are already descending on Atlantic City for the Super Bowl of Mixed Martial Arts, Sparta. 52.  J.J., you've made a fortune with your hedge funds, yet you turned your back on Wall Street and dedicated your life to making Sparta happen. Tell us, why is this tournament so important to you?  The roof is about to blow clean off Boardwalk Hall Arena! It might be Fourth of July weekend, but this is Christmas Eve for fight fans! This is Atlantic City! This is the War on the Shore! And this is what everyone has been waiting for! 61.  Sixteen of the baddest men on the planet duking it out over a 24-hour period for the largest purse in Mixed Martial Arts history. In the town everyone knows from the game of Monopoly, we've got ourselves a winner-take-all affair. Buckle your seatbelts, roll the dice, and take riiiiide on the Reading. Sparta. Is. Here!  Welcome, I'm Bryan Callen along with best-selling fight author Sam Sheridan. Sam, when J.J. Riley conceived Sparta he wanted to create, quite simply, the biggest Mixed Martial Arts spectacle in history.  It's unprecedented, Sam. As is the hoopla surrounding Tommy Riordan, the war hero who has become an overnight sensation...  Tommy Riordan's captured the media's attention, but the question still remains: who is this guy? And more importantly, can he compete in this talent pool? Can he win?  You gotta love this guy, Sam. No walk out music, no sponsors, no interviews. He skipped out on the press conference. Wouldn't have his picture take for the program. He's breaking every rule! 63.  But the reason a lot of his fans are in the stands is because of another video, which is even more stunning than the Mad Dog Grimes video. Let me describe it for you folks for the few who haven't seen it, and I don't know anyone who hasn't, but Tommy Riordan ripped the door off a tank in the heat of battle, saving lives in the process, and then walked away without claiming a medal. He ripped the door off a tank!  Sam. He ripped the door off a tank!  Tommy Riordan definitely has his hands full in his first opponent, Francisco Barbosa. Barbosa is nothing to scoff at.  We're about to get the big answer to the big question: is Tommy Riordan for real? And here we go!  Definitely gonna be looking for a take down.  Barbosa is down! Barbosa has been knocked out! Tommy Riordan is most definitely for real! 65.  And now he's walking out of the cage! He's leaving the cage! There goes another rule out the window!  And he chose Brendan Conlon, which quite frankly is something I just don't understand.  I can understand coming out to no music, by why in the world would you choose classical music for your entrance?  My apologies, Mr. Renaissance man.  Classical music is about as fitting to this setting as Brendan Conlon is to this tournament. In fact, let me show you something. 67.  This is Brendan Conlon. He's a feeder fish, and he's about to get dropped into a shark tank.  I remember him, too. I remember him being very unmemorable.  When the brackets were announced, Midnight thought he'd be going up against Marco Santos. He's gotta be thrilled to be seeing Brendan Conlon standing across from him.  He said he was gonna give the teacher a serious lesson, and that getting killed was no way to spend a summer vacation.  This can't last much longer. This won't last much longer. The teacher just has no answers.  And now he's got the hooks in. 20 seconds left.  10 seconds left, and Brendan's face is turning purple. Conlon's whole world is about to go from day to night.  Are you kidding me? 71.  Midnight is in big trouble!  This isn't happening! This can't happen!  Brendan Conlon tapped Midnight! I can't believe it!  Frank Campana embracing his man, Brendan Conlon. I don't think either one of them can believe what just happened. 72.  That's a hallmark of Frank Campana's philosophy right there.  Very technical finish, but come on, that's a fluke.  Conlon beats Midnight!  We're down to eight fighters, soon to be seven as Koba prepares to go to work for the second time tonight.  That was quick.  I'm afraid he might have broken something else, Sam.  Mad Dog fighting like a man possessed. Like a man with something to prove.  The teacher miraculously passed his first test, but now he's gotta face The Dane.  I honestly don't know how Brendan Conlon is still standing, Sam. 75.  He has been absolutely battered in both his fights tonight.  Do it one time, it's a fluke, do it twice, that's something else!  Pull the bandwagon over, I think I'm hopping on! I think I'm a believer!  The crowd catching fire for war hero Tommy Riordan. 77.  Here he comes again like a buzzsaw. Tommy is all over Diego Santana!  There he goes again! Storming right out of the cage!  Tommy Riordan marching through the crowd, and straight into the final four! 78.  Tommy Riordan, coming down the tunnel without his trainer.  I wouldn't say no walk out music, Sam. Listen to this.  Tommy acknowledging his comrades for the first time, and climbing into the cage.  Mad Dog Grimes has been looking for revenge ever since the day Tommy Riordan walked into his gym in Pittsburgh and turned his life upside down.  Mad Dog mocking Tommy with a camouflage motif for his mohawk tonight and the Marines are really letting Mad Dog have it.  Mad Dog predicted an early knockout. Said he was gonna knock Tommy out with one punch.  And they are off!  Tommy tackles him and he's on top! He's raining blows!  That's the fastest knockout I think I've ever seen.  I'll tell you what: you do that to someone on the street and they'd lock you up and throw away the key! Break out the yellow tape, Sam. Tommy's walking away from the cage like he's leaving a crime scene.  He's getting a huge reception. I mean, this guy shocked everybody last night. 86.  And here comes the great Russian Koba.  Should I be nervous for Brendan? `Cause I am. I want to stop the fight before it even begins.  Now the question is, how long can Brendan Conlon stay alive?  Koba just pounding on Brendan Conlon! He's pounding on him like a side of beef!  Koba's got him in the air. Oh no! 88.  Seriously, Sam. How much abuse can one man take?  That one shook the entire building!  His bravery can get him killed, Sam. He's got nothing more to prove. He's already lasted two rounds against Koba, which is more than anyone else can say. You wonder what's keeping this guy up. 89.  Conlon somehow answering the bell for round three, but Koba's all over him again.  Koba's got him caught in an iron vice, squeezing for all it's worth and trying to choke the teacher out.  He just launched Koba! Can you believe this? Conlon just shook off a guillotine!  Conlon's staying after him! He's squeezing him! The tables have turned, and the boy scout is squeezing the bear!  This is a fight! We've got ourselves a fight!  Conlon going for a knee bar! He's got it very deep!  Brendan Conlon wrenching that knee for all it's worth! He's putting everything he has in it, and Koba is screaming in pain!  He did it! Brendan Conlon has tapped Koba! I can't believe it! He can't believe it! Frank Campana can't believe it! This whole place can't believe it!  That's gotta be the biggest upset in MMA history! Brendan Conlon has tapped the great Koba!  Brendan Conlon, the Physics teacher! Brendan Conlon, the civilian! He's done the impossible! He's pulled off a miracle! This place is going crazy `cause we've just seen a miracle! 92.    We've just got some incredible news that I'm having trouble putting into context, but here it is: the two men fighting for the championship tonight, for the five million dollar prize, for the middle weight championship of the world, are brothers.  Here we go, Mom! Time to lock up your china, the boys are at it again!  He's doing it again! Conlon's doing it again! This is going to be over!",
        "Tess": "What's going on here?  Em, you want to open your presents?   This an awfully big box.         Hey babe, I'm late. Mom's saying goodbye to the girls. She's gotta get on the road. They've been fed. They just need a bath.  Can you get them down at a reasonable time tonight? They're exhausted.  Babe.   Yeah. Just like you gave me a call when those Temple frat boys decided to smash up your face.  Alright, well wait up for me tonight. I'll see what I can do about that.            Oh my God. What happened? You said it was going to be a slow night.  What do you mean you're not bouncing?  You've been lying to me?     We'll figure it out. But this is what we're not going back to.     What are you doing?  They're gonna review your case at the end of the semester, but until then you're suspended without pay. Joe gave me the number of his attorney.  He talked to me for free. As a favor to Joe.  He said there's no precedent for this. You'll be back by next semester.  You're gonna put yourself through this over and over, for five hundred bucks a pop?  What are we gonna tell the girls?            Yeah, the girls are good. They're good. Yeah, you should. You've been spending so much time with Brendan these days it's like you're part of the family or something. Yeah, he's right here.  It's your boyfriend.  Really? So that's your decision? You decided? `Cause I really enjoyed that conversation we just had about making that decision together.  You told me you were gonna fight guys that watched too much UFC. I saw that Koba dude on TV, and he's the guy they're watching.  I don't give a shit about the money, Brendan. I told you that. We're gonna end up cashing in your life insurance policy before we pick up that prize money.  I think you can get killed.  Fine, you're not going to get killed. But can you promise me you're not going to get hurt? You're not gonna end up in the hospital? You're not gonna end up paralyzed? We'll have no prize money. No house. Payments for  I'm not gonna watch you fight again. I'm not. I'm gonna get the girls breakfast.         Yes! 73.               What was that!"
    },
    "imdb_rating": "8.1",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTk4ODk5MTMyNV5BMl5BanBnXkFtZTcwMDMyNTg0Ng@@._V1_QL75_UX380_CR0,12,380,562_.jpg",
    "description": "Two brothers face the fight of a lifetime - and the wreckage of their broken family - within the brutal, high-stakes world of Mixed Martial Arts (MMA) fighting in Lionsgate's action/drama, WARRIOR. A former Marine, haunted by a tragic past, Tommy Riordan returns to his hometown of Pittsburgh and enlists his father, a recovered alcoholic and his former coach, to train him for an MMA tournament awarding the biggest purse in the history of the sport. As Tommy blazes a violent path towards the title prize, his brother, Brendan, a former MMA fighter unable to make ends meet as a public school teacher, returns to the amateur ring to provide for his family. Even though years have passed, recriminations and past betrayals keep Brendan bitterly estranged from both Tommy and his father. But when Brendan's unlikely rise as an underdog sets him on a collision course with Tommy, the two brothers must finally confront the forces that tore them apart, all the while waging the most intense, winner-takes-all battle of their lives.—MConnell",
    "name": "Warrior",
    "genres": [
        "Action",
        "Drama",
        "Sport"
    ]
}