{
    "filename": "We-Own-the-Night_script.txt",
    "imdb_id": "tt0498399",
    "imdb_url": "https://www.imdb.com/title/tt0498399",
    "characters": [
        "Vadim Nezhinski",
        "Burt Grusinsky",
        "Joseph Grusinsky",
        "Jumbo Falsetti",
        "Bobby Green",
        "Sandra Grusinsky",
        "Michael Solo",
        "Amada Juarez",
        "Russell De Keifer",
        "Spiro Giavannis",
        "Kalina Buzhayev",
        "Freddie (as Dominic Colon)",
        "Bloodied Patron (as Joe D'Onofrio)",
        "Marat Buzhayev",
        "Pavel Lubyarsky"
    ],
    "dialogues": {
        "Vadim": "Bobby walks   to the table. There's a lot of food around Vadim--he's   eating off six different plates. Bobby is really only   focused on Rosario. When Rosario sees him she brightens, virtually getting out   of her seat:   Bobby--c'mon, join us! I wanna talk to you!  This is the fuckin' guy right here. Practically owns the place.  Everything all right with you?  That's real good... `Cause you gotta be happy, you know? All my guys, I tell `em, the mind and the body, they're connected. That's how you stay sharp.  You know Bobby, my uncle upstairs, he, he likes you a lot. Practically thinks you're one of his kids.  Yeah... Smart smart stupid. Got his head buried in books all day, `stead of the real world...  Listen uh, I come to you, I tell you I got some friends bringin' a load in here, maybe something big-- I'm just talking now--they bring it in, how do you feel about that?  Well, upstairs don't gotta know everything, am I right? Place gets packed every night, everybody wins.  You know, you should think about comin' in with us. You're popular-- you could help us...expand a little. A lotta money in it.  Go ahead.   We'll talk.  The cross is for good luck.  That one's for God.  Get us onto the expressway... Move!  Hey, look who's here!    Glad to hear it.    You know--  We got a lot of muscle behind us. Lotta muscle.  That's right.  Bobby, those cops--they, they ain't no problem.  You see this? I got this on the inside, at Tchita. You earn these. So don't worry--we'll get `em all. Cut off the head, the body'll fall, right? You keep on doin' it `til they get the message. We got all their names. On a list.  Just think about it. You change your mind, you call Pavel.  You needed to come here tonight...?  What's the matter, ain't Pavel good enough for you?  Where'd you get this?     All the shit I get here is at least eighty-six percent pure. And we got a lot more comin' in--a LOT more. In a way nobody could ever trace.  The whole city'll be sucking our glass soon--you'll see. We push the Guineas out, the Domos'll work for us.  You're breathing heavy.  You know, I seen fighters--they breathe like that, means they get nervous. You nervous?  You got both matches and a lighter.  He got a wire! Kill this motherfucker, right now!  Don't shoot!  He is a dead man...   The car is moving. Jack is driving. Another cop is in the front passenger seat. Two other cops straddle Vadim. Silence, then, motioning toward Joseph's car:   They did good.    On his face.   Jack puts a cigarette in his mouth, turns to the cop next to him:    THREE MEN IN SKI MASKS emerge from the van, automatic WEAPONS IN HAND. JACK PULLS OUT HIS PIECE and immediately begins firing at them, using the wheel and dashboard as cover. He opens his door to slink out.    The other two officers are immediately riddled with    The rest of the product is in the van--total weight, 75 kilos.  REALLY STARTS TO BURN. It is an odd flame, BLUE and   Within what seems like a split second, Bobby raises his SHOTGUN and FIRES it. VADIM CRUMPLES TO THE GROUND. A DIRECT HIT to the chest.  Bobby lifts his shotgun and approaches. The weeds separate, REVEALING NEZHINSKI, with a look on his face that registers a kind of shock, a shock that he's been hit. Nezhinski sees Bobby standing over him. With all the energy he has in the world:   Don't...don't let me die in here...",
        "Nezhinski": "Bobby--c'mon, join us! I wanna talk to you!  This is the fuckin' guy right here. Practically owns the place.  Everything all right with you?  That's real good... `Cause you gotta be happy, you know? All my guys, I tell `em, the mind and the body, they're connected. That's how you stay sharp.  You know Bobby, my uncle upstairs, he, he likes you a lot. Practically thinks you're one of his kids.  Yeah... Smart smart stupid. Got his head buried in books all day, `stead of the real world...  Listen uh, I come to you, I tell you I got some friends bringin' a load in here, maybe something big-- I'm just talking now--they bring it in, how do you feel about that?  Well, upstairs don't gotta know everything, am I right? Place gets packed every night, everybody wins.  You know, you should think about comin' in with us. You're popular-- you could help us...expand a little. A lotta money in it.  Go ahead.   We'll talk.  The cross is for good luck.  That one's for God.  Get us onto the expressway... Move!  Hey, look who's here!    Glad to hear it.    You know--  We got a lot of muscle behind us. Lotta muscle.  That's right.  Bobby, those cops--they, they ain't no problem.  You see this? I got this on the inside, at Tchita. You earn these. So don't worry--we'll get `em all. Cut off the head, the body'll fall, right? You keep on doin' it `til they get the message. We got all their names. On a list.  Just think about it. You change your mind, you call Pavel.  You needed to come here tonight...?  What's the matter, ain't Pavel good enough for you?  Where'd you get this?     All the shit I get here is at least eighty-six percent pure. And we got a lot more comin' in--a LOT more. In a way nobody could ever trace.  The whole city'll be sucking our glass soon--you'll see. We push the Guineas out, the Domos'll work for us.  You're breathing heavy.  You know, I seen fighters--they breathe like that, means they get nervous. You nervous?  You got both matches and a lighter.  He got a wire! Kill this motherfucker, right now!  Don't shoot!  He is a dead man...  They did good.    On his face.  The rest of the product is in the van--total weight, 75 kilos.    Within what seems like a split second, Bobby raises his SHOTGUN and FIRES it. VADIM CRUMPLES TO THE GROUND. A DIRECT HIT to the chest.  Bobby lifts his shotgun and approaches. The weeds separate, REVEALING NEZHINSKI, with a look on his face that registers a kind of shock, a shock that he's been hit. Nezhinski sees Bobby standing over him. With all the energy he has in the world:   Don't...don't let me die in here...",
        "Burt": "Here, take another one! Get another!     You see your brother yet?    Hello.  We gotta talk to you. Alone.  Your hair's long.    Joseph!  I knew you wouldn't help us. I told your brother, I said, `no point even bringing him down here.'  Hold on a second--lemme ask you a question. That girl of yours downstairs--she Puerto Rican?  She hooking you up?  Yeah, keep laughing--your mother, rest in peace, I think she was too easy on you.  Thank you. You know, I used to tell my kids, \"work first, play later,\" and my son Joseph really took it to heart. He's been a real fighter over the years... He overcome his mother's passing, and the dyslexia--eventually wound up graduating John Jay as salutatorian and distinguished himself many times. Anyway, you've shown yourself to be very brave and selfless, and I'm just, I'm very proud here tonight.  Where you going? I was the one who got you outta there!  You're a real big shot, aren't you! You see what happened in there last night? Hey--I'm talking to you!  You know, you and your girlfriend're only getting off `cause of your brother. Up to me, you'd sit in there another couple days.  Fire you?! From what? Probably the best thing that ever happened to you!  Don't EVER speak to me like that again. You hear me? I'll rap you right in the mouth!  You gotta keep your hands up! Keep your hands up!  Which kid is it?  No.   Go on, I'll be right out...  What're you lookin' at?!? It's got nothing to do with you...  What do you want? You stayed out of it--you got what you wanted. Why don't you go somewhere and pick a fight--you're good at that!  Nah, I don't want that crap.  Hello, your honor. Commissioner. Thank you for coming.  We'll get `em, your honor. I'm gonna come back in and run it myself--we'll get `em.  I'm working.  No. They'll be back on the street in a day. We gotta try and catch `em with their hands full--find out where they got the real weight. Then we can move.  Doesn't matter. It's our only play.  What're you talkin' about?! C'mon, don't be a first-class schmuck!  Then we make the time! Look, I want you all to understand something--we don't ever play in the dirt here, okay? Not ever, no matter what! You piss in your pants, you only stay warm for so long.  Bunch of college boys from Kansas. We protect our own here.  Forget it, both of you.   That's too dangerous for him! We don't know how solid his cover is out there! That girlfriend of yours, she knows about you, right? So can we just get back to the discussion please?  What?  Good. I'm glad. But it's not happening. So forget it.  Don't worry about me, just worry about yourself, arright? Anything happens with your brother I'll call you. Goodbye.  Goodbye!  Where's my goddamned kid?!?  Jesus.  You guys go on a bust like this and you don't tell me about it? You think I'm born yesterday?  You're a real comedian! He's gonna need to be in protection now!     I'll get them to take care of that. Just go get yourself fixed up-- that's the most important thing.  Joseph--we got some things we need to discuss, when you get the chance.  Bobby--you should hear this too, for the trial.  We're gonna try and turn him, get him to tell us how they're bringing it in. But don't worry--we'll make sure he does plenty of time.  Well, you marry an ape, you don't complain about the stench of bananas.  What's that, Bobby?  I asked him to come in, Joe. If he's gonna have to testify, he should know all this.   No--it's better this way. I don't want him sitting around with nothing to do, feeling useless--  Hey, c'mere. A lotta people been talking. About how good you did. And I think maybe...considering the alternatives... ...maybe you might wanna think about joining the Department.  I could pull some strings, get you through the academy with an early  Wait--Don't go yet--  Can't you put some clothes on him?   Burt, dressed in his v-neck undershirt, is reaching into a jar of B &amp; G pickled tomatoes. The television plays \"THE PEOPLE'S COURT\". THE PHONE RINGS; Burt grabs the receiver:   Hello?   What's the matter? Huh?  Jesus! Listen to me--you and Jack get someplace safe. Let ESU take care of it--I'm gonna go get your brother.  Nezhinski's out.  Your brother was taking him to the A.D.A. and they got ambushed. They hit three of our guys.  Your brother's fine. We gotta get you moved--you've been here too long.  You need to pack up.  Nah, we're good. It's just, I just realized--I know this neighborhood. I used to come with my father, to work on the plumbing, for the houses--brought me along to do the talking. He only spoke Russian his whole life... Anyway, it's all changed now.  Arright...  I don't know... I heard he did good, though. You know, with everything that's happened--who knows? Maybe all this'll bring us closer together someday.  Once this is over, you and your brother, you'll talk, you'll work things out.  Bobby--your brother, I think he probably feels a little guilty, with everything you did, with you in protection now... But he appreciates what you've done--I know he does.  Look, I'm just trying to keep us together here, that's all. That's all I want.     OTHER, SIDE TO SIDE; THEN, A HUBCAP--we don't know from which car it's been dislodged...   They got a hit on! Get support, now!  I got him!   I got the sonofabitch!",
        "Grusinsky": "Here, take another one! Get another!  Pop, they got enough! What're you doin'?!?     You see your brother yet?      How you doing...  Feels like nothin'. Nah, it feels good! I love trying to, you know, help make the City safer for people and everything...  Bobby, hey! You, you got off work and everything--  Hello.  We gotta talk to you. Alone.  Your hair's long.  Bobby, I asked Pop to bring you here.  Well... I'm gonna be heading up a new narcotics team, starting this week. A Russian unit, outta PSA 2 in Brighton.  Yeah, they need me over there. There's only eleven guys in the whole department that even know the language right now, so...  Bobby, we need you to do us a favor.   We're looking at this guy Vadim Nezhinski.  Served time in the Soviet Union for black market activity, come over around 1979.  He's dealing H, cocaine, angel dust... Operates out of that club you manage. The El Caribe.  No, we know that. We checked up and down the rest of management, too--his uncle, the owner--  Everybody come up clean. It's just Nezhinski we're lookin' at.  We need to track how he's bringin' in the product and...we were just hopin' you'd keep your eyes and ears open a little.  No, we would never ask you to do that. Just observe, that's all. It's a closed community and you're our only way in right now--  Nothing's gonna get fucked up, Bobby. All it takes is one thing, you know that! One guy to flip, we crack the whole thing!  Whole city's falling apart, Bobby-- don't you got any sense of responsibility at all?    Thanks for coming.  Just be careful out there next coupla weeks.  Joseph!  I knew you wouldn't help us. I told your brother, I said, `no point even bringing him down here.'  Hold on a second--lemme ask you a question. That girl of yours downstairs--she Puerto Rican?  She hooking you up?  Yeah, keep laughing--your mother, rest in peace, I think she was too easy on you.  Thank you. You know, I used to tell my kids, \"work first, play later,\" and my son Joseph really took it to heart. He's been a real fighter over the years... He overcome his mother's passing, and the dyslexia--eventually wound up graduating John Jay as salutatorian and distinguished himself many times. Anyway, you've shown yourself to be very brave and selfless, and I'm just, I'm very proud here tonight.  Thank you everybody for coming-- happy Thanksgiving. Before I say anything else... We got some bad news this morning.  One of our Irish brothers was killed in the line of duty last night--detective Edward Conlon was gunned down serving a warrant on Northern Boulevard. The clock's about to strike ten, so I thought we might give a moment of silence to remember.  Good. I just wanna make sure we take it easy in there. We don't want no panic.  It's his day off. He ain't gonna be there.  Everybody! Get your hands on your head and don't fuckin' move! Turn off that music. Right now!  Give everybody a toss. G.Q.--  Too much pizza, right there.  Turn around...    Turn around!  What is this? Want me to double your money? Huh?  Okay.   It's doubled now, how's that.  You got a cross AND a Jewish star on you?  What's the star for?  Okay, let's go. You. And you-- You're under arrest, possession and sale of narcotics--  Your boy's gonna turn. And then we'll come back for you.  Where you going? I was the one who got you outta there!  You're a real big shot, aren't you! You see what happened in there last night? Hey--I'm talking to you!  You know, you and your girlfriend're only getting off `cause of your brother. Up to me, you'd sit in there another couple days.  Fire you?! From what? Probably the best thing that ever happened to you!  Don't EVER speak to me like that again. You hear me? I'll rap you right in the mouth!  He stabbed himself, he was a bundle guy. Mighta known how they're movin' it. See, that's the key--  We waited `til it was your day off. We had to go--I'm sorry.  Nezhinski was seen there, Bobby! What am I supposed to do--announce it in advance, compromise the whole thing? C'mon.  Yeah, well, I tried. What do you want from me, anyway? You know, you're standing there feeling sorry for yourself, but you wouldn't be in this shit if you didn't fuck around in the first place.  Bobby, you're the one acting like you're above it all all the time!  Fuckin' around with your little Puerto Rican all day--  You heard me. Have some fucking class for once.    You come at me like that...? Don't come around me no more--I don't wanna have to look at your fuckin' face ever again.     You gotta keep your hands up! Keep your hands up!  Which kid is it?  No.   Go on, I'll be right out...  What're you lookin' at?!? It's got nothing to do with you...  What do you want? You stayed out of it--you got what you wanted. Why don't you go somewhere and pick a fight--you're good at that!  Nah, I don't want that crap.  Hello, your honor. Commissioner. Thank you for coming.  We'll get `em, your honor. I'm gonna come back in and run it myself--we'll get `em.  It's okay.  He's alone. Your father just left for the precinct.  I'm working.  No. They'll be back on the street in a day. We gotta try and catch `em with their hands full--find out where they got the real weight. Then we can move.  Doesn't matter. It's our only play.  What're you talkin' about?! C'mon, don't be a first-class schmuck!  Then we make the time! Look, I want you all to understand something--we don't ever play in the dirt here, okay? Not ever, no matter what! You piss in your pants, you only stay warm for so long.  Bunch of college boys from Kansas. We protect our own here.  Forget it, both of you.   That's too dangerous for him! We don't know how solid his cover is out there! That girlfriend of yours, she knows about you, right? So can we just get back to the discussion please?  What?  Good. I'm glad. But it's not happening. So forget it.  Don't worry about me, just worry about yourself, arright? Anything happens with your brother I'll call you. Goodbye.  Goodbye!  Hello?  Hello...?  Where's my goddamned kid?!?  Jesus.  You guys go on a bust like this and you don't tell me about it? You think I'm born yesterday?  You're a real comedian! He's gonna need to be in protection now!     I'll get them to take care of that. Just go get yourself fixed up-- that's the most important thing.  Only when I look at you!  Hey, Bobby...  Everyone, let's, let's move inside-- there's plenty to eat!  Joseph--we got some things we need to discuss, when you get the chance.  We could do it now if you want, Pop. In the den.  Bobby--you should hear this too, for the trial.  We're gonna try and turn him, get him to tell us how they're bringing it in. But don't worry--we'll make sure he does plenty of time.  He ain't gonna be reliable, Pop.  Well, you marry an ape, you don't complain about the stench of bananas.  Where is he?  I wanna go with you on that. See his fuckin' face.  That's `cause we got their number one. Dried it up at the source.  What's that, Bobby?  Bobby--you done a lot for us already. You don't gotta get involved in this anymore. Okay?  I asked him to come in, Joe. If he's gonna have to testify, he should know all this.  This's police business, Pop--you gonna make him an honorary member of the Force now?   No--it's better this way. I don't want him sitting around with nothing to do, feeling useless--  Hey, c'mere. A lotta people been talking. About how good you did. And I think maybe...considering the alternatives... ...maybe you might wanna think about joining the Department.  I could pull some strings, get you through the academy with an early  Wait--Don't go yet--  Can't you put some clothes on him?  I'll go in the lead car. You stay with him `til we get to the A.D.A.'s.  He makes a deal today, maybe my brother don't gotta take the stand... Least that's something...  Stop the fuckin' car!  Hello?   What's the matter? Huh?  Jesus! Listen to me--you and Jack get someplace safe. Let ESU take care of it--I'm gonna go get your brother.  Nezhinski's out.  Your brother was taking him to the A.D.A. and they got ambushed. They hit three of our guys.  Your brother's fine. We gotta get you moved--you've been here too long.  You need to pack up.  Nah, we're good. It's just, I just realized--I know this neighborhood. I used to come with my father, to work on the plumbing, for the houses--brought me along to do the talking. He only spoke Russian his whole life... Anyway, it's all changed now.  Arright...  I don't know... I heard he did good, though. You know, with everything that's happened--who knows? Maybe all this'll bring us closer together someday.  Once this is over, you and your brother, you'll talk, you'll work things out.  Bobby--your brother, I think he probably feels a little guilty, with everything you did, with you in protection now... But he appreciates what you've done--I know he does.  Look, I'm just trying to keep us together here, that's all. That's all I want.     ...I'll catch `em, Bobby. Don't worry...  They're gonna need us to identify the body...     I'll be ready to come back and head it up. I'll be ready and, and we'll get `em. After the funeral.  Bobby... I'm real glad you're with me now...  You know, I was...I was jealous of you, [for a] long time.  ...I always did what Pop wanted. And you were free...  ...It's all right... I'll be all right...  What about Nezhinski's uncle? That clubowner--Marat Buzhayev?  It's comin' up quick, we don't know anything... We're gonna lose it...  I know that. And my family takes the hit--my family...      It's not that. It's just... You give up what you wanted to do to be here, Bobby. And part of me feels a little responsible.    Yeah, definitely... We'll get the TAC plan together... And wherever it is, we'll be ready for `em...  Yeah?  The deal's closing--let's go!  You know, I think Pop would be real happy to see you like this.  Ah, the Force'll treat you good. I'm sure you do very well.    Arright, yeah.    Sounds good.  I love you, Bobby.",
        "Joseph": "GRUSINSKY'\". Cases filled with trophies. Food tables, piled high. And beer. Lots and lots of beer.  Many COPS are drinking, cavorting, smoking CIGARS, making sandwiches. And DANCING UP A STORM. Men and women FLIRT, GAB, MAKE OUT. FLASH! Pictures taken constantly. A mass of people surround TWO PEOPLE as a PHOTO is taken:  ANGLE ON: JOSEPH GRUSINSKY, thirties. Bobby's OLDER BROTHER. In uniform. Clean-cut, though not neurotically so. Sharp, tough features--the GLOW of a WINNER. He is SMILING, receiving many AD-LIBBED CONGRATULATIONS and holding one of his children in his arms, infant PAUL. Next to him is his wife, SANDRA, thirties. Next to her, their older infant, TEDDY.  NEXT TO JOSEPH: BURT GRUSINSKY, sixty. Bobby's father, we will soon learn. Tough as nails. Unsentimental, ex- military, rough-edged, vital. In this world, he is a king.  Standing behind Burt are his two closest associates: MICHAEL SOLO , fifties, somewhat urbane, and JACK SHAPIRO , also fifties. A big, quiet man. Huge hands. The enforcer. Burt is beaming over his treasured son. He directs a PHOTOGRAPHER, repositions Joseph:   Pop, they got enough! What're you doin'?!?    How you doing...  Feels like nothin'. Nah, it feels good! I love trying to, you know, help make the City safer for people and everything...  Bobby, hey! You, you got off work and everything--  Bobby, I asked Pop to bring you here.  Well... I'm gonna be heading up a new narcotics team, starting this week. A Russian unit, outta PSA 2 in Brighton.  Yeah, they need me over there. There's only eleven guys in the whole department that even know the language right now, so...  Bobby, we need you to do us a favor.   We're looking at this guy Vadim Nezhinski.  Served time in the Soviet Union for black market activity, come over around 1979.  He's dealing H, cocaine, angel dust... Operates out of that club you manage. The El Caribe.  No, we know that. We checked up and down the rest of management, too--his uncle, the owner--  Everybody come up clean. It's just Nezhinski we're lookin' at.  We need to track how he's bringin' in the product and...we were just hopin' you'd keep your eyes and ears open a little.  No, we would never ask you to do that. Just observe, that's all. It's a closed community and you're our only way in right now--  Nothing's gonna get fucked up, Bobby. All it takes is one thing, you know that! One guy to flip, we crack the whole thing!  Whole city's falling apart, Bobby-- don't you got any sense of responsibility at all?  Thanks for coming.  Just be careful out there next coupla weeks.  Thank you everybody for coming-- happy Thanksgiving. Before I say anything else... We got some bad news this morning.  One of our Irish brothers was killed in the line of duty last night--detective Edward Conlon was gunned down serving a warrant on Northern Boulevard. The clock's about to strike ten, so I thought we might give a moment of silence to remember.  Good. I just wanna make sure we take it easy in there. We don't want no panic.  It's his day off. He ain't gonna be there.    Everybody! Get your hands on your head and don't fuckin' move! Turn off that music. Right now!  Give everybody a toss. G.Q.--  Too much pizza, right there.  Turn around...    Turn around!  What is this? Want me to double your money? Huh?  Okay.   It's doubled now, how's that.  You got a cross AND a Jewish star on you?  What's the star for?  Okay, let's go. You. And you-- You're under arrest, possession and sale of narcotics--  Your boy's gonna turn. And then we'll come back for you.  He stabbed himself, he was a bundle guy. Mighta known how they're movin' it. See, that's the key--  We waited `til it was your day off. We had to go--I'm sorry.  Nezhinski was seen there, Bobby! What am I supposed to do--announce it in advance, compromise the whole thing? C'mon.  Yeah, well, I tried. What do you want from me, anyway? You know, you're standing there feeling sorry for yourself, but you wouldn't be in this shit if you didn't fuck around in the first place.  Bobby, you're the one acting like you're above it all all the time!  Fuckin' around with your little Puerto Rican all day--  You heard me. Have some fucking class for once.    You come at me like that...? Don't come around me no more--I don't wanna have to look at your fuckin' face ever again.      Joseph drives up to the house, a working-class part of Queens. He parks the car.   Hello?  Hello...?   Several POLICE CARS line the block. There are ARMED OFFICERS perched on rooftops. As PROTECTION. Many of the houses have \"WELCOME HOME\" banners hanging from them. The media are here. NEIGHBORS are on their porches.    Packed with people and playing CHILDREN. Lively. Food everywhere. TWO ARMED GUARDS stand against the wall. A CROWD surrounds someone. Then, as the CAMERA DOLLIES CLOSER, people move away to reveal: BOBBY, seated in a chair against the wall. His leg is bandaged. AD-LIB friendly HELLOS from partygoers, who surround him and treat him respectfully. PAN OVER TO REVEAL: ROSARIO, seated next to him. She sits quietly; his arm is around her shoulder. People are STARING AT HER.     Only when I look at you!  Hey, Bobby...  We could do it now if you want, Pop. In the den.   Burt and Joseph and Jack and Mike.    Bobby enters the room. As he does, we HEAR:   He ain't gonna be reliable, Pop.  Where is he?  I wanna go with you on that. See his fuckin' face.  That's `cause we got their number one. Dried it up at the source.  Bobby--you done a lot for us already. You don't gotta get involved in this anymore. Okay?  This's police business, Pop--you gonna make him an honorary member of the Force now?  I'll go in the lead car. You stay with him `til we get to the A.D.A.'s.   As Joseph looks back at Vadim's vehicle, behind him:   He makes a deal today, maybe my brother don't gotta take the stand... Least that's something...   The cops see this accident.     The DRIVER:   Stop the fuckin' car!      Sitting on the couch is Joseph. He is trying to be stoic, but appears wan and tired. Alone. We HEAR the crowd in the house, but they are in the living room. A KNOCK: Bobby enters.   ...I'll catch `em, Bobby. Don't worry...  They're gonna need us to identify the body...     I'll be ready to come back and head it up. I'll be ready and, and we'll get `em. After the funeral.  Bobby... I'm real glad you're with me now...  You know, I was...I was jealous of you, [for a] long time.  ...I always did what Pop wanted. And you were free...  ...It's all right... I'll be all right...  What about Nezhinski's uncle? That clubowner--Marat Buzhayev?  It's comin' up quick, we don't know anything... We're gonna lose it...  I know that. And my family takes the hit--my family...      It's not that. It's just... You give up what you wanted to do to be here, Bobby. And part of me feels a little responsible.     The group is all together. Cops we don't know pack the room, standing around the table. Seated at the table: Michael, Jack, Bobby, and at the head, Joseph. A TOUGH- LOOKING COP we've seen before but not met:   Yeah, definitely... We'll get the TAC plan together... And wherever it is, we'll be ready for `em...  Yeah?  The deal's closing--let's go!  You know, I think Pop would be real happy to see you like this.  Ah, the Force'll treat you good. I'm sure you do very well.    Arright, yeah.    Sounds good.  I love you, Bobby.",
        "Jumbo": "",
        "Falsetti": "Okay, Bobkes! Looks like you got everything under control here--so uh, so I'm gonna go outside, take my break!  Yes, your fuckin' majesty!  Yeah--let's all play Spin my Pickle!     Shut your mouth! You wouldn't recognize `em--they were, they were all undercover.  Anyway, I got a little of what everybody asked for here. I got uppers, downers, hash, mescaline, some blow-  Yeah, you need that, not me!  And what's with the suit anyway? You look like a monkey in the circus!  Yeah? Well, you know what you should do, you should turn it into a fag joint and then maybe they'll let ya in!  My brother! How'd it go? Ho, well! I'm guessing it went pretty good then!  That's my specialty. I'm whaddaya call, a people person!  Yeah, no problem--half of `em got rats as pets anyway.  She's a player, Bob. You know how it goes.    I do, I'm serious! Last year, one of his guys was gonna flip? Jesus Christ, what I saw...  Nezhinski dragged him into the toilet. They stood him up against the wall and held him--  They fuckin' pulled down his pants, and I swear to God, Nezhinski just cut it off.  Worst thing I ever seen in my life, Bob. Anyway, cops found his head in the middle of Brighton Avenue the next day--fuckin' dick was in his mouth.  Yeah, that's funny. You sure it wasn't your mouth?  Jesus, that cop's crazy!  I got a bruise too, you know--right here!  So Bob, I think we fold. We fold, right?    Bobkes, I love you!  I was the one told him to keep goin'!  Bobkes--?   What's wrong?    Take it easy, TAKE IT EASY! Calm down and everything'll be, uh, non compos mentis!  Where'd you run off to, like a Jew? You got outta there, it became like a real zoo. The spics-- `Scuse me--the P.R.s, they're goin' nuts for the money--picka picka picka picka--and the girls, they're screamin', and I'm keepin' everybody in line. I'm fuckin' bustin' heads, like Bruce Lee--I'm fuckin' bustin' heads--  Oh, `scuse me, sorry about that.  Arright. But I'll tell you Bobkes, nobody else could ever do for you what I did.  Bobkes! My brother! I been calling you all week! Where you been?!? We missed you!!!  Yeah well, without you around I hadda lower myself here by hangin' out with Freddie!  Bobkes!!!    You know Bob, everyone's been askin' `bout you. We was all real surprised to hear about your family- -I mean, your father's like J. Edgar Hoover--   At that moment, BOBBY SEES his old friend, and the two make EYE CONTACT. Bobby is greatly moved by his appearance, and nods subtly to Jumbo. Louis salutes gently, a slight and sympathetic smile coming across his face...  SIMULTANEOUS: Joseph takes a look at the COFFIN, grows more distraught. He breaks down. Bobby is there to catch him and does.   HEY!!!!   Bobkes!!! How you doin'?!  No. She's holed up with you, ain't she?--God knows where.  Well, I talk to her, I'll tell her you called.  Oh Bob! That's great! Whaddaya say we knock back a few in your Dad's memory tonight?  Come on! El Caribe's got their masquerade party--every third drink's free. Be like old times! I'll be there--what more could ask for! C'mon! You comin'? Huh? You gonna be a man or not?  My brother!   The Grand Return!  You ain't heard from Rosario yet?     And you're already acting like a pain in my ass! I can hold my liquor and yours!  Bob, you all right?  Florida? Well, she probably just needed a little time for herself. She'll be back.  Ah, don't worry, Bob. I have no doubt she'll be back.  I mean, between you and me, that place they had you in was drivin' her crazy. The Kew Motor Inn--we used to call that the SCREW Motor Inn, with all the hookers... Get that waitress wouldja?  Huh?    I don't know--  But I don't kn--  Bob, we're, we're buddies--we're like brothers! C'mon!  Bobby I swear--I don't know nothing!  No, wait! Bob, please! Don't do this to me... Don't do this to me Bob, please...  Bobby, I... I told `em where you were--but, but it ain't what you think! I was makin' a buy and these guys in hoods, they held a gun to my head--so I tried to give `em the wrong information!  No, wait, listen! It's true! Rosario tol' me you moved every couple days, she said you was gonna move--I thought you'd be gone by then! It's the truth, Bobby! I would never try and hurt you! Never, swear to God!",
        "Bobby": "...you're so fuckin' beautiful, you know that...?    What the fuck's goin' on in here?  Yeah--just keep that wide load of yours outta trouble, arright?  What're you doing?!? You gotta behave yourself here!  Well now you're gonna do nothing someplace else! Now listen--one of these days I'm gonna run this whole block, and I see any you in here again--any you-- I'll bust your fuckin' hole! Throw `em out on their ass. I gotta go upstairs, drop off my keys with the old man.  Mr. Buzhayev, how are you!  Listen, Mr. Buzhayev--I gotta go do something right now. But don't worry--everything's in good shape downstairs.  You remember what I tol' you?  Nobody knows about my father and my brother--not even Jumbo. And it's gotta stay that way, you understand?  Nah.   Nah, I'm managing now.  Yeah. I'll see you `round, arright?    That's them there. In the corner. Lookit `em--two peas in a pod.  [My] Father's friends--they were all in Korea together. Biggest bunch of fuckin' stiffs... Look, don't talk to nobody, we'll get out quicker.  N--I just wanna get out quick, that's all...  Yeah I did so...congratulations...  Pop. Everybody, this is my girlfriend. Rosario.  This's my brother. And my father.  I know. I like it this way. That why you got me up here?    [To] tell me my hair's too long?  Whatsamatter?    You ever talk?     You cut me off financially, and now you need the favor? `S interesting.  `S good lookin' boy!  I don't know nothing about that.  The old man?! What, you been watching us?!?    You kidding me? Inform for you?!? That's what you wanted me here for?  Yeah well, find another way. I got a lot invested in that club and I can't let it get fucked up.  [You] Fuckin' broadsided me... Everything's about the goddamned job with you.  C'mon... Get off your fuckin' high horse and bust somebody else's balls.  You're welcome.  'S that supposed to mean?!?  Congratulations. You got me up here.  Good.   Then now you know.  Yeah.   I like the dark meat.    I gotta go, Pop. I'll see you `round.  C'mon, let's get outta here, [we'll] go party with Jumbo.     MUSIC UP: PRINCE'S \"HOUSEQUAKE.\" Hot girls and flashy- looking guys. The men are drinking. The women make themselves up en masse in front of a large mirror over the sofa. A couple KISSES in the corner. Everyone's getting ready for a night of revelry on the town. They are SINGING, having a GREAT TIME. The decor is late `70's, though not exaggeratedly so. DRUGS are EVERYWHERE. We   PAN around the ROOM: a set of weights on the carpeted floor, with clothes scattered everywhere; on the wall, a Jets football schedule, a Led Zeppelin poster. Bobby is PRIMPING in the mirror. Rosario stands on Bobby's king bed, DANCING SENSUALLY to the music in a state of partial undress. She MOVES with great FREEDOM, puffing on a JOINT.   You're just like her, baby...  That's cool.  It's all right--they don't like nobody outside their own little world.  My brother and my father ain't like that. It's just--the whole thing ain't for me, that's all.  You know how gorgeous you are?  What is it?  ...it's beautiful...  ...you're so good to me...  Only if you behave yourself...   A mussed Bobby ENTERS from the bedroom, passing the party. Bobby opens the FRONT DOOR: Louis, Hazel. Thrilled, he waves them in. When the rest of the room sees Louis, THEY SCREAM \"JUMBO!\" He holds his arms aloft, as if greeting an adoring crowd.   Uh oh--[The] party's really gonna get started now!  Any Spanish Fly in there for you?  I'm goin' up to see Buzhayev tonight. I think he's gonna ask me to buy into the club.  I'll show you a fuckin' faggot!  Everybody, I gotta be at El Caribe in an hour, so get ready!  No no, I'm all right... Hi everybody...  Everything's really rockin' tonight. Line's halfway `round the block.  You wanted to talk to me?  'S a good move.  I appreciate that. You know, I been thinking `bout it--I'd like to become a partner here too--buy in with you. I mean, I got a lot of ideas.  Well, I just think we could do more. Maybe expand into Sheepshead Bay. I know a good spot--we add a restaurant there, get the spill- over. Like what your brother did, in Miami.  I can understand that. But I got money to invest--we could make it something real special over there. Do what I did downstairs--you know, bring in name DJs on different nights? What do you think?  Yeah, sure.   I'll come.  Nah nah, no thank you...  Listen--I get this done, I want you to be a host. In one of our spots.  Well, just make sure you get your old co-workers from the Health Department to give us a pass on the kitchen.  Where's Rosario?  Goddamnit... [She's] With that fuckin' animal again.  Look at him... I'll tell you, [when] this is my place, we'll kick his fuckin' ass right outta here--  Yeah, you know a lot.  You sure it wasn't your dick?  Shit... I'll be right back.    He don't look like a middleweight no more.  Your uncle's a great man. Smart man.  Your uncle loses his license, he ain't gonna be too happy.  Yeah...I'll think about that. Rosario--I wanna talk to you.  You gotta stop dealing. You hear what I'm telling you?  You hear what I said?  Just hold off then, for a little while. Okay? I got my reasons.  Gimme your shit!  Thanks a lot.    I appreciate it.  Okay, I'll go thank him too then. He comes in, raids the fuckin' place--now I gotta go beg `em not to fire me--  Fuck you, Pop.    Fuck the both of you's.  You fuckin' touch me!? You gonna fuckin' touch me?!?  Mr. Buzhayev... I'm real sorry about what happened the other night. [If] I was working, maybe I would've been able to do something, but... Anyway, I'm sorry.  You don't mind my saying, I think that's probably the right thing to do. Things get back to normal, I'm hoping we could get started on what we talked about.  Mr. Buzhayev, my getting arrested ain't gonna be a problem. I don't got a record--  Yeah...   All right...  You had to hit that spot.  I had plans down there.  You got real balls saying that to me. I made something for myself, and you come in and fuck it up? Just `cause I'm not trying to be like you? And Pop--  What did you call her?  You piece of shit...  Fine with me, you motherfucker!   SMOKE AND DRINK everywhere. MADONNA'S \"DRESS YOU UP\" plays in the background. CROWDED. Bobby, Rosario, and Louis are at the center of a poker game. Lou sits next to Bobby, partnering with him in the game and whispering into his ear from time to time. Rosario sits next to Bobby and watches the game intently.  The poker pot seems exceptionally large. A STOCKY LATINO MAN is the main one competing with Bobby. Bobby's a mess, maybe worse than we've yet seen him. But he is HAPPILY DRUNK, his eyes BLOODSHOT. He and Louis look at their cards. Rosario turns, looks at Bobby for a BEAT. She sees a small bruise he's got on his forehead, kisses it.   That ain't nothing.  We'll see you and bump you two C's.  Siegfried and Roy, baby! Two fucking queens!  Who is it?  Hello?  Is--is he gonna be all right?  My brother was shot...they're operating on him now.  Game's over, everybody.  That's right.    I gotta go.  What're you doing?  No--it's gonna be a fuckin' scene. I'll call you later.    Don't argue.  Louis, lock up and take her home.  Yeah, no--I just remembered I gotta do something, that's all--  Pop?  Pop, he all right?    You guys blaming me for this? Is that it?  That's bullshit--she's clean.      You fuckin' keep away from her.  Yeah.   That's me.  Look--I'm his brother, you fuckin' hard-on!  ...Feels like it was my fault...  Hercules, do me a favor--before you kill a waitress, go pay the check.  Don't tell Louis nothing about what happened. Far as he knows, my family moved away, [a] long time ago.  I didn't have nothing on me.  Your uncle's got some problems now, though.    It's a little dangerous right now, don't you think?  Muscle--?  A cop got hit today. They ain't never gonna sit still for that.    I need to find Deputy Chief Grusinsky.  Pop, I gotta talk to you.  It's important--I got information.  It's about you.  It's bad.  Yeah...  Pop, Nezhinski's been talkin' about a shipment he's got comin'. Maybe that's how you get to him.    What do you mean, set something up?    Pop?  You could trust her.  But...but you could get killed--   Bobby enters his room, which is dark. Rosario is here, asleep. Her back to Bobby. Upon hearing him enter, she turns and looks at him  in SLOW MOTION...  Bobby sits on the edge of the bed, touches her back. She senses something wrong and speaks, voice ravaged by sleep:   Your mother's real important to you, ain't she. You'd do anything for her.  Go back to sleep...  You been up to see my brother...?  ...How's that been goin'...?  Well I... I been thinking...if you could keep it confidential...? I'd make the connection for you.    They trust me--we could go in large, use my money for the buy, they won't suspect anything--    I know. It's just--I realized... ....my father dies `cause of all this, I couldn't live my life knowing I coulda done something. I know the same is true for you.   I know it is.  So please--can we do this...?  Hey.  It's Bobby Green. I decided--I wanna buy in.  Fifty k, to start.  Sounds good.  Okay.   I'll see you tomorrow.  Most expensive phone call I ever made.  You need to promise me something, though. You won't investigate my girlfriend--she's, she don't know any better.  I'll take care of it.   Bobby enters the bedroom. Presses his answering machine button, and a message begins to play. It is Rosario.   You gonna leave me all alone out there?  You come up with that one all by yourself?  I--I need to talk to you.  I--I'm gonna inform. For the police. I'm gonna help `em set up Nezhinski.  I had to do it, Rosario. These motherfuckers--they were gonna come after my father.  He ain't ever gonna find out.    He ain't ever gonna know.  I don't know... I'd, I'd probably have to go into protection.  But that's never gonna happen!  Rosario, listen--I had to do it.  I had to do it...  Everything's gonna be all right... Don't worry, it'll be all right...  Yeah... Sorry, buddy--I got some legal shit to deal with, from the raid... But I ain't forgot about you--I'll be back soon.  No, it's okay--I'll talk to him later...  Where's Vadim.     You know me.  That's all the money I got.    And I ain't gonna leave it alone.  From my savings. From El Caribe and Rasputin.  Sounds good.  I took a little taste.  I'm clean.  You wanna search me again, you go `head. I just wanna make this deal and go home.  I'm gonna get pussy from this...  [When] this deal goes down, I'm, I'm gonna get a lotta pussy...  PAVEL, this has become the madness of war. Pavel bleeds profusely all over Bobby's chest, and this is a fight to the death.   I'm with you!     I'm with YOU!   I'll be all right, Pop.  I need you to get my girlfriend, Pop. I need her to come with me.  Yeah. They let me come--long as I brought these guys with me.  Good... It's rehabbing good, for only nine weeks. Don't matter, I wasn't no Fred Astaire before.  Anyway, it ain't nothing compared to my brother, so...  Just hold on, `til he gets here.  I'm not sure yet... We been thinking about moving down to Miami. Guy I used to work for, his brother's got a place down there.  A lotta kids here, lotta family... It's nice, ain't it...?  You know how happy I am you're with me?  I'm real glad you're home...  What're you talking about? They got a lot of food over there--why don't you go eat something?    We gotta straighten this out later.  That don't mean nothing.  There's a whole network full of suppliers. The organization goes deep.  I'll be outside if you need me.    Well, why's he goin' back to work so soon, anyway? He ain't ready.   No, come on! I don't want that! What I did, I did for you guys, this once. I got my own plans.    Rosario?    Rosario!   The cops're right outside--let's go. I said, let's go!  Lou--no more of this for her.   It's too fuckin' dangerous now.  Yeah--we'll talk later, buddy--I'll call you. But right now I need to get her outta here.  You gotta put everything in jeopardy? Huh?  You know, I don't think you realize how serious this is?    I know. But I'm workin' on it, I am. Soon as the trial's over and I get my money back outta impound-- everything'll get better, you'll see.  Rosario--once this's done, we'll go down to Miami... [It'll] be a new thing for us--a lotta opportunities... I'll talk to Mr. Buzhayev about working for his brother down there. We'll get your mother to come too-- I'll even talk to Jumbo about it.  C'mon... Let's go back--this'll all be over soon. I promise...  Thank you... You know Mr. Buzhayev, I come to see you today `cause...with everything that's gone on, I don't think it's a good idea for me to stay in New York anymore. I was hoping maybe you could ask your brother if I could work with him, down in Miami. On his restaurant.  I'd appreciate it.  You always been very important to me too. I should probably go now.  Yeah, maybe. Why don't we give `em all these bags to throw out--it's becoming a mess.  What's goin' on?  What--?  Jesus...   What about--  You see something out there?  Pop?   Joe come close this morning?  Yeah, maybe.   But you know the way he is.     Bobby and Rosario are in the back seat. She looks through her pocketbook for some gum, he remains focused on the view through the windshield of his father's car.  Bobby's driver, Vitt, follows Burt down the streets. RAIN is FALLING frighteningly HARD, to the point where the windshield wipers aren't moving fast enough for the water on the windshield. Upsetting. Visibility's terrible.  The cars swing onto the Kosciusko Bridge loop. The traffic is sparse this early morning. We HEAR the THUMPETY-THUMP of the bridge beams and the windshield wipers. And we HEAR the steady, haunting HUM of the bridge surface beneath the wheels of the automobiles. Bobby puts his arm around Rosario, in the back seat. Re the rain:   It's really coming down...  Hey--Vitt--I think somethin's on our right!  Get down!  Right at BOBBY, RIGHT AT US. WE BLINK. Bobby swerves. THE HUBCAP SKIDS OFF the front windshield. Bobby brushes up against the guardrail. We SEE THAT IT is all that protects him from spinning off into the river, two hundred feet below.  Bobby darts from lane to lane, and the THIRD POLICE CAR-- behind the Olds--has SLAMMED on its BRAKES to avoid hitting Bobby's car...  THE OLDS IS RIGHT NEXT TO BURT'S CAR.      BOBBY SEES the barrel of the gun swing to Burt.  ANOTHER BIG PUDDLE--A MUFFLED THUNDERCLAP sound... The water slides away, REVEALING that the back window of Burt's car has shattered.  Bobby is startled at this, his mouth momentarily drooping open. He CAN SEE:  HIS FATHER, FIRING his WEAPON out the window at the OLDS. We HEAR BURT through the RADIO, a STATIC-RAVAGED SIGNAL:   Rosario!   You hurt?  Pop, lay back!  CLOSER...SILENCE... He sees, through the rain: a LONG SHOTGUN BARREL come out of the window from the rear passenger's seat area.  His eyes pop. The OLDS SPEEDS UP.    THE BARREL OF THE SHOTGUN turns:  WATER covers the windshield, BLINDING the driver . The water slides off the glass.   Don't fuckin' look at him! I said don't--back up! Don't look at him...  Does my brother know yet?  Then you gotta take me to him... I wanna go see him...  Joseph?  I don't know if I can do that.   I  I wanna stay close to you from now on, Joe... I wanna stay with you...  You gonna fuckin' catch these guys?  You ain't got nothing, do you.    Course...  No.... I did it to hurt him...   I disappointed him...  I can't live like this no more, Mike... They destroyed my family. There's a deal going down, I... I wanna help...  I, I could join you.  My Pop tol' me you pull guys outta the Academy, guys with special knowledge, [and] make `em cops? You could do that.    I know.  Joe, I'm gonna join you. I just decided... Okay?  This is where I belong...  I wanna talk to you about something.  I'm thinking of...maybe joining the Force.  I mean, I help find Nezhinski, we don't gotta live like this the rest of our lives--moving every three fuckin' days...  What're you talking about? I just got through telling you--  (struggling to stay  Hold on a second--I know what I'm talking about'd be a change. It'd be a big change for us.   Bobby gets up, walks over to the desk. Rubs his fingers on its surface, not looking at her but resolutely:   But we could make a life here. This'd be something we could build on. We could raise a family, and...  Pretty soon you'd fit in.  They'll accept you if we're  Gave it up? Gave up what?  What fuckin' life did you have? You're a fuckin' cokehead--look at you!  Well, maybe I was a piece of shit too! Wasting my goddamned time!  Wake up!   All that was nothing!  My brother's gonna be all right-- and nothing's gonna happen to me.  Hey--where you goin'--  What the fuck you doin'?  All right. Why don't you just calm down and think about it a little.  You think about it, you'll feel different. You'll understand. And in time, we'll look back on all this and you'll see I was right. Look--I love you. Why don't you go get some rest?  Thank you, sir. I'm gonna try and do my part too, now.  \"I, Robert Green, hereby pledge and  \"--that I will support and defend the Constitution, both of the United States government and the State of New York, to the best of my ability...\"  \"...I will faithfully discharge my duties in the rank of rider in the New York City Police Department. So help me God.\"  Thanks.   I'll call her back.  Could you guys go outside for a minute? I wanna talk to my brother.  You're trying to do everything-- it's gonna kill you.  We could handle it. I mean, I come on to help you--  I know. But you don't gotta do everything yourself. That's what I'm trying to tell you.  Joe, what's wrong? Come on, you can tell me. A deal this big, something's gonna come up. You'll see--someone'll fold.  Nah, you didn't do nothing. It's meant to be. You can't fuckin' control it...  Tell her I'm on my way back now. Don't worry.  That's all in the past. I'll see you later.  What happened--where'd she go?!?  We gotta go find her!   Go `head!   Keep me in here--KEEP ME  You gonna keep me here? HUH?!?  It's me, Lou.  I'm okay. Listen uh, you ain't spoke to Rosario lately, have you?  Yeah--it's just, she   must've gone out for a little bit   and...I wanted to get in touch with   her.  Thanks... You know, things are really changing on my end. I ain't gonna be in protection anymore.  ...I, I don't know...  No...  Jumbo, I don't want nothing right now--don't worry about it.  Okay, Eli.   Tell him I'll come up.    Yeah... You know, I was just thinking `bout when I first met her here... Working back there...  Louis--? How'd you know where I was staying?  How'd you know where I was staying?  It wasn't in no papers, Louis. Don't make me embarrass you. Let's go outside, right now.  Where's Nezhinski?  Don't play games with me, Louis.  I just said, DO NOT PLAY GAMES WITH  You don't mean nothing to me now-- that part of my life is dead. Today it ended for good...  You know my father is dead because of you?  You know I'm on the Force now? And I could do anything to you?  You tell me what you know right now or I swear to Christ I will make you disappear.  You tell me, right now-- Where's your fuckin' spot?!?  Well, he said tomorrow and that's what matters.  They got one year of experience, repeated 25 times.  Pop would never bring `em in, Joe. We gotta see this through ourselves...  All right, c'mon. Enough...  We're gonna get all of `em today.  Lookit the two of them...they're so fuckin' close...  You're surrounded by the police! Come out now, with your hands on your heads!  Joe?!  Arright, just stay down!   backing up toward him; each man has his back to the other...    SHADOW ON THE GROUND. He turns, SLOWLY...raises his weapon, about to FIRE when he realizes:  It's MICHAEL SOLO, who, in profile to Bobby is unaware he's almost been killed. He stops when he feels the barrel of Bobby's shotgun against his ribs. SLOWLY TURNING AROUND, he sees BOBBY. WHISPERED:   Vadim is in here with us. Radio our guys, tell `em to get into the clearing.  Are all our guys out?  Burn it.   I'm not gonna let him get away...    CARS. THE POLICE ARE ASSEMBLED     around: MARAT BUZHAYEV. BOBBY WATCHES HIM FOR A MOMENT,    HIS FACE filled with  Get down!   On the ground!  Put him in the fuckin' van... Don't touch him...  Hey everybody...  All right.   We'll talk about that after.  They're getting started--we should probably go in now.    You definitely gonna leave? Ain't no way you change your mind?  Listen, we'll spend some more time together from now on. Okay? I'll come over next week.  Chaplain? I'd like you to introduce me this way. If you don't mind.",
        "Green": "...you're so fuckin' beautiful, you know that...?    What the fuck's goin' on in here?  Yeah--just keep that wide load of yours outta trouble, arright?  What're you doing?!? You gotta behave yourself here!  Well now you're gonna do nothing someplace else! Now listen--one of these days I'm gonna run this whole block, and I see any you in here again--any you-- I'll bust your fuckin' hole! Throw `em out on their ass. I gotta go upstairs, drop off my keys with the old man.  Mr. Buzhayev, how are you!  Listen, Mr. Buzhayev--I gotta go do something right now. But don't worry--everything's in good shape downstairs.  You remember what I tol' you?  Nobody knows about my father and my brother--not even Jumbo. And it's gotta stay that way, you understand?  Nah.   Nah, I'm managing now.  Yeah. I'll see you `round, arright?    That's them there. In the corner. Lookit `em--two peas in a pod.  [My] Father's friends--they were all in Korea together. Biggest bunch of fuckin' stiffs... Look, don't talk to nobody, we'll get out quicker.  N--I just wanna get out quick, that's all...  Yeah I did so...congratulations...  Pop. Everybody, this is my girlfriend. Rosario.  This's my brother. And my father.  I know. I like it this way. That why you got me up here?    [To] tell me my hair's too long?  Whatsamatter?    You ever talk?     You cut me off financially, and now you need the favor? `S interesting.  `S good lookin' boy!  I don't know nothing about that.  The old man?! What, you been watching us?!?    You kidding me? Inform for you?!? That's what you wanted me here for?  Yeah well, find another way. I got a lot invested in that club and I can't let it get fucked up.  [You] Fuckin' broadsided me... Everything's about the goddamned job with you.  C'mon... Get off your fuckin' high horse and bust somebody else's balls.  You're welcome.  'S that supposed to mean?!?  Congratulations. You got me up here.  Good.   Then now you know.  Yeah.   I like the dark meat.    I gotta go, Pop. I'll see you `round.  C'mon, let's get outta here, [we'll] go party with Jumbo.    You're just like her, baby...  That's cool.  It's all right--they don't like nobody outside their own little world.  My brother and my father ain't like that. It's just--the whole thing ain't for me, that's all.  You know how gorgeous you are?  What is it?  ...it's beautiful...  ...you're so good to me...  Only if you behave yourself...  Uh oh--[The] party's really gonna get started now!  Any Spanish Fly in there for you?  I'm goin' up to see Buzhayev tonight. I think he's gonna ask me to buy into the club.  I'll show you a fuckin' faggot!  Everybody, I gotta be at El Caribe in an hour, so get ready!  No no, I'm all right... Hi everybody...  Everything's really rockin' tonight. Line's halfway `round the block.  You wanted to talk to me?  'S a good move.  I appreciate that. You know, I been thinking `bout it--I'd like to become a partner here too--buy in with you. I mean, I got a lot of ideas.  Well, I just think we could do more. Maybe expand into Sheepshead Bay. I know a good spot--we add a restaurant there, get the spill- over. Like what your brother did, in Miami.  I can understand that. But I got money to invest--we could make it something real special over there. Do what I did downstairs--you know, bring in name DJs on different nights? What do you think?  Yeah, sure.   I'll come.  Nah nah, no thank you...  Listen--I get this done, I want you to be a host. In one of our spots.  Well, just make sure you get your old co-workers from the Health Department to give us a pass on the kitchen.  Where's Rosario?  Goddamnit... [She's] With that fuckin' animal again.  Look at him... I'll tell you, [when] this is my place, we'll kick his fuckin' ass right outta here--  Yeah, you know a lot.  You sure it wasn't your dick?  Shit... I'll be right back.    He don't look like a middleweight no more.  Your uncle's a great man. Smart man.  Your uncle loses his license, he ain't gonna be too happy.  Yeah...I'll think about that. Rosario--I wanna talk to you.  You gotta stop dealing. You hear what I'm telling you?  You hear what I said?  Just hold off then, for a little while. Okay? I got my reasons.  Gimme your shit!  Thanks a lot.    I appreciate it.  Okay, I'll go thank him too then. He comes in, raids the fuckin' place--now I gotta go beg `em not to fire me--  Fuck you, Pop.    Fuck the both of you's.  You fuckin' touch me!? You gonna fuckin' touch me?!?  Mr. Buzhayev... I'm real sorry about what happened the other night. [If] I was working, maybe I would've been able to do something, but... Anyway, I'm sorry.  You don't mind my saying, I think that's probably the right thing to do. Things get back to normal, I'm hoping we could get started on what we talked about.  Mr. Buzhayev, my getting arrested ain't gonna be a problem. I don't got a record--  Yeah...   All right...  You had to hit that spot.  I had plans down there.  You got real balls saying that to me. I made something for myself, and you come in and fuck it up? Just `cause I'm not trying to be like you? And Pop--  What did you call her?  You piece of shit...  Fine with me, you motherfucker!  That ain't nothing.  We'll see you and bump you two C's.  Siegfried and Roy, baby! Two fucking queens!  Who is it?  Hello?  Is--is he gonna be all right?  My brother was shot...they're operating on him now.  Game's over, everybody.  That's right.    I gotta go.  What're you doing?  No--it's gonna be a fuckin' scene. I'll call you later.  Don't argue.  Louis, lock up and take her home.  Yeah, no--I just remembered I gotta do something, that's all--  Pop?  Pop, he all right?    You guys blaming me for this? Is that it?  That's bullshit--she's clean.      You fuckin' keep away from her.  Yeah.   That's me.  Look--I'm his brother, you fuckin' hard-on!  ...Feels like it was my fault...  Hercules, do me a favor--before you kill a waitress, go pay the check.  Don't tell Louis nothing about what happened. Far as he knows, my family moved away, [a] long time ago.  I didn't have nothing on me.  Your uncle's got some problems now, though.    It's a little dangerous right now, don't you think?  Muscle--?  A cop got hit today. They ain't never gonna sit still for that.    I need to find Deputy Chief Grusinsky.  Pop, I gotta talk to you.  It's important--I got information.  It's about you.  It's bad.  Yeah...  Pop, Nezhinski's been talkin' about a shipment he's got comin'. Maybe that's how you get to him.    What do you mean, set something up?  Pop?  You could trust her.  But...but you could get killed--  Your mother's real important to you, ain't she. You'd do anything for her.  Go back to sleep...  You been up to see my brother...?  ...How's that been goin'...?  Well I... I been thinking...if you could keep it confidential...? I'd make the connection for you.  They trust me--we could go in large, use my money for the buy, they won't suspect anything--    I know. It's just--I realized... ....my father dies `cause of all this, I couldn't live my life knowing I coulda done something. I know the same is true for you.   I know it is.  So please--can we do this...?  Hey.  It's Bobby Green. I decided--I wanna buy in.  Fifty k, to start.  Sounds good.  Okay.   I'll see you tomorrow.  Most expensive phone call I ever made.  You need to promise me something, though. You won't investigate my girlfriend--she's, she don't know any better.  I'll take care of it.  You gonna leave me all alone out there?  You come up with that one all by yourself?  I--I need to talk to you.  I--I'm gonna inform. For the police. I'm gonna help `em set up Nezhinski.  I had to do it, Rosario. These motherfuckers--they were gonna come after my father.  He ain't ever gonna find out.    He ain't ever gonna know.  I don't know... I'd, I'd probably have to go into protection.  But that's never gonna happen!  Rosario, listen--I had to do it.  I had to do it...  Everything's gonna be all right... Don't worry, it'll be all right...  Yeah... Sorry, buddy--I got some legal shit to deal with, from the raid... But I ain't forgot about you--I'll be back soon.  No, it's okay--I'll talk to him later...  Where's Vadim.     You know me.  That's all the money I got.    And I ain't gonna leave it alone.  From my savings. From El Caribe and Rasputin.  Sounds good.  I took a little taste.  I'm clean.  You wanna search me again, you go `head. I just wanna make this deal and go home.  I'm gonna get pussy from this...  [When] this deal goes down, I'm, I'm gonna get a lotta pussy...  I'm with you!     I'm with YOU!  I'll be all right, Pop.  I need you to get my girlfriend, Pop. I need her to come with me.  Yeah. They let me come--long as I brought these guys with me.  Good... It's rehabbing good, for only nine weeks. Don't matter, I wasn't no Fred Astaire before.  Anyway, it ain't nothing compared to my brother, so...  Just hold on, `til he gets here.  I'm not sure yet... We been thinking about moving down to Miami. Guy I used to work for, his brother's got a place down there.  A lotta kids here, lotta family... It's nice, ain't it...?  You know how happy I am you're with me?  I'm real glad you're home...  What're you talking about? They got a lot of food over there--why don't you go eat something?    We gotta straighten this out later.  That don't mean nothing.  There's a whole network full of suppliers. The organization goes deep.  I'll be outside if you need me.  Well, why's he goin' back to work so soon, anyway? He ain't ready.   No, come on! I don't want that! What I did, I did for you guys, this once. I got my own plans.    Rosario?    Rosario!   The cops're right outside--let's go. I said, let's go!  Lou--no more of this for her.   It's too fuckin' dangerous now.  Yeah--we'll talk later, buddy--I'll call you. But right now I need to get her outta here.  You gotta put everything in jeopardy? Huh?  You know, I don't think you realize how serious this is?    I know. But I'm workin' on it, I am. Soon as the trial's over and I get my money back outta impound-- everything'll get better, you'll see.  Rosario--once this's done, we'll go down to Miami... [It'll] be a new thing for us--a lotta opportunities... I'll talk to Mr. Buzhayev about working for his brother down there. We'll get your mother to come too-- I'll even talk to Jumbo about it.  C'mon... Let's go back--this'll all be over soon. I promise...  Thank you... You know Mr. Buzhayev, I come to see you today `cause...with everything that's gone on, I don't think it's a good idea for me to stay in New York anymore. I was hoping maybe you could ask your brother if I could work with him, down in Miami. On his restaurant.  I'd appreciate it.  You always been very important to me too. I should probably go now.  Yeah, maybe. Why don't we give `em all these bags to throw out--it's becoming a mess.  What's goin' on?  What--?  Jesus...   What about--  You see something out there?  Pop?   Joe come close this morning?  Yeah, maybe.   But you know the way he is.    It's really coming down...  Hey--Vitt--I think somethin's on our right!  Get down!  Rosario!   You hurt?  Pop, lay back!  Don't fuckin' look at him! I said don't--back up! Don't look at him...  Does my brother know yet?  Then you gotta take me to him... I wanna go see him...  Joseph?  I don't know if I can do that.   I  I wanna stay close to you from now on, Joe... I wanna stay with you...  You gonna fuckin' catch these guys?  You ain't got nothing, do you.    Course...  No.... I did it to hurt him...   I disappointed him...  I can't live like this no more, Mike... They destroyed my family. There's a deal going down, I... I wanna help...  I, I could join you.  My Pop tol' me you pull guys outta the Academy, guys with special knowledge, [and] make `em cops? You could do that.    I know.  Joe, I'm gonna join you. I just decided... Okay?  This is where I belong...  I wanna talk to you about something.  I'm thinking of...maybe joining the Force.  I mean, I help find Nezhinski, we don't gotta live like this the rest of our lives--moving every three fuckin' days...  What're you talking about? I just got through telling you--  (struggling to stay  Hold on a second--I know what I'm talking about'd be a change. It'd be a big change for us.  But we could make a life here. This'd be something we could build on. We could raise a family, and...  Pretty soon you'd fit in.  They'll accept you if we're  Gave it up? Gave up what?  What fuckin' life did you have? You're a fuckin' cokehead--look at you!  Well, maybe I was a piece of shit too! Wasting my goddamned time!  Wake up!   All that was nothing!  My brother's gonna be all right-- and nothing's gonna happen to me.  Hey--where you goin'--  What the fuck you doin'?  All right. Why don't you just calm down and think about it a little.  You think about it, you'll feel different. You'll understand. And in time, we'll look back on all this and you'll see I was right. Look--I love you. Why don't you go get some rest?  Thank you, sir. I'm gonna try and do my part too, now.  \"I, Robert Green, hereby pledge and  \"--that I will support and defend the Constitution, both of the United States government and the State of New York, to the best of my ability...\"  \"...I will faithfully discharge my duties in the rank of rider in the New York City Police Department. So help me God.\"  Thanks.   I'll call her back.  Could you guys go outside for a minute? I wanna talk to my brother.  You're trying to do everything-- it's gonna kill you.  We could handle it. I mean, I come on to help you--  I know. But you don't gotta do everything yourself. That's what I'm trying to tell you.  Joe, what's wrong? Come on, you can tell me. A deal this big, something's gonna come up. You'll see--someone'll fold.  Nah, you didn't do nothing. It's meant to be. You can't fuckin' control it...  Tell her I'm on my way back now. Don't worry.  That's all in the past. I'll see you later.  What happened--where'd she go?!?  We gotta go find her!   Go `head!   Keep me in here--KEEP ME  You gonna keep me here? HUH?!?  It's me, Lou.  I'm okay. Listen uh, you ain't spoke to Rosario lately, have you?  Yeah--it's just, she   must've gone out for a little bit   and...I wanted to get in touch with   her.  Thanks... You know, things are really changing on my end. I ain't gonna be in protection anymore.  ...I, I don't know...  No...  Jumbo, I don't want nothing right now--don't worry about it.  Okay, Eli.   Tell him I'll come up.    Yeah... You know, I was just thinking `bout when I first met her here... Working back there...  Louis--? How'd you know where I was staying?  How'd you know where I was staying?  It wasn't in no papers, Louis. Don't make me embarrass you. Let's go outside, right now.  Where's Nezhinski?  Don't play games with me, Louis.  I just said, DO NOT PLAY GAMES WITH  You don't mean nothing to me now-- that part of my life is dead. Today it ended for good...  You know my father is dead because of you?  You know I'm on the Force now? And I could do anything to you?  You tell me what you know right now or I swear to Christ I will make you disappear.  You tell me, right now-- Where's your fuckin' spot?!?  Well, he said tomorrow and that's what matters.  They got one year of experience, repeated 25 times.  Pop would never bring `em in, Joe. We gotta see this through ourselves...  All right, c'mon. Enough...  We're gonna get all of `em today.  Lookit the two of them...they're so fuckin' close...  You're surrounded by the police! Come out now, with your hands on your heads!  Joe?!  Arright, just stay down!  Vadim is in here with us. Radio our guys, tell `em to get into the clearing.  Are all our guys out?  Burn it.  I'm not gonna let him get away...  Get down!   On the ground!  Put him in the fuckin' van... Don't touch him...  Hey everybody...  All right.   We'll talk about that after.  They're getting started--we should probably go in now.    You definitely gonna leave? Ain't no way you change your mind?  Listen, we'll spend some more time together from now on. Okay? I'll come over next week.  Chaplain? I'd like you to introduce me this way. If you don't mind.",
        "Sandra": "It's okay.  He's alone. Your father just left for the precinct.  Everyone, let's, let's move inside-- there's plenty to eat!",
        "Michael": "In a house of God, no less? C'mon, get up...  Hello, Bobby. Nice suit you got on.  Bobby, it's important. These ain't dumb guys we're talking about. We don't stop `em up front, coupla years from now, it'll be chaos out there. We'd be wishing the Italians'd come back.  The spot's got one main entrance, two rear fire exits. All of `em'll be covered.  What if he is?    We still go?  What's it gonna be?  You got anything in there?  Coupla dimes on `em--cocaine, a little PCP.  I don't know, Joe--forgive me, but uh, your brother... Ever since your mother got sick--  Bobby, it's Michael Solo--I got some bad news. Your brother's been shot. He's at St. John's--they're workin' on him now. I just thought you should know.  Listen, your father's coming--I gotta go. But he's at St. John's.  The shot went in his cheek and come out through the jaw. It missed his brain, thank God.  He was real lucky--considering.  Bobby--that ain't a good idea. I probably should've told you not to come down here--there're a lotta things going on right now.  Listen, I ain't judging you--I called you `cause I thought you had a right to know. But we're gonna be going hard after Nezhinski--and maybe some other people you're close to. Like that girl you know--  Jesus Christ, you gotta be kidding me!  Nezhinski got a hit list? On us?!?  We gotta go bust `em, Burt--right now.  That could take us forever!  What about callin' in the Feds? They got a lot more juice than we  How you know about that, Bobby?  Well, maybe that's it, then. If we can get him-- To set something up, maybe one of our uncles could move in--  You'd go set up a buy with `em, just like they've been asking you to. We follow you to the spot, bust `em a week later. That way, your name's clean, nobody knows you're involved--  Yeah. Your father's still with him- -we were just gonna go back to the PSA. Try and figure out a tac plan on Nezhinski.  We don't got much yet, but we'll do our best. You all right?   It's too dangerous--you heard your father.  If anything went wrong, he'd never forgive us.    We'll get it back for you.  Now listen: from now on, you'll get all your information through this, at an undisclosed location. Your contact with us is over after you leave here.  Just be smart about things. Okay? You get burnt and we gotta put you in protection, it's still better than winding up dead. An informant dies, they talk about you for a day. A week later, ain't no one remembers your name. Moral of the story is, don't die. You understand?  She won't be a target. Just make sure she don't open her mouth.  You know we known you your whole life, kid? Good luck.  Hands on your heads! On the floor!  I guess we do.  Nezhinski's cache was huge, about 40 keys--yayo, some angel dust too.  I'll tell you, though--streets're dead. Junkies're waitin' out there for something big, no question.       You and your brother don't gotta worry about any of that. Just take the time you need--  You're a civilian, Bobby. Ain't no way.  Bobby, come on--you got your own life to live--  Then you gotta understand--this ain't something you do just for a vendetta. You gotta go back to the Academy when you're done, you gotta commit yourself.  Gimme a couple days--I'll talk to the P.C.  ...But we got our guys   out there, working the street all   over? I mean, they coupeing or   they working?  Well, you tell Narcotics Queens we got an A-1 sale hanging over our head and either they help us or we fuckin' take it out on `em later!  Joe--this is still new territory for all of us. I mean, we hadda use your brother here to get any results to begin with.  They're movin' serious weight, we might be talkin' major league firepower. Maybe we call in the Feds.  Each one of `em's got 25 years on the job with this kinda thing, Pudge.  Arright, guys.    That's it for now.  Okay--when they complete the sale, that's when we move. ESU'll grab the kids.  This's too dangerous. We'll all wind up killing each other--  Bobby?   What're you doin'--  I just saw the commissioner. A lotta people're gonna wanna talk to you--important people. About maybe settin' you up with your own unit.",
        "Solo": "In a house of God, no less? C'mon, get up...  Hello, Bobby. Nice suit you got on.  Bobby, it's important. These ain't dumb guys we're talking about. We don't stop `em up front, coupla years from now, it'll be chaos out there. We'd be wishing the Italians'd come back.  The spot's got one main entrance, two rear fire exits. All of `em'll be covered.  What if he is?    We still go?  What's it gonna be?  You got anything in there?  Coupla dimes on `em--cocaine, a little PCP.  I don't know, Joe--forgive me, but uh, your brother... Ever since your mother got sick--  Bobby, it's Michael Solo--I got some bad news. Your brother's been shot. He's at St. John's--they're workin' on him now. I just thought you should know.  Listen, your father's coming--I gotta go. But he's at St. John's.  The shot went in his cheek and come out through the jaw. It missed his brain, thank God.  He was real lucky--considering.  Bobby--that ain't a good idea. I probably should've told you not to come down here--there're a lotta things going on right now.  Listen, I ain't judging you--I called you `cause I thought you had a right to know. But we're gonna be going hard after Nezhinski--and maybe some other people you're close to. Like that girl you know--  Jesus Christ, you gotta be kidding me!  Nezhinski got a hit list? On us?!?  We gotta go bust `em, Burt--right now.  That could take us forever!  What about callin' in the Feds? They got a lot more juice than we  How you know about that, Bobby?  Well, maybe that's it, then. If we can get him-- To set something up, maybe one of our uncles could move in--  You'd go set up a buy with `em, just like they've been asking you to. We follow you to the spot, bust `em a week later. That way, your name's clean, nobody knows you're involved--  Yeah. Your father's still with him- -we were just gonna go back to the PSA. Try and figure out a tac plan on Nezhinski.  We don't got much yet, but we'll do our best. You all right?   It's too dangerous--you heard your father.  If anything went wrong, he'd never forgive us.  We'll get it back for you.  Now listen: from now on, you'll get all your information through this, at an undisclosed location. Your contact with us is over after you leave here.  Just be smart about things. Okay? You get burnt and we gotta put you in protection, it's still better than winding up dead. An informant dies, they talk about you for a day. A week later, ain't no one remembers your name. Moral of the story is, don't die. You understand?  She won't be a target. Just make sure she don't open her mouth.  You know we known you your whole life, kid? Good luck.  Hands on your heads! On the floor!  I guess we do.  Nezhinski's cache was huge, about 40 keys--yayo, some angel dust too.  I'll tell you, though--streets're dead. Junkies're waitin' out there for something big, no question.       You and your brother don't gotta worry about any of that. Just take the time you need--  You're a civilian, Bobby. Ain't no way.  Bobby, come on--you got your own life to live--  Then you gotta understand--this ain't something you do just for a vendetta. You gotta go back to the Academy when you're done, you gotta commit yourself.  Gimme a couple days--I'll talk to the P.C.  ...But we got our guys   out there, working the street all   over? I mean, they coupeing or   they working?  Well, you tell Narcotics Queens we got an A-1 sale hanging over our head and either they help us or we fuckin' take it out on `em later!  Joe--this is still new territory for all of us. I mean, we hadda use your brother here to get any results to begin with.  They're movin' serious weight, we might be talkin' major league firepower. Maybe we call in the Feds.  Each one of `em's got 25 years on the job with this kinda thing, Pudge.  Arright, guys.    That's it for now.  Okay--when they complete the sale, that's when we move. ESU'll grab the kids.  This's too dangerous. We'll all wind up killing each other--  Bobby?   What're you doin'--  I just saw the commissioner. A lotta people're gonna wanna talk to you--important people. About maybe settin' you up with your own unit.",
        "Amada": "",
        "Juarez": "",
        "Spiro": "Everyone?   Everyone!  I'm Deputy Commissioner Spiro  You know, we look around in these troubled times, and in moments like this we need leaders, men and women who can bring order back to our great communities. We're here this holiday season to give thanks for one of these men, our Russian brother, Joseph Grusinsky.  ...Joseph, many of us've known your father, Deputy Chief Burt Grusinsky, for many years, and I know he wants to say a little something. Chief?  Bobby, hi! Spiro Giavannis, Deputy Commissioner. Glad to see you made it out here today!  How's the leg treating you?  You got any idea what you're gonna be doing after the trial?  Gee, that's great. Well listen, you need any help, you give us a call. `Cause we can be part of your family too.   As he looks into the CAMERA. We can't yet TELL where we are. He continues, backing up from us slowly, leading us somewhere not yet in focus:   The Commissioner is here now, and he's ready to go.",
        "Giavannis": "Everyone?   Everyone!  I'm Deputy Commissioner Spiro   APPLAUSE.    Bobby, Rosario move to the exit.   SIMULTANEOUS:   You know, we look around in these troubled times, and in moments like this we need leaders, men and women who can bring order back to our great communities. We're here this holiday season to give thanks for one of these men, our Russian brother, Joseph Grusinsky.  ...Joseph, many of us've known your father, Deputy Chief Burt Grusinsky, for many years, and I know he wants to say a little something. Chief?  Bobby, hi! Spiro Giavannis, Deputy Commissioner. Glad to see you made it out here today!  How's the leg treating you?  You got any idea what you're gonna be doing after the trial?  Gee, that's great. Well listen, you need any help, you give us a call. `Cause we can be part of your family too.   As he looks into the CAMERA. We can't yet TELL where we are. He continues, backing up from us slowly, leading us somewhere not yet in focus:   The Commissioner is here now, and he's ready to go.",
        "Kalina": "So beautiful!   Beautiful!    Bobby! Our daughter and her husband Eli come by for dinner. You want something, some tea?    Food is ready!",
        "Buzhayev": "An ornate, gaudy place. The walls are covered by mirrors with that cheesy brown marble pattern print all over them. Plush couches, clutter. Bobby walks in.  We HEAR RADIO MUSIC up here, nothing like the stuff played downstairs. A RUSSIAN CROONER. In an EASY CHAIR sits MARAT BUZHAYEV . He is old, kindly, weakened by age; sits next to his babushka wife, KALINA. Buzhayev watches a Russian musical program with the sound off, listening to his small transistor radio.   Bobby!   Come here!  So beautiful!   Beautiful!    Next week, you come by--we talk. Okay? We talk about plans for you.    Bobby! Our daughter and her husband Eli come by for dinner. You want something, some tea?  Yes, it's good...  You know, maybe we open another spot next year. Across from Brighton.  We need someone in charge here full- time, then. And we think you do a great job.    My son-in-law, he worries people take advantage of me.  Yes. Together we do it. You come to our Thanksgiving again, on Thursday?  Good--we talk more, at the dinner.  Give him, for tonight!  No no--it's okay. Say hello...  Now--we go this week to the field, okay? To ride the horses? Go to Mama.  It's not your fault...  You can't always control everyone in your family... My nephew, he don't come back to the club anymore.    I know.   I don't worry about any of that.  I used to teach chemistry before I come over here, and now I have the fur store, and this. One thing I learned here, you can always start over. So don't worry--someday, we do it. Okay? Someday.  Food is ready!  You take some time off, everything will be fixed in a little bit. Then you come back. I pay you for the time. Come on...   We SEE Bobby's ARMED GUARDS waiting on the steps.    TILT UP TO the closed door. Over this, we HEAR:   We heard all about you in the news. We were all very sorry about your brother.   Bobby and Marat Buzhayev, inside the living room.   Bobby sits down, on the couch's armrest; Marat is in an easy chair, his lunch being served on a T.V. tray in front of him by his wife Kalina. The television plays a Russian movie, and Marat seasons his food.   I could talk to him. I think he would like you very much.  We're going to be very sad if you're going. Having you here in this house meant a lot to us. You know, my wife and me, we have only daughters.  Bobby--you'll always be welcome back here.  Good evening. My name is Marat Buzhayev, and I'm the owner of the El Caribe. We have a special night, tonight--the Odessa Dance Troop is here to perform for us. I know you'll enjoy it.  We also have an old friend who's come back to us--I want him to stand--Bobby? Ladies and gentlemen, Bobby Green, who used to be our manager here...  This's what we've been planning for for so long. My nephew has stayed just to see this through.  When this is done, we'll control almost the whole market. Each load is completely untraceable. It's my own method.  Bobby--I, I didn't know it would be your family--",
        "Marat": "An ornate, gaudy place. The walls are covered by mirrors with that cheesy brown marble pattern print all over them. Plush couches, clutter. Bobby walks in.  We HEAR RADIO MUSIC up here, nothing like the stuff played downstairs. A RUSSIAN CROONER. In an EASY CHAIR sits MARAT BUZHAYEV . He is old, kindly, weakened by age; sits next to his babushka wife, KALINA. Buzhayev watches a Russian musical program with the sound off, listening to his small transistor radio.   Bobby!   Come here!    Next week, you come by--we talk. Okay? We talk about plans for you.   Opening the door is Kalina, who embraces him.   In Russian:   Yes, it's good...  You know, maybe we open another spot next year. Across from Brighton.  We need someone in charge here full- time, then. And we think you do a great job.  My son-in-law, he worries people take advantage of me.  Yes. Together we do it. You come to our Thanksgiving again, on Thursday?  Good--we talk more, at the dinner.  Give him, for tonight!   BOBBY ENTERS. Packed with people. A family get-together for Thanksgiving. Children abound, a PARTY atmosphere. BOBBY is in the FOYER, holding a cake he's brought.   No no--it's okay. Say hello...  Now--we go this week to the field, okay? To ride the horses? Go to Mama.  It's not your fault...  You can't always control everyone in your family... My nephew, he don't come back to the club anymore.    I know.   I don't worry about any of that.  I used to teach chemistry before I come over here, and now I have the fur store, and this. One thing I learned here, you can always start over. So don't worry--someday, we do it. Okay? Someday.  You take some time off, everything will be fixed in a little bit. Then you come back. I pay you for the time. Come on...   We SEE Bobby's ARMED GUARDS waiting on the steps.    TILT UP TO the closed door. Over this, we HEAR:   We heard all about you in the news. We were all very sorry about your brother.   Bobby and Marat Buzhayev, inside the living room.   Bobby sits down, on the couch's armrest; Marat is in an easy chair, his lunch being served on a T.V. tray in front of him by his wife Kalina. The television plays a Russian movie, and Marat seasons his food.   I could talk to him. I think he would like you very much.  We're going to be very sad if you're going. Having you here in this house meant a lot to us. You know, my wife and me, we have only daughters.  Bobby--you'll always be welcome back here.  Good evening. My name is Marat Buzhayev, and I'm the owner of the El Caribe. We have a special night, tonight--the Odessa Dance Troop is here to perform for us. I know you'll enjoy it.  We also have an old friend who's come back to us--I want him to stand--Bobby? Ladies and gentlemen, Bobby Green, who used to be our manager here...  This's what we've been planning for for so long. My nephew has stayed just to see this through.  When this is done, we'll control almost the whole market. Each load is completely untraceable. It's my own method.  Bobby--I, I didn't know it would be your family--",
        "Pavel": "This's \"Kid Quick\" you're talking to, dude. Best fuckin' middleweight in the Ukraine.  Police are a fuckin' joke, dude-- the Mickey Mouse ain't gonna do nothing.  How much we talkin' `bout here, dude?  Oh, [the] man's gonna be good with that. How `bout tomorrow night?  Arright. We'll meet at El Caribe, `round midnight? That way, you could dance a little, say hi to your girlfriend...  Oh, he don't come in here no more--  Be on the boardwalk in a hour...  And dude--this don't shake out...  Dude!    Hey, dude!  Get in!  Put your hands out, where I could see `em.  Shut your fuckin' mouth and do it!  Turn at the light...  Go left.    Again.  Let's go.   No one's on us.    BOBBY, a TERRIFYING LOOK ON HIS FACE. But Bobby is ready, and SHOVES THE LETTER OPENER INTO PAVEL'S NECK. BLOOD CASCADES DOWN THE MAN'S CHEST. Pavel collapses on Bobby, still very much alive. His eyes are popping, and he throws his hands around Bobby's THROAT. VADIM CHARGES INTO:",
        "Lubyarsky": "This's \"Kid Quick\" you're talking to, dude. Best fuckin' middleweight in the Ukraine.  Police are a fuckin' joke, dude-- the Mickey Mouse ain't gonna do nothing.  How much we talkin' `bout here, dude?  Oh, [the] man's gonna be good with that. How `bout tomorrow night?  Arright. We'll meet at El Caribe, `round midnight? That way, you could dance a little, say hi to your girlfriend...  Oh, he don't come in here no more--  Be on the boardwalk in a hour...  And dude--this don't shake out...  Dude!    Hey, dude!  Get in!  Put your hands out, where I could see `em.  Shut your fuckin' mouth and do it!  Turn at the light...  Go left.    Again.  Let's go.   No one's on us."
    },
    "imdb_rating": "6.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTY0MTQ5OTcyNF5BMl5BanBnXkFtZTcwMDE0NzUzMw@@._V1_QL75_UX380_CR0,15,380,562_.jpg",
    "description": "Brooklyn, 1988. Crime is rife, especially drugs and drug violence. A Russian thug is building his heroin trade, while everyone laughs at the cops. Brothers have chosen different paths: Joe has followed his father Bert into New York's Finest; he's a rising star. Bobby, who uses his mother's maiden name, manages a club. Bobby too is on the rise: he has a new girlfriend and a green-light to develop a Manhattan club. Joe and Bert ask him to help with intelligence gathering; he declines. Then, Joe raids Bobby's club to arrest the Russian. From there, things spiral out of control: the Russian puts out a hit on Joe, personal losses mount, and Bobby's loyalties face the test.<jhailey@hotmail.com>",
    "name": "We Own the Night",
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ]
}