{
    "filename": "Whiteout_script.txt",
    "imdb_id": "tt0365929",
    "imdb_url": "https://www.imdb.com/title/tt0365929",
    "characters": [
        "Robert Pryce",
        "Russell Haden",
        "Dr. John Fury",
        "Russian Guard",
        "Russian Pilot",
        "Sam Murphy",
        "Jack",
        "Rhonda",
        "McGuire",
        "Russian Co-pilot",
        "Carrie Stetko",
        "Delfy",
        "Rubin"
    ],
    "dialogues": {
        "Robert": "",
        "Pryce": "You must be Stetko --  I was heading to ASB to talk to you about Weiss when I was told you had come up here.  FBI notified us. Your base commander called it in.  I thought I might find answers in his gear, but there's nothing here but clothes.  I realize that, but considering the time constraints we're up against, let's be honest, taping and bagging everything isn't going to be an option.  You heading out to Delta One One?  I'll grab my bag.  If they've been digging out there, that's a direct violation of the United Nations treaty. We think they were digging. That makes it my business.  And you don't get killed for them either. This is now a U.N. matter. I am within my rights to commandeer your pilot and plane if I have to.  Fine.  Mind if I ask you a personal question?  Why do you smell like suntan lotion?  We ready?  Two thirty.   Anything?  Their daily work log.  It's ground penetrating radar.  Areas labeled?  At Sections 101 and 102, they spent one day.  103 two days.  104 -- seven days. That was a month ago.  How far?  Let's go see what they found.  Hurt?  How long have you been down here, Marshal?  What brought you to the ice?  Everyone down here is running away from something.  Yeah, and that I should call my mother more often  Every Sunday.  They got me working out of Christchurch, New Zealand. Beautiful country. But this -- crazy place to make a living.  He give you that ring I saw? Tell you he was going to marry you?  Flattered that you even looked.  You sure this is right?   Hold my legs!  Almost got you.  Carrie?    Can you hear me?  Just answers. Those are fuel tanks behind you. This plane was outfitted for long range capabilities.  They put some serious work into this.  This isn't going to work, it's like digging through concrete with a spoon. We're going to suffocate before we get out here.  Three of us down here -- 12, 15 hours at the most.  Fire will burn the O2 quicker.  Hold these.  All these planes used to have bail- out hatches.  Has to be more than one.  Found it!  With the angle of the plane, I don't think we're that far from the surface. Give me a hand.  These are explosive bolts. If we blow the hatch, maybe it'll smash a hole up through the ice.  We can be blown up, suffocate or freeze to death. Take your pick.  This could work -- give me the battery from your phone.  When I connect these two wires, hopefully there's going to be a big bang. May want to take some cover.  You guys ready?  Delfy, help me with this.     We'll need to get up higher.  What's going on?  I've been authorized because of what's happened.  Don't do this.   Listen to me -- Forty eight hours ago, we picked up chatter between someone down here and Tahir Soufian, a black market trader in New York. It was all about setting up a buy for cannisters found in an old Russian transport buried in the ice.  There's been rumors for years that the Russians had a second base -- a secret weapons research facility under the ice that supposedly blew up in the late sixties -- nothing was ever confirmed.  The fact is, before the treaty in `72 they were strip mining all over the place down here -- we believe for uranium and other specialized minerals for weapon's use. It was the Cold War. No one knows half the things the Russian's were up to. This plane could be the link between rumor and truth. And if it is true, what's in those cannisters could be a prelude to another terrorist attack.  Look, the U.N. carries a lot of weight down here. Think about it - - if I had told you I was C.I.A., you would have been on the horn back to Washington in no time. This is a very sensitive matter. News travels fast down here, I don't have to tell you that.  Besides, I didn't know if I could trust you.  Six cannisters, maybe four inches in diameter, about a foot high -- find out exactly what the Russians transported in something that size.  You have a photo of Rubin anywhere?      You need to get that looked at.  Of course.  I stopped by the clinic... Doc told me.  Got Rubin's face all over Antarctica, but nobody's seen him yet.  ...Unfortunately.  No.  What happened?  It's what the Russians used to transport weapons grade materials in. They match the dimensions inside the safe. We're looking for six of these.  Langley's thinking it might be Hexafluoride, which is a derivative of Uranium. It's a component for nuclear detonation.  I better get this back to him. And we have to find Rubin.  Sure.  For what it's worth -- I think you're pretty tough, Marshall.  Yeah?  How long's he been out there?  Wrong answer.  Who's Tahir selling it to -- what's the intended target?  Hit the sonofabitch again!  Name's Pryce.  It's a twelve hour flight to Christchurch. Anything can happen in that time. Keller is here, so we know it's still on the ground.  Once that plane is in the air, we've as good as lost it. Just give us 10 minutes.  It's clean.  You check the cockpit?  I don't get it, why lie to us -- we have him either way. He's stuck here.  He's got nowhere to go, nowhere to hide.   Shift their attention to the plane.    Blades turning. They stalk forward. Slowly. Carefully.      Eyeing for any betrayal of movement.  Then, with a nod from Carrie, they move in. Fast. Ready. Look into the plane. It's empty, except for a duffle bag in the back. Carrie nods to Pryce. Motions for him to go one way, she'll go another.   Carrie eyeballs a Snowcat. It's door is slightly open. She heads for it. Gun poised.  Pryce moves to check the next plane.    Eyes dart to every dark corner.  Carrie gets to the Cat.    Springs toward the door. Inside's empty.   ...I didn't see him.    Hey --  You get him?   The cannisters?  What did we miss? Think Keller cut and run without the stuff?  If he had made it out, he wouldn't have been crazy enough to come back for it.  We've got six months to figure it out.  Hey, Doc -- thanks.  What is it?  How's the weather where you are?  Yeah, St. Barts ain't bad either.  Six months.   Six long months.",
        "Russell": "",
        "Haden": "",
        "Russian": "",
        "Guard": "",
        "Pilot": "",
        "Sam": "The plane soars through a cloudless sky, the sun sparkling brilliantly on the endless ice sheet below.  Carrie's in the copilot's seat, wrapped up tight in her ECW, just trying to stay warm. Delfy's at the controls. Doc's in the back.    Darkness. A flashlight clicks on. Reflects off a wall of ice with a frozen blood trail leading up. Carrie gets to her feet. Sees that she's in a small dug out area.  As she slowly turns to get her bearings, her light falls on an ESCAPE HATCH of some kind, maybe three feet high.  Carrie shines the light to her feet.        The ground beneath her is metal.     A SUBJECTIVE POV - catches interval glimpses of Rubin through the small windows that run along the side of the tunnel as he dashes through.    Rubin is moving through to a door at the far end as Carrie enters. It's lined with several free standing, empty bookcases.    Carrie shoulders the door, but still doesn't budge. Hears FOOTSTEPS BEHIND HER. Turns to see it's Pryce.    Rubin's pace is slowing -- he's exerting himself to get to the people as they climb into snowmobile with the container.   Frostbite is chewing up his lungs. He's too slow, they take off. He coughs up blood.    Carrie passes a gap between storage containers where several snow shovels are stuck into a mound of snow -- through their vertical slats, SHE CATCHES A GLIMPSE OF RUBIN at the Snow Melter across on the other side of the main building. Sees the ECW guy closing in.        Pryce is moving under ASB. Passes a hydraulic support leg. Spots Carrie on the other side moving toward Rubin. Also sees the ECW guy in pursuit. Heads toward them.     Rubin's frostbitten hand reaches for the hose. Grabs it, but he doesn't have the strength to turn it on. Throws a defeated glance over his shoulder to see --  -- THE VILLAIN in ECW gear right on him! Shoves Rubin against the tank. Grabs the hose from him. Turns it on - - SPRAYING him head to toe.  Rubin's clothes turn to ice. One eye freezes shut. Lips go cobalt blue. He tries to escape, but several stiff steps away, he slows and finally stops: a prisoner in his ice-locked clothing.  The man moves to Rubin.   Grabs his head, and - SNAP - breaks his neck.  Rubin's body topples stiffly to the ground.     Rhonda crosses the busy room. Reaches for a clipboard hanging next to the window. Something outside catches her attention.    The Killer turns to leave the crime scene and --  -- WHACK! He's blindsided by a SHOVEL to his head. Goggles shatter.     Employees are trudging up through the back entrance into the plane. Get checked off a list by the LOAD MASTER. Toss their gear into a netted cargo area. Find a seat. Plane is nearly full.     Desperation clings to his face as he turns the plane onto the runway. His wound oozes blood -- eats the pain as he gives it full throttle. Starts to pick up speed. Heads down his strip of freedom.    A funnel of bumpy light spreads across the ice before Carrie on the snowmobile.      Rhonda's standing up front with the pilot and Copilot, watching the horizon where dark storm clouds are coming at them like a tidal wave. Brings a walkie to her lips...   Murphy looks to Doc.",
        "Murphy": "You busy?  I got a pilot at ASB who thinks he spotted a popsicle out on the ice.  Don't know.  McClain Valley.  I've got a plane heading to ASB in an hour with some supplies for Winter-over. Can't get you back until tomorrow.  You leaving the dart board?  What camp was he with?  This is all I need right now.  That's not what I meant. I'll contact the FBI -- see how they want to handle this.  That's not possible. We're still bringing people in and resupplying other bases for Winter-over.  Shit -- we've got to move up the evac.  Six hours at least.  Then get them in!  Where the hell have you been?  Do me a favor, you find any more bodies, mind not parading them down the main corridor. I've got Newbies afraid to winterover, for Chirstsake. They want out on seats I don't have. And next time you want to take a Goddamn plane anywhere, you ask me.  We don't have enough supplies for all of us to Winter-over if we get stuck down here.  And you wonder why it didn't work out between us.  This is ridic---  Have you completely lost your mind?  What the hell's going on?  Who the hell are you?  We don't have time. We'll just search it in Christchurch when it lands.  Do what you have to, but that plane takes off in one hour.  I'll send what I can.  No -- what's going --  In the clinic. About to bring the bodies out. What's --  Doc!  He get away?  I know.    I know.  Can you do this on the plane? It's your call, but I need to know now.    Leave'm.   Let's go.  Take care of yourself.",
        "Jack": "",
        "Rhonda": "I'll have them boomerang back and pick up the load -- just have it ready.  Good, have them check all the pressure levels on the hydraulics, then clear the exterior storage bins. Make sure we're not leaving anything out there.  Sam told me you'd be coming up -- how's the sleigh ride?  I'll have him meet you in the hangar.  Dinkle.   Howard Dinkle.  We're tracking it now.    Sorry, can't.    All the planes are committed.  What am I supposed to tell the deep drill ice core team getting picked up in four and a half?    You expect me to --  Fifteen.  How much?  Jesus, I got crew that's still not in.  Dinkle, it's Rhonda --  Sam!  Sam, it's Rhonda -- we gotta go. Now.",
        "McGuire": "",
        "Carrie": "Alright --   Hey Fred, unlock any secrets of the Universe -- discover we're Alien life forms?  Which one's Sapperstein?  Okay, thanks.  Sapperstein?  Wanted to see me?  All what?  Professor Sapperstein, I'd like you to read something for me.  What's this say?  C'mon, go ahead, read it.  Keep reading.  Very good. Now are you still sure you want to report the theft of an illegal narcotic?  Professor...are you planning on doing the winter-over?  Good. And how are you feeling right now?    What do you think? I know you weren't in the area. What's up?  What flavor?  And we were doing so well. Where?  McClain Valley? What was he doing out there? That's no man's land.  No -- just the picture.  Bottom of the frickin' planet.  Doc?  Keller.  You seen Doc?  Checking the freezer for a popsicle.  It got called in this morning.  Delfy, one of the pilots here.  Yeah -- probably.  ...Were you the second guy from the front?  Not interested.  Fine. I need a plane and that pilot who saw the popsicle.  Yeah, good.  I wish -- We got a job. I need you to take a ride with me.    So it is.  My gut and I don't talk anymore.  I saw your boxes packed up. What was all that BS last month about, \"I'm never going back -- I'll die here. Scatter my ashes over the pole\"?  Not you.  Or mentioned her. A grandchild? Doc, that's great.  You Delfy?  Delfy's taking us, Doc. He's the one who saw the body. C'mon, you'll be fine. I'll even hold your hand if you want.  What were you doing out there?  That your son?  He's cute.   Has your eyes.  So why aren't you with him?  Hate it.  We all make stupid mistakes.  Yeah. Got it.      It's a popsicle alright.  Red jacket.   He's American.  Linger.  So do you. Think his name's Weiss. We Wintered-over last year with him. Played cards a couple of times.  Yeah.    Geologist, I think.  Then where's his crampons -- his gear?  Yeah, maybe --  What's the closest camp?   What the hell where you doing all the way out here?  You going to be alright?  Oh yeah -- I'm really going to miss this place.  Who manages the Post Stations?  One - two - three...  How long to thaw him out?  It bothers me no one's reported him missing yet.  How'd he get out there?    There were no tracks.  Nobody wants to get out of here more than I do, trust me, but right now -- we're all this guy has.   Little by little, it starts to move -- then finally, ZIIIIIIIIIIP. The jacket opens up, barely -- like sliced skin.  Doc watches as she tries to pry it open further, but can't.   Grab that side.  ...I'll be alright.  I know.  Exactly, this is the first murder in Antarctica, Doc -- and I can't just pretend it didn't happen. I'm sorry.  I'm on my way to find out.  I'm sure his family's thinking the same thing.  I hate interrupting educational programming, but --  I need to talk to Dinkle.  Chaplain.  What are they doing out there?  English, please.  I don't get it -- Weiss was no where near Delta One One.  When are they scheduled for evac?  Isn't that a little unusual this close to Winter-over?  -- You've been a little busy. Yeah, I can see that.  What's their frequency?    Delta One One, I repeat, this is United States Marshal Stetko, come in, over.  Stetko.  Vostok? Patch it through.  This is Marshal Stetko, who's this?  Mooney?  What happened out there, Mooney?  Where's Rubin?  Getting drunk already?  Murphy's contacting the Feds.  I'll do everything I can to get you off this ice, promise.  Going to Vostok.  One of the guys from Weiss' team called.   Wants to talk.  I need a plane to Vostok.  I'm not asking.  Tell them I took their plane.  The Russians barely supply Vostok anymore. They have to barter with other bases for supplies. Some of these guys have been rotting here for years.  Who's in charge?  Stetko, US Marshal. I'm here to talk to an American named Mooney.  I figured.  Where is he?  Against the law -- Antarctica's the only place in the world you can't have one. Part of the Treaty.  All this crap on -- I prefer naked.  Do you have to do that in front of me?  Sure.  Nope. Thoughts?    Mooney?  ...My God.  Jack?  Jack!  What happened?  Yeah. Someone got to him before I did. Then went after me. How long was I out?  Thanks.  I need to get back in there.  Let it go, Delfy.  Unless you want your head cracked, I wouldn't move.  -- Let me see your hands.  Now turn around.  Who are you?  Let's see it -- slowly.  How do you know about Weiss?  This is part of a crime scene.  I'll be sure to let the U.N. know if I find out anything.  Maybe.  Don't take this personally, but I don't need your help.  You don't dig for meteorites.  Fine. But this is my investigation, understand? If you obstruct it in any way, I will have you detained.  No, but I have the feeling you're going to anyway.  Murphy, listen to me, it's got to be Rubin who tried to kill me. You have to shut down flights leaving ASB and McMurdo -- search for him.  Sam, I think these guys found something out there at the camp. I'm going to check it out. Until I find Rubin, no one leaves the ice. Not yet.  Guess so.  What time is it?  A.M. or P.M.?  Wonderful.  I'll take this one.  Rubin?  Someone's left leg took a hit, lost a lot of blood. What do you got?  Looks like they were surveying sections at a time.  Yeah --  Looks like they hit some really big meteors.  About four miles.  I want to check something out first.  North.  Yeah, a little.  Almost two years.   The excitement, mostly.  Some shrink tell you that?  And do you?  Where do you plant your boots?  I came down to fill in for a Marshal for six weeks before Winter-over. I met someone, decided to stay.  No -- just gave me a headache.  I didn't see a ring on your finger.  This is it.  Stop.  Just stop.  Section 104.   These are the coordinates.  This is shaved ice.  They were digging, Pryce. And they tries to spread the ice to hide it.  Grab me!  I'm slipping!  I'm losing my grip.  ...I'm okay.  Cargo plane, but I don't recognize it.  Guess that makes three.  Where's Pryce?  What is that?    And by the looks of that safe, must've been transporting something pretty important.  Whoever got hurt, they dragged him out of here. There's blood all over the tunnel.  What is that?  Go!  No signal, you?  Someone followed us.  How long do you figure we've got?  What about the Vodka -- we could make some torches, maybe melt the ice?  What choice do we have?  What're you doing?  We came in through it.  Or, if the ice is too thick the blast will come right back at us.  Don't move.  Our friend here isn't who he says he is.  Didn't you know it's a direct treaty violation to carry a firearm down here?  Stop lying to me --  Delfy, cuff him to the wall.  He was saving his own.   Do it.  You know what was in that safe. Now, who are you?  I swear I'll leave you here to die.  Have you got an ID for that too?  Why did you lie to me?  Plane could've gone anywhere. There's forty-six countries here all counting down to Winter-over. Rubin could just disappear in the mayhem.  Rhonda?  Heading back. How many fly-ins to McMurdo in the last four hours?    I need a list of names.  He knows I'm on his ass, so he might. Anything's possible. I want to eliminate his options.  Back at ASB --  I know why Weiss was so far from Delta One One. He was dumped from a plane.  I'll have the Doc take a peek when we're done.  Murphy?   What the hell is he doing  I'm on 30 if you need me. Rubin's picture is in a file on my desk.  You wanted to see me?  Buried under 2 tons of ice. You?  Sure thing, Chief.  It didn't work, Sam, because you couldn't keep your hands off every new woman who stepped foot on the ice down here. I was stupid enough to be one of them. Now if you could cut through your red tape for just one second, you would realize that someone's out there with six cannisters, possibly full of Uranium, and he wants to get it into the hands of some very bad people. And I'm trying to stop it -- so fuck asking you for shit, Sam.  You know what Doc, it's alright.  You got my list?  You worry too much -- but it's what I like about you.  Doc, did you notice if Weiss had a wound on his left leg?  Then it's gotta be Rubin. I don't know.  There's no way they're gonna make it. Not with that storm coming in over the peninsula.  Oh God.  When did I go to Vostok?  No.     Carrie's bag is open on the bed with the Russian's gun next to it.  She's trying to put on a clean flannel over a T-shirt, but can't button it up with only one hand. Her frustration mounts as she fights back every bit of emotion that's trying to get out.  She finally gives up -- kicks over a nearby chair that sweeps the stuff off her bed. Bag and gun go flying.  Carrie slumps to the floor.    Silent tears.  After a beat -- she notices Pryce standing in the doorway with some PAPERS in his hand. He's looking at her compassionately.   Pretty tough Marshal, huh?  (holds up hand with missing ring  Anything?  ...You ever kill anyone?  Anyone you ever trusted?  I hadn't held a gun in my hand for over two years. Wasn't supposed to need one down here.  You asked what I was running away from...I came down here to forget my partner, Jack. Thought it would be better than any therapy.  We were on a stakeout at a Holiday Inn in Miami, waiting for this buy to go down. I was excited, we'd been after this trafficker for a long time. Thought this bust would be my big chance to impress the brass. Anyway, guy's a no show. One hour went by, then two - - nothing.  Then Jack starting acting strange. Next thing I knew my face was being rammed into a mirror. My own partner was trying to kill me. Turns out the whole bust was a set up from the start. Jack was dirty, working with the guy we were after.  Four years together. I knew things about him that his wife didn't even know.  But he was my partner and I killed him that night. There's no changing that.  Marshall service cleared me -- ruled it self-defense, but I had a real hard time getting over the betrayal -- how little my life meant to a guy I was willing to take a bullet for.  Know what the kicker is -- Jack thought I was close to figuring him out. Thought this hotel room was the best place to get rid of me -- make it look like a bust gone bad. Truth is, I had no idea.  God, I was young and stupid, and in way over my head.  You asked me why I smell like suntan lotion -- Jack wore Aramis, this cheap after-shave his wife gave him. Some of the guys down here wear it -- suntan lotion is the only thing that keeps me from smelling it.  What do ya got there?  These beakers where really in over their heads.  Think you can you help me with these buttons, first?  Who are you?  Mooney's dead.  And so's Weiss.  It's okay, you're safe, just put the knife down.  Who's after you? Where are the cannisters?  Rubin -- I need you to focus for me.  It's okay, he's a doctor, he can help you.  You alright?  Pryce --  Rubin's here! He's on the run. Level one. White T-shirt. Jeans.    Rubin, wait!  Rubin -- I can help you!  Door's jammed --  Pryce, it's not Rubin --  Someone's trying to kill him.  Shit, Rubin doesn't have any gear on.  Thirty seconds.  Where are the cannisters?  Help me drag him over here.  Keep him still.  Why did you kill those scientists, Keller? Was a four-way split too much for you?  Where is the uranium?  Let go of me.  Where in the plane?  The cannisters are on the plane.  Throw him in the holding cell.  He's with the UN. We have to search that plane now!  Sam, do what is right here.    Come on.  We'll need some help.  Nothing. That bastard. What the hell are you up to, Keller?  He's buying time.  Out of the way!  Shit!  He won't try.    He's a goddamn pilot.   Shift their attention to the plane.    Blades turning. They stalk forward. Slowly. Carefully.      Eyeing for any betrayal of movement.  Then, with a nod from Carrie, they move in. Fast. Ready. Look into the plane. It's empty, except for a duffle bag in the back. Carrie nods to Pryce. Motions for him to go one way, she'll go another.   Carrie eyeballs a Snowcat. It's door is slightly open. She heads for it. Gun poised.  Pryce moves to check the next plane.    Eyes dart to every dark corner.  Carrie gets to the Cat.    Springs toward the door. Inside's empty.   No!    You stay awake!  Damn it! Come on. We're getting him up.  Press here.    Hard. Hard or he will die!  He's not going to be number four!  You're bleeding out. Freezing drops your pulse. We have to slow it down. You hold on.  Sam -- is Doc on the plane yet?  Keller got out. He hurt Pryce -- he's bleeding bad. Where's Doc?  Tell him to stay put, and I need your help getting Pryce there. We're at the hangar. I've got to stop Keller, he's got the cannisters.  Don't let him die.   Cripples the plane, pitching it sideways. A wing catches the runway, CATAPULTING the entire plane into a cartwheel of disaster as it veers off the runway and --   Keller hit him with an ice axe.  No.  I'll stay with you --  I'm sorry.  Thanks.  Hey back.  Um-hm.  Nope.  After all this, no way. Keller didn't have it on the plane because he's got it hidden somewhere. Where would he hide something for six months. Somewhere he could be sure no one would ever look.  True -- what the hell was his plan...  Need any help?    Nothing -- I'll be right back.   Someplace no one would ever think to look.  And we thought it was nukes the whole time.  How did you get wrapped up in thing, Doc?  Then Weiss got cold feet. It got ugly, didn't it -- and Keller killed him at Delta One One. Everything went to hell after that, didn't it, Doc.  Doc -- stop.  There is no granddaughter, is there? This was about greed, plain and simple.  Dead is dead, right?  What's happened to you? There are four people dead! Four! People we knew.  Where you going to stuff my body too? Huh? Was I going to be five?  I won't go through it again. Don't make me shoot you, please.  Doc, your not thinking straight.  Doc, please.   The sounds of lapping surf and distant seagulls serenades us like a rhythmic lullaby as we --  CU on sand with a shadow of a palm tree casting over top of two pairs of feet -- intertwined.  Slowly widen -- to see Carrie and Pryce, kicking back on lawn chairs, side-by-side. Two heat lamps pouring out bright, warm light. A cut out piece of paper in the shape of a palm leaf is taped to one of the lamps -- throwing the shadow.  Pryce has a small bandage over his shoulder.    Hot. But there's a gentle breeze. Fiji's beautiful this time of year.  Nah. Freedom's just a sunrise away.",
        "Stetko": "",
        "Delfy": "Yes, ma'am.  Brooklyn. And unless your wrinkled ass has a heart attack on my plane, I think we'll be all right.  I went to evac a camp. Had to fly off route to get around a storm. Got down low to avoid some turbulence, and there it was.  Yeah, name's Nathan.  Lucky he got his momma's brain. Kid's smart.  The bonus pay. Trying to buy a house. Give my boy a yard. His own room. Stuff I never had.  Don't like the cold, huh?  Then why are you down here?  It's right up here.  I don't carry extra panties Doc, so keep it tight. There it is.  Three o'clock.  Jesus.  Brits -- about eighty miles west.  No -- this is the kind of stuff that scars you for life.    You don't carry a gun?  Doesn't that make you feel kind of naked?  Gettin' worse. Minus eighty-one. Wind at a hundred and ten knots.  Give you a hand?  Ever been on a rope-line in a whiteout?  Yeah, hold on tight.  Wo wo wo.   It's okay, it's okay.  When   you didn't come back -- we went   looking for you. Found a dead   guy in the other building -- that   Mooney?  A couple hours.  He's been looking after you.  Whoever it was, could have flown out after the storm broke.  Who's Jack?  Until I met you, I hadn't seen any dead people. Now I'm at two.  He can, you know.  Looks like my dad's old lawn mower.  I said \"which way?\"  There's nothing here.  Maybe you wrote them down wrong.    Saw a rope in the Cat.  It's an Antanov-74. Russian made - - late fifties. No one's put these in the air for forty years.  This isn't funny --  Vodka.  It's the Cat!  Sonofabitch!  No way. I'm not going out like this. No way.  And when that one goes -- we're screwed.  Don't need my vote.  It'd be on the ceiling in case of an ocean landing.  Hallelujah --  Yeah -- what're you doing?  Man, the guy just saved our lives...  Damn, I knew that government eavesdropping was true.  Keys are still in it!  You think Rubin might try to leave out of McMurdo?  When we get back to the plane, I'll get ya there in forty minutes.  It won't stop!  I know, I know, he'll die!",
        "Rubin": "-- Did Mooney talk to you? I didn't hear from him -- he was supposed to call me after you talked.  No...  And I'm next, I know it.  Weiss didn't want to go through with it. Oh God. How did we let this happen?   -- His vision begins to cloud as the corneas are literally being burned by the intense light. He tries to shield them -- has little effect.  He looks over his shoulder -- gets a BLURRED IMAGE of his attacker not far behind.  Rubin trips. Hands go to the icy ground to protect his fall. Still hits hard. Starts to get up, but his palms are frozen to the surface. Doesn't have time to care -- pulls hard, tearing the skin right off. Stands. Spins around in a panicked whirl -- he's lost ground.  Continues to the end of the storage bins. Moves under ASB, using the enormous HYDRAULIC LIFT COLUMNS to conceal his movement.       ...Help me.  W..wa..wait."
    },
    "imdb_rating": "5.5",
    "description": "U.S. Marshal Carrie Stetko is three days from the end of her tour at an international research station in Antarctica after which she'll resign. An incident from her past haunts her. The continent's first winter storm is coming when a body, wearing no gear, is discovered in the tundra. She investigates, soon finds more bodies, and must find a motive and a murderer before the storm and her departure. A U.N. agent, Robert Pryce, appears, seemingly out of nowhere, to help. An aging physician about to retire, a nervous mission chief, a downed Soviet plane, and the weather's deadly elements add to the story. Can Carrie trust Pryce and does she still have what it takes?—<jhailey@hotmail.com>",
    "name": "Whiteout",
    "genres": [
        "Action",
        "Crime",
        "Mystery"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMTg5NDczMTQ4M15BMl5BanBnXkFtZTcwNzE4MjI4Mg@@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}