{
    "filename": "White-Squall_script.txt",
    "imdb_id": "tt0118158",
    "imdb_url": "https://www.imdb.com/title/tt0118158",
    "characters": [
        "Francis Beaumont",
        "Girard Pascal (as Julio Mechoso)",
        "Charles Gieg",
        "Sheldon 'Skipper'",
        "Frank Beaumont",
        "Dean Preston",
        "McCrea",
        "Gil Martin",
        "Dr. Alice Sheldon",
        "Chuck Gieg",
        "Tod Johnstone",
        "Sanders",
        "Shay Jennings",
        "Robert March",
        "Tracy Lapchick"
    ],
    "dialogues": {
        "Francis": "Ahoy there.  Albatross?  Doesn't inspire a lot of confidence.  I'm Francis Boutillier.  This is my son, Philip.  Your cable said you wouldn't be putting out until mid-October.  Indentured servitude is not what my son had in mind.  And I would have expected compensation for my time and expense coming all the way down here.  I'll be frank with you.  This was his mother's idea.  A romp through the Caribbean on a sailboat sounds more like a vacation than an education if you ask me.    He's a big boy.  Ahoy there!!  Well, well.  What do we have here? A floating brothel?  Well, we thought we'd drop in and see if you were all still in one piece.  Well, you never can tell these days, can you?  Well, we've come to give our boy a little break from the monotony.  Never the less...  Hop to boy.  We haven't got all day.  What's wrong, you don't like steak?  Humor me.  Eat it anyway.  Spying?!    Listen to me, you thankless little prick.  We're your parents, so don't you dare talk to me disrespectfully. What the hell is it, this captain? Because I'll see him in a rowboat...  Well, what does it have to do with? Us?    Who is it Philip?  Who are you talking to out there Philip.  Come back in here.  Captain Sheldrake exhibited an arrogant, controlling attitude in my presence on more than one occasion. I believe he had a personality conflict with my son from the start.  It was his dream to go.  I could hardly stand in the way of that, could I?  Sit down!",
        "Beaumont": "",
        "Charles": "Now just take it easy.  We're not going to a fire.  Appearances aren't everything.  Keep your mind on the road.  What are you doing?  Make us proud.  Chuck!  Chuck!!!  I couldn't bring her down here until I knew you were safe.  Come on.  I thought we'd find a store, get you fixed up and then get you some lunch.  That sound good?  I'm sorry, son.  Are you okay?  Why don't you go and try some of that on?  How're you doing in there?  All right.  I'm gonna wander over and look at some shoes...  Chuck!!  No, I can't.",
        "Gieg": "Maple street, USA, tree lined and quaint.  The Gieg home is a modest two story house with a covered porch.  The family station wagon is poised for departure.  CHARLES, 45, a generally serious man broods as MIDDY, their mother, 40, soft and thoughtful, exits the house.  Chuck and Will appear from the woods.",
        "Sheldon": "",
        "'Skipper'": "",
        "Frank": "",
        "Dean": "",
        "Preston": "",
        "McCrea": "",
        "Gil": "",
        "Martin": "",
        "Chuck": "Though I hadn't seen or spoken to Sheldrake in over thirty years, it seemed impossible that his heart was the thing that had finally failed him...  I never got close to him, nobody did.  But by the time we made Tampa, I was sure I knew who he was, that I understood what he saw, what nourished his soul and tested his faith...  He had taken us to worship, where, what was for him, the holiest of holies.  And, for us too by the end...  Though he had moved on with his life, now even for the years, to hear him eulogized by strangers, seemed strange.  He had been a hewner of stones, a pilot by the silent stars.  Like me, alone among many.  But most of all for us, the crew of the brigantine Albatross, he was always and would forever be... our Skipper.  I was just thinking that I never had a new pair of shoes till I was twelve.  It's not a vacation, it's private school.  That's not why he's sending me.  Because it looks good.  I'm just not like you.  Ya know? I'm never going to go to Yale.  I'm never going to be \"William\".  He does.  I won't.  No, I didn't.  Me too.  I don't feel like driving.  Okay?  Yes.  Look, I just better go.  Goodbye Mom.  I'll be okay.  Yes sir.  Yeah.  Gieg, Chuck.  Whatever.    What happened to it?  Maybe it's an air raid.  Jesus.  He was everything I had expected, part Ahab part Queeg and even Bligh. He spoke in whispers and answered all queries with efficiency and directness.  He had gone to sea for the first time at fifteen, the same age as Bill Butler.  And as he looked upon us that first day it must have been as though he were staring into a mirror.  We were all thirteen individuals. We'd arrived the sum total of our limited experiences and the result of our parents' best, if not narrow, expectations...  ... Some of us were there for discipline, some for escape.  But I could see a small piece of myself in all of them and though I fought the notion, for me, I knew now, this would be home.  Yes sir.    Northeast sir!  Yes, sir.  And so it was the Albatross that took to the open sea with the wind in her snapping canvas and a bone of white foam in her teeth... In each of us were feelings of anticipation and hesitation for the man at the wheel and of the unfamiliar world he was leading us into.  It was my fault.  I slipped.    How ya doing?  Good.  I just brought you something to eat.  I feel like I got you into this.  I'm used to spending a lot of time alone.  I guess that's what I thought it would be out here.  But, it's not is it?  It doesn't matter.  Really.  I'm just sorry you got chewed out.    That a... storm, Skipper?  Would you, um, say it's a big storm?  Shouldn't we turn away?  If it's all the same, I'd like to stay on deck.  The storm lasted sixteen hours and it set us all on equal footing.  It was the first time that we shared an episode on an even plane.  As we stood our watches we were equally out of control of our situation, regardless of our physical abilities or social backgrounds.  And though our real feelings lay hidden beneath bravado and defiance, we were no longer strangers.  Toss me a Cola.  What?!!  Come on you guys, this isn't funny!   Do what?  That's like wondering if your mom and dad do it.  Who wants to know?  What do you mean?  No way!  I walked in on my parents one time. It was only like eight o'clock and they were in bed and I thought that was kinda weird so I just walked in.  So I'm standing there and you could hear a pin drop.  No breathing or snoring... Suddenly it hits me that somethin' was goin' on that just stopped, really fast, like people are holding their breath.  My mother says in this really low, but very awake kind of voice \"What?\"  I said \"Sorry, wrong room\" and walked away.  I don't remember.  How do you know?  They might.  Yeah.  We better get back.  Depths of hell... Ohio.  How 'bout you?  Well, and it's pretty cool too, ya know?  Bein' here together an all...  It was a bad dream...  Here's the thing; whenever you're having a nightmare, all you have to do is say 1-2-3 wake up!  You'll be out of it.  You'll wake up.  My dad.  Swear to God.  Only good advice he ever gave me.  Now, go back to sleep.    Who?  Jesus, you never told them?  You think George'll miss the bottle?  \"If it doesn't move, throw it overboard.  If it's too big to throw overboard, screw it!\"  Alright.  Everybody just stay cool. We'll figure this out.  Shut up, Phil.  Where you going?  If you're gonna cheat, you might as well copy off somebody who's gonna get the answer right.  Takin' a piss?  Yes you do, stupid.  Because if you don't, I'm gonna go right up there and have a heart to heart with Skipper and you'll be on the first plane back to idiotville.  What?  You're not a moron.  Listen, you don't cheat, and we'll make sure you get the grades.  We'll start a private study group.  Nobody knows.  You'll ace that test.  Because we believe in you. Because we're your friends.  What are they doing?  Yeah, but how are you supposed to make the first move?  Curacao seemed out of a dream, somehow make-believe.  But, as Ohio drew further and further away, it was home that began to seem unreal, drifting somewhere in the foggy reaches of our memories.  And I knew that each of us was falling in love. But not only with these wonderful women or the swaying palms and porcelain beaches... We were falling in love with the experience we were sharing, and with who we were becoming.  Bregitta.  Do you believe it?  Her name. Bregitta.  It's poetry.  I can't remember feeling like this about myself, a place, someone like you.  We've come such a long way, seen so much.  But nothing like this.  I'm not the best at expressing myself.  Maybe the only reason I can now is because I know you don't understand me. I like you so much.  Too much.  But how could I?  I mean, if we can't even communicate, how could I know you?  It's confusing.  We sail in an hour and I'll never see you again.  Why'd you do it?  You only hurt yourself you know?  What are you talking about.  I'm here on behalf of the crew, sir.  The fact is... We'd like you to give Phil another chance.  Sir...?  He killed the dolphin.  Of what?  It's his father sir.  He's suffocating him.  We've all seen it...  I mean he has all these expectations and he doesn't even know who his own kid is.  What right did then have to show up here?  They send us because they want us to change, or grow up or something and then they try to keep us the same.  I don't know.  My god...  As Robin rang him out, we waved in silent protest against Skipper's decision.  And in the days that followed the low morale was matched only by a sense of arrogance that perhaps the master should step down and let his students take over.  We all have problems.  What'd he say?  With staff and string he showed us how to build a sextant.  As we rode the trades, he shared the ancient secrets of how to read the waves and follow stars.  And some mornings later, bathed in the orange glow of a sunrise, Panama rose from the sea like a phoenix.  We had journeyed over six thousand miles to the very edge of the earth. Like Darwin before us, we would witness the bliss of nature in the absence of man.  And it was as if the Albatross had forded time, leaving it behind.  In the heat of those equatorial days, on the virgin onyx beaches and shifting coral dunes, one could expect to find sunning iguanas, nesting frigates and perchance... the footprints of God.  You okay?  Ninety-six.  What about you?  It's a ninety-one!  It's an 'A'!    This is your moment, don't you see? The instant when you know that your life is never going to be the same again.  When you stand up and are counted.  Yes you could.  You did. This is all you.  Nobody else.  Feels different doesn't it?  That we're going back.  I don't want it to end.  I don't want to be what I was when I left.  Anonymous.  I've been getting ninety-sixes my whole life.  It's what they expect. After all this, I still haven't figured it out.  Who I am, outside of this boat. What the hell I'm doing here.  You know, I never had friends like this.  I feel like... we can do anything.  In the fading hours of that Pacific dusk, with nothing left to confess, for the first time we felt safe, capable, sure of who we were and where we were going.  Looks like we're gonna get wet.  My God, they're drowning!    We slashed at the sharks as if striking out at the finger of God. And we all begged silently for the ability to understand what had happened.  But, if there was a God that day, his answer came only in the moaning wind and our questions were left to drift unanswered, in the titanic ocean of our deepest grief.      Dad!  Where's Mom?  Yeah, sure.  Okay.  Fine.    Oh God...  When we were growing up I always felt like you would take care of things, that everything would be okay. But you can't make this okay, can you?  They need it to be simple.  They need a reason.  All of them.  Everybody waiting on that dock.  This is crazy.  Nothing could have prevented what happened.  No.  You're wrong.  Can we talk?  Everybody's saying this whole tribunal is happening because of your father.  Because of you.  Is it true Phil?  You weren't there, you don't know what happened.  Phil, please.  It won't change anything.  Tell him to call it off.  Wait.  We figured he'd have wanted you to have it. You do what you've gotta do Phil.  You taking the order wouldn't have changed anything.  But that's not the point...  No!!!  Don't you walk away!  Not now.  Not after all of this!!!!  Tell me Skipper, was it all just a lie?  \"Where we go one, we go all\". We listened to you.  We believed it. And we're still here!!  Shame on you then Skipper.  Shame on you.  Tell them the truth.  Make them understand.  It's simple.  Bad things happen sometimes.  It wasn't Skipper or Tod.  It was all of us.  Everyone in this room.  Because we all knew the risks. You sent us... You paid our tuition, you allowed us to go.  So to invent a reason for why this happened, to pin it on one person, well that won't change anything.  It'll just make our experience meaningless.  If you want to judge this man, judge him by his crew.  Judge him by Alice and George.  Chris and John and Robin.  In one way or another each one of them gave their lives saving one of us.  This may sound crazy but the Albatross wasn't just a ship, or even a school.  It was something that we made, that's inside us. That's who Skipper is.  That's what he taught us.  I guess what it really was about was... the privilege of sacrifice.  Isn't that right?    They didn't take his ticket that day.  But why he never returned to the sea, I'd never know.  Perhaps he hadn't been able to free himself from the anchor of grief that had driven him to his knees aboard the Gran Rio, or that he no longer cared for the solitude and isolation of command without his Alice.  Or maybe it was just that the waves that had spoken to him for so long, had grown silent.  Whatever it was, that thing, it had always troubled me. Because, fate offers up no reasons. And maybe that's what I have traveled these thirty four years to say.  Maybe that is all I really know... And, that one man cared.  Rest easy old salt.  For together again, we'll sail.  Some time later we learned that one of our long boats had been recovered.  Several young men found it washed up on a nameless beach somewhere on the island of Hispaniola.  No one seemed to know who they were or where they came from, but they seemed to know of the Albatross. Sometimes in my dreams those faceless young men reveal themselves as my lost companions, and on the twilight coral sands of forever, between my slumber and conscious state, we race naked again, so open and in love with those precious moments, running, ever laughing, ever young, ever free.",
        "Tod": "Well Ricky boy, spear gun or no, it's sweet to be back in the world of rum and honey.  Me and Skipper had a meeting of the minds.  I begged.  Not just any 'local' girl.  Trust me, we did the deed.  Believe me, I needed the rest...  To tell you the truth, I think it was her father.  Would you be addressing me, sir?  I'll take a dollar of that.  Chow down boys.  The milk and eggs are the first things to go once we put out.  Har, har, har...  Butler, what'd I ever do to you?    We blew the inner!  There she blows!!  Thank you, sir.  Shall we trim the main Skipper?  I think we could get another knot or two.  I'd say, fuck off junior.  Jesus Christ!!  Let it out.  Let it out!!    Sorry to here it.  Why are you such a penis Phil.  Do you do it on purpose or can't you help it.  Gimme those.   Don't mind him, Chucky.  You're talking to a guy whose idea of big romance is a palm full of Vaseline.  That's because I'm discrete, moron.  There they blow!!  There they blow!! Dolphins off the bow!!!  Listen man, I think I have a problem.  I'm pissin' fire man.  Yeah well, your sexual orientation is not my problem.  Yeah.  Jesus!!  No, hard to port!    Just tell 'em what we know and be done with it.  That's what he'd want.  What's that supposed to mean?!  I was trying to get her up wind! That's what you do when you're hit a-beam.  Or maybe you're too stupid to know that!  It didn't go over 'til I turned her starboard!    That's right, that's right!  Bleed the sails from the deck and she could've taken a hurricane!  There's still a way.  It's me, don't you see.  Terry's right, I'm the escape hatch.  I disobeyed order.  They don't know that. We were the only one's on deck. Look, there's nothing they can do to me right?  I'm a kid.  That is the point... And Skipper'll slip off the hook.  I thought we'd have a better chance if I headed into the wind so we could spill air from our sails.  Twice.  No.  Let the blow drive the boat down wind.  Neutralize our canvas.  No.  Because -- I panicked.  That's not true Tod.",
        "Johnstone": "",
        "Sanders": "Why didn't you drop any sail?  But your instinct was to lose sail?  How old are you, son?  Thank you.  Philip, why were you discharged from the Albatross?  Were you?  Well, if you don't mind my asking, sir, why did you let your son stay?  Is it true that you forced Robin Weathers to climb the mast when it was clear that he was acrophobic.  Were you aware that his brother was killed in a fall.  Sir, were you aware at any time of the use of alcohol among the crew.  Had you ever seen a \"White Squall\" before this incident?  What makes you so sure it was one?  You really felt that your crew were up for the conditions.  Except, a \"White Squall\". With all due respect Captain Sheldrake, they're only boys...  Is it true that the reason you expelled Philip Boutillier...  ... and that you invited him to strike you?  To fight it out on the deck of your ship?!  Do you think this is funny?  Some kind of joke?  You lost six people out there.  I have no more questions at this time.  Oh, one last thing... Isn't true that your father was a sea Captain?  Isn't also true that his vessel went down off of Nantucket?  Lost everyone on board.  In fair weather no less.",
        "Shay": "",
        "Jennings": "",
        "Robert": "",
        "March": "",
        "Tracy": "",
        "Lapchick": ""
    },
    "imdb_rating": "6.6",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMzE1ZGU3ZGMtZjM3NS00YTA1LWE4MzMtMDcxMWZhMTA2YWRmXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "A true story about a group of American teenage boys who crew a school sailing ship to gain experience, discipline, or whatever their parents feel they lack. The voyage is a true adventure for them all but it has its downs as well as ups.—Rob Hartill",
    "name": "White Squall",
    "genres": [
        "Adventure",
        "Drama"
    ]
}