{
    "filename": "Witness_script.txt",
    "imdb_id": "tt0090329",
    "imdb_url": "https://www.imdb.com/title/tt0090329",
    "characters": [
        "Rachel",
        "Stoltzfus",
        "Moses Hochleitner",
        "Samuel",
        "Schaeffer",
        "Fergie",
        "Elaine",
        "Sheriff",
        "John Book",
        "McFee",
        "Carter",
        "Eli Lapp",
        "Daniel Hochleitner",
        "Bishop Tchantz",
        "Mrs. Yoder"
    ],
    "dialogues": {
        "Rachel": "I'm sure he does, Daniel.  Daniel?  I need time, Daniel.  I see, darling.  Of course not. We're going to Baltimore. It's much nicer in Baltimore.  We have a ticket to Baltimore. Where is that train, please?     What do you want of my son?  Samuel. Samuel Lapp. But what happened here is none of his affair. My sister is expecting me... our train is leaving soon.  May I talk to you?  Zwartich. It's the way we say... dwarf. Not like him... very big.     (reassuring, but hardly in her own mind  Where are you taking us?  You have no right to keep us here.  You don't understand, we have nothing to do with your laws!  It's not a joke.  He wants to know who you are. Your name. I told him we don't need to know anything about you.  John Book, you listen to me! I will have no further part in this, nor will my son! As God stands between us!  No! We do not stay in hotels.        Yes, thank you very much.  Yes.  They are English. They don't understand.          Good morning.  I wanted to. you were kind to take us in last night. Anyway, I needed something to do. I was so angry with your brother. He's so... agaanisish!  Just a minute. I'll pour you some coffee.     Please, I didn't mean...  I brought your coffee.  I'm sorry. I didn't mean it that way.  Fred. The way he looked when you screamed at him.  At home you'd never hear a woman scream at a man that way.  You just wouldn't. It's not the Amish way. But I think it would have done me good if I could have screamed at your brother last night.  Okay.  The problem is I don't happen to think my son should be spending all his time with a man who carried a gun under his coat and goes around whacking people.    We do not go into your courts.         He says you look very tired. I thought the same thing.  But not a good tired.  Your sister said you don't have a family?  She thinks you should get married and have children of your own. Instead of trying to be a father to hers. Except she thinks you're afraid of the responsibility.  Oh yes. She thinks you like policing because you think you're right about everything. And you're the only one who can do anything. And that when you drink a lot of beer you say things like none of the other police would know a crook from a... um... bag of elbows.  I think that's what she said.  Good appetite.  Why don't you arrest that man? Are you protecting him because policeman?  But why would they murder...    Oh yes! Of Course. Why shouldn't we feel safe in a city where the police are so busy killing each other!  Where are you taking us now?  You couldn't wait until morning?    You said we would be safe in Philadelphia.  Kinner un Narre... [\"Kinner un Narre saage die Waahret\"  \"Children and fools say the truth\"  Amish expressions]  Stay for awhile. Rest. I'll make coffee and breakfast.  What about Samuel? Will you come back to take him to trial?  His name is John Book.     But John... why didn't you go to a hospital?    But   No...  I know.  It will go when he goes.  Thank you for coming, Stoltzfus.  Go help Levi with the car, Samuel.  No, he must stay here.  We'll pray that he doesn't die! But if he does, then we'll find a way so no one knows!  I know God help me, I know that, Eli. But I tell you that if he's found here, the people who did this to him will come for Samuel.  What else can we do?     Thank you.  It's all right! You have got to lie still.    Hello.  The leadership of our district... the diener. Bishop Tschantz is the one with no hair on top. They decided to come and see you for themselves. Except Stoltzfus, of course. He came the first day. I think he saved your life.  Only the elders.  What?  Two days.    See. Anyway, you don't have any clothes on. And besides that, Bishop Tschantz wants to talk to you when you feel better.      He'll leave as soon as he is able. He already wants to go.    Wait for me downstairs.  John Book, I would appreciate it if, during the time you are with us, you would have as little to do with Samuel as possible.  It's not the gun. Don't you understand... It's you. What you stand for. That is not for Samuel.  Please, it has nothing to do with you personally.  Enjoying your reading?  Your shirt and jacket are still stained with blood. I have them soaking.You can wear these.  Yes. It's good that someone can have the use of them. Besides, in your clothes you'd stand out to strangers.  I should tell you these do not have buttons. See? Hooks and eyes.  Buttons are Hochmut.  Vain. Proud. Such a person is Hochmutsnarr. He is not plain.    Telephone? The Gunthers across the valley. They're Mennonite. They have cars and refrigerators and telephones in the houses even.  Well... the store at Saltzburg... But you won't be going to Saltzburg for a while.  But Stoltzfus said...  You can go with Eli. He's taking Samuel to school. But you'll have to hurry.  You'd better go.  Oh. The bullets.      Eli is a fine carpenter. Best in the district. He and his father built the big house themselves forty years ago.  We had some lemonade and he left.  You know carpentry?  What else can you do?  Whacking is not of much use on a farm.  I'm sorry. I'm sure it is.  Tonight I'll let out those trousers for you.  Eli, John is a carpenter. As well as being a fine policeman.  But... You may not be well enough.    No... You just stop   I have done nothing against the ordnung.  I have committed no sin.  That is idle talk.  I am not a child.  I will be the judge of that.  (blinking a tear now, but meeting his gaze    I see. But I hope you have a lot of sugar. Eli is ready to go to Zook's.  Good luck.  All of them charitable, I'm sure.     Samuel, who is that?  Do nothing. This happens from time to time.  It's not our way, John. We'll have nothing to do with violence! John!    John, lost control of himself. He... will be repentant.  Yes. Samuel! We're going.  You should not bother with that birdhouse. If you're leaving tomorrow.  There was a time when I thought you might have stayed.  There was a time when I would have welcomed it.    You're so sure of that?  (almost conceding it, but... her voice rising a bit, annoyed   There is always a way! But you are such a... a Glotzkopp you cannot see! You'd rather go back to that city! To nothing! No woman! No children! No land!  What you do is take vengeance! Which is a sin against heaven!  That's God's way!  I could never love a man who was so... little.  The other night... when you saw me after my bath... I... I tried to look as I thought you would want a woman to look. I am sorry... that I did not.     Eli, would you see Samuel to bed?    You have no right here!  You might have killed him!  My son is out there!        I have to help him!  I want you to take this... to remember by.  Here. Whenever you want them.",
        "Stoltzfus": "Lapp was a good farmer. None better.  That's the English is it?  I feel... burning.  This man should be treated in town. The bullet entered there... and came out there. But there is the danger of infection, and he has lost a great deal of blood.  Make a poultice... three parts milk, two parts linseed oil... for the infection.  Lapp, I'll have to speak with the diener on this matter.  He was touched by God's hand.  Rest, Mr. Book. That's the ticket. And drink my of my tea.",
        "Moses": "",
        "Hochleitner": "",
        "Samuel": "Quickly, Mother Quickly!  Look, Mama...!  Is this where we're going?                               No... I saw the man who killed him.  (groping, touching his clothes and pointing at Carter  Not Zwartich, like him        I don't want to stay here.  I wish dawdie was with us.          Momma  look.         I would only kill a bad man.  I can see what they do.  I have seen it.     That's Luke. He doesn't like strangers.  ...I want to say a thing.  It looks like Hochstetler's mare.  Is it them?    What are you going to do?  Don't let them hurt you.    Are you really ever coming back?  Have you got your gun on now?",
        "Schaeffer": "How reliable is this kid?  Amish.  What have you got?  So one of them got to him.  You know who?  You're still convinced there's a link to the department?  That's the problem. We need results. The press is driving us crazy over this P2P thing. Calling us the 'speed capitol of the country'. You know the sort of thing. It's getting political. The Commissioner's getting very uneasy.  When word gets out that Zenovitch was a cop, all hell will break lose. You've got 24 hours. That's all I can give you. 24 hours on your own. After that the case and the witness go back to the Homicide Department.              I hope you don't have any doubts about that.         What's your first move?  Who else knows?     Looks like we're going to need some help from you folks down there.     I've got the woman's name, Sheriff. Lapp. Rachel Lapp. That should simplify your work.  Ah... no.  Sorry.  Thank you, Sheriff. It's been an education.  Not yet.  Elaine, I've come to apologize for Lt. McElroy. He overstated the department's position.    Elaine, I don't want to have to take you in for questioning. You've got his car, you were the last to see him   But... if you had to guess?        I don't think she knows.  What about Carter?  Lean on him.     You know where he is.  You'd lie to protect him.  You admit you're lying?  You're the first one he'll contact.  It's funny. I know he's hiding somewhere with the Amish, I know it. Can you imagine John Book at a prayer meeting? Our John Book?  Either you're a member of the club or you aren't, Elton. Tell me what you know...      How are you, John?    I'll take it in the study.  You can hang up, dear.        Got it. We owe you one, Sheriff.  Undersheriff Holmes and I have talked on the phone. Good work.  If we need any help, we'll give you a shout. I'd like to slip in there quiet, then get out before we attract any attention.  They don't have any shit.     We're police officers. We're looking for a fugitive, John Book. He's living here?  You speak English. Good. Now listen   Lady, I'm here to help you. This man is very dangerous. An armed criminal. He's got a gun, hasn't he?    He'll live.       Get back in there.  Nobody's going to hurt your son...  What the hell happened?           You stay put!     Cut that out!  Get down to the house and stay there!        Okay, Johnny. On your feet.  Hold it.  Get back, you people! Keep moving, Johnny...  Don't try me, Johnny!  Move! Or you die right here!",
        "Fergie": "",
        "Elaine": "How could you do this to me tonight? I told you I had company        Upstairs, asleep. Where'd you think?  That's none of your goddamn business! So keep your goddamn holier-than- thou mouth shut! Anyway, they like Fred.  Who are these orphans, anyway?  Everything okay?                   Aganishish? Yeah, that sounds like John.  You're not carrying a bullwhip... how'd you manage to put my kids to work?  Oh, is that so? No offense, lady, but I'm not so sure I like the idea of your coming in here and turning the place upside down!  I know exactly what you meant! Listen, maybe I'm not a world-class housefrau, but maybe I don't have time to polish the goddamn china and keep after the kids! It's none of your business, but I don't happen to have a man around here full time. So I sell cosmetics in a goddamn drugstore and sometimes I can even pay the rent on time! So maybe I'm not Mary Poppins, but maybe I don't need to have it jammed down my throat like this.  There is that clean enough for you?       It's okay. Look, I shouldn't have blown my top. It's like... somehow... I've let everything get away from me. And you sort of made me face it.  What's so funny?    No? Why not?  Listen, I don't know what's going on or how you got mixed up with him, but don't you let that self-righteous son of a bitch push you around, okay?     It's John. He says you have to leave now. He says it's urgent.  John, I don't understand any of this.  John, why?...    Then go away, you bastard.",
        "Sheriff": "...want to help any way we can, Chief, but you got to understand we've got upwards of seven thousand Amish over here.  How about an address?    Problem is, Chief, 'bout every third Amishman around here is named Lapp. That or Yoder. Or Hochstetler. Chief, if the Amish have taken your man in, I wouldn't want to hang from a rope until you find him.  There... White Oak Road a couple of miles before it ties into two-twenty- two. Got it?  My man Holmes here put it together. Fine officer, Chief. He spoke to the doctor at the hospital.  Sure you don't want us to post some backup units?  Let 'em be. It's their dirty laundry.",
        "John": "",
        "Book": "You found the body?  What kid?        Hi, kid.  I'm a police officer. I'm going to have to talk to the boy. What's his name?  There'll be another train. The man who was killed tonight was a policeman, Sam. It's my job to find out who did it. I want you to tell me everything you saw when you went in there.  Who'd you see?  Who'd you see, Sam? The man on the floor?  Anybody know about this?      Try that one again, Sam        All right, talk.  We were running Zenovitch... That's all I can tell you. But I want it, Terry. I've got a call into Schaeffer.    Go get a cup of coffee, Stan.  Oh, he's good.  Yeah.  Zenovitch was about to deliver a list of names tonight  street chemists... the guys processing this P2P into speed.  Maybe.  Maybe.  If there isn't I've just wasted the last six months.  The Amish boy saw him, Paul. I'll make it, but Set Donahue and the Homicide Department off my back or they'll blow the whole thing.  What's-her-name moved to Buffalo.     Let's just find Coalmine. Listen, Zenovich made a mistake. You didn't let anybody down. It happens   We're looking for a suspect. We've reason to believe he's still in the area.  Yes I do. Your son is a material witness to a homicide.  Doesn't surprise me. I meet a lot of people like that.  You're right. It's not a joke. Listen, I know a little about the Amish. I know this has to be an ordeal for you; and I'm really sorry you an Samuel got involved.  What was that?  Book. John Book     Sammy, where's Coalmine?  Coalmine.  Put some light on him.    Sorry. It's important.     Where's Timmy and Buck?  You've got a man here and the kids are upstairs?  Oh sure, Fred.  They're Amish.     Now what's the problem?  Whacking?  Believe me, I'm trying to get this over with as fast as I can. But Samuel will probably have to come back and testify.  People who don't go into our courts when they're told to sometimes go directly into our jail.  Look, I'm genuinely sorry...  They kid a lot.  What's a 'good' tired. Tired is tired.    No.  Oh? Anything else?     Afternoon, gentlemen. I'd like you to meet Samuel Lapp. We'd like a little help.        Because  somehow  they knew I was getting close. Look, it's narcotics... They make dope out of chemicals... they sell it on the street for millions of dollars. They'll do anything. And they can get away with it because they're cops.  You'll be safe. You don't have to worry.  Look, they're thinking as long as they keep the killer out of Samuel's way, we can't make an I.D. There's no way they can know Samuel saw that photograph, so he's safe.  I mean it. You will be safe.  It was McElroy, Paul.  Last guy I would have figured. But he's part of it.  If I did, I'd have kept my mouth shut... It fits, Paul... Fifty-five gallons of P2P confiscated four years ago... Guess who was in on the collar? Mac. He salts it away somewhere... he knows the stuff is potent, but the street chemists haven't figured out how to process it. But they do now. And now the stuff is worth five-grand a pint and there are a lot of pints in a fifty-five gallon drum.  Just us.  More people... Gotta pick up where Zenovich left off. People from outside the department.                   Just us.     No! No hospital!        Listen carefully, I wrote the Amish woman's name and address on my desk calendar, I want you to lose it for me, Now. Tonight.  Nothing. I'm not going to be around for a while. I'll call you when I can.    Yeah... I can put it all together when I get back, 'Til then, you know nothing, understand? Business as usual...    Put my car in the garage and close the door.         Home.  I was wrong.      I can't.          No, no doctor...  Gunshot... they'll file reports... they'll find me.  And when they find me, they'll find your boy!        Can I have something to drink?  Does anybody know I'm here?  How long?  How long have I been here?    Tell him his tea stinks.        Give me that.  Come here.  You ever handle a pistol like this, Samuel?  Tell you what  I'm going to let you handle this one. But only if you promise not to say anything to your momma. I've got a feeling she wouldn't understand.  Call me John.  You don't want to point that at people you just started calling by their first name.  Nobody meant any harm. The boy was curious. I unloaded the gun -  Put it up someplace Samuel can't get it.  Friends?      Very interesting. I'm learning a lot about manure. What's that?  Your husband's?  Something wrong with buttons?  Hochmut?    Quaint? Can't imagine why.  Where's the nearest telephone?  No. I'd want a public phone.  I'm going this morning.    Rachel.  Thanks.  My... eh... gun?  The... bullets?    It's me.  Never mind. I'm coming in to take care of business. How hot am I?  I'm coming.    Where I'm at is maybe 1890.  Make that 1790.  Sure, I'm sorry. Hope you don't mind me plugging in to your battery. Mine's dead... How can I help? What can I do?    I've seen pictures.                            I thought I was the English.  Try the house.     Pigs.     Oh? What happened to Hochstetler?  A real fireball.  I did some carpentry summers when I was going to school.    Now hold on. There's a lot of people who think being a cop is a legitimate job.  Guess I'm not used to so much.  Sure.  I'll drink some more of Stoltzfus' tea.  Hi...  Not long... A few days.  You like it... Don't you?    It's not her fault. I        All right, you nasty son of a bitch, we're going to be friends whether you like it or not.  See... Sugar. You like sugar, don't you for Christ's sake?  Won him over just like that.  Later.  It's been a while.       Yes, sir.      Hey, Sam...       Same to you, Sam.     Sam?         Last night.  If... we'd made love, then, I couldn't leave.  Maybe I ought to learn to drive this thing.        Lieutenant Elton Carter, please.  What? I'm a friend of his.  You made a mistake, Paul. You shouldn't have taken Elton out.  I'm fine. I'm going to live a long time. That's what I called to tell you.  You might want to pass it along to Mac.  I've already got something worked out. Be seeing you.      I'm leaving tonight. I'm going to need my clothes. And my gun.      No. I was being unrealistic. Even thinking about living this life.  Aren't you? After today?      That's your way, not mine.  Well in the City of Philadelphia, God needs a little help!         (he bends to the boy, takes him by the shoulders  Listen to me, Sam! I want you to go across the new corn to Stoltzfus'. Run as fast as you can. And stay there!  I'll be all right. You just do as I say.  (rising, pushing Samuel toward door                                                                    It's okay, Sam.     You're going to have to do it right here, Schaeffer.  It's all over, Paul.     Got to, Sam. You and I are going to a courthouse together, put some people behind bars.  Sure have, Sam.  Where's my baggy pants?",
        "McFee": "",
        "Carter": "I didn't even know about it.  I got there late, John.       Yeah...  What the hell are you talking about? What's happening.      Yeah?  Johnny! Where the hell have you been?    Listen, Johnny, don't do anything stupid. You couldn't get within a mile of Schaeffer right now. So stay put... Stay in touch  I'll let you know when maybe it makes sense.    That's more like it. Where are you at, anyway?    Wrong.        What I know, Paul, is... He's going to take you out...",
        "Eli": "You be careful out among them English.  Who was that man?  Is the English dead?  Looks dead...  Stoltzfus is coming.  That has no place in this house.  Didn't you hear Stoltzfus? What if he dies? Then the sheriff will come. They'll say we broke their laws   Rachel, this is a man's life, we hold it in our hands.    The gun  that gun of the hand  is for the taking of human life. Would you kill another man? Eh?  What you take into your hands, you take into your heart.  Only a bad man. I see. And you know these bad men on sight? You are able to look into their hearts and see this badness?  And having seen, you would become one of them? Don't you see...? The hand leads the arm leads the shoulder leads the head... leads the heart. The one goes into the other into the other into the other... And you have changed, and gone amongst them...  \"Wherefore come out from among them and be ye separate, saith the Lord!\"  (indicating pistol; continuing from Corinthians 6:17  Hurry up now, John Book!  If you are well enough to do that thing, you can do work for me.  Maybe milking.  Cows. You know, cows?  Good, you start tomorrow.       Good, firm twist and pull, eh? Right. Now you try it.  Didn't you hear me, Book? Pull! You never had your hands on a teat before?     Have to teach you mules, too, I guess.  Eat up, Book. What's the matter with your appetite?    Eh? Well then, maybe he can go to Zook's barn-raising, eh? See how good a carpenter.  Rachel!         (tone softening... in the dialect   (the old man almost breaks down as, in the dialect      Wait here 'til I find a gang you can work with.  I have nothing to say to you. Get out of my house!  John Book!  Praise Gott!    It is not our way!  So... will you kill us all, then?  You be careful, John Book! Out among them English!",
        "Lapp": "",
        "Daniel": "",
        "Bishop": "",
        "Tchantz": "",
        "Mrs.": "Everyone has an idea about you and the English.  Hardly any of them.  How are you, John?",
        "Yoder": "Everyone has an idea about you and the English.  Hardly any of them."
    },
    "imdb_rating": "7.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZWQzYmM5OGYtMDJlOC00M2RlLThhYzgtNjZiOWYxNjlhMDJmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_QL75_UX380_CR0,3,380,562_.jpg",
    "description": "An 8 year old Amish boy and his mother are traveling to Philadelphia, on their way to visit the mother's sister. While waiting at the train station, the young boy witnesses a brutal murder inside one of the bathroom stalls. Police detective John Book is assigned to investigate the murder of the man, who was an undercover cop. Soon after, Book finds out that he's in great danger when the culprits know about his investigation and hides out in the Amish community. There, he learns the way of living among the Amish locals, which consists of non-violence and agriculture. Book soon starts a romance with the mother of the little boy, but their romance is forbidden by the Amish standards. But, it's not long before the bad guys find out Book's whereabouts.—blazesnakes9",
    "name": "Witness",
    "genres": [
        "Drama",
        "Romance",
        "Thriller"
    ]
}