{
    "filename": "Wonder-Boys_script.txt",
    "imdb_id": "tt0185014",
    "imdb_url": "https://www.imdb.com/title/tt0185014",
    "characters": [
        "Grady Tripp",
        "James Leer",
        "Q",
        "Fred Leer",
        "Officer Pupcik",
        "Oola",
        "Walter Gaskell",
        "Vernon Hardapple",
        "Miss Sloviak",
        "Emily's Father",
        "Amanda Leer",
        "Traxler",
        "Hannah Green",
        "Terry Crabtree",
        "Sara Gaskell"
    ],
    "dialogues": {
        "Grady": "'The young girl sat perfectly still in the confessional...   ...listening to her father's boots scrape like chalk on the ancient steps of the church, then grow faint, then disappear altogether.'  As he finishes, GRADY ponders a PAIR of MAINTENANCE MEN, perched on ladders in the quad below, stringing a LARGE BANNER between two bare trees. The BANNER reads:    So. .Anyone?  A GIRL with jet-black hair turns to a PALE YOUNG MAN sitting at a desk in the back of the classroom. He is JAMES LEER, 19. Like GRADY a moment before, he is staring out the window.   All right. Let's try to keep it constructive, shall we? Howard, what about you?   That's not exactly what I meant by constructive, Howard.   Yes, Hannah?   Well put, Hannah. And a good note to end on, I think.  Don't forget about WordFest this weekend. And remember: those of you driving V.I.P.s to tonight's cocktail party need to have them at the Chancellor's house no later than 5:30.  Hannah Green gathers her things, pauses by Grady.   Thanks for that. He all right?   Me? Sure. Why?   Chancellor.   I got the message you called too.  This hangs in the air, awkward somehow, then both nod and continue on, without so much as a backward glance.    The RADIO BLASTS as GRADY pops the glove box, removes a JOINT as big as his pinky, and wheels his DARK MAROON '66 GALAXIE RAGTOP away from campus, cruising under another  How are you, Crabtree?    The more the merrier.   I sweat blood for five years and he checks for spelling.   Emily?   Oh. We're picking her up. Downtown.   Lay off Pittsburgh. It's one of the great cities.   She's a transvestite.   She's still a transvestite.   Isn't she?  Crabtree ignores Grady's question, smiling placidly as he watches the carousel spin.   It's fine. It's done. Basically. I'm just sort of. ..tinkering with it.   I don't know. I'm sort of at a critical. . . juncture .   I just mean. . .   That would be a tuba.    As the Galaxie emerges from a TUNNEL, GRADY watches the great city of Pittsburgh reveal itself in the distance, then glances in the rearview mirror.   That perfume you're wearing, Antonia. It wouldn't happen to be Cristaile, would it?   Lucky guess.   It was Jerry Nathan's. He owed me money.   He said something about being between things.   Hi, Tanya.  This is Tanya. My wife's secretary.  CRABTREE and MISS SLOVIAK smile and nod. Tanya smiles and nods back, her eyes passing uneasily over Grady's joint.   You're leaking, Tanya.  Tanya nods--at a loss-then turns away into the rain.   She left me. Crabs.   This morning. I found a note in the kitchen.   I thought maybe I made it all up.   It's Mrs. Gaskell's. Her hobby.   Piss off, Crabs. I lost a wife today.   Easy there.   He's still barking at me. He's blind.   I need to talk to you.    I don't believe I know where the upstairs guest room is.   New?   All right. This morning--   Well. This is...surprising. Does Walter... ?   Emily left me this morning.   She's left the room before. She always came back.  Sara nods. Considers this.   Simple.  GRADY and Sara stare at the ceiling. Sara sniffs the coat lying beneath her. Miss Sloviak's coat.   Hm.   If she's not now, Terry will make sure she is by the end of the evening.   Yes.   No. Maybe. I don't know. I don't know what I'm going to do.   Sara, my arm. I'm stuck, honey.   Ask him if he's conflicted about his house in the Hamptons.   Q,. Hannah's had two stories published in The Paris Review. You'd best dust off the 'A' material for her.  As GRADY moves off, he sees Poe sniffing, and goes the other way, heading directly into the crosshairs of a MAH IN TWEED, who is talking to another, shorter MAN.   Hello, Nathan.    No wonder it's still in print.  As GRADY flees, he passes a WOMAN holding a cigarette.   James?  James Leer wears the same nasty overcoat from class, a GREEN KNAPSACK hanging off one shoulder. GRADY looks at what appears to be a sliver of moonlight in James' palm.   It's very convincing.   ...You carry firearms.  As GRADY exhales a plume of smoke, James' eyes pass briefly over the jay. GRADY notices, offers.   Are you and Hannah seeing each other, James ?   Relax, James. I'm not her father. I just rent her a room.   Maybe it's because she's beautiful and she knows it and try as she might to not let that screw her up, it's inevitable that it will in some way.  James looks away from the window, at Grady.   You're not like my other students, James. So what was the movie you two saw?   She went crazy, Frances Farmer.   Sounds like a good one.   Listen, James, about this afternoon. In workshop. I'm sorry. I think I let things get a bit out of control.   Well...    Really? That's remarkable.   You cold, James?   So what are you doing out here?    You're right.  James blinks, startled by Grady's laughter, startled that he's said something funny. He looks back to the greenhouse   Heaven?   James.  Don't leave just yet. There's something I think you ought to see.   This is worth it.  James looks conflicted.   Trust me.   He's going with me. You take Crabtree. And his friend. All right?   The answer's yes. I think. Yes. I don't know. Where are they exactly?   James. This is my editor, Terry Crabtree.   That's really it.   So I'm told.  James, in the presence of the holy grail of suicide garments, stands speechless.    Go ahead.   Really.  James swallows, then'-goes to the jacket. Carefully, he reaches out his fingers and touches the yellowed collar, barely making contact, as though it might crumble to dust.   Like the lady herself.  GRADY says this airily, ironically, riding his buzz a bit, but James nods solemnly, eyes transfixed on the jacket, as if Marilyn herself were inside it.   I guess. Walter never tells Sara the truth about how much he pays for these things.    Pretty good. I'm friends with Dr. Gaskell, too.   Right.  A DOOR SLAMS downstairs and GRADY and James jump. The CLICK of a woman's HIGH HEELS sends GRADY to the bedroom window, where he watches Sara slide into a WHITE CITROEN DS23, turn on the ignition, and motor away.   We, better skedaddle. Close that closet-- James? You ail right?  James is slumped on the Gaskell's white linen bed, knapsack between his knees, head in hands.   Maybe. I'm feeling a little sad myself tonight.   Yes. Well. It's complicated, James. I think we should go now.  Without thinking, GRADY flicks out the bedroom light, leaving James Leer in the dark for the second time today.  James just sits there, a shadow in a room of shadows.   Okay. Easy now. Eee-zy. . . .  GRADY starts to take a step, when.... Poe shoots forward and sinks himself deep into Grady's ankle.   Jesus!  GRADY hops gracelessly, momentarily lifting Poe off the ground as he swings his leg up. Poe, countering, rolls his head in a snapping motion and drops GRADY in a clumsy heap.   Get off of me, you son-of-a-bitch!  Poe regains his feet, but doesn't let go, whipping his head back and forth, back and forth, over and over, growling low, dark, and hideously from the back of his throat, until there is a sharp...   Shit, James. You shoe Dr. Gaskell's dog.   Couldn't you've just pulled him off me?   Okay, okay. Take it easy. Don't freak out on me.  GRADY roils down his sock. Apparently, Poe went through life with a slight overbite.   He's dead, James. Believe me, I know a dead dog when I see one.  James looks miserably at Poe.   First you're going to give me that little cap gun of yours.   Yea, James.   I don't know. I'm still trying to figure out how to tell the Chancellor I murdered her husband's dog.   Trust me, James, when the family pet's been assassinated, the owner doesn't want to hear one of her students was the triggerman.   I've got tenure.   Okay.  James totters forward, arms hooked under Poe's front legs looking like a sorry marathon dancer. GRADY frowns, limps forward, and takes the hind legs.    That's just what they used to say in the ads. Come on, Crabtree, I know you're holding...   Miss Sloviak's.   She is. Ah. Here we go...  GRADY unravels a pair of boxer shorts, finds an airplane- size bottle of JACK DANIELS, then grabs another pair of boxers.   Most of the time he is, James. Some of the time he isn't. Now what do we have here?  GRADY rattles a prescription bottle, then shakes out a pair of WHITE PILLS, each etched with a tiny numeral 3.   Looks like ...our old friend Mr. Codeine. That should take the pinch out of my ankle.  Have one.   Right. That's why you were standing in the Chancellor's back yard twirling that little cap gun of yours tonight.  You're fine, all right, you're fit as a fucking fiddle.  GRADY opens the tiny bottle of Jack with his teeth, drinks down two number 3's, then looks at James.   I'm sorry, James. I'm sorry I said that.  Recklessly, James takes a pill, tosses it in his mouth, and tips back the tiny bottle of Jack. Half a second later, he spits it all out. GRADY looks down, peels the soggy pill from the lapel of his jacket.   How 'bout we try that again.   I'll be right back.   Is the thing-is it over?   Nothing. I think I twisted my--  GRADY looks at his ankle and feels a rush of guilt.   I have to tell you something. Something.. .hard.  Sara's face stiffens, becomes more Chancelloresque.   Well...   No, really, Sara, I don't think you--   I don't think I really have a choice in, that. Emily left me.   Not have it.   Well, no, I don't see any way.  And I know how hard it is for you to-- to lose this chance.   It's-it's a souvenir. Of Baltimore.  Before GRADY can close his hand, Sara has it in her own.   Caps.  She points it-at Grady's chest. He smiles nervously.   You got me.   I love you, too.   Is he ail right?   I'm your man.   There's an explanation.  MISS SLOVIAK raises an eyebrow and then, leaning in, unzips her suitcase.    As GRADY drives, MISS SLOVIAK finishes with the top button of a man's shirt, then reaches into the zippered COSMETICS BAG in her lap. Onto the open tray of the glovebox, she places a JAR of COLD CREAM, a BOTTLE of NAIL POLISH REMOVER, and a cloud of COTTON BALLS.   James is. ..I don't know...   I'm not sure that's possible.   Listen, Antonia--   Tony. I'm sorry if things didn't work out so well for you tonight. With Terry.   He's writing his name in water.   Like most editors, he really wants to be a writer, but he's too busy living a novel to bother writing one.   He'd call it habit. But now. ..I get the feeling he's going through the motions a bit.  Tony peels off a pair of false eyelashes, blinks.   Jesus. Is that what he told you?   That'' s nice. All we have is a Japanese beetle trap.   I'd better go. I think I may have to rescue James Leer.  MISS SLOVIAK returns the gun, .steps out of the car, and peers in at Grady.   As a whistle.   Double Dickel on the rocks.   Is that just beer?   I'm sure. Where is everyone?   Jesus. He's out.  CRABTREE glances over, nods.   I know. He started it Fall semester.   No. Not yet he isn't.   Come on. Crabs. Don't do this. He's . one o£ my students, for Christ sake. I'm not even sure if he's-   I think it's more complicated than that. Besides, he's a little...scattered. He almost ...did something stupid tonight. At least, I think so. Anyway, he doesn't need sexual confusion thrown into the stew right now.   Thanks.  GRADY notices the waitress's nametag  and realizes she is conspicuously PREGNANT. He watches her disappear beyond the blur of bodies on the dancefloor, where Hannah Green's slinky form seizes his attention.   Shut up and drink.  CRABTREE grins, brings his bottle up, then stops.   President of the James Brown Hair Club For Men.  Sitting alone in the dark booth is a SMALL BLACK MAN with big hands, a face peppered with scar tissue, and--most noticeably--a tsunami of hair sprouting from his scalp.    He's a boxer. A flyweight.   Not Curtis.   And now he's addicted to painkillers.   He lives with his mother.   Groom. Named Claudell.  And his mother blames Vernon for his death.   He heard everything we were saying.  Just then, Hannah Green bounces up in her red boots.   I thank you.   I hope that isn't true. We need all the downy innocents we can get.  GRADY spies the corner table, watches CRABTREE say something to Q and then, casually, stroke a lock of hair from James Leer's forehead.   Do?   Are you holding me up or am I dragging you down?  Hannah snuggles closer, lays her head on Grady's chest.   Look, Hannah. When you get him home ...make sure he's ail right. Before you leave. Okay?   Hannah, are you telling me you don't know where James Leer lives?   That strikes me as odd.   What's he saying?   Hh-uh. Last time I saw it was...  GRADY glances at the idling Galaxie across the street.  Shit. He must've left it back at Thaw. In the auditorium.   All right. Take him to my place. He can crash on the sofa.   I don't think it really matters, Hannah. We could probably stand him up in the garage with the snow shovels at this point.  As GRADY lowers James into the seat, he WHIMPERS, curls into a bail. Hannah turns her puppy dog eyes on Grady.   Ail right. In my office.  As GRADY starts to turn away, Hannah's fingers graze his face.   Excuse me?   It's mine.   You must be mistaken.   Go home to your mother, Vernon.    All right, what's the matter?  CRABTREE just keeps smiling.   Christ, Crabs, what do you expect me to do? The kid's practically in a coma.   Yes.   What's this guy's problem?   Shit.   Now what?   I just had my car jumped on.   Wait here. I'll be right back.   I hope it wasn't my fault.   Oh.. .yeah.    I don't know. It might be...   Christ, Traxler. How the hell should I know?   Oh, right. Yeah, that's true. He used to rub ail kinds of things on it. Paprika. Ground lamb.   No, my wife's out of town.  Just then, the Honda FILLS WITH LIGHT. HEADLIGHTS loom, then a POLICE CAR sweeps into the Gaskell's driveway. Walter appears on the front steps.   Her husband.  Traxler looks anxiously at the police car.    Taking the long way home.    As Traxler drives away, GRADY mounts the porch with James Leer's knapsack hanging from one shoulder. He reaches above the door, feeling for a key, but his fingers come away with only dust. He stands, dispirited, then an idea strikes. He takes the doorknob, turns it. It opens.    GRADY enters, closes the door quietly behind him.    James Leer slumbers on a green sofa, draped in an old sleeping bag. GRADY drops behind his desk, lets James' knapsack slide to the floor. He lifts his cuff, inspects his ugly ankle, then glimpses something in the knapsack.  Something yellow. Something soft.  GRADY reaches down and, slowly--like a magician producing a magical scarf-extracts MARILYN MONROE'S WEDDING JACKET from James Leer's ratty green knapsack.  GRADY glances at the young man on his sofa, then, looking very tired, reaches for the desk lamp ...and turns out the light on the both of them.    GRADY enters with a THERMOS--pauses--redistributes the sleeping bag over James Leer's pale body.   You're welcome.  GRADY sits at his desk, pours himself a cup of coffee from the thermos, then sets the cup directly in the center of a galaxy of previous coffee rings. Next, he takes a clean piece of paper, balls it up, and-with ritual precision-strokes it into the MINIATURE BASKETBALL HOOP that crowns the rim of the WASTE BASKET across the room.  All net.  A 9-VOLT CROWD ROAR belches from the hoop and, without further ceremony, GRADY turns to the blank page curling from his IBM SELECTRIC and SPACES to the top right corner, TYPES:   2611  In other words: Page 2611.  CLOSE UP - THE TYPEWRITER PAPER -- darkening with WORDS, the KEYS SNAPPING faster and faster, a CRAZY CLAMOR that grows and grows until, finally, it just ....Stops.   James I  GRADY awakes with his back to the floor, James leer's quizzical face floating like a cloud above him.   I'm okay. I just lost my balance.   Oh.   Huh? Oh, no. This isn't Emily's. I just write in it.   There is, but it's not that interesting.  James nods. Down the hallway, in another room, the  Sure.  As James shuffles away in the sleeping bag, GRADY rises delicately and turns toward the window, ..just in time to see a POLICE CAR roil slowly by on the screen below.   Who?   What'd he say?   What'd you tell him?   Good, James. If the Zodiac killer calls, be sure to mention the back door pops open with a couple hard shakes to the right.   Afraid so.   I think it's sort of writing itself at this point.   But . . . ?   Washed up?   Ah. I don't believe in writer's block.  James takes another glance at the mammoth manuscript.    If-you 're planning on staying for breakfast, I'd put on something a little less comfortable if I were you.  As GRADY moves to his desk to reacquaint himself with the page curling from the typewriter, James continues to stare into the emptiness of the hallway. The sight of CRABTREE seems to have made him suddenly queasy.   Hm.   No one seems to know where you live, James. Hannah thought you'd like my couch.   Well, James, you did shoot the Head of the English Department's dog and steal his most prized piece of memorabilia.  As James contemplates this, the DOORBELL RINGS. GRADY looks up, sees the POLICE CAR he noticed earlier, now parked at the bottom of his driveway.   Do yourself a favor, James ...Hide.   Well, there's always people you don't know at these things, but I can't say there was anybody particularly suspicious. ..Wait. There was one guy. Tiny fella. Claimed to be a jockey.   Horses, right. Vernon something...  Hardpple  Pupcik stops on his pad, looks up.   I could be wrong. What happened anyway?   That's weird.   The perpetrator.   Just kidding.  Pupcik nods slowly, as if re-filing GRADY under \"Dealing With Assholes.\"   I might have his number on campus.   Oh. Well. I...  Hannah stretches and the t-shirt slides dangerously up her thighs.   Hello?   Could you hold on a minute, honey?  With a look of wonderment, GRADY watches his hand ever- so- gently ...hang up the phone.   How 'bout we get the hell out of here?    James, now wearing one of Grady's flannel shirts beneath his ratty overcoat, follows Grady-to the Galaxie, knapsack swinging from his shoulder. GRADY tosses him a ring of  You start her up.  As GRADY runs a plastic WEDGE over the GLAZE of ice blanketing the windshield, James stares curiously at the keys, as if they were some strange artifact, then slides behind the steering wheel.   Well done, James.  As GRADY works, James' face comes into view, then ...the wedge SNAPS, splintering into the flesh of Grady's hand.   Shit!  James blinks, pokes his head out the window.   Where exactly do you live, James?  James, in the midst of chugging from a 64-OUNCE JUG of ORANGE JUICE, stops.   Apparently not even Hannah Green has a clue as to the location of your apartment.  GRADY tosses the tin of band-aids into a small plastic hand basket, begins to move down the aisle.   I guess there's probably a story behind that.   So where have you been staying?    But James. I mean. ..How long?   Jesus, James, you should've told someone.   I don't know...  Me.  GRADY drops the basket at the check-out counter and, abruptly, finds himself face to face with a BABY, lolling on the shoulder of the woman before him. The baby is staring, spellbound, at a display of...Q'S LATEST  frowns, then detects the true source of enchantment: a spray of SHINY MYLAR GIFT BALLOONS.  A thought evolves.    What do you think of these?  James takes another chug from his jug, nods.   Hm.  GRADY gets out, then pauses, glancing at the giant orange juice jug between James legs. It's about half-down.   You better ease off that stuff, James. It's pretty acidic.  James takes a powdered donut that lies on his coat, studies it curiously.   Shit, James, you're hungover. What do you think's the matter with you?  As GRADY turns away, James ponders this, then considers the ring of white sugar imprinted on his coat and re-sets the donut in precisely the same place.   Totally.  I'm sorry. A lot was happening this morning. Can you talk?  Sara nods, moves the ficus to another table.   I-heard.   A twelve-year-old policeman came by the house this morning.   Really? That was fast.   Oh. Right. Ha. Listen, about last night. There is something I need to tell...   Hub? Oh, well, that's part of what I need to . . .   No. I mean. Well, actually, yes. Sort of. I don't remember. Listen, Sara, I have to tell you something.     ...want to be with you.  Sara looks at him.   Really, Sara, I...  Sara holds up one gloved hand.   I know that. I know what's at stake here...   About the baby.   James Leer.   I'm sort of helping him work through some issues.  Sara raises an eyebrow, then pushes through the door.   Yeah, well, actually. . .  James looks over.   The moment didn't really present itself.  James nods, unsurprised, then turns back to the window, staring at the landscape, still sitting oddly still. GRADY glances at him. At the orange juice jug.   You' re not planning on puking in my car, are you, James?  Nothing.   Don't be proud, James. We're in Sewickley Heights. We could find you a nice golf course to barf on.   Your aunt ?  James turns, eyes flashing with surprise.   Hannah mentioned something about an aunt.  James nods vaguely, then reaches into the ashtray, takes a JOINT between his fingers, sniffs it.    Maybe...   Glaucoma?   Jesus, James. Wow.  James puts the joint back in the ashtray.   Where's that?   Carvel? Where's Carvel?   I never heard of it.   Your father worked in a mannequin factory?   What kind of dancer? .    James Leer, are you telling me your mother was a stripper?   Didn't you say your Mom went to Catholic school?   Amazing.  GRADY takes the joint from the ashtray, lights it, then notices-with surprise--James has his hand out.   I thought you were the guy who didn't like to lose control of his emotions.   Kinship.   Unless I miss my bet...my wife.  James' heavy eyelids flutter with surprise.   That's right. That one.   How can you tell?   Smoke the rest of that joint, James, and you can start on the box.   She came here. We'll just wait. In the meantime, I need you to shimmy through.  James stares at the \"Doggy Door\" cut into the back porch door.   Relax. Emily hasn't carried a house key since she was twelve years old. And your hips are as slim as hers.    Oh. Right. Well, let's try not to think about that.  James takes another sad glance at the little door, then drops onto ail fours.   I know. It's the house you want to wake up in on Christmas morning.  Make yourself at home. I'll be right back.    Yes, I' m looking for the Chancellor... I don't know. She should be in the main hall ...Thank you.   cups a hand over his ear.   Sara? Hi. It's Grady.   I'm in Kinship. Listen, Sara, there's some things we need to talk about...   Yes. But that's not why I called...   What? No'. There's no one here. I'm just ...just....    James! For Christ sake, will you turn that thing down!   Look, Sara. ..I'm not here. ..I'm not here to . . .  As GRADY watches, a late-model PONTIAC BONNEVIlLE turns into the driveway below him.    ...reconcile with Emily.   No. Sara, you don't understand...    Yea?   Mom. Dad.   Yes. He's a good kid. Maybe a little messed up.   What made you pull out that old thing?   And?   Maybe I should read it.   Where's Emily, Hank?   I'm not going to stalk her. Hank. I just. ..want to know where I stand.  Hank looks up, incredulous.    l-just want to say I'm sorry.   Neurologist? Why? What's wrong?    Oh. Right. Linda ...I haven't been doing a lot of sleeping lately. My editor's in town and I have the book to finish and--   Listen, Hank, I'm sorry about ail this. I didn't come here to upset you and Irene. I want you to know that.   I -just wanted to see her, I guess-- Emily. And to see you too-you and Irene. And to let everyone know that, even though it may be difficult to comprehend now, this-everything that's happening-it's not forever. It doesn't mean \"Goodbye.\"   I'm really happy for you, James. But do me a favor, will you? Lay off my dope. That stuff's not for amateurs.  James looks at Ziploc as GRADY fiddles with the heat   I just wanted a little sip? Tell me, James, exactly what point was it that you turned into Serpent Boy?   Jesus...  Look, James, you appear to possess-like many an aspiring writer before you, by the way-a rather ardent affinity for the stuff of which dreams are made. However, I 'think it's best if, for the moment at least  ...we abstain.   What?   It wasn't her dog. It's her husband's--  Who said anything about girlfriend?  James eyes shift slowly, as if to 'say: Who are you kidding?   Okay, James, I wish you hadn't shot my girlfriend's dog. Even though Poe and I weren't exactly what you'd call simpatico, that's no reason for him to take two in the chest. Still, the fact remains that I'm the one who took you up into the Chancellor's bedroom. I'm the one who has to take the blame. I- don't know what the hell I was thinking.   Thanks for the halo, James, but I've . never done that much thinking ahead in my\" life-ever.  James looks -out the window, pondering this.    I -don' t know, James . I don' t know why I do half the things I do. Who does?  Why do you wear that coat?  James looks down, a little defensive.   James, fall semester, first day of class, it was 95 degrees and you were wearing the coat.  James just blinks, no ready answer-available.   That's why they all give you such a hard time in workshop.   Because you act like a goddamn spook all the time. Not to mention the fact that every last one of them is jealous of you.   Not you. Your talent.  James' face hardens. He looks away.   The hell I am.   I never said that.   I didn't mean it that way.   Shut up, James. You're annoying. Carrie and Howard don't know what the fuck they're talking about, okay? The entire class combined- including the lovely Hannah Green-has about one tenth of one percent the talent you have, okay?  James stares blankly at Grady, then turns his face to the window. He ponders Grady's words, the praise inherent in them. A hint of pleasure glints in his eyes.   Who cares what-. I said last night, James I I was drunk, I was stoned. I'd been bitten by a dog. My wife had left me. How 'bout cutting me some slack?   And don't be so goddamn sensitive. Who cares what anybody thinks anyway? You want to .be a good writer? You want to be-a great writer? Then stop giving a damn what other people think. Most of them haven't thought in .years.  James turns, studies Grady's face as it flickers in the first headlights of the evening.   Let me spell it .out for you, James. Books don't mean anything. Not to anybody. Not anymore.   Well, for that, if nothing else, James, I'm sorry.   In a minute. Get us a table.  James nods, pushes past the glass doors into the coffee shop, and a big REDHEAD in a waitress cap leads him to a table with a view of the highway. GRADY watches James-- stick figure in black brogues--slide into the booth and open his big, laminated menu.  Finally, as if concluding some internal debate, GRADY kicks open his door, steps out.   C-a-r-v-e-I. That's right, Carvel. Yes, I'm sure. It's outside Scranton.  GRADY straightens up, takes a peek at James, sitting by himself on the far side of the coffee shop.   You have no listing. Okay, well, lady-- at this very moment, as we speak, I'm looking of a resident of Carvel, Pennsylvania. I think he'd be pretty interested to learn that the good people of Bell Atlantic have misplaced his entire hometown. It's not like I'm making this up as I go along--  GRADY stops, his own words ringing in his head.   Never mind. My mistake.   No thanks.   Spells? Jesus, James, you make it sound like we're in a Tennessee Williams play. I don't have spells.   I don't know. ...'Episodes.'  James shrugs, spears a fluffy chunk of pie.   I eat.   When nobody's looking.  GRADY watches a pair of headlights approach...   You just worry about yourself, James. Okay?   Nowhere. You just sit here and... eat.  GRADY moves off, then stops, looking back at James and his giant piece of pie, still troubled by his words.   Grady.    Looks like I've dashed a-wonderful evening.   Ah. Well, that's ail right. James and I 'had a little dinner.   That's not necessary. I just felt. ..it might be good for James to be with his family this weekend.   Well. Let me go get him.  GRADY turns for the coffee shop, then stops, looks back.   I \"hope you won't consider this forward of me, Amanda, but I wonder if I might ask. ..did you ever attend Catholic school?  Amanda Leer's eyes narrow ever-so-slightly.   James. Listen. Things-things are a little weird with me right now and I-- well--I have enough blame to shoulder these days without having to take the blame if something bad happened to you. And if you hang around me long enough, something bad is going to happen, trust me. That's why I need you to go home. Understand?   James, like it or not, they're your parents.   I remember that. Five or six years ago.    Near Carvel?   James, come on. That man is obviously your father. You look just like him.  James looks down at the table, takes a deep breath, and speaks in a voice heavy with implication.   Get out of here.   In the crawl space, with the rats and the casks of Amontillado. Come on. Up.  As GRADY lifts him from the booth, James attempts a plaintive tone, but his heart's not in it.   Take care of him.   Hey!   as the Mercedes begins to pull away and James turns, elbows on the back dash, his pale face slack. Spying Grady, he raises one limp hand, and then-as if it were held by a string-lets it drop.    Hey.    Grady's HOUSE looks like a three-dollar whore on a block full of nuns. MUSIC BLARES, LIGHT BLAZES from every window, and there are so many CARS GRADY is forced to leave the Galaxie in the middle of the street.     Crabtree.    Times Square before the ball drops. GRADY enters, scans the room, then shoulders his way to the stairs.    Hannah Green sits on the sofa, twisting a long strand of hair around her finger as she reads a THICK MANUSCRIPT.    Hey.   No, it's okay. I just can't believe I left it out in the open like that. CRABTREE hasn't been in here, has he? Poking around?   Listen, Hannah. You don't remember where that aunt worked, do you? James' aunt.   Actually, He's not the Chancellor' s--What?   Jesus.   Crabtree? He doesn't even know James.   The aunt, Hannah. Where did you take James that day?   But where? I need the street.   Shit.  As GRADY starts to turn away, Hannah hooks her finger inside his belt buckle.   Listen, Hannah, I'm flattered, really, but right now I--   You stay there.   Gee, I don't know. Crabs. I don't seem to remember you actually asking me if you could invite 200 people over to trash my living room.    Think, Hannah. Does James have any friends. I mean, besides you and. ..me?   Nothing, he's just been sort of, I don't know.. .kidnapped.   His parents.   Good idea. Crabs. Only one problem. I don't know where they live.   It's a little late to call Admissions.   Maybe ...I don't know.   Love. It's Love facade--and what do you mean 'based on what you've read'? You skimmed two chapters at 80 miles an hour while gargling methamphetamines.   Only in your bones?  GRADY smirks, glances at Crabtree, but gets a surprise; CRABTREE offers no snappy come-back, no antic wordplay. He just stares out the window, his voice distant.   How bad is it for you?   Which is?   What's to tell?   Me too.   This is it.   I told you. They keep him chained in the basement. Come on.   James Leer.  GRADY moves to the window and RAPS on the glass. A moment later, James peeks out. Seeing Grady, his face brightens briefly, unguarded, then quickly resumes its usual Leerian aspect. He motions with his hand, as if to say, \"That way.\"   I can't believe you made fun of my robe.   Oh, Christ, don't start on ol' Gran or we'll leave you here.   Ah, wear whatever you want.  James flinches, stung, then disappears into a bathroom.   So sensitive.   It's just ail that crap he spins out. Just once I'd like to know if the little bastard is telling the truth.   Yes? 'His heart...'  CRABTREE hesitates, then... reads on:   No.  CRABTREE and James turn.   I've got something better than a teddy bear.  CUT TO: POE -- as he's lowered delicately onto James' bed.   Sweet dreams, Jimmy.    The lights are still blazing, the front door is wide open, but not a soul remains.   Crabtree.   Nothing.  The door closes, the LATCH CLICKS, and GRADY is left alone, the bossa nova floating softly in the air.    The TV is on. GRADY steps to the doorway, pauses.   How are you--is it Joe?   Don't sweat it. Well. 'Night, Jeff.   No...   It's cool, Jeff. Really.    GRADY sits quietly on the porch steps, a joint burning in his fingers. To his left, perched atop a Haagen-Dazs container, is a TELEPHONE. As he pulls it into his lap, a LAMP in the living room pirouettes clumsily, spins free of the cord, and SHATTERS on the floor.  GRADY blinks, looks away, and DIALS, just as. ..the CLATTERING COUGH of an ENGINE is HEARD and a VAN appears. Stenciled on its side panel is:  Kravnik's Sporting Goods  The van slows, almost coasting, then abruptly bursts past Grady's house and disappears around the corner. GRADY frowns, then realizes a MAN'S VOICE is coming from the RECEIVER in his lap.   Walter?   It's Grady, Walter.   GRADY Tripp. English Department.    I have ...eight-fifteen. That's not right, is it?   This is important.    I'm in love with your wife.   Sara. I'm in love with her.  Silence. Then Walter's VOICE returns: even, administrative.   No.    A CAR rattles down the street, NEWSPAPERS pinwheeling from-the window.    A heavy THHNK hits the driveway outside and GRADY blinks. Sitting in his pink robe, bleary-eyed, he reconsiders the piece of paper curling from his typewriter.  GRADY'S POV - of THE PAGE  It's obvious he's been sitting like this for some time. Just then, the DISTINCTIVE PURR of an ENGINE is HEARD. GRADY peers through the window, watches a CAB. glide to the curb below. A Citroen DS23. Sara.    GRADY steps onto the porch, unintentionally punting a BOTTLE of Iron City Beer onto the front lawn..   Sara.   Oh?    I'm sorry, Sara. I've been trying to tell you. It's all my-  Sara raises her hand, silencing him.   Inside.   Over there. In the backseat of the...  Grady's hand hangs in mid-air, gesturing pointlessly to the driveway, where the only thing that exists is an oil stain roughly the shape of North Dakota.   Someone stole my car.   Honestly. Someone stole my car. I parked it right there last night.   Of course, I'm sure.  Ah, Christ, the puberty police are back.  Sara turns, sees Officer Pupcik cruising to the curb.    Is he awake?   Nevertheless. There's a police officer standing on the porch and I don't think he's going away.   Thank you, Frankie and Annette.  James swings his pale little legs to the floor and walks bare assed across the room to retrieve his BVDs.   And we both thank you for that, but we're... we're... fine.   Shut up, James.    There is no problem. Did I say there was a problem?  As James' head pops through Grady's fully-buttoned flannel, he and CRABTREE exchange a knowing glance, at once referring to and excluding Grady.   Who do you think it is?   Evidently.  Coming!   It's Walter's dog and yes, she does. Know. But let's spare her the details. Come on, your shoes are in the hail.   Great. Between you and Officer Pupcik out there he can be the next Jean Genet. It's been awhile since somebody wrote a good book in jail.    Sara and GRADY stand by as Pete Pupcik deposits James in the back of the squad car, SLAMS the door.   Don't worry, James, I'll figure something out.   I'm a little worried, James.   Well, let's see if we can keep that from happening.  James nods and GRADY starts to step back from the car.   Yes, James.   Would Walter really press charges?   I think I might have.   I think I might've said I was in love with you.  Sara's face remains .unchanged.   He told you.   And what did you say?   Find the jacket.   First I see if Hannah will let me borrow her car.   Hey, Jeff. If you're really interested in discussing that business with the tango, try the guy at the end of the hall.  Jeff nods--puzzled--then goes. GRADY smirks.   He cribbed that from Borges.   Right. Anyway, I was wondering if I could borrow your car. Mine's sort of out of commission.   That good, hub?    Hh huh. Well, thanks for the thought, but, as shocking as this may sound, I'm not the first writer to sip a little weed. And furthermore, it might interest you to know that one book I wrote, as you say, 'under the influence, ' happened to win a little something called the PEN award which, by the way, I accepted 'under the influence. '  Hannah nods, averts her eyes, and immediately GRADY feels ridiculous. He starts to say something, but instead gathers his manuscript and exits.    Don't touch it.   Only now I'm starting to think the car wasn't exactly Jerry's to give.   My guess-Vernon Hardapple.   He said a few things that lead me to believe the car's his.   'That's my car, motherfucker.'   ...we find the jacket.   No wonder he screwed us over.   Call it a hunch.  Parked in front of KRAVNIK'S SPORTING GOODS is the white van. A few feet behind, the battered Galaxie.   It's good to know I'm still talented at something. Keep the motor running.   Oola.   I never forget an Oola.  Suddenly, there is a HEAVY CLICK.   Vernon.   Who's got a gun?   Relax, Vernon...   Not true. You're the only Vernon I know. Actually, I'm wrong. I once knew a Vernon Peabody at Penguin U.K.   It's just a souvenir. They don't even make the caps anymore.   No, really....  GRADY lifts his arm, points the little pearl-handled pistol to the DARK CLOUDS overhead.   A Manhattan book editor murdering a Mormon girl's clutch.  The car bucks crazily, picks up speed, and Crabtree-- swiping aside a flutter of MANUSCRIPT PAGES that have taken flight inside the car--begins to veer right toward Grady, Vernon, and Oola.   No! Don't shoot! He's just a lousy driver.  CRABTREE fans the wheel wildly, goes into a slide and the passenger door snaps wide, releasing what looks to be a FLOCK OF WHITE DOVES into the wind-whipped sky.  Only, these ain't birds.   - ^   Oh... my... God!  These are PAGES. Seven years of-pages.  CRABTREE goes into another slide, one-hops the curb, and smashes flat into the weathered GLOVE of BILL MAZEROSKI painted on the front wail of KRAVNIK'S SPORTING GOODS.  As Hannah Green's RADIATOR EXPLODES, CRABTREE steps free of the car and looks skyward. It's a ticker-tape parade ail the way down the street, ending in the frigid waters of the Ohio River.    I take it back.  Shoot him.   I have an alternate version of the first chapter.   That was MacCaulay.   He was never able to reproduce them.   Kind of a sign, you're saying.   I don't think so. In my experience, signs are usually a lot more subtle.   'Fraid so.   Ail right, all right It's done. There's no need to talk about it. It's done.  They ride in silence for a moment, then Oola turns, glances at GRADY and his little sheaf of pages.   I don't know...  Oola's brow wrinkles. CRABTREE glances at his old friend, genuine compassion in his eyes.   I couldn't stop.   Hey, Vernon. Can I ask you a question?   Boy or girl?   Right. Well, thanks. For the lift.   Sure.   Oh, right. Oola. About that jacket...   It used to belong to Marilyn Monroe. She had small shoulders, like you. Most people don't know that.  As Oola smiles, pleased, Vernon shakes his head.   Came to my senses. CRABTREE  Ah. Well. Congratulations. Meanwhile, what is James supposed to do? Pray for Walter Gaskell to come to his?   Walter Gaskell isn't going to send James Leer to jail, Crabs. I know that.   No. But I don't think that matters.   Nobody teaches a writer anything. You tell them what you know. You tell them to find their voice and stick with it, because that's all you have in the end. You tell the ones who have it to keep at it and you tell the ones who don't to keep at it, too. Because that's the only way to get where you're going.  Of course, it helps if you know where you want to go.  Maybe that's the only thing--that and Sara-- that's made the last seven years worthwhile.  GRADY slides James' knapsack off his shoulder, smiles cryptically as he considers it. -   As for James, he doesn't need me anymore...  Without warning, GRADY tosses CRABTREE the knapsack.   He's got you.  CRABTREE stares at the saggy green canvas in his hands, watches GRADY walk away.   Gee, I don't know, Crabs...  Improvise. You're good at that.  GRADY continues on, leaving CRABTREE to stand alone, as he walks toward the buildings in the distance.   You peeked, didn't you?   You're not just trying to make me feel better?  CRABTREE looks directly at Grady, his old friend.   Well, thanks for that, Crabs.    GRADY surveys the room. Empty chairs. Empty desks.  He walks to a WINDOW, the same window he stood at two afternoons ago when reading James Leer's story. A chill breeze pitches the fabric of his shirt as he studies the barren benches and icy walkways of the quad. Finally, he-. turns away, settles behind his desk and, reaching into his pocket, removes the seven remaining pages of his manuscript. He considers them, then folds them in half length-wise. He continues, folding the top right corner down into a triangle along the first crease...   Sara!  Sara turns ...as the door glides shut. As GRADY hustles forward, Q, wine glass in hand, intercepts him.    Thanks, Q. I felt the same way about the bank teller's breasts in your last one.   No...  But GRADY looks anyway. Hannah sits a dozen rows down the aisle, hair pulled back in a clip, glorious skin gloaming. The Goatee Kid sits close beside her.   Jeff. He comes from a long line of tango dancers.   Take a bow, James!  James turns, spots GRADY in the back row, then-a sheepish grin on his face--spreads his arms, hangs his head, and takes his first sweet public bow.    Wonder Boy.   Sara!  Its empty. Quiet. GRADY pauses. Somewhere, a HEAVY METAL DOOR CLOSES. GRADY rushes on.   Yo, Traxler.   Do you get high, Sam?   As a heart attack.   Looking for you.  He wants to say more, he opens his mouth, but then... ALL  I passed out.   I've been doing that a lot lately.   Do you think that's why I've been having these...   ... spells?   The last month maybe.   Spiro T. Agnew was vice president, I believe.   I've been trying to finish a book...   Is that in my chart?   I know.   She told you about. . .   Actually, it was her husband's dog...  Greenhut glances up, looking GRADY in the eyes for the first time, and GRADY stops.   They're anxiety attacks? That's a little disappointing.   So is my friend...is Sara still here?   I have to see her. As soon as possible.  Greenhut studies Grady, calibrating the desperation in his eyes, then takes a quick glance at his watch.   I wonder if you could show me something.   Are these the only ones you have?  The nurse's eyes crinkle.   Kidding...    Is that a suggestion?  GRADY sits, blinking the snow out of his eyes, then TWO SHAFTS of-LIGHT dance across his shoes. A white Citroen DS23 appears.  It passes.  Slows.  Stops.  GRADY stares at the car, burbling at the curb, then lifts himself up and makes his way to the driver's window. Sara makes a face, bugging her eyes a little-mad at him, but- not without humor. Then she rolls down the window.   I'm so glad to see you, Sara.   I'm through improvising.   I lost it ail.   I know.   Ouch. How many?   I went and looked at-some babies just now.    I guess you have to go on faith.   Did you tell Walter?   Does he still love you?   Well I do. I've always loved you, Sara. I didn't know it at the time, but I'd always been waiting for you. My whole life. Because you're who I need. Because nothing makes sense without you. Because the best moment of every day is the moment I first see your face. And because when you leave a room, there's no reason to be in it any more. It's just a room again.  Sara cocks her head.    In the hospital. I \"was kind of excited about it at-the time, but then I was on pretty heavy painkillers.  She frowns good-naturedly.   Even so...it's still true. Every word.  Sara just nods, looks away, her face unreadable.   Sara, I promise, even though commonsense might tell you...  Sara turns, puts a finger on GRADY's lips...   You don't deserve me, you know.",
        "Tripp": "",
        "James": "Turn out the light, please.  GRADY pauses, studying the wan figure sitting at the back of the classroom, then--reluctantly-hits the switch on the wail, leaving James Leer alone in the DARK.   It's fake.  James' face betrays his own fragile chagrin and GRADY peers more closely at what lies in his extended hand. The sliver of moonlight is, in fact, a shiny PEARL-HANDLED  It was my mother's. She won it in a penny arcade in Baltimore when she was in Catholic school.   It used to shoot these little paper caps, but they don't make them anymore. The caps.  GRADY reaches for the gun, but James closes his fingers and slips the tiny thing back into his overcoat.   It's just. ..for good luck. Some people carry rabbits' feet...   No, thank you. I don't like to lose control of my emotions.  GRADY nods, accustomed to James' weirdness.   I'm not supposed to be here, in case you were wondering. I crashed. I mean, not intentionally...  James nods toward the house, where Hannah Green can be seen in a window, still fending off the determined Q.   ...but the other night, Hannah and I were together, at the movies, and she asked me. Since she was coming. So I ended up coming. Too.  GRADY nods, ponders this over-elaborate explanation.   No! What gave you that idea?   She likes old movies like I do, that's ail.  Besides, she doesn't really know me. She thinks she does, but she doesn't. Maybe it's because she's Mormon and I'm Catholic.   You're not like my other teachers, Professor Tripp.   Huh? Oh. Son or Fury. With Tyrone Power and Frances Farmer.   So did Gene Tierney. She's in it too.    It's not bad.  GRADY considers James' fragile face.   They really hated it. I think they hated it more than any of the other ones.   It doesn't matter. It only took me an hour to write.   I have trouble sleeping. While I'm lying in bed I figure them out. The stories.  As James gazes off at the gloaming greenhouse, GRADY looks down at the left front POCKET of James' overcoat. Like a nervous tic, James' hand- hidden-twitches against the modest bulk of the cap gun.    A little.   It's colder in there. -   Actually, I saw the greenhouse. So I thought ...I thought I'd come out here and take a look at it. You don't see one of those every day. It looks like heaven...   I saw a movie once. Part of it took place in heaven. Everyone wore white and lived in crystal houses. Like that. At least that's the way I remember it...  Abruptly, James glances at his watch.   I should be going.  James turns away, then stops. He stands like this a moment, then turns back. Holds out his right hand.   Goodbye, Professor Tripp.  GRADY hesitates, then shakes James' hand. James moves off then, leaving the light of the house behind.   I'll miss my bus.   No, I'm going ho--   George Sanders?   Pills. August 25, 1972. In a Costa Brava hotel room.  The few people within earshot glance oddly at James, but Crabtree's eyes glitter with intrigue.   There's so many...   Pier Angeli, 1971 or '72, also pills. Charles Boyer, 1978, pills again. Charles Butterworth, 1946, I think. In a car. Supposedly it was an accident, but, you know. . .  He was distraught. Dorothy Dandridge, she took pills in, like, 1965. Albert Dekker, 1968, he hung himself. He wrote his suicide note in lipstick on his stomach. Alan Ladd, '64, more pills, Carole Landis, pills again, I forget when. George Reeves, Superman on TV, shot himself. Jean Seberg/ pills of course, 1979. Everett Sioane-- he was good--pills. Margaret Sullavan, pills, Lupe Velez, a lot of pills. Gig Young. He shot himself and his wife in 1978. There are more but I don't know if you would have heard of them. Ross Alexander? Clara Blandick? Maggie McNamara? Gia Scaia?   That's just how my brain works, I guess.   Actually. ..I just want to go home.   Is that really it?   The one she wore on her wedding day?   Really?   They're glass. The buttons.   She was small. Most people don't know that. The shoulders are small.  It looks so perfect. I bet it's the only time she wore it. That day. She must've felt so ...happy.  GRADY studies James as he takes the fringe of the jacket, lifts it lightly.   It's feels unreal, like butterfly wings or... something. It must've cost Dr. Gaskell a lot.   You're really good friends with the Chancellor, aren't you?  Grady's eyes slide, paranoid, but James' face remains unchanged, consumed with the jacket.   I guess you must be, if you know the combination to his closet and he doesn't mind your being here in their bedroom like this.   I'm sorry. Professor Tripp. Maybe it's seeing that jacket that belonged to her. It just looks...really lonely. Hanging there. In a closet. Maybe I'm just a little sad.   You mean, with your wife leaving you and ail?  Hannah mentioned something about it.   About a note.   I had to. Didn't I?   No! He was crazy. I didn't-he looked-- 1 thought --   Do you have a mirror? It's the best way to see if someone's breathing.   What are we going to do?  GRADY rises awkwardly, holds out his hand.   Professor Tripp? Can I  ask you a question?   What are we going to do with...  James glances in the backseat, where Poe lies, strange blue eyes gleaming.   You?   Does she want to hear it was one of her professors?   He's still a little warm.  They lay him down, push him deep into the trunk--until there is a SOUND like a pencil SNAPPING.   Yuck.  GRADY grabs Crabtree's garment bag, frisks the pockets.   That's a. big trunk. It fits a tuba, a suitcase, a dead dog, and a garment bag almost perfectly.   Whose tuba is that anyway?   Can I ask you something about her?   Oh. So. Is--is your friend Crabtree-- is he-- gay?   No thanks. I'm fine without them.   Woah! The doors made so much noise!  As they make for the restrooms, Sara and GRADY appear.   This is so embarrassing! You guys had to carry me out.   We're going to the men's room. Only we might not make it in time.    .. .he was killed, when a gangster named Freddie Nostrils tried to shoot his favorite horse. He took the bullet himself.  GRADY and Crabtree turn to look at James Leer, who opens one bloodshot eye to regard them.   Vernon, over there, was in on the hit.  James' eye closes. CRABTREE looks over at Grady.   Mmhmmm.. . . knap ...sap....    Mmrrmmm.. .KNAP SAP!  GRADY frowns in annoyance, opens the passenger door.    Thank you.   I put you on the floor.   I thought you might--l don't know-- swallow your tongue or something.  I guess you really miss her, huh?  GRADY peers down at the geraniums blooming on the pockets of the robe, its overall fuzziness.   I guess there's probably a story behind that.   Want me to get that?    He didn't give his name.   The guy on the phone.   He wanted to know if a GRADY Trip? lived here and drove a dark maroon 1966 Ford Galaxie 500 with black interior.   Yes.   I thought maybe you'd won a radio contest or something. Is that single-spaced?  James has noticed the towering stack of 20 Ib. bond on Grady's desk.   That's a big book you're writing.   Wow, Hannah always swore you were working, but--   Nothing, it's just that,, well, it's been awhile since Arsonist's Daughter, and some people--some of the kids in workshop--thought maybe you were...   Blocked.   No kidding.  A LOUD HACKING is HEARD. GRADY and James turn, watch Crabtree, wearing only a pair of striped boxers, materialize in the hallway.   Professor Tripp?   How did I get here last night?   And ...and before that. Did I do anything? Anything bad?   What do we do now?  #####Before GRADY can reply, .the TELEPHONE sitting on the table next to him   How's that?   You're bleeding. Professor Tripp.   I got kicked out. Well, not exactly kicked out. I was asked to leave.   There is, but it's not that interesting.    The bus station.  GRADY stares incredulously at James.   It's not -so bad. I know the night janitor. And there's a broken locker I can put my stuff.   A couple weeks. That's why... that's why I had the gun. For protection.   Who?   Nice.    Isn't this...?   I can't help myself. I don't know what's the matter with me.   She seemed to take it pretty well.    No.  GRADY looks over, surprised by the James' tone. James blinks, looks embarrassed.   I mean. I'm fine. I'm sorry. I just...  James peers out the window at passing landscape.   I've got a thing about, ..places like this. I know what those houses are like. I know what the people are like.   Humboldt County?   It's my father. He gets it from his doctor.   Colon cancer.   It's a bit of a scandal. My parents live in a small town.   Carvel.   Outside Scranton.   It's a hellhole. Three motels and a mannequin factory. My dad worked there for thirty-five years.   Seitz Plastics. That's where he met my morn. She was a fry cook in the cafeteria. Before that, she'd been a dancer.   Whatever kind they wanted her to be.   I'm telling you what I was told by my uncle. And he should know. He ran half a dozen men's clubs in Baltimore before he skipped town on a bad debt.   When we fall, we fall hard.   Maybe I just needed the moment to present itself.   This is so nice. It's like where Andy Hardy would live. What's it called again?   Kinship. And what's here?   The one that left you?   Someone jumped on your car with their butt ..-   You can see the outline of a butt.  As GRADY nods, James holds out the donut box.   Want one. They're incredible. Incredible.   Maybe she didn't come here.   It's not that. It just reminded me of-- you know-of what's in the car. In the trunk.   It feels really... good. ..here.   Hullo.  FOOTSTEPS are HEARD on the staircase and GRADY hobbies into view. He tries a smile.   I'm having a really good time, Professor Tripp.  GRADY glances over, sees James burrowing into the Ziploc.   I just wanted a little sip.   Probably about the time you gave me the codeine pills last night.  GRADY stops with the heater, glances over at James, whose face bears not the slightest trace of irony.   You're mad at me, aren't you?   You're mad because I shot your girlfriend's dog.   Sure you do. You were thinking: 'That's no cap gun in that kid's overcoat.' You were thinking 'I can't let that kid get on. the bus alone-he might never get on the bus again.' You were thinking: 'I've got to find a way to distract this kid. ' So you did. It was--in its way--a noble act.   So, why did you take me up there?   It's warm.   Because of my coat?    Jealous? Of me?   You're lying.   Yes you are. My stuff stinks. I know it. You said so yourself.   Yes you did. Last night. To your friend Crabtree. \"Is he any good?\" he said. And you said: \"Not yet he isn't.\" I heard you myself.   It's okay, Professor Tripp. Carrie, Howard, the others--they 're right. My stories are annoying. They go on and on and on, and the longer they go on the more annoying they become, until finally you just want to grab something heavy and--   But, last night...    I'm sorry.   Arsonist's Daughter meant something.  GRADY smiles contemptuously.   I mean it. It means something to me. It's one of the reasons I came to school here. To be in your class. To be taught by you.  It's one of the reasons I wanted to become a writer.  GRADY stares ahead, watching the darkness tumble away before the wide sweep of the Galaxie's headlights.   You coming?   Want a bite?   That's why you're having them. Your spells.   What would you call them then?   It's because you don't eat.   When?    I just worry about you, that's all.  ...then pass. James' words finally register. GRADY looks at him.   Okay.  Just then, a long, pale WAND of LIGHT splinters against the coffee shop windows and a CAR sweeps into the parking lot. GRADY follows it with his eyes, rises.   Where you going?   I'm not going with them..   I'm not going, with them.   Parents? They're not my parents. They're my grandparents. My parents are dead.  GRADY stares at-James wearily.   I swear. My father had his own airplane he used to fly up to Quebec. One Christmas, he and my mom were flying up to our house in the Laurentians when the plane went down. It was in the newspaper.  GRADY doesn't flinch, unpersuaded.   I 'swear. My father was a senior vice president at Dravo. My mother was a socialite. Her maiden name was Guggenheim.  GRADY starts to protest, then pauses.   Six. Their plane went down right outside Scranton.   I'm sorry about all that. I just-I don't like to talk about my family. They treat me like a freak.   She makes me sleep in. the basement of my own house. It's mine. My parents left it to me.  GRADY glances toward the parking lot, studies the contours of Fred Leer's face. Frowns.   There's a reason for that.  Grady's addled brain grapples with this dark little riddle, finally deciphers what James is suggesting.   That's why she hates me. That's why she makes me sleep in the basement.   I swear.   Hey. What are you guys doing here?    Electric CANDELABRAS light a large converted cellar whose walls are crowded with MOVIE POSTERS and LOBBY CARDS. There are STACKS of what look suspiciously like LIBRARY BOOKS and an enormous BAROQUE BED, complete with CANOPY.   The candelabras were my Gran's.   Can I--I mean--do you mind--if I wear this again. Professor Tripp?   I'm ready...  James stops, sees the two men looking at him.   You all right, Professor Tripp?   Oh, well, that's just it. She's been coming down here, every half hour or so, to, sort of, check on me. If I'm not here, she might ...call the police or.. .something.    Yeah. Like in Against All Flags. Only they use a couple big hams.    GRADY strategically arranges the coverlet, gently adjusting Poe's head so only a TUFT of FUR shows. He steps back, joining CRABTREE and James for an assessment.    That same guy?  CRABTREE peels back the blankets and James Leer opens one eye.   You snore.    No offense, Professor Tripp, but you look sorta crappy.   It's the Chancellor.   I'm fine, right. Fit as a fucking fiddle.  GRADY squints at James as he pulls on his pants.   Does she mean--does she know about ...her dog?   Thank you.   I'm not worried. You're not worried, are you. Professor Tripp?   Don't be. I don't care if they expel me. I probably should be expelled.   Professor Tripp...?   Even if I end up going to jail....  James smiles his crooked grin.   You're still the best teacher I ever had.  On this,  Pete Pupcik pulls away, leaving GRADY standing on the curb, watching the back of James' head, framed in the rear  window of the police car, growing smaller.",
        "Leer": "Turn out the light, please.  GRADY pauses, studying the wan figure sitting at the back of the classroom, then--reluctantly-hits the switch on the wail, leaving James Leer alone in the DARK.   It's fake.  James' face betrays his own fragile chagrin and GRADY peers more closely at what lies in his extended hand. The sliver of moonlight is, in fact, a shiny PEARL-HANDLED  It was my mother's. She won it in a penny arcade in Baltimore when she was in Catholic school.   It used to shoot these little paper caps, but they don't make them anymore. The caps.  GRADY reaches for the gun, but James closes his fingers and slips the tiny thing back into his overcoat.   It's just. ..for good luck. Some people carry rabbits' feet...   No, thank you. I don't like to lose control of my emotions.  GRADY nods, accustomed to James' weirdness.   I'm not supposed to be here, in case you were wondering. I crashed. I mean, not intentionally...  James nods toward the house, where Hannah Green can be seen in a window, still fending off the determined Q.   ...but the other night, Hannah and I were together, at the movies, and she asked me. Since she was coming. So I ended up coming. Too.  GRADY nods, ponders this over-elaborate explanation.   No! What gave you that idea?   She likes old movies like I do, that's ail.  Besides, she doesn't really know me. She thinks she does, but she doesn't. Maybe it's because she's Mormon and I'm Catholic.   You're not like my other teachers, Professor Tripp.   Huh? Oh. Son or Fury. With Tyrone Power and Frances Farmer.   So did Gene Tierney. She's in it too.    It's not bad.  GRADY considers James' fragile face.   They really hated it. I think they hated it more than any of the other ones.   It doesn't matter. It only took me an hour to write.   I have trouble sleeping. While I'm lying in bed I figure them out. The stories.  As James gazes off at the gloaming greenhouse, GRADY looks down at the left front POCKET of James' overcoat. Like a nervous tic, James' hand- hidden-twitches against the modest bulk of the cap gun.    A little.   It's colder in there. -   Actually, I saw the greenhouse. So I thought ...I thought I'd come out here and take a look at it. You don't see one of those every day. It looks like heaven...   I saw a movie once. Part of it took place in heaven. Everyone wore white and lived in crystal houses. Like that. At least that's the way I remember it...  Abruptly, James glances at his watch.   I should be going.  James turns away, then stops. He stands like this a moment, then turns back. Holds out his right hand.   Goodbye, Professor Tripp.  GRADY hesitates, then shakes James' hand. James moves off then, leaving the light of the house behind.   I'll miss my bus.   No, I'm going ho--   George Sanders?   Pills. August 25, 1972. In a Costa Brava hotel room.  The few people within earshot glance oddly at James, but Crabtree's eyes glitter with intrigue.   There's so many...   Pier Angeli, 1971 or '72, also pills. Charles Boyer, 1978, pills again. Charles Butterworth, 1946, I think. In a car. Supposedly it was an accident, but, you know. . .  He was distraught. Dorothy Dandridge, she took pills in, like, 1965. Albert Dekker, 1968, he hung himself. He wrote his suicide note in lipstick on his stomach. Alan Ladd, '64, more pills, Carole Landis, pills again, I forget when. George Reeves, Superman on TV, shot himself. Jean Seberg/ pills of course, 1979. Everett Sioane-- he was good--pills. Margaret Sullavan, pills, Lupe Velez, a lot of pills. Gig Young. He shot himself and his wife in 1978. There are more but I don't know if you would have heard of them. Ross Alexander? Clara Blandick? Maggie McNamara? Gia Scaia?   That's just how my brain works, I guess.   Actually. ..I just want to go home.   Is that really it?   The one she wore on her wedding day?   Really?   They're glass. The buttons.   She was small. Most people don't know that. The shoulders are small.  It looks so perfect. I bet it's the only time she wore it. That day. She must've felt so ...happy.  GRADY studies James as he takes the fringe of the jacket, lifts it lightly.   It's feels unreal, like butterfly wings or... something. It must've cost Dr. Gaskell a lot.   You're really good friends with the Chancellor, aren't you?  Grady's eyes slide, paranoid, but James' face remains unchanged, consumed with the jacket.   I guess you must be, if you know the combination to his closet and he doesn't mind your being here in their bedroom like this.   I'm sorry. Professor Tripp. Maybe it's seeing that jacket that belonged to her. It just looks...really lonely. Hanging there. In a closet. Maybe I'm just a little sad.   You mean, with your wife leaving you and ail?  Hannah mentioned something about it.   About a note.   I had to. Didn't I?   No! He was crazy. I didn't-he looked-- 1 thought --   Do you have a mirror? It's the best way to see if someone's breathing.   What are we going to do?  GRADY rises awkwardly, holds out his hand.   Professor Tripp? Can I  ask you a question?   What are we going to do with...  James glances in the backseat, where Poe lies, strange blue eyes gleaming.   You?   Does she want to hear it was one of her professors?   He's still a little warm.  They lay him down, push him deep into the trunk--until there is a SOUND like a pencil SNAPPING.   Yuck.  GRADY grabs Crabtree's garment bag, frisks the pockets.   That's a. big trunk. It fits a tuba, a suitcase, a dead dog, and a garment bag almost perfectly.   Whose tuba is that anyway?   Can I ask you something about her?   Oh. So. Is--is your friend Crabtree-- is he-- gay?   No thanks. I'm fine without them.   Woah! The doors made so much noise!  As they make for the restrooms, Sara and GRADY appear.   This is so embarrassing! You guys had to carry me out.   We're going to the men's room. Only we might not make it in time.    .. .he was killed, when a gangster named Freddie Nostrils tried to shoot his favorite horse. He took the bullet himself.  GRADY and Crabtree turn to look at James Leer, who opens one bloodshot eye to regard them.   Vernon, over there, was in on the hit.  James' eye closes. CRABTREE looks over at Grady.   Mmhmmm.. . . knap ...sap....    Mmrrmmm.. .KNAP SAP!  GRADY frowns in annoyance, opens the passenger door.    Thank you.   I put you on the floor.   I thought you might--l don't know-- swallow your tongue or something.  I guess you really miss her, huh?  GRADY peers down at the geraniums blooming on the pockets of the robe, its overall fuzziness.   I guess there's probably a story behind that.   Want me to get that?    He didn't give his name.   The guy on the phone.   He wanted to know if a GRADY Trip? lived here and drove a dark maroon 1966 Ford Galaxie 500 with black interior.   Yes.   I thought maybe you'd won a radio contest or something. Is that single-spaced?  James has noticed the towering stack of 20 Ib. bond on Grady's desk.   That's a big book you're writing.   Wow, Hannah always swore you were working, but--   Nothing, it's just that,, well, it's been awhile since Arsonist's Daughter, and some people--some of the kids in workshop--thought maybe you were...   Blocked.   No kidding.  A LOUD HACKING is HEARD. GRADY and James turn, watch Crabtree, wearing only a pair of striped boxers, materialize in the hallway.   Professor Tripp?   How did I get here last night?   And ...and before that. Did I do anything? Anything bad?   What do we do now?  #####Before GRADY can reply, .the TELEPHONE sitting on the table next to him   How's that?   You're bleeding. Professor Tripp.   I got kicked out. Well, not exactly kicked out. I was asked to leave.   There is, but it's not that interesting.    The bus station.  GRADY stares incredulously at James.   It's not -so bad. I know the night janitor. And there's a broken locker I can put my stuff.   A couple weeks. That's why... that's why I had the gun. For protection.   Who?   Nice.    Isn't this...?   I can't help myself. I don't know what's the matter with me.   She seemed to take it pretty well.    No.  GRADY looks over, surprised by the James' tone. James blinks, looks embarrassed.   I mean. I'm fine. I'm sorry. I just...  James peers out the window at passing landscape.   I've got a thing about, ..places like this. I know what those houses are like. I know what the people are like.   Humboldt County?   It's my father. He gets it from his doctor.   Colon cancer.   It's a bit of a scandal. My parents live in a small town.   Carvel.   Outside Scranton.   It's a hellhole. Three motels and a mannequin factory. My dad worked there for thirty-five years.   Seitz Plastics. That's where he met my morn. She was a fry cook in the cafeteria. Before that, she'd been a dancer.   Whatever kind they wanted her to be.   I'm telling you what I was told by my uncle. And he should know. He ran half a dozen men's clubs in Baltimore before he skipped town on a bad debt.   When we fall, we fall hard.   Maybe I just needed the moment to present itself.   This is so nice. It's like where Andy Hardy would live. What's it called again?   Kinship. And what's here?   The one that left you?   Someone jumped on your car with their butt ..-   You can see the outline of a butt.  As GRADY nods, James holds out the donut box.   Want one. They're incredible. Incredible.   Maybe she didn't come here.   It's not that. It just reminded me of-- you know-of what's in the car. In the trunk.   It feels really... good. ..here.   Hullo.  FOOTSTEPS are HEARD on the staircase and GRADY hobbies into view. He tries a smile.   I'm having a really good time, Professor Tripp.  GRADY glances over, sees James burrowing into the Ziploc.   I just wanted a little sip.   Probably about the time you gave me the codeine pills last night.  GRADY stops with the heater, glances over at James, whose face bears not the slightest trace of irony.   You're mad at me, aren't you?   You're mad because I shot your girlfriend's dog.   Sure you do. You were thinking: 'That's no cap gun in that kid's overcoat.' You were thinking 'I can't let that kid get on. the bus alone-he might never get on the bus again.' You were thinking: 'I've got to find a way to distract this kid. ' So you did. It was--in its way--a noble act.   So, why did you take me up there?   It's warm.   Because of my coat?    Jealous? Of me?   You're lying.   Yes you are. My stuff stinks. I know it. You said so yourself.   Yes you did. Last night. To your friend Crabtree. \"Is he any good?\" he said. And you said: \"Not yet he isn't.\" I heard you myself.   It's okay, Professor Tripp. Carrie, Howard, the others--they 're right. My stories are annoying. They go on and on and on, and the longer they go on the more annoying they become, until finally you just want to grab something heavy and--   But, last night...    I'm sorry.   Arsonist's Daughter meant something.  GRADY smiles contemptuously.   I mean it. It means something to me. It's one of the reasons I came to school here. To be in your class. To be taught by you.  It's one of the reasons I wanted to become a writer.  GRADY stares ahead, watching the darkness tumble away before the wide sweep of the Galaxie's headlights.   You coming?   Want a bite?   That's why you're having them. Your spells.   What would you call them then?   It's because you don't eat.   When?    I just worry about you, that's all.  ...then pass. James' words finally register. GRADY looks at him.   Okay.  Just then, a long, pale WAND of LIGHT splinters against the coffee shop windows and a CAR sweeps into the parking lot. GRADY follows it with his eyes, rises.   Where you going?   Hardly.   We were on our way to a benefit. But, as luck would have it, the club was on the way, so...  We were able to put in an appearance.   Otherwise we would've been here earlier.   Well, certainly we'll reimburse you.   Well, of course, we can understand that.  GRADY considers the two glittering ghosts before him. They seem to be waiting. Just waiting.   Excuse me?   I'm not going with them..   I'm not going, with them.   Parents? They're not my parents. They're my grandparents. My parents are dead.  GRADY stares at-James wearily.   I swear. My father had his own airplane he used to fly up to Quebec. One Christmas, he and my mom were flying up to our house in the Laurentians when the plane went down. It was in the newspaper.  GRADY doesn't flinch, unpersuaded.   I 'swear. My father was a senior vice president at Dravo. My mother was a socialite. Her maiden name was Guggenheim.  GRADY starts to protest, then pauses.   Six. Their plane went down right outside Scranton.   I'm sorry about all that. I just-I don't like to talk about my family. They treat me like a freak.   She makes me sleep in. the basement of my own house. It's mine. My parents left it to me.  GRADY glances toward the parking lot, studies the contours of Fred Leer's face. Frowns.   There's a reason for that.  Grady's addled brain grapples with this dark little riddle, finally deciphers what James is suggesting.   That's why she hates me. That's why she makes me sleep in the basement.   I swear.   Thank you. Professor Tripp.   Oh, don't worry. We'll take care of him. You can be sure of that.  Fred Leer hits the gas and swings the Mercedes around in a tight little arc, feathering Grady's pants--from the knee down--with a pudding of ICE and MUD. GRADY glances down at his spattered self, then notices, sitting on the front passenger seat, James' knapsack. GRADY grabs it, turns.    Grady--limping like an aging prizefighter--leads CRABTREE up a steep incline toward an enormous three-story house. The Leer's Mercedes gleams in the shadows.    LIGHT GLOWS from a low BASEMENT WINDOW. From one side, a WOMAN is HEARD SINGING. GRADY and CRABTREE pause, listen.   Hey. What are you guys doing here?   The candelabras were my Gran's.   Can I--I mean--do you mind--if I wear this again. Professor Tripp?   I'm ready...  James stops, sees the two men looking at him.   You all right, Professor Tripp?   Oh, well, that's just it. She's been coming down here, every half hour or so, to, sort of, check on me. If I'm not here, she might ...call the police or.. .something.    Yeah. Like in Against All Flags. Only they use a couple big hams.    That same guy?  CRABTREE peels back the blankets and James Leer opens one eye.   You snore.    No offense, Professor Tripp, but you look sorta crappy.   It's the Chancellor.   I'm fine, right. Fit as a fucking fiddle.  GRADY squints at James as he pulls on his pants.   Does she mean--does she know about ...her dog?   Thank you.   I'm not worried. You're not worried, are you. Professor Tripp?   Don't be. I don't care if they expel me. I probably should be expelled.   Professor Tripp...?   Even if I end up going to jail....  James smiles his crooked grin.   You're still the best teacher I ever had.  On this,  Pete Pupcik pulls away, leaving GRADY standing on the curb, watching the back of James' head, framed in the rear  window of the police car, growing smaller.",
        "Q": "And while my latest has been on the New York Times bestseller list for 40 weeks, I can't help but lament that my first book, which contains what I consider my finest writing, was remaindered in less than five. So, I find myself conflicted.   Hello.. .Professor.   Good evening.  GRADY stares, over the gleaming sea of heads before him, watching as Q pauses, ..for a very long moment... waiting until the auditorium is consumed in a heavy, anticipatory hush. Finally, he speaks again.   I am a writer.  As the audience EXPLODES with glee, GRADY frowns. He glances to his right, sees James' left brow crinkled with a similar look of bafflement.   As a writer, one thing you learn is that everyone you encounter has a story. Every bartender, every taxi driver, everybody has an idea or a. story that would make a \"great book\" or a \"great movie.\" Presumably, each of you has an idea. But, how do you go from there to here? How do you go from having an idea to having a book? How do you get across? What is the bridge, the bridge that allows you to walk on air from the shoreline of inspiration to the terra firma of accomplishment? Faith. Faith that your story is worth the telling, faith that you have the wherewithal to tell it, faith that the carefully woven structure you create won't collapse beneath you...  GRADY glances at James, sees that his eyes are unblinking and glazed, then sees, beyond him, Sara standing by the far EXIT. A blink later, she is gone.   ...and faith that when you get to the other side someone will be waiting who gives a damn about the tale you have to tell.  GRADY leans back, listening to the BEATING of his own HEART, the soft GLIMMER of the chandeliers hanging by a thread forty feet above his head...  Abruptly, James LAUGHS OUT LOUD--some private amusement: bubbling up from the bottom or his brain and out into the auditorium. As Q looks and four hundred other heads turn, James ducks down--mortified. Crabtree, sitting a few rows away, studies James with amusement, then winks at Grady.  GRADY blinks, turns to James.    Oh my God! What is that?  It's Vernon, waving his arms, his shadow enormous in the beams of light.    You could always go over him.  Then, as the three men watch, Vernon rocks back on his heels and--with a gymnast's precision-pitches himself onto the Galaxie's big hood. He -lands on his ass, slides smoothly off, then takes a deep bow and disappears into the night.   What just happened?  GRADY peers at the wrinkled asterisk on his hood.    GRADY sits in-the GREEN GLOW of .the radio dial, smoking a joint. He glances at the knapsack, sees James'   A moment. Then-from the third floor window-a PAPER AIRPLANE glides into view, soaring then dropping, soaring then dropping, again and again, graceful as a dove.   Grady. I have to tell you. I took another look at Arsonist's Daughter the other night. There's a description of a bald cypress that left' me breathless.",
        "Fred": "Hardly.   Otherwise we would've been here earlier.   Well, certainly we'll reimburse you.   Well, of course, we can understand that.  GRADY considers the two glittering ghosts before him. They seem to be waiting. Just waiting.   Thank you. Professor Tripp.",
        "Officer": "Good morning...  Professor Tripp? Sorry to bother you, sir, but I understand you attended an event at Sara and Walter Gaskell's house last night and were one of the last to leave...   ...was just wondering if maybe you saw anyone. Someone you didn't know. Who seemed out of place. Suspicious maybe...   A jockey? You mean, like--   Hardapple?   Huh? Oh, someone pulled a B&amp;E on Dr. Gaskell's closet. And the dog's missing.   We figure the perpetrator let him out. He's blind and we figure he just wandered off and got run over.   No, the dog.   One other thing. About this kid, this student of yours- Leer--James Leer. You wouldn't know how I could get in touch with him, would you?   That's all right. We'll find him.  Pete Pupcik smiles, tips his big blue police hat, and turns away. GRADY frowns, starts to close the door...",
        "Pupcik": "Good morning...  Professor Tripp? Sorry to bother you, sir, but I understand you attended an event at Sara and Walter Gaskell's house last night and were one of the last to leave...   ...was just wondering if maybe you saw anyone. Someone you didn't know. Who seemed out of place. Suspicious maybe...   A jockey? You mean, like--   Hardapple?   Huh? Oh, someone pulled a B&amp;E on Dr. Gaskell's closet. And the dog's missing.   We figure the perpetrator let him out. He's blind and we figure he just wandered off and got run over.   No, the dog.   One other thing. About this kid, this student of yours- Leer--James Leer. You wouldn't know how I could get in touch with him, would you?   That's all right. We'll find him.  Pete Pupcik smiles, tips his big blue police hat, and turns away. GRADY frowns, starts to close the door...   As I told the Chancellor, Professor, I'm. just going to run James here over to the university. It'll be up to Dr. Gaskell where we go from there.  GRADY nods, leans in the window to James.",
        "Oola": "I never forget a drink.   Why's he calling you Vernon?   You' re not going to shoot him, are you?   Who's Vernon?  A rude SQUEAL breaks the silence--rubber scratching asphalt--and Grady, Oola, and Vernon turn to see Hannah Green's rattling Renault lurching awkwardly toward them.   So what was it about?  Your book.  What was the story?  GRADY stares into Oola's sweet, brown eyes.   Yea?  GRADY looks at the waitress in her pink jersey dress, snuggled up in the silk wedding jacket.",
        "Walter": "Yes . She' s charming.   Joe DiMaggio. Simply put, Antonia, it' s my contention that their marriage tapped into the very id of American popular culture. Joe DiMaggio represented, metaphorically speaking, the Husband as Slugger.. And, though it may be controversial, I personally believe every woman, in some way, desires to be Marilyn Monroe.   I could swear I had a '63 Chateau Latour in here. You haven't seen it, have you?   You'd recognize it if you tasted it.    Well, Q certainly will. And, given that he will be addressing 500 people in little over an hour...   If he' s happy. . .  I'm happy.  As Walter goes, GRADY studies Sara as she stands alone in the quiet little room, looking small and tired. Finally, she takes a breath, steeling herself, and moves off, returning to the clamor inside her house.  GRADY sighs, guilt-stricken, then detects a FLICKER of LIGHT coming from the darkness beyond. A FIGURE is watching him from the retaining wail that leads to the Gaskell's garage. GRADY blinks, chagrined that he's been caught eavesdropping, then his eyes narrow and he steps off the porch.   ...really needs no introduction. Walk down the aisle of any airplane or by the pool of any hotel and you'll see his face beaming back at you. You all know the name, you all know the books, so welcome if you will, the man those of us who know him simply call.. .Q.  As the audience THUNDERS, GRADY and James slink into the auditorium. It's standing room only. As they head for an open space against the back wail, GRADY squeezes past a KID with a GOATEE .who regards him warily.  Yes?  GRADY says nothing, as if wondering what he's doing.   Who's this ?   Grady?   I know it's you, Grady, I just... Christ, Grady, do you know what time it -is?   It's three-thirty, Grady.   Oh?   What is it, Grady?   Excuse me?   Are you drinking. Professor Tripp? Right now.  GRADY sips on his roach, responds in a pinched voice.   Nevertheless, I'd like to see you in my office Monday morning.  As the line goes dead, GRADY stares at the phone, wondering if he has, in fact, just done what he thinks he's just done.   And now, as those of you who've been with us in previous years know, we have a tradition of sorts here at WordFest. I'm speaking, of course, of The Plums.  An anticipatory BUZZ sweeps through the audience as Walter begins to read from a separate list.   This weekend, Susan Lowery, of North Braddock, found a publisher for her children's book. The Loneliest Prawn, Susan, stand up.   And Robert Wilkenson--who many of you know for his City Beat column in the Post-Gazette--has found a home with Putnam for his new Three Rivers thriller. Blood Patterns. Robert.  A SHORT, BALDING MAN stands briefly then Walter's VOICE takes a shift in tone.   Now, this next one, I think, is especially exciting to announce, because it concerns a student here at the university. Our own James Leer, a sophomore in English literature, has found a publisher for his first novel, which I believe is called The Lovely Parade.  GRADY blinks, leans forward, and watches Walter smile warmly toward the front row. CRABTREE gives James a jab in the ribs and slowly, awkwardly, James rises. Stunned, Carrie McWhirty turns to the GIRL next to her.   And finally--and perhaps not least importantly--Terry Crabtree, of Bartizan, has also decided to publish my own book--a critical exploration of the union of Marilyn Monroe and Joe DiMaggio and its function in American mythopoetics-which, tentatively, I've entitled The Last American Marriage.     \"  Wild, obsequious APPLAUSE. GRADY smiles cynically, watches Walter take a brief, dignified bow of his own. . :   Until next year. Thank you, everyone.  The LIGHTS come up. As the auditorium empties, CRABTREE shakes Walter's hand and Jeff and his goatee escort Hannah Green down the aisle, where she drapes her lovely arms around James.  GRADY watches them ail, sitting alone in his row, when suddenly Sara appears over James' shoulder. She says something congratulatory, turns, and exits out a side door. GRADY blinks, scrambles up.",
        "Gaskell": "Through the windows, a rabble of writers, faculty and select students can be SEEN, mingling under a haze of cigarette smoke. GRADY brings the Galaxie to a lurching halt across the street, parks in front of another fire hydrant. As the trio steps out. MISS SLOVIAK notices a GREENHOUSE, shimmering quietly in the chill night air.    As the front door swings open, Sara Gaskell appears, riding a wave of jagged party CHATTER onto the porch.    Poe noses blindly through a forest of legs, pauses by Miss Sloviak's high heels and scores a Rye Krisp. Crabtree, returning with a pair of DRINKS, tiptoes around him, finds MISS SLOVIAK chatting with a trim MAN in his 50's.   Yes . She' s charming.   Joe DiMaggio. Simply put, Antonia, it' s my contention that their marriage tapped into the very id of American popular culture. Joe DiMaggio represented, metaphorically speaking, the Husband as Slugger.. And, though it may be controversial, I personally believe every woman, in some way, desires to be Marilyn Monroe.    GRADY comes out the back: door and ferrets a JOINT from his pocket, lights it. He takes a long draw, walks around the side of the house. As he passes a window, a VOICE accosts him.    GRADY and James Leer stand in the doorway. Just below the photograph of Marilyn and Joe--hanging next to a PIN- STRIPED JERSEY bearing the number 5--is a SHORT BLACK SATIN JACKET trimmed with an ERMINE COLLAR.    Grady, squinting through the ten-inch panel of cleared ice on the windshield, roils slowly up onto the curb in front of Walter and Sara Gaskell's house ...then off.    GRADY pays a TAXI CAB DRIVER, then turns,     looks at the Gaskell house.",
        "Vernon": "You driving this car?   This 1966 maroon Ford Galaxie 500. You driving this car?   Bullshit. It's mine, motherfucker.   Bullshit.  GRADY shakes his head wearily, opens the door.    Move away, cupcake.  He's got a gun.   You've got a gun, motherfucker. Drop it!   Why's he sitting in my car? He's crazy, that's why. He probably calls everybody Vernon.   Shut up.  Cupcake. Please. Inside.   I'm going to shoot him. If he doesn't put that gun down.   Bullshit. I know a gun when I see one. And that's a gun.   Are you crazy!  The gunshot seems to have cleared Grady's head. He stares at the gun, watches Vernon wrest it from his hand.   Get out! What's the matter with you? Can't you see the condition my girl's in?  As GRADY gets out of the car, Vernon places his hand on Oola's tummy.   You all right, cupcake?   What the...?  Gears GRINDING, tires smoking, CRABTREE fish-tails wildly, then kicks open the passenger door.   Who the hell is that?   Woah.  Vernon steps into the street, levels the German Nine.   Pull off, you crazy motherfucker!  Frantic, GRADY steps between Vernon, the German Nine, and the oncoming Crabtree.   Let me get this straight. All that paper that went into the river. That was the only copy?    And you're saying it's some kind of sign? What the fuck's the matter with you?   I'll tell you the problem. You behind the wheel. There's your fucking problem.   Hey, pal, you don't start doing crazy eights in the middle of the street none of this happens.   He was trying to steal my car!   Yeah, but you gotta know what it's about, right? I mean, if you didn't know what it was about, why were you writing it?   Shoot.  GRADY glances at little round Oola.   As long as it looks like her, I don't care. You know what I'm saying?  GRADY watches Vernon give Oola a kiss on the forehead.   No sweat. Only do me a favor?   Stop calling me Vernon.  CRABTREE leans into Grady, WHISPERS.   Man, that book of yours must've been one nutty motherfucking ride.  Vernon points an imaginary gun, fires a friendly cap into Grady, and pulls away. CRABTREE stands stunned.",
        "Hardapple": "You driving this car?   This 1966 maroon Ford Galaxie 500. You driving this car?   Bullshit. It's mine, motherfucker.   Bullshit.  GRADY shakes his head wearily, opens the door.",
        "Miss": "Terry was telling me about you on the plane. It was ail so interesting.    That's exactly what he said.   Why yes. How did you know?   That's a nice greenhouse.   Practice.  Sara looks at Miss Sloviak, a faint glitter of scientific curiosity in her eye.   Antonia. Antonia Sloviak--  Just then, a THICKLY-MUCSCLED DOG with very strange EYES skitters around the corner, BARKING SAVAGELY in the general direction of Grady.   Who ' s he barking at now?    Walter's been telling me the most fascinating things about Marilyn Monroe and. ..who was it?   Oh, I couldn't agree more.   I need a ride.   Couldn't he have just thrown a shoe at the poor thing?   Disturbed. And when your friend CRABTREE gets done with him, he's going to be even more disturbed.   Sure it is.  GRADY watches MISS SLOVIAK peel the wig from her forehead.   Tony. Now that I'm home.   Forget it. I should've known better. Your friend is just, I don't know, into collecting weird tricks. Mind?  Tony angles the rearview mirror toward himself.   What's that?   That sounds like a fancy excuse for being a shit.   You mean because his career's ruined and all?   He said he hasn't had a success in ten years and everyone in New York thinks he's kind of .a. . .  As Tony re-sets the rearview mirror, GRADY gets a glimpse of his own swollen eyes.   ...loser. But I'm sure your book is so good that he'll be able to keep his job.  Hearing this, GRADY looks troubled. MISS SLOVIAK points.    Turn here.   It's a bathtub. What she's standing under.  The PORCH LIGHT conies on and a SMALL, WHITE-HAIRED MAN squints through the screen door.   There's Pop.  Let me see it. The gun.  GRADY reaches into his pocket, hands it over. Tony smirks.   Figures. It's like the kind of gun Bette Davis would carry. In a little beaded purse?  GRADY studies the gun in Tony's hand, then glances at the front screen door. Pop is still there.   You know, Grady, if I were you. I'd think about going home. You look like you need a little rescuing yourself.",
        "Sloviak": "Terry was telling me about you on the plane. It was ail so interesting.    That's exactly what he said.   Why yes. How did you know?   That's a nice greenhouse.   Practice.  Sara looks at Miss Sloviak, a faint glitter of scientific curiosity in her eye.   Antonia. Antonia Sloviak--  Just then, a THICKLY-MUCSCLED DOG with very strange EYES skitters around the corner, BARKING SAVAGELY in the general direction of Grady.   Who ' s he barking at now?    Walter's been telling me the most fascinating things about Marilyn Monroe and. ..who was it?   Oh, I couldn't agree more.   I need a ride.   Couldn't he have just thrown a shoe at the poor thing?   Disturbed. And when your friend CRABTREE gets done with him, he's going to be even more disturbed.   Sure it is.  GRADY watches MISS SLOVIAK peel the wig from her forehead.   Tony. Now that I'm home.   Forget it. I should've known better. Your friend is just, I don't know, into collecting weird tricks. Mind?  Tony angles the rearview mirror toward himself.   What's that?   That sounds like a fancy excuse for being a shit.   You mean because his career's ruined and all?   He said he hasn't had a success in ten years and everyone in New York thinks he's kind of .a. . .  As Tony re-sets the rearview mirror, GRADY gets a glimpse of his own swollen eyes.   ...loser. But I'm sure your book is so good that he'll be able to keep his job.  Hearing this, GRADY looks troubled. MISS SLOVIAK points.    Turn here.    GRADY pulls in front of a small brick house. On the front lawn, a small statue of the BLESSED VIRGIN stands under a little white BAND SHELL painted with stars.   It's a bathtub. What she's standing under.  The PORCH LIGHT conies on and a SMALL, WHITE-HAIRED MAN squints through the screen door.   There's Pop.  Let me see it. The gun.  GRADY reaches into his pocket, hands it over. Tony smirks.   Figures. It's like the kind of gun Bette Davis would carry. In a little beaded purse?  GRADY studies the gun in Tony's hand, then glances at the front screen door. Pop is still there.   You know, Grady, if I were you. I'd think about going home. You look like you need a little rescuing yourself.",
        "Emily's": "GRADY pushes open the door with the tips of his fingers, lets it glide open. The room that is revealed is bright and well-ordered, in direct contrast to the lazy clutter of Grady's office. There is a DRAFTING TABLE and a COMPUTER, pads and pens neatly arranged alongside.  A BULLITEN BOARD hangs on one wall, bearing an intricate mosaic of multi-colored index cards. There are PRINTS, framed, from various art exhibits, and two of Grady's DHSTJACKETS--including, most prominently, Arsonist's Daughter.  There are PHOTOGRAPHS of EMILY too. In a black turtleneck with friends. In a sundress with Grady. In a billowing Burberry, floating like a dark butterfly against a BLUR of YELLOW TAXIS on a street in Manhattan.  Smiling brilliantly. Beautiful.",
        "Father": "",
        "Amanda": "We were on our way to a benefit. But, as luck would have it, the club was on the way, so...  We were able to put in an appearance.   Excuse me?   Oh, don't worry. We'll take care of him. You can be sure of that.  Fred Leer hits the gas and swings the Mercedes around in a tight little arc, feathering Grady's pants--from the knee down--with a pudding of ICE and MUD. GRADY glances down at his spattered self, then notices, sitting on the front passenger seat, James' knapsack. GRADY grabs it, turns.",
        "Traxler": "No. I guess you're here for the backpack.   I saw the manuscript inside. So when you showed up, I figured. . .  GRADY lifts the knapsack, peers inside. There is no title page to the MANUSCRIPT, Just the words The Love Parade and then, halfway down, TEXT.   Is it good?    Traxler gives GRADY a ride in his Honda, one of the original Hondas best suited for sidewalk driving. The backseat bulges with a huge AMPLIFIER and BASS GUITAR.   Say, Professor Tripp, is ail that stuff true about Errol Flynn? How he used to put coke on his dick. To make himself, you know, like, last longer?   Well, jeez, you're reading his biography, aren't you?  Sam points and GRADY glances at the knapsack riding on the seat between him and Sam. A BOOK'-bearing ERROL FLYNN'S PICTURE--IS tucked into the side pouch.   Sick.   Wow, check out that greenhouse. Is that your wife?  GRADY gazes at Sara, a .vaporous blur in the greenhouse.   Who's that guy?   What exactly are we doing here, Professor Tripp?    Hey, Professor Tripp.  GRADY considers the Ziploc in his hand, looks down again.   Only when I'm working.  GRADY hangs-over the railing and lets fly the Ziploc.  It pinwheels through the vortex of stairs, lands at Sam's feet.   Holy shit. Are you serious?   Thanks-Whoa, Professor Tripp, careful ^here...  GRADY is still hanging over the railing-but looking dizzy now. His eyelids flutter and he tips forward-a Steinway on a window ledge-and as he starts to drop...  ...there is a SHARP JERK on his- COLLAR, a SHIRT BUTTON caroms off his cheek, and slowly, he is hauled back.",
        "Hannah": "I think maybe we're missing the point. It seems to me James' strength as a writer is that he doesn't take us by the hand. He treats us like adults. He respects us enough to forget us. That takes . . . courage .  GRADY nods, smiles subtly. Appreciative.   I think so. ..What about you?   Just checking.  GRADY watches her glide away in her CRACKED RED COWBOY BOOTS, then starts to exit himself.    Grady.  Q eyes GRADY over his wine glass.   Hey, you two.  GRADY stops, sees Hannah slipping on a coat in the foyer.   Are you riding with me, James?   Ail right. By the way, his friend...?   James'll know about George Sanders.   Mr. CRABTREE was saying how George Sanders killed himself, only he couldn't remember how.   Oh, James is amazing. He knows all the movie suicides. Go ahead, James. Tell them who else.   Just a few then. The big ones.  James glances at the loose group of people around him, watching, then...   I haven't heard of half of those.   Come on. Teach. I want you to dance with me.   I've been re-reading Arsonist's Daughter. It's so beautiful, Grady. So natural. It's like ail your sentences always existed, just waiting around in Style Heaven, or wherever, for you to fetch them down.   And I love the inscription you wrote to me. Only I'm not quite the downy innocent you think I am.   So what are you going to do?   I just mean, I--I guess Emily isn't going to be there when you get home.  GRADY looks down into Hannah's translucent face, then catches a glimpse of himself in the fractured, wail. The tile that would reflect his head is missing.   Shush.   I would if I knew where I was taking him.   Some apartment somewhere. But I've never seen it.   James is odd. I know he has an aunt in Sewickley Heights. I dropped him there once, but...  Come to think of it, it-wasn't even his Aunt's house. He said she worked there. Or something. I don't remember.  James MUMBLES, starts to slide onto the hood of the car.   His bag. You know that ratty green thing he's always carrying around. He must've left it inside.   The one in your office? It's the best one .for naps.   Hey. If you want to talk later...I'll be up.  GRADY watches her fold her lovely self into the car and drive away. He sighs, crosses to the Galaxie, and just has his hand on the doorhandle when a TINY FIGURE appears.  Vernon Hardapple.   There you are...  GRADY stiffens, then turns to find Hannah Green across the room in her t-shirt and cowboy boots, looking ail dewy- eyed and delectable.   I thought we were going to talk. Last night.   It's okay. ..I'm here when you want me.  GRADY stands frozen as Hannah smiles sleepily, pushes through the swinging door into the kitchen. A THUMPING is heard as James, tangled in the sleeping bag, hitches down the last few steps of the stairway. He watches Pete Pupcik drive away in his big police car.   Grady!  She slaps the page she is reading back onto the stack at her thigh. GRADY stares. The manuscript. It's his.    I know I shouldn't have, but there it was, just sort of lying out, and I couldn't resist and-and--I suck.   I don't know--maybe- I don't think so.  Grady's  mind races with unfortunate possibilities, but only briefly: his immediate thoughts are elsewhere.   He shot the Chancellor's dog, didn't he? The blind one.   At first the police thought he just ran away, but this afternoon Dr. Gaskell found some blood spots on the carpet -   CRABTREE said it sounded like something James would be messed up in.   Who does?  Just then, Crabtree's VOICE bellows in the hallway outside.   I told you, Sewickly Heights.   I don't know, Grady. I just dropped him on a corner.   No! Don't go. I've been waiting ail night for you.  GRADY looks at Hannah's hand, where it rests. He looks terrified.   Two-sixty-two Baxter Drive.  GRADY and CRABTREE turn, see Hannah sitting on the corner of Grady's desk with the WHITE PAGES open on her lap.   They're in the book.    Hannah Green lies tangled in the sheets, surrounded by little colonies of Grady's manuscript. GRADY studies her, then detects something on the floor. The red boots.  Delicately, he lifts the sheet. Hannah Green's feet-- finally revealed in ail their naked glory--prove to be thick, wide, and ordinary. GRADY sighs.    Hannah, wrapped loosely in cotton sheets, SMILES as she listens to the Goatee Kid, who sits cross-legged at the foot of-her bed, fully clothed.    Stop it.  Hannah looks up, sees GRADY in the doorway and blushes. She pulls the sheet up, gives an oddly formal wave.   Grady. Hi. What's up?  Jeff eases off the bed, past GRADY uneasily.   It beats 'What's your major?'  GRADY nods, detecting a new aloofness in her voice.   Sure. The keys are on the dresser next to. ..to your book.  The hitch in Hannah's voice hangs in the room like a cloud.   I uh, I didn't finish, I ...fell asleep.   No, it's not that, it's...  Hannah glances at the huge stack of paper sitting on her dresser, then, hesitantly, looks back to Grady.   It's just that, you know, I was thinking about how, in class, you're always telling us '-that writers make choices--at least the good ones. And, don't get me wrong. I'm not saying the book isn't really great-I mean, really great- but at times it's, well, very detailed, you know, with the genealogies of everyone's horses and ail the dental records and so on-and I don't know, maybe I'm wrong, but it sort of reads, in places, like, well, actually, like...  ...you didn't make any choices at all. And I was wondering if it might not be different if, maybe, when you wrote, you weren't always ...under the influence.    CRABTREE sucks on a Kool, driving Hannah's rattling Renault too fast, shifting gears apparently at random. GRADY rides shotgun, still wearing the robe over his clothes, the Wonder Boys manuscript sitting like a watermelon on his lap-looking, all in all, fairly pathetic.    CRABTREE takes a corner recklessly, immediately slows, and blinks in amazement.    CRABTREE stomps on his Kool. GRADY looks very much like a man who has pulled off the road to take a nap.    CRABTREE jumps as the tiny pistol at the end of Grady's arm FLASHES, makes a FEEBLE POP in the wind.",
        "Green": "I think maybe we're missing the point. It seems to me James' strength as a writer is that he doesn't take us by the hand. He treats us like adults. He respects us enough to forget us. That takes . . . courage .  GRADY nods, smiles subtly. Appreciative.   I think so. ..What about you?   Just checking.  GRADY watches her glide away in her CRACKED RED COWBOY BOOTS, then starts to exit himself.    Grady.  Q eyes GRADY over his wine glass.   Hey, you two.  GRADY stops, sees Hannah slipping on a coat in the foyer.   Are you riding with me, James?   Ail right. By the way, his friend...?   James'll know about George Sanders.   Mr. CRABTREE was saying how George Sanders killed himself, only he couldn't remember how.   Oh, James is amazing. He knows all the movie suicides. Go ahead, James. Tell them who else.   Just a few then. The big ones.  James glances at the loose group of people around him, watching, then...   I haven't heard of half of those.   Come on. Teach. I want you to dance with me.   I've been re-reading Arsonist's Daughter. It's so beautiful, Grady. So natural. It's like ail your sentences always existed, just waiting around in Style Heaven, or wherever, for you to fetch them down.   And I love the inscription you wrote to me. Only I'm not quite the downy innocent you think I am.   So what are you going to do?   I just mean, I--I guess Emily isn't going to be there when you get home.  GRADY looks down into Hannah's translucent face, then catches a glimpse of himself in the fractured, wail. The tile that would reflect his head is missing.   Shush.   I would if I knew where I was taking him.   Some apartment somewhere. But I've never seen it.   James is odd. I know he has an aunt in Sewickley Heights. I dropped him there once, but...  Come to think of it, it-wasn't even his Aunt's house. He said she worked there. Or something. I don't remember.  James MUMBLES, starts to slide onto the hood of the car.   His bag. You know that ratty green thing he's always carrying around. He must've left it inside.   The one in your office? It's the best one .for naps.   Hey. If you want to talk later...I'll be up.  GRADY watches her fold her lovely self into the car and drive away. He sighs, crosses to the Galaxie, and just has his hand on the doorhandle when a TINY FIGURE appears.  Vernon Hardapple.   There you are...  GRADY stiffens, then turns to find Hannah Green across the room in her t-shirt and cowboy boots, looking ail dewy- eyed and delectable.   I thought we were going to talk. Last night.   It's okay. ..I'm here when you want me.  GRADY stands frozen as Hannah smiles sleepily, pushes through the swinging door into the kitchen. A THUMPING is heard as James, tangled in the sleeping bag, hitches down the last few steps of the stairway. He watches Pete Pupcik drive away in his big police car.    Through the steamy panes, we SEE GRADY approach with the balloon, enter. He crosses to a high table, sets the balloon down, and steps back, considering the placement.   Grady!  She slaps the page she is reading back onto the stack at her thigh. GRADY stares. The manuscript. It's his.    I know I shouldn't have, but there it was, just sort of lying out, and I couldn't resist and-and--I suck.   I don't know--maybe- I don't think so.  Grady's  mind races with unfortunate possibilities, but only briefly: his immediate thoughts are elsewhere.   He shot the Chancellor's dog, didn't he? The blind one.   At first the police thought he just ran away, but this afternoon Dr. Gaskell found some blood spots on the carpet -   CRABTREE said it sounded like something James would be messed up in.   Who does?  Just then, Crabtree's VOICE bellows in the hallway outside.   I told you, Sewickly Heights.   I don't know, Grady. I just dropped him on a corner.   No! Don't go. I've been waiting ail night for you.  GRADY looks at Hannah's hand, where it rests. He looks terrified.   Two-sixty-two Baxter Drive.  GRADY and CRABTREE turn, see Hannah sitting on the corner of Grady's desk with the WHITE PAGES open on her lap.   They're in the book.    Stop it.  Hannah looks up, sees GRADY in the doorway and blushes. She pulls the sheet up, gives an oddly formal wave.   Grady. Hi. What's up?  Jeff eases off the bed, past GRADY uneasily.   It beats 'What's your major?'  GRADY nods, detecting a new aloofness in her voice.   Sure. The keys are on the dresser next to. ..to your book.  The hitch in Hannah's voice hangs in the room like a cloud.   I uh, I didn't finish, I ...fell asleep.   No, it's not that, it's...  Hannah glances at the huge stack of paper sitting on her dresser, then, hesitantly, looks back to Grady.   It's just that, you know, I was thinking about how, in class, you're always telling us '-that writers make choices--at least the good ones. And, don't get me wrong. I'm not saying the book isn't really great-I mean, really great- but at times it's, well, very detailed, you know, with the genealogies of everyone's horses and ail the dental records and so on-and I don't know, maybe I'm wrong, but it sort of reads, in places, like, well, actually, like...  ...you didn't make any choices at all. And I was wondering if it might not be different if, maybe, when you wrote, you weren't always ...under the influence.   You did.   So I hear. You've also been smoking a lot of marijuana, I understand.   How long have you been having them?   How long have you been smoking marijuana?   That's probably not the problem, then. What about your lifestyle. Any major changes recently?   And your wife left you.   I spoke with the woman who saved your life. You're lucky she came along when she did.  GRADY considers the larger ramifications of this statement    You need to see a doctor, Mr. Tripp. An internist. And I think you really ought to consider seeing a therapist, as well.   Her dog, yes.   Look, Mr. Tripp. You have a drug problem, all right? On top of that, you have a bite on your ankle that is severely infected. We pumped you with antibiotics so you'll be fine, but another day or two and you might have lost the foot. As for your spells. I'm guessing they're a result of the anxiety you've been experiencing lately.   Better luck next time.   No. There's no one here.   Look, Mr. Tripp. If you really want to leave, I can't stop you. But I'm going to write you a prescription for a course of ampicillin and I want you to follow it to the end-no matter how stupid you decide to be with everything else. All right?    GRADY hobbles to the greenhouse, puts both hands to the glass as he looks inside. Quiet. Empty. Dispirited, he pulls away, but not before leaving...  ...the IMPRINTS of his hands, perfectly etched in the frost of the glass.",
        "Terry": "",
        "Crabtree": "Tripp!   Brimming. Say hello to my new friend, Miss Antonia. . .uh. . . .   I took the liberty of inviting Antonia to tonight's festivities. You don't mind, do you. Trip? ?   I was explaining to Antonia how a book comes to be published. What you do as a writer, what I do as an editor...   We know each other pretty well.  So where's Emily?   Your wife.   Perfect. Well then, shall we?  GRADY nods, but lingers briefly--studying the architecture of Miss Sloviak's ankles as she CLICKS off in her spike heels, arm in arm with Crabtree.   Do you know how many times I've boarded an airplane praying someone like her would sit down beside me? Particularly while I'm on my way to Pittsburgh.   If it can produce a Miss Sloviak you'll get no argument from me.   You're stoned.   Mm.   So how's the book?  GRADY stiffens. He had been expecting this, but not so soon. He tries to act casual.   Great. I was hoping I could get a look at it sometime this weekend. Think that might be possible?   I thought you were tinkering.   Forget I asked. I don't want to pressure you, Tripp. But...   ...I get pressure. Know what I mean?  GRADY ponders this, troubled by it. Suddenly, Crabtree's face brightens again.   Ah. ..well now. What do you suppose that would be?  GRADY turns, watches an immense PONY HIDE CASE drop onto the carousel.   You didn't actually purchase this car, did you. Trip??   He owes God money. You know, he queered himself for good with Esquire.  GRADY takes a joint from the ashtray, snaps a Scripto butane.   Yeah, between a bookie and a pair of broken legs.   Trip? ?   Left you...?  Who? Emily?   But. ..why didn't you say something, Tripp? I mean, what are we doing here?  GRADY gazes at the glittering scene beyond his windshield, turns on the ignition.   I thought you were Mrs. Gaskell's hobby, Tripp.   Oh, I'm sure you'll find another. You always do.   Chancellor. Don't you look ravishing.    This wouldn't be Walter's dog, would it?  Poe continues to rage, his paws doing crazy eights on the hardwood floor, until he's spun himself completely around and is barking at the living room.   We'll just make ourselves at home.  Won't we, Poe? Yes, yes....   Walter! I see you've met my friend.   Here we are!  CRABTREE appears at the top of the landing with Miss Sloviak. Her lipstick is blurry.    Nell, hello there.  CRABTREE steps down the stairs, hand extended. James Leer's pale fingers rise as if on a string.   How comprehensive of you.   You did them alphabetically.  James turns, finds Crabtree's laser eyes on him. James blinks, as if he had forgotten about Crabtree, then shrugs shyly, looks away.   Fascinating. Listen, why don't you come out with us after the lecture. There's a place on the Hill I always get Trip to take me.   Oh, don't be silly. No one your age just wants to go home. Besides, faculty will be present. Just think of it as a field trip.  As he exits, CRABTREE raises an eyebrow to Grady, as if to say: \"Bring him.\"   MISS SLOVIAK follows, eyeing James glacially as we CUT TO:    He's fine. He's narrating.   Primarily. Although I gather you two staged a little raid on the CRABTREE pharmacopoeia. You missed a few bottles, by the way.   Sara and Walter declined. Guess they wanted to go home and curl up on the couch with the dog.  GRADY cuts James a glance, trying to determine if he's copped on Poe, but James is winking out. His head drifts back against the wail, settles with a gentle ...thunk.   He has a book.   He finished it Winter Break.  GRADY looks up, unable to disguise his surprise.  He glances at James' slack face tilted against the wall.   So. Is he any good?   Well, I'm going to read it anyway.   He is. Take my word for it.   On the contrary, it 'could be just the ticket.   No sexual confusion there, eh, Professor?   Oh my goodness. Do you see what I see?  GRADY follows Crabtree's glance and finds Oola again, but it's not Oola CRABTREE is eyeing, it's her CUSTOMER.   Huh uh. A jockey. His name's, um, Curtis.. .Curtis Hardapple.   Vernon, then. Vernon Hardapple. The scar's are from a--from a horse. He fell during a race and got trampled.   He can't piss standing up anymore.   And he had a younger brother who . . .was . . . a. . .    Because. . .because. . .   That was good.   and Q huddle inside.   Tripp.   Hit your brakes.  GRADY flicks his eyes from the rearview mirror just as a SHADOW looms in his headlights. As he squashes the break pedal, Q's EYEGLASSES go flying into the windshield.   Just go around him.  GRADY taps the accelerator, but each time, Vernon dances back in front of Grady's grille.   Back up. Go out the other way.  GRADY throws the car in reverse, backs straight up, then turns up a one-way street. He shoots down the alley behind the Hi-Hat, turns onto the adjoining street, ..and watches in amazement as Vernon materializes from behind the high wooden fence that runs parallel to the Galaxie.  As GRADY pinches the brakes, Vernon grins.   Where would we go?   Good morning, boys. James.  James waves feebly from beneath the sleeping bag.   Trip?! Where are you'  GRADY looks anxiously toward the door.   Trip?!    Tripp, where the hell. . .  CRABTREE stops, takes in the tableau before him.   Oh, I'm sorry. Am I interrupting a. student- teacher conference?  GRADY delicately removes Hannah's hand from his buckle, points at Crabtree.   What? Ohhhh. Is that... it?  CRABTREE cocks his head toward the reams of paper stacked on Grady's desk.   Honestly, Tripp. Do you actually think I would sneak in here and read your book without asking you?   Sometimes we have to improvise.   James? My James? What's happened?   Kidnapped? By who?   Good God. Let's go rescue him.   Ah. Wait a minute. The university must know where he lives.   Is it a little late to call the Chancellor?   You know--based on what I've read-- this is a very exciting piece of material, this Big Parade.   I've been doing this a long time, Tripp. I feel this kid in my bones.   No. I think I might be right. I've felt it before...  As Crabtree's voice trails off, GRADY studies him.   Bad enough. And God knows I don't exactly fit the new corporate profile.   Competence.  GRADY and CRABTREE look at each other a moment, then CRABTREE smiles, gives a little shrug, and picks up James' knapsack, rummaging through the contents.   So tell me about you and the Chancellor.   Plenty, I'm sure. But, for what it's worth...  CRABTREE fishes out the biography of Erroll Flynn, gives it a look.   ...I like her.  GRADY peers at the stars, his voice barely audible.   Jesus. There must be two dozen windows on . that thing. How are we-supposed to find his?   Doris Day.  CRABTREE and GRADY look at each other.   James Leer.  GRADY moves to the window and RAPS on the glass. A moment later, James peeks out. Seeing Grady, his face brightens briefly, unguarded, then quickly resumes its usual Leerian aspect. He motions with his hand, as if to say, \"That way.\"   We're springing you. Leer. Get some pants on.  As they step inside, GRADY gives James' PJs the once- over.   I like what you've done with it. When's Captain Nemo moving in?   Hey, I heard all about it--the parents, the grandparents, the China town thing-- and I believe you, okay? That's why we're here. Now go get dressed.  James scoops up the shirt GRADY lent him. this morning.   So modest.    Oh, come on, Tripp. Cut the kid some slack.   The-truth. I know that's always been real important to you. Key, check this out...  CRABTREE leans over an old ROYAL TYPEWRITER, reads from the freshly-typed PAGE curling from the carriage.   Finally, the door opened. It-was a shock to: see him, shuffling into the room like an aging prizefighter. Limping. Beaten.'  Sound like anyone we know?  But it was later, when the great man squinted into the bitter glow or twilight...  Bitter glow of twilight? This kid definitely needs an editor.  ...and muttered simply, \"It means nothing. All of it. Nothing,\" that the true shock came. It was then that the boy understood that his hero's true injuries lay hidden in a darker place. His heart...'  CRABTREE stops abruptly.   'His heart, once capable of inspiring others so completely, could no longer inspire so much as itself. It beat now only out of habit. It beat now only because it could. '  GRADY nods, his face unreadable, then James returns.   He's great. Come on, let's blow before ol' Gran decides to boil your bones for breakfast.   Hhhuh. So we decoy her. Stick a couple pillows and one of your teddy bears under the spread and she won't know the difference.   Things must've picked up after we left.  CRABTREE pats Grady's cheek, heads upstairs.    Ye-es?  GRADY looks down, sees James Leer's black brogues sitting on the floor outside Crabtree's door.    CRABTREE sits in bed, flipping through the pages of The Love Parade while stroking a tiny TUFT of HAIR that is the . sole visible part of .James Leer.   I'm afraid he's pretty worn out, poor kid.   So I hear.   He's right, you look horrible.   Ah, right. Well, I gave you my opinion.   So what's the problem?   Who's that?   The Chancellor's here? Now?   James. This book of yours. It's not bad. Not bad at all.  James stops, considers this piece of news with a look of deep seriousness, then nods.   You're welcome.  As James shuffles off into the hail, CRABTREE looks at Grady, his eyes dancing with excitement.    I want to publish this.  I've got to.  I think they'll let me.  With a little editorial guidance it could be brilliant.   So- what do we do now? ,   Oh' huh. Exactly how do we do that?   It seems to me that girl would let you borrow her pancreas.   Want some help with that?   Let me get this straight. Jerry Nathan owes you money. So, as collateral, he gives you his car.   So whose car is it?   The hood jumper?   Such as.   Hh hub. So. We find Vernon, we find the car. We find the car...   There's only one problem, Tripp. We don't know his real name. We just made it up. In fact, we made the whole guy up.   Christ, Tripp. How did you know?   I'd call it genius.  GRADY steps out, strips off the robe, and drops the lumpy leviathan that is his manuscript on the front seat.   What the hell...   Holy shit.   Tripp! Run!  GRADY doesn't move an inch, watching in mute amazement as CRABTREE whistles by, proceeds halfway down the block, then turns back for another pass.   Naturally you have copies.   You'll be all right then.  Look at Carlyle, when he lost his luggage.   Or Hemingway, when Hadley lost all those stories.   Bad examples. Look, Tripp, I don't want to depreciate the loss here, but perhaps--in a sense- this--  is for the best.  Grady's eyes shift, study Crabtree.   In a sense.   I'm just saying that sometimes, subconsciously, a person will put themselves in a situation-perhaps even create that situation- in order to have an arena in which to work out an unresolved issue. It's a covert way, if you will, of addressing a problem.  Vernon stares at CRABTREE as if he's from another planet.   That's pretty simplistic, don't you think?   Excuse me. Did you, or did you not, have a gun to his head?   What he means is, it's difficult to distill the essence of a book sometimes. It-lives in the mind.   The jacket, Tripp. We need the jacket.   You mind explaining what you just did?  GRADY watches the shrinking Galaxie sail under a drooping NORDFEST BANNER, lost in thought.   Do you know he won't expel him?   That's very enlightened, Professor. It's comforting to know that America's children have you for a teacher.  GRADY blinks, ponders this briefly, then looks toward the buildings of the campus, his VOICE still distant.   Me? What can I do?   I'm sorry, Tripp.  GRADY stops, turns.   I peeked.  GRADY considers this. Nods. It-doesn't seem to matter anymore   It really had the makings, Tripp. There was a lot to admire. I've ...never read anything quite like it.  If there was a Kentucky Derby for editorial bullshit, Crabtree's last three utterances would finish win, place, and show. And GRADY knows it.   Scout's honor.  CRABTREE and GRADY stare into each other's eyes. Both are acutely aware of the subtext of this conversation.",
        "Sara": "No, Elliot, I said five hundred programs for today. This means we have no programs for the weekend. This means that tomorrow morning, at 9AM, several hundred people will walk into Thaw Hall and have absolutely no idea where they are going.  It's all right, Elliot. I'll take care of it.  GRADY watches Sara take the programs, turn, and spot him. There is the slightest of hesitations, then....   Professor Tripp.   I got the message you called.   Well, hello, everyone. Terry, good to see you again.   Aren't you sweet to say so. I was beginning to wonder if you were ever going to--oh!  As Sara steps forward, her heel-catches and she pitches forward ...into Grady's arms.   I'm sorry. It's these goddamned shoes. I don't know how anyone actually walks in these things.   I don't believe we've met...   Poe!   Poe' Hush! Now stop this. Honestly.  As Poe simmers to a deep growl, GRADY leans forward.   That's funny. I need to talk to you, too.  Perhaps you could put some of these coats in the upstairs guest room, Professor Tripp.   Well then. I'd better show you. Terry--    Walter just got it back from the framer today.  Sara takes Grady's hand, drawing him away from the pennant and down onto the coat-covered bed.   You go first.   I'm pregnant.  A flash of LAUGHTER flutters from the living  room below. GRADY starts to speak.   I'm sure.   I think Walter would find this a little more than surprising.  GRADY nods, getting her drift, then roils onto his back.   She's left before...   So. I guess we just divorce our spouses, marry each other, and have this baby, right? Simple.   Is that Cristaile?    My God, I wear the same scent as a transvestite. She IS a transvestite, isn't: she?   Has he asked to see the book yet?   And? Are you going to tell him?    Neither do 1.  GRADY starts to pull up, but his arm is underneath Sara.   I guess you're going to have to chew it off then.   I doubt I'd recognize a '63 Chateau Latour if I was sitting on it.   I doubt it, darling.   You want to keep him happy.   Grady? Grady?  GRADY opens his eyes, finds Sara's face swimming above him. He is lying on his back in the corridor, his corduroy blazer bundled under his head like a pillow.   You had another one, didn't you? You have to see a doctor, Grady. First thing Monday morning. All right?   Almost. Wane to sit up?  What's the matter?   Then stand up. I'm too old for all this roiling around on the floor.  GRADY lets her pull him up, watches her light a cigarette.   Don't. I know what you're going to say.   You love Emily. I know that. And you need to stay with her.   She'll come back. That's why I'm going to. ..to not have this baby.  GRADY watches her flip her hand up, bring the cigarette to her lips, and inhale ...then grimace and drop it to the floor.   No. There's no way. I mean, don't you think there's no way?    No you don't. And fuck you for saying you do. And fuck you for \"saying. . .  ...for saying there's just no way. Because there could be a way, Grady.  Somewhere deep in the building, APPLAUSE swells.    He must be finishing. We should go.  GRADY looks sadly at Sara then stoops to retrieve his coat.  As he grabs it, James Leer's little pistol CLATTERS to the floor.   Who's gun is that?   Heavy. Smells like gunpowder.   Pow.   I love you, Grady.  GRADY places his fingers gently over Sara's... and removes the gun from her hand.   Terry CRABTREE and James Leer. Leave it to you to make that mistake, wait here.  As Sara heads off after James, GRADY turns toward the lobby...directly into the hostile gaze of Miss Sloviak.   Grady, it's Sara. Thank God you're there. You won't believe what's happened.   Feeling guilty?  GRADY jumps--startled--and turns. Sara has materialized behind a ficus, large POTTING GLOVES on her hands.   I can't believe you hung up on me, you dick.   Walter's on campus, being the good soldier for WordFest. But he's a basket case. Someone stole Marilyn's jacket last night. And Poe's missing, too.   You heard? How?   Did you confess?  GRADY looks up, mildly alarmed.   Your fingerprints were all over the bedroom.    I'm kidding. Hello?   Are you limping? Why are you limping?   Did you pass out again, Grady? Did you fall somewhere?   All right.  Sara settles back, folds her arms. Waiting.   Gee, Grady, that sounded so heartfelt.  I don't know whether to swoon or smirk.   I believe you. I believe you want to be with me. But this is not just about me anymore.   No, I don't think you do. And besides... I haven't decided yet.   That ...and you.  GRADY goes still, watches Sara strip off the gloves, drop them on  a table.   I'm not going to draw the map for you on this one, Grady. Times like these you have to do your own navigating.  Sara turns to leave, then stops, squinting far down the street.   Who's that sitting in your car?   What's he doing out there?   Isn't he lucky.  GRADY watches her ripple across the glass, head for the house, and wave. James, slumped low in the Galaxie, offers a limp hand in return, but it's too late.  She's already gone.   Where are you, Grady? An elevator?    You're in Kinship?   With Emily?   Just what? Doing a little dusting?  As GRADY endeavors to respond, TWO YOUTHFUL VOICES, CHEERFULLY SINGING, rise from below.   James? He's still with you?   Are you there to not reconcile with her?  The Bonneville's trunk pops open, revealing THREE BAGS OF GROCERIES, and HANK and IRENE WINTERS, both in their 60's, get out. An enormous NEWFOUNDLAND vaults from the backseat.  Sara, eating phone static this whole time, interprets Grady's silence her own way.   Goodbye, Grady.   Trust me, I understand. I just want to say something to you, Grady.   How you choose to live your own life is your business. But you be careful with that boy, Grady. With James. He belongs to somebody else.  As the line goes dead, GRADY watches Hank and Irene Winters disappear below him.   I tried to call, but apparently there's something wrong...  Sara leans down, replaces the uncradled phone.   ...with your phone. Unfortunately, mine was ringing loud and clear this morning.  GRADY doesn't know what this means, but he's pretty sure it's not good.   It seems one of our students is - missing and his parents found a dead dog in his bed.   I'm not very happy with you right now, Grady. But more importantly, Walter's not very happy and he's gotten the police involved. They seem to think James Leer is somehow responsible for all of this. You wouldn't happen to know where James is, would you, Grady?   And the jacket?   Grady.   Are you sure you parked it there?   I'll deal with this. You dig up James.   How's it coming back there, Professor Tripp?   This is not what the university has in mind when it promises a liberal education, Grady.   It's within the realm. He takes his souvenirs pretty seriously. And he was just a wee bit prickly this morning.  Grady, detecting something in Sara's tone, turns, watches her take a drag on her cigarette.   You didn't happen to call the house last night, did you, Grady?   And what do you think you might have said?   He told me.   I said it didn't sound like you.  Sara tosses her cigarette in .the gutter, gets into her car, and dives away.  GRADY looks after her sadly, then turns, sees CRABTREE standing on the porch wearing a shirt which claims \"Ativan Chases the Clouds Away.\"   Grady, what are you doing, you idiot?  GRADY looks up into Sara's freckled face.    faintly at first, then more forcefully, calling Grady's name, calling so insistently that the earth seems to RUSH upward until we see that she is...  KISSING him or something, and all goes softly... Blue.   I believe you. Did that nice doctor let you out? Or-is this you improvising again, Grady?   Terry told me about Wonder Boys. Is  it true? Did you lose it all?   Oh, Grady. You're such a putz.   And you're old.  Sara strokes his scalp, takes a gray hair between her fingers. Yanks.   Dozens. It's very sad.  Sara smiles at Grady, but the mischief leaves her eyes when she looks into his, and-she glances away.   Oh?    Some times...  GRADY studies her as she traces her finger around the HOSPITAL BRACELET still encircling his wrist.   I told Walter.   It didn't come up.  GRADY studies Sara's freckled cheeks, her anxious profile, then turns her chin gently toward him.   Did you just make that up?   Don't write a page when a paragraph will do.  GRADY nods, takes her hand. Looks at it as he speaks.   I know, but sometimes...  Sara turns, looks at Grady. Her eyes are glistening.   You just go on faith.  GRADY looks into her eyes, then rises, and we do too, drifting above the streetlights as GRADY limps to the other side of the car and gets in. As GRADY snaps shut his door, the car drifts off, gradually losing itself in- the soft veil of falling snow. After a moment, GRADY and Sara are lost too, nothing more than a blur."
    },
    "imdb_rating": "7.2",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMDViMDlhNzgtNjZhZC00YjZmLWJkYzEtOGMwNjNjZDY2OWIwXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_QL75_UX380_CR0,5,380,562_.jpg",
    "description": "Grady Tripp is a professor/writer living in Pittsburgh who is struggling with writer's block. Whilst doing this, he also manages to get the chancellor pregnant. In the meantime, he and a college student, James Leer are trying to find a rare jacket once owned by Marilyn Monroe, and a college girl, Hannah Green boarding with Grady has a bit of a crush on him.—Dave Lean <davelean@hotmail.com>",
    "name": "Wonder Boys",
    "genres": [
        "Comedy",
        "Drama"
    ]
}