{
    "filename": "xXx_script.txt",
    "imdb_id": "tt0295701",
    "imdb_url": "https://www.imdb.com/title/tt0295701",
    "characters": [
        "Viktor (as Jan Filipensky)",
        "Kirill",
        "J.J.",
        "Kolya (as Petr Jakl)",
        "Xander Cage",
        "Senator Dick Hotchkiss",
        "Agent Jim McGrath",
        "Toby Lee Shavers",
        "Yelena",
        "Agent Roger Donnan",
        "Milan Sova",
        "Jordan King",
        "Agent Augustus Gibbons",
        "El Jefe",
        "Yorgi"
    ],
    "dialogues": {
        "Kirill": "Yorgi!  What's the problem?  What?      Nice and easy, Petra...  Ready.  There's some bullshit going on!  What are you doing!",
        "J.J.": "",
        "Xander": "Sky, you there? Start packin' cause we are out of here!  Did I promise you a fat vacation or what? Get ready to get down in paradise.  Hey, you don't need all this just to go on vacation. Unless this ain't for going on vacation...  I can see that. Why?  I'm having fun, what's the problem?  I don't wanna go mersh, you know that. But hey, if this is about money...  I got an advance on the next bootleg. Let's get out of here, just you and me. We'll chill out in Bora Bora for a couple months.  Alright, so I'll get more.  Well if you're bailing, I guess I'd better give you your surprise now.  I was gonna wait till the islands, but...  Of course I'm serious. I bought it, didn't I?  I don't know. I thought this is what you wanted. You want stability, here it is.  You're not exactly \"going anywhere\" yourself.  She had nothing to do with the tower jump. She's nobody. I just met her last night. Tell them. I hardly know you.  God, I hate cops. What's the charges this time?    What the hell?  Hey. Where am I? How did I get here?  Huh?  You alright?  Yeah, sure.  What?  Problem? No, no problem. You go right ahead.  Whatever, dude.    Better shoot me quick.  Too late!  Alright, bitch, what's going on?  Talk! What's the game? Who are you people?  Who the hell are you?  What is this place?  Diner, huh? Let me tell you what the problem is. I wake up drugged to find what? You've got a \"salesman\" over here reading a three week old newspaper. He's pulling a 211 with a \"trucker\", who happens to be packing a cop issue H&amp;K 9mm. I get tipped that something is going down when she passes me a note. How's that for twisted logic? How did she know there was trouble unless they pulled the guns before I \"walked\" in? And if that's true, why'd they stop and wait until I woke up to gaffle the money? Then I notice how beefy they both are. Hell, even the waitress is cut. All three of them look like they went through the same training program. Ergo they ain't strangers and this isn't what it seems. That's how I knew yo-yo wouldn't get a round off even if I gave him all day. Why?  Cuz there's nothing but blanks in these guns. And no offense, but their performances were terrible.  That shows me already that you don't have a clue. What's it to you, anyway?  Good for you. Now why don't you stop wasting my time and tell me what you want. You didn't go through all this for my benefit.  A Fed, I shoulda known. Who else would have this kind of budget? Now you're gonna hit me with the sales pitch.  ..If you're trolling around for narcs, man, have you got the wrong guy.  Look at me, dude, do I look like a fan of law enforcement? Forget the tests, you shoulda just asked me. I woulda saved you a lot of trouble.  Are we done now? You've got nothing on me. So if you ain't booking me, I'm walking.  Is that a fact?    You bastards love to see me sleep.     Been to any good diners lately?  Nobody told me this was a costume party.  A parachute. This does not argue well.  I get the picture.  Don't look at me, brother. It's every man for himself.  You gotta be kidding me.  You boys are too good for me. Guess I failed this one, huh?  So much for \"every man for himself\". Nice to see you again, fellas.  This oughta be good.  This must be el jefe. How's it goin' jefe? Some weather we're havin'.  What's on the menu tonight? The old blowtorch-to-the-family jewels routine, I'll bet. Hey, you want roasted nuts, let's break out the Planters.  Oh, I don't know. It was an accident.  We're anti-social. We don't have any friends.  Who's writing this dude's dialogue?  We're on to the game, ese. You got the fake blood splattered all over the walls, you got your torture tools... It's all very cute. But come on, let's quit while you're ahead. I'm only trying to save you a beatin'.    Keys. You got 'em?  Hand 'em to me.  I hope you're getting paid extra for this.  Aw shit.  Help me with this guy.  That only works if you're a man!  You alright?  Keep your head down, I'll be right back. I'm gonna steal us some wheels.  Looks like we're in the middle of the drug war.  Alright Mr. free-for-all, you go that way, I'm gonna go this way. They can't follow us both.  Go!  Shit!  I'm gonna need to hit the trees after a night like this.  Nice of you to draw me a bath. Is it Saturday already?  You're a cold piece of work. You almost got three people killed out there.  You want the cheap backstory? The runaway mom, the suicide dad and the foster homes? Gimme a break. You're not interested in my past, you're interested in my future as some kind of spy.  I'm not interested. I've already got a job.  I plan on getting a lot older. And playing spy games sounds like a quick way to get yourself dead.  What's this? You're gonna try to scare me now?  Now I'm the one who's nauseous. So what's the deal? What do you need me for?  What do I get out of it?  You're one sick bastard. A sadist with a badge looking to rope me in to a suicide mission. I think no matter which way I go I'm likely to wind up face down on a sheet of plastic. So here's my answer: kiss my ass, Hop-along.  Not bad for a gimp.  I'll take that under advisement. Maybe I can be like you and lose a leg for the old Stars and Bars. I bet the flag's a great comfort every time you need help climbing stairs.    You tell me.  There better be a movie on this Goddam flight.  How about a pedicure as long as you're down there. What's this? Lo-Jack?  Yeah, I spy or I die.  You must stay up late to come up with shit like that.  Fine, but I'm not gonna be no Bulldog Omega 5.  Up yours.  Is that all?  I've got something for you to chew on. Next time you send someone to save the world, make sure they like the planet the way it is.  Slick graphics, huh? See these dudes? They're called \"Anarchy 99\", they're the bad guy bosses.  You wanna check it out? Come here.  First we've got Anders, the psycho looking biker. In charge of transportation and smuggling. Controls every trucking union in Eastern Europe. Don't look too clean, either.  Next we got a Siberian redneck, Viktor. Into snowmobiles and snowboarding. So naturally, he covers prostitution and the drug trade.  Kirill, the sniper. Looks like a bookworm, but he had 72 confirmed kills in Chechnya, they called him the \"Finger of God\". Assassination and weapons.  You like her, huh? Petra. She runs their finances, money laundering, computers. Joined the gang after spending some time as the girlfriend of this dude, Yorgi Azar Zimin. Capo of Anarchy 99.  Yorgi masterminded the take-over of three Red Mafiya clans. Cops called it \"blood week\". He combined all of their global enterprises into one huge crime syndicate: Anarchy 99.  What are you gonna do? They're Euro- trash.  Just about anything I want, it looks like. This is gonna be tough, though. There's no way to save this game. I gotta get it right the first time through.  Nothing, really. My guy is just doing it to stay alive.  Like what?  This is bullshit, man, I wanna see some ID.  You're both named Ivan? That's gotta be confusing on Valentine's Day. So where we headed? Fellas, I said where we headed? Yeah, whatever.  James Bond never had to put up with this shit.  I've been on a plane for twelve hours, I think I'll stand.  Here we go again.  First of all, you should kill whoever sold you that suit. Two, I don't wanna be here either, so just step off. Three, if you had the authority to shoot me you would've done it by now, so just ease up on the machismo, bitch. Now that we've got that sorted out, I'm gonna get some rest.  Nice hops.  That's the guy.    Look what we have here. Czech 5-0 on the mack.  He flashed his badge to half the bar when he bought his drink.  Thanks, but I'm here on business. I heard you're the G around here. I'm looking for some cars, expensive ones. A lot of them.  I'm talking about the sports cars that disappear off the docks in Genoa and wind up here. If you don't know about 'em, who does?  I guess I heard wrong.  When else are you gonna do it?  Cops arrested me while I was still in surgery. Did two months.  Ferrari's, Lamborghini's... high end pasta rockets. Ten to start.  I have Japanese buyers who are looking to move a fleet, if you have the quality of merchandise they're after. And it's a mil two, max.  Is she for real? Honey, maybe you should quiet down and let the grownups have a conversation.  Sure. Just chisel some off your heart.  It'll work faster if I have an account number.  Wouldn't dream of it. I'm even gonna throw in a few extra bucks to send you to charm school.  I believe I can hang with you fellas for a while.    Buddy, you sent me here to get close to their organization, that costs money.  I'm already on a first name basis with these dudes, I got a deal set up, you want me to hammer it or not?  What the hell am I after? You're telling me dick.  Call me crazy, but I thought hooking up a million dollar deal was a great way to get on their good side. What else? You gonna hassle me about the weapons and spy stuff too?  I know, poison needles in my shins. You've got 36 hours. Peace, out.  That's would be me.  Yeah, thanks a lot.  I stole your beat, huh? Guess you forgot to brown-nose the right people.  Why don't you show me some gear before you get hurt.  What is all this? I didn't even order some of this stuff.  Kinda looks like you.  They come in any other styles or colors?  That one I'm real familiar with.  I think I'll hang on to these.  From the Beastie Boys collection?  You're joking, right?  I thought that was in detail.  Very nice. I'm impressed.  I had to inspect the merchandise first.  What's this?  You're alright, Yorgi.  You tell me! You got a sniper up there or what?    I've got him. Buckle up.    What's \"Anarchy 99\"?  You wanna see my politics?  Screw the world. If I'm gonna die for something, it better be bitches and money.  \"...try walking into a deli and urinating on the cheese\". 'Anarchy Burger' by the Vandals.  How you gonna do that with government and rules everywhere?  This is great, dancing with the back of your head.  If you got a problem with me, why are we dancing?  You do everything Yorgi says?  It's gonna be like that, huh? You got all bent out of shape as soon as he started dancing with someone else. Why's that?  Did you guys used to date? That's it, right? He broke your heart and you're still soft on him. That's funny, it don't seem to fit with a tough broad like you.  Where are you going?  I was invited. What's your story?  Come on, don't front like that. You'll put a guy right off you.  That right? Why's that?  You got a great set-up here Yorgi. You really know how to live.  I've been here before, when I was a kid. My old man was in the service, we used to live on the Army base in Hamburg.  Hell no. My dad was a straight up tin soldier. Somehow he pissed this general off and got himself dishonorably discharged. Had a court martial and everything. The charges were total bullshit, so he was sure he'd get his name cleared, but it didn't happen.  My old man, he bought into the system, and it screwed him. So he swallowed a bullet. Me, I don't believe in nothing I can't see and touch.     That's alright, I'm kinda tired.  You gonna tuck us in?     Listen, no offense, but I'm not in the market right now, okay? You can stay here, but let's not --  You don't understand a word I'm saying, do you?  Stupid, right? That's what I was trying to tell you. I just got out of this heavy thing...  The things I have to do for my country.  Looking for a phone book. I want to call a cab. Unless you wanna give me a ride?  We hung out last night, remember?  Hey, take it easy. I'm just a dude trying to make a buck.  You've got to relax, baby, you're paranoid.  Hey, you're good.  That makes two of us then, sweetheart, because I ain't buying your bullshit either. You're not like them, I can see it in your eyes. So you tell me, who's bullshitting who?  The eyes don't lie. All this has gotten to you, hasn't it, Petra? You came in as Yorgi's girlfriend and you stayed because it was fun. Now you don't like it so much, but you're in so deep you can't get out anymore. Tell me if I'm wrong, Petra.  Look at you. You're helping run things now. You're a gangster. I bet that snuck up on you. You woke up one day and you were a criminal.  It's cool, I feel you. I might even be able to help. Here, let me show you something. You wanna see what's in my pocket, I'll show you.  I'm an information gatherer. You wanna go somewhere and talk about it?  I'm just gonna have a garden salad. Oil and balsamic vinegar on the side.    Let's just say I'm freelancing and leave it at that.  Don't judge a comic book by it's cover.  I know where he's coming from. The only thing I really don't get is why he dumped you. Up until I found that out, I thought his judgment was pretty sound.  The people I know want facts, the kinds of things an insider would know. They're interested in putting Anarchy 99 out of business.  We could work together. Then maybe we could both get the hell out of here. There's a beach in Bora Bora with my name on it.  So there you have it. I guess you just have to ask yourself, how bad to you want out?  What's up? Is there a problem?  What are you talking about?  It's a long story, but yeah, more or less.  If I go out the back, he'll know you've warned me.  Not an option. Just get up slowly like everything's cool. Petra, trust me. You just hung yourself out to dry for me, I'm not gonna let you down.  They'll kill you, you know they will. Besides, there is no back door. Keep smiling. Ready? Now.  Very nice.       Let's see what's going on inside...     What the hell are you guys stealing?     What the hell...?  No way, man, no way. I'm just supposed to be an observer. Aw shit. This job sucks.  Toby Lee Shavers, if this thing don't work, your ass is kicked.  Son of a bitch!  Is the boy alright?  You sure?  Captain, huh? You get a lot of broads with that uniform?    Yeah, I sent you pictures. Here's what I'm thinking. If they take out the cameras and sensors, they could probably put a bomb in this thing. You drop it in the water in the Red Sea and three weeks later it's swimming up the Potomac.  Hey, one miracle at a time. They're on to me now, remember?  Thanks.  You ain't seen nothing yet.  Get in. We've got work to do.  I want all that... In there.  Right behind you.  So what's the plan with this Ahab? Are they selling it or what?  We've got to find out what it is. Can you handle that?  What's that?  You're what? What the hell have you been doing?  I'm busted up for you, but Jesus, what the hell are you doing? Those people almost drowned on that boat and you didn't lift a finger.  Get your head back in the game. There are lives at stake here.  When can I see you again?  Great piece of hardware.  Damn.  Speaking of people that are full of shit, funny you should mention those guys!  They put their records out through Sony, one of the biggest corporate machines on the planet. Some revolutionaries, huh?  Slovo?  Dude, what are you doing here?  I found something big enough for us to take these guys down with. They've got a of nerve agent they're gonna unleash.  Yeah, give it here.    Why you dogging me up?  What the hell are you doing? You could've killed me!  I don't know what's going on anymore. I thought I was square with that dude. Now everybody's switching sides like it's the WWF.  What are you doing with the Ivans?  Where are we going?  Wait a minute, whoa. We can't go now. What's Yorgi got planned with that nerve agent?  Of course it matters. Hey, hold on!  Petra, this ain't about the people that sent us here, you know that.  We can't leave now. We have to do something.  Alright, so I was full of shit. I thought believing in things was wrong. Turns out believing in nothing is worse. You might as well be dead. I'm not thrilled with the world, but I'm not gonna let those idiots start killing people. Come on, you're a cop, we've got to get these guys.  We'll have to go after them.  A long time ago I learned how to put fear away in a little place in my head. Maybe that's my problem. If you don't feel fear you can do some amazing things, but you can also screw your life up in ways you can't imagine.  You don't have to do that.  Aren't they gonna wonder were you've been?  When this is over, we're just gonna take off, the two of us. Take a vacation.  That gives us something to live for.  Nothing like fresh powder.    Snow covered fortress. Army of bad guys. The usual.  They retrofitted Ahab with some kind of rocket launcher. They were loading canisters of liquid into it, light colored and dark colored in the same tube but separate. Something tells me this it that \"classified\" stuff you didn't want me to know about. Does the song \"Silent Night\" mean anything to you?  Come on, Gibbons, you can do better then that.  Jesus Christ, Gibbons, this is something we came up with?  Kinda funny, though, isn't it? We're not supposed to be making weapons like that anyway. Guess we shoulda played by the rules.  We don't have that kinda time, boss, I don't think Prague's gonna be around much longer. I've gotta go now. I've got a lot of bad guys to kill.        Don't forget goatee boy. I greased him up on the diamond run.  I wanted to get the hell out of Prague before Silent Night falls.  What's the gimmick, Yorgi? That's the part I don't get. You gonna hold the world hostage with your gas bombs? I didn't think you were dumb enough to go with that hack cliche.  So all by yourself, you're going to destroy every government; in the world.  Including rape, pillage, murder.  And here I thought \"anarchy\" was just something cool to put on a Tshirt.  He's a regular humanitarian. And all this time I thought he was just a tool.  Oh just shoot us already. I'm sorry I asked.  Hey! We're on your side!  Petra! Tell them something!  How's Ivan?  Thanks for coming, man, you guys were right on time.  Let me guess, they had a big white torpedo with them.  Did you do your homework?  Let's do this.  Where's he headed?  You get down! I'll take care of this fool!  Goddamit! He's gonna stop playing around soon and shoot something valuable!  Let's see what my man put together.  Where'd the damn truck go?!  Toadies right behind.  You okay?  I'm sick of that guy. Let's stop playing nice.  I guess the surgeon general was right.  You can't talk to it?  A manual control on a moving torpedo. This day keeps getting better and better.  Radio Ivan! Tell him what's going down! Have them evacuate downtown!  It has to surface to release the nerve agent, right?  Use your grenades! Maybe we can blow it up underwater!  Petra!  No you don't.  I'm pretty happy to see me too. So are you done with me yet?  But I hate cops, remember? Except for her.  Who says you're the good guys?  Oh yeah? Why don't we start by taking this thing off my ankle? The poison needles?  No needles, huh? What about the acid bath?    You can't welch on me now. We had a deal.    It's about your next mission. You need to be debriefed.",
        "Cage": "",
        "Yelena": "",
        "Milan": "",
        "Sova": "",
        "Jordan": "",
        "King": "",
        "El": "",
        "Jefe": "Do you know what we do with people come round here? You know what we do with people come in our business?  We cut the Achilles tendon. Your feet flop around like a marionette. You ain't walkin' nowhere no more. Sound good, tough guy? Or maybe instead you wanna tell me something.  Whatchu doing here?  That's some accident, hombre. You accidentally fall out of a plane in the middle of the night and land up in my back yard.  We seen this kind of parachutes before, you know. U.S. Army. You got some friends here, jump out with you guys?  No friends, huh? That's funny, I don't know no U.S. Army that comes without no friends. That's cuz U.S. Army is pussies. They always come with the five hundred guys and the helicopters and the see-in-the-dark glasses. So don't you tell me you all alone out here, my friend. You bullshitting the wrong guy.  You ain't begun to see crazy yet, amigo.  You saving me? You talking pretty tough for a guy got himself chained to the ceiling.  Now you're gonna make me enjoy this, funny guy. Now I'm gonna take the whole foot off. Whatchu think of that?  What's that, eh? I thought you didn't have no friends!",
        "Yorgi": "This pizda? Never seen him before.  Cops. Like a plague. No matter how many you pay there's always another with his hand out. How did you pick him out?  I appreciate you bringing this to our attention. Whatever you want, the rest of the night, consider it on the house.  Sorry, man, don't know what you're talking about.  Xander Cage!  This is insane, man. Xander Cage in Prague. Come on, sit. Sit with us.  I remember that one where you jump the motorcycle over the freeway at rush hour.  We seen all your shit! So you want cars? We get whatever cars you need. What are you looking for?    Alright, now that business is finished, we party! Bitches, come! We have a drink and toast the deal!  Has it arrived yet?  Perhaps he is not all he says he is.  I'm somewhat less so. We seem to have a bit of a problem...  Of course.  This is a gift. From me to you.  It's a little nothing, you take it.  Come on, get in.  What in the hell...?  What's going on, my friend?  He's not with us, Xander. He must be with you.  Get him! Find out who he is!  That's the cop from the club!  What are you doing? Get in the car!  I don't believe it! You can't shoot a cop in the middle of the street!  You say you get a million, you get the million. Some cop gives us shit, he's dead. Jesus Christ, man, you're hard-core!  Total chaos, man! Welcome to Anarchy 99!  It's all this craziness! It's what we've been living since 99, when we left the Army. One of our brothers died in Grozny and we said the hell with this shit. What for? He dies for what? Politics? Who's politics? Not ours.  That's what I'm talking about, man! That's why Anarchy 99 was born.  To us it means no walls, no speed limits, no jails. It's everybody does what he wants. People think democracy is freedom but they don't have a clue. There's an old punk song. It says: \"America stands for freedom, but if you think you're free...\"  You got it, man. It's stupid but it's true. True freedom is when you do whatever you want anytime you want. That's when you know you're living, man.  Easy. You get enough money that you grow an ass big enough for the whole world to kiss.  You hang with us, buddy, taste some freedom! Petra! Dance with this guy!  Xander, check it out! The revolution begins!  Let's get some air, man.  It's a beautiful town, Prague. It's been good to me.  You, an Army brat? I don't see that one at all. Did you join the service as well?  Connections and politics, it's the same everywhere.     Next week these idiots are having a peace conference here. What the hell are they going to talk about? It's the system itself that causes all the world's problems. You're okay, buddy. Come on, it's getting early.  This way, girls, let's go!  (sorting through messages  I've got meetings this afternoon, I've got to get some sleep. Just pick a girl.  You want to insult me? This is my hospitality. Pick one.  Good, now find a room to crash in.      Something bothers me about you, Mr. Xander Cage...  Get Kirill. Now!  I'm inside the police mainframe. Do you see anything?  I've searched their E-mail. No funeral announcement, no obituary, no call- to-arms. Nothing on the news, even. I swear I saw a cop get shot yesterday. How come no one is talking about it?  I also check the wire transfer. I follow the money back to it's source, but there is no source. It comes from nowhere. First they bring CIA, then British SAS, now maybe they plumb the lower depths. Maybe now they send someone who looks like us. Maybe someone like our houseguest Mr. X.  Where is he?  Ready the boat.  It all happened so fast. Such an unfortunate accident.  Let's go.  What was that for?  You've been so quiet lately, Petra, I thought you no longer cared.    Perfect!  Xander, my friend, that can only be you. Why don't we put our weapons down for a few minutes and discuss this like friends. How would you like to come to work for us instead? We could Rage Against the Machine together.  Come on, you're the one who's fooling yourself. Why risk your life for your government when we can offer you a future that is truly free?  He blew the gate control. Anders! Get the bastard!  That was for Anders.  Look who we found playing outside.  Petra, my sweet dove, do you notice anything strange about X? He looks slightly less than dead.  Do you think I didn't know about you all along? My contacts in the KGB told me you were coming. You show up undercover and, I must admit, you play your part to the hilt. When it's time to be cruel, you are cruel. When it's time to be passionate, you are very very passionate indeed.  I could have killed you, but I thought this would be so much more fun. To twist you and use you how I see fit. And to be honest, you went much farther than I ever expected you would for your country.  And you. Why do you have such a problem staying away, my friend? Did you miss us that much?  Not bad, man, not bad. You put things together quick. Prague it is.  Nice place to start, don't you think?  You think I'm after money? I told you, my friend. Anarchy. Time for a change. Money is good, but for true freedom you have to get rid of the rules themselves.  Easier than that, buddy. I'll get them to destroy each other. You kill an entire Peace conference, someone is going to have to pay. Then our friend Ahab continues down the river to the ocean and begins his world tour. London, Cairo, Beijing... Pretty soon everyone's involved. These guys bomb those guys, those guys invade these guys. Soon the whole world is like your wild West cowboy days. No rules, no law, everybody free to do what they want.  Sure, if that's what you want. Why not? It's all human nature. So we just have to launch our baby and wait for the decline and fall of civilization as we know it.  Come on, Xander. You used to stand for something. What happened to you, man? I thought you'd get it.  You both could have been a part of it. You could have ridden with us into a new day, the dawning of a new age of --  Screw you too, buddy.  Hurry up, kill him!    I've got it, go! Cover me!  This is going to be exciting, buddy! Front row seats to the apocalypse! Come on, sing with me! \"I am an Antichrist / I am an anarchist / I... wan-na be... Anarchy!\""
    },
    "imdb_rating": "5.8",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BYjYwMzg4MTAtYTQ3NC00MjdlLWEzNGEtNzQwYzA3OGZmZWYyXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "Xander \"XXX\" Cage is a thrill seeker who until now has been deemed untouchable by the law. NSA Agent Gibbons forces XXX to cooperate with the government to infiltrate an underground Russian crime ring, and avoid going to prison. Gibbons sends XXX to enter this world of crime undetected where others have failed, using his natural athletic prowess and a whole lot of attitude. Xander must combat an organization led by a clever, ruthless and nihilistic Yorgi whose first target is the city of Prague.—Artemis-9",
    "name": "xXx",
    "genres": [
        "Action",
        "Adventure",
        "Thriller"
    ]
}