{
    "filename": "Yes-Man_script.txt",
    "imdb_id": "tt1068680",
    "imdb_url": "https://www.imdb.com/title/tt1068680",
    "characters": [
        "Tweed",
        "Homeless Guy",
        "Terrence",
        "Multack",
        "Peter",
        "Tillie",
        "Nick",
        "Lucy",
        "Carl",
        "Allison",
        "Stephanie",
        "Wes",
        "Ted",
        "Norman",
        "Rooney"
    ],
    "dialogues": {
        "Tweed": "",
        "Homeless": "",
        "Guy": "If you're interested, intro to Korean is starting right now.  You interested in learning Spanish?  I love cell phones. I breathe cell phones. I own, myself, thirty-five cell phones. My brother is an idiot and he's selling cell phones hand over fist. What do you have? A Nokia 9850?  Oooh, pretty lady.  Eighty five hundred.    Just give me the cash.  Basically.  You want to pawn --",
        "Terrence": "",
        "Multack": "",
        "Peter": "You're going, already?      Oh, c'mon, Carl. No one's seen you for like forever. Please swing by?  (over the answering  This is an intervention.    You've missed your last event.  Our engagement party.  You're watching Hell's Kitchen. That's not even B-list reality TV.   It's bigger than that. You and Kath broke up over a year ago and you still aren't dating anyone.   I don't mean to be harsh but everyone's moving forward. It's like you're still wearing a Timex while the rest of us each have entry level Rolexes.   Thanks for noticing. It's an Oyster Perpetual Yachtmaster. Sapphire crystal, self-winding. Four Gs. But that's not the point I'm trying to make.   What's wrong with Crate and Barrel? They have adorable stuff at reasonable prices.   Lifestyle? You have to have a life to have a style of life. You never leave your apartment. You never meet anyone new.   You've become a complete cave dweller.   Just the other day?   That was seven years ago.   You had started there three years earlier. Why you've worked at that place for so long is beyond me. You had so much potential. You shouldn't be a teller. You should be the guy who tells the guy who tells the teller what to do.   Actually, he'd be in fourth grade.          Excuse me?  If you don't want to be here, you don't have to be.  Oakleys, polarized lenses, indestructible. Two fifty but worth every penny.  If you want to be sitting so bad, why don't you say something?  What's going on with you?  She's a fancy lawyer making bank. It's about time she was buying.    I don't think I've ever seen a waiter tap one of those pepper mills.  Because you ordered a latte.  A normal-sized beer is fine with me.  We need a sofa, Carl.     We're not buying a second home.  For a whole year?  But for a whole year?  Well, someone sounds like they're yuppifying their life.  There's no way you can do this for a whole year.  Yesponsor?  You aren't going to last for more than a week.  Cavalli. Silk and cotton blend. Seven fifty.  That's too bad. I'm sure someone will offer.  Sorry, didn't bring my wallet.   Carl's sitting across from Peter in Peter's fancy law office. They're each eating burgers.   What's with the kitten?  I don't want a kitten.  Andy Solomon on line two.  Hey, asshole, we're not talking until you sign that goddamn contract.    She was upset you went on her date.  I think you're taking this too far.  You hooked up with a dude?  You hate Korean food.    Lawyer.  If you'll excuse me.  Nice job with Renee. She's definitely odd, but that's not necessarily --  What?   Why?   Don't get mad at me about it.   You can just stop.   You've gone from a passive guy who always said no to a passive guy who always says yes. Just saying yes is not a legitimate life philosophy.   I'm involved.   I can't see the difference. Honestly, I'm terrified.      It's marriage, you know?   The biggest thing ever.  I know.  I know.  Really?  But what if I really can't tell the difference between ivory and cream? Does that make me a bad husband?   Carl sits across from Peter.   You own an apartment because of that job. People don't generally leave good jobs.  Hey, honey. I think we should go with the tulips. I know roses are more romantic, but they're also much more clichéd. Babe, can you wait a second? I'm going to be on for a while. Ask your guru. He's the one who sent you on this retarded quest in the first place.  (over the answering  Why does he want us here?  Wow.    There's a horse in here.  What're you doing out here?  What're you talking about?  Say hello to her when you see her. Where is she by the way?",
        "Tillie": "",
        "Nick": "",
        "Lucy": "Rooney might throw up.  How did he take the break-up?  I'm so sorry.  It's OK, Carl. It's just brunch.  It's a two bedroom duplex with harbor views. It'd be perfect for you Kath.  That's... OK. Do you want a bite of mine?  Congrats, Carl!  I think I'm done actually.  Well, it's been fun watching you guys recreate freshman year, but Peter and I have some furniture errands to run.  It was good seeing you.    You should come out more often.  My girlfriends are being such bitches. It's been two weeks and no one's offered to throw me a wedding shower.    I was kidding. Wedding showers are thrown by girls.  Thanks.    That means a lot to me.  Who was that?  How'd you meet?  So, I know it's just a wedding shower, so who cares really? And it's like so lame? But I've made an appointment at a stationery store. Are you going to totally kill me?  Ooooh, pretty. What do you think?      Nothing special. Just hors d'oeuvres and wine.  I'm not doing Bridal Bingo.  Can we concentrate at the task at hand?  That's kind of cute.  That seems a little extreme.  You're really good at this. You mind helping me with the wedding invitations?      What happened?  I've never heard of a Wedding Shower cake.  I'm sorry, it's just you've been so great at all this while my husband- to-be has been completely absent. Do you have time to grab a cup of tea?  Is he scared to get married?    Is that why he doesn't care?  You know how to show it. A wedding is a huge deal. I'm so scared.  I know that and yet I'm still so scared.  He can be just so closed off.  You've been so good to me. I've really come to depend on you. I want to pay you back.  Peter tells me you might have some disposable income these days.  If you want to look at some open houses, I'm happy to waive my fee.  So this is at the very top end of what you could probably afford. Are you interested?  Are you sure? I mean, this is the first place you've looked --  I'm looking forward to meeting Renee tonight.  We're all having dinner.    Tonight. Remember?  Least I could do. At least he's involved with our wedding.  What do yo do for a living, Renee?  Real estate broker.  He doesn't know crap about wine. Just pick one, Carl.  Do you rent or own?  If you're ever interested in buying, you should ring me up.  It's been hard to reach you.  Everything OK?  I was wondering when you want to meet with the florist.  You're just stopping, just like that?  He is helping. Here I was thinking we were actual friends.  I have no idea.  Who are all these people?  Thanks, Carl.",
        "Carl": "I'm here, aren't I?  So I discovered b-school's not for me. People grow.    Of course I care.   But I also understand.  We're at different places in our lives. I get it.  That would be inappropriate.  C'mere.   It'll be OK.  Well, that was fantastic.   Good night, guys.  I saw the ball drop and hugged all of you. Aliens didn't invade. Our computers are still working. What else could possibly happen?  I see that happen like every night. Good night and Happy New Year.   Carl goes into his apartment. He lies down in his bed and closes his eyes. CLOSE ON THE ALARM. His alarm goes off. Carl HITS IT off. It's now DAYTIME.     Carl gets dressed.   He puts on a nametag for Southwest Bank.     Carl walks down the street, fast. He passes a CUTE GIRL who's name we'll learn is RENEE passing out flyers for a band called \"The Flying Buttresses.\"      I don't rock out.  No thanks.  No.     I'm not a soldier.    Sorry. Today I'm officially a greeter.  Someone might come. And if I'm not here, they won't be greeted.  Until I'm relieved as a greeter, my hands are tied.  I'm Carl Kendall.   Just a teller.    No, but this gentleman can.  Will do!   Carl microwaves a Lean Cuisine.     Carl watches Survivor while eating Lean Cuisine.     Carl lays down and closes his eyes. The alarm GOES OFF again. PULL BACK to reveal it's morning.    No thanks.  No.  Can't.   Carl warms up a frozen pizza.     Carl eats the frozen pizza and watches Big Brother.     Carl lies down.       The alarm FLIPS ON.   No.  Sorry.      No can do.           Carl's lying on his bed.      The phone is ringing.   He gets up and answers.   Hello?  I'm in bed. Why?       What happened? Did someone die?  It's already 11:15.     I don't think I can make it.  No.  Tell everyone Happy New Year.  Alex Eberts? What's up, buddy?  Where've you been? Norman's been heartbroken since you quit.  Same old same old.  You kidding? Every day it's impossible not to throw rocks at the place. Since you don't work here anymore, you want to throw a couple?  What're you doing!   Stop that!   I was kidding!   Carl walks into his apartment.    He hits PLAY on his answering machine.    Carl's watching Hell's Kitchen and eating a frozen pizza. There's a knock on the door. The \"Just Say Yes\" pamphlet balled up on his desk. He's using it as a napkin. Carl PAUSES the television show. He stands up and opens the door. Peter STUMBLES IN.   What are you doing here?  What're you talking about?  I'm sorry.     I'm just really busy.  So I don't want to go out tonight. Maybe I have to wake up early tomorrow. You don't know.   What? So? I'm like a sexual camel. I only need it once every couple years.   You wear a Rolex?   So I don't have an oyster watch. All you and Lucy and Kath do is sit around and talk about real estate and Crate and Barrel.   Forget Crate and Barrel. Maybe I'm just getting more mature. I don't need the lifestyle ever night.      I hate meeting people.   I am not a cave dweller. Just the other day, we all went to Summerfest and snuck backstage and you bet me I wouldn't steal something and so I stole a drumstick from that horrible Swedish hillbilly band. That's not very cave dweller of me.   But that's not possible -- I was already working at the bank by then.            I don't know if I want that.  Cool. Do you want anything from the refreshment area?  That's OK.     I'm just auditing.  I'm cool right here.  Carl.  I wouldn't say that.  It wasn't exactly my idea.  Honestly?  This whole thing seems retarded.  I wouldn't necessarily --  A little.  It is.  I'm not sure --  Yes?   Carl's asleep. The phone starts ringing.     Carl sleepily grabs the phone.      Yello.  Don't worry about it.  Oh, thanks for the invite, but...        Why?  You kidding? I love brunch.  Why do people wait an hour for breakfast? It's so hot and bright and we haven't even had coffee yet.  Of course I want to be here. I love waiting an hour for eggs. It's fun. Although I will point out that you have sunglasses which is probably making this wait a lot easier.  We were definitely before those Lowell people.  Why does no one ever say anything?  Yes.   I will.  Excuse me, but we were here before those people.  Yes, we were.  Well, this time the list lied.  (to the people who are  I just want transparency in terms of the brunch seating order.      Bacon and eggs.  I don't want an adventure first thing in the morning.  Yes.  Yes.  Yes.  Yes.  Yes.  Yes.  Yes.  Yes.  Yes.  Coffee.    And juice.  Yes.    Yes.  Yes.  I'm just addicted to the stuff. Chinese cultures say it's good for digestion. You're all welcome to have some.    Uch. Brunch coffee. Why can't they make it black without all this frothy shit?  I don't think... there's any reason why I shouldn't? On a Saturday there's nothing I like more than the inside of a bank.  Yes.  All of them please.  Of course I'll take a flier.    Carl.  Yeah. I just though it would be a fun way to lighten things up.  I spent my own money on them...  How may I help you?  While loans aren't normally in my jurisdiction, I'd be happy to help you.  Yes.  Yup.   What's your business?  Adorable.  Let me just get final approval on this.  No, I know, so if you think this is a bad idea for a loan that's fine but can you please tell her yourself?  Her business plan.  That's silly. How're you supposed to start a tiny business if you can't get a tiny business loan?  Do you maybe have any interest in borrowing ten thousand?  Of course we can.    One moment please.  Diet Coke?  It's approved.  Thanks, Marge. We don't like to make other customers jealous so can we keep this between you and I?  That seems like a lot of responsibility.  Grand?  Next Saturday... sounds great.  Wouldn't think of it.  Believe it. Because this guy just got a promotion.  Yes.  Why not?  Yes.  Have a good day yuppifying your lives.    I have not been this drunk in years! The room is spinning in a bad way!  Where's the class?  Yes.  That girl is hot. Or at least she seems hot. I'm kind of too drunk to tell. Right now, honestly, you seem hot.  Yes.                               I think I'm done.  Carl downs the jello shot.     He stumbles a little.   Sign me up, bitch.  (singing/talking with an  Well I guess what you say is true, I could never be the right kind of girl for you, I could never be your woman.  Well I guess what they say is true, I could never spend my life with a man like you, I could never be your woman. I could never be your woman. I could never be your woman.    Then yes.  Yes, I do.     Very much.  Yes, I am.  I will.  Me bringing it.  I'm too drunk to feel!  I'm like Darkman!  You do not cross Carl Kendall.  Yes.   Light is streaming in through the window. Carl opens his eyes. He's in bad shape. He looks over to see the Hot Girl finishing getting dressed.   Your fiance?  I thought you said you two weren't even dating?  Hi... is there a Sanji Gupta staying here?  I'm Carl.    The guy from yesterday.  No thanks. I just wanted to thank you for that inspiration.  You know, just living every day to it's fullest. And, like, learning to continue to experience life or whatever.  I just said I'm going to keep experiencing life. I thought you'd be happy.  So what should I do?          I say... yes.  Is this like a legal document?   Yesterday I got promoted and beat up and hooked up with this chick and I have a massive headache today and I still might throw up, but I don't care because it was the best time I've had in like forever. Not to mention finding out that, despite what you might think, smoked whitefish in an omelette is delicious, even if covered in a thick layer of pepper.  You don't   understand. I got promoted.    Do you know how long I've been   waiting for some kind of financial   step forward? I said `yes' and   it arrived.  Excuse me for wanting an appliance in my kitchen besides a hot pot.  That's where you come in.   You're my \"Yesponsor.\"  Like in AA. I need you to hold me to it.  I look forward to proving you wrong.  Nice suit. If I move up anymore at the bank, I might need a few.    That's sexist. Please.      I insist.  Yes.    What kind of beer do you guys want?   Carl wakes up.   He looks at the tattooed \"Yes\" on his hand.     Carl goes through a series of junk mail flyers for credit cards. He VERY CAREFULLY fills each one of them out.    Black coffee, large.      What's the hurt in taking another?  Of course.     I couldn't say `no.'  Even if I wanted to.  Dear deposed King of Nigeria. I would love to help you anyway I can with your confidential transaction. Please let me know what I can do. Yours, Carl Kendall.  Would I like Viagra? Yes, I would.  Do I want a Persian wife? Perhaps I do.  Norman, would you say I prefer Iranian, Pakistani, Bangladeshi or no preference?  Yeah.  Where did you hear that?  I told her not to say anything.  I might have some stuff to pawn./I will definitely check out your gun selection./I would like to learn Korean.  (in Korean, with  I disagree. I think you hit some pretty high octaves.     \"Big Balled Water Nymph\"?       It's a working title.  Sure.   I love clearing stages.  So early?     It's only 8:00?  You're a photographer too?  What time do you leave?  Wow. I haven't seen the sunrise maybe ever. I guess now I'll be doing that tomorrow.  Hey, Kath. Would you like one? I'm going to learn Swahili.  Seb?    What is that?   Swedish?  You're on a date then?  He's very tall.  Well, it was nice meeting you, Seb. So I'll be going.  I'd love to. Join you guys.  So, how did you guys meet?  Yes.  Oh, this is good. I was walking past Pizza Hut the other day, and for a second I was sure the sign said \"Pizza Hat.\" And then I thought, wouldn't it be funny if there was a shop that sold hats shaped like pizzas? You know. Because it sounds like \"Pizza Hut\" only it's a hat shop.  Shit.   Carl flips on his computer. He's trashed.     He has a bunch of emails. He clicks on the email.      Carl's alarm goes off. Carl hits it and sits up. He grabs his head and then runs to the bathroom and throws up.    Good morning.  Well, it is five in the morning.  I thought I'd use my phone.  That's what I thought.  As it was meeting you Farinoush.  Will do.    Should I call you?  Farinoush Azzam. Great girl, but I don't think we're right for each other.  PersianWifeFinder.com. Let's talk wedding shower.    Looks good to me.  I'm just helping throw the shower.  Look at this -- Bridal Bingo. What's Bridal Bingo?  That sounds fun.  How about a calendar shower?  Do you even know what a calendar shower is? Maybe a calendar shower is awesome.  I think that's really cute.  Look at this one -- \"Knights in White Armor.\"  You have got to do that.   Like it's not even a choice.  You only get married once.  How much do you need?  Done.  You promise you'll pay it back?  What am I doing?  I'm sorry, but it's absurd that if you need a small amount of money you have to go to a loan shark. Only rich people can pay back loans over ten grand. A bank's job is not to just help the rich. It's to help anyone with a dream achieve it.  Thank you so much.   Rooney sits down across from Carl.   What do you need a loan for?  Why don't you hire movers?    Yes.   Do you want to help at all?  Where are you moving?      I'm kind of in a rush...  Well, that's really neat. So, thanks for the books and the jasmine tea and the vegan curry, but I have to go --  It was really great meeting you --  I really have to go.    Do you have any candles?      I just love candles.  How about wine?       Like a bottle of Beaujolais?  I have herpes.  Downstairs?  It's a swinging door!  I just adopted her. If you're interested, they're giving them away in front of Petco.  Neither did I.  Seems like a nice guy.  He asked me to join them.  I have no choice. I'm a yes man. I must say yes. If Seb asks me to join them on their date, I must. If some dude asks me for a loan I have to give it to them even if it's clearly never going to be paid back. If a guy asks me into his bedroom, I must hook up with him.  It's like hooking up with a strong woman. I honestly don't see what the big deal is. I am guided by yes. Yes has become my superpower. And let me tell, yes is turning out to be a pretty sweet deal. Now if you'll excuse me I'm late for Korean class.  That's no reason to write off an entire, vibrant culture. See you later, buddy.  You really are displaying that.  Wow. That's really big. How do you have time for all this stuff?  You gave me the flier, so I had to go.  Do you want to go out sometime?  By the way, I do other stuff besides follow you around.  I take Korean.  I think I'm good.   To have some more.  So, all this art you create.   What do you want to do with it?  Like, do you want to open a store?  They're not terrible.  I think you're being hard on yourself --  When?   Like in a couple years?   People always talk about that, but you're actually doing it.   It's lame, but you know, it's pretty funny. My boss Norman always throws theme parties.   Because... it's actually not lame. I just gave the answer I've automatically given for years. I'm actually enjoying the bank for the first time maybe ever. I started this pilot program that gives out microloans.   Like say you need three hundred bucks to pay for paint so you can start a house painting business. Rather than paying a loan shark who charges you 300%, now you can come to Southwest Bank. Whatever. It's kind of dorky.      (in Korean, with  Funny, not crazy.    My boss is white noise.  You know, like totally boring.  I wouldn't bother.  We don't have to stay long.  I'm Carl.     This is Renee.  I don't think so.  So, how do you know Norman?  You're in a karate club?    I'm Carl.    What do you do?  Cool.  It can't be that bad.  So did you let him in?  If you hate your job so much, why do you do it?      I say yes. To everything.    Say Yes More. It's that simple.     Carl and Renee walk into Carl's apartment. Ten kittens and puppies come running up to them as they enter.   I just love pets. This is Veronica, King George, Owen, Carl jr., Carl the III, Carl IV, Bubbles, Greedo, Cat 1, Cat 2 and Cat 3. At the end there, I got kind of bored of naming them.   The room is piled floor to ceiling with boxes.   Renee starts to go through the boxes.   You don't need to do that.  I have a congenital heart thing it helps. And it's cheaper than the stuff that's made here.  It's cheaper to buy in bulk.    Is that a crime?  Yes.   Renee and Carl lie next to each other.   I give great massages.  How much does a Schwinn cost?  Done and done.  Really?   Because I have a thing at one...  I actually met you when I was just a teller.  Thank you.  Generous helpfulness?  Uh huh.  Janice Peabody's ant farm rental business.  I've started a microloan project. I figure that if someone needs less than ten grand why should they go to a loan shark when they can come to a legitimate banking institution?  No.   I wouldn't do that.  Thank you.  Yes.  Yes.  I'm sorry -- bank meeting stuff.  You have to have one. Modern Bride calls them a necessity.  Sorry, Luce. Work stuff. Yeah, I can definitely be at the blood bank in twenty minutes.  Are you OK?  You know Peter. He's a man's man. He cares, he just doesn't know how to show it.  You guys are perfect for each other.  Maybe if you're just honest with him about how you're feeling it'll be OK.  Sorry, the bank, you know? The UFO conference is tonight? No, that's fine, I'll definitely be there.  I'm sorry.  Not necessary.  For some reason, the bank keeps promoting me.  Yes.  Yes.    I've got to run.  What?  Right.   Of course.      I'm sorry I'm late.  It was work, it went crazy late.  Long story. Miss, could I have an orange juice? Like fast?    Oh, this old thing?   Prada, I think.  You should check out her pottery. It's really big.  Well, we're kind of in a celebratory mood.  Maybe we should wait for Peter to decide.  Why not?   Let's celebrate.  It's a really nice corner though.  It's on me! I'd like to split it between an Advanta Blue Business, Mastercard, a Diners Club and my South Dakota Bank Visa Check card.  I just spent $1500 on dinner.   Because the waiter asked me if I wanted the expensive wine and you weren't there to stop me!   No I can't. If I didn't say yes to the band flier, I never would have met Renee. If I hadn't said yes to taking charge of bank day care and then yes to becoming a loan specialist and then yes to the president's golf trip, I wouldn't be moving up. Each yes leads to the next one. If I stop, it could all fall apart.   I don't know why I should be taking advice from a guy who's wife is pissed he's not involved at all with the wedding planning.   You told her you don't care whether the invite's cream or ivory.   What?   Why?  But you guys have dated for years.  You're perfect for each other.  She's terrified too.  Of course she is. I think you'll both be a lot less terrified if you're terrified together.  What matters is that you pretend you can see the difference.  They're a little stiff.  I'm actually going rollerblading with Ralph.  You know, crazy rollerblading guitar man.  Any interest?  Yes.   Carl and Renee are making while Carl surreptitiously checks his watch. Finally, Renee stops kissing him.   That is really good to know.    I do this whole Habitat for Humanity Thing.  (in Korean, with  Just a little.  Is it a problem if I've never played golf before?  Metaphorically?  I do.      That's really far.    Just keeping them on their toes. Reverse psychology. Tiger Woods does it.   Of course not.  Male. Apartment. I prefer light beer. Three to five times a week. Orlando.  Chris, you hit a 90.   Nice one.  Joo-Chan hit a 95. Nice work.      As for Seung Kim. You hit 453.  And as for me, I hit... ... 503.  I'm sorry to say that team Korean Bank International has won.        You're very sexy.  I just got promoted to bank manager.   Have dinner?    Yes.    (with an unidentifiable  My Singaporean accent.     Pretty good, right?      I've been promoted.     I've got money to burn.  Tony.  I'm sorry.     I've been busy.  That's our flight. We should probably get going.  See you soon.  Where's your seat?  This is an aisle. That's a middle.  Well, clearly we should go there.  I had no idea that the earliest switchboard operator headsets weighed ten and a half pounds. That is fascinating.  Not at all.  We're here. We might as well.    There's, uhh, no power steering.  I'm sorry about the barn.  Just don't sue me.  This day has been so randomly incredible.  Yes.  Definitely.  Yes.  I'm definitely falling for you.  Like you want me to bring it with me? On the plane?    National Enquirer?  Just a gift for some buddies back home.  I don't know!  Yes. I'm sorry. Just let the girl go. She doesn't know anything.  Some old lady gave me a package in the Lincoln airport to deliver to her son, Sheldon Winkleton. That was really stupid of me and I realize that now. I don't know anything about anything.  Yes.  Yes.   But that's all.  But that's the only bad shit I've done. I swear.    I can explain.  Look, when the nice lady asked me to take them on the plane, I thought they were chocolates.  I know how it sounds.  Wait!     I'll explain better.  Yes. Pardon the pun.  See? Do you get it now? It's nothing, just a glitch really.  I don't.    It wasn't a lie.  I don't care. Just take it all.  I'm not a drug dealer --  You got to do what you got to do to help Mr. And Mrs. Shareholder.  Totally.     Carl's office has VIEWS of other corporate parks. Despite the fancy digs, Carl's depressed. Chris pokes his head in. Carl's on the phone.     I thought I was just implementing the microloan program.  Sorry about that.  You can't close the Maple Branch!  You don't have to if you don't want to.   Norman's crying.   Rooney's getting worked up.   There are other banks.  You don't even work at the bank.   Carl then RUNS into his office and sits down at the desk. He's covered in sweat and is breathing heavily. Chris pokes his head in.   Those dicks.  I think I made a mistake letting Renee go like that. What if I'm supposed to go on that trip?  But the bank doesn't feel right...  Hi, Sanji.     I'm Carl.   Kendall.  Actually, I had a question for you...  I'm sorry to bother you again --  I have a really important question. I have to choose between traveling around the world with a girl I'm really into or choosing a job that will make me pretty well off. I don't know which yes to take.  I don't know why that's important.  A lot, OK?  I don't want to go to a seminar. I just need help with this question.     (yelling to the   Carl returns home.    Rooney's on the couch, wearing a headset playing Xbox Live.   Out!  You've slept on my couch for four weeks. You're a grown man. Now sack up and get the hell out of here.  Are you deaf?  You knew?  Get the hell out of here.   Carl's in front of his computer. There are a bunch of emails selling Viagra. He angrily deletes them all. He gets a letter from the King of Nigeria.   Omar, Let's cut the crap. You are not a king. You're probably just a teenage con artist jerking off somewhere in Russia. Write me again and I will find you and beat your stupid lying face in. Dick. Sincerely, Carl Kendall.   CLOSE ON THE ALARM.   His alarm goes off.   Carl HITS IT off. It's now DAYTIME.     Carl gets dressed. He puts on his suit and tie. His apartment is noticeably nicer than the last time we saw it.    No.  No.   Carl sits in his office.   Lucy walks in.   Hey, Luce. What're you doing all the way over here?  I've been a little swamped.  Yeah.   Things are great.  Sorry, but I'm too busy these days. Don't have time to help with the party anymore. Good luck.  I'm not the one marrying you. Maybe you should ask him for some help.  Have you guys thought that teenagers don't have the financial knowhow to use a credit card?  Include a Mastercard with every xBox.   Carl gets home.   He hits play on his answering machine.       Carl's alarm goes off. He opens his eyes. He's PROPPED the post card up next to his alarm clock. The orangutan seems to be staring into his soul.     Carl's writing a list of names. The post card lies on the desk nearby. His secretary pops her head in.   The executives are gathering in the conference room to officially greet the KBI Officials.    It's an elderly orangutan actually. Could you please call everyone on this list and tell them to show up at Rudy's Bar &amp; Grille this evening at 9PM?  Will do.  I just want to say, it was really great having you as my first secretary.  You're not firing me, are you?  I don't think I'm going to be working here much longer.  I need to talk to you.  I don't know if I'm good enough at Korean --  (in Korean, with  (in Korean, with  (in Korean, with      You speak English?  For myself.  I quit.    Congratulations on your engagement!  I didn't have much time to throw this together. I got a stallion, didn't I?  I entrust you to sell all my shit.  Yes.  Well, if you do that's what my answer will be.  I just flew twenty-two hours. What do you think? Now can I please kiss you?      I'm here to see Omar.   The former King of Nigeria.  Omar! It's wonderful to meet you in person  I'm sorry for calling you a masturbatory Russian teenager.",
        "Allison": "",
        "Stephanie": "",
        "Wes": "Carl sits at his cubicle, flips on his email.    Carl stands in the middle of the floor staring into the middle distance. A CUSTOMER approaches him.    Carl stares up at the clock.   The clock finally CLICKS TO     Carl stares as the clock clicks to 5:00.        He's out the door.         Carl's eating lunch at a picnic table outside. Several bank employees smoke cigarettes near him. An oddly hyper guy named ALEX approaches Carl.    Carl STUMBLES INTO work, hyper from the giant coffee.    Carl's greeting.   A MIDDLE-AGED MOTHERLY CUSTOMER comes in.    Carl's trying to keep up as the customer launches into intense finance-speak.       Carl's at the loan desk.    Norman comes over, looking grave.    Carl sits at his cubicle, and flips on his email. In the background, we see various SUPER HAPPY EMPLOYEES eating the Dunkin Donuts that Carl has brought. We see on the screen another email from the King of Nigeria.    Carl's reading his email when a HIGH SCHOOL GIRL sits down.    Carl's sitting across from an Arab Guy at the loan desk.    Carl's sitting across from a LARGE MAN. Carl's hands are like claws. A line of people waits to speak with him.    Carl walks into the conference room.     The bank president, CHRIS PARKER, motions to a seat.      Carl stumbles into the lounge outside Chris's office.       The VPs are sitting around the board room.    Carl comes in, late, still covered in clay.    Southwest Bank employees and Carl stand in a picket line outside the corporate offices.    We FOLLOW Carl as he runs up the service entrance to the corporate offices.        Carl, Chris and the other VPs sit around the conference table.       Carl walks into the crowded room.   Korean executives and Southwest Bank executives mingle.   Carl heads towards Chris.",
        "Ted": "",
        "Norman": "My teller reporting for duty.  You're a soldier on the front line of finance.  So, Carl, I'm having a party this Friday. It's a funny hat party. May I entreat you to come?  That would be me.   Norman Calhoun.  Definitely.  Nice work if you can get it.   Am I right?  Check and check.  Think about my party, Carl!  Valentine party. Just wear something red!  Dress as your favorite animal --    -- historical figure --  What do you think you're doing? Alex Eberts! Is this an alumnae prank? I love pranks!    Hey, Carl. We're a little short on our Saturday staff. I know this is going against ten years of precedent, but you have any interest in coming in today?  There really is something magical about this place.  Morning, Carl. Thanks for coming in and being part of the Saturday banking experience. Oooh, Munchkins. Are those for the office, you dirty devil?    Kidding! Munchkins are always approved. Although, I can't reimburse you. Today is free Munchkin day. That's right! Free Munchkin day!   Carl stands before Norman.   You're a teller, not a loan specialist.  What's this?  Inta-maresting. My grandma loves beanie babies. Although unfortunately, we have a minimum loan floor of ten thousand dollars. She only wants five.  I don't make the rules, I just break `em. I don't break them. I just wanted to rhyme. If she wants us to loan her ten thousand or more, great. Otherwise, I think her only option is a loan shark.  Oooh, thank you. Feed the addiction, am I right?  Carl, could I see you for a moment?   Carl nervously sits before Norman.   Earlier today, you showed some initiative. And I loved it. What do you say to a permanent spot at the loan desk?  We need a loan specialist a lot more than we need a teller and greeter. Besides, you'd have a starting salary of 52.  No, dollars. What is this Darfur? Sorry, Patricia, that was inappropriate. Of course grand. To celebrate, next Saturday, I'm throwing a party. Dress up as your favorite character from Heroes. Save the cheerleader, save the world.  Don't dress as Hiro.    I got dibs.  May I speak to you, Carl?   Norman sits across from Carl.   I know what you're doing.  You're loaning below our minimum.  You thought I wouldn't notice the paperwork? I'm not the regional manager because I ignore the details.  I know. These microloans are pretty interesting. So I'll you spearhead a little pilot program at the bank.  If corporate finds out, you're the one who's getting fired. So keep it quiet.  We need a volunteer to think up local marketing ideas  We need someone to be a weekend cashier.  We need a volunteer --  -- to be in charge of day care.   Norman opens the door. He's dressed as the Japanese character Hiro from the show Heroes.   Carl! Welcome. Or should I say, uerukamu!  You didn't tell her? This is a dress-up as your favorite character from Heroes. Do you watch?  I don't know what to do with that information. There are drinks, chips, dips, various and sundry noshes. I entreat you to make friends. Let's get this party started!   It's very quiet.    A couple people mill about.   Baked Lays people!   It is on!   Everyone's standing around Norman. They've laid several pieces of wood out over a coffee table.   Hey, the boys upstairs are here to speak with you.  He asked for you specifically. Ixnay on the small loans-ay.  The bank's all I've got. Every morning I restock the hard candy, polish the safe, write today's interest rates on the board.  You should protest with us!  Yeah, throw a rock!",
        "Rooney": "It's true.     I'm very close.  Carl Kendall? Out in the world? Are you some kind of ghost? Am I having a religious vision?  Well let's get you a beer. You want a 20 ouncer? I'm just joking - -  Two twenty ouncers and one tiny, little beer, barkeep.    What do you say we have another?  You are a beast!  Whatever, yuppy sellouts.  Barkeep! Two more double pints s'il vous plait!  Well fortunately you're not the only game in town! Let's go to some place with class.  They wear uniforms here.  I am hot.  Yes.                               I think I'm done.  Carl downs the jello shot.     He stumbles a little.   You gotta do karoake.  C'mon, Carl, let's go --  You popped that guy!    He didn't know what hit him.  That was some good times last night. You back for more?  I've got no cash. You mind spotting me and my buddies?  As long as you're buying, I want a Grey Goose straight up./Kir Royale/Whatever's in that dusty bottle back there that you never take down.  What's up Carl? It's Rooney!      What do you say we grab a couple brewskis?  I don't. I was wondering if you were around tonight to help me move?  Because it's cheaper to ask you.   Rooney and Carl are looking at a fridge.   Can you carry the fridge alone?  You OK?  I wish I could, but I hurt my back trying to move that fridge.   Carl has put the last box into the moving van.   Rooney and his mom are hugging.   I'm going to miss you, baby.  And I'm going to miss you, ma.  I can't watch you go.  You must be Renee. I have heard so much about you. Can I watch?  We have to protest the merger.   Get some grassroots action going. Grass looks weak, but it grows everywhere.  Yeah! Protest with your employees! It will only make you more popular!  Throw a rock at him.    What?   Why?  Will you let me stay here please?  You have to say yes if I ask you.  I may not seem like I get it, but I get everything. Lucy and Kath? Made out one time in the bathroom at Rudy's.  I'm Rooney."
    },
    "imdb_rating": "6.8",
    "description": "Carl Allen is at a standstill. No future - until the day he enrolls into a personal development program based on a very simple idea: say yes to everything. Carl discovers with amazement the magical power of \"Yes\", and sees his professional and romantic life turned upside down overnight: an unexpected promotion and a new girlfriend. But he'll soon discover that better can be good's enemy, and that not all opportunities should be taken.—Happy_Evil_Dude",
    "name": "Yes Man",
    "genres": [
        "Comedy",
        "Romance"
    ],
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BZWQ4YzBiMzgtM2ZhZC00ZDQ5LWFiZjgtNmFlNzZlMTBkZTJhXkEyXkFqcGc@._V1_QL75_UY281_CR0,0,190,281_.jpg"
}