{
    "filename": "Youth-in-Revolt_script.txt",
    "imdb_id": "tt0403702",
    "imdb_url": "https://www.imdb.com/title/tt0403702",
    "characters": [
        "Bernice Lynch",
        "Matron",
        "Lefty",
        "Nick Twisp /Francois",
        "George Twisp",
        "Jerry",
        "Estelle Twisp",
        "Sheeni Saunders",
        "Paul Saunders",
        "Lacey",
        "Mr. Saunders",
        "Taggarty",
        "Vijay Joshi",
        "Lance Wescott",
        "Mr. Ferguson"
    ],
    "dialogues": {
        "Bernice": "Who are you?  That's OK. It was something I ate. So wait, are you Sheeni's boyfriend?  My name's Bernice. Bernice Lynch. Not that you asked.  Thanks. And Trent can go to hell for all I care. Sheeni too.  Personally, I hate her guts. Well, pardon me, Nick. I feel like throwing up some more now.  I did actually. I think he was on his way to Sheeni's room.",
        "Lynch": "",
        "Matron": "Q'est que c'est passer ici?!?",
        "Lefty": "I might have to kill myself.  My sister said she saw Millie Filbert holding hands with some college guy.  Well it's working. What am I gonna do, Nick? I'm obsessed. I think about Millie so much my balls ache.  So, I've been taping my pecker to my right leg at night.  Then I look at this issue of Better Homes and Gardens that has a girl that looks just like Millie until it gets good and hard. I think it's starting to straighten out.  Are you kidding? It would kill them to know that I even get hard-ons.  True. What if I shove it up the wrong hole?  What's with your mom, Nick? She gave me the third degree just to come up here.  Well, good thing I stole this from the bookstore then.  I was reading it all last night. Boy, having sex is a lot more complicated than I thought. Did you know you were supposed to stick your pinkie in her bumhole?  No way, man. Here, I got the page marked.  Are we really supposed to be that... uh... big?  Maybe we should compare.  You'll never believe who called me, Nick. Millie Filbert!  I dunno. She just called and asked if I wanted to hang out tonight. I didn't want to ask why. I need to find someplace for us to get it on.  Really?  Right on.  Dr. Browerly's office. My parents are making me see a shrink now.  You bet your left nut he is! He asked if I had any lustful thoughts toward my sister.  I told him about beating off once with her brassiere.  You don't know what it's like. I think they release chemicals in their office to make you tell the truth.  I wouldn't know. The bill goes to your house.  I guess so. It was your cyclops I was staring at.  That's true. Gee, maybe I am gay.  Oh, right. I forgot. That's a relief. So you'll leave the door open?  Thanks a pantsful, Nick.  Psst. Nick.  No. I did not get to blow my wad.  No. Worse.  Millie is a lesbian.  The only reason she wanted to hang out with me is because she heard that I showed you my slinky and thought I was gay too.  Well, I dunno what you're gonna do, but I'm giving suicide serious consideration this time.  Hey, that's not a bad idea. Thanks a pantsful, Nick.  Oh. Hey, Nick!  I live here. The guy's only charging me fifty in cash a month.  I did what you told me, Nick. I threw my backpack off the pier and reported my own suicide. I even left a note.  So where you headed?  Can I come?  It's weird, Nick, but school seems like a pretty fun place to hang out once you get rid of classes and homework.  I'm telling you, Nick: killing myself was the best thing that ever happened to me.  Sure. I'm Lefty and this is Nick.  Hey, that's you, Nick.  That must come in handy.  Heather sounds like a babe. You think if I grew a beard I'd pass for college age?  And then he'll probably fuck her in other ways. Did you know you're supposed to put your pinkie in a girl's bumhole, Vijay?  Sorry, Nick. What should we do?  You can tell your father you are staying at Nick's house for the weekend. And visa versa.  What is this music, Nick?  And I'm not gay.  Your roommate won't mind?  Well, see you guys in the morning.  I'm right here, Nick.  You can have one of ours, Nick. If you need one.  I did it three times! Two long ones and a quickie.  But we have no money!  Whoever she is, she sure gets around.  Ooooooh.  Aaaaaaah.  Congratulations, Vijay. That makes it official. Welcome to the club.  I guess this means they're not being expelled.  Nick?  Nick, haven't you heard? Vijay's been arrested.  For grand theft auto. They found his prints in your father's car.  No. He said you were his accomplice and now the Ukiah police are looking for you!  Nick? What are you doing here? Everyone and their mother's mother is looking for you.  Home. I'm done being dead, Nick. Heather and I are going back to Oakland for Christmas. You should have heard how glad my parents were that I didn't kill myself. They were even happier when they found out I'm not gay.  Yeah, being in love is pretty great. So what's your plan, Nick?",
        "George": "So what's this I hear about you being gay?  Yes, but my condition is only temporary. I can change it.  Nick, there are more important things in life than money.  I've got two words for you. Safe sex.  Sorry, Nick. In this car, faggots get the back seat.  My God. Look what you've done.     Go ahead and bring your stuff inside. Lacey and I need a nap. C'mon, Sugar Puss.        What the... What the hell?     We're calling that fruitcake display strike one. Two more strikes and it's back to Oakland.  Mrs. Crampton's our new housekeeper. I'm renting out the spare room to her seeing as her camper has been deemed unfit for human habitation.  He's bunking with you.  You working on strike two?        Lacey! Get in here!  Sticks and stones. It doesn't bother me if you sleep on the couch from now on.  That's strike two, jerkoff!  Look who's wearing the pants this morning.  Are you by any chance referring to me?  We'll see who's sucking on what soon.        Nick? Is that you?  Quit fooling around, Nick. This is your dad. Is everything okay there?  What the hell is that supposed to mean? Is Lacey there?  Paul! Who the hell is Paul?  Who's naked? Is Lacey naked?  You are in serious trouble. You've assaulted me and I know for a fact that you two were having naked orgies with my son. That child is only twelve years old.  Shut your pie hole!  When you get out of prison, you will both have to register as sex offenders. You will never be able to get a decent job again.  Not until you pay me the rest of the money you owe.  Not the extra charges.  Using bad language in front of a minor. The judge will hear about that too.     A POLICE OFFICER stands on the steps. Nick goes wide eyed at the sight of him and visibly slumps.              Hey. That's my car!",
        "Twisp": "",
        "Jerry": "It's a '62 Lincoln convertible. Like the one Kennedy was shot in.  See that. I was going to take you and your mom for a spin after breakfast. But now I guess it'll just be her and me. You have your smart mouth to thank for that.  The what?  Sold it to a sailor on the Alameda Naval Air Base. A man should never own a car for more than three months, Estelle. That way he always gets the thrill of owning a new automobile!  Nick, you little shit, get down here!  You tell them when I was coming back?  I think I'll go get the Lincoln washed.  Just tell him he bought the car with my standard guarantee. Thirty days or thirty feet. Whichever comes first. I'm in the right.  Get rid of them!  That's my life savings!  Please. Please don't hurt me. It's all I got, guys. I swear. Take the Lincoln!  Wow, those guys are even dumber than I thought. They actually think I'm stupid enough to let them muscle me into paying.  I'm not some tattle-tale like your son.  Can't. It's in The Code.  Code of the streets, Babe. Code of the streets.  Let's blow!  C'mon Estelle. It's real cute on the inside.  I say the kid does the dishes and we retire to the master bedroom.  Turn off the damn light!  You wanna beat your meat, go outside!  She's got a nice rack.  What's your cash price?  Thousand, huh? That must be with a guarantee.  I don't know. Those rusty propane tanks are a fire hazard. The roof probably needs work. I couldn't go above eight hundred.  Nine hundred.  Okay. Back to civilization!  You see that, Babe. They caved.  Boy, everything's complete. There's even water in the windshield washer.  Looks like they brought it in piece by piece and then reassembled it.  Or a navy, Babe. Or a navy.  Can someone do something about the mutt?  OK, Babe, I guess when I come back from my next haul I'll just have to take it apart piece by piece.  Hey, Nick. Want to learn how a car is put together?  See, Estelle, I told you the kid was queer-eeAAAAHHHHH!  Damn it! The dog!",
        "Estelle": "Jerry? Where did that car come from?  Jerry, I don't understand. What happened to the Chevy-Nova?           The door is opened to reveal two burly, tattooed SAILORS standing on the stoop.   Their eyes drift to Nick's mid-section. Nick follows their eyes to the belt buckle he neglected to fasten out of haste. He returns his gaze to the sailors as he wrangles the belt.     Nick, do you know anything about this?  What are you going to do, Jerry?  You're leaving? What happens when the sailor comes back for his nine- hundred dollars?        Don't hurt him! Nick, call 911!     Jerry, what are you talking about? We need to call the police!  Then for God's sake, Jerry, just sell the Lincoln and pay them!  What code? The vehicular code?  Then what are you planning to do?  Goodbye, everyone! We're going on vacation!  Jerry...? You said it was a cabin.  Nick, how   many men do you think there are   who'd be interested in a forty-one   year old woman with two brats, no   money, and stretch marks?  Nick, honey, meet Sheeni Saunders.  Sheeni needs to go to the grocery store. I've offered her your help in carrying her bags.  So what's this Sheeni girl like?  Jerry!  There are mouse droppings in all the closets, Jerry.  Nick, honey, say goodbye to Sheeni. It's time to hit the road.           How did they ever get it in here? My front door can't be more than three feet wide.  But it would take an army of mechanics to do all that!        Nick, your sister came all the way from LA for a weekend visit!     I don't know, Jerry. Can someone do something about the monstrosity dripping oil in my living room?  I think Joanie looks very nice. And she has a new boyfriend too.  Nick met a nice girl in Ukiah.  Collect calls? And just who do you expect to pay for that?  Nick, put the dog in the basement.  Nick, that was your father on the phone. He lost his job.  Watch your smart mouth. This means the end of child support.  You'll have to start going to... Oakland Public School.           Kids? This is Officer Lance Wescott. He has some bad news.  Will they be sending his belongings?  His... His wife?!?           She's sleeping in.  No, Lance! Nickie, go to your room.  Where do you think you're going?        What the in God's name has gotten into you?!? Jerry paid good money for that trailer!  Who the hell else would write such a thing?  And just how do you explain this?  And just who the hell is Lacey?  His girlfriend? What are you doing with a picture like this of your father's girlfriend?  When I want your opinion on raising my child, I'll ask for it.  You are confined to your room until school starts, you sick pervert.         You won't get away! I'm calling your parents! PERVERTS!  In my house! How dare you!  Nick, I just want you to know that I've thought about it, and I've accepted that you are gay.  That sounds more like a job for your father. Here, he wants to talk to you.  Lance and I are walking down to the movie theater. There's TV dinners in the freezer. Oh, and Nick - your father got a job in Ukiah.  Nick, that just wouldn't work. I depend on that child support money to eat.  Watch your smart mouth.        Nick! They have a description of the arsonist!  What am I going to do? My only son will be sent to prison!  Oh, Lance, can't something be done?  Oh, Lance! You're wonderful! How can I possibly repay you?  He can go make his father's life miserable!  You're going, buster!  You're son just burned down half of Berkeley! Come and get the little brat!  (cupping the squawking     Hello?  Where are you, Nick?     Wally was a friend of Jerry's. He came to help me in my time of mourning.  Lance is busy training to be a detective. He isn't around as much as he used to be.  Mr. Rumpkin is very smart. Ask him a question, Nick.  That's nothing. You should see what he did with the living room.     Go ahead, Wally. Show them.  Nick?  Nickie, I have some bad news!  I'm afraid Lance and Wally got into a terrible row. He tried to arrest Wally and Wally broke Lance's jaw.  The Berkeley police know you started the fire. Lance told them where you are.  Nick, they're coming to arrest you!",
        "Sheeni": "Your robe is open.  Hel-lo, Excitable Boy.  No. Much to the consternation of my fanatical parents I have converted to atheism. Fortunately my brother, Paul, paved the way for such transgressions.  Buddhist, I believe, though we have not seen him in some time. I myself am looking forward to being free of parental bondage.  Well, your mother seems very nice, though your father I think might be rather dim.  Yes, even though I am no longer a believer I always found the services wonderfully aerobic.  Nick, are you going to turn out like all the other young men and have nothing on your mind except carnal pleasures?  Really? I think about it all the time. It's the hormones at work, you know.  Yes. Father bought it so that he could look down upon the world. For him, Christian humility has always been a struggle.  Well, it was nice to meet you, Nick.  What a thoughtful invitation. I'd love to, Nick. Wait for me in the living room.  Back in a moment.  Oh, Father, do shut up.  Let's go, Nick. Bye, Father.  Would you mind applying this to my exposed areas?  My, you get turned on easily.  Oh, don't stop, Nick. We all have our hormones to deal with. Girls are fortunate in that it doesn't show. For all the world knows, my vagina could be moist with desire as we speak.  That's none of your business, I'm sure. Shall you do my front too?  I hope you don't find it too stimulating, Nick.  Uh, Nick. Maybe you better do the top now.  Thanks, Nick.  Breathless is one of my favorite films, though it might be eclipsed by Rebel Without a Cause. I often wonder what American cinema would be like today had Dean done more than three.  Oh, Nick. You seem very nice. But in fairness, I should tell you that I have a boyfriend.  Trent Preston.  Seventeen years of age, six-two, fluent in French, plays the piano, a champion swimmer, and writes Futurist Percussive poetry.  I could recite one of Trent's if you'd like.  RamDam 12/ Sizzle mop/ Crunch down/ Safety net/ Hot! Hot! Hot!/ Void.  Nick? God what time is it?    Nick, where are your hiking boots, water bottle, provisions, survey maps and compass?  Okay, but I have no plans to baby any slackers.  Yes. Not to be morbid, but this sight has been the chosen means of at least three teen suicides.  Well, there is a road. But I agree. Adolescents have a tendency toward the over-dramatic.  Don't get so upset Nick. Though your handwriting is egregious, you have a fairly decent vocabulary. Although, Trent is not an \"affected twit.\"  Nick?  The lengths you say you are willing to go to to win my heart, the contemplation of suicide at the thought of not having me... It all evokes a strong emotional warmth in my breast.  Did you mean it, Nickie?  You can read it if you'd like.  A necessity for a child in a household with prying Christian parents.  Wouldn't you like to know. That last passage would be of particular interest to you.  Never!    You're still a virgin, I can tell. Maybe that's why I like you.  Kiss me, you wienie.  Okay, lover. Break's over. Let's go!  Get up early tomorrow and you can shower with me in the ladies room. Five minutes to six. If you dare.  Get out quick!  No. I managed to convince Mother you were retarded and couldn't read the sign.  I'm sorry. But, Nick, women are always discreetly late. It's expected of us.  Don't complain. At least you got to shower with a naked woman. What are your plans today?  I should like to come with you, Nick. The more time we spend together the better. I fear when you leave we might never see each other again.  Look, Nick!    Oh, thank you, Nickie!  I'm going to name him Albert.    Well, your hormones certainly do. And oddly enough, my hormones like you too.  I hope that's true, but.. It's not that. It's...  It's my parents. They're... I fear they will never allow me to keep Albert.     At least you could consider it, honey. For me. I've never asked you for anything before.  That's asking a lot. Trent worships the ground I walk on.  OK, Nick, I guess I don't have any choice. I'll break up with Trent. But if he kills himself it's on your conscience.  Well, good, that's settled.  What?  Do you have a condom?  It has to be in a safe place. A nice comfortable bed. With no threat of interruptions. And for relaxation and mood setting some good red wine, preferably French. I want a new condom. Not one that's been riding around in your wallet for years. Consumers rated them a while back. I suggest you get their top-rated brand. This may take some research in the library. I'd appreciate a photocopy of the article. Plus, for supplementary protection, I want a name brand spermicide.      Nick?  I'm well, Nickie.  Of course, he was disconsolate, but we talked all day and he's come to see this as an opportunity for growth. Oh, and Nick, Trent wanted me to tell you that he bears you no ill will.  His parents are sending him to a French speaking boarding school this year. He's sure to get along there. So how is my darling Albert?  And you, Nickie? How are you?  How unfortunate. What did he do?  Really? Nick, I suggest we look at your father's firing as a blessing in disguise.  I propose we get your father a job here in Ukiah and you can come and live with him.  Oh, Nickie. Now, I happen to know Progressive Plywood is looking for an assistant editor. It would be perfect for your father.  The owner is the father of a friend of mine.  Okay, it's Trent's father. So what?  I told you, darling. Trent harbors you no ill will. I will have him call your father up pretending to be a head hunter.  You must influence her to send you away. I feel this will require being in a constant state of open revolt on your part.  I propose you rent the film Rebel Without a Cause as soon as possible. You must emulate James Dean...  ...You must be bad, Nickie. Be very, very bad.  Nick! Oh, Nick!  I had to sneak away just to see you.  That was you? Nick, are you out of your mind?  Nick, Trent betrayed us.  Who's François?  I don't know, Nick. I do love you, but I don't want to spend the rest of our lives on the run.  I... I can't, Nick.  I know, Nick, and I've been longing for you so. But we'll just have to find another way. The car is already packed.  Nick Twisp, I will not allow you to accept defeat so easily!  When the time is right, you must make your way to Santa Cruz. And then we will make love.  Did you bring the consumer reports?  Then it will have to be Santa Cruz. I really must go now, darling.  I love you too. Squeeze darling Albert for me.     ...I am writing you from my room in Santa Cruz. Surprisingly, boarding school has proven to be a welcome liberation as well as...  ...a stimulating experience which I am now not so quick to change.  Perhaps you should consider learning French and enrolling. That said...  ...English cannot be spoken on campus even if you are hemorrhaging from an accidental limb amputation.  I have made friends with the head of the girls' basketball team. Her name is Heather, and despite her popularity, she is saving herself for college boys.     I have an interesting roommate from New York named Taggarty...  She has already slept with seventeen boys and hopes to rack up fifty before leaving here.  Trent has taken up windsurfing and has been designated target number one by all the girls. I am still very angry at him for the betrayal but he claims he wants to mend our friendship.  I guess we shall see.  Nickie?  Nick, I knew you'd come!  ...but you must wait in the car until we can sneak you in.     Pardon me, everyone.     Don't be silly, darling. Not with others in the room. We must wait until everyone falls asleep.  Yes, Nick?  No.  It was Trent.  Yes. He came to discuss our friendship. I told him now was not the time.  I assume he went back to the boys' dorm. Now really, Nickie, you are keeping everyone awake with your inquiries.     Yes, darling.  Yes, Nick.  But I sent him away again.  Because I want you, darling. Not even Trent can match the industriousness and tenacity with which you have pursued me.     Nick?  Not so well. I have been afflicted with some kind of chronic fatigue.  I'm not home sick, Nick. In fact, I'm not very happy with you.  You know damn well, Nick. You've been spreading rumors about Trent. And he doesn't deserve it.  Well, whatever you said to Ed Solomon, it was enough to get him to give Trent a black eye.  Cock-blocked? We'll have to resume this another time, Nick. It's been an emotionally exhausting weekend. My parents are in an uproar over Paul. He's moved some floozie in with him up in the studio over the garage.  Lacey? You know her?  Nick. Don't be gross.  Tomorrow?  Don't even think it, Nick. You know my parents don't approve of you.  Nick, you must dismiss this Thanksgiving notion from your mind. I remain firm on this issue. Goodbye.     I do not intend to be party to my brother's absurdities. He has allowed you in and drugged my parents.  What are you doing here, Nick? I expressly asked you not to come.  You were raped by a walrus?  Sex, Nick. Why don't you just say it? That's what you want. You want me to have sex with you.  How is my dog?  I hate you, Nickie!  Not long enough, Paul.  Trent, darling, this is Nick.  What is it?  The poor girl.  Nick! You could have killed me!  You are completely contemptible, Nick Twisp. I never wish to see you again.     Excuse me. Are you a friend of Nick's?  You shouldn't be, Carlotta. I am no doubt culpable for Nick's actions.  Yes, Carlotta. Nick had wonderful a way of making me feel worthy of the pursuit.  Would you like to stay the night, Carlotta? We can reminisce of our departed.  It's just... I don't think I could bear to be alone tonight.     Do you like it? I bought it in Santa Rosa last fall. I had hoped to wear it for Nick.  I like lying here with you, Carlotta.  I can't think of anyone I'd rather lie here with.  Except maybe Nick. If Nick were here, what do you suppose he would do to me?  Then why don't you?  Take off that silly wig and make love to me!  Of course, Nick. Did you really expect to fool your soul mate with such a disguise?  Take me darling!     My parents are at services. They won't be back for hours.  What a lovely notion, darling. You go ahead downstairs and get things started.  Calling Taggarty to report that you are not completely incompetent in the bedroom.  Not a chance, Mr. Twisp. Such things are reserved for girl talk only. And for good reason.  Well, I called them of course.  But, Nickie, it had to be done.  I can't very well marry a wanted man, honey. Look at it this way, in a few months you'll be a free man and we can be together in Paris.  Write often, Nickie.  And don't worry about Albert. He'll be waiting for you too.",
        "Saunders": "It's your neighbor, Mrs. Saunders. Church services begin at seven fifteen prompt. Donuts will be served.        I understand you have invited my daughter to the beach.  Aha! Then I trust, sir, you are aware that in doing so you have entered into an oral contract to perform in loco parentis, i.e. to provide for the safety and well- being of aforementioned minor female.  Vaya con Dios!                She most certainly is not. As a matter of fact, we've banned you from her life, Nick Twisp.  Trent Preston informed us that not only were you moving here to pursue my daughter, but that you're not even mentally-handicapped, and thus molested my wife in the shower of sound mind and body.  You watch your language. This is a Christian home. We're sending Sheeni to Les École des Arts and Literatures in Santa Cruz.  Then I guess it's a good thing Trent is going there too. She'll have someone to console her.           You are very, very tall.  I can feel the floor pushing against me. Can you feel it too, tall youth?     Paul? Your father looks rather strange.  That's no excuse.  Siiiilent night, Hooooly night/ Aaaall in calm, aaall is bright...  Who died?",
        "Paul": "Hey, Nick. I'm Paul, Sheeni's brother.  We've met.  In a previous life.  Nice fire in Berkeley.  She didn't have to.  No. But Sheeni was.  Men. Men and boys.  We saved you some mushrooms, Nick.  Okay, George, just calm down.  That boy is an underaged minor. I'm going to have you arrested and charged with child molesting.  I've never had a decent job. I don't think I'd want one.  Hello, Nick. Right on time. Come in.  No he's not, Dad. He just appears tall because you are on the floor.  Yes, it's a recipe I picked up in the Southwest. Stuffed mushrooms.  Well, mother, he is sitting in his own bowel movement.  Thank you. Sister, darling, how long has it been since we all observed the rituals of Thanksgiving?     Welcome back, Nick. We had a feeling you were coming.",
        "Lacey": "Hiya, Nick!     Is..? Is that my bra?  This came for you, Nick.  In the bedroom. I wouldn't bother him, Nick. He's in a foul mood. He's on with the police. Apparently someone broke in and stole his Beamer.  It's not my fault, you tight-assed, critical, nonfeeling, sexist drunk.  Does it bother you that you're a selfish, uptight, boring lover?  Hello? Thank you.  They found your car in Davenport, George. Go pick it up.  Nick, I feel for you. It must be tough being a teenager in this house.  Your mom has had a difficult time. She has had a great deal to put up with. I'm starting to appreciate that now.  If the shoe fits, suck on it.     Nick? Get the phone?  He is on the wrong path. I have felt that for some time.  Don't be an idiot, George. No one was naked.  Let's go, Paul. George, I'll pick up the rest of my things tomorrow.  I paid you all your money!  Fuck-your-stinking-extra-charges.  What interesting flowers, Nick. Who are they for?  Mr. and Mrs. Saunders, you remember Nick Twisp, don't you?  Paul served an appetizer earlier.  Dear Lord...  Dear Lord, thank you for this bounty. Help us to be tolerant of others - especially the boyfriends and girlfriends of our immediate relations. Amen.",
        "Taggarty": "Oh. So you're Nick.  a series of mug shots of sullen-looking TEENAGE BOYS. Most of them have been given a grade of C- or below.    Bonjour.  Hey, Nick. I suppose you want to talk to Sheeni.  It's your would-be-lover.  The food is delicious, Paul.  Oh, Trent, you made it.  Have a seat, Trent.  Nick, you didn't!",
        "Vijay": "May I sit at your table?  I am Vijay Joshi.  I see you both have been rejected by the socially elite of our school. Ukiah is a cultural wasteland compared to India. Though some of the girls are very attractive.  Not at the moment. But I am optimistic. How about you?  You don't mean Sheeni Saunders. I heard she was interested in some brilliant fellow in the Bay Area.  I'm surprised. You are not at all what I imagined.  So how is Sheeni?  Shall I translate it for you?  I speak French, English, Hindi, Marathi, and Urdu.  Dear, Nick...     Oh yes... Love to you and Albert. Who's Albert?  I don't know, but this Taggarty girl sounds very uninhibited. I wonder if she's made it with a Hindu yet.  But what will we tell our parents?  But what if we are caught?  You want culture? I will give you culture.  A distinguished group I would be happy to join.  I am in a state of sexual frenzy. What is your plan?  What if they don't go for it?  It was difficult to tell with that condom, Nick. Why did you buy such thick ones?  Well, she's safe. No organism could penetrate those walls.  They will likely notify their parents. Perhaps even expel them.  What will we do?  I have no shoes! I'll catch pneumonia and die a indeterminate proto-quasi-virgin!  Ooooooh.  Aaaaaaah.  I spoke with Taggarty this morning. She requested a wallet sized photo.  A C+. Which I feel is perfectly satisfactory given the conditions.  No, apparently they convinced the matron it was all quite innocent.  No need to be jealous, Nick.",
        "Joshi": "",
        "Lance": "Your mother's friend Jerry had a heart attack in a bar in Dallas. He's dead.  Uh... I'm afraid they've already been sent. To his wife.  There, there, Ma'am. It's going to be okay.  Kid, you are asking for trouble.  You little shit. You stole your mother's dead ex-boyfriend's trailer and set a five million dollar fire.  A white teenage male, about five- seven. A hundred and twenty five pounds, dark hair, spotted complexion...  He was also wearing a tee shirt with the words: I'm single, let's mingle.  Tell you what, Estelle. I'll make out that Nick reported the car and trailer stolen before the fire. It'll be less suspicious. But I could take some serious heat for this.  I'll think of something, Estelle.  Now the kid better not be here when the detectives start coming around. I'd send him away for a while. A long while.  Wait a minute, Estelle, aren't you going to punish him? I'd say he deserves a good hiding.     Yeah.  Nick, ya little prick, where are ya?  No matter, they'll get you eventually.",
        "Wescott": "",
        "Ferguson": ""
    },
    "imdb_rating": "6.4",
    "imdb_image_url": "https://m.media-amazon.com/images/M/MV5BMjE3NTkxODUwOV5BMl5BanBnXkFtZTcwMjE4NjI5Mg@@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "description": "At 16, Nick Twisp is wry about his teen funk: he lives in Oakland with his sex-addled mother; his father's child support is her meal ticket. While camping in Ukiah, Nick meets Sheeni: for him, it's love at first sight. Nick has to figure out how to get his father a job in Ukiah, then how to get sent to live with his father, then how to get close to Sheeni, whose religious parents may want her sent away from temptation to a boarding school. There's also Sheeni's all-American boyfriend to contend with. Overwhelmed by the challenges, Nick's about to give up when he conjures an alter ego who whispers revolt into his ear. Nick is not altogether hapless, but can this end well?—<jhailey@hotmail.com>",
    "name": "Youth in Revolt",
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ]
}