{
    "id": "tt0162222",
    "name": "Cast Away",
    "description": "Memphis-based FedEx operations executive Chuck Noland and grad student Kelly Frears have long dated and lived together, and despite each being the love of the other's life, have not gotten married because of their respective busy schedules, especially Chuck's as he is more often on business trips than he is at home. That marital status changes when on Christmas Day 1995 as Chuck is rushing off to catch yet another FedEx plane for a business trip, he gives Kelly a ring. That flight experiences technical difficulties, and goes down somewhere in the south Pacific. In a life raft, a relatively unharmed Chuck washes up on shore what he will learn is a deserted island, he unaware what has happened to any of his fellow flight mates, or the plane. However several of the packages on board for delivery do wash up on shore with him, those packages which he initially treats with respect. Chuck realizes that his priority is survival - which primarily means food, water, shelter and fire - and rescue. But survival is also in an emotional sense. To fulfill that emotional need, he has an heirloom pocket watch with Kelly's photo that she gave him as a Christmas present, and eventually opening the FedEx packages, a Wilson volleyball on which he paints a face and which he names Wilson. As time progresses, Chuck goes through a range of emotions, but if rescue is ever in the cards, he realizes that he has to find a way to get off the island, which is seemingly impossible in his circumstance due to the strong on shore surf he cannot get beyond without assistance. What Chuck may not fully realize is the longer he is not rescued, the harder it will be for him to return to his old life in its entirety if he ever is rescued. Although the thought of Kelly is what largely keeps him motivated to be rescued, Kelly, who probably believes him to be dead, may have moved on emotionally from him in the intervening time.—Huggo",
    "genre": "Adventure, Drama, Romance",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BN2Y5ZTU4YjctMDRmMC00MTg4LWE1M2MtMjk4MzVmOTE4YjkzXkEyXkFqcGdeQXVyNTc1NTQxODI@._V1_QL75_UX380_CR0,0,380,562_.jpg",
    "rate": "7.8"
}