{
    "id": "tt0120684",
    "name": "Gods and Monsters",
    "description": "1957. Long having retired,James Whale, arguably most famous for directingFrankenstayn (1931)andFrankenstayn'ın nişanlısı (1935)among some other 1930s horror classics, has burned his bridges with the Hollywood community in that they have abandoned him, the possible exception being his continuing friendship with former loverDavid Lewis. James had been openly gay even during his working period and is in declining health. Having been recently released from a hospital where he was recuperating from a stroke, he left with some permanent health issues, the aftermath of the stroke. Much against the disapproval of his loyal longtime housekeeper Hanna, his health does not prevent him from toying with the handsome young men who may wander into his midst in his continuing homosexual desires, although Hanna is as much, if not more concerned about any of those young men taking advantage of him in his elderly and fragile state. The young man who catches his eye among the most recent is Clayton Boone, who Hanna had hired to do garden work around the property. Clay, an ex-marine from the proverbial \"wrong side of the tracks\", has no idea who James was or is before he starts this job. James and Clay soon begin a friendship of sorts. Clay is also unaware of James' homosexual orientation before such is confirmed by Hanna, an issue which threatens his masculinity, especially in light of the cracks showing in his casual sexual relationship with a slightly older and wiser diner waitress named Betty. Clay has to reconcile that threat against being in the company of someone whom he considers an interesting and once famous man. The friendship and his state of health related to the stroke lead James to reflect in a bittersweet vein on key points of his life, most notably serving in WWI, and as a result reveals his ulterior motives through the actions he takes toward Clay.—Huggo",
    "genre": "Biography, Drama",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BZDczYmY3Y2UtZGQxZi00Zjg1LTk3N2QtMjk4ZGVmYWYwMWQxXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_QL75_UY281_CR7,0,190,281_.jpg",
    "rate": "7.3"
}