{
    "id": "tt0077936",
    "name": "Les Miserables",
    "description": "In late eighteenth century France, in the middle of the French Revolution, the unemployed woodman Jean Valjean (Richard Jordan) is arrested for stealing bread to feed his family and sentenced to five years in prison in Toulon. He tries to escape from prison due to the mistreatment from cruel Javert (Anthony Perkins), increasing his sentence. Nineteen years later, he is released, but forced to carry identification that labels him a thief, making him unwelcome at inns and many other places, but is helped by the kind Bishop Myriel (Claude Dauphin) who feeds and shelters him. However, he steals his silverware at dawn, but he is arrested by two Policemen and brought back to the Bishop. The Bishop tells them that the silver objects were a gift, and gives two additional candlesticks to Valjean. When the Policemen leave the place, the Bishop tells Valjean that he has bought his soul, and now he should live an honest life. Jean Valjean becomes a well-succeeded businessman with the alias Madeleine, bringing prosperity to a small town by producing black beads that he had learned to make in prison, and then becomes the town's Mayor. His life changes when Javert is assigned the Chief of Police of his town. Javert arrests the beggar Fantine (Angela Pleasence) accused of prostitution, but Madeleine asks him to release her and brings her home. He learns that she sends money to a couple to raise her daughter Cosette (Caroline Langrishe). Meanwhile, Javert travels to Paris to denounce Madeleine, but he learns that Jean Valjean is arrested. But Madeleine confesses the truth to the court and releases the man. Now Javert will take him back to Toulon. What will Jean Valjean do?—Claudio Carvalho, Rio de Janeiro, Brazil",
    "genre": "Drama, History",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BNjFhNDI4YmUtOWI3OC00YjI1LTlkZjUtOTMwNjU3YWY5MDg0XkEyXkFqcGdeQXVyMTA0MTM5NjI2._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "rate": "7.3"
}