{
    "id": "tt0409459",
    "name": "Watchmen",
    "description": "It's 1985 in an alternate reality. The Watchmen - comprised of the Comedian, Dr. Manhattan, Nite Owl II, Ozymandias, Rorschach and Silk Spectre II - are a disparate band of masked superheroes, modeled after the Minutemen, who were masked superheroes of a generation earlier, most of who are dead or afflicted by the ravages of life. The Comedian belongs to both groups. Despite the activities of the Watchmen leading to the west winning the Vietnam War which in turn has keptRichard Nixonin the White House, Nixon has now outlawed masks, resulting in the Watchmen disbanding and going into retirement, most hiding their Watchmen past under their human identities. However, the Comedian, in his human persona of Eddie Blake, and Dr. Manhattan - former physicist Jon Osterman who obtained his superhero powers through a scientific accident which almost killed him - now work for the government. Dr. Manhattan's powers in particular have kept a watch over nuclear proliferation, as he is able to stop any nuclear attack. Regardless, the Cold War is at its height with recent Soviet posturing regarding nuclear bomb buildup. In her human persona of Laurie Jupiter, Silk Spectre II is Dr. Manhattan's assistant and lover, as much as they can be in Dr. Manhattan's now non-human state. Meanwhile, Ozymandias has come out to the world as wealthy genius Adrian Veidt, capitalizing on his Ozymandias identity to better the world, and Rorschach continues to work as a vigilante, although one wanted by the law despite he the reason that many criminals are behind bars. When Blake is murdered, Rorschach, as the only one still on the streets, believes the murderer is out to kill all the Watchmen, despite any number of people wanting to kill the Comedian for being a misogynist. Evidence points to it perhaps having something to do with an imminent attempt of nuclear annihilation. Rorschach has to convince his colleagues, who he has not seen since their superhero days, of the validity of his theory for them to come out of retirement, which is no easy task. If they do, which will require them to overcome external forces which seem to be conspiring against them, they will have to discover both who killed the Comedian and why before they befall the same fate as him and/or before the mastermind is able to exact his larger grand plan.—Huggo",
    "genre": "Action, Drama, Mystery",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BY2IzNGNiODgtOWYzOS00OTI0LTgxZTUtOTA5OTQ5YmI3NGUzXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_QL75_UX380_CR0,4,380,562_.jpg",
    "rate": "7.6"
}