{
    "id": "tt0120890",
    "name": "Wild Things",
    "description": "Having recently been named educator of the year, Sam Lombardo is the well-liked guidance counselor and sailing instructor at Blue Bay High School on the Florida coast just outside Miami. The student body of the school is largely comprised of the offspring of the country club set, and while he helps any student he can, he especially tries to mentor those who are disadvantaged, such as Jimmy Leach who would not have been able to afford being in the sailing program otherwise, and tough Suzie Toller, a proverbial swamp girl who he's helped through a few scrapes with the law in the absence of any parents, Suzie living with her streetwise grandmother Ruby at an alligator sideshow zoo. Although not socioeconomically part of that country club set himself, he nonetheless has ingratiated himself within it, he having slept with a good number of the country club maidens, he currently settled into a relationship with Barbara Baxter, the well-off daughter of high powered lawyer Tom Baxter. Sam's world comes crashing down around him when student Kelly Van Ryan, who has made it quite clear to her classmates she is sexually attracted to him and who is the daughter of one of his former bed mates, sexually provocative widow and socially powerful Sandra Van Ryan, accuses him of raping her. Already in trouble in that no one can fight and win against the Van Ryans in Blue Bay, Sam, whose career is ruined regardless of his guilt or innocence in never being able to recover from such accusations, gets into even more problems when Suzie quickly thereafter comes forward also accusing him of previously raping her, her story similar to Kelly's. The likelihood of Kelly and Suzie colluding together to manufacture similar stories is remote as it is well known that they have always detested each other. Having now become persona non grata among that country club set, Sam is forced to hire sleazy storefront lawyer Ken Bowden to defend him. Blue Bay Police Detective Ray Duquette of the Sex Crimes Division, he investigating with his partner Gloria Perez, goes against her advice and that of DA Bryce Hunter by delving into sensitive areas in believing that not all associated with the case are as they appear on the surface.—Huggo",
    "genre": "Crime, Drama, Mystery",
    "imageUrl": "https://m.media-amazon.com/images/M/MV5BODMyYTlkNWYtODAzMC00ZjFiLWE3YjctMGUyMzM1MDk3ZDFlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_QL75_UY281_CR0,0,190,281_.jpg",
    "rate": "6.6"
}